{"text":"Overpriced hot pot. Unsanitary conditions: plates were dirty, washrooms were dirty (no toilet paper or paper towels) like no one had cleaned then for days. Poor service and very slow service. Would not come back."}
{"text":"Other reviews says it feels like eating in China, I guess it resembles that sort of experience because the service was HORRIBLE. The hostess is extremely rude and pushy. It was our first time to the restaurant and the hostess wouldn't give us our table because the fifth person was late to show up to the restaurant. We explained nicely that the fifth party will be really late due to traffic and if we could sit down first. We had to literally fight with the hostess to even sit. She was saying rude things in Chinese to her manager about us and finally the manager allowed us to have our table. The table they make you book for five people can only sit four realistically. Can't believe the hostess was even trying to make us call our friend. She would never get a job at a non-Asian restaurant with the horrible attitude. The hotpot base was mediocre at best and waiters were so slow to bring you the items. Will never go back since food wasn't great and service was definitely lacking. You are better off going to Emperor hotpot or doing it at home. Don't open a restaurant if you don't even understand the concept of customer service."}
{"text":"First time returning since 2013 and the place has greatly improved since. Unfortunately so has the cost. It's about $25 a person then another $10ish for the broth which is pretty expensive compared to other hotpot spots.  The upside is their spicy broth is amazing.  The food was delicious and has lots of variety.  The only thing that bothered me was how the vegetables seemed not fresh even almost dehydrated."}
{"text":"It's always dirty here, even before they changed their name from 100 degrees hot pot to this foreign China hot pot restaurant. Beware they do not rinse any of the veggies served especially mushrooms."}
{"text":"This used to be my go-to hotpot place. The house spicy soup base is so good that you don't really any additional dipping sauce but can just simply enjoy the taste from the authentic Chongqing hotpot. There is also a vast variety of food selections and snacks and they always come fresh. I would give it a 5 however my today's visit was somehow dissatisfying so I decided to give a 3. 

My buddy and I went there 4:30pm for early dinner. We ordered the house spicy soup base as usual. But this time it tasted very different. It used to be very flavorful  but this time it tasted simply spicy - no other flavors. For the first time I had to go get some dipping sauce for my food. 

The food was not up to quality today neither for some reason. The lamb served to us was almost 90% pure fat. We tried to eat it but unfortunately it's just too fatty for us. We ordered Fermented Rice ball in Rice Wine which tasted like water and my buddy had no rice balls in his serve. (I had many so can't complaint lol)

We also ordered Black Pepper and Onion Pancake. The pancake is usually freshly fried when customers place the order so it tastes really good. However this time it came in cold and saggy- looks like leftovers from lunch and they didn't even bother to microwave it before serving. Nonetheless we ordered the pancake again in the second round hoping they can make some from scratch. Unfortunately it never came. We asked several times and every time we got the same response - it's freshly made so it's gonna take sometime and will be ready in 10mins. We even waited for another 30mins after we paid the bill. Eventually it was just too late and we decided to give up and left dissatisfied. 

I know it's really difficult for a restaurant to maintain its quality. However if a restaurant can have consistent quality it will have return customers and will have booming business. Perhaps I will not go back to Liuyishou again for hotpot - or at least much less frequent than before."}
{"text":"I came here awhile ago but it's still my favourite hot pot place so far.  I love the selection of food, quality and sauce bar.  However, if only they could speak English/Cantonese or not skip over our table when they know that we don't speak mandarin, that would help.  

Food: 
Great broth selection.  They all come at a different price but it's broth quality is good.  Although I didn't have the spicy broths, my friends who did were very impressed with it.  

Food selection and quality is above average.  Food quality is fresh and they have some unique items that other hot pot places usually don't have.  My favourite were the pork neck, hong kong style sausage, dumplings and kelp.  

The sauce bar has around 13 different types of  sauce for you to mix and match to your desire.  It would be nice if they had some pointers for some suggested combos for people who didn't know much about the sauces.  

Atmosphere/Service:
It was a bit hard to get someone to come serve us.  Although seating is comfortable with tables being spaced apart decently."}
{"text":"Came on a Friday evening and it was quite busy.  

The prices are above average at $28/person and you had to pay at least $8 extra for soup base.  It's not on the menu, but you can ask for just hot water and make your own soup base from the large selection of dipping sauces.

For the Corn and Pork Rib soup base I ordered, it was just a few pieces of pork and corn.  Was not worth the price. 

The food came out quickly and the quality was actually good.  For some reason the only chicken dish they have on the menu was chicken feet.  No drunken chicken unfortunately.  

The servers I had all were able to speak both canto, mando, and English. It was actually pretty decent service for a Chinese restaurant.

Ordering is done through a tablet controlled by the servers, and only a few dishes were missed.  

Overall I enjoyed it more than I expected walking in.  It's a bit different from the traditional canto hotpot restaurants, but the prices are higher than what I was used to."}
{"text":"This was my second time trying hot pot and I was really excited. This place was a little disappointing, the atmosphere leaves much to be desired and I felt  that it could have been cleaner too. 

We had to wait about 35 minutes before being seated, however they do offer perks for wait times starting at 30 mins and up - we ended up getting a free dessert, which tasted okay. It's also important to note that they will text you in Cantonese/mandarin when it's your turn. If you don't speak either of these languages, it is a little inconvenient. 

The food was alright, there were a few tendons in our sliced beef which was unusual and the medium spicy broth was far too spicy. Unfortunately, I don't think I will be back at this joint."}
{"text":"Great tasting hot pot. I like that there's actually some space to walk around unlike some other hot pot places that just stack you closely as possible. The quality is the same as more expensive places in Markham."}
{"text":"Pretty good soup base and lots of varieties for AYCE hot pot. The spicy broth is No joke. 
They have a separate buffet counter for some cold appetizers, dipping sauces and (canned) fruits.
Beware of your vegetables! We sent back couples of time because we could clearly see the dirt on our veggies. 
The waitress was very nice and helpful during our visit."}
{"text":"First the good, I loved the sauce options. There were so many to choose from! What would have been helpful is to provide recos on which ones to mix. They also didn't have the egg that you break into the sauce mix.  I did the usual...sesame oil, sesame paste, green onion, cilantro, chilioil, chilipaste, mushroom paste and sesame seeds. 

I like the 3 broth pot option for $12.95. We got tomato, pork bone and corn and lastly the spicy broth option. They have a pretty decent option of meat and veggies.

Now for the bad...unfortunately I got very sick after. And service seemed a bit challenging..we didn't get water until about halfway through our meal and it's a bit of a struggle to flag the staff down

Overall a 3.5!"}
{"text":"The food are good. However the service are not horrible but it is slow and they need hire more help. They don't have free refill for drink. And the price are little pricier then other Chinese hotpot places"}
{"text":"Recalling my 2 past visits here from a while back..

Good variety and quality food here, but no free soup base keeps me from coming back (I'm the kind of hot pot person who don't care for any of the premium soup). The time we came was quite busy, and when we first arrived, we kept seeing the servers bring other tables their pot while we waited for what seemed like eternity (yeah we were hungry).

There's an good selection of sauces, but I personally don't care for communal sauce counters (for hygiene reasons), but it's not a big deal. At times they could be slow at replenishing the sauces.

I was leaning towards 3 stars, but I thought this restaurant is technically a bit better than most others, so I'll give it 4 stars (I wish yelp had a 0-10 rating instead).

Quality: 8/10. Services: 6/10. Value: 6/10. Overall: 7/10 (Not an average)."}
{"text":"Call me (or my parents) crazy but we waited almost 1.5 hours for this place on mid-autumn festival. We were told it would only be 45 mins, but 45 mins later, we had waited so long we felt like it'd be a waste if we just left. This place has a very young, Chinese, clientele. It almost felt like I was transported back to China! 

General consensus seems to be this place is expensive. On a weeknight, it was $25ish per person and you do pay extra for the soup base ($8-12) and desserts. I didn't think it was that bad given how much you get to choose from. There are 28 types of sauces and 8 (I think?) types of soup base. You can even have 3 types of soup base in one pot (most places only have 2). They are famous in China for the spicy Chongqing base, so you have to at least try that one! 

I think their meat quality is better than other hot pot places I've been to. The pieces are sliced REALLY thin, which is perfect for hot pot. Their speciality is definitely the fresh fish and cuttlefish balls. They are made in house and come in a little dish. You get to scoop, shape and cook them. 

The place was a gongshow that day because of how busy it was. Some of the servers looked new and kind of flustered by how crazy everything was. One of the guys who was our server was actually really nice and funny. He got along great with my parents and was super happy despite everything that was going on. We had a couple good laughs and it definitely made the experience better. 

I don't think I'd come back if I had to wait this long again, but I would if I can come on a weekday and not have to wait. If you love spicy hotpot and haven't been to similar ones in China, you should try this place!"}
{"text":"I called ahead to make reservations for a table of three.  Right after making the call, the restaurant sent an automatic text message to me to confirm my booking.  Unfortunately, the text message is in Chinese so although I have a slight idea of what it says, I'm sure customers that do not read Chinese will not appreciate the foreign communication.

When we got here on the Thursday at 6:30 p.m., there were so many people waiting in the foyer.  When I alerted the host that our party had arrived, it did take a while for the tables to clear out and for us to get ours.  I was surprised at how many people there were already who had finished up the first round at 6:30 p.m.

We chose the split pot with the Tomato Soup Base in one side and Braised Silk Fowl Soup Base in the other.  We sent off our hot pot items request to the server who reported them down on an iPad-like device and almost immediately before we were even done ordering, the items already arrived at our table.  It was so fast!  We didn't even receive our hot pot yet either.

They had a self-serve condiments station that included chilled appetizers like semi-spicy cucumbers, bean curd slices, peanuts, condensed milk bread slices, and more too.

Overall, the meal was very good and I liked the soup bases.  Each one was true to its taste.  I liked the red meats, ox tongue (so smooth), the frog legs, the veggies.  A solid hot pot place!

An outstanding part of the night was their service.  The servers were always around and came by often to refill our hot pot with more soup without us having to ask.  Also, it is worth mentioning that at one point during the night, I sneezed just as the server was walking by.  He actually turned around and gave me some napkins.  That was so attentive of him!"}
{"text":"To be honest, paying 30+ dollars for a hot pot like this was definitely a WASTE. We got there at around 10 PM, the receptionist was good, gave us a sit, and everything was good on that point. But, to order the base of the soup and the food, we use 20 mins to catch the attention of the waiter. The service since than was TERRIBLE, no one was walking around to ask if needed anything when the table was empty, because customers need to order from the server and not an order shit. Even more terrible, servers ask the tables for any request that were near around us, except us who were sitting at the middle of the restaurant. By paying this price for a meal, this restaurant will lose a customer and I believe more coming."}
{"text":"Poor, inattentive unfriendly service. Staff also barely speaks English so you'll have to point to all the items you want on the menu. When we first arrived at the restaurant we waited 10 minutes to even be seated because there was no one at the front counter, they were chilling with their friends in the back relaxing. Also, they don't check up on you while you eat so if you're thirsty or want more food or need anything you'll have to either wait for a server to pass your table (which isn't often) and try to flag them down or get up and find a server. However the variety and food quality was very good ! Really expensive for what it is. $180 for two couples to eat. The sauce bar was also great it had basically anything you could possibly want to put in your hotpot sauce. Another downside to this place is that out of the entire full page of yummy looking $3 deserts (which was what originally made me lean towards trying here) they only have mango pudding.. I enjoyed eating here but I would probably explore my other options for next time."}
{"text":"We had dinner here for my MIL birthday on a Saturday night. We made reservations and got a table right away. They were busy with people waiting out the door. The service and our server Sunny  was fabulous. I have to say the quality of the meat was better than all the hot pot places we have been too. MUST try: fish and shrimp pasta, watermelon juice and beef tongue. We will definitely be back!"}
{"text":"My family 12 people just came here tonight for the first time, and we love it. This is definitely our favorite hot pot place. Good service, fresh food and they give you as much as you want."}
{"text":"Have been to this hot pot for many times already, price is a bit more than other AYCE hot pot place, but the quality makes up the difference.

Soup base varies from $7-$20 and the ones me and my friends tried are all flavorful, 2 hours limit during busy hours.

The food is mostly decent quality, we are surprised as after ordering few times of meat, they still give u good quality meat, unlike many places they start to give u lower grade meat after 2nd 3rd round of ordering, I would rate this part 5stars

Service wise, there are specific personals to take your order, and they key ur order in via iPad, and I don't recall except once they missed our ordered, while at other AYCE hot pot places, missing orders are quite common in my experience

Overall it's one of the places I would recommend to my friends as quality and service is pretty good"}
{"text":"Be careful. If you throw around the name of this restaurant carelessly, without its proper pronunciation, it may sound like you're racist. I know. I've been accused of being one when all I wanted was some hot pot. And I'm Chinese. Such is life. 

Anyway, Ching Chong Ling Long isn't bad, I guess. But man, this is one costly place to boil your own meat. You're paying $30 for just the basic hot pot stuff, not even counting premium ingredients. You've got another $10 for the soup base, double that if you want their special traditional ultra spicy soup base. AND you have to pay for drinks, which I was not happy to see at all. It's hot pot and food is salty as hell, give me my unlimited plum juice, damn it!

Food's fine. You get pretty much everything you get in a standard hot pot. The quality is decent and the soup bases taste alright. My friends got the super spicy expensive soup base and were very happy with it (it was also half priced on the Tuesday that we went). I did enjoy the sauce station in the middle of the restaurant. Lots and lots of options to mix into your ideal goop. 

Service is something else though, and not in the good way. Yeah, It's common for an AYCE place to miss an order, but when you miss the same order 5 TIMES, then someone needs to get their shit together. We only wanted an order of spam! Out of those 5 times we ordered, one involved someone going up to the counter and making a point that this was the 4th time we were ordering this same item. We tried both English and Chinese. It still didn't come. 

And this brings up my other issue, how can we order something 5x and not get it but we keep getting things that we didn't order?? How many orders of lettuce and mushrooms can we eat? COME ON.

But all of this doesn't matter because this place is crazy packed! It's brimming with second gen rich kids straight from the motherland where this is a well-known franchise. So I may understand the bad service because Asian establishments are just like that but at these prices, no thank you. Bet they're not charging CAD $50 a person in China!!

(5/100) - 2017"}
{"text":"Pros: 
good meet selection
Clean
Great sauce selection
Good location

Cons:
No beef tendon!
No ice cream
Weak desserts
No included soup base options
No homemade ice tea

Slow service but it's what you expect for ayce 
It's not bad but honestly I probably won't come back"}
{"text":"Came here twice, this place reminds me of the 1920's during the Great Depression, in the sense that I feel like I'm on food rations. \"All you can eat\" is a stretch. Quality soup base, so I've heard, I couldn't tell you because I wasn't actually able to eat anything cause the food never came. 

Morals village, here I come!"}
{"text":"This is one of my worst experience for hotspot. The service is terrible, food portions are small and the AC is extremely cold. My bad experience start with food ordering. The waitress didn't have patience to the customer. When we ask what drink do they have, she used her pen and pointed on the menu rudely. We forgot to order beef and lamb and she didn't remind us. Plus the drink takes a year to serve. For the AC, I ask them to turn it lower, because I felt chilly while wearing my jacket in the restaurant and it's June. They refuse to do so say they can't do it."}
{"text":"At first when we were waiting to be seated their service and receptionist was really kind and caring. The owner was also walking around the restaurant to see that everything went smoothly. We waited around 30 minutes to be seated and this was around 8pm.

After being seated...everything started to go downhill, especially the service. All the waiters/waitresses are super inattentive and wasted 20 minutes just trying to get their attention and order Thank goodness that the food came quickly though!

They have a wide selection of sauces to mix and match together which I enjoyed. There are also freshly cut fruit. The watermelon tastes soooo good!

Honestly, the food quality didn't seem top notch to be at this price. I always say you cannot go wrong with hot pot so the food tasted decent in my opinion. A lot of the things costed additional $$. We got watermelon juice and half/half pot and it was around $35-$40 per person. 

We stayed til around 10:30pm and it took FOREVER to get our bill because the servers were all nowhere to be found. It's very annoying when servers are inattentive. The server actually gave us the wrong bill too. They really need to pay attention to detail in the future."}
{"text":"First impression was exciting until later. First turn off was the menu. The choice was small and everything that should be free was charged. The kiwi juice was a joke. Sugar water! The only thing was good was the sauce area. Lot of choices but no eggs. The glass water jug was chipped. I will never come back."}
{"text":"We eat at this hot pot place last night. The price is on the high side once you add the cost of the soup. Theres no free option for a regular soup like other places. Then you have to add cost of drinks as well. If you pay cash, they give you a free oyster for each person. Thats the only good part of the dinner. After that, everything went down hill. The food quality is average or even below average. That's for both meat and veggies. I can buy better food from supermarket. And most of us had a bad stomach the next day,  that's out of eight persons. This place is bad quality and overpriced. Will not come back. Pretty sure this place won't last. Many better hot pot place in the area."}
{"text":"This place took the place of 100 Degrees which I use to visit so I decided to give it a chance. 
The place was completely redone and now looks very different inside. 
They have an option of picking one, two or three soup bases. I had never seen a pot that could have three, so obviously we had to do it - not to mention how it gives us a chance to try three bases rather then just two. We had a medium spicy traditional broth, mushroom, and pork bone ($12.95). Prices for broth increase according to how many you choose.
The spicy broth gets more and more spicy as you continue to boil it, so medium was a good choice for us.
There's a sauce bar, where you can grab your own sauces as well as some fresh cut fruit (melon, pineapple, oranges). 
We ordered all the meat items and some veggies and tofu. The quality of all the food was pretty good. The slices of meat were very thinly sliced - thinner then usual, so we ordered more. 
There's complimentary tea and water, but plum juice and all the other beverages are extra. 
The service was excellent. As they got busier, the waitress still checked in on us frequently and took away empties as soon as they appeared. She was very friendly and helpful. She also spoke Cantonese, Mandarin, and English, which is a plus as I've been to many places a long Hwy 7 that only speak Mandarin. 
The price on a Monday night was $25/person + soup base + drinks. Its pretty high in my opinion and that's the only reason I can't give it 5 stars. At most places, they include complimentary drinks for a lower price, which I think this place should consider. Not pop or alcohol, but maybe some cold chrysanthemum tea, or plum juice? 
Aside from those two downers, I think the option to have three broths is pretty cool and the service was great so I'd recommend this place if you don't mind spending a bit more."}
{"text":"Service is excellent but some of the waitor there dont speak english well just point to the menu:) 

Food is tasty and alot of variation of meat and sauce booth for you to customize your sauce.

I just dont like how most hotpot place is charging for soup base type..."}
{"text":"I can't tell if I will come back or not. The food was amazing and fresh/delicious. But the wait was ridiculous and not worth the 12% discount they gave us. The staff were pleasant.... But I can tell they snuck in a couple of their regulars/friends before us and hoped we didn't figure it out. We waited for 1.5 hours! Maybe I will go on a Monday night...but definitely I will never go back on a weekend night again."}
{"text":"Featured in blogTO as one of the top 10 Chinese restaurant chains in Toronto, this Hot Pot import peaked our interest. Very spacious, but very busy, thankfully you can make a reservation. Excellent selection of broths, meats, and pretty much anything. I especially loved the Chef's selections of frog legs, New Zealand lamb slices, pork neck, and lots of innards, yum! Make sure to try the soft boiled quail eggs. The selection of ingredients for the DIY dipping sauce station is quite impressive. If they don't have uncooked eggs, ask your server for one. Their spicy broth is truly spicy, so beware or you will cry. Desserts are extra, but cut fruit is part of the AYCE. The service is pretty good as well.
With over 1000 locations worldwide, this is the Hot Pot to try!"}
{"text":"Not too bad and not spectacular, it does the job. The restaurant feels more roomy after renovating from the previous hot pot spot. The food quality is good and the service is fast.

This place makes you feel like you're in China (since it's a franchise there). How? Well, their walls are filled with self-given awards for titles like \"most clean\" and \"friendliest\" etc. They always have a membership card program where you get bonus spending if you prepay a certain amount, again extremely popular in China.

To summarize: it goes the job"}
{"text":"Ehhhhhhh soup base is OK.......... food is OK.........you get some side dishes which is cool and the sauce selection is good. Music is mehhhhhh...portions are bigger which is not really a good thing since you could always order more anyway.....

Morals Village is way better!!!!"}
{"text":"Certainly one of the better AYCE hotspots in Toronto. Liuyishou specializes in chongqing style hot pot, which is very spicy and numbing. In terms of broth, they offer non spicy pine bone broths with Chinese medicinal herbs as well as a plethora of spicy bases. They offer a wide selection of vegetables, meats, seafood, and other miscellaneous items, everything from the familiar to the exotic. They also have a condiment bar where you can create your personal dipping sauce according to preferences. The most surprising aspect was the dessert selection, which is included in the meal. The fruit quality was very fresh."}
{"text":"I'd probably give the food here 4 stars but the service and cleanliness had me deducting a star.  Tried making reservations for a Saturday night but they only accept reservations for 5+ people so instead they suggested we arrive early like 5pm, which we did.  The restaurant was empty for the most part but all the tables were filled with dirty dishes from previous customers.  I'm not sure if they were changing shifts or the late lunch crowd JUST left before I arrived but even though there was no one before me I had to wait a while while they cleaned off the tables.  The soup base here are a bit more expensive than other hot pot places I've been to but I did find it more flavorful.  They only do large pots but they can be separated into two or three sections to provide a variety of soup bases...or if you just don't like mixing food with others.  Drinks are also extra charge with the exception of water.  Their selection of food was pretty large which I loved.  The waiter takes your order down on an electronic device but most of them only speak Mandarin, with the exception of one we encountered that spoke Mandarin, Cantonese and English, but best to either speak Mandarin or point on the menu to avoid confusion.  They have a little rack beside each table which I thought was a great idea so that you can put your dirty raw plates there or leave refilled plates so as to leave more space on the eating table.  It was pretty easy to get the waiters attentions but they kept redirecting us to get the sauce bowls and strainers (scoop things) over the sauce/fruits/sweets bar.  However..... There were never any there.  They must've still been washing them from the previous round and hadn't brought them back out yet.  We eventually got some and went about eating.  I think they got busy and lost track of time because we ended up eating for a good 3 hours before they told us it was our last call and if we could pay the bill.  They have desserts which are pretty decent but at an extra charge.  Overall if I were to go out and hot pot again for a similar price to other places (approx. $40/person with regular soup base) I'd probably come back to this place."}
{"text":"This hot pot place is expensive man!! Around $30 for one person including tax. One thing that threw me off is how you have to pay for the soup base... Really? And it's not cheap either, it's like $8-12 bucks per soupbase. And it's for one pot, so if you have 6 people, you better get in reallllly close to share one pot or pay for two pots. Some soup bases allow you to choose 2 or 3 kinds in one pot, they just split it. We got the tomato base and another meat broth. 

There's a variety of items you can choose from seems endless. There's seafood like shrimp, fish, mussels. A lot of different kind of vegetables and so many different mushrooms! Meat dishes include pork, beef, spicy beef, chicken, and lamb. it's definitely a huge menu. The meat slices come in really small and thin, so order up! The waiters we got were super slow and unresponsive and a lot of them didn't speak English. We had to ask multiple times for things like napkins or other utensils. 

They have over 28 different sauces for you to choose from at the middle of the restaurant but beware it's all labeled Chinese... I had trouble telling which one was soy sauce. You'll just have to smell them all. They also provide fruits in this section and other cold cooked appetizers. I stack up on the pineapples and papayas!"}
{"text":"Pretty good hot pot, fresh meats and veggies. Love the shrimp and the variety of sauces to mix"}
{"text":"These prices are getting fkin ridiculous. Expect to pay $40 per person all in on the weekend. 
No English labels on the sauces. 
Good quality meats and presentation. Good and friendly service. 
Awful parking."}
{"text":"I've been a few times. That says a lot. I like it here

This is a pretty good hot pot place. There's a lot of choices with meat and veg and noodles. Pork neck and fish balls stood out to me. 

 There's a good broth selection. Every thing from no spice to 'omg it tastes like fire'  and all combos in between. 

 There's a large dipping sauce bar. I've never seen one before but I like it. You can make it the temperature you want with any of about 40 or 50 different items. Lots of selection which is great.

Parking can be a real pain. Theres a parking garage behind it though so you can park there and walk over. Not that bad if it's not minus 100 out!

Hint. Make a reservation it gets super busy even during the week.
Also. It costs more on fri to sunday"}
{"text":"This is the best Sichuan hot pot in Toronto so far. Nice service and authentic taste. Fresh salad bar with tons of choices. They even have hongkong styles desserts. Highly recommended."}
