{"text":"This place is under ratedly good. They have Indian style Chinese food (Hakka). Their Chicken Manchow Soup is to die for. Also, I love their Chicken Pakoras and Chicken Lollipops. I keep going back again and again once a month.

All their meat is Halal."}
{"text":"This is a typical Indian Chinese restaurant. Even the owners speak Hindi ;-) I guess is a family run restaurant, and deals with you very cordially

Few of their typical tasty dishes include Chilli Chicken, Manchurian Chicken, spicy Chicken Lollipops, Sizzling Beef, and Chicken Pakoras

They serve halal meat, i think

This place is a bit for large group in terms of space though!

Overall verdict: Good food, value for money!"}
{"text":"The chicken pakora is the best I've had ..but they over charged me or added a tip. As per the prices on the menu .. I got 2 egg rolls at $1 each , steamed rice at $1.50 , and the chicken at $8.75.. So that equals $12.25..tax on that is $1.59 sooo that equals $13.84..yet the bill was $16.95..so therefore she over charged or basically stole $3.11..I noticed this and purposely made it an even $18.00..so they made an extra $4.16 off me"}
{"text":"This place isn't worth going to. No offence to the other two reviewers.

Like they both said, it's your typical Indian-Chinese Hakka restaurant... but there's nothing remotely impressive about it.

The service is good, but that's about the only pro. I went with my husband. We asked for some Ho Fun Noodles, and she said she was out, so we had to choose something else. She immediately recommended us the Manchurian noodles, to which both agreed was fine. We asked for it with the beef.

The noodles were really oily. They were packed with veggies, which was a nice change from the regular Hakka restaurants that barely put any in their noodles, but at the same time there was barely any beef, which both my husband and I would have preferred over the veggies. The price was average, if not slightly overpriced for a Hakka restaurant. I've seen way cheaper, and I've seen much better for the same price. Hell even Lucky Chinese Restaurant a block down is way better quality, and it's slightly cheaper than this place. The portions are also pretty small for what you're paying.

If you're in the area, I recommend going to Spicy Dragon over this place. It's a way better price, and the food tastes so much better. Also, you get huge portions that can really feed quite a few people.

Verdict: the owners are nice, but this place sucks otherwise. I would eat here again if I had to, but I would never stop by on my own again. There are just too many better alternatives."}
{"text":"This is the most authentic and best hakka place in town. Beats lucky, lin, Fredrick's. Owner from calcutta (so it's legit hakka). 
American chopseuy, sweet n spicy fish, chicken pakora are the classics"}
{"text":"We ordered in on a Saturday night, my cousins order regularly from this place for their authentic Hakka cuisine. We ordered chicken pakoras (8 pieces-my favorite appetizer; wasn't too spicy); ginger fried rice (very light); spicy beef (almost like a general tao beef with an Indian twist); steamed beans with a soy sauce dressing (really enjoyed this dish-); a fried boneless fish dish. There was complimentary white basmati rice, various sweet & sour, chili, vinegar and chili sauces and can't forget the fortune cookies! Great combination of foods and family time."}
{"text":"We went there on 14th April 2018 again as the owners of the restaurant happen to be Chinese couple having migrated from India and know Hindi as well. Besides the personal touch, the food was also very good.

Would recommend this restaurant for food and personal service"}
{"text":"Chilli Chicken here is unreal, their green chilli are so spicy but I just can't get enough. Not many places make their chilli chicken with a wet and saucy. This is the place for that!!! Yum"}
{"text":"My family has been going to Chopsticks for the past ten years (if not longer). Chopsticks has always been consistent and delicious - but really it's a wonderful service from Linda that keeps us coming back time and time again.

The food is tasty - some of our favourites are their soups (sweet corn, hot and sour, and manchow...oh my goodness the manchow soup),  Manchurian noodles, spring rolls, and the paneer sizzlers.

For vegetarians - Linda and her husband are very understanding of dietary needs and are careful and respectful. 

The atmosphere is far from a fancy restaurant in downtown Toronto, but it's welcoming, warm, and friendly. No complaints here. 

Check it out!"}
{"text":"Being a former resident of Scarborough, I can attest to the fact that this place as been around for quite sometime, and for good reason.

The indian chinese food you get here is very good. For apps, try the fish pakora. The beef pepper fry is amazing, chilli chicken, manchurian fried rice are also some of my favorites.

The service is very good, and the lady (owner) is very attentive and very friendly, and yes she does speak hindi. :) In fact, she use to own the Chopsticks in Bandra (Mumbai).

The price is also right, the decor isn't much to write about. Check out the pictures on the wall as soon as you come inside, you will see just how many indian bollywood actors these owners have met.

I would suggest this place over mostly indian chinese places in Scarborough."}
{"text":"Returned here after about a decade (used to come here often as a kid/teenager).  I ended up in Scarborough again so I thought why not. Hasn't changed - not the appearance, the owners or the quality of Hakka food. I usually avoid Hakka places nowadays as a result of how I feel afterwards but Chopsticks' quality remains up there, high above the rest. Stuck to the favs: chicken pakora, mixed Szechuan fried rice and dry boneless chilli chicken & all of it was still as good as I remembered."}
{"text":"PROS: good taste, nice staff. It has my fave chinese dish ive only had at their place. My secret.

CONS: portions not as big as other prices and two dollars more on average compared to other hakka joints. 

This place is pretty basic. Not fancy. Very 80s decor, but that doesnt matter. Its about the food.

 Its dead during the day but packed in the night time."}
{"text":"My go to place when I visit my family for Haka food.  There Chicken Pakora is to die for especially with that sweet orange sauce they have.  Manchurian Noodles umm so good and the sizzling shrimp is always good.  small hole in the wall run by a wonderful lady. Would definitely recommend this place to anyone."}
