{"text":"Chinese take-away, there are lots of them and they all seem to be about the same.  Chopstixexpress is fast... walk in, place order and walk out with your order in 20 minutes.  You get a clear and open view of the kitchen while your food is being prepared, makes me feel a little more food safe because of the transparency.  I've never asked, but always wondered... the specials advertised over the counter... are they actually specials available or just signs for decor :)  When you have a craving for Canadian-Chinese food, this is the best in the area."}
{"text":"This place rocks!  Screw your usual Chinese restaurant that charges an arm and a leg for the same damn crap that they order wholesale from some mysterious central source of Chinese food.  Call them and your food is ready inside of 15 minutes for pickup.  Absolutely super fresh.  And, free chicken wings over a $25 order (I think).  So awesome...  If you order about $25 to $30 worth of food, you will have plenty to eat for the night for two, along with lunch for the next day.  I love the lemon chicken.  Nicely breaded.  Kung Pow Chicken also very good.  Just the right spice.  Delivery area seems to be pretty wide.  No comment on it though, as we always pick up.  Finally, decent Chinese food, straight up."}
{"text":"I work in the neighborhood and wanted to order delivery, all the reviews were good so I ordered soup, fried rice and sweet and sour shrimp ,boy were they right! Hot ,fresh and sooo good !! I recommend it highly will  definitely order from here again!!! 5 stars !!!"}
{"text":"First time visiting this Chinese food.place in the area close to my bf's place.  It's a typical Chinese take out and delivery with no actual place for sitting.   The food was ordered and received in decent timing.  Got it home to see that everything appeared fresh, but nothing really from the ordinary made it stand out. Not exactly interested or dying to visit again."}
{"text":"Had the #4 meal from here.....added chicken chow mein. Wow!!!!......1 egg roll very flavourful, a bit oily mind you, but still good. Chicken fried rice......short grain rice, nice and light, not clumpy and sticky. Chicken balls......4!......tasty as well. But REALLY liking the chow mein!!! Big pieces of chicken throughout, and the bean sprouts were nice and light tasting and not bitter. I have not had any CCM since about 30 years ago, up until this place that did not taste acrid and strong. As I am told, bitter because the sprouts are to old. I will be doing lunch again very soon!!!"}
{"text":"This is pretty terrific Chinese food at a great price. I have never not had tons of leftovers, great chicken wings too"}
