{"text":"Good take out for a good price, I ordered a large beef fried rice and chicken fried rice and they were good, plus they were ready in under 5 min. Would definitely order again if I was looking for something quick. I hesitate to give 5 stars because the food is just decent, nothing I'd go out of my way for, that's just me though"}
{"text":"Fastest and best Chinese restaurant in the area! I eat there regularly! love it"}
{"text":"Standard greasy chinese food. As if often the case at chinese food takeout places, you can see the food being made which immediately creates regret and disgust. The front counter help is bonkers too."}
{"text":"Portions are huge, prices are cheap, and it's convenient to Case, UH, CCF, etc. There's pretty much no other reason to come here, unless you like the way they answer the phone: \"CHOPSTICK, WHAT YOU WAN?!\""}
{"text":"This is my second time coming here, I can't say it's the best I've had. The food is okay for the price. Not much of a selection when you work in UH main campus. But as far as for their food, I'd give it a C-"}
{"text":"Fast and good food for the price. I stopped by during lunch and got the $6 lunch combo. They don't put utensils or napkins in your takeout bag (and I didn't see any napkins inside for people to grab), so make sure to get some before leaving."}
{"text":"So, I think some of the reviews have been pretty harsh here. My honest opinion is that this plae was decent. I ordered chicken lo mein, was told it would be ready in 5 mins and it was. The chicken was tender, not chewy like others have said. Sauce was tasty, veggies still crisp.  For a quick, inexpensive decent meal...this place is doing it right."}
{"text":"This food was ok in a pinch. It was quick for me but not full of flavor.  If you are looking for quick and convienent this this is a good match."}
{"text":"Good for Chinese fast food. Don't go in expecting healthy authentic Chinese food- it's fast food. Tastes way better than Panda Express and has a wide variety of options.  I liked their Salt Pepper Ribs + Hot and Spicy Chicken Wings (which are not spicy at all)  It's also nice that you can preorder online so you don't have to wait when you pick it up."}
{"text":"I've gotten take out from this place a couple of time. I swear they use the same sauce for EVERYTHING and it has a really strong vinegar flavor. It's basically your token cheap low quality Chinese place. Good for when you're feeling lazy and craving some semi-satisfying food. But if you're looking for flavorful authenticity- go somewhere else."}
{"text":"What a gem.  Good Chinese food for an very reasonable price.   Lunch specials are just $6 (Monday through Saturday).    Good portions and come with soup or coke.    There are a good selection of items available for lunch too."}
{"text":"The food is really not that good there kind of high in price kind of Chinese which means cut in Chinese really don't care for any other food"}
{"text":"LOVE this place. It's so convenient, because when I WANT Chinese food, I WANT IT and I live about a 5 minute walk from the place. The wait is relatively quick and I've never had any problems, which is pretty nice because I'm a little wary of Chinese at times. If you get hungry an hour later, guess what?! You'll more than likely have great leftovers.   Also, another attraction is the Coca Cola in a can. Being a Case student and loving Coke is hard, since it's a Pepsi campus, so Chopstick provides a great treat every now and then: great sweet and sour chicken and Coke in a can."}
{"text":"I was in town for a night and had a hankering for some low Mein.   So I stopped into Chopstick for a take out order.  Chopstick is pretty much the kind of place that you SHOULD take-out from and not dine in.  The place is fairly crusty on the interior.....not exactly a date spot. My pint of Low Mein was only $4!   This is bad chinese at it's best.  My dish contained a lot of grated carrots three sorry clumps of broccoli and some cabbage slices. To to top it off it had a slightly scorched flavor.  But somehow it was salty tasty goodness. I'm giving it four stars because it's great bang for the buck.   There is a metered parking lot right next door as well."}
{"text":"I was leaving an appointment at UH and wanted to grab lunch before heading back to the office so I found this little place. It was pretty busy even at 11am on Tuesday so that's always a good sign.  I ordered mongolian beef and it came with soup for only $7!  It was a huge portion of mongolian beef and the wonton soup I chose was very tasty.  I will certainly return.  The wait for my food was only about 8 minutes so it's a great place to stop if you're in a hurry!"}
{"text":"I was craving Chinese fast food the other day. So, I went to Chopstick and it hit the spot. I ordered the sesame chicken with fried rice as a lunch special, which is a very good price.    One downside was that most of the chicken pieces I ate had very little chicken and mostly batter. Pictured below!!!  You were warned!! As a Case student I'm glad we still have Chinese fast food for the days I crave it, but I wish it could be as good as the other Chinese fast food places back in my hometown."}
{"text":"I'm one of those Chinese people that loves bad Chinese food. Sesame chicken and General Tso's are two of my favorites. There's just something weirdly sinful about getting your chicken tossed in some weird sugary goo that makes my taste buds jump up in excitement. Weird, I know, but I just crave it sometimes.   However, when I come to Chopsticks, I often order off their special menu. It tastes pretty traditional and is so cheap. The variety has been increasing these past few years from when they used to have 1 or 2 un-written specials to a whole list. It is definitely one of my go tos when I want something authentic but don't want to drive all the way to Asia town. Affordable, quick and  pretty dang good. I'm definitely going to stay a regular."}
{"text":"Walking distance from Cleveland Clinic and University Center.   It was one of the few places open on a Sunday night. Food portions are huge but like many of the reviews mentioned the food was tasteless, colorless. I've never seen fried rice so pale or had chicken so chewy. I  also  ordered the singapore noodles. How can singapore noodles be flavor less is beyond me.  Will definitely not go back."}
{"text":"Won't be back. yechh.  This is basically a take out place, but you can eat there at one of the two tables.  Ordered the chicken schezuan.  There was something in there that resembled chicken, but the taste & texture was more like tofu.  Great place to go if you need sustenance, but if you enjoy flavor, texture, appearance, this is not the place."}
{"text":"Really, there is nothing special about this Chinese food.  It is passable.  What makes this place worth going to, however, is that you can leave from anywhere on the Case Western campus, give them a call, place your order, and then it is ready to pick up when you arrive.  All for about $4.25.  And it will even make for leftovers, as they give you so much food.   No seating area, and no real 'specials' of any kind.  This place still perfectly fills in the niche into which it has fallen."}
{"text":"Ask for their daily specials! They have a lot of off-the-menu dishes everyday that are very traditional Chinese dishes :)"}
{"text":"Chipotle is my kitchen, that's how awesome it is . It is not like any other to go Chinese restaurant but place that makes real Chinese food, and really good Chinese food. I love their chicken wings, fish, mixed vegetables, noodles. And they have very reasonable prices!  I think you should try every thing. Just go and get surprised."}
{"text":"Surprisingly very good food got general toa's chicken combination. Fried Rice was very flavorful & general toa's was crunchy in a good way the sauce was perfect. I will  definitely patronize this place again. The wonton soup had good flavor but needed maybe meat or something else in it was just plain  but it was  good. Fast service oh yeah the one bad note was the egg roll it was boring know crunch nothing to  brag about.."}
{"text":"this place does not deliver, as the description states. but they have the best orange chicken i have ever had. its a shame they won't deliver to my office 5 minutes away..."}
{"text":"I came here for takeout on a Monday night. The restaurant is mainly a takeout location with a few tables inside the establishment for those who want to eat in casually.  Service-wise, the place is very well run. They give you a beeper once you order your food, and ours went off reliably when our food was done. Staff was courteous and pleasant.  The food, however, didn't suit my fancy. I got the Szechuan Shrimp dish, and I found it extremely bland. There was a tiny bit of salt, and the dish was billed to be spicy, but I couldn't get even a hint of spice from the dish. I was definitely underwhelmed. I expected flavors to burst from the food, but everything just fell flat. That being said, the vegetables and shrimp were, in fact, perfectly cooked, which is why I give this restaurant just a mediocre review and not a bad one.  Overall, this is probably a good place to come for fast food, but don't expect anything miraculous here. It's just not that special."}
{"text":"Five stars for a good, cheap Chinese takeout place in Cleveland and University Circle. It's also the only place around here that can satisfy my nostalgic food cravings for food I like to eat back home. It's strange to me that with so many Chinese students at Case there aren't more decent Chinese food places nearby.   Basically they have two types of menus. The one on paper and on the big overhead boards are the \"Americanized\" Chinese dishes, such as orange chicken, Mongolian beef, etc. My partner who is not Chinese loves their General Tsao chicken lunch. It's a pretty good price for the amount of food, and you get a free soda or a soup.  The other menu is the more \"authentic\" menu that Chinese people who want Chinese food actually order from. It's on the left side wall written in neon colors. The menu changes from time to time but several dishes always stay. The one that I always order is the MáLà noodle, because it somehow reminds me of MáLà tang (???). Even though it's still pretty different, the dish is as spicy and flavorful.  One of my friends said he's got food poisoning from their food but I've eaten here close to twenty times now and have never had any problems. I guess if you're in doubt, just go for the MáLà noodles!"}
{"text":"Their lunch combo is worth. $6 for lunch and soup or soda. The food is hot and good. Not that spicy but ok. easy and quick grab"}
{"text":"don't go for lunch, the lunch size sucks I didn't even get any fried rice, just normal steamed rice. makes me mad."}
{"text":"Cheap, quick, and greasy...what more can one possibly be looking for in a Chinese restaurant close to one's office? Everytime I order, I can't seem to get away from the beef chow fun. Drop one of those slippery noodles on your work pants and they're toast (no Tide-to-Go pen can salvage a garment that has been subject to that much grease)."}
{"text":"Not very good cheap chinese food.  The chicken with broccoli had a weird sauce with it.  The egg drop soup was decent. The lunch special which includes both was 6$.  This a carry out only place but there is ample outdoor seating in university circle.  I have heard their noodle dishes are decent so maybe those would be better.  There are now quite a few other Asian options in University circle including Ninja City and the highly anticipated Inchin Bamboo Garden."}
{"text":"Gross Garbage Cheaply prepared food. Gave two chances since it is within walking distance from hotel and usually easy to get vegan options. Veggie fried rice contained pork after I made it very clear that I did not eat meat and veggie egg roll was solid cabbage and dripping with grease."}
{"text":"I am rating this place based on the Singapore Chow Mei Fun. This is one of my favorite dishes and they do it better than anyone I know, to date. Ask for it extra spicy if you are so inclined, it is worth it! I return frequently for this dish and nothing else."}
{"text":"Quick, cheap Chinese food.  Got the garlic chicken to go and it was pretty good considering the low price."}
{"text":"Solid, standard Chinese food. Tastes fresh, it's quick and inexpensive.. idk why this place is getting hated on so much. I got Mongolian beef stir fry and 2 egg rolls. Came to $10.50. Would definitely come back."}
{"text":"This place is in a little out door food court area and to be honest, you will have several better choices than this place. As well as quality Asian cuisines versus this. The place is incredibly small and waiting in line led to everyone being on top of each other. They could've atleast had a roped off line so then people just don't skip the line when they want. A couple chairs if you decide to eat in, but not worth it with how cramped it is. There is outdoor seating close by. I just got the orange chicken and lo mein and this orange chicken was so weird. It was some weird tangy sour citrus taste. It was over fried and too crispy.  The lo mein was pretty standard and they did have the food freshly ready in like 3 minutes, so super fast! But I'd recommend atleast working on whatever sauce and seasonings they use."}
{"text":"Chinese takeout. Rated 4 stars because lunch special is a very good deal and good amount of food and if you want typical Chinese takeout, this is a great place for it. Unfortunately, I am Chinese so I do not like takeout. I hear if you order in Chinese, they may serve more authentic Chinese dishes off menu, but I haven't tried it yet."}
{"text":"Well I am working in the area so I figured I would drop in and try this place it was pretty good. I ordered the General Tao chicken combination it was 7. 75 The egg rolls are bland tasting to me but that sauce on that chicken was pretty good . The seasoning was nice and the vegetable fried rice perfect not all salty tasting . They have a small waiting area to sit inside or plenty of outdoor seating. I'm gonna say that rice is great tasting. The staff is very friendly and food came out in like 8 mins."}
{"text":"Now add a lot of new food, very delicious The food is very fresh The restaurant is very busy, you'd better make a phone call scheduled"}
{"text":"Verdict: Would go again if craving fast food Chinese food  Food: For one thing, this place is owned and managed by Chinese people but the taste is highly Americanized. When you want spicy, it's not Asian spicy, just FYI. The food was pretty good. They have a house specials which is more traditional Asian dishes and your standard Americanized Chinese food dishes. I've tried the General Tao chicken and stir fried chicken + mushrooms with oysters sauce and they were both good. I like that they have lunch/dinner specials that comes with rice and a soup of your choice. Really cheap and reasonable prices versus around the area, so I like that.  The Extra: Inside seating area is pretty small, which is standard for these types of restaurants. There's only about 8 seats and I think there's a small table outside. I really appreciate that the kitchen is right there for the viewing because in my experience, when food is being prepared in a \"fast-food\" way, I'd like to know how they're cooking it and I'm assuming it's more cleaner since they know I may be looking. The order came in about 5 mins when they were not really busy."}
{"text":"If you go here and are not a vegetarian, order the General Tso's Chicken. I've eaten at Chinese restaurants all over the Cleveland area, and this place has the best General Tso's. The portion sizes are quite large too--one order provides enough food for two meals.  Other than that, it's pretty unremarkable. If you're a Case student with a car, head up to Amazing Wok II at the intersection of Cedar and Taylor--the food up there is far superior, and the people are much friendlier. I'm glad to have Chopsticks within walking distance of my house in Little Italy, but it's sure not my no.1 pick for takeout Chinese. There's nowhere to sit, so count on taking your food back home. If you drive here, make sure to bring a few coins for the parking meters because the UCPD hangs around this lot like a vulture around roadkill."}
{"text":"I go to Chopsticks regularly and it has been consistently good every time. It's a great value. The dinner specials are less than $10 and are decently yummy. You get fried rice and egg roll with your main dish. I've always found it to be very filling. It's very Americanized, so probably similar to what you would expect from a fast food Chinese restaurant. They have all the popular dishes like general tsos, sesame chicken, lo mein, etc. along with traditional asian dishes house specials, and their daily chef specials. Plus you can order online and pay when you get there! They're super fast too, they usually have our order ready in less than 20 minutes. I wouldn't recommend dining in though, it's pretty small and cramped in there and usually hot too with very limited seating along the wall. Also, the staff is very nice. Remember to ask for sauce too if you want because at least in my experience, they never include it."}
