{"text":"I've driven past Cristy's Rotisserie Chicken countless times, but I never get a second thought to eating there.  After all, I can get a rotisserie chicken at the supermarket any day of the week.  How much better could Cristy's possibly be?  Turns out, it's alot better and cheaper than I'd ever imagined.  I ordered the Homestyle Chicken Sandwich, which was piled high with deliciously seasoned all-white meat chicken on two thick slices of whole wheat bread with a side of fresh marinated vegetables.  The chicken had a flavourful blend of herbs and spices, and the veggies were a nice healthy alternative to the standard french fries you're stuck with at most fast food joints.  All this goodness for only $6 - hot damn!  Besides their roster of roast chicken delights, Cristy's also offers a nice sampling of Asian inspired dishes including Salt & Pepper Chicken, Lemon & Orange Chicken, and Ginger Beef. If you're looking for a healthier fast food alternative, Cristy's offers delicious \"Cluck for your Buck\"!"}
{"text":"I have been to this location many times over many years for their Asian food... the one thing that is a constant is that it is inconsistent....  one time GREAT next time hell no im not going back... then i go back it is good then no...  When im in the area the thought that goes through my head is... how do i want to feel for the rest of my day..... do i chance it???  I have had the chicken and other menu items and those are good... but the others...  some time i roll the dice and im happy but others i loose."}
{"text":"Go there and eat. Don't argue. Get the Salt and Pepper Chicken. Just Do it. Do it."}
{"text":"I've been here twice and it's my go to restaurant when I'm in the city. Had the $9.99 honey chicken special last time and it was incredible. The chicken is cut up and you're served a pretty decent portion. The skin had a slight crunch to it and the honey on it was just the right amount. Had the 2 sides of cubed potatoes, which were awesome and mixed veggies. Both sides were plentiful as well. I cant believe i finished my plate. It was so good. Nandos is just down the block a few but if u want bang for your buck Cristy's is the place for you."}
{"text":"First of all, I can't complain about the food.  The food is really good and fast and easy.  I was a regular until recently.  I went about 2-3 times a month.  Unfortunately one evening I bought my food (take out) and on my way out I saw someone cutting their nails in the kitchen.  I just can't get over it.  How is it ok to be cutting your nails in front of customers?  That is a food safety issue.  I'm sorry because of that one experience I will not be back."}
{"text":"Yum yum yum  I've ate here a few times.  The prices are good for half chicken and two sides.  All that's missing is the Chalet sauce.    The nice thing here is that it is yummy and the service is great.   You get the same quality of chicken for cheaper than most places.  (Swiss Chalet) I recommend this if you need more food than humanly possible to eat in one sitting.     It's clean to boot!"}
{"text":"For a plate of hot steaming fresh food this is the place to go. For me, it's a good post workout restaurant. I get a lean protein (I choose the 1/4 white chicken rotisserie) with potatoes (boiled perfectly soft with the skins on and seasoned with a light butter/dill sauce) and steamed fresh veggies (carrots, broccoli, cabbage, etc.) I ask for packets of hot sauce, maybe a teenie tiny packet of pepper, and I'm golden. Sometimes they ask if I'd like a small muffin of complimentary sweet corn bread. Sweet and golden.  The portions are large enough that I feel totally satisfied (and trust me I have a large appetite), but I feel good because what I order is not deep fried or with too much sodium. It's exactly what I want - large juicy delicious rotisserie chicken breast and a crispy wing to send me swinging into a food orbit of epic proportions!   But they have more than roast chicken, they have Chinese dishes, fried salt and pepper chicken dishes, hot chicken sandwiches with gravy, all delicious and affordable. I've eaten here about 8 times and their food is consistently good.   It's a casual place, there are TVs and reading material. You order like at a mall from a snappy & sassy Chinese woman, where you can see most food options in warming pans behind the window. Then you pay, bring your food on a tray to a very comfortable booth or table, sink into your meal and enjoy. At lunchtime there's usually a line and the place does have their regulars, but there's always room.   Since the booths can fit 4 comfortably, this is a great place for a group lunch or casual dinner.   It's on 32nd Avenue in the NE next to Arby's."}
{"text":"Sometimes you just need a big plate of comfort food to gorge yourself in.  I've had many of those day's, I must admit.  Sooner than later, your jeans fitting a bit tighter becomes your voice of reason.  This place by no means is a fancy schmancy sit down and get waited on type of place. The best way to describe it is a cafeteria type service without waiters but the best comfort food under $10.  Their menu offers many selections but nothing crazy, stir fries, sandwiches, chicken dinners, and a wide selection of sides, more than most restaurants.  My absolute regular must have sides are always their roast quartered potatoes, so tender, buttery and seasoned to perfection, stir fried veg, to counter balance the potatoes of course, and the mini corn meal muffins (they always give you 1 to go with your meal, I always ask for more even for the extra charge.) BTW an additional charge for any side with your meal is, are you ready?  0.89 cents, SERIOUS! Sometimes I switch it up and go for the pasta salad, so creamy and my favourite in the city, sometimes I pop in just for a container to take home.  Their chicken is by far the most flavourful and succulent that I have had at any fast food place, and better than most restaurants that charge you about twice what you would pay here.  The lack of waiters and fancy decor doesn't stop me from coming in when I need a chicken fix.    Great place for kids, and families, and doesn't break the bank.  You probably have seen this place in a food court, I think 32nd ave is the only one with a sit down area, either way, give it a try, it is not the daintiest meal, but surely to please even the most picky eaters."}
