{"text":"I was lost somewhere around Queen street in a snowstorm with a gurgling, uneasy feeling in my stomach when I came across this place. All it took was the words \"Churrasqueira\" on the sign to convince me to step inside and abandon my plans of going to the gym. I'd never heard of a Churrasqueira before, but it sounded kinda like \"Carniceria,\" which always means good food.

I parked my bike in front of a be-toqued hobo and crossed the threshold. This place is the real deal. Boisterous olive skinned people (the Portugese?) conversed loudly with each other across piles of chicken and glasses of red wine. A baba-from-the-old-country-looking lady sat in a corner, monologuing to a group men standing around in jackets and scarves. Everyone seemed like they belonged here, like they either worked for the place or were related to someone who did. Some hilarious over-the-top foreign soap opera played in the corner, unwatched.

About the time when I was starting to feel out of place, this sweet girl behind the counter grabbed my attention and set me at ease with a good old \"hi there, let me know if you have any questions!\" I ended up ordering the half chicken special, the words leaving my mouth slow and gummy due to the fact that my lips were still frozen. I'd hoped I made a good first impression, because this girl became my rock. Within two minutes of stepping into this place I felt like I had been dropped into another country and I was gonna need a friend.

Initially, I had planned to grab the food and go, but the ambience was so pleasant that I decided to stay, even if that meant eating dinner in a restaurant by myself while being scrutinized by locals. I pulled out this new neuroscience book that I'd been hoping to read and got to work on it; waitress girl brought out some bread and butter. Ahhhh yeaa, I was gonna make of night of this.

Before I knew it, the chicken dinner arrived. The thing was huge, one of those classic big Italian dinner plates piled high with salad, spherical potatoes, chicken, and dipping sauce. It was truly the biggest pile of food I'd ever seen at a restaurant in Toronto.

The chicken was fantastic. Rubbed with salt and some interesting combination of spices. It was totally worth breaking this week-long vegetarian streak I'd been on. The potatos, too, were remarkable: salty, roasty, and inherently satisfying. However, the best part of the dish was the piri piri sauce. This stuff (which waitress girl later informed me was handmade made in house), had the perfect balance of heat, acidity, and flavor. It also had a fair bit of creaminess that really rounded out the flavor of the potatoes.

All too soon, the chicken was gone and I was stuffed. I felt truly good. Not even the thought of having to bike through the snow could put a damper on my chicken-fortified spirit. I'd had a good meal, made some progress on this book, and found a cool new place to eat where I felt welcome. I think the waitress even called me cute at the end there. Ahh yeaa."}
{"text":"I was in charge of catering our holiday party for just over 100 people at work and I must say dealing with the team at Vila Verde was very seamless, especially Nella. 
A fear when catering is that there won't be enough food and that wasn't the case with Nella, she gave us her advice and told us what would work. She always returned my phone calls and answered all my questions. 

The food was amazing, it arrived hot and fresh and everyone was thrilled! They asked where we catered from and yes, there was enough food! The chicken was tender and the hot sauce is so good! We also ordered their vegetarian lasanga and my goodness was it ever good!!

Bravo to the folks at Vila Verde!!"}
{"text":"This is probably my new favourite find. Killer juicy chicken, one of the best pirri pirri sauces I've had, fucking scrumptious little potato balls, and a perfect classic simple salad with some oil and vinegar to balance everything out. Dip it all in that pirri pirri, bro. Dip bread, lettuce, whatever. I was dipping my shirt in it and sucking on it. Oh, and the place is really quite lovely and quaint, with a wonderful family feel."}
{"text":"I loved this place.  This place was randomly chosen among a few other restaurant along the Dundas W strip.  It felt like typical a mom and pop restaurant in Portugal but had very tasty food.  The chicken sandwich was made with a fleshly baked bun, pulled roasted chicken chunks and it came with savory piri piri sauce on the side.  The roast chicken meal came with rice and potatoes.  The skin of the chicken was extra crispy and was nicely seasoned.  The piri piri sauce transcends the the already flavored chicken to a heighten level .  Amazingly good and amazingly cheap!"}
{"text":"Rhum Corner was closed so we walked on and found this place! It was empty, but we sat down anyways. We were starved. We ordered the fish cakes and shrimp patties- for starters. They were fresh and delicious. Piping hot, I tell ya. We were stuffed before our quarter chicken dinners came. But when they arrived, hot with fresh veggies and rice...not to forget the grilled chicken, our greedy sides kicked in and we dug in. It truly is very very good food. I felt like I had a really good home cooked meal. I had leftovers to take home. Don't go in here if you are on a strict diet, that is not going to stick! Haha"}
{"text":"Went back again on Wednesday for lunch with sister-in-law from the left coast who has been with me for two months and wonderful son who loves food.

The order was:  Shrimp Spanish Style, Calmari Crispy aka. deep fried with regular seafood sauce, whole chicken, medium rice, medium crinkle potatoes, medium salad, piri piri sauce, 2 pops, one MGD beers, half litre Two Oceans White Wine,  $72 +10 tip.

That shrimp dish has the best flavour i've had in ages it was exceptionally good. The calamari although fresh is not what i wanted, the left coast ordered it, i would have preferred the grilled.  Nothing special.  Definately get the Shrimp enough for four people as an app.  

The chicken this time seemed to be really small, couldn't figure out where the white meat was or decipher the chicken configuration at all.  That said it was very tasty.

The rice is bland and will never order that again, it was clumpy and cold. The crinkle deep fried potatoes are what they are, either your love or hate them.  I like them, son loves them.  Left coast hated them.

Now onto service,  it was very slow and a bit incompetent.  We arrived at 1:15pm  order taken at 1:30 (asked for water 3 times).  Shrimp and Calamari with salad at 1:45pm with bread/butter.  Pop and Beer at same time.  Chicken, Rice and crinkle potatoes 2:30pm no piri  piri had to wait 5 minutes.  Half litre of wine not there yet as well.  We actually ordered a Portgeguese wine but she made a mistake on the Two Oceans we took it because i couldn't bare waiting another 15 minutes for the right one.

The waitress is a very nice women and personable but i think she needs more help on the floor from staff.  She really can't do it all.   Hence the $10 tip.  The guys behind us seemed to wait forever for their food and looked at their watch oh maybe 50 times.  Not to be a nosey neighbour but i saw their $50 + bill and the tip was $4.

I was on no schedule but if you were you may not want to have lunch here.  Out of there 3:15.  About two hours. Left overs for home.  Will go back again....i do love the chicken and piri piri, and i think the fish dishes are where i need to go next time..."}
{"text":"Pleasantly surprised! We were looking for a place to eat one day and we're not feeling anything unhealthy. Out of the blue I remembered this place on the corner of my street! We looked it up online and the reviews looked promising so we thought why not! Very out dated inside but it has that old school charm! A whole chicken is only $13 cooked over flames and very tasty. We also got a side order of medium potatos which were very flavourful. While ordering there was quite a bit of people also coming and ordering food. Our chicken and potatos all together came to $19.50 which is a great price! They also give you peri-Peri sauce on the side ( their only sauce option). 

This place is definitely somewhere I will keep in mind the next time I'm hungry"}
{"text":"Dishes were good and well priced.  Service was excellent. Fries were too blonde IMO. 

Took half the bbq chicken home and was pleasantly surprised to find they had topped up the rice and parisienne potatoes !  Would dine here again if in the area."}
{"text":"Hidden gem?  Maybe, maybe not...
Tasty and good value?  Definitely!

This completely unassuming super authentic Portuguese place is located in currently trendifying and hipsterfying part of Dundas West between Bathurst and Ossington.  Decor is minimal with a TV.  Expect to see lots of Portuguese families in this casual, casual joint.

The FOOD was all decent with some hits and misses.  The grouper was quite tasty, although we weren't sure that it was actually grouper.  The half chicken was probably the best dish of the night and came with a delightfully spicy dipping sauce.  The steak, which I ordered medium rare,  was served on the well done side of well done; however, the flavor was actually good.  I don't get why places ask about steak temperatures if it's not going to make a difference anyway.  Fries were pretty limp.

SERVICE was friendly and very casual.  Definitely not a place to come if you're in a rush.  The food took a long time to come out, but the free bread and olives helped with the wait.  

OVERALL. the VALUE is good.  Most of the entrees are in the $8-$13 range.  Drinks are fairly reasonable as well.  It doesn't quite rate as a hidden gem, but I'll call it a hidden cubic zirconium."}
{"text":"We pre-ordered four whole chicken (two grilled, two rotisserie) and two large potatoes the day prior for our staff lunch.  The total of this was $72. 

My colleague mentioned that rotisserie is usually more moist.  The owner of the restaurant said they were more known for their grilled chicken.  So I gave the grilled chicken a shot and it was mediocre. I've tried other Portuguese chicken before and they tasted better.  We got hot sauce on the side which made the chicken taste better.  The potatoes were really good- my colleagues enjoyed them too."}
{"text":"I knew this place was great!
Both times I went to the 268 Westin Road location (Yelp won't let me change the address)

FOOD
So I had the BBQ quarter chicken lunch with rice and fries (I don't remember the price either $7 or $9 I think) and it was delicious!

The chicken was roasted to perfection. The skin was just slightly burnt and the meat was dripping with tender goodness. *drool

The fries were freshly made and just had the best gold potato taste. Crunchy on the outside and soft on the inside. 

The rice was just meh. But I didn't go there for the rice.

The special homemade hot sauce was the secret to the meal. It had the perfect amount of kick and I literally just wanted to eat it by the spoonfuls.

ENVIRONMENT
It was almost empty today which was so different from the last time we were here. I have no idea why....

RECEIPT
Again, no receipt and I really think they do the math wrong in their head.  I'm not sure how my meal and my friend's meal which were both under $10 or his was maybe $11 at most could amount to $26.  I mean if our meal was $20 total, that only totals $22.6 with the tax. So I really don't like being fooled. Next time I'm going to check the price on menu and calculate the total myself.

LOST AN HOUR OF MY LIFE
The one thing I really didn't like was that I had to wait about an hour for my food. I was absolutely starving when I got there and was borderline unconscious when my food arrived.

TIP OF THE DAY
To figure out what to eat, I think it's best to look at what other ppl are eating and just say you want what they are having. It seemed everyone was either eating the chicken or fish fillet.  A 1/2 a chicken is $5 and a whole is $10.

Make sure you have 2 hours of spare time to eat at this place b/c you're not getting back to work ontime."}
{"text":"This place is a special hidden spot!  They have delicious roasted chicken and potatoes.  It is very reasonably priced.  It is a small spot and looks like it is family run.  Be prepared to have a leisurely and enjoyable dinner.  Don't rush and just enjoy :)  
Also I hear their takeout is great.  I may use them to cater a party in the future!"}
{"text":"We came in because it looked like it was small mom and pop restaurant.
There was a family and 2 other couples there.  It's a small space.  Prices are
reasonable.  Home cooked style meals.  We ordered an entree of steak, calamari,
and grilled cod.  There are several sides to order from.  We thought it was a good meal.  Prices were reasonable."}
