{"text":"Happened upon this spot by accident sort of between lunch and dinner.  The food was very good but it looks like the place is more setup for takeout than dinning in as there were a dozen people waiting at the counter for orders and some sitting at tables waiting for orders.  I had the grilled chicken which was really good, extremely flavourful.  Lots of different side options.  All in all I was very satisfied.  The service was very good.  Food took a while but they are cooking in front of you so if want fresh then that's how long it takes.  You can phone ahead if you are picking up and they will have it ready for you."}
{"text":"I wish I could give this place 0 stars...food is great but the service and people are the worst. If you ask the lady at the cash for hot sauce she looks at you like it's Armageddon. Go to xpress bbq or the portugese place by weston Rd and major mack. I hope the owners read this review."}
{"text":"Great food but service is really bad - cashier staff is terrible. Rude and simply lacking in any manners. Better off going to the oakwood location. Not planning on going back to this location again."}
{"text":"The chicken is amazing .There is a bit of a wait on the weekend but that just tells you how good it is. Before you could call in and order for pick up but they cancelled that given it must have created problems. The staff is friendly. Great place when u want to avoid fast food and pretty good value for what you get."}
{"text":"Delicious! My favourite is the chicken with the grilled eggplant and quinoa and cranberries. Must try"}
{"text":"Excellent quality food with a healthy serving..half chicken with 2 sides is the best value for me.. This restaurant stands out because the sides that they offer changes, giving you more options.   Great choice for health conscious people and a smart choice for a post gym workout meal."}
{"text":"Food is great but the worse service I have ever experienced in Woodbridge.  The ladies in the front have no clue.  Especially the old blond lady. I have to wait 15 minute before they even notice i want to order.  When I try to place an order over the phone they put me on hold and never come back.  I only go here now when I am desperate and have 30 minutes to kill because that's how long it takes to get any kind of service."}
{"text":"This Brazilian/Venezuelan mix on traditional portuguese chicken is a great spin on the otherwise dry less flavorful chicken in the area. They offer chicken 2 ways , on the grill BBQ style or rotisserie. The chicken is marinaded in a tangy blend of olive oil, herbs and lemon juice which is to die for and keeps the chicken moist and tender... The piri piri sauce they serve on the other hand is not the best I've had. I'm not even sure if it's homemade... It has a very distinct resemblance to Tabasco sauce . The sides are great. They have many different dishes that range from cultural classic dishes like bacalao and homemade rice and potatoes to healthy options like Coleslaw and chick peas. They make a mean French fry too.... Best I've had surprisingly . It must be the oil they fry them in because they have an addictive quality to them.... The worst thing about this place is the customer service. There's no organization in the ordering process and don't expect a pleasant hello . They definitely don't have the best people skills but can cook a mean chicken and make you come back to face them again.. Lol... But don't let that discourage you ... The chicken is what matters... Grab and Go!"}
{"text":"Update: Don't even phone this place. No phone manners. Food is good so if u can ignore staff go in and order.  I just don't understand why they have no customer service skills whatsoever. That aspect is extremely disappointing."}
{"text":"I'll definitely agree with my fellow GTA'ers, this place fills the hunger gap for a quick Portuguese Chicken lunch, but it's certainly falling short in a few areas.   Full marks on the plumpness of the chicken, cooked well and not one point was dried out. I especially appreciated how nice the grill taste was on it.  My gripe was with the sauce. Hot sauce was basically your bird dredged in a franks red hot vinegar based hot sauce. Not authentic Portuguese from my experience. Also there appeared to be a lack of piri piri in house.   Potatoes were boiled but not cooked to a perfect crisp in outside. They were tasty but past the surface were a little bland.   Lastly, the spinach Salad was great but the dressing was heavy on the olive oil and made for an unbalanced flavour.   I'd return but not if given a choice between this and my face chi hen joint.   Eatcrest out"}
{"text":"Always great chicken, well seasoned and very tasty!  All the food at the hot table is awesome, you have to try the cod and potatoes but get there early or it's gone."}
{"text":"Exactly what my stars say...it's A-OK.  I'm usually not at this end of town, unless I'm visiting my girlfriend's parents or going to Canada's Wonderland. Normally, her parents' cook but when were lazy we don't have much choice because there's not a lot good food choices other than fast food franchise. Also, it's 5 minutes away.  We've bought take out from this place three times and their BBQ chicken tastes good but nothing spectacular. Chicken isn't dry, the least but it could be better. Price is affordable but I've had better for the price I've paid. Their potatoes are good but how can you go wrong. Rice tastes like rice, nothing special. As to Portuguese cuisine, I've had better elsewhere.  We bought two whole chickens, small potatoes, and rice. The total was about $45.00. We ordered two chickens because one was not enough for four people. It's no Swiss Chalet, but it's to par."}
{"text":"Let me tell you. The 1/2 chicken meal here is bomb diggity. But. The service is absolutely horrendous. The food does make up for it though.  The chicken is charred and grilled to perfection, the meat is SOOO flavorful and has a great smokey flavor to it. The hot sauce works really well with the chicken (I do think it's just Frank's Red Hot Sauce though). The rapini is great, just needs to be cut in half or something, it's so chewy and tough sometimes, needs to be cut. The potato's are okay but the rice is great. The egg tarts are just average tbh.   The service is just so so terrible, and I know I'm not the first to say it. But if your a first time customer, it is confusing where to order, and the front blonde haired lady is so rude, every single time. She doesn't smile or say hi, asks if you've ordered yet in a very hostile tone, like she's always angry. And she is always staring at people, even me in a very rude way, almost like she's trying to convey the message of you not being wanted. Everyone else is nice except her. And I am basing this off of 5-10 occasions which is all the times I came here if not more. The wait is soooo long, even when it isn't busy. Always try to call to place your order over the phone 15-20 mins in advance.   Overall, super yummy food, but don't expect to dine-in, you'd be super uncomfortable."}
{"text":"Food is good but probably the worst service I've had, would rather go and get take out and pollo loco"}
{"text":"Although the chicken and only the chicken is good, everything else is a bit bland, tasteless even, and the hot table is usually a mess. We've visited this location many times due it being near home. But we all agree (the family, friends and even the people we've met waiting in their ridiculous line ups, that they take forever to make your order, and your lucky if your order is correct! The wait is ridiculously long!  Half of the staff seems to be on a permanent break,, those are the same people who have terrible customer service, no hi-hello, even if you call ahead and they tell you it'll be ready in 10 minutes, I promise you will still wait for 20 Minutes amongst other angry, annoyed and hungry  customers! It's the same every time, as much as we hope the next time will be different it never is. Therefore we have all decided to stop returning to this place! There are 3 others within minutes of driving. Not worth the hassle!"}
{"text":"Wow. I cannot believe how unexpectedly delicious this place is. I entered with high hopes and Costa Verde did not disappoint. I hope yelp changes their platform to give half stars because I'm rating this place a 4.5  Here's what I liked: clean interior, modern atmosphere, relatively spacious atmosphere and upbeat music   Here's what I loved: the food. I got the half chicken, rice, macaroni salad. The seasoning on the chicken is addicting. Salty, slightly tangy and smokey. Cooked right and still very juicy. The rice was very flavorful and had a bite to it.   Here's what I didn't like. The rice, despite being delicious, was too salty. It overwhelmed the chicken and created imbalances to a perfectly cooked bird.  The sides were too small and not as filling. I recommend giving a bit more sides to fill up the box or use a smaller box to appear larger.   Bonus, after our meal, the two of us decided to get a couple of Portuguese tart.  The employee was describing it and i blanked out. Next thing I knew, I was walking out with half a dozen. It was the best impulse buy I've ever made. I'm no culinary expert, but if I'd have to describe these tarts, I'd call them the \"crack of culinary\".   Just take my money, you're food is very good."}
{"text":"Interesting, it seems I can't turn the corner in Maple without having a Churrasqueira in my way.  The Churrasco population is definitely on the rise and it seems even some Downtown businesses want part of the Pie(or rather Quarter Chicken).  That's right, Costa Verde's second location is now in the middle of nowhere.  The same place where you'll find me hanging out, NOWHERE.  The Dining space deviates from the usual warm-traditional-portuguese-house setup into a high-end stylish Cafe which reminds me of Aroma Espresso Bar.  In comparison to various Churrasqueiras in the neighbourhood, there seems to be more choices available as Sides(Salads, Parisian Potatoes, Rices, and more) while some Mains(Meats) are sold by weight.  I asked for my usual Lunch portion until I realized 1/4 Chicken is not an option.  Minor setback will make me reconsider this as a Lunch-budget friendly destination.   Grilled Chicken or Rotisserie Chicken is the main attraction while the vast selection they offer as Sides help spice up the deal for more possible return trips.  Octopus Salad is the only side dish not optional for the Meal.  3.5'd  1/2 Grilled Chicken Meal($9.99)  Grilled, chopped into 4 pieces, my Picante Chicken has the usual Portuguese sauce helps keep the Meat moist although it takes away from the crispness of the skin.  Surprising to find Beansprout in the Rice side along with shreds of Chicken and Bellpeppers/Onions.  Although we ate in-house, we were served in disposables. Simply means no tip required and more waste overflow in the tiny trashbin."}
{"text":"Came in at the end of the day. Low on rice. Try to tell me it's a full serving of rice. They charge me full price. Not happy.   I told them to add some potatoes in there if that's all the rice they are going to give me. They refused. And let us know that every other time I was here I have been overserved on the rice. Check out I asked if that gentleman that was checking me out was the owner? He confirmed that yes he was. I let him know he has a unhappy customer. And he said oh well. I let him know that all he had to do was give me some extra potatoes and he would've not got a one star review. He said well did you ask for potatoes? I let him know that yes I did. And he then says well then she should've gave them to you. When he himself admitted that his employee should've gave them to me. What kind of a monkey business is this?  He then tried to tell me that the girl used to work there used to overserved and she is now fired. Which is not of my business and which is none of anybody's business to be honest. But it seems like he got a kick out of insulting his former employee. Which is just bad business ethics. He couldn't even handle my complaint the correct way.   The food is good. Attitude is shitty. The weight is terrible and very long. Very unorganized business. As I said. This is simply a monkey business. But the food is good I will not lie. This is a truce will review. And the only one so they get is for the food being good. They have lost the for other stars due to the terrible customer service and horrible attitude from the owner. Just remember one thing Mr. owner. Your employees look at you and will behave the same way you behave."}
{"text":"Just to update you all, after my last update the owner messages me complaining about my most recent review especially in light of my favorable previous reviews  He proceeds to challenge my assertion on service and asked for more information and then proceeded to block me so I could not respond to him  Quite hilarious and no I still have not and will not go back until there are new owners and fellow yelpers indicate the horrible service has improved.  Dont get me wrong, the spicy grilled chicken is still great, I just refuse to wait almost 30 mins for food I called ahead for only to be told they do not have my order   And yes as my fellow yelpers have noted the hot sauce is basically Franks but there are worse in the area"}
{"text":"Worst service everrrrrr!!! I order my chicken for pick up at 6pm at 3. We arrived at 6 only to be told we had to wait. We've been waiting 30 minutes now and have been put into a line. So now I have guests at my house waiting for dinner as the chicken isn't ready yet!! I've been coming here for years and have always pre-ordered and have recommended the place to others but now that the service sucks I will never come back here again! There are a lot of other Portuguese chicken places out there don't waste your time on this one. Extremely disappointed!!!"}
{"text":"I work in the area and I have always passed by it but never got a chance to try. I've heard a lot of my clients say that it's really good which is why the reviews on Yelp are shocking to me.   My friend and I ordered a half chicken, with rice and two sides. He got the roasted potatoes, and mushrooms, and I had the grilled zucchini and eggplant. We both chose the spicy sauce.   Their chicken is juicy, tender and flavourful. With a lot of churrasquieras I find that the chicken is usually on the drier side, and a little too salty for me. So it was good to see they don't overcook their chicken. The spicy sauce wasn't overbearingly spicy either, so if you like a kick then it should be a good choice. The rice was nice and fluffy and the potatoes were cooked properly.   I didn't have any problems with the service, everyone was polite, nice and happy to be there. We ate it there and didn't see any of the workers be rude to any other customers.   The food didn't take long at all, normal waiting times. I read some of the reviews and how can people complain about waiting 15 minutes for freshly prepared food when the line at McDonalds can take even longer than that?? If you want food to be made fast, eat fast-food.   Overall it's a nicely decorated and clean joint. The food is tasty and fresh and the service is great."}
{"text":"Food is ok for this type of fare...but there are better places out there. This place basically serves BBQ chicken with a bit of sauce thrown on for good measure.  I always ask for extra spicy and it comes as they see fit to serve it to you...I've never had something in the vicinity of spicy at this place. Their \"spicy\" sauce does not have the heat factor of other places in the area or the complex favors in a piri piri sauce.  In house dining was obviously an after thought and really shouldn't be classified as \"dining\". Smoke from the open flamed grills usually make this place a bit smoky and during the summer it is down right hot in the restaurant (even when waiting for food to go)   Food is average...chicken is moist, potatoes pretty bland), rice is good, salads are way overpriced.  In summary....good...not great"}
{"text":"Food is ok. Service is shitty. I was trying to figure out where to order for about 5 minutes. I was not greeted or asked for help."}
{"text":"Found this place by accident walked and saw the chicken and gave it a try. You also get a tons of options for the side. Half chicken meal is filling and at a reasonable price. The chicken is moist and full of flavour. The options are mild, medium,  hot,  and extra spicy.  If you like spicy get extra spicy and spicy, it's a really great combination in flavour.  The service is a little confusing,  you have to go to the grill first to order and the wait times are usually 15 mins so it's best to call ahead.   I'm big on customer service so out of 5 they get a 3 from me. But the food is a 4. Best to come in and try it for yourself.  They have a ton of options for you."}
{"text":"Make sure to call and order ahead if you're taking your food to go, this place is always packed! Great food, fair prices, recommended this place to all my family and friends!"}
{"text":"I have been coming to this place for a couple of years now mostly for their pastel di nata (the Portuguese custard tarts), they're simply amazing and you can't get enough of! On another note, i'm not a super fan of grilled or rotisserie chicken in general, but I do have my cravings every now and then.. The place is fairly small, few tables, but the most traffic is for takeout/pickup.. This restaurant compared to the other Portuguese grilled chicken joints, have most to offer. They have a very large menu aside from the chicken selections, starting from the numerous vegetarian sides that you can add, salads, vegetables, quinoa salads, beans, corns, rice, octopus salad, etc...along with different stews with pork or seafood. They also have a variety of grilled fish (snapper, cod, etc...) and sausages! so that's a good plus for them to stand out among the competition.. the taste is okay, nothing extra ordinary, but great for a quick bite or pickup."}
{"text":"So although the food is still good, the service has gone down hill. Both in regards to customer interaction and in house cleanliness.   All the tables are sticky and gross. The place is filled with smoke. We left smelling like barbecued chicken.   Besides that, the 1/2 chicken with 2 sides for $7.49 is a steal. And good."}
