{"text":"Always fun to find a new Italian restaurant and very reasonably priced. Food was good, nothing special but a good value. Everyone enjoyed the pizza (although there was 1 little piece of basil on the whole margherita) and the kids enjoyed the pasta. Unfortunately, the place wasn't clean - table was sticky and dirty (it needed more than a quick wipe with a damp towel). The floor under our table had crumbs and pieces of food that looked like they had been there a while, attracting hundreds of ants (no exaggeration). We were already halfway thru the meal so didn't point out to upset the group, but it was bad. I also wish someone had pointed out the pasta machine - the kids might have liked it but we didn't see it sitting up front. Weren't told about any specials or asked if we wanted bread. It was nice to be able to get a glass of wine. If it wasn't for the cleanliness issue, we would have gone back."}
{"text":"Stood in line for a few minutes, but it was SO worth it. First time to Cibo this evening. Everything on the menu is homemade and fresh. The pasta was actually coming out of the machine as we stood there and we watched ours get cooked. Our plates included Cavatelli with pesto, marinara, and arrabbiata sauces. The pasta was perfectly cooked and the sauces were delicious. In fact, the sauces were being prepared as we waited. Things are simple here -- as they should be. Great fresh ingredients, time-honored recipes, and skilled hands putting it all together. We will definitely be back and bring our friends that appreciate great food."}
{"text":"What a great find!  Fantastic family run Italian \"Chipotle\"....you pick your pasta, sauce and ingredients and they make you a delicious plate of pasta while you wait.  They also have other Italian dishes that vary...eggplant parm, pizza, etc.  Serve wine and beer too.  New store with a nice decor.  Not sure why this place wasn't more crowded but it should be.  Family run and friendly service.  Go...you won't be disappointed!"}
{"text":"By far the best restaurant in town! Amazing food, even better service and a warm and welcoming atmosphere. The pasta is to die for! I am addicted to the whole wheat pasta with marinara and eggplant on top. Highly recommended!"}
{"text":"Good food, but lacking service.  It took 20 minutes to get water, it was loud, even paying took forever.  To the restaurants credit it was pretty busy."}
{"text":"Everything here is good.  Homemade pasta is fantastic.  Pizzas are amazing.  Nice simple menu.  Family owned and operated.  Lovely people. The only problem is this:  all of the table surfaces are sticky.  Not sticky enough that I'll stop coming, but enough to make it slightly less enjoyable."}
{"text":"Delicious pizza. I've been there twice with some co-workers and both times everyone has commented how their pizza was perfect. I'll definitely add it to my regular rotation when I'm in town."}
{"text":"This is the best restaurant I have ever been to from the drinks good and scenery it is great for families or just yourself I heart it."}
{"text":"One of the best family restaurants in the Chagrin area. The food is amazing , the service is fantastic and it is an all around great place . Trust me: the pizza is so good here ! Perfectly wood fired and thin crusted- love it."}
{"text":"Best local Italian spot around.   The menu is simple but delicious.   Cavatelli with your choice of sauce, various pizzas and a few salad options. Very kid friendly.    The pizzas are thin crust and amazing.   And we love the Cavatelli with meat sauce and the pesto sauces are wonderful."}
{"text":"Love this place! Been going there ever since it opened. Wonderful family owns and runs it. My kids consider going there a real treat!"}
{"text":"They don't take the check in offer and the owner said she isn't associated with Yelp at all. Very strange reaction and not sure what to make of it."}
{"text":"Pizza and pasta excellant. Service too. Great value. As good as any pizza and pasta you'll get anywhere. Very casual atmosphere. Great for anyone including families. Need more places like this."}
{"text":"Food was just ok. Not much flavor. Requested salt and grated Parmesan and they never showed up. Service was below ok. We were seated outside after it rained. The furniture was covered in bird poo and everything was wet. We had to rearrange chairs and request napkins multiple times. The young girl brought out a wet towel to wipe off the wet table and wet chairs. Probably not headed back anytime soon."}
{"text":"Oh my gosh the best sauce ever! Homemade pasta made right there in front of you, doesn't get much better than that. We had the eggplant Parm, chicken Alfredo and cavatelli's all were delicious. Cute patio too."}
{"text":"Been coming to Cibo for years! AMAZING food, especially the eggplant and homemade cavatelli. Good value and big portions.  Not sure what \"Lincoln G\" is talking about with the check in offer - \"not sure what to make of it?\" I don't believe that every restaurant has to utilize Yelp/Groupon offers?"}
{"text":"We were visiting our daughter who lives in Chagrin Falls and were looking for a casual Italian close by. Based on the yelp reviews we selected Cibo. What a great choice. It was a Saturday evening and we called ahead and were told that coming after 8 things would open up. We arrived right around 8 and had about a 5 minute wait. The restaurant is small and while they have outdoor tables it was raining so the restaurant itself was full. Cibo specializes in fresh homemade pasta, (cavatelli is the only pasta they serve). A variety of sauces as well as several add ones, meatballs, ground Italian sausage, grilled chicken and vegetables are offered. In addition to the pasta Cibo serves about 10 different thin crust pizzas. My wife and I shared a pasta with marinara sauce and a tomato, mozzarella, Italian sausage pizza and a bottle of their house Sangiovese. The pasta was wonderful, very fresh with a light tasty marinara sauce, and a large delicious meatball. The pizza was also very good, light, crisp, flavorful not greasy. The wine was better than what I expected for $20. The wait staff Saturday consisted of 3 of the 5 daughters of the owners. They were attentive and very helpful in describing the menu to us first timers. All in all an excellent experience and we will certainly go back when we are in Chagrin again."}
{"text":"With 4 1/2 stars, I expected this place to be really great. However, my family and I went and were a little disappointed. They only make one type of pasta that you can order with the various sauces they have, and they also have pizzas. I think maybe we should have ordered the pizza because the pasta was only so-so; we tried both the regular and the whole wheat. I had the pesto-Alfredo sauce and it was pretty good, although I don't think I'd order it again. Other family members ordered the meat sauce and red pepper red sauce, and the sauce seemed pretty watery. They were underwhelmed. For appetizers, we ordered bruschetta (which was really good actually. It came with 4 pieces for $5 though) and the antipasto meat, olive and cheese platter (very overpriced- $10 for a few pieces of provolone and Parmesan, salami and prosciutto, and some kalamata olives).  Our server didn't seem very happy to be there, and actually never came back after we requested more bread and water refills. We had to ask someone else to serve us.   Overall, we wouldn't come back. But the bruschetta was pretty darn delicious."}
{"text":"AMAZING homemade pasta! Family owned & run which makes it very comfortable and pleasant. Highly recommend!!! If you are a pizza/pasta fan then definitely check it out. I will definitely be returning to try the pizza next time! Love that you can carry out and dine-in. Very comfortable and good sized place in a convenient plaza in Chagrin! Love love love the food and the atmosphere."}
{"text":"My husband and I go once a week. He gets pasta and I get the salad with chicken. Have also had the pizza and cannoli, both are excellent as is their whole wheat  pasta. You can watch the pasta machine cranking out the fresh dough. The family that owns the restaurant are delightful. There are a bunch of daughters (5?) who all waitress. They are always friendly as are mom and dad."}
{"text":"My friends Shefali and Sumeet took us there when we were visiting them over thanksgiving. The place was bustling with merriment and we were glad we had made reservations. This is a family owned restaurant and every task in kitchen from prep, to cooking, serving and cleaning is done by the family. The pasta and pizzas are wonderful; such fluffy, light weight, flavorful, packed with a punch of aroma. One single person can finish off the pizza. The owners do come and check on their guests. It never felt like that we were in a restaurant. It felt as if that they have let open the doors to their dining room and we were part of their home. The owner Tony came by to check on us twice and this time offered the nutella pizza. Oooo!! We were all stuffed and were amazed. The food goes really well with Wine and they do have some very good ones to offer.  Overall an amazing experience and cant wait to visit my friends again and enjoy the food."}
{"text":"Family friendly, tasty, great price point!  Family dinner on a Tuesday.  We tried marinara, pesto and Alfredo.  All were winners.  Attractive small space.  Love that this is one of our neighborhood places.   We will rerun for both dine in and carry out.  Enjoy it both ways."}
{"text":"Really good Italian food. Pizza, pasta and eggplant dishes are outstanding. Very casual and friendly atmosphere!!"}
{"text":"First time visitors and will definitely be back. Great pasta great Pesto great price great service"}
{"text":"A fresh pasta bar owned and run by a family local to the area, Cibo offers an interesting concept in serving up Italian food in an area where 4 Italian-themed restaurants compete within a 200-foot radius.  First off, and most importantly, the food quality is good, tasty, and delicious, full of rich Italian flavors (garlic, marinara, oregano, basil, etc.) - simple yet genuine.  The fresh pasta bar concept?   Now this is a real treat for someone looking for a change from the usual laundry list of menu items copy-catted at virtually every restaurant with an Italian-sounding name.  Sorta akin to a Chipotle or Subway, patrons order their meal at the counter working from one end a short distance to the cashier.  Except instead of choosing what type of foot-long bread or what meat gets plopped on your tortilla, at Cibo you start by choosing which type of pasta (cavetelli or whole wheat cavetelli made fresh on site, then cooked in front of you).  Then you choose one of the 10 sauces available (i.e. marinara, arrabbiata, aglio olio, alfredo, pesto, vongole, vulcano, etc.), the topping (meatball, grilled chicken, veggies, etc.), and then the extras (i.e. Romano cheese, extra cheese, side salad, etc.)    Each stage is priced separately so you can add as little or as much as you want.  For example, I had the cavetelli pasta w/ arribiata sauce ($4.95) plus a meatball ($2.00) plus cheese ($0.50) and a fountain drink ($1.55) for a total of $9.00.  My wife partook of one of the day's special - chicken parmesan w/ pasta (she chose the cavetelli as well but opted for the aglio olio sauce full of roasted garlic) for $8.95 plus parmesan cheese ($0.50) and drink ($1.55) for a total of $11.00 for her.  (BTW, eggplant was the other special of the day.)  Yes, pricier per-person than the aforementioned Chipotle and Subway but remember: this isn't fast food.  Plate the same meals up on a fancy charger atop red plaid linen with a candle mounted in a Chianti bottle nearby and you'll easily be spending $16 - $22 per-person for the same fare.  Cibo also offers subs and catering and the TV is tuned to Italian programming.   Next time you're near Rte 306 & Washington Street (old 422) and hankering for simple yet true Italian flavor, fresh and quick, Cibo is the excellent choice."}
{"text":"It's really fun to watch the pasta machine in action as it shoots out the little noodles. I could watch this all day. We visited on a recent friday night and it was not terribly busy. The family behind the counter is friendly and efficient. The menu is simple but confusing; we had to ask about a few items as we weren't sure what they were.  I had the creamy pesto pasta - after you order, sauce is sauteed with the noodles for a few mintues before serving. The basil pesto was creamy and delicious. My friend got the marinara with a huge tender meatball, so good. I just wish the sauce was a littel thicker so it stuck to the noodles a bit more."}
{"text":"Amazing, authentic Italian food. Imagine the best pasta bar you can, with the addition of giant meatballs, subs, eggplant/chicken parm, and more. You might miss it driving by, so be sure to pop in! Great prices for great food."}
{"text":"Great family run pizza and pasta place! I'm from Rhode Island which is home to some of the best pizza and pasta, Cibo fits right in. Was pleasantly surprised how good the food was. Its a small spot in a strip mall in Chagrin Falls. Pasta is made fresh daily and they offer wheat! They specialize in Pizza Napoletana which is cooked special in their over and it's amazing! We always get the meatball appetizer too because it is awesome! I also like the Jessica salad. They also offer great s'mores dessert pizza .  The marinara must be a family recipe and it is one of a kind, real good! I actually stop in during the week and take it home for our own pasta dinners.  Most of the girls working there are sisters and family, which makes for a friendly staff. It is very clean establishment and they offer outdoor seating. I recommend giving it a try, you won't be disappointed. However, check the hours because they are limited to evenings and closed Mondays/Sundays"}
{"text":"So easy, so comfortabe, so affordable, so good.  Meatball app, wood fired pizza and a bottle of wine made my evening."}
{"text":"Pasta and cannolis were phenomenal. Cappuccinos were the highlight of our night! Great food. Great place. Great family."}
{"text":"This meal was amazing!  I had the marinara with a touch of alfredo! The pasta was perfectly done, the sauce was amazing!  I also had bruschetta and the caprese salad!  I am definitely going back!  If you are in the area you must give this eatery a try!  Bravissimo!  Well done!"}
{"text":"This is a small gem that everyone should try. The homemade pasta is delicious and cooked perfect.  The sauce was light and flavorful as was the meatball. Service was fabulous and server was helpful and attentive.  I can't wait to go back and try the pizza."}
{"text":"Amazing and wonderful Italian food!! Homemade noodles and sauce. A great find!"}
{"text":"We love cibos!  Freshly made pizza and pasta, what more could you ask for.  I love their salad with chicken and a side of sauce, sounds wired but so yummy.  Great place to rise the kids."}
{"text":"Fantastic food!  Meatballs the best restaurant meat balls around.  Pizza not to-go, but leftovers are FANTASTIC day 2 straight out of the fridge!"}
{"text":"Homemade pasta, homemade sauce are both very good.  I always get the wheat cavatelli with arrabiata sauce and ground Italian sausage and add my own parmegiana cheese at home.   The arrabiata is spicy and delicious.  My wife lives their volcano sauce which is, ironically, not spicy."}
{"text":"We have visited many times when we're out in the Chagrin area. We love the fresh, fast pasta. The sauce is to die for! They are always friendly, helpful and the meals are priced reasonably. You can't go wrong stopping in for a meal!"}
{"text":"This was a great find!!! I was driving by a d hungry so I stopped in. The cavatelli is homemade and delicious! It looks a little different from cavatelli I've had in the past - regardless it was delicious and the meat sauce was awesome!!!  I can't wait to go back and try some of the other sauce options. They also have specials - it was eggplant parm when I went however I did not try it. Casual yet nice environment and they serve alcohol!!!"}
{"text":"Pasta itself was good, Alfredo sauce was nice and rich and stuck to the chewy noodles. Wife's whole wheat pasta was equally good with a red sauce, ( marinara?)a little thin for her liking but overall good. Kid shared ours- we have stopped eating meat so both entrees did not have meat added. We got an order of bread on the side; 4 pieces of crusty bread for $1. No butter, oil and vinegar or sauce otherwise. No big deal if it is included with the meal but I expected more if it was additional. Wife and I had soft drinks and kiddo had a chocolate milk. Wife and I each had a side salad that was not worth the money. Good salad dressing, however. Service was spotty; no refills on soft drinks, had to get up to pay and wait while money handler was on phone with to go orders.  Concept was a little confusing. Is it a chipotle style of restaurant where you order and then go sit down? Was it a service restaurant where they serve you, or was it a French style café where you order, get served and then get up again to pay? It seemed to be a little of all of the above. Anyway, the pasta was good but everything else was not worth going back when price was factored in  Whole tab: $34 plus tip. I hate to say it, but Olive Garden would've been about the same money with the salad thrown in and endless breadsticks and soft drink refills. And Olive Garden is gave me food poisoning once..."}
{"text":"Traveling across the country and found this on yelp.  So glad we stopped!!. Cute place, fabulous food, speedy service. A must see."}
{"text":"Best Italian place in the area!! Great pizza! Love the eggplant over whole wheat pasta and the simple but wonderful arugula salad"}
