{"text":"There was a hair in my soft taco. Did not finish my meal and was only comped for one taco , as opposed to being comped for whole meal."}
{"text":"The food was below average and very limited options. There was no meaningful desert and lot of treys were empty. Will never revisit again."}
{"text":"Great food and great service!  7 of us arrived at Cinco de Mayo 20 minutes before they closed on Sunday evening.  The staff on hand was extremely welcoming and friendly.  Food was great and plentiful.  I had fish tacos which were delicious.  Couldn't ask for more!"}
{"text":"Wow this place is delicious.  From southwest US and didn't expect this type of real Mexican food in the east!!!"}
{"text":"Service was poor and food was mediocre.  In nachos definitely got more veggies than meet.  Service is what makes me give two stars."}
{"text":"This time I tried \"Mole Poblano\", unfortunately the chicken was undercook. They reheated the dish but it was not what expected, in general flavorless. IMO The service is good but the food not so good."}
{"text":"Quaint little spot tucked away in an unlikely shopping center behind a gas station. Very nicely decorated, clean and great service. The staff is very friendly and attentive. I highly recommend the shrimp burrito, and sopa de pollo!"}
{"text":"Food was good, asked my wife she gave 7 or 8/10. Service was also good. We had reservation for 8 and we were seated in cozy booth once we got there. Overall everything was good, except don't get regular margaritas, coz it had less alcohol and tasted like juice for me."}
{"text":"Really good food. We got the lunch buffet and there was at least one thing that everyone loved, even the kids.  Would definitely recommend.  Definitely get the cinnamon chips for dessert. Yum!"}
{"text":"We went a few times around lunchtime. Food is good. Better than most Mexican restaurants. Service was good too. Definitely go back."}
{"text":"Ordered the chicken fajitas..vegetables were still raw on the plate, meat had little flavor. Service rather slow and unorganized."}
{"text":"This is a very good place for dinner .. just stumbled on this restaurant when passed by concord mills.. their queso cheese dip was delicious, fresh chips, had their queso pollo dish and supreme burrito and their tacos. Everything was excellent.. will definitely make it our New Mexican place.."}
{"text":"Absolutely love this place. Food is great, service is friendly and the prices are excellent. I've had just just about everything on the menu and all were fantastic.

Drinks are excellent too and they make a great Mojito too!"}
{"text":"It's Mexican.  It's American.  

I'm not doing a Fandango on the table, but I'm not complaining either.  The food and service is what you've come to expect from a Mexican restaurant in the Carolinas.

I tried a few different dishes.  They're on par with the dishes at restaurants of the like.  It's worth a try."}
{"text":"Excellent Mexican food and service during our trip. I see some of the reviews are from one extreme to another. Food was as authentic as you can get and we will be coming back when in the area."}
{"text":"Delicious food. Interesting vegetarian options. Good cheese dip. Not \"great\" service but it's worth it."}
{"text":"This place is great!!!! The service was perfect and the food was amazing. Lots of flavor and lots of choices. You will not be disappointed!! We eat at a lot of Mexican restaurants and this is one of the best. You must visit Cinco DE mayo when in Concord!"}
{"text":"Fastastico, my husband has ate here many times at lunch and told me how great it was, well it is. Cheese dip galore. The buffet has many authentic Mexican dishes besides your normal Mexican cuisine. Worth a try."}
{"text":"Wow!  Go here. Really. Fajita plate is biggest I have ever seen. Very good food, and a great value for the price. Much better food, and more of it, than you get at a chain. Better atmosphere, too!  Great service. No complaints. We'll be back!"}
{"text":"Service was great. Food was a little bland. I am vegetarian and really appreciated the vegetable fijata."}
{"text":"Stopped by on a Friday evening for dinner with my boyfriend and we were ready for some margaritas! We were seated right away and restaurant was quiet. There wasn't a drink menu on the table so we asked for one, however our server told us they didn't have one. I thought that was a little strange, no drink menu? So we just ordered a regular margaritas... and they tasted more like sour mix (sad face). 
I ordered chicken fajitas and they came with rice and beans. They were sizzling and delicious! I think I made four fajitas, so much chicken, peppers and onions. 
Service was great and quick!"}
{"text":"We've been searching for good food and we found it AND it didn't break the bank.we had a variety of foods, between four of us. Real ground meat. Real chicken. Real steak. Margaritas aren't bad either. The chips and salsa to start was a great treat too. We had a good server too, she didn't try to make sweet tails or talk up the menu. She gave us time to decide and took orders (tada!) we will return, it really was great food!"}
{"text":"When I ordered the Chef's Burrito and it said 14\", I thought it was a joke.  When it showed up on the plate, I'm pretty sure it was closer to a 20 incher!  This thing was jam packed with chicken, rice, beans, lettuce, salsa, cheese, and sour cream.  The chips and salsa to start were as good as any I've had.  The queso was was solid, not spicy, but tremendous when mixed with the salsa.

If you're looking for a low key spot that lacks the commercial setting of an On the Boarder or the like, then this is your place."}
{"text":"This is one of the best restaurants!  The dinner service was fast and friendly.  The food is excellent!  Prices were in line with other restaurants.  We really enjoyed the atmosphere which is intimate and comfortable.  Our conversations were in a normal tone of voice and not having to yell over twenty five other tables.  We will definitely be frequenting this hidden treasure."}
{"text":"Food was delicious and reasonably priced. I had tacos and the Texas dip, I would definitely go back. The only reason I gave it 4 stars because the server could have been a little nicer."}
{"text":"By far my favorite Mexican restaurant in the Charlotte area! Service is great and food is phenomenal!"}
{"text":"No complaints with the food or service here. The pile of veggies I got with the veg fajitas borderlined ridiculous, but they were so fresh and tasty I somehow managed to eat the entire skillet.

Husband's tilapia/scallops/shrimp dish wasn't as healthy as he hoped. The bacon and butter sauce wasn't listed in the description. Regardless of the calories, the flavor and preparation were great. The scallops were tiny, but there was a lot of seafood on the plate for $12. 

The service was significantly above average. We never went without drinks and special requests were accommodated quickly."}
{"text":"Why this place gets a 3 is because I give it a 2 and the hubs gives this place a 4. Honestly, i hated my dish (some enchiladas) but the hubs' Pollo Ranchero was good.

I liked their salsa and the quick service.

Another thing to mention- i had a sneeze-attack as soon as I got seated. Not sure what the reason was but it could be because of the strong smell of salsa. Anybody else experienced this?"}
{"text":"This place is horrible. The buffet is not fresh and the food is cold. I was pushed by a waitress who clearly doesn't speak English as she was very rude. I'm surprised the health department hasn't shut this place down."}
{"text":"Traditional Mexican restaurant BUT VERY GOOD!  Lots of unique menu choices, lots of vegetarian items, too.  FRIENDLY staff, very clean."}
{"text":"This is a pretty solid Mexican restaurant. The chips were warm and fresh. The salsa had a nice cilantro flavor. I got a chicken burrito and a chicken quesadilla. The burrito was good and the quesadilla was great! The cheese dip was good, large large portion of it $6. Solid 4/4.5!"}
{"text":"I went there for the first time and the guacamole is excellent.  I recommend a large order.  Loved the enchiladas!"}
{"text":"My family just dined here for the first time based on the reviews we saw on Yelp. The decor is so-so, maybe throwing a little too much Mexican flair in your face, but don't let that deter you from an otherwise amazing experience. As soon as we sat down we received some chips and salsa. Our waiter was very attentive and constantly stopped by our table to see if we needed anything else. We got the 99 cents draft beers (how can you not) and a white cheese queso as an appetizer. The queso was excellent and probably one of the best white cheese quesos we have ever had. I only wish the chips were a bit better since we had a lot of small crumbs, but our waiter brought us more refills whenever we needed. I ordered the Burrito Californio with steak and it was very good. The meat was plenty and seasoned very well. The cheese was just right and one of the better burritos I have had in a long time. The rest of their family enjoyed their meals very much as well and the food was very reasonably priced. This place definitely hits the spot for good Mexican food and doesn't break the bank for a family night out."}
{"text":"Now, THAT'S a burrito!!
Good food and quick service. 
I had enchiladas which were great and he had a burrito the size of his head. We will be back for sure. 
I didn't get one myself, but saw someone with a margarita. The glass was huge like a fishbowl. Next time!"}
{"text":"We love Mexican food so we decided to visit on Saturday. I ordered the fajitas cinco de Mayo and My Love ordered the Fajitas Texanas. Both dishes were equally delicious and fresh. I loved the small salad that came with my meal. Their horchata isn't bad either. We've had better, but theirs was good...could've used a little more spice. Overall, we enjoyed our meal and would definitely come back again."}
{"text":"The food was great. It wasn't to salty like other Mexican restaurants. When I come back into town, I will definitely come back."}
{"text":"This was a step up from the typical American Mexican food.  I had the shrimp and scallop fajitas.  Very good (not overcooked). 

Service was great as well."}
{"text":"Great carnitas! Very tender, crispy char on the outside but juicy inside. I asked for their salsa verde to go with it and my nose was running and mouth was burning! What a great meal. Dos Equis on draft helped cool it down."}
{"text":"Wow - not sure where these good reviews came from. I guess if you like greasy cheese covered in greasy cheese, then this is your place! We're regulars at three amigos which has great food, but I was looking for some good chile rellenos.  This is definitely the worst Mexican restaurant I've ever been to.  From walking into the overwhelming smell of cleaning products, to bland salsa, and greasy everything - along with terrible service, we certainly wouldn't recommend this place."}
{"text":"Very strange dinner. Three of us ordered I was the only one that got a drink from the bar. Let me try and be fair since I will not be going back. 

\"A\" at station 5 was our waitress or what ever. Inattentive and slow but a nice young lady.  Here is the order:

Small cheese dip - very small but good
Sweet Tea - acceptable
Virgin Margarita for the teen - liked it
Thursday medium Margarita for me - looked good but they forgot the tequila or so it tasted. All mix no booze
Burrito Chipotle - ok
Burrito Dos Amigos - less than ok
Enchiladas Supremas  - ok

$47.00 that would have been better spent at Taco  Bell

Then there is the picante. Couldn't eat it way to salty. Told \"A\" about that and was told that a lot of people say that. 

Take a hint!!!!!!!!!!!!!!

Slow to get refills on tea, slow to get check and slow bringing back the check. 

So I tried to be nice and I hope I was but this was my first and last time. The strange thing is that the wife and some of her friends eat lunch there and like it. The wife was even surprised with the difference between the noon meal and an early supper"}
{"text":"Well I am new to Charlotte and went here after seeing the reviews thinking it had to be atleast fairly good. But as much as I tried to like it I really really didnt.

I had the nachos supreme- with no jalapeños and with beef. First off- it came out looking like a mess- but that's okay it's the taste that matters! I think the real issue here was the cheese. It was hard to explain. Because I would say it looked and had the consistency of cheese wiz from a can but I could also clearly see some was actual shredded and sprinkled. But it was liquid like- it didn't pull like cheese. I hope this makes sense. It was also really bland. The only good part was the guac which I asked for.

I also got a sex on the beach- no ice or anything wasn't even cold. So, unfortunately I won't be back. But I'm uploading a photo just so people don't think I'm a liar lol"}
{"text":"Disgusting. The food was just ok, the service was abysmal. I ended up getting gum on my pants and the owner came over and said \"sorry, happens all the time.\"  She didn't comp our meal or offer anything other than ice. When I tried to clean my pants she berated me telling me I'm doing it incorrectly and that she wasn't paying for my pants even though I never asked her to do that. If you eat here check underneath your table for gum."}
{"text":"Best. Fish. Tacos. Ever!! Ask them for some of their homemade hot sauce, it's very hot and truly amazing! We stop here every time we're passing through Concord."}
{"text":"I really love this place. It feels like it's much more authentic Mexican food then some of the other places around. The wait staff is very friendly the décor is quite nice. I usually get the fajitas and that is more than enough to fill me up. The specialty drinks are also quite awesome."}
{"text":"I just ate there with a group of 9, including 2 children. Everyone was very pleased with their food and the prices were great!"}
{"text":"No Bueno. Our service was terrible for a multitude of reasons. It took way too long to be greeted. When we were, we got our drinks quickly. Fast forward to an hour later when we still did NOT have our food we ordered!! Yes I said an hour!! We were told that the ticket machine ran out of paper and our order didn't print. Strangely, our table was the only table this happened to. Everyone seated around us came and ate and left. Part of our party actually got up and left too because the wait and the excuses were so bad. Two of us stayed and tried to see it through. Well....the food came out after the manager apologized and to make things worse, an order was wrong. The manager offered nothing but an apology. Never, never, never going back!! Adios cinco de mayo!"}
{"text":"The service is not very good. They are nice, but very slow. Guacamole and the cheese dip were very good and huge. But we went on a Sunday for the $3.50 Sangria special and were told they were out. I tried to bargain to see if they could replace the sangria special with a margarita special and they said \"No, we don't do that\". I almost gave them 2 stars because of that, but the food is good."}
{"text":"The tacos here are seriously amazing.  The carnitas are my favorite, but the al pastor is good too. The meat is incredibly tender. Definitely coming back next time I'm in the area."}
{"text":"Always fresh, always exceptional food. Wait staff is friendly and fun.  Value is terrific. We have been eating here for years and we never walk away with a complaint. Their sauces and spicing is spot in for North Americanized Mexican foods. We love the way they work with your order and the portion sizes are massive. Chips and salsa are super fresh. Drinks are made big and to order and because they are so busy always, everything is always amazingly fresh."}
{"text":"I know you have heard this before \"Finally a decent Mexican Restaurant!\" We have been fooled by this review tease so many times. But our dedication has paid off and we have a gem in Cinco De Mayo Mexican Grill in Concord. 

By far the best Mexican food we have had in the Carolina's. Five stars for covering all the key criteria for a great dining experience. 

Awesome service - Evelyn, our server,  is talented, fast, and super friendly. 

Great salsa, guac, and chips (served warm)

Great margarita's

Very reasonable prices

Nice atmosphere, clean and comfortable 

Excellent food - steak burrito, fluatas, & tacos. Fresh quality ingredients, perfect seasoning, great taste. 

We live un Fort Mill and were in the area shopping. We will definitely make a point of returning. It is worth the drive."}
{"text":"Our favorite Mexican restaurant!!! Great vegetarian fajitas, chicken soup. My food is always hot and delicious, generous portions. There has never been a wait. Just walk in and get seated right away. I hate buffets but if that's your thing, they have that too every day until 3:00. Daily drink specials. Can't get enough of this place."}
{"text":"While staying in Concord to visit the Speedway, we stopped in for dinner. As we were staying at a hotel just down the street, it was convenient for us, because we didn't know our way around and it was simple to find, even though it is located in a shopping center. 

I love mole poblano, and not every \"American\" Mexican restaurant serves it. In fact, few do. Cinco de Mayo does serve it, and the mole sauce is excellent. It is one of the best moles I have ever eaten. Chips were hot and fresh, salsa was mild but very flavorful. Mom loved her chimi, too.

Service was attentive and efficient, not at all \"hover-ish\". We were there on a Saturday night and although the place was busy, everyone seemed to be well-fed and enjoying themselves. Nobody looked as if they were waiting overly long for food or drink refills. We sure weren't.

An excellent meal at a very reasonable price. If we're ever in the neighborhood again, we'll definitely stop by!"}
{"text":"Came for a quick lunch and was pleasantly surprised with how quick & friendly the service was!  They were getting busy for lunch but our waiter was in top of it. All 3 entrees came out fresh & delicious!  Margaritas were yummy! I would definitely come back. Next time maybe I will try the buffet- looked like a good variety!"}
{"text":"This place is really good. My wife and I discovered it on a rainy lunch break and have been back twice now. 

Everything we have had is excellent, including the cheese dip with fresh jalapeños to give it some flavor."}
{"text":"Pretty decent Mexican joint tucked back in a little strip mall.   Good drink specials and TV's playing football.  No complaints.  We want to try the lunch buffet some time...."}
{"text":"This was once my favorite Mexican restaurant 
However, things have changed. We were the only ones in the restaurant and I had to find the waitress to seat us. She left us for twenty minutes to take our order. The music was blasting and the temperature was high. My daughter found chicken bones in a BONELESS CHICKEN MEAL. 

The rating was once high but dropped to a 94

I won't be back."}
{"text":"This is our go-to Mexican restaurant in the Concord vicinity.

Chips and salsa are great, but if you ask they will bring out different salsas - we've gotten a hotter chipotle salsa and an avocado salsa.

Portions tend to be huge.  I've had their fajitas texanos and their street taco's - both were terrific.

If you like shrimp and spicy HOT, I recommend their camarones ala diabla - shrimp in fiery hot chipotle sauce.  It brings tears to my eyes, but it is soooo good.

Update May 23, 2016:

It appears there has been a change of ownership and changes to the menu as well, all for the worse.  Fish / shrimp tacos are now breaded, and a request for grilled shrimp tacos yielded shrimp that looked like they were sauteed in butter, not Mexican style in any way.  Fajitas for two had only eight tiny shrimp.  Disappointing."}
{"text":"This is an average Mexican restaurant . This place isn't really worth visting. The staff seemed very un organized as I had three sets of people as me back to back what I wanted to drink. I ordered the vegetarian burrito the food was bland barely warm. The chips and salsa were decent . Skip this place and try another recommended Mexican restaurant on my list."}
{"text":"Last minute later dinner turned out to be a fabulous idea. It was just me my oldest daughter and my 2 month little girl. She ordered the rice with cheese and chicken I can't remember the exact name but she said it was delicious! I ordered the taco salad with shredded chicken and also the tortilla soup. I was starving when we got there and thought it was a little cup if soup- WRONG! This was a dinner plate size bowl of soup! And soooo yummy! The avocados in it were so fresh as was the pico. 
My salad was also good and I brought home my leftovers which to my surprise were just as delicious the next day.  Would definitely recommend going here for some great Mexican food!!
Prices I have to say could be a little cheaper for the dinner crowd ( I see they do have specials for lunch though) but for good food and huge portions I can justify spending a little more though I know Mexican food isn't expensive at all to make!"}
{"text":"Came here last week. The food was really good and they serve you plenty of it. That's always a plus. When we first arrived, we moved to 3 different tables because of different issues. But I didn't let that ruin my time there because I came for the food lol. Again all of our food was really good and you can tell it's a real authentic Mexican restaurant, not a typical chain restaurant. 

All in all great food"}
{"text":"Food was good. They have good chicken and steak fajitas. I did not like the chips much. It tasted old to me. Over all great place to eat"}
{"text":"I've had lunch here a few times, and so far, so good. The food is pretty standard, nothing that blows you away, but the service makes up for it. We had a group of 8-10 that only had an hour for lunch, and the waitstaff made sure we were done with time to spare!"}
{"text":"Went here for taco Tuesday since they have $0.75 tacos. The meat quality was high and they did NOT skimp out on the amount the provide for the price. These tacos are on the smaller side but I ate 6 of them and was extremely stuffed (I usually eat enough food for a person and a half).

I would highly recommend this place ESPECIALLY for taco Tuesday!"}
{"text":"This Mex restaurant is tucked away in a corner of a dark parking lot. The inside is nicely decorated with clay tiled comfortable booths I had the arroz and pollo and it was delicious. See my picture. I added a $4.25 margarita. It was a nice size with a good mix of alcohol and flavor. The staff was friendly and good.  I'd stop here again if in the area."}
{"text":"I thought I'd update this review since it's been three years and we have been repeat customers over the years!  I'm pretty sure management or ownership has changed within this time because we have noticed differences.  A lot of the familiar face servers are gone, and there's a ton of new faces.

We are still huge fans of the fajitas, and that's what we get when we visit here.  The price for fajitas for two is still $18, three years later, and tasty.  Lately they have been even fresher tasting and enjoyable!  The charro beans are absolutely delicious!  We get those instead of refried every time.  You won't be disappointed if you want to try something different!

They have HUGE beers...woah.  My husband got a 32oz Dos Equis Amber for $6.50 and couldn't finish it.  Yum!"}
{"text":"I absolutely love this place! The environment is nothing special, but the tacos al pastor are to die for! The salsa is fresh and prices are cheap. They have great drink specials too. This is my go to place when I'm in the area for lunch or dinner!"}
{"text":"Cinco de Mayo offers fresh, tasty, affordable Mexican food and good service, all in a location that is (literally) a two-minute drive from Great Wolf Lodge. My favorite is the Burrito Loco in the Vegetarian Entree section -- fresh zucchini, summer squash, mushrooms, and onions in a large burrito with a creamy ranchero sauce. Yum! Dinner for my husband, son, and I came to $35 before tip and we were all full. We'll make this our dinner stop on every GWL weekend."}
{"text":"Found a new-to-us Mexican spot in Concord and loved it! They have about 10 different fajita variations and that makes me happy. Like super duper fajita happy. 

I had the Fajita Mexicana with beef, chorizo sausage, jalapeños, dried chili peppers, mushrooms, bell peppers, and onion. 

My better half had the pork carnitas and it was equally delicious with what looked and tasted like pork three ways. 

The service was prompt and with a smile. We'll definitely come back!"}
{"text":"Hey Urverybody.

You want the mexicos? You come to this place, capiche? 

I haven't been impressed with a mexican joint in a long while. Doesn't mean they aren't good, just means theyre all as good as the ones next door.

Not Cinco de Mayo.

Atmosphere and service are okay. Nothing bad, nothing really good. They're fine. But the food is some of the highest quality and freshest Ive had, the prices are crazy good. 

Go here. 
Drink a margarita, theyre amazing. 
Order a chipotle burrito.
They put real chipotle peppers in it."}
{"text":"Really good deal on the lunch buffet!
And the food was very good too. 
 I'll most defiantly be back!"}
{"text":"What can I say about this place?!  I have been coming here for years.  The atmosphere is not fancy but if you can get past that, it's well worth it!  Staff is friendly and efficient.  0.75 Taco Tuesdays are awesome and very authentic \"Street Tacos!\"  The regular menu is great as well!  There are always lunch specials that are rarely over 5.00!  Check it out!!"}
{"text":"Had the dinner special for two.  The service was good.  Large portion.  There is a huge menu with lots of options.  Would return here again on my next visit.  It's worth stopping in."}
{"text":"Excellent find!   We have been on the hunt for generous reasonably priced Mexican food and we hit the JACKPOT!!!!  

The hubby and I ordered the shrimp  fajitas for two only 19.75 and the amount of shrimp n veggies were INSANE! We also each received our own side plate of deliciously seasoned refried beans; very tasty Spanish rice and lettuce, tomato, sour cream and Guacamole for the fajitas!!!!!

Our friends with us had tacos which they loved and our daughter had shredded chicken quesadillas which she said was the best she's had!  

They start you off with fresh Salsa  and warm fresh chips with just a hint of salt! 

We finished it off with Sopapillas served warm and yummy! 

Our waitress was attentive stopping by often but too much where it became an interruption to ensure our drinks were filled and any other needs 

I always after ordering go to the restroom to wash my hands and the bathroom was clean and well appointed.  

We will put this restaurant in our regular rotation for sure."}
{"text":"As a native Texan, I have high expectations for Mexican food. This restaurant exceeded my expectations. Tortilla chips were freshly fried, warm, and refilled 3 times. Salsa tasted of fresh tomatoes and cilantro with just the right amount of kick. I had a tamale as a side order and it was PERFECT. I also had a combination plate of 3 enchiladas (1 beef, 1 chicken, 1 cheese) and they were perfect as well. As an added bonus, there were about 10 entre choices for my vegetarian daughter. I am so happy that we took a chance and tried this place. It's the real deal!"}
{"text":"I really enjoyed this place but could do without the loud rap music. It's not very festive for this type of restaurant. Food was good price was fair."}
{"text":"I came here on a Thursday during lunch time to see how the lunch buffet was.  It was around 1:45, and there weren't too many people in the restaurant.  I was disappointed in the selection.  I'm not sure if I was late, and they stopped making some things, but I didn't feel like there was a lot of choices.  The enchiladas were just OK.  The rice didn't have flavor.  I saw you could make tacos, but I didn't see things like lettuce, tomatoes, etc.   The  service was decent enough so that's why I'm giving it 2 stars instead of 1."}
{"text":"This is an alternative spot for Mexican for alternative reasons.  I have events I go to nearby.  I came because I was shopping at the BJ's and the home goods store thereabouts.

This is a place where you are more likely to hear patrons speaking Spanish than English, this doesn't mean the food is any better or worse.

What makes this place a 4/5 is the buffet.  The buffet has all the unhealthy comfort foods you could want.  You need to eat a lot to get value out of the buffet as the entrees are reasonably priced and filling.  Where I get my value is from the variety of items you can get.  Don't make fun of the variety of Mexican food - there is actual variety and here you can experience it.  You can also get value if you just want tons of cheese on everything.

The management is very friendly and improves the entire experience.

The bathrooms are what cost this place a star and make it impossible for me to give it 5 stars.  I like a restaurant to have a nice bathroom, for whatever reason I feel like the entire establishment is classier and cleaner if they have a good bathroom.  I suggest you don't go to the bathroom here as it will bring your mood down.  Don't get me wrong, this isn't a mop bucket utility closet with a toilet in it (that would cost 2 stars)."}
{"text":"I love this place. The workers are so friendly. The food is divine. We always go for the lunch buffet and leave happy customers."}
{"text":"This place is horrible no flavor. Not real Mexican
Went inside was pretty busy on a Saturday night. Service was a bit slow. Even the salsa was bad to watery. I think Id enjoy a meal at Taco Bell instead of this place don't waste your time!"}
{"text":"Generous portions of delicious food! Very happy we took a chance on this place. The vegetarian fajitas were awesome! Service was quick and friendly. We will definitely make this our local go to place for Mexican food! 4 stars only because the decor and bathrooms could use some updating."}
{"text":"Not a fancy place, and not the simplest to find the first time you visit - often you're screaming past, hoping to find that perfect decoration for your house or racing to a party for the kids at Chuck E Cheese's, but once you know it's there, it's easy enough to find, tucked into the strip mall next to yet another mattress place.

On the inside, there isn't a ton of atmosphere - you are in a strip mall after all - but the staff is welcoming and the food is decent and they are helpful to get you the food and get you going again, so you can get back to the races, either the real ones at the track down the road one way or at the mall the other."}
{"text":"Not the best Mexican food in the area (and certainly not super \"authentic\" Mexican but also not the worst, and Cinco de Mayo is very cheap. There is a lunch buffet everyday from 11-2:30 or 3 that only costs $9.50 and all of the entrees are super cheap as well. The service isn't bad but nothing spectacular either. Basically Cinco de Mayo is your average Mexican restaurant, nothing more and nothing less. 
The lunch buffet has some meat entrees: fajita beef, chorizo pork with onions, pork ribs, and some chicken con queso. They were all forgettable except the corizo which was very good. They have beef and chicken enchiladas, chicken taquitos, cheese quesadillas (very cheesy and very good), chicken nuggets, fries, and ground beef & chicken along with soft and hard shells to make your own tacos. Everything was average quality with nothing that really stood out. The rice and beans were not very good at all either- and it's not just the buffet quality, my girlfriend ordered the chimichanga which was okay but her rice and beans were also really mediocre. 
If you're in the area and need a Mexican fix for cheap, this is better than Taco Bell, or if you really want to chow down the buffet is all decent quality stuff and super cheap as well. If you want really good or authentic Mexican food though, I would venture out to other places in Concord/Charlotte to get your fix."}
{"text":"Back again just as good as the first time. Great authentic Mexican food.
As good as last time.  Very good and fresh food."}
{"text":"It was a lazy day so we decided to just order out. Unfortunately it was like pulling teeth trying to order over the phone. I did, however, have a pretty large order. When I was finished, she said it would be ready in 10 minutes. Sure enough, it was waiting for me when I got there. 

The food is always good. I have a mild obsession with their grilled shrimp burrito. It's also very large, I wouldn't even be able to imagine eating the whole thing in one sitting. My husband and mom usually get the pork carnitas and chicken burritos for my 3 and 5 year old. My kids aren't super picky, they'll eat whatever is put in front of them even if they don't care for it. However, my boys love the chicken burritos from here. 

The manager is a great guy. Whenever we come in, he'll stop by and chat with us for a while, play with the baby,  bring some extra tortillas for the little one.. 

This place continues to excel in my book and is definitely my go-to place for Mexican food."}
{"text":"My husband and I are new to the area and have been searching for a Mexican restaurant that would replace our long time favorite in Raleigh. Today, we found it. I ordered the Arroz Texano and my husband ordered the chori pollo. It was absolutely delectable. My palate was pleased. The flavors were dead on. I added jalapeño for an extra kick. On tuesdays they have .75 tacos. We ordered two (one steak and one pork) for appetizers. The steak is cooked to perfection. It was seasoned well and tender. The salsa they use to serve with the chips could have been better, yet still tasty. One negative, the pina colada tasted like water and milk. I sent that back and ordered a LIT. Great choice. The server was very sweet and accommodating. We will be back!"}
{"text":"I came here for dinner one night instead of going to the buffet for lunch. I ordered a margarita and it never came out, so, when my dinner showed up, I had to ask the waitress where it was. They eventually brought it out, but I kind of had to rush through it because we were already mostly done with our food. Also, the food was a little expensive for a Mexican restaurant and it wasn't anything special. I will come back to this restaurant, but for the buffet, not for a sit-down meal."}
{"text":"This place has really good reviews so I decided to check it out for lunch one weekend. I was extremely disappointed with the food. I ordered an enchilada and a carne asada taco. The enchilada was disgusting. I wish there was another word to describe it, but no--it was terrible. I've eaten a ton of enchiladas in my life, and this was probably one of the worst. As far as the taco goes, first I was brought a ground beef taco. This was not what I ordered, but the server was great in changing this out. The taco was ok, not great. The service was good (which is why I gave them 2 stars and not 1), but there really wasn't a lot to like about the food I tried. I'm hopeful there are better options, given the pretty good reviews. I'm not in a hurry to find out."}
{"text":"I have been on the search for authentic Mexican food in the Charlotte area, and this is not it. By no means is the food terrible but it isn't great great either, it is very Americanized. The first give away is when they offer you hard shell tacos, second when you get offered ground beef tacos, third their rice water is very grainy sort of like a rice water mix from Walmart. On a positive note their service is great and their portions are huge! But unfortunately not authentic :-("}
{"text":"Overpriced and mediocre food.

Good service.

Idk what I expected with a name like this. I wouldn't go here again unless all other local Mexican places are somehow worse."}
{"text":"The food was good and hot. My service was great!! The server was Felipe and he was very attentive and fast with the food! Will come back because of that service!!"}
{"text":"I was working at Great Wolf Lodge last weekend and decided to give into my craving  for Mexican. The owner ? Was super nice. My chimichanga was  just ol. Salsa was awesome and the horchata was delicious. Lots of people were in for the daily lunch buffet but I did not partake."}
{"text":"The food was very flavorful. I ordered the steak burrito chipotle. My wife ordered the lunch special #5. We both agreed that if they were located in the Matthews area this would be our \"go to\" Mexican restaurant. The only downside was service was a little slow even though they did not appear busy, but overall we enjoyed the experience."}
{"text":"Been to this place over 20x and this place has really gone down hill in most areas. It was once a 4-5 star restaurant and the food was great but I have noticed the pattern..."}
{"text":"It was alright. The place is really clean and we were greeted immediately. Service was decent.  I ordered the taco salad with beef and it was terrible. I didn't really eat much of it. They put way too many beans in the salad which made it mushy.  The tortilla shell was so mushy that I had to use a knife to cut it. My grandmother ordered the quesadilla and really enjoyed her meal.  It was a really large portion too."}
{"text":"Great food and service! We were passing through and wanted some Mexican food - Outdoor seating was a great option as we had our dog with us. The waiter was attentive and took great care of us. Would definitely recommend."}
{"text":"Average food, but poor service.  Had to request tortillas for fajitas twice and the place was almost empty (around 7:30pm on a Sunday).  Practically finished the fajitas before we finally got them and no apology at all.  Best part was the churros for dessert. Kids liked them."}
{"text":"I'm from California, so I'm skeptical about Mexican food outside the southwest. But this was great! I was there with 8 people, a couple of them from Texas, and we all loved our meals. The chips and salsa are great, the beer was very cold, and the food I saw at the other tables looked great too. I am a vegetarian, and appreciated the veggie section of the menu. Excellent food and very nice staff."}
{"text":"I really want to like this place because it's the closest Mexican restaurant to my house, but the food is so inconsistent I just can't. Sometimes the fajitas are ridiculously oily. Sometimes my food arrives lukewarm or cold. Twice the cheese in my cheese quesadillas wasn't even melted. The last time I went, instead of red sauce on my burrito and enchilada sauce on my enchilada, the whole plate was smothered in queso. I like queso but that was gross. If you're lucky enough to get a hot plate of well made food, it's good. But I'm not willing to play these odds anymore."}
{"text":"We had the fajita nachos and they were amazing! My husband and I loved them!!!! The grilled chicken is so good. Great food and service I strongly recommend."}
{"text":"It was good.  Pretty classic mexican family restaurant."}
{"text":"More authentic menu than I anticipated. Food was very tasty. (With the exception of the chicken tenders off the kid's menu...which were over fried...but if you're going here for chicken tenders then you're making bad life choices.)"}
{"text":"This a true spot you must check out! from the burritos to the quesadillas and the Margaritas,  everything here is WINNER! Service is always pleasant and efficient and the food will leave you beyond satisfied!"}
