{"text":"R took me here for a belated Valentine's dinner. Thought it was nice without being pretentious or too fancy. Started with the duck confit, which I thought was nice but nothing too special. R had the Alsacian tart (warm brie and fruit baked in a phyllo), but since he doesn't like to share his food I only got 2 bites. But 2 very nice bites.   Mains: R had the rib-eye filet. Tender, but not fatty enough for me. I *heart* well marbled meat. I ordered the scallops with risotto. 6 seared scallops that were sweet and salty like the sea :-)   Dessert: chocolate bread pudding. It was actually very bread-y, like  a bread-y cake.   You can order wine by the half-glass which is very convenient when you want to pair the courses with wine.   The damage: way more exensive than I expected. We could have gone to Maestros or Roaring Fork for the same price."}
{"text":"Three friends landed at Sky Harbor airport one hot May evening.  \"So, this is Phoenix, eh?\" they said as I picked them up curbside.   Two flew in from San Francisco and the other from New York. I had my work cut out for me. Where the hell am I going to take these folks? And how in the hell will I convince them that I haven't moved to, well, hell?  I remembered a tip from a friend to check out Circa 1900, a fairly new restaurant just across the walkway from Pizzeria Bianco in Heritage Square.  I called them up to see if they were still open. \"Sure we are!\" the host said, \"Come on over!\"  So we went.  We walked into the old historic Silva House and had our choice of seating areas. We chose one of the front rooms and the server helped us pick a great bottle of wine. For appetizers we got the asparagus, duck confit, and the cured meats plate. All were great and my friends did the \"Not bad. Not bad at all\" head nod as they masticated and looked around the room.   For entrees, two of us ordered scallops, the other two (including myself) got the rib eye steaks. Man, that steak was tender, juicy, and perfectly cooked. Great sauce and mushrooms to go along with it. My other friends were really enjoying their scallops and we sat there for ages catching up on old times and discussing my new times in Phoenix.   We didn't stay for dessert because my friends were getting tired, but they were impressed that restaurants like this existed here. I was just grateful that I didn't have to end up taking them to Denny's. Circa 1900 helped start the weekend off with my three skeptical friends just right.   Definitely recommended for those looking for good New American cuisine. Not yet five stars because I don't know how desserts are here and the service got a little slow at the end, but I'd go back again. See (and taste) for yourself."}
{"text":"I am still thinking about the gnocci I had at Circa 1900 back in July. Any dinner that remains deliciously vivid in my memory for four months has got to be worthy of five stars.  I had a great time with one of my good friends. We were excited to see they used Effen vodka to make their martinis and had a great blackberry cosmo. I was afraid it would be too fruity for me, but it was fabulous.  I had a fresh tomato salad - perfect for the Arizona summer - and a very light gnocci dish with a delicate broth and mushrooms.   We didn't get a chance to have dessert because we were running to a movie - Another great thing about Circa 1900 is its location. We were able to walk to the Arizona Center to catch our movie and then rounded out our evening with some ice-cream at Cold Stone."}
{"text":"Sorry folks. As of December 14, 2007 (or earlier), Circa 1900 is closed.   Its replacement will be the Rose and the Crown, an English pub which isn't open as of tonight."}
{"text":"Little food for alot of money.  It's definitely good, and I would highly recommend it for a date, but it will hurt your pocketbook.  The ambience is fantastic, a little more conservative than Bar Bianco, but has a similar vibe and reflects the same time frame.  Not for vegitarians, if you're green, don't even try it."}
