{"text":"Wow what a triumph. Their food is absolutely incredible. Excellent environment and the accordion player is very talented! Make sure you go!"}
{"text":"Great food, great service. The two most important things for me . Their sauce and meatballs are homemade and delicious. We had the pasta special of the day and it was great. Tiramisu for dessert was delish. Will definitely come back !"}
{"text":"The only saving grace here was the friendly server. Food was overall mediocre. Seafood doshes were bad!! I don't get the good reviews. The mussels were skimpy and small. They also stinked. They were either cheap, old or not cooked properly. The clams in pasta were small and looked very unappetizing. The pasta was also very bland and tasteless. Marinara meat sauce was ok, but nothing that you cannot cook at home."}
{"text":"Overall, good. They have a nice outdoor area, an extensive menu and good food - the tiramisu was fabulous!

It was a little spendy though, for what you get. Inside, it was surpirsingly fancy... white table linens, etc. If they'd come down on the formality and the cost, it would be a great place! It was Sunday night when we visited and it was nearly dead. 

We probably won't return. You can get the same from Olive Garden for less $$$."}
{"text":"I can't speak to the food, because for the first time in years, I walked out. 

After 20 minutes, I hadn't had so much as a drink order taken. I was willing to be patient, though, until two other tables were seated, and had multiple waiters take drink orders and bring bread. That was the final straw. 

My companion and I were casually dressed in jeans and plain t-shirts, with sneakers, but certainly not slovenly, dirty, or otherwise worthy of such complete and utter lack of response. 

The first thing that was addressed to us was as we rose to leave - and that was one of the servers helping one of the tables seated after us, to assure me that \"someone will be here to help you shortly.\" No, thanks."}
{"text":"ciros is the best italian restaurant  i've been to since i moved here in 1998. and i'm from long island n.y.  and i've eaten in the best italian restaurants in brooklyn and manhattan. the penne a la vodka and clams oreganoto is great. if you want to taste traditional italian food give ciros a try. and say hello to artie the owner."}
{"text":"Went to Ciro's for lunch and ordered the fresh mussel appetizer with the white wine sauce. It was pretty good. The muscles were small, which I like and none of them were bad. The sauce was tasty, but nothing spectacular. I'd be willing to go back."}
{"text":"We found this place off of Yelp and after reviewing the reviews my husband and I decided to try it out. We went here to celebrate our wedding anniversary and the food and atmosphere was awesome. I do not recommend to take small children. The atmosphere was very romantic with dim lighting and they had someone to play live music on the accordion.

I ordered the house special which was the Whiskey Shrimp and Chicken. This dish was so good, it did not disappoint. My husband ordered the Bake Zitti which was great as well. For both of our meals plus wine and a few beers we paid an average of 60+ bucks. 

We will definitely go back again with friends and family."}
{"text":"If you have not been to Ciro's you are missing out on some of the best traditional Italian food in Charlotte.  Casual atmosphere, good prices, friendly staff, always clean... They bake their own bread fresh every day, it's incredible. Their pastas, seafood, pizza, appetizers... all outstanding. My wife and I have been going here for nearly 15 years. Try to go on a Friday or Saturday evening, if you're lucky Paul the owner will play some Italian classics on his accordion.  I can't say enough about this place, it's fantastic."}
{"text":"I had the lunch seafood pasta with spicy sauce it was outstanding!

Big portion for a lunch price so great value!

Very good service and atmosphere!

I'll be back when I'm in the area for sure! 

Sorry no pic I gobbled it up!"}
{"text":"I have been going to this place for many years, always a great experience. The meals are large, tasty with a nice warm atmosphere."}
{"text":"We had gone here last week and I left a very poor review. 
We went tonight with other friends and must admit it was pretty good. However the caviar is that Lorenzo went with us and he made sure all was great. Thank you guys. Give them a try."}
{"text":"This place has been around for a looong time- which is tricky to do sometimes in a city that is dominated by chain restaurants.  The reason that Ciro's had stood this test of time is easy:  delicious food in a comfortable atmosphere and good service.  I must say, I've fallen in love with the chicken piccatta- all other chicken piccattas must live up to this one.  Others (who shall remain nameless at this time...) will forever be linked to the AMAZING stromboli.  I don't think I've eaten any dish at this restaurant that would not have me running back for another meal."}
{"text":"Good food, good service, reliable and dependable.  I take clients there when visiting town on business, and have never been disappointed."}
{"text":"Terrible. Terrible terrible. Terrible terrible terrible. Service was... ehh. Food was BAD. My mom and I went there in an effort to try somewhere new. Bad idea. The food was nothing better than what I could make myself with some prego (and I'm far from Italian). 
The food's presentation was awful. The food was just tossed on the plate. The ingredients were far from fresh, not what I usually expect from an 'authentic' Italian restaurant. 
We just left the restaurant literally minutes ago and I rushed on here to caution the rest of Charlotte to make a different choice for dinner tonight. I wish I could give it zero stars."}
{"text":"Yesterday was my 3rd time ordering the tiramisu. It's literally my favorite thing on the menu. The portion of the cake is pretty big and it's delicious. 

I've also had these 2 items:

Appetizer Mussels - very good!
Fettuccine Alfredo - a bit overpriced and bland, but it's OK."}
{"text":"Love this place. Fresh Italian food! Yummy bread, pizza!  Fantastic service.
This is going to your Italian Nona's home.
Gotta live the father -in-law  playing the accordion."}
{"text":"Average food, average service. Marinara sauce over spaghetti was far too sweet. Tasted like canned. Italian sausage was bland at best. Wine selection was average and overpriced.  Would not recommend."}
{"text":"Went in here for lunch while in town.  Talked to the owner there a little about the place and Italian food in general, she was very friendly.  The food I saw going out of the kitchen all looked good, but I didn't have time for a meal, unfortunately.  I ordered the eggplant parm sub with a side salad.  The salad was better than your average pizza place salad, and the eggplant, sauce, and bread were all fresh and perfectly cooked.  I'd like to try a pasta dish with the sauce since it seemed to be seasoned very well.  I'll definitely be back when in town and can try some dishes."}
{"text":"Pasta over priced. Pizza not the best. Service was subpar. Wouldn't recommend. Nice to sit outside and listen to wine vault live music on weekends."}
{"text":"Excellent food! I had the pasta traditionalle and it was so good that I will probably always get that! They also serve warm bread while you are waiting, which is common for Italian places, but still nice! They also had white tablecloths and the place looked very classy upon entering.
I liked the dessert menu, but we were too full so we didn't get any.
Beautiful restaurant with great prices and a very courteous staff. Wished I lived closer so I could go here more often!"}
{"text":"Nothing special. Subpar food and service. All the waitstaff were standing around talking amongst themselves and playing on their phones most of the time."}
{"text":"It was GREAT!!! Paul played the accordion the food was great the service was spectacular, don't drink wine so not sure on the wine lists but I do eat and the food was awesome. I would recommend to a place to sit down to."}
{"text":"Service was phenomenal (had a guy named Nader), food was pretty good but nothing too special, and the decor was very pleasant.  All around a great night."}
{"text":"There aren't that many nice restaurants around University but this one is close.  Your basic Italian fare with and accordion player.  The plastic/parchment covers over the table cloth's lets you know right away that this place isn't that high end.  They don't have a website???

Don't get me wrong, its not bad, its just not that good.  Its probably one of the best restaurants in the area besides Thai House, now that Melting Pot is closed.  I can't think of too many other places in the area where a college kid should bring a date.

The apps were pretty good.  I had the mussels, calamari, and antipasto.  The mussels were a little salty but a pretty good sized portion.  The calamari wasn't quite as large of a potion but was decent.  Light airy batter and relatively tender squid.  The antipasto had ham that could have easily been lunch meat.  The balsamic wasn't anything special either.  I did like the artichokes and parmesan chunks though.

After tolerable but uneventful apps and looking at an overpriced wine menu we just decided to walk over to wine vault for some booze and live music and grab a snack later on.

Bottom line, its good for the area, but that ain't saying much.  Macaroni Grill may be a better option and I rarely suggest chain restaurants."}
{"text":"Easy to find and plenty of parking make this a great stop for very good food. The accordion player is excellent, the wine list is very good, the staff is efficient and friendly.

The portions are not so great to over feed you and my veal was tender and hot."}
{"text":"Don't ever remember having a problem with this place. Fine dining and good food. The only bad experience was the night the accordion player was there."}
{"text":"Excellent authentic Italian food, the owner greets the guests and personally says good bye also. The owner also plays the squeeze box while you eat sometimes! So cool! Absolutely amazing food! If your not used to authentic Italian food you mite not like it, it's not Olive Garden! It's real! Ignore the reviews that say the food was bad, if you know REAL Italian food when you taste it you will love this place. I eat here every year when I'm
In town for the car show, and as long as Ciro's is open I'll be here for dinner when I'm in town. Thanks!"}
{"text":"I dined at Ciro's while traveling for business in Charlotte. We were staying nearby and found the restaurant while walking around our hotel. We ordered appetizers for the table one of which included the fried calamari. While I didn't have any the table agreed it was quite salty. I ordered the gnocchi with meat sauce for my main entree. My guess is that the gnocchi was not homemade. It was good, but not a meal I would go out of my way to have again. The potion sizes are also very large; Split when possible!"}
{"text":"Only one word can be used to describe the food at this place: bland.

Let's start from the beginning though. A coworker and I came here on the recommendation of another coworker. For these prices, we were expecting high quality Italian food. However, I should've known from the initial encounter with the person upfront that this wasn't going to be that great of a meal. We stopped in initially to ask to look at a menu. The guy upfront gave us an annoyed stare and then pointed to their to-go menus. He didn't even hand it to us! He then walked away. Fast forward to us figuring out that there isn't much in this shopping center. We got seated and our waitress, while attentive, was just not all that friendly. They really try to push their salads on you. I heard, after everytime someone ordered, they would say \"Would you like a salad with that?\". Sneaky. I originally had not wanted a salad but agreed to it. Bad idea, the thing was horribly bland - my coworker agreed.

I had the spaghetti and meatballs which is hard to screw up, but it didn't have any \"special sauce\" like the menu suggested. This was plain kroger sauce for sure. And another note, spaghetti and meatball should never be $15, that is just a ridiculous price. I can't remember what my coworker got but I do remember the price ($21) and I do remember it had chicken and mushrooms. She said it was bland as well. The bread, while it wasn't hard, wasn't that great tasting either. Also note that the salads they get you to order are $3 something each.

Overall, for the final price of the meal for 2 (over $50), I was not amused. They're lucky this was a business expense because had I had to pay here, I don't know if I would even give it two stars."}
{"text":"We've been going to Ciros for years. We love the ambiance of the accordion and authentic Italian food. We've tried nearly everything on the menu and are never disappointed. I love the eggplant relative as an entree. My husband digs the calzones and pasta dishes. It's a fun place to get a good Italian meal."}
{"text":"Food was outstanding, service was friendly and great, and the owner was one of the nicest guys. It's so nice to know that there are truly family friendly and people centered businesses left in this world! I highly recommend!!!!"}
{"text":"My food was a little burnt on the underside when I first got it, but they were extremely apologetic, took it back, and then brought me back a fresh dish. The second one was perfect. It was a wonderful dinner with my family, and I'd like to go back someday."}
{"text":"Nice and fancy but with reasonable prices. The spaghetti was yummy. Better than Olive Garden's. Amanda, my waitress Amanda was very sweet. The ambiance was very romantic. It was nice and clean. I loved the tables.Thanks for helping me feel like I was in Italy for a while."}
{"text":"My wife and I had dinner here, once again, Saturday night. As usual Ciro's does not disappoint. I had the Three Coins in a Fountain special with an app of Meatballs in Ricotta. My wife had her Shrimp Scampi. All I can say is that there is a reason we keep coming back. The food is great and the service is so personal that you don't find this elsewhere. From the owner, Artie, coming by to say hi and his father-in-law entertaining on the accordion, the night is so much fun. There will be Light Rail service early next year. If you're in the uptown area, this place is worth the trip.

Joe and Dawn Schiano"}
{"text":"Had lunch today with clients for whom this was their 1st visit.   They were not disappointed!   Over the past 20 years I have dined at Ciro's and have always been treated as a guest in an Italian home.   Yes, the menu has changed over the years but never have I complained about either the quality or value.   Paulo (who plays the accordion) is a hoot--where else in the QCity will you find this?   Sound too tacky for you?   There's a Macaroni Griile across I85 (yuck)."}
{"text":"CLEAN, FAST, SAFE, & DELICIOUS!!!! I ordered the gnocchi pasta with pink sauce tonight and it was DELICIOUS!!!! My food came very FAST! It's also in a SAFE upscale location (I was traveling through and was not familiar with this area. The server was super nice and suggested different specials. Very happy with my service. It was very CLEAN and would be a great date night location."}
{"text":"I was pretty disappointed when I came to this restaurant. My boyfriend got a simple fettuccine alfredo dish and it just did not taste good at all. The atmosphere is not comfortable because everyone is on top of each other and the tables are awkwardly low. For as much as we paid, I was expecting much better Italian food. The food was definitely not worth the cost. Not coming back!"}
{"text":"Great place! We came here for a special event and the atmosphere was great. The wine list was adequate and the food menu was extensive. We started with bread with rosemary/garlic infused olive oil and balsamic vinegar which was very good. The mozzarella en carozza appetizer was not great and I wouldn't recommend it- too much cheese, no crunch and sauce wasn't great either. We got a bottle of wine which was good and served well. We then ordered chicken sorrentino, fettuccine alfredo with shrimp and penne vodka. All of these were done well, I wouldn't call them knock out of the park wonderful but they were good. The accordion player was wonderful and the service was amazing! Our waiter AJ was really great, had an awesome disposition and a good knowledge of the menu. We would definitely eat here again and would likely order specials next time around."}
{"text":"Solid Italian fare in an environment that is very open and bright.  My wife and I have tended to go here when we could get babysitters for our 4 kids.  The reason:  The best lasagna (according to my wife).  I agree with her that their dishes are all very good.  Best Italian ever?  No.  One of the best in Charlotte?  Yes.  Worth giving a try?  Absolutely.  Every visit is nicely topped off with a cappuccino that makes the meal satisfying."}
{"text":"Ciro's is a.somewhat refreshing restaurant single location restaurant in an area of town that is saturated with chain food and fraternity bars. The wait staff is pleasant and the food is also decent.  In my opinion the food was  adequate but left much to be desired to give me a true amazing Italian experience.  I would return. The atmosphere is warm and inviting and seems like a great place for a nice lunch or dinner."}
{"text":"Service was really good. The waitress was very patient with us taking our time to order. Although it took them a while to notice we had walked in and we waited for a few minutes before anyone sat us.  

The bread was ok but when you eat it with olive oil and vinegar it tastes good. 

HUGE portion sizes. Bruschetta bread was very good, but the tomatoes were kinda runny. The tomatoes with the the bread soaked up some of  it so it made it slightly soggy. Still tasted good

I had the eggplant parmesan for dinner which was delicious. An app and main course is way more then enough for 2 people. 

very nice, family/homey feeling all around

The mints they give at the end were delicious"}
{"text":"The food was NOT great at all! I had a chicken parmigiana and I've had better parm at pizza shops. The chicken tasted like prefrozen breaded chicken. The Noodles didn't taste like they were cooked long enough and the sauce was damn near Preggo. The only positive touch was the guy playing the accordion. There's no reason for me to visit again! There was NO human touch to this place to make me want to visit there again. I got the chicken parm because it's a basic dish that would showcase their cooking ability and they TOTALLY dropped the ball"}
{"text":"Great food! They brought my one year olds food out earlier than ours. Also he loved the accordion and they played for my son a lot which kept him entertained! I had chicken piccata and it was delicious!"}
{"text":"Wonderful food and fabulous service.  I was with a group of three, none of us from Charlotte, but a convenient meeting point.  Our waitress was amazing!!!  Very knowledgeable about the menu, and the one thing she didn't know she quickly found out.  Very attentive without being annoying.  Food was delicious.  Would definitely visit again!"}
{"text":"They have the very best spaghetti carbonara & !! I love this restaurant for dining in as well as for takeout."}
{"text":"Good but very expensive. The food is good. But not worth the price. We have cheaper and better options like Giacomos."}
{"text":"We went on a Sunday night and it was not busy at all. The restaurant is huge so with only 3-4 tables occupied it seemed even emptier. 

Our service was really friendly and efficient. The restaurant was clean and the bathrooms were attended to. The food was ok, not bad, but certainly not gourmet Italian. We started with bruschetta which was good, lots of fresh basil. Not sure they used the right bread as it got soggy pretty fast. Since they don't have thin crust pizza, I opted for spaghetti and meatballs. Again, it was ok, not great. The sauce did not have much flavor and the meatballs were rather dry and tough. The spaghetti was just regular out of box. In the end, I was really hungry so the meal was not bad, but certainly not a place I would rush back to for the food. Prices seemed kind of high to me based on the quality of the food.

I am giving it 4 stars on the strength of the service although in reality it is a 3.5 star restaurant."}
{"text":"Working in the University area, we bring clients to Ciros all the time.  I have been there at least ten times and I can honestly say I have never had a bad meal.  And I am usually with a large group of 5 or more people.  No one in my group has ever had a bad meal.  Everyone always raves about how delicious everything is.  There is bread served with oil/balsamic which is delicious.  The older man who places the accordion is very friendly and entertaining (although at times he plays too loud...he means well!) Overall, one of my favoriate restaurants in the area.  I am very surprised at some of the negative views, as I am a very picky food person! :)  I can always tell when food isn't fresh, or prepared too far ahead of time, etc.  Never noticed this at Ciro's.  YUM!"}
{"text":"Ciros is a good family Italian restaurant.   They have many good dishes from the basic pastas to the more inventive dishes.  

I usually get the Chicken Parm which is always good.  The sauce is a little sweet and is great.  Pasta ala Vodka, Lasagna and The Seafood Pasta is great.  

The eggplant appetizer is very good and the cannolis are not to be missed."}
{"text":"We had a team dinner with someone from out of town and had to find somewhere \"near the office\" to go. Well, if you're in the area you know the options are mostly chains, not a fan. Someone suggested Ciro's and we were all able to agree on it.

We had 6:00 reservations and I was surprised how busy it was in there. There must have been some kind of happy hour/mixer in the bar area, it was packed. Who knew!

Overall the service was stellar! We had someone extra joining us so they added an extra table to our table, no problem. Our waiter made recommendations and checked on us the perfect amount - I wish I remembered his name to give him a shout out, he was great. They were also really accommodating about special requests on people's orders - and everything came out right. 

The menu is huge - ranging from traditional hearty Italian (chicken parm) to lighter healthy fare (grilled salmon salad). Everyone seemed happy with their meals, unusual that no one has an issue when there are 9 people.

The table shared the Calamari, wow, great reco from the waiter! Just lightly battered and fried and very fresh (not chewy like it was frozen) yum! I tried the Chicken Lucia - sautéed chicken in a white wine sauce with artichoke hearts and sundried tomatoes. Really delicious.

I will definitely stop by Ciro's again if another work dinner pops up. Impressed!"}
{"text":"Dined here recently.  I have been here before but it has been years.  The place has been around for a while so I guess they are doing something right.  Food is decent.  No complaints there.  Service was good as well.  There are better options for Italian food but Ciro's is not a bad one."}
{"text":"Worst Italian food I have ever eaten. Think Chef Boyardee at ten times the price."}
{"text":"again, came here as it was within walking distance of our hotel. the restaurant wasn't very full, but service was super slow for our party of 7. i was really excited for the bread after reading the reviews, and i am the type that can kill a whole basket. i could barely eat one. it was dry and tasteless. 

then our side salads took forever and a day to come out. we also asked for extra ice and such, but our waitress never remembered. sigh. the salads finally came and it was a normal salad but good as i hadn't eaten much veggies during my stay. i had ordered the special of the day, pesto chicken (but i substituted for shrimp) florentino. when i was given my dish, it was a alfredo sauce. i pointed out to the server that i had ordered pesto, and she replies, yeah i thought that didnt look right. wow sherlock, since pesto is green! she took it back, and it came out a minute later. i think they just threw some pesto in and mixed it up as it came back way too fast. but regardless, i preferred that than having to eat 10 minutes after all my coworkers dug in. my dish was okay, heavier than i had expected (but maybe i wasnt expecting alfredo with some pesto), but the shrimp were huge and tasty. not as much food as i had thought it would be, which was good. i tried a little of the margherita pizza, and it was not good. it was sooooo soggy on the bottom. yuck. but their pizza portions are huge! tried my coworkers penne vodka, and that was tasty!

again, probably wouldnt come back, but if i did, id probably only order the penne with vodka sauce. to go."}
{"text":"Always a great place with great food. I love the pink cream sauce its a must try.  Wish I could have that at home."}
{"text":"Solid place!  Great lunch prices too.  

I had the lunch special here recently which was a Tilapia Puttanesca and it was dinner portion for a lunch price!  A great deal.  And it tasted great.  At first when I ordered it, I immediately regretted it due to my recent reading of Anthony Bourdain's Kitchen Confidential (eating seafood on a Monday or Tuesday after a weekend is probably not a good idea)... but it tasted great to me and I was very happy about my choice.

Our server was very prompt and took care of our refills.  Even adding a little color and warmth to our lunch experience.  Almost as if he was a long lost distant italian uncle you've always wanted.  My friend and I cleaned our plates and he came over with a sad expression and said, \"you guys didn't like it! [insert italian accent here]\"  We had a good laugh.  He was very good about offering us fresh ground pepper for our salads along with the freshly grated cheese over your dish.

When you first walk in, Ciro's has a quality about it that almost makes it formal, but it seemed okay for a casual lunch.  I've had dinner here before and don't exactly remember feeling under-dressed... but that was a while back.

WARNING:  I enjoyed their bread WAY too much.  Especially when they drop a bottle of olive oil (looks like rosemary and garlic infused) and bottle of balsamic on the table for you to make your own dipping oil.  Be warned.... liquid crack soaked up in warm bread!"}
{"text":"I am a huge fan of this place.  The food is better than my previous go to Italian restaurant.  I really like the music and when Pauli plays the accordion.

Not to be missed are the veal dishes.  I also can't recommend the shrimp and salmon dish enough.  You really need to try this restaurant.

The service was also excellent.  They know the menu, they know the people, and they know how to accommodate special requests."}
{"text":"Had the fettuccine Alfredo with shrimp and a Caesar salad, both were quite good. A little on the pricey side but the attentive service was worth it."}
{"text":"Ciro's Italian Restaurant is Charlotte's best Italian Restaurant in The University area and has fresh home made ingredients. I have been coming here for years now.

Best Italian Food in The Queen City! Best food, great service.

The Owners always take the time to welcome me and my family every time we dine in. His father in law comes in every single morning to bake his special bread and plays the accordion in the evenings making it romantic. Whenever I want home made Authentic Italian food, this is my favorite place. Great service and friendly staff."}
{"text":"Went there once for a Valentine's Day dinner. Not a big fan of their food but they do have the best Tiramisu in the world! I have yet to find something that can beat theirs. 

I have gone back but only for dessert. 
I'd give them 0 stars for their food and all 3 go to their tiramisu."}
{"text":"If you are into the salty over seasoned commercial Italian food, this is probably not the place for you. If you like a place with good food where the ingredients are allowed to have their own flavor, then yes.  We were seated quickly and served with respect. Our food came at an appropriate interval to the yummy appetizer bread. It was nicely plated and tasted as good as it looked.   We ordered a calzone and lasagna. The lasagna was definitely the better of the two dishes. It was even good reheated next day."}
{"text":"My husband and I attended this restaurant for our anniversary. I had a great salmon and shrimp pasta dish and my husband had pasta as well. It was delicious and we had no complaints. There is a German Riesling on the menu that everyone should try! I would only come back if it is for a special occasion as the prices are high. The owner comes out frequently to ask how your food is and the servers are very professional and are very kind. The atmosphere is definitely Aimed at special occasions or romantic evenings! The only criticism I have is that it was vey hot while we dined and I felt that the air conditioner may have been broken, which took away from the experience a little."}
{"text":"Although it is expensive it is a good Italian restaurant. Very friendly waiters and good food. When I went there was a party of 40 near by so service was a little slow but that is understandable. I would definitely try it if you like Italian!"}
{"text":"I don't get up to the University area that often, but I've now been to Ciro's twice and overall I've give them 5 stars for service and 3.5 stars for food.

I won't reminisce over the first visit as it was quite some time ago, but hubs and I strolled in there to grab a quick bite before heading to a show in Concord. Our server Colleen was fantastic - she seriously should work at Disneyland because that woman is so happy. She was also incredibly friendly, professional and efficient, making sure that we were in and out of there for our show with plenty of time to spare. 

Beyond the tasty (I presume freshly baked bread), I ordered the cavatelli primavera - an large portion of finely cooked cavatelli pasta loaded with tons of veggies in a light marinara sauce. The pasta was just what I was looking for and the veggies were fresh - my complaint? The sauce was quite bland. Perhaps more crushed red pepper? More garlic? More BAM? Regardless, I had leftover to eat for lunch for another day and for the price, $14.95, it was a ton of food. 

One an alternate note, make sure you note the price of the specials if you're interested in them...hubs and I were both surprised that his chicken & pasta dish was $22. It was roughly the same portion and similar ingredients to my dish and seemed as if the chicken breast cost added $7 to the price. Strange. Regardless, next time I'm  in the University area I definitely want to try their tiramisu - I hear it's phenomenal!"}
{"text":"Great food!  A nice spot if you prefer authentic Italian!  I recommend the manicotti!"}
{"text":"Ciro's Italian was my choice for dinner last evening with colleagues from Atlanta. My goal was a family-owned restaurant showcasing the best of University City. Ciro's did not disappoint. Starting with warm bread and a bottle of rosemary infused olive oil and another of balsamic; we were mesmerized by the divine smells. Two orders of fried calamari were crunchy with the lightest of batters. All of entrees were fantastic from veal Parmesan to pasta carbonara. And a selection of a nice 2013 Colluta Cabernet was perfect. There's nothing like accordion music to complete the ideal meal. It was so good, I forgot to take pictures!"}
{"text":"I have eaten at Ciro's numerous times for lunch.  It's always quiet and I have never had to wait.  I will agree with other reviewers that their prices are a bit steep.  However, their pasta portions are huge!  I usually cannot eat more than half in a sitting and have the rest for lunch the next day.  I love the bread they serve.  It's always soft and warm.  I wish they had a lunch menu and a little more variety since I eat there so often.  Lastly, salads should be included with the meals like most restaurants.  All in all, I would recommend them."}
{"text":"I went for lunch and got seated right away.  The service was friendly and quick. This was my first time here and I was pleasantly surprised.  I am very picky about Italian food, but really loved the stuffed shells. The prices were a little high, especially for lunch only, and the fact salad was not included.  I got 3 shells, and although they were deliciously prepared, probably wouldn't pay that much for lunch again."}
{"text":"We had dinner for four adults - it was fabulous.  We each had a different dish - and ended up tasting each other's dishes.  They were all delicious!  The food is very high quality and fresh.  We ate out doors (it was in May) and still got great service.  Very nice place and would be great for a special night out."}
{"text":"I tried this place, even though I was hesitant about the mixed reviews. We had a nice experience! The fried zucchini, eggplant parm and calzone were all good, as well as the tiramasu. The sauce for all our dishes was delicious, which I think can make or break and Italian restaurant. The decor is cute and owner played the accordion. I would certainly go again!"}
{"text":"Overpriced and underwhelmed. The excellent waiter could not make up for for overcooked broccoli and sausage over mediocre quality pasta. Pity as I like to support the local businesses."}
{"text":"Ordered shell fish pesce ... around $25.  Very good and ample seafood and pasta.  Preceded by really good calamari and brouschetta appetizers, and i also had a greek salad.  Very good.  Waitress very attentive.  i will be back."}
{"text":"I always get nervous when an Italian restaurant brings out less than stellar bread. But Ciros served up some great appetizers (Caprese, Calamari and a delicious Cesar salad) unfortunately as I began to get excited about this restaurant my steak came out overcooked with no flavor."}
{"text":"Just ate at Ciro's for the first time although I have lived here nearly 5 years. Ahhhh!!!!  Shame on me. Should have tried this place long ago. Went with some family visiting from out of town and we were all extremely happy with everything. 

Two of us had simple spaghetti and meatballs. Absolutely delish. One had vegetable ravioli. She raved.  

We went very early and the house was basically empty. Service was excellent. Do not know if that was because it was so quiet or not. Regardless, we had a perfect experience all around. I will be back."}
{"text":"What do you do when you don't know the area and you have an urging for Italian without the use of a smartphone to go on Yelp? You improvise with the use of primitive 20th Century devices.  Naturally, we used a GPS and found the closest place.  That was Ciros.  What a pleasant surprise.

The waiter was professional, polite and on cue every step of the way with subtle humor as well.  Music live by accordion added nice ambiance to the setting.  The veggie calzone was excellent. The Marsala and marinara were a bit in the sweet side.  We concluded sherry but we didn't confirm.  The tiramisu and canolli were huge.  Over the top huge.  Very much made to be shared.

Overall, we were very pleasantly impressed."}
{"text":"Went to Ciro's for the first time with a group of former coworkers for our quarterly get-together and was quite impressed...and I'm already ready to go back!

I ordered the Gnocchi w/shrimp in a pink sauce.  YUM.  The shrimp were large and perfectly cooked.  Admittedly it seemed as though they were a teensy bit stingy w/the shrimp at first glance, but it turned out to be just enough.  By the time you finish those & the doughy gnocchi you're full!  Also threw in a Caesar side salad & I must say they did a good job.  Dressing wasn't too bland or overpowering.

Ordered Chicken Fettuccini Alfredo to take back to the other half, and even reheated it was delicious.  Quite flavorful actually. 

I will say that they're a little pricey, but it was worth it since it was a ''special'' gathering.  For the gnocchi, fettuccini and one Tirimisu for me (and a soft drink), my total was just over $50 including tip.  Not cheap for sure, but I'll give'em a pass since it was so tasty.

Atmosphre was laid back and casual, but not a Red Robin type casual.  It IS a somewhat nicer Italian restaurant after all.  During dinner an older gentleman (we're thinking he may have been the owner?) began walking around playing his accordion.  While the accordion may seem corny, it was actually quite festive & jovial--made me wanna wave my napkin around & dance a bit!

If you're in the University Village & would like to partake in a slightly upscale (I said slightly) Italian meal, then head over to Ciro's.  I don't think you'll be disappointed."}
{"text":"Started with Cozze Marinata-Fresh Mussels sautéed with garlic, and olive oil in a red sauce. The mussels were tender and tasty. The red sauce was delicious. It had chunks of tomato in a well flavored red sauce.  

My entree was  Veal Pizziola with onions, diced tomatoes, oregano, in a white wine filetto sauce served with capellini. It came with three pieces of thinly sliced veal that was very tender.  The sauce had a nice flavor, different than the sauce with clams. All in all , the meal was delicious. 

The Extra was the music with the meal. 

Hot white Italian bread came with the meal, but meals did not come with salad."}
{"text":"Yum...still one of the best!  Best eggplant park ever!

Sauce with a perfect mix of sweetness and ripe tomatoes...dante spaghetti, eggplant perfect...great bread too.

Owners Father was playing music...greeted me...been over two years, but remembered!"}
{"text":"Didn't seen any pizza reviews for this place, so thought I'd take the plunge. Decent looking sit down Italian restaurant on Boardwalk, but also happy to do fast, friendly take-out pizza. Generally New York style, definitely better than average. Great quantity and quality of toppings (ordered pepperoni with sausage one half, meatball the other) and it was loaded (see pic). Beg to differ on the review that said their Italian sausage is bland, as the stuff the put on the pizza had a good little kick. Probably more like a 3 1/2 star pizza, but they get the extra half star for speed, friendliness, topping quantity, and the size of a medium was more like a large for $17. Add-in that this is North Carolina and I'm a pizza snob from Chicago. Solid za all around. Crispy outside, chewy inside crust, good not great. Toppings, cheese, and sauce all authentic. If you're in a hotel in University City like me and in the mood for a good pizza that crushes the chain joints, find a way to pick up one from here. Shame they don't deliver in an area surrounded by hotels."}
{"text":"A great italian dining experience.

I like this place because it's upscale casual.
The menu is diverse and the food is excellent.

I had the grilled salmon with shrimp with linguini...goodness.
The service was great.

The romancing accordian player was a bit loud and annoying at times."}
