{"text":"Such a disappointing experience and a huge misstep by the casino.  My review is solely based on Sunday brunch.  Based on their advertising, I was truly expecting a completely new and exciting  experience.  However, this is the exact same Brunch they served at Verona.  Our server was clueless, inexperienced and inattentive.  Tables were crammed together and the dining room itself just felt uncomfortable.  It's a smaller space room than before but I think it's because they carved out a private room for their Platinum players. Food was mediocre at best.  Desserts were still the same old off-site prepared desserts - boring & tasteless.   I recently received a BOGO brunch offer.  Didn't even use it...wasn't going to waste my money or my casino comp money.  The best part of this horrific experience was the Chef who was making omelets to order; she had a winning smile and an awesome attitude."}
{"text":"Let's discuss brunch.

The good, the bad, and the ugly.

The good: The staff working in the restaurant. They are extremely friendly and bust their tails to provide good service. They are fighting an uphill battle against whomever it is that designed this brunch layout.

The bad: Very limited options for brunch. Before they changed over to Cities the brunch was actually done quite well. There were many options available that represented both lunch and breakfast. This new arrangement of tables and service was horrendously thought out. Just to access the cold shrimp one must walk down a narrow corridor and share a room with servers coming in and out. 

The ugly: The general concept. As stated previously the prior menu for brunch was done very well. There were cold cut options, cheeses, various breads, an omelette station and even just plain old scrambled eggs if you wanted them, several hot dishes as well as an exceptional dessert table.

Here's the bottom line, you have a prime rib station, at which most of the time the prime rib is mediocre. You have a waffle station which seems woefully under used and a single chef at an omelette station.  Customer flow bogs down at the omelette station simply because there are no other options and only one person. 

Moreover they are allowing children into the restaurant now. I think that implies they are trying to make it not just a draw for the gambler but an actual profit producer. In order for that to happen there needs to be some serious rethinking on the menu, the flow, and the concept. Nothing is working right now. If management is reading this, you really screwed up when you changed from Verona."}
{"text":"While others commenting aren't so happy, my wife and I find Cities one of our regular places to go when dinner out is on the menu.

A great place with great service---Thomas is THE BEST!  And Manager David makes sure everything is to our satisfaction---never a disappointment.

The choice: go there for our week-day night out or the Sunday brunch---a tough choice to make.  In fact, we do both a couple of times a month."}
{"text":"If you want mediocre food and terrible service, this is the place for you! Clam chowder is delish but not worth the crap service. Other food is just okay, at most. California chicken sandwich is terrible and dry. Turkey burger is decent. Fries not seasoned. It's a convenient place to eat but it's not worth it..."}
{"text":"Great food and service even on Thanksgiving Day. We had a party of 11 and yet everything arrived hot and as we ordered. Chefs squash soup and the turkey were knockouts. Servers were efficient and anticipated our needs. We will be back for the brunch next."}
{"text":"This is a definite step down from the previous Verona Steakhouse. I'm not sure whose idea or why they closed Verona and opened Citie's B&G. We went for the Sunday Brunch, which we have been going to for several years at Verona. They raised the price substantially and have the same food, although the scrambled eggs were just awful. They actually used to be eggs. I miss the ambiance of Verona. It had class. It was hard to have a conversation with my husband across the table since he was so far away. The music for Sunday Brunch was OK, but I miss the soft jazz. It was very loud in there and not just because of the music. It's also very cramped now. I doubt we will return. I do want to add the service was great. Our waiter, Thomas did a great job. Luckily, they kept the great omelet chef."}
{"text":"If I could rate this place zero stars, I would. Our first mistake was not checking Yelp reviews. We should've also noticed the red flag being there were only a few tables occupied during dinner hour on a Saturday. But we took a look around and since it looked like a really nice place and the food was priced a bit on the higher end, we assumed the service and quality standards would match. 

I'm not sure why, but our server, Dennis, was rude from the very moment he took our drink order. You'd think with only a few tables, the service would've been better, but several times he walked past our table without even looking at us, almost as if he had \"blinders\" on. We had to flag down other servers every time we needed something, and at one point my husband noticed his beer sitting at the bar waiting for a server to run it to him and went up and got it himself. Ridiculous! The food also fell short. My husband sent his Jambalaya back (it looked and tasted like beef stew), and I kept my salmon dinner only because I was starving, but it was overcooked and dry. They did remove the Jambalaya from our bill. We let the manager on duty know about our experience on the way out, and she smiled and said \"ok, thank you for letting me know\". Never again!"}
{"text":"This review is for Sunday brunch only:  We used to go to the Verona Chophouse several times a year for Sunday brunch.  We enjoyed the wide selection of items and the mellow atmosphere.  We went today partially to celebrate a birthday - and had requested a specific server in our reservation if she was available.  The server we had requested had been sent home because they were too slow (Verona Chophouse was always packed during the winter), so we were a little disappointed in that.  Cities Bar and Grille is a much more updated look, probably better suited for a casino. I'm not sure I like the lack of separation of the bar and restaurant.  You can sit and watch TV from the restaurant area.  We found the food very good and enjoyed everything we ate, but there are probably half the selections available that there were previously.  The server we did have was quite attentive and very pleasant.  Overall it was an enjoyable experience, but we missed having the wonderful choices of cheese, berries, the small desserts, and wider variety of entree items.  The salad was fine, but there was no vinaigrette choice for dressing.  If you're not a prime rib fan, you're there pretty much for breakfast.  The waffles were wonderful."}
{"text":"My bff and I go almost every Sunday for brunch their food is  so delicious and the atmosphere is friendly, inviting and comfortable.  Shout to all the staff and Heather your smile makes want to stay longer."}
{"text":"Stopped in 10 min before happy hour and asked for specials. Bartender rudely says \"its not happy hour yet! We said we would wait. She is annoyed. So we left."}
{"text":"Came here with my husband and his friend. I ordered the BBQ sandwich that was pretty good. My husband ordered a caprese sandwich that looked gross. He said it was flavorless, and I guess that's why they gave him so many fries to compensate.  Being that this restaurant is inside a casino we never visit I probably wouldn't return."}
{"text":"Great brunch with a lot of variety. What really stands out in addition to the food was how nice everyone in the staff is. They all are friendly and seem happy to be here."}
{"text":"The Sunday Brunch is AMAZING!! They have a wide assortment of freshly prepared breakfast & pasta choices as well as an entire array of everything: from pastries to prime rib to biscuits with gravy to shrimp to fresh fruit!! The staff was patient & very friendly & we arrived about 15 minutes before they were getting ready to close. They did not rush us & offered to bring waffles to our table rather than have us stand & wait for them!! Everything tasted fresh & delicious, not like it had been sitting in a warming tray! We will DEFINITELY be back for brunch!"}
{"text":"Went for Sunday brunch w my family.  Nice looking restaurant.   Very poor management and just ok food.

Prime rib was overlooked.   Omelet was ok.   Soup overly salty.

10 mins trying to seat 4 people when there are 10 tables empty.   Buffet line setup is not efficient.  Very slow process.

Will not return."}
{"text":"We had good and bad experience at cities. We will try one more time for Thanksgiving!!"}
{"text":"Service was not the servers fault. The bartender and chef did not cut it.
The meat in each of our entrees was over cooked & bland. So, over priced for the quality. The inside is nice & trendy, but I wouldn't consider it fine dining or high end dining, more like old school dive-bar food. Most likely won't return unless there's diff kitchen & bar staff."}
{"text":"This was only our second time here but you know it's good when my husband wants to go because he tasted what I ordered the last time we were here and he's craving it 6 months later, it was the Prime Rib with a baked potato and salad by the way,  and it was just as good as he remembered  I on the other hand wanted to try something different and something I wouldn't normally cook at home. Our waitress Heather was so great and super funny, she helped me decide on my dinner which was the salmon with wild rice and veggies,  I asked for lemon to squeeze on top because that's all I know to do when it comes to anything fishy like that.  I gotta say I'm so glad I ordered this. It was absolutely delicious.     We also had these chicken,  black bean and corn egg roll things as appetizers sorry I can't remember what they were called but those were fantastic as well.  We didn't order alcohol and our entire meal was Just under $50 which we think was pretty reasonable.  The atmosphere was great, and the staff was super helpful and nice.  We made reservations although it's not always necessary but glad we did. Great date night! Thanks again to our awesome waitress Heather for the wonderful service and laughs"}
{"text":"We frequent Lone Butte casino way too often (lol) and always need to get something to eat while there. Everything we ordered was well done, even prime rib that was ordered medium rare to the rare side. Refused to accept it and sent back and ordered a  steak instead to replace it, medium rare, and it came out well done also.  Hubby had ribeye and 80% of it was fat and gristle. Noticed that the people at the table next to us also sent their meals back when they were delivered. Don't know what the problem was with theirs, but I could guess. This looks like a fining dining place, has fine dining prices and is just terrible. My dog was happy though, got a huge doggie bag!"}
{"text":"Service good.  Prime rib mediocre.  Nice atmosphere after gambling at casino.  Great lobster tail."}
{"text":"For Sunday Brunch:

$19.99 for each player's club member in your party and $24.99 for the others.  Good selection:  omelet station, waffles, prime rib, shrimp, salad and a few prepared dishes and desserts.  Price includes coffee, tea, soda, etc.  

The food quality is pretty good and the restaurant is nice.

If you'd been to the previous restaurant in this place, it's the same."}
{"text":"Atmosphere nice, service good, food sucks!
Worst calamari I ever had. Prime rib sandwich had no flavor and was extremely dry."}
{"text":"If I could rate this place zero stars, I would. Our first mistake was not checking Yelp reviews. We should've also noticed the red flag being there were only a few tables occupied during dinner hour on a Saturday. But we took a look around and since it looked like a really nice place and the food was priced a bit on the higher end, we assumed the service and quality standards would match. 

I'm not sure why, but our server, Dennis, was rude from the very moment he took our drink order. You'd think with only a few tables, the service would've been better, but several times he walked past our table without even looking at us, almost as if he had \"blinders\" on. We had to flag down other servers every time we needed something, and at one point my husband noticed his beer sitting at the bar waiting for a server to run it to him and went up and got it himself. Ridiculous! The food also fell short. My wife sent her Jambalaya back (it looked and tasted like beef stew), and I kept my salmon dinner only because I was starving, but it was overcooked and dry. They did remove the Jambalaya from our bill. We let the manager on duty know about our experience on the way out, and she smiled and said \"ok, thank you for letting me know\". Never again!"}
{"text":"This was a good place within the Casino to avoid the nasty smell of cigarette smoke.  Our server was great!  There is a really nice looking outdoor area where you could sit to eat.  Food was very good.  I got the jambalaya and my wife got the french dip.  Our only issue was that it took a while for food to come from kitchen.  We enjoyed our experience."}
{"text":"Grilled children club was excellent and hearty and a decent price. Waitress was very attentive refilling our drinks every time the glass was half full. I would recommend this place."}
