{"text":"The first time i went there around the grand opening the quality was nt bad but after being open for a year or so it really shows how they dropped  their standards. All the meat is either burnt or slimmy and clearly all frozen items. I will never return to this establishment highly disappointed"}
{"text":"This place is a little gem tucked into a strip mall.  (Placement, by the way, has nothing to do with the quality of the food!). The best Chinese restaurant I've ever been to was in a strip mall in Texas.  Don't judge the book by its cover guys!    The egg rolls are great here, the wonton soup is wonderful, and entrees aren't just your same old same old Chinese  fare as far as flavor goes.  Im a big fan of the chicken in garlic sauce.  It is Addictingly delicious, and unlike anything I've had anywhere else. - in a very good way.  The place is clean, the service is very friendly, and the food incredibly fresh & tasty.  Don't skip it just because of the location, you're missing out!  Oh, and your wallet will be happy too.  The portions are big & the check is small.  Make someone's day with a gratuitous tip.  They will remember you!  My mom and I love this place!"}
{"text":"We ordered the Hunan chicken and Szechuan beef for dinner and added sweet and sour soup and egg rolls to our meal.  What a great deal!  You can add the soup and egg roll for just $2.50.    The hot and sour soup tasted perfect but was missing  pork strips and the mushrooms were regular canned mushrooms and not the Chinese black mushrooms and tree mushrooms that typically are in this soup.   I loved the egg rolls because they were hot and the vegetables in it were crunchy and big.  They were light on the amount of shrimp in them (I only had 2 pieces in mine) but still, they were very tasty.   The Hunan chicken had a very good amount of tender chicken, a decent amount of varied veggies and was tasty but a bit too salty for my taste.  I also prefer my veggies on the crunchy side and the broccoli, pea pods and other veggies were not soggy but were over done for me.  The amount of spice(hot factor) was perfect and it was served piping hot.  The Szechuan beef was very tasty, had a good amount of beef and veggies.  Spicy but not overpowering.    What impressed me about this Chinese restaurant was that the food was served piping hot, the service was superb (our waitress served all of our dishes in perfect timing and we never had to ask for our water glasses to be filled).  An additional perk was that the pricing on the food was great.  We had considered going to the  buffet place which is 4 doors down from here but opted to go to a regular full service restaurant instead.  We were so happy we choose this restaurant.  I hope they continue to thrive and we will be back on a regular basis!   When compared to other Chinese restaurants in the area, I would  highly recommend this restaurant vs. others."}
{"text":"Well prepared typical Chinese food. The veg is not overcooked and all of our items came out freshly made! Egg roll was right out of the frier. It was a long wait for the food to come but worth it. Portions are decent size and tea was good."}
{"text":"I ate at this place for the first time yesterday. I had a very good experience. Food was tasty lots of meat and vegetables! They definitely do not skimp out on you . You get your money's worth for sure.  My fiance and I had hot and sour soup, Chinese hot pepper chicken , pineapple shrimp and vegetable lo mein.  Everything was delicious and in large portion.  I will definitely be coming back.  Service was good and friendly."}
{"text":"I love this place but last 2 times I believe were a wed or Thursday they were closed till 3pm? We were there at 1pm each time. A shame we ended up in McMurrays sesame inn which now is closer and they deliver to my apt. Where as CCC don't deliver any time. If they had Delivery there are 90 tenants in my apt in bethel park and we get Sesame inn delivers lunch. Please CCC get delivery!"}
{"text":"3.5 stars!  I stopped in here recently while on a site visit in the area.  Classic Chinese Cuisine isn't really 'classic' at all.  It's Americanized Chinese food.  Let's call it 'Classic Americanized' Chinese food.  On the other hand, Americanized Chinese food can be quite good.  In fact, I love it!  So Classic Chinese Cuisine is your typical strip mall Chinese joint.  Nothing here you haven't seen before.  And they have your typical lunch specials here too.  The food here is good though.  I still love some of the names places like these give their dishes though.  'Eight Treasure Chicken'?  Makes me wonder what the eight treasures are and if it's better then \"Seven Treasure Chicken'.  I went with one of my standbys, Sesame Chicken.  So places like these won't rock your socks, but they'll definitely fill the bill when you need a quick lunch or you don't wanna cook and you need some take-out."}
{"text":"Skip the Chinese Buffett next door and try this place. Solid food and great staff. Might not have much atmosphere but more than makes up for it with service. Inexpensive lunch menu that is quick and delicious. Say no to fast food and give it a shot"}
{"text":"This place is pretty good, like a lot of other Chinese places in the area. There was no stand out flavor in their dishes but rather just the expected flavors. The place is nice inside and the environment is pleasing. Service is on the slow side however is still very friendly. There isn't much that sticks out about this place but that being said it is still a good place to eat if you are just looking for ordinary American Chinese. You want Fwied wice?   I would stop here if it was convenient, maybe a dinner before a movie if time was an issue."}
{"text":"Typical Chinese restaurant. I have no complaints about anything I have eaten here. I have never eaten inside and have only done take-out, I would definitely order more frequently if they offered delivery. I prefer this Chinese to others in the area."}
{"text":"An unassuming restaurant's spin on Szechuan Hoi Sin, an opulent combination of lobster tails, weighty shrimp, fat scallops and various steamed and caramelized vegetables, somewhat reinvigorated my interest in Chinese cuisine weeks ago.   As its name implies, Bridgeville's Classic Chinese Cuisine isn't bent on turning expectations inside out. A shopping center treasure of the suburbs, CCC just does the usual things well in a modest setting.   Take for instance their plump, moist-as-meatloaf pork dumplings or their egg rolls, each of which are a cornucopia in a deep-fried potsticker. Both the former and latter were so exuberantly appetizing, we doubled our orders, nearly allowing them to wholly comprise lunch for us.     Fortunately, I managed to save room for the aforementioned Szechuan Hoi Sin, a dish so prodigious in terms of portion size, it could have fed two or three guests. Alas, I needed a box for half of it, and it still managed to enthrall the next day, even after a spell in the microwave.  I can't bestow a full 5 rating to CCC since I wasn't exposed to anything I haven't had before in another permutation. Facing facts, this was the same veggies-with-a-protein-rice-and-a-sauce I've had all too many times, and I kept getting the vague feeling that had I ordered an entree with poultry or beef, ennui would have overcome me. Nonetheless, the Szcehuan Hoi Sin was an oceanic dazzler ornately presented.   It doesn't need to be stated that the Pittsburgh area is overrun with dinky, takeout-only Chinese joints, but if a case for the sit-down Chinese meal with fancy silverware, white tablecloths, and dapper, professional servers is to be made, Classic Chinese Cuisine is the most persuasive and passionate of advocates."}
{"text":"Family run chinese cuisine. Very good flavor and nice portions. Their chicken egg rolls are very good."}
{"text":"Best cold noodle sauce that isn't peanut butter based !! Perfect sweetness that you want to spoon up every drop"}
{"text":"I really enjoy this restaurant. The prices are reasonable and the servings very ample. Get the soup and shrimp roll for only 2.75 more. Food takes a while but is worth the wait."}
