{"text":"I will start off by saying I did enjoy the food here although we were only there for their happy hour special for $3 sliders.  The service was good as well, our server was friendly and helpful.  We tried the lamb, duck, chicken and soft shell crab sliders.  The duck wasn't my favorite but still good.  The buns used for the sliders is heavy and gets gummy after the second or third one.    Our cocktails were pretty good as well, mine was wrapped in a brown paper bag, would never ever pay full price for it though.  Ok so sounds better than 2 stars right?  I would've given this place 4 stars however here's two things that really annoyed me.  1. They charge for tap water...tap water, are you serious? Of course we weren't informed of this until the bill came.    2. It's an open kitchen, nothing wrong with this, however I could see everything.  The cooks were playing with their phones in between preparing the food and NOT washing their hands after.  Unless the phones have been sanitized before their shifts which I'm assuming they weren't, this is super nasty to see.  Also another cook started having a sneezing fit in the kitchen, yes she sneezed into her arm, however blew her nose in the tight kitchen area and again didn't wash her hands."}
{"text":"Have had a couple of nice meals at Cleaver. First Clever experience, my friends and I enjoyed all of the dishes, which we shared - Kale chicken salad, feta and bean bruscetta, selection of three sliders and the tuna wraps. We finished it up with the salted caramel fondue which came with donuts and homemade marshmallows - amazing! I have come back again just for this dessert dish.  The atmosphere was great, and had no issues with the service. Others have complained about the price, but we got a lot of food for a reasonable price. I have been back for dinner and brunch, and will definitely keep Cleaver on my rotation. They also have some very tasty cocktails."}
{"text":"I really enjoyed this place until the 4th visit when the bartenders were watering down our drinks . There was zero alcohol content- and at 12-15 bucks a cocktail.. Feel cheated as I really did like this place. Great ambiance and menu, really great cocktail menu- I liked the owner and the staff- just felt that the bartenders had a hate on and it brought the whole place down. But really great service otherwise."}
{"text":"This was our second visit to Cleaver, our first visit was during AB burger fest and the second was for their pop up long weekend brunch. Our first visit was great, the patio is a beautiful south facing little spot that is great for drinks and people watching and the burger was great as well.   For brunch we were able to check out more of the interior of the resturant and although we were not sure exactly what direction they were headed for the decor we eventually settled on southern farm. It was cold and rainy outside but with the leather and wood decor and gas lanterns inside it was welcoming and cozy.   Love the coffee here. It is served fresh ground in a French press which delivers great flavour but for a first time user of a French press can be a bit intimidating. I ordered the pancakes with bacon and blueberries. When it come it looks small because of the plating but really there are 3 full size fluffy pancakes and 4 pieces of bacon there. I really enjoyed the dish, the pancakes were fluffy and the bacon was extra crisp just like I like it. The pancakes come pre-dressed with syrup but there was just enough to give the sweetness and not a drenching which I really liked. My husband ordered the hangover chorizo hash with baked egg. The dish had a great seasoning on it and the egg was a perfect creamy sunny side that broke beautifully into the hash. He really liked the chorizo as well and said it had just the right amount of spice and great flavor.   Although breakfast was enough, we also opted to order the duck fat fries afterwards. They were great. A fairly large serving that stayed crispy and were well seasoned right down to the bottom of the bowl. Don't be afraid of the curry aioli either it was a great addition that had us going back for more.   Overall both experiences here have been very good and we will be keeping it on our list of places to return to."}
{"text":"A lesson in poor customer service and poorly trained management. First off, let me say most importantly the food was great.  The kitchen kept their end up and the bar staff also pulled it off well.  The disappointing factor during our visit is the person at the door, we believe was a manager, name Alex - what a disappointment. We booked reservations for NYE dinner for 9pm. Showed up and we were put to sit at the bar. When asked, Alex told me that was the reservations. I reminded him we reserved with Open Table, and as the name implies, we should have a table. He swiftly informed me if I wanted a table I was to put that in the comments section. Clearly, Alex must think I am an idiot to assume that making reservation for a table doesn't necessarily include a table!  Now, he could have said something to the fact; I am sorry, we do not have any tables available, and we didn't get an opportunity to update the reservation system.  With it being NYE, tables are staying longer than expected, and the only spot we have is at the bar.  But no, instead, I spoke to me as if I should have known better not to expect a table would be reserved. I tried to make it through the night, but just couldn't shake the incompetence of Alex. This was unfortunate. And yet a reminder to those that know how to engage a customer and deliver great experience. So if you are thinking about making reservations, you might want to add in the comments section that you want a table or they will sit you at the bar."}
{"text":"Best old fashioned I've had in Calgary. Cocktails are 2oz. Bartender was friendly and helpful. Service was fast. Try the lamb - you won't be sorry!"}
{"text":"I was meeting a friend for brunch the other day and when they suggested Cleaver, I was eager to try it! I had heard many things about it, but had yet to visit myself. The decor is gorgeous. I love the industrial feel to it. I imagine the folks at HGTV would call it 'rustic chic', as it's welcoming but also very trendy.   I tried the Spinach and Goat Cheese Eggs benny. I really enjoyed this dish. The hollandaise was just right (hollandaise can so easily be messed up) and the flavors of the goat cheese and spinach married really nicely together. The hashbrowns were really good too. I actually enjoyed that they weren't overly fried. It made the dish not feel so heavy. My only complaint is that I wish there were more hashbrowns on there. I had many 10 potatoes on my plate, which felt a little stingy honestly.  Otherwise, it was a wonderful meal. Our server was really lovely. She was attentive without being overbearing and never made us feel rushed. I want to go back for their happy hour as their cocktail menu looked super cool!"}
{"text":"Service was non existent. Manager ended up placing us at the bar even though we reserved a table.  We ordered the bucatini but I wanted the egg they put on top on the side to which she argued that there is no way the cook would agree but could not provide any rationale other than they simply don't do that kind of thing.  This place is pretentious, overcharge for their tasteless dishes.   While we were there, the manager began to talk down his bar manager in full view of patrons.  How professional is that?  Be prepared to wait an extremely long time to get your dishes."}
{"text":"We went to Cleaver last night, and once we finally were sat, it was great. However, we had made a reservation a month ago, at 9pm and it took 45 min to get a table. It was a sense of chaos and they seemed extremely disorganized in their seating process. Why make a reservation if you just have to wait, for 45 minutes at that. That did leave a poor taste in our mouths, but after that the service was great, as well as the food."}
{"text":"Delicious food fabulous staff... you'll see a lot of interesting presentations for different dishes and drinks and also creative combinations on each plate. Specials are quite intriguing, try it on a Monday!"}
{"text":"The food was great and the service was excellent, up until we paid our bill that is. We were asked to leave right away to free up the table. For that reason I wouldn't return or recommend."}
{"text":"Happened upon this place walking up 17 Ave.  Very glad we did. I was surprised to read negative reviews from others. We thought everything was amazing including the service. Most of all, loved sitting at the bar watching the talented tenders mixup amazing cocktails! The sliders that we got at happy hour (9pm till closing) were incredible and worth way more than we paid. Awesome atmosphere and service! Sit back and enjoy!"}
{"text":"Loved our first visit at Cleaver! Go during their Happy Hour - it is impressive! All cocktails/beer/wine for $6 and sliders for $3! There are so many options to choose from we were full and didn't try the mains. Roasted cauliflower is pricey for what it is, but the Bomb fries were amazing! Be careful - it is hard to find for some (only sign out front is a meat cleaver)!"}
{"text":"The Food was good, and our server, Landon was great, but the host was terrible. He constantly rushed us to complete our meal in two hours or less because he had another Reservation coming in. Did not take feedback well and was rude."}
{"text":"I 200% agree with Carli W below - I went in a group of 7. Five of us were seated and were waiting on two. Reservation was at 7:30.   We ordered 3 appetizers to start with and some drinks. It was now 7:50. My friends were looking for parking at the time. then the hostess comes up to our table with two guests and tells us its been an hour and that she needs to take a table away.  I told her our reservation was at 7:30 and she said yes. Then I told her that it's only been 20 minutes and that we ordered food and drinks already and guess what she said? - \"do you want me to call my manager?\" Funny thing is, my friend just then arrived. \" There they are.\" Hostess turned away, clearly pissed.  Food was mediocre (6 appies and steak), the steak we ordered took 40 mins and it was bleeding raw - what?. I couldn't eat it I paid $60 for a dinner I hated. We will not return. They're all about turning the tables for more money. Management and servers alike, which I understand but there is no need to be rude especially when the majority of the party is here. First time in a very long time that I tipped 5% - my standing average is 15%.  By the way, you guys just made the top of my very short list of two most hated restaurants in Calgary. There are SO many good restaurants on 17 ave and 4th, don't waste your money here. I just wish there was a way to place zero stars."}
{"text":"Cleaver was one of our stops on our 17th Ave Bachelorette Pub Crawl and we were able to make resos for 8+ guests. However upon arrival, our table was not ready quite yet due to a previous party that hadn't wrapped up yet. They were able to get us a couple separate tables so we wouldn't be lingering about at the front entrance.  The second we sat down though, we got 5 star service! We were greeted with glasses of champagne (that were never empty at any point of the night) and we were never short of cocktails from their extensive menu.   Their food. OMG. I dunno about you but when we drink, it's all about the carbs.The brie, basil pesto and shaved pear on fig & walnut bread? Scrumptious! Grilled cheese and tomato dip? Look at all that oozing cheese! The baked bread with chicken drippings and bacon butter? I would have drank that bowl of deliciousness if no one was watching. Warm bread slathered in bacon butter and dipped in chicken gravy. Every word in that sentence is perfection.  Not only are their cocktail names witty, but they're creative in flavor too. If you want to see cotton candy incorporated into a boozy drink, Cleaver is where you'll find it!"}
{"text":"Wow.  I have not had such a great experience as I had last night at any place in Calgary in a long time.  This place is awesome. The food is fantastic and unique. The service is friendly and the ambience is very cool.   First of all, its busy there. In a great way. But things run very smoothly and no one makes you feel rushed.   The menu boasts a lot of delicious and inventive small plates as well as some larger items for sharing. We have the kale tempura (yum), duck fat fries (could not stop eating these) and the strip loin steak to share (melt in your mouth). But by far my favourite was were the scallops and blood pudding. Just wow. I could have eaten 10 plates of those. We finished the meal with toffee pudding. Delicious. All the food was perfectly cooked (and showed up hot!) and served in a casual rustic style. Its definitely a classy casual kind of place!  They make a \"smoked\" old fashioned and the preparation and presentation are worth whatever the price of the drink is. They put a lot of care and love into the details and it shows in everything you experience at Cleaver. All the servers were knowledgeable, super friendly - it already has a neighbourhood feel despite not being open for very long.  I cant wait to go back and try the sliders - we spied some from afar and they look spectacular!"}
{"text":"Probably the best happy hour this side of the US boarder.  $3 sliders, $5 cocktails, wine and beer.   This restaurant has a few kinks to work out communication wise(between staff, kitchen, bartenders and customers).  Once they do I think this restaurant will do well.   It was almost like watching a comedy of errors.  My table and I were laughing hysterically at times.  The issues our table did have were rectified professionally.  Once my dish did arrive and they finally remembered to take everyone's order, the food was cooked perfectly.  It is by no means a fine dining experience.  It is casual food and drinks.  I wouldn't bring clients or family here, however for friends, it's perfect.  Their expensive old fashioned was amazing.  Their cheap old fashioned was the worst I ever had.  Maybe they did that on purpose so I'd order the expensive one.  Lol.  I would definitely return for their happy hour, well worth it!"}
{"text":"Cleaver is overall one of my top 3 favourite places to grab a cocktail on any given evening. Cleaver is great for a casual hang out, girls night, or an intimate date. It's pretty small space though so you're basically shoulder to shoulder with other diners.  The cocktails are crafted with care, and the food is rich and delicious. They have a very large selection of drinks and cocktails, so there is something for everyone! The G-spot, randy granny, immigrant, slap your mama...with those names it's hard not to have a good time. I also think the happy hour is one of the best in the city.   My only problem with Cleaver is that they really need to make the patio first come first serve. The last time I was there they had some weird wait list with people that were not even at the restaurant.. and the patio seats were empty for at least 30 minutes.   Besides the seating woes, Cleaver gets a thumbs up and I'll continue to recommend Cleaver when friends are looking for somewhere to go!"}
{"text":"arrive on time and are told there will be a wait (as always at cleaver - whatever). They were self-assuredly kind enough to offer a round of prosecco on the house -- nice, differentiating touch. Then we get to the 30-minute mark of waiting outside in the cold for our table and I request another round on the house. Waiter obliges and brings it over making it clear that it's also on the house. We finally get seated about 55 minutes after initial reservation. As we are being walked to table \"manager\" apologizes profusely for delay and says first round is on the house. So we decide to order great cocktails to start even though plan was to just drink wine. fast forward through a good meal with great food and company; we even made friends with the girl at the next table. Service returns to gruesomeness when the check comes. Collectively we were under the United understanding that we were getting a total of three drinks comped. Waitress thinks it's just one.  Politely set her straight and get the earlier waiter involved, remind him that we requested the second prosecco be comped and he explicitly stated it was comped when we delivered it to our table. He relented. Then it comes to our attention that the first round was also on the bill, and both the waitress and the waiter want to fight us. I request manager. This is when things get theatrical. We engage in respectful but forceful pushback on the bill and he responds with vitriol colored by years of disillusionment. He says we should be grateful that the first two drinks were comped and forget comping the third. We remind him that we were outside for an HOUR in windy 8C weather with improper heatlamps (they're there but do positively nothing) and that's when he flashes into a memory of himself as an angry father beating his children (meanwhile were being far humbler than necessary by \"apologizing for miscommunication\"). He yells at us for changing the reservation from 8 to 6 to 4 and says we should count our blessings because no one yelled at us before. (For the record, we diligently called to shrink the reservation, giving ample notice, and when we were finally escorted from the freezing patio over an hour after our reservation the waiter appeared relieved that we were 4, not 6, because otherwise he wouldn't have had another table and there would've been no hope for us). Then the manager absolutely loses his calm and bellows that we should never come back to the restaurant. EVER. IN OUR LIVES. So let's be real and recapitulate this dysfunction. We are left to freeze for an hour to have to demand second prosecco, everything is made okay by the promise that first round of cocktails is on the house. Then he kicks us out in a fit of anger, even though he and his team entirely screwed us over, and we were obviously more than convinced to never go back anyway. The waitress was as incredulous as we were at his actions but couldn't do much. I asked her if he has anger issues and she said she couldn't answer...that's a yes."}
{"text":"The food is pretty good but the happy hour is unbelievable!! It's available most hours of the night and is the BEST place to go for cocktails. An extensive list and all for $5 during happy hour. Sliders are ok but for $3 how can you pass that up?"}
{"text":"Service:  I was late joining me boyfriend by 30 minutes in that time he had a drink and appetizer. But on arriving it took over 15 minutes to see a waitress. Then on  ordering she was rude  (only distinguishing feature was she had ink sleeves) and was abrupt.    When asking about how an old fashioned was made at this restaurant she actua?y huffed and said the same way they make them everywhere.  Meaning she had little beverage knowledge and experience and she had a bad attitude.   Drinks:  I ordered the Catholic it was delicious ($10). My friend ordered the smoked old fashioned and it was $17 and not really anything special. They charged $8 for pilsner (the brand) on tap.   Food:  I have no idea what my boyfriends appy was but he said it was good, my friend said the Yorkshire pudding was good, though he had never had one before. My calamari was okay but for $15 I have to say 8 pieces is pretty sad (by the way this was ordered before our friend came). It looked sad when I got it and was definitely hungry when I finished. My boyfriend and I  ordered our salad at the same time as our friend ordered the yorkshire. 45 mins after our friend got his dinner the manager came by to say sorry our salad was taking so long but the kitchen had dropped the plate and it was going to take five more minutes to cook new chicken. 15 minutes later our server dropped by saying nothing about the salad and we informed her we didn't want it and said we were going to go. Then another five minutes later she came back and said the kitchen had just plated it and she was going to pack it up and take it off our bill. 10 minutes later we got our on the house salad, to go, and paid the bill.   When  we got home and took a look at the salad I have to say I was pretty insulted. A bed of kale some chicken slices and a blob of goat cheese, THAT'S IT!!! For $17, glad we didn't pay.  Wouldn't recommend and will definitely not go back. This place is stuck in the past of old Calgary where a mediocre restaurant can charge a fortune because it roasts a whole chicken and calls it \"cock\" on the menu and drizzles truffle oil on poorly assembled menu items. News flash Calgary is in a recession and I don't appreciate your pretentious, low quality food... even if you wrap it in a hipsterish bow."}
{"text":"For starters, I met the server that everyone was talking about named Austin, and he is good people! He made sure I was comfortable as I waited for my hubby to arrive. He definitely knows the menu and I appreciated his recommendations, honesty and demeanor.  We each tried the Autumn Fizz cocktail. It was refreshing, but I do think that and their other cocktails are a tad bit pricier than needed. We paid $30 just for two cocktails....  Anyway, here is where the review gets juicy... we ordered: 1. The bone marrow: This stuff comes piping hot and it is a greasy, delectable treat. The bone marrow in its nature is greasy/oily but they compliment it really well here with a bangin' chimi churri sauce and toast. It was my first time trying bone marrow and I was not let down! 2. The trio sliders: We chose the buttermilk chicken, which to me ALMOST beat out the soft shell crab, but the cool cucumber and sauce on the chicken was just incredible. I appreciated our server warning us about the nature of a soft shell crab just in case, but it was so delicious! Finally we had the lamb slider and it was also good. 3. The double dipped duck fat fries, with parmesan and truffle: Like I said in my photo, these little potatoes are worth being fat for!!! I will rave about these and I would go back just for these alone! My hubby almost lost some fingers near the end of the bowl! 4. The salted caramel fondue: This comes with house made marshmallows and doughnuts and it was a really nice end to the meal. I could have drank the caramel sauce! My hibby also tried the sticky toffee pudding, but after the caramel sauce, it wasn't super impressive to me. He loved it though!  Overall, Cleaver was a fantastic way for us to try some new and different foods. We will be back, but not for a while. To us and our lifestyle, this is not going to be a regular haunt but more of a place to go when we want a treat!"}
{"text":"The ambience is great! The sllider (1) is $7 & they charge $2 for a $500ml of distilled water! Pretty overpriced place I must say.  Oh! & the cutlery resembles dollar store stuff!!"}
{"text":"Summary: interesting new cocktail lounge/restaurant that could be improved with better service and cocktails.   Went for Tuesday \"7$ cocktail special\". Ordered a Manhattan and Creamy Polenta. The latter was delicious with mushrooms and truffle oil. It definitely hit the spot.   However the cocktail was another story. It was bland and flavourless. I was excited that were using Alberta Premium Dark Horse. I use this as home everyday to make Manhanttan's but Cleaver's version was uninspiring and definitely not worth the 15$.   In addition, apparently not all cocktails were 7$ specials. Apparently, it was only a select few which was not made obvious to us. The server made good by giving us a drink for free but we had to fight for it. Table of six also has automatic gratuity of 20% which seems on the excessive side. Typically it is 18% for table of 8 or more."}
{"text":"This experience was so so. I ordered chicken and waffles and they cooked the chicken using the sous vide method. They insisted the chicken was cooked but one particular piece was bloody inside and the blood went all over my thumb nail. It seemed to be a big deal when I told the server and they kept explaining it was cooked so, in order to avoid making my whole table feel awkward, I kept it. I avoided that piece of chicken. But the waffles were good. My husband ordered the poached egg on the avocado toast and he said it tasted like nothing. They don't supply salt and pepper on the tables, which is inconvenient, because we like salt & pepper on our eggs but we didn't bother the server because she was extremely busy.   Having the ability to season our food would've been nice but we couldn't. I find this a very strange practice. Everyone has a different sense of taste. Please let us salt & pepper our food if need be.   The atmosphere is very loud so don't dine here if if you want a quiet experience.  I'm not sure I'd return here.  It wasn't great."}
{"text":"Yay cleaver! Your food is delicious, your drink menu Devine. If I didn't have to sit on someone else's lap to eat everything would be fine.   Rhymes aside. This place is rad. It has great ambience, friendly and attentive staff, yummy food and an awesome assortment of drinks.   Sitting by the kitchen along the bar is my favourite place to sit. Here I can watch the activity from the back and front and don't need to worry about someone else breathing on my food. I've been here a handful of times and I always forgot how close the seating is so I'll laugh when they seat me literally hip to hip with another person, and I will kindly ask, may I sit by the bar instead please? (they're always happy to oblige).    Did I mention the sliders that are on sale during happy hour? You have to try one of those!!"}
{"text":"Met some friends here for a Sunday brunch back in mid December. Heather had heard great things and the photos looked amazing, so we were very much looking forward to trying this spot.  It's a very nice restaurant, I thought the layout and open kitchen were really cool. We were seated up by the front window... the girls ordered Caesars and mimosas and I started with a pint of Parallel 49 Jerkface 9000.. good start, right?  The food here looks fantastic. As plates came out to other tables we found ourselves checking them out, commenting and being impressed. Ultimately the esthetic qualities of the dishes would trump the flavor unfortunately. Heather and I each ordered Bennies... he the Buffalo Chicken, hot sauce and celeric slaw; me the Spinach, mushroom, goat cheese and crispy onion. We shared and swapped for a half each so we could each try two different kinds. Again, both were good just not as great as they looked.  Most disappointing was our server here. We had a young lady who seemed very disinterested in her job. Service was poor, we continually had to flag her down for water refills or any other issues. She was not overwhelmed or busy, she just didn't seem to care or know what she was doing.   Facility great, drinks good, food okay. service poor. That's my easy summary of our experience here."}
{"text":"I'm still trying to find something fantastic to say about this place but honestly I wasn't blown away by any of it. The food was good but not great. The service was alright. The atmosphere was OK.   A few things kinda bugged me about this place. First their menu is confusing. I get the idea of being minimalist and designy but the wording of the headings confused me. Our waitress never explained the concept of the menu but did tell us everything was meant for sharing. At that moment I thought 'that's cool. My wife and I can try a bunch of stuff'. So we ordered the duck fat fries, fish and chips and the egg yolk ravioli along with some wine.   When the food arrived I was disappointed by their idea of share plates. I'm sorry but the portions were meant for one person not two. The duck fat fries were good but had too much salt. The ravioli was ok, I've had better. The pasta was too chewy for me. The fish and chips was a complete disappointment. The portion was small and the homemade potato chips were so salty I couldn't eat them.   The prices for their food are expensive and the wine prices are also overpriced. My suggestions: change your website. Add some text explaining the story of the restaurant and why you plate things so awkwardly. Get your servers in the habit of always explaining the concept of the menu and be honest with portion sizes. Lastly take a dollar or so off your menu items.   I won't return here."}
{"text":"Great atmosphere!  We sat the bar and were immediately greeted by a couple of the super friendly bartenders.  They gave us some waters and a mug of nicely flavoured popcorn (I hate popcorn, but this was actually delicious) while we mulled over the drink list.  The husband got a beer and I asked for a suggestion on a drink since I don't drink alcohol.  They made me a delicious raspberry mojito mocktail which I nursed throughout the meal.    We decided to order 3 \"starters\" with the intention of ordering more if we needed to.  We got the Steak Tacos, Kale Tempura, and Yorkshire pudding. All delicious!  And filling.  We figured we had just enough room to try a dessert, and got the chocolate ganache with maple creme brulee.  A-mazing.  It was HUGE and we couldn't finish it between the two of us.  That never happens.  We ALWAYS finish the dessert :)  To summarize,  great service, fun atmosphere, cool menu, delicious food.  Will definitely be back!"}
{"text":"This is a second review: Made our \"table reservation\" only to get bar stools still to sit at. Making our reservation later too. If I wanted bar seating I could have reserved earlier and sat at the bar (with bar stools with a back!) I specifically made the reservation to not get bar stool seating.   Food: Sliders are always amazing and the sausage rolls too! The bone marrow with the whiskey shot is a must try. I was disappointed with the beef cheek ravioli.  It was a pleasant surprise when we got there that it was happy hour. Could have enjoyed more if we had our reservation earlier, oh well.   Overall meal and service was good."}
{"text":"The food and cocktails are amazing: 5 stars. The last 2 times I've been there the service has been horrible. It seems That when the owners not there the staff we've had have been miserable. Staff morale appears to very very low and it shows. Too bad."}
{"text":"Worst place in Calgary! Very bad service, terrible food, and the worst staff !!    I order the lamb and it was very old and cold. The steak was over done.   The drinks were very sugary.   Wine selection is non existent.   Only good thing is next door at the living room."}
{"text":"A great place to have a snack! Me and my gff went there for dinner, and we had a couple of drinks (good selection of wines) and some appetizers and a salad.  Everything that we tried was really delicious. A salad with pieces of bread, with a very good dressing. A mini chicken burger with maybe too much deep fried bread crumbs. And the egg plant croquets with cheese (maybe a bit less of cheese would have being better) I really enjoy my time there, it was superb.   I didn't gave 5 stars because it doesn't make sense that they charge you two dollars for tab water  Bottom line is that you should try it, but expect a big bill"}
{"text":"Outstanding.  Great food, great service.  A different concept that is welcome.  Well stock bar and wine list.  Comfortable place for dinner with friends or family"}
{"text":"The worst restaurant I have ever visited in Calgary  half the Meals came out 45 minute apart between 6 of us?!?! ,  half of us had finished our meal whilst other were not yet eating, it was a joke -strangely the meals were similar to what the other half ordered so its clear the meals were forgotten  we asked four times when the food was coming and our server would walk away saying she would check and never did (as we could see the chefs from our table), the fourth time she did eventually ask which was when they started to cook it,  when we asked to speak to the manager we were refused and also told there was nothing they could do?   customer service obviously doesn't exist here,   no explanation whatsoever the server was unapologetic didn't keep and eye on the table or update us on when it was eventually coming and didn't care which was really upsetting  100% wont be returning,   ill be spreading the word its a total sham of a restaurant to everyone in Calgary, after the way we were made feel if your not going to be a people person and hire friendly & customer driven staff, you in the wrong business!"}
{"text":"Environment: The place has a modern atmosphere. Floor is filled with popcorn bits from the complimentary popcorn they serve. The restaurant has a nice ambience all together.  Food: The quality or quantity of the food does not match the price. The food tasted very generic and was served in very small portions. We ordered the half cock and chips... any grocery brand roasted chicken tasted better. The duck fat fries were good, but it was slightly over salted. We also had their gnocchi & salmon...  It was quite bland. The gnocchi and the salmon were tasteless. The only flavour that contributed to the dish was the coconut milk... The sliders were passable except you are paying approx. $7.00 each for a two bite burger... if you order 3. I wouldn't be complaining if the price matched the quality of the food, but it was just very basic.  Service: Friendly staff and they were constantly checking up with customers about their service.   Overall: It was an experience to try this restaurant but I probably would not come back nor I recommend to a friend ."}
{"text":"We went here a while ago and it was an amazing experience! Ambience was perfect for date night but I could see it working for a party of 4-6. Our server really made our night at Cleaver. Blonde girl with tattoos, you're amazing! We had so much fun with her and we each got a dessert so we could stay longer. We would highly recommend Cleaver for cocktails, entrees, desserts and the popcorn!"}
{"text":"Great experience at this new 17th Ave hotspot!  I had once tried to walk in on a Friday night, but it was not happening - the place was PACKED! So we made reservations for a Thursday night. When we got there, it was still completely packed. In fact, our table was not even empty yet because patrons had not left. In fact, we had to wait for a table despite a reservation. I was about to get annoyed but the hostess offered us a glass of prosecco for waiting. Okay, we said. The wait wasn't so bad anymore, since we had drinks in hand. Husband finished his prosecco before me, and the hostess came and topped up his glass! Great, now we definitely did not mind waiting! The hostess was super nice, so we made conversation and asked her about the menu etc while we waited.  When our table was finally ready (about 10-15 mins), we were seated quickly and once again, offered another drink on the house, \"for being so patient\". Seriously, these people know how to please customers! I ordered a glass of pinot noir, and the husband ordered a bourbon cocktail. We ordered four plates of food to share from the menu: The tuna wraps, the beef cheek, the lamb chops and the polenta with mushrooms.  The food all came in RECORD time.   The tuna wraps came almost immediately after we ordered. Excellent! The tuna was generously portioned, and had an interesting flavour because of the cumin. It came with a small head of butter lettuce to wrap them in.   The lamb chops arrived as soon as we were done the tune wraps. They were like lollipops, and were meant to be dipped in the accompanying korma sauce, and then dipped into the accompanying toasted slivered almonds, and then bitten into. SO FLAVOURFUL! One of my favourites of the night.  The polenta with mushrooms came after, and it was absolutely heavenly. The truffle oil, mushrooms and polenta were an exquisite combination. My other favourite of the night.  The beef cheek came after. It was Guinness braised, and served with mashed potatoes and broccolini. The meat was so tender it was almost buttery. It was my husband's favourite, along with the polenta.  We also asked to sample some house made bread and we got two hunkin' HUGE chunks of bread. One was a beet bread, and the other was a dark bread that I am having trouble remembering because everything was so delicious and I was deliriously full!  But aside from the food, the second highlight of the night was the service. At one point my husband dropped a knife. I kid you not, a server appeared right behind him IMMEDIATELY and handed him a new one. Before he even had a chance to bend over and pick up the knife he had dropped. C R A Z Y. So between our super personable and knowledgeable server, and the knife incident, not to mention the free drinks to make up for the wait times.. man, they were on the BALL!   To end this gigantic review, both my husband and I were very impressed with our experience at Cleaver. It is a casual place, but the quality of the food and the quality of the service are phenomenal. The people behind Cleaver know what they are doing, and a lot of new restaurants can learn from them. Easy 5 stars!"}
{"text":"We had booked a reservation on Thursday for this past Sunday for our anniversary dinner. We love bad food and by the pictures we saw on instagram we were sold on cleaver. We arrived about 20 minutes early and we're told our table was still occupied which was fine as we were early. Not even 5 minutes passes and the hostess comes back and tells us our table is ready....she wanted to seat us at the end of the bar where it's so busy and especially loud.  I told her we had a reservation and we were expecting a real table. She told us that this was our table so I told her to find us another because sitting at the end of the bar where you have the steam from the dishwasher on you was unacceptable. (P.s she had lied to us about th4 bar seat being our table because ours was still occupied) We ended up sitting on the other side of the bar which was a tad bit better but my experience with her left a bitter taste in my mouth and had a hard time enjoying the rest of our dinner... Now on to the food, the poutine was incredible a bit on the salty side but that's what I was craving. We also ordered the sliders which we didn't know was on special for $3 each. We ordered 2 buttermilk chicken which were decent, the burger with ale cheese sauce was okay nothing to write home about, but the lamb was delicious. I wish we had ordered more lamb sliders. We also tried a few of the drinks and if it weren't for the awesome bartenders our night would have just been shit because of the hostess who couldn't even apologize for sitting us at the bar when we had a reservation.  I also let her know in the future for over the phone bookings at least tell the person that they'll be sitting at the bar like other restaurants that offer the option. In conclusion I would return to try out a few other things from the menu but I won't come with a high expectation for getting good all around service. The two stars is for the bartenders who gave us decent service."}
{"text":"After bar hopping around 17th, a few of us ended up here for some cocktails. I've gotta say, if you're looking for some interesting and different cocktails check this place out! The names alone are fun to go through: clotted cleaver, the protestant, the Catholic, smoked old fashioned. And each one has some crazy ingredient or quirk that makes them fun. The smoked old fashioned is done by burning an oak board and seeing the glass upside down on it to get the flavor! The protestant has cotton candy in it! I suggest sitting at the bar because the bar tenders, or maybe mixologists? Are fun to talk to and make awesome drinks."}
{"text":"This place was fantastic. Best craft cocktails with interesting makeup. The tuna was overdone & the chicken pizza had a chicken bone in it. The fries were good (both). Mac & cheese was more cheese than noodles. If it weren't for the amazing drinks & service I'd give it three stars. Also sitting outside at night means lots of requests from the homeless. Not an issue."}
{"text":"I was here the first year they opened and had to leave as the service was terrible and they didn't honour my reservation and I said then I wouldn't come back. I, however, came back tonight and the service was the best part of the experience.  We had the sirloin but they didn't ask what term we warned it, which I thought it was bizarre. They brought a sliced medium piece - it was good though s bit chewy. The rest of the food was good.  One thing, the kitchen bell is a bit loud and annoying. The two hipster bearded guys behind the bar are fun to watch."}
{"text":"Had the Nutella French toast and got to try a friends breakfast poutine, both were truly delicious. Service was great but you definitely need a reso as its always busy! I can't wait to return to try some of their dinner items!"}
{"text":"During Poutine-Week I went on a Poutine Crawl with a group and our first stop was Cleaver, but I almost wish we'd saved it until last because it was so good it set the bar super high!  The location itself is almost so blended in that you don't even notice it at first, but once you get inside it's clean and bright with lots of wood and mirrors.  It's got a nice feel to it but it was rather loud as it filled up.  The tables were set already with paper menus and a mug full of popcorn between the place settings.  The popcorn itself was good, with a nice smokey-cheesy flavour.  The poutine we had was Curds, Treacle-Gravy, Whiskey Duck, with Parmesan Duck-fat Fries.  The fries were well seasoned but a little limp but the cheese on them was delightfully gooey.  The gravy was delicious, with great duck fat flavour unfortunately it was a little too thin so instead of coating the fries it just pooled at the bottom of the bowl.  The duck meat was perfectly cooked pulled similarly to pulled-pork which blended well with the fries.  All in all I would eat that again for sure, though I haven't tried anything from the regular menu yet."}
{"text":"Had a very good group dinner here on April 4. Food was outstanding and perfectly prepared and presented. A cool concept of multi dish sharing between friends and family. Price was quite reasonable to boot.   Only negative is that drinks were a bit slow coming from the bar. But a $5 perfectly made Old Fashioned during happy hour... worth the wait.   Will definitely be back here again in the future."}
{"text":"Went here for brunch. Had a joiner but server didn't let us know they did last call for food or alcohol. Joiner wasn't able to get a drink but kitchen allowed them to order food. Short wait even with a reservation. Breakfast sandwich was okay. Didn't blow me away. However my friends enjoyed their chicken and waffles. Will have to try dinner."}
{"text":"I really love their cocktail menu here. Each drink the bartenders make you can tell they really put a lot of love and effort into. Food is also very different and delicious. A great place to come to if you have a sophisticated palate and love trying new things. Atmosphere is pub like with a hipster feel. Would recommend for a date night or with a small group of friends."}
{"text":"disappointing. I get it's new and quoted 45mins and it was 2hr wait. The food is trying to be good but lacks Char Cuts subtly. Not worth it, even for a \"new\" restaurant. 4 out of 10 for service; 6 out of 10 for food."}
{"text":"Food is hit or miss. I ordered the tuna wraps recently which had NO flavour. Beet salad was great though! Service is okay.. the guy in glasses seating people seemed flustered and disorganized and we had to ask to order after being seated. I went here a few times when they first opened and overall it was much better then. Maybe my last visit was a one off. I would still go back and give it another try but with so many other options that won't be for a while."}
{"text":"While the food is great and drinks very creative, the service is terrible. Our order came our incorrect, the waitress proceeded to tell us that we had indeed ordered that. I found that quite funny.  The manager can be seen getting mad at staff, giving customers dirty looks if they are having happy hour items only.  Drink came with a hair in it, they could be seen trying to determine if we had in fact placed it there!  There are too many great restaurants in town, I would not recommend giving Cleaver your time or money."}
{"text":"Are you ready for a cacophony of cocktails? With great names like Suckin' Diesel, Farewell to Sober and Shag Therapy??? You can find anything & everything to wet your tastebuds before dinner.  I had the \"off menu\" suggestion from our server of the French 75. It c/w Gin, lemon & lime juice with Prosecco. It was crisp and refreshing! Everything at Cleaver's is tapas style for sharing. The food comes hot in skillets and is made with fresh interesting ingredients. We had a table of three and ordered the poutine, grilled broccolini, warm roasted squash (spicy warning) and beef cheek ravioli. Everything was delicious! The service was quick they offered suggestions and advice on their own favourites. This is not just a place to get drinks, it's lively fun and has great food too for sharing!  Post note...Unfortunately I had to take off a star because I have spent the whole night sick and not feeling well. The food is very rich and I should have been more careful with my partaking of these guilty pleasures."}
{"text":"Seriously cool little spot is pumping out some delicious food. We started out as a couple going to Cleaver, but when the word got out all our friends wanted to join. I'm sure the host wasn't thrilled that I changed my reso 3 times, but he was so accommodating.   Not a large place, but the intimacy is perfect. You can watch the bartenders and chefs work their magic. As everyone has said come here before 7pm Sunday - Thursday as sliders are $3 and cocktails are $5. Definitely worth it. I tried every slider and they all had deep developed flavors that were delicious. Duck was slightly dry in my opinion, but others at my table loved it. I will definitely be back!"}
{"text":"This has to be a first; staff that spends 10 minute's instragram'ing your food before even bringing it to you. Bizarre.   Came here for brunch one morning to fine that its incredibly overpriced (welcome to 17th Ave?) and really not very good. I had their breakfast burger which--and I can't believe I'm saying this--had way too much chuck and no toppings worth noting. By the way; it comes with a fried egg which they actually squished at the serving bar for their photos--isn't that one of the best parts? Maybe I'm a weirdo."}
{"text":"Went here randomly on a Monday night, and I was pleasantly surprised. On Monday's they have a deal where you get a plank dinner for two which includes: half a chicken, veggies, salad, steak tacos and fries for $25. It was freaking delicious, but the deal didn't end there. At the end of your meal they give you a pair of dice and if you roll double even numbers you get your meal for free. Oh yeah you best believe we rolled even and got our meal FOR FREE. Aside from the fantastic meal and deal, the service was spectacular. Our waiter Austin was super charismatic, nice, and came around to check on us at the perfect times. I will definitely be returning here!"}
{"text":"I came here on a Monday night for their Plank Monday special, and the place was packed! I'm glad we didn't arrive overly hungry because the service was very slow. The Plank Monday is a unique idea where they serve a meat with several small sides, and the total cost is $30 for two people. At the end of your meal, you can roll the dice and try to get your meal for free! The food was very good, but the plank of food was not very filling on its own. I would suggest ordering appetizers, which then causes your cheap date night of $30 to go up quite a bit (assuming you also order beverages and dessert). We ordered the caramel fondue with marshmallows and donuts for dessert, and it was my favorite part! I was scooping out all of the caramel sauce out of the cup! I would definitely come back, but next time, I would try to make it for happy hour."}
{"text":"in the past month I drove/strolled along 17th and wondered about the place that weaved the massive rusty Cleaver and the droves of people that buzzed about inside this restaurant.  Finally the opportunity to try Cleaver came on a Sat night when I had to scratch my brain trying to find a place to eat/drink with someone who seemed well-versed in Calgary's trendy food spots.  \"Actually I don't think I've ever been there, sound delicious!\"  Win.  Reservations were a cinch. Cleaver didn't use the Open Table site but sent confirmation texts on the day of.  The atmosphere of cleaver is somewhat very steampunk, old england indsutrial, and speakeasy.  I gotta dock one star for our hovering waitress who constantly asked us if we were good. I hadn't taken three sips of my drink when she asked if I wanted another one. She was nice though, but there were tables were free so I'm not sure what the deal was.     The ambiance is enticing and a little romantic,  Appies were legen...wait for it....TASTY, I had my heart set on the yorkshire pudding with chicken liver, while my companion tried to sell the tempura kale to me.  \"You had me at tempura.\"  The drinks, were supreme. Someone decided to start the night with an ominous drink that spelled trouble \"So long to sober.\" Indeed, that beast of a drink was so sweet you didn't realize you just invited the bad seed into your system. I settled for the close cousin of the old fashioned, as well as a well crafted Manhattan.  It's a pricey joint, I'll give it that. But the food was stellar and the drinks were potent enough to send two people giggling away into the streets."}
{"text":"I'm not typically a cocktail drinker but the cocktails here are brilliant! So well executed, and well balanced. They also have great picks for the beer and wine. Their happy hour pricing makes the visit that much more affordable and enjoyable. The food is not to be forgotten either- the menu items are unique, well thought out and executed with obvious skill. Add the consistently friendly & helpful service and you have a thoroughly enjoyable experience. Make sure to make a reservation ahead of time, as it is not a large venue (although they do always make an good effort to accommodate walk-ins)."}
{"text":"I've been meaning to try Cleaver for a long time. Mostly because of a review from Dale and seeing that Cleaver makes a deep-fried crab slider.   My husband and I ordered the Kale and Beet salad, Slider Combo (fried chicken, lamb, crab) and the duck fat fries.   Believe all the reviews that rave about the fries. So good. These aren't those wimpy fries with no flavour. Long, crispy with a soft interior and this deliciousness I'm guessing comes from the duck fat. I would come back just for those fries.   I didn't care for the lamb slider but I went crazy over the fried chicken and crab. The fried chicken was so tasty, I'd say the chicken and crab tied in terms of awesomeness.   The Kale and Beet salad was healthy. If you want something to balance all the mayo drenched sliders and deep-fried goodness, I would get it. I found it a tad pricey for $17."}
{"text":"The room is exceptionally well thought out with attention to detail everywhere that ties into their rustic, industrial, quasi-romantic slaughterhouse look. Please bare with me as I bark out single sentences relating to the super cool things I saw, tasted and experience here for the remainder of this review.  Extra Touches/Cool S#!+:  Plastic handled cutlery like your grandparents had. Tin bowl-plates like when your parents took you camping. Cocktail glasses that, depending on the drink, range from glass bottles stuffed in brown paper bags, to classic whisky glasses, to copper mugs. Tap handles made from rusty cleavers and vintage meat mallets on an antiquated looking iron pipe bar. Chicken wire and reclaimed would cabinet fronts. Old wood, raw metal and concrete everywhere. Leather bar stools with pipe bases. Bill holders made from hollowed out bone.  The Food: Gourmet'ed up classics. They start you off with complimentary truffle popcorn served in a tin mug. Double cooked duck fat fries topped with salt and pepper served with curry aioli - $7 and totally delicious. Get this as a side if you opted for the sliders like I did. For $21 you can get the Slider Trio - 3 sliders of your choice. We went with the Pork Belly, The Crab, and the Beef. For $7 a slider, I'd expect quite a lot and Cleaver delivers. While the sliders are built on micro burger buns about and inch and a half in diameter, they're piled so high they take a wooden BBQ skewer to hold them all together.  The service was rad. We received a positive greeting from the very beginning that encouraged to check the place out. Full disclosure - I was looking to grab a cocktail at Ox & Angela but they were closed for a private function so we wandered over to Cleaver. I'd been very excited to go for a full-on dinner here but didn't think it was the right kind of place to stop by for a cocktail or two. The friendly gent assured me that we were in fact in the place we needed to be and that there was a cocktail revolution happening inside Cleaver."}
{"text":"We decided to come here for a birthday and we're encouraged by how busy it was and the interesting decor. Unfortunately, our server had quite the attitude. He seemed annoyed ever time we looked and the menus to decide which drink we wanted from their long cocktail menu. We then tried to order the traditional shots and he quickly turned up his nose and said \"we don't serve those here\" and then finished with \"you should go to Montana's if you want those\" ... the drinks we did order were good but not worth the high price tag ... you get a whole sack of snootiness for free though"}
{"text":"My English friend Joe was the first person to give me the heads up about Cleaver's brilliant happy hour and when he recommends a bar, you listen. I was sceptical at first, the cocktail and slider special seemed to good to be true but I agreed to meet him after work one day for a drink or two (ended up being 7). You can't go wrong with any of the cocktails on the Menu and the sliders are delicious, especially the new Fish and Chip slider which tastes exactly like a fish burger from back home in Australia (and that's a hard taste to find in Calgary, I've spent 3 years finding fish that tastes even half as good). I've come down to Cleaver several other times since that initial evening and always enjoyed myself.  I also find that the atmosphere and vibe make it an ideal location for a first date, albeit only between the hours of 5-7 and 9 til close (I'm not made of money).  Always make sure you pre-book a table before heading down though, I barely ever see a free table at any time of the night."}
{"text":"beautiful food (got the lambchops, fries, and tartare) though the wine is severely overpriced i'd still come back maybe just not imbibe this time. wait staff was gracious and very present without hovering, and the ambiance is divine. making it my goal to try everything on the menu, nothing else to say, just simply good food at a very reasonable price (again, barring the drinks)."}
{"text":"Joined a ladies meet up group and we met here on the first meeting. You would not recognize the place as it doesn't have a signage in front but it is beside Immaculate concept. It's rustically chic, not quite spaceous but okay, their funny cocktails name such as :) Protestant, Catholic, Shag Therapy, Suckin Diesel, made me curios to try 'em but I like Protestant and Autumn fizz.  I'd love to come back again for their wide variety of cocktails and sliders, $5 for cocktails, $3 for sliders. One of the best Irish place to visit in Calgary during happy hour. Their happy hour is until 7pm, lots of time for those working 9-5."}
{"text":"The grilled cheese was by far the best dish here! Second would be the roasted chicken with duck fat fries. I wasn't too impressed with the steak nor the flatbreads but because of such an awesome grilled cheese it's still a solid 4."}
{"text":"I have been to clever twice now and both experiences have been fantastic. The food is amazing and the drinks are even better. The only one complaint then that I would have would be that although the drinks are good- they are very expensive. Average is about $11-$13 a drink. The first time I went I had bread that came with homemade bacon butter and chicken fat or dripping that you would dip it into to moisten it. It was amazing.  This last time when I went here I went for brunch and the brunch is just as amazing as the dinner menu. Both menus are small so it makes making a decision so much easier. For breakfast I got prawn eggs Benedict. It was served on a biscuit with chipotle cream cheese. Tomato. Salsa and eggs. And served with hasbrowns. It was amazing."}
{"text":"Good food, great vibe. I've been here twice and both times I sat at the bar. Loved watching them make the great cocktails. Yet each time I was uncomfortable because the stools don't have foot rests. They have a something attached to the bar but it's too low. Both times I've been with someone who's commented on that too. We are not overly short (5'4 and 5'8). I still like the food."}
{"text":"Had the fried chicken salad.  Friends had the scallops and seared tuna.  the Tuna was good.  The scallops were off.  The fried chicken skin was peeled and had no bottom crusting.  The salad was interesting, and yet dreadful for these strange pieces of extremely tough meat - a dried baconbit immitation?   the prices were spot on."}
{"text":"\"unethical, deceiving, thieving, and selfish behaviours by the front of house staff\"   The food quality and skills of the kitchen are superb, but check your bill.  However. I have dined at Cleaver twice in 2 weeks and both times there have been surprises on the cheque that have lead me to conclude I cannot trust their business practices. The first time, a beer listed at $8 on the menu was charged $9.50 on the bill, and when I mentioned it to the server the bill was not corrected. Second time, I was with a party of 7 people and noticed that a 20% gratuity was included WITHOUT being informed by the server at any point during service, and WITHOUT there being a written statement on the menu. Resulting in members of my party tipping them +40% on their meals.  The result of these unethical, deceiving, thieving, and selfish behaviours by the front of house staff and management to cheat money out of customers with inflated prices and self serving neglect to disclose auto gratuity have left me with no choice but to never dine there again. What I witnessed is the equivalent of robbery, how dare a server and management fail to notify parties of automatic gratuity. Selfish, greedy, and self centred behaviours that rob customers blind and prey on the generosity and trust that are expected of the server customer relationship."}
{"text":"We made a reservation for Cleaver for Saturday night dinner. We were treated like royalty! We were provided with delicious popcorn while we waited for our table. We sat at the bar and watched the bartenders craft the delicious cocktails that we and all the other patrons enjoyed. The bartenders behind the bar were skilled and entertaining to watch. They were also very friendly and helpful when we asked for suggestions on which drink to order next. We ordered the bone marrow and lamb chops for an appetizer. The food came quickly and was perfectly made. Four of us shared the chicken and rib eye steak meals. It was more than enough food. The chicken was moist and tender and the fries that accompanied it were delicious. The bread sauce that came with the chicken was AMAZING! The steak was cooked impeccably and the portion was more than generous. Even though we were all more than stuffed we couldn't resist to enjoy a couple desserts. The sticky toffee pudding was beyond perfect and the brownie was great but was outshone by the toffee pudding. Have the Clotted Cleaver it was incredible! The atmosphere was fun and upbeat. Perhaps a tad on the dark and loud side but nothing to complain about in light of the incredible service and meal."}
{"text":"Well, this is officially my first review in Calgary that I wish I could give ALL THE STARS TO!  What a great place. From my understanding, this place is relatively new. I hope that everything stays the way it does.   Service: STELLAR. You will receive stellar service at this place. We had a reservation, and the place was quite busy. The host, said that there would be about a ten minute wait. No worries, as for me it was a first date! More conversation time for us. After about five minutes of waiting, the host brought us both a glass of prosecco which was on the house. WHO DOES THAT?! Great impression to start off the night.  After we were seated, the amazing service did not stop there. Our server was very knowledgeable, friendly, and super accommodating.  Food: Upon being seated, we were provided with some delicious popcorn with truffle oil to start as off! Yum. Only request would be that I wish that the popcorn was warm.  To start, we had the toast. I can't remember what kind of toast it is, but WOW. Delicious depth to it, and the egg was a perfect touch. We also had the fried tempura kale. I'm not going to spoil how good this was. Just order it.  We decided to go with the \"cock\" for our main. This is a full chicken. YUM. DELICIOUSNESS. The  flavour from that bird was SO good. If I only had to choose one cock to spend the rest of my life with, it would be that one.....  Then for dessert, we had their doughnut fondue. YUM! House made doughnuts. Delicious crunch and flavour to them. Please save room for this.  Drinks: They have a great menu here. Now, when I go to places that make specialty drinks, I always ask if they can make a \"Ramos Gin Fizz\". My all-time favourite drink. THIS WAS THE ONLY PLACE IN CALGARY I HAVE FOUND TO MAKE IT, THUS FAR!!!! The bartender made it a point in her night to come to our table and ask me how it was? She explained to me that it was her first time making the drink, but it had tasted like she had been making it for years. More kudos for their awesome service.  Atmosphere: Great place for a first date! I think I can say that from personal experience, right? It is perfect for intimacy such as mine, but also works great for large groups which we saw at the restaurant.   If there is only one place you have time to spend your appetite on, please choose CLEAVER! :)"}
{"text":"Went to clever in December for a girls night out, such a cool spot! Its smaller so I would suggest making a reso before you head down. The food is amazing and they had a great happy hour on that started at 9pm, so perfect if your looking for a great cocktail at a good price.   There sliders went on special to, and it made it really easy to share a few dishes amongst us girls, we had everything from the mac and cheese to the tempura kale!!!! Need I say more?   The price is right, you get what you pay for and the service was great. I like to pick up cool glass wear whenever I'm out and they made it happen for me! Love service that goes above and beyond! Defiantly going to have to head back hear soon, especially now that I heard they do brunch!!!!"}
{"text":"Ok -you all know the critic in me when it comes to restaurants- so Cleaver, 50 Seats & a Cow. Gets a 5 outta 5 for food, service and ambience...truly frickin delicious! With that said - I have below a photo of the entrance door - (and the other side of he door is locked ) both Oksana Grushetski and I could barely fit through it- ( I'm not Size zero more like 8/10) but come one, when one has to walk sideways through the door? is this about selecting the clientele ? Just saying, no one over weight can dine here..thank you for a beautiful evening Oksana, throughly enjoyed time well spent with you"}
{"text":"Upscale, trendy, friendly and ambient. It's the best of all worlds. The cocktail list is extensive and has something for everyone. From tart to sweet, it's bold and adventurous. The food is delicious and well plated, and if it matters, well-proportioned. The happy hour is phenomenal. $5 cocktails and $3 sliders. The softshell crab slider is . On point!"}
{"text":"Excellent service. Waiter was hilarious. The cocktails are superb. The location is right in the middle of all the happening. Beautiful setting. Everything we order was crazy delicious, I'm a very rich and unhealthy way."}
{"text":"I love it here.  The ambiance, food and service are all excellent.  We came on an exceptionally hot day.  With the patio doors open, the restaurant itself was quite warm.  Luckily they have an extensive drink menu.    I didn't try the complimentary popcorn as the other members of our party devoured it, but that's a great sign!    We really wanted to try the cock (the roasted chicken prepared whole) but the restaurant unfortunately sold out of it.  Apparently, they only prepare four per day so if you're interested in ordering it, perhaps phone and order it in advance.  Oh well, onto the food we actually ate...  We started off with the lamb, buttermilk chicken and soft shell crab sliders and brie/speck flat bread.  The rest of my party loved the lamb (I'm not a fan of game meat so I passed) but I did try the korma dipping sauce that accompanied the lamb and it was delicious.  The buttermilk chicken slider was very good and the soft shell crab slider was unreal.  It was probably my favourite thing on the menu that we ate.  It was crunchy, yet soft, deep fried goodness.  The flat bread also hit the spot.  You just can't go wrong with brie!  Great start to the meal.    For our main, we had the 42oz steak, the polenta with mushrooms and truffle, the duck fat fries with parmesan and truffle (they use a lot of truffle oil!), and the kale chicken salad.  Steak was cooked perfectly and accompanied by a tasty bernaise sauce and topped with onion rings, the polenta was very good but could've been a bit thicker in consistency, and the kale chicken salad was a good balance to our salt-laden meal!  The duck fat fries were so crispy and they maintained their crispiness throughout the meal.    We finished with the marshmallow dessert which was yummy but very sweet and definitely should shared and the Guiness ice cream sandwich, which was not-so-sweet and I wouldn't order that again - it really didn't taste like much of anything."}
{"text":"I use to be a regular here, the food is good and so are the cocktails. I will no longer be frequenting this place because of the TERRIBLE service. They have many ridiculous new policies such as charging for tap water (????) and not allowing you to sit at the patio until the whole place is full, despite making a reservation politely requesting to do so. I have given this place a few chances as the food is good, but can't do it anymore as I am tired of being treated by complete disrespect by both the owner and the servers. I can't see this place staying popular for much longer as the loyal customers will get tired of being treated terribly."}
{"text":"I wouldn't know... we made reservations for dinner on a Friday night, were on time and were seated at the Bar, we explained we had a reservation, which the hostess confirmed but also didn't care (everyone knows you sit at the bar if you're a walk in, or while you wait for your table)  When I make a reservation somewhere, I expect to have a table that goes along with it! For those prices I'm not sitting at the Bar constantly hearing \"excuse me...sorry etc\" we asked to speak to a manager - he was \"too busy right now - we are busy\"   Too bad, I wanted to try it but won't go back there (bad service tends to have a lasting impression)"}
{"text":"The service was so bad, our waiter barely checked up on us. We try ordering a drink and our waiter told us they didn't have it but 5 mins past by and the table beside got the drink we wanted. The food came out 45 - hour later. Sat there waiting for our waiter to come by for the bill and no one came and we had to get up and get a waiter. No napkins were or tools was given and we had to ask for it. Worst place ever. This place is over hyped and not worth a penny. This place is only good in photos but other than that not worth it. Stay at home and eat."}
{"text":"I absolutely love Cleaver, and have had great experiences for both dinner and brunch.   DINNER: This place is best in a group of 3 or 4, because you can order enough things to get a mix of their various dishes. And you do want to order a bunch of things to share - that's the best and really only way to do it. Take their advice on what's good, and how much to order. Their sliders are ridiculously good (I don't know what they do to their chicken, but everything chicken I've ever had here is amazing), and the happy hour deal is not to be missed (I recommend cutting them in half to get as many tastes of as many of them as possible when sharing). I've literally never had something here I didn't think was good, and having a taste of 4-6 dishes in a meal (with a group of 4) is super super great.   BRUNCH: We take the same approach to brunch always share several dishes among a group of people. SO THE RIGHT WAY TO DO IT. Why, you ask? Because you'll want to taste everything. Their blueberry pancakes were good, and not too sweet. The avocado toast with poached egg was cool and scrumptious. The mushroom and goat cheese Benny was awesome (though not a combination I'd have thought of or picked), and the chicken and waffles were yummy. We often have to order 2 of their buffalo chicken benny, because my husband loves it that much. Again, *that chicken*. Also, you can get a reservation for brunch - which is rare in the Calgary brunch scene and SUPER convenient for rallying the group you're going to want to bring in order to share the deliciousness.  OVERALL: Cleaver is a gem, and somewhere we love to bring out of town guests for a fun, scrumptious, family/european-style meal. Very highly recommended!"}
{"text":"I will never return to this restaurant again after the absolutely terrible experience my friends and I recieved by the managers!  I should start off by saying that our server Camille was nothing but kind and apologetic, she was the best. The drinks and food were good and the drink special ($5 cocktails) was awesome, but even that is not enough to convince me to return.  Basically to try to make a long story short we had a large group (8 people) who wanted to sit on the patio. We called twice (once the week before and once The day before) and were told that the balcony is first come first served, no reservations. When we got there right at 4 we were made to cram 6 people on a 4 top table and had to call the other two members of our party and tell them not to come because the rude and abrasive manager (didn't get her name but she had veni vidi vici tattooed on her arm) insisted that the open table beside us was reserved, despite our group being told multiple times you can't reserve on the patio. She kept telling us that they had to make a booking outside because they were over booked, but they could move our party inside if we needed more room. How can you move us inside if you're over booked? No answer.  Another manager then came to talk to us and advised us that it wasn't a reservation, per se, it was a wait list and when the table opens up they text whoever is next on the wait list to come down and keep that table open for them. The table was vacant for an hour and a half. We asked the girls who eventually sat there how they got their table and they told us they just walked in off the street.  Needless to say our group ended up leaving and going to ship and anchor just down the street where our other friends were able to join us and no one lied to us about patio Reservations. I'm not sure why cleaver didn't want our business, we ended up staying hours and ordering food and drinks the whole night."}
{"text":"So for my birthday we decided to try Cleaver on a Thursday night. We went there in a group of 3 and were sited promptly. The ambiance is very warm and welcoming and I really like the vibe.   We decided to start the night with some cocktails. It took the bartender a good 5 minutes to prepare 3 cocktails. However, it was definitely worth the wait. The taste was balanced and not overly sweet also a lot of attention to details were paid. My favorite was the cinnamon and rosemary cocktail.   Afterward, we ordered 6 different small plates to share. The food arrived fast and hot. The first dish was the Tuna lettuce wrap which in my opinion was the highlight of the dinner. Next was the lamb chop with roasted almonds and curry sauce, it was cooked to perfection and very tasty. The eggplant and cheese dish arrived hot and crunchy with a light tomato sauce. A great small bite packed with a lot of flavor.   The next batch of food included the bone marrow, tempura Kale and roasted cauliflower. The bone marrow was fantastic. I was expecting more from the tempura Kale but in my opinion it was a very good tempura but nothing more. However, it was a very generous portion. Roasted cauliflower was more visually pleasing, the taste was okay, again nothing special.   We paid 150$ for 3 people which in my opinion was very reasonable taking into account that we ordered a lot of food and cocktails.   For me this was a very easy 5 star. Good food and good service. The taste of the dishes were very unique. This is what you expect from a modern restaurant. I cannot wait to go back there and try other items on the menu. BTW, the table beside us ordered the bone in rib eye for two and it looked delicious and very generous."}
{"text":"I've been here a handful of times and the service is always great! Servers are super knowledgeable, personable, and helpful. The food is delicious. Try the cock. Seriously, it's incredible. The sliders are fantastic, as is their cheese plate. The duck fat fries. Wow! They're addictive. It's not all that expensive, either, if you share the meals, as the menu is designed for you to do. Also, the smoky whiskey drink is incredible.   Go. Eat. Drink. Be merry."}
{"text":"No wait time on a Saturday at 11:30! Was this my lucky day? Or a sign to look elsewhere? The upscale appointed space with actual gas lamps throwing a glowing  ambiance, raised my hopes for a positive gastronomical experience. We were seated at a 4 seat high top and brought water. Without delay a smiling server took our drink order. A Cesar came shortly after. It was pleasant. The menu was one side of a large printed card. I decided on an egg sandwich. Sounded good on paper. Brioche bun sausage patty  Hollandaise. I received an Egg McMuffin with a slice of tomato and hollandaise sauce and is that a slice of American Cheese? Yas it is... 16$ for an egg McMuffin... my daughter had chicken and waffles. She liked it. My son in law had poutine ,which was ok. Service was 5 stars. Over all disappointed. Left hungry."}
{"text":"I'm amazed at this awesome place for the ambience and the desserts . I ordered Salted caramel fondue, mix'd up doughnuts, marshmallow and toblerone & Oreo baked cheesecake, meringue kisses, chocolate sauce. Those were few of the  tastiest desserts I have ever had . The menu for entree looked delicious and affordable but unfortunately I had already had dinner by the time I reached here  . The place has amazing vibe and is definitely worthwhile to visit if you are around Calgary . Bookmark it like a tourist spot !"}
{"text":"Went with a few friends for a meal. We ordered a bunch of dishes and shared the meal family style. It was so good!   There was an issue with our reservation so they sent us over each a glass of prosecco which made the wait a little more manageable.  Under the guidance of our server we ordered a few starters, a main, and a couple of desserts. We were all stuffed by the end of it.  What was consumed: - Cheese plate, so much going on - Kale tempura, highlight of the meal - Lamb lollipops, so tender - Mushroom polenta, close 2nd place for favourite dish after the kale - 30oz t-bone, you'd have to be real hungry if you're going to share that between the recommended 2 - Marshmallow and doughnut salted caramel fondu, out of control - Chocolate ganache cake, so huge and so rich  One bit of criticism: it is so dark in there. Reading the menu is an exercise in maneuvering the paper by the candle without setting it on fire. Should have brought the headlamp."}
{"text":"Food was good the rest of the experience was disappointing. It's unlikely I would eat here again.   We went to Cleaver for a friends birthday. At first it felt like it was fun and trendy as most places on 17th are. It is a nice looking but smaller restaurant with an open kitchen. While nice looking it was busy and extremely loud, it felt like we had to yell across the small table to have any conversation.   When I first looked at the menu I thought the prices were ok, but once I took a closer look there were definitely items that I felt were way over priced. I ordered one slider and some fries, the slider was delicious but quite small considering the price. Fries were good but in my opinion very over priced.   Our server was ok but not overly good and seemed a bit put out that I didn't order a drink and tons of food. I'm currently 7 months pregnant, It's hard to eat a lot because there is a baby squishing my stomach. As it was I didn't finish everything I ordered without my friends snacking on some of my fries. We also didn't see our server much beyond her taking our orders. When we were done our meal, she started clearing down the table while we were still there, we all felt like she was pushing us to leave and we ended up going to a coffee shop so we could actually have a conversation and not be rushed out the door.   When we got our bill, I was checking it over and found a charge for the tap water (maybe filtered water) that was on our table. While it wasn't a huge charge, I still find it in very bad taste to be charging for water. The bill was split up and items we shared split between us, which was great except that the birthday girl's meal was being covered by someone else so that person grabbed her bill and said I'm taking this bill too. She paid, then our server gave the machine to me and the price on it was several dollars higher then my bill. When I asked why she seemed confused and had to ask someone else why the bill was higher. Also she seemed a bit put off why I would question the amount on the machine being different from my actual bill. Turns out she redid the bills so the split of the shared items redistributed between only the people paying, which wasn't what we wanted at all.  While the food was good it didn't make up for everything else."}
{"text":"If you're on social media, there is no doubt that you're heard about Cleaver. I had their name in my head after seeing many posts on Instagram. I forgot to remember that the 777 special is on Sundays and Tuesdays, however. That's $7 for plank $7 for wine $7 for beer/cocktails. I was there on a Thursday.  The Scene: Cleaver oozes coolness. From the sign-- a simple cleaver to a witty drink menu like the Moby Dick to Moby Chick. You can tell the owners have put thought into every detail of the restaurant.  Their patio is perfect for the summer-- I'm a sucker for string lights and candle lights so I enjoyed the ambiance of the restaurant a lot!!   The Crowd: A great spot for a group. And the menu caters to this crowd. The $75, 42oz \"Bull\" is meant to be shared and there is a good selection of sides to customize your meal.  The Taste: Cleaver seems to follow the rule, \"no Basics allowed\".  Instead of bread you get popcorn sprinkled with curry. Which is actually quite addictive. And the rule goes for the salads and condiments too. You won't find a caesar salad or ketchup on the menu. If you want tomato jam however, Cleaver gotchu!   You're also put on notice that \"any modifications and substitutions will be politely declined.\"   The Conclusion: The menu is unique and has a good variety but if you are looking for a steak and potato place, Cleaver is not for you. I think with an adventurous spirit and a full wallet you can have a really great time at Cleaver. I think the next time I would go back on a Sunday or Tuesday though."}
{"text":"I will honestly never go back to Cleaver.   In order to establish my credibility as a reviewer, I will just mention that I have worked in the service industry for over 10 years, holding positions including server, bartender, and manager. I am a very patient and understanding person when it comes to the service industry, because I know how it works and I have realistic expectations.   I've been to Cleaver a handful of times, and each time, I've had some sort of negative experience, but the cheap and delicious cocktails from 9-close kept me coming back... until my most recent visit.   A friend from out of town and I went in without a reservation, waited about 10 minutes before anyone even acknowledged us, and were then (understandably) wait listed. The manager told us it would be about 40 minutes, so we left my phone number with him and went to grab a drink elsewhere in the meantime. An hour later, we hadn't heard anything, so we decided to go back and ask how much longer it would be.   The manager saw us and said, \"I just sent you a text!\" I checked my phone, and I did not have a text. He left, and shortly after, I received it. That was odd, but not a huge deal, and I only mention it because I think it highlighted this man's dishonest vibe. When he came back, he told us it wouldn't be very much longer. Then, 2 other girls walked in and said they didn't have a reservation. He told them that if they didn't mind sharing a table, he could seat them right away.   You can imagine my shock and frustration.   I confronted him about the situation, asking why he wouldn't have offered us that spot, and at this point it had been an hour and 20 minutes since we first signed up for the wait list. He was very condescending and kept saying \"Oh, you wouldn't want THAT table, we're getting a much better table ready for you.\" I don't even understand the thinking behind a comment like that... why is this table somehow not good enough for my friend and I, but he will gladly sit these other women there? Am I supposed to feel special? Because I actually felt offended for the other women, that he would put them down like that in order to try and flatter my friend and I into submission. We told him we very much WOULD have liked that table, but we weren't even given a choice. He would not answer our question of \"Why wouldn't you offer us that seat?\" Finally, he told us we could have it, but by that point, there was no way we wanted to spend money there, so we left.   The cheap and delicious cocktails are not enough to make up for being treated in a rude, condescending, and inconsiderate way. It was completely unacceptable and I will not be going back. I feel bad for the staff who have to work for this man. I really hope he treats his staff better than he does his customers, but somehow I doubt it."}
{"text":"My dear Cleaver,  You certainly know your way with proteins, but that doesn't mean your veggies and carbs are any less good.   Your sliders are amazing and so are the french fries deep fried in duck fat.   You tease us with popcorn and then spoil us with the main course. The staff here is friendly and the prices are reasonable, considering the food you're getting.  Definitely one the top restaurants here in Calgary. A must visit."}
{"text":"This place was a pleasant surprise for Calgary. I'm a stickler and it was a surprise.   Walked in on a Sunday afternoon and took up a couple of seats at the bar. Decor follows suit with a lot of hipster decor in YYC...they're just catching up to that style here unfortunately and in other (larger metropolitan) cities it's on its way out.....I did not see a TV...I hope there were no TV's. TV's need to be banned from social places.  The menu is limited and they do specify that no modifications will be made so this was a bit of a piss off at first BUT luckily they had a robust enough selection of food that Vegans & Vegetarians will be able to fill up no problem.   Looked like a great selection of beers, wines and spirits. Seemed to be quite the number of old fashioned cocktails being served as well. I did not partake.   All the veggie dishes were prepared well and plated artfully. Nothing was over salted or under cooked.   Jeff had one of their pork belly sliders (which are full sized) and was pretty impressed with the taste. They do them up pretty large so you have the option of ordering just one.   Decent pricing for what you get. After all, Moxies is trying to charge $20 for one of their hideous salads now so you can't complain.   I'd go back for sure."}
{"text":"Worst place I have ever eaten ! Took my family out for Father's Day and I should have saved my money . Service was so slow , do not bring kids as they don't have anything on their brunch menu that can eat and I had to keep my 9 month old on my knee the entire time as they didn't have a high chair ! We had the Irish breakfast , Irish I'm Irish and I have never been served that disgusting plate of crap anywhere in Ireland before ! I would be ashamed to serve it to a dog ! My kids had plain old duck fat fries and eat one each they were dropping in so much salt they couldn't eat them ! I should have saved my $70 , for 2 side order of fries , plain water , and 2 Irish breakfasts yuck ! Ended up having to pay again as we were starving and went to Rickis :)"}
{"text":"My BFF and I went here for dinner instead of giving each other xmas presents. We had a reso at 7pm and were seated promptly when we arrived. The truffle popcorn they brought over to munch on was amazing.  We ordered 3 things to share and while they were all good, I wasn't blown away. Each item was good, but I just felt like something was missing. I think we just didn't order the right combination of food (and I can't really blame the resto for that). We had the duck fat fries, kale tempura, and tuna wraps.  The fries and the tempura were both a big portion - too big in my opinion. I would rather have smaller portions so that we could try more things. The sauce with the kale tempura was awesome.   Service was amazing. Very attentive without being overwhelming.   I think the reason I'm not giving it 4 stars is that I'm just not super enthused to go back. I'll probably check them out for brunch and that could bring me back around but I've been eating out a lot lately and there are a few other places that I just can't stop thinking about.  Bottom line - Try them out, probably with a bigger party so you can sample more things."}
{"text":"I visited this establishment with friends a while back for a birthday. The food was only okay. Highlights were the polenta, the strip loin, and the Yorkshire pudding. These items did have me coming back for another bite. The polenta and mushrooms were full of rich, earthy flavour. The strip loin was juicy and had a great balance especially when paired with the bernaise sauce. The Yorkshire pudding was a delight served with chicken liver pate. I thought the sticky toffee pudding was delicious but hat wasn't a thought shared at the table.   The other things we ordered were not a good experience. The tempura kale felt heavy and overly greasy that the sweet ginger dip couldn't mask. The duck fat fries were over fried and overly salty. The seared chicken salad and the soft shell crab slider were tasty but not memorable.   Unfortunately the service was sub par. The wait staff are very helpful in accommodating dietary concerns but they seem to have mixed priorities when it comes to serving the table and taking orders. For instance, we ordered a bottle of wine and the server wanted to put away the tray before opening and serving the wine. Also, they wanted to open another table's wine after asking us what we needed. It may have been a busy night but more attention to the customer would have been appreciated."}
{"text":"Cleaver is a spot to visit for creative cocktails. The bartenders know their stuff, and its fun to grab a seat at the bar to see how they do it!  It's a very small space, which isn't a big deal. However, we could hear the manager giving a few staff a hard time in the close proximity for standing around. This makes it uncomfortable for everyone (best done in private). Also, we were surprised that the restaurant was not willing to make modifications for my wife who is vegan. In 2018, most places are very used to dietary restrictions. Especially for a modern place like Cleaver!  We'd stop in again for a cocktail or two, but won't be back for dinner."}
{"text":"Cleaver has fun drinks, consistently good service, delicious food, and a fun, relaxed vibe. I've gone 3 times in the past few months and it's the only place I want to go now. Lots of veg options for a place called Cleaver which is awesome. Keep it up!"}
{"text":"I booked online with OpenTable. Glad I did. It was packed by 7pm.  I ordered the Caesar Stack to drink and share the garnishes with my table mates. Delicious and a good idea. I also ordered the kale salad and a duck confit slider. The salad is tasty and hearty. The duck slider is savory and nutty, with sweetness and toasty sesame. He got gooey grilled cheese and tomato dip. It's greasy (that's the nature of grilled cheese) and delicious. There's mozzarella, Parmesan, and gruyere .. and a leaf of kale.  Our company ordered the prosciutto and corn on sourdough and the bucatini pasta dish. Great appetizer with sweet corn and salty meat, creamy cheese and earthy kale. He said the pasta was very rich but the best he'd had in a long time.  The noise level is high and tables tight.  It's a good evening place and has a summer patio. Starter of free seasoned popcorn snack is a nice touch."}
{"text":"Wow, what a surprise.  My buddy told me once he got wings and they were awesome, so by that sole input and what I saw while walking by it for some reason I thought this was just a small bar on the 17th avenue strip - Nope!  This is a legit restaurant that boasts a menu that rivals any of the top tier restaurants in the area.  Decor is really cool, at the front that have high top tables with leather cushioned high top chairs with a soft back, small detail but to me makes the whole meal so much more enjoyable to be super comfortable.  They start you off with complementary popcorn, for my night it had a mesquite rub on them - it got devoured quickly.  Was with a group so we ordered a bunch of things, quick run-down: Candied bacon appetizer - at $5, a great way to start!Lamb - incredible, side 'sauce' (orange colored) was out of this world Beef cheek ravioli - maybe the star of the show, very big and very flavorful Cock - get the cock!  One of the better birds I have ever had! Tuna - very unique, long thin strips of Tuna, loved it Beef tartare - loved it, served with mini baguette like rolls Asparagus with speck and egg confit - pretty good but the speck was lacking Soft shell crab slider - okay, nothing too special (the other sliders looked amazing) Bucatini - was pretty good but not super memorable, a bit to heavy on the pasta and light on the meat (cannot recall what it was on the menu, but small bits of it for sure)   Drinks were great, the special old fashioned was good but a little too expensive to have more than one ($17), I'd suggest going with a Manhattan instead."}
{"text":"I went back in September this year with a friend that really wanted to try their brunch menu in particular, so I joined albeit begrudgingly.   We were seated on their patio which was quite roomy and pleasant. They do have heaters on out there, so it was fairly warm (maybe too warm for my one friend that was right under it).   The waitress was very friendly and helpful. She was around often to refill our coffees and waters.   The brunch menu has a lot of different choices, full stuffed French toast to eggs Benny. I believe I ordered the brisket benny. Food was good and hardy. Large portions, but pricey.   Buffalo chicken benny was a little overwhelmingly vinegary, but crispy and juicy. The ceasar we ordered was peppery and had a decent amount of vodka. Garnished with a chunk of bacon.   Overall a good experience and I would come back now."}
{"text":"It is always a great experience going to Cleaver! Their food is geared towards comfort food, but with a delightful twist. The first time I went to Cleaver, it was during a 2016 Burger Fest YYC crawl and everyone agreed that it was hands down the best burger out of the crawl!   My boyfriend and I came one night during their happy hour ($3 sliders and $5 2 oz cocktails!). We tried all of the sliders and our favorite was the buttermilk chicken and soft shell crab! In addition to their food, they have an extensive list of cocktails that you would not be able to find elsewhere, I loved the Sticky Wicket and my boyfriend loved that their long island iced tea was made from scratch.   If you intend on checking out Cleaver, I would highly highly recommend sitting at the bar. The bartenders are hilarious and very knowledgeable in their cocktails. They'll ensure that you will have a good time!"}
{"text":"I was amazed as to the interesting staff. Extremely fun drinks that are exciting to watch being created.  I love the cleanliness since I have a cleaning business and the all around atmosphere. I wandered in here unexpectedly so it was fantastic to have an amazing experience that was unexpected.  They focus on bringing out the value of the drinks by scientific things :)"}
{"text":"I think this place is normally pretty expensive but they have nice happy hour pricings. I literally only go for the happy hours. Very nice employees. Sometimes the music is too loud and the employees are too busy but the food is good and the drinks are good. I like how it's not too dark like most cocktail places are. Nice place in Calgary."}
{"text":"Came here for their pop up brunch so my review doesn't really cover the dinner or their normal menu.  I'd love to come back to try their regular menu on an evening.   The brunch menu had a lot of choice including sweet and savoury, and three different Benny's.    I ordered the pancakes which came with bacon and blueberries.   The food was tasty, but lacking enough blueberries to enjoy with the pancakes.    Our experience was fine for brunch.  Service was polite and prompt.   It was a bit odd that the restaurant wasn't full yet they packed in the people so we were directly next to other couples, while there were multiple empty tables.   Not a big deal, but the tables are uber close together so if there is enough space they should allow guests the space.  I liked the layout of the place, definitely had a butcher type vibe that fits with their cleaver and meat theme.    The three stars are because the experience was good but nothing stood out in terms of the food or service.   Again, I'd like to go back for dinner to see what they have to offer then."}
{"text":"We went to Cleaver for our anniversary and left feeling awesome.  The building is interesting to look at, with an understated outside that almost seems a little hidden.  (There is a small patio section outside that seems invisible from the 17th Ave strip) The inner restaurant with custom tap handles made from Cleavers and meat tenderizers was eye catching.  The bar was lined with cocktail ingredients and the bottle racks arranged laterally with vintage looking wire cabinet fronts.  The menu was great, it had many cocktails to try, if you're into that.  The craft beer selection on tap was alright, but you have to ask what they have on tap as things change. Watching the bartenders make cocktails was really fun, and they seemed to have mastered making rapid fire cocktails from a menu list two pages long.  Good work.  The food was awesome and exactly what I was looking for: some awesome pub food like wings or sliders etc, and other gastro fare like Bone marrow, chicken drippings and baked bread, bacon butter, beef tartare, mini sausage rolls.. I think you get the idea.     I'll keep it brief and say I didn't know it was happy hour and apparently our 14-15$ cocktails only cost us $5 each.  I kept an anniversary dinner at a cool place under a hundo.  And I definitely needed a cab after!  I've told most people I know about this place in about 3 days.  Go, stop reading this and just go."}
