{"text":"this is not cleopatra anymore...it's tony's pizzeria now! the best pizza on the planet! the ingredients are so fresh and the cheese and sauce is delicious! the owner and staff have to bake with love! the taste is incredible! they give world class customer service! i won't eat pizza anywhere but tony's from now on! i am going to be a regular there forever! they could charge alot more - but the prices are more than reasonable! i more than highly recommend tony's! i am part italian and i'm very picky about pizza...and tony's wins! i am sooo blessed to have found tony's!"}
{"text":"Really good pizza. Not the best in the world, and it can be a little pricey. But it's nice to chill here with friends, have a beer, and go next door to smoke hookah. They also sell pipes and smoking paraphernalia. If you are bored on a sunday night it's a nice place to hang. PS: *Beware the tweekers that like to haunt around the parking lot at night* But then again, that's all of Phoenix, right?"}
{"text":"We ordered the \"hospitalized hot\" chicken wings they we're mild at best so we were very disappointed. The pizza was mediocre nothing special and the place was hard to find. It just said PIZZA on the building."}
{"text":"Well, I've been a little negligent in not updating my review.  I've been very impressed with the quality of the pies.  We've tried a number of other pizzas since last time - we're getting close to 10 at this point. My wife was very impressed with the Tandoori pizza (which I still need to try without the chicken), while I'd been favoring anything with mushrooms.  But a few weeks back we had a garlic and tomato pie and it was magical.  GREAT use of garlic - a human being had actually chopped up a few cloves of garlic, it wasn't just some garlic powder (which has disappointed me at so many other spots in town, to the point where I usually don't order it).  Best garlic I've ever had on a pizza.  As I type this, we're ordering a garlic and mushroom pie.  I can't wait to take a bite...   Check this out if you're in the neighborhood, or even if you're not.  It's a mellow spot and the staff there has always been very friendly."}
{"text":"My man found this place. for under twenty we can get a small pizza, large enough ceasar salad to share and ten wings! the pizza is good they have fresh oregano in the sauce. I love fresh oregeno. The hot wings are actually hot! Not gormet pizza but way better than any dom. or hut!"}
{"text":"This place is no longer Cleopatra Bistro it is now Tony's Pizzeria. I'm from Chicago and stumbled into this place by accident  on my vacation. The pizza is AMAZING! it's just like Chicago style pizza from back at home. I was very impressed by the taste. I left a little room for the Italian ice and it was definitely worth it. I recommend this place to people looking for authentic Chicago style pizza or just amazing pizza in general."}
{"text":"LG peperoni pizza, 10 garlic Parmesan cheese wings, and order of Cleopatra fries.  $24.00  Pizza dough tasted pre-made (little Cesar pizza crust is much better) the sauce was OK. The seasoning they sprinkle on the pizza overpowered the flavor of the pizza. I'm not sure what it was, but we did not like it. About the wings.  They were covered with pureed garlic?  the textured of the wings felt as if they were boiled? Not good. The fries were OK. When you walk in, you smell smoke from next door. Yuk. I recommend you call in your order.  I waited 45 minutes for my order, which wasn't bad.   We do like to support our neighborhood businesses, but I don't think we'll be able to support this bistro."}
{"text":"Nothing special... Seems like pre prepped pizza. Neighborhood is questionable and the interior doesn't help any with guys laying around watching T.V. Would NOT go here again.... doesn't matter Halal or not... there are better options out there."}
{"text":"Pizza is okay. I little too much garlic (I bit into a whole clove under the cheese). It taste better than little cesar's or domino's, but as far as fresh, baked bistro pizza goes...I've tasted better.   It's next door to a smoke shop... I think there's a double door adjoining the them. It smells like hookah when you first walk in. The place looks like a poorly remodeled cafe/lounge. Seems like it might be a neat place to hang out (has a pool table and large tv), but there are quite a few guys (friends of the owner? ) hanging around who make it a little awkward.     The cashier/cook was nice, but I question the cleanliness of the kitchen."}
{"text":"I've had pizza here before at least 3 other times, and typically it is PHENOMENAL! Yesterday around 4:30pm I had one slice of the pepperoni/cheese pizza my friend had ordered and the sauce tasted great! Lots of REAL garlic and spices in the tomato sauce - and I usually don't even like red sauces! I thought it was delicious. Around 8pm I wasn't feeling on-par but figured I was just feeling lethargic. A couple hours later my stomach felt weird so I figured I was just hungry. I ate one more slice. A few minutes after the second slice I was feeling queasy. Soon after that, I had liquid coming out of both ends! It had to have been the pizza. I puked another time around 5am and slept until about 9:30. I felt better, but still not 100%. It's 1pm now and I've eaten some rice and V8 that I think I'll be able to keep down but I still feel bad. Frustrating, because I get so excited to eat here usually! I'm sure it was just a bad episode. One of my friends that ate it is totally fine, the other said he felt some stomach weirdness but didn't get sick. I might get adventurous in the future and try it again, who knows, I'm sure it'll be fine. :)"}
{"text":"This is now Tony's and is the best pizza on the planet! the most delicious cheese and freshest ingredients! they just have to bake with love! i received world class customer service! the owners and staff are so friendly! the pizza is incredible and I won't eat pizza anywhere else! I am now a regular customer for life! prices could be way higher but they aren't! I'm part Italian and very picky...so I am sooo blessed to have found Tony's! I more than highly recommend!"}
{"text":"Just went to \"Tony's\". New owners straight from Chicago. Had great pizza and my family enjoyed real saucy wings. Gave us all free samples of the Italian ice. Yummy! Also enjoyed the conversation. These are the nicest guys you will meet! Open late & delivery. They just took it over do they are going to be redoing the interior. Support local business and really good people. Give it a try!"}
{"text":"I love the fact how they are open late even if u get there juat before closing they will still take your order... The food is delicious extra chrispy wings amazing..."}
