{"text":"Greasy spoon. It doesn't open 'till noon. Fries were greasy and if I wanted something to replace the fries it would be an up-charge. One server for the entire restaurant, he worked the bar and our table. There were only two customers at the bar and one other table with two people: that says a lot because most restaurants are crowded at lunchtime. The Buff-a-dilla was \"a meat searcher,\" hardly no chicken on it and a lot of greasy cheese. Also, whole wheat bread wasn't an option either. Won't go back."}
{"text":"The bar tender was really great. She was funny and fast...the karaoke was loud and not so good"}
{"text":"I stopped here on my lunch break and since I am from out of town I thought this place looked like a legit place to grab some lunch. We walked in at 12:25 and sat ourselves because the only people working were a bartender and a cook. No big deal since they open at noon. I was  with 2 other people, one of them ordered a burger well done the other person ordered a burger medium. I ordered a side of fries. We had plenty of time to eat and get back to work. Well after 20 minutes we were wondering what was going on, our drinks were never refilled and we had no update on our order. After another 10 minutes we got up and informed them we had to leave real soon and we asked where our food was. 5 minutes later we were getting up to leave and the bartender came our with out food. My friend that ordered the medium burger got theirs well done. Very disappointing from a burger place that is their specialty. We were brought our checks and nothing was comp'd and the bartender said :I did my best.\" What a disgrace to not even get our drinks comp'd or a discount. I left my fries on the table paid my bill and we all left. How is that the best you could do? We had no time to negotiate because we had to get back to work on time. If that is his best I do not want to be there on one of his bad days. Good luck!!"}
{"text":"Service was pretty good. It was pretty slow and they seem distracted with future schedule days but courteous and prompt,and just nice in general. Marinara sauce should not be hotter than than the mozz sticks with cheese just barely warm. Had the Brutus burger and it was delicious! A party for your taste buds if you like the burgers with different flavors. Been here a few times since it switched to current owner/name and by the best food yet."}
{"text":"So disappointed..I've been wanting to try this place for awhile. They have fattoush on the menu, which is my favorite salad ever, and is more rare on menus on the east side it seems. Went with my dad, he got the blue devil burger. The jalapeños still had the seeds in them which made it very bitter. I on the other hand went all out as I wanted to try several menu items. I got the fattoush of course, fried pickles, and 6 wings since it was .50 cent wing day. The fried pickles were very good and came with a good sauce. Unfortunately that's where the fun stopped. The wings (I got spicy ranch) were just not good. They tasted old or frozen or something. The fattoush had so much vinegar that the red onion was pickled. I mean mouth puckeringly sour/acidic. And this is coming from someone who drinks pickle juice out of the jar. Worst fattoush I've ever had, and I get it anywhere that offers it. So sad."}
{"text":"A really cool menu that is executed by, what I can only guess, is someone recruited from the Waffle House at the other end of Vine. There's a reason there is no one ever here when you drive by. No one is friendly and it smells funny too......"}
{"text":"Another fun, yummy dinner at CBC! Went last night around 6p, and the place wasn't too crazy. Within 15 minutes, people seemed to pour in. Waitress was friendly and attentive, even though she had so many tables. We got two draft beers (shorts, which were $1 off for happy hour, which lasts til 7), and reviewed the menu. This was the third time we've been to CBC; if you come here, be aware it's bar food- good, fried bar food. Their burgers are the stars- lots of creative fun options, all sound so good! Hubby's had the \"bagel yo' pardon\" twice, but got the fish sandwich last night. It was GIANT- and delicious. Came with a spicy mayo he really liked. I came in wanting fried pickles- and they delivered! Fried pickle spears with a yummy, crunchy breading.
Not greasey or too salty, served with their house ranch. So yummy!!!! I ordered the CBC platter, knowing I'd have plenty to take home. It was a LOT of fried food- but perfect with my beer (side note- I plan to heat it up later in the oven for lunch, yay!). My only complaint was the floor was dirty and the table was a little sticky. Every time we've been here, they have met, if not exceeded, our expectations. Definitely a great place to watch sports, drink beer and eat some food!!!"}
{"text":"Decided to go here since I was on the verge of hangry. Not a good place to be. Glad we stopped. My burger was very juicy, if a little overdone, but I can forgive that. Medium rare scares a lot of people. Mine was the bagel burger. Egg, bacon, cheese and all on a bagel?! I'm there. Mom got the pulled pork and pretty much killed it. Loved the fries. The iced tea was tasty too. If I wasn't driving I would have had a beer as they seemed to have an extensive selection on tap. 
I will be back!"}
{"text":"Jon and his people give absolutely amazing service. Burgers here are absolutely second to none. Certainly a hidden jem here on the east side"}
{"text":"This place was excellent.  The food was delicious and our server was great!  Loved the fried pickles, Yummy!  Great atmosphere will definitely be back.  Thanks for tasty burgers."}
{"text":"My boyfriend and I stopped in here the other night for a few beers and a late dinner. They have a good beer selection. The service was pretty good at first. We started with the crab dip, which was absolutely amazing! We also got a sampler, that was just okay. Cold marinara and the motx sticks weren't done enough. Onion rings were overdone. The Mac and cheese bites were great. My boyfriend got a spicy burger loaded with cheese, which he loved. We both loved the fries! I got a Turkey wrap, which Was good. I ordered a side of spicy mayo to go with the wrap, it was supposed to also come with a side of Italian dressing. I didn't get the Italian, I figured maybe he subbed it for the mayo. At this point our bartender was standing on the other side of the bar talking to a server who had just gotten off, audibly complaining about how tired he was from his vacation, and asking if it was time to close yet. My boyfriend also ordered a drink during this time, which was totally forgotten. It was about 9:40 when we asked for boxes, because we were full. We also asked for the check, planning on finishing our beers and being on our way. The kitchen closes at 10. At 9:55 the bartender loudly complained, saying it was ten time to lock the doors, to the same server. He wasn't talking directly to us, but we get the point. We got our $85.00 bill, had him take the drink off that he never got my boyfriend, but charged us for. He also charged me for the mayo, I'm not gonna nit pick $.50. I have Italian at home for the leftovers. Overall we'll be back for the food. But I was paying a babysitter to have a night out away from our hectic lives, not listen to my bartenders problems and complaints. I also didn't ask, but I'm pretty sure the bars close later than the kitchen at most places. It's extremely rude to make customers, paying good money to drink and dine out, feel obligated to leave at 9:55."}
{"text":"I stopped in the Cleveland burger company for lunch this week, I haven't been at this particular place since it used to be called something like the purple mushroom on purple elephant or something like that. Anyway the bar / restaurant has been completely remodeled opened up and the floor plan is actually quite inviting they've done some decent decoration to it and it actually was a pretty decent meal. Now the motif there is of course burgers however always on the watch for extra cholesterol, I had a turkey burger. To quote Samuel L Jackson from pulp fiction, now that is a tasty burger. I don't know enough about turkey burgers to determine if it was fresh made or or purchased from a wholesale food vendor, but whatever they're doing they should do it again because it was delish. The fella I had lunch with I had a bacon cheese blue cheese burger and promptly inhaled it. The only feedback I really have is that these French fries we're not only overdone but it seemed like they weren't blanched. They were very salty a little burnt and I'm a fan of fresh cut fries, but these just weren't very good. The server was also the bartender she was the only one working that day and she was running her little tail off but she did a great job with her service anyway. I think I probably will go back again with some of my coworkers and give it another try."}
{"text":"It took 30 min for a to go order at noon I ordered it medium well when I got it and took it home it was a freezer patty perfectly round tasted like a freezer patty dipped in salt well done ..Burger King has better burgers and I paid 12.00 that taste like crap I threw it away I couldn't eat it. There's been numerous burger companies in here but that's the worst I've tasted"}
{"text":"Cigarette smoke smell inside the restaurant and karaoke is very obnoxious walked in and walked right out"}
{"text":"Phone service was great. The young lady on the phone was polite and repeated the order to me to ensure she heard me correctly. Order was to be ready in 15 minutes and was great!!! Presentation in a 2-go container was beautiful. We will be back. Their buffalo chicken salad is to DIE FOR!!!!"}
{"text":"Classic good burgers. Fun atmosphere.  Affordable. The only downside is the one server who is incredibly mean to her coworkers and dismissive to customers. We were there one evening and had made it a routine, when two servers, on separate occasions right in a row, spilled drinks and/or broke glass. The server who had broke glass blamed it on her coworkers and started barking orders at a young girl to clean it up. Then, she had the nerve to tell the girl she wasn't properly cleaning up the mess she had made herself. I'm amazed at the young girl's patience, because as a working high school student, I would have just left and never came back. For someone else to witness this who was not involved is appalling, and we have since stopped making this a routine stop... It's a shame."}
{"text":"I have been passing this place for sometime now & tonight we decided to give it a try. It was slow but we were greeted by a served named Mike. He was very polite & smiled a lot. We started with a Crab Dip appetizer served with fried wonton chips. It was very tasty & enough for us two. I ordered \"the shore\", a Yuengling battered haddock served with a spicy mayo. It was very delicious. The only downfall was the tater tots I ordered coming out fried in what tasted like old oil. Not to fret, my husband ordered \"the rundown\", a burger topped with pulled pork & a fried pickle. He said it was delicious & the hand cut fries were cooked to perfection. The menu selection was very diversified & I look forward to returning to try something new!"}
{"text":"We drive by this place all the time and never stop in.  This was our mistake it is worth stopping in and eating as the food was hot and good.  First the Mac n cheese appetizer was amazing.  I had the pulled port sandwich and the wife had the fish sandwich both very good. Service was good and attentive what more do you want??   I took a photo of the weekly specials hope every one come and has as good of experience as we did."}
{"text":"Ate here twice last week! Burgers are amazing! Had the bagel burger, one of the top 3 burgers I have ever eaten! Seasoning on burgers are amazing! Had the buffalo chicken wrap on my second visit and it was very good. Definitely recommend to anyone! Great variety of food also."}
{"text":"I really like this place a lot and can't wait to go back. My server/bartender Johnny was really really nice and friendly. The environment was pretty cool and fun, definitely have the regulars there and they were joking around and just all around comfortable setting. I had a fish sandwich there called \"The Shore\" and it was delicious!  I didn't too much care for the fries (nothing to do with CBC...just don't like those particular fries) but that can be overlooked. The drink menu looked interesting with different funny names for their drinks...had one called LL Cool Aid which was pretty yummy. They do have happy hour with different drink specials. I would definitely head back there."}
