{"text":"Close Quarters is a great local neighborhood bar. The wings that Harry makes are the best around! The burgers, jalapeno poppers and sweet potatoe fries are also very tasty!   You are bound to see someone you know as soon as you walk in. Looking for pictures of people you know or even yourself is always a great way to pass the time until your food and drinks are ready!  Take out is just as good!  Agree with the other review- they can randomly be closed but don't let that hold you back from trying again!"}
{"text":"Love, love this bar. Super cozy, happy customers. Every time we have been in there have been great beers on tap, and honestly for a little no frills bar, very adequate wine. The food is great- grilled hot dogs and cheese, wings, burgers. All good enough to warrant an extra trip to the ATM since it's cash only. We definitely do a drive by to make sure we can get in, but when we can it's a great evening."}
{"text":"I  miss the days of walking in there and seeing Z sitting on the bar.  No other seat was tall enough for him.  Definitely an Avon Lake institution.  Close Quarters recently appeared in an MSNBC article of the World's 10 Smallest Bars:  http://www.msnbc.msn.com/id/42559084/ns/travel-destination_travel/?gt1=4"}
{"text":"Great small neighborhood bar.  The wings are really good.  The service is very friendly.  Great place to stop in for a few drinks."}
{"text":"Super small place but a great place to stop for a drink. The bartenders are funny and the decor is interesting (to say the least). The food is decent and super cheap!"}
{"text":"It's definitely close quarters, but the place is fun and the prices reasonable. Patrons have always been friendly; the owners and barkeeps as well."}
{"text":"Tiny.  I can appreciate what a submariner goes through in their daily life after having to shoehorn my rear end into this place.  This is one of the few bars I've been to were the name actually makes sense for the business.  That being said it's a great little place.  Really friendly people - well they have to be since it's so small - and they can cook up some good food.  Like other yelpers who've reviewed Close Quarters I've had the wings and they were really good.  Cooked crispy (not the soggy pizza place skins), and with a very tasty mild sauce that I had ordered.  Drink prices are pretty good.  Staff is friendly.  The crowd tends to be a little heavy on the \"Golden Buckeye\" card members - at least on the occasions I had been there."}
{"text":"THE UP-SIDE:  Walking into Close Quarters is like walking into a mini-neighborhood.  The place is small and cozy, full of life, and everybody there seems to know each other.  That said, the crowd made me feel entirely welcome on my first visit.  Complete strangers - male and female alike - included me in their conversation and joked around with me.  I felt at home.  In addition to the cozy and homey vibe, Close Quarters offers up some pretty great \"bar food,\" some quirky decor, and some friendly service.  The owner, Harry, cooks the food and takes random photos of people as they sit at the bar.  From what I'm told, he makes them available to look at a few days later, and even hangs some on the wall; all part of the odd and fun nature of CQ.  THE DOWN-SIDE:  It's SMALL.  Do not go here if you're gonna be all crabby about the lack of space.  A big down-side is that they don't take credit/ATM cards.  In this day and age, that's just inexcusable and the only reason they don't get five stars from me.  THE SUM-IT-UP:  Try Close Quarters for a fun, cozy and neighborhood-ish experience.  You will have a great time!"}
{"text":"Close Quarters is one of those best kept secrets kind of places. You only know about it if someone that loves it takes you there. Although, all of that may change now that they've been listed by MSNBC as one of the World's Ten Smallest Bars.   I was recently taken here by a new friend. He loves the place. And for good reason. I love it now, too.   Very appropriately named, Close Quarters is so small that long-armed folk could possibly touch opposite walls, end to end, at the same time. Okay, that might be a slight exaggeration. But really, it's tiny! I think the fire code capacity is 36. There may have been around 30 people in the place on my visit and it was damn crowded. If you're one of those people that gets bitchy if someone bumps into you, or you don't like being too close for comfort with strangers, CQ is not your place. Stay home. Seriously. They wouldn't want your miserable ass in there any damn way.    This place oozes with kitschy charm. There are walleye Christmas lights. It doesn't get better than that. The owner, who is sweet as pie, even took out a little sex toy to show us. Not THAT kind of sex toy, ya perv. Just a naked lady that lights up if you stick a pencil in her vag. (Yes, I said pencil.) If this doesn't make you want to visit the CQ, I'm not sure what else will.   The food was some of the best bar food I've ever had. Try the wings. They were REALLY good. The burger and fries were pretty darn good, too.   One last thing -- check out the jukebox. Walk over, put some money in that baby,  and play \"I Wanna Be Seduced\" by Leon Redbone. You'll see what happens."}
{"text":"New owners. Same menu. Lots of craft brews. Short but tasty bar menu mainly burgers and wings. Try the dirty everything wings. A specialty.   Cash only!"}
{"text":"This place is everything the reviews say it is. Great local place with local friendly people and great prices. Definitely come for the dirty wings and the fresh cut cajun fries were excellent. Staying in town for work and will definitely make this a regular stop. Seating is limited but come early and stay late. If you're in Avon this is a must stop place."}
{"text":"I love Close Quarters and think every town should have a bar exactly like this.  There is CRAP EVERYWHERE and I love it (fake parrots, topless mermaid, goofy boat garbage). Once, when someone played \"staying alive\" by the Bee Gees on TouchTunes all the lights when out and a disco ball was illuminated.  Chicken wings are kinda small but who cares.  No one eats them to get full anyways. Honestly, people don't even like chicken wings- the sauce, combined with the experience of gnawing flesh off of a bone over and over again, is what they enjoy....The \"DIRTY\" wings are SPICY as hell (delicious!) and served on a styrofoam plate with like 10 weird round tortilla chips?!!? Is that normal? NO! Do those little nuances slowly craft the kind of experience I desire? YES! Amazing posters and pictures were borrowed from your weirdo hillbilly cousin's garage and cover the bathroom walls.  If you haven't been here you are missing out. I definitely enjoy all the craft beer nonsense, and they have a decent selection, but when I'm at Close Quarters I drink whatever is on special or Michelob Ultra."}
{"text":"Ok, it is hard to complain about this place. It's exactly what I had imagined.  Also, if you read enough of the reviews, you get the idea.  It is a bar, maybe 15 seats.  The service is all at the bar.  There is a flat top and a deep fryer.  It's all you need for a dive bar.      Food:  I wasn't in the mood for wings, so I went with the burger.  It was actually better than expected.  The fries are fresh cut and were also above average.  If I am driving through in the future, I'll definitely stop by for the wings, since this is what they are really known for.    I guess I can check this off as my 2nd on the list of smallest bars in the US.  I may not be back, but that's because of the location.  If I am in the area, I might stop in for a drink."}
{"text":"We came in on  a Wednesday night and shared a Cajun burger, Dirty wings and fresh cut fries.  Everything was delicious, but the wings were tiny.  Obviously, it's a small place, but the bartender and owner were nice.  We will definitely return if we are in the area again!"}
{"text":"This place is precious! It's like Cheers where everybody knows your name if you're a local and even if you're not......Close Quarters will make you want to be! Great jukebox and late night munchies food.....took my sis and her hubby there when they came to town and we had a blast. The owner takes your photo for his photo wall too. Oh and Budget Travel just featured Close Quarters in the 10 smallest bars in America article!"}
{"text":"The name says it all  bar, kitchen and storage area, can't be more than 500 square feet.  Yet they produce some of the best wings!    I love this lil hole in the wall.  I use to live like 5 houses down from it on the lake side.  It was always fun to roller skate and if I was lucky I could get a tow back home from a  passing car or bike.   Great people!  Great drinks good times!      I miss life on the Great Lake Erie"}
{"text":"The food is awful and nothing on the menu is worth consuming. Not sure if the patrons who rated are related to the guy that cooks, serves drinks, cleans the bar, and turns out the lights. The wings were burnt to the point where I threw them away. A friend was visiting from out of town and she encouraged me to give it a try since she had heard about \"the best wings in town\" garbage.   Avoid this dump. It gets a capital F."}
{"text":"The only reason I head to Close Quarters is to get the Dirty wings. They have an unique flavor that is hard to come by and I have been enjoying these tasty treats for many years. My friends have been ordering these wings since high school. The nostalgia and the wings are the only reason I will give CQ 3 stars.   Yet, the other night I ordered these wings and I was definitely disappointed in the result. The wings keep getting smaller and smaller and the chips were even more stale than usual! Also, it is strange that as the wings get smaller, the price continues to increase. I am sad to say I will not be going out of my way to order these wings anymore!  I recommend ordering out since the place is very, very small and is usually bursting at the seams during busy times. However, if you like going to a bar and talking to some locals and striking up some good conversation then this place is for you. (Just make sure you try the dirty wings).  CASH ONLY"}
{"text":"If you are looking for a cute little dive bar in Lorain County give this place a try. Close Quarters can get really busy so you will need to catch it on an off time in order to get a seat. In addition, the owner, a cute little old man, often closes for a few days or weeks at a time. Call ahead...he always has a message about the status of the restaurant and if it is open or not.   I love the atmosphere at this place. It seems like every square inch of the walls and ceiling are covered with \"stuff.\" The bartenders are super friendly and treat their customers like family.   Close Quarters has a decent menu for the size of the place and serves awesome bar food. I have tried their burgers and fries. The French fries were fresh cut and wonderful! The burger was juicy and fresh and cooked to my satisfaction!   If you are out in Lorain County and looking for a place to hang out...give Close Quarters a try!!!"}
{"text":"Cute small bar. Lots of cool things themed around the bar. Bar tender was really pushing us for food but it was nothing my diet would like. So we had to pass but it smelled good."}
{"text":"A friend recommended this place to me and said they had the best wings ever. So one night we decided to make the trek out to Avon Lake to give it a shot. The name doesn't lie, as others have said - probably 12 seats at the bar a few more along the back wall and that 's it.   As they were billed so highly, we got a plate of wings and I got the Cajun shrimp basket. The food was very average bar food. Nothing more, nothing less.  The wings were served on a paper plate spread with tortilla chips and garnished with banana peppers. The shrimp came with banana peppers too. Seemed an odd choice but I like banana peppers as much as the next guy so whatevs.   The service was friendly -  a little old guy I took to be the owner or at least somebody who'd been around a loooong time. He took our picture to put on their bulletin board. Cute.  The ambiance was part Cleveland sports scene, part fisherman shanty, part booze collectibles.....and some Ritz crackers and cheese that had been sitting out too long on the bar. Eew.  Overall, a reasonable cozy little spot to get a beer and some greasy bar food. But certainly not the best bar food ever and wouldn't make a special trip again.  Oh yeah, CASH ONLY."}
{"text":"Great small bar. Aptly named, great staff!! You will never get bored looking around at all the decor. Good food and you can literally watch your wings being made (the quarters are that close). I tried the dirty wings and they were great. :) will be visiting again soon! Nice little hole in the wall. Emphasis on little (but awesome) :)"}
{"text":"I shouldn't even tell you about this place.  It's so tiny, any influx might leave me out in the cold.  But I do it for you, my darlings, because I care.  I so want you to be happy, I will throw myself at the mercy of fate for you.  Only you.  You seriously owe me a beer.  ATMOSPHERE:  Close quarters is a tiny, tiny little bar located on the south side of Lake Road in Avon Lake.  The only way to find it is to look for the small sign and the wooden reindeer with the fairy lights that lives outside.    Inside, it's close quarters.  Hence the name.  Clever, n'est-ce pas?  It's covered stem to stern in photos of customers and slightly naughty kitch.  The bar takes up most of the room in the place, leaving a small alley for a row of barstools and another row of stools next to window ledge/table.  It's kind of like your what your granddad's basement bar would have been if grandma hadn't forced him to get ridda all dat junk once in a while.   It's awesome.  The crowd here is amazing.  This is not a pick up joint or a hard drinking bar.  This is a place where friends-- usually bunches of guys or groupings of couples aged 30 something to 50 something-- go to have fun.  I've gone in alone for a burger and a beer and ended up chatting with a bunch of really nice folks.  When I've gone in with a friend or two, we've ended up running into someone we know or just meeting new friends.  There is always a judge or a councilman holding court.  BOOZE:  Great Lakes brews on tap as well as a selection of other well-chosen brews.  There are featured beers as well as your old standbys.  FOOD:  The food is some of the best bar food you will ever eat.  The wings are crisp and perfectly sauced (Being a Buffalonian, I know Of whence I speak.)  The burgers are large, fresh and juicy.  I love the Mexican Burger.  The fries are handcut spikes of crispy, skin-on happiness.  Also good are the quesadillas and pulled pork.  Come in the summer and you may experience the sheer orgasmic bliss that is fried corn on the cob.   Ooooh.  That's it.  Cash only, baby."}
{"text":"This has always been a local favorite!  Had a fabulous burger last night along with yummy sinkers and those famous CQ wings.  The new owner who took over about 2 years ago keeps the place super clean.  Great bar tending and cooking staff too!  An enjoyable evening for sure!"}
{"text":"This place is just amazing!  My boyfriend has been coming here for years and decided to share his secret wing place with me. I have never had better wings from anywhere and the moment you squeeze into this little bar you feel right at home!"}
{"text":"I lived in Avon Lake for over 4 years and went to CQ many times. Harry, the owner and his son are great bartenders and Tommy Murphy, another bartender was my next door neighbor's brother.  First \"discovered\" CQ on Christmas Eve, a number of years ago. That is customer appreciation day and the place is always elbow to elbow. It truly is \"close quarters\" since the bar is only about 8 feet wide and 20 feet long. On Christmas Eve the first beer is free and they hand you a mini bottle of Irish Creme.  Guinness and Smithwick's on tap.  Limited menu but everything is freshly prepared - you can watch Harry make your fries from scratch (get the spicy fries - they are excellent). The wings are totally awesome - get them \"dirty\" and their pulled pork sandwich is not bad either.  The olives on the bar are incredible!!  You cannot go in there without expecting to meet someone you don't know and having a great conversation. We were there one night and a woman walked in with cookies her mother had baked - shared them with the bar.  Another thing - Harry will take your picture and post it on the bulletin board. My wife and I have a couple of pictures from our visits since Harry wants you to take them.  Voted \"Best Dive Bar\" in cleveland magazine in 2005.  Do yourself a favor and stop by some time when you are in Cleveland. Not open on Sunday and don't be surprised to see the place closed on the spur of the moment if Harry decides to take off for a week.."}
