{"text":"I went here three days in a row for the pulled pork taco. Insanely wonderful!"}
{"text":"I'm a taco snob, I admit. That's the California in me. I've just been disappointed with most of the tacos I've had in Montreal. But I remember bookmarking this place a while back, and since we were at Jean-Talon Market, I figured why not give it a try. I mean, the smell coming off that huge (I don't even know what to call it) wok-looking thing with the pulled pork in it was reason enough. Plus for $9 you could get a soda and a pastel de nata ALONG with 3 of the pulled pork tacos, not bad. Shared a plate with the boo and she agreed that this was probably the best taco we've had in Montreal to this point. Juicy, spicy, and full of SABORRRRRR. The pastel de nata was a nice finishing touch as well. Definitely coming back."}
{"text":"Located on a small table between Le Ryad and the coffee shop (which I cannot find the name of ANYWHERE) is a tiny oasis of Mexican sandwich deliciousness. A large shallow pan simmers gently over a small flame, filled with tender shredded pork. It's piled onto a soft bun which soaks up all the delicious pork juice. Pickled red onions are optional, but not really - you want these pickled red onions. The green hot sauce is hot, not mild or medium, but hot. It has a great flavor but apply with caution. I appreciate some heat in my food and so I applied the hot sauce liberally on my first visit. After my first bite the heat gave me a brutal case of hiccups. Despite the heat I finished my sandwich with gusto; it was too delicious to give up. The pork is tender and melt in your mouth with tons of flavor and the tang of the onions are the perfect complement."}
{"text":"Im quite the snob when it comes to tacos and burritos because I've spent quite a bit of time in California. Cochinita is cool, I love the homey feel of it but is it a good taco? meh. definitely lacking a whole lot but then again what am I expecting from $5 tacos"}
{"text":"You might miss this place, as it is small, and infront of a coffee shop, next to the crepes, but look for the plancha with warming tortillas and the small chalk board with their name.  This inside the market, so come inside and try it out.  These tacos are the real deal.  Good tortillas, yummy pork, some beans cooked in a magic sauce all put together with some pickled onions.  Three of these little guys for $5 is a great price, but you'll need more than three for lunch as you won't want to share.  They also have a sandwich, which I did not have because, well, TACOS!  But basically instead of tortillas they use bread, which would be good as well.  Be sure to get some of the hot sauce on them.  Might have used a tiny bit more of the onion to really blow the doors off, but these are really good tacos hands down!  With all the great things in the market, it would be hard to decided what to get, but you can't go wrong with some tacos from Cochinita Pibil.    If you go late in the day, they will be sold out, but you can spy the prep for the next days sauces!"}
{"text":"Ça me peine, mais je suis obligée de revoir leur note à la baisse. C'est peut-être parce que l'endroit devient de plus en plus connu (tant mieux pour eux), mais ils n'arrêtent pas d'augmenter leurs prix, et la qualité baisse. Je trouve maintenant les tacos plus secs, et la garniture beaucoup moins fournie.   Et je n'ai plus jamais revu la salsa verde piquante à point, snif."}
{"text":"The food is delicious. As a Mexican raised around authentic food! This hits the spot!! So delicious and the woman who runs the stand is so friendly and nice!!"}
{"text":"I suspect this may be the best secret taco deal in town. Jutting out oddly from the front of Brulerie aux Quatre Vents in the middle of the interior section of Jean Talon market you'll find a simple family situation. Hot plate for heating up soft taco shells, a slow cooker full of spicy pulled pork, and a few small containers of black beans, pickled onion and veggie options. For $5 you get 3 tacos or one sandwich, and they are spicy, homemade and delicious. There's a bowl of green salsa on a small table by the counter that is a good way to burn your tastebuds off while still experiencing flavour pleasure - a mistake I make again and again, tears running down my face, gasping between grit teeth \"it was worth it.\""}
