{"text":"Leo used to work for Z'Tejas for years. Looking over the menu I can see he stole(copycat) some of the items from Z. Yet Cocina Madrigal looks a little more expensive."}
{"text":"I drive by this area everyday and saw the new restaurant sign    decided to look on Yelp and see what the reviewer were saying. I saw excellent reviews and decided to bring my whole family in for dinner tonight. We were greeted by the sweet and helpful hostess Yazmin (not sure on the spelling). She seated the 6 of us. We told her we came in because of the Yelp reviews and we excited to see a mom & pop place in south Phx. She was the daughter of the Chef. Her lovely mother brought us homemade guacamole and chips to start off our meal. The guac was so thick and flavorful. We ordered a round of margaritas on the rocks and also order the Trio!! Then on to our entrees . The food came out looking amazing and each bite was full of flavor.  The Beans & Rice were delicious ..You can mix and match the Tacos too. One of the owners offered for us to try the frozen margaritas. They offered a powerful kick and made without ice. Absolutely amazing and gave you a nice buzz. After we finished our main course we had to try all the desserts. I honestly enjoyed each one and can't even give you a favorite . Each one was delicious in its own way. We finished everything !!! The Chef stopped by to say hello and it really felt like he cared about his customers.. This will be a staple for us to visit. Welcome to the south mountain family Cocina Madrigal.. love this new place!!"}
{"text":"This restaurant more than exceeded my expectations! Let's just say that the Owner/Chef brought Scottsdale straight to the hood! Do not pass this restaurant up, you will not regret the cuisine! It blows many of the new and upcoming \"trendy\" taco spots in North Central Phoenix and Chandler/Gilbert out of the water!"}
{"text":"First time here and it was amazing! Great food, drink, and service! Exceeded expectations! Anyone in the area, passing through, or visiting needs to come by. I can't wait to come back! Will be returning again soon!"}
{"text":"Awesome food. Atmosphere is causal and easy going. Service was prompt and friendly. Prices reasonable as well.   Highly recommend the guacamole, the romaine salad, the mushroom enchiladas and the beef tenderloin. Also, try the margaritas.  Neighborhood is up and coming and could use more restaurants like this! I will be coming back."}
{"text":"South Phx! You want flavorful food,  an imaginative, passionate chef, stiff tequila drinks, and great service? Look no further!     We stopped in for the Grand Opening.  We were not disappointed.   We were greeted by friendly faces, a (sweet surprise) complimentary guacamole, chips, and salsa.  The chips were light and crispy.    The salsa was delicious.   Nice flavor and a lil heat.  We devoured the chips, and salsa.  And then polished off the guacamole, that we found out isn't made until you order.   I loved the roasted pineapple guacamole.  Will be ordering that again.     If you are a mushroom lover, I would recommend the wild mushroom enchiladas.  They are loaded with mushrooms, accented by cheese, and topped with a ancho cream sauce that will send you to enchilada heaven.  They were the best enchiladas I have ever had.  My husband had the seasonal veggie burrito, and let me have a bite.  The veggies were cooked perfect, and the green sauce was flavorful.  Overall a bright, and flavorful dish.  But the mushroom enchiladas were the shining star to me.    Dropped in today headed home from work.  This will be our 4th/5th time here. Today we had Leo's hot salsa.  Wooo did that have a delicious donkey kick!  It was flavorful but had that punch of hot salsa that I love.  I kept going back to the original then to this hotter one.  Both are fantastic, and I love having a spicier option when i'm wanting the heat and the flavor punch!  I tried the raspberry brandy liquor frozen margarita.   WOW it was delicious.  I will be ordering that next time, AND the next time.  The contrast in the flavors of the lime, and raspberry was phenomenal.       Ordered the shrimp tacos.  The shrimp in the tacos are so yummy buttery (yes, yummy buttery) and the tacos are so so flavorful. Ive ordered these the last two times.  Def becoming my second go to favorite dish here."}
{"text":"Checked this place out after seeing some rave reviews on the Nextdoor app.  A little back story - my kids and I just loved to SoPhx from Chandler a few months ago. We always lived in the East valley and it has been so much fun checking out local flavors...and Cocina Madrigal did NOT disappoint.  My son and I visited Cocina Madrigal the other day. We actually missed it because the signage isn't great, but we were able to quickly get back on path. Small parking lot, so be aware of that if you go during happy hour/dinner. Also, it gets a little hard to hear across the table as the dining room fills up.  We entered through an unmarked door near the patio & saw a hostess stand between the dining room and the bar area. The hostess was friendly & we were seated immediately. Our server, Zay, was helpful and energetic.  We started with chips and salsa. The salsa was a little more heat than I can usually take, but I powered through because it was delicious!  For our entrees...He had the tacos (Al Pastor, Anchiote Braised Chicken & Beef Tenderloin Steak) and I had the Barbacoa Green Chile Enchiladas + a house margarita (rocks, no salt).  My son doesn't usually try new things and was questioning the pickled red onions on the Al Pastor taco, but he went for it and had nothing but good things to say!  The enchiladas were so tasty, but I was full from the chips &  salsa. Ended up taking some home...of course, my son ate the leftovers the next day  The margarita was excellent as well - glad I gave it a try!   Will definitely be back to try more things on the menu."}
{"text":"Great place. Had lunch today with some friends. A very casual place with very friendly staff. We talked to the chef and the owner before lunch and got a sense of the place. I had the mushroom enchiladas in ancho mole cream sauce with rice and beans, others had a chicken burrito and the Al Pastor burrito.  Everyone raved about their dishes. My mushroom enchiladas were the best enchiladas I've ever had. Absolutely fantastic. Chips and salsa were excellent as well.   Reasonably priced, friendly service and top flight food. Can't ask for more. Will definitely be back."}
