{"text":"I really enjoyed this place! Came with my family, we were a table of 12!

I'm from Toronto (Mississauga) and have family that lives in the area so once in a while we like to try new breakfast places or cafes when we visit. This was our first time here and someone coming from Mississauga (a place where there's tons of breakfast places) this resto was pretty good! 

This review is based solely on the fact that I'm from out of town...

Yes, it's kind of another \"typical\" bfast place but not something you would find in Mississauga. 

1. They have different menu combinations. In Mississauga it's limited and if you wanted to replace or add something, it would be extra.

2. They serve waffles and crepes! Not something I'm used to. 

3. They serve creton as an option! Yum!

4. Portions are fairly big.

5. They're bilingual. Very nice and very patient!

Sooo obviously for an out-of-towner this place is really good! For a local, maybe just another \"typical\" breakfast place. I will definitely be back!"}
{"text":"The food is good but uninspired. Service was a little slow. Not sure if I will visit again. The restaurant is full mostly because it is one of the few options close bye. Great location in Vaudrieul."}
{"text":"Decent all around.

The staff is friendly and bilingual, the order was accurate and the food arrived quickly (a plus because we were a group of 6), the waitresses asked how we were doing during the meal and topped our mugs with coffee/hot water for tea.

May be it's still newly opened because there was no lineup throughout our meal (10-11:30am ish) on a Sunday.  May change once a lot more people know about this place.

The food was plentiful and had us leaving stuffed.

Overall impression, \"just another breakfast/brunch place\" that satisfies.  At least at this location, you can do your groceries or shopping afterwards if you have errands to run.  Conviently located in a shopping area."}
{"text":"I'm not sure why this place has no reviews. My husband and I came across this place accidentally and we happened to be starving. The place looks nice, clean and new and it was packed...on a Friday early afternoon. They  have indoor or outdoor seating on a beautiful little patio they have made that makes you feel like your sitting on a posh downtown patio. The food was great, no complaints. My husband ordered a construction plate and I ordered the build your own breakfast. The staff were very nice. I would definitely eat here again."}
{"text":"Well to begin you sit down and admire the beautiful modern decor in the place it really is special and well done. Meal is great and they leave the coffee pot on the table so drink away. Service is excellent!"}
{"text":"Usual family breakfast/brunch place. Spacious and cosy interior, super friendly and polite staff and big reasonably-priced breakfasts for all. Nothing fancy, just good ol' hearty breakfast with something for everyone!"}
{"text":"Your typical low end breakfast place with your generic foods. Nothing really sets it apart from any other breakfast food chain like Tutti Frutti or Cora's. 

The menu is quite missleading on the portion sizes and quality of the plating. It is kind of like the advertised Big Mac versus what you actually get in the box. Everything is smaller, minusulce bacon, sausages, eggs. Very much the minimum you can get away with before being called out for false advertising.

Yes it's food, and do go if you're dying to eat. It's just no 5 star Yelp rating. Nothing special."}
{"text":"From the state's. This place is awesome. Great food. Great atmosphere. Love the customer service."}
{"text":"Une bonne petite place à déjeuner. J'y suis allée deux fois depuis leur ouverture. L'ambiance est relax, les serveuses sont super gentilles et souriantes. Merci Sophia pour ton travail! Si vous buvez du café, la serveuse vous apportera la cafetière à table. Quelle bonne idée! Ainsi, on peut se servir à volonté. Le service est rapide. Par contre, si vous êtes un groupe, il vaut peut--être mieux réserver une table la fin de semaine car c'est assez achalandé. Moi, je suis assez classique, genre deux--oeufs--tournés--bacon--pain brun, mais il y a aussi des crêpes, des gaufres, des oeufs bénédictes et des assiettes santé. En plus, je vous recommande fortement les cocktails faits de fruits et les smoothies! Une excellente façon de commencer la journée avec une bonne dose de vitamines!"}
{"text":"We had been here a couple of years ago and wondered why we hadn't returned. I remember now. 

The service was slow. The place wasn't busy for breakfast; there was only a handful of people but it took at least 15 minutes for the server to come and take our order and then after she gave us the bill took another 15 minutes for her to come and tell us to pay at the front.

Her and another server were giggling at the counter instead of waiting on the customers.

Not impressed at all."}
{"text":"Lovely breakfast place around the corner, portions are HUGE and they have a fidelity program where you can earn in $, 5% of your spend... Eventually one day a free breakfast hehe ! If you choose not to take an item that usually comes in your plate they are very flexible in changing it for something else or give you more potatoes for example .. Really fast and efficient just how i love to start my days"}
{"text":"The service is always prompt and friendly. You get your order in less than 10 minutes even for a table of 6. The food is delicious and fresh. Great for the whole family."}
