{"text":"Okay. I'm generally a love-it or hate-it girl. Last time, I was so not impressed. But I've been back a few times and the boys and girls working have been much more friendly, and my drinks have been tastier, and the new owner let me try the new hummus she will be putting on the menu. She was super nice and ill be happy to go back to support her business.....I'm also curious what other changes she will make to the menu. Thank you for saving my coffee stop!"}
{"text":"I happened to walk in when they were closing the place a few months back. It was right when the new owners were deciding on a name, and they were sitting at a table talking to customers. They gave out sweets and coffee in exchange for people's thoughts on the name. 
Aside from the friendliness of the owners, there isn't much to say about the change. I tend to plop down onto one of the couches they have and get some reading done. Sometimes the music is a little loud/inappropriate for getting reading done, but then if you need silence, I would suggest a library or your own home. 
Haven't bought beans from them yet, but I'm about to in a few minutes :)"}
{"text":"It's too bad, but I feel like Coffee Phix has been on a steady decline since the change in ownership.  It looks pretty much the same, and the prices are pretty much the same, but it's the little things that I've seen every few weeks when I stop by for a morning cup of coffee:

- One morning I ordered a bagel (since they had been advertising & selling Bialy's bagels, which I love)-- and the bagel I ordered was pulled out of a Bruegger's bag that was sitting on the back counter.  I am not a huge bagel snob, but Bialy's is unequivocally superior to Bruegger's and Phix should not have been advertising bagels from Bialy's (a local business) while purchasing from a national chain.  Since then I believe they have stopped advertising Bialy's, so I think that this mistake was due to carelessness, not intent to deceive.
- Someone (I actually think it might have been the owner) once prepared my coffee for me one morning and coughed into her hands before grabbing my cup, then coughed on the cup while she was filling it with coffee.  I didn't want to make a scene in the coffeeshop, so I emailed Coffee Phix later that day to let them know that they might want to refresh their basic hygiene practices-- never received a reply.  Priorities???
- They changed the hanging overhead menu with new writing that is really difficult to read.  I'm not even 30, I shouldn't be squinting to decipher menus yet!
- Often, the stirring spoons, napkins, or half-and-half are missing (and I'm not usually there until 8am or so, so it's not like they're still getting set up first thing in the morning).  

Any single one of these items could be easily forgiven, but put them all together and it just isn't a pleasant experience like Phoenix used to be.  I feel like the new ownership might be in a bit over their heads on this one.  Hopefully it improves but in the meantime I'll just brew my caffeine at home (and go get my own Bialy's bagels!).

CHECK-IN 2/3/2014:
Stopped in for some hot chocolate and was giving a piping hot cup of what I can only guess was chai mix.  Come on, Coffee Phix.  I want you to be great.  Or at least better than Dunkin' Donuts."}
{"text":"I was looking for a place to study, so I decided to give this place a shot. The coffee wasn't anything special, and that was probably the best thing about this place. The service is incredibly slow. The people who work there don't know the ingredients of anything on the menu. I ordered a salad and watched the guy copy the ingredients from the menu onto a post it note so he would know what is in it. Then, I waited 20 minutes for a salad.  A salad! While I was waiting, I took a peek at the display case with all of the baked goods in it, and noticed fruit flies everywhere. I would never go back to this place, and I would definitely NOT recommend this place to anyone else!"}
{"text":"I'm not sure I understand this place. Is it a Phoenix? Or a Phix? Phoenix products? Not the name? 

When we came here, it was because my husband needed a caffeine...ahem...phix. I don't really indulge in caffeine or even coffee that much (cursed sensitive stomach), so I got an iced tea that was minty and fresh. So delicious! The only problem was that though this place is mostly still a Phoenix, it doesn't have as welcoming of a vibe. I felt like Pee Wee Herman when he walks into the biker bar on his search for his stolen bicycle and everyone stops and looks at the \"intruder\" that just destroyed their fun. 

Also, the parking lot...yeeeesh. Cramped and scary."}
{"text":"Great neighborhood place to hangout and get some work done. Free WIFI and always plenty of room to find some workspace."}
{"text":"Coffee Phix has a new name (formerly Phoenix Coffee) and new furniture which has eliminated the smoky smell that would follow you home on your clothes.  Same great food & drinks, and a drive through window for when you don't have time to hang around.  Comfy seating, and plenty of access to wall outlets for your laptop."}
{"text":"Awhile back, I noticed that the sign for Phoenix Coffee changed. But...I really didn't think anything of it. I thought maybe this was a new concept for the local chain or maybe even some letters had gone missing in their sign. But...apparently this little coffee house is under new ownership and does, in fact, have a new name. Mind blown.

I hadn't been in Phoenix...I mean Coffee Phix in a year or so but nothing seemed all that different to me. Same coffee. Same menu. Heck, I think the people working there might even be the same. And just like before, it's an ok place. There are plenty of outlets and there is some nice furniture to sit on...but...the place seems a little \"weathered\" to me. Not in a bad way...but considering that this is a \"new\" coffee shop, I guess I would have expected to recognize that it's not the same place as before. (I really had no idea until I went to write this review that it was no longer a Phoenix Coffee...which is bad considering I live a mile or so away)

This is still a decent place to grab a cup of Joe, study, or people watch. Just be prepared for some deja vu!"}
{"text":"This place is pretty much like Phoenix Coffee without the two vowels and the n.

From what I can tell, the menu hasn't really changed.

For years, I've been a fan of the speedball (no, not the drug. Beware of telling people how much you love speedballs). I get it hot or cold depending on the season and they are great. Well, usually. Which brings me to my next point.

The issue I have with the new owners/workers is the consistency of the speedball. Sometimes I'll order it and it's a DREAM. Rich, creamy, chocolatey, amazing coffee. Other times I'll ordered it and it taste off - bitter, watered down, not enough sugar/chocolate, etc.

They are also almost always out of apple fritters and that gives me the case of the sads. Do they only bake like, 5 a year? Come on baker guy.

If they iron out the inconsistency issue and bake MORE GD APPLE FRITTERS (!!!), this place would be a 5-star cafe in my book. Until then, they are A-Ok aka 3 stars."}
{"text":"Very little difference since changing hands: new staff I think, and a couple added menu items, but basically the same as when it was Phoenix Coffee: the same Phoenix-brand coffee, served in the same atmosphere for the same prices. Even the same kinds of live music and poetry events (although I tend to prefer quiet myself).

I can easily find a seat with power and Internet to get some work done, and I like their drinks. So, no complaints here! (I did notice, since someone else mentioned it, that my mocha was poured out of a milk jug from the cupboard. In my ignorance, I can't say whether pre-mixing such drinks is normal, or a bad sign. I don't usually get straight coffee--hopefully that is made fresh.)

I wish they were open later, but I see this fall they plan to return to 9pm weekday closing, which will be welcome, and 10pm on live event nights (check their site).

One issue I must touch on: it's nice and quiet (other than live event nights) for working or visiting... HOWEVER, the silence is shredded by an obnoxiously short music loop (one CD maybe?) which is mostly generic pop music from recent years. Some of it is raucous repetitive barking, the likes of which only a 9th grader could love. I'M LISTENING TO IT RIGHT NOW, and more than anything I want hard alcohol. And I don't even drink. That's now obnoxious the music is. If only the same songs didn't keep repeating! Kill me. Take a sofa cushion and put me out of my misery.

I shouldn't share my Top Secret Parking Tip, but I will: the front lot fills up fast, but there's a small rear lot. You can't get to it via Mayfield, but you can get to it from either side street, Green or Victory (same way you'd enter for the drive-through)."}
{"text":"I have tried this place a few times. Each time it was pretty bad. I believe in buying local, so I kept trying. Got a mocha....tasted like over sweet hot chocolate. Tried to get an ice tea...waited....waited...and finally was told the fridge wasn't working...so no ice tea...tried a scone....pretty bad/stale.  So, I give up not going back. Sorry."}
