{"text":"the crepes were really good, i loved the whole wheat crepe. Great place"}
{"text":"Really awesome food!!  Woke up early not wanting to cook,  this place was 5 minutes away from me and I figured sure.  Wanted something away from the normal dognuts and coffee. Will return!"}
{"text":"I had the Nutella crepe. It was good and I appreciate a place that offers crepes, but I prefer the way I make them. It was too much money for what little you get. I would go back again to try other crepes. The truly bad thing about my visit was the tea. They use store bought juices and lemonades to make their drinks! I didn't even see any tea go into my drink. Also, the wait was outrageous. People who came in after me got their orders way before me. I was about to walk out when they FINALLY called out my order."}
{"text":"This is not the kind of little café I'd expect to find on the west side. Their coffee is delicious (though I'm not a connoisseur by any means), and rather than make a half-assed stab at doing coffee shop-style pastries, they do crêpes. And do they ever do them well. Fresh and delicious.

Their menu expands by a couple items every month or so. They also have smoothies, but I can't vouch for them.

Typical warm, cozy café atmosphere, with plenty of IKEA couches and chairs to chill on."}
{"text":"Excellent coffee & fabulous crepes! Nice little spot to meet up with a friend or two. Service is outstanding!"}
{"text":"DELICIOUS!! and great customer service. pineapple crepe is to die for. first time going there and will definitely be going back"}
{"text":"The tropical crepe was divine!  Customer service was exceptional.  Place was busy but everyone was happy.  This is my new favorite spot!"}
{"text":"Service here is amazing, and I love the coffee. Crepes are super creative and delicious."}
{"text":"I was visiting from California for business and had a wonderful breakfast meetup on Saturday.  Everything was tasty, clean, and overall a great experience.  

One star dock for... 

Came back Sunday for a quick bite to eat before hitting the road...  
THEY'RE CLOSED.  A breakfast/crepe joint closed on the weekend?!

Just doesn't make sense to me.  I believe they would find it is their busiest day if they were to open on Sundays!"}
{"text":"Nice comfortable place to chill. No worries nicely priced. Yummy fried ice cream, strawberry crepe and the smoothie! Nice waiter even ran out to a customer that forgot her coffee on the table last night. I noticed. How nice!"}
{"text":"Yummy place it's a bit pricey but worth it. It makes you happy to try something that's not located everywhere. The atmosphere is very chill love the decorations , employees are friendly. I've bought the crepés Nutella Ice cream one & the Ham Chipotle with cottage cheese and pesto ! Not sure which one I liked more. Recomend this place %100 '"}
{"text":"The crepes are so good! I got the nutella strawberry banana crepe ..and a white chocolate frappe. .Their customer service is great and the place is so nice. I will definitely go back!!! It's worth the calories ."}
{"text":"Merci Colados Coffee & Crepes, it was déliciueci !  Took me back to Paris . I could say you have mastered making a good crepe which is not easy.  If you've had a crepe in Paris and loved it,  you would really appreciate this place.  Great quality coffee and customer service was wonderful.  I wish you much success and expect our referrals .  You defiantly need a location on Estrella pkwy I am sure a lot of people would love it. No complaints here!!"}
{"text":"Staff is very friendly! I had the peach crepe it has Carmel , peaches and almonds. It was so delicious! They also have a variety of drinks and coffees."}
{"text":"After reading the reviews my fiancee and i decided to step in there and I was impressed with the service and with crepes. They have a few but they are the bomb the coffee is also delicious.  Highly recommended it to anybody."}
{"text":"Excellent service every time I go. Usually takes about 5-8 minutes to give me my order but I understand since I usually get two crepes and their blended drink. The drinks are always fantastic!"}
{"text":"I will start out by saying the crepe was pretty good, and the presentation was nice. However, the plastic forks and knives that were available suck, I could barely cut my crepe into bite sized pieces because my plate kept sliding around because the flimsy knife couldn't handle the crepe. 

The chai latte was just okay, there was gritty stuff on the bottom of my drink so I'm thinking it's made from a mix. 

Might come back for a crepe sometime but not good enough to be a regular treat."}
{"text":"So glad I found this place. It's become my favorite coffee spot! The quiet and cozy atmosphere makes it great to enjoy my morning coffee cup! The family who owns it are always so nice and polite! I HIGHLY recommend this to anyone looking for some good coffee and crepes!"}
{"text":"For all you haters who wanted a lunch at subway come down and get your colada on. best Nutella crepe ever"}
{"text":"Such a cute little place Nutella crepe very yummy and the white chocolate mocha was very good. Nice place to sit and converse."}
{"text":"Very cute interior with lovely staff and yummy food/drinks. The atmosphere is nice enough that you want to stay and chat. The crepes were delicious and I cannot wait to go back and try more of the menu. They also have dairy alternative milks for coffee which is a huge plus. Prices are fair and portions match."}
{"text":"The crepes were OK.  I loved the Nutella one but the others were just fine.  I do want to come back and try there fried ice cream.  It's a nice quick breakfast place, but it's not the best."}
{"text":"My first and every time here is always amazing. Just being inside is so relaxing. I was never a huge fan of Starbucks for some reason but this place to me is way better. Made me fall in love with coffee all over again"}
{"text":"Since coffee is always a good idea and given that it's close to 90 degrees outside around 9 am, cold brew is in order. The cold brew here is delicious! Comes on strong yet flavorful and as the ice melts, the coffee becomes more refreshing and mellow. 

Now, on to the food. FANTASTIC! I had the Chipotle crêpe with bacon and eggs (I was asked if I wanted to add those and frankly, I can never say no to bacon and eggs...) The plating was very well executed. It came with a dab of hot salsa, delicious and a dab of pesto. Now, I pride myself to say I  come from the place that invented pesto (totally self proclaimed statement without any scientific basis) and man did they knock that one out of the park. AMAZING! The crêpes was savory, and judged by what's left in my plate, good does not even describe the tip of the iceberg.

Good atmosphere, friendly and helpful staff, great food and awesome coffee, make this experience a 5 star rating."}
{"text":"Decided to give this place a try after many friends suggested it and may I say It was very delicious! I personally got the all green tea and Nutella crepe and they were very good!! Highly recommended"}
{"text":"So happy this place is so close to our house... I've waited to review to make sure my good experiences weren't just happy mistakes.  After having at least five lattes, I can say with certainty that their espresso drinks are delicious and perfectly made. They even offer almond milk which is rather unique! We've also tried their chai latte which was probably the best chai I've had. It was a perfect balance of spicy and sweet.

We tried the whole wheat crepe today and it was really a satisfying treat-very light, moist, and sweet, but not overly so. Presentation was nice and didn't take long to arrive, although it wasn't too busy.

They have a small menu and don't offer a ton of options, but I can definitely recommend their espresso drinks and crepes with confidence. The staff has always been pleasant as well, and they keep the dining and open kitchen area clean and modern looking. The only downfall of this place is parking... Probably one of the worst parking lots I've had to endure, but no big, it's always worth it."}
{"text":"This place is amaaaaaaazing! The coffee and the crêpes are delicious. Just wished it wasn't closed on Sundays"}
{"text":"Found this place on yelp.  Visited it for the first time with my family and we loved it. Crepes were delicious and my little one's loved the fried ice cream. Definitely returning in the near future."}
{"text":"Great local option if you're in the West Valley.  I have not tried the Crepes but look forward to heading back soon.  A little difficult to find, it is located in a strip mall just West of a Fry's grocery store."}
{"text":"Loved everything about this place. Location, set up, friendly employees and on top of that the AMAZING and very DELICIOUS crepe and coffee. One thing for sure is I will defiantly be making more visits here. Think I found my spot!"}
{"text":"Great crepes. Good coffee. Great service.  Yeah, that pretty much sums it up."}
{"text":"Delicious crepes! Was unable to try the coffee, but I'm sure it is excellent as well."}
{"text":"Crepes are made fresh and taste delicious! The workers are friendly and make sure you enjoyed everything. The coffee was great especially their caramel helado! The inside is cute a little loud but a great spot to catch up with an old friend."}
{"text":"Very Disappointed about this place. Truth be told. This is Mexican own restaurant and just like most Mexican restaurants in the valley, very cheap and poor portions of food; not to mentioned how pricier they are, for quantity of food they served. very Poor customer service, had to go ask twice for someone to pour more creamer in my coffee  and every time it seemed like if I was asking for too much. Also waiting time was insane, they don't have the adequate equipment to prepared food. Overall the food was ok, but would not recommend."}
{"text":"Love this place.   I have had many crepes in Europe and this is the best I have had is the USA.  Nice ppl good food. Nice atmosphere. Thanks"}
{"text":"Came here when they just opened and it was great and they were very friendly! we had the vanilla helados and they were BETTER than starbucks. I also had the deep fried ice cream which as delicious. If your looking for a coffee place, ITs HERE!"}
{"text":"Great little coffee place and the crepes are awesome also. If you're in Avondale, you really need to stop by."}
{"text":"Looking for somewhere to study and found this coffee shop. So impressed with the young lady at the counter and her customer service. Like the ambiance. Crepe was tasty. My drink was perfect. I think this will be my new study hangout."}
{"text":"Absolutely one of my favorite breakfast spots. I love their morning crepe and mocha coffee. I come here every week!"}
{"text":"Love the crepes on this places, nutella strawberry and banana is my favourite. They also have great selection of tea and coffee."}
{"text":"So just to be clear, the restaurant was clean, and the food was alright, def worthy of a 3 or 4 star review. However, between the disorganization of the staff and how slow service was, I don't see us ever going back here. We waited over 40 minutes for 3 crepes to come out! A few couples and a family of 4 got there food prior to us getting ours and we came in before them! We decided to let the staff we wanted ours to go since it was taking so long and they said it wouldn't be a problem. Not 5 minutes later, the nutella crepe with ice cream we ordered was brought out to us on a plate. Why lead with literally the only dish that has a timeframe to eat? After we clarified we wanted it to go, they brought it back and put it into a to-go box. The ice cream sat there for another 10 minutes till our other crepes were finally finished. We left there with melted ice cream and a soggy Nutella crepe, which still tasted good, but nonetheless. Not worth it to go back in my opinion. 

Oh, and while waiting for our last 2 crepes, a server went over to the couple that followed us in and gave them a gift card to apologize for the long wait. Yep, that happened."}
{"text":"I love this place, its a nice place to just go and talk with friends and enjoy something sweet. There's no obnoxious music playing in the background like in some other paces iv been. The staff here is really nice and bilingual."}
{"text":"Absolutely love this place! Dont let that the location of colados fool you being in a strip mall type buliding, the moment you walk through the door your immediately greated by the employees, the atmosphere is relaxing and inviting. The coffee is devine! My husband and I usually order a cappuccino with half & half, the cappuccino is nice and smooth not bitter at all! We love there crepes, my favorite is the tropical crepe and my husband likes the morning crepe.
I love that this is not the typical coffee chain place, wish there were more places like this around the valley."}
{"text":"Always loved coming here. Great atmosphere and good coffee. Good selection of crepes. You should try it out."}
{"text":"Coffee is not that great if you enjoy Starbucks you will not like the coffee here, but great service"}
{"text":"loved it here the crepes were delicious, the ice cream was perfect, and the coffee was very rich and fresh. I happen to be very picky about my restraints since I don't just look at the food but this particular place had a great  ambience and great food. When you put those 2 together with great hospitality you have a great establishment."}
{"text":"I love this place. It's the go to spot for my boys after soccer at fear farm. They love both the savory and sweet crepes. The food is outstanding. I love the coffee in a real cup and the smoothies. I also love that the serve the crepes on real plates, which brings me to the only thing that keeps me from giving 5 stars -- the cheap flimsy plastic ware!  Why use china for the coffee and plates and cheap out on the \"silverware\". I like to cut crepes with the edge of the fork, but it's near impossible with the cheap plastic ware provided. I think I'm going to have to bring my own fork next time."}
{"text":"We were looking for a place to get dessert and found this place on yelp. So glad we decided to try something new!! Super friendly staff, delicious desserts, and reasonable prices!!  Definitely plan to come back again!!"}
{"text":"Colados is great, beats your standard coffee shop and there isn't many in the area.  

They don't have many options as far as coffee goes, but what they do have is more than good!
Their crepes are what wins you over!  Their Banana/Nutella crepe is to die for(literally)!
The place seems to be family owned, and the owner/manager walks around to ensure that you enjoy what you had!  
Will definitely be back soon!"}
{"text":"Cozy atmosphere and yummy crepes! Mocha is also to die for! Get there early, it can get crowded!"}
{"text":"Love this place, really delicious Crepes and coffee. The staff is super friendly and always make you feel welcomed, even if you arrive minutes before they close. If you haven't tried then yet, you should."}
{"text":"I came here to meet a business associate got a salad for lunch while I was waiting . I was greeted by very friendly waiter and cashier I ordered the chicken salad and it was absolutely fantastic one of the best salads have had in a very long time.  I will definitely comeback."}
{"text":"Very friendly service, great coffee and even better crepes. Only complaint is this place is too busy! They need another one."}
{"text":"The crepes taste so good I had the Nutella crepe with banana and ice cream it was delicious very clean and friendly staff."}
{"text":"Great service! Very friendly staff. I've had all the crepes and the Morning is my favorite, but they're all delicious and the Latte is amazing! I love this place!"}
{"text":"such a cute place!!! food was great, coffee was great, and the overall vibe was amazing. 10/10 recommend"}
{"text":"Next to Fry's, a really good refreshment after grocery shopping. Banner sign says \"Now Open\". 

It's more cozier than Starbucks, they have a sitting area, high table tops if you want to eat/drink there or you can take it to go. 

Got a mango and strawberry smoothie w/ a tropical crepe and they ask if you want ice cream on top. Everything tasted awesome!! 

Great customer service & great crepes, definetly will be back to try more of the menu."}
{"text":"Friendly, awesome place. Coffee and food is delicious.  It's not to big, quiet easy to talk to your friend. Can't wait to go back."}
{"text":"Great people, great service, and the crepes are SO GOOD!!!! I had an iced chai and my boyfriend had a coffee. We both agreed...better than Starbucks! We had the Nutella, the Breakfast and the Chipotle crepe...all Delicious!!!!! We'll definitely be back!"}
{"text":"When I see that a new restaurant has opened and is being advertised on an app that I use frequently, such as Instagram, it catches my attention to look up the business and what it's all about. When you think about going to a new restaurant you think to yourself \"Is it worth spending my money on something I have never tried?\" or more curious questions about the restaurant. I always think that when I want to try new food, just like when I wanted to try a Nutella crepe at Colados Coffee & Crepes for the first time. I decided to go try it and I absolutely loved the crepe with a side of a hot cappuccino, it was a perfect meal that made the inside of me happy. Colados is great place to have a cup of coffee with a savory crepe because it has delicious food, very friendly employees, and a chill comfy environment. 

             Colados Coffee & Crepes is a family owned establishment that serves traditional coffee and specialty crepes. The crepes are made with modern flavor, unique coffee flavors and freshly brewed, and friendly atmosphere that will provide a new different experience as a coffee house. 

              One reason Colados is a great coffee shop is because of the great quality food it has to offer. For example, if you don't want to try the basic Nutella crepe, you can try other different flavored crepes such as a Chipotle crepe that includes ham and spinach or a Whole Wheat crepe with yogurt, granola and fruit. The menu has endless items to choose from for whatever it is you are craving; they also have a chicken salad if you are more on the green side. Ever since the first time I tried Colados, I have always ordered the Nutella crepe because I love it so much and I can never get enough of it for its simple but sweet flavor, the classic is always the best. The Food is very affordable, crepes cost around $6 and beverages are at a great price for a cup of coffee or for a smoothie. 

                What makes a restaurant very successful is how the employees work and respect their costumers when it comes to serving them. It's actually the first thing that you run into when you enter a resturant, they take you to your table with a well greeting or take your order as kindly. Colados has always had nice employees who care for their costumers needs, friendly attitudes, and seem to be happy where they are just as the costumers.

                Lastly, Colado's environment is for everyone. Family, couples, students to study or even a meeting. It's an authentic coffee shop to feel free to enjoy a warm coffee on a rainy day in Arizona or to have lunch with a coworker. The music is what I also enjoy at Colados, it almost  feels like I'm at coffee shop in New York like the ones in the movies with smooth jazz music Just like one said of a review on TripAdvisor \"This is the best place to eat crepes on the west valley, very nice environment, clean relax, staff is super friendly, all the crepes are so good, highly recommended !!!!!\" said by 267Johana. 

                 Colados Coffee & Crepes is a place you must try for it's great variety of crepes and food, the friendly employees and the environment of the coffee shop. If you live in the West valley of Arizona, you got to try it and you will end up craving a crepe every week."}
{"text":"there aren't that many places to get some crepes locally but this place definitely satisfies my crepe needs. although their menu for crepes isn't that large the crepes are still great. Colados can get really busy so the indoor and outdoor seating helps accommodate the demand. 

the food is well presented and the drinks are always good."}
{"text":"I've been here twice in a week...the first time was by coincidence. The second time, today, was definitely planned. I live 30 min away, but their crepes are totally worth the drive!!!

Initially, I came on a Wednesday afternoon, and it wasn't busy at all. I had the Chipotle Crepe, which was excellent!!! Today, Saturday, it was packed. There weren't any places to sit down for about 10 min. 

I came with my girlfriend to celebrate her birthday, and she agreed it was worth the drive. She ordered the Chipotle Crepe while I had the Balsamic Chicken Crepe. Because they were really busy, there was a slight wait for our meal. It wasn't a bad thing because we were rewarded for our wait with fresh crepes. 

The portions are huge, especially for the amount of money they charge for the crepes. Only $6.55 and you come away absolutely stuffed! We also shared the deep fried ice cream in top of a Nutella Crepe. It was huge, delicious, and almost too pretty to eat. If you order one, definitely plan on sharing with someone. 

For a place so busy and popular, the owners keep the place spotless. My orthodontist is up the street from this place, so I'll be by monthly, for sure. I prefer Mom and Pop shops bc the food is usually better. I really like this place a lot. I can't wait to come with my husband to try this place out in a few days."}
{"text":"Decided to try something new and could not have been more pleasantly surprised. Delicious drinks and food and amazing, friendly service."}
{"text":"Very delicious! I have a crepe and coffee. I paid $10+ which I thought was a little pricey. I was still hungry after. A side of breakfast meat or a salad what be great to fill you up. I would go back because it was just so delicious and the atmosphere was very comfortable and laid back."}
{"text":"Extraordinary coffee shop with excellent specialty coffee, smoothies and French crêpes. It's a family business who obviously care about their customers. The environment is welcoming and friendly--but also quiet and relaxing. There are big beautiful photographs of Paris on the walls and easy-listing music playing. This trendy atmosphere is perfect to meet up with friends or study using their free wifi. I will be back and I highly recommend you visit them soon! :-)"}
{"text":"Best crepes in the West side, love getting the Morning eggs bacon and a mouthful of deliciousness. If you want something  fresh and green there is the chipotle you can add egg and bacon.

White chocolate helado has a sweet taste but tastes like coffee it's perfect"}
{"text":"This is a family-owned establishment with a unique menu: coffees and crepes. 

Take a walk on the wild side with a Nutella crepe or feast on a chipotle crepe with guacamole and tomatoes. 

You won't be disappointed."}
{"text":"I'm not a crepe expert but these were the best I've ever had.  All the choices looked great but tried the one's with yogurt, granola, and berries. ....and the coconut pineapple one. Excellent.

The drip coffee also was excellent. 
Can't say enough about the service as well. Very friendly and accommodating. This is a counter place but they bring you the food.....wanted to show appreciation but surprise. ...no tip jar....no tip line on credit slip. Wow.

Also very much enjoyed the nostalgic music being played during my visit.  I would go out of my way to partake here again."}
{"text":"I always like to find a local coffee house when I'm visiting someplace. This was a perfect spot! Very good coffee with lots of coffee options, and the crepes were amazing! I had the Nutella and it was fabulous. The staff were very friendly.   I think it may be family owned which is a plus in my book. I highly recommend it if you're in the neighborhood."}
{"text":"Came to this place by coincidence and got one of their breakfast crepes. Was definitely satisfied! If I'm in the area I will definitely come back to eat at this place."}
{"text":"I was excited to try this place and for the most part I am pleased. I ordered the balsamic chicken crepe for lunch and the passion tea sweetened with lemonade. They were both delicious! The crepe was pretty big and filling. I liked that they offered various milk options for coffee; although I'm not sure if it is extra. I did not give 5 stars because when I arrived there were dirty plates on most of the tables they had. It seemed that they were short staffed; there were only 2 workers in the kitchen and taking orders. So the drinks came out with the food; which I didn't mind because they had a small water station and did not finish my drink while waiting for the meal. This is a place I would come back to try the sweet crepes!"}
{"text":"I've been here several times since it opened and I love it. The food and coffee is prepared fresh when you order and it's a family owned business. Very loving and supportive of the local market, definitely recommend visiting."}
{"text":"It to expensive and the wait is kinda long But it's a nice relaxing spot geat customer service .  Just wish the price was a little less"}
{"text":"What inwas originally impressed with was the high quality and friendly staff. I've been in quite often and our order was totally skipped, waited for 20 minutes before asking about it and it was then quickly made. Another customer had to ask for her to go order and she had placed it before us. That's not the first time. It's hard to get a seat and awkwardly shuffling for a place to sit at a dirty table isn't fun. I took my sister and neice last week and there was a hair in her crepe, and while she didn't want to complain, which is her preference, I was none too pleased because it's not the first time we've had a poor experience lately."}
{"text":"This place has a good atmosphere and their crepes are wonderful.  I recommend the tropical crepes, because the nutella crepes is too chocolately unless you are a big fan of chocolate.  The chipotle crepes is really delicious and if you want coffee their hazelnut and mocha are good too."}
{"text":"First time at Colados Coffee and my experience was not what I expected with a service, they were busy as always and that is great. They got the orders confused and three drinks were delivered at different times and the colado coffee was warm not hot. Hopefully next visit will be better."}
{"text":"Been there twice and I have no complain... Place feels like those coffee shops in San Francisco CA... Friendly people and great food I have ordered chipotle crepe although my friends thought I was crazy... They change their mind when they try it. Now it's their favorite."}
{"text":"Delicious!!! Friendly. Well worth the visit. Located behind McDonalds. You'll be thankful you came."}
{"text":"This place is must try for any lover of crepes.  The peach crepes are my favorite and are stuffed and drizzled with caramel and almonds.  The service is fast and the employees are very friendly.  My only complaint is that I wish the dessert crepe menu were more extensive.  They only feature a few flavors.  However, I have tried a few of the crepes here and none of them have been anything short of delicious."}
{"text":"So excited to finally try this place!!! It's always on my Facebook with pictures of their coffees and Crepes! It was so so so good! My husband got a Mocha Hot latte and I got the white toffee iced latte AMAZING! We both got the new Chorizo Crepe. It was so good and savory. Cheese egg chorizo topped with an amazing sauce! Next time we are gonna share a Savory and share a sweet one so we get best of both worlds! Everyone was extremely friendly even the customers everyone saying good morning to each other! Very wonderful way to start our day on a beautiful fall morning! Keep up the good work guys! We will be back again and again!!!!!"}
{"text":"Cute furniture, frappé's tasted like frappé's and the crepes are delish! Definitely go and try the crepes."}
{"text":"Oh, yummmmm to this cute place. Everything I've tried is great and it's such a cute, affordable and cozy place to eat! Love it!! Great, great, great food!!"}
{"text":"I love this place! The whole wheat crepe is my favorite! But I wish they would expand their menu a little. It would be nice to have a few more savory crepes."}
{"text":"Colados is a nice place to get a crepe and smoothie or coffee.  

I admit I want to love it considering how close to my home it is and the fact they serve my favorite desserts... Nutella and banana crepes!

But each time I visit the restaurant is louder that I'd like to see.  When you walk in the decor makes you feel like you walked into a romantic \"Melting Pot\" (look up the restaurant) kind of feeling but disappoints because the lighting isn't dimmer, kids are running around and it's not as cool and romantic as it could be.

When it comes to the crepes the food is good for the price but I wish it was more like Cibo's (5th ave) downtown where the crepe is just stuffed with fruit and topping.  Here it's a little less fruit and topping... but still good.

Oh Colados,
I want those,
Endless stuffed fruit crepe Os
With a romantic vibe 
I would decide
To buy more Colados"}
{"text":"Delicious crepes and fantastic service. Loved the energy and vibe of the restaurant...although it's difficult not to love anything between crepes. Coffee is above average, but not great."}
{"text":"This was our first visit and it was fantastic! We tried the Morning crepe, the Nutella crepe and the seasonal pumpkin. The only downside was It was pretty crowded so seating was very tight, but the reason it's crowded is that it is so delicious! My kids ages 2-10 we equally impressed and we will definitely be returning!"}
{"text":"So I saw this little gem on Yelp and my son and I decided to give  it a try! GREAT choice! My son got the Nutella crepe with ice cream and I got the peach crepe with ice cream. Both were STELLAR! Not only were the crepes fresh and delicious but the coffee is fantastic and they even made a cute little heart with my cream! I'm not sure if either of the employees that helped us were managers or owners but I'm sure they were one of the two and they provided us with excellent service! We will be definitely be returning!"}
{"text":"The Strawberry, banana & Nutella crepe I tried was delicious. The people I went with tried the breakfast crepe and they enjoyed their pick. The cold brew coffee was good. It gets pretty busy there, it's a small place. 4 stars based on the fact we had to wait FOREVER for our drinks. We finished our food before the drinks appeared. I would still go back though."}
{"text":"Great family owned place coffee shop
And delicious crepes. Friendly staff. Love the atmosphere. It does get really busy Saturday's mornings and evenings but worth it. Nice worldly decor. Pics of the Eiffel Tower, Big Ben, etc.. very nice place. The coffee and the crepes are delicious. I get the morning one. So good egg, cottage cheese, bacon tomatoes and a chipotle sauce yummy. Highly recommend:)"}
{"text":"Wheat Crepe w/ strawberries and granola & a Morning Crepe with a caramel machiato...  delicious!  Perfect place for when you need to relax in a soft setting and looking for a rich coffee and delicately delicious breakfast!  We will be back soon!"}
{"text":"I would give this place a million stars. Amazing food, and great staff. It is crazy busy in their especially on the weekends so I normally call in our order for pick up and they are always really quick. My favorite is the chipoltle crepe and the Nutella crepe but all of them are amazing!!"}
{"text":"This place is amazing!
The food is fabulous, the service is spectacular, and the drinks are delicious.
A must stop if you are in the area!"}
{"text":"A must go-to-crepe place! The flavors were well blended. I enjoyed every bite. The only suggestion is to add More choices and to cut down the wait. However, I will return for those lil crepes. :) Thank you all, who signed \"THANK-YOU\" when I walked out the door. It was inspiring."}
{"text":"Delicious breakfast.  Loved the pour over.  We will certainly be back next visit to town."}
{"text":"First time at Colados. I got the vanilla blended coffee and the Nutella crepe. 

Coffee was yummy and very well blended. 

I got the crepe without banana because I don't like banana. The strawberries weren't very fresh and aside from the drizzled chocolate syrup, presumably Nutella, the Nutella was nowhere to be found. ): 

Note: my whole order was to go and it traveled well including the crepe ice cream."}
{"text":"If you want to go somewhere for great coffee this is the place to be. Add in some crepes? You're in heaven."}
{"text":"I love this place! They are so friendly and make you feel really comfortable. Not to mention how good their crepes are well actually everything is very delicious they have many things on the menu its very hard to choose from, as for coffees i would recommend the ice caramel macchiato. If youre looking for a comfortable, relax and cozy place to have a coffee this is the place. I will definitely be coming back and will be sure to recommend as many people as i can so they can too enjoy of a place like this . thank you for the wonderful experience it isn't easy to find places like this around here which is why I'm so glad i found this place. Keep up the great work !"}
{"text":"I ordered a \"green\" smoothie and it was very tasty. The employees were friendly. The place was cozy with nice furniture, a small bookcase with a few books to read while you're there. 
The drink menu was sufficient, however the crepes were very limited. 
I would like to have had a few more selections."}
{"text":"*Drool* I love crepes and I love coffee, so why have I never tried this place?! Family owned and absolutely scrumptious. Doesn't get much better than that. Between my little family, we tried three different crepes, one savory and two sweet. Each were equally delicious and very different in flavor.   Like so delicious it gave me chills. They taste so fresh and like they are made with precision and care. On to the coffee...I got a latte and the first sip brought me immediately back to my visit to Paris. That's all that needs to be said about that."}
{"text":"I drove 40 minutes to this place because I had heard such great things. I love crepes but it's hard to find good ones. the atmosphere was great, cozy but plenty of tables so I didn't have trouble finding a nice little area for myself. It's a walk up and order- I wanted a savory crepe but they didn't have any swiss cheese which i was a little disappointed in. 
I waited a fairly long time to get my latte but once I did it was amazing. great presentation and tasted even better. I waited equally as long for my crepe. I usually don't mind waiting I was just impatient because i assumed a crepe and coffee would come quicker. 
I got the chipotle crepe, it was delicious and again the presentation was great. I didn't care for the fresh spinach on top, because it's not cooked it has an overpowering leafy taste. next time i will hold the extra spinach. the side of chipotle was a great touch and I ended up loving the cheese that it came with. I'll definitely be back to try something new!"}
{"text":"The best coffee house. Finally! A local spot to relax in. The ambiance is not really like a local coffee house, I believe it can be better. But overall it's delicious and nice."}
{"text":"Loveliest crew ever. I'm a very picky eater and they're more than happy to make my whole wheat crepe fit my needs. Love this place."}
{"text":"If you are looking for great Crepes and coffee, Then it's a must that you try them beautiful atmosphere great service. you will not be disappointed."}
{"text":"All I have to say is that every bite of any of their crepes is like putting a little bit of heaven in ur mouth!! Soooooo good!!! The Chipotle, the Morning and the Nutella crepes are my favorite.  They are so good I haven't give my self a chance to try the rest of the crepes.  Coffees, teas and frappes are delicious as well. 
Great, clean, with a comfy atmosphere and great service keeps bringing me back and introducing this place to my family and friends.  
 Needless to say they also loved this place."}
{"text":"Absolutely love this place! Everything is delicious here from the crepes to the coffee and even the tostito dishes. It's great for dates with the girls or your significant other. Never disappoints!!"}
{"text":"Nothing better than coffee, aside from crapes, and Colaldos has it both! It's wonderful to see new places on the west side that aren't chain coffee shops *cough cough* Starbucks*. Colados is an awesome hang out that not only has great espresso or frappes, which ever you prefer, but also fresh crapes! It's a great place to start off your morning, or take a nice brake from the day."}
{"text":"The crepes here are delicious and the drinks are really good. The chipotle crepe is to die for! It did take a while for the food to come out, but the place was busy. There aren't many crepes to choose from, but the ones they do have are worth going!
The place is decorated with lots of beautiful portraits and it's a Paris theme. It is super nice and cozy!"}
{"text":"WOW!!  So happy I wandered over and tried this place. First - the latte is probably the best I have ever had!  I wanted to drink 15 more!!  

Place is super cute and every table filled!  I am not a crepe expert, but my Morning crepe was perfect. Big enough to keep me from going hungry today. 

Do yourself a favor - if you are in the west valley for a football game or the morning after a concert (or anytime you are in the neighborhood) come visit Colados Crepes - it is worth it!!!"}
{"text":"We really enjoyed this place.  Great frozen/blended  coffee, and fantastic crepe. We had the peach one,  and would almost lick the plate. 
Can't wait to try a savory one,  they look great too"}
{"text":"Came here after Yelping a breakfast restaurant with good reviews. Not disappointed! We tried both a savory and a sweet crepe (peach and morning) and they were INCREDIBLE! Their blended coffee was perfect and the green smoothie was so refreshing. The restaurant was clean and the staff was friendly. We will definitely be repeat customers!"}
{"text":"My husband and I recently returned from Paris last week, and during our stay we enjoyed crepes almost daily. Yesterday I longed for crepes and was delighted to find this restaurant. I had the wheat and berry crepe coupled with hot chai. My hubby had the traditional banana and Nutella crepe and an Americano. We opted out of the ice cream option, but I'm sure it would have been a delicious accompaniment. We savored every bite. The staff was very friendly and I appreciated the decor, as it reminded me of our trip. If only I could have replaced the outdoor scenery of the Fry's strip mall with the streets of Paris. Nevertheless, I highly recommend this restaurant!"}
{"text":"Decided to try out this cafe and glad I did. The coffee and crepes are amazing. Ordered the peach crepe and I wasn't sure what to expect. Glad I did because it was amazing. So sweet and filling! This is a favorite for breakfast now."}
{"text":"If you like your coffee strong and your crepes sweet, this is the spot. Great easy menu, even for a picky eater. Good selection of coffee and tea. Try the colado (pour over) to wake you up first thing in the morning."}
{"text":"This is a very cute place and one of a kind on the west side of Phoenix. Good coffee and crepes. Need a few more choices/variety with the crepes."}
{"text":"The staff is incredibly friendly and attentive. The sweet savory crapes election is super and only surpassed by the taste and quality. They also have quality coffee drinks. A must!!"}
{"text":"Saw this place while going to frys so decided to stop by and try it out. We got the Nutella crepe and peach ice tea. Nutella crepe was good. My niece loved it. But the peach ice tea probably needed more peach flavoring. It was bland. Will come back to try other drinks next time."}
{"text":"Marvelous, just marvelous.  You would never guess that this amazing little shop is tucked away in a rather boring shopping center between a Fry's and a chain pizza shop.  The interior is very tasteful, and the food is even better.  The pictures here are an exact representation of what you will receive.  You can see the passion and the attention to detail they have in the dishes they make.  No detail is too small.  It's the type of place you can curl into a chair with a good book and spend the day."}
{"text":"This is a total hidden gem, tucked inside a strip mall. I was meeting up with a friend for brunch who lives out west, so I looked to Yelp to see what our options were. This was one of the few spots that caught my eye, especially since it's locally owned. It was the day before Christmas eve, so they were pretty slammed but they were handling the crowd well. I ordered a balsamic chicken crepe with a dirty chai latte and my friend had the peach crepe. Both crepes were fantastic! The balsamic chicken was fully of savory flavor, I really liked how the sweet balsamic balanced with the creamy blue cheese. I also tried my friend's peach crepe and it was really delicious too. If you're looking for an awesome locally owned spot on the west side of town I highly recommend Colados and wouldn't definitely return!"}
{"text":"Very cute spot for catching up! A friend I hadn't seen in years and I spent well over two hours here and it was holistically pleasant.

The spot is a little hard to see within the scope of the plaza but parking is cake. Capacity inside is about 25 people and there are high tables, low tables and a few couch seats. Cute interior and it was holiday decorated, nice touch. Their menu was diverse... Sweet crepes, savory crepes, hot, cold and blended coffees and hot and cold teas, smoothies and... Tostitos preparados! Ha, plot twist. My friend had the nutella crepe and I had some good ole fried ice cream (with the works aka coconut, fudge and almonds). We ordered on the same ticket and we each were able to easily split it using our cards. After, we took a seat and immediately lost ourselves in conversation over their soft but lively jazz music! And before we knew it our drinks arrived, and shortly after our sweets! Their presentations were hands-down ig-worthy. The crispy ice cream was an awesome way to break my fast!! Call me a rebel ;) My chai latte was lukewarm so it could have been warmer, but my friend's blended French vanilla was perfect. 

All the staff were polite - they greeted, nice small talk while ordering, checked up on our table through out, and cleared our table at the end. 

I'm visiting Colados next time I'm in town, it feels \"me\"!"}
{"text":"Omg.  So good.  This place is tucked I to a grocery store strip mall, what a pleasant surprise.  We got there just before the lunch rush, which was a good thing because there was a line out the door!  Amazing crepes!  Excellent service."}
{"text":"Great mom and pop stop! Support local business!! This place tops Starbucks for sure!!"}
{"text":"It was instant love! From the warm reception to the amazing Breakfast crepe with bacon, eggs, cottage cheese, fresh tomato and garnishes. Wait. Is that jazz I hear playing overhead? Oh my! A feast for eyes, ears, and tastebuds alike! Add a double shot dirty chai with soy milk and whip cream and you have a bit of heaven on earth! Maybe even two bits of heaven on earth :)"}
{"text":"The  crepes are made there fresh when you order with fruit toppings.  These are some of the best crepes I have tasted. Their cappuccinos have the perfect taste and everything was absolutely delicious.   The staff is very nice and always make you feel welcoming. My favorite coffee place."}
{"text":"Swanky decor, friendly service and amazing food. I ate the nutella crepes with vanilla ice cream. The crepe was one of the best I've ever had. The matcha green tea is really refreshing and calming too."}
{"text":"A very small and intimate coffee shop with great coffee. I didn't get a chance to try to crepes but many people were ordering them so they must be good. The staff are all friendly and nice. It gets a little crowded which is a good thing but can also be a bad thing maybe. However, it's crowded for a reason: people like coming here. Coffee is not \"coffee snob\" level but it's pretty good for normal people."}
{"text":"I was shopping in the area and decided to grab a coffee before a long drive home. Found Colados on Yelp and it was 3 miles from the mall but what th heck if they have good coffee.

I am glad I came!!! The iced macchiato is perfectly prepared...not too sweet, yet strong coffee. Perfect! Would definitely come again when I am in the area."}
{"text":"They have great crapes the only thing is they don't have a lot different crape Variety.
 There's only about 7 of them , I believe this is including sweet and savory. But wha they do have is a variety of delicious coffee & tea . is a family owned restaurant small gig kept we'll cleaned and amazing customer service ! 
Their is only one location but soon to have a second location it the end of the summer 2018 witch will be located 7 st and Oak."}
{"text":"I went to this place with my family and it was delicious. The service was great and the staff was friendly. The smoothies were good and of course the crepes were sweet and scrumptious. Don't miss out!"}
{"text":"Oh the crepes are so good... the balsamic chicken is yummo! I just wouldnt go here if your actually hungry. More of a small meal / snack kind of place."}
{"text":"I have been to this place a few times now, and love to sing it's praises.  The employees are so nice and accommodating.  They seem to remember my husband and I and that makes us feel very welcomed.

The sweet crepes are delightful.  You can taste the deliciousness of the crepe without being over powered by the toppings.  Totally worth it to get the ice cream on top.  I do wish the peaches were fresh, not canned.

The savory crepes are great.  The chicken inside the balsamic chicken tasted a little like canned chicken, but it worked.  I would definitely order again.

The coffee and tea is fresh, made to order.  I love that the sweetness doesn't over power the taste of the drink itself."}
{"text":"Everything in their menu is delicious, customer service is great also. Me and my wife discovered this place a couple months ago, and now every Saturday morning we eat here. It is delicious. Definitely would recommend it to anyone"}
{"text":"I love this place! The place is so cute and homey! I usually get the Nutella crepe, but decided to go for a savory one for breakfast this morning. I got the Morning crepe and it was delicious! I'll definitely be coming back to try all the other ones. Their white toffee coffee and matcha green tea are also amazing! I always recommend this place to friends and family too."}
{"text":"This place is the bomb!  Family-owned, friendly....and best of all--DELICIOUS!

They will make you just about anything you could find on the menu at Stabucks and even some unique creations, crepes mainly."}
{"text":"Love this cozy and welcoming place. Owned by husband and wife and operated by the couple.  Nutella crepes and  fried ice cream was delicious! I love the ambiance of this place and what a great choice of music! Love it!"}
{"text":"This is a must try place!! The food is fantastic and the coffees are delicious!! You can find a comfy place to sit there or take it to go! We will definitely be back!"}
{"text":"I'm a coffee snob and I LOVE the latte here. However the crepes stand on their own the pineapple coconut taste like a piece of Hawaii. I've never been disappointed. Staff is sweet and attentive but don't expect a quick coffee, as it's usually very busy, don't worry it's worth the wait! Family owned & local, you'll often find the owners mingling around. Love it!"}
{"text":"I love this place! They have a lot of options! Everyone here is very friendly and helpful if you don't know what to get. This is probably my third time coming this week! I get the whole wheat crepe"}
{"text":"This place is great and I highly recommend it!!!  Great design & decor, great customer service, fast service, and let me not forget great crepes & coffee!  I went with a good friend of mine and we were so excited to try this place out with high expectations of course and it did not disappoint!  They have a variety of expresso coffees and teas.  I had the Nutella crepe with a side of vanilla ice cream that was very tasty!  I'm looking forward to visiting again and trying their other crepes but I especially am looking forward to trying their fried ice cream!"}
{"text":"Great ambiance great food.  Small menu but done well.  Had the chipotle crepe it was amazing.  Tried the Nutella crepe it was equally delicious.  When we got here the line was really long but it went down quick.  The employees are all really friendly.  The stopped by and asked how our food was and chit chatted.  Great service."}
{"text":"YOU MUST COME TRY THIS GEM! It's located in West Phoenix, which could be quite the drive for some people, but totally worth it. They have an extensive menu of sweet and savory crepes. I ordered the strawberry nutella, the chipotle, and tropical crepe. I seriously couldn't pick one as the best crepe. My friends and I were WOWed on how amazing they tasted. 

Also, the owner is usually there and engaging with his customers. Excellent service ALL the time. The staff is really nice too, and they are great at providing recommendations."}
{"text":"Thoroughly enjoyed my breakfast from here. I was concerned whether or not there was going to be any high-protein options on the menu and it turns out they can put egg and bacon inside any of the savory crepes (they recommended the Chipotle crepe and it was delicious). Price was a little higher than I was expecting for the bacon and egg chipotle crepe at $9.50, but since it seemed to be made from scratch, I won't dock them any stars for that. Great cold brew coffee as well. This is a place to treat yourself to for sure!"}
{"text":"Awesome little neighborhood place. the coffee is nice and strong, the crepes are tasty and it's a nice little place to hang out."}
{"text":"Upon arrival of the establishment look very cute. The downside of this place is the choices available on the menu. Also we're having as many employees as they do in the back it took me about 20 minutes to get my food, which was a simple crepe. Definitely would avoid during school days as the establishment is full of high school kids. Not very impressed"}
{"text":"The food is great and the servers are always so nice! My only wish is that they opened at least at 7am. I would swing by every morning for a coffee if not crepes if I didn't have to be on my way to work by the time it opens. I truly do love this place and maybe in the future we will get lucky enough to have it open a little earlier!!"}
{"text":"This place is a true gem. It is family owned and operated and from the moment you walk in the door till the moment you leave you feel like you are part of the Colada's family. Their specialty is crepes and the variety is truly amazing from sweet to Savory there's something for everyone. Their coffees are fresh-brewed and their deep fried ice cream is out of this world! Recently they have started making fresh salads that I can't wait to try. If you haven't been to this sweet place you don't know what you're missing."}
{"text":"Quality crepes and coffee / tea. Casual atmosphere, chill. Good for conversations. The Nutella crepe was tasty but could have been bigger! The dining area is very open so no hiding spots for private dates but great for people to get together!!"}
{"text":"First time in Litchfield Park wanted coffee and a quick bite. I love crepes so decided to try this place out. It's small but very popular. If you're in a hurry this isn't the pace for you; however, this is definitely worth the wait. The coffee was good and the crepe was amazing. Would highly recommend if you are in the area. Would love to see them opens North Phoenix or Scottsdale location."}
{"text":"Really nice experience!!! Estoy enamorada de este lugar muy buen servicio!! I totally recommend"}
{"text":"We've come here three or four times now, and have always been so impressed with the quality and uniqueness of the food. So good! Definitely our favorite place to go for breakfast. The employees are always friendly as well."}
{"text":"Honestly I don't get the fuss about this place,  the coffee is far from good, the crepes are small, they don't have enough filling in it and, or fruit on them, actually this place over price their food for the quality and quantity they provide, I gave this place several chances but sadly I have to say, it was a waste of my money."}
{"text":"Great coffee and the crepes are delicious! Nice staff and simple but nice atmosphere. Will be coming back often."}
{"text":"Great place, super clean and comfortable. I've come here 5 times or so and the staff is always chill, professional and do great on the food and coffee... Highly recommended! The crepes are delicious"}
{"text":"This place is so cute!! Cute little sections. They have pretty portraits all over. And let me tell you.... AMAZING MUSIC! It's like classic old jazz or something. Michael bubble. Frank Sinatra. That kind of feel. I really enjoyed their music choices. It was pretty great. I did devotions with one of my best friends here and it was so fun. I didn't try their coffee however. I have yet to try it. But man was the crepe good. I had a Nutella crepe. It was super yummy. Highly recommend coming here for a crepe!!"}
{"text":"Had the Nutella crepe and it was delicious with fresh strawberries and bananas. I will definitely be going back! Staff there were pleasant and provided quick service."}
{"text":"Finally a creperie/cafe in this side of town! Crepes are pretty cheap - around $5. There's only around 3-4 crepes to choose from but it's better than nothing. To me the crepes were a little dry and a little too chewy but was still good nonetheless. There are other food available too (fried ice cream, chips).

Oh and I like that they played Jazz music.

Id rate it 3.5 stars but ill bump it up to 4. Just have had much better crepes from other places."}
{"text":"Good place to go and enjoy of coffee, smoothies & crepes... Family owned and operated."}
{"text":"Crisp....Tasty....Delicious....looks like crepes for dinner.

I had to try this place spotting it after finishing up some grocery shopping. On my first visit, I ordered the Tropical ( pineapple, coconuts, & nuts) and Chipotle (cheese, ham & spinach). Both crepes were absolutely delicious.  These crepes were everything a crepe should be, light, crispy,delicate, soft, and full of flavor.

Ordering is done at a counter and the food is delivered to the table. It is definitely a very casual and comfortable neighborhood eatery. I sat at a window table and just watched people passing.  The staff is friendly and very warm and  accommodating."}
{"text":"My daughter discovered this place and it sure was a good find! You'd be surprised that there are only 7 Crepe items on their menu but they are all you need. We ordered one savory crepe called Morning.  It had bacon, eggs, green bell pepper with sour cream dressing drizzled over and a cottage cheese topping. It had a chipotle sauce on the side. It has my 2 thumbs up!  The other crepe we ordered was the Strawberry-Banana Nutella crepe with vanilla ice cream and whipped cream. Heavenly! Their iced coffee was also good. I highly recommend this place."}
{"text":"I ordered the Nutella crepe which included bananas, strawberries, whip cream and a side of ice cream. SO GOOD. It was smaller than I expected it to be. Thought my bf and I would be able to split one.. He ordered a strawberry smoothie which was also delicious! I'll need to stop by there again!"}
{"text":"It's in the Fry's shopping center, but when you step inside you would think you were at a trendy spot in downtown PHX or South Scottsdale!!! The flavors of the food and coffee are amazing, the service is very friendly, the ambience is great!"}
{"text":"I was only introduced to this place yesterday and went back today to have my husband try it too! My friend and I like to check out hole in the wall places and this one is an amazing find! The place is spotless (including the restroom) and the staff is incredibly friendly and helpful. I love that they ask if its your first time visiting and that they help you with your decision by telling you about, and describing, their favorites. They did a good job to create a nice and cozy atmosphere although it is a small strip mall establishment.

Their drink menu is large and filled with your coffee house favorites, but they're keeping their crepe menu simple, with four sweet and three savory choices, and I love that. I think that works extremely well. Yesterday, I have a sweet crepe - Nutella with bananas, strawberry and crème. Delicious, standard, save. And I had a vanilla latte macchiato with that - also delicious. My friend had the chipotle one, (but with turkey instead of ham), and I tried it...oh.my.gosh. 
I liked it so much I came back today for lunch to get THAT one (but with ham) and to have my husband check it out too.  I had a passion fruit iced tea with it. I wouldn't get the tea again but the chipotle crepe is outstanding. 

I know that we will be back because we want to try all of the crepes :)"}
{"text":"New stuff on menu!!! White chocolate raspberry coffee, Cherry Crepe and the Island Latte. Great place to start your day with!! There iced coffee is great and made fresh right in front if you. Will definitely be stopping by again."}
{"text":"I love coming here! I don't come as often as I should, but I will definitely make it a point to come more often. 

The staff here is always so warm and hospitable to say the least. They treat you like you're a guest in their home. 

The food is awesome. The coffee is just right. And it's peaceful here. (The perfect place to study if you need some quiet.) 

I'll definitely keep coming back for more!"}
{"text":"Awful is the best word I can use for this place. The staff has an attitude. I ordered a hot chocolate. I was asked if I wanted marshmallows and whipped cream. I said I only wanted whipped cream. The server brought me my hot chocolate way after being my food. I told her that I ordered my hot chocolate without marshmallows because I'm  vegetarian and i don't eat marshmallows. Instead of just saying she was sorry she said well that's what you asked for. My crape was ice cold. The pineapple was right out of a can. All those great reviews must be from their friends and relatives. There's no way I'd ever go back there. Do your self a favor go somewhere else and don't waste your money."}
{"text":"Bring the family here twice a month for a healthy start to our weekend with a quality breakfast. Bang for your buck when compared to larger businesses and the flavor in both the variety of crepes and drink (coffee tea etc) is fabulous.

Wife introduced me to this place and let me say that for being a small business it's had large success."}
{"text":"My experience here was below average. I don't know how these guys have such high reviews, but I got my coffee about 10 minutes after it was ordered and there were only about 4 customers in the place at the time. I sat down prior and was told to move to another spot because they had a party of 10 coming in. I don't know but I felt that was a bit rude since I was there first and the full party had not arrived yet. 

Coffee: below average
wifi: weak. 
Atmosphere: good
Food: n/a"}
{"text":"Amazing. I actually wish that people didn't know about this place because it's always packed!! But regardless they are quick and have the best quality. You can order anything  here and you will be pleased"}
{"text":"I'm pretty disappointed in a couple of things not really about the restaurant, but past reviews. It came up as \"good for dinner\", \"good for kids\", and \"good for groups\".  However, I would not peg this place for any of those things. The food is extremely light and not filling. So if you're looking for a light dinner, then this place is for you. The setting is more intimate; any group over four people and you won't be able to sit together. The crepes are more on the sweet side, and they have nothing savory for vegetarians. As far as service, taste, ambiance: the service was good, the place was clean, and the food was good. Nothing crazy good, but good."}
{"text":"Great service and good coffee full of flavor

It's on the other side of the city for us but worth a stop by when in the area!

The people working there were all very pleasant!

They also have some good crepes too!"}
{"text":"The best breakfast spot that I've found in the west valley so far. The food was phenomenal and the drinks were great. I have zero complaints about my visit here."}
{"text":"We were looking for a light breakfast option so I came here with my son this morning.  Wow!  Great service, nice & clean, reasonably priced, great coffee and delicious food. 

We tried the Morning Savory crepe and Chorizo crepe. Delicious.  We also shared the Nutella crepe.  So good. 

We will be back!!!"}
{"text":"Absolutely delicious! Found my new coffee and breakfast spot! We need more places like this on the westside!  The crepes are to die for and the cappuccino is incredible! Check this joint out!"}
{"text":"Very busy, and packed place. The atmosphere was nice. The employees were keeping up with the orders and extremely nice. You could tell they liked there job. Food was fantastic. The savory crepes are amazing! Try it out, it's worth the wait!!"}
{"text":"Minus one star for the vanilla latte which was undrinkable. Fortunately the blended hazelnut drink and crepe made up for it. The drink was perfectly creamy and not overly sweet. The breakfast crepe was a really nice surprise. It had eggs and bacon (I held the bell peppers) with cottage cheese on top. At first I was skeptical about the cottage cheese but now I'm going to try it at home. The bits of cilantro and got sauce on the side made it the perfect breakfast."}
{"text":"This is a great place! I'm Deaf. People who works there are very nice and patient. They are willing to help me. They would get a notepad and pencil for me to write down what I would like to order. It's greatly appreciated! I love Blended Chai Tea Latte.it's delicious. Thank you!"}
{"text":"This is a great local coffee shop with awesome crepes! My wife and I rode our bikes over for brunch. We both enjoyed the chipotle crepe. I had an Americano and she had a blended white chocolate. Both were very good. It's a great addition to the neighborhood, and we will certainly be coming back! Would love to see some bike racks in front though."}
{"text":"This place has the cutest decorations ever. Such a great hang out place with friends. Super clean and friendly staff. They are pretty quick with taking orders and delivering them. Even though place is small, the way they arranged the tables makes it roomy and easy to move around. The crepes here are delicious as well. Made just right and not too sweet. I wish they had board games for us to play with while enjoying our orders though. And if they closed a little later than nine, my friends and I would be here everyday. Come here if u want a great place to hang out and get good crepes with your friends!!! 

Note: prices are very reasonable as well :))"}
{"text":"This places is the best for Crepes! They never disappoint. I recommend the Nutella crepe or the tropical crepe both of which go great with a scoop of vanilla ice cream! It's a good place for studying and for a hangout with friends! And it's prices are reasonable too!"}
{"text":"What was life like before this place.....Seriously! I am in love with the Nutella crepe, fried ice cream & white chocolate blended.  so good! This is a must try!

I was a little skeptical about the crepes, I thought it is probably going to be too sweet. It really balances with the strawberries and banana! What is Starbucks? Nothing compared to Colados coffee."}
{"text":"Quality breakfast had at Colados Coffee and Crepes. The service was great and the atmosphere was comfortable, even though it was very busy today.  The chocolate chip and white chocolate helados were tried as were the nutella and peach crepes.  Both helados were tasty and provided an added boost to the day.  The nutella crepe was super sweet and tasted great. Just make sure your sweet tooth is in full effect for this dish. The peach crepe was very good and the almonds really added a nice touch. Very impressed by how well this restaurant is run."}
{"text":"The mocha was perfect. Not too strong but rich and pretty.  Service was awesome!  We couldn't find seating large enough for our party of 8 so they let us sit in their conference room.  I had the Tropical crepe, they were very generous with the pineapples- if you like coconut and pineapples  I suggest getting the tropical crepe...wish I had asked them to drizzle some chocolate syrup on top.  Got to try their savory crepes next time."}
{"text":"Don't think I'll come back. Me and my friend went here tonight because I heard amazing things and wanted to try. This place is very overhyped. We walked in to a completely full restaurant which was loud and crowded. We went to order and the cashier wasn't that happy and honestly looked like she couldn't have cared less. I ordered one crepe and she told me it would take about 30 minutes to make. I said it was ok and I paid. My friend ordered a butterfly pea tea. We managed to sit in the horribly crowded space. It took them about 20 minutes to just bring out my friends tea and wow, it was horrible. It tastes like artificial grape and cough medicine. When I finally got my crepe after 40-45 minutes, it was cold and not very impressive. Will not be coming back."}
{"text":"This was our first time and we found the crepes to be very delicious; the staff very friendly ; and crepes/coffee are made fresh for every customer.  They have been in business three years and I hope they continue.  We will return!"}
{"text":"What a great little place with some very reasonable pricing. Glad I stopped and I'm bringing my friends next time."}
{"text":"Great experience! Friendly service, the chai latte was delicious as well as the crepe! I had the pumpkin one  I will return!"}
{"text":"They didn't actually have the oreo fried ice cream :( I had been dying to come here for that! They only have one that is coated with granola which wasn't great. No vegetarian options for their savory crepes. I wish their menu was more descriptive. I don't like caramel (I know I'm weird) and my peach crepe was filled with it. Nothing was super yucky or bad, but nothing was worth finishing either. 2 stars because a lot of this negative review is due to food disappointment. I'm sure I would have enjoyed it more if I had a better idea of what they have and what's in their crepes."}
{"text":"Delicious and best Crepe and Chai latte in town. Must visit and beware of becoming addicted to this place. Oh they also have fried Ice cream so yummy! Colados has a relaxed atmosphere. Simply my favorite place and I know a lot of people have not yet tried a crepe and this restaurant will make u be addicted to them. From Nutella, banana and Strawberry is my number one then my second choice is the Balsamic Chicken?! Right? Yes delicious. My first review yayyy :) haha"}
{"text":"My favorite coffee shop! I had their peach crepe and colados coffee the 1st time I was there and they were both amazing! Coffee was sweet to taste (you will love it if you generally get sweetened coffee). Crepe was a big portion, but I finished it anyway because it was that good.

I got a chai latte the 2nd time I was here, and this was, hands down, the best chai latte I've ever had (so SO much better than Starbucks) and it even comes in such nice presentation. The staff here are young and friendly, always greet you when you come in and when you leave. Their wifi was finicky when I came the 2nd time, but they put in their best effort to get that fixed and had the heart to let me know when it was back on! 

Small coffee shop with pretty decors! So worth it! :)"}
{"text":"Absolutely delicious! We ordered the peach and the Chipotle crepe and it was delicious! :)"}
{"text":"I read a lot of the reviews before going in for breakfast. I noticed a lot of people saying that the crepes aren't that big but I thought it was the perfect size for one person. Not sure what size others are expecting a crepe to be. I ordered the Nutella crepe with a scoop of ice cream and it was delicious! For a drink, I ordered a small passion tea with lemonade and honey which was also tasty. Overall, I have no complaints about this place. I also got it to go and the ice cream was still cold and frozen by the time I got home which was a plus! I'll definitely go back."}
{"text":"Yum! This place is crazy busy but rightly so. If you are in a hurry, do not come here. I repeat do not come here and then complain about how long it takes to get your food. When I went it was standing room only. Even the tables outside were full. I got the Nutella crepe and oh my god! It was absolutely delicious. I also got a chai latte and it was very good. The crepes are large so bring an appetite. The inside is very cute and the staff is friendly amid the chaos. Somehow they keep it all in order."}
{"text":"This place is awesome really good coffee great customer service their menu love it.  Screw Starbucks!!"}
{"text":"Came here on a Saturday afternoon with my niece.  We split the Nutella and Morning crepe.  They are so delicious.  The crepe is light and flavorful.  The drinks are good too.  She had a latte something and I got the fruit smoothie.   Staff was friendly and helpful.  Food/drinks came out quick.  Need to come back to try more items."}
{"text":"Tried this place out with a group of friends.  We called ahead to make sure there would be enough seating.  They reserved a small room with a high top table for about 10 people.  There is not a large menu of choices for savory crepes. But we ordered a variety and they were all so delicious.  I had the grilled chicken with balsamic and it was wonderful.  The dessert crepes were just as great.  Definitely coming back!"}
{"text":"Absolutely cannot wait to go here and have one of their crepes! Accidentally found it yesterday and am so excited to take my honey...."}
{"text":"Wow, what a gem inside a strip mall. Appears to be very popular with the locals as it was packed on a Thursday morning around 8:45."}
{"text":"Fresh. Delicious. Excellent! We are a group of 4 from Seattle & Florida just asking Siri for a crepe place & she led us right to them! Perfect little stop for any time of the day! Really great!!"}
{"text":"I won't write a long review because this place doesn't really deserve a well thought out review.. 

I ordered a nutella crepe to begin with and I'm not gonna lie, it was good. My sweet peach iced tea wasn't even sweet. That was the problem.. I asked if they can make it sweeter and the girl added \"sweetness\" to it, but it still tasted watered down. 

The prices are reasonable though. The one thing I did love was the way it looked inside. It was cute and most likely I will come back,  but I won't order a sweet peach iced tea."}
{"text":"This place was pretty cute! We tried a couple dessert crepes which were okay but the fried ice cream was surprisingly good. Expect a giant ball of a ice cream rolled in granola. I'm not convinced that they're actually fried but it was really good nonetheless."}
{"text":"I had a nice breakfast here, while coming through town.  I had the chipotle crepe with ham, etc..  It was good and freshly made to order.  I also had a latte, which was good as well.  

I'd visit again if in the area, as I would like to try one of their sweet crepes."}
{"text":"I got the Nutella crepe which came with Nutella, bananas, strawberries, whip cream, and ice cream. The crepe was really good. It was fresh, not under cooked, and has a nice presentation. Even though they were busy they didn't rush my food which is what typically happens at a less expensive restaurant. I'd rather wait and get quality. I also had the coffee which wasn't as sweet as I would like, but it was made fresh so can't complain. The restaurant itself is small. You order in line, get a number & then grab a table. Someone comes and brings you your food. It was clean though & very busy so I imagine I'm not the only one to enjoy this place. Will definitely be back!"}
{"text":"Bruuuhhhh I've been sleep on this place for way too long. Coffee was bomb and the Nutella Crepe was flames. I will be back tomorrow!"}
{"text":"I got the nutella crêpe with strawberry and banana, and I tasted the morning crêpe.  Both were pretty good, and the presentation was definitely beautiful, but could have been a little more substantial in my opinion, especially the savory crêpes which seemed like they could have had more inside.  I'm barely over 100 pounds and if I think they could have been bigger, I'm sure people taller than me would agree.  The place was very cute, very clean, nice decorations, even flowers on the tables, and was a nice place to hang out.  The staff was very friendly.  I was disappointed with the lack of variety on the menu, with only 3 sweet and 3 savory options available.  These things may just be being overly picky but I would have preferred if they didn't take so long to clear our empty plates after we were done while I was finishing enjoying my delicious latte, and I also wish they would offer real silverware and cups instead of plastic, since plastic is wasteful and bad for the planet.  Overall, pros and cons... I would go again... and this is after all one of the only places (maybe the only?) to get crêpes in the west valley, so it's nice to have a place to go for this."}
{"text":"This place is a must. There aren't many like it out there. If you are craving for something sweet but not overwhelming this is a great option. They have a variety of flavors and they are all great combos. I have two fav: the classic strawberry banana and NUTELLA!!! And the tropical cococunt and pineapple! They are just sooo good! I've tried the peach one too and didn't disappoint. Their customer service is great as well. The place is neat and clean and I like their theme. They have great atmosphere to spend a good time with friends."}
{"text":"My first restaurant yelp review but I had to share.  I am visiting  AZ from California for Superbowl 49. Found this place on yelp. I ordered the Morning Crepe and my husband got the Nutella. From the first bite i knew it was THE  BEST crepe I've eaten. When i go back to California will be dreaming of my Morning Crepe! definitely recommend this place."}
{"text":"This place has some of the best crepes and best coffee that I've had, hands down. I had the morning crepe with a caramel latte and my husband had a Nutella crepe with a mocha latte. Everything tasted incredibly delicious."}
{"text":"I don't think this qualifies as a coffee shop per se, it's more like a café. Cool place, nice people. Except they talk to you according to skin tone. If you look lighter they go for English, if you look darker or tan, they go for Spanish. I speak both, but that's annoying. The protocol should be: Speak to your customers in English, they're the ones who will let you know if they speak Spanish only. Now, the coffee was good, they just need a little station in the actual dining room area with cream, sugar and other items so that you don't have to be asking every time you need something."}
{"text":"Nice to see a coffee place on the west side that is not a Starsucks! I tried the colado coffee since I had never heard of it. It is strained through a cloth. Wow, lots of coffee flavor, without a trace of bitterness! It is quite unlike the aforementioned coffee chain's joe, which is awfully bitter and burnt-tasting. I highly recommend the colado.

I got the Nutella/banana/strawberry crepe to go with. It was delicious but a bit over the top with lots of whipped cream and chocolate syrup drizzled all over. Next time I will order it without those toppings; i think Nutella is really rich enough on its own. The crepe itself was lovely.

This place appears to be family owned. They were really sweet and concerned that I was pleased with what I ordered. How nice is that? Hard to find around here. And it is nicely decorated inside. Avoid the Starbucks down the street and come here instead."}
{"text":"I love this place. They have great coffee both hot or cold and the creeps are delicious. Couple that with friendly and attentive service and you have a winner. Even the decor is very nicely done, both inviting and relaxing. Great unexpected find."}
{"text":"Wonderful service! I had the chipotle crepe and it was delicious and the chai latte was amazing. I can't wait to come back for more!"}
{"text":"Glad to have a cute place in Avondale! I love the atmosphere and there is a good selection of drinks and crepes. 

A friend and I ordered just drinks, mine blended and her iced. They came out opposite. The drinks did take quite a while to come out, and the place really wasn't all that busy. 

I wish them luck in the new business! It was a great place to hang out."}
{"text":"Pro: Place is clean. It is also one of the few places in phoenix that offers crepes.

Con: Service was really slow and disorganized. Waited 15 minutes for my order only to find that they misplaced it. A couple of orders sat on the counter without calling out for who it was from.

There is only 6 kinds of crepe to choose from. Size was small for a 5 dollar crepe. Chipotle flavor was good. Nutella....was disappointing...."}
{"text":"This place is so quaint and cute, like sitting with Hemingway in a French cafe sometime in the twenties! Only thing is the coffee could be a little hotter. Will definitely be coming back!"}
{"text":"This little cafe reminds me of the wonderful cafes back home and in Germany! It  is family operated (who doesn't love supporting a small business?) They are all super friendly and attentive. 

There coffee is great. When they first opened I asked for a very specific drink that not many places can make well and the owners nephew made it for me he said it was his first time making it and he would remake it if I didn't like it, but he nailed it!! They make there crepes fresh right in front of you every single time and they are super yummy! 

Now lets talk about some amazing service! The owner brought around some of the stamp cards he had when they first opened up, I was working at an office close by and was unable to leave the office even during lunch breaks. I asked him if they did delivers, he stated typically they do not, however he would for me. I literally got coffee delivered mid day to my office 3-4 times a week with NO Delivery fee!! 

Seriously if you haven't tried this place and your a coffee lover like I am go, like now! lol"}
{"text":"Average.  The place has a lot of potential, but needs some serious work. The ambiance isn't too bad, tables are a bit small to work on. Shelf space is poorly used and many of the items they used were from the grocery store nextdoor. I can appreciate needing something in a pinch, but when the creamer comes from the grocery store or the can of whipped cream. Be authentic!!  The \"meeting room\" could be used for additional storage, etc.  Have 1 unisex bathroom and convert the other into a dishwashing area.  The books occupying the shelves behind the counter... It's a decoration... It shouldn't be back there and as much as I can appreciate the need to clean, especially the dusty & dirty grill on the bottom of the fridge, during business hours is not the time to do it. Either spring clean in the morning or evening after the customers go home. 
Have more available flavors for the coffee and experiment with the crepes.... Like I said, lots of potential, but needs lots of work!!"}
{"text":"Love this place. The crepes are delicious and the coffe is just as tasty. It's my go to place when I have guests from out of town. My favorites are definitely the morning crepe and the chipotle. And I always finish by sharing a nutella crepe with scoops of ice cream. Highly recommend it."}
{"text":"We absolutely love the food here and that it has variety of options of crepes, smoothies, etc. The atmosphere is great for nearly almost all occasions and the service is wonderful!!"}
{"text":"Dear Colados,

As a resident of the Pacific Northwest, a Mecca of artisan coffee and beacon of the coffee community, I am always caffeine-depressed (depresso) when I visit Arizona. There just are no quality coffee opportunities here in the Avondale area--and I've looked. Oh, how I've looked.

Your coffee is a light in this-- what must be without proper coffee experience--unhappy part of the world.

Sincerely,

A Weary Without Coffee Traveler"}
{"text":"Seriously one of the best crepes I have had! As soon as I stepped in, I knew it was a good place because it smelled like heaven. This is a little mom & pop shop and you can definitely get that vibe in here. I love supporting local small business owners so it was great to see that the owner was in the restaurant and cleaning up tables while we were there. 

There was a group of 4 so I was able to try a little bit of the savory and sweet crepes. I must say that these people know how to make crepes! The portion was just right and the flavor was really good! I really can't point to 1 good crepe because all the ones I've tried was really good. Glad to see a crepe restaurant in Phoenix!"}
{"text":"It's a nice small coffee store that sells crepes.  It's good delicious crepes that goes very well with their coffee.   They need more flavors or have more days with different flavors or everyone is just going to end up ordering the banana and nutella crepe.  It's 10000x better than Crave at Westgate.  I have honestly not many complaints about Colados, but the location could be much better than being next to a Fry's Supermarket."}
{"text":"Oh my gosh, why have I never been in before  I got a Green Tea with Mango and it was by far better than Starbucks and the price is even better!! Will be back for sure!!!"}
{"text":"Great place to relax, the staff is very hospitable, awesome food. Lots of room to walk around. Very clean too."}
{"text":"Delicious breakfast crepes and desert crepes!! And their hazelnut iced coffee tasted amazing!! I loved it
I guess the only downside would be it was like 50$ just for two people. It's kinda pricey but hands down the best desert crepes I've had
Waaaay better than iHop, js"}
{"text":"This place is fantastic! So glad I found it on Yelp! Went there on Saturday and it was busy but there were a few tables open. The bf and I both got the nutella strawberry banana crepe, but he got his with ice cream (decadent!) The crepes are just what they need to be -- soft but a little crunchy on the edges. The serving size was perfect. I just wish they would add a couple more flavors to their menu! I definitely want to try the peach one next. 

I ordered a hazelnut ice blended coffee and he got the white chocolate ice blended. Both drinks were great -- they were a little runny, but it's summer in AZ so that's to be expected, but the flavor was spot-on. Sweet but you could still taste the rich coffee flavor. 

The service was also very good. It was mainly staffed by high school-aged kids, but they were very friendly and the girl behind the counter gave us an extra stamp on our punch card for being new customers.

Thanks, Colados! We will be back!!"}
{"text":"My husband was one of the first customers and it has been great to watch this business grow over the years. Bernie and Yessica are wonderful people.   Always love brining the family here.  The crepes are fantastic and they always come up with some seasonal flavor that really hits the spot. Don't pass up this pass."}
{"text":"Some of the best coffee and crepes.  Every time we are on this side of town we make it a point to stop in.  Friendly family run business.  While the place itself is small, the ambience and decor is nice.  They even have a separate room for small business meetings and such.  The only bad thing is that there is not one closer to me!"}
{"text":"I love coming here everyone is soo nice and the creeps are sooo yummy!! We came for a baby shower and they helped us so much and very nice! Also when I have order over the phone when I go the order is ready!"}
{"text":"Finally got a chance to check out Colados this Saturday late morning. It was very crowded. The service was fast and friendly. Love the fall weather in Phoenix and I was able to grab a small sidewalk cafe table. Tried the seasonal pumpkin crepe with house-made pumpkin filling, marshmallows, glaze, and pecans. The presentation was beautiful. The crepe had a little bit more marshmallow than I like, but I just put them to the side. I expect to come back again!"}
{"text":"This place is definitely a hidden gem! Crepes (breakfast, lunch & desserts) are all amazing. Their green tea is also good."}
{"text":"AMAZING ! That's all this place is, the crepes are delicious and the coffee is simply amazing ! It's also a great place to sit down and work on stuff or a place to talk to some friends !"}
{"text":"You have absolutely got to try this place. It is awesome! The crepes are amazing!!!!! It is family owned so you automatically feel welcome when you walk in. I honestly can't stop thinking about the next time I get to come back! This place is a MUST!"}
{"text":"This place is amazing!! There was little choices but what they had all seemed amazing! I had the breakfast creepe and it was so delicious! My husband got the chicken one and said it was delicious! And my cousin got the Nutella one and ate every last bit of it. A little on the pricey side but definitely worth it! Ice tea was great as well!"}
{"text":"This place is amazing and great for a late night dessert run. It's intimate and perfect for a first date and it's chill and comforting if you want to have some desert with the kids. The portions are big so share!"}
{"text":"Food was great! Seems to be crowded a lot of the time and not very organized with handling food"}
{"text":"I have been here so often and realized I've never done a review. The people and atmosphere is really great and so friendly. My favorite chai latte of all places is here, and their crepes are great! The strawberry smoothie tastes like a paleta de fresa. The seasonal crepes are always something to look forward to :)"}
{"text":"I almost want to smear this place just to keep it to myself, it's so great!  But that would be a great disservice to my fellow man.  I have only been here twice, but each was a treat.  It's clean and nicely decorated, the staff is very friendly and professional.  The first time I came, I had a Nutella crepe with ice cream.  It was to die for!!!  Made fresh and delicious with ripe fresh strawberries and bananas on top.  I've been in search of primo chai and found it here as well.  Nice and spicy with just a hint of sweetness.  Tonight I had the fried ice cream.  It's a good thing I didn't have to die for the Nutella crepe, because I need that life to die for the fried ice cream!  It was a huge globe of crunchy creamy goodness on a fudge-drizzled plate sprinkled with fresh strawberries, adorned with caramel and more fudge, and crowned with whipped cream and chocolate curls.  Beautilicious!!!"}
{"text":"Was a bit pricy for the coffee and it was completely watered down. Worst coffee ever. Will have to go back for crepes though"}
{"text":"Love, love, love this place. We typically go on Saturday morning for amazing crepes and delicious coffee or Chai Tea. We recommend this place to many."}
{"text":"Yum! Yum! Yum!  The creeps are sooo good and inexpensive, too!  Great coffee!  I had a peach crepe with almonds and whipped cream, hubby had a whole wheat crepe with strawberries and granola, and daughter got a Nutella and banana crepe!!  Clean establishment, quiet, and friendly!"}
{"text":"This place is amazing! Great crepes and great service. Second location opening soon!
Just try it you will love it
I had coffee Americano----excellent 
I also had the sweet Nutella crepe with bananas strawberries whipped cream and don't forget the small scoop of ice cream--"}
{"text":"5 stars because I thought all the good cafes were only in downtown. Except for this one.  I am so glad I finally checked it out. I came here to meet a friend for coffee and had an extra hot mocha. It was delicious. Inexpensive for a big mug comparing to all the other cafes in downtown. It was quiet and had nice music playing. I also had Nutella Crêpes.  Okay for the price.  I would totally recommend this place if you want to meet up with a friend or simply relax and read a book. This is my new \"spot\" close to home! 
Very clean inside and the baristas were super friendly and nice!"}
{"text":"The only reason this place is getting a 1 star review is because it can't get lower than 1 on Yelp.  This place sucks.  Not only did they burn the shots on my latte, but it was labeled hot chocolate.  My 6 year old got her first taste of coffee.  Gross coffee.  Incompetent staff.  Normally we do well using Yelp while we are on the road, but this time Yelp failed us miserably.  Don't let the great Yelp reviews fool you into wasting your time and money on this Coffee Shop SCAM."}
{"text":"I tried it today for the first time ever, I had a whole wheat crepe, it was so tasty. The service was also really nice! I would 10/10 recommend!"}
{"text":"Me and my fiancé came to eat at Colado's recently and we are very satisfied with their food and service. I had a Nutella crepe and a chai latte. My fiancé had a tropical crepe (he changed the pineapples to strawberries , the workers were very attentive to our needs). We will definitely be back, Thanks!"}
{"text":"Tried it today for the first time.  Prices are good but I thought they could have filled them up a bit more. I didn't take pictures but wish I had. There was very little fruit on our Nutella crepes. The pumpkin crepe was very good as was the chorizo crepe. It was as very busy Thursday 11am. Lots of kids. They offer outside seating, nice!  But not sure I would come back again. Was good but not great"}
{"text":"Treat yourself to this family owned shop! Great atmosphere, very friendly staff. It's a little expensive but so worth it!! They accidentally gave me the wrong crepe, and I didn't say anything to them because it was so delicious anyway. As I was about half done they brought me the right one and apologized. Two huge crepes, and a huge coffee later I could barely walk out of the restaurant! You guys are the best!!! A must visit!"}
{"text":"The coffee, fried ice cream were all good. Crepe a little dry around the edges but made fresh on the spot. Plenty of toppings. The kids demolished them."}
{"text":"Preferred the savory crepe to the sweet one as it's more food for the same price. The staff was nice and friendly."}
{"text":"I suggest this place again and again. I came here quite often while I was in Graduate School. What I loved most about this little place was that it was family oriented and a sweet little mom and pop shop! If you want to support a local business this is the place to go for a tasty coffee as a pick me up or to grab a sweet and satisfying crepe! They have wifi, a nice little sitting area with couches and tables, and it is pretty quite if you need to focus like I did while I was there. I highly recommend the Whole Wheat Crepe as well as the Nutella Crepe! Enjoy!! Oh- and don't forget your stamp card so you can redeem a goodie when your card is full. :)"}
{"text":"Love this place, the cappuccino is my favorite also shared the chorizo crape, it was delicious! Busy place but worth waiting for a table to open up."}
{"text":"The music, the atmosphere, the coffee, the people, the crepes, and the coffee are all wonderful. Oh, did I mention the coffee? Love it."}
{"text":"I am not a big crape fan but I do like the whole wheat with added nutella and banana! The coffee is very good. This seems to be a family owned place where everyone is very nice and strives to make good consistent food and coffe. Excellent."}
{"text":"We waited over 30 minutes for two crepes and two drinks, and it didn't seem to be all that busy. The tea was sickly sweet and the crepe was overpriced. There was very little filling in the crepe, and the bananas that were on top were very stiff; not the most appetizing texture. The peppermint drink tasted like coffee, no peppermint. Will not visit again. Two stars for effort, and because the employee who greeted us was very nice."}
{"text":"Never a bad experience.  Always friendly, always quick.  The crepes are good, even the non sweet ones.  Sure is a busy place on weeknights, doesn't affect the service quality.

We go here all the time."}
{"text":"I love this place.  The best crepes I've ever had.  The wait is long since the place is small, but the crepes and drinks are super worth it. And they will make accommodations if you need them (vegetarian friendly ).  My personal fav is the chipotle crepe with their chai tea latte.  But the sweet crepes are also delicious!  The only thing that sucks about this place is that they are closed on Sunday's and that when I always find myself wanting to go."}
{"text":"So so yummy! Had a caramel helado with the morning and chipotle and peach crepe. (There were four of us so we shared!) :) each and every crepe was so delicious!! The workers were friendly and helpful. The atmosphere was cute and cozy. We brought our two crazy kids and we survived the meal. We will definitely be bringing our friends to check it out."}
{"text":"Delicious coffee and crepes with a relaxing and enjoyable atmosphere and great Italian music. Everything I could ask for in a true coffee shop."}
{"text":"I stopped in for a coffee. Pretty nice little place. Wanted to try a crepe but hadn't had dinner yet soo. We got 2 large chocolate chip blended coffees with an extra shot of espresso in each. Definitely get more for your money here. My only gripe would be that the chocolate chips fell flat. They tasted like eating chalk. Kinda flour-y. Other than that a good atmosphere to hang out and from what I seen the crepes looked awesome."}
{"text":"We've had crepes many times, and maybe it's because it was a holiday (valentine's) and it was super busy, but.. the Nutella crepe we ordered was way overcooked, you should not need a knife to cut a crepe... crepes are suppose to be very light, thin and fluffy. We actually had to use a knife to cut the crepe... not impressed at all. We eat crepes a lot at Butter's and Butterfield's restaurants in Scottsdale and their crepes are always fantastic, and taste much better than the crepe we ate tonight. If you want a delicious crepe, it's well worth the drive to go to Scottsdale, but that's just my opinion, obviously people like this place based on how busy it was.. I should add that we didn't have any of their drinks, so maybe it was more for their drinks than their crepes?!"}
{"text":"I went here a couple weeks ago and the food was delicious. The crepes were so fluffy and the fruit toppings were fresh.  Also, the staff is friendly which is always great!"}
{"text":"This is my new favorite place to have coffee. I have try their white chocolate blended ice coffee and it was delicious, as well as for their whole wheat crepe. They could be a little slow to get the orders done, but it's worth the wait."}
{"text":"Excelente service first of all. On a road trip to California and had to stop by to check out the goods. 
Chai latte is deft the BEST I ever had. The breakfast crape is wonderful specially if you like bacon. I couldn't resist and ordered a small Nutella crape as dessert and that was just what I needed. 
Crapes can deft be shared.l because they are big portion."}
{"text":"When they say coffee and crepes they mean - coffee and crepes. 
They have 2 specialities and they do it SO WELL!!
I've tried 4 of the crepes so far and they're all wonderful. It's our new favorite spot for breakfast!"}
{"text":"There was a hair inside of my food! 
They didn't even apologize. I asked for my meal to be refunded and they gave me a hard time, then ended up double charging me.

I've had 4 different coffees here and none have been good.  Hazelnut tastes powdery and most are watered down.

I am thoroughly disappointed and will not return."}
{"text":"Coffee was really good. Minimal selection of crepes that were just mediocre. It was a little frustrating that I had to wait 10 minutes for two espressos and a crepe, but I'll give this place another chance."}
{"text":"This place is a nice little treasure and I loved the details in appearance of food. It was delicious and looked beautiful"}
{"text":"Crepes are not the best, but they are quite good and at a reasonable price.

I tried two kinds when I visited: the nutella/strawberry/banana, and the peach/almond

I added condensed milk to the peach/almond. You can add extra \"add-ons\" for 50 cents."}
{"text":"The atmosphere is adorable. All of the staff was quick to greet & very kind. Lots of groups chatting. Will definitely be back."}
{"text":"Ordered 2 crepes (Nutella and whole wheat) and 2 iced americanos. Crepes were about 5 bucks and were delicious! Coffee was mediocre, nothing to swoon over. But I loved the ambience of this place. Oh! And also they have punch cards! You get a punch every visit and on your 8th or 9th visit you can get a free crepe or beverage. Definitely coming back!"}
{"text":"Finally a great place for coffee and breakfast/lunch on the west side!  

The Chipotle savory crepe was wonderfully balanced and robust.  They offered an upgrade option for eggs and bacon in it as well and we opted for it.  Each flavor and texture blended well and none overpowered others.  The pesto and red pepper garnishes on the side were great as well.  Spectacular and will get again.

The peach crepe left a bit to be desired.  I think it would have been great if only they used fresh peaches instead of canned.  Disappointing and we left most of it uneaten.  It looks like the strawberry Nutella crepe has fresh strawberries so we might try that next time.  So, two words to the owner, - fresh peaches!  :)

I got the signature Chelados \"pour over\" and it was as good as any I have had in a froo froo snobby purist coffee shop!  They even had honey available which is my sweetener of choice and it was even heated and diluted slightly for easier mixing.  VERY satisfied with their coffee!  I'm so happy to have another good coffee shop close (kinda) by."}
{"text":"Nice place to study and friendly staff. Lacks an extensive menu, but the coffee drip, the Colados, was delightful"}
{"text":"They consistently make pretty gosh darn good coffee. 

Whether it's been a mocha, americano, or the cold brew I had today, it's always been top notch, and without complaints. Their roasts are bold, and somehow, a bit spicy. I love that. 

If you're not stopping by for a quick cup, have some crepes for breakfast. Their savory crepes like chipotle are good, so I'm excited to try the desert variety. Next on my list of things to try: fried ice cream. Having a little independent coffee shop in a suburban sea of chains is such a treat!"}
{"text":"I can't rave about this place enough 
I came for the crepes and coffee and coming back for the service and delicious food and drinks"}
{"text":"AMAZING! ORGANIC-COFFEE! Need I say more?!!..CREPES BEST in Town! Service is Great. Ambiance relaxed-romantic-cafe feel."}
{"text":"Yes, have the red velvet crepe, it is the best sweet crepe on the menu. The strawberry nutella was fine, but most crepe shops offer this flavor. The red velvet is the star of the dessert menu. If you are tempted to order the deep fried ice cream, it is the size of a softball!"}
{"text":"I love this family-run business. The paintings and decoration were very Frenchy. Jazz music was playing in the background. It was very relaxing overall. We had white chocolate helado (?) (I forgot the spelling), latte, Chipotle crepe, basalmic chicken crepe and strawberry banana nutella crepe. I give the food 5-stars for presentation and 4.5 stars for tastes. The drinks were not too sweet and were very tasty. On average, price of crepes is about $6.50. I would come back."}
{"text":"They make a delicious mocha and caramel latte. I get the Morning Crepe and my fiance gets the Chipotle Crepe. The service is really friendly and they treat you like family."}
{"text":"There crepe is so far the best in Avondale area. They also can make vietnamese coffee if requested. The owner is super nice ... I have to go there whenever I am in town."}
{"text":"Best coffee in town, period.  Their food is fresh and delicious as well.  A great neighborhood cafe."}
{"text":"Crepes are very yummy. Iced mocha was good. The place was very clean and very nice respectful employees. I would recommend and come back"}
{"text":"This place is great I've gotten something different every time I go there and I'm never disappointed!! It's difficult to choose a favorite item!"}
{"text":"It was really good but they don't really have a lot to choose from which kinda was bummed out but it was delicious would go back"}
{"text":"It is so nice to find a good family run coffee shop in the West Valley! I stopped in her near closing to check it out and the family was exceptionally accommodating. The prices are good and the crepes were delightful.

My one suggestion to the owners would be to expand the crepe menu to include some breakfast crepes and some lunch crepes. The desert crepes were great, but I'd love to stop in for coffee and breakfast crepe on a Saturday morning.

But well done! This is a great addition to the neighborhood and so much nicer than nearby Starbucks. Also have wi-fi!"}
{"text":"The wife and I happened across this cute little \"Ma & Pa\"-esque café just this morning and boy are we glad to have found it. While we already had cold coffee drinks from a different business in our hands when we walked in, the crew didn't give us any trouble about ordering some crepes and dining in with our competitor drinks on the table. We tried the Tropical, Whole Wheat, and Morning crepes and liked them all! Their ice blended coffees seemed to be a hit with other customers. Hopefully we'll try those out one day too! (So until I try out more of their menu: 4 stars)"}
{"text":"This is my favorite cafe, although it might be a bit crowded at times the crepes are great if you like them sweet or savory, the coffee is great hot or cold and they have great tea. they even have fried ice cream which is awesome!"}
{"text":"This place is wonderful.  I was visiting my mom recently, and she took me here.  

I had the Morning Crepe...wonderfully prepared with just the right amount of everything.  The addition of cottage cheese on top gave it that pop, add in the delectable spicy sauce they give you and this thing is on point!

I finished off my breakfast with a tasty chain latte.

Yum, yum!"}
{"text":"Came here for a crepes, and was not disappointed! I had the Colada coffee and a peaches crepes. Great vibe, music, and nice staff. A recommend."}
{"text":"This place is fantastic. Their chipotle crepe (ham, cheese, fresh greens on top, chipotle sauce, a cottage cheese type sauce, and a large dab of each a pesto and hot sauce) is to die for!"}
{"text":"Stopped in on a chilly night for crepes. I decided on the Nutella with strawberries and banana. I waited only a few minutes before our server brought it over. Presentation was nice but honestly it was just ok. It barely had any nutella and the crepe was not even that warm. The service was friendly and the vibe is pretty cool but I'm not sure how this place has 5 stars if it's mainly for the crepes, or coffee or what. For me, it was just OK. I might stop in again in the future and try their coffees and perhaps give the crepes a second chance. I was also a bit disappointed they only had vanilla icecream. I had fallen in love with a photo of this chocolate icecream with an oreo cookie on top (which I saw on yelp posted just 2.5 months before) but they discontinued this. Bring it back Colados! It truly looked so yummy."}
{"text":"The fact that I had to give this place 2 stars is kind of tragic. I really wanted to like the place. The coffee is good, and the ability to get crepes seems to be a huge selling factor, but in the end the negatives outweighed the positives. 
 
Pros: The crepe itself was good. The coffee was great. Some of the ingredients were delicious and fresh. The place has a nice interior. 

Cons: The wait time for food is atrocious. I've been here 4 times and each time it seems like the wait is longer than the last. The strawberries were not fresh, and the tea and juice was just not good in any way. The price is also not great considering how small the portions are. I like to eat, and I like to spend money, but spending money on two or three bites of crepe is just highway robbery. However, the biggest negative was the overall service and attitude. I don't know if it's because we come in the early AM and they are just waking up, but I have constantly got the impression that they would rather not have us as customers. They have been cold, rude, or even worse, not said one word to us the whole time we are there. That kind of treatment is what led tot our decision to make this review, and not go back again. If you don't like customers, why get into the service industry?"}
{"text":"This place is very delicious! The Setting sets the mood of this 1900s old fancy restaurant. My favorite is the Crepes. The have a variety of choices followed by a Jug of free water to grab on the side of the order area. They bring you the food... When you are done they pick up the plates. You don't do anything! Scoop of ice cream is about $1.50 and is worth it with a Cold & Warm bite combination!"}
{"text":"My only complaint about this place is that it's always busy, good for them! 

Colado's has delicious coffee, fantastic food and friendly staff. Whether you want a sweet treat or a savory meal, they've got you covered. I usually have to go downtown for this kind of quality, so I'm very excited to have Colado's in my own neighborhood (and I find myself eating a lot more brunch these days!).

Do yourself a favor and try the chipotle crepe with eggs and bacon 

I wish the Colado's family much success with the wonderful business they've built."}
{"text":"Delicious crepes to start your day. Of course ice cream needs to be added to the plate. Variety of flavors on those crepes. Other treats too, and the place is packed till at least 10am, then full for lunch."}
{"text":"Great place to hang out. Delicious coffee and crepes. Their macchiato is great, better than Starbucks but I think every other coffee place is better than Starbucks lol. Crepes made fresh in front of you. They have breakfast crepes with egg etc and fruity sweet ones. I think they have a spicy one too if you like that. The atmosphere is chill. Nice decor, clean. Family owned local business. I like that. I prefer that. I highly recommend :)"}
{"text":"-But first, Coffee- 

It was recently my first time at Colados this Memorial Day, and it was a wonderful experience! I was meeting up with some friends, and they were running late so I thought \"oh what the hay, I'll grab a coffee as I wait\" and I've come to a conclusion that the Island Latte is to DIE for. Coconut and macadamia goodness swirled into one cup over ice. So good, I've been back twice for it and even introduced it to my gal pal Joyce W., She loves it too!  When my friends finally arrived, we ordered our crepes. My friend got the whole grain strawberry, her husband got the chipotle crepe and I got the morning crepe. They also very much enjoyed their americanos and green smoothies. We all enjoyed our crepes very much and left NO SCRAPS. I like that they have both savory and sweet crepes.

Later on that day my sister in law saw our posts on Facebook and she had us come back! We the ordered the strawberry banana nutella crepe, tostilocos and another green smoothie, also equally enjoyed and devoured. 

I really like the atmosphere here, it's so cozy and very nicely decorated, very Paris! I like that they have tables and chairs for dining but they also have love seats and little sofas around for those who need to study and a quite place to focus. 

Service is quick and friendly, I'm sure this is going to be another regular spot!"}
{"text":"Just left Colados with their \"Island Latte\"!! The staff is very friendly, the shop is fun, and the island latte is delicious. The west valley is lucky to have such a hidden gem!"}
{"text":"Incredible coffee and food, only 5 minutes from Westgate! We love the Colados coffee, and their crepes are a very tasty light meal. We've gone for breakfast, brunch and late dinner and they are always so friendly! Very clean, and the atmosphere is like a European bistro."}
{"text":"Great service, Great food,and great small comfy space!!!!!!! So many great crepe options and ... fried ice cream!!!!!!!!!"}
{"text":"I really don't know why this place has such good reviews. The service people had a bit of an attitude. I got my sugar free coffee with whole milk (I didn't ask for this and they didn't think to clarify that they make this with half whole milk. They then brought me back a 16 ounce cup literally half filled and when I asked where the rest of my coffee was they said you wanted no milk right? I said yeah no milk but where's the rest of my coffee? They said you wanted more ice? I said no (the cup was already filled a quarter with ice)  I want more coffee. They finally said okay and filled my coffee put it on the table and of course did not apologize. And oh the crepes? Both my mom and my crepe were ice cold not sure how they accomplished that one since they were made in front of us. The crepes we ordered... Both fruit crepes were completely overly sweet. And I'm a huge sugar fan. Please don't come here the service and the food was terrible. Don't waste your money. Go to McDonald's or something they have better service than this place."}
{"text":"They have some of the yummiest iced coffees and crepes. I've been here on two occasions. The first time I tried the healthier wheat and yogurt fruit crepe, it was fresh but the flavors were not my favorite. The second time, I tried the chipotle crepe and substituted the ham for chicken... so delicious!! I love that they allow you to customize most of the items on their menu."}
{"text":"The staff were super friendly, the food tasted very well, very clean for the area it's in. we ordered tostado preparados which was spicy. in addition the tropical crepe and Nutella crepe. the mango smoothie topped it all. very delicious. will come back again."}
{"text":"I love sweets! We're not on this side of town much, but we had to stop in and see our mechanic and this place was just down the street. 

We ordered the Whole wheat crepe, macchiato hot expresso and the caramel helado. The service was great, I believe it is a family owned business so everyone was really polite.

The whole wheat crepe was delicious and the coffee the also bold and strong! The prices were fair not too cheap or expensive. We would definitely come back here again when we are close by."}
{"text":"What a gem. We came for dessert for the first time and had the whole wheat crepes, fried ice cream, and a coffee (pour over). Everything was delicious and service was excellent! Worth a try! Can't wait to come back for breakfast :)"}
{"text":"Visited on a Saturday morning at 8am.  Great place,  met family and had perfect seating.  Had a morning crepe, yum, enough to share.   Also, had a hot chai latte, delicious,  perfect foam!  By 930 the place was packed,  line to the door.  Very popular place.  This will be our meeting spot now!"}
{"text":"This was my first time visiting this location and it was a very positive experience!! Customer service was excellent! I had the nutella crepe and it was very well presented and the taste was delectable! The shop is very clean and nicely decorated! Keep up the good work! I will definitely be back!"}
{"text":"Decent crepes and such a cute place for breakfast with friends, but I wish they had more options, or the option to customize your crepe order with a greater selection of toppings! I've tried a couple of their sweet crepes and a couple of their savory ones, and they're always good, but look a lot tastier than they actually are. One of my favorites that I've had was a seasonal crepe with an apple filling. It was delicious and I do enjoy when they switch it up a little bit with a seasonal flavor, so I wish they'd be more consistent with that! I'll continue to come back as there are no better options in the area for crepes like this, but I wish they would work on their flavors a little more!"}
{"text":"I've been going here for a while. I love the coffee, environment, crepes, etc. My only request would be is for the cooks to wear hair nets!!!!  One of the last times I went... found a hair on my crepe that's all. Other than that, I love this place!!!"}
{"text":"Delicious! Tried the Nutella, Tropical, and Morning Crepes! It was all very filling. Will definitely come here again."}
{"text":"Best place to get crapes and coffee on the west side it is not in the greatest shopping area but when you walk in it is transformed into a cute bistro with amazing food and the prices are great and awesome the children's menu is amazing and they cater to your needs it's a wonderful experience dining there and the coffee is thousand times better than any Starbucks"}
{"text":"Awesome crepes of all kind. I got the breakfast crepe and it was delicious. I also got a cold brew coffee which tasted better than Starbucks cold brew."}
{"text":"Atmosphere is pleasant, decent amount of plugs for working/studying! Ordered the 24oz Iced Caramel Machiatto (if that's how you spell it) and the Nutella Crepe with whole wheat batter! Both were great, and I would recommend again! Service was a little slow, but the taste of my drink and food made up for it!"}
{"text":"Extremely friendly staff and very good crepes! However, the menu is pretty small, I would like to see a bigger variety, but other than that I love it here"}
{"text":"I don't go out for breakfast very often, if at all. This place is going to change that. I found Colado Brother's  coffee & crepes here on Yelp one morning and I'm so glad I didn't just go to the Dunkin donuts 2 miles away. I entered the Crepery at around 11AM, expecting it to be busy for brunchers. It turns out, it was busy, but I didn't have to wait in any line. I was greeted warmly by the cooks and a server took my order promptly. There was soft Christmas music playing in the background and a soft hush of people talking around me enjoying their food. It was a 5 minute wait for my to go order - A small black sweetened tea, and a Nutella crepe with a side of ice cream.

I drive like a hellion, and yet my order looked perfect as I sat down at home to eat it. And let me tell you. THESE CREPES ARE INCREDIBLE! They tasted like heaven in my mouth. Fresh strawberries and bananas cut into bite sized bits, over a crepe generously bundled with Nutella inside. It was out of this world. The flavored exploding in my mouth were SO amazing. The tea was brewed very fresh, but was ice cold, and the black tea had a very earthy, perfectly sweetened taste. I wanted to go back and get 4 refills. Lastly, something about their ice cream was just perfect. It was still incredibly smooth and chilled when I arrived home 10 minutes after purchasing it. Over all this place gets an 11/10!"}
{"text":"Been searching for delicious crepes here in AZ and finally we found this! Their crepes are absolute ahhhmazing! Every bite was heaven. Definitely need to try if you havent!!"}
{"text":"The moment I walked in this place and saw their menu, I was hooked! I love crepes and all they have to offer! The coffee was average, It was a bit too sweet compared to other coffee shops. But the crepes, are to die for! I love how the portions are sized right and the art they put in it makes it the best! I also am a big fan of the dining and seating arrangements. 4 out of 5 stars for sure, can't wait to come back and make it 5 stars!"}
{"text":"First time in here, got the Nutella crepe that has strawberries bananas whip cream and of course Nutella($5.45), with a side of ice cream(.75). I felt like the crepe was lacking flavor, and a little on the small side. My kids and I are usually able to share one crepe and leave satisfied at other places,That wasn't the case here. I'll give it another try with my husband next time and see what he thinks."}
{"text":"The crepes here are very good. The customer service is great and the price is fair. I love coming here with friends and family. A great place to just hang out and chat."}
{"text":"good service, attentive 
always with  a welcome smile
crepes are good 
Café COLADO is delicious
place is clean 
I really love to come for coffee here with my husband"}
{"text":"This place was super cute! Loved the crepes especially the savory ones. The chorizo and breakfast ones were so delicious! Loved that they had Mexican hot chocolate but they wouldn't mix the Mexican hot chocolate with coffee to make a Mexican mocha. Kind of strange. Definitely should add it to their menu. The space is cute with the dividers in between. Didn't care so much for the Parisian decor. I understand it creeps but i feel coladas has its own specific untapped identity that can translate to a more personable decor. Overall loved it. Can't wait to go back for some savory crepes! And of course a sweet one too! Can never go wrong with Nutella"}
{"text":"My favorite spot at this moment! The savory crepes are go die for and so different from the normal cuisine."}
{"text":"Woohooo! Blows the competition away! I highly recommend this place! The crepes are awesome and so is the coffee!"}
{"text":"This place is amazing! The codes are amazing Everytime I go in!! The crepes are good. My kids love the vanilla and cotton candy helados. Cheaper and so much better than Starbucks. I love that this is a family owned coffee shop that puts family first ( stays closed on Sundays)"}
{"text":"A bit crowded at timrs.  Great service.  Food is a bit pricey but the crepes and coffee are well worth it."}
{"text":"I stopped by here on a whim to grab a quick snack. I am so glad that I did play customer service great food I will be back."}
{"text":"Coffee Fact:  Coffee was originally chewed.

After four years and numerous check-ins later, I should probably give an updated review. 

I'm still not a fan of their teas (although if you get it with half lemonade, it is more tolerable).  They have expanded their menu these days to include matchas and some seasonal favorites (February: Red Velvet Lattes and Red Velvet Crepes!). I also enjoy the Green Smoothie as it's both healthy and refreshing.  The crepes, both sweet and savory, are delicious and I hope they further expand on more dishes with their fresh-made crepes.  The peach crepe is my favorite though since it has dulce de leche in it. Mmm!  One thing I don't like is their plasticware.  I don't mind using plastic forks and knives but the kind they use is like extra cheap with sharp pieces at the ends that jabs you in the middle of the hand.  Ouch! 

Free WiFi, lots of seating (although it's really busy here so you still might not be able to find a seat), and they have a real charming atmosphere with a friendly staff.  I'll be honest and say I wouldn't make any detours to come here but since I work in the area, it's always a nice treat to stop in for a drink or some crepes. Comes to Colados, y'all!  Any place that serves me bean juice in a mug as big as my face is A-OK with me!"}
{"text":"This place is awesome. I had a Carmel latte and it was the best I have ever had. A super thick and creamy foam. We also had the crepes and they were also very good. 

The only bad thing is they are not open Sundays. We live in Chandler and did a staycation at the Wigwam and wanted to go back there before we leaving this part of town. Then again can you blame anyone for wanting a little balance? Keep up the great work!! JT"}
{"text":"This place is sweet & cozy. We ordered the chorizo and Nutella crepes -- the perfect mix between sweet and savory. My caramel cappuccino was delicious as well. Would recommend anyone looking for a fun, light breakfast!"}
{"text":"Tasty crepes and strong coffee. Super nice and genuine staff as well. Go for the relaxed vibe if for no other reason"}
{"text":"the good was really good, but the portions were a bit on the small side. I suppose it's not that big of a deal. the variety on the menu was definitely lacking. what they did offer was very tasty, though, to be fair. the location seems weird, but stepping inside is like being transported. very cute interior, gives a cozy intimate vibe. there isn't anything like this in the West valley, so it's nice to see a place like this around here."}
{"text":"3rd time here. Never fails. The menu is on point the Hispanic twist on some crepes is fantastic. Chorizo crepe and Red velvet crepe today. Turns out you can put chorizo in a crepe. Who knew? And I make crepes but never thought of this. Great concept. Very savory and also some sweet options."}
{"text":"one of few places here in arizona to find crepes. the cafe has a chill ambiance for people to just chill. i like their chipotle crepe (ham,cheese,and spinach). the crepes have very good presentation...the only thing is that the portion are small for a $5-6 price tag. the  staff are friendly but the service is a bit disorganized and slow; they have missed my sister's order twice."}
{"text":"Stopped in for coffee this morning and ended up staying to try the crepes.   Good food with a nice atmosphere and very pleasant staff."}
{"text":"Am not a huge fan of crepes, but there's were very very good. 

This is a neat little place to hang out ...limited menu of foods, but I liked the vast selection of tea and coffee beverages.  Comfy chairs, no loud music and lots of natural light.  

Too bad they're soooooo far away from my home, I would become a regular!"}
{"text":"Super family friendly coffee shop with happy employees. I'm always greeted with a warm welcome when I walk though their door. My cappuccino was perfect, and my crepe was delicious. This place is filled with kindness and happiness. A must visit, and don't forget to bring the little ones."}
{"text":"Wife and I really loved our first visit. 
We had the chipotle crepe. The chicken crepe and for desert we had the Nutella crepe with their fried ice cream on top. It was all great but I will drive 30 minutes to have that fried ice cream again!"}
{"text":"Great crepes! Both savory and sweet are some of the best I've had. Not skimpy but not overly filling. A great breakfast or brunch spot with girlfriends. Cute atmosphere. Definitively one of the best brunch spots in the Avondale/Goodyear areas."}
{"text":"If you you like France you should go to this place they have very good crepes here.  They not only have your topical sweet topics they also have breakfast style crepes .  The service is good very normal but I'm fine with out the fake friendly service.  I like the real but not mean service lol.  The location is good as you can get more food around if you not completely full ( but you will).  Oh let's not forget they also sell coffee and smoothies.  The restaurant atmosphere is very French though remember you in Phoenix lol.  Overall, I like his place I'll go again."}
