{"text":"Very good kadhai chicken and alo tikki. The butter chicken was not good though. Friendly service. Definitely a go to place"}
{"text":"I was there last weekend. I ordered Bollywood veg Thali which was very fancy. They have authentic Indian food on street of Toronto. Interior looks cool. 
They have variety of items in a traditional way. I will be back.. Thank you Colaba junction you made my weekend."}
{"text":"Had their Bombay Railway lamb curry and Kadai Chicken on a weekday afternoon. Service was fast but the food sucked. I know exactly how both dishes should taste like and it's sad when they pass that off as Indian food because that's not how it traditionally states. Chef, you got to learn and train harder! 
Overpriced but I know you have to pay rent at a downtown location so at least up the game on your food quality and taste please! Not going back again."}
{"text":"I was born in Mumbai so I was thrilled to see Colaba Junction open and was excited that Toronto may finally have a restaurant that serves authentic Mumbai street food. Unfortunately, it was a disappointment. 

The menu is all over the place. It does not have some basic essentials (like Sev Puri, Dahi Batata Puri, or Misal Pav) and instead includes chicken satay tikka (Malaysian/Mughlai?), Wasabi raita (Japanese?), Paneer lasagna with goji berry (no idea!). If these items were well executed that would be something to celebrate, but they fall flat. 

I tried the Colaba Chaat, which was too much farsaan (chickpea, wheat crisps) and too little rice puffs. It would not pass the muster on any Mumbai street cart. The Fish Koliwada was delicately cooked, but the spice mix on the batter was schizophrenic (neither Konkani, not North Indian, just a haphazard mix of two flavours with an overpowering of coriander seed).

Finally, an Indian restaurant is judged on its chai. The tea was served in a glass reminiscent of what you'd find in an Irani Cafe in Colaba, but it was flavoured with mint instead of the traditional ginger. Again, if they had pulled it off (like a Moroccans or Egyptians mint tea), I'd celebrate, but like everything else, the tea was a failed attempt at overreaching, neither here nor there. 

As a Mumbaikar, I'm embarrassed. Torontonians take note, this is NOT what Mumbai street food tastes like."}
{"text":"A friend was raving about this recently opened up place and my friend me dragged me up here.

We were at Colaba junction on Friday eve and it wasnt too busy. I was expecting a kick-ass vada pav but was disappointed as the vada was double fried and stale.

Pani puri came with a great presentation and three different types of water but they all tasted pretty bad. 

Chaat was the only high-light. 

They are new and should improve on their some key dishes pretty soon before they lose customers"}
{"text":"Awful. I was craving some desi food and thought this would be ideal. 

Firstly, when we walked in, nobody really explained what was going on. They just stared at us. So we got our own table and found the menu on the counters. 

Ordered the samosa chaat, chicken kathi roll and pav bhaji. None of the dishes we ordered tasted remotely authentic. Everything had a strong taste of SOME spice. I'm not sure what. But it felt like they had over seasoned everything and it just tasted bitter. If I cooked food I'd be able to point out what spice they used but as an eater...of food for the last 20 something years, I can honestly say this is not Bombay street food. This is a scam to make people overpay for food that does NOT taste good."}
{"text":"4 stars for food. 2.5 stars for the story that will follow:
Went there for lunch with colleagues. Ordered kale and spinach curry and asked if I could add chicken to the dish (I even made hand gestures to mix the chicken directly in the spinach kale curry). They charged extra 4 plus tax for it. So we sat down (pay at the counter and they bring your food to the table) and food came.
The $4 chicken they supposedly added was literally 3 thumb sized chicken that came in a tiny sauce bowl in different sauce.
So.....I mean, the food tasted pretty good but that's not what I asked for or expected..
Overall I would go back to try different dishes but wouldn't try to ask for different options."}
{"text":"Being a mumbaikar for me it was Great place and delicious food. I ordered Shrimp curry which had well balanced flavour of coconut and spices, loved it. Also order masala chai, really good and had really nice and strong flavour of ginger and cardamom. Will definitely come back and recommend to try something delicious and great Mumbai food."}
{"text":"Have Bombay bachelor, food is at good quality, but it's too spicy for me. Overall a little bit expensive, but ok if occasionally."}
{"text":"Small little \"fast food\" Indian. Quick courteous service. Very much a fast food place. The fried cauliflower is amazing!!!!  Would have given 4 stars if there wasn't plastic forks. Very satisfied."}
{"text":"This place is a hidden gem. 

The two of us ordered pani puri and veggie thali. I'm not an expert of Indian food, but I've had my fair share of Indian food in little India and Brampton. Personally I think this place has the best thali in downtown. 

This place was recommended by an Indian foodie friend, which also proofs something. 

People working here were so friendly and attentive. They didn't talk too much but were observant. As soon as they saw us sharing the thali, they brought individual paper plates for us. 

Will definitely come back here."}
{"text":"The food is really good quality. We tried the Bhel which was pretty decent. The White Butter Chicken is more a cashewy qorma than butter chicken - very light tasting and needed a bit more kick. But for someone who doesn't take too much heat, this was a very flavourful dish. The Chicken Baida Roti, OTH, had some serious spice kick. It was a generous portion and would require a a healthy appetite to finish. The Chicken Tikka skewers are run of the mill but the Malabar Parantha it came with was very good. My four year old preferred the bread more than the Chicken for sure. We didn't try any of their drinks or desserts but will hit the place again. Prices definitely way more reasonable than Bombay Street Food who are just up the street from them. 

Now for the service - pretty lacklustre I would say. They brought three of our four dishes fairly quickly but the important one that my pregnant, and very hungry, wife ordered was forgotten - they blamed it on being busy. There were not many people there - it was a cold, drafty evening so not many tables were full - they had IMO forgotten about the item altogether but wouldn't admit to it :) No one died this time but, guys, be careful with pregnant ladies :p"}
{"text":"This was a planned visit with a reservation made in advance.
First of the menu pics that were posted online are misleading as the menu has changed a lot (lack of a website didn't help either) 
We ordered a few items a few I got to try so will comment on those only
Jhakas Ghost: Comes with rice but I substituted it for nan. Very good IMO with spice not held back. Nice tender meat and fortunately there wasn't any smell of the lamb meat so that's another plus
Chicken Tikka meat ball: Disaster IMO a cross between Italian meatballs and butter chicken anyone. I tried it a bit and couldn't even finish that. Most of it was left untouched.
Chicken Tikka Skewers: Cold and dry. The paratha that accompanied it was very good and I would even go as far as ordering it on its own.
Veg Thali: Didn't try but was liked by the person ordering it
Colaba chat: Didn't try but was well like by the person ordering it
Mango Lassi: apparently run of the mill stuff again
Godiva Samosa: A puzzling dessert as it said rabdi (which I didn't find at all) Funny thing is I have had a similar dessert elsewhere (maybe an empanada with a truffle inside) anyway not a good option and I would skip.
Service was great so half star bump. No LLBO yet either. I think I will come back to try other items as there is a dearth of half decent food in this area.
3.5 Stars all said and done"}
{"text":"A three star experience that has potential to go up if a few things get tightened up over there.

First, the menu is not easy to understand if you aren't familiar with Some of the culinary terms. A more general-laymen-friendly menu would do them good, or they should be more friendly themselves, because we were clearly confused and asked for information and received not very much help. 

I got the Kati roll w paneer. It was hot and tasty but a bit boring. Can Indian food even be boring? Something was missing (and not just because I asked for no cilantro...) my boyfriend got the $18 (yes. Actually) meat plate but a lot of it was cold or lukewarm which is so disappointing. Naan was great. I liked the subtle flavours to the rice. So they do carbs great and the rest needs work.

Super close to my home so I will be back most likely but a pretty bland introduction."}
{"text":"Had the aloo tikki and it was pretty good. Not huge for the price, but not bad. It took longer than you'd expect for \"street food\", but was fairly flavourful. The atmosphere is fairly basic and it's not a very lively place. I think this place would benefit from trying to be less of a typical Toronto casual food place and more like the Indian street food place the menu suggests."}
{"text":"Delicious lunch treat.  The food comes out quickly, which is perfect.  I had the thali and it was a lot of food, which included dessert.  Definitely recommend this dish if you are hungry or maybe to share.  The price point is good considering the area.  Definitely will come back here again"}
{"text":"A run of the mill Indian style restaurant, with nothing much to offer. Things I ordered were:
Bhel - it was soggy and didn't live up to the actual street style taste.
Chicken skewers - felt like they had been heated up in the microwave, as I saw lumps of over cooked meat around the edges.
Kathi roll - the inner filling was more of a tomatoe based gravy, which is not how a kathi roll is supposed to be. 
Vada Pav - over priced for what they were serving. Ideally Mumbai vada pau comes with chillies or the spicy powder. This was nothing like it."}
{"text":"Fun decor, friendly attentive staff and the lamb curry changed my day from blah to bam!  7 of us local office workers reserved a table and we all got to sample a few items on thier exciting menu.  Coconut fries are devine with thier side tamirand dipping sauce.  The white butter chicken, not too spicy so it is a safe order for those who think pepper is hot!  Lol  we loved the house pickles mmm a blast of salty lemon heat...love it.  

Update: the energy is high and all the various dishes our group  of 6 ordered today was gorgeous and delicious.  They graduated to 5 stars."}
{"text":"Walked in and immediately smelled the aroma spices... they're quite strong but you get used to it sitting in there. Please open a window maybe ? 

They have a remixes of English and Indian music which was great and reflects their take on the dishes. 

The washrooms were clean but not well-lit. The garbage was overflowing however. 

I ordered the Veggie Thali. Beautiful presentation although I asked for spicy and they put a bunch of green chillies on each of the veggie dishes. This comes with rice and 4 pieces of naan bread. The rice seemed to ruin the experience. I would have been happy had they just given me naan alone - and more than 4 prices which was NOT enough. I asked for more and they brought me HOT FRESH naan bread - so delish!! 

Your hands get pretty dirty so it would be great if they had those hand wipe alcohol swab things. 

So they don't tell you how to eat this but in case you aren't sure: start from the left and work your way to the right:
1. Chana (chickpeas)
2. Daal (lentils curry) which is to be used with the second last one being Achar (south Asian marinated pickles)
3. Paneer curry (cheese in curry) 
4. Saag Paneer (Spinach and cheese curry)
5. Next is the Raita which is used for your rice 
6. Then the achar as previously mentioned
7. The last dish is your Gulab Jamun - your dessert.

All in all, a great experience. I went around 2 or 3 on a Wednesday so it wasn't busy at all and I got decent service!"}
{"text":"Popped in on a quiet evening. We were the only customers in the whole place for the time we were there, which was just before closing on a Tuesday night.

We ordered Pani Puri, White Butter Chicken and the Meat Thali. Although we were the only people in the restaurant, the staff forgot to bring out parts of our order (such as the tea my partner ordered). Still they were friendly. I found their twist on the pani puris to be a little odd. The appetizer comes with three shots of different types of juice (\"pani') that you pour into the puris. The serve yourself wasn't odd as much as the flavouring of the juice.

The mains are significant in portion. I've never had white butter chicken before, but I found it to be underwhelming in taste. A super filling, but mediocre dish. My partner had the Meat Thali. He seemed to enjoy most of the dishes on his thali. Overall, this place felt more gimmicky than authentic. The decor was fun, the service was friendly if not spot on, but the food was just okay in my books."}
{"text":"Thought I would try this given its proximity to Bombay Street Food and I wanted to compare places. Bombay street Food wins hands down. 
Visited at 1pm and the place was very messy with dirty plates piled up at the counter and no one greeted me (having just opened a few weeks ago, client service sucked!). I dug up a menu from the counter and ordered the Kathi Roll. I didn't even get asked if it was chicken or paneer server just assumed chicken. I asked for water and my total bill was $14.70!!! I was handed the credit machine and said I was paying cash! 
The food came quickly and hot, the portion was TINY given the price, but I did get a handful of potatoe chips that were obviously from a bag. The roll fell apart but the taste left me the most disappointed, it was overly salty. 
The highlight of my meal, I scored a complimentary gulab jaman. 
I will not return!! Another Indian pop-up where the staff lack client service skills and are banking on the food concept to succeed. There are many other options for Indian food, give them a try instead."}
{"text":"Read the good reviews and decided I should give it a try.
It's a lot of food for lunch. Got their vegetarian thali.
Rice was good (yes rice can be bad too)
Naan was ok,acceptable. I don't think it's homemade. I don't think they have a tandoor oven there. 
Food had a light kick but the Chili pickle was there if you wanted more zing.
The rest was decent. My favourite was the paneer dish, I liked the sauce for my naan.
It's light in that they don't add much cream, if any to their dishes.
Is it my fave? Nope. But it cured the Indian craving ?
Yup..."}
{"text":"The samosa chaat is absolutely delicious and amazing value considering the price. Staff is friendly and the interior is super cute!"}
{"text":"Tried Paneer Kathi roll, aloo tikki. 4 stars for food, amazing taste, -1 star for tables were not clean.

I must suggest to come here and try India fast food."}
{"text":"Food and the menu are good. I like the style and the range of authentic Indian food that is offered. But I would definitely think twice before going next time as it is very overly priced for the quantity and ambience. I would have accepted the prices if it was a fine dining restaurant but not for a quick food spot."}
{"text":"Ordered a Vada Pav and it took about 45 mins before the dish arrived. However, the food was flavorful. The ambience of the restaurant is quite pleasant, with a diner feel."}
{"text":"Incredibly disappointing. Indian street food is made to be quick, delicious and fresh. It seems that the chefs keep coming in and out and don't seem to care that paying customers are waiting. 

Husband ordered the pani puri and each one literally has 2-3 small chickpeas in each puri. The presentation is nice but still is so lazy. No napkins provided. It's supposed to be a messy treat! 

Mango lassi is ok. 3/5. 

All in all, do yourself a favour and go across the street to Bombay street food - way better service, larger portions, and tastier food."}
{"text":"This place is amazing! Food is just spot-on. The Jackfruit Kofta was a revelation and the vegetarian thali was sumptuous. I'm going to be frequenting this establishment now!"}
{"text":"Do not try the Spicy Bhel, it is super disappointing and full of onions."}
{"text":"Came here on a Wednesday with a coworker.  Not far from the hotel I was staying at and what a great find.  As you walk in there is a counter to order at and the menu board behind.  Tables are off to the right.  A few bench seating areas as well as high-top tables.

We decided we'd order and share (family style).  I ordered the daily special (Lamb Curry with rice) and some Naan.  My Coworker ordered a couple of small plates.  Vada Pau, spicy Phel, and one other that I can't remember.  

We took a seat and shortly there after the dishes started coming out.  One by one.  There didn't appear to be any reason for the order of the dishes.  Needless to say everything was very good.  I was told that the dishes are very much Mumbai street food style.  Not that I would necessarily know what that is, but it was all very good.  We had ordered too much food and ended up not finishing everything. 

Overall I was pleasantly surprised by the food served and it felt like it wasn't westernized.  I was also surprised by the other reviews and find it odd that I had such a good experience while others seemingly didn't.  I liked it and I'll go back."}
{"text":"When we walked in, both cook and cashier was sitting on the dinning area on their phones. It took a couple of second for them to realize we were customers. .Me and my friend ordered the thali. One meat and one vegetables. My meat thali had 3 pieces of meat, most of the vegetable dishes consisted of just sauce considering the meat thali is $20. I would not go back and my friend too. When we left, both employees were sitting beside our table focused on their phones. We recommend bombay street c.o for good indian in the same area."}
{"text":"I like their street food very much when you compare to any other Indian place.. especially their Bhel Puri as well as Samosa Chaat 

Not to forget - the Interiors are amazing!"}
{"text":"This place is a bit of a hit and miss.  The three times I've gone here, I've ordered through the Ritual app for lunch.  The first time, I got a chana masala, which was great.  It was hearty, delicious, and filled me up. The second time, I got a saag paneer, which was okay.  The paneer could have been bigger cubes but overall, it was okay.  The most recent time, I got a kale and spinach curry, which under their menu description says that it contains \"white corn and paneer\".  It sounded great so I chose that over the daily special today of saag paneer.  

To my dismay, when I picked up my order and opened it, it contained ZERO paneer and ZERO corn.  I looked through the menu again and I have no idea what they actually gave me.  It was literally just kale and spinach with some tomatoes in there.  The curry was also quite watery today.  

I've seen some pretty good reviews here about their thali and their butter chicken so I'm willing to give this place one more try and maybe modify my review but so far, I'm quite disappointed especially with today's meal."}
{"text":"Really great Indian place at Bay and College! Stopped by for dinner and came out super full. Had the spicy bhel (my favourite part, so flavorful!), lamb curry, and butter chicken. Everything was very delicious and fairly priced. The chicken was a little over cooked, but the lamb made up for it. The mango lassi and kulfi were really good as well! The restaurant is nice and modern and clean and bright. Overall great place and would come back again!"}
{"text":"Bread is not a naan; veg option on the thali was stale. Bad experience, bad service, go someplace else."}
{"text":"Excellent food! Have now been here twice, and both times the food has been great. Take out takes a little time, but the food is worth it. The portion sizes are very generous, with the appetizers being big enough for a full meal. Last time the veggie thali was enough food for 3 meals. Overall would definitely recommend checking this place out.  The staff are friendly, the food is great, and the prices are very reasonable."}
{"text":"Finally a tasty Indian food take out! I've tried the white butter chicken and it just has the right amount of heat and the portions are great!"}
{"text":"There are many mediocre Indian restaurants in downtown Toronto. This is not one of them.

Highly recommended by this Indian girl and her Indian parents."}
{"text":"Was here over the weekend, the vada pav were really good. I feel that this place is probably more of weeday lunch spot. The veg thali comes in a creative presentation. The chickpeas were hard not fully cooked. The nimbu pani was premade and kept in a freezer not a big fan of that either. I feel they could do a better job representing kolaba!"}
{"text":"This place opened strong with a very authentic Indian/Bombay-style menu and great service.  Popped in today to find the menu has changed. The new options are generic and boring - what you could find at any food court. Service has dropped several notches as well. Disappointed."}
{"text":"The variety and quality on offer here way exceeds that of Bombay Street Foods next door. We had the butter chicken hurry curry and the fried lamb chotta - I'm definitely wowed. The butter chicken is very mild, but aromatic. The lamb was tender and a little spicy and came on what I assume is the Malabar paratha, which was unbelievably delicious. I thought it tasted super coconutty... turns out it's from Kerala, so it's probably fried in coconut oil! I'm coming back, probably regularly."}
{"text":"Good Authentic Mumbai food. As good as you can get in Toronto. Got kathi roll and bhel - at par with my expectations."}
