{"text":"My party ate brunch at the Smallman Galley and two of us had dishes from Colonia that were outstanding -- the breakfast sandwich (Brazilian cheese bread, egg, turkey, aioli) and the breakfast hash (yam, yucca, pork, various veggies).   Both portions were huge for the price, perfectly cooked and seasoned, and very enjoyable. A lot of flavor and while both were definitely \"hearty\" options appropriate for the cold weather, neither were overly greasy or too heavy. Paired perfectly with a cup of coffee from the Commonplace Coffee bar and the amazing smores from Brunoise. Will definitely be back to try their dinner options."}
{"text":"Most tender pork I've had in awhile and both dishes seemed to stay very true to its roots. The Cochinita Pibil is marinated pork shoulder slowly cooked in banana leaves with rice, pickled red onions, and charred orange chicharrón. My only critiques are...more rice to accompany the meat, to scatter the cilantro all over the plate as opposed to having it chill on the side, and more sauce. Otherwise, I think Chef Jesse Barlass will be very successful if he ends up opening an independent Colonia!!! Looks like they changed the price and style of the pupusa since I've been!"}
{"text":"I was excited to see this place open up.  Having lived in San Francisco before, I was a big fan of pupusas and felt dismayed that they are not easy to find in Pittsburgh.  I visited Colonia specifically to try the pupusas.  While I was excited to finally find somewhere that served them, they didn't quite measure up to my expectations.  The outside tortilla was thicker than I preferred, and though the fillings were tasty, the pork pupusa suffered from a lack of cheese that the potato pupusa contained.  The prices were also higher, with a single pupusa going for $4 or $5.  When I go back to Smallman Galley I will more likely try a different restaurant than coming back to Colonia.  But if a day comes that I feel the need to specifically get pupusas, at least I know this is here for now."}
{"text":"One of the four restaurants at Smallman Galley.   Facebook page: @coloniapgh Some nice selection of Latin American influenced dishes.   The Cochinita Pibil was good.  Nicely marinated pork shoulder in banana leaves with rice, pickled red onions and charred orange chicharron.  While the meal was good it did seem a little on higher priced for the serving size."}
