{"text":"Have had lunch here several times. Always fresh and delicious. Generious portions! Usualky go for the spicy chicken or beef bowl. Spring rolls on the side. Will try the suggestions from the other reviewers next time."}
{"text":"Pretty good. Best pho in the Aurora/Newmarket area. I have tried all of them in the area and this one definitely is the best."}
{"text":"My hunt for shrimp on sugar cane north of Aurora continues...

This place feels authentic and probably is - lots of Asian customers, tables all taken quite late in the lunch hour.

I am always hunting good bun and shrimp on sugar cane and this place was not too bad.  If it was in Toronto, I would never go back because it's not that good either - but it's the best Vietnamese food I've been able to find in Newmarket so far.

I had the grilled pork, spring roll and shrimp on sugar cane on bun. The grilled pork was lovely and smokey (although I eventually began to wonder if it actually had liquid smoke on it) and plentiful.  The spring roll was undercooked and I like more noodles and less starchy veg, but okay.  The shrimp on sugar cane seemed freshly made, but reliant on Pollock rather than shrimp which was a bit odd -- not sure it didn't have MSG in it.  I also like peanuts and basil or coriander as garnish and there wasn't any of that.

The avocado shake was glorious - creamy and not too sweet.

Service was bare bones and fast. No complaints there at all."}
{"text":"I really love the pho from this place. So far the best we have found in this area. Super fast service as well. We usually get the beef pho and it's delicious!  Totally worth trying!!"}
{"text":"Excellent Pho beef noodles at Com Pho Asia.  The soup base is quite flavorful but not overwhelming.  Been there many many times and have never been dying of thirst afterwards, which obviously indicates little or no MSG used.  Vermicelli also excellent.  Lots of meat and tasty sausage.  As good as the Pho noodles and vermicelli are, their shakes are amazing. Their avocado shakes are creamy and very tasty. 

Best Pho in town!!"}
{"text":"It's not the best Pho in Toronto, but it might be the best in Newmarket.  Never had a bad bowl of Pho with them but I agree with other reviewers that the attitudes can be a mixed bag.  Sometimes we call for pick-up and a younger person will answer and pleasantly take the order - other times the person is in such a rush to get us off the phone that we're worried they will hang-up on us.  Its never been so rude that we considered not ordering, but it skims the line - it feels like taking an order for food is a burden sometimes.  Good Pho though so judge your selections by your own tolerance for brevity."}
{"text":"I am always in search of new Pho restaurants and have tried many,  I thought I found my favorite Pho in Scarborough but I was mistaken.  I am new to the Newmarket area and recently discovered Com Pho Asia.  By far the very best Pho I have ever eaten.  Their food is fresh, delicious, reasonably priced and they have great owners/staff.  

I also want to add that their #3 (rice paper roll w/shrimp) is DELICIOUS and the sauce they offer is amazing.  I was surprised because they dont offer the peanut sauce.  At first I was thinking \"that is a strike\" but I was pleasantly surprised how delicious it was, Mmmm....

Their #33 Chicken w/rice noodle soup is so tasty!  The chicken is WHITE meat which is rare to find.  

Thank you Com Pho Asia for offering the very best in vietnamese food."}
{"text":"This is my go to place for Pho in Newmarket. I've been to other ones and they are not authentic at all. This one is owned and operated by Vietnamese people so they are quite authentic.

The reason I give it a 4 star is because of the service. Been here probably over 20 times and every single time the lady that's always there isn't that pleasant. But I still come here because I do like the Pho here and don't care too much for service when all I want is a bowl of Pho"}
{"text":"This is the place to get Vietnamese food in town. The service is extremely quick, as you'll barely be waiting at all for your food even if the place is fairly busy. 

Their specialty is pho and rice noodle soups and you can tell as you are given free beansprouts, mint, lime, and sauces to add to your own tastes. Their vermicelli and rice plates are also very good too with a lot of food for the cheap price."}
{"text":"This place is awesome! The Beef Noodle Soup is soo tasty and delicious. My ultimate favorite lunch place during the work week. I wished I lived closer so I can come here on the weekend too! Just the smell of soup makes you drool and the taste is mouth watering.  The fragrant of the soup in combination with the basil leaves, beef slice......just soo good. For me, by far the best Vietnamese noodle place. Plus, it doesn't seem to have MSG, since it doesn't make you thirsty afterwards. Not sure if that is the true test of MSG.  Just writing the review makes me hungry, and I just ate dinner too."}
{"text":"This update is long overdue. I came here over the summer, so I'm posting this quite late.

This is an update on my last visit and it was terrible. I went in a small group, no more than 6 people. Service was really bad, not very polite. The lady served us our food with a very unpleasant grin. At the time I was hungry and didn't want to let that bother me. The quality of the food remained consistent, just not the attitude. We finished our food and just decided to stay for a little to catch up. The lady had the balls to hand us our bill a few minutes after we finished eating.. At this point, I was furious (in my head). I didn't want to make a scene bc my friends were with me. I'm sure they felt the vibe I put out.. Luckily for the server, I didn't pay. If I did, I wouldn't have tipped. But thanks to this experience, I now visit other Vietnamese restaurants around town. I'm happy to say that there are other places that have Vietnamese food just as good or better, WITHOUT the attitude. 

Haven't been back since summer (nov29/16)"}
{"text":"Another pho place in Newmarket, ON. 

Get right on it. Pho  number 26. When I asked for tripe or tendon, I actually want these things. What I don't like is a measly, unrecognizable, thing called tendon and tripe. It is not authentic unless you give what you advertise. I liked their customer service and I will not take more stars away from the rating. Pho Fusion is a deserving 5-star, and Com Pho Asia  is a notch less. People are great, but the pho is so-so. 

The soup base should be \"pho-nomenal\" and when it is not, I feel disappointed. We also go the dry noodle dish with vermicelli, grilled pork and spring roll; this dish is comparable to other places. Yummy. Will order again yummy. However, I ordered sour sop shake and that was yucky. It was not blended thoroughly and came put as sour sop juice with chunks of ice rather than blended ice with sour sop. 

The four star is for their service, attitude, and the dry noodle dish. The pho and sour sop shake deserve a 3-star, unfortunately. Would I come back? I will. I love it when the people treat you like you're their most valued customers. Makes me want to treat them like I am one."}
{"text":"Their wonton soup is perfection! My friend always orders 44 and he loves it. The ladies washroom is clean, which is a factor to me when dining out. The staff are friendly. The avocado smoothie is tasty. They are closed on monday but are open every other day of the week. Will definitely visit again and recommend.
Well over a year since ive been visiting this restaurant. Service is great and the food served is always consistent in taste and quality."}
{"text":"I have been stuck repeating my visits to several Vietnamese restaurants in Newmarket, so I often miss one of the only places on the West side of town.  I stopped in for my usual test: a bowl of rare beef pho.

Com Pho Asia can get pretty busy, as was the case this night.  I was seated in near the kitchen, and served a nice hot tea.  As the place was getting pretty crowded, the manager asked if I could be moved to a smaller table.  No problem, I didn't need a quad for just me.

The soup arrived after a bit of a wait, but it was worth the wait.  I hoovered it down, and made my way across the parking lot to grab a bubble tea at Tea Hotea.

I still find Pho Fusion on Bayview to be my favourite choice, but if I didn't have the time to get there, I would not hesitate to stop into Com Pho Asia again."}
{"text":"This is a real Vietnamese five. Authentic Vietnamese food and dripped coffee. The best choice the neighborhood!!"}
{"text":"Excellent service, top of the line broth, and very reasonable prices. 

I always get the Chef Special Pho (number 30) and am never dissapointed. Tons of noodles and meats.

Staff is friendly and courteous, always very fast.

Best pho in Newmarket!"}
{"text":"The is my place to go in the area whenever I crave for pho.  I feel that the flavours are more authentic then the other Vietnamese restaurants in Newmarket.  I also don't get the thirst after (from the MSG?) that I sometimes get after eating at other places.  The only comment I have is that the sliced beef they use is too lean."}
{"text":"Came here awhile back. Since moving to the north of Toronto, we've been on a hunt for good pho. 
Service was quick and pho was good. Broth was fantastic. 
Our ultimate test is how thirsty we are once we finish the meal. We left and half an hour later, we were doing pretty well. We would come back when we are craving pho, pho sure."}
{"text":"There is nothing more soothing than a hot bowl of pho in -30 degree weather.  We came to Com Pho Asia for the first time and we were quite pleased.  

The hubby ordered pho while I got the bun rieu.  The broth were quit clear and tasty.  While we visit pho fusion often, the hubby said Com Pho Asia is more generous on the amount of meat and also better in quality. As for my bun rieu, I was quit happy with the taste however there were no presence of crab meat. It was all just egg which is a bit disappointing as authentic bun rieu should have some crab meat.  

I didn't get any attitude from the waitress as noted by previous yelpers, perhaps I caught her on a good day or that I have very low expectations when it comes service in Asian restaurants. I would definitely come back here to try other stuff."}
{"text":"Been to this place a couple of times.  There Pho isn't bad nothing special.  The place is clean inside but like everyone else has said there attitude there sucks."}
{"text":"I like coming here because it is usually less busier than Pho Fusion and this place has bun bo rieu WHICH is amazing here. The restaurant is super clean and spacious. The food here is amazing. 

Make sure you try the spring rolls here, they are the best and they don't skimp out on the meat too!

The only thing that will keep me from coming back to this place is the older lady who is a waitress there. Most of the time she is unprofessional, rude and snappy towards me. She isn't very consistent at all and very moody throughout our visit to the restaurant. One second, she is very happy and the next she is very snobby. I rather go to an OK pho restaurant to get the better service."}
{"text":"Pho is one of the greatest all-time comfort foods. I'm glad I found a really good place up in Newmarket.

Com Pho Asia is a mom and pop shop Pho noodle restaurant that serves many Vietnamese noodle, rice, and appetizers. They also serve a variety of drinks and shakes.

A small restaurant that seats about 40 people is nice and cozy. The owners are usually working on-site at the cash or serving tables. There's a tv broadcasting CP24, you know, if you ever get too bored of the person you're eating with (kidding).

If you don't already know what you're getting, I'd reccomend the Ph ?c bit (Pho Special) which is the Pho beef noodle soup that practically has everything you would want in it. I'd also order the friend spring rolls to share. If you're not into the noodles, the bbq pork/beef/chicken rice is also a solid choice.

This time around I went with the spicy beef noodle soup (this thing is spicy -- no joke). It's not intensely spicy... but it definitely has a good kick. So for those who don't like spicy, stay away from this one.

Overall, I'd rate the restaurant very good, for the freshness and taste of the food and the location in Newmarket. Lots of parking as it's in a plaza. Service is quite friendly. Great place."}
{"text":"This was the first time here. There are many pho places in the area so I had high expectations since there is so much competition. Overall my experience was not bad. 
I didn't end up getting pho, i got wonton soup which was satisfying and cheap. After my meal i got bubble tea. The bubble tea was amazing! defiantly recommend the bubble tea!!!! 
The place was clean. I would say the staff could have been a lot nicer though. They came across as not very hospitable. 
i would probably have given this place 3 stars due to their staff if their bubble tea wasn't so amazing!"}
