{"text":"FOOD
- My partner and I both got the 2-piece fried chicken meal, but we both got different sides:

1. Potato salad: Needs some work. Maybe add in some mustard or dill? Not much flavour.
2. Macaroni salad: Average, similar to KFC macaroni salad.
3. Poutine (+$1): Pretty good! The gravy has lots of flavour and the cheese's melt-factor was more than acceptable.
4. Kettle chips: GET THESE RIGHT NOW, DO NOT HESITATE! Forget Tim Horton's \"warm\" kettle chips, Coney Island's kettle chips were jawdroppingly delicious. They're sliced from a regular sized potato and they taste very natural, because they are! As a side, the portion was huger than expected and came out fresh and hot in a medium-sized takeout box.

- The fried chicken itself is juicy and a lot less greasy than KFC/Popeye's. The skin is, as someone else mentioned, somewhere between KFC and Popeye's. By the chicken itself, it's unremarkable, but the meal came with hot gravy which elevated the taste. They must have thickened their gravy from the first couple of reviews because the texture and viscosity were A-OK.

- You can choose to get a free sauce on the side. I got sweet chilli which was totally yummy. It's not a homemade sauce, just the regular one that comes in a bottle. My partner got the Bullseye BBQ sauce which was just that - the Bullseye BBQ Sauce (smoky, not so much sweet).

SERVICE
- The workers were young and there were only 2 or 3 of them there when we went on Thursday night. They are friendly, but don't interact too much at service points. They seemed a bit shy, so I'd recommend that they work on a more outgoing approach.

- Our food came out in just under 10 mins.

ATMOSPHERE/LOCATION/MISC
- The restaurant is set up like a fast food restaurant with a counter and self-serve pop machine, but we later realized that the employees bring out the food to your table. They should let people know this, so they don't expect the speed of a McDonald's or get confused.

- There are only two washrooms, one for men and one for women. They are huge and look like the kind you would find in a Moxies.

- Located at the new TD Bank plaza at Hwy 7/McCowan.

- They have free Wi-Fi.

- I would definitely come back!"}
{"text":"love this place!  tried it with my family today and was amazed. great fried chicken and fabulous rotisserie chicken, beats swiss chalet and kfc by a long shot. a lot cheaper in price too.  great great value.  management was excellent and very friendly. will recommend to all my friends. will be back again."}
{"text":"Drove by this yesterday on the way home and decided to try it out as I love fried chicken!  Wasn't sure what to expect when I walked it, but it was setup like a fast food type place with a counter to take orders and maybe 8 tables or so.  

I ordered the 2 piece with fries and steamed veggies, but wish I had tried other more different choices.

The chicken was fried to order, nice and crisp, the chicken very hot, moist and juicy.  Not as flavourful as I would have liked though.  

The fries were ok, but nothing spectacular, after reading other yelp reviews, maybe I should have tried with gravy.  Steamed veggies of course were steam veggies, acceptable.  

Service was very good, friendly.  

I would probably go again and try to rotisserie and different sides.  Good to support a non-chain place though and at least try it for yourself once!"}
{"text":"The texture of the chicken was less salty than KFC and less oily than popeyes. 

Will definitely try it again for the roast chicken. 

The French fries with gravy was a nice combination."}
{"text":"I had the chicken wrap, its loaded with slices of chicken and vegetables plus 2 sides.  Its worth the $ and its pretty filling.  I also enjoy their fried and rotisserie chicken.  The tastes are both awesome, not to salty and not to greasy."}
{"text":"Came here for chicken because it was close to where I live. The food was okay. I can see much more improvements for this place. They should start with giving utensils for take out."}
{"text":"The first thing I noticed about this place is that all the staff are young - I get the impression that it's a few young people starting up their own place.  As a result I find that the staff were all very nice if not a bit disorganized - though this is understandable and easily overseen by how new the restaurant is.

I've had a chance to try both the rotisserie and the fried chicken.  The rotisserie chicken is better in my opinion - pretty juicy - while the fried chicken is pretty good but hasn't wow'd me.  I like it much more than the KFC chicken because I'm not a big fan of the batter taste.  You get gravy for both rotisserie and fried chicken which is a bonus!

A two piece friend chicken meal (incl. fountain drink and TWO sides) is $6.98 which is pretty good value to me.  The fries came in a pretty big box and makes me think I'm getting a good deal.  The salad is the only thing that is a bit disappointing - they provide lettuce and sauce of your choice but tastes similar to salad-in-a-bag that I'd get from No Frills.

Overall I enjoyed my food here - I like that it's a start-up business and do want to support variety of food choices in the neighbourhood.  However, I do get the impression that they are themselves a bit confused about the type of restaurant they are.  Oddly enough, they are neither a fast food place nor a sit down restaurant.  The decor and service is that of a fast food restaurant, but I find that I've waited over 15 mins for my chicken meal.  I didn't mind waiting for it as I was with a friend, but this place would not be my choice of food next time I need to grab something quickly, nor would I suggest this if I needed to meet up with a few friends over lunch.  The restaurant should probably be more of one or the other.  

I would probably come back and hope they do well!"}
{"text":"Found this neat little place along the southeast corner of 7 and McCowan (same plaza as Hero Burgers). It took me a while to find the entrance, and this place is not noticeable if you're coming from westbound Hwy 7.

I came in with the expectation that it's either gonna be similar to Swiss Chalet or KFC/Popeyes. It is actually a hybrid of both, with both rotisserie chicken and fried chicken available. At first I thought they would have hot dogs, since isn't that what Coney Island is famous for??? But nope.

I had the quarter rotisserie chicken with gravy and the 4 piece fried chicken meal. The meal comes with a dinner roll, two sides, and a fountain drink. I personally liked the rotisserie chicken a little more as the meat was juicier, and the fried chicken not standing out much from the likes of KFC and Popeyes (they are all almost the same price though, although the skin is somewhat healthier here). I can't compare to Swiss Chalet as I've never eaten there before (bite me!), but if Swiss Chalet was anything like this I might consider trying there for the first time. The gravy, however, needs improvement as it was too light and watery for my liking.

Service was okay, the manager did approach us and asked how we liked the food. The cashier was somewhat emotionless, but did explain us the orders to decent satisfaction. I also like the automated fork, knife, and spoon function in this place.

I'll consider coming back for rotisserie chicken, but in terms of fried chicken I'll probably stick to KFC/Popeyes."}
{"text":"Pretty good actually. Rotisserie was as good as swiss chalet in my opinion and fried chicken wasn't too bad either. Nothing separates it from KFC and Popeye's, but it's not worse either. Would recommend."}
