{"text":"The building is totally unassuming and you'd never know it by looking at the outside, but this place makes the best pizza. The crust is always perfectly crispy and they are heavy on the toppings without overloading the pizzas so much that you can't eat them."}
{"text":"Hands down best pizza in the area.  We eat Congin's frequently, tried many different types of pies and they've all been fantastic and done/delivered on time.  Salads and wings are good too."}
{"text":"It's our go-to pizza place! Reliable & consistent every time we order!  Delivery and pick-up both go smoothly!  Love that we can easily get a sheet pizza anytime!  We serve this pizza at every event we host and always get rave reviews!  Thank you Congins!"}
{"text":"Update:   The Chicago-style pizza is phenomenal, however their delivery service blows hard. All the food arrived cold."}
{"text":"This place is a neighborhood staple. The staff are friendly and the food is delicious and reasonably priced. I've had the pizza, wings, subs, salads, and pasta, it's all yummy. Great for feeding groups and they deliver."}
{"text":"My first time at this location the husband and I used to grab Pizza from the Cleveland location when we both worked downtown every day - and if it's any indication I drove past the place and was like wait the same Congins? -  big U-turn!!!!   They have the most delicious pizza and it's a total 10 -  crispy crust, delicious sauce, killer toppings, browned perfect bubbly hot cheese - as well as some amazing sandwiches salads and appetizers.   But back to the pizza - you know like the whole reason we're here - you get it in the car and your whole car smells so good you're like is it worth burning the roof of my mouth? It is worth burning the roof of my mouth.  OK second thought is it worth dropping cheese and sauce all over myself in the vehicle it is... it so is.   The staff is super friendly, super fast and great at moving the lines and orders.  Cannot tell you how glad I am to see them in Chardon now - as pizza is easy to mess up and hard to perfect - they've nailed it!"}
{"text":"The last of the good neighbourhood independent pizzerias around. We've never been disappointed with pizza from here. And if the Yelps with people griping about cost is making you think twice about going here, remember that you're getting something made by hand by a local business that's been there forever."}
{"text":"We have gotten pizzas delivered a few times. The delivery person has been nice. The toppings on the pizzas is fresh.  The Half-Sheet pizza is expensive $32 and it does feed us for 2-3 days.  The quality of the pizza and ingredients is very good.  They serve some of the best pizzas in Cleveland area. They are closed on Mondays:("}
{"text":"Great place. I've lived in Collinwood my whole life and this was walking distance from my house growing up. The bundo burgher is like a Roman burger but way better. We order our pizza well done and it's freaking perfect! They have great wings and the antipasto salad is great for pairing with anything on the menu."}
{"text":"Better than average pizza spot in Collinwood, right by the 185th street exit/entrance and right across from Rainbow Muffler (why we went!). A very unassuming, bare bones building lacking in even a modicum of charm -- think \"Soviet Union, pre glasnost\" -- staff is brusque. Parking is minimal. They have a drive through window, for some reason (but who orders pizza at a drive through, when it takes 40 minutes to make? I guess for pick ups only?).  My expectations were modest, but the pizza was very good to excellent, with superb crust and very good toppings. Generous cheese. Mild sauce. My only complaint was NO GREEN OLIVES. We adore green olives, not black.   Prices are a tad high, especially considering this is the super-low rent neighborhood....$12 for a plain large pizza (16\" generous sized) with no toppings. Toppings are $2.00 each, so that adds up fast. A specialty pizza (like buffalo chicken, hawaiian, supreme) is $21. Also they are super slow. I called in my order, and it took close to 40 minutes, but I will say when I got it -- it was STEAMING hot, right out of the oven, literally CLOUDS of steam coming out of the box!  Recommended and we will definitely go back, even though it was out of our normal neighborhood."}
{"text":"Delicious pizza. Old school in most senses of the term. It is in a tiny, unassuming building in what would otherwise be a pretty unremarkable intersection.  The pizza is standard thickness with a great balance of flavor and texture. Places like this need to survive so check them out. Not enough of them out there in Cleveland."}
{"text":"So, I am originally from Chicago and since moving to Ohio have been on a mission to find the best or closest thing to the Chicago Style Deep Dish pizza they have there.  Until we found this place, everything fell short in many ways (sorry Ohio).    We took another gamble and orders a deep dish and a thin crust from here and took it home.    O-M-G!!!  It was fantastic!  The pizza, although still not like Chicago, was the closest thing we've come to it in the area.  We will definitely go back here again and again for any pizza!"}
{"text":"Terrible portion size for the spegettie. And clearly Congins doesn't practice good customer service because when they forgot the meatballs that I ordered, aperantly its my fault and I have to send them pictures of the spegettie to prove that I hardly got any. Who does this?"}
{"text":"Best pizza in town! Crust is amazing. I always get a sheet pizza(for good price) and have leftover next couple days. Local favorite"}
{"text":"Great pizza! And great wings too! Its priced a little higher than I like for pizza but it's really good and you pay for the quality. They've recently done some remodeling and it looks much better."}
{"text":"Sorry Congin's I just got done eating one of your sandwiches and had to knock you down a star.  Still A-OK with your pizzas (pricey but good), but not the biggest fan of your sandwiches.  I ordered and picked up your Italian Sub and it reminded me exactly of the subs I make at home from ingredients from Costco, no kidding.    The Italian meats on this sandwich were far from outstanding.  Standard pepperoni, salami, ham, tomatoes, lettuce, onion, cheese and dressing.  As I'm not a big fan of tomatoes and hate myself for saying this, but the ratio on this sub stunk. The slice needs to at least travel 3/4 the width of the bun.  The amount of onions on this were also embarrassing.  As I adjusted my 'wich to the center of the roll, I noticed 4 thin onion slices, 2 each half.  You can probably guess how the rest of the sandwich went.  Subs are approx. 8\".  The highlight was the oven baked sub loaf.  It really looked and tasted similar to the ones you can get at Costco but maybe slightly bigger.  Now that I've tried Congin's, I'll go back home and make one of my own to compare (pic I took but not sharing).    I will give them another shot and see if any other of the subs measure up to the ~$6.25 price tag unexpectedly up from the $4.75 price I got off an obviously old take out menu.  At the old price the sub is worth it, new price, not so much.  Compare with Papa Joe's or Giorgio's and decide for yourself.  Still looking for that GREAT sub place in the area.  I had to edit because I didn't notice that it's been exactly ONE year from my previous review....eerily ironic."}
{"text":"It is hard to find a really good pizza place among all of these chains, Congins really stands out. Their crust is delicious, I have never had a bad pizza from here. It's a little hard to find but once you find it you will be back again and again. Best pizza around! Highly recommend!"}
{"text":"I have been eating here since like 83 this is the best pizza in the area and has been for years . The sausage is my favorite , they have a drive thru window if your in a hureey or choose not to get out of car. I also like their chicken Parm dinner . They use high quality toppings old school pizza the way it should be. Its right off 90 185th exit south to Notingham try it you wont be disappointed."}
{"text":"Alright this is my Friday night safe haven for lunch .. Its a sure bet if I'm tired of cooking or just the average fast food stops this is where I choose to get my food from... The delivery times are precise"}
{"text":"Great pizza, friendly and prompt service, love this place."}
{"text":"So, so nice service! We ordered pizza for our movers when we moved to the area in November, and I got a bit turned around in the neighborhood. I called for directions, and the person who answered was so accommodating. He offered to stay on the phone with me until I got there, which was beyond the call of duty, and I really appreciated. He came out from the kitchen to say hello as well when I arrived. Nice kid!  Whenever we order takeout, everyone loves it and asks where the pizza is from. A great place!"}
