{"text":"They have the best congee you will every eat. The congee is healthy for you, delicious and tasty, affordable, and there are a variety of congees to choose from. I would recommend this restaurant as one of the best Asian restaurants in the Mississauga area."}
{"text":"Average place for congee. I usually order congee and some fried donuts. 
There isn't many congee restaurant in Mississauga, so this place could be a place to considered."}
{"text":"One of my friends wanted to have some congee last week, so we went to Congee Dynasty. I was surprised at how busy it was for a weeknight.

For the three of us, we ordered a Pickled Cabbage & Pork Vermicelli in Soup and 2 Super Bowl Congees (one Seafood and one Crabmeat, Egg White & Fish Maw). The guys didn't believe me when I told them these \"super bowls\" are huge, so they were shocked to see the size of the congee when the first one arrived. When another server came with our second bowl of congee, she thought there was an error with our order because she was surprised to see 3 people order 2 big bowls of congee AND a noodle soup.

The vermicelli is quite light. Personally, I did not find it to be too salty or too bland. There is a decent amount of pork and vegetables, and I actually devoured it because I was so hungry post-yoga. 

The guys enjoyed their congees. I liked the seafood one better because there were thick slices of salmon and decent-sized shrimps. However, I felt the congees were a little too salty for my taste. One of my friends did not mind it, but the other kept reaching for his tea. 

The service was all right, and the food came fairly quickly. It's definitely a place to check out if you're in the area, looking for quick and decent eats for a reasonable price."}
{"text":"this place is not good at all.  I feel sorry for people who live in Mississauga but can't get to Congee Queen in Markham.  This place is a fail on alot of levels.  

They try to copy the dry garlic seafood fried rice from Congee Queen, but they put barely cooked vegetables.  The food doesn't taste that good either.

Service was not great either.  English and cantonese fluency is lacking because they speak mandarin.

Go to congee queen at Steeles and 404 if you want the same food from here but tastes good."}
{"text":"Good is average as most Cantonese restaurants. 

The services is horrible. How bad? Well, the worst I ever had and it is a excellent place for people not to tip the waiter/waitress for their very first time! Trust me, you won't regret not tip, at all!"}
{"text":"I'm not sure how this place received so many stars.  

People either have no taste bud, or the price must be right, because the service is obviously not there.  Empty tea?  Don't worry, just leave it open on the table, and they'll be more then happy to walk right on by.

I would not give this place 4-5 stars because of the price.  It is cheap for a reason.  Probably because the chefs can't cook.

The way I scale Chinese restaurants is by starting off by ordering fried rice.  If you fail at making fried rice, you most likely fail at life.  Surely, they failed horrendously on this aspect.  It came out wet and mushy. They tried to blame this on me by stating it was a certain type of fried rice I ordered.  NICE TRY!  I've ordered the same dish at every Chinese restaurant I've attended, and not once did they ever come out the way yours did.

This place should not even be considered an Asian restaurant, what an embarrassment.  What Asians put ketchup noodles on their menu?  Pad Thai with ketchup?  C'MON, ARE YOU EFFIN FOR REAL?  This makes me so mad, because one of my friends actually ordered it.  Sure enough, it got returned. Just imagine eating chow mien with ketchup.  YUCK.  I'm sure they offer that too.

Anyway, if you're feeling like Asian food with no standards, c'mon by this place.  You should be seated right away.

If it's winter time, be sure not to take off your jackets.  Their heating system is crap or nonexistent.  Anytime the door opens, the entire restaurant gets cold. Ask to be seated far back as possible if you don't want to freeze.

PS.   If you're going strictly for congee, that's all this place is good for."}
{"text":"Probably the best Chinese restaurant in Mississauga. The congee is excellent, the rice in hot pot is amazing. The price is fair. I would recommend this place to any Chinese food lover."}
{"text":"As far as Chinese food goes in 'sauga, this is okay.

Recommendations include the soft-shell crab fried rice (often unavailable) and the fried-raddish-cake (now virtually unavailable for some reason).

Last time the congee is a fair portion, but it was really salty.  Ironically, the salt-fish-chicken-cutlet-fried rice was amazingly bland and unsalted.  The salty-fish was used very sparingly and the dish lacked flavour.

Their choy is pretty standard, but heavy overuse on the garlic.

There must-try dish is the \"pepper & salt\" line - they have chicken wings, calamari, and some other ones.  

The exterior decorations are horrifying (can we say - overuse of neon?) but the inside is pretty snazzy.   Now if only a Chinese restaurant can find a better way of displaying live fish!  The current method is simply unattractive."}
{"text":"all my friends hate this place because they hate congee but I think they have so many varieties of congees, I love it, I especially love the seafood congee and I think its definitely one of my favorite places to get Chinese food."}
{"text":"Must say there isn't much interesting asian restaurant in mississauga but the food here is alright. Their congee is not the best I had , and also the bread stick that we order to eat with the congee always cones out 10mins after the congee. (Therefore the congee would be cold already). Taste of food is alright but service is really bad, done of the waitress don't really pay attention when their taking your order. Worse is one of them had their thumb dip in our dish while delivering it on our table. If you're going to eat there just for the taste, then go for it. If you're expecting a nice dinner with some family and friends, don't go there. T"}
{"text":"I love it Huge portions and low prices and the food is good.
This a great clean place as well."}
{"text":"Terrible service and the price is not reasonable compare with the one in golden square. We asked price for a dish, the waitress told us one price, but when we saw the bill, it was different. We asked but no one even responded, just saying that we need to pay as what the bill shows"}
{"text":"The place is great for big group as you can order various things from the menu. The restaurants is good size with nice look and atmosphere. The food is tasty...and taste comes with salt and spices. 

The dishes are good portions and are reasonably priced. We were a group of 15 to 20 people so it was easy on the pocket!"}
{"text":"*******CLOSED*******

Drove past congee dynasty today(still under \"reno\") and there's now a banner up for Little Sheep Mongolian hot pot!"}
{"text":"Your average Chinese family-style restaurant.
Nothing too special about the food and environment. I went to a family member's baby shower held at this restaurant and they pre-order platters of food to come out in order to feed the whole family (5-6 tables full). The bigger the party, the worse the food quality becomes. The food came out cold and many people kinda lost their appetite. 
I generally feel that since this was around dinner time, the restaurant was pretty busy and so the quality of food became a 2nd to how fast they can whip the orders out. 

I went again another day during lunchtime but this time with a couple pals and we decided to order from the lunch specials menu such as grilled pork chop and egg noodle soup which comes with a dish of greens which are really tasty. Also as a personal favourite, I ordered an extra order of Fried Turnip Patties because those are the bomb.com  : p 
This time, the quality of food was better and I left feeling more satisfied. 

The thing that stayed constant for both experiences was the service. The waiters were pretty rude and both sides had a hard time communicating because many waiters knew limited English and we only knew a handful of Cantonese. 

So essentially I would only recommend this restaurant if you aren't so picky with your food and environment but you enjoy a nice Chinese family-style meal : )"}
{"text":"3.5 stars * Decent congee, good salty fish or soft shell crab fried rice, deep fried tofu, Dry garlic lobster, fried oysters - the list goes on. Food is great for the price but service sucks  (they have new employees every 6 months) Ive gone here a ton of times for the last 6 years, I and am happy its so close to home. Hong Kong tea iced? Yes puleaseee."}
{"text":"Had their banquet meal (for two tables) during the past weekend to celebrate the birth of our first child. Coincidentally, it was also the day of the first big snowstorm in the GTA area. Naturally, the restaurant wasn't as busy as it normally is. This worked in our favour, as the waitresses were especially attentive. They changed our plates mid-meal, asked us if the food was to our liking, and even offered to cut and serve the cakes we brought ourselves at the end of the dinner. The banquet meal was 11 courses and the menu can be found on their website. The food was hot, fresh, and thoroughly enjoyable. Our guests were very pleased, as we were. A friend suggested that we should come back for Chinese New Year's, which is a very good possibility..."}
{"text":"The food was okay but the service was horrible.  I like the clams.  They were really yummy.  The waitresses kept giving us attitude and then implied that we had to tip her afterwards.  They should really get their training right.  The place could be a bit cleaner.  My utensils had gunk stuck on them.  

4/5 food
3/5 venue
4/5 value
2/5 service"}
{"text":"This place is a typical eat in lower end to medium quality type of Chinese restaurant.  The food is decent when I compare it to the many other Chinese restaurants I've ever been to.  The portions are good to above average in size but what really works is the price is a good value for the quantity that you get.

If you are ordering a large congee it is really large.  It will be enough for the entire table that is, for everybody to have seconds or more easily.  

Everything else is pretty much on par with what you would expect from a Chinese restaurant.  I have to say though the last time we were there we were about 10 or so and it was barely over 120 bucks.  That's not bad for a large group.  If you have a large group to feed this would be a place to consider for the value for sure."}
{"text":"After reading a few good reviews about this place, I decided to go here for lunch with mom. After going here and trying it out for myself, I'd have to defer for both the quality of food and service. 

We ordered hot and sour soup, Malaysian style chow mein and shrimp look fun. Unfortunately, everything was brought out in an inconvenient order: the chow mein (with hardly anything in it)  first, followed by the look fun and THEN the hot and sour soup. I swear they are working backwards here. 

Food was poor...service was even poorer. Food was brought out and kind of just \"dumped\" onto our table. Once the bill came, we paid but with what was handed to us, we didn't give a tip; the waitress had the nerve to ask us if we'd give a tip! Yeah... okay... 

We would have been better just having Subway right around the corner!"}
{"text":"Food is not great or cheap.  Went to the restaurant with husband and 2 kids.  Service was poor.  We need extra 2 bowls, napkins and 3 glassess of water and they did not arrive until 0.5 hours later.  Then the waiter gave us the bill without us requesting it and my kids were still eating.  How rude!!!  When complained about the service, the waiter told us to go to a 5 star restaurant next time.  How rude!!!  Promise never to return again!!!"}
{"text":"Wow, I can't believe I've never written a review for this restaurant.  We used to go here all the time.

What I like: their decor and the assortment of food.  The best is the chilli turnip cakes.

What I don't like: their congee and wonton soup.  They both have tons of flavour, but its not natural.  It's all MSG.  You will be so thirsty after eating here.  I suggest going to Chi's congee instead."}
{"text":"Here's the thing about this place: if you're looking for quality Chinese food and service? Turn right around and walk out that door. The only really good things here is the congee, and for some reason, people are so surprised by that. Hello guys, it's in their name.

I have been here half a dozen times for non-congee related meals and they were slapdash at best. It wasn't disgusting but you might as well have gone to the other side of the plaza and gotten the hot foods at B-Trust. If you don't eat Chinese food that often, you won't know the difference.

However, that being said, their congee is delicious and seriously cheap. Around $5-8 for a sizeable portion and if you're just getting it to go (like me) it'll be ready in less than 5 minutes.

But yeah, don't expect quality service here. Or food. Except the congee."}
{"text":"Although this place isn't quite as busy as it used to be,it still is a gem to me! Fast service and delicious congee. However, the dim sum items on the menu do not meet my standards. I reconmend the aged duck egg and sheeded pork congee. Yummy!"}
{"text":"Got take out today and have to say the service was utter garbage. Staff are snappy and non responsive. My bill came out to be $16.a few cents so I handed her a $20 bill and she didn't even bother giving me the change back. I was  astounded but I just let it go. Even got snappy replies for asking if I could sit at a table to wait for my food. I will never go to this restaurant again!! Very rude service."}
{"text":"The congee was pretty amazing here, as was the selection of other food. For newcomers to traditional Chinese, I recommend working with your server... they know the dishes pretty well and can help accomodate your tastes. My co-worker and I split a big bowl of congee, a beef dish, a couple orders of rice noodles, and some beers; though we're pretty big eaters. Price was also fairly reasonable considering how much we ate. As said before, come here for excellent food, not necessarily excellent decor."}
{"text":"The last time I ate there ... there was a roach on my plate ... hence it was my last time."}
{"text":"Had their oyster with broccoli, it was good. Their service is bad when is busy hours, it's really hard to get their attention when we need something, like when we want water or need a fork. But when is not on busy time it was ok."}
{"text":"Food is a bit too salty (MSG?), service is usually not overly fast, attentive, or friendly. Slightly more expensive than I would expect.

Good variety on their menu though."}
{"text":"One of our favorite restaurants in Mississauga. We love the fried noodles and the enormous bowls of congee."}
{"text":"Really really solid chinese food in Mississauga. Everything i've had here is decent or good, nothing was horrible. 

Give this place a try!! and theyre so clean/have nice decor compared to other chinese restaurants in Mississauga."}
{"text":"Last meal in Canada before heading back to the States and it was close to my hotel. We had some jook/congee,  dim sum and a few other items. I was satisfied with the majority of it, but my cousins were not so hot on most items saying they lacked flavor and seemed salty on some items as other Yelpers mentioned. Service was OK borderline abrupt."}
{"text":"Visiting family in Canada we were taken here, it's very busy staff is attentive it's clean and spacious!  Food was good and it came out fast!  Minus 1 star for the bathroom... or washroom how's it's called in Canada... it really needs some updating!  And I'm a dude!"}
{"text":"Terrible service. I came in with the mrs. Late night and no one even paid attention to us. There were around 8 servers and maybe like 5 tables. I had to ask for the bill 3 times and never got a takeout container. 

The food was good but there are better options nearby."}
{"text":"My standards are pretty high for Chinese. Didn't really find anything special about their food, although true to their name maybe it would be better to stick to congee next time. The place was a bit untidy with spilled fried rice on the floor at an empty table and it was not even busy that time. My plate and utensils were a bit suspicious too but I had to use them anyway. Hope the staff can give a little more importance to cleanliness."}
{"text":"We came to Congee Dynasty as a Plan B after our dim sum plans got changed last minute.  

We ordered the pork/egg congee ($4.25) with donut ($1.50), Chinese greens ($4.25), 'Deep Fried Three Kinds of Stuffed' ($5.75) which despite the terrible name turned out to be tofu, eggplant and green peppers stuffed with shrimp/crab meat, fried chili turnip ($5.95), a Cantonese chow mein ($8.99) and rice noodle with beef and black bean sauce ($7.75).

Food came out hot and fresh, although cooled down quickly due to a draft from the kitchen where we think there was a door was propped open to the outside.  

The dishes were all average with the donut being the highlight.  It was like biting into deep fried dough heaven - soft, fresh and crispy, yet not too greasy.  The donut alone is reason enough for me to return here.  I did find the food to be a bit on the salty side but MSG is an integral part of the Chinese food groups.  

Portions are generous, definitely enough for 5 people to be full and we had enough leftover for one person's workday lunch."}
{"text":"I'm a little harsh on my Chinese restaurants.  I've been eating at these types of places since I've been 5.  We've get into our car, drive a good 45 minutes to the Scarborough, find a tiny hole in the wall, and eat some amazing tasting ho fun, chow mein, jook (congee), and wonton west of the Pacific Ocean. This place doesn't stack up sadly... to be fair, most places in Mississauga don't have the same quality, cost, or taste as the ones in the GTA East.  Perhaps it's the lack of customers... I'm not sure but this places gives it a decent shot but falls short on a few places.

When you come to these places, I don't expect spotless but I expect reasonably clean tables and chairs.  This place doesn't get that far.  When we walked in, the wait staff casually gestures us to a table that has some left over pieces of chow mein from the previous diner.  Using the paper towels, I tried to clean it up but it was really heavily sauced and just left smears everywhere.  I think the bottom of my shoes picked up probably a spoonful of fried rice as well.  So the start of the dinner was less than optimal.

We ordered 3 dishes for the 4 of us and they came quickly.  Fried rice, beef jook, a seafood chow mein, and chinese vegetables. When you start eating you notice it quite immediately.... MSG and it was really strong.  If it isn't MSG, then they're using some really funky tasting salt.  Except for the jook, these dishes were really unbearably salty.  I was constantly drinking the hot tea to dilute the flavour.  I was hoping for a half decent meal but after the first couple of bites, I knew this wasn't it.

The service was the usual Chinese noodle shop ... some what functional, really quick, and totally impersonal.  They only had 50% of the tables filled so we never had  to wait long for anything.

If you're looking for good Hong Kong Chinese noodle and congee food... head a bit west to Macey's.  It's only a 5 minute drive max to this other restaurant and you'll get your fill of good authentic Chinese noodles similar to the ones in GTA East."}
{"text":"Come here for the congee.  The congee is where it's at!  Everything else on the menu is subpar (not that I have tried everything else on the menu mind you).

But the congee is good quality, and cheap!

Good, quick service, like most other chinese restaurants.  Big space, never had to wait for a table.  

I recommend this place for family, friends, and couples.

Derek"}
{"text":"the best bang for the buck quick chinese food in Mississauga. food comes out in lightning speed and its def above average for this type of chinese food. I've tried all the different jooks and all are very well made. tasty flavour and perfect texture to the goopy poor man's dish. My fav jooks include the congealed cow blood and Manila clams. The establishment is pretty typical chinese decor. Come here on a sunday afternoon for a cure to a good hangover."}
{"text":"My mom is a big fan of Congee Dynasty and has been telling me about this restaurant for a long time now.  I have since eaten at the restaurant but I more frequently order delivery.

At the restaurant - you must defintely order the Chicken and Shredded Duck Congee big bowl.  I think it's A9 ont the menu, feeds about 6 people for $7.99.  We have ordered it for delivery but you get smaller portion than if ordered in the restaurant.  Another favorite is Pork Jowl and garlic stems in XO sauce (I don't know if this is the exact name of the dish but it can be found on the special menu placed at each table).  Don't forget to order some chinese donuts to go with your congee.

For delivery - there are endless possibilities.  My favorite dishes are Shrimp and Chive Rice Noodle Roll, Fried Shrimp Dumplings, Yeung Chow Fried Rice and the Hot & Sour soup.  They program your info into their database, so ordering is quick once you give your phone number and they deliver within 20 minutes from the time you place your order.  I also have to mention that it's cheap!!!"}
{"text":"We come here about once a month for the congee.
The fried turnip cake is one of our fav dishes.
Service is typically 'Chinese' friendly ie nothing to write home about...but it's OK."}
{"text":"Agree with D-T on the review.

Overall, an above average restaurant if you are more \"Canadian\"/\"North-American\". The restaurant is a lot cleaner than most Chinese restaurants and has a more \"modern\" atmosphere (think slightly less than Asian Legend). 

Food review: decent food for normal-ish prices. Nothing amazing, but definitely a lot saltier/lot more MSG than usual. A good dish to try would be the \"XO sauce fried radish cake\" - my favourite and generally enjoyed by most people I've introduced it to.

Service review: agreed with DT - not overly fast, attentive or friendly, but gets the job done.

Average restaurant - not a bad option, not a great option."}
{"text":"I've been here several times with my family and for some reason I haven't written a review for this place...maybe because I'm so tired after all that MSG.

I actually just went there for dinner tonight with my sister and mom. Parking was quite full so we assumed we would be waiting for a table. However, we got seated promptly as we entered. I think they changed the booth seats because they look cleaner and the texture is different now. The utensils, cup, bowls, and dishes always seem a bit dirty to me. Does anyone also think this?

Since it's called Congee Dynasty, it's pretty obvious that they specialized in making congee. I don't even like congee but it's actually pretty good here (with the dough fritter, of course!). The three of us ordered their house special congee (consists of only seafood, yum!), a plate of dough fritters, pad thai with chicken and shrimp, and fried noodles with beef in soya sauce. The dishes were average so there wasn't anything special compared to other Chinese restaurants. To be honest, we didn't finish anything because the portions are huge. Everything was taken home...now we have food for tomorrow, yay! The total came up to $44, which is quite cheap considering how much food we got.

Try this place out when you're in the area. You won't be disappointed but you won't be highly impressed."}
