{"text":"i love this bar! you never kno what to expect... depending on the day, you have a wide range of specials, contests, and entertainment. the bartenders are crafty and the crowd truly ranges from evening to evening..."}
{"text":"Alright, here's the straight up deal with Connolly's.

If you live near this place and want a sports bar to hang at with your friends, this is a great spot for that. It's by no means a \"destination\" if you're coming from a ways away. It's no craft beer bar. It's probably not the place you want to go to meet people (it seemed to me that people mostly kept to their own groups.) But this place has some nice TVs, it's laid out well, the beer is well priced, and they have a couple of decent pool tables.

This isn't a place that I will be frequenting, as it is out of my way, but if I lived down the street I would probably have my own butt print left in one of the bar stools by now."}
{"text":"What a terrible experience....was suggested to me that they have great wings on wed nite...25c........sounded great...i love dive bars...i looked at the reviews before going, but i'm like, oh well...really shitty reviews, i'll see for myself. 
The bartender looked 15, and so did the chick in the kitchen. Evidentally its a family affair, with the parents there drinking and sociallizing, while i wait 5 min for a drink.  The man next to me waved her over. She said she can't see...great!!! Lets see how she makes a bourbon/7...it took her a bit after picking up and looking at 6 bottles. Good poor, terrible service.  The place was not busy. I ordered a dozen wings. The man next to me had been waiting 20 min, and said he was leaving. I was sitting at the bar, so i could see the kitchen. A 12 year old looking young boy then entered the kitchen holding his cue stick, and starting helping the other child kitchen worker do all the wings that are being ordered..no gloves, no washing of hands.....i said \"JESSICA\"....bill please....not staying for the wings!! I left....Glad someone can open a bar, have kids running it, and BAAAAD service.....Health Inspector Health INspector???????????????? They must have their money, and this business is for fun!!"}
{"text":"Connolly's is a dive bar on the westside. The crowd is wanna be \"bros\" rockin the motocross look and promiscuous girls lookin to hook up with them with a few ghetto people thrown in. They have a stripper pole here and beer pong on Sundays. The first time I came here I was very intimidated because everybody looks like they're going to beat you up but in the end everyone is very down to earth.  They serve food during the day but I always show up when they're done serving food. You can find me here every Sunday playing beer pong :)"}
{"text":"New owner took over in April, much better, laid back, good prices and friendly staff.."}
{"text":"Nice dive bar with good drinks and good food. They have a couple pool tables and several dart boards, Just enough TVs to keep you intrested and a good staff to keep you drunk."}
{"text":"Actually this is not a dive bar. This might not be up to Snotsdale standards, as no one here is going to kiss anyone's a** for any reason. This is a good ol' corner bar. It has nice servers, the food is bar food, and the owners are cool.  The beer is cold the atmosphere is laid back and its a good time. So if your looking for a high class, high scale place, go to Martini Rocks, or some other over priced bar. If your looking to get a drink and have a good time Connolly's is the place to go."}
{"text":"The new management has ruined a good bar. They are rude and have run off the regulars.  The food has gone down hill and the new bar tenders make crappy drinks.  They don't even have any amazing drink specials to make up for it."}
{"text":"If you're in the market for a spot to catch a game, check out this place. Huge beers, hot wings and enough TVs to ensure a good time.  We will be back!"}
{"text":"Is this an Irish bar or same old dive bar that plays rap and had a low riders car show over the weekend? Was decent back in 2008 with a fun crowd,rock and actually quality food. Those owners moved their bar far north and are very successful. Hopefully the new owner here markets this bar to the middle class and turns it around."}
{"text":"Went on Saturday night and I was treated to karaoke. It was fun! There weren't many people, so I was able to be on the pool table for quite a while. Service was fine.  The bathrooms were very dirty."}
{"text":"Awesome place! Always my favorite when visiting friends in the neighborhood, walkable to their house. Sweet as pie bartender. A little problem with another customer and it was handled extremely well by the manager and bar backs, including a round of drinks on the house to make up for the whole situation. They also had an adorable cowboy singing amazing live country this weekend, including an incredible original song. I've been here for daytime basketball games, and of course the FREE BREAKFAST. All is well at connellys!"}
{"text":"Connolly's feels like a frat house party except there is no college near by. All of the reviews were on target regarding the attempt to be \"bros\", the obvious roids, some beer pong etc..

Last time I was there I remember it being dark, cramped and smelling a little.

If you are an ex wrestler, current wrestler, ex football player stuck in a time warp or a guy who just never out grew your college frat or even a guy who just likes to dress like hes in a frat whether or not he was then this is the place for you.

Girls if you are looking for the above paragraph type guy then here you go.. 

PS people were having sex in the parking lot last time I was here... and no not in their car it was on their car.. thats hot at 3am in your drive way its ghetto at 9:30pm in a parking lot off of a major intersection."}
