{"text":"Not sure what has happened to this once fine restaurant the last few months.  It's been a favorite of ours and we've been regulars for years but will never return.  The last time (Sept '16) we were here and actually received food, the fish fry came out with soggy fish.  Our waitress acknowledged the condition but denied they had been sitting under a heat lamp or were microwaved. She offered no remedy or apology.  Today we waited 15 minutes at our patio table before a waitress appeared and offered menus.  After placing our orders we waited 40 minutes without seeing our waitress again.  Approached the manager who asked where we were sitting, as if that was to blame.  We left for the last time without ever seeing our waitress or our food!!!!!"}
{"text":"I got married to my beautiful wife on September 12 2015. After searching many locations for our reception we decided that coppertop was the place to go. I have to say that was a mistake. I was very embarrassed when my wedding party and half of my guests was served chicken that was on even close to being done. The manager on duty brought out fresh food and replaced the plates that had already been served but at that point the damage had been done. I think what upset me even more was when I contacted the establishment afterwards I was told that they would check into the situation and see what they could do for me. I'm still waiting for something to be done or at least a call telling me they have no intention was doing anything for me. I've been waiting for five months now so obviously they've decided it wasn't important enough to address."}
{"text":"We frequent coppertop often.   It is well priced for its menu and drinks.  The owners to the waitress have been very professional and friendly.   The staff will go out of their way to accommodate their patrons.  Service is quick but not rushed. I appreciate the well time appetizers to meal to desserts.  Coppertop is an asset to valley city."}
{"text":"Been a few years simce my last visit, and will be a fewore before I return. Had to send waitress in to kitcken tofind out if ribs \" baby back or st louis\"  Some rices different the website menu and some items missing. We all had sandwiches or salad. Food about what you would expect froma golf course kitchen. Okay but not top quality."}
{"text":"We just went to Coppertop last night for a clam bake. We were seated immediately. The service was great and waitress was very through and pleasant. The half chicken was Hugh and delicious. Clams enjoyed by all. 3 of us added steak for $5. The steak was so good, I ate mine first. It came with rolls, coleslaw, sweet potato casserole, corn on the cob. Thoroughly enjoyable evening and meal there. We look forward to going again and soon! great place to take friends for dinner."}
{"text":"I've been here a few times and at first it was amazing.  Food was delicious, service was fast, and the bar was quick.  However, after the first visit things went down hill.  I'm a sucker for a good clambake and if there is one in the area, I'm going to end up trying it.  I've been to their clambake for the past three years and I can say I won't be back for a 4th.  The quality of the food was poor and the quantity felt like it was for a kids menu.  The view on the patio is nice during the summer months but not when your waitress forgets your out there.  I would really like to see Coppertop return to its former glory, but I'll wait till other try it out before I return."}
{"text":"I have had hit and miss experiences with restaurants at golf courses over the years. I have been to some that are over priced and fairly bland. I have been to others that are actually pretty darn good. The Coppertop fits in the second category. The waitresses were a little confused as to who took which table but were always quick to bring drinks or check in. I ended up getting chips instead of the fries I ordered. When they said chips I was picturing a bag of lays, but the chips were home made. While they made a mistake with my order I was glad they did, the chips were fantastic. I got the \"Shroom Burger\" which was juicy and well prepared. When I end up in Strongsville again I will be stopping here again."}
{"text":"Never disappointed here.  Having eyed my crab stuffed flounder during our last visit, my wife ordered it this time.  In an effort to justify ordering a bowl of lobster bisque, I got the chop salad with grilled shrimp. Both seafood dishes were correctly cooked and flavorful.  The bisque was flavorful as well, but heads up....they process the lobster so no tasty chunks of lobster are to be found floating about hence I must confess disappointment on that note."}
