{"text":"Very disappointing experience.  The lady beside us ordered the Ahi Tuna Salad with no feta cheese.  The waitress wrote it down and told the chef.  The order came out wrong and the manager refused to correct the situation.  The service was good,  the food was average.  If you want a burger and a beer this is your place."}
{"text":"Food was so-so. Looked good but not that flavorful. What's with the soccer tents outside? The owners could create a nicer atmosphere with a nice awning. It makes the place look like a dive."}
{"text":"Decided to visit on a week night, walked in and wasn't greeted by the hostess for about 5 minutes. Was told there was a thirty minute wait (no one waiting with 2 empty tables in sight), so I asked about bar seating and was told \"It's first come first serve so I don't know\". Decided to go somewhere else with that bad of service at the beginning, was really hoping for better."}
{"text":"Food was awful. Waitress was very nice but overwhelmed and they didn't send help until it was too late. It's waaaay over priced for quality, I've had better Steak at Denny's. Beer decent"}
{"text":"Beer selection: A Food: C+ Location: B- Service: C-  The waitress smoking near the front door, beside the no smoking sign, should have been a warning. Unfortunately, we didn't trust our instincts.  We followed the hostess down a a narrow hallway, and nearly crashed into an oncoming server as we rounded the corner. We were seated at a table near the bar, and our server greeted us promptly. They have a good selection of craft beers, so I wanted to try something new, as did my friends. The server mixed up our beers, and we had to sort them out via taste tests.  The menus and the decor both seemed hurried and incomplete. The food selection was decent for bar food. We started with a macaroni bite appetizer, which was delicious. I ordered a steak, cooked medium, and my friend ordered a burger with extra mayo, and his wife ordered a chicken sandwich, with no tomato. The food came out in about 20 mins, and was all messed up. My medium steak was beyond well-done, and practically charred; my friend's \"extra mayo\" burger had no mayo, and his wife's \"no tomato\" chicken sandwich had plenty of tomatoes.  The server came by shortly, and did her best to make things right. She took my steak back, and I had a new, properly cooked, one about 15 minutes later. It was ok, but certainly not on-par with Longhorn or Logans. The corn on the cob, however, was wonderful! Strangely enough, I had to ask for butter, as it wasn't served with any.  The staff, and the establishment overall, seems very disorganized and unpolished. I think the place is fairly new, and I imagine that the wrinkles will be ironed out in time, given proper attention by management."}
{"text":"Horrible Service.   We arrived around 3pm today (Saturday).  Sat at the window table at the end of the bar.  Ashlynn was our waitress.  There was only one other table of 6 in the room being waited on by another girl, who we wish we had.  Ashlynn took our order brought our drinks and brought our food.   Then she disappeared.   We had to walk up to the bar and ask for refills on our drinks to the misery of the unpleasant bartender who had to help us.  Then we sat for 30 minutes with dirty plates (baskets), and glasses all over the table while waiting for our check.  Still no Ashlynn after 45 minutes we asked miss miserable bartender for our bill, paid, no tip obviously, and left.  As we were walking out, who do we see hanging out at the hostess stand BSing with all her friends...  wait for it...  Ashlynn!  WTF???  We told her she forgot about us and her answer was that \"she was on n a break\"  Again WTF???  A 45 minute brwak when you have 1 table at 330 in the afternoon and the place isn't even busy?  Worst service ever.  Burgers were way overcooked.  Buns were stale, Mac  And Cheese sandwich was cold and disgusting.   I will never be back.  Good luck.  Y'all will need it!"}
{"text":"We tried this place.  They didn't have half of what we ordered it was hot inside only one high chair in the place staff was nice. The manager was no where to be found. So we just left.  Would not recommend this place to someone who is traveling.  Don't waste your time."}
{"text":"Worse food I have ever eaten or rather tried to eat in my life.  The cheesy potato soup looked and tasted like watered down cheese whiz.  The tuna pasta was inedible.  The chicken salad was tasteless as were the fries.  The ketchup I tried to put on my fries to give them some flavor was sour.  Save your money and your stomach and don't eat here under and circumstances."}
{"text":"We loved our waitress. The two beers we tried were great, and the burgers were good.  Why did we not stay longer and enjoy another beer? No atmosphere. Inside , the weird Christmas-like decorations need to go. We sat outside since it was a lovely night. We sat under the kind of tents we use for yard sales, no music, and the metal seats( no cushions) are terribly uncomfortable. Please, please, please invest in some thick cushions, decent umbrellas, some big pots of plants, and a sound system. Also, to make life a little easier for the wait staff, fix your doors so they can push in either direction. They had a hard time when their hands were full. I would love to see you last."}
{"text":"Had the fish n chips, besides the paper thin fillets the oil was old and cold.... Honesty the salad was the only thing worth eating. The Buffalo chicken was a just cooked and covered in BBQ sauce. Soft fries way too salty. Not worth the $40 tab...."}
{"text":"The bartenders were the best part of the visit.  The service was spot on.  They had a great selection of craft beers.  They have flights, but they weren't on the menu, so I'm glad I asked.   Both bartenders were friendly, knowlegeable, and chatted with patrons.  They got an extra star for the service alone.  I wasn't crazy about the food.  The avocado eggrolls weren't good.  It was more like quac and a piece of mozzarella, but there was an overpowering spice in the eggrolls.  I couldn't tell if it was thyme or oregano, but it completely overpowered the avocado and didn't go well with the other flavors.  I also tried the Troy pizza.  The flavors don't meld well, despite what it says on the menu and the pizza crust was more like cracker crust.  It was dull and didn't have any flavor of its own."}
{"text":"Fantastic service! Super fast service. Really delicious and great beers on tap. Got the BLT and sweet potato fries. Fabulous."}
{"text":"A heads-up for anyone planning to go here.  They were found guilty of refilling expensive liquor brands with inferior substitutes then selling them to the public (as if it were the more-expensive brands).  You can find proof of the violation by going to the NC Alcohol Beverage Control website, hover over, \"Legal\", then click on, \"Meeting Reports.\"  Look at the Summary for August, 2017.  They were fined $3500 for the infraction.  Think about what that says."}
{"text":"Great service, great food, great beer!! Order the burger with bacon and peanut butter and the spinach dip you won't regret it!!"}
{"text":"Mediocre. Took over 30 minutes for an appetizer in the bar. Boneless wings is just a cut up breast. Entire experience was off."}
{"text":"Excited to see an ale house on this side of town. Unfortunately my first visit was not great. I love beer but I don't care for super hoppy IPA's or beers that are so weird they don't even taste like beers.  Out of 23 beers on the list, the only one that I would drink was the Yeungling. Very frustrating. I would love to find a place that focuses on great tasting well crafted beers and not just the strangest, hoppiest thing they can find. They have like 16 IPA's and pale ales, but not one decent Amber ale, Brown ale, Irish Red, European lager, or Bock. They had one each of the first three but they were so weird they were undrinkable. Bar tender was nice and the app was a little fishy but OK."}
{"text":"The pictures on the website are more interesting than the actual food.  The waitress was sweet but the kitchen sabotaged her.  They were changing the menu. However, they hadn't ACTUALLY changed the menu, so one of us had to re-order twice.  Re-order after having given her original order.  Twice.     We enjoyed each other's company but our evening wasn't enhanced by our dining experience.  No intention of ever going back."}
{"text":"The only reason I'm giving two stars is for the excellent service we received, and the beer was cold. I don't know how long this joint has been open, but if they don't get the kitchen straight, it's not gonna matter. I just wrote a review on the Bonfire grill, and we didn't even eat there. That's another story.        This is where we went after the debacle at the Bonfire. We chose another local spot that looked promising since they had a room immediately available to seat our large party on a Saturday night. We were very thankful for that. Of the orders, we received the following. Salads were excellent!! Good cold and fresh.  Fried pickles- greasy, battered too wet so the coating wouldn't stick to the pickle. Pickles tasted good but a poor preparation.  Burgers-most were medium rare to rare and cold. Definitely not what you want from a frozen burger patty. Most of them were returned and replaced with chicken fingers. Oh, and don't serve nacho cheese as beer cheese dipping sauce....what a joke.  Ribeye steak- actually not too bad. Needed seasoning and all three we ordered were vastly different in size. Maybe selfish of me, but when my steak is not the same or equal to the guy across the table from me, I'm not happy.  Mac and cheese- how can you screw that up right? Well...serve it on the kids menu with Nacho cheese as the cheese instead of normal cheese. That's a fail....no one ate the mac and cheese and it was returned.   Fish and chips- definitely not beer battered, but coated with some sort of breading, not like any fish and chips I've ever seen. Even though it wasn't traditional, the fish was very good and cooked well.   The waiter and waitress did a great job and were as nice as can be with the amount of bad food that was delivered and returned. Actually the waiter only brought me beer, while she dealt with the kitchen issues.  Possible we give them another shot if they get the bugs worked out."}
{"text":"I so wanted to really love this place, large bar area, nice outdoor space and overall - a good vibe.    Two stars because they have a great local craft beer selection.   After that, it quickly goes south.     We went in at 5pm on a Saturday, there was only one other table being served.  To be fair, the Avocado and Bacon Egg Rolls were tasty and came out fast.  We ordered as the restaurant started to fill up.    We both ordered the Hot & Spicy Overload.   We had to ask for silverware.    The burgers were way over-well done.  Served luke warm.  They missed a requested swap out of cheeses on one.  The fries and onion rings were ice cold.   Just FYI - it took 40 mins to bring the plates out, so they sat, hence the coldness.  Empty ketchup, I asked for another but it never came.    No refills of water.    The servers took turns seating tables, that is a problem - the same server could have inside and outside guests.  Which apparently is not very efficient.   Our server was MIA.     So, unfortunately, this joint has a lot to do to work the kinks out if they want to survive.    I wish them all the luck.     PS - wing lovers, your out of luck.    No wings.   Strange."}
{"text":"We love this place! Amazing appetizers, creative and juicy burgers and they rotate the craft beer selection constantly! Every time I come I try 2-3 new beers I have never had, and they have a great variety of mixed drinks! The staff is friendly and knowledgeable and always treats us like vip's even when they are busy. I highly recommend copper ale house to anyone looking for great food and great drinks in a clean and friendly environment."}
{"text":"I have been to Copper Ale House about 8 times now. I am really glad that another great non corporate restaurant has come to Concord!!! They had it really going on in the beginning but the food and menu has changed for the worse.  The outdoor seating is less than par with the odd collapsing canopies.  I really want this place to get it together.  The beer is great."}
{"text":"I had the beast burger and it was was hands down the best burger I have had in a long time! Nothing negative I can say about this place... I think I found my new favorite burger and beer place!"}
{"text":"Copper Ale is my new go-to spot! Don't believe the negative reviews....people can be so critical and it's not always fair but that's life I guess...u cannot go wrong here! I've had all their burgers (awesome), wraps, salads, steaks, beers and this is the new hot spot in the area! Try the waffle waffle sweet potato fries-sweet potato waffle fries dipped in waffle batter wha?!?! Not to mention they rotate taps weekly...Great food/drinks at a reasonable price what more could u want? Live music/specials throughout the week too! Support a local business as well! Get away from the chain restaurants and go check out Copper! First beer on me!!!"}
{"text":"Wanted to give it a chance after The Brew went down. Service is still slow. Food still does not taste fresh. Did not get silver ware, napkins or appetizer plates. Food was warm. Fries were cooked in old  oil. I'm out."}
{"text":"Service was great even though they were really busy. The food was just okay. We had the spinach artichoke dip which was ok but seemed to be mostly cream cheese. The pita bread that came with it looked like it was cooked in oil that wasn't hot enough, too soggy and greasy. The Reuben sandwich and fries were good and they have a good selection of beer."}
{"text":"Much like many of the other reviewers, I really wanted to like this place. We had eaten once at their old location and really enjoyed it. Basically everything went wrong with this experience.   1. Server took a while to stop by and when she did we just ordered everything at once. She only took drink orders for half the table. We waited 15 minutes for the ordered drinks and then sent someone to find the server to put in the other orders.  2. We got the Avocado Bacon egg rolls as an appetizer. For $9 you get 6 huge egg rolls. Seems like a great value but it's completely unnecessary. The flavor was pretty good except they were frozen in the middle. I hate it when restaurants use frozen food.  3. Kids ordered pizza (previously frozen) and cheese burger (hockey puck). Husband ordered the Loaded Bacon Cheeseburger add onion and I ordered the Troy Built burger Med Rare (patty, grilled onion, bacon, peanut butter, American cheese). Husband's burger comes out with just sliced cheese (not melted) and bacon with onions rings (not ordered). It was missing the lettuce, tomato and onion. Server comes back with it on the side but most of the lettuce was rotten. My burger had good flavor but it seems like the burger temps are either hockey puck or moo. Mine came out as moo. I ate around the edges but couldn't eat the rest.  4. Asked twice for napkins and water before getting them.  5. Bill delivered and the onion rings that weren't ordered were charged. So we waited 10 minutes to have them removed. When we pointed it out to the server there was just an exasperated sigh before she left to go find a manager. No sorry or \"I'll take care of it\" or anything that would be considered customer service in the least.  6. Waited another 15 minutes to get the credit card run.  We didn't really get a chance to complain. There was just too much time between service to do something about anything. We just won't be back."}
{"text":"Best onion rings evah! Great staff! Great food! Will definitely be back!!   Price is comparable to similar pubs.  Quick service.  Good portions..  Well worth the price."}
{"text":"Great place with good food and a reasonable selection. Service was not an issue even though the place was busy. Would recommend for beer fans. John the bar tender is very attentive and was on the ball. If you want a cosy romantic atmosphere this is not the place.  Only gave 4 stars cause they need a better sound system for the music.  Will be here next time in town!"}
{"text":"We had a great dinner here tonight. Waitress Ayana was above and beyond. She let us taste 3 beers. The gobble gobble turkey burger was superb. Sweet potatoe fries were great. The spicy artichoke soup was very tasty. The owner was checking with all tables to see if they were happy."}
{"text":"I'm very disappointed and had high hopes. The waiteress smoking in a no smoking area. To 20mins to get a drink order and we where the only ones there. Cook came out to smoke in a no smoking area and tried to hide it. Food way over priced and not cook right. Wife ask for no cheese and she gets cheese. Wait staff needs to be retrain and ower should be on site. We will never go back. Sorry we tried it and we can get better food and at a leaser price."}
{"text":"Last night was our second time trying Copper Ale House. The first time, our food was decent but expensive. They had a $30 for $12 special on Groupon so we thought we'd give them another try. The menu has changed - a good bit cheaper but far less options. We ordered nachos, which should be the easiest thing to make, but they were awful. First they came out with almost zero chips so the kitchen remade them. Turns out they ran out of chips. Dry shredded chicken that looked like canned chicken or cat food and loaded with lettuce. They were cold and dry - no flavor. My buffalo chicken wrap had the same \"shredded chicken\" - maybe 2 ounces of meat. Nope! I sent it back. It's obvious this restaurant is about to close down because they're trying to save money and use inexpensive Sysco food products. All of the beer kegs were foamy and about tapped out. Bad experience. We won't be back."}
{"text":"Stopped in here for dinner because we had a Groupon voucher. We have been excited to try this restaurant but we were let down. There were multiple things I noticed.   1. The outdoor seating is adequate but the indoor decor is odd. With a name like Copper Ale you'd expect a modern almost Brewery feel, instead the decor was like an Italian restaurant (Tuscany/rustic vibe) with yellow and orange walls. It didn't match the theme at all.   2. The menu is just OK. 4 pages total, 2 pages of food and 2 pages of a wine & beer list. The appetizers weren't anything special cheese fries and stuff but steep at $8.99 a pop. They have a salad buffet that has the works and a soup of the day the wait staff brings out. Dinner entrees were $16+ each.   3. The food was below average, not impressed. The vegetable soup was chalky and did not have flavor. My husband ordered the blackened salmon which was $17, it was flavorless and had an overly sweet mango salsa on top. The best part of our meals was the beer and salad bar. Sad right. My house chips weren't even salted or seasoned. I have a feeling they meant for this place to be more a drinking spot but it's more below par bar food. They put some more expensive entrees on the menu but for the price they're asking we just didn't think the salmon was worth $17.   4. The hostess was sitting with what I assume was her boyfriend at a table while she was on duty. She would seat a table then go back to sit down with a gentleman at a table. Super unprofessional, but not surprising with no owner and supervisor present during dinner service.   Overall we were disappointed with the food, the beer was alright. If you stop in here get like a sandwich or a salad stay clear of the dinner entrees. We probably won't be back honestly with more competitive and better tasting restaurants nearby."}
{"text":"In town for the weekend and this place was within walking distance from our hotel so we decided to give it a whirl.  One of the Thursday specials is $2 off burgers.  I had to try the Troy Built Burger since I've never even heard of putting peanut butter on a burger.  It was great!  Good size patty with a nice smoky char.  Brioche is on point!  The sweet potato fries were nice and crispy.  Nice atmosphere and an attentive server.  Definitely deserving of 5 stars."}
