{"text":"This is a less expensive alternative to Eez. It is priced much more afford-ably for the more frequent sushi indulger's. I still love Eez but it is a bit expensive. This place is located in the plaza with Hickory Tavern. It has a cozy indoor seating area with a small sushi bar and an outdoor patio. We chose to dine outside but neglected to lather up with bug spray... yikes! We went for dinner but I think \"we\" were dinner.... still scratching!!!   Anyway, the menu is quite extensive. I had trouble figuring out what to choose with all the options in front of me. I decided on the Edamame followed by the Chicken in Garlic Sauce. I know, it's not sushi. I saw this and pulled the trigger. It was ok, I haven't had this dish since I was in NY. I think I'll stick to the place in NY. One thing is certain, I do believe a lumber jack would have trouble finishing his plate here.... Holy Cow! I think it was $8.50 for this platter of food. So if \"hot and a lot\" is your thing... this place is for you.   I didn't hate the experience I just didn't care of the dish. I will go back again to try a sushi roll, at least once.   All in all...Paul Bundy sized portions, great prices and good service.  Oh yeah, they also have daily drink specials and serve a variety of fruity Martini's and Wine. Monday is $2 domestics and $3 imports night."}
{"text":"I love this place. Great sushi. Especially since I prefer more raw sushi (not fried or covered in sauces). Their noodle dishes are also really good. The udon stir fry with pork is one of our favorites."}
{"text":"Best sushi at the lake! Get their roll of the month, it is always interesting and delicious! My favorite is the Mardi Gras and the Cherry. The owner is so personable, always ensuring you are a happy patron! Prices are great!"}
{"text":"Our party of 6 enjoyed a delightful meal from Coral Sushi last night. Our sushi choices were delicious (better than Ez Fusion) and more reasonably priced. A few in our party ordered hibachi dinners and those were fabulous ,as well. The service and atmosphere were great...a very welcoming establishment. When having a desire for sushi, this is the place we will go!!"}
{"text":"The sushi was good, prices are fair... I just don't like the sushi bar (its small) and the the restaurant's crowded setup"}
{"text":"Good sushi rolls, friendly staff, but cold and arrogant owner.  Great options in the area to feel unwelcome"}
{"text":"Wow!,we loved the food! Fresh,fresh,fresh! Our new sushi spot. Three's not a crowd platter is huge!"}
{"text":"One of many we tried in the area. The atmosphere was nice and the staff was friendly. Stopped in for some sushi. The rolls were fresh and yummy. One of the top 5 places out of the 10 in the area. We think its a little overrated by some but deffinitly worth 4 stars and you should stop by and give it a try."}
{"text":"I live about 2 miles from Coral Sushi and it is a family favorite. Whenever friends come into town, this is the place that we take them. The staff is so friendly and they always have smiles on their faces.  If you are going, you MUST get the chicken fried rice. It is a basic dish that almost everyone loves but they make it so well. It is buttery and the rice is always cooked perfectly. In regards to sushi, we love the hot lovers roll, the godzilla roll, and the caterpillar crunch roll. They are all pretty tame since our oldest child doesn't like raw seafood (or seafood in general) but the family loves them. We have tried very many dishes here and we have never had one we didn't enjoy. We encourage you to check out Coral, it is a diamond in the rough that not many people know about."}
{"text":"I will forever be a fan of this place. The owner is a sweetheart and they always accommodate my request for the Melissa's Roll. It is an old item that is no longer on the menu. A baked roll. YUMMY!! Oh and if you are drinking try the Fuji Apple infused Sake. LOVELY!!!"}
{"text":"Great service, better than average habachi chicken, nice atmosphere, California roll w salmon or tuna is fun, fair price for the quality, just don't take my favorite booth in the back!"}
{"text":"I am going to go ahead and say that the Godzilla roll is my favorite. This was my first time to Coral; I went there on a suggestion from a friend after sharing that I love sushi. I have been on a mission, as of late, to find a go-to place in the Charlotte area. Coral was wonderful and just may be the winner! The service was absolutely fabulous, the sushi was delicious, and the staff was very knowledgeable and friendly."}
{"text":"Love this place...always fresh. ..a regular stop on my circuit of good food! I can have my favorite Red curry. .The Cajun roll...everything is always really good..I love  consistent restaurants. ..and these guys always nail! Thank you.."}
{"text":"This place was horrible. The service was bad and the owner never visited our table. It was packed, and she made her rounds to EVERY table but ours! The first time, I gave the benefit of the doubt, but on the second return, it was the same bad service! She does not like minorities visiting her place of business, and I would only say this because the other minority couple that visited received the same service that we did. After I received my bill, the owner peeped around the bar to see if we were leaving so that she could hurry and seat the next guest that were coming in. I would NOT recommend this place of business to ANYONE I know, and have told all 5500 workers that work for my company. I would never wish bad on anyone, but I know when you dont treat all your customers with the same treatment, you will not stay in business long!"}
{"text":"Overall bad service.I was ignored at the table, food quality was bad, and our waitress seemed aggravated when we needed additional condiments. The seafood hot and sour soup was good, but the chicken lettuce wraps were terrible, and the rolls available on the lunch menu are very basic. Do not recommend."}
{"text":"Great sushi and awesome value! If you're like me, you don't want to spend a fortune on 1 roll and not be able to try another! At Coral, the prices are so reasonable and the sushi is so yummy! What a treat! We had the Coral roll, which was awesome. Order it now! So good. We also had the classic Crunchy and we threw in some Avocado rolls and California's. Hey, I'm pregnant, so what?! It was delicious and the presentation was just beautiful. This is our go-to sushi joint. Also, sign up online for their mailing list and they'll even throw in a free app or dessert. Win-win! Enjoy!"}
{"text":"LOVE the Godzilla roll!! There are tons of specialty sushi roll options and non-raw rolls, which is nice for people that don't like the raw fish idea (also a large variety of veggie only rolls).  The prices are good and there's quite a few sake and cocktail options, which is hard to find all in one place that has delicious food too.  Oh, and our server was FABULOUS. I've been having serious problems finding good customer service lately and she was hands down one of the best servers I've had since moving here. The owner also stopped by to see how everything was, she was super nice.    Coral Sush beats the pants off Sushi at the Lake. I wish the building was bigger and had a bar (not just the sushi bar)."}
{"text":"Best sushi in the Lake Norman area.  Try the Summer Roll."}
{"text":"Went to Coral after being invited by a sushi chef working there.  I had never eaten sushi before, believe it or not.  The chef sent out a creation of his own that he spun off of the Godzilla roll but with a different wrapper.  It was the best thing we had.  It kind of reminded me of the flavor of Bang Bang Shrimp.  We also ordered the Godzilla roll and a California roll.   My husband left there a fan of sushi and wants to go back.  We will be back but the next time I will try the other things on the menu- not sushi.  I think I am just not a sushi fan.  The kids had chicken tenders and we split a chocolate cake for dessert.  The service was wonderful- I am giving the place 4 stars because my husband now loves sushi and I was pleased with the service.  Definitely try it."}
{"text":"Really love this place!! Great sushi and affordable prices. The staff is friendly and knowledgeable. Always a great experience!"}
{"text":"Very disappointed.... Thought it would be good sushi based on reviews... We ordered tuna sushi, nigiri and sashimi. First of all, the rice had barely any, if at all, rice vinegar. So rice has no taste. It's also hard. On top of it, and it tasted like not fully cooked with some grains harder than the rest.  My rice cooker can make better sushi rice with store bought sushi vinegar than this.... Second, there is no wasabi in between the fish and rice in the nigiri. Third, the sashimi doesn't taste fresh, a strong strange after taste. Don't know if it's because it was too early in the evening (around 6 or so).... Not a pleasant experience, do not recommended nor will visit again."}
{"text":"Coral Sushi is our favorite sushi spot in Huntersville/Cornelius....we have tried them all!  From the moment you arrive until the moment you leave, the staff is friendly and attentive.  The sushi is delicious and affordable.  Some favorite must try rolls: Coral, Godzilla, Hot Lovers, Lee's, Maui Wowie, Venus"}
{"text":"We tried this tonight.   Got a firecracker sushi roll and hibachi.  Great owners.  Definitely will be back!"}
{"text":"Updating my review, coral is definitely the best sushi in the area. My husband and I frequently go to coral and it's always great. Service has gotten better and is very good! 5 stars. Head to coral now!"}
{"text":"From the beginning to the end a great experience! Fast and fresh sushi with a smile, great atmosphere and price is more than fair, I will definitely be back!!!"}
{"text":"I LOVE LOVE LOVE Coral! It is by far my favorite sushi restaurant. We eat here at least once a week.  The prices are great for the amount of food you get, we always leave stuffed. The fish is fresh and their selection of rolls is awesome. You must try the Godzilla roll, Eskimo roll and my absolute fav the Bonsai roll. MMm! I'm getting hungry now. They also have a large sake menu. Although I'm not into sake much, they do have a Fiji Apple flavored sake that i usually get. Tastes like the green apple blow pop.  The service is always on point...my glass is never empty and the food is out very quickly. The place is small, but its never too crowded and if there is a wait, it's never been more than about 5 minutes. There is also a patio area when the weather is nice."}
{"text":"This is another place that I frequent and can not figure out why I have not gotten around to writing a review.  The Crab Rangoon is, hands down, the best I have ever had!   In addition to great Crab Rangoon, every other dish I have tried has been great. My favorites: the Yellow Curry (I have heard that the Red Curry is also tasty), the Pad Thai (I've always had it with tofu and shrimp), the Quail Egg (definitely ask for it to be served Nigiri style), the Godzilla Roll (there is a reason it is their #1 seller), the Paradise Roll (for those who appreciate interesting flavor combinations), and the Dynamite Roll (my personal \"go to\").  As you can see, Coral Sushi is much more than just sushi. I would recommend trying the many available options. You will be pleasantly surprised!  Why only 4 stars? I don't enjoy eating in the restaurant. It lacks ambiance which is why I have gotten into the habit of calling my order in and taking it to go."}
{"text":"Tried going to Eez Fusion first, but there was no parking there so I came here.  The sushi was good.  And the miso soup was considerably tastier than what I get at the Japanese restaurant I frequent up home in Arlington.  Service was good.  The hostess kept my diet coke full.  I never ran out."}
{"text":"I love coral sushi. I'm from Miami, where no matter what road your on there is a sushi place. So when I moved here last year. I was eager to find a sushi place as good as my favorite one in miami. Coral is definetly it. It has awesome prices for awesome food. When I go I always get an order of edomamae, house salad with ginger dressing, and about two or three rolls... the spicy tuna roll, the godzilla, and the roll of the month.  Trust me when I say this is an awesome sushi place!"}
{"text":"So, there are some good things, the godzilla roll and a couple others, but nothing special as far as sushi places go.  I'm not racist but its kinda weird having a Mexican sushi chef."}
{"text":"This place has excellent sushi and friendly service. My brother took me here and I ordered the lunch sushi special. You pick 2 kinds of sushi and either a soup or a salad. I ended up getting the spicy tuna and the spicy crunchy roll, both of which were delicious. Their salad was a standard garden salad with ginger dressing. I would definitely go here again."}
{"text":"After reading the great reviews I decided to give this place a try. I ordered the sushi for two platter and it was by far the worst sushi ive ever had. The fish was warm and dry and did not melt in your mouth at all and the rice was not fully cooked. It was unfortunate that we spent so much money here and received low quality food. Do not recommend."}
{"text":"Sushi is very good and quite reasonable. Atmosphere is perfect. Laid back but attentive service. I go back often."}
{"text":"By far the best sushi in Mooresville! We live in Virginia and every time we come down to the lake we make it a point to eat sushi here. The staff is awesome and you cannot get fresher better prepared sushi and sushi me then this place!"}
{"text":"While attending an evening of music at the Nook Coffee Bar, we decided to try this restaurant. The Hostess was very nice and we were seated immediately as we requested outdoor seating so we could continue to listen to the music of Sandra Herreault. The waitress didn't appear to be very pleased that we were seated in front of the restaurant instead of the normal seating on the side of the restaurant. No personality, no smile. When we ordered water to drink she huffed and turned to go back in the restaurant. Since it was our first time at Coral we needed extra time to look at the menu. Again, not a happy waitress. The food was great, good flavor and ample quantity. Our meal was delivered on entre at a time, not together, and 5 minutes apart. Not a good thing.   We ordered:  Wonton soup - excellent Singapore Noodles w/chicken - excellent Hibachi chicken - excellent Waitress- poor  Kitchen timing - poor  We will visit again to give the service another chance. I expected more since there was a lot of traffic and take out orders."}
{"text":"I really  love their Godzilla roll & volcano roll.  The owner, Sandy, is as sweet as she can be & will always come by to talk to you. The servers have always been nice & pleasant.  The place isn't huge & that's ok. I've never seen it overly busy or crowded.  What is really neat is the restaurant's involvement in events. I went to her sushi making class last fall & was blown away! The price to take the class was well worth it. We got a mat (to keep), had all the ingredients to make the rolls & got to eat everything we made. I was in sushi heaven! She also has a sake tasting class; however, I'm not a sake connoisseur, so I'll pass on that class.  Prices are great, in my opinion.  I'm happy with Coral Sushi. I've only had their sushi - yes, I'm a hibachi snob. :D"}
{"text":"Disclaimer: I eat a LOT of sushi and I'm a snob.  With that being said - this place is pretty good for the price. You can get all those big fancy rolls for around $10 which is a little unheard of - especially in this area.   Also, I've only ever gotten my food take-out here so the service is something I can't attest to, and I'm sure the food only gets better when it's fresh out of the kitchen."}
{"text":"Great friendly and attentive staff..  the Caterpillar and Hot Lover rolls are good.. You should come here and don't focus on anywhere else when you need to get your Sushi On!"}
{"text":"I got the Godzilla roll and it was huge and delicious. The staff was nice, the food was great, and their prices for what they give you are super reasonable."}
{"text":"Quite simply the best sushi I've had in a long time.  And for the non-sushi crowd the Chinese was excellent as well. Everything I tasted was excellent and that is so rare nowadays!  Try it out!"}
{"text":"Good food. I didn't expect such a big serving of food but it was more than enough. I had to take half of it home, plus our appetizer.  My husband got two orders of sushi which was about half the size of my plate. I had the trio hibachi which had chicken, shrimp and steak plus rice onions and zucchini.  Our app was the crab ragoons which were pretty good. In total we paid around $44. Our waitress was extremely friendly, she wasn't rude or rushing us in any way.  We sat at the sushi bar, which the guy behind the counter kept eyeballing me (in a bad way.) every time we made eye contact he looked like he was mad we sat there.  Other than that my husband and I had a good dinner."}
{"text":"Best sushi in area!!!! Excellent service!!! I had the lunch combo C with the spicy crab roll."}
{"text":"Service was excellent and very accommodating. The happily take care of special requests. The it's better then most of the Asian restaurants I've experienced in the area. The food is served fresh and hot. I feel it deserves a 3 1/2 stars. The reason not a four is there is no atmosphere. 4 is to me a great restaurant 5 would be a perfect place. So for me 3 1/2 is a good rating. Try it you'll like it!"}
{"text":"I go to coral weekly, only because I love the lunch specials. But the service absolutely sucks, the main waitress that serves me almost every time is so rude and snappy. I called today for a pick up order and before I could finish my sentence she yelled over me \"what do you want?\" I have held back from writing a review because I love the food and lunch specials, but the service has pushed me to the line so I am finally writing the review. If you go to the restaurant you better have a lot of patience and NOT be expecting good service. Also if your order is wrong or your not happy with it don't expect a comped check or for them to fix it for you."}
{"text":"My husband & I enjoy Coral Sushi for, well, the sushi. We love that they offer a new sushi roll every month, to change things up a bit. And their soups and edamame are very good, too. But we are not fans of the hot entrees this place serves. The owner & her employees have always been very friendly & accommodating. The only thing we do not like about Coral Sushi is their limited hours open during the daytime."}
{"text":"I normally despise places that serve sushi AND Chinese food because they normally only have variations of California rolls and some mystery rolls that taste like whale cooch and soy sauce. Not this place! This place had well over 30 different unique/specialty rolls which surprised me and the place was booming. There were only about 5 empty tables.   The sushi prices are great. I had the Mardi Gras roll and the Bagel roll. The bagel roll was okay. Basically a fried Philly roll with unagi sauce. But the Mardi Gras roll was so damn on point! I loved the seasoning and sauces in it which complimented the crawfish.    My first time here was great. Why not 5 stars? The bagel roll wasn't fried well enough for me, the coating  was pully.  The service, although friendly,  wasn't organized.  3 different people took care of me after I sat down. I don't know how they feel about splitting $5 three ways but oh well. LOL"}
{"text":"I've been looking for a take out Chinese spot in Huntersville for a long time. I like my fried rice a certain way and until I found Coral Sushi, I was still traveling to the Mallard Creek area for take out. Service was good and I can't wait to try their sushi. Until then I highly recommend their fried rice and egg rolls."}
{"text":"Coral is a family owned restaurant that takes great care of their customers. It is my favorite place for sushi in the Lake Norman area. The sushi is delicious and reasonably priced. The menu has a lot of variety, which is great for people that are not sushi lovers as well. I have also purchased sushi platters for parties over the years and they are always a hit with our guests."}
{"text":"I got carry out and they gave me the wrong roll. I wouldn't have been too upset if it were still good but it's mostly just a rice ball. Not even sure what's supposed to be in this..."}
{"text":"I was craving hibachi and this place did not disappoint! I also ordered a yellow curry to go, which was delicious. My friend tried the sushi (can't remember which rolls) and also loved it."}
{"text":"Sushi is DELICIOUS!  Have eaten here for years, and it is always fresh and top of the line!  Highly reccommend!"}
{"text":"Got some takeout for lunch. I got the steamed chicken veggies and rice, and it was actually pretty good. The healthy sauce was a little too heavy on the mayo though, so I switched to soy sauce and hot sauce instead."}
{"text":"The food here is amazing! We are so happy that we found this little gem. It was actually referred by our Uber driver! Can't wait to come back and have some more veggie rolls!"}
{"text":"GREAT chinese/japanese place! My husband and I have been looking for great chinese food and we have finally found it! I started with their hibachi chicken and it was delicious! Huge portions for the price and their shrimp sauce is delicious! The spring rolls and egg rolls are great as well. My husband gets the general tso chicken and it's by far the best around."}
{"text":"STOP WITH THE FORTUNE COOKIES! If you're not a Chinese restaurant, put the fortune cookies down and find another gimmick.  Had to get that off my chest. Sorry for shouting.   This is a small pan Asian restaurant with lots of sushi, sashimi and nigiri options plus some Chinese and Southeast Asian options.  We had the California Combo (Salmon Roll, Tuna Roll, Crab Roll, Miso soup and a house salad) and the Combo \"A\" (Spicy Tuna and Salmon Avocado) and Wonton soup.  The Wonton soup was chicken broth with some wontons and green onions thrown in. The wontons tasted good, but the broth was bland. The miso soup was fine. The house salad was iceberg lettuce, shredded carrots, cucumbers and tomatoes with a thick ginger dressing - pretty sedate.   The three types of rolls in the California Combo had the same ingredients (avocado and a ton of cucumber) so they all tasted the same. The subtle tastes of the fish & crab weren't enough to overcome the cucumber domination.   The Spicy Tuna could have been spicier, but it was ok.  My husband was tempted to order the red curry, but it has corn in it and we've had soooo many bad curry experiences lately that it wasn't worth the risk.  The service was fast for us, but the lady sitting at the table next to us complained about waiting 20 minutes for Egg Drop soup to which the waiter replied, \"20 minutes? I don't think so.\" Then she walked out and said she was going elsewhere. My husband said she looked like she was late for a Zumba class. Haha. Free entertainment with lunch.   Back to the food: Everything was fine. I would come back."}
{"text":"Food was amazing. It was flavorful and fresh. Would def go back. One of my favorite places.   Meal: Sushi 5/5 General tso chicken 5/5 (spicy) Fried rice 4/5 Egg roll 5/5  Service 5/5 Atmosphere 5/5  Wonderful place. Will definitely be going back"}
{"text":"Ignore the reviews, this place was horrible and I would never recommend anyone to eat here.    Our order consisted of: spicy tuna roll, salmon nigiri, surf and turf roll, a ninja roll and a small house salad.  There was literally nothing that was good in our order, and it was so bad, we ended up throwing it away.  Even the salad was tragic, with iceberg lettuce, shaved carrots and a horrible dressing they call \"Ginger dressing\"."}
{"text":"The BEST sushi in the area by far!    Great experience every time.  We have even introduced some of our new to sushi friends and they are now hooked.  If you want a place that will keep you coming back Coral is it.  My favorite rolls are the ultimate, coral and hot lovers...yum!  Go you will love it!!!!"}
{"text":"So the hubs and I were building a new computer and needed some quick parts at the Office Depot and saw this place from across the parking lot. I was tired of our regular boring neighborhood sushi spot (I won't name it here) but I said hey why not. No crowd and I think there were six people in the place including us. That usually is great for me because I hate when a restaurant gets in a rush to bang out orders. Anyway the menu was pretty good. I was just glad that there were more rolls on it that just a few boring variations of cream cheese and salmon. The selection is pretty good, the coconut shrimp that I normally avoid like the plague was very good. That chef was either having a A+ day or they have the formula right. We got four rolls, Speedy Gonzales was good but not hot enough for the hubs. I had Deep Sea and a Jenny's they were pretty darn good for a first run of this place (can't remember what the four one was but it was ok). The staff was cool a little disjointed but they got everything right and to the right table, so that is a plus. I am a fan so far, much better than just the run of the mill sushi/hibachi places."}
{"text":"Food is good, service is decent at best but nothing to really complain about. They just don't go above or beyond but I do have to say their sushi is always fresh tasting"}
{"text":"We love Coral Sushi! They have great lunch specials and amazing wanton soup! I also love their spring rolls!"}
{"text":"I received this scathing email from Bob J in response to my review of Coral Sushi. Clearly, he is friends w/Coral Sushi. I have cut/pasted in it's entirety. This alone will force me to NEVER, EVER return or provide positive word of mouth to friends.  First of all, I want to say, \"you ought to be ashamed\". Why do I say this? Well, I too am a dog lover and visited Coral for their dog days effort. I had a fantastic time and, like you, greatly appreciated how the owners at Coral went out of their way to do this for the dogs. With that said, although I was glad to see that you gave them kudos for this in your recent review, I was amazed by what else you had to say. I will not belabor the issue by arguing with each point. That would be silly. To each his own, but for you to take such a public shot at a local small business owner that invited you to their establishment for the purpose of helping the dogs, is honestly outrageous and completely classless. Don't get me wrong, i'm all for folks giving their opinion, but in this case, you would have been well advised to keep your, albeit, \"fine-tuned tasting trap\" shut. Do you really think that it was wise of you to mix your desire to give your opinion with an off-handed thanks in this case? I think any clear thinking person with any sort of class would know better. What is really interesting though, is I kept wondering after I read your review, how could it have been that bad? I have eaten at Coral over 100 times and have never had an experience like this, so I decided to do a little research. I decided to see what sort of reviews you had written in the past, especially about other Sushi establishments. Well, what do you know? You wrote a rave review for the closest competitor in the region, Sushi at the Lake. It turns out that you are a die hard fan of 6 years! Well, I am sure that Coral's arrival to the area has taken a bite out of their business in the last year. I also am relatively sure that you would be aware of that, being that you fancy yourself a local critic and you are likely close to the owners there. Well, at any rate, I do not have a beef with you being an avid supporter of your friends place. I love Coral Sushi, and I tell everyone I know. That is fine and acceptable behavior. What I do not do is go on Yelp and seek to threaten a small business owners livlihood, like the pp that own Sushi at the Lake, just because I like Coral more. That would be petty and rediculous on my part. In my opinion, this is what you have done and to make matters worse, what you have done is made far more embarassing by the fact that you were there because you were invited to help them to help the dogs. I don't know what else to say, but \"Shame on you\". BTW, I have been in Coral since you wrote your \"Review\" and one of the other patrons had seen what you wrote and was also very bothered by it. I can only hope that neither the owners of Coral nor the folks at Great Dane Friends have seen this. I am sure that they would be quite disappointed."}
{"text":"This is good sushi.......the place is nice and laid out well with a good corner spot in Birkdale and the outdoor seating is great this time of year.  Sushi menu is very good and the pricing is reasonable, but not affordable for the bigger roles.    A good date place, but regular eating might become an expensive habit."}
{"text":"Poor food quality, poor service, poor management, over priced, and overall a dismal sushi experience. I have been looking for a replacement sushi restaurant since Sushi at the lake burned down. Summary... this place is a big disappointment."}
{"text":"We started going here when we moved to Huntersville.  It's always one of our first priorities to find a sushi place.  We loved it from the get-go.  It's a small place, but enough tables and a sushi bar.  TVs to watch a game, a bar to enjoy a drink and outdoor seating for nice nights.  They have a full menu that includes many non-sushi items such as hibachi, noodle dishes, bento boxes and desserts.    Our favorite is the Two's Company or Three's NOT a Crowd.  Plenty of food, you will not leave hungry.  We took a Japanese business associate in town from Tokyo, he said it was outstanding and very traditional food.    Sign up for their email coupons."}
{"text":"They were closed when I went here.  I really wanted to eat here but I had to make other plans.  I will update this review past the obvious.  Being closed from 3:30 to 5:00 PM is strange."}
{"text":"I think this has the best sushi in the area. Try the volcano or Chicago roll. The red tuna is some of the best I've had. Always a great experience. You should definitely give this place a shot!"}
{"text":"Yuck... go across the street to Eez.  Prices are expenisve for the lack of atmosphere in the restaurant and quality of the food.  Skip it..."}
{"text":"This place serves sushi that is so boring, its worst than conveyor belt sushi places. This is like supermarket sushi.    The fish was dry, the nigiri was packed so hard you can break a window with it.."}
{"text":"I am very impressed with the quality of their sushi. I have had most of the sushi in the Huntersville/Cornelius area and this wins hands down. I love the environment and I am glad it is only five minutes away from my home. I think I might be addicted..well done!"}
{"text":"Love this place! Only can speak for their sushi because I haven't tried anything here but that. I usually get their lunch sushi and their combos are not only great, they are cheap! Especially for the amount of food you get! I have only gotten takeout here as well. Not trying to jinx myself... But, they have never messed up my to-go order or left anything out. They always give you plenty of soy sauce and it's nice that they give you a cup for your soy sauce and wasabi mix."}
{"text":"Contrary to present review, Coral Sushi is excellent with children or not.  It is family oriented."}
{"text":"A favorite place for rolls.  I've tried so many of them, and they're all good.  Some favorites: Godzilla, Dynamite, Hot Lovers, Bangkok"}
{"text":"I've been here numerous times and have subsequently dropped my rating, because I've been disappointed more times than not.    Let's start with the good -  1) The lunch prices are good and the sushi is fresh. The maki rolls are also larger than what you get at most other sushi restaurants.  I like the spicy salmon rolls (they add something crunchy to the salmon..yum) and shrimp tempura rolls (with added cream cheese). They have a great selection of combos for lunch, too. 2) Service is also very good and your meal will arrive pretty quickly.   Now the bad - 1) The specialty rolls are not worth the price.  The $12 seafood festival roll uses FAKE crab, and is topped with a sauce that tastes like watered-down miracle whip.  I was so disgusted when I got this, I couldn't eat more than one bite.  2) Their shrimp lettuce wraps have very little shrimp for the cost (7.95). 3) They play ridiculous pop music in the dining room, which seems so out of place! 4) Their gourmet loose-leaf teas are $4 PER PERSON.  (Nowhere in the menu is this clearly stated.)  If I had any idea that the tiny pot of tea was going to cost $8 for the two of us, I most definitely would NOT have selected it."}
{"text":"I recently went to coral sushi for the first time and loved it! I usually go to Red Bowl, but I found the sushi here to be just as good. I ordered the dream roll and philly roll. It all tasted very fresh and I felt like I got alot for my money. I was very full and happy and plan to go back soon."}
{"text":"As I have been a HUGE frequenter of Coral Sushi, I would normally have given this rating a 5 star, however after my experience yesterday- I feel I need to give those who have never been a heads up.  Yesterday my boyfriend and I decided to head to Coral for a Sunday afternoon lunch around 12:30... The host was fairly short with us but I assume it was due to what SEEMED to be an understaffed afternoon? Not sure.  What we witnessed was the host offering us drinks, I ordered a glass of wine,and she let me know the server would have to get that for me, but that she would bring our waters.  18 minutes later...and I truly mean 18 minutes, the server comes over and says \" so you wanted a drink or something?\"  I told her yes, sorta chuckled, and we then ordered our food as well.  Once I saw the sushi chef finish my sushi- i watched it sit on the counter.  I had ZERO problem with the Sushi sitting on the counter for a bit, but my boyfriend was served his hot lunch, and over 5 minutes later, I had to get up myself and ask the sushi chef if that was mine, and get myself chop sticks and a soy sauce dish.  Like I said, I normally LOVE this place, but had we been new comers, we would have 100% got up and left after the 18 minute wait for a drink.   PS- we received NO apology for this careless service."}
{"text":"Very good.  Went on 7.13.14 for my birthday the next day.  Coral is a small, intimate sushi restaurant.  The food was delicious, we stuffed ourselves!  Godzilla Roll is the bomb.  Everything we got was good; extensive menu with something for everyone.  Service was very good and very friendly.  Enjoyed!"}
{"text":"Very nice place. The food was very good. The staff were very attentive. The rolls are tasty, as is the wonton soup. I think we will be going back here often."}
{"text":"Wanted a sushi fix for our 29th anniversary dinner, so after reading the good reviews here on Yelp* and a recomendation to my wife, here we are! LOVED the sushi! Tried the Godzilla and Spider rolls, eel,scallops,smelt roe,squid and whole tiny baby octopus. It was fresh, flavorful and well presented on the plate. Tried hot Sake for the first time and to me it tasted faintly like silver tequila, which was not a bad thing. Followed the meal with Molten Chocolate Lava cake served warm and moist with a liquidy chocolate center topped with vanilla ice cream and drizzled with fudge sauce YUM!! Small and cozy inside which can be a good or bad thing. A large party with small kids was seated next to us just as we were leaving and I could tell it was going to get very noisy fast but we were leaving so it did'nt matter. We would have ate outside, but a thunderstorm arrived just as we did. My wife thought the service was fine, I thought she could have been a tad more attentive, so we will just leave it at that. Over all we had a great meal and will be back to try more sushi and other menu items."}
{"text":"We were regulars here for a couple of years. The owner is not friendly and doesn't take care of the staff. There are better places in Huntersville and Cornelius."}
{"text":"I guess it's easy to see how we kept forgetting about Coral Sushi, even though we live less than five minutes away from it. Tucked in the back of a strip mall-type area it is hard to see from the road and the sign for it is pretty small. We needed a place to eat tonight and finally remembered it's back there, so we headed over to get our sushi on. They do serve Japanese noodle dishes, hibachi (not the live demonstrations though)  and \"traditional\" Chinese meals like General Tsao's chicken, but we were strictly on a mission of sushi.  The restaurant is pretty small, quiet and cozy, and does have an outdoor eating area. They keep the lights relatively low and I was annoyed to find that they placed us under a table where the light kept flickering the entire meal. The service was pretty fast though we had a confusing experience ordering the sake as the waitress couldn't figure out how to tell us how big a \"small\" fruit-infused sake was. We decided to just go with the flow and ordered a small lychee sake ($7) which ended up coming in a half size carafe, and was pretty tasty. We also ordered some edamame which came out piping hot and had just the right amount of salt on it.   We ordered three rolls to share...the Godzilla, the LKN Roll and the monthly special called the La Vida Loca. I saw a few reviews here praising the Godzilla, and the menu lists it as their best-seller, and for the price of $8 we just had to check it out. I definitely see what the hype is as it's a pretty tasty with a really nice spice to it. It consists of spicy tuna, avocado, masago, and scallions...and the whole roll is fried. The crispy, hot outside of the roll is addicting, as is the spicy sauces drizzled over the top. For eight bucks this is one heck of a roll, and one that I can see myself ordering each time I visit.  The LKN Roll ($10) had yellow tail, tuna, salmon, crab and scallops all wrapped up in soybean paper, rather than the seaweed. I kinda like the soybean wrappings since they make the roll lighter and keep everything together better, though I do miss the textural firmness of the traditional wrap. Everything worked really well together, and the mushy texture of the scallop (and it's tastiness) definitely stands out against the other participants. It's served with a light ponzu sauce that is very delicate and not very flavorful, yet adds a little something more to the whole roll.  The monthly special was the La Vida Loca roll ($10) was made up of BBQ tilapia, mango, and cucumber topped with avocado and potato straws. The contents of the roll were good and I liked the crunch that the potato straws provided. However I wasn't crazy about the sauce that was smothered on top of the roll, as it was overly mayonnaise-y and I just couldn't get around how it overpowered the general flavor of the sauce.  Coral Sushi is a really good sushi option in the Huntersville area, especially if you're tired of paying Eez's prices. The quality was right up there and with a good price and convenient location, we'll definitely be coming back."}
{"text":"I wish I could give 3 1/2 stars! Definitely not the best sushi I've had, but it's not bad for the Lake Norman area! The hostess always wears weird clothes that just seems unprofessional. The second time coming, our waitress kept taking our plates the moment we were done! I mean, basically just reaching over and stealing our plate. At the end she said \"should I get you guys anything else?\" ....no thank you! We'll probably come back because the sushi is cheaper than Eez, but it's not a date place!"}
{"text":"I was pretty disappointed today with my sushi. Haven't been in a while but it was closest to me at the time but I Have been here many times for the mediocre sushi but tonight was pretty bad. Sweet potato roll was pretty hard and tough to get through. Paradise roll was falling apart, tempura shrimp was tiny and tasted like it was cooked three days ago. On top of my meal not being very good I got charged extra for eel sauce! I always get an extra side of eel sauce but tonight was the first time I was charged extra for it. Hmmm maybe just give a little container of it instead of a big container that I will never use all of and don't piss customers off over 60 cents! This is the kind of stuff that drives customers away. Probably won't be back, better options in the area."}
