{"text":"So, so good! I went there for lunch with a large crowd from work. Ordered the herbed chicken focaccia sandwich with sweet potato tots as my side. I ate the (amazing!) tots and the salad that I didn't know would be included -- and that was all I had room for. My husband and I split the sandwich for dinner, so I basically got three meals from one menu item! Service was a little slow,but as I said it was a large work group. All my co-workers said their lunches were very good, too. I'll definitely go there again!"}
{"text":"Quite possibly delicious food, unfortunately served almost cold. Everything else is right: a sincerely friendly staff, stylish surroundings that also manage to be comfortable, and an intriguing and varied menu.    Each dish tasted like it might have been great, but nearly all arrived too cool to tell. You could have fed almost any of it to a toddler without incident. It's hard to imagine that a kitchen able to turn out such well-prepared food would put up with having it served at school cafeteria temperatures.  We didn't see as much of our server as we should have, but when he was around he proved to be very pleasant, knowledgeable and accommodating.  I'd like go back in a month or so -- there's plenty more to try. In the meantime, I hope they get their sea legs."}
{"text":"Just opened very outgoing staff really paying attention to doing things right! The few items we tried Belgian Frits, croque Monsieur, we're done well and satisfying, but the asparagas mimosa they hit a home run with that fucker!"}
{"text":"The Cheese, Fruit and Meat plate is amazing, we have it every time we go there.  Great Cocktails and craft beer selection.  Absolutely love the music in the background too.  Keep up the good work!"}
{"text":"I've been here twice and was never disappointed.    We started out by sitting on the patio.  The weather was nice and the outdoor ceiling fans made us feel more comfortable.  Our server was extremely friendly and encouraged us to take our time to look over the menu.   We wanted to try one of everything, but there was it enough time, or stomach space, for such an endeavor.  Instead, we tried the croque monsieur and the BBQ pork piccolo.  They were wonderful!    My only complaint about this place is that there are not enough customers, so I hope more people realize what a gem Corduroys is.  I encourage everyone to check it out!"}
{"text":"Was at corduroys with a friend last week and noticed they changed The menu so that you can't order a separate dish for yourself as an entrée anymore. For instance, The pork medallions with the cherry sauce is now a shared plate for two. Same with the appetizers. The only problem with ordering for two is my friend and I got the pork medallions and I love meat cooked medium, but my friend will only eat well cooked meat! For me, meat well done is dry...for our starter we had their mango guacamole with corn chips which we both loved ! I still love this place !"}
{"text":"First time here today and it was phonominal!  We shared a couple items but everything was fresh, fantastic flavors and nice sized portions. Very nice decor with a nice relaxed and comfortable vibe to it.  Definitely will be back!"}
{"text":"We were looking for a tapas bar, found this place on Yelp and thought we'd try it. Wow! We had a fabulous time. Great food...loved the Cuban cigars, a ham and cheese concoction, awesome cheese and meat plate, and luscious Mac n cheese with shrimp. Reese, our waiter, was friendly and attentive without hovering. Very relaxing atmosphere. We're a little older and not into noisy places where you have to yell to be heard. We will definitely be back!"}
{"text":"Great food and great service!  Dropped in because it is across from our hotel, and had an excellent dinner.  We had the BBQ pork sandwich and the House burger with cheese and bacon.  Both dishes were great.  Also had the amazing chocolate cake with ice cream and caramel topping.  Really excellent stuff.    Our server was Frances, who was awesome.  We really enjoyed her nice touch to a great meal.  We're only in town for a few days, but will definitely go back before we leave!  Highly recommended!"}
{"text":"Cute place with nice selection of craft cocktails and food. Great place for happy hour. I wasn't impressed with the staff. They seemed checked out and disinterested. Worth checking out."}
{"text":"Amazing appetizers- we had the artichokes, cauliflower, empanadas, Cuban cigars and chips/guacamole. Very original menu"}
{"text":"First time here to meet up friends for a surprise bday. Love the Toluca Salad. Great place for groups"}
{"text":"This place is crap. Drinks are overpriced. Half filled Martini glasses. Go anyplace but here.  Manager argued with us that drinks were full with half glasses in front of us. Sam the waiter was great,  despite the bitch of a manager and shitty drinks. But don't eat here."}
{"text":"My wife and I had lunch there and were very impressed. The food, service and atmosphere were all top notch. The bar tender was very happy to do special requests. We highly recommend it."}
{"text":"I visited this restaurant in the 10 o'clock hour on Wednesday night. We had the following:  Grains Salad - $10.95, which the menu describes as kale, barley, cabbage, carrots, mint, cilantro, peanuts, crispy leeks, sesame ponzu dressing. The barley and mint were not well distributed. The mint was only tasted in two bites. I tasted no peanuts, nor cilantro. This salad was a disappointment. Maybe they ran out of ingredients. If so, they should not have served it. I would not get this again.  Empanada (count of four) - $13.95, which the menu describes as flaky pastries, braised bbq pork, jalapeño crema. The pastries were not flaky, rather looked shiny, as though brushed with butter. The pastry portion was done nicely, however. The inner portion was a BBQ pork flavored with spices...not sure if it was allspice or cloves....the spice gave a warmth to it. I found it interesting, but not something I delighted in. I tasted no  jalapeño to the crema...disappointing. They were filling. I had been expecting Central American empanadas, and these did not taste like that to me. I don't think I would get them again, but my companion quite enjoyed them.  Figs N Bacon (count of four) - $5.95, which the menu describes as coming with sliced apples, grapes and bleu dressing. The figs were likely cut up and wrapped in bacon. They were bite-sized and piping hot. Party in your mouth. Green-skinned thinly-sliced apples and red grapes accompanied, along with crostini slices (tasted like out of a box, unfortunately), and some tiny blue-cheese crumbles in what tasted like bottled dressing (unfortunate). Even with the missteps in this dish, I would absolutely return for this item.  Dessert Special - $7.95, comprised of two chocolate cookies, vanilla ice cream, and a caramel sauce. This was recommended by our waiter. The cookies were supposed to be two different flavors, but they tasted the same. They were chocolate but lacked richness and depth. Part of a cookie was soaked in a lovely caramel sauce --and that tasted pretty darned good. The vanilla ice cream was a delight - rich, heavy, and fragrant. There were two sauces that I saw a bit of in the dish - reddish and purplish, were otherwise unremarkable (too bad). I would not get this again.  The atmosphere is quite nice (old brick walls, tin ceilings) except for some of the table-side lighting. We had to turn off both bulbs of a Mission style floor lamp as the first bulb was shining in my eyes, and the second was shining in my companion's eyes. I think a shade adjustment and/or lamp adjustment is in order. When choosing lamps, one should not just consider how it looks when walking in the room, but also how it will interact with diners.  The restaurant was relatively quiet and my companion and I engaged in lengthy conversation. It was a comfortable place to be and talk. There was some nice string music from the bar area.  I will give this restaurant another chance. I may also inquire up front if items will be served as listed on the menu (e.g., if they are out of certain herbs, etc.) I gather that this is a new restaurant. I also know that weekdays may not have the senior chefs in the kitchen. I hope that this restaurant pays a little more attention to detail. I would have posted a two-star review based on the food problems, but I found the Figs N Bacon so good... I also liked the atmosphere and the service.   They are open Tues. to Thurs. 11 a.m. until 11 p.m. and Fri. to Sat. 11 a.m. to 12 a.m., Sun. 10 a.m. to 10 p.m., and closed Mondays."}
{"text":"Great location, E-Z parking, warm friendly greeting, beautifully decorated space and friendly waiter all promised more than delivered.   We ordered bacon wrapped figs (or were they dates?)  Regardless, they were very tasty but so incredibly tiny we could hardly find them on the plate. The Cuban cigar things that were highly recommended were tasty, but not worth a second try. We shared Calamari which might have been good if they had been served when they were first made, but were barely warm by the time they got to the table. The monkfish entrée was very attractively presented, should have taken a photo, but again was barely lukewarm when it finally arrived.  The place is so nice we will give it a second chance, and we will make different menu choices, but there will have to be a huge step up in the food, otherwise there won't be a third visit."}
{"text":"We visited on a Saturday afternoon. Great service and great food. We will be back again!"}
{"text":"We have been here several times, different times of the day, seated both outside and inside and feel like I have enough information for a 360 degree review and for that, I feel a solid 4 stars are deserved.  By far, for me, brunch is my favorite meal at Corduroy with the breakfast sandwich leading my selection:  spicy bacon, over medium eggs, irish cheddar, aioli, raspberry jam, tomato, on country toast.   Wow!    My second choice is always the breakfast tacos: 4 small corn tortillas, scrambled egg, chorizo, potato, feta, fire roasted salsa, side guero beans.   The mornings and early afternoons are still comfortable enough to sit on the patio.     I love Corduroy for happy hour/dinner because their long selection of starters (or what they call \"tapas\").   Try the Cuban Cigars: 6 crispy wontons w/ ham, pulled pork, gruyere, sweet onion, pickle dijon sauce.    But the Mango Guacamole (I've ordered it twice), comes out like it has not been made fresh to order.   I believe it is made fresh in the kitchen, but both times I've ordered it, the avocado looked slightly brown which led me to believe they made it in batches.     Their list of specilaty cocktails is impressive.   I think my favorite to date is the Bubbling Hibuscus -- it tastes 'fresh' and light - perfect for the heat.   Our server was very impressive in his ability to recommend wines and describe the drinks - asking us back a list of questions regarding our preferences in order to make a recommendation.     Parking, by the way, is plentiful.  And many folks ride their bikes over from the surrounding neighborhoods.    We like the vibe.  I wanted to share one strange event we experienced in making reservations.  On a Friday night, I tried to make a reservation for four on Open Table for 7pm.  Open Table said they were full until 8pm.  I then called Corduroy to see if I could get a reservation.   They also told us they were full, but that I could try stopping by.    We took our chances and stopped by at 7pm and there was plenty of seating and we go in -- patio seating and all.   After the fact, we noted that it was First Friday so maybe Corduroy was expecting a crowd of walk-ins?   The whole experience was odd to me.      I hope your experience is as good as ours has been so far.   And, SWITCH, next door, is always a standup, consistent, option."}
{"text":"Flavorful meal in a nice atmosphere.  My husband and I had dinner there on a Saturday evening.  He had the short ribs. I had the Tikki Masala.  Both were very tasty.  I picked this restaurant based on the Yelp reviews and they were not wrong.  It's an eclectic menu and it was tough to narrow down to our choices.   Our waitress was very nice and gave us good recommendations on the meals.  The food came out pretty quick and probably each meal was enough for two people - generous portions. I'd definitely come back."}
{"text":"Looks very nice inside.  The herb chicken sandwich was good.  I wish they offered smaller tapas plates for a few bucks.  I would have liked to try a few. I think they are priced high for lunch."}
{"text":"We decided to check out this fairly new spot on our last date night. Let me start off by saying that this restaurant was absolutely beautiful inside, very hip looking with choices of booth seating or tables. The booth was huge and cozy. They also have a cute patio, but it was too hot for that.  We started with the Cuban cigars by suggestion of our waiter. They were like Cuban sandwiches in an egg roll. Very yummy! The drinks we got, however, were kinda gross. I got a cocktail called \"the rooster\"- tasted like tar; and my Mr got an old fashioned and said it was not very good, either. We still drank them bc they were expensive. For dinner I got the vegetarian curry and it was SO GOOD! It's a red curry with ordinary veggies but I loved it. My Mr got the chicken pri-pri and that was SOOOO good, too. Would for sure come back and eat here with friends again!"}
{"text":"The atmosphere is amazing, the food is a treat, and the wine and cocktails put the cherry on top. A great place to gather with friends and family while exploring down town Phoenix!"}
{"text":"Me and my friends have been coming to Corduroy since it opened and have always enjoyed it!  We were anxious to try the new menu and see if it would still be as good.  We weren't disappointed!  Ambiance is the same comfortable place but the menu has some tweaks to it.  I love the \"all day\" $6 cocktail list!!  What a great idea!  One of the things we liked about it in the past was the great retro music they played but now they play regular upbeat jazz like you would hear in any restaurant (my only disappointment)  We ordered one of the bruschetta for an appetizer and it came overflowing with toppings and tasted delicious!  We each enjoyed our entree's but not that impressed with the dessert selections so we didn't have any.  Our waitress Phyllis has waited on us several times and she is GREAT!  Very friendly and always honest with her opinions of what to suggest from the menu.    This is a great little place that hasn't yet been \"discovered\" so you can always get in right away.  I hope more people catch on to it so it doesn't go away!"}
{"text":"Ambiance was very nice. All the options sounded so good. We had BBQ empanadas and crab rolls small plates. I would recommend both dishes! Our server, John, was friendly and helpful when we had questions about items on the menu. We will definitely be back to try some of their other dishes."}
{"text":"I wanted to love this place but walked away disappointed. Saturday, date night and we were in need of a late night dinner and Corduroy came to mind. Close in proximity, serves late, and appeared to have good reviews, why not? I became slightly concerned when we pulled up and the parking lot was empty, which is strange for a weekend night in downtown Phoenix. Inside, the space was nice, dimly lit and appealing to the eye. However, it was the temperature of a meat locker so any cozy feelings brought on by low mood lighting are quickly dissolved into violent body shivers. Jaime, the gentleman who sat us, was bitchy when we asked to be moved to another table due to the table next to us having a loud valley-girl like conversation that even the strongest drinks would have made impossible to stand - like, OMG! We ordered the Cuban Cigars as appetizer, followed by Lemony Chicken and the Supatra salad. The Cuban Cigars were dry and without flavor, unless you count dripping grease as \"flavor\" Without the dip, they would have been hopeless. The Lemony Chicken was salty, and the potatoes were burned to a crisp. You can't truly mess up salad...or so I thought. Not only was the combination of flavor strange, the actual lettuce has an overpowering chlorine smell that reminded me of my swimming pool...or impending death. In my desire to survive the night, I had a couple of brave bites and tried my best to wash the flavor down with my overpriced glass of wine. All in all, this dining experience cost us $68.90, hunger pains and full body shivers. Never again."}
{"text":"Stopped in for a quick bite. Everything we tried was outstanding...the best burrata I have ever had. Great drinks and top notch, uber friendly service. Will definitely go back."}
{"text":"Great new restaurant! The cocktails were well mixed and the eat were mouth watering.  And on happy hour (4-7pm) were well priced, with great service.   Cucumber Collins was both sweet and tart with a very fresh essence. The Aviation Gin Martini had a light flavor and Watermelonade was tasty and better for sweet drink lovers.   Cuban Cigars were a delicious riff on a Cuban sandwich - the sauce was creamy with whole grain mustard and dill pickles and so delicious.   Amadora Calamari was lightly battered and jalapeños with 2 sauces. We loved both but the red sauce had a smokey bite to it that was unique and flavorful.   The fries with gravy and Gruyere was so tasty - a Poutine-esque treat.   I can't wait to go back to explore of the menu!"}
{"text":"It took me a few hours to submit this review because I lost the first draft which upset me so badly I had to go watch a no-brainer show to get over my disdain. And yes, I had to share this with you to let you see how determined I am to leave this review on this new restaurant, Corduroy.  I absolutely love the decor: Warm, modern, expensive, roomy, nothing plastic, seedy, or cheap looking. Very nicely decorated. Next, Corduroy's serves the perfect ice cold lemonade when dodging in from the triple digit temperatures - just enough tart to make you think about it!  Because this was our first visit, we took our time and cruised the menu - asking questions about dishes I and my sister certainly had never had and this was the perfect time: It was towards the end of the lunch rush, the manager was interviewing nearby so we could ask questions regarding the menu items, and it gave us opportunity to try a few appetizers.  First we're presented w/the Potato Jamon Croquettes and the Spring Onion Shrimp Toasts. The Potato Croquettes were somewhat bland for my spicy Southwestern palette but they were definitely a scrumptious delight to my sister. The Shrimp Toasts were definitely for me (with a shot of Tabasco) as my sister felt they were too 'chewy' for her taste.  Our entrees: My sister was presented with a beautifully plated Chicken Piri Piri dish and I was presented w/the Croque Monsieur Tartine. Of course, I wanted my sisters dish and she wanted mine...siblings.   The presentation of the food was absolutely magnificent. This chef wants repeat customers and he will get his wish if he continues to layout dishes like works of art, his menu remains creative, fresh, and exciting, and his creations remain tantalizing to the palette.   After enjoying ourselves here we have no doubt that our return with others is just a reservation away. It was well worth it. The waitstaff is quite enjoyable to say the least and quite professional. Enjoy! (And 'no' this review is not a paid review - I even have the receipt to prove it. LOL)"}
{"text":"We recently tried this place and had a good time. The appetizers were AMAZING. We got the fried artichokes and calamari and enjoyed both. Our cocktails were very good and they had an interesting selection. The meal was good as so was dessert. However, the stand out was definitely the appetizers.  Next time I come, I'll bring friends for drinks and appetizers and sit on the comfy couches near the window."}
{"text":"Good is just excellent!!!  Everything I've had had been great...try the sweet potato tots....it's fantastic"}
{"text":"I was looking for a venue downtown to host a small party of 10-12 people for my boyfriends birthday this past weekend. When I went into Corduroy to inquire about a space the staff seemed excited and eager to help! I spoke with the GM, Chris, and he offered me this amazing area with a retro vibe for a really reasonable rate. When we arrived for the reservation chris was extremely hospitable and personable. We ended up chatting for a bit and he had the area ready for us 15 minutes prior to our reserved time. Our bartender/ server Crowley was awesome. He checked on us frequently enough that no ones drink was ever empty as he tended an extremely busy bar prime time on a Saturday night. The craft cocktails are really great, and we love that they offer Moscow mules on tap! I will most definitely hold future parties and gatherings here. Thank you so much so such an epic time!!!!"}
{"text":"Absolutely stellar food experience. I would recommend this place highly! Great food; reasonably. No snobby tiny plates : )"}
{"text":"Met some friends for tapas and drinks on a Friday night.  The ambiance is really nice - urban hip but comfortable.  It wasn't packed even on a weekend, and the wait staff is really attentive.   The food is fairly good - the cuban cigars and bacon wrapped figs are standouts while the barbecue pork empanadas were tasty..  But fried artichokes tasted mostly of fried batter and the mango guacamole was a tad bland.  The real problems, though, are the cocktails. Instead of flavorful, the concoctions taste like kids punch mixed with alcohol. I couldn't even finish one (after trying two different ones). They really need to work on those drinks.  I would like to come back and try some of the entrees, though, as they look as though they would be pretty tasty. But I will bypass the cocktail menu next time."}
{"text":"Wine is good. Food sounds better than it actually is. Corn dogs are all breading. Egg rolls are too rich. Crab cakes are awesome. Service is wonderful."}
{"text":"I stopped by Corduroy for the first time this week, and I have to say that I'm impressed. My colleague and I shared the Crispy Cuban Cigars and the Dragon Salad, and it was fantastic!  First of all, whoever thought of taking the ingredients to a Cubano and frying them should be given a medal--and then shot. I mean, these are dangerously delicious. The coarse-ground mustard is also to die for.   Next, the Dragon salad is really tasty. I've rarely encountered dragon fruit in American cuisine, and it's very interesting and totally worth the feature. Additionally, the mango was fresh and the salad itself was well-balanced in terms of taste and of texture.  The staff was friendly and attentive, the space has been repurposed beautifully. I'd definitely return."}
{"text":"Great building, food, service and location.  Vincent totally took care of us.  Only complaint is the juicer machine in the bar is very shrill and it was being used often."}
{"text":"We stumbled upon this this amazing bar while wandering around Fremont st. Feels like a neighborhood bar. Jen provided excellent service! We made it during happy hour. $3 PBR drafts and couldn't resist the shot of Jack D (normally Jameson, but not our thing) with their homemade habanero pickle juice back are $9. They are new, come check them out. We will be back... Tomorrow!"}
{"text":"Loved the food, location, and I especially loved the cocktail list. The BEST charcuterie board I have ever had!"}
{"text":"We went in and sat at the bar. I was quickly and pleasantly surprised by the cool and calm atmosphere. Drinks were amazing: We had the bubbling hibiscus, southwest mule kick, and royal bijou. The bartender was attentive, professional, and had a wonderful personality. The menu was diverse offering many house specials (I recommend trying one of the specials!!) We had the burger special, corduroy burger, and lemony chicken. Great choice of side with the burgers! They offer several size plates which makes this a great spot to stop in for a drink and snack or a full fledge meal. Highly recommend trying this place out."}
{"text":"Food and drinks are decent, but the portion size and price for \"small/medium\" plates does not lend itself to the sampling that I enjoy at tapas style restaurants. We ordered 2 small plate appetizers, 2 medium plate appetizers, shared a dessert, and had 2 drinks. The total tab was $80, a bit pricey. My recommendation is to reduce the portion size and prices. For example, there were 4 empanadas for $12 (I believe), make it 2 for $6. The food itself was good. Asparagus was our favorite. Parking is also a bit tricky, with Switch and Durant's sharing the same lot. I found parking right away and my friend circled for 15 minutes (no street parking nearby either)."}
{"text":"Love this place. My girlfriend and I come here regularly.  The drinks are always great and the service is as well. The eclectic decor and music fit well together and there are a couple of cool surprises here. If you want to try a new drink, I highly recommend the Screaming Viking. Additionally, I love that they carry Sailor Jerry Rum. It's the only rum I'll drink and it's sometimes hard to find in bars."}
{"text":"Off to good start. Door man was nice a hell. He said there's never a cover for dancing and DJ's. I hope they keep it up. Drinks are reasonable priced as well. $3 Pabst on tap and like $8 dollar whisky. Thumbs up."}
{"text":"Great bar with dope paintings in the back and picture room! Bartenders work well! And cocktails are very interesting and unforgettable! :)"}
{"text":"I truly loved this place. The cauliflower appetizer is a must have. The service was quick, the ambiance was great, and there was no wait!! I'd definitely go back."}
{"text":"Corduroy is down the street from my office so we often grab lunch here. I've yet to try anything on the menu that wasn't delicious. Highly recommend the crispy cauliflower and sweet & sticky chicken appetizers! Since I've only been for work lunches I've yet to try their cocktails but they all sound fantastic."}
{"text":"The worst meal I have had in ages. I ordered a skyy and soda with orange bitters and they added salt to the rim? Really... It was awful. The chicken katsu was so over cooked is was dead and got stuck in my throat. The pasta was undercooked and COLD Nobody checked on us either. We will never return."}
{"text":"Great, rich, European home cooked type meals. Like my Dad makes. Along with awesome cocktails, and decent wine list. Younger business, and local downtown eclectic working professionals (aka gay guys with great taste in food and dress :) )  More dress up a bit dinning, with relaxed atmosphere and good food. Late night food as well !!!  Have been back many times."}
{"text":"We came here for lunch and it was pretty good! The food was good, we ordered the bacon board, calamari, and scallops. We also ordered two different mimosa carafes which were pretty good as well. The service was great as well; our server Dante went above and beyond."}
{"text":"Love, love, love Corduroy. I hosted a brunch Meetup here last Sunday, about 12 people. We originally had a reservation for 18. Two tables of 9 near each other. It was a Cards Against Humanity Brunch. The manager, the server, everyone was so accommodating and nice!   No one in my party ordered the same thing. Or choices for food varied from chicken and waffles, to omelettes, to steak tips and eggs, to Belgian waffles. Everything taste delicious, no compliments.  I ordered the blood orange mimosa carafe. The server said it was 2 drinks, it actually gave me 3.  No compliments there .., none at all lol  We're already planning to go back in a month or so!"}
{"text":"We came here to meet some friends. From what we got in the short time we were there is that they were a bit snooty. The customers were kinda rude. Waited I. Line to take a photo in their cool lighted room and people were crowding and breaking things. We left for next door. Wasn't too impressed with the music being played either."}
{"text":"Update. i just spoke with the GM of this joint. He agreed that the wine was shit, because they only sell \"about 5 glasses a month.\" Fine. If I were to come back I'd order a beer.  As to the 1.5 ounce pour of Bailey's (which half the amount of alcohol as any whiskey, I was informed that he had 20 years experience in the bar and restaurant  business ans was a \"sommelier\". He then told me that the staff was instructed to pour 1.5 oz of whatever they were asked for. So, if you order Chivas, it's 1.5 oz.. and if you order Bailey's, which is half the strength, its the same pour.  As I said before, we won't be back; not for the drinks nor the shitty hipster attitude that we encountered. There are far better bars on Fremont Street than this dump."}
{"text":"I'm going to have to check it out because of their mules. Moscow Mule Hells to the yeah"}
{"text":"Over the past few years this DTP spot has been a million different concepts...a local crafters retail spot, a pop up shoe and apparel store, several years of Life is Beautiful retail pop up, and a couple of bar concepts that never came to life... But finally it is Corduroy...and it rocks.  If you are lucky enough you can land a spot in the large window that opens to Fremont, sitting there is the worlds best \"people watching\" place. Seriously, the best.   The atmosphere alone should bring you in the door. The cute big orange doors.  Yea there is the cool selfie room built with small secret windows so voyeurs outside the room can watch all the action. Very cute.  The jute box has all the rock you can handle. The \"your neighbors 70's basement vibe\" is a touch dive, a touch relaxing. Walk around and check out all the fun rooms.  Homemade Moscow Mules, yummy craft beers and the classic PBR are all on tap waiting for you. HH prices for wells, mules and beers are hot and ready at 4pm.   Oh and don't forget to call your mom!"}
{"text":"We went here for brunch before departing from our mini getaway in Phoenix. This wasn't our first choice but the place next door was packed and extremely unorganized so we decided to check Corduroy out. I am SO glad that we did!   Firstly, the atmosphere is super trendy and lounge-y (just how I like places, if you're following my reviews). All of the decor just worked with the place. The service upon entering was attentive and nice as well. We were greeted promptly and seated with a very minimal wait. Why more of the people waiting next door didn't make their way over here is beyond me. They missed out!   So we were able to snag a patio seat and (if the weather is tolerable) I would suggest you do the same. It's so nice and adds to the brunch mood - if there is such a thing outside of my head, ha! Our server arrived promptly to take our drink orders - which they have PLENTY of mimosa/Bellinis options to choose from on their brunch menu. We went with the tropical pink, standard and blood orange Bellinis & mimosas... all of them were fantastic, you really can't go wrong here. Perfect Sunday early afternoon drinks!   We ordered our food and it arrived promptly as well - chicken and waffles, chicken Cesar salad, tacos of the day and lemon pesto chicken. There were NO complaints at our table and we were all actually exceptionally impressed with the quality and taste of our dishes. I cannot go too much into detail about the other's dishes but I had ordered chicken and waffles. The chicken was so light and crispy - katsu style. The waffles could have been a little less done, but it seemed to pair well with the chicken, so no complaints here. I expected the syrup but hadn't really had chicken & waffles with hot sauce as well... which added that extra spice that I love. So bravo Corduroy!   If you find yourself wanting a relaxing and delicious brunch, check out Corduroy. Not the bear, this place. :)"}
{"text":"Wonderful little place to pop in and have breakfast, lunch, or dinner. Service is fantastic and the atmosphere is very welcoming.  Great times create great memories and the Corduroy is perfect for getting life's joyful times started!"}
{"text":"Pleasantly surprised! Location was awesome, parking was easy, Kari was excellent with her recommendations, and they have a good happy hour with some awesome appetizers.  My new place to kick it downtown!"}
{"text":"Cocktails are out of this world, and the tapas all have amazing flavor. The spices are really the stars!"}
{"text":"Great drinks and awesome service. Jamie the bartender is a master of his craft. This place is great on its way awesome!"}
{"text":"We randomly tried this restaurant based on Yelp reviews and have to say it was worth doing.  We would definitely come back and bring people with us.  The service was impeccable,  the quality excellent and the atmosphere perfect.  We really enjoyed our experience.  We had the Cuban Cigars and BBQ Empanadas for appetizers,  the Grains n Green Kale salad, and Chicken Piri Piri, along with the Apple Carrot Cake. Everything was unique and perfectly blended.  Definitely coming back. The chicken dish was spicy so make sure you like foods with a bite.  The Apple Carrot cake was more like an Apple Spice so don't be expecting carrot cake. We were not disappointed in anything.  The service was very welcoming,  relaxing,  and just plain enjoyable!"}
{"text":"Do NOT go here!!. U will get your ass kicked by 3 people (bouncers) If u are to drunk. Which is what i thought we did in Vegas!? My Son was Manhandled out very aggressively,so was behind bouncer and pulled on him to let go of my son.I was walking out and i said something smartass to bouncer and he pushed me...(I am female) and on my way out!! Not staying .. I pushed him back and next thing you knw I was body slammed to the ground , put in a choke hold and ganged up by 3 people. I couldnt breathe and kept tapping him to let him knw this. He didnt care. I seriously thought i was gona die. If I was the owner of this establishment I would train my staff Better on how to deal with drunks.you do not aggrivate them and manhandle them out the door!! I was a happy drunk,causing no problems. Maybe an embarrasment to myself a lil,but wasnt causing any problems. These guys are seriously messed up in the head to do this to a woman.I am sitting in ER now to see if my ribs are fractured as I am having problems breathing. It is not worth going here. Had fun everywhere else before that bar. Bartenders were nice. But Bouncers need sum schooling.. They are itching for fights. Very TWlight Zone at this place. Hope the bouncer with beard gets his KARma!"}
{"text":"The Pancetta Fries were great. Good size and great flavor.  I got the Corduroy Salad with Katsu Chicken. The salad and chicken portions were a good size but the chicken was rubbery and salad wasn't dressed enough. It was replaced with grilled chicken which I felt was better but had a burnt taste.  Good service though."}
{"text":"We went in for happy hour while waiting for a table at Le Thai down the street.  (Which was not worth the wait but anywho). So we met the cute bartender Stephanie and she gave us a little taste of the house  made Moscow mules which were quite good!  Which for happy hour were $8.00. Ok so a little spendy in a town that wants to give away alcohol so you gamble more but this is a bar so go for it!  Then we also ordered a Bombay sapphire martini. Which I guess a martini is considered a double but it was the tiniest glass and not worthy of a double and the bill was $32 plus tip for 3 drinks...not much of a happy hour if you ask me. But the bar is cute and Stephanie was very friendly...so you decide."}
{"text":"I just loved this little bar downtown! What a great new addition. The space itself is quite small, however they have multiple rooms to hang out in. The main bar has the coolest back drop, with a water wall that changes color throughout the night. The cocktail menu had quite a few options that were specialty cocktails I normally don't see while bar hopping Fremont.  The bartenders are engaging and knowledgeable, one even explained to our group how and where mescal is made as a mescal shot came with one of our drinks we ordered!  The décor and ambience dark and dim with a steam punk vibe in the hallway connecting the back room. The back room is decorated with artwork that glows in the dark with a black light, very trippy. They have the greatest little room for a photo opportunity, which I personally thing is the staple for this bar and what's made it so well known. The music was def my favorite part, a good mix of old and new music, mostly alternative rock from the 2000s.  Our group will def be stopping in here when we are downtown from now on!"}
{"text":"I asked the waitress what on the menu was gluten free and she asserted that anything on the menu could be gluten free.  We ordered a chicken dish that the server suggested as a gluten free option along with a salad, to which We added chicken. The server suggested against adding the chicken to the salad because of our other chicken dish.   We received the chicken dish which looked like it was covered in a sauce thickened by flour so we asked her to double check to see if there was gluten in this dish to which she rolled her eyes. She came back and admitted there was indeed flour in the sauce, asking us what else we would want to order since we could not eat the chicken dish.   The people who could eat the chicken dish ate what they could, but more than half of the chicken plate remained (as we picked this dish for the celiac dining with us). When the server returned to clear our table, she did not ask if we wanted a box and returned with our full check."}
{"text":"Tried to meet some friends for a Sunday brunch/lunch at Postino's up the street, but it was too crowded, so they suggested Corduroy.  We had an awesome lunch - the salads were spectacular and the ambience was great - not to mention attentive and pleasant service.  We chose to eat indoors, but saw a full crowd at the outdoor seating area.  Would love to come back and try some more items on the menu, but the first time was a definite hit."}
{"text":"So,  I've come here for HH and brunch and have really liked it.  The interior is really nice with comfortable seating, a lot of attention to original detail,  and great noise dampening, which I greatly appreciate  The menu is diverse and our brunch was really yummy.  The place encourages lingering and the staff is attentive.  I was happy they were able to make recommendations with confidence. I think this place is continuing to establish its identity and have some suggestions: Continue refining your menu to present the things you do well.  Asparagus with egg?  Yes!!  Poutine? Not so much.  Waffles?  Yes, please!! Continue working on ambiance.  Perhaps some jazz would go nicely with the setting. I wish you the very best, Corduroy, and will be back to see you soon"}
{"text":"Love this vibe!  As a local I haven't been down town in a while and stopped into this new joint.  Guys at the front door were cool, awesome throwback rock alternative vibe, drinks are spectacular, MUST try the Moscow mule!  Fresh ingredients, I loved it!  Finally Vegas dt is getting some cool little places!"}
{"text":"Dinner was good, service was good. Night ruined by a cockroach crawling on my cousin during her birthday dinner. Was a quick way to waste a $60 evening.  Staff apologetic, but insisted it happens all the time. Gross! Been to a lot of restaurants in central Phoenix and never have we had a cockroach crawling on us in a booth. \"Staff said they just come through the walls.\" No compensation was offered for our dinner at the time, but after we called later a 50$ gift card was offered. We left immediately after the cockroach incident, lost her appetite ruined her evening."}
{"text":"Great food and service. Jared was an outstanding bartender. He still learning, so he is a little slow making the drinks, but he puts a lot of effort on it, and the drinks cane up perfect.  Try the empanadas and Cuban cigars. Delicious!!"}
{"text":"Literally one of the best bars I have been to in Las Vegas. Chris the gm is absolutely amazing!!! One of the sweetest guys ever. The bar tenders are great and let me say the pickle juice shot is AWESOME! The mules are awesome. Such a great place for locals. Love it!"}
{"text":"Great experience!  My wife and I went to Corduroy during the happy hour. All the cocktails I had were well made and a twist on a classic. We had the mango guacamole and Cuban cigars as appetizers- both recommended. I had the AZ burger which is a very vertical meal.  A little hard to eat due to the size but all the flavors worked well together. My wife had the garlic sticky chicken which was great, reminiscent of chicken I make at home. Our server Phyllis was great and we had constant refills on the water and cocktails ordered quickly. Very nice for a date night!"}
{"text":"Nicely decorated restaurant. The food took forever to come out (want to say almost 35 minutes) and it wasn't very busy. Decent portions nothing special. I had the Katsu Chicken and my partner had the Herb Chicken sandwich. Probably won't be back."}
{"text":"Just finished dinner at Corduroys and was a little disappointed with the food.  We had the fried chicken with mash potatoes and broccolini and the broccoli I was over salted that it was inedible. We also had the Butternut Ravioli although pretty tasty the ravioli was over cooked.  We love both Corduroys and Switch but tonight was not their night."}
{"text":"This place is just fantastic.  What a great experience, from start to finish.  Our server Alek was so friendly, helpful, and quite the  snappy dresser.  Our cocktails were top-notch.  The food just killed.  We had the cuban cigars to start (delish!  just barely a hint of carmelized onion) and the mustard based ailoi with pickle bits was a perfect touch.  Our favorite was the chicken piri piri - just a bit of spice, and perfectly flavored.  Cannot wait to return!  Edit - two visits later...STILL love the place.  The sour cherry chicken foccacia - mega noms! The epitaph cocktail, smoky and smooth.  And it turns out that John, the bartender who was at Hula's for about five years, is now working here, wooooo! His signature cocktails are so well made, and his personality and wicked sense of humor are just luxardo cherries on top.  They are gonna get sick of me here... HA!"}
{"text":"Cool ass bar with a great selection of music blaring on the speakers. Awesome multi colored changing  water wall. Average prices, strong pours, eclectic crowd.  I put down two Jack N cokes ( $8.00/ pop), Vodka Tonic and a Mudslide    Dark and spacious inside with unusual semi hidden rooms with curious mood enhancing lights,,, a great place for selfie junkies.  The Corduroy bar and others nearby ( Commonwealth, The Griffin) are great options away from the bling bling of Fremont street. Ignite your curious side and take a walk on east Fremont away from downtown... and do it late night You'll be met with old relics from the past, some still in operation and others abandoned to time."}
{"text":"Loved this place. Our server was perpetually happy. My husband wasn't in love with his drink so he brought us a new one for free. My salad with goat cheese was yummy and my husband loved his fried chicken. Just a hip, dark, expertly designed, fresh, yummy food place!"}
{"text":"Definitely try the Bacon Wrapped Figs, Croquettes, and the Cheesecake for dessert! You won't be disappointed! Brunch is also delicious!"}
{"text":"The menu boasted Spanish tapas and I fell for it. It was a tad it overpriced even with the happy hour menu but the food was really good and the wait staff was very friendly."}
{"text":"I really love the vibe of this cool new DTLV bar that is open Wednesday through Sunday evenings from 4 p.m. till 4 a.m. So many creative and clever touches help make this a retro paradise. There's a light feature behind the bar that reminds you of a lava lamp. There's also a selfie room equipped with a video booth with flashing lighting perfect for snapping away and updating your social media with cool content guaranteed to have your friends saying, \"Where were you at? That place looks fun!\" Grab a group of friends and enter to make your own little private dance party.   Check out the \"Call Your Mother\" phone that really works. Is your mom down with a drunk dial? Sounds a bit dangerous. I'm not that brave but use at your own risk. Or sober up a bit by ordering a Hot Pocket, then call her afterwards.  I always have a good time at Corduroy. This is a place I'll bring all my out of town visiting friends who want an \"off the strip\" and unique experience in Vegas. You just know in advance that they'd like it and you'll have good times. I'm almost scared to write this review and get the word out because this place is so awesome! I can see it becoming way too happening and crowded once people become aware of its existence. Oh well... Can't help but spread the gospel. Must provide my endorsement."}
{"text":"Decided to give this place a try with the misses for date night and we were both very happy we did!  We shared some sweet potato tots that were crisp and delicious and smoky paprika hummus that came with veggies, pita, and crostini to dip to start.  The hummus was a nice sized portion and it had a very unique smoky taste we both enjoyed immensely.    For dinner I had mussels in white whine, butter, and garlic sauce with tomatoes and pancetta.  It also come work toast points to sop up the delicious garlicky broth.  The muscles were very fresh and tender.  Close to if not the best I've had in AZ.  Along with that I ordered the bacon wrapped mission figs that came with apples and grapes.  Perfect pairing with the crispy salty bacon and the sweet figs and fruit.  I would definitely order both again!  The Vegan :) had a corduroy salad that was chock full of tons of veggies, nuts, and legumes with a lemony vinegarette.  Rave reviews were given for the salad as well.    The service was tentative and the gentleman that helped us were very quick and extremely pleasant.    Beautiful old decor with exposed brick and stamped tin ceiling.  Warm atmosphere and quite relaxing.    All in all it was a fantastic meal with exceptional service and we were both very happy with the entire experience.  We will be back!  Support local and give them a try.  With so many options on the menu in varying size plates and snacks you are sure to find something you like."}
{"text":"I've been here once before and truly enjoy the atmosphere.   While I wasn't here tonight to eat, I did try the Cuban Cigars which were so delightful. The wontons were crowded with melt-in-your-mouth meat and the gruyere cheese adds a creaminess that makes this appetizer one to enjoy.  I ordered a drink that was not on their menu, a vodka collins very light on the simple syrup. The drink was too sweet and when I ordered the second I specifically asked for my drink to have less simple and to be tart. Unfortunately, that did not happen.  The service was slow. We waited for our drinks on more than one conditions and waited for a long while for our checks. I will give kudos to the waiter for separating our checks at the end, especially since we did not tell him ahead of time that we wanted split checks. I also have to give him props for being super cheery and nice.   I hate giving three stars, but my drink not being to my liking twice and having to wait for my drinks and the check, warrant the lower review. I am not sure if I will be back after this experience."}
{"text":"Great dive bar in a great location. Has a very cool and mellow vibe. Bartenders can make some damn good, reasonably priced drinks. Their specialty is the Moscow Mule. Already made and ready to serve. One of the best on Fremont Street."}
{"text":"Please try to get a server named Christina. She's a doll and will make your experience fabulous. This is my 3rd time being severed by her at Corduroy and will always come back b'c of her. Try the Croque Monsieur"}
{"text":"A friend and I tried corduroy after work on a friday. I got a red wine flight of malbec, tempranillo,  and one other I can't remember. All delicious. My friend tried the bees knees. She enjoyed it but liked the bees knees at Clever Koi better. We ordered the trout brushetta.  Amazing.  We also shared the lemon pesto chicken. It tasted like a frozen lean cuisine meal to me. Weird texture on chicken and weird gravy like sauce. I'm still giving a high rating because I enjoyed everything else and I just know next time to not order a chicken dish. Give it a try. I am also looking forward to trying their brunch."}
{"text":"My husband and I keep going back for their Sour Cherry Chicken Sandwich.  Today we stopped in for lunch - so excited since they have ALWAYS been consistent which we appreciate and the chicken on the sandwich was so thin...we could hardly see & taste it.  What a disappointment (insert sad face).  Same price - but a third of the meat.  Please, bring back your most delicious, juicy sandwich!  I want to be a fan again."}
{"text":"Great Atmosphere  Awesome service Great beer selection Prime Realestste  And playing Classic Rock (no rap BS) *****5 STARS*****"}
{"text":"From Tom Jetland, the man who brought you FEZ, Bliss ReBar, Switch, and Pizza People Pub comes a new restaurant that embraces the popular pass around concept.  While Corduroy isn't strictly speaking a tapas restaurant in the truest sense, it does offer dishes both large and small that can be shared amongst a couple of people or even large groups.  I've sampled the pass around concept before at places Tuck Shop and (the now defunct) Centurion with positive results.  Based on my first experience here it seems like Jetland's crew have hit on a winner with this concept.  Not everything was perfect during my first go around, but plenty of promise abounds.  My Mom actually wanted to grab dinner for the night at Switch next door.  After thinking about it for a second, I remembered reading some initial publications about Corduroy's opening just a few weeks prior.  Since its right next door, I figured I'd steer us here since we'd both already been to Switch.  The space occupies what was a long time Schlotzsky's Deli.  You won't find any traces of the old deli here as the space now includes a narrow bar area at the main entrance and a cozy dining area facing Central Avenue.  Additionally, there's a decent sized patio around the southeast corner of restaurant (though fair warning you'll probably get a steady whiff of the Burger King chimney across the street while you're out there).  On the whole the restaurant very much has the feel of a lounge, albeit a classy one.  We grabbed a table in the dining area since it wasn't crowded.  Much like Tom Jetland's other Downtown restaurants, the menu here is expansive with a wide variety of dishes that deliver their own take on otherwise familiar ingredients.  To start with my Mom and I decided to split a plate of their crab balls.  Basically 5 crab cakes in ball form served with arugula and a lemon aioli (which at first glance looks like yellow mustard).  I love crab cakes and this didn't disappoint and the lemon aioli was a subtle but delicious accompaniment.  I was ready to dive into one of the sandwiches on their regular menu, but my Mom was so excited after the crab balls she wanted to stick to the pass around menu....and then some.  Before I knew it, my Mom was ordering FIVE (!!!) more dishes to share just between the two of us.  Yikes.    Apologies, as I didn't get photos of all the dishes, but here's the full rundown.  First an order of their empanadas with barbecue pork and cilantro inside.  It comes 5 to a plate.  Delicious pork filling, though the shell didn't quite have the thickness or the crunch that I like with empanadas (i.e. Fuego Bistro's version).  Next, a small order of their creamed cabbage with bacon and parmesan cheese.  Fantastic texture with nice cold crunchy cabbage and the cream sauce mellowed out the sharpness of the cheese and the brininess of the bacon.  Next, an order of their Chicken Piri Piri.  Chicken with tobasco, garlic, peppers, peanuts, and scallions over a fruit flavored rice.  This was probably the most disappointing of the dishes in my opinion as the chicken tasted pretty bland despite all the seasoning and didn't contain anywhere near the spicy punch I was expecting.  Next we got the Braised Red Curry Lamb over couscous and veggies.  This was probably my favorite of all as the curry sauce they used tasted wonderful on the lamb as well as the veggies.  The lamb was cooked just right and there was no shortage of meat.  Finally, we shared one of their desserts.  Their dessert menu changes daily so its never listed, but tonight we went with their chocolate cake with ice cream and caramel sauce.  The waitress told us the caramel sauce would be what we most remember about this dessert and she was right.  The caramel sauce was pretty unreal.  Not sure what they put in it, but it was heartier than most caramel sauces I've had.  Complimented the cake perfectly too.    And no, we absolutely did not come anywhere close to finishing all that food ourselves.  Multiple take out boxes were used on this night.  Not that my Mom cared as she was basically in heaven.  Overall, a great opening impression from the food to the ambiance to the friendly staff.  Though the prices can be a little steep for some of the food (similar to FEZ and Switch), the quality and creativity is certainly good enough for me to recommend a try here.  The bar makes for a great happy hour spot and (also of great importance) there is ample parking in the lot east of the restaurant (which also serves as parking for Switch and Durant's).  If your Mom goes as nuts for this place as mine did, don't say I didn't warn you."}
{"text":"I was here in April (I know... its been 4 months. My bad.) You know, when the weather was nice!? Hard to imagine right now in our 120 degree weather this summer. BUT, I've been day dreaming about the day we sat on the patio here. And how I need to come back and do it again once it starts cooling off.   My husband and I had actually pulled in to the parking lot thinking we were going to try Switch. The Wine bar next door. But when I pulled up Yelp and looked at all the great reviews and pictures of everything. We decided Corduroy looked a bit more fun and exciting. We made an excellent decision.   To drink we got the Bubbling Hibiscus and the Blood Marry (comes with carafe, score!) and we decided to start with the CUBAN CIGARS: 6 crispy wonton spears filled with ham, pulled pork, Gruyere, sweet onions,pickle dijon sauce. Holy delightful... Crunchy on the outside, gooey on the inside. The pickle Dijon sauce to top it off was perfect. Great starter, but pretty filling. So we decided to split the CORDUROY BURGER*Harris ranch beef, Boursin cheese smoked ketchup, piquillo peppers,arugula, crispy leeks, sesame bun. Great burger. Beef was tender and the cheese was bitter but in a good way. The burger came with crispy French Fries.   Safe to say we thoroughly enjoyed ourselves and we were glad we gave this place a try. Really great vibe, food, drinks, and service. We will be back soon."}
{"text":"This place has great small plates and cocktails.  The staff are always extremely nice and welcoming."}
{"text":"We have been excited to try out Corduroy since it opened several months ago.  It is located in a convenient location north of downtown, the space is nicely decorated and was pretty lively at the bar when we arrived for a late dinner on a weeknight.  We shared the cuban cigars to start and boy, were they great and really filling too.  I enjoyed the cherry pork tenderloin with sweet potato mash, carrots and green beans and my husband enjoyed the lemony chicken...although it was pretty tart.  The prices are reasonable for the quality of the food and the portion size.  This is definitely a great addition to the Central PHX dining scene!"}
{"text":"They were super accommodating with my large party, even letting us hog the large tables in front of the bar because my friends wanted to watch basketball.  The service was kind of spotty with our party though, some people at the end of the table were complaining of being ignored by the same waitress that was super attentive to my side of the table.  There was another server helping that was kind of aggressive...  but overall I thought the service was ok.  The cheese plate was huge.  It seemed like the cheeses were kind of boring but the frills were adventurous (like pickled red peppers).  My favorite item on the board was the caramelized cashews.  The calamari was cooked perfectly.  The figs, fried cauliflower, sweet potato tots were all as expected and ho hum.  Overall I think the food is good, but not memorable or distinctive in any way.  That's fine, as long as it's consistent right?  Cocktails were pretty solid.  Their beer selection was interesting, though I think it wasn't too appealing to me.    Overall, a pretty nice time!  The food's solid, although if you're not there for happy hour it might be a little pricey for what it is.  Most of their cocktails were pretty tasty and appealing so it would be an excellent venue for such a thing.  :)"}
{"text":"Sorry - not a good choice for us tonight. I had a mushroom burger that was cooked great. However, there were so many flavors going on, the burger was undetectable. My friends all said their dishes weren't great. Drinks were tasty which is why I'm giving a 3 star. Without drinks, food taste would have been a 1 star and atmosphere a 4 star - seating was very comfortable. We love trying new places but this didn't do it for us."}
{"text":"I actually came to this place 2 days in a row. I really liked the bartending staff, atmosphere, and quality of company that arrived. People are friendly here and they have really good mules. Interesting tho that they are premixed, but made 5 gallons at a time so they're always fresh. The whiskey version is a bit sweeter while the vodka version is not. They are also heavy on  ginger so be ready for a spice."}
{"text":"The sour cherry chicken sandwich is amazing!! Absolutely worth every penny!  I would be in trouble if I lived close by!"}
{"text":"Loooooooooooved the atmosphere of this place! Best Moscow mules ever...and they are on draft. They have old school board games too. Definitely 5 stars except for the fact they are closed on Monday and Tuesday; so disappointing when you are only in town Sunday-Tuesday! Will definitely come back, bartenders are awesome!"}
{"text":"The corduroy cob bacon burger was amazing! This place looks nice and the bartender was really nice. They have $6-$10 carafes for brunch."}
{"text":"Nice little place in the Central Phx area. Great vibe. Great food! I had the Pork Sandwich and it was amaaaaazing. Really big portion size and great flavor for sure. For an appetizer, we got the Chef's Board - which was comprised of meats, cheeses, veggies and breads. It was delicious! Would definitely recommend this place to friends and we'll definitely be back. It's a great date-night spot!"}
{"text":"This place was great. Wife and I went for a date. Even brought the kiddo. Great food and atmosphere"}
{"text":"I've been coming to this place since it opened. Whether you're a tourist or a local, Corduroy drivers the perfect balance of quality drinks, amazing music, and the perfect ambiance for any night.    Chris, Tater, Jennie, Vedo, Alex, Stephanie, AJ, and everyone else here makes me feel welcome and like a god damned rockstar each and every time I visit.   This bar stepped into Downtown and demanded a place and deserves every patron that walks through its doors. Don't change a thing!!"}
{"text":"Food is pretty good.  Micheladas are bomb.  However, this place is hands down overpriced. A 15 dollar burger better be mind blowing.  But it's not."}
{"text":"Found this place on yelp during my recent visit to Vegas. The drinks are strong! The bartenders here are cool and friendly. My wife and I decided to sit by an open window where you can see people on Fremont street walk by. It's pretty cool being able to people watch while drinking.  I saw online they had a selfie room but we didn't go to the back to look for it. The bartender also told us they make their own pickles here. Regular and habenero. I'm not a pickle fan but they might be worth a try for someone who is."}
{"text":"We were on a Date Night at a Concert in Comerica Theater when I called an audible.  We had the Suite all to ourselves, with food and drinks; and I really wanted to end the evening with panache. After all, I was on a date with my Beloved (when am I not on a Date Night with her, anyway?).  Thanks to the trusty Yelp Mobile app, and YT; I was able to get some recommendations of late night eats in the area that stayed open past 10PM. I typically have two time periods wherein I wake up - 6AM and 10PM. I get alot of work done during the day, and late at night.   Unfortunately, many places her close at 9PM, or even if they close at 10PM on the weekends; their last seating is typically at 9:30PM.  Not so for Corduroy. Thanks to one Yelper's PM, we were able to grab a late night bite after the concert; and prolong the evening with conversation and continually developing our lifelong friendship with endless conversation - until the place closes!  We pulled into the parking lot, I noticed that there seemed to be a dearth of cars in the parking lot. Only Durant's next door was still hopping, and they were actually winding down.  When we walked in, we were surprised to see that except for one gentleman at one end of the bar, and another lady at the other end of the bar, all the tables were empty. We thought that this was rather unusual for a Saturday evening. Could this be indicative of how bad this place is?  Absolutely Not!  Our server was polite and engaging; and introduced us to the evening's offerings. We didn't want anything too filling, but enough to satiate any pangs of hunger with enough left overs for the following day.  We ordered the Mango Guac with Tortilla chips. And for the main course, my wife ordered the Boursin Mac & Cheese accompanied by Grilled Chicken. I ordered the Corduroy Burger with a Side Salad.  As we waited for the food to arrive, we just took the time to take in how well appointed this place is, and how it provides a great view of Central Avenue. Not that it mattered to me, since I wasn't starting at the view of the street when I had the company of my Beloved.  I am not a fan of Guacamole, but my recent acclimation to the combination of Mango and Avocado is changing my often maligned predisposition. This combination is both lively and flavorful.  When our main course arrived, my wife immediately commented on how well the chicken was prepared and grilled. And the sauce that enveloped the Mac & Cheese was heavenly. Who would've thought that Mac & Cheese could taste so good - she quipped!  The Corduroy Burger was massive and the Hamburger Meat was quite succulent. The Bacon that it came with could have been a little less overdone, however. And the mixed green salad was a great addition, but a little bit on the dry side.  All in All, our experience with this establishment made for a delightful end to a lovely evening!"}
{"text":"First time here was not a let down.   Boyfriend and I checked out this place after hearing about the great music and atmosphere.   I love that they play alternative music. It brought back nostalgia from my youth and put me in a good mood. I had a Tokyo Tea which was $13 or so. It was a perfect concoction of liquor and juice. The staff here is super chill and nice.   We wandered around the place which wasn't packed at all on a Wednesday night. The decoration and furniture is very \"instagram worthy\". There is even a light box room where you can play your own music for 5 mins and take all the pictures and videos you want (with your own device).   I definitely will be back with friends. I enjoyed my visit."}
{"text":"My family and I have been on a brunch kick.  Hands down best brunch for the money....the quality of the food was awesome.  I had the Croquet Madame, my daughter had the waffle and my husband had the steak and eggs.  All great choices and just good.  Definitely coming back."}
{"text":"This place seriously has the best music! Reasonable prices, nice ambiance, zero complaints!!!"}
{"text":"Phoenix finally has a tapas restaurant!  We went at 6PM on Tuesday night.  Their happy hour is 4-6:30PM and it's definitely worth it.  Cuban Cigars - excellent.  (ham, cheese, carmelized onions in a wonton wrapper) Dates wrapped in bacon - awesome. Pulled Pork Empanads -- fantastic. Croquettes - fantastic. Sweet potato tots - perfect balance of sweet and salty. Veal meatballs - yum.  Just yum.  Interesting house cocktails - very toothsome.  Our server was very polite, friendly and well-trained."}
{"text":"LOVED Corduroy! We tried it out for the first time on NYE. I haven't come across really any tapas places in Phoenix, and this one is located in a good spot.   Our server was great and very attentive. We had made reservations ahead of time because it was NYE, but it was not even that busy.   We had the bacon wrapped mission figs which were probably my favorite. Everything about them was perfect, even the blue cheese sauce that they come with.   BBQ Pork empanadas and the Cuban cigars were very delicious!   Mango guacamole and the tacos of the days were great as well! Warmer chips for the guacamole would have been better.   Drinks were just like I like them, STRONG.   Will definitely be back, especially to try their brunch."}
{"text":"100th review!   We sold our sweet friend a townhouse across the street from here, so we have been wanting to get in and check the Corduroy out!   Ambiance: Win. The build out here is beautiful. There is no doubt that it's a really stylish place to hang out. My only quarrel here is the music; they were playing music from a box in a corner, and it would have just been cooler if the place was actually wired for it.  Service: Excellent! We were seated immediately, greeted by all the servers along the way, and our waitress was just wonderful. She was knowledgable about the menu and was always paying attention to our water glasses and the table.  Food: I got the croque madam with sweet potato Tots. The bechemelle was perfectly executed, and the farm bread with just chewy enough to hold it all down. I loved the big pieces of ham, and topping it with an over medium egg was perfect.   Great wine list, would love to check out the weekend brunch. Would certainly come again, but the menu was very large and the dishes eclectic, so it actually took a while to figure out what to choose."}
{"text":"Wow, this placed sucked. Here's why:  1. Service. I asked for salad without dairy (I can't digest it). \"No problem!\" My salad is drenched in cheese. Nice; thanks. My husband's order was also hugely incorrect. Great work, guys.    2. Actual food: The skinny french fries taste as if they're three days old. They are not worth eating. I had to throw them in the trash. (The best fries in the Valley, in my opinion, are those at Bitter & Twisted.) The pirri pirri chicken dish was watery and, frankly, awful. The \"sauce\" tasted like dishwater. So disappointing. The sauce ruined the rice (and the chicken). I have no idea how the salad tastes, however, because I couldn't eat it; it was smothered in the dairy they told me they'd leave off.   Bottom line: The food stinks, and the servers are thoughtless and prone to mistakes. If you can eat somewhere else, do that, and if you have food allergies, definitely go elsewhere!"}
{"text":"This is my favorite local place.  Amazing food and service to match.  The inspirational menue has a great twist on several of your favorites from the burger to the chicken amd waffles.  My mom loves the chef."}
{"text":"Undecided between 4 and 5 stars and need another visit to decide.  Beautiful decor that lacks Corduroy and very professional service.   Corduroy is a Spanish Global Style Tapas House sort of.    Everything we had was DELICIOUS!  We shared some crispy cauliflower. It came with a lemony aioli. We also shared the Corduroy Salad and the Chicken Piri Piri. The salad and the piri piri were really very good. The salad was very detailed with about 13 ingredients and was dressed with preserved lemon champagne dressing. It was an adventure of taste and textures. The piri piri was made with seared moist flavorful white meat chicken in a spicy but not TOO spicy tabasco sauce and was served over citrus rice and was just delicious.  This place just opened last week and they are still tinkering with the menu.  Corduroy isn't in the decor and isn't worn by the servers.  Not your cheapest eats but also not the most expensive either.   Very very good could be a new favorite!  4.5 stars"}
{"text":"Nice spot with great ambiance. Wasn't overly busy on a Saturday night so we were seated instantly. The specialty cocktails were very good- not overly sweet like some spots in the area. If you go you must get the cauliflower and asparagus mimosas appetizers- so good!"}
{"text":"Our waitress was great and so was the food. We will definitely come back when in town."}
{"text":"Great spot, staff and Mules on tap. This is where I'm starting my vegas weekends from here on."}
{"text":"Alex and Stephanie had the best service/attitude  out of all the bars on Freemont! Awesome place, good vibes, recommend 100 percent!"}
{"text":"I would only give this place one star. Horrible Front Door service. I got married in vegas and this was one of the places we wanted to go to. They wouldn't let my brother-in-law in because they said he had \"athletic shorts\" on. He was wearing cargo shorts like everyone else there. So screw them. They've lost our business and we would have returned if it was any good. What right do they have to single someone out like that and use a fake excuse.   Other than that the bartenders were ok and drinks adequate enough.   UPDATE: And their only response is thanks for feedback.  No apology, no explanation. That place is a joke."}
{"text":"I was happy to see another restaurant coming into the neighborhood and still wanted to try it even after hearing mediocre reviews from friends that tried it.  While the interior  was very trendy and comfortable, I do have to say the food that I tried was extremely disappointing.  Our table sampled 5 different tapas dishes and I really could say that they lacked flavor......all were kind of bland.  I ordered the lemony chicken and it was such a bitter sauce accompanied with undercooked potatoes.  It was pretty horrible.  Phoenix has so many great restaurants and it's a shame that such a great space is wasted with mediocre (at best) food.  It's new so maybe they have to work out their issues, but I won't be back unless I start hearing great reviews from friends that go there."}
{"text":"As an 80s baby, the vibe here was super inviting and comfy. The cocktail I ordered was super tasty and it too sweet - thanks to Stephanie's excellent drink making skills! The DJ wove together epic glam, rock and rap anthems. Will definitely recommend this spot!"}
{"text":"Came here with co-workers to do some work and enjoy some good drinks!  This is a new place in the Fremont East district and What a good addition to the community.  I love the openness of the bar, it's decorations is like taking a trip back to the 70's & 80's! There's a lot of throwbacks as a nostalgic experience.  I literally felt like a kid seeing the old reel to reels, the Beta Max video player, even the old school mike box!  Chris is your very friendly and passionate mixologist! If you've been downtown a lot, you'll probably already know him from other past Downtown bars - it was great to see him.  Snacks are available, try the hot pickle if you can handle spicy hot food!  If you work in downtown, this is also a great coworking space to be productive and have some cocktails at the same time!  I definitely will be back again and see what new things they will add to the experience!  :)"}
{"text":"If you haven't tried this place it's an absolute must!  I went there for the first time with a foodie friend of mine and it's now one of my favorite places to eat here in the valley.  Let me start by saying the building itself is super cute, all brick and very quaint.  They have it set up very low key with warm lighting and plenty of seating.  There's also a bar area where you can sit if you like.  From the moment we walked in we received the absolute best service I've received in a very long time.  Our server knew the menu well and even made some suggestions that we took her up on.  Now for the food... O M G!!  That's all I can say!  Just top quality, fresh ingredients perfectly executed.  I had the vegetarian curry which was absolutely to die for.  Fair warning, it's super spicy but I love spice so it was right up my alley.  My friend had the scallops and I have been dreaming about them ever since.  They were on a bed of mashed potatoes with a creamy tomato sauce and crispy pancetta.  Enough said!  We also split one of their salads which was so fresh and delicious.  It had sweet heirloom tomatoes and good tomatoes are very hard to find in Phoenix.  And now for the real reason I will keep coming back.. the mac and cheese!!!  They make it with an herb boursin and it should be on your bucket list of food to try before you die.  It is one of the best things I've ever had!  In short:  - Great (AMAZING) food - Unbeatable Service - Very Fair Prices  I highly recommend this place, you just have to try it!"}
{"text":"Fantastic tradional eggs benedict on a great muffin. Sauce was plentiful and great tasting. I also loved the potato sides that I dipped in ketchup. Real nice modern metro interior. I will definitely repeat."}
{"text":"This is a great place in midtown Phoenix for a bite to eat. The Katsu Fried Chicken was delicious. This dish will bring you real joy. Sage gravy covering mashed potatoes topped with split tender Fried Chicken breast. Great atmosphere and the bar staff was awesome! Liz & John at the bar really made the dinning experience better with great service! Definitely try this place for a flavorful meal."}
{"text":"I really really wanted to love this place but it was just okay. :/ The positives: GREAT service, nice atmosphere and the figs were really good! Pretty big portions. The cauliflower, artichokes, Cuban cigars, Mac n cheese, and grains & greens salad were unremarkable."}
{"text":"My favorite bar downtown! The staff is so friendly. The prices are good. There's not a cover charge. The music is upbeat but not too loud that you can't talk to the people your with and the atmosphere is on point. They have an awesome video booth that is a must to check out when you are with a group of friends. I have been a few times so far and will continue to go downtown just to hit this bar."}
{"text":"Best Mules ever. Pinky is the best Bartender in Vegas. Stop by for the mule to cure you hangover and get back in the game. She also made me a new drink for my birthday Jameson stout chocolate bitters, sugar cube and orange peel, Amazing!!!!!!!!"}
{"text":"Ordered several small plates: the calamari, cauliflower, asparagus, cuban cigars & figs. Also had the blood orange margarita (sweet/sour & delicious).  Unfortunately the calamari was super chewy so we sent it back. Everything else was great!"}
{"text":"Yesterday my partner and I went with other friends for first time, the place was nice and clean. The servers were phenomenal!! And the menu selection was good for those who wants to eat red meat, chicken or sea food but very very little options for vegetarians (very disappointed).  Because of that I don't think I'll come back again"}
{"text":"Our server Jacob was excellent. This was my first time  and I was not impressed with the food we ordered. Mango guacamole, artichoke hearts, tacos of the day and Cuban cigars were all bland. I wanted it to be good, but we were disappointed. Even though our server Jacob did a great job, the food was expensive and tasteless, therefore I only give the restaurant two stars."}
{"text":"Best mules ever!!! What a great spot.  Go see Pinky and get great service and a wonderful drink.  Plenty of beers on tap - and did I mention the mules?  The best!!!"}
{"text":"My new favorite late night spot downtown! What a fun atmosphere. The DJ never disappoints and the drinks are reasonably priced. Since I work downtown this will be mine and my coworkers go to spot for after work drinks! They even have whiskey mules on tap. Awesome spot!"}
{"text":"I'm definitely a fan! Jamila H. picked Corduroy for her birthday dinner (ask her how old she is!) and it was a hit! The location is great, right next to two other must try restaurants (Durant's and Switch). I was a little early (as always) and found the place to be pretty dead for 8pm on a Saturday but hey I'll take it. It took a couple minutes to get seated and our table was between two other parties. I'll never understand why they do that when the restaurant is empty!   Anywho, I since I have a champagne/sparkling wine problem I ordered the Bubbly Hibiscus {brut cava sparkling wine | candied hibiscus flower | rose syrup | citrus bitters} $8 to start. I thought the dryness of the sparkling wine was balanced perfectly with the slight sweetness of the syrup. I may or may not have ordered another! The other ladies ordered the Pimm's Peach {pimm's #1 | aviation gin | lemon | cucumber | mint | izze peach soda | rocks} $8 and the Aviation Gin Martini {dripping springs gin | maraschino & violette | lemon | amareno cherry | up} for $11. I did not try their cocktails but they were happy with them.  We ordered a ton of food to share. The Corduroy Board was HUGE and included grapes, pistachios, an assortment of meats, smoked gouda, bleu cheese, and white cheddar among many other fantastic accompaniments. The Lost Cuban Cigars were good- but compared to the rest of the dishes kind of fell short. The fried cauliflower was to die for! I know most things fried taste magnificent, but this was something special! Another favorite was the asparagus mimosa. It sounds weird know- but trust me. Asparagus, lemon aioli, and an over easy egg = party in your mouth!  I ended up eating myself half to death, but wouldn't have it any other way! Cheers!"}
{"text":"Corduroy is a newbie to the Las Vegas downtown stretch, right in the heart of the action. It's got the life, personality and quality to fill the big shoes of its awesome location. It's been open for barely a few weeks yet has crawled its way to the top of my list of favorite bars in, not just downtown, but Las Vegas itself.   What stood out to me immediately, aside from the awesome light up water wall behind the bar, was the genuine service from the bartenders. And not just one but everyone of them so far. It may be that they have yet to be weathered down by the uncompromising and often irritating flow of people that commonly occupy downtown bars -but as it stands, these guys lead the way in service.   Not to mention the quality of their drinks are consistently well crafted. They have a tiki bar day with flavorful mojitos and rum drinks, a great selection of drafts including some solid IPA's (my favorite) and a cocktail list with a lot to cross off.   The ambience and interior features are also a major point in setting this place apart from the rest in the area. The initial bar area has a crazy light-up water fixture and a sweet back wall built with retro stereos  that give the place some pizazz. I'm sure live music could be accommodated well here. Upon moving further back, there are very classy little private tables with bead-type curtains that make you feel like you're at a Gatsby party. Towards the farthest back is more private areas, with a classic pacman/galaga machine (which I have the 3rd hi-score for Galaga, FYI) tables, and an area which I HOPE they begin filling with a DJ of some kind.   Best for last: the corduroy light room. I take every new person here and tell them nothing until we're already 15 minutes into a photo shoot. So much personality in this downtown hot spot. 5 stars easily earned."}
{"text":"Bartender recommended the Screaming Viking and it was pretty good. Would come here again."}
{"text":"This is now my number one bar around Fremont street. Awesome concept, great staff, plenty on the walls to keep it interesting. The kind of music that is easy to listen to for hours. As one who actually cashed a check in that space a decade or so ago, it's particularly exciting to see such a fun re-use of the space. These guys are hitting it out of the park, can't wait to visit next time!"}
{"text":"Excellent food but portions could have been bigger for the price. We got the salmon, which only had a side of rice, and the fried chicken. Both were delicious but not nearly enough so if you're really hungry be sure to order an appetizer."}
{"text":"This could have been a disaster. We started out thinking our party was going to be 10 and that jumped to13 and well into it jumped to 16. Almost all of us were some degree of late because of traffic connected to the car show up the street. we played musical chairs after we ordered. At one point one of the original 13 moved to join the last 3 in another waitresses station before her order came out. And they handled it well and still smiling. They even plated the entire party at the first table at the same time and I did not hear a single complaint of food having sat to long. Everybody that I saw cleaned their plate. My burger came exactly as I ordered it. I would certainly not mind a return trip."}
{"text":"Had some free time and saw some friends were headed to brunch so I joined in,  and glad I did. We were a bigger party, since the group I was crashing was a friend's breakfast club, at the end I think we had about 16, but the wait staff handled everything great!  I started off with a smoky spicy Bloody Mary, I don't even know why, I never order Bloody Marys, it's just not my thing but this was a great cocktail, it was spicy, smoky and smooth, why have I not ordered these sooner? Haha.  I am an eggs benedict loving fool, just can't get enough of them, and Corduroy has a few to choose from. I went the Boursin Benedict. 2 perfectly poached eggs on top of English muffins with Boursin cheese, caramelized onions & grilled tomatoes and a grain mustard hollandaise sauce, it also came with crispy potatoes.   This was a great benedict dish, I just was expecting more of a tangy flavor on the hollandaise sauce, but even that didn't disappointed, because I almost licked my bowl clean haha.   This was a great brunch and I will be back soon to try out more of their menu!"}
{"text":"if you like fried tapas, you'll like this place. we didn't try any entrees so i can't comment on that, but at least the cocktails were tasty!"}
{"text":"This place was amazing. Got great service from Vito and Alex. This place has a few hidden rooms and has a great cocktail program. Get your drinks and head to the back!"}
{"text":"I went here for a wine dinner and it was amazing. The decor is beautiful. It's kind of upscale urban. Dress code is casual.  The wait staff were friendly but with a serious attitude. Like they were all pros not kids just trying to get a paycheck.  The wine was great but the food is what stood out. Our salad course was outstanding! Who knew salad could be so exciting?!   This place is a \"must go\"."}
{"text":"So I tried hitting up this place on a Monday and it was freaking closed! Who doesn't do business on a Monday? Well, these guys don't!  So I tried to come again on another day. The entrance is on the south side of the building. A nice gentlemen sat us and you see the bar area first to the left, and the dining area is farther to the left. We decided to sit at the bar since well, there was no else there and I didn't want to walk farther. Yes, I'm lazy and I had heels on.   Our server was really attentive and gave us recommendations. We decided on the Crispy Cuban Cigars and the Corduroy Cob Bacon Burger with sweet potato tots. The crispy Cuban cigars are like wonton eggrolls with ham, pulled pork, caramelized onions, and gruyere. It came with grain mustard aioli. This I did not really enjoy. I guess being Asian, my taste buds tell me that those ingredients don't go together as an eggroll. The burger though - that burger is a damn good burger and it was a great size! Bacon, Fontina, Piquillo Peppers, Arugula, Lemon Aioli, Crispy Leeks on a Flax Bun - freaken yummy! The sweet potato tots were good too!  The bill came to about $30, which isn't a cheap meal. I would skip the Cuban Cigars and get the burger for lunch. I plan to come back for happy hour and sample other small plates!"}
{"text":"Went to Vegas with a group of girls. Stumbled upon this bar, Corduroy, and met an incredible bartender. His name was Chris Crowley. Asked him to whip us up a drink,and before our eyes he created something that we loved. Returned the next night because of the service that we received from him. Keep up the good work Chris."}
{"text":"Let me start out by saying that I have been here several times, but only for cocktails. This is one of my favorite spots for an after dinner drink because they are open late and it's not loud like the regular bars that are open even later.   Lately I have been siting on the patio, enjoying my cocktail next to the fireplace and heaters. They have music but it's not loud.   Drinks are wonderful. There is a large menu of handcrafted cocktails to try.   Inside is beautiful, plush seating, great lighting and friendly staff.   The food menu looks great, so I will give it a try soon.   Enjoy!"}
{"text":"I stayed near here in midtown Phoenix.   We decided that since it was so close and had cocktails we could walk over and have some drinks and walk back to the room.   That is the setup.  We got in and the atmosphere is upscale chic.  That is the 1 star.   We ordered the appetizer of bacon covered figs.  I ordered the AZ burger and their take on a Moscow mule with a jalapeño dash of flavor.   She ordered some tacos and a glass of wine.  If I had to say that cordoruy has a corner on flavor that flavor would be BLAND no joke.    Their food was bland.   How can you make BACON bland?  These guys figured it out.  Their food might come out of a can (the beans on the taco plate looked like it)   I am intrigued at how this place has a 4 star rating.   Must not have a lot of tastebuds to think it is good."}
{"text":"We'd been to the restaurant next door a few times and figured we'd give this a try as well.  Were not disappointed in our dinner and were impressed with the generous adult beverage pours.  Will return for a good meal any time we're downtown."}
{"text":"Great food selection, a lot of thought put into each menu item, great drink selection, and ambiance.   Traveling for work as often as I do, I often struggle to find a solid lunch spot. Corduroy provided a great balance of healthy salads and hearty sandwiches.   I have to say the grain and greens salad is probably the best all around salad I've ever had."}
{"text":"Breakfast tacos are awesome! Nice atmosphere & affordable prices. Was there for the fist time but will definitely come back again."}
{"text":"Food was really good the waitress was awesome love the ambience really can't say anything bad about the place also had great wine selection."}
{"text":"Fremont Street has many bars. I'm glad that we spent time at this one.  Corduroy seems to be a relatively new spot in the Fremont East district of Downtown Las Vegas. We may have been attracted by the colorful animated well behind the bar, but we stayed to check out of some of their craft beers on tap.  Mind you, they didn't have anything utterly groundbreaking, and a few of their taps had the mass-produced \"popular\" beers (not to mention the array of stuff for cocktails and shots which surely were also popular), but they do have some draft crafts if those are what you're into.  My friend and I just so happen to be in that crowd, so we enjoyed a couple of brews which happened to be $7 each for something in the range of 12 oz pours. My choice of Stoutello by Knee Deep Brewing Company was a nice milk stout, but instead of the promised chocolate hazelnut, I picked a light peanut flavor. I enjoyed the beer, but the marketing was misguided.  My friend picked up the Evergreen Haze by Novo Brazil. It so happens that I've had it before, and there's definitely a tropical/citrus thing going on in this American, non-hazy IPA. I enjoyed it roughly as much as the first time.  We both totally rocked out to the music. Not classic rock stuff, but the bands which we grew up on, like blink-182, Taking Back Sunday, The Killers, and Panic at the Disco (well, he may have a differing opinion there). I'm not sure if that music is on regular rotation or if it was just the preference of the DJ for Friday night / Saturday morning, but we had a blast while sitting at the windowsill and sipping on beers.  I'll definitely have Corduroy in mind should I end up on another bar crawl in Downtown Las Vegas."}
{"text":"Great place to eat, drink and be merry! You have to try the Vanilla Irish Old Fashion it will give you the complete Corduroy experience or just relax with a Modus Hoperandi, yup that's a Durango, CO IPA. Everyone is super friendly, nice and straight up outgoing. Especially Jamie whose loves Loves LOVES to have a good time as he pours amazing drinks for everyone. So glad I stopped by!!!!"}
{"text":"Check your check carefully! On the good side: surprisingly innovative menu--looks like a lot of good flavors. My meal was really good. I'd come back for the food. Negatives: The suggestive sale for wine & dessert came on a bit too strong. Once we received the check, a very long wait to get it processed. But worst of all, the prices on the check were higher than the prices on the menu. I was going to say something, but it took so long for the server to get back to us that I decided not to bother. On second thought, I checked a menu on the way out and confirmed that the prices for the entrees were $1 higher on the check than on the menu. I did say something at that point, & I'm sorry I did because it took a very long time to sort this out--a lot of hassle for $2. We're so dependent on computers that everyone is lost when they don't work right."}
{"text":"This place is awesome!!  Bartenders are very friendly and whip up some very tasty drinks.  Good comfort food and you can also order off of the food junky menu from next door which has awesome food and selection and made from scratch!!"}
{"text":"Yelp 100 Challenge - 2018  #71  What an amazing bar!  I had such a great time here and I will defiantly be back. A friend and I stopped in for a bit while waiting for another friend to get off of work. I had no expectations going here and just simply wanted to check it out. I was pretty impressed upon walking inside.  1.) I love the beautiful bar area with the purple bubble things. 2.) The DJ was playing great music. 3.) They have a photo booth.   The photo booth would have to be my favorite things about this bar. There was a guard at the door of the photo booth just making sure no one stayed in there to long and to ensure no-one cut line. The sad thing about the photo booth is that I never received my photos in my email. After taking your photos you have the option to add your email and phone number for the photos to be send; however, I never received ours."}
{"text":"I took my brother here for his birthday to try something new. Upon looking at the menu ahead of time we were super excited and looking forward to a good experience. Unfortunately, we were a bit disappointed.   At first the service was great and the ambiance was spot on. Our server was friendly and helpful, especially with the drink choices. The cocktails we ordered were pretty tasty and so was the bacon board (although perhaps a little skimpy) - no complaints there. We ordered the boursin mac & cheese with chicken and the katsu fried chicken. Mac & cheese is one of my favorite dishes and I'm rarely disappointed. However, this one was so bland and the chicken was dry as a bone. The katsu fried chicken was okay, but one of the pieces was really rubbery. So gross.  As we were wrapping up, I asked if they did anything special for birthdays and the response was, \"Sorry no, we've only been open for three weeks so we're not in a position to give anything away.\" Hmm, well, you just did. It's called my business. On top of that, I ordered the cuban cigars to go for my boyfriend. He forget to put in the order and left us hanging for about 15 minutes. When he finally came back to our table, I asked if he had put in the order and he had not. In my experience, most restaurants would take accountability and either offer a percentage off the bill or comp the dish in question, but instead he returned with my order and a new bill. On top of that, they were so rubbery and the ratio of fillings were way off.   I'm really saddened because I was hoping this would become a new favorite spot. It has a super cool vibe, but the overall experience left little to be desired."}
{"text":"When you're excited about trying a new restaurant because the menu looks so good, an evening can get a little soured when your expectations are smashed. So went our evening at Corduroy last night. There were six of us without a reservation and we were nonetheless accommodated by a less than interested, less than personable host. Once at our table, we were greeted by our server, Jacob, who would prove to be the highlight of our dining experience. Beyond Jacob, the menu items and peripheral services fell flat.  There were 4 appetizers ordered: Cuban Cigars, Cheese and Bacon Board, Paprika Hummus and Spicy Chick Peas. Cuban Cigars: the menu stated there would be 6 pieces. Pieces was right, as only 3 \"cigars\" were served, each cut in half on the diagonal. Less quantity  than expected and quite flavorless aside from the delicious aioli dipping sauce. Cheese and Bacon Board: hard, burned bacon served with a non-descipt Mozzarella-like cheese, a Bechamal-cheesy dip, burnt bread and slivered fruit and vegetable choices. Paprika Hummus: though quite tasty, it was extremely dry and grainy, which drew so many distracting and unflattering comments from around the table, it was difficult to really appreciated the flavor. Spicy Chick Peas: good flavor yet, there was a somewhat moist texture to them which created a weird sensation in your mouth. Our entrées included the Scallops and Pancetta over mashed potatoes (with added shrimp). Requested was a side of bread from a nameless server to sop up the red sauce, and only after 15 minutes when Jacob intervened, did the bread finally arrive to begin a now cold meal. Though the flavors were nice, the scallops were undercooked and had a metallic taste to them that stung the tongue. The side of bread was the same burned bread as before, which made any sopping up near impossible. Another entrée was the Boursin Mac with added Katsu Chicken. Made with a very non-mac pasta like Orecchiette, which wasn't salted while cooking, the stick together pasta barely held on to the thin Boursin sauce, which though somewhat flavorful, was just as understated as a box of mac and cheese from Fry's. The added chicken was overly deep fried, dry and flavorless. The remaining entrées were various burgers which appeared to be \"your average burger\", and a Crouque Monsieur, none of which received much more than a little aplomb.  Dessert proved to be just as weak as the entrées. Though Jacob had prepared us by letting us know that the cheesecake and Germany Chocolate cake were not house made, he couldn't have prepared us enough for the dull presentations or the lacking flavors of both. The house made cherry and port wine sauce was the only bright star of the course. Leaving the restaurant, we agreed we had enjoyed our own fellowship and the great Jacob, while lttle was said about a return visit to Corduroy. The 3 stars are due to Jacob's great service and personality."}
{"text":"Great little restaurant in mid-town/downtown Phoenix. We enjoyed a Saturday night at the bar during happy hour. Great hummus platter and good wine selection. The bartender (Jake) was very friendly and helpful in selecting a terrific wine wine (Roussane). We will definitely keep this place on the short list for future visit that will include dinner."}
{"text":"We've only visited once and just for drinks and an appetizer but the fried artichokes were awesome and the Bangkok Daisy drink was delicious- spicy but refreshing. The atmosphere was nice and the waiter had a bow tie. We won't hesitate from coming back if we're again in the area but probably won't make a drive to return."}
{"text":"Door dude will take a picture of you and your ID to enter. And keep it for who knows how long, accessible to the unknown. If you are cool with that level of privacy invasion, step on in, drinks are cold. I prob won't be back as long as this policy is in place."}
{"text":"Cool, trendy new bar in downtown Las Vegas.  The atmosphere is very relaxed and they play great music. The bar has a traditional selection of drinks as well as some house concoctions.   There is outdoor seating in the front, bar seating, and a little room with upholstered seating in the back that looks straight out of the 1970s.  Find the \"secret\" photo booth room and take some fun pictures. The lighting is amazing."}
{"text":"I love the decor here. High walls and big windows. A bit dark, but classy. We were dressed to impress in our 1930's best for brunch and Corduroy didn't know what hit 'em. We were a very large party and the servers handled it pretty well. Food came out at different times, but not terribly staggered. In the meantime, we enjoyed some tasty carafes of mimosas. My crab cake eggs benedict was so fucking amazing. The only problem I could find was that my stomach wasn't big enough.   My husband got their special of the day, which was chicken and waffles. When it came out, he was just 'eh' about it. He didn't say anything because we were part of such a big group that it would only be more trouble to talk to someone about it, so he stuck it out. The server, in her infinite wisdom, came by and apologized for the plate, saying that it was the first time the chef had it listed on their specials, so they were going to play with the recipe a little more for the next time. They didn't charge him and ALSO gave him a to-go bag of the enchiladas!! Oh my gosh. We were over the moon. Since we were going to be on the road for the rest of the day, drinking on bikes, those enchiladas made two people living out of a shopping cart very very happy. Thanks for that, Corduroy!"}
{"text":"Stephanie took care of us, great customer service! Great smile and attitude. We order mules on tap. Bulleit bourbon and Ketal one mules $6.50.  They also got pickle juice backs for your shots!!!  I'm pickle Rick, Morty!!  Has a groovy 70's feel and classic Rock. A RETRO VEGAS FEEL WITH OLD SIGNS. A MUST CHECK OUT."}
{"text":"Stopped in almost on accident for lunch. Was going to go to Switch next door but this place has a nice curb appeal. Aside from the exterior grabbing my attention with its small but modern chic patio the interior had equally aesthetically pleasing touches for my tastes. Once seated promptly we were given several menus. A specialty cocktail, brunch and regular menu. I have to say every option, whether a drink or a side dish looked interesting and tasty. Me and my guest actually took longer than usual to decide simply because so much sounded fantastic. The final choices for both of us to ultimately share were as follows: bloody Mary carafe, modus hoperandus, bacon and cheese board(custom built), Cuban cigars, breaded cauliflower, and the crab cakes eggs benedict. With out dissecting each dish I will keep it simple and say everything was superb!!!! I highly recommend this place to anyone with an adventurous palate. My one and only knock on the place is both the menu and our server say that the Cuban cigars and cauliflower are small plates. They are not. They are delicious so who cares right?!?!"}
{"text":"I just have to give this place five stars for the friendly and knowledgeable staff, great food, and the diverse selection of food. I walked in craving a salad, because the yelpers really seem to enjoy them. I found my new salad spot! The salads are huge, fresh, and unique. It's going to be hard to come here because I  want to try every single thing on the menu, but I can't wait to come back! I think it would also be a fun place for cocktails as well."}
{"text":"Uncovered this place on yelp while driving to our meeting. I must say that they have a very nice job with the decor and overall look and feel. Hip and chic ambience , their wait staff were very friendly and knowledgable. We got the Burrata and I got the green and grains salad. Mind blowing flavor and texture. The drawing was so unique that it made me want to finish and clean my salad bowl dry. The grilled chicken was so soft and tender and perfectly seasoned. Every one was very satisfied  with their food choices. A perfect restaurant in all respects. Try it to believe it."}
{"text":"Arrived at 10:55...service was FANTASTIC food was absolutely DELICIOUS!!!  Our server, Vinny, was very friendly, made great recommendations and checked on us regularly.  We ordered the Corduroy salad and Cuban Cigars.  The salad was HUGE, fresh and wonderful. This was a surprise considering the late hour. Hubby enjoyed the Cuban cigarsBoth servings were very generous. I highly recommend this restaurant and will definitely return to try more of the many good looking items on the menu."}
{"text":"This was the most amazing Moscow mule we have ever had the privilege! Equally delicious with either vodka or whiskey. Small place with a great vibe, and don't miss the bathroom!! Spend some time exploring the stall pictures. Prioritizethis one while near downtown Vegas!"}
{"text":"I came here on Valentine's Day with my best friend to celebrate her birthday (yes, ON Valentine's Day). We got there around 8pm and there were a few seats left at the end of the bar, so we grabbed a spot. Within minutes, maybe even sooner, the bartender gave us their drink specials menu and let us look it over for a bit before ordering our drinks. The bartender that served us was fantastic (Vito). My suggestion: ask for the Eloise - it is so good and it's Vito's own creation. The doormen here are also super friendly and not unapproachable like many in Vegas. We'll definitely be back!"}
{"text":"If you desire a blast-from-the-past 70s/80s experience combined with super cocktail offerings, visit this spot and stay a while. You'll feel transported to the sets of That 70s Show and Freaks and Geeks but furnished with dope booze. Chris served us a G&T and a Dalmore 15. He did an excellent job and appears enthusiastic about bartending. We'll be back to try some cocktails and say hello to Chris G, Vedo, and Alex. I'm sure they're rocking it here."}
{"text":"Corduroy was catty-corner from our Phoenix lodgings, and pleasantly surprised my wife and  me with both  tasteful decor and an excellent selection of culinary offerings ranging from appetizers and small plates to imaginative dinner entrees and desserts. The shepherd's pie was a real Irish classic, the lemony chicken lived up to its name, and the blood orange bread pudding was exquisite. Although we did not partake of  libations that evening, there was a fine selections of both wines and cocktails."}
{"text":"This place amazing!! A great environment and the staff is very welcoming. Definitely somewhere you should stop on your night downtown!"}
{"text":"What a fun and exciting place to visit!  Nice and open bar area with a beautiful water feature that changes colors and bubbles flowing through it .  Ordered 2 Moscow Mules and let me tell you, if you love ginger, you will love the bite that those drink offers.  Hits you in the back of the throat, type of kick! Wooowee!! Lol Topped with sprigs of mint...which I love also!  Make sure To get your pics in the light room in the back! Perfect photo ops  Drink were reasonably priced for the weekend. $10 a piece"}
{"text":"At happy hour the drink deal is $2 off signature cocktails. Server said well vodka cocktail would hv been $6.99 so I went with a Cucumber Collins for $6 and my friends Blood orange margarita was $7. Both very good drinks. We tried the green pork enchi which was okay but I really liked the smoked trout  bruschetta topped with micro greens and slivered almonds...very very good! Cool place to meet after work right on Central so park in the back as if going to Durants."}
{"text":"Best new find in months!  I had crispy cauliflower appetizer with unimaginably delicious dipping sauce and a sour cherry chicken sandwich with sweet potato tots.  Service was excellent, nice ambiance and a wonderful menu to select from.  Parking was easy just steps from the entrance.  Highly, highly recommend with two thumbs up!"}
{"text":"I'd like to start out by saying I had a wonderful person bring me here and the ambience was perfect. This restaurant was built in 1928 and even though it has been remodeled you can still sense the uniqueness of the building.   Service: quick and non intrusive, polite and informative, friendly and helpful   Food: really great. I had the macaroni and cheese and it was different. When I say different I mean \"great different\" the flavors were defined.   Atmosphere: jazz playing in the background and servers wearing bow ties, decorations were perfect and silver tiles on the ceiling. There is also the coolest tree on the wall.   Anyways after all that, LOVED this place and I highly recommend!!"}
{"text":"This place is great Food is awesome Spirits great Would recommend highly for a nice dining experience with friends"}
{"text":"Came here with my lady loves Taylor J and Jessica K here for the thirtieth birthday...yeah I said it. I'm not afraid anymore! Anywho the decor was contemporary American. Sleek, but not pretentious.  We decided to just indulge in some apps to avoid commitment to a certain dish. Their Corduroy board was delicious. Simple, but who doesnt love some Grade A meats and cheeses. The Phoenician Cauliflower was delightful. Light crispy breading, and a tangy mustard sauce was a slightly healthy treat. The Asparagus mimosa's citrus aioli and over easy egg really brightened up the dish. This was probably my favorite. The Cuban cigars were okay, but i fealt they were a little too greasy.  The service was alright. When we came in with cupcakes the first thing the host said is you can't eat those here...easy bro. I'll contain myself and just eat them in the alley like a crazy cupcake fiend. Our server was nice, but was a little slow in getting us more drinks. Would love to try Corduroy for HH."}
{"text":"Well a new menu has replaced the menu I remember being on the website and good to know the crispy cauliflower (9.95) is still being served. It was tasty florets covered in a crisped up cheese coating. A good size serving, but required many napkins to combat greasy fingers. What I didn't like were the dips. No creativity at all.  Desserts of apple carrot cake and cheesecake were delicious. Cheesecake is consistently a home run, the apple cake depends on who's baking. Love the caramel sauce. Wish they offered more."}
{"text":"This was probably one of my favorite dining experiences because we ordered a little of everything!.... Ok, not everything, but many things! Their version of the Cuban is really good because it has a crunchy outside. The calamari were crunchy and delicious. The empanadas scrumptious and the bacon wrapped dates really yummy. Mmmmm! I will do that all over again one day!"}
{"text":"Good first impression, and thank you for a quality late night dining experience. This restaurant is in its first opening days. The food is quite good, but not really \"tapas\" in the traditional Spanish sense. The interior is gorgeous and the patio is equally attractive. I hope the owners will become a little more creative with the wine list; it is pedantic at best...a little too careful, a little middle-of-the-road. Phoenix diners don't get late night dining yet...but what do you expect with an urban center that dies after 7 p.m.? Nonetheless this restaurant has the right idea. I hope they can relax a little and adapt the European/Spanish sense of hospitality. If they do, this could be a keeper for some time to come."}
{"text":"Small plates were 3.5 stars. We had the artichokes & mussels. Burrata salad was 4.5 stars, it was pretty good. For our main dish we got the chicken with pesto, sent it back because it was too salty. Then we got the chicken piri piri, that was about 2.5 stars. My mom thought this place was a 2 star restaurant. Our server was 5 star. The host was about a 2 star. He was not very happy when we wanted to move seats. The manager was very acomadating though. We won't be going back. I would recommend just ordering small plates & sharing them rather then ordering a main dish."}
{"text":"Terrific atmosphere....fabulous food and great service.  The corduroy burger was full of flavor and can't wait to go back and try breakfast."}
{"text":"A great place Uptown Phoenix to relax with friends. Service is spot on and friendly. You can sit back and enjoy an evening of good food and great drinks!   I love how so many of our uptown and downtown buildings are being saved and created into great destinations for food and fun. Corduroy is one of them. Built in 1928 as a grocery store. Yep, and you can still get food & drink here . . . just wonderfully updated!"}
{"text":"Everything I have ordered has been delicious! The wait staff are very professional and the atmosphere is very swanky.  I particularly enjoy their eclectic and wide ranging music, and although I've never needed a reservation yet (I guess it's a best kept secret so far), I have run into friends or acquaintances here almost every visit!!  Great spot for date night or an easy meet up where you can actually have a conversation."}
{"text":"This was the worst place to eat ordered the scallops menu said 3 received 2 salty and smelled awful, don't order the lemon pesto chicken was nothing but mush. Oh and the mango avocado guacamole was awful as well nothing but red onions and avocado The manager didn't even come over to our table to speak to us but hid in the back.  Second time eating there and last time.  My recommendation is to stay away from this place also very pricey quality of food poor."}
{"text":"Corduroy is another DTLV project bar that once again... is amazing. They're located at Fremont East in between Beauty Bar & The Griffin. My pictures don't do this place justice but they're good for a reference to my review.   It has a gorgeous backbar with a color changing lava lamp-like wall. Permanent DJ booth to keep the tunes spinning. Retro decor throughout.  If you want a little privacy for you and your party, there's secluded rooms.   There's an overflow bar in the back with additional seating. Near the overflow bar you'll find a #Selfie room that you can kick up your own jams in for 5 mins and take some pictures or a breather for yourself.    The bathrooms are spacey and clean with old retro powder soap that gives you a nostalgic feel.  In the very back of the building is a closed off smoking room with seating and an antiquey cigarette vending machine.  Drinks are decently priced and there's food options available like pot pies and hot pockets.  This place is great & there is no cover charge, YET. But I'm sure that's to change once it's popping. ):   Maybe by Corduroy only being open certain days of the week they'll be able to eliminate the possible future need for a cover charge.  All in all, go check them out. It's a great spot with bartenders who take pride in making their signature cocktails and serving them with a smile."}
{"text":"We tried Corduroy for the first time early on a Wednesday night. The restaurant was relatively empty, but I could see it being a great places for drinks and happy hour. The interior is really great. The service was excellent. The food was good, the fried cauliflower was the best I have ever had. (Seriously, don't miss the cauliflower.) The servings were more generous than most small plate places I've been.   The AZ burger was enormous and my husband really enjoyed it. I had the chef's taco plate, it was beef brisket the night we were there. Tasty, but nothing amazing.  I'll definitely be back to try more of that menu. Everything on it looks fantastic."}
{"text":"We had a blast at this place! The music was awful in a good way I felt like it was 1999-2001 and I should be at a high school reunion, but everyone there was in good spirits and rocking out. We ended up staying there a good 2 or 3 hours."}
{"text":"I went to this gem for the first time and absolutely loved it! The food was great, dessert was mouth watering and the drinks were spot on. They have a great selection, laid back vibe and friendly service. My husband and I sat at the bar and thoroughly enjoyed ourselves- we will be back!"}
{"text":"The Jolly Diner's destination tonight was Corduroy on Central Avenue.  According to the waiter the chef named the restaurant because corduroy to him or her sounded very comfortable That was the reason why. We started out with appetizers of potato croquettes and also guacamole with blue corn chips. Both were very delicious. The main courses consisted of my mother having a cup of the soup of the day which was chicken noodle with a wedge of hearty bread. My aunt had a \"MyBurger\". My sister ordered the Crab cake Burger, and I had a vegan half of salad and the vegan red curry. I can tell you everything was top-notch, everything was fresh, and this is my new go-to place for vegan red curry. It was delicious. Because of the atmosphere, the great service, and the delicious well-prepared food, the Jolly diners rated this restaurant at a 4.7 out of 5. Definitely recommend Corduroy to anyone who wants a good hearty fresh meal."}
{"text":"This bar is pretty chill and has great drinks! They're strong and made well not like most bars where they just slap something together. I had a few different ones but I can't remember the names ;) the atmosphere was fun.  They had a dj playing some old school hip hop which was a change from All the top 40 crap you hear constantly.  There's room to dance and a back area for sitting. I wanted to see the selfie room I read about on yelp but didn't get the change. Boo. Oh well maybe next time."}
{"text":"Went for a lunch meeting.  I ordered a Sour Cherry Chicken sandwich.  The chicken was slightly dry but overall very tasty.  The service was very good.  They come over often to ask if all was well and refill drinks.  The restaurant itself was clean and looked nice.  I had been here once before just for drinks."}
{"text":"I read online that Corduroy was billing itself as a rock bar, so of course I had to scope this new bar out. Located next to the Griffin, Corduroy has a prime location. There was a line to get inside, but security got everyone in before you could say Timbuktu. There wasn't a cover around 10:30PM on a Saturday night, which is always appreciated.  The backdrop of the bar is really unique. It's like a giant colorful lava lamp screen. In fact, there were quite a few unique gems to be discovered here. There were doors that opened up into little gathering rooms. As far as rock music was concerned, there was none to be had. The music was mostly 80s pop music. Disappointing, but this bar is still pretty cool.  YELP 100 CHALLENGE 2017: #31  EDIT 2: Yelp did something weird and turned my initial review (which was an accidental duplicate listing) into an \"updated review\". I don't know how to delete the first review so that it's just one review instead of two. :/   EDIT 1: Apparently there was already a Yelp page for Corduroy, so I moved my review here :)"}
{"text":"We visited this bar while on our trip for Halloween.  We started out at the bar area so we could see the large lava lamp.  We introduced ourself to the bartender, Stephanie. She was GREAT!!! From that point on she called us by name and made sure we had drinks as needed ,even though there were a lot of people  for her to serve.   Later on we moved to the window to \"people watch\" since everyone was in their costumes. The window is a great part of the bar.   If you are in the area, you should visit this bar...  it's a great place to hang out !   Thanks for your great customer service Stephanie!!!!"}
{"text":"How could you not like this place. Great and friendly service. Best of all their food... Man their food. I had the chicken and waffles. So so so good. And I got to taste one of their crab balls and that was awesome. Fantastic and flavorful. Can't wait to go back again!"}
{"text":"I came here after being dropped off at Fremont street. I wasn't sure where to go but stopped by this bar after I saw the sign that they had Moscow mule on draft. Yes you heard that right. They have a kettle one version and bullet whiskey version. Both are so fresh and amazing! They also squeeze their own ginger and fresh juice. The bartender and owner are such nice people and provide a chill atmosphere. If you're looking to get away from the edm music and go off the strip then you should come by! The mules on draft are $10 what a steal!"}
{"text":"LOVE THIS BAR! It's new, its hip, it's lively! I've literally been here every weekend for the past 3 weeks! The drinks are really great and the bartenders are super friendly! My friends and I always make sure to make this our first bar stop while on a night of bar hoping! Definitely a must go too spot! On top of that they have a really cool room in the back that's Instagram ready for a cute photo where you and your friends can blast some music and make a sick video! Please check this bar out it's all the rage for sure! It definitely a cute hip bar that downtown was very much in need of! LOVE ITTTTT!"}
{"text":"Dropped in during happy hour prior to a downtown event. I tried the green chili park enchiladas.. stacked enchiladas-very good flavor. Presentation was great with cabbage and Fresca. Decent happy hour specials ... service was attentive and helpful with suggestions .. they have a Mediterranean nut mix made on site that is quite tasty to share while waiting on food .."}
{"text":"Came here for a birthday.  I could smell the aroma coming from other people's food as I walked by their table.  It was delicious.  The 4 of us ordered different entrees and had a taste of everyone's meal.  All entrees were delicious.  Can't wait to make it back."}
{"text":"I had dinner at Corduroy and it was unimpressive.  The beef tenderloin was chewy and flavorless and it was served with watery mashed potatoes.  I think I've had more exciting food at a school cafeteria.  The cuban cigar appetizer was a bit more tasty but still left me wishing I had eaten elsewhere.  The place is decorated nicely and is in a great location.  Our waitress was friendly.  What a shame about the food."}
{"text":"I loved this place. It is located downtown on Fremont. I remember when this place dealt in check cashing, and now they deal in drinks and music from the 80/90s. The interior is fun with a bubble/lava back drop of the bar, and a wall full of speakers. If you venture down the hall you will a few other rooms for sitting, and past that a lounge area with neon painted walls... very psychiadelic.  Now onto the drinks. I have the \"sex on the beach\"/punch bag. It was tasty, but I was more sold on the packaging because the drink was served in a bag that you punch a hole through with a straw. It is exactly like the capri sun drinks that is in every kid's lunch. I hope at least. It was a pricey $12-14. I bought into the nostalgia and I am perfectly fine with that. I plan to go back for boozy bingo on Thursday nights. Fun times for this lady."}
{"text":"Just finished dinner at Corduroys and was a little disappointed with the food.  We had the fried chicken with mash potatoes and broccolini and the broccoli I was over salted that it was inedible. We also had the Butternut Ravioli although pretty tasty the ravioli was over cooked.  We love both Corduroys and Switch but tonight was not their night."}
{"text":"Great new bar in the heart of downtown Las Vegas positioned right on Fremont Street. One unique thing about Corduroy is that they have their own Moscow Mules on tap with a vodka or whiskey option."}
{"text":"Amazing hand crafted drinks, I didn't get a chance to eat anything but I will be returning. I would have given five stars but I came with a large group and it seemed to annoy the bartenders or at least the male bartender that night. Either way I'll give them another try"}
{"text":"In Phoenix for a work conference and this place came recommend by the hotel manager. Surely he did not lead me astray. The place is super causal but the ambiance and the staff are truly what make this restaurant amazing. I had the Scallops and Pancetta which were to die for! I was a little nervous about ordering this dish cause scallops are really easy to mess up but mine were perfectly seared and delicious. And to top it offer I had the most perfect cocktail: the High Ball. It was the perfect ratio of alcohol to chaser and if anyone is like me I like my cocktails to have more alcohol than mixer lol so they were spot on when making my drink. Overall the service was great and fast. My waiter was super friendly and made an awkward dinner for one waayy less awkward. If I'm ever in town again I will make a point to come here."}
{"text":"Awesome place. I had the greens and grains salad and the vinho verde. Delicious. Salad was perfectly dressed.   Decor is nice. Atmosphere has some swank to it. Service was spot on. Thanks Big John!"}
{"text":"I came here with a friend to give this new restaurant a try on a Friday night. We came for happy hour and, like this company's other restaurants (Fez, Ticoz, etc), the happy hour is nothing special. They offer a small discount on beer and wine and good prices on well cocktails, but no discount on any specialty cocktails (which is what you would want... or at least what I would want...). Food specials are equally unimpressive with only a couple dollar discount on their fairly pricy apps. We had a couple of the specialty cocktails despite their not being on special, and they were alright, but not fantastic. The play on the pimms cup was better than the sling, which was not bad, but not great. Additionally, my friend had a drink made by the bartender off the menu that was so sweet it was almost undrinkable. For food, we had the empanadas. The crust was nice and flaky, but the meat was a bit odd.... like bbq. Anyway, I would consider giving this place another shot, but it wouldn't be at the top of my list."}
{"text":"This is a LAS VEGAS bar. That would not let me in because I was wearing a LAS VEGAS Golden Knights Jersey. Not even on a peak night or weekend. Absolute garbage. Will never even try to come here ever again.  If you Support and love this city, I suggest you do the same. Disgraceful."}
{"text":"I give it a 2 for our overall experience....which was mainly due to poor service.  If it was just based on food...I'd give it a 3.  Let me start by saying....I love Switch, Fez, and Bliss Rebar, and have always had great food and service at each of those places......that made me really excited about trying this place out.  I heard a few good reviews about it, but was very disappointed when I finally tried it last night.    I made a reservation for my group of 9.  We were going to go see a play at the Phoenix Theater that night, and my normal routine includes going to Switch prior to the play.  This time, I wanted to switch it up in order to finally try Corduroy.  We got there and were seated, and our server was a very polite girl, but that's about it.  Her server skills completely lacked.  This was one of the worst dining experiences I've had.  I used to be a server, so I will give her a little bit of slack.  The one thing she did well was make sure the vases of water were always full.  I love when a server is aware of everyone's water, and she did that.  Everything else was far from being good.  It started with her taking our orders.  She went around in a circle, which is completely fine, but she did it TWICE!!!!  The first time she took our order, and then the second time she asked me \"What did you order again?\"  She hadn't even left our table to key in our order yet.....she made the second circle around the table immediately after she did the first round to initially get our order.  She shouldn't have to ask our entire table AGAIN....especially RIGHT AFTER she just took our order.    Our food took a ridiculous amount of time to come out.  We were on a tighter schedule with our time, but I allowed plenty of time.....and even had some extra time just in case.  Good thing I did, because we used every last minute, plus some, that I had allowed for dinner to get to the theater in time.  The food was descent.....nothing special.  I got the Croque Monsieur Tartine at the recommendation of our server.  It was good....but nothing amazing like she had stated.  I also asked if it was possible to order a side of the mac and cheese, because me and my boyfriend like to try the mac and cheese everywhere we go to do taste comparisons.  She said that we could do that, which was great.  Another friend ended up getting a side of mac and cheese as well, because she told us that it could only be added as a side to sandwiches.    When the food came out, we had issues with the mac and cheese.  Two of us had ordered it as a side, and one of us had ordered the actual entree.  All 3 that they brought out looked exactly the same.  The entree was significantly more expensive than the side....and they still charged our one person the entree price, when it was clearly not an entree.  At this point, my whole group was pretty irritated with how long it took to get our meals....and there was one gentleman who placed another drink order and never received the drink.  She asked if we were all on one tab, and we explained to her who was together and who was separate.  We had to tell her this at least 3 times....maybe even 4.  I was beyond frustrated, and we were running very low on time.  She brought out the checks all mixed up.....and charging full price for the one mac and cheese.  Her explanation on why they were being charged full price, was because they don't normally do sides of mac and cheese, so gave us all the same thing (but didn't charge us all the same amount).  The explanation made absolutely no sense to me.  They ended up adjusting that, which they should have, because we didn't receive the entree like what was ordered.  What bothered me even more, was the fact that she's now telling us that they don't do mac and cheese sides, when she made it well known earlier when taking our order that they could only add the mac and cheese as a side to a sandwich order.  She clearly didn't know what she was talking about.  I would have been fine without getting the side, all she had to do was say it wasn't offered.  We had to have her move a couple of items on a couple of checks, and when she came back with the revised checks, not only did she move the items we told her, but she moved several other items as well.  Since we had no time left, we all just paid so we could get out.  When she brought back our final receipts, after swiping our cards for payment, our totals were different once again.  I couldn't believe it.  I never once had any trouble as a server splitting the checks for tables......especially 2 or 3 times on the same check.  It was beyond ridiculous.  It's safe to say, that I will most likely not be dining here again.  The food wasn't worth putting up with the service.  I will stick to Switch."}
{"text":"Found this bar only by chance. After eating dinner across the street at eureka, and having a bad experience at the restaurant next do to it, we began bar hopping. Our game plan was to go to the container park, but when I saw the marquee for habanero pickle backs, we darted across the street in front of a slow moving fire truck. After getting past the door man, who was only checking id's, promptly bellied up to the bar and asked if the pickle backs were a lie. I was looked at like I was crazy, and to my surprise I was promptly served the real deal. From that point it was on, next thing I knew the rest of the group was drinking homemade ginger beer Moscow mules, and I was able to get one of the pickles (to share) straight outta the habanero pickle juice dispenser. The bartender had some trendy name, but spot on attitude and personality that I so look for in someone serving my drinks. A bad even rolled through the bar, played 3 great songs and left. Overall this bar was my favorite one on this trip to Vegas and I will definitely be back!"}
{"text":"The corduroy salad is my favorite! I can't wait to eat here again, and again. Great food, chill vibe, amazing service all set in a very cool building. You won't be disappointed! Go eat!!!"}
{"text":"Disappointing. The restaurant is very nicely decorated, and the service is pretty good. I was expecting good to great food since it's owned by the same people who run Fez and Switch. Had a salad which I thought had way too much cheese on it. Unfortunately I can't remember the name but I expect really fresh, beautiful ingredients in a salad. These ingredients were fresh, but everything was just so... blah. It felt like a salad I could make at home.  Husband had the corduroy burger which was cooked over what he wanted. It was pretty good, but again, nothing remarkable that made him think YES WE SHOULD COME BACK!  I'd be willing to give it another go since we only tried two things off their menu and again, it's owned by people who have some pretty yummy restaurants in Phoenix. It might take me a little convincing, though."}
{"text":"We had a wonderful evening at this new restaurant! Not only was the service fantastic but the food was amazing as well! Be sure to try at the Cuban cigars these were an amazing starter as well as the bacon board! The greens and green salad was amazing especially with the fillet skewers on top! We also had chocolate cake and carrot cake and they're both to die for! What a fantastic place ambience was amazing as well as the vibe! Can't wait to go back!"}
{"text":"The only reason I give this place a 5 star is because of how Great our service was with Chris Crowley!!! He was amazing. From the moment we walked in he took care of us with joy and humor and made sure we were taken care of!!! This bar has great music and atmosphere but I would recommend to go back with Chris is on!! This place is a hidden gem!!! Thanks Chris for a great 2 nights!!! He is the reason the second night here we decided to come back to Corduroy!! Amazing ! You guys are lucky to have him as a bartender one of a kind !!!"}
{"text":"Beautiful bar. Excellent staff! we are here at 2:30 in the afternoon. It's calm obviously but its definitely a bar that looks like fun at night. They have $3 pbr's pints. If you're in downtown check it out for you're self."}
{"text":"First time visit to this spot owned by the same people who bring you \"Switch\" next door. I had high hopes the moment I walked through the door. Summer Saturday afternoon - not too busy and seated at a high boy immediately. There were a few patrons at the bar and a few couples seated in cozy booths as well. You've got choices here! Saturday and Sunday mornings offer a little brunch menu with the star of the show being their carafes of Bellinis or Bloody Mary's. We opted for the Grapefruit Bellini first and the Ginger Peach the second time around. Both were thirst-quenching and had appreciably enough 'good-morning' kick. Sampling through menu with a bacon/cheese board (crispy well-flavored bacon, fruit, veggies, cheese dip, and a little fried cheese too), on to fried calamari (a bit soggier than I'd prefer), and then a scallop plate (4 minis with a scoop of mashed potatoes.) All in all, I felt that the food was very good. We finished up with a slice of German Chocolate Cake - chocolately but not overly sweet with a scoop of vanilla/coconut ice cream. The ice cream had an interesting coconut gelee within. Good but interesting. My favorite part of the visit had to be our server, Dante. He was warm, personable, friendly, and efficient. His recommendations were spot-on. I'd visit again... it was that good!"}
{"text":"We were looking for a change. Terry T and I meet up every few weeks to catch up and eat. Or is it eat and catch up? Either way, Corduroy was on our radar and we're certainly happy to have tried it.   No surprise, the first thing we ordered was the cheese and bacon board, with the cornmeal crusted goat cheese and fontina (I think) and the duck bacon and corn cob smoked bacon. With the assortment of fresh veggies, it made a great starter. However, even if I were to eat this alone, it's not enough to get full on.  Next came our crispy cauliflower, which was amazing fried goodness dipped in aioli. Seriously, this was the stand-out of the day. Then we tried the veal meatballs and were delighted by the fantastic flavors, and the great gravy that was like a cloud of flavor. Finally, the boursin mac and cheese finished off our meal. [Before an intimate wedding ceremony a week earlier, another of the guests was talking about this mac and cheese and everything she said worked against it--rich, creamy, cheesy--worked in our favor of ordering it.]. At this point, we were tapping out of stomach space.  While a little pricier than our normal haunts, Corduroy definitely deserves return visits. We enjoyed the food and loved the service. The patio is awesome, and if I could be on it during a rain storm tapping on the tin roof, I'd be a very happy person."}
{"text":"As a local, I come downtown quite often. For some reason, I barely made it out to this bar but I was not disappointed. I'm an avid believer that the downtown experience is what you make it & that depends on who you are with. Love the picture booth idea! Super fun! Our drinks were delicious & the bartenders were super friendly on the busy Saturday night."}
