{"text":"I came here as a last minute bar to explore at the end of the night.  Arriving,  we had only 5 min until the kitchen was closed for the night but the happily made us a great pizza.  To go with this,  I had a great pumpkin seasonal beer which was fairly good.  The service was great and the bartender very friendly and willing to hand out samples before we had made up our minds in ordering.  Overall,  I would say the pricing was fair with a decent selection of craft Ontario brewed beers and local wines.  I would strongly recommend trying this place out if you feel like a low-key evening to enjoy a drink and company."}
{"text":"Was heading to the Jays game with a friend and we were a lil hungry and a lil thirsty.  Being tired of going to Hoops or Real Sports he suggested we try this little beer & wine place in the back of Longos.  After working our way down through the store and into the back corner there stood a mini oasis for beer and food before any game.  The service is awesome and the daily \"Pint & Food Item\" Deals for $10 are totally worth it.  My personal favorite which takes place on Saturday, Sunday & Mondays is a Pizza & Pint for $10.  Also for those Friday night games I like to stop by for a Pint and their Signature Wings for only $10 (Make sure you get the signature wings, the other kind they sell are way below par, seems like they were just heated out of a frozen box).  Since my introduction to this place I have become a regular dropping by before every Jays game I go to (I got season tickets so I go to a lot)."}
{"text":"I'd like to shake the hand of the genius who thought of opening up a bar in a grocery store. I love coming here whenever it is beer o'clock (e.g. while grocery shopping, while studying, after doing my banking, while meeting a friend, before a game with overpriced drinks, etc). It is so well hidden that I didn't know it was there for months of grocery shopping at Longos - what a pleasant surprise it was.   They always have a beer to match your taste. Today, I described to the bartender what I was craving, and like a pro he poured me the perfect drink. I love that they carry craft beers and not your usual domestics. Keeps things interesting.  This bar is just a great casual place to hang out. There are plenty of tv screens, comfortable seating, and nice washrooms close by."}
{"text":"Love this place, I work nearby and we come here every Friday for the past year.  It's a little different than a traditional bar, it's like a bar inside a supermarket which is Longos in this case.  You have a bar that sits about 8 people and then you have the seating area which is really public seating, anyone can come and have lunch there.  But it is full service which means you have servers. They even have microwave and cutlery if you decide to bring your own lunch.  Service is great most of the time, it's a very casual place to have a drink.  Most of their stuff are locally brewed, things you don't hear at a regular pub.  Every week seems to be different, they always have new stuff coming in.  I describe this as a cheap man's bar because you can grab a sandwich for $3.50 - $5 at Longos and have a beer and it will be all come to less than $15.  Or if you want something else, they have full buffet by the weight at Longos and fire oven Pizza cooked to order!  They used to have a combo special, you get a beer and a burger with salad all for $12!  You can't beat that anywhere, unfortunately they moved this special from Friday to Wednesday!  Bring it back on Fridays!    So, Real Sports bar nearby for more formal stuff, this for your everyday casual drinking needs.  It's not a sports bar, they do have a few TVs but they're really small TVs.  It's a very very casual place to enjoy lunch and a few drinks.  Everyone should try this place out, it's very very light on your wallet.  I wish they have more of these in Toronto, a very cool concept because not everyone wants to go into a full bar and spend $20 on a burger and another $15 on beer."}
{"text":"Corks is a restaurant inside the Longo's grocery store. They serve light meals as well as many wines by the glass and micro brewery beers. I had the Pizza and enjoyed it. It was inexpensive but fresh and tasty."}
{"text":"Great place to have a pint for cheap and grab some food. Thursdays are great as you get 3 oysters with drink and you can get a whole 16 inch pizza for 6.99. Service is friendly and you can order stuff from the store as well which is awesome. Sadly it's all Canadian wines here but the prices are somewhat reasonable. Great place to unwind and chat with people as this place attracts a different crowd than your average watering hole. I recommend the Pilsner. P.S. the oyster and pint has been revised to 10$ for a pint and 6 oysters. And the pizza is 7.99$ on thursday."}
{"text":"Thank goodness for reviews on yelp. This place would have been hard to find. It's actually inside the longos at the back. Although the category says tapas/small plates..it's actually just like a small bar. The service was surprisingly on top of things although the space was packed. Between the 4 of us, we shared 2 pizzas: the meat lovers and the pesto Primavera. It was aight. Could get a much bigger pizza from the actual Longos supermarket."}
{"text":"This place is just hassle-free, low-priced, high-quality good eats.  Servers are laid back.    Great charcuterie board, big goat cheese salad and 3 pints were, like $40.  Sometimes we come for the unbelievably cheap oyster and pint deals on Thursdays ($10 for a pint and 6 oysters).  If you don't get seating in the tiny bar itself, the atmosphere is cafeteria-cheesy, so best to bring great company where stuff like that doesn't matter.  This is awkwardly located in a back corner of the giant Longos by the ACC--it's an ancillary business to the major grocery store and is probably why the pressure to perform in volume and tips is removed from this chilled out place.  Great for downtown, after work."}
{"text":"In search for some food and good beer/wine prior to an outing at the ACC? Look no further than corks.   I recently visited Corks just before attending a Leafs game. The place was busy, since my last visit I did notice that they have added more seating and even have some waiters to come serve you at your table. My friend and I decided to grab 2 pizzas; I opted for the La Grilla pizza, all personal size pizzas will run you $8. Shortly after we ordered my pizza was brought to me and the waitress notified us that they had burnt the cheese pizza my friend ordered, she assured us that another one would be out shortly and that it would be on the house. It really impressed me that they were willing to own up to their mistake and gave us the pizza free without us having to ask, that's my idea of good customer service!   My pizza was ok, the dough is thin and crispy, and it came with a generous portion of sweet peppers, artichokes, zucchini and mushrooms. There were too many toppings in my opinion, a little more cheese and sauce would have gone a long way. This was still better than any pizza you will get at a fast food chain and at $8 is a bargain for a decent meal around the ACC. The thing that will keep me coming back to corks is that they have a good beer selection, a few taps of local craft beer as well as a decent bottle menu, pints or bottles will run you about $6 again a bargain for this part of the city. I definitely enjoyed my local craft beer! If you are not a beer lover they also have a selection of Ontario wines.   The service as I mentioned before was good, our waitress brought us our food and drinks in a timely fashion considering they were slammed. I will definitely be back at corks the next time I am hitting up a sporting event or concert at the ACC.   * If you don't fancy anything they have on the menu you can go into the Longos grab something and eat it there, this is great especially for those of us who try to eat healthy."}
{"text":"When I first came over to the new Maple Leaf residences, I first ventured into the Leaf-owned mega-sports bar, RealSports and yes, it's very impressive at least in appearance. Lots of taps but nothing really out of the ordinary. Mostly Molson and Rickard's crap.  Then I ventured down into Longo's.  They've got a bar too. Yes, in a supermarket but forget about that for a moment. It's strictly beer and wine but it's all local. There's six taps and they are all Ontario based craft brews from brewers like Black Creek and Granite.The one I had was a Lager from Beau's All Natural Brewing Co. and it was exceptional. One of the best beers I've had in awhile. Pints typically cost $3-4 which is far less than purchasing a pint of crappy Molson upstairs. Better yet, since I was there on a Wednesday, I could order a pint of that and a 10 inch Stone Fired Pizza for 10 bucks! Yes, a combo deal and a really good one. The pizza is baked over at the supermarket and it is only sliced into four huge slices. Maybe too big. Six would have been more appropriate. Pizza was good but could have used more toppings. I guess that's to keep the price down.  Bartenders are very knowledgeable and happy to share their experiences with the products. Best of all, it's a really quiet atmosphere. A far cry from the noise upstairs at RealSports or any Irish pub nearby. You can talk here! You can even read their copy of the Toronto Star while you're there if you like. You really do forget you're in a supermarket with a Starbucks next door. If you're a fan of really good beer, skip most of the bars and pubs in town and come over here instead."}
{"text":"What's not to like?  It's not a huge menu, but the atmosphere is pleasant and the service is always excellent.  As others have mentioned, you can't beat the weekend pizza special (nice sized delicious pizza and a pint of Steamwhistle beer for $10).  And it's fun to sit at the railing and look at the shoppers in the supermarket below.  I was just there today.  Pizza and beer + chicken club sandwich (with avocado) and diet Coke.  All for $23.  And we couldn't finish half the pizza and took it home.  You won't find a better deal anywhere."}
{"text":"A co-worker and I decided to try this place when we were in town on business. We found it on yelp so we're a little surprised to find it in the market.   It didn't matter. We had a great time. We sat at the bar and enjoyed a couple local beers. You can order food there or pick up foot from the market and eat it. They were shucking oysters which looked pretty good too.   The bartenders were beyond friendly and knowledgable when we were asking of other places we should try in the area. I would for sure come back here if I lived/worked in the area."}
{"text":"Who would have thought? A nice little restaurant/bar in a grocery store! We had two pizza's, burger and Wings a couple of craft beer, then off to the Raptors game. Service was great, food was good, price was right! We will return."}
{"text":"Literally a hidden gem! Concealed in the back corner of Longo's (... yes, seems weird, right?) is Corks... but I think it's genius!!   I live across the street and have come here a few times - the service and food are always incredible. I usually pop in for a \"make your own\" za which include: your choice of sauce, cheese and three toppings. Unless you want to pick from one of their predesigned options, of course.   The pizza comes perfectly cooked every. damn. time!! And boy are they quick!! Each time I've been, they've had some sort of special going on - I like to get the 'pizza and pint' deal.   The bartenders AND kitchen staff are both very accommodating. They even charged my phone one time (I know this is annoying, so thank you). The bar itself has very little seating, but I've never had an issue...  After another positive experience with Corks, I felt the need to get on here and give you guys five stars because you deserve it!   Oh! And the cherry on top?! You can't beat the prices here! ... I selfishly hope that Cork REMAINS a hidden gem! :) ;)"}
{"text":"Great place, knowledgeable bar staff, daily deals. I feel like you could probably get a larger pizza and a beer for a bit cheaper in the grocery area [you cannot do that and bring it to the bar though]. I would be interested in trying more of their bar food next time.. I'm working nearby a lot so will probably pop back in.."}
{"text":"It's everything the other reviewers say it is: slightly tricky to find (look for the Starbucks), a modest food menu of starters, pizzas and sandwiches, great selection of beers and some wines, very affordable prices and friendly, helpful staff.  Good for a casual meal before or after the game, especially if you're looking for something tasty at a reasonable price. Pizza and sandwiches are not as good as what you'd get from a sandwich or pizza joint, but better than you'd expect from a Longo's. Nice middle ground between fancy overpriced dining, and quick & cheap take-out :)"}
{"text":"Great inexpensive food in downtown Toronto! A bit difficult to find at first but if you look well you'll find it next to Starbucks in Longos. Go for the wood oven pizza and craft beers :)"}
{"text":"For a bar that's inside a grocery store, Corks is pretty awesome. My friend and I intended to go to the ESPN bar but it was way too crowded and noisy it would have been impossible to talk. So we came down here instead. The bartender was great! He knew his wine, and gave us a great selection to taste along with our cheese plate. We even got to taste an incredible dessert wine from a Canadian winery."}
{"text":"Love this place.  Very reasonable prices.  Wonderful service.  I LOVE the pizza much better than at Nervosa Trattoria in Yorkville.  They let you sample their beers and I found some that I love.  The appetizers like the cheese board and charcuterie board are delicious too.  My favourite is the Potato Pizza (I thought I would hate it but I LOVE it)."}
{"text":"I got a little lost finding Corks.... wondering around Longos wondering where is this place? a Bar? Don't see one? Then I saw Starbucks, almost want to have a coffee instead and forget about my beer... then I saw Corks, tagged right at the corner beside Starbucks.   Thursdays from 5 to 8 pm, three free oysters when you purchase a pint or a glass of wine is a good deal... but the oysters were kind of small and not really fresh and on a paper plate ..... meh... but it was a nice offers.   The bartender here was super friendly and explain to me what they have on tap and character of each beer. Love how Corks feature local beer from the breweries!   Plowman's Ale ($6) is bold and heavy and have great characters...love the bitter finish at the end........   I might just skip the oysters but definitely will be here for a quick drink when I am in the area.......oh maybe some Canadian wine... Corks must be a wine bar, as it is call Corks??"}
{"text":"Awesome! Inexpensive! Had the meat pizza with a beer. Very good! Cool that's it's in the grocery store and you can essentially pick something up and pair it with whatever you want at corks!"}
