{"text":"Dieses Eiscafé lebt maßgeblich von seiner Lage: Direkt am Lech - wirklich wunderschön.
Das Eis ist auch nicht schlecht, die Kugel kostet moderate 80 Cent (ist dafür aber auch etwas kleiner als bei Mr. Gelato).
Das Personal ist aufgrund des hohen Andrangs manchmal leider recht gestresst - genervt. 
Wer es aber geschafft hat und hier am Lech seinen Eisbecher genießen kann, den wird das nicht mehr stören..."}
{"text":"Voll, schlechte Sitzplätze, lange Wartezeit( ok es ist Sommer), flüssiges Eis.
Nein Danke, nicht nochmal."}
{"text":"The Location is nice but this is absolutely NOT an Italian Ice-Cream... is not creamy and is made by ice cream powder. I'm from Italy... trust me!"}
{"text":"Wirklich sehr gutes, selbst gemachtes Eis mit großer Auswahl an Klassikern aber auch ausgefalleneren Sachen die sich lohnen.
Preis für die Kugel ist ok, aber die Sahne dazu etwas zu teuer. 
Ist leider fast unmöglich einen Platz zu ergattern, aber wenn man sein Eis zum Mitnehmen kauft, findet man in der Nähe schon ein gutes Plätzchen für sein Eis."}
{"text":"Hier ist es mal was besonders, man kann hier, wenn das Wetter mal schön ist, direkt an der Lech sitzen, über die Mauer schauen und die Lechfälle bewundern, die es so ähnlich auch in Füssen gibt  da allerdinx ohne Eisdiele. 
Der Preis ist akzeptabel. 
Und hier gibt es eine phat grosse Auswahl an Sorten, und sogar das selten gewordene Waldbär/Yoghurt-Eis ist dabei! 
Da komm ich gerne wieder."}
{"text":"Unsere Stammeisdiele in LL super Eis, tolle Auswahl an Eissorten und Eisbechern. Sitzplätze sind leider nicht viele da, aber mitnehmen kann man auch und am Lech spazieren gehen. Auf jeden Fall ist das Eis spitze."}
{"text":"auch hier gibt es sehr gutes eis! allerdings besser zum mitnehmen"}
{"text":"Das beste Eis weit und breit an einer tollen Location in Landsberg mit Blick auf dem Lech!"}
{"text":"Wunderschöne Lage, tolles Eis (Auswahl und Geschmack TOP) und servicetechnisch nichts auszusetzen!"}
{"text":"DER Klassiker am Lech in Landsberg.
Seit über 20 Jahren immer sehr leckeres Eis und Kaffee. 
Der Beste Platz am Lech!"}
{"text":"Mit die schönste Lage in Landsberg und hausgemachtes italienisches Eis. Sehr lecker und auch ein großes Angebot! Service i.d.R. auch immer sehr freundlich."}
{"text":"Wirklich das beste Eis in Landsberg, da kann die Konkurrenz eine Straße weiter meiner Meinung nach einpacken! ;)
Die Eisdiele liegt direkt an den Lechstufen. Von hier aus kann man die Enten und Schwäne beobachten, während man sein Eis genießt. Man kann sowohl drinnen als auch draußen sitzen.
Das Personal ist auch freundlich! :)
Also wenn man hier ist, im Sommer auf jeden Fall die erste Anlaufstelle für leckeres Eis! :)"}
{"text":"Eisdiele direkt am Lech. Schön gelegen direkt an der Staustufen kann man hier wunderschön im Getöse des Wassers verweilen.

Eis und Café sind lecker, Service trotz vollem Haus rasch und nett.
Wer in Landsberg während eines Bummel kurz mal relaxen möchte: unbedingt ausprobieren."}
{"text":"Auch hier in Landsberg schon des öfteren vorbeigekommen und dann musste ich hier am Lech bei der schönen Aussicht natürlich erst mal ein Eis essen.

Auch hier viele Sorten immer einen Besuch wert...

Eisbecher kann ich hier leider nicht bewerten da ich immer nur ein paar kugeln in der Waffel hatte."}
