{"text":"As I have noted in other reviews, I am a recent transplant from Venice Beach, CA and have decided to dive right into the scene!  In LA, there are tons of wonderful Ethiopian restaurants to choose from, so I have been checking out what Las Vegas has to offer.  I began my journey at Meskerem last week (see my review) and decided to check this place out.   I read a post ( don't think it was on Yelp) that said that Cottage Cafe was better than the spots in Little Ethiopia in LA. That's a bold statement! Needless to say, I had to see what the hot fuss was about.  I called my order in as I know that Ethiopian joints can some times have service that is SSSSLLLLLLOOOOOWWWWW! I placed an order for the vegetarian combination and the lamb stew. An order like this from most Ethiopian restaurants is typically enough food for me to make into about 6 meals. Perfect as I do not want to cook in 105 degree weather!   The first woman who answered had to get someone else to take my order as she could not understand the simple phrase, \"I'd like to place an order to go\".... Anyway, I ordered (with a bit of apprehension) and proceeded to head over thinking that surely my food would be ready by the time I got there. I live in Green Valley and the restaurant is around the corner from UNLV. You would think that that would be enough time....  Of course there were no customers in the place when I got there (about 9 pm on a Thursday night) and the chicks behind the bar looked put out to have a paying customer walk in the door. When I said that I was there to pick up my order, one frowned up at me and asked what it was and proceeded to write out the ticket and take it back to the kitchen. HELLO! The point of calling it in was so that it would be placed and ready for me to pick up! The other chick never said a word and just disappeared into the back somewhere! Wow!  After standing at the bar and watching an episode of Real Housewives of NY on their big screen TV, I finally got my order. Long story short, for $23 bucks, I was expecting more food, more flavor, and some form of service ( a simple 'Hello\" would have been nice)!  When I got home I was pretty disappointed. The portions of veggies were way smaller than I am accustomed to, and the lamb was way dry. Unlike one reviewer, I know it was definitely lamb (not dog or cat meat like he said---tee hee hee :-)), but the bone to meat ratio was pretty high and I had to add my own Ethiopian spices to it!   Don't know how anyone could give this place more than 1 star, but I would avoid this place at all costs!  Never again will I return. For the first time in my life, I am NOT looking forward to the left over Ethiopian chilling in my fridge. Being tipsy helped it go down okay last night. Might have to try that again for the remainder!"}
{"text":"This place rules for breakfast.  I haven't gone for lunch yet.  But for breakfast, it's a solid, homestyle diner place.  If you looking for good simple breakfast offerings, go here.  The cost is not much.  Two people are definitely eating under $20 easily.  The biscuits and gravy are excellent.  The eggs benedict, hash browns, sausage, coffee -- all just nice, no-frills awesome food/drink.  You seat yourself - get there by 9 am on a weekend to avoid waiting.  The parking lot can fill up fast, too.  The service is fast and the servers are pleasant.  IHOP and Denny's have good breakfasts, but if you want a little less grease and a little more homestyle flair, go to Cottage Cafe."}
{"text":"I can't stand people who eat ironically.  The Cottage Cafe is a totally unpretentious breakfast and lunch diner frequented by hipsters, OGs, church folk, farmers, business people - a real cross-section of the East Side in one fluorescent-lit, country themed dining room.  The staff is very friendly, although at a fast pace as business never seems to be anywhere close to slow.  Sundays are the worst, when the church crowd stuffs the place and there's a long wait for a table.    But the food is always decent, some of it good, some less-so, but very consistent quality all around.  I like their soups a lot.  A little salty maybe, but made in-house, and not with the starters or canned bases a lot of cheap diners use.  The sandwiches are hit-and-miss; burgers are fine, turkey club comes on a hoagie (WTF?) grilled cheese is done right, and can be varied with diff. breads and cheese choices if you want..  Fries are crispy with a coating of crunchy potato stuff.  Salads are all iceberg lettuce based.  Like you expected anything else.  The hashbrowns are classic, like the Platonic Ideal of hashbrowns  - grated potatoes, crispy and a little greasy, with veggies mixed in.  The scrambled eggs are not my fave - they are the kind that are cooked in one mass on the griddle, like a kind of omelet.  I prefer scrambled eggs to be turned as they cook so they're fluffy.  The pancakes are average but good, sort of like your classic bisquick style.  The coffee is diner coffee - that's what all the sugar and cream is for!    Come on - you know exactly what this place is all about before you even walk in.  A lot of these cheap diners make you feel like you're gonna get sick eating their food.  The Cottage Cafe is one of the good ones.  The food is decent, the prices are unbelievably low, the staff is welcoming and ready to make you a regular if you come often enough, and it's all total comfort food."}
{"text":"Delightful neighborhood diner. Pleasent wait staff, all three off us had excellent meals. This place lives up to the hype! If you enjoy great food and the charm of the old corner restaurant, it is worth the trip."}
{"text":"Incredible service and amazing food! Eggs Benedict meal was one of the best ones I have had in a long time! Prices are very, very great - fairly inexpensive!"}
{"text":"Excellent prices, wonderful basic food, and outstanding service.  The wait staff is very efficient and consistent, and I particularly enjoy the potatoes obrien.  Open only until 2pm, for breakfast and lunch."}
{"text":"I'd give this place 5 stars, but yelp has a good filter system and since this is my only review,  they would probably filter it if my review is too good or too bad.  I like the cultural experience of this place. Watching TV on the moniters. I saw Al-Jazeera, and you get a true international feel from the news, instead of watching everything with such a U.S. based focus.  I had the veggie combo for $10, since I'm a junk food vegetarian. I got the coupon off of vegasclick, giving me 20% off the total bill. The injera bread is soft and spongy. It looks like a dishtowel, and you use it instead of eating with your fingers. It doesn't have any salt in it, so it is a different type of bread than we are used to.  When I first went in, the woman there didn't speak much English and just said come back at 1PM, so I had to be patient. When I came back at 1PM, the waitstaff there were so calm and apathetic and distant and quiet, that it was quite an experience.  I liked the smell of the food. The flavors were not overpowering, so this food will take some getting used to. I don't know enough about Ethiopian food to really give a good judgement about it. But, I liked the smells and it all seemed to be done well.   I believe Ethiopian life is not driven the way westerners are used to, and so patience is something good to learn and for those with patience, they will be rewarded. You say something to them, they think for a bit, then reply.   I heard from the bus driver that the cab drivers eat there in the morning, so I could only assume that they don't bring in the English speaking staff until the afternoon.  If you like traveling to exotic foreign countries and sampling their food, and will be in Las Vegas, then this restaurant is perfect for you.  The portion I got was pretty big, and I had to let my stomach settle three times for a few minutes in order to have enough room to finish the plate.  It is a shame that American values can't notice the beauty of a place like this, with a slower pace of life and whatever other cultural differences they have. I can't tell you how it would be for  a meat-eater and what they do to meat, though.  The meal was quite relaxing and so was the setting. In fact, I have had more stressful meals in Hawaii and near the beach. I remember eating at a fish place in Maui with yuppies and a hotel buffet. Most meals are rather stressful, from making decisions about what to order and ingesting all of the gunk. Maybe, Ethiopian food is a reflection of how these people live their lives. There was some quiet TV in the background and some Ethiopian flute music, which was all so quiet that you hardly noticed it."}
{"text":"I discovered Cottage Cafe thanks to my 75 yr old neighbor who is a Cottage regular. I keep coming back for the bean soup, cheap and plentiful breakfast offerings and most of all the service. Can I just say the Cottage Ladies rock! This is probably the most kid-friendly restaurant in Madison. My daughter loves the Mickey Mouse pancakes loaded with Redi-Whip and we both love the coloring book pages and  the full box of crayons that are cheerfully presented as soon as we sit down. extra points for clean restrooms, ample parking and optional suckers on the way out."}
{"text":"I have lived in Madison for ten years and recently went for the first time. This place is awesome! So disappointed I never went before now.  The staff are always friendly and speedy. The food has always been great and the prices are right."}
{"text":"very good! Worth a trip. great service and delicious food"}
{"text":"I am not sure where Luther, the previous poster, went.  Cottage Cafe is a throwback diner that serves up great breakfasts and lunches at a very reasonable price.  Do not let the outside of the building discourage you.  It looks a bit long on the tooth, but inside is well lit and clean.  The wait staff is friendly and experienced.  The food is always prepared just right, and the portions are huge.  I had the Sunday morning steak and eggs special. Steak, 2 eggs, hash browns, toast and juice.  Delicious!  And the bill was $10 and change, including a bottomless cup of coffee.  And if you sit at the counter, you get to watch the waitresses juggle plates of food, cups, glasses and coffee pots while serving a full house of hungry customers."}
{"text":"It's a small diner, but it definitely wasn't cramped. The menu had a pretty good selection of both breakfast and lunch items.  I had the Eggs Benedict, and they were delicious.  The plate was covered in hollandaise sauce.  The staff was friendly, my waitress made sure my water glass was always full.  The prices were reasonable.  The one bad thing about my visit was that I ordered a milk, and the waitress never brought it to me. By the time I realized it, I was already done eating, so I didn't mention it. They didn't charge me for it, either."}
{"text":"Great food and supper reasonable.  My son and daughter love the French toast."}
{"text":"I went here for the first time this afternoon (a Sunday), about an hour before closing time. I sidled up to a rather short stool at the counter and was quickly greeted by one of several waitresses who were busy with their end-of-shift chores.  Having read a Yelp post about the Chorizo Platter, I immediately ordered that, with a baby pancake on the side and a bottomless cup of coffee. It came to less than $11.  The wait time was average. The coffee was a little better than average, with refills aplenty. The main entree was fine but overall bland. Even a healthy dose of Cholula didn't do much for it. I think part of this had to do with the chorizo, which is always a letdown wherever I order it.  The star of this meal was the \"baby\" pancake, which reaches the edges of a normal-size plate. It was not too thick, not too thin and had a perfectly smooth bottom that I love. I did detect a slightly \"dirty\" taste, but I'm not sure what that was from. It might have just been my tastebuds acting up.  The ambience reminded me of every small-town breakfast/lunch place I've ever been to in the Midwest. The waitresses, while clearly looking forward to heading home in an hour, were all still very polite. (One, in particular, kept checking the Packers score and was bemoaning the fact that their team was trailing.)  For anyone familiar with Middleton, C's Restaurant is a good comparison to this place. Although, I would rate C's higher after dining at each place once.  Considering I live less than a mile down the road, I definitely foresee myself returning here anytime I'm in the mood for a no-frills breakfast."}
{"text":"The food was very good! I created my own omelette. The staff is very friendly and you can tell they have good management by the vibe the staff has with one another. Skip the chain breakfast restaurant and head over to Cottage Cafe!"}
{"text":"what a great place...the owner is very friendly, food awesome, and good value:  we will def. return!"}
{"text":"As a number of others point out, the place tends to be pretty empty save for some occasional Limo drivers. That's too bad, since the food has always been great when I've gone and it's in a fun neighborhood. It's true the service has sometimes been slow, but it has also always been friendly enough and I suppose I've never been in a rush. I try to go here whenever I'm in Vegas."}
{"text":"Great food.  Terrific service.  The place to go if you live in the area, or passing through."}
{"text":"Stopped here enroute to a Door County for breakfast on a Monday morning. The cafe is busy with what appears to be regulars when we arrive but a table opens up in a few minutes. The staff is friendly and quickly bring our water and menus. We order standard breakfast stuff pancakes, omletes and such. Everything is nice and hot when delivered . The food is good and reasonably priced. This place is nothing fancy it simple provides a good meal at a good price."}
{"text":"I really like this place.  It's not fancy or gourmet food, but, its a good traditional Wisconsin cafe. Good consistent food and the waitstaff is consistently friendly and efficient. This is my go to breakfast place."}
{"text":"My aunt, husband and I went this morning.   The atmosphere is down home feeling. Was quite cold inside. I was freezing and it's the end of July! The server, I didn't get her name, was kind of blah. She wasn't too friendly. Though she did check on us,   But no offer of refills.   I order the potatoes O'brian and toast. It was ok. The flavor was good but it could have used a little more seasoning. Sorry but salt and pepper just don't do it for me. The toast was good for toast, I had the sourdough. It for sure needed jam.   My husband and aunt got the same thing. It was 2 biscuits, 2 eggs, sausage and gravy with American fries (large, diced potatoes). My husband had cheese on his fries. It was great they said.   Over all I'd come back when we are in town."}
{"text":"This is definitely a throw-back to little town diners. The food is basic, but well made and cheap. Really cheap. Nothing over $8 on the menu and most things in the $5-6 range for breakfast which is served all day. I recently went here on a weekday morning that I had off work and the place was mostly filled with older guys sitting around in groups drinking their coffee discussing the weekend football games. You can tell this is the type of place that people visit every day to chat with neighbors and have the community feeling. Service is prompt and efficient. On weekends there can be a short wait, but never anything too bad."}
{"text":"You will never go away hungry...and your wallet will not be much lighter.  Good food, good prices and wonderful staff."}
{"text":"Was over at the Double Down and wanted to get something to eat while waiting for a band to go on. My friend recommended we check out Cottage Cafe. Although we arrived as they were closing up for the night, the owner was extremely kind and offered to let us order something. It was like super VIP, we had the place to ourselves, and were treated like regular guests, not rushed.   We ordered some spicy beef and lamb with veggies to split. And had to get some Ethiopian beer to wash it down. I had no idea what to expect and was thoroughly satisfied when the food came out. My first time eating here and I will plan on coming back again. The taste and portion you get for the price is great, you can't beat it.  I'm curious to try breakfast next time. I'm a fan and have already recommended some other friends to try it."}
{"text":"Food is great help is great your family here  yor coffee will never be dry good place to go by yourself sit at counter end wach real people working hard there great"}
{"text":"This isn't the Farm to Table 5 stars, this is the down home, old style just breakfast  5 stars. Hidden away in an innocuous strip mall by HWY 51, Cottage Cafe is immaculate and a bit quaint. At 63 I almost felt young. The waitresses are old pros. Fabulous service. I think I have eaten here three times. Today I had 2 eggs poached soft, raisin toast and corned beef hash. The eggs were perfect and hash crispy, as requested. The coffee was just fine. My friend had oatmeal with raisins and walnuts. It was just right. The bill for us both was $11.67. The place was full but the acoustics allowed us to chat away without a din in the background. So all in all it was just right!"}
{"text":"I liked this place a lot, though it wouldn't be for everyone.  It's pretty out of the way, down Paradise almost to the airport, and very easy to miss - in fact, we drove by it once even after we figured out where it was because we thought there would be a driveway facing the street, but you actually have to turn a little early to get into their parking lot.  Paradise is one-way there, so you have to circle around if you miss it.  Once inside, we were literally the only people eating there.  I kind of felt like I had interrupted a private conversation when we walked in - the two women in the back of the room looked as us as though they weren't sure why we were there.  Once we were seated, though, they were very friendly and willing to make suggestions about what to order.  I've had Ethiopian before, so I ordered the kitfo, and my friend went with a beef stew entree (not sure what it was called, but it was the third one down on the main entrees list).  His was the winner among the two - the kitfo was good, but the beef stew was excellent.  We ate it all the way down to the injera bread, and then ate all of that too!  The portions were large compared to other Ethiopian restaurants I've eaten at.  Two entrees was more food than the two of us could eat.  A few other people came in while we were there, though a few were lost and looking for the club next door.  By the time we left I think one or two other tables were occupied.  Overall I liked it a lot and would recommend it."}
{"text":"Great breakfast for our family of three. We enjoyed the omelette & breakfast burrito. American fries really hit the spot. Coffee was good, too! Good service & other patrons were really friendly. Will come back next time we are in town!"}
{"text":"What a wonderful gem of a place ! Homely feel, spotlessly clean, first rate service and minimal wait times even at peak hours ! Perfect for a weekend brunch/breakfast, the menu is pretty extensive and includes all the basics. The one thing I would highly recommend are the potato pancakes. Delicious crispy and cooked perfectly. We also tried the malt waffles and the quiche, which were both very good. Our coffee cups were never empty, the staff is super friendly and adds tremendously to the happy ambience. I left with a smile on my face."}
{"text":"Nothing special. Basic atmosphere, decent food, cheap prices, friendly service. Def not a 4.5 star restaurant/cafe though."}
{"text":"Nice neighborhood resturant. Good food at reasonable prices.  The regular pancakes are plate size, so you get a lot. Staff friendly and prompt with coffee refills."}
{"text":"The place is hoping every time I come in.  The local traffic is super loyal as they should to this great little stop.   The staff goes above and beyond. Never leaving your coffee get to the bottom of the cup. Quick service.    The food is good, not great. Well done all the time just little tiny things prevent me from adding the fifth star. Canned corn beef.  I have issues with that.  Everything else meets the higher standards one can have.   The place is great for siting down meeting friends and enjoying great food."}
{"text":"I almost hesitate to review this place because it is so awesome! Cottage Cafe offers a classic diner experience: very decent food, no frills atmosphere (I think we all had subtly different plates!), great prices and super-friendly staff! There can be a bit of a wait, but it seemed to move pretty quickly when I was there (in agreement with the other reviews). I wouldn't come here with a big group (more than four) since that might make it difficult to get a table in a timely fashion.   With places like this, why would you ever go to a chain like Denny's or Perkins? I'm so happy places like this still exist, I hope they're around for many years to come!"}
{"text":"I've eaten here probably more than 30 times, since I used to live next door.  It's my favorite Ethiopian food (and I've eaten at dozens of Ethiopian restaurants, including in Ethiopia itself), and it's my favorite restaurant of any type in Las Vegas.  The food is simply exceptional.  The injera is thick and moist, and the vegetables are spiced to perfection.  The portions are generous, too.  Sometimes I can't finish the Veggie Combo, which is saying something, because I'm *always* able to finish any meal at anywhere else.  But you can't go here expecting American-style service.  It's a genuine Ethiopian establishment, run by Ethiopians, and their style is waaay laid back.  There are no hours posted on the door, and the opening and closing hours can change at whim.  (Sometimes open until midnight, sometimes not.)  The place will be mostly empty when you arrive, and they won't greet you warmly when you walk in.  The waitstaff might speak little English.  The service can be a little slow.  You might have to explicitly ask for the check rather than waiting forever for it.  None of these things is especially unusual for an Ethiopian restaurant, though the more successful ones are more \"Americanized\" and give the kind of experience you're used to.  This place, on the other hand, serves primarily the Ethiopian immigrant community of Vegas, not tourists.  If you have the proper expectations, I think you'll have a good experience.  But if what I've described is outside your comfort zone, this one isn't for you.  I almost gave it only four stars because the service won't be what many people will expect, but I decided that the service issues aren't really \"wrong\", they're just different.  I've certainly never been disappointed by the service myself.  And I wanted to give five stars because the food is just really, really good.  I've wondered whether I'd get tired of it if I ate it every day."}
{"text":"Clean cafe, amazing food, sweet efficient waiters. Great place for breakfast. The best crab Benedict that I've had outside of an ocean area!"}
{"text":"Pleasant local diner just a short drive away from the Dean Medical Center.  Seems to be mostly a local crowd. More of the read the morning paper over breakfast kind of spot. The place was crowded but service was efficient and very friendly. Was really happy to see one of my growing up faves: spam and eggs on the menu. The only negative for me was the coffee (standard breakfast diner refill type) was fairly weak."}
{"text":"I was surprised by the location of this place- it's right next to a laundromat. You'd miss it if you blinked. Lots of space though! Usually eat breakfast after I'm done with my 3rd shift job on less busy weekdays.  The inside is very pleasant and well kept. The wait staff are always friendly and accurate. The menu is fairly cheap compared to other breakfast places I've been. The food is certainly better than what you're paying but it's nothing to write home about. Most items are exactly what you'd expect from any standard dinner anywhere.   Still, it's a nice place to unwind after a shift. A good place to frequent if you live close."}
{"text":"The people here are so friendly!  They are helpful and excited to answer questions and emerse you in the experience.  The outside of the building and neighborhood is a bit sketchy, but once you walk in the door it is warm and inviting.  I've been to a few Ethiopian resturants in town, but the flavors here are so much better.  They serve a green chili sauce to die for that I haven't found at the other places."}
{"text":"A hidden gem in Madison. Truly one of the BEST breakfast restaurants around. Very welcoming employees. The food is made to perfection. The breakfast burrito is simply delicious. The crab cakes eggs Benedict is absolutely A..M..A..Z..I..N..G !! You will be hard pressed to find a better place to eat."}
{"text":"When I travel I like to go to \"local\" types of places---and this greasy spoon fit the bill and definitely did not disappoint.  Visited on a Sunday morning, place was packed but still made it in time right before the after church rush.   i LOVE places that serve breakfast all day---I can't get enough of eggs and greasy meats!  My food came out prompt, hot, and tasty----just the way I like it!  They're very accommodation for food substitutions if need be and have lots of tasty specials.  Get the cheddarwurst--yummo!"}
{"text":"I have been there over a dozen times. Food is always good. Food ticket times in the kitchen are normally 25+ minutes. This past visit. I walked in and followed the signs like the other dozen times to seat yourself. The waitress took our order. Then the cashier came up to my family rudely and asked if we were on the list. I had no idea what he was talking about and pointed to the signs that said seat yourself. He said get up and get on the list as people are waiting. I asked why the signs were not removed then he ripped them down. Don't change your policies and not remove the signs. I doubt we will be back and I will spread the word of how embarrassed your employee made our family feel."}
{"text":"I think I just fell in love.  I loooove breakfast.  Love it.  Sometimes, I get really overwhelmed by large, fancy menus.  So you can imagine, what a breath of fresh air, the Cottage Cafe was.    We walked in at 9 am.  Early, but not too early.  The place was packed.  Wow.  I walked up to the register and little did I know, but it is a seat yourself place.  There was no sign.  So we waited a few minutes for a table to open and sat down.  I am a simple person, I ordered the special of biscuits and gravy with two eggs.  The menu had quite a few other options.  My husband ordered the steak, two eggs and hash browns.  $8.  This is probably the most expensive item on their menu.  My gravy was perfect.  It was thick without being sludgy.  It had the right amount of seasoning.  I received my breakfast on two plates because the biscuits and gravy were overwhelming a single plate.   I ordered scrambled eggs.  They were bland and flat.  I spied my neighbors omelette which looked much more appetizing.   Our whole bill (for two people) was $16 and some change.  Bottomless coffee and breakfast.  Wow.    Oh, parking is tough.  There is only one shared lot."}
{"text":"Okay. No lie, this is one of my favorite places for breakfast in Madison. The corned beef hash is HEAVEN and I have honestly not tried anything else because it's way, way too good. The no frills atmosphere and loving service makes me feel at home every time no matter what I'm wearing or doing. My home away from home!!"}
{"text":"Classic old school diner.  Food good, love the servers.  Kind of place everyone feels welcome. Breakfast go to spot when looking for the basics."}
{"text":"An interesting local diner. They have a nice selection of breakfast and lunch items. Breakfast is served all day. Place was clean and help was friendly.    The food arrived in a timely manner. The portion size was generous and the food was hot. The two selections we had very good.   During our visit the customers appeared to be over si"}
{"text":"The cottage cafe is one of my favorite places, it has a very cozy atmosphere with homemade cooking, the service is outstanding and the prices are reasonable, big bang for your buck so to speak. I recommen the crab cake Benedict."}
{"text":"Good food, good prices, good service. Simple little breakfast diner. Down to earth and delicious. If I lived here I would def b a regular!"}
{"text":"If you want a great breakfast at a reasonable price this is the place. There is nothing fancy about it, but it's a great old school diner with old school diner food and it's awesome. I recommend the Cottage platter, it will fill you up yet not leave you feeling like you need a nap.  The coffee was hot and my cup was always full, friendly staff and great service even though they were super busy.  Give this place a try and you will go back!"}
{"text":"My first visit to the Cottage Cafe was today after getting in on a morning flight from Little Rock AR.  I had been up since 4:30 am and I need some good breakfast food.  I have just moved to the east side of Madison, and noticed the crowd one Sunday morning at the Cottage Cafe....that many people could not be wrong.  And I was not disappointed in the least.  The Cottage Cafe was what I thought it would be; a breakfast place first and foremost with a lunch offering.  I went simple with eggs over medium, bacon and a pancake.  The pancake is enormous!!  I will go smaller next time, but it was good.  Eggs over medium worked well. Served hot and delicious.  The bacon was cooked just right as well...crispy but not burnt.  Coffee cup never went empty.  Service was outstanding and friendly....smiles everyone...smiles!!!  I will be back.  I will venture into the menu a little more.  But remember where you are going and what to expect; good, simple food cooked well.  Dine on my friends."}
{"text":"I'm a big fan of having breakfast here, so this is a breakfast review.  I enjoy the steak and eggs/ hash brown breakfast. Each time I've ordered this, the steak it a great breakfast sized sirloin perfectly cooked.  Nothing is every very fancy or trendy at the cottage café, it is just straight up down home traditional breakfast cooking.  Coffee, Eggs, biscuits, hash, sausage, bacon, pancakes, toast. The essentials. Who needs anything else when your hungry and want someone else to cook for you on a Sunday morning, right?  Plenty of seating, but a word of warning.....I'm not the only person who loves this café. It fills up very quickly on the weekends and you may be waiting for a seat.   Service is very good every time. Bottomless Coffee just keeps on coming! I love that.   The pricing is the best part! Nothing like getting a great plate of food for a more than willing to pay price. I believe my go to Steak/eggs/hash browns/toast is around $7.99. Ya! Amazing right!  Between my wife and me, I have not seen our breakfast bill over $17 bucks yet...including each ordering coffee.   So Like I said....Nothing fancy, just great traditional breakfast food at great prices."}
{"text":"When you walk into Cottage Cafe, you forget your in Sin City, you forget your only a stonesthrow from the Vegas Strip.............  I love that about this restaurant.  The food is fantastic.  I have eaten at many Ethiopian Restaurants and the food here is authentic and delicious.  The Awaze Beef Tibs ($8.90) are our favourite, paired with the Vegetarian Combo ($9.90) And talk about value for money!! for 2 people who can eat large, you can be FULL off $20 with a doggy bag to take home.   You cant find or beat that anywhere near the Strip.   We will be regulars here."}
{"text":"I love breakfast, and at Cottage Cafe, they really get it right.  The food is the biggest hit with lots of basic American breakfast fare options.  Expect to leave stuffed as the portion sizes are pretty big.  The coffee service is awesome and the whole staff is quite friendly and efficient.  You get all of this at a super reasonable price."}
{"text":"Cottage Cafe is an interesting experience.  Let me say undoubtably, the food is fantastic.  It's not the food that is.... well.... odd. I've been to this place a few times, and the experience has always been the same. Once you find it (as the other reviewer said, it is easy to miss on Paradise), you enter to find a nicely decorated place.... and..... no..... people.  Well, not completely true.  Two of the times there were several limo drivers huddled together, watching something on tv and eating. no one greets you when you come in, and it has often felt like I'm entering someone's home when I wasn't invited. Though the wait staff is friendly (sort of), there is this air that they aren't thrilled to be dealing with you. However..... once the food comes, all that weirdness evaporates into the ether and you enter culinary heaven.  So, if you're up for a weirdish social experience as a precursor to wonderful ethiopian food, check it out."}
{"text":"The Cottage Cafe honestly surprised me. We visited the cafe after church to grab some brunch because we had heard good things about it.  The outside of the building looks absolutely abysmal. It's at the level that it feels like you may get food poisoning just by walking by it. It looks like a scary dive dinner. Fortunately, Cottage Cafe is NOT a scary dive dinner, and it will NOT give you food poisoning. Think of the Cottage Cafe as a scrappy stray dog. He's dirty on the outside, but he just needs a bath because inside his heart is gold.  The interior of Cottage Cafe is clean and feels like a classic country eatery. When we arrived it was absolutely packed, but it had a sort of \"home\" feel to it. We had about an 8 minute wait, it wasn't anything terrible considering the number of customers, which we took as a good omen.  Our server ended up being the sweetest lady, and she hooked my friend up with his ridiculously custom breakfast burger order. It arrived just as he asked!  The menu prices were surprisingly low and portions large that it almost felt like stealing. The \"baby pancake\" ended up being the size of a human head. Do not let the name fool you.  I ended up ordering the \"big breakfast\" for $6, which has amazing value. I had 2 scrambled eggs with cheese, bacon, hash browns, and 2 pieces of toast. The melted cheese on the eggs was just a slice of sandwich cheese, which was kind of strange, and I like my hash browns a little on the crispy side. Both of these are personal preference, though. Overall, the meal was incredibly considering what you pay for it. It would cost you almost this much to get a breakfast meal from McDonald's.  I am recommending Cottage Cafe because of the value and the incredibly sweet servers that will help you customize your meal. I would not be recommending Cottage Cafe if the prices weren't so low. For the price, the food is great. I would just expect  higher quality if the prices were to jump immensely.   Go to Cottage Cafe and get a meal that will fill you up for cheap without feeling awful afterwards."}
{"text":"We were craving breakfast on a Monday after 11am and Yelp led us to the Cottage Cafe. I was initially discouraged by the darker decor and lack of outside seating. But the restaurant was clean and we sat ourselves by the only window.   Their menu reminded of Denny's. I ordered the steak and eggs (probably the cheapest I've ever paid for one at $8.49) and my friend ordered the big breakfast. She also ordered a cinnamon roll ($1.99) that exceeded expectations. It was warm, light and sugary; you should definitely order one to share. The coffee was on the weaker side but I enjoyed it. We both enjoyed our food; it's definitely nothing special but well priced and cured our cravings.   Service was excellent. Our server got slammed by 6 tables arriving practically at the same time. But she handled it well, still very attentive and friendly."}
{"text":"Amazing pancakes, love the menu, kid friendly, kind wait staff, great service including the young man at the cash register!  Highly recommend :)"}
{"text":"Server was quick to take my order and the order came in a timely manner, but she was pretty standoff ish when I told her I didn't care for my meal. The food was blah. I ordered eggs benedict. The eggs were overcooked, the sauce bland and the hash Browns left much to be desired. I won't be back...."}
{"text":"Love the clean friendly atmosphere ! Very good place for breakfast and will be back soon"}
{"text":"I had Oreilly potatoes. The eggs were perfect but the potato dish was a bland mush with a slice of American \"cheese\" semi melted on it. The Mrs. had a cinnamon roll French toast. So so there too. The local patrons were plentiful which is normally a good sign. Our waitress was nice and said she had never had coffee. If all coffee was as dishwatery as the Cottage stuff, I would quit myself. On the good side, the decor is nice, full of nice photos and art. It is a shame that the kitchen art could be as good."}
{"text":"Do you, like me, enjoy Waffle House without irony? Then come on down to the Cottage Cafe. The menu caught my eye on Yelp for having malted waffles, the delicious cornerstone of the WH franchise. Cottage Cafe's are a bit different (they're Belgian waffles instead of the thinner ones served by our neighbors to the south) but have a similar flavor. This morning I was also served possibly the best hash browns I've ever had. Crispy outside, creamy center, and none of that raw potato flavor you sometimes encounter in the less-cooked bits. True to Waffle House form, I ordered mine with cheese. Yes, it's a slice of American that goes on top, but that is exactly what I wanted.   Does Cottage Cafe offer premium, creative, cutting-edge fare? Not by a long shot. They do, however, hit the spot as a cheap greasy spoon."}
{"text":"Cottage Cafe is a Classic Breakfast Joint. Yeah it's a joint... A locals joint. But as soon as you walk in, you will be greeted and treated like a regular.   I had the Biscuits & Gravy special with over easy eggs and hashed Browns. I tried to order a pancake as well, but was waved off and encouraged by the waitress to go with the baby cake.   Turns out that the baby cake was as big as my rather substantial head. The full size pancake ergo must be larger than a grown man's head.   The biscuits and gravy were a hit - smooth and creamy. At one point I managed to get the over easy eggs and hash browns all mixed in with the biscuits and gravy and added several shakes of hot sauce... Delightful. I'd been hankering a big sloppy breakfast for a couple of weeks and the Cottage Cafe did not disappoint!"}
{"text":"In a sea of restaurants serving spring mix on a breakfast plate, Cottage Cafe  serves up a typical, yet well executed breakfast and Lunch menu, sans spring mix!  This place takes me back to a time when I would expect to be asked if I want to dine \"smoking\" or \"non-smoking\"! The service is generally friendly,  and the kitchen staff are well disciplined in the art of short-order cookery.  It's a simple pleasure in life, eating an egg that is properly cooked!  By no means are we regulars, but we have eaten here enough over the years, to know that if we want a no-frills, satisfying breakfast or lunch, served fairly quickly, go to Cottage Cafe.   I'm not a coffee drinker, so I can't speak to its quality, but, the servers made coffee pouring rounds, several times during our most recent visit!   Support your local restaurants, eat at Cottage Cafe!"}
{"text":"Stopped by the place on a Sunday at the recommendation of a friend.  Of course my first thought was to look it up on yelp and I was pleasantly surprised to find that it had 4.5 stars.  As we drove closer to the restaurant however I got a bit nervous because it had more of a diner look than I preferred.  It's not that I don't like diners.  It is more so that the food can be hit or miss; though I guess the same can be said of most restaurants.  We walked in and the entrance was packed with people hungrily waiting for their seats.  The hostess was very sweet and was seating pretty quickly which was nice.  They have a good sized menu with of course the normal breakfast fare.  There was also a specials board across the room that caught my eye with its chorizo special.  I am a HUGE fan of chorizo!  I ordered that and was given the green light by the waitress as she raved about how good it was.    When my food came it had a layer of hash browns, covered with eggs, and topped with chorizo.  I had never seen it served this way before and I honestly can't say that I thought I would like it this way.  Well I was wrong.  Like super wrong!  The dish was amazing!  I mean like so much flavor on the hash brown, eggs, and chorizo.  It was so good that I was pretty silent at the table while I sat and devoured the deliciousness!  I asked the others at the table how their food was and they seemed to like theirs as well.  One got steak and eggs for $7.99 and another eggs, bacon, and potatoes for around the same price.  I am very much looking forward to finding myself in Cottage Grove soon so I can have this dish again .  The service was great and my meal fantastic!"}
{"text":"The prices here are really cheap and the food is not bad at all!  I ordered the steak  breakfast with runny eggs and hash brown.  The steak lacked flavor it was a little under seasoned and not a favorite but not bad and I also ordered a side of corned beef hash which was really good.  My friend ordered  the big breakfast which comes with eggs hash brown a side of corned beef hash and also ordered their \"small\" pancake which was the size of a whole plate!  She still finished it.  Good food with fantastic prices! :)"}
{"text":"This is our go to breakfast place in Madison. Great service relatively inexpensive and great food. You won't be disappointed."}
{"text":"I want to give this dump a big fat 0.  My mother and I went this past weekend very hopeful that the food would be good based on the fact they won Best in Madison. How on earth did this place win any award for great food and service is beyond me.   The menu was extremely old, small and the coffee was pure water.   I order the walleye, hash browns, toast and eggs breakfast. My mother order biscuits and gravy  My toast was cold, hash browns had no tastes, over easy eggs were not cooked fully and fish was very small in size.  Mothers gravy was too salty and a thick bunch of sop.   The menu had no coordination. Biscuit,gravy and hash browns? That is nothing but starch!  With that aside, Not only that but the server was horrible. I felt like she ignored my mother and I the entire time. I understand they were kinda busy. Fine. We can be patient. However, she refilled coffees at her other tables and stopped by to tell the customers their food was being made after waiting for so long. We did not receive such treatment. She passed our table several times and never once asked us how was the food or why our orders were taking so long. Not once.  She was a horrible waitress.  Neither my mother or I could finish our food. I took possibly 4 bites and was done. We spent less time eating then we did waiting and ordering. Waitress continued to ignore us, so we got up and just walked over to pay.  I told the cashier the food was horrible and I wouldn't be back. She then stated to us that normally the food is good and she wasn't sure why it was taking the kitchen so long and were getting orders wrong.   But here is the killer... she then leans over and says \" I hate our kitchen staff, we need new ones\"  What kind of place does that? You do no throw your co workers under the bus TO CUSTOMERS! I was beyond flabbergasted.   Just a horrible business, not friendly and food is beyond pathetic.  Do not go here. I have no idea who in their right mind would vote them as \"Best in Madison\" or give it 5 stars unless you do not have taste buds.   If you want great food, coffee AND service, go to The Original Pancake House in Monona."}
{"text":"I had quite the dining experience at Cottage Cafe. Where to begin...  When we walked in the front door, the only people in the place were the staff. They watched us as we stood there, only approaching us after we seated ourselves. Since we had never had Ethiopian food before, we asked for some recommendations. The waitress spoke so softly that I could barely hear what she was saying, but we ended up ordering drinks and three entrees: lamb, beef, and this bean dish. After we ordered, a man came in and placed a to-go order. About 20 minutes after we ordered, he got his food and left. About 15 minutes later, we finally got our food. The lamb and bean dish were very good, but the beef was not. First of all, there wasn't really any beef. We got these chunks of bone, most of which looked like sections of vertebrae, that had a few small pockets of meat buried in the gaps, but that was about it. Second, one of the sections of bone had a few ribs still attached. Normally I wouldn't mind, but considering I have seen beef bones before, I know that THESE WERE NOT FROM A COW. These ribs were small and I am convinced they were probably from a dog or a cat. When we asked the waitress about the beef, she just said, \"Yes, the meat is there.\" Odd.  After we finished eating, the waitress didn't come to take the plates away for a good 20 minutes. After we sat there for another half hour or so, she finally brought the bill. I tend to look over restaurant bills before paying, and in this case, I thought that one of the line items was more than was listed on the menu. We asked the waitress if we could see the menu, so she obliged, but as she picked up the menu, she immediately went back into the kitchen where we could hear her arguing with the chef. She came back to our table, set the menu down, and without hesitation told us that one of the line items was mistakenly overcharged. She proceeded to correct a separate line item from the one I had noticed. I then checked each price on the bill against the prices listed in the menu and found that EVERY SINGLE ITEM WAS OVERCHARGED! I have to give them credit for not even try to be discrete about ripping us off. Anyhow, she took the bill back into the kitchen to correct it and didn't bring it back for about five minutes. It appeared she was arguing with the chef again. Maybe we were just being paranoid, but when we got the correct bill, we paid with cash. I had this feeling that paying by credit card would result in a slew of suspicious charges.   I wouldn't be surprised to find out this place is a front. Meatless meat dishes and shady service aren't the traits of a restaurant that cares about customers returning. Who knows, maybe they just tried to take advantage of us since we weren't Ethiopian. Regardless, dine at your own risk."}
{"text":"Well the breakfast burrito lived up to the reviews.  The wrap was lightly toasted and the mix of flavors was perfect.  I don't want to know how many calories are in the hash browns but they were yummy.  I had the California Club served as recommended with the coleslaw on the sandwich.  I highly recommend having this sandwich.  My daughter even commented that she was surprised to see me eat the whole sandwich."}
{"text":"We aren't strangers to Madison, though we'd never heard of the Cottage Cafe before. After checking the reviews we decided to give it a shot. The cafe may be small, but it's quite bigger on the inside. A popular spot, it became quite packed on a Saturday morning.   The service was in no way hampered, however. Our waitress arrived quickly and promptly brought us drinks. She even brought out a free carafe of Fruit Loops for my son while we waited. What's more is she brought some crayons and a coloring page to keep him busy.   I ordered the Cinnamon French Toast breakfast. It came out looking just like the picture in the menu. The eggs were nice and hot, and the bacon was superbly cooked. The French toast was packed with flavor. My son ordered the kids pancakes with chocolate chips and they arrived first. The waitress brought them just for my boy while they were hot.   Our coffee cups were never empty and my wife loved her eggs Benedict. Hot food, great service, and happy faces. We will definitely be back!"}
{"text":"Great homestyle breakfast, which I crave every so often. Quick service, seat yourself, great hometown atmosphere.   My food was good, but seemed a bit bland for me. I do, however, like bold and rich flavors-so it could totally be me :)"}
{"text":"Third time out this month eating Ethiopian! We're definitely getting around!  Cottage Cafe is about a block away from the Hofbrauhaus, and like the other yelpers mentioned, pay attention when you're driving there.  It's on the right, and you'll see a sign for a Pirinha night club first, and Cottage Cafe is next door to the left of that.  However, you need to turn into the parking lot before you drive past the club, otherwise you're stuck and have to make you u-turn somewhere.    A few people hanging out when we arrived on a Friday evening for dinner.  We chose a table by the right side and noticed how much more lighting there was at this restaurant (as opposed to the other two we've been to).  There was this annoying blue light though directly across from me, it was just a tad too neon.  We have our favorites and so this is what we ordered:   * Vegetarian Combination \"A combination of alicha, collared greens and lentils.\" ($9.90) - I was concerned that there would be only three items in this combo, but  not so!  They had split lentils in red sauce (good, but a bit different from what we've had), green salad, carrots and string beans, steamed cabbage and potatoes, yellow bean thing (that we really liked here, better than the other places), beets and potatoes, yogurt, and collared greens.  So, there was definitely a nice array of things to choose from.  * Kitfo \"Finely chopped, USDA choice lean beef with spiced butter and mitmita - hot pepper.\" ($8.90) - When we ordered this dish, we made a point of checking with the waitress to be sure it was going to be raw beef.  And we went over it a couple of times and she assured us it was raw.  I still had my doubts because I don't think she understood us.  Well, when the dish arrived, our kitfo looked like cooked ground beef.  The Husband and I asked the waitress again if this was the kitfo, the RAW beef, and she said it was!  I was in disbelief and knew my eyes were not fooling me.  Finally, another waitress came over and asked us if we wanted the raw beef, and we said yes.  So they took it back and changed out the beef.  It didn't seem to be a problem for them, I just don't think the waitress understood us at all.  The kitfo was good, not quite as spicy or buttery as Merkato's version, but still good.  It was the perfect amount of food for two people.  Service was fine - the waitress refilled our glasses without asking and brought out more injera (spongy flat sourdough bread) just as she saw we were needing it.  A few other people came in to dine during our visit there.  One gentleman asked if I wanted to join his party for coffee, but I passed.  (I think he was trying to pick me up despite the fact that I was with the Husband!)       3.5 stars  Cash only."}
{"text":"As others have suggested, this place looks rather questionable from the outside (in that regard, it fits into the neighborhood well) & you'll give it a little extra scrutiny because you'll guess it's closed/out of business,   But once you're inside,it's a rather typical Ethiopian restaurant with the usual Ethiopian photos, paintings, etc. on the walls.   What are a little unusual are the mirrored disco ball hanging from the ceiling, and the 5' tall wooden Indian.  They had a tub of incense burning -- smelled nice at first, but then gave me a headache.  The place is clean, and based on the raised stage area with large loudspeakers on it & bar area, on the right night, this place might get rocking -- I suspect with Ethiopian expats on the weekend, and that would explain how the place can afford to stay open -- sadly, I was the only customer when I walked-in at 5:15PM on a Thursday & that remained the case until I left at 6:45.  I ordered the vegetarian platter & an Ethiopian tea.  At first she didn't understand what I meant by the tea, but she eventually brought me a cup of hot, \"spicy tea\" & it was great, though it wish they offered an iced version of it  (it's 100 degree outside,..).   I had to ask for a glass of water.  The food was great, and she volunteered to bring me more injera, which was very nice.      This is my second Ethiopian restaurant foray in LV & I'm sadly concluding that here they do not bring you the hot wet towels to wash your hands before the meal & the cool wet towels to wash them afterwards, so be sure to wash your hands right before you come here, & especially if you like the food, you'll need to scrub them when you leave.  I'm looking forward to trying more Ethiopian places here in the LV area, but I wouldn't hesitate to come back to this place."}
{"text":"Old school greasy spoon food and very nice service. It's a throwback to another time and a good one at that."}
{"text":"what a great place for breakfast was in town for a hockey tournament and wanted to eat somewhere other then the hotel lobby. What a great find this place was. the service was fantastic and the food was good. Had the french toast breakfast with corned beef hash. Owe my was it good! Wife had an omelette which was good. She was not fond of the canned mushrooms used in the omelette, but that does not bring down the rating of this place for me. Amazing how good the coffee was. If I am ever back in Madison, I will be having breakfast here"}
{"text":"Yummy food, great prices, and wonderful service. Reminded me of a place my grandparents took me to regularly when I was a kid. Warm, family-friendly, cheerful."}
{"text":"One virtue of the Cottage Cafe is the low hipster to real people ratio for Madison. There's only so many bearded and tatted young people one can bear at any one time.  Had the Eggs Benedict this time and that can be risky, but not at the Cottage Cafe. Lorraine the waitress was right on the mark when she said it was excellent.  Check out the size of the ham slice in one my photos. All portions were so large I ended up eating 1.5 meals.  Parking lot still needs to be repaved or holes fixed."}
{"text":"Short staffed (as I'm typing this) and still managed to make my family welcome and didn't keep us waiting at *all*!! We had a super nice waitress named Laurie, which I'm only saying her name because if you go there, hopefully she's the one to serve your table- super nice, on top of everything, etc. I got a medium sized burger with fried onions on it and french fries with it. Burger was good, buns not my favorite, but was still good. My parents both got breakfast. My dad finished everything and left his plate spotless.. aka he loved the food, haha. (Plate sized pancake, eggs, corn beef hash & my mom had an omelette and toast!) They don't set out napkins so make sure to ask for them if you're gonna need them. Overall, I hope to come back again! Recommend 10/10!!"}
{"text":"Really great experience. They greet kids with little containers of fruit loops. The coffee is piping hot, the prices are some of the lowest I've seen in the area and the food was pretty solid. My one complaint is that there is no way their biscuits are fresh or baked in house. Taste like Sodexo fare. But smothered in sausage gravy you can ignore that and move on. Next time I'll try something different. Service was spot on."}
{"text":"Came after church. Was recommended by our preacher, Baxter, who comes early every Sunday. I planned on getting breakfast until I saw the table next to us receive their order of chicken noodle soup. I switched to soup and a sandwich. So worth it. The soup was flavorful with lots of chicken, veggies and the best homemade noodles!! My husband had the large burger and fries and it was an added bonus to get the spicy mustard which he loves. When we came in our table was the only one open so I expected a wait but the waitress tended to us right away. The food came fast and she was on refills and was very friendly not only to us but in convos with other costumers. Will definitely return!!!"}
{"text":"Pretty interesting place for lunch. Ambience was very nice and the different smells from the kitchen were quite flavorful. I accompanied a friend from Canada, who raved about the great Ethiopian food in Toronto, so we met up at Cottage Cafe to sample their food. Im not sure what I was eating as I let him order, but I did like the lentils and the beef! Couldnt tell ya what I ate, but it was good! And the fried coffee afterwards was worth the experience!! Yes I will go back and eat there again, anyone game to go with me??????????"}
{"text":"Great little place off of cottage grove road right by Dream lanes. This is a great little mom and pop joint that serves great breakfast. I ended up having the Walleye breakfast. It was great. In addition I Had the corn beef and hash which was great! It was cooked perfectly and I definitely recommend it. The coffee was a little watery, but it isn't enough to down grade it. The breakfast came fairly promptly and the waitress was great!"}
{"text":"I might be biased in my opinion of cottage cafe due to the numerous memories I have of having breakfast with my mom, dad and grandfather. At cottage cafe don't expect to see elaborate fruu fruu farm to fork style food. Here you'll find the basics, egg any style you want, pancakes, omelettes, and eggs Benedict for breakfast.  The staff is the best, they are friendly and always greet you with a smile. If you become a regular, like my mother is, they'll bring your usual drink order as you sit down! I highly recommend Cottage Cafe for all greasy spoon restaurant lovers!"}
