{"text":"While this place is great for a variety of sandwiches along with the best, fresh pizza in this little town, I just stopped by after seeing the \"Fresh bread\" sign in the window.  On a cold, rainy Sunday, who does't need fresh bread for dinner? In one word-wonderful.  Freshly made today it will be great for dinner or sandwiches.  And, reasonably priced. Look for the sign in the window!"}
{"text":"We ordered pizza. The crust was not homemade and tasted like it was either frozen or pre-prepared.  Will not be ordering again and would definitely not recommend.  Chain pizza is better."}
{"text":"I had a thin crust pepperoni and sausage and a cinnamon sticks. The order and delivery staff were friendly and timely. The pizza was good and the crust was crispy. Following it up with some of the best breadsticks I have had in a long time was awesome. These guys are my go to pizza place in Bridgeville now."}
{"text":"The other day my family and I tried Country Style Pizza for the first time and we were very impressed. We ordered three different kinds of pizza and they were all delicious. This is easily one of the best pizza places that we've tried and we will definitely have them again next time we are in town."}
{"text":"I must start by saying this is thd best pizza I have had in the Bridgeville area around my shop.. Everything about it is great. Great taste, customer service. They are very kind and inviting. I love the different drinks. Glass bottled soda just like when I was young. Thank you for your service.."}
{"text":"Don't try to use a Groupon there if you bought one I purchased two of them I used one a few weeks ago and no problem with the order then I have an identical order go to use the Groupon and they tell me they can't accept it on this order don't know what's that about not  can't lie I thought their pizza was good but they don't honor  Groupons"}
{"text":"Delicious pizza!!! Definitely recommend. Enjoyed the Lakemont Pizza along with one of their deep dish pizzas and a baby back rib pizza - very good, everything."}
{"text":"Friendly, owner-operator kind of place that names Country Style as \"global headquarters\" on the owner's business card. Eggplant parm sandwich was tasty and spinach toppings were fresh. Crusty, warm, pizza dough served as the sandwich bread. Take away or delivery only - no eat in option. Solid, if slightly unique sandwich. I'll be back!"}
{"text":"The pizza is always phenomenal but sometimes just a bit too much topping for a pie. Every pie is worth the money and the guys are always great to their customers. You don't need the typical size pie bc their pizzas are thick and full of topping so your belly is expanding quickly."}
{"text":"We have had pizza from Ca to Pa and Myrtle Beach SC. I believe this pizza was the best ever. Ordered tomato basil and hamburger pizza. Herbs are from his garden too. Awesome!! The owner Steve is very friendly and we enjoyed talking to him. Great person. So if you are passing through Bridgeville Please stop by. You will love it!! We will be back !"}
{"text":"I'm new to the bridgevill area and i stopped in for the first time and had a buffalo chicken sandwich, it was delicious! I'm definitely going back"}
{"text":"This is the best quality delivery pizza I have ever had from PA or CA where I grew up. The dough is delicious and they load on the toppings which is a big plus for me. I have ordered delivery on numerous occasions and they are ALWAYS earlier than quoted. Two big thumbs up!"}
{"text":"I've lived about 2 minutes from this business for 10 years and I finally tried this place out because of awesome reviews. This is truly the best pizza I've had. They have so much to choose from. I got the baked spinach pizza with tomatoes added. Absolutely amazing. I love that they have dessert pizza. Service was awesome and they delivered our pizza pretty darn fast. I will be back very soon to try some more amazing specialty pizza's that look delicious on here."}
{"text":"This is my new favorite pizza joint.  I called to place my order and had some questions about the various pizzas they offer.  The person who answered the phone was pleasant and very informative.  He described the pizza and explained they are also a bakery so the pizza crusts are made fresh daily and never frozen.  They have both thick and thin pizzas and can do most with either crust.  They do not have a fryer so there are no fries or wings available.  The delivery guy was pleasant and called when he couldn't figure out which house was mine.  The pizza toppings were fresh, not frozen.  We had a pizza with sausage and mushrooms which was pretty good.  The spinach and artichoke pizza was the best I have ever had.  The spinach was fresh and There was a ton of it.  I will definitely order from them again."}
{"text":"Exploring my food delivery app and found Country Style Pizza.   If good pizza = Country then fire up some Kenny Chesney.  The pizza had great flavor.  I like their addition of cheddar cheese to the pizza topping.   I will definitely order from here again.  The pizza was on time, hot, and very tasty."}
{"text":"Service was good and food was delivered on time!  Pizza was okay but not my favorite.  It had a thicker crust than I was expecting and was greasy.  Ordered salads too and was surprised to find them served on top of a cheesy pizza crust with a side of some kind creamy dressing that had the consistency of sour cream."}
{"text":"omg.... if not for yelp24 id have never known this place existed.  i have seen the face of the pizza god, and he is good. There should be a religion based off this pizza. This is the first nacho/taco pizza ive ever tried that didnt taste like it crawled out of a toilet. Im a glutton for punishment though, so i decided to try it from this place, and i was pleasantly surprised. This is now my favourite pizza."}
{"text":"Their pizza is excellent. We ordered right before closing and yet owner was accommodating. We selected the broccoli and cauliflower pizza as well as the excellent eggplant. The eggplant Parmesan that topped the pizza was hand-breaded while my husband waited. These pizzas while not traditional, was creative and tasty. Support this local business!"}
{"text":"Ordered a thick crust cheese and a pepperoni. Love the sauce and the crust. Very good pizza and fast service."}
{"text":"This is some great pizza!  You need to try!  Staff was super friendly and right in the heart of Bridgeville!"}
{"text":"This is my favorite pizza spot in Bridgeville!  It's hidden away near the library, so glad we stumbled upon it.  I love their taco pizza and and the thick crust traditional pizza.  If you haven't given them a try yet you're missing out."}
{"text":"HOW does this place have such good reviews? We just tried it and were blown away by how awful it was. The pizza crust tasted pre-made from Sam's club and frozen, with hot pink hued sauce & way too much cheese. Nasty canned mushrooms. The best (worst) part tho was the salad- we ordered a straight up garden salad right? Except it came ON A PIZZA CRUST. It was like hoagie toppings on a pizza crust. As for all the wonderful reviews? All I can assume is that the fine folk of Bridgeville haven't tried good pizza before."}
{"text":"Take out or delivery only.  No place to sit.  The guys working in the shop were very friendly, talkative, having fun and made sure everyone waiting was part of the conversation.  Flatbread style pizza with homemade flatbread.  Many sandwiches on the menu, too.  There are many different types of specialty pizza including 5 or 6 vegetarian pizzas, a pierogi pizza, Smoked Baby Back Rib pizza and pizza deserts.  Someone waiting said some of the desert pizzas are really good.  We just had a regular pizza and it was good.  The flatbread crust was good, thick and crunchy."}
{"text":"We got a small pepperoni pizza and a small eggplant pizza. Pepperoni was good, eggplant was ok. The eggplant was too thick and kind of chewy and heavily breaded. Picked it off, ok pizza. Overall it was fine. Nothing special."}
{"text":"Great pizza, the dough is sooo good!!! I like a lot the tomate sauce they use, it's super yummy, and thick enough to make you feel like a home made sauce, ohh so good!!"}
{"text":"These guys have been around forever and the pizza is probably some of the best around. I lived very close and was always happy to order out for dinner rather than cooking. It's strictly a shop for pick up only or delivery, not a restaurant. The pizza sauce has such a unique and robust flavor unlike any I've had before. I'd love to get my hands on that recipe for sure."}
{"text":"Listen.  I'm not one to just willy-nilly try new pizza places, especially with 'Country' in the name.  BUT.  Yelp reviews totally convinced me, and I'm SO SOLD!  Just had my first pie delivered.  What everyone says is true, they were 15 minutes early.  But not only that, the pizza was still hot, and the crust was not even the slightest bit soggy or wet.  Best crust I've had on a pizza in a while, other than what we've made at home.  All the toppings were fresh, the delivery kid was really nice, AND he even read the note where I said to knock because the doorbell is out.  I am so pleased.  The price was reasonable for extra toppings and delivery.  I'm excited to order again!  All I've wanted since moving here was a good pizza place that delivers.  I'm thrilled to have found it!!!!!  Thank you, fellow Yelpers!  Without you, I would NEVER have found this place."}
{"text":"Delicious pizza, always delivered in less than half an hour. My favorite is the thin crust pizza with spinach. The spinach is sautéed so that it's nice and moist - not burnt to a crisp like most pizza places."}
