{"text":"Walk into the place around 8pm.  A quick scan of the place revels that there are 3 people in the place, two of which worked there; This is usually this is a bad sign.  But this placed seems ok.  The chicken sandwich I ordered was great.  The keg was fresh, according to the bartender.  The service was fast and the bartender very friendly.  I would come back if I was in back in the area."}
{"text":"In downtown for work and yelp for a good burger place and decided to give this a try..easy to find location, seated right away at the bar lunch crowd was filling up and people were being seated in the upstairs. Ross the bartender went over the menu got me a drink and recommended some items. went with the burger insanity chesse, mushroom, red pepper. and coleslaw for the side...burger was good perfect i was alittle sadden by the lack of mushroom and peppers but after the first bite i was glad the burger was sesoned great and had great flavor the toppings didn't override the burger but added some unique flavors ..the bun was soft and held together. drinks were refilled regularly and i was checked on often ...so have to say the Courthouse Tavern was  a good find in a city with lots of choices."}
{"text":"I live on the same block, and the sewage-sucking truck had been by to \"clean up\" this place 3 times in 3 months. Ick. The first time, the health department closed them for a day."}
{"text":"Great potatoes, sandwiches, and quesadillas. Friendly staff. Not a sports bar fan, but this is great food."}
{"text":"Food is good, but you may have to wait an hour to get it, happened on 2 occasions. Will not return."}
{"text":"I used to frequent this spot pretty often a few years back and it was very good...the wait staff was awesome...food was decent...sandwiches, wraps and such. Not the best, but good and fast. Solid lunch place.  My wife and I stopped back in today and had a terrible experience...not sure what happened since the last time we've been there, but I can guarantee you that we won't be back.  Restaurant wasn't what I would call busy...slightly full. Plenty of open tables available. We stood waiting for a good 10 min to be seated while the two waitresses walked around doing nothing and chatting. An enterprising bus boy eventually came out of the kitchen to seat us...waited for another 10 min while the servers continued to ignore. The bus boy came out again to take our order and give us drinks.  We sort of shrugged, holding some loyalty to the Courthouse of old hoping for the best..but it just got worse from there. We waited for our orders for another half hour...waitresses *still* hadn't bothered to check in at the table. My wife could actually see several tables of food sitting waiting to be delivered while the waitress inexplicably filled half full beers and wandered aimlessly.  The CHEF started delivering food. Needless to say...it was cold. We didn't have silverware, so my wife asked the waitress as she was wandering by for some napkins and the check. (It's lunchtime...we had been there for 50 minutes and both had to get back to work) Waitress responded by sort of looking back and mumbling something. 10 minutes later, she shows up with a napkin and says something about the check. ANOTHER 10 minutes later we STILL didn't have the check.  I had to get cash from the ATM, estimate what we owed and leave it on the table because after being there for nearly an hour and a half we never did get the check... I have some advise for the owner(s) of the Courthouse...fire your wait staff before you lose any more customers."}
{"text":"A quick review of a place I went to luch today...  Courthouse Tavern is your standard Bar & Grill. No frills (although a nice TV setup behind the bar). Standard fare (apps, burgers, sandwiches, etc.). Decent service.  I had \"The People's Choice\" sandwich, which was a chicken breast with provolone, bacon, and grilled red peppers. At first, I thought it was a tad small, but it turned out to be prefectly portioned. It would have been nice to have more than 2 grilled peppers on it, but overall, it was VERY tasty. I will get that again. It came with red potatoes, which were just OK. Nothing special.  Warning to any tea drinker: they only have \"soda-fountain\" tea, so it was (Bill Walton voice) \"terrrrrruhbull\".  The service was fine. Nothing fancy, nothing bad.  I will write more upon my return to Pitt, when I go back for wings/beer (which I almost did today)."}
{"text":"I stopped in to have a seasonal pumkin beer, and the Courthouse Tavern delieved.   I had a Horny Goat pumpkin ale, that was on tap. It was oh so yummy,  just the right amount of pumpkin, nutmeg and spice."}
{"text":"Went there today for lunch with a friend.  Food was ok, not too shabby for the price.  But the service was atrocious.  It wasn't that busy in there and took forever to get our food (25 minutes for a salad and a burger).  Meanwhile our server was eating her lunch from behind the bar.  Even after we received our food it took a little bit to get silverware and napkins...I started eating my salad with my hands.   Place is tolerable, but with all the other choices in the 'Burgh don't go here."}
{"text":"Stop by this place on a regular basis. They have a new chef who make's the most unbelievable dishes! He is very creative and the food is GREAT! But enough about him,,, you have to stop by and see the 6 foot blonde bartender with the great ass and the big tits!!!! She doesn't move fast, but it's worth the wait!"}
{"text":"My friends and I used to come here for lunch at least once/week for over a year. I'm not sure why we lasted so long.  The menu offers a good variety of various bar foods. The warden burger, the atticus finch burger, various salads and sandwiches, etc.  The service is decent but the food itself is hit or miss.   Sometimes the burgers or steak in the steak salad were properly cooked, others times not so much. This inconsistency in the food led us to consider other places."}
{"text":"Two of us came here for lunch on a Friday afternoon. The place was moderately busy but I wouldn't say it was packed. Three waitresses should have easily been able to handle the crowd.   We sat down right away and a waitress came over to take our drink orders and bring them out almost immediately. About 5 minutes later, a different waitress came and asked if we had ordered yet, and we placed our order with her. We each ordered a house salad, a cup of soup, and an order of fries to split. The soups (French onion) came out within 5 minutes. Good, but lukewarm.   About 25 minutes go by and we start wondering if we are going to get the rest of our food. No one ever stopped by to ask how we were doing. Seemed like our waitress was too busy chatting with some young male customers a few tables over. 5 more minutes and we get ONE salad, followed by the other 5 minutes later. Again, salads were just fine.   We received the check about an hour after first arriving, and of course the fries, which we never received, were on the check. Told the waitress when she came back to pick up the check that we never got the fries and asked if she could just take it off the check. All that she replied was \"ok.\" No apology whatsoever.   The food was okay, the service was horrible. I'll be the first to admit that I hate chit-chatty waiters, but this girl had absolutely no interest in us at all. And I think we at least deserves an \"I'm sorry\" about not receiving the fries we order"}
{"text":"I met up with a friend here for lunch, it was my first time here and I'll probably be back.    The place didn't have many people in there which is odd for a Friday afternoon, but that meant we got a seat quick and got our food quick.        All in all the menu is pretty standard bar fair, this isn't some trendy joint, but it's relatively inexpensive so   for some basic fair it's worth stopping in."}
{"text":"Being a city I've spent barely any time in, when I saw this bar pop up as the only true dive bar downtown for a Saturday night at 9pm, one I was concerned for Pittsburgh but also realized it could either be the lawyer hang out, or, what it was, where the other side of the law may linger.   When I entering we were welcomed by a guy who was spouting epithets at the bartender about not being treated as an equal, racial slurs, and making his case that he hadn't received the drink he paid for (which, according to witnesses he did). Amidst the fracas the bartender was still prompt on service.   This space is brightly lit, all 9 people in the place were at the bar, and the touch tunes juke box is just waiting to be taken over by Britney and Miley songs. I don't know what the standard is for Pittsburgh beers on tap, but the list here was impressive. Great Lakes had the most featured.   Being felt hung out to dry, errr, abandoned in the cold on empty streets around our hotel felt really odd. If you're staying at any hotel in -- The Point district? -- prepare to either spend $10 on craft cocktails in crowded rooms, cheap drinks at gay bars (good on you, Pittsburgh!), walk to Market Square for Winghart's, or leave the area. Or, well, go to Courthouse Tavern for a low key -- despite the sole despot killing the good vibes -- drink in the booths at Courthouse Tavern."}
{"text":"Had lunch at the Court House tavern today. I sat down at the bar and waited for the server to get done chatting with the guys at the end of the bar. About 10 minutes later I was noticed and in an almost sharp tone she asked, \"What can I get you?\" I asked for a menu and a sweetened ice tea. I got an unsweetened ice tea.  Looking over the menu I decided on the Warden Bacon Burger. On the menu it read, \"Burgers are 8 oz. ground chuck, made to order, on a wood chip griled, served on a kaiser roll with your choice of french fries, red skin potatoes, home fries, sweet-n-sour cole slaw or vegetable of the day.\"  After what seemed like another eternity watching the server chat with a few of the other gentlemen, she came over, asked what I wanted and took my order while pouring a shot of Jack Daniels in a glass never bothering to make eye contact with me. I told her I'd like to have the bacon burger with provolone, tomato, onion and pickle. After pouring the Whiskey she  made a phone call and chatted to someone about the road conditions while placing my order.  I never got a chance to ask what the vegetable of the day was.  I would have most likely chosen that or the sweet-n-sour cole slaw but my burger came with french fries.   On a positive note, the burger did come rather quickly. It had everything I asked for on it but also had lettuce which I didn't ask for and took off. For the most part the burger was pretty good. Had a charred coating on it that you would expect from a firewood grill and was nice and juicy on the inside. Was it worth $9.00? Probably not. I've had burgers just as good in this city for less.  I paid for my meal with a card but didn't include a tip (I'm usually a pretty good tipper) and wrote on my check, \"Service was rude\". I will not be back."}
{"text":"I used to come to this place on a monthly basis but haven't been here in months. Well, before they were fined by the health department but decided to give it another try. Had lunch there today with several friends. We sat at a table, but should've sat at the bar.   Service was horrible, to the point of nonexistent. Server forgot our beverage order, then the food never arrived. We waited for over 50 minutes. They had one bartender, who was also doubling as the waitress for 11 tables, plus the bar. This place is understaffed and run very poorly. I wouldn't recommend going there. If i could give less than one star, i would."}
{"text":"Note: Courthouse Tavern is open on Sundays, but according to their website, it's only for \"special events\" or during football season. I've added the hours of operation to the listing. Hopefully, they'll appear soon.   I must say that the $50 on my Just Pay Half Hot Card certainly got me around the city a bit. First it was Bloomfield's Lot 17, followed by Scott Township's disappointing Nobby's, and lastly, Downtown's Courthouse Tavern.  I'd avoided this place simply due to a wrong assumption that they were near the Allegheny County Courthouse and therefore were only open during banker's hours (they're actually a few blocks down the street from it). Alas, some research revealed that they're open late until the evening. Smacking myself upside the dome for not using Google sooner, I made it a point to hit up Courthouse Tavern ASAP after work one weeknight to use up my remaining 10 bucks of credit.   Amidst a jury of blue-collar folk like myself...He waited for me with a gavel in one hand, and a noose in the other...  http://www.youtube.com/watch?v=u-FLsp0ee50  Comprised of a premium 8 ounce patty of medium-rare ground chuck, breaded onions, pickles, and a \"secret sauce\" between a halved pretzel roll, he strode into the darkened room, declaring me...  http://www.youtube.com/watch?v=Aj04cyXOQF4  And he wasn't just any kind of judge...  http://www.youtube.com/watch?v=tX4Tp55UyLA  My crime? Failing to recognize the Judge was a worthy burger, and this was a kangaroo court!  \"Thou hast forsaken my majesty!\" It bellowed.  \"Face me!\"  Thus, our courtroom clash began!  http://milehighcomics.com/cgi-bin/backissue.cgi?action=fullsize&issue=54721413440%2051  The hearty pretzel roll proved absorbent considering the juices from the beef and the honey mustard/Caesar dressing alchemy that was the yellow sauce. The breaded onions provided texture to the burger while dill pickle medallions added zing to the proceedings, countering and complimenting the sweet canary-colored condiment.   Justice was served. Justice was tasty. Justice was done, and I had won...  http://www.youtube.com/watch?v=EGFp7saTQEU   P.S. A nifty sweet/sour cole slaw helped cleanse my palate before tackling the burger.   P.P.S. To address some of the other reviews, the service was fine, and the multiracial clientele behaved themselves.   P.P.P.S. I brought home with me the Up the Creek Salmon Salad for my darlin', and she was very happy with it."}
{"text":"This is another place that just popped up on my list as \"you should review this\" when i swear I reviewed it back in May 2014.    Anyway, stopped here for lunch and it was a decent experience.  My chicken sandwich with bacon and cheese was good.   They had a decent beer selection although the beer I got tasted funky.  I should have ordered something that was ordered more frequently because mine tasted like old tap line gunk.  The lady bartender was nice.  Decent choice downtown."}
{"text":"Stopped going a while back. Food's good, but the service just sucks. Bartenders spend too much time chatting each other up. There's better beer selection and ambiance elsewhere, even in downtown."}
