{"text":"Finally an authentic sandwich place in Mac Towne! Beef is amazing! The brisket sandwich with cheese sauce is absolutely fantastic! Additional topping selection is good. Slaw is great too!"}
{"text":"Tried their new location in McKenzie Towne SE. Expertly smoked meat, fresh condiments and great service. Welcome to the neighbourhood, we will be back!"}
{"text":"The CowTown Beef Shack is a pretty unique spot in town to grab a sandwich, and I'm a fan.  

Just a small drive thru kiosk on the side of Macleod (in its former life the building offered up espresso), it aims to serve a few different beef on a bun sandwiches:  cheesesteak, beef dip, and BBQ beef.  

The menu is simple, but the beef sandwiches are tasty.  

They advertise catering services too, so my assumption is that the owner originally opened The Shack as a way to fill up his week outside of catering events.   

At any rate, it's a super friendly operation, and throughout the summer - when people are eating outside at the picnic tables--I'll often see the owner taking time out to visit and chat.

Now, I'm a fairly regular sub eater, and more often than not I'll grab something from the big chains because they are nearby.   But it's pretty much a no brainer that given the opportunity, I'll steer clear of processed meat subs and get the real deal at CowTown.  

It's the type of local business I'm happy to support."}
{"text":"My favorite beef dip sandwichis from a restaurant called Portillo in Chicago, I have never been able to find a restaurant to matches the flavour and quality until now... Cowtown has got it right, best beef dip in town"}
{"text":"Just stopped in at Cowtown Beef Shack while waiting for another shop to open nearby.  I ordered the beef dip sandwich and it was absolutely amazing!!!! My husband and kids weren't hungry and still ate half of my sandwich.  We will definitely be coming back for more!!  I'm glad we went in.  Friendly place, excellent beef/flavour and all-around pleasant experience."}
{"text":"Excellent pulled pork sandwich. Prices are fair and worth the food quality. Went with 5 people and there was nothing left of our meal. It was a totally satisfying meal. The only thing that could use some improvement was the tables, they were a bit wobbly. Staff was nice and welcoming."}
{"text":"Very good value. Meat was very tender and tasty. You must try the smoked meat. They shave it!!! Yummy."}
{"text":"Located across the street from SAIT, this incarnation of the restaurant is streamlined for high throughput student traffic, with a simplified menu of smoked beef (the old location did pork too) with various topping combos like philly cheese, and a minimal number of side dishes like poutine. The quality and flavor of the beef was good, and the bun was a nice egg bread. Pricing is also student oriented, with large and quite plentiful sandwiches for under $10. A quality fast food, local meal."}
{"text":"This is indeed a shack (drive-through only), but both the roadside sign and the smokey flavor are too big to miss.  I had a pulled pork sandwich, and on the advice of the gregarious man-in-the-shoebox, topped it with a combo of BBQ, hot and honey mustard sauces.  Together with the cranberry slaw, these sauces melded nicely to accompany the great hardwood smoke flavour of the meat.  The portion was enough to satisfy all but the hungriest, and at $8 is pretty good value for money.  

The only part of this sandwich that could use improvement would be the hoagie bun, which lacked a bit of structural integrity for in-car eating.  But this is like pointing out that the Mona Lisa has no eyebrows. Like a museum, they are open 11-6 Monday through Saturday, so get your BBQ fix on the way home, or take a group order and impress your officemates with your low-and-slow food savvy."}
{"text":"Proper. My girlfriend and I went in and ordered the beef dip and pulled pork. What we received was phenomenal, friendly service, and the best sandwiches I've had. EVER. You know it's a true gem when the owner chats with you and gives you samples of different menu items to try out.

Proper BBQ. Proper service. Definitely will be back!"}
{"text":"Was craving some beef dip and decided to check out this local business.

Was very glad I did.

We ordered a barbecue beef, beef dip and pulled pork. Portions were above average and very moist.

Wish I would have gotten some au jus for deeping my Roast Beef dip into.

Would recommend this place to friends anf family, I will be back for more."}
{"text":"As far as drive thru food goes, this is the best(provided you like beef). The portions are generous for the price. The beef is always moist and never stringy. I  had a friend try the pork and he said it was the best pulled pork he ever had.  Brad the owner is alway friendly and in good spirits. After reading the other reviews, I'm going to try the briskit next time."}
{"text":"Amazing! Can't say much more, food is unbeatable and service is top notch, had a beef dip sandwich and smoked meat and it was absolutely perfect. You gotta try this place"}
{"text":"I had a bbq beef sandwich here today. Wasn't greasy and exceeded my expectations for how cheap it was. If you like roast beef make sure you stop by. The service was good too and he was just about to close up. I plan on going back in the near future."}
{"text":"This place is simply amazing. I was in for work and found this place.  The staff was super helpful and friendly and were very open to helping me out. 

Pulled pork was delicious, baked beans a bit salty but full of flavor. I also tried the slaw and that was just as good as the rest. 

Next time I'm in Calgary I will stop by again and try the brisket :)."}
{"text":"Wonderful Beef dip good flavour tender meat fresh bun.  Disappointed there was no brisket available as stated on their website.  Pepsi products for drinks was another bummer.  Parking is another difficulty at this location.  Still one of the best meat sandwiches around."}
{"text":"Amazing!!!!
The smell when you walk in the door will instantly starving! 
Pure heaven if you are a meat lover.
We assumed it was the owner that was helping us, he was so friendly and chatty
We bought the large in both beef deep and the BBQ Beef with cheese so that we could split them and try them both
I was full all night from just the sandwiches alone!  
It was so good, I have found my new favourite place to eat!  
I absolutely recommend this to anyone who loves beef!
Home grown and hormone free!  who could ask for anything more.
Nothing better then Alberta Beef, slow roasted.
YUM!!!"}
{"text":"Wow I love this place.  The owner/chef is always friendly and charming, dressed in his chef's whites.  The beef dip is my favourite, so flavourful with a tasty provolone cheese and the best au jus ever.  I am so sad they are not open Sunday, 'cause I can't get there on weekdays due to work, but I'm a regular on Saturdays baby!"}
{"text":"I don't know. I mean, hey, it's in a shack, this is Calgary, things aren't supposed to be done this way, how fun! But the food is not up to proper BBQ standards. I just wanted some brisket. You know, brisket. Just brisket. You order it, they take the slab, then they cut it into slices, weigh it, and then give it to you. Then you take the brisket in your hand, then you put it in your mouth then you eat it. Just that. That's it. I get strange looks from BBQers in this city when I try explaining this to them. I mean, you could order some slices of bread (you know, regular slices of white bread), wrap the brisket in the bread, then dip it in the sauce if you wanna get really kRaZy. Apparently people are unable to do this in Calgary. Some kind of disability. Who cares if I am giving them my money, they just don't do it that way. Im-possible. This is as ridiculous to Calgarians as renting instead of owning. Everything has to be on a bun. Just like what every other place does. Whatevz.

After making a scene over their inability to just give me some brisket, I asked for some BBQ sauce after ordering a brisket-on-a-bun. The lady said that this was not possible. The shaved brisket is either soaked in BBQ sauce or not and that's how I'm gonna have it. No way to get it on the side. BBQ is about choice, not being told what to have, so I got pretty Canadian/offended and acted Canadian/passive aggressive over that.

The \"brisket\" was, meh. The sauce was, meh. The bun wasn't that fresh, the baguette was crusty at one end. The only condiment offered was onion. No jalapenos, no bbq sauce, no pickles, no nuthin'. Typical run of the mill brisket will have some hickory or wood type smokiness to it, this did not. It just tasted like a mass produced beef on the bun you would get at the stampede. The sauce had nothing to it. No kick, no pizzaz, no ho-yeahhh. Maybe a bit of a vinegary taste to it. I asked her if they smoke on site, she pointed at some stainless steel contraption hidden off in the kitchen. This explains the blandness. You smoke out of iron, not stainless steel. The lack of BBQ sauce on the side is a disappointment. 

If you have had proper BBQ, you will be disappointed. If you are accustomed to the Calgary beef on a bun mediocrity and have never had proper BBQ, you will probably rate this place 5 stars. What pisses me off is that all it takes for this place to vastly improve is to put a bit of effort into the food instead of focusing on the simplest and quickest method of preparation. You'd think a \"shack\" could try a bit harder than Big Ts.

I mean, if this place purports to be a YYC style beef on a bun, fine. But don't claim you're \"authentic Southern BBQ\" when you do un-Southern things:
a) Smoking in a woodless stainless steel contraption.
b) Pre cutting and mixing all the meat together in order to maximize yields.
c)  Not serving meat by the pound...
d) ...instead serving it on a BAGUETTE only
e) Dousing the meat in sauce, instead of serving the meat the way it should be: smoked and unadulterated."}
{"text":"Add this to my list of \"my God why didn't I try this place before\" places. Like the others have mentioned, this road-side stand does fantastic BBQ beef and smoked brisket on a hoagie roll at a dynamite price, all served up by a super-friendly dude in less time than it would take you to grab a gut-buster from Rotten Ronnie's. 

At the owner's advice, I had the smoked brisket. I was happy to see that while the brisket was sliced quite thin (freshly sliced might I add) there was a nice balance of meat, crusty edges and fat, unlike the mushy, chopped, steam-tray resting beef that some of the city's supposed BBQ royalty (or should I say high priests) serve up. 

I was also pleasantly surprised by the toppings. I ordered mine 1/2 plain to really check out the meat, and half chef's choice. This turned out to be: sliced onions, a little bit of hot sauce, and a little bit of what appeared to be a provolone cheese sauce. Plain was great, and the meat holds up, but hot damn the next time I head back I'm ordering the whole thing chefs special. 

The hoagie loaf or Vienna roll had nice flavour, and while I'd usually argue for a slightly crustier loaf, I was actually glad not to shower my lap with breadcrumbs. Only thing that would make this better would be a can of cherry coke, rather than the standard coke, Pepsi, or ice-tea. 

I am definitely a fan, and can't wait to drop in again (that's sort of my threshold for 5 stars...if I scheme, daydream, and wistfully plan my next visit). 

You have to love it when someone chooses to do something simple but do it really, really well. 5 sauce soaked stars."}
{"text":"I first visited the Beef Shack within a month of it opening it up, and loved it. I've been back a few times since and every time the smell while waiting for my food is intoxicating. I won't go out of my way to eat here, but if I'm hungry and driving by, I'll stop in as I know it's good. 

The one thing that would make it better is if they served the sandwiches on toasted buns."}
{"text":"If you want high-quality meat sandwiches at an affordable price range this is the only place in Calgary. I will drive 30min+ out of my way to get a sandwich at cowtown. Every type of meat here is on point. My favorite definitely has to be the beef dip, the Au-jus is the best I have tasted in the city with a deep savory flavor. The meat is always juicy, tender, and full of flavor. I have also tried everything else on the menu and never been disappointed. The smoked meat has that quality of a southern bbq shack that has been going for 30+ years. They have the technique for roasting and smoking meat down. I need to find where they source their baguettes from because they are also delicious and have the fresh baked flavor every time.

The only gripe I have about this place is with service. It's always friendly but seems slow. It doesn't have that flying off the wall feel that most good bbq places have, and the toasting method is inefficient and can lead to backups. Definitely not a reason to avoid going, though. 

If you're in the mood for an amazing meat sandwich cowtown definitely has you covered."}
{"text":"Solid beef dip, great bun, tender and juicy. Fast friendly service. Glad I found this place on Yelp. Going to try the brisket next time."}
{"text":"Great subs with a perfect BBQ sauce. Drive Thru and walk up window. Picnic benches outside. No tables inside. Only $8 for a sub.

The owner is opening a second location in Mackenzie town just behind the Kilt and Caber.  Much closer to my house and will be a sit down location with a larger menu.

Check out his menu. Brisket. Pulled pork on a hoagie bun. Heaven!"}
{"text":"I wasn't thrilled, my fiancee was in like.  I might have been being picky that day, and want to try it again.  It's quite the landmark so I'm sure we'll drive-thru once more!"}
{"text":"A great choice for anyone looking for a meal on high street! The beef dip is my favourite and comes with beef, onions and provolone on one big mighty sandwich! The beef is delicious!! Would recommend to anyone, although, you might have to get over the bad smell first."}
{"text":"We had the beef au jus and pulled pork sandwiches. Top quality meat (juicy, tender and flavourful) on freshly baked rolls. No frills and reasonable cost; just like we like it. A very solid sandwich shop."}
{"text":"Had the beed dip with horseradish, it was really good and filling.  The meat was tender, and the bun was fresh as well. I believe they pride themselves in using ALL local ingredients. My wife had the pulled pork sandwich.  All the sandwiches are served in sub buns, which are brought in by the owner every morning. 
When I was here this Friday evening they had a steady stream of customers ordering take-out for dinner and catering. 
Oh yeah, they also cater company parties for approx. $20 per person. 
It's a family run business which makes it both friendly and good quality. 

My family and I will definitely be back.

:-)"}
{"text":"our food was so good we had to get seconds to bring home.... my boyfriend almost died after his first bite"}
{"text":"Just yum! Wish they had more side dishes to choose from but I'm not complaining. This place is real deal food!!!"}
{"text":"Oh my god, this place is amazing, a bit of a limited menu but what's there is fantastic, the best BBQ sandwiches in Calgary, hands down!!"}
{"text":"Oh damn! I was scoopin' out a restaurant around my ladies home that wasnt sushi related and i saw this little gem. We popped in last night and instantly feel in love with the smell. Smokey-beefy goodness. My love got a large beef dip and i had to try the large cowtown cheese steak. Again, oh damn! That is one sweet ass sandwich; soooooo much beef. And the chipotle sauce was in point. The flavor of the meat is not lost with all the tasty toppings. Highly recommended; a must if you're in the Mackenzie area."}
{"text":"Everything from the sandwiches to the customer service is amazing. The people working there take pride in what they do and greet everyone pleasantly and have full on conversations with you as they are working. They take the initiative to make their customers feel at home & they take a genuine interest in you. The sandwiches are amazing, if you are in the Calgary area you must visit this location! Soooooo worth it!"}
{"text":"My friend and I attended Cowtown Beef Shack upon great recommendations. It lived up to the hype! Best beef dip I've ever had and the horseradish mayo was just the perfect bite back! My friend had the pulled pork and we were both regretting we didn't go for the larger size sandwich!!! Definitely a new stop on the map when in the area!"}
{"text":"Ok - the question was simple and the answer was absolutely superb!   Question - \"WTF it's not Stampede and I feel like beef on a bun, geez this is Calgary and it's easier to find Chicago Deep Dish Pizza...\"

Answer \"COWTOWN Beef Shack!\"

A tiny little 'shack', yup it's a shack - with a tiny menu - if you don't like beef, don't go!

The menu is  sparse as Cowtown focus' on what it does well - Beef.  I'll post a picture of the menu but basically you choose from:

Philly Cheese Steak - Good with a white Cheddar sauce but sorry I've eaten at Pats and Geno's - they win hand's down!

Beef Dip with optional horseradish or hot peppers - This is a great sandwich from the bun to the meat to the au jus!!!!!  love it!!!!!!

BBQ Beef - I haven't had it but someone I was with said it was really good.

For extras, all Cowtown offers is two or three drink choices and a couple of options of potato chips.

Couple of things that I could see added into their tiny space - even if it runs out early - A baked beans side....   and if they could somehow make a yorkshire pudding beef dip, I would CRY!"}
{"text":"Delicious beef dip and local products. I enjoy the food here but sometimes get frustrated because they will have a take out order of 40 sandwiches they make on the line in front of all of the people waiting to order. They should consider a different system that doesn't require walk in guests to wait for large take out orders to be prepared first. 

Update: I have been calling in advance now and the food is always ready when they quote. Now I can enjoy my delicious beef dip without the frustration of waiting!"}
{"text":"I feel bad writing this review because I love that it's a shack and the people inside that shack were so nice, but I had the same experience as Lizette R.: my sandwich was bland.  I had the cheese steak.  I will try again some day with the pulled pork because my friend had that and it looked pretty nice."}
{"text":"I found the au jus to be extremely bland, but the meat and bread were decent. They have a forced tip option on the machine but you have to stand around and get your own food and bring it to your own table. It's exactly the same as McDonald's. Not sure why you would tip!?"}
{"text":"This place's sandy game is pretty much as good as it gets. I'm relatively certain that there was a good 4/5th's of a cow on the beef dip. It tasted like Beef Jesus came down out of the sky and made this holy creation himself. I would have believed that too, If i hadn't seen the girl behind the counter make it with her own two hands. She may have not been beef jesus, but she was definitely a close second. Maybe a Beef Mary, except blonde.

Totally the opposite of dry, I would say moist but that word is filth, and fresh tasting. The \"Au Jus\" was good enough to drink on it's own, I tested that. 

Overall:
-Service was prompt and polite
-Serving size was huge for the money
-Tasted like meat heaven on a bun
-Basically walked in thinking I was just getting a sandwich, Walked out having a religious experience.

10/10 Would recommend to everyone in the universe. Except vegans.

Praise be to Beefus."}
{"text":"So happy to see that this place is so close to home! Had the small beef dip for lunch and it was delicious!    Brioche bun topped with a generous amount of shaved beef that was juicy, tender, tasty, delicious!! Also had horseradish and mustard along with the jus which worked perfectly with this sandwich. I loved how spongy the bun was to soak up the jus perfectly without being too thick. My date had the large BBQ beef which was also delicious and he loved it. Prices were $6.95 for a small and $9.95 for a large, both had very generous portions of meat. Will definitely be back!"}
{"text":"Wow. If sandwiches were swords CowTown beef shack is the Scottish claymore that will win you your freedom...from hunger

Props to Nick S. for suggesting this place. After two weeks of being delayed opportunities to try CowTown, I made it my mission today to go for lunch, ditching a desk full of unresolved reports and neglected a phone that wouldn't shut up. Located in the same parking lot as Home Food Inn, CowTown is literally a shack no bigger than 2-3 office cubicles put together. But when I walked up to the kiosk and peeked inside, I saw a chef with a miniature gourmet kitchen ready to fire out sandwiches!

I ordered the BBQ beef sandwich, which cost 8.00. The tissue soft sheet-strands of beef in BBQ tasted LES INCREDABLE. The pockets of fat made random bites of the sandwich a different experience. The bread was pretty basic but hey, how can you draw art without a plain sheet of paper? I asked for the cheese and pepper toppings which complimented the beef. The cheese sauce was interesting as it had a nacho cheese flow but with the curdled consistency of melted hard cheese.

I wish I still had my hefty appetite, otherwise I would go back and attempt to tackle a second sandwich. Still one order is large enough that I can feel my heartbeat drumming against the spine along my neck.

I could really use a na...*passes out*"}
{"text":"When you walk by Cowtown Beef Shack, there's no mistaking what their specialty is. You'd have to be crazy to resist the tempting aroma of smoked meats that wafts from the store.

The menu is simple: beef and pork sandwiches offered with sides including slaw, beans and potato salad. On this visit, I shared two sandwiches: the beef dip and the cowtown cheesesteak along with the slaw and the house special side.

The beef dip was piled high with tender beef. The rich beef and cheese were perfectly offset by the spicy horseradish spread.  The cheesesteak was also generously topped with lots of meat and a creamy cheese sauce.

The slaw is on the sweeter side as it includes dried cranberries. The house side combo was fun, being a mix of cold creamy potato salad and hot sweet baked beans.

Overall, the flavour combos were delicious, but I feel the quality of the meat was a bit lost in the ample toppings. I would prefer more menu options allowing for simple cuts of the meat on its own."}
{"text":"I just moved in to the neighbourhood and on the evening that I moved in I explored this area and found this cute locally owned restaurant. My boyfriend and I decided to go here for dinner and I am so glad I did because it was delicious. They said all their beef is local and everything is home made. They have one menu for their \"beef\" things and the oath half of the menu is for the \"smoked beef\" dishes. 
I had a smoked beef sandwich. Other things they have are a steak and cheese sandwich, beef dips, etc. For sides they have homemade coleslaw, potato salad and bbq beans. 
The portions are huge and the onions that come on here are great but if you don't like onions that much I would tell them to only out half the amount of onions that they normally would on. 
Went to San Antonio this past winter and this place reminds me of Texas BBQ shacks so much! Cannot wait to eat here more!"}
{"text":"Can't get enough of this place. The cheese sauce is so good, it should be illegal.
I would make a recommendation off the menu but it's all good. Every last thing."}
{"text":"this shack in the middle of summer was so hot, yet the beef on a bun came cold.  I took a bite and it was horrible, I had to throw it away.  Theres only so much one can do in a 3footby3foot shack."}
{"text":"We had a large, half pulled pork, half beef dip. Was absolutely amazing. Definitely the best of both worlds. Very friendly service, helped us decide our order. We will be coming back."}
{"text":"LOVE this place. The pulled pork is to die for. I hate coleslaw, they put theirs on the pulled pork and I nearly died. Sooooooo good. My hubby got the philly cheese steak and we almost fist fought over it.
The customer service is amazing, my husband went today for the first time since summer and the owner remembered his name!!! 
My only warning: go hungry and don't wear white. It's messy"}
{"text":"Drive thru Meat!

Had a pulled pork sandwich ($8) on Sun Aug 13th.  Staff was friendly, and sandwich was tasty.  Good flavor, and interesting coleslaw on the sandwich with apple pieces.

I would go back for the brisket next time."}
{"text":"Best beef dip I've ever had in Calgary. Fair priced and soooo good. Very kid friendly. I recommend if you're in the area and want some good food to stop in here and you won't be disappointed."}
{"text":"I use to go by the old location on Macleod Trail until one day it was closed. I was ecstatic to find out they had relocated to McKenzie Towne, thankfully on the first day i moved here. I always order the Cowtown cheese steak, it's just so addictive! They use to serve it with cranberry sauce as well. Btw, can we bring that back please? It was amazing!!  

The owner is a really nice and chatty guy, always hires friendly staff.  I wouldnt change a single thing about this place. They are very consistent with serving high quality, delicious food. Have never had any complaints. . .other than my cranberry sauce  :)"}
{"text":"Brilliant food and top notch service.  If you enjoy quality beef in a great setting I HIGHLY recommend Cowtown Beef Shack. It's seriously beef epicness. 

Try it yourself and you'll never regret it."}
{"text":"Always a solid sandwich experience here, whether it's the beef dip or the BBQ beef. I'm probably one of the few who doesn't love the cheese sauce but they offer provolone also which I do love with the beef. You can taste the smoke which is delicious! Coleslaw also kicks butt."}
{"text":"Just plain delicious. Cannot go wrong here for premium quality roast beef sandwhiches. Quality ingredients. Non GMO. Price is around 7.00 for a sandwich piled high with very fresh, tender and juicy beef cuts. Fits the \"Alberta\" beef stereotype in all aspects. 

A1"}
{"text":"Amazing sandwiches!!!!  I have been going here for years and was so excited they moved into McKenzie Towne!!! The owner is so nice, and I always enjoy chatting with the staff while they make my sandwich. This place is one of the best in town! And definitely worth the drive to the deep SE!"}
{"text":"If Calgary had a food cart culture, the CowTown Beef Shack would be at the heart of it... okay maybe cart is the wrong word for this stationary little kiosk, but it sounds a lot better than food shack culture.

It was fate that brought me to this sandwich... actually it was Nick S.'s review. I had read the review earlier in the day and happened to be travelling northbound on MacLeod Trail later that afternoon. As I drew near the Beef Shack, I saw a mini van parked outside. It was open!

I had four choices for a sandwich. Cowtown cheese steak, beef dip, beef and cheddar or BBQ beef. I asked Bradley, the man behind the shack, which one he'd recommend for a first-timer. He made me a BBQ beef sandwich with horseradish and onions. The BBQ beef was all sweet'n'saucy, wrapped up inside a big crispy roll. It sure didn't last long... let me just catch my breath.

All sandwiches are $8. Adding a drink or some chips on top of that will run you about $2 each I think. 

And Bradley... well, he's a character all on his own. He gets 5 stars too."}
{"text":"After reading about and driving past the original Beef Shack several times, I finally made it into the new location, and I'm glad I did! 

We had the beef dip and the cheesesteak, and then split so we could try both.

The beef dip is absolutely delicious, very moist, tender, and full of flavour. The jus has a good balance of flavour and the horseradish adds just the right amount of bite. In addition to wanting to try out the beef on a bun and pulled pork, this is what I'll be coming back for.

As for the cheesesteak? Any Philly purists will declare it inauthentic, and while that was my first reaction, what I realized after is that the toppings really just take away from the reason I came in the first place: the beef. The combination of beef, bun, jus, and horseradish is all you need."}
{"text":"PS: Was contacted by someone apparently related to this business, stating they've been investigated by food safety authorities and passed the test with flying colors. If that's true, good for them! My opinion remains the same, though - and yours is up to you to decide."}
{"text":"I discovered Cowtown Beef Shack this past summer as a friend of mine is absolutely obsessed with beef dips and she said that Cowtown legit has the best beef dip ever. Soo....after the dog park, we headed over.

Inside, its a cute little cozy place with a couple tables and some western decorations and in the summer time they have small tables outside. The menu is on the back wall, they have a handful of smoked meat options: pulled pork, smoked brisket, BBQ beef, beef cheddar, beef dip and only couple side options: potato salad, coleslaw. A cool option is that and if you weren't feelin' bread you could order the meat by ounce and mix it up! Add cheese, sauce or none which is nice if you're trying to eat cleaner.

MJ knew she wanted the beef dip and of course I had to try it as well - along with a side of coleslaw. The guys up front were super friendly and fast with our orders. We decided to sit outside to keep the pup company while we ate. The beef dip came with fresh roasted beef, onions, Provolone cheese and Au Jus for dipping. The bun that came with the beef dip was soft and clearly fresh while the meat and melted was just soooo succulent and melt in your mouth - DEEEEELICIOUS! The bread soaked up the au jus for the perfect combination. Heaven. The coleslaw side was fresh and light....everything was just perfect together.

Fresh local ingredients, soft baked fresh buns, succulent AAA Alberta beef and AB cheese.....no processed or preserved ingredients - WHAT MORE CAN YOU ASK FOR!?! The best!!!!!  The only possible con is that if you live in the north, McKenzie Towne is quite the drive but I'd say its worth it! BUT! NOT FOR LONG! I saw a posting that Cowtown Beef Shack will be opening soon on 16th Avenue NW - GET EXCITED!!!!!!!!!!!!!!!!!!!!!!!! :)"}
{"text":"Are you kidding me?!!! This place is so unbelievably amazing! The beef from the smoker is moist (such a gross word, but I can't think of another one - so get over it). The buns are fresh. Not too soft, not too firm - just right. 
Staff are chatty and friendly, super helpful. That alone is tough to find these days.
A must try"}
{"text":"Brutal Service and food was mediocre 
I'll start by saying I religiously went to these guys when they were still actually a shack and raved about them to everyone. When I heard they were setting up on 16th I was stoked. I went on opening day and the food good but nowhere near as good as it was. In been 3 times since opening and each time the service got worse and the food was slipping in quality as well. Today I went for the last time. It took 20 minutes to get my food and my cheesesteak sandwich seemed to be missing the cheese as there was only a minuscule amount on it. 20 minutes with no one ahead of my is ridiculous. They didn't offer to make it right or anything for making me wait and then still gave me a tasteless cheeseless sandwich. Shame on you for ruining a once great name."}
{"text":"Stopped in here one evening and had a great experience. We spoke to the owner who explained the process to us. 
He facilitated our gluten free needs with no problem. They recommended side dishes for us and the food was just delicious. I would highly recommend."}
{"text":"i really, really, really wanted to like this place. i found the reviews before my trip and made a note to stop. it was so cute - just a little drive thru kiosk - and the chef was such a nice guy but the sandwich just wasn't very good. 

i got the beef dip sandwich and my friend got the pulled pork. the pulled pork with the coleslaw was ok but my sandwich was pretty bland. 

i know all of the other reviews are really high so maybe it was just an off day or maybe i am spoiled with my numerous bbq trips through the southern united states. whatever the case may be - the shack just wasn't all that good."}
{"text":"A great sandwich is a wonderful thing.  Just like the late Warren Zevon said to David Letterman in his own version of \"carpe diem\":  \"Enjoy every sandwich\".   There is a lot of truth to this statement; life is short, and it is important to take pleasure in the everyday things - such as a truly great sandwich.  To that end, you MUST visit the CowTown Beef Shack!

If I am traveling north on Macleod Trail and feeling {very} hungry, this is my go-to spot.  Menu is pretty much all sandwiches (surprise!), but they are great ones - philly cheesesteak; pulled pork; and a few other \"Stampede\" type sandwiches, albeit infinitely better than the crap you buy on the Midway.  I've had some great sandwiches in my life, but for their genre, CowTown's are just about perfect.  Staff is fun, friendly and laid-back. 

My only very minor complaint is that I wish they had a few more picnic tables (a la Peter's Drive In) - these wondrous sandwiches are too messy to eat in your car (another sign of an amazing sandwich). 

I had to think about it a bit, but I think CowTown deserves a five star rating!  Don't just drive by next time, stop in to visit!"}
{"text":"Wow, has it only been two years since Bradly and his Beef Shack have been open??

What can I say that already hasn't been captured by past reviews....probably not much so let me summarize the highlights.  

Great food...yes, his sandwiches (be it the beef or newly added pulled pork) are fantabulous!  Juicy, FULL of flavor and are huge!  The choice of toppings are enough to provide a good selection but never too much to drown out the beefy goodness!  Remember, we're in Alberta where the cow is king!  Or would that be the \"cow\" is queen and the \"bull\" is king?  Regardless, whatever bovine is perfectly cooked and sliced and loaded onto his sandwiches is as close to perfect road food you'll ever find.

Service...yes, Bradly and his small gang never fail to impress.  They're friendly, never fail to engage in some great conversation and still keep you moving through the queue ASAP. 

It genuinely makes me happy to see a small business owner find their niche and succeed.  In our market where generic \"roadhouse spork\" (aka Earls, Tony Roma's, Joeys...which don't get me wrong...will fill the void) is rampant its awesome to see something unique like CowTown thrive!"}
{"text":"The staff here are really friendly-- it seemed like it was being run by the owner, but I'm not sure. But, yeah, very nice!  Anyway, because I had read the very positive reviews on Yelp, I decided to give this place a try.  When you walk in, it smells like smoked meat.  It's a bit overpowering to be honest, but at least you know the food you're about to eat is authentic.  We got the beef dip and a side.  When the order came up, it seemed like normal white, store-bought, mass-produced submarine bread with sliced smoked beef on it.  That's it.  When you dip it in the au jus, the bread is immediately a soggy mess.  I eventually left the bread out and just dipped some of the meat, and it was okay, but the smoky flavour is pretty strong.  The people who were there with me felt the same.  The side was a mix of beans and potato salad, which was just okay.

I was a bit disappointed, to be honest.  This place was rated as having the best beef dip in Calgary, but I feel like I've had much better.  It could just be that beef dips are their niche, so they focussed on smoky beef and some people love that flavour.  Either way, we won't be regulars there, but it seems (according to these reviews) that many other people are.  Maybe I'm just too picky!  One suggestion I would make for them is to improve their bread.  A French baguette bread is appropriate for beef dips, not just mass-produced pure white bread because it's just too soft."}
{"text":"So maybe this place was hyped up a little too much on Yelp because I did not find it to be a 5-star lunch. I had a quality sandwich with good ingredients but I didn't walk away *needing* to come back. I will definitely come back to Cow Town Beef shack if I am in the area around lunch time, but I wouldn't drive to go to it. 

I ordered the pulled pork and my husband got the beef dip. The value could not be beat - my half sandwich was $5 and my husband's full sandwich was $8. The pulled pork was good. The meat was tender, the bun was soft, and the cranberry slaw was a nice added touch. However, as I said before, I wasn't wowed. This wasn't the sort of sandwich that I would crave (perhaps maybe on a drunken night but even that's a stretch...)

My husband absolutely loved the dipping sauce for his sandwich (more than the actually thing.) We still have some of the sauce in the frig and he continues to dip other sandwiches in there as well. However, that was the best thing about his meal, as he also felt that the sandwich itself was good, but not great.

Don't get me wrong, if we are in the area, we will definitely stop by again but I guess I wanted to be floored and I walked away content. All-in-all, not something I can complain about. :-)"}
{"text":"In a weird little parking lot at the side of Macleod Trail's Home Food Inn, there's this weird one shack where one of the absolutely bravest and heartiest chefs that ever can be is.  

Chef Brad, is there, much like a classic tiny Punch and Judy stand, surrounded by huge hunks of beef.  It's tiny, it can't be all that well insulated from the extreme cold that Calgary can get, or well ventilated against the extreme heat inside during the summers, but there he is day in day out serving some of the most awesome beef sandwiches that you can find anywhere.

So far of note that I have tried, the BBQ beef sandwich and the beef dip.  ANd there's quite a few other ones I will have to work on.  The beef is carefully prepared, well seasoned, and absolutely tender and juicy.  The gravy of the beef dip is simple, straightforward, yummy, yet strangely mysterious (I'm not too sure, but I could swear I sense of anise somewhere as an aftertaste...).  Still, it's his speciality, and as I've heard, this little shack actually has led to a full sized resto somewhere else in the city.  

Bravo Chef Brad, and I salute you for managing the elements in that tiny shack that's smaller than my bathroom!  You have my respect and most importantly, my energetic vote of approval with a sandwich in my hands!"}
{"text":"Best smoked meats in the city !!! Beef dips to die for. I decided to take my family visiting from australia as a treat and it was such a hit with my extreeemly picky siblings 6 7 12 15 my parents and my picky grand parents.... so much they went back 3 more times during their stay . It will not dissapoint"}
{"text":"Best meal in Calgary! Wasn't expecting much when I arrived, but was recommended beef dip from the owner himself. Best beef dip I've ever had! Meat was so succulent, juices flowing through the sandwich.

Highly recommended to at least check out if you are a meat lover."}
{"text":"The food was very underwhelming for the price. I'm glad I got to try it but I don't think I'd go out of my way for a steak sandwich from here again. The cheese sauce (??) consistency really threw me off, and I ended up taking most of it off. I definitely didn't have a bad time, but it's just not for me."}
{"text":"The food was excellent and the price was great.   They loaded my beef dip sammich with meat.... not sure why extra meat is even an option lol.  The regular was the perfect size for little me and the large could feed me and my 2 daughters.   Huge size difference between them (they should probably create a med sized sandwich) however it was yummy.    

To the ladies: if you go to the bathroom the weird seat does lift to reveal a normal seat so don't panic!! 

-this is my new go to for sandwiches in Calgary"}
{"text":"This place is awesome! I'm from LA and ended up in Calgary for work for 10 days and I drove by this place all the time. I decided to give it a try and boy was it worth it. I ended up coming twice to try the brisket and pulled pork with hot sauce and slaw. The bread soaks up the sauce very well and you can taste the smoke on the meats. If I had a place like this next to my place back home I would be 20 lbs heavier."}
{"text":"It was my first try! I have been keeping my eye on this place for a while. I was not disappointed. I had the large beef dip au jus with horseradish mayo.

Great stuff!

I would go double beef if you have a good appetite! 

Au jus was not even necessary."}
{"text":"My girlfriend took me to this location because I love pull pork and especially beef.

The beef dip is amazing with the aju sauce words cannot descripe how good it is. 

This place is a must!!!!!!

Staff there are super friendly"}
