{"text":"Cozy Cafe is the epitome of a local business - it's not fancy but the bakery items are good and the two sisters are charming and well integrated into the local neighbourhood. The local community association worked hard with the owners to try to make the space warmer and more inviting and it does look better and less like the abandoned donut store it started as.  Their breads are great as are the cinnamon buns, danishes and strudels.  There are daily lunch specials (looove the pasta with rose sauce) and they are trying hard to meet the needs of the local community. And what we need is a solid bakery, and that's what we've got."}
{"text":"I came here to check this place out after I saw them advertise on a group deal.  When I arrived some customers were getting their fill as they were redeeming their coupon.  I remember cinnamon rolls, breads and shelves of desserts behind a glass counter.  This place is near the corner of Woodbine and Danforth - some customers were sitting there but I think this place is more   \"grab and go\" since the joint is not what I call \"cozy\". Wooden tables and chairs without cushions abound - reminds me more of a cafeteria style set up.  Service was friendly, the woman behind the counter I think was one of the owners.  (One of the two sisters from the Niagara Region.)  I had a dessert from behind the glass counter - unfortunately I thought it was too sweet for my taste.  Pink coloured shell over a hazelnut marzipan type cookie (1.99).  Next time I think I would try something safe and recognizable."}
{"text":"I went today because I had a voucher and ended up buying several more vouchers.  The food was FABULOUS!  I had a veggie panini with side salad and homemade salad dressing.  The dressing was tart and absolutely delicious.  I also had a danish with vanilla custard and cranberries and a cinnamon bun to take home.    I would go back even without the voucher.  I went in hopeful and came out thrilled."}
{"text":"The two sisters who run the Cozy Cafe are so sweet.  If I was feeling like a treat on the way home, I would hop off the subway and grab a loaf of their wonderful whole wheat bread (and hope they hadn't run out during the day-- apparently I'm not the only one who likes it).  Cheaper than the bread in grocery store bakeries, and tons more delicious.   Once I went in and happened to be short a quarter and didn't have any cards on me.  I felt so bad, but I got a smile and a \"no problem!\"  They let me take my bread anyway.  I was sure to pay them back next time.  Another time I went and struck up a conversation, and it turned to ethnicity.  The sisters are Serbian, and I'm part Czech.  We talked about the funny differences between languages and subtle differences between food, and she sent me out the door with a free makovnik (poppy seed roll) despite my insistence to pay for it.  It was such a special gesture that I remember it over a year later.    I didn't live in Toronto for too long, but it's wonderful little places like this, owned by hard-working people, that I miss the most."}
{"text":"My Friday Mom group decided to convene this time at the Cozy Cafe & Bakery.  cozy: cozy [koh-zee] -adjective, -zier, -ziest 1. snugly warm and comfortable: a cozy little house.   Yea no. The Cozy Cafe was anything but snugly warm and comfortable! Wooden benches line the walls and wooden chairs are abundant. There are a few comfy looking red velvet chairs but that's as cozy as this cafe gets.   café [ka-fey, kuh- or, especially for 4, Fr. ka-fey] -noun, plural -fés [-feyz; Fr. -fey]  1. a restaurant, often with an enclosed or outdoor section extending onto the sidewalk. 2. a restaurant, usually small and unpretentious.   Yea no. The Cozy certainly did not have an outdoor patio - in fact its the kind of establishment I would have plain walked on by without a second glance because of its extremely lackluster storefront. And it was far from small - the place was huge! Enough to accommodate not only my Friday mom group but another one in the area as well. There had to be about 20 moms and their kids + strollers and gear and there was still room to do a changing or even move around freely. In that respect it was great because its a great change from being crammed around tables and tucking your elbows in! The only thing is that there is no change table for your kiddo in the bathroom, but I changed mine on an empty bakery rack (is that hygienic? meh.) while others used vacant benches, tables and chairs.   bakery [bey-kuh-ree, beyk-ree] -noun, plural -eries. 1. a place where baked  goods are made.   *shrug* I guess. Cozy did have quite a few yummy looking baked goods out and some even yummier looking deserts in one of the display's but upon tasting my carrot muffin I was really disappointed in how dry it was. My friend also sampled one of their cinnamon buns who was also sad to report that it was on the dry side. Next time perhaps I'll try their danishes which has jelly and may be the saving grace to the dryness of the pastry.   All in all this was a ho-hum type of experience, made only enjoyable for the company I was with and he spaciousness of the facilities. I would have given this a higher rating if only my damn muffin was a bit moist."}
{"text":"Bread bread pastries pastries schnitzel on a bun LOVE !  Love the baked goods here.  Really great traditional Eastern European pastries and breads.  Better prices than at a grocery store - and phenomenal toothiness and flavour to their breads.   I wouldn't call the place Cozy, but the owners are very pleasant and know how to bake.   I occasionally see people sitting down to eat, but it's basically a run-through-and-grab-good-bread-and-danishes-place.   We occasionally get one of their schnitzels on a bun to share on a Saturday afternoon (gotta time it right, as they run out of these regularly) - good bread, good schnitzel, wowser sauce and veggies.  Can't imagine even trying to finish one by myself.  Recently tried their version of spinach strudel and some kind of ground meat strudel (I am sure there's a real name for these) - soooooo good.  The ladies knew I was taking them to the beach for a snack while we walked the dogs so they warmed them in the panini press for me and wrapped them in foil.  Did I mention soooooooooo good? Soooooooo good.  Will have those again.     Not wild about their muffins, but I think if you stick with what is within their traditional baking knowledge you'll be happy.  If you love Timmy's, the food might be a bit too real-tasting for you."}
{"text":"I was across the street at the art supplies store and realized that I was hungry. This place was close, so I decided to check it out since they advertised breakfast. I was not disappointed. Reasonably priced and served until 12, I decided on the BLT.  I was surprised that it was empty save for a few who came in to grab a cup of coffee."}
