{"text":"Came here for lunch and had some amazing food. The food was cooked to order. It was all seasoned so good and so delicious. I enjoyed it a lot! I'd highly recommend checking this spot out. 
Parking and the area may seem sketchy, but it's worth the effort, and the parking situation. 
I would definitely return here again if I'm in the area. 
Plus the owner is on site sometimes and he's very personable, and welcoming. The space to eat inside is small, but if you have the chance to relax and listen to some good music while eating good food. 
Take advantage of that."}
{"text":"We got the lobster mac and cheese and the crab fries. The crab fries and the large lobster mac and cheese were both $10.50. Meals are in the $15 to $30 range, which isn't bad for seafood and steak, but the prices don't match the ambiance. It's a take out spot with bar stools if you wanted to eat there. The food is tasty, well seasoned and made to order. My only complaint about the food is that I wish there was more lobster in the mac and cheese. As you can see in my picture, its just mac and cheese with a shred of lobster here and there. I expected chunks of lobster. Same with crab fries, except there were chunks of crab on it, just not a lot. 

I'd def go back to get some seafood take out. It's
perfect for date night at home."}
{"text":"This is an excellent restaurant, the food is amazing every time I go. The prices are reasonable, but even if you think they aren't the food is definitely worth It. I would recommend \"Crabs R Us\", over and over again."}
{"text":"This place was great! I went for my first time yesterday. I got the lobster tail meal with Mac and cheese, broccoli and corn. The broccoli was just okay but everything else was soooo great. It's a tiny place with just a few chairs. More of a take out place but you can sit to eat. I will be back!"}
{"text":"ordered here yesterday VERY VERY small portions ,, for the price ,, crab cakes very salty. they didnt even have lemon with it which may have helped the saltiness, I was very excited to try this place,, what a let down ."}
{"text":"The food was just ok to me. I may need to try it again to make a fair assessment. I had salmon, corn on the cob and potatoes. My salmon could have been cooked a bit more firm. The corn and potatoes were ok but I'm not sure the price and portions equate."}
{"text":"Some very tasty seafood treats from a small kitchen and a restaurant with very few chairs to sit down and eat. It's mostly A takeout restaurant. Stop in and try it ,you might be surprised that food can taste this good from such a place. A very courteous and family oriented staff to greet you, and the menus are pictures on the wall. All you have to do is point and select. I had the lobster,Very tasty."}
{"text":"I'm from out of town and tried this place on a whim and I'm glad I did. This place has great food. Service is great and timely. The menu has variety too. 
They have a new regular every time I'm in Pitt!"}
{"text":"This is my first time leaving a review but I've eaten here several times. I decided to leave a review because I'm concerned with the mix reviews.

Crabs R Us is absolutely fabulous. My boyfriend and I eat here at least twice a month if not more. Our personal favorite is the stuffed salmon which is so delicious. We have tried the crab, shrimp, and crab cakes as well. The crab cakes are delicious and a nice size. When we had the crab and shrimp is easy good but we fell in love with the salmon and literally that's all we get.

As far as the sides and extras. Let me tell you I hate corn like its my least favorite veggie. BUT.. There crab is absolutely amazing and the sauce is delicious and is what makes it all.  The red potatoes are also very delightful. Lastly, the lemonade is so good. I'm a huge fan of lemonade and love theirs. 

Big time recommend trying this place."}
{"text":"Sooooooooooo good! I've been here 4 times and everything has been great. The crab and shrimp are wonderful. The corn on the cob is addictive. Strawberry lemonade is so sweet and refreshing."}
