{"text":"I really wanted to like Crave because if it's cool concept and equally cool environment but the food was just \"meh\". My husband and I are new to AZ and went for brunch. I got the basic chicken sandwich waffle and my husband ordered some type of BBQ styled waffle sandwich but TBH the both tasted about the same and were just ok. TBH all of it could've used salt or something for flavor. The hubs still enjoys this place from time to time and I'll go, but I am constantly reminded of the bland sandwiches I encountered."}
{"text":"Went to this place before taking my girlfriend to the Bieber concert last night.  I work at a bar so I'm more understanding about things.  The service was alright and the food did take a while but that's not the issue.  Around 2am last night I started vomiting everything out.  I was puking every half an hour for about 10 hours.  I had the worst headache and had the chills.  Everything I tried to drink or eat came right back up.  I got food poisoning from this place and therefore I will never go back.  I never leave reviews because I'm not a fan of yelp, but I just want to warn people before they eat here.  Just an fyi I had the waffle sandwich with the carne asada, lettuce, avocado, and chipotle aoli."}
{"text":"Warning Flies, Flies, Flies! The sandwhiches were great, the poutine fries awesome. However the flies were out of control, when we asked the waitess, non chalant response \"the manager insists we keep the garage door windows open\". Mind you while she was telling us this flies were landing on her face. We asked for containers so we could take the food home. Lack  of engagement to address the issue, ridiculous!"}
{"text":"Amazing waffle creations they are definitely worth  trying out if you haven't. This is definitely one of my favorite places to eat at on cheat day"}
{"text":"Service was great. Went for Sunday Sunday brunch and got mimosas and a bacon egg and cheese. Very tasty. Sat at the bar, our bartender was very attentive"}
{"text":"Both savory and sweet waffles were delicious. There is a bit of a wait but it comes out hot and fresh. It is on the pricey side."}
{"text":"Went in last week which was there first week open. Although they only had a few menu items available at the time we decided to the them out. The Nutella waffle (don't remember the name) was delicious. We even grabbed a drink at the bar while we waited for the food and I loved the bartenders. We will be back soon to try out other menu items soon! :)"}
{"text":"britt is amazing. she always attends 2 my needs and gives us service with a smile. keeps me coming back and i live in mesa,az. try the ranchero sandwhich with extra \"ranch\". promise you wont be dissapointed!"}
{"text":"I found this place from Westgates Instagram page. Me and my mom decided to have a night out and I told her about Crave. It was our first time there and we weren't sure what to order... BUT. Brittany (our waiter) was so helpful and so lovely and kind & she helped us order. Me being a chicken lover, she suggested the \"Southern Hospitality Savory Plate.\"  Their food is beyond great & I would recommend Crave a million times!!! I crave Crave!"}
{"text":"Came here for breakfast and it was AMAZING! It was a few months ago but I am new to YELP but I had to comment. Bloody Mary's are to DIE for and I really liked the atmosphere. Nice place to just relax and take a load off."}
{"text":"Customer service here was great. The employees were very welcoming and helpful with the menu. Food was great too. I was questioning if a sandwhich on a waffle would be good (i typically like spicy food) but to my awe it was great. Definitely will come here again!"}
{"text":"The food was good and I left full. That's all I can say. There was flys everywhere and our sever didn't feel obliged to serve us with condiments. More of a bar then a breakfast joint."}
{"text":"So incredibly disappointing.  As others have mentioned the menu board wasn't working.  We had to look at one of their take out menus where approximately 30% of the items were crossed out.  $38 later we sat down to wait for out food.  And waited.  And waited.  I can understand a wait when you have ordered food that takes a long time to make but we ordered waffles! There was only about 6-8 other people in the place so it's not like they were busy.  We finally ended up asking for the order to go after an hour of waiting.  

We got home and opened our food only to find that things were missing and looking like something we could have got from fast food.  The waffles with Apple were ok.  My husband got the California which he said was OK but nothing better than other places.  

The granola was missing from the yogurt,  fruit and granola.  It came in a drink cup which I dumped put onto a plate only to find some fruit compote with very sour Greek yogurt.  The fruit and whipped cream came with three sliced strawberries and some whipped cream on the top waffle with nothing else on the other pieces. 

It seems like the owners rushed to get this place open for the Super Bowl when they should have spent more time in training.  The kitchen is not efficient enough to operate and no one is checking to make sure orders are complete and correct.  This place might be good in a 6 months,  not now.  Definitely not worth the money we paid to have a nice Saturday brunch."}
{"text":"Don't waste your hard earned money. The food is horrible.  Once the novelty wears off this place will go belly up!"}
{"text":"We had been to a similar place in California that we absolutely love and we're excited to hear about Crave. It definitely met our expectations. Great food, the smores waffle is my favorite! Only downside is it does take a while for them to bring out the food, but that just means it's fresh right? Will definitely be returning over and over again."}
{"text":"Melissa, the manager, is basically your long lost best friend. She was incredibly inviting and very personable. She recommended a Scotch Ale for my husband, which he loves. But it also can be made into a float! Although I don't like the taste of drinks, we are both beyond happy with the way Crave has their drinks. We also had a Strawberry Shortcake and are hooked. It's now a craving we'll end up driving into town for, no doubt (or pun originally intended). Today we visited on a Friday night. Go to Crave to enjoy the food, great atmosphere, great TV's, and music. You'll be back just like us!"}
{"text":"I do my best to assume positive intent.  I have been to Crave twice. 
The first experience was less than ideal. Had a 10:30 movie to get to, so I arrived early, 9:45 to order and eat. My friend and I order from a menu that was not complete. Granted the store was less than 14 days old. Ordered the PB&J and when I got it, 20 minutes later, it was the most delicious sandwich I ever had. The peanut butter was sweet as was the raspberry jelly. The powdered sugar was a bit much, but I ordered a sweet entree so that was I got. My friend's order was just as delicious. The fries I ordered were forgotten at the time of delivery. I went back and asked for them. They were ready very quickly.
Here is where I now talk about the reconciliation the manager initiated. He asked about the experience and I dodged the question. I really liked the food but the service was not great. He recognized that fact and made no excuses for it. I told him it will get better because he is actively working on it.
On the next visit, the service was great. The food was just as delicious and the entire order was correct. The manager and server made sure we were taken care of and had what we needed.
Being a new business there are some things they are working on, but don't let those cloud your mind. Yes, the whole experience is critical, but give them a chance. I will be back with even more people."}
{"text":"The food was amazing, the service was amazing.  Indeed a cool concept and atmosphere was very unique.  This is by far one of my new favorite places to eat, very comparable to other waffle and chicken spots but with  much fresher food.  GREAT JOB CRAVE!"}
{"text":"Support local business and enjoy the best damn waffle sandwiches in the world. Don't be weirded out by the thought of a waffle sandwich trust me it's amazing."}
{"text":"Every. Single. Time we go here our food is cold & they always manage to get one of our orders wrong. Not sure how you can mess up an egg, bacon & waffle sandwich but I guess it happens"}
{"text":"We got there at noon and wanted fries with our meal. They told us fries would not be ready for 50 minutes because they use a process that takes 24 hrs to prep the fries. Great! Here's an idea, get your life together you hack. Start that process 24hrs before the next days opening, show some discipline! If you can't run a simple food prep, what makes you think I'll want to come back to your restaurant.

Then I waited for my food. My brother and sister got their food and ate it before I got mine. I asked for a refund and walked out. Do not go here.

Jim, get your shit together."}
{"text":"Everything should be on waffles. Everything. 

Stumbled across this place after a gun show at westgate; was the only place not packed and forcing people to sit outside. Service was very very prompt with entire crew on top of things. 

We ordered three dishes: the American, the Californian, and an order if poutine fries (which was a pleasant surprise on the menu). I'll let sav review her own food but here is how mine was. 

Californian comes on a waffle that is not sweet at all but very light, and much light than sandwich bread or a bun. It had turkey that was actually turkey, not deli sliced sandwich meat sadness that is typically served. Bonus points for red leaf lettuce instead of iceberg, and the cream cheese herb spread was great as well. 

Lastly, the poutine. Huge fries covered in beef stock gravy and melted white cheese. It was incredible to the point of wanting to drive an hour plus to get to get, while reciting the words to \"o canada\" and itching to go to a hockey game. 

Keep it up and open a location or good truck in the easy valley!"}
{"text":"Eat here on the reg always great food and great service!! Ummm pbnj is out of this world seriously try it and you will see. Food is always fresh tastes amazing, love the carne fries! My favorite is the huevos rancheros waffle sandwich! If you catch gabe at the bar get a bloody and thank me later dude is legit! All in all lovely lil unique spot in westgate highly recommend."}
{"text":"My first time to this place, I'm mixed about it and here is why. The food was good, price was good, service was HORRIBLE. Sunday morning, I walk in, there's a sign that says \"wait to be seated\", the hosts was like \"can I help you\", almost like \"what the hell you want\", I ignore. So I see the bar I ask if it's open so I go. At the bar, this heavy hitter waitress seemed bothered that I was there. Not friendly at all and sort of ordered for me, also kept disappearing. At this point I'm like, dang it, I'm stuck here. But the food was alright. I don't know if I'll go back. Sunday staff needs replacing or a pep talk."}
{"text":"Don't waste your time. My drink had particles in it. The food was so cold, and the customer service sucked, they won't last long in business."}
{"text":"If I could give no stars i would! We were some of the first people in the \"restaurant,\" and yet families of 4-6 who arrived after us got their food, ate and left before we even got our food. Not only did we wait for 45 mins to get our  food but then half our order came out cold.. They just reheated the food and was \"fixed\" in two minutes with our waffle being under cooked and mushy. If our visit couldn't get any worse they tried to offer us $1 coupons and took only one meal off the ticket still making us pay for the now 50mins wait time for two of the three meals while paying for our food with only 10% off. Take our advice that if a Resturant takes 20 minutes to have the owner to come out to talk to us then they won't deserve any patron to spend their money at this place ! The food wasn't good, the service was worse. Not even worth trying - stay away!"}
{"text":"The staff is all about partying.... They encourage drinking hard alcohol but when it comes to actually being a server well they fall WAY short.. The restaurant itself is dead at this moment and they forget people's order and the food takes long as it is.. I wouldn't recommend it here at all... It's a Saturday night and it's not busy at all..."}
{"text":"Food was just o.k. My husband and I both ordered the southern hospitality and my daughter ordered the kids waffle sandwich with egg and sausage. We found it difficult to eat because the waffles are so crispy you really cannot eat it like a normal sandwich. Perhaps if the waffles were a little softer it would taste better. I had to eat mine with a fork in pieces. The presentation of the food and the staff were nice. West gate was really busy but the place was empty so we were a little skeptical at first but thought let's try it anyway."}
{"text":"Disappointing. The novelty of having a sweet waffle with a salty-type burger was weird and overrated. The prices were high, the service was slow, and the portion sizes were small. When I asked about ordering a second entree, I was told that they were busy and \"it's gonna take awhile \". My party and I were one of only 5 or 6 tables in the establishment."}
{"text":"Very clean environment and fresh food. Had the chance to speak with the owner and gave me a tour around the restaurant, food is all prepared fresh no freezer in the back. Fries are prepared and blanched everyday. Waffles are made fresh. Along with the meat is all prepared properly. I would recommend this to anyone who wants to try a waffle sandwich!"}
{"text":"The food is wonderful. The only bad part about this place is the recent switch to full service from quick service. With this switch, there was no change from paper plates, plastic cups and plastic utensils. Quick service would do better here. The service was great, our servers first day(s) and he tried hard. Management wasn't present to assist with the rush on a major concert day, which was sad and a huge mistake."}
{"text":"I am conflicted to write this review even though the management (Ruben) went above and beyond their expectations. Let's start here...I had ordered the Huevos Rancheros without onion. This is NOT a hard task to complete. However, when I had gotten my plate, which was on time, it HAD onion. I picked off two slices of onion and put them on the side of the dish and checked inside to see if there were anymore in there. There was. Ok, honest mistake. I let the waitress know and she took it back. Literally 2 minutes later, she came back with the EXACT same plate. How do I know this? Well besides the obvious LOOK of the same dish, the same two pieces of onion were still there on the edge of my plate, as well as the onion inside the eggs. Ah, so they think their customers are stupid. I see. \"Excuse me Ma'am? This is the exact plate. Why was I given this? Are you guys F%!#$ing with me?\" I jokingly ask her with a smile upon my face. With a nervous laugh, the waitress takes back the meal. \"I'll tell them make a new one for you then.\" haha...\"Ok,\" I said. They should've made a new one from the get go. But it's ok, I'm sure this won't happen a third time. Not but 5 minutes later, she came back with a \"gloppy,\" mess of a thing COVERED (or rather hidden) under a greasy blanket of cheese. Ok, this is where it got frustrating and apparent that the staff NEEDS to stop immediately (!!) and be REPLACED with EXPERIENCED and MOTIVATED cooks and servers. I was even told that this happens more often than not. This putrid mess that they called a \"meal\" was staring up at me and with shame and disappointment. Sigh...It was VERY UNDERCOOKED, HORRIBLY COMPOSED, AND....wait for it...STILL HAD ONIONS!! I could not help but laugh out of madness. I walked right up to Ruben and the waitress, showed them, and they both agreed that what I was being served was wrong and \"disgusting.\" Look, I am NOT angry in the slightest. Ruben was a great host. He kept telling me that he, \"had never been so embarrassed in his life.\" He even went back there and prepared my dish himself and personally brought it to me. THAT is the kind of customer service your restaurant needs! Not the pandemonium of individuals you call a staff currently. The waitress (though she seemed inexperienced), was amazingly nice! We tipped her as well. However it doesn't take a genius to prepare a minimal task like this. Whoever prepared my meal, NEEDS to be replaced for the good of the restaurant. To Paul and Sonia, the lack of motivation and experience of that crew is astonishing to say the least. You guys are on a sinking ship and your restaurant needs to get it's act together...and QUICK!!"}
{"text":"We greeted by the head chef and two lovely cashiers when we came in. They explained they were trying to get open as soon as possible so some menu items were not available yet and they would be in three days. I was okay with this because the options they did have sounded good. I ordered the Back Yard Bbq and so did my friend. The order was deliver promptly by the head chef. The waffles were light and crispy more like a panini then your typical breakfast waffle, and boy were they amazing. The fries were good perfectly seasoned and when I asked for sauce for them I was given a made from scratch thousand island type dressing, however it was not your typical thousand islands. 

The customer service here was the best I have ever had. We were checked on by the chef making sure everything was to our satisfaction, and it was. The bartenders were kind and friendly (and yes they have a full service bar). We ordered a dessert waffle to go, the cheesecake and it was great too! Again a perfect waffle with cheesecake filling a fresh strawberries. I had an amazing experience and definitely something new and different in the west gate area. 

You have to stop in and try this place you will not be disappointed!!!!"}
{"text":"We are in love with this place! The food was absolutely incredible, flavorful and fresh! Both my husband and I are impressed! The staff is very friendly and welcoming! I love that this restaurant is locally family owned! It's been open for only two weeks but we know that they will continue to serve Az good quality food and exceptional service! 

Thank you Team Crave for serving my husband food that we love, created with a twist and served fresh! We will be coming back soon! 

Ps cheers to the success of this restaurant! Keep doing what you all are doing! 

Melody & Eric Richards"}
{"text":"Best strawberry cheesecake ever. The restaurant was very crowded being new, but the service was outstanding. The manager came over to our table twice to ensure we were happy. Very family friendly place."}
{"text":"Deeelicious! With a smidgen of extra syrup it was the tastiest sandwich ever! The perfect crunch and softness of the waffle and perfect amount of sweetness in the waffle. Our friends brought us here and with good reason! #wafflewipedout #naptime"}
{"text":"This place has potential but needs some serious help. A group of eight of us came in at 10:15 am on Saturday. We were sat at 10 30 we sat there a good 15 minutes before someone came to take our drink order.   We all ordered the bottomless mimosas they offer on Friday, Saturday and Sunday between 9am and noon that is advertised on a poster on the wall and on their website. Well  to our disappointment we were told that this was nor offered on \"game days\". Are you freaking kidding me is what I thought.  May I suggest if this promotion is not offered on game days that you take the poster down or put an asterik on the poster saying not available on game days. We really felt this is false advertisement. When we got our drinks it was 11:10 and it was time to order but we were told breakfast was only served until 11:00am. This was very frustrating due to the fact that we had been sitting there over 40 minutes waiting for  our drinks. I ended up ordering the southern hospitality which is ironic since there was not much hospitality in regard to service. The restaurant was packed there was one bartender, two servers and a manager running food. The saving grace is the food was delicious. If this place gets some well trained,. friendly and is staffed appropriately it will make it. Also take down that poster on game days and make an exception on your website about your specials not being offered on game days."}
{"text":"i read some of the rude comments, and i must say they are talking out of their a$$, we went here the 1st time tonight after my husband wanted to go to the fractured prune across the street, we decided to stop by and see what they have and i must say their desert menu had some really good things on it! i ordered the nom nom nutella and i am in heaven! i use to go to the fractured prune but i think i found my new fav desert place! it was fast, the staff was friendly and the food was good! a bit on a pricey side, but for getting a snack every once in a while its great!"}
{"text":"Way over priced for plastic trays and eating utensils. Waffle burger was tasty but some of the ingredients were missing that the menu said it includes. Also took 30 minutes for our food to get to our table, and there were only two or three other people eating in the restaurant. 
You could go to a gourmet burger joint in downtown phx and spend less money, for a service that includes waiters who take our order sitting down, real plates, quicker service, and better service. We pay less when we go out every week. 

Food tastes great, but not worth the price when we could have equally as great food, with better, actual sit down service."}
{"text":"This place is so good! Everything is fresh and it tastes like it too! I got to meet the owner, really nice guy, gave my mom and I a free cheesecake waffle which was darn near the best dessert I've had in months! They have a wide variety of sandwiches too so everyone can find something they would like. Honestly its a brilliant idea that really works well definitely try it if you're in the area!!"}
{"text":"Great concept works well fresh ingredients fun eating Best fries no grease waffles are delicious."}
{"text":"This bar sucks!! Don't ever go after an event. If they don't like your jersey you may have a LONG wait time for drinks AND food! I had to ask for ice water to accompany my two beers, 3 times, had to cancel my \"loaded French fries\" bcuz apparently they had to grow the potatoes and don't worry about asking for limes for your drink! Those don't EVER!!"}
{"text":"This place was very gd loved the southern hospitality waffle and my fiancé liked the carne Asada fries 
Definitely would try again"}
{"text":"Went after going to the movies on a Friday afternoon.  I got the sandwich South of the Border.  It wasn't cold and everything like someone else said.  Everything was hot.  They have a fancy soda machine that you can even add flavors.  

The waffle part of the sandwich was really flat.  I've had pancakes thicker.  My sandwich was also supposed to have avocado and it had NONE.  I noticed after I had eaten half of it and a girl came around and asked how it was.  I said I didn't get any avocado which is supposed to be part of the sandwich.  She said you shoulda said something before woofing down half of it and walked away.  Really!?!?  Not even a \"I'll bring it to you on a side for your other half a sandwich\"!?!?  That's why the low score."}
{"text":"This was the worst place ever. The place was empty which should of been the first clue to NOT eat there. The food was discussing and the service was horrible. There were also gnats everywhere. Things with this place need to change fast or it won't last long."}
{"text":"Went here for some breakfast. Waffle sandwiches just seems like such a great idea. The food was great. I had the huevos rancheros sand which and it came out quick. It was delicious. My fiance had the sausage egg and cheese and liked it as well. The only thing I.can complain about is the fly/bug problem. I just think they need to invest in the blowers above the doors and they'll be okay. It was still a great experience and I would come back again for sure."}
{"text":"Good concept, fun menu, friendly staff. Incredibly slow service. Don't come when you are hoping for a quick bite. Food was ok."}
{"text":"Came here today with wife and daughter. We ordered the all American burger and a classic create your own waffle   The classic waffle with bananas and caramel was delicious.  The burger was juicy and tasty our our server was very helpful too  Our only reason not giving 5 stars is that our fries must have been from the bottom of the bag.  They were the little pieces with only a few regular sized  fries. Other than that, it was very nice and we will be coming back soon."}
{"text":"So, I was a little wary of the idea of a waffle sandwich, but i found myself here when A friend of mine wanted to hang out here. After i got off work, I ended up eating here than eating at the place i originally were going to eat at . I was pleasantly surprised, the service was great, I sat at the bar and the Bartender for the night was Shae, she was the best. We had several different conversations and she even suggested me some drinks.
  Her mix drinks were very balanced, which i appreciate. The food was great to, had a chicken sandwich called 'all about the greek' . Once again, very surprised how good the sandwich was. I will defiently be back here again"}
{"text":"This was our second time here. We got the strawberry cheesecake and the all american burger with bacon. Last time we got the southern hospitality. All of it was really good. I think the southern hospitality is my favorite the only thing is the waffle gets soggy but it's very tasty. The waffles and fries could be more crispy. And the staff was really nice and attentive."}
{"text":"So I just had lunch with my wife at this place. We were both excited to try something new but left disappointed. To start both our fries were undercooked. Soggy and oily on the outside and hard on the inside. I had \"the American\" which was basically a burger. The patty was over cooked and other than that it was just a standard burger. My wife had \"the southern\" which she said had a strange flavor. Heavy taste of curry and a strange spicyness to the chicken. The waffle were disappointing in that we couldn't taste them. You would think that a place that tries to be different by using a waffle instead of bread would make it the star of the menu but in reality you couldn't taste it al all. The service was okay I guess. I would have liked someone to come over after we got our food to ask how it was but that didn't happen. If it was busy I can understand but we walked in around 130 and I would say about a third of the seats were occupied. So in conclusion, cool idea but poor execution. Maybe we just caught them on a off day but I doubt I'll go back which is a shame because I live really close by and love waffles."}
{"text":"We went here for grand opening.  The food was great!  I had the southern hospitality with fried chicken and maple syrup...yummy!  We also had poutin (which is french fries with gravy and cheese curds) and they were made to perfection.

I shared a s'mores dessert which was to die for.  The portions were a good size for the price. Would highly recommend trying  Crave."}
{"text":"I ordered the \"some like it hot\" and it did have a bit of a kick to it, but lacked flavor. The waffle was thin and broke down half way into eating it."}
{"text":"Loved this place I had Some like it hot I loved the onion rings. Loved the waffles light & buttery on my hamburger...Very nice waitress!!"}
{"text":"I hate to leave a place like this a bad review. But...it is what it is.

I like waffles. I like sandwhiches. This should be great!

No it is not.

I got a breakfast waffle with eggs bacon and cheese. My husband got some delicious sounding fried chicken and gravy combo. Our kid can't have wheat so she got a hamburger patty, avocado and banana slices (two thumbs up for accommodating this) 
The waffles were so soft they were mushy. My eggs and bacon were so sad. I was expecting some slices of bacon. Nope. Tiny sad shreds of diced bacon. There was a weird after taste as well. Don't know if it was the bacon, egg or waffle. It just wasn't good. It was a small portion of food and I didn't get through half. My husbands waffle was basically disintegrated by his sandwich filling. I know we weren't alone in this. Another customer was very loudly and angry in his complaint that \"MY WAFFLE IS MUSH.\" The best meal was for our toddler. Her patty was tasty and the fruit and avocado fresh. The employees are incredibly sweet and friendly. The restaurant is stylish, very clean. I hope they can pull it together and improve the food."}
{"text":"This review is based off the bar & a snack. I will be back to try the sammies soon. We didn't know that they had opened so we ate before getting to Westgate but we snacked on some onion strings that were served with the crave sauce & ranch. The batter was light crispy, not greasy & the Crave sauce was pretty tasty. It was early & the bartender was just coming on so the manager was manning the helm & she was super sweet, fast & helpful when we weren't familiar with the menu or cocktails.  When the bartender came on she was busy doing some set up & was still attentive which was great."}
{"text":"Omg. Great beer.  The waffles and apple pie, Nutella are excellent!   Cashiers, bartenders are great.  We are coming back at least once a week and bringing friends."}
{"text":"I was curious about what a waffle sandwhich would be like so I had to come. I got the some like it  hot and it was so delicious. My daughter got a chicken tender kids meal and it was a good amount of food for a kid and the fatty I am, I stole some of her food. Oh my gosh, seriously think they may be the best chicken tenders I have EVER had. The carne asada fries were super great too and I didn't have one complaint. The guy who I think Is the owner was nice and overall I would recommend. Prices weren't bad either. Definitely coming  back, I want to try the sweet Caroline next and poutine fries!"}
{"text":"Stumbled upon this place on a Saturday afternoon... and we will be going back regularly. We read some of the posts about food taking so long and I said to myself these people are idiots. Of course it takes forever to get food on weekend nights. When a place is as good as this, plus it's in a heavy drinking/partying/sporting district you can expect a wait. 
With that being said, this place is great. THE Asada fries were good. Bummed that they weren't made out of waffles bit still really good food. My wife had the Californian... oh my golly gee this was delicious. And the S'more dessert was heaven on earth. This place was delicious!"}
{"text":"Interesting concept. Very inexpensive. Wondering how they can survive at those price points. That's for them to figure out, but I won't be surprised if I look at their menu six months from now and see higher prices. 

We ordered the Southern Hospitality (chicken and waffles), Philly cheesesteak, kids burger and plain waffles along with the fries with mozzarella and gravy and pulled pork fries. All sandwiches/burgers are served on waffles. Good sized portions. Food was tasty. 

Now, the reasons for three stars...  

1. It wasn't busy, yet our food took a reeeeeeeeaaaallly long time to come out. 

2. One order of waffles was done separately, when they weren't making any others, and the waffles were cold. I asked the hostess if the waffles were premade earlier, because they weren't remotely warm. She apologized and offered a cheesecake dessert on the house. 

3. While waiting, I saw one of the chefs hold his head (while wearing food handling gloves), then take his hat off and put it back on again - food gloves still intact. I'm not up on all the food handling procedures, but I'm pretty sure you're not supposed to do that. Didn't stick around for dessert after seeing that. Lost my appetite."}
{"text":"Crave burger is beyond delicious! Who doesn't love waffles right?' Brittany (our server) was kind and attentive! Next time we are in AZ we will be coming back!"}
{"text":"This was the worst dining experience I have ever had. 

I ordered an overpriced ravioli dish ($18 for 5 raviolis). It took them 25 min to serve me my dish and I was literally the only person at the restaurant at noon on a saturday. The pasta was WAY overcooked and barely edible.

There was a guy shouting on his cell phone, walking around the restaurant. He seems to have worked there. It was really annoying."}
{"text":"I was surprised at how much I liked this place. I didn't think I would, but it's actually really good."}
{"text":"Nice atmosphere.  Friendly staff but it took them forever to get our meals out.  Our waitress came to us at least twice wondering why we haven't gotten our food yet and she'd come back saying our food should come out soon.  I'd say we waited a good half hour.

When the food finally came, mine was a bit lukewarm/cold and the waffle had softened.  I've never had a waffle sandwich before but I'm assuming it should have a bit of a crunch like waffles do?

Despite the food being on the cold side, the taste was not bad.  The pulled pork fries was probably the best part of the meal.  Quite tasty.  

We'd probably come back here just to see if the \"bad part\" of our experience was just a fluke.  If you are curious about their food, I'd say definitely give it a try.  The food was tasty, just a bit on the cold side."}
{"text":"Just a ding for service as some servers do have some attitude. Otherwise, maybe we were lucky and service was quick and food was great (and hot, as opposed to others reviews). There were 3 of us. We had lunch with homemade peanut butter waffle and jelly, turkey waffle sandwich, and a chicken strip waffle sandwich. All were really good. We came back next day for breakfast, and it was great as well. Also, a negative would be their floors. The concrete just looked dirty and stained. Back and forth with 3-4 stars. Either way, I plan to visit in the future. Pricing is really good as well."}
{"text":"Creative concept, great execution, and really inexpensive!  Unfortunately, it took more than 35 minutes to get our food and it arrived cold and one thing was wrong--I ate it as is because the server would never make eye contact to let her know.  In addition, our server didn't seem to scan the room and my drink sat empty for most of my meal, then when we went to pay it took 15 minutes and asking another server to find out server.  If the food had been warm or the service had been good I would've given it 4 stars."}
{"text":"This place is pretty bomb my friend and I split the Nutella waffle sandwich and the Mexican carne asada Sanwhich . Both were really good although you need to be rolled out o there afterwards. They serve mimosas as well. Recommend give it a try Atleast once . Not sure if I'd ever come back. Service was good though also"}
{"text":"The waffle sandwiches are very good, but don't taste as good if you take them home. So order and enjoy there. The servers have always been kind and friendlu, even to my young kids. They even offered to change the channels to a more kid friendly station. One of our favorites at Westgate for sure."}
{"text":"So far so good. I got the sausage and egg and it's good. I like it. The place is pretty packed so other people must like it too. I couldn't find any sugar for my iced tea though, that was kind of a bummer. 

I live out of town and wanted a cool place to get some brunch-this was a good pick."}
{"text":"Have passed by this place a few times and it never seems to be busy.  I finally decided to go on a Saturday and try the lemon berry cream. I assume we were the first customers of the day because it took quite a bit of time for us to get one waffle (more than 20.mins).  The server was nice- I'm sure she overheard us talking about the long wait time, so she did explain that it took a while for the waffle iron to warm up.  This place has so much potential but I feel like the management may not have their priorities in order considering the extremely long wait time for one order and the consistency in complaints.  A 5 star would have included:
A decent size waffle for the price
A ready establishment (meaning- at a WAFFLE centric business that  opens at 8 and the waffle iron needs 20 mins to heat, someone should turn it on at 7:40 to make sure you can serve your customers)."}
{"text":"OkAy so i just came back from burning man and had a hankering for a waffle sandwich. I searched far and wide and ran into Crave in Westgate. Britt who was a phenomenal waitress, was fast friendly and full of glee! She made the best vodka red bull in Az! i'll be coming back tomorrow for more waffle surprises!"}
{"text":"Terrible food. Calling it mediocre would be generous.So many mistakes with the food and most of them just sloppy and easily avoidable. Whoever is doing the quality assurance for that kitchen knows nothing about food, execution and technique.  Dry, cold buns. Horribly over cooked and tasteless hamburgers. I could go on. The location might dictate that they have at built-in customer base but I'm predicting this place is going to be out of business sooner than later if they don't get it together."}
{"text":"Had a 'light dinner' special.  Spetzel (sp?) was tasteless.  Turkey club was ok.  Sweet potato fries were pretty good."}
{"text":"Don't think I'll ever come back..., the service brought to us by Steph as it said on the check was horrible and so was most of the food. 

We came in as a party of three, however we were waiting for two more- while waiting we ordered drinks which took a couple of times for her to bring all of the correct drinks to the table, and the loaded fries as an appetizer that came out with shredded cheese that had been melted and then was solidified by the time it had hit the table. The sour cream/cream cheese that it was served with was impossible to dip into or even spread onto the fries. We decided to eat them because we came in hungry and we understand not everything will be perfect however, it went down hill from here. As we finished up the fries Steph came by to ask us if we needed plates for the fries that we had already finished. Never once checked on the quality. 

We ordered food for everyone while waiting for the last member of our party to arrive. The entrees were just fine (strawberry cheesecake, blt, turkey club, and the southern hospitality) however it would have been nice if Steph brought us the condiments that we asked for, instead she went to go do some side work. Because one of our guests were late we had asked for it to be held under the heat lamp and he would arrive minutes after however she insisted that it go into a Togo box and that he ate it later. After telling her that he would arrive soon she left the table. 

After a while we needed drink refills that we had to call her over to the table for- still no quality check or condiments. We finished eating and she cleared the table. She has offered desert- strawberry cheesecake which we had already ordered...we declined and she brought us the bills (split 4 ways) on my particular bill it was $36.xx we placed a $20 bill and a card for it in the check presenter. We told Steph to process the cash then the card, instead Steph failed to inform us of an auto grad (would have been courteous) but more important than that she pocketed our $20 as a tip, then charged the card $36.xx + an 18% auto grad on top of that. We caught this and she told us there wasn't anything she could do about it, but after discussing this we found out that a manager was able, the manager never came by the table after to apologize and Steph was short with us after the situation. 

I don't mind giving a deserving server a generous tip, but to assume that after the service we received that it was going to be that incredibly generous just puts a horrible name for this establishment. If you're looking for bad service, and  just okay food I highly recommend!"}
{"text":"The food wasn't bad and the service was pretty good but they need some work still. We went on a Sunday afternoon around 3 PM. There were a few people already eating but they didn't appear to be busy at all. My wife and I ordered a BBQ Chicken sandwich to share, they offered us the option to make it a combo for an additional $3 which seemed like a pretty good deal. They are a little pricey for fast casual. The combo was over $11 with tax. The menu board was out of order so they offered us a printed menu, looks like they are still recovering from the super bowl as a handful of sandwich options were not available. Unfortunately we waited 27 minutes for our single sandwich and fries. We weren't in much of a hurry and sat on the patio but I was a few minutes away from getting my money back. The manager came over and apologized for the wait and offered us a free dessert. The sandwich was pretty good, the chicken was nice and juicy. The fries were OK but a little limp. We had the cheesecake dessert waffle, the cheesecake was more a yogurt than cheesecake. I also noticed from another user's picture that there cheesecake seemed to have some graham cracker in their's, ours did not. It seems they need to work on their consistency. Overall it's an interesting idea but they need to work on their execution. We will probably try in another few months when they get their act together."}
{"text":"Had the pull pork and chicken and waffle. Realized later should have eaten with knife and fork vs handheld. Overall I will be back very soon."}
{"text":"Tried out the southern waffle here.  It was basically chicken and waffles and was pretty tasty.  The chicken had a some spicy syrup on it that was a nice touch.  The meal was a decent size.  Enough to share.

The only bad part was the thing was supposed to be a sandwich but was impossible to pick up.  It would have been better just as chicken and waffles on the side.

I would come back to try out some more.  Looks like Westgate is slowly improving.  I hope more places open up."}
{"text":"The all American waffle burger was fresh. The waitress was very friendly. Order a side of the frys."}
{"text":"Definitely liked the waffles. I would have been more impressed if they actually integrated waffles into their appetizers. The carne asada fries weren't that impressive (fries need to be crispier and a better recipe please!). The waffle sandwich was good with the waffle. Slaw was old and I wish they included more meat (one small piece isn't enough to sample). The dessert combination was good (Nutella, banana). Service wasn't bad but there was a point where the food was sitting on the window waiting so our food was a little cold when we got it. Overall I'd come back for waffles."}
{"text":"No cheese curds as advertised on the poutine fries but a decent amount of mozzarella cheese.  The waffle was delicious, light with a slight crunch with a great tasting burger inside.  I was impressed.  I also tried the carne Asada fries and the pork fries. While I feel all of their food that I've tried is excellent, the fries lack a fair portion of meat to make the price acceptable."}
{"text":"I love coming into Crave; I enjoy the atmosphere the staff gives. Kim is my favorite server! She's so funny and sweet, plus she has the same name as me so that gives her brownie points in my book! Other than that the food is surprisingly amazing the waffles sound a little strange at first but please try it you will be surprised."}
{"text":"The food was good. It's wasn't anything like \"OMG\" but the food was good enough to come back. 
I got the Southern Hospitality ($9 + 3 for fries and drink) and the chicken was well marinated. The only thing I didn't like was how they put the cold slaw inside the waffle sandwich. It made the waffle very soft so half was crunchy and half was soft which annoyed me to eat my sandwich cause it was so sloppy. Also the ranch was so warm... That's kinda nasty. Ranch is suppose to be cold once it's open...

But the service was just not right. They act like they only cared for the paycheck. I mean, everyone works for their paycheck but the employees their are so rude to each other. I witness the girls fighting over bring customers their food and rolling their eyes at each other. That's just not right. 

Does the chef not know there's a wide open window in front of them? They be scratching their head, taking off their hat and then not wash their hands and continue to handle the food with those dirty hands. That's just nasty. I wonder if the kitchen is even clean....

I don't know who the manager is, but he or she needs to trained the employees a little better. 

Overall, I would come back once in awhile."}
{"text":"I would have given this place 5 stars but the service is absolutely horrible. It's 2:11pm and we are literally the only family in here and I had to hunt someone down for refills. The waitress never checked on us. I had to walk over to the server station/expo window to grab some ketchup for my daughter. While I did, I glanced and saw 2 line cooks playing on their phones. No one ever asked how we were, and I had to flag down the bartender to get the check. 

The food is literally amazing. The flavor, variety and overall concept is fire!! We are not from around here so our first impression is terrible. Which is too bad because I would've loved to come back when we visit Phoenix again. 

Ps. Our server was Britt."}
{"text":"The staff was nice, but the food just OK.  It seems as though no seasoning whatsoever is used when preparing the hamburgers which was a big disappointment.  It would be great if maple syrup was provided with each meal since waffles are involved.  We live too far away to make this a out of our way destination.  Best of luck with business!"}
{"text":"Hubby and I came here day before super bowl. They only had a limited menu available which was fine with us. Hubby order the pulled pork waffle sandwich and I order a chicken sandwich. Order was surprising prompt for how busy it was. The hubs order came out perfect, mine on the other hand came out all wrong. The cashier had completely entered the wrong sandwich. Instead of a chicken sandwich I got a cheese burger. There was a crazy long line so I just ate the burger which was still good. Plus having a waffle for a bun is just awesome. Only other complaint was about the salt level on the fries but I have a low salt tolerance my hub said they were delish. All in all I will definitely come back. I'm looking forward to a dessert waffle!!"}
{"text":"I really wanted to like this place however our experience was just so bad, two stars is being generous and only because the food was pretty decent.

We stopped in Crave before heading over to the stadium for Monster Jam. Every restaurant in WestGate was packed with lines out the door due to Monster Jam as well as a snow day at the mall; people were literally everywhere. But the line at Crave wasn't bad so we decided to check it out. After standing around in what we thought was a line to the hostess stand, we realized there was no actual line and people were just hanging around waiting for someone, anyone, to check them in. 20 minutes later, we were finally added to a list by a very flustered server who assured everyone a table shortly, that they were just short staffed at the moment. I didn't mind waiting seeing as though we would have waited anywhere we went that night. The guy behind us wasn't so patient, though. He let the server know that customers were walking out due to the host/servers lack of organization and communication. The server, I think her name was Brittany, started calling names from the half assed list and quickly realized the majority of customers had either left or already been seated at which point she berated another server in front of all of us. Telling her they need to cross names off the list or else everyone gets pissed. She had a point, however she should have never spoken to another server in that tone in front of customers. I was patient and understanding up until that point, but her unprofessional manner completely turned me off.
She seated us and the rest of our time in Crave became an even longer waiting game.
We ordered drinks, which we had to wait at least 15 or 20 minutes for, our food took another good 40 minutes or so.

I understand they were busy and supposedly understaffed, but seriously the place isn't that big, there were maybe 10 other tables in the place and 3 servers that I saw. It was like no one in the place had ever worked a day in the restaurant industry in their lives. No one knew how to handle a crowd. And our server, Brittany was flat out awful. When another server tried to bring us an order of onion rings instead of fries as we had ordered, Brittany came to me and whispered, \"don't mind her, she's losing it!\". Not cool at all.

I'm giving Crave a 2 star review because the food was decent- we ordered a club with fries and a regular waffle. The sandwich was good, as were the fries. The waffles were super crispy and a great alternative to regular sandwich bread.

I'd probably give Crave another chance given the food was good, but id make sure it's not busy and make sure Brittany's off that day."}
{"text":"Have been patiently waiting for this place to open. After having something similar in Oklahoma a while back I couldn't believe something similar didn't exist in Arizona. Glad this place is open. Everything is fresh And delicious. Only a few menu options right now considering it just opened. Will surely keep coming back."}
{"text":"Our first time here and I have one word for it... DELICIOUS. I ordered the club and their pesto is perfection with the havarti cheese. The waffle is buttery, not sweet and not too much where it would be too filling. Even their fries are amazing. I will be back!!"}
{"text":"Ok, so one of my friends told me about this place and she didn't really have the best of things to say. However another friend of mine wanted to check it out so I said hey why not. We went for lunch and it wasn't really that busy so we were able to take our time to figure out what we wanted. 

The concept of using waffles instead of buns is different and definitely something everyone should try. I was a bit worried the waffle would be too thick and filling but it was just the opposite. It was thin and airy so it was actually lighter than some used breads used for sandwiches and burgers. I had the California, had turkey slices, avocado, lettuce and this cheese spread. Other than the turkey slices being a bit dry, it was pretty good. 

The service was good. The cashier also seemed to be serving as the runner and busser. Again wasn't too busy but kinda felt bad for her. She checked on us a few times which was nice to see if we needed anything.

I'm not sure I love the waffle sandwhich but I wouldn't be against going again."}
{"text":"It's not just a buffet, regrettably.
We had a coupon and went there midweek at 5pm; I anticipated that would be a time when it wouldn't be busy and I was correct, but that didn't help at all.
The decor is pretty standard \"Sheraton chic\"; verging on tacky, but just managing to avoid it.
The apps came promptly and were the very best part of the meal; my charcuterie board was actually very nice. Too bad the platter it came on was bigger than our table, literally. It looked like a visual, food-based representation of canada...a lot of land, and not many people. My wife had to rest her shrimp on it.
  25 minutes [yes, 25 minutes] after the waiter removed our appetizers my wife got tired of waiting for the mains and went to find the washroom. I'm guessing the [new] waiter was hiding around the corner in anticipation, because the second she disappeared our steaks arrived. Turns out the washrooms are for the entire hotel and you need to change buses to get to them. By the time she got back about ten minutes later, our food was stone cold [although it had only been lukewarm when it arrived], but we dreaded the thought of asking for new plates and waiting for who knows how long. So we had cold steak and instant mashed potatoes you could use to apply wallpaper.
  45 minutes [yes, 45 minutes] after they removed our mains, the desserts arrived. Typical Sysco stuff, not surprisingly.
  There was one source of entertainment that was ongoing during this excruciating experience, however. We amused ourselves by watching a solitary guest send his meal back three times. He was livid! Ironically, he arrived after us and still made it out before we did.
  The problem with the service appeared to be that our waiter had two other people \"helping\" him. They were all equipped with remote mics but I don't think they spoke the same language; the lack of communication was astonishing.
  At the end, we got the bill three times from three different people, and guess what? Each and every bill was exactly the same as the other ones, and none of them took the coupon into account.
  The two \"helpers\" were astonished to hear that we had a coupon, since the first waiter had taken it away at the start of the meal and they both asked us to produce it... that's when I almost lost it, but my wife restrained me. I guess they thought we were lying? Our original waiter then arrived with the third bill, informing us that we paid full price now and the discount would be taken off the final bill when we checked out of the hotel. When we politely pointed out we weren't staying at the hotel, he didn't know what to do.
  After more than two  and a half hours in \"The Twilight Zone\", it took us a few minutes to get accustomed to the natural light out in the parking lot. 
  Quite possibly the worst experience I have ever had at a restaurant, and that's saying a lot."}
{"text":"Very nice and friendly staff. The food was different but good. It was interesting having burgers with waffles as the buns ! It was a overall fun experience!"}
{"text":"The service was ok.. wasn't anything special and they were out of three things I asked for I wanted to get up but I ate the food nothing to write home about honestly probably won't b back not really a breakfast spot anyway"}
{"text":"Everything here is wonderful. Food is inventive and delicious. Bar drinks have always been great, the inside is nicely decorated and the staff is wonderful. I have been here many times and would recommend it to anyone!"}
{"text":"Registered girl was friendly. All the other staffs were rude. They need to train their employees more. Understanding that I came for the food, but the way one of the employee talking so loud and dressing was innopropriate. The food was NOT good at all. Made my stomach hurt."}
{"text":"We came here during the intermission at the nearby AMC for the Oscars Viewing, which means we only had about an hour to make it back for the next movie.  I'm not sure why other people keep saying that the food came out very slowly because we definitely didn't have that experience, thank goodness.

I ordered the Some Like It Hot and found the waffle concept to be a perfectly nice addition to a burger.  We had a couple beers with our meal out on the patio and it was perfection.

The owner and possibly the manager came by and both asked us how things were tasting and if they could do anything else for us.  He had mentioned they wanted to make sure they continued to make the experience better.  It had only been about a month after the Super Bowl and so they wanted to work on all the kinks that they noticed had happened during that time.

If you like to try to new and unique foodie experiences, I definltely recommend you check it out.  I for sure want to come back for a sweet treat."}
{"text":"We went out to eat at this location last night and it was the worst experience I have ever had. At first we waited 10 mins for our server to come to the table . She was very polite and sweet but said no one had communicated to her that we had been seated ? Ok ... fine... she then continued to take our order which included one dos X and one margarita . We had waited almost 30 mins for the drinks before I got up and went to the bar to see what was up , the bartender continued to tell me that she had lost the order and she was busy and frustrated. Ok?! We then waited another 30 mins for our food to get to the table and then it wasn't really fantastic! Super disappointed would never ever go back! Management needs to wake up before they start losing a lot of business."}
{"text":"Only one waitress staffed for 6 tables. And shes also running the bar. Shes very friendly and nice doing the best job she can but there should at least be one other person to help her. When i mentioned it to her she said that its happened before and that its been even busier with just her on. I watched someone walk out because she couldnt seat them due to being busy at the bar. The food is great but it does take a while. Ive been here twice and each time its been about a 30/40 minute wait for food."}
{"text":"Really glad we decided to give this place another shot! I had visited when they first opened & was not impressed, this time was the total opposite. I had the poutine & chicken & waffles & I could honestly say this was one of the best chx/waffles I've had! The poutine was awesome but the fries were a bit soggy, not a huge deal for me as the gravy was just so delicious. The chx/waffles were perfection; crispy sweet waffle, chicken was crispy & salty, the perfect combo! Can't wait to come back & try out some more of their creations."}
{"text":"Had a few issues and only ordered 2 salads. The manager stepped in and fixed everything. I would return but would stick to breakfast/dessert for a location like this."}
{"text":"This place was great! Good atmosphere, the waitress (I wish I knew her name to give her a shout out) and manager (awesome!) may have showed us some of the best customer service ever! I had the Southern Hospitality... It was great!! We shared the strawberry cheesecake for dessert, also amazing! Huge portions for around $10, so make sure you're hungry!! There was 5 of us there, and they definitely made regulars out of us all. Keep up the great work!!"}
{"text":"It took forever to get take out on a Friday night.

The food and portions were worth it though.

I had the waffle with skirt steak, avocado and chipotle sauce.  It was delicious.  Loved the waffle and all the toppings.  Only problem was everything was cut in bite size pieces and then put on the waffle.  This made it almost impossible to eat as a sandwich.  I think a big chunk of steak would make much more sense.

Husband tried the carne asada fries.  Was so big he couldn't even finish.

One child had the kids meal pb&j and was happy.

Other got one of the egg ones but wanted the egg and meat on the side of the waffles .  Kids meal portion was same size as adult.  

Would like to try more things on the menu."}
{"text":"Had an interest after seeing a movie, now trying out today and it was a new, delicious, and satisfying breakfast. I had the crave club and my cousin  had the melt down the waffle sandwiches were wonderfully crisp and not to sweet but very well compliment the meats and vegi's. Over all very satisfied!"}
{"text":"I wish I could give this place 5 stars but we waited over an hour for our food when there were only 4 other small groups of people there.

They changed this place into a sit down restaurant and I feel that could be part of the problem. Enough of my complaints, lets talk about all the good things. First off, there is something here for everyone from sweet to savory. I ordered the BBQ chicken one and it was amazing! The chicken was a mix of being lightly fried with a perfect amount of sauce. I loved the onion rings since they were the lightly battered ones.

The prices were pretty decent and I would go back again especially since there is ton of free parking. Hopefully next time my food will come out a little quicker."}
{"text":"My husband and I,  were looking for something different for dinner.  We found ourselves at Crave Waffle Sandwiches.  The wait time was minimal and the staff was friendly.  We ordered two different variety of waffle hamburgers & the combination of waffles 'as the bread' & the meat patty was different but good. Go check this place out, if you haven't already."}
{"text":"Food was on point, nice size for the hungry ones. The special honey sauce in a must have, got extra to take home."}
{"text":"For some reason I expected this to be a high quality foodie type place. I was wrong. It was empty while we were there but I'm guessing the quality of food meets more of the teen crowds standards. 
Burger was very small, and dry. The waffle 'bun' was cold and soft. Salad had ingredients not listed on the menu. Also way overpriced for what you get. Next time I want a burger I'll go to in and out."}
{"text":"I went to this place when it first opened and it was pretty good, so we came back today...big mistake. First, they tried sitting us in between two tables stacked with dirty dishes (that remained that way the entire time we were there) so I asked for a different table. There we sat waiting and waiting for a waitress. When she finally approached we had already decided on our food so we placed our entire order. She brought the wrong drink, walked by us multiple times and refused to look our way so we finally had to call out to her to get her to come over. I told her the drink was Wrong and she said she'd get a new one then carried on helping other people, I finally gave up and walked up to the drink station and got my own drink. Long story short the service was so horrible and we got sick of waiting and waiting so we walked out. Oh, and a waffle place that charges $1 extra for syrup? Come on."}
{"text":"I am actually creating an account to write this review.  I hate complaining, I can count on one hands how many times I have probably sent items back in my life because it was incorrect.  I went here on a Saturday night before the Aerosmith concert and after waiting 20 minutes in line with my girlfriend picking out exactly what we were going to order they told us \"we just decided to stop taking orders for the night, sorry.\"  I'm sorry, what!?  It was 7pm!!!  You decided to just stop taking orders?  No explanation at all, were they out of food?  If so, how could you be out of food?  I understand it was busy but lots of concerts and sporting events happen next to Westgate this can't be your first rodeo.  The thing that made me the most upset wasn't that the girl didn't tell us while we were waiting and let us wait 20 minutes before telling us, it was no offer of a complimentary meal to make up for our troubles, no further explanation, just sorry you waited that long and then she walked away, meanwhile there are 4 or 5 people behind us!  So I am the one who turns around and says they are not serving food anymore...do your damn job!  I go to Westgate quite a bit before Cardianls games, but one place I will never try is Crave Waffle Sandwich Creations!  I will definitely be verbalizing this dissatisfaction to anyone even wondering about this place."}
{"text":"NOM! A concept I have never seen before and executed well. Southern Hospitality, Pulled Pork, and All-American are deeeelish. Now to try their sweet waffles! Minus one star because the wait time can sometimes be lengthy even when the place is not too crowded."}
{"text":"Great, creative, delicious, absolutely fresh food!! You have to try the strawberry cheesecake.. Great for kids and for adults. Service was the best really friendly service stayed late with a smile:) and beer on tap can't go wrong:)"}
{"text":"First time last time. While the sandwich itself was OK the wait time was much longer than it should have been.(45 minutes)  Frys ice cold.  Beer luke warm. Need help organizing kitchen."}
{"text":"I recommend their southern hospitality! It's absolutely amazing like omg  and they have a strawberry and banana desert that's absolutely to die for man! Great place stop in for a quick bite!"}
{"text":"I would rate them more stars if their waffle was crispier and held up with all the sauce & juices of their sandwiches. The fries were delicious. Their service was fast and friendly. Just make sure to ask for ketchup if you take your food to go."}
{"text":"Omg. This place is amazing! My friend ordered lunch and I ordered breakfast and we split. I got the waffles with whip cream, strawberries and bananas. My friend got a yummy sand which. I think it was like the crave special or crave something. Both were amazing. The \"bread\" for the sand which was mad out of waffles. We literally ate all of our portions of both plates. I can't say I do that too often but it was awesome! I definitely recommend this place. I would like to go back for sure."}
{"text":"I heard alot of good things about CRAVE. I pass by it all the time and I always told myself that I'm going to go in there and try it out. But I would always forget. That pretty much sums up my experience with CRAVE, forgettable. The place looks great and the food looks delicious, its just plain. I got the backyard BBQ chicken sandwich. Chicken & Waffles and BBQ! Sign me up. Where was the flavor? Maybe it was the sauce cause it did seem to overpower everything. I couldn't even really taste the waffle. I really enjoyed their fries though. I like my fries to be a little on the soft side. So I'll give their fries a A. I'll give CRAVE another try. I usually like to try a place more than once before I review it. I won't go out of my way to try them again. Or make it a go to spot on a weeknight for food. But if just happen to be in the area I'll stop by. I just hope I don't keep forgetting to go and try them again."}
{"text":"Sorry but cannot give this place the ratings everyone else is going with. Here is my experience.  Noon on a Friday.  Staff was nice but still figuring out themselves and the menus.  It is a walk up order and they bring the food to your seat.   The menu was not displayed, the specials board was unreadable and the only thing we could read was one small menu on the counter with the \"available items\" highlighted.  Approximately 75% of the menu was available.

We ordered poutine, a Cobb salad, a crave club and a sweet Caroline.  I had to go over to the bar to order my beer. Which was $7.60 for a 12 ounce on tap of Blue Moon. 

We took a seat inside, and the trouble began. We immediately noticed a significant amount of Gnats/flying insects all around us. At first we thought it was just a few annoying bugs by us so we killed them but they kept coming.

So we decided to change tables. We thought if we sat outside where it was slightly windy it would knock the bugs down and we wouldn't have an issue. So we sat outside for all of two minutes before part of our food showed up and it was clear that it was not going to get better. The waitress asked if we would rather sit inside. We said yes and she helped us into the restaurant.

We sat at a different table inside and the problem continued. At one point there were five Gnats on or in my beer. They were all over the table and my wife's arms. My son had trouble eating because it seems like every time he went to take a bite there was either a fly near him or on his food or about to go in his mouth.  we could not stay any longer with the amount of flies around us. A number of the staff came up and asked us if everything was okay and when we said no they said \"oh sorry you have a lot of fruit flies at your table.\" It seemed like they were familiar with the situation but could not really do anything about it. Maybe closing the bar windows so that flies don't get inside the restaurant would be a good start.

If that was the only issue we probably would give three stars. But when my wife was getting ready to leave we asked for to go boxes and they said \"sorry we don't have to go boxes\" so they gave us aluminum to put across the top of our trays. Then we recognized that we haven't gotten our poutine yet. So we asked about our poutine and they questioned whether we had actually ordered it. We had to show them our receipt even though we were one of only a few customers that had recently orders.  They brought the poteen out about five minutes later. My wife had already left the restaurant because the bugs and service issues were overwhelming.

So we took the food to the car and finished eating in our car. We then found out that our son's salad had come without any dressing but we didn't want to go back into the restaurant so he just ate a dry Cobb salad.
With all of that said the food in the car was pretty good. The poutine was okay and the two waffle sandwiches were very tasty. my son liked his Cobb salad even though it was dry. 

Overall the staff tried to accommodate us but wasn't able to, the bartender was very nice and brought me a different beer that I had to drink extremely fast just so flies didn't get in it. The food was good but we had to eat it in our car. I can't give it more than two stars but maybe they'll work some of the \"bugs\" out and it will be better. We may try again in a few months."}
{"text":"This place was so slow,the place isn't even half full and the hostess/cashier acted so flustered as if the whole fuggin place was slammed. We asked if we could just sit on the patio since there was 2 people there...might as well have asked if I could have shit on the bar. The two salads that were ordered came out 10 minutes after the other 5 meals came out. The food wasnt at this place it's the service. The women were rude as fack and acted like we were idiots for asking to just sit down since it wasn't very busy. BUT according to them they said, \"sorry for the wait, we're never this busy.\" HOLY HELL I'd never go again if it was 1/4 full, everyone looked so pissed off someone needs to fix the time management issues going on in there. Won't recommend and won't return. don't be rude to customers because you can't handle yourself at less than 1/2 capacity."}
{"text":"Came on a Sunday for lunch. Place was busy, but service was still great and timely. I like how the owner came around to make sure we had enjoyed our visit. Everything is made fresh when you order, so for two of us, it took about 15 minutes for our food to come out. The waffles are thin, but I think perfect sized for a sandwich...I wasn't sure if they would come out really thick and make it hard to eat my sandwich. I got the southern hospitality sandwich and my fiancé got the Backyard BBQ. Both were delicious and I especially liked the spicy coleslaw and spicy syrup that came on the Southern Hospitality. We also tried the Asada fries which were perfectly paired with delicious gauc and sour cream. We will back again to try more!"}
{"text":"This was okay! The fries were excellent. The salad inside the waffle, I didn't understand it. The bottom of the waffle was soggy. Not much flavor to the chicken either. 

The staff ....Britania was excellent! The other staff members, just huddled around one another gossiping. The first thing, I noticed when entering was the kitchen staff, sitting on their phones."}
{"text":"Wait was def longer than promised for a to go order, they seemed a lil flustered and it was only 1030 so it was def not busy enough to explain the wait."}
{"text":"My boyfriend and I went here for lunch. I got the chicken club sandwich it was awesome!  You get a very large sand which and a ton of French fries. We both really enjoyed this restaurant and can't wait to go back!"}
{"text":"This place is delicious! I went with 2 other foodie friends of mine, so we could each sample the delicious menu items we read about prior. I ordered the Cobb salad- it looked rather small, but that was truly deceiving. One of my friends ordered the south of the border waffle sandwich, and other friend ordered southern hospitality waffle sandwich. We also ordered the asada fries. In addition to EVERY plate tasting amazing, the bottomless mimosas for $12 can't be beat. Now I don't have to drive all the way to central Phoenix for s great mimosa brunch. Service was excellent, food was amazing, and I highly recommend. Will be coming back for sure!!!"}
{"text":"Heh. Ordered the BLT with extra crispy bacon and fries. 

Ticket time was long given that we were the only guests, and when the food arrived, it was room temp at best. 

Bacon wasn't crispy, fries were hardly cooked and some were floppy. 

Service was okay, nothing spectacular."}
{"text":"OK you know I give REAL Reviews.... I would come again if I was in the area.

Food- is Above decent.. not enough to make you swoon and pause for a moment to think about life. Lol
The South of the Boarder is a Savory Carne Asada sandwich.... The menu says chipotle spread... That was Non existent on mine. With the waffle and steak.. a sauce is imperative....OR SO I THOUGHT!! 

The waffle was Light and crispy and the meat was juicy and well cooked. So the sandwich Never got thick or dry. There were traces of lime and cilantro but overall the sandwich was a little bland, but a LOT of potential to pp it up. I ordered the Cinnamon Crunch drink which was really sweet but the Bartender was an Angel and therefore the STRENGTH of the drink made up for anything else. Lol I was hoping the appearance of the drink would be fancier. Like a Cinnamon or cereal rim with a garnish and topping. But it didn't just looks like a glass of milk... Strong milk lol! 
Overall 3out of 5!"}
{"text":"My wife and I both had a savory meals. I had the South of the border and my wife had the chicken waffle.
Both were so so.
The rest of our group got the sweet waffles and they were amazing. 
Next time I'll definitely go here for a desert and not for a meal."}
{"text":"Food was really tasty!!! I seriously enjoyed my food I got the ranch is huevos and it was delicious. Service for me was super fast and Jennifer took care of us from start to finish!

I read a lot of reviews here but I did not have this experience while there. I was taken care of by Jennifer who was awesome! I could tell that other servers and a cook had an attitude of (whatever) about them so I could see how others had a different experience. Jennifer was definitely the shining bright star of the crowd working there so maybe we were lucky. I still enjoyed our visit and I really hope this place turns for the better their food is really good! I believe they are making changes so give them a try."}
{"text":"This review is based solely on breakfast upon hotel check-in at Sheraton Parkway Toronto on a Saturday late morning.  My party of three arrived approximately 11:30 am which was the tail end of breakfast being served.  We were immediately seated despite the tables were not cleared of debris from previous patrons nor wiped clean.  There were no table clothes nor cloth napkins.  Our table was a booth which was rather sticky from the debris of previous patrons.  I prefer the selection from their breakfast menu largely displayed near the entrance.  The Canadian eggs Benedict was surely on my mind as I not going to let go of a running egg yolk and Hollandaise sauce with Canadian ham- augh... but I had to follow the crowd of what my party decided.  Ergo, a light buffet breakfast was indulged.  I always care for hard boiled eggs and some sausage, but disappointedly there were no waffles, no pancakes, no home fries, no hash browns, no white toast with butter, and no fresh fruit.  Maybe it was the end of breakfast time and the beginning of lunch which I do give the benefit of doubt.  I have a predilection for waffles with maple syrup which I can eat everyday without weary.  There is wheat bread and marmalade.  I actually like marmalade.  I was not offered what teas were available but was served orange pekoe tea which was awful!!  I prefer light teas as green or white teas but not black tea because of the strength.

Our server Peter is very attentive, efficient, ready, able and willing to serve our party of three with a sprightly lively tone.  He appears very weary and in need of a vacation."}
{"text":"I really enjoyed this place! The food was good and so was the service! It's also very affordable. I'll definitely be back!"}
{"text":"One star for the food, one star for free soda I got for checking in, and another for the service. Lost two stars due to freakin flies flying around"}
{"text":"First time ever having a sandy on a waffle w a side of syrup outside of my house!  And gatta say, was super delicious!  Def recommend. ..don't remember what I ordered cause I told our waitress to bring me what you eat...Apperantly,  not on the menu...but damn was it good...mix with a cold brew! DynOmite!"}
{"text":"The food here is good, and it's a really interesting idea to put everything on waffles. But I recently went there with someone, and honestly next time I go there I would prefer to take my food to go because the waitresses are annoying as fuck. They come over and bother us about every 3-5 minutes. All we wanted was to sit down, and enjoy our meal together, and the waitresses (two of them because I think one was training the other) kept coming over constantly and asking us if we needed anything. Seriously, we have our food and our drinks are full, now leave us the fuck alone!"}
{"text":"My review is based solely on brunch @ Crave

I have been to Crave twice now. The first time was for Christmas Day brunch and the 2nd time was just a couple of days ago for Sunday Brunch. We had such a great experience on Christmas Day that we were curious about trying out their Sunday brunch. We called ahead to make sure there was availability and they told us we were welcome to walk in. We arrived around 11:30am and seated fairly quickly in a nice cozy booth. The restaurant was only half full, there were a few large groups of at least 5-8 people. A few tables had reserved signs placed on them - great choice since they were by the windows. By 12pm there were no empty tables.

I wasn't sure what to expect for their Sunday Brunch because i was really surprised at the price. Normally buffet brunches range from $40-50 (double that downtown at some buffets). It was priced at $29.99!! This is what they offered: bacon wrapped filet mignon, duck breast, pork tenderloin, prime rib, tilapia, salmon, rice, veggies, roasted potatoes pasta, king crab legs, peel & eat shrimp, full antipasto selection of cheeses, cold cuts, seafood salad etc., Breakfast items were eggs benedict, made to order omelette station, made to order pancakes, bacon, sausage. For dessert there was a chocolate fountain with fresh fruit, mini mousses, cakes, pies - the list goes on! Pretty impressive for $29.99! Ooops almost forgot - coffee & orange juice were included in the price. I'm a big coffee drinker and love a good cup of coffee Their coffee was really good, which surprised me since i never like hotel coffee. 2-3 different servers came by to clear plates, top up coffee, water and anything else we needed. We never had to flag anyone down. I also had an allergy concern and they brought out the sous chef to go over a couple of the items with me (they did the same at Christmas Day brunch).  

On a side note - Christmas Day brunch costs only $5-$10 more and has double the amount of items as well as turkey, stuffing, cranberry sauce and options for kids. Plus they have cookie decorating & a visit from Santa for the kids.

I took away 1 star for 2 reasons. #1 they didn't have any options for kids. Chicken tenders, fries or mini pizzas would be nice especially since they are offered at their holiday brunches. and a couple of items were cold. #2 a couple of items were a bit cold.

Overall - great experience, friendly staff and we were treated very well - i will definitely be back!"}
{"text":"The food was good, but the service was horrible.  The staff was clearly unorganized.  Friendly, but long wait at the hostess stand without being acknowledged.  Then we waited forever before someone came to get our order, and even longer for our check.  By looking around we were not the only diners experiencing bad service."}
{"text":"I love this little brunch place hidden on the northeast side of Westgate. We had friendly service and the food and drinks were delicious. This is one of my favorite mimosa and bloody Mary spots. The food is creative and tasty and I love how they stack your sandwiches using waffles! I always get the Californian or the chicken and waffles. Can't wait to go back and try more!"}
{"text":"Awesome place... The owner is hands with the business... He even gave us discounts and free taste for their desert..  I honestly don't know why some people thinks it's terrible because the one I had was amazingly crispy and hot"}
{"text":"LOVED the waffle sandwiches! Loved the chocolate, peanut butter, bacon, and REAL whip cream waffle! Great service AND great food! Super jazzed about stumbling upon this place! Will be back. Great job guys!"}
{"text":"1st time here had the Carne Asada Fries the were ok also tried strawberry cheese cake it was eh. Coffe supper strong. Would come back for the food"}
{"text":"Tried it for the first time tonight.  My girlfriend and I were pretty happy with the food.  I had the American burger.  The service was pretty prompt and decently friendly.  I did get the pulled pork fries and the loaded fries.  Pulled pork fries were amazing!  The loaded fries were ok.  My only complaint is it seemed a little overly pricey.  I would still come back though honestly.  Want to try their bfast next."}
{"text":"Food was excellent, our server (Kim) was so friendly. Pulled pork fries were delicious and we enjoyed several waffle themed dinners. South of the border has a nice after burn. If you're a drinker, my lady had the blueberry waffle cocktail ... great experience all around."}
{"text":"I stopped by on my lunch break and no one was there to assist me. The restaurant was pretty slow with one or two people at the bar and a couple people seated a one table. Come to find out there was just ONE girl working the front. She was bartending, hostessing, serving and doing take out orders. She was friendly and helpful, but I felt bad and couldn't help but feel like they needed one more person to work the front. I ordered the southern hospitality and it was pretty decent. I've honestly never had anything like it before but the service was just slow, and I couldn't be mad at that poor girl basically working the restaurant by herself. It took about 15 minutes for my take out order to be ready. Not entirely bad. They need to just work on the slow service."}
{"text":"My mom and I came here for Valentine's.  I made our reservation through OpenTable, and our table was ready when we arrived.  Overall, we both really enjoyed the food, very tasty and well presented.  I would have given Crave a 5-star rating if the service was better."}
{"text":"We came for breakfast this morning
No wait!  The mimosa was huge!
The waffles were airy and crispy and the service was good
We will be back"}
{"text":"18 bucks for a sandwich and fries.  Its a cute idea but this place is not for me.  I tried the poutine fries and the Some like it hot burger....EH."}
{"text":"Went the day of the Super Bowl, and multiple times after. Innovative menu, awesome soda machine, cool ordering system. It's kind of tucked away at Westgate but I highly recommend giving them a shot!"}
{"text":"A friend had recommended this place, and I loved the idea! 
So today the boyfriend and I went and tried it out. The wait staff was very friendly. 
I got my food, no problem. It was good, but also nothing special. 
However my boyfriend got huevos rancheros and requested no onions, and had to send the thing back three times because they kept putting onions on it, and on the third time it was also completely raw!! So he just gave up. The saving grace of this place was the manager RUBEN who went into the kitchen and cooked up a new one himself, and finally got it right. 
So I repeat that the wait staff was friendly, and the manager was fantastic, but the kitchen staff was awful. The only reason this got three stars and not lower was the awesome manager."}
{"text":"Crave it for breakfast.
Crave it for lunch.
Crave it for dinner.
Crave it before a concert.
Crave it after a movie.
Crave it before and after a game.

This place is fantastic! Excellent service!

Waffles are a great delivery vehicle for sweet food and savory food!"}
{"text":"Me and my boyfriend went to west gate after a quick break from a softball tournament. It was empty so we figured it would be a good quick bite. I then was nervous after reading the reviews of how long the food takes. To our surprise it was only about ten minutes for us to at our food and it was UHMAZZZING! Every sandwich should be on waffles. Mmmmm! Only 4 stars because the bathroom was filthy.. servers and hostess weren't doing anything so they should check on the bathroom."}
{"text":"Not bad, we got the Southern Hospitality which the waffle was a tad thin, the coleslaw soften it up and halfway through eating it fell apart. I also think there was a tad too much coleslaw bevause in some bites the yaste of the chicken was lost. Definitely put the syrup on this for sweet kick. We had the poitinne as well. Not bad as well, fries were good, maybe more cheese curds, gravy was a little on the salty side. Still not as good as Angel's Trumpets poitinne. 
I would def eat here again. My jalapeno Margarita was spicy yet refreshing  (on the hot side so if you are not into hot, not a good choice) I just didnt like the  $11 price tag, I dont think making it spicy with Jalapeños was deserving of the $2 up charge. It was also on the weaker side with alcohol. Next time I will try the coffee and get the alcohol somewhere else.
I think it is worth the try. No problem with service, but it wasn't extremely busy when we went either."}
{"text":"It's decent. The specific meal I had was very tasty but the waffles are so flimsy it doesn't really hold up. Their version of Poutine Fries was alright. Do NOT ORDER TOGO. I took home my leftovers and ordered something to go for someone and by the time I got home (Within 20min) ALL The food was soggy and it does not reheat well, not in the microwave or oven. 

Not bad for a hangover though and it;s a great idea. 

The server was pleasant and the atmosphere was great."}
{"text":"Ambience is nice. Fast casual but it's not very fast. The waffle is soggy, the chicken is ok, not great. We were excited to try but we won't be back. Great idea but very poor execution."}
{"text":"Delicious! We ordered add the cheese, please, blt, and an order of fries. Everything was sooo tasty. I never thought a waffle could taste sooo good with bacon and cheese. Cute decor, and has a bar with inside and outside seating. I will definitely be back soon to try other things on menu."}
{"text":"Very cool place. Unique waffle sandwiches and even better outside bar. I like to hang here and people watch for football games. Just wish they would turn off the overhead blowers when sitting outside. Supposedly it's a food heal thing.but it dries out my contacts."}
{"text":"I recently visited this restaurant with my family and right away the customer service was great. We were greeted at the door and were seated right away. Our waitress was very attentive and the vibes of the restaurant was very laid back and relaxing. One down side was when I received my pineapple juice and there was a small bug in it. However, our waitress was more than happy to bring out a fresh one bug free. 
Now for the food. The food was amazing and I got the Crave Parfait.  I just wish that they could of given me more waffle pieces for my parfait but other than that it was very delicious. 
I definitely would recommend checking this place out!"}
{"text":"This place is very different. You have to be open minded with the concept and you won't regret it. The food was awesome. Try it out"}
{"text":"We ate at Crave tonight. Our server was great.  She took our drink order right away...and that's where the wheels came off. The bar was apparently a disaster. Over 20 minutes to get a beer and a glass of wine. Might have been 30 minutes but I don't want to exaggerate.  It wasn't the server, it was the bar. The bartender made sure to cover the bar, but no one was taking care of the tables.  We weren't the only ones complaining. 

Food was ok. They comped the first round - which was nice. But I would have preferred to pay for the drinks and get them in a reasonable time. Annoying but not the end of the world. Lots of other options at west gate so..."}
{"text":"Delicious food made fresh! You can definitely tell they use fresh ingredients. We had the carne asada fries which were a hit, Crave Club was amazing if you want something in a traditional sandwich and On the border sandwich which had a nice Latin twist with tender carne asada. 

All the staff members were very friendly and Jim (not sure if he was manager or owner) was awesome. You can  tell he takes pride in this new spot. We are definitely going back to become regulars.

Being in the same industry I do have to say that it's great to see the technology they are implementing in their restaurant. The new soda machine layout with different combinations to add to your drink. Their ordering system is pretty cool as well and their large menu display on tvs. Great job"}
{"text":"The wife and i read the reviews. We decided to give it a try. When we ordered we were told they did not have most of the menu in stock! Who ordered the food here? Apparently running out of food on a weekend is good business. The food took almost an hour and there were onky 4 other tables seated. When it did come out it was the wrong order. I watched as several tables had wrong food delivered.  
What is wrong? How hard is this?
When our food did arrived I have to say it was good. Small portion but good.
Might give it a try again in a month to see if they function better."}
{"text":"1st time here was super excited to try. Yes the waffle is pretty thin for all the deliciousness inside of it! Also the carne asada fries were warm and a tad soggy not hot and crunchy,However the carne asada was very authentic true Mexican flavor!they got my son's meal wrong but corrected it with a smile. I did notice 2 waiters hanging out they were not the best and it contributed to the cooled down fries.However the girl at the bar took action and is an excellent multi-tasker! She deserves a hand and took care of us.I would definitely go back and request my hot fries! Definitely ask for the sauce on the side until grubb time! Highly recommend it. Crave is better than the place in California Crave uses less butter and oil. No heart burn in this tummy."}
{"text":"We just took our big family there. I think we had 14 and the food is still great. The service took a little longer but hey we were a large group! Our whole family loves all their meals!"}
{"text":"Great spot! Good waffle sandwich combinations. Love going here for breakfast every now and then. Their own twist of great waffles! Definitely recommend!!!"}
{"text":"The service was soooo slow and we were one of 6 tables! The food was cold and lacked any flavor! One star is being generous!"}
{"text":"I went to this place in March. Everyone except me had a meal with the waffles and they loved it. I went the good route and got a salad. The chicken on the salad was good but the ranch had a tangy taste to it. Within 6 hours I became violently I'll on our way to San Diego. A 5 hour trip took 8 hours so I could vomit. Arriving in San diego I was immediately admitted to the hospital for severe food poisoning. Per the doctor the timing makes the culprit craves. After recovering I emailed the manager several times and never heard anything. I even called \"Jim\" the manager that said we had 10% off for life. After spending $250 for the hospital bill and $50 for prescriptions, that 10% means nothing. Plus to this day no one has ever called or emailed me. It could have been the lettuce or the dressing. So please pay attention if you eat here. The young and inexperienced chefs don't know how to clean the food or properly store at the right temperature and if you become ill they ignore you.
Tracy"}
{"text":"So my wife and I get there last Saturday around 11:00. One group of three ahead of us, 6 open tables. The hostess won't seat us because the kitchen is backed up. I am not mad about the kitchen being backed up, but mad that we can't be seated, comfortably with a drink, despite 6 open tables.  Instead, we are on a 25 minute wait. This is the dumbest thing ever. I've never seen this happen anywhere, and I eat out at least 8 times a week. So the service, or lack there of, is pretty lame run by stupid managerial decisions."}
{"text":"My boyfriend and I decided to stop in Westgate for lunch today. We were weary of the concept walking in! We sat at the bar and our bartender was Katie (sp. ?) she was SO nice and so knowledgeable on the food and the area. She suggested the carne asada fries, which ended up being amazing. Especially for only 6 bucks. We loved our food and the service. I have never written a Yelp review, but am taking the time now to express our complete satisfaction. We would both strongly recommend trying this restaurant, and definitely asking for Katie as your bartender! Like she said, she was glad we thought \"outside the bun\" today and we agree!"}
{"text":"This update is for the bar area. 
This place is a favorite of mine when I am in the area. Not for the quality or prices, but for the atmosphere and convienance.

The beer is always cold, the vodka martini is good but they gotcha by the cohonas for the bill over all. 

Today I went for the \"royal treatment\" and ordered the 17.00 wings dish.
Thankfully I can expense it, but it is pricey. But,    I will say the wings were just as I like them crispy hot and tender with a side of veggies and some fries.. check the picture. 

I like this place because its simply, it's comfortable and quiet at most times. (Talking about the bar itself) I am not looking to pickup or chat up anyone I am looking to sit at the bar watch TV and enjoy a bit of relaxation being stuck on the road without my sweetie.

This place makes me feel welcome and comfortable. I wish the prices were a bit better, but as I said the convienance and other factors make me always stay here to rather than drive to any of the numerous other joints in the area.

The staff are mostly long timers that are friendly and very proffesional. Just don't ever order the butter chicken"}
{"text":"The sandwiches here are just fine.  I was hoping for more.  They are not bad or great.  Price is a little higher than I would expect.  I will be giving it another try sometime."}
{"text":"Food was passable but waffle sandwiches didn't really work and fell apart. Service was surprisingly slow as they had as many workers as customers. Seemed disinterested in helping.  We asked for a milk shake (which took nearly five minutes to get someone's attention) and ended up just cancelling it ten minutes after we ordered as we had to catch a movie. They had just stared to make the milkshake. Wish it had gone better."}
{"text":"Wow! A slice of heaven waffle style! Ordered the s'mores waffle and split with hubby. After just a taste though I could have had the whole thing myself. Good thing he was there to take 1/2.
Tastes just like smores only on a waffle.
Order at the front and they bring it out to you.
I definitely want to go back for breakfast (served all day) so this won't be my only visit here."}
{"text":"Stopped in on our way out of Phoenix because we needed a quick breakfast.  We both ordered the chocolate covered bacon and peanut butter sandwich, it was delicious! I would have preferred the bacon a bit crispier, but the waffles were perfect. They have a ton of options, and they serve alcohol which is a plus. The only thing I wasn't impressed with was the decor. It was lacking in creativity."}
{"text":"I can't say I was put off by the idea of a burger on a waffle. I am all about the food texture/taste battle. I put salt, pepper and butter on pancakes. So the sweet/savory thing is right up my alley. If you haven't had the pleasure of eating here, I STRONGLY recommend you give them a try. Great serving sizes, wonderful staff, fun experience, and really great food. Even if the thought of a burger on a waffle is odd to you, try it. You just might like it."}
{"text":"Nice and spacious with excellent waffles. I thought it was a little bit pricey at first. I ordered \"The Meltdown\" and realized how wrong I was cause it was out of this world. Definitely coming back for more :D"}
{"text":"Not bad at all ...different  but tasty the full bar makes it even better its the incentive...very good service the server and bartender were extremly nice...will be back good prices"}
{"text":"I was disappointed.  The weather is amazing right now but they should close the bar from the outside to prevent all of the gnats from coming inside.  I had to put a coaster on top of my beer and a gnat still got in my glass"}
{"text":"This place is staffed by a bunch of teenagers and very disorganized. Waited almost 30 minutes for 2 sandwiches. The breakfast sandwich was underwhelming with plastic like eggs. The fries were decent."}
{"text":"I ordered the Southern Hospitality. I also received no hospitality. 

Food was damn tasty, but the service was atrocious. 4 people, didnt come during peak time. Had to find a manager to have someone come take our order after sitting there for 10 minutes without a peep from anyone. She came and took our order, then stumbled through the rest of the transaction. The food saved the visit, but it sounds like the way to go is to order takeout and go eat it in the Pavillion area nearby."}
{"text":"Their waffles are magical!  The waffle batter is so good both traditional and liege'; Liege if you have a sweet tooth.  My favorite dish is their Strawberry cheesecake waffle.  Something refreshing about it.  I've also had their poutine fries (god-like) and their hash browns.  The hash browns are different from what I'm use to which was to expect patties; theirs is like diced thick fries.  Still good in their special sauce, ketchup, ect.  

The waitresses were super nice and the chef was timely in getting food to us."}
{"text":"A pretty cool idea. We have been by a couple times and wanted to try it so we stopped in for lunch on the way to the splash pad. It was an amazing day outside so they had opened up the wall and windows.

We were greeted by a very cheerful and helpful young lady and she made some recommendations which we took. I had the egg, cheese and bacon. My wife had the southern steak. Both were very good. Wasn't sure what to think about waffles as a sub for bread in a sandwich but the waffles are pretty light and tasty. I think I would have liked the egg and sausage better but it's still pretty good. The combo comes w some awesome steak fries that are perfectly seasoned. Maybe my favorite fries anywhere. 

The place is clean, some good drink options w the cool soda machine and many types of brewed teas. They have a lot of nice big tv's that were quietly playing whatever sports were on. I'm curious if they would turn up the sound for a big game. 

I think the food was pretty good and worth 4 stars and the customer service was amazing. I would love to leave a extra half star. We'll just have to come back to try some of the other items on the menu."}
{"text":"When we first arrived there were three girls at the front counter tallying up receipts and not a single one of them looked up to greet us. I had called the Tuesday before Mother's Day to see if the made reservations, to which they said yes and took mine down. However, when I said I had a reservation the girl at the front (who couldn't be bothered to look up and say hello) rudely said she didn't know where it was, until another girl found it. When they did, they realized they didn't have a table big enough for us (after having just seated a table of four at a six person table that would have fit our five person party right next to a four person table that would have fit the other group... Logic), and rudely informed us they only had a table outside for immediate seating. I heard one make a passive-aggressive comment about \"this is why we don't take reservations,\" which pissed me off since that wasn't what I was told when I called on Tuesday. When we said that was fine they proceeded to seat us at a table with the sun glaring right in everyone's eyes, so we decided to sit at the bar instead (even though some of the group was under 21). The manager, who was also tending bar, was nice and comped some of our meal to make up for the inconvenience, which was nice. However, the rude girls working there continued to provide shit service. We were brought a dish meant for the table to share, and asked the girl who brought it for extra plates so we could share (as we were sitting at the bar all in a line) and she said she would then never came back with them. Ultimately I get that they were busy, but that doesn't excuse being rude. I will usually be far more understanding when a wait staff is stretched thin because they're busy when they're nice about it and still gracious. But these girls were just stupid and rude. No apologies for the failing on their part, and bitchy looks and passive-aggressive comments within earshot. If they didn't take reservations I would have been completely fine with that had they said it when I called, and I would have made a reservation elsewhere. I know better than to try and walk in somewhere on Mother's Day for brunch expecting to be seated immediately. But when I do my due diligence and make a reservation, I expect that to be honored. I appreciate the gesture of the manager who was tending bar, but unfortunately it doesn't make up for his incompetent and rude staff. Perhaps with some staffing changes this place would be a lot better."}
{"text":"I haven't been in a place where it took so long to make the food!  Our daughter placed her order a few minutes after us and it came out over a half hour after ours and when my wife asked about why everything was taking so long, the manager argued with her.  Eventually they brought her meal out with no refund or any kind compensation.  Won't be returning."}
{"text":"Quick to be seated at the bar, we were quickly greeted by the bartender. We received menus and I ordered a drink, which was made and delivered quickly. Pretty tasty bloody mary, but it was kinda basic. It would be cool if this place had some bar drinks that matched the theme of the restaurant by incorporating some of the waffle/breakfast side into the drink specials. 

We ordered the breakfast sandwiches, both in bacon and sausage. The order came in fairly quickly despite the small issues of working with a new system (the place opened on super bowl weekend). Waffles sandwiches were great, the waffles were fluffy, the eggs and sausage/bacon we're properly cooked.

The service we received was great, and the only gripe we could have is not being able to choose from the full menu due to the place being so new and busy for super bowl weekend. Will definitely return to see the full menu!"}
{"text":"Way too slow, way too salty and enough to get me to break my long streak of not leaving poor reviews. . 

One table when we arrived, people finishing up outside around 1930 on Thursday.  Food took a dog's age to arrive  approx 25 mins ( kids , love to wait, oh yes they do)  


My poutine was awful,easily worst in the valley, and about as salty as this review.

To be  beaten by Food trucks and several bars may not be a disgrace but there are better offerings at ice rink restaurants within the valley. Not saying anything else on the menu is awful but that was the main reason this restaurant was chosen. 

   I  left it mostly uneaten which didn't raise a comment.  Barely any gravy, curds that couldn't squeak if you tried , fries  limp as all hell, I.E.,  Just vile phoning it in crap.   when people don't ask why you buy things to just sit on the table it suggests it's a known issue.  

The kids fared better and really liked their waffle kid's meals which appeared reasonable value and came with a mountain of fries , insultingly bigger than the poutine for adults,but I digress. I didn't eat their food. 

I just can't forsee another outing based on our being in Westgate is event based and if takes this long on a quiet non-event night I'd hate to imagine the lead time before a game."}
{"text":"Can I say that the food was good. That was a a different take on traditional foods. It reminded me of a place in Vegas. If you go, try the Curd. They stayed open for us too. Customer service. Bam."}
{"text":"Poor management, our entire meal was cold and soggy. The place was packed but the manager was more concerned telling employees what to do rather than actually helping them. Took over 20 minutes for a grilled cheese to-go and it was served at room temperature. Very disappointed highly doubt I will return"}
{"text":"What a great place food is awesome staff is very sweet and attentive our server is on top of everything and management even checks in on you, we live here part time and this is our first time here and it's Mother's Day, we will be back many times to come"}
{"text":"Have stopped in to Crave on a few occasions, at first i didn't see the price being accurate. After talking and digging into this business I've found they make Majority of their items in house!! Not many places in the west valley can attest to this, and that aspect makes the price spot on. Exceptional homemade food. Further more, Jim always takes time when I'm in to be sure everything is accurate and up to par. I have nothing but positive review in regards of the service! Katie and Shaelyn always take care of me when I'm at the bar, and recently I've been growing accustom to Kaylie's inviting spirit around."}
{"text":"Always tasty and the fries are a breed apart. This is my go to brunch/lunch spot during the week. 

07/20/2017: this location is closed indefinitely. Sad to see them go."}
{"text":"As specific I can be about how I like my service, it still pains me to write a bad review but please hear me out when I say the service here SUCKS. I'm gonna keep this short and sweet: We walked into a HALF FULL restaurant, my girlfriend and I, and were seated between two parties. One party had been waiting far longer than they should for a check. The other party was waiting far too long for one order of onion rings. Whilst watching other couples and families just get up and leave, we waited a good 20-30 minutes for our drinks before we saw the bartender go back to the bar from the kitchen, only to proceed to restock and not make drinks.. it's Sunday at noon, how hard is it to bartend?? The waitresses continuously kept seating folks and taking orders but did nothing more. Didn't bring food or drinks, just took orders. We watched the kitchen and saw that only to-go boxes were being sent out, nothing for the folks actually in the restaurant. Definitely make this restaurant a stop if you're trying to anger your already-hungry significant other!"}
{"text":"This place might be good for lunch or dinner, but don't go here for breakfast.  The breakfast menu is very limited, although the prices were competitive.  However, the waffles, bacon, and sausage we ordered took an unusually long time to prepare.  The bacon was undercooked (not at all crispy like bacon usually is), and the waffles were too flaky to make a substantive meal.  I won't have breakfast here again and am unlikely to try lunch or dinner either."}
{"text":"Went by yesterday and very sad to see crave shut down. 




Had absolutely amazing service here the server made sure we were satisfied the whole time. Service took a bit before we ordered our appetizer but there were other people arriving so as someone who has served before I was fine with waiting until they were settled and greeted. We ordered some cheese fries though it wasn't on the menu the chef made his own cheese sauce rather than just throwing cheddar on top it was amazing. For the entree my friend got the meltdown basically a cheeseburger on a waffle, it came with the best seasoned fries and I got the classic chicken and waffles which comes with no side because it's huge. Great food and great service from kait, will definitely come back soon to try more things from the menu."}
{"text":"We went to Crave when it first opened and loved it. That was a few years ago. When we went tonight it was a lot different... First off - you use to be able to order from the front then pick your table to sit at. Now you have to have them seat you and tip a waiter or waitress. The waffles use to be soft - the sandwiches were really good! Tonight we were sadly disappointed- the waffles were crispy and didn't taste good at all. To top it off, there was a small rock my husband bit into in the loaded fries. The waitress took off the cost of the fries from our receipt, but still! Just glad he didn't break his tooth! Not going to be eating here again."}
{"text":"I'm giving this restaurant three stars because I thought the food was actually very good. I preferred the sweet waffles to the savory, even with the sandwich fillings. They were light and delicious. Mine had crispy chicken and a really awesome spicy maple syrup. 
The service was a big problem. It was a Saturday night and Westgate was packed; we'd been given up to a two hour wait at some of the other restaurants already and were surprised to see this one only about half full. I thought maybe they were short handed because the poor hostess was single handedly trying to seat customers, bartend, take orders, serve food and apologize to groups who were complaining. I watched her give a free round of drinks to more than one table. I didn't see any other bartender the whole night, and watched several people come in and sit down at the bar then leave after being ignored for more than 20 minutes. We decided against ordering drinks. I tried to get my own water but couldn't find any cups, so I flagged down a bus boy, who must've gotten the waitress' attention finally. I didn't realize she was the waitress because she hadn't moved from the kitchen doorway in the 45 minutes since we'd come in, apparently chatting with one of the cooks. She brought our water without a word and then turned to walk away without even asking if we were ready to order, back to chat at the doorway. We had to call her back. There was one other cook who did appear to be working, just very slowly. It was another hour at least before we had our food. The table next to ours had six people and their plates were served one at a time, with 10 - 15 minutes in between each one. 
This place could be really good and do an awesome business if they could get their act together."}
{"text":"Asked if the pulled pork was spicy... (I don't do ANY spice with heat)  the waitress said no there is no spicy in it.  I said I don't want ANY spicy.  It comes and is spicy.  When told it was spicy I was told \"that's the coleslaw in top\"...really?  Lemon curd is delicious. Nice concept but will not be back. My waffles using krusty's are much better. and the bacon was yucky"}
{"text":"Incredible!! My husband and I ordered one savory & one sweet to share. I believe the savory sandwich was the Southern BBQ? We also had the strawberry cheesecake waffle. Yum, yum, yum! We will definitely be back! Go visit! It's delicious"}
{"text":"Gabe is a great bartender & management was fantastic, food was on point! We will definitely be back! Thanks crave :)"}
{"text":"Awful. Slow. Won't come back. Tomato was not ripe and lettuce was wilted. Bacon taste like it was microwaved three days ago. This place blows."}
{"text":"I got the chicken and waffle sandwich. The sandwich was slamming and delicious. I would of gave this place a five if it wasn't for the inside and the service. The service was meh and the inside needed to be cleaner and get the flies away from the inside. Maybe I caught it on a slow day. But like I stated before the sandwich was good."}
{"text":"I didn't like it much, the service was excellent and they were very friendly. But the food was not good, the hamburger was not beef.... No way...  I wish they would tell you the fries are spiced up with a sweet spice... I thought that for the food we got I paid way to much,I paid $60. For 3 people...."}
{"text":"I have here for breakfast every time I am staying at this hotel - as breakfast is part of the room rate.  The servers and staff are all friendly, helpful, and prompt.  They do get busy (note: the peak hours are 7-8am when almost all the tables are taken).  The cook for the omelette station is very polite and pretty prompt and accurate with all the orders.  The only odd thing is the breakfast food stations (including the omelette chef) are in a tiny enclosed room.   When the restaurant is busy, it can get uncomfortable with everyone trying to navigate to the food without blocking or touching each other.  I try to leave C$3-5 tip each time but I notice some people don't tip thinking the service gratuity is free!"}
{"text":"Under new management so I'll give them another shot. The food is great but in the past the management left a lot to be desired. Strawberry Cheesecake Waffle is my personal favorite."}
{"text":"Worst place I've eating in a long time! Wasn't impressed with the food at all!  Gnats flying around all of us all the time we ate. Our server dropped off our food never came back even after we were finished eating. Place is empty and another server asked us if we were done and she would get our server! NEVER coming back big disappointment!"}
{"text":"The staff was very pleasant but the manager didn't seem to want to be there. Ordered two different types of waffle sandwiches and they both came out cold as ice. The staff was pleasant enough to provide two additional ones for free, but  those came out cold as well. We tried the desert ones and they were cold so I'm just assuming that the waffles come cold? it was a very unique concept but something that I don't think it's going to last. The hours are confusing as it says it's open till midnight on yelp and I even called them to confirm what time they close and they said midnight, and then when we were leaving they were shutting down and it was 10 PM. I guess this place is only open till midnight on the weekends; confusing for a customer."}
{"text":"This place was horrible. The food was cold and took forever to get service. I'll not go back."}
{"text":"Extremely poor customer service, rude wait staff and manager.  An hour of our time was completely wasted.  Apparently they forgot our order and no update was ever given even after repeatedly speaking to it waitress and speaking to the manager.  Waitress literally said \"I have no idea\" when we asked what was going on with our order.  Completely unapologetic when we told them we were leaving, very disappointing experience to leave a restaurant hungry."}
{"text":"When we first arrived to this place, we were excited to try something new, as it's only been open for a few days. Looks like Super Bowl took over the whole place. That's understandable. They were completely out of 3/4 of the menu or more. 

We decided to each order the bacon, eggs, and cheddar waffle sandwich. We had waited awhile for the water to come out even though there were only a few people. Hmm. Then the waffle sandwiches finally came out. I took a picture of it and we both realized that the cheese was missing. And in addition, no utensils. Hmm. At first I thought maybe it was mixed and melted within the scrambled eggs. Nope. My friend confirmed that our same 2 sandwiches had no cheese. So we had to ask for the cheese. We got it back in a few seconds. Hmmm. There it was. A slice of cheese torn in half for each half of the waffle sandwich. Not even melted. Same with the other sandwich. Hmmm. It's not difficult to put 3 ingredients into a sandwich. And to forget the cheese on 2 of the same exact order. Hmmm.

I don't about this. It was basically chopped up bits of bacon and scrambled eggs thrown into a waffle. It looked like the total amount of ingredients were split in half amongst the 2 sandwiches. We were pretty disappointed. No creativity. We ate it all because we were hungry. 

Not worth my $8 per sandwich plus pre tip = $10. I'm not a fan of pre tipping something that I didn't know was going to be a disappointment. 

For these reasons I had to rate this place pretty low."}
{"text":"We got the poutine fries. They were so good, we got a 2nd order. We also had the backyard BBQ, the southern hospitality, and the crave club. All were very good. 

Service was just ok. I wanted to order a mimosa, but noticed they were $12. When I asked if they were bottomless, the bartender looked at me like I was crazy and said, \"No. That's for one.\" Since their glasses also looked pretty small, we chose to pass. In addition, we were going to order dessert and another round of cocktails, but our server dropped our check without ever asking if we needed anything else. That's too bad, because we were a party of four and would have increased our check amount by another $50 minimum. 

Four stars if not for the price of the mimosas and the so-so service."}
{"text":"This place is pretty cool! First of all its a waffle themed restaurant with a bar and they serve breakfast all day. I ordered breakfast which was good and my fried ordered the loaded frys which were also really good. The cashier really seemed to know her information about the restaurant and waffles and what was good and what wasn't.  It was a fun time and the food was good.  I would go back."}
{"text":"This is a great place to check out.  I had the All American and it was so delicious!  We also had fully loaded fries and they were also great.  The service is pretty slow, we waited about 30 minutes for our food and there was nobody else there when we got there."}
{"text":"Came in on a Saturday night with my family of 5. Waited almost an hour for our food but decided to  cancel our order before it came."}
{"text":"First thing you need to know is the cafeteria format.  You order and sit with a number.  All orders are served in cardboard baskets with plastic flatware.  That said, the chicken and waffles was delicious.  There is a little kick in the batter on the chicken and onion rings, but not too bad.  My hubby's chicken salad was not a hit with him because it was smothered in fried onion rings.  Service was quick.  Good place for something different."}
{"text":"Pleasantly surprised! Fresh ingredients & good sauces. Fresh cut turkey and a good sized burger. The waffles seemed weird when ordering but definitely worth it! Might come just for dessert next time. This place is a must try at least once! Yum!"}
{"text":"First time to be here. I tried the Southwestern Hospitality (Waffle with Fried breaded chicken) very tasty with hints of cajun spices. The waffle is soft. I also tried Nom Nom Nutella, soo good! Enough Nutella & Banana, sliced crisp almond; the waffle on this is crispier, like it!! Get to see the owner, Jim. The waitress is very nice too. They sell cocktails too. Free sparking water."}
{"text":"I order waffle with fruit topping. 

Server was good and on point, the service was was good.

They fell down on the food. The waffle were serve cold to the table. the better place for waffle is the one the comes with chicken I won't  be back."}
{"text":"Great food! Awesome atmosphere and great people... Bartender is cute too!! Had the Asada Fries very yummy steak was tender and guacamole tasty!  Waffles are good, BLT  sandwich was good. My little girl had the breakfast sandwich with bacon, egg and cheese! Added a little syrup too it and loved it."}
{"text":"We have been twice. We had the poutine sp? fries which were great. The gravy is French onion soup tasting which is fine with me. I had the classic chicken and waffle sandwich. The waffle was great but the chicken didn't wow me, I prefer Lolo's. The second time I had the waffle, egg, cheese and bacon sandwich. Again the waffle was great. The bacon was very good but the eggs were over cooked and dry. There was no cheese. We had the poutine fries again which seem to be a bit addictive. 
I wish they would have paper menus so you could sit and decide what to have. We tried finding their menu online but could not. The very sweet waitress also could not find it so she took my phone and took 2 pictures of the wall menu. I thought that was very smart of her and I appreciated it. 
Parking is a nightmare when an event is at the stadium. We will check schedules before doing that again."}
{"text":"I really enjoy this place, only complaint is that they don't make the dough for the Liège waffles everyday. I really plain Liège waffles with the crystal sugar mixed throughout as well as sprinkled on top. This place does have a HUGE amount of waffles to choose from and you can have everything from sweet to savory. Yes you can have lunch or dinner here and it should taste pretty darn good."}
{"text":"My husband and I were looking forward to visiting Crave for weeks.  We weren't entirely impressed. 

Waffle sandwiches are an amazing idea, and the offerings all look tempting - and then your sandwich (wafflewich?) shows up with room temperature meat and slightly undercooked and cold waffles.  Did you hear that???  It was my dreams shattering.

Food was delivered in shifts, waffles and then fries, but at least the fries were warm.
Oh but the beer was cold...and being attacked by fruit flies.  Yum!  We were told by one of the bartenders that she makes sure people put an extra coaster on top of their beer when they aren't drinking because of this.

I know this place is pretty new and still working out some kinks, but wow.  I'm not sure that I'll be back."}
{"text":"I had tickets to a Coyotes game and decided to eat in the Westgate area. Found Crave Waffle Sandwich Creations here on Yelp and thought it sounded great. I was pleasantly surprised and will revisit this restaurant for future games and events in Westgate. I opted for the Southern Hospitality which is their take on chicken and waffles. The sandwich is four waffles folded into two sandwiches with fried chicken and coleslaw. I personally would have like the chicken portion to be larger but it had a nice crispy outside with good flavor. Waffles were thin and cooked nicely not being either soggy or crispy and though not a fan of slaw this all worked well together.
My friend and I also split a dessert waffle with peanut butter, chocolate, bacon, and whipped cream. This was quite delicious! Personally speaking, creamy peanut butter instead of crunchy, a chocolate sauce instead of Nutella and forgo the whipped cream and this would be heaven on a plate. 
As Arnold is famously quoted for, \"I'll be back\"."}
{"text":"First time and the last time I will have a waffle with anything but a waffle. Game day service was just ok. I would come back for a $5 beer and that's it."}
{"text":"This is one place that I have wanted to try for a while, and we finally went. At first, you see the portion sizes, and think they are too small for the price, but after you finish, you are really full because the waffle expands in your stomach, so the portion size is great. Make sure you get the carne Asada fries, wrap it up with a pb&j waffle! Delicious. I had the Carolina and husband had the club. Son had the BLT. Bacon is crispy and perfect. They also have a full bar. This place is great."}
{"text":"I was just here today as part of a party of six. Food was average but inconsistent. I had chicken and waffles with 2 nice sized waffles and 2 large pieces of chicken. The other waffles at the table were small; one was no bigger than a freezer waffle for a hungry guy so that was disappointing. The other was irregular and looked like a crepe. I had read the reviews and knew service would be slow and it certainly was. The hostess took our drink order, brought us our food, and checked on us because our server was busy. The place was empty; 5 tables max. But I suppose that's what happens for Sunday brunch with only 2 servers and 1 bartender. Now the bar: we had several bar drinks which were okay at best. The spicy jalapeno margarita was good but $2 up charge for \"muddled\" jalapenos and $5 up charge on the basic bloody Mary which had a soggy piece of bacon in it AND we didn't get the refill on until after our meal was finished  (we ordered it when food arrived). Needless to say, not in a hurry to come back and may not ever, but the redemption was the nice hostess and the fact they had a table ready with our reservation."}
{"text":"I can't believe it took us 4 months to come back!!! Hurry bring my Southern Hospitality!!! So so so good!"}
{"text":"Staff was very friendly and helpful. Food was delicious and a good portion size for the price. Will definitely be trying some of their other options."}
{"text":"Super Underwhelming!!! Food was so lackluster in taste. I ordered Sweet Caroline and it was missing the bbq sauce when they sent it out. My fries were under cooked. My friend ordered the chicken and waffles. His chicken was super over cooked. Dark and dry! What cook and what server actually thinks that is ok to bring to the table. We told the waitress and she got us another one of both. Even though I got my fries fresh the flavor still was not there. Tasted like it was frozen and the frost got to it. My friend said the chicken was not bad. Also, there was literally a terminex man in there spraying corners and putting down mouse traps. The menu is ultra small and the food is just not good. Whoever the cook was that day was horrible!"}
{"text":"over priced, awful tasting french fries with their jellied brown gravy with non melted cheese what they consider a \"poutine\". The only reasonably good thing I enjoyed was the strawberry cheesecake waffle, but I was amazed how small their menu is. They mention they have burgers, okay only one was listed on the menu. Ha! What a joke? I'd not come back nor would I'd suggest it."}
{"text":"A friend and I went there a week ago. The loaded fries took a little longer than expected to get made, but were worth it! They have great specials and awesome service! I'll be back. :)"}
{"text":"I went here yesterday and I started off excited. The young lady at the register was super friendly and gave us suggestions. I ordered the Southern Hospitality and my boyfriend ordered the bbq fried chicken one. His was good but seriously lacked meat and lettuce. Mine was delicious for the most part but I could only eat a portion of it. the coleslaw they put on it is so good but super watery so the lower layer of waffle was soggy and inedible.  I wish they had the foresight to put the slaw on the side so it could be added while eating. It was like paying 9 dollars for half a sandwich. if I do come back I'll order something different I guess."}
{"text":"The meats are pretty good but the sauces are not. The Californian's sauce is like onion dip. Sandwiches are small. Tasty fries, though."}
{"text":"This place is so good! No matter what you order it's delicious! I had the waffles with fruit to keep it original and also the Huevos Rancheros, southern Style waffle sandwich and Carne Asada fries dessert was a waffle sandwich with banana, Nutella & powdered sugar. The Huevos Rancheros were perfectly cooked with cheese, onions, green chiles, cilantro in a waffle perfect! The southern style is the classic fried chicken and waffles combination in a sandwich form. The others are self explanatory. None of the options I've eat have ever disappointed me. You have to try it at least once! They have sweet & savory options I'm sure you will find something you love!"}
{"text":"This place has the worst customer service.  My first and only time there experience sucked and will never go back.  There was only a hand full of people there at the time when i had ordered 1 simple appetizer sitting at the bar oh and by the way flies in my beer, with in 20 min afterward  5 families walked in and ordered, they got their food and I am still waiting for my order finally after 30 min and went to the manager angry and told him that this place will not last with the customer service they have, this guy had the nerve to put his hands on me to calm me down. Then I had the bar tender close my tab and she had to through in an excuse that they were busy instead of making my situation better. I don't recommend this place you will be disappointed."}
{"text":"Was excited to try this place even after reading some of the reviews. The staff was friendly enough but a bit slow to take the order. After careful selection of the limited menu we ordered the southern hospitality, a strawberry cheesecake, poutine, amd two small drinks, $27? Wow. The gnats were complimentary though, yuck. They are everywhere, my ears, my mouth, and our food. I must say that the cheesecake and my waffle were delicious. The chicken in the southern hospitality was good but the flavor of the slaw was not to my liking, thats simply my opinion though. As for the poutine, we trashed them after a few bites. Soggy fries, gelatinous gravy and cold curd. Want some good poutine? May I suggest The Rose and Crown pub. If you're looking to try this place I'd  say to probably stick to the waffles in the breakfast portion of the menu, not that you have much other choices. Really? How is \"sorry, but we just recently opened\" an excuse for not offering half of your menu?"}
{"text":"Is there a no star option?? The wait staff suck. They are slow and unatetive. Couldn't even get a water refilled and had to seat our selves. 10 employee just standing..dancing around and taking selfies ... An food sucks . Not much food for expensive prices. A waffle place with gross waffles yuck!!"}
{"text":"I was a little unsure about going here because I am a very picky eater. But the concept intrigued me. It was a nice and small place, not too loud. When I was looking through the menu I was having a hard time finding anything that I would like. But luckily I saw that they had chicken strips and ordered that. The waitress was very polite and checked in with us regularly. The food didn't take very long to get to us and was delicious! I was surprised by how big the chicken strips were. Overall it was a good experience. The only reason I'm giving it 3 stars is because there wasn't very much variety in the menu selection."}
{"text":"Worst customer service... I can't rate the food because we never got seated... First I was told it would take 15 minutes to get seated because they were short on waiters and the kitchen was backed up.. When we returned 15 minutes later we were told that it would be another 30 minutes..worst part is that it seemed like they did not care for our business."}
{"text":"Food is great, although not a huge selection. For waffles, I was pretty happy they were not overly starchy and thick/dense. I also had a cocktail drink, which the bartender made very well. I would go again for sure , and even w the kids."}
{"text":"Wow worst service I've had in a long time. I would give it a zero but You can't. Our waitress sucked. Service was horrible. I asked for an ice tea without lemon and it came with lemon. Wife asked for a Diet Coke. She got regular Coke. We asked the waitress after she walked by several times and didn't acknowledge us for a Diet Coke. She said ok. Then walked by us 3 more times without a new beverage. My wife finally got up and walked over to the waitress station, dumped out her drink and got her own Diet Coke. She walked by the waitress and told her she took care of it to a very non caring \"sorry\". The part that really pissed me off was the manager (I think she was)because she walked up to the table next to us and asked how everything was, then she passed us and went to the table on the other side of us and asked if everything was ok. I was like uhhhh what the hell. I guess Were chop liver. Plain and simple the service here sucks! This actually happened three times to us. I saw and heard several customers complain to the same server we had and she just gave out the same \"sorry\". Too bad Crave you missed the boat when you hired such non caring people to represent your business and I can guarantee you I will not be back. I watched many customers food die in the window. Watching this place run was almost comical as these people are clearly lost and have no idea how to run a restaurant. My wife and I actually contemplated leaving but we had already sat here for 30 min.  Finally the hostess not our waitress came over and apologized for such a long wait and that our food was almost ready. After waiting another 10 min we got up and went to pay for our drinks and left. They didn't make us pay and said sorry again. My question is how long does it take to Make a damn waffle and eggs? When we got there it was even busy. Oh and while waiting we realized this place adds an automatic 18% gratuity. Uh no. I'm not going to be forced to tip someone for such horrible service. Could be a reason why the service sucks. They get tipped regardless. Peace out Crave you lost a family of customers."}
{"text":"Granted the place had only been open less than a week. It's not a bad place for a waffle sandwich the staff is friendly and informative. Crave waffle sandwich are the same owners of razzle berry yogurt which is  around the corner inside the west gate mall. I ordered the BLTA I enjoyed the food and ate outside the patio, I wish there was more avocado though. It was still very good it was not greasy and wasn't shy about the bacon at all.( everyone loves bacon) will definitely come back before I leave AZ. I think this place we do good once everything is up and running."}
{"text":"My review was placed in the hidden \"other\" file.  I was honest, truthful and painted the exact transaction of my visit to CRAVE.  The food was not good and the service needs repair.  The young lady at the front desk was very nice and the manager was accommodating to giving us a refund for our food.  As I read the 5 stars it is obvious they are \"fake\" and probably friends of the owners or wait staff.   Nothing was prompt and the fruit flies were very annoying.  Now they can hide this review.  If you want to see my original review go to the other list  thank you."}
{"text":"Interesting concept.  The menu is mostly sandwiches but utilizing waffles instead of bread. 

We had the All/American cheeseburger, carne asada fries. 

I was pleasantly surprised. The waffle was cooked perfectly and the burger was quite flavorful. Good spices on the burger patty.  Fresh veggies as well which is nice.  

The carne asada fries were pieces of steak, pico de gallo, and cheese on crispy fries. Very tasty as well. 

Wait staff was outstanding and very attentive. 

Next time I'm in the area I will try this place again to sample some of the other menu items."}
{"text":"Tried this place for the first time today. Really liked it. Played it safe with the BLT sandwich and fries. Like the waffle concept, clever and quite tasty too. Sandwich was awesome and I love that they carry Pepsi products instead of Coke. Service was friendly but I can say food came out of the kitchen pretty slow considering they were not super busy when we arrived. That needs to be looked at by management."}
{"text":"Slightly above average food but my server was amazing. I'd come back just to have such courteous, thoughtful service again."}
{"text":"I was so excited to try this place, but it was a total disappointment. While the idea is fresh and new, there were a few problems with the food. We will start with the \"some like it hot,\" not terrible tasting, but the waffle was so light it didn't stay together. The ingredients were WAY too much for the light waffle, so it's a mess after the first bite. I had the bbq chicken one and while the chicken was cooked well, I was surprised it was so cold considering we were the ONLY customers the restaurant. We also ordered the loaded fries, which also were cold and unimpressive.

The waitress was really nice, but she was eating a salad at the bar while waiting on us, which is inappropriate to be doing during your shift, in front of customers. The waffle alone was very light and fluffy, but tasteless and definitely should NOT be used as a bun replacement. You are better off eating in a different restaurant in the area, this place isn't worth trying for dinner. I didn't try the dessert/sweet stuff."}
{"text":"Yum yum yum. It's rare to find a place that the kids like and that you can have an excellent Bloody Mary. This is the place. Great food, good service, friendly vibe. Good for any meal of the day. Really busy if there is an event going in at the arena, but worth the wait."}
{"text":"I've been here over 10 times, whoever the bartender, Shae, Brittany, or Katie, they have an attention to detail and really take care of you.  If you bring in your AMC ticket you get 20% discount on your tab! Great waffle sandwiches which ever one you go with."}
{"text":"Gabriel our bartender is awesome..food always amazing..we always stop by when we are close.  Southern Hospitality and the Sweet Caroline ate great@! Amazing fresh waffles and chicken!@"}
{"text":"Not bad but not great. I enjoyed my meal but my husband didn't like anything he ordered. I liked that there are a lot of options on the menu for both dinner and dessert. You could order something new every time. The prices are low enough that you can get two items. The seasoned fries are really great. The service was also great. I liked the unique atmosphere that was modern and half inside, half outside. There just wasn't anything WOW about the food."}
{"text":"Wow, the lack of service and professionalism at this place is astounding. I could tell you the whole story but the important things you need to know is the food is mediocre at best, the service is terrible, account for 40 min to get your food (yes, for a sandwich), and know this is epitome of inefficiency. Also, there is a a lack of leadership and accountability. I get better service at Chipotle. Spare your time, not worth it. Being busy because there is a concert is not an excuse because there are events here all the time. By the way, thanks for making me late for my concert!"}
{"text":"Decent food. Horrible service.

Was out in Arizona with some friends and family and stumbled upon this place. We had a decent size party and this was one of the few places that was not really packed on a Saturday night so we decided to give it a shot. 

Was seated fairly quickly and got our orders in quick as well. So far so good. However, that's when things went bad. It took 15 minutes just to get waters. When they finally brought our waters, that's when they tell us that they can't make the two milkshakes we ordered because their machine broke. 

Food finally comes out and it's ok. I ordered the Southern Hospitality. The chicken in it was tasty but everything just got soggy way to fast with the sauces they had in it. However, we did not see the server ever again for the entire dinner service for drink refills or anything. Let me remind you, it was not a busy night at all. 

When it finally came time to pay, the checks were a nightmare. Peoples orders were on wrong checks and it was impossible to get a server to ask about it. 

TL;DR: I have NEVER not given tip. Tonight was my first. Food was decent, service was horrible. Maybe it was an off night for them, but I'm never going to go again."}
{"text":"This place is amazing!!  Everything is cooked fresh and completely from scratch. No frozen or processed foods here!  The staff is great, fast, friendly service and always checking in on you to make sure your needs are met. Jim the GM spent time talking to us and even appreciated our sandwich suggestion. 

The food is fantastic. The waffles are the perfect combination of tender and crisp. The Sweet Caroline was to die for. You have to try it!!  The BLT hit the spot of savory and fresh. 

We will be returning again and again to see the special sandwiches, such as Corned Beef for St. Patrick's Day as well as the regular menu. It would be a great spot for dessert."}
{"text":"The food was okay. I ordered a club and it took FOREVER to come out. When the food arrived it was absolutely cold. I thought because a club has cold turkey bit cooled off the waffle \"bun\". My girlfriend's hot waffle sandwich was cold too! The sandwich would have been really good on normal bread, but the waffle with syrup was nasty and rather gimmicky. If you're in a hurry, keep walking."}
{"text":"Holy delicious! I got the southern comfort and the cheese cake sweet one. It was so much food. Of course it was so delicious I made quick work of it. I will sooooo be back. Not the best for reheating, but honestly not much made it home anyways. I'm still dreaming about it."}
{"text":"Me and my husband passed by Crave while leaving another restaurant and stopped by to check out their menu. Because we missed the past happy hour at our other spot we decided to sit down and grab a glass of wine (since it's half off on Thursday). Waffles were sooo good and the staff was very accommodating and nice. Overall we had a great experience here and will definitely be back for their breakfast option with their $12 bottomless mimosas Friday through Sunday!!!!"}
{"text":"We were in Westgate for dinner and saw this place while waiting for a table somewhere else.  We decided to come back for dessert.   Very, very glad we did.

All four dessert waffles were the perfect combination of crunchy and chewy.  Service was great and the owner stopped by to make sure we were happy. 

I hope this place does well.

I will be back for dinner and it looks like I won't have to wait for a table."}
{"text":"Holy amazing!!!! It is a must to check out. Went in as a lover of waffles. I'm so very impressed with how well made there food is. Everything is well made and the staff and owner is crazy friendly!!  Such s fun place!"}
