{"text":"While, my wife and I had enjoyed our previous visits, when we were in the area.  The business appears to have closed.  A hand written sign on the door basically says Sorry we have closed.  It was the only North America location that I am aware of.  Guess the next time were down under we will try them again."}
{"text":"Maybe I'm the exception, but I had a good experience here!  My friend and I decided to come here for brunch one morning and to dine in.  The wait for our crepes did take a little bit of time, but bear in mind - they're making these crepe's from scratch on the spot, and they're really really yummy!  We split a sweet crepe (banana-peanut butter-nutella ) and a savory one (tomato-pesto-basil).  Both were really really good.  They're also filling!  We were too full to try any of their gelato or specialty drinks, but everything on their menu looked so good that I know I'll be back to try their other items!  The waitstaff was nice and helpful as well, and inside it was all sunny and happy feeling (yay for lots of windows, bright decor, and white, minimalistic furniture).  You could call ahead and take out, or if you have some extra time for some good food and a relaxing meal, then try out Crepe Cafe."}
{"text":"My first tip-off should have been that my menu had a large chunk of food on it. My second tip-off should have been that my water glass had food on it, too. My third tip-off should have been that the people two tables away from us finally had to go up to the register to pay, and then before ordering food, that the coffee was absolute crap. Yet, my fiance and I were in it for the long haul (little did we know how long). After about 20 minutes the server took our order. It didn't take so long to receive the food, but that's probably because there was a lot of crepe and few ingredients (although I must admit that my fiance's Norwegian was better than my Parisian which still had lukewarm, not entirely melted cheese). After asking for a refill on water, our server came by the six table space three times without coming back to our table. How does one catch the attention of a server who avoids eye contact with her customers as much as possible? When it was time to get the bill, the table next to us just shouted to get theirs, so we resorted to doing the same. When we finally got our bill and attempted to pay, their credit card machine was being rebooted. After about 10 minutes, my fiance walked up to the register to find out the credit card machine wasn't working, period, and he had to walk to the ATM down the street. Okay, so it's not their fault that the credit card machine died, but the nonchalant demeanor of this server was incredible. To make up for the credit card issue, they gave us a scoop of mocha gelato, which had the flavor of graham crackers and chocolate chips (they charge $60 for a tub of this stuff, by the way). So yeah, we could've left before it all fell apart, but we were super hungry and we wanted to be open minded. It was a purgatory of mediocrity."}
{"text":"Crepe Cafe was formerly known as Tout Sweet. Apparently, it used to be owned by the owners of Cafe Luna and The Bread Company but not anymore. The place is very small and only has about 6 tables. They have both sweet and savory crepes but I would recommend the smoked salmon crepe. I had that for lunch and it was very delicious. The only drawback is their service; it was VERY slow. If they only have 6/7 tables, I don't understand why it took me at least 15 minutes to get my food. So, if you're in a hurry, think twice before going there."}
