{"text":"Those delicious fluffy buttery croissants are a must try. Definitely check this place out if you are in the area."}
{"text":"The croissant and the coffee from this place are great! They are the best croissants that I've had outside of Paris. The other pastries are delicious as well. Nothing is overly sweet and they have a great texture. The service is great as well. I've had something for breakfast from this place everyday because it's so good."}
{"text":"Great little bakery nestled in Le Plateau Mont-Royal. The service is great and the baked goods are delicious.  The space is quaint and cosy. They have delicious hot chocolate that warms you up during those cold winters.  My partner and I couldn't get enough of their chocolatine (chocolate and almond croissant). The croissants have to be the freshest, butteriest, and flakiest that I have tried in awhile.  I would definitely go back my next trip to Montreal."}
{"text":"Les meilleures viennoiseries à Montréal et de loin! Parmi les Best of: croissant bien sûr, le croissant au fromage suisse, les sandwichs à base de pâte à croissant...un pur bonheur!!! Un super bon barista aussi pour vous préparer de super cafés en tout genre!"}
{"text":"We love this place! The staff are kind and the croissants, etc are excellent. A nice spot to bring kids to pick up a bite. The service is fast and the location is right by Park Baldwin. The baking area is surrounded by windows which is fun to observe with kids. And this bakery shake things up a bit here and there, experimenting with flavors (I.e. pain au chocolat avec fruit de la passion, walnut/blue cheese croissant)."}
{"text":"Excellent and beautiful Latte. Good croissants and nice quiche. Everyone was very friendly. They brought the food to your table on a nice tray. Overall it was a very good experience and I would go back."}
{"text":"Quelle belle découverte! Du goût, du goût, encore du goût! Bien que c'est une petite place avec peu de chaises pour s'assoira , quel merveilleux café pour prendre une quiche, un croissant, un café au lait et surtout des chocolats chauds! Chocolat chaud à la menthe a été le préféré de mon amie, pour moi ce fut le chocolat chaud au quatre épices! Quel délice!"}
{"text":"Boulangerie découverte aujourd'hui même sur l'avenue du Mont-Royal sur les conseils d'une amie.  Le croissant est un pur délice tout comme le croissant aux amandes. Le personnel est souriant et très accueillant. Des places sont disponibles pour manger sur place ce qui est un gros plus.  À essayer de toute urgence !!!"}
{"text":"Tucked away on the upper east-end of Mont Royal, this cosy little café has very little seating and minimal décor but overall, this little shop is amazing!   Besides coffee, the cafe sell sandwiches, quiches, and salads, as well as a variety of baked goods including, like the name implies, croissants. On my last visit, I purchased a tall latte and croissant for a total of 5.50$, which is wayyy inexpensive compared to other spots on swanky Plateau! The coffee was perfection; flavorful and rich, and I really enjoyed the little heart as coffee art ;)  After last night's carb fiasco, I donated my croissant to a coworker, who described the croissant as flaky and buttery good (I only bought it cause you need a minimal 5$ for debit).   Service was very friendly and I love the fidelity card program to boot! I think I found my got-to coffee shop near work, yeah!"}
{"text":"A cafe dedicated to all things croissant?  Where can I get in on this action?!  I love this delectable French pastry so naturally a place called 'Croissant Croissant' will catch my attention and pique my interest.  This particular café is located pretty far east on Mont Royal so it is a little bit outside the main Plateau area but it is worth the visit.  There isn't much in terms of seating so you might be wise to take your order to go.    On my first visit I was there later in the day so there wasn't much left except for some vegan options and the traditional butter croissant.  It was so flaky and buttery but I wanted to come back and see what their other offerings were like so I made a point of going early one Saturday morning.  This time I was rewarded with an abundance of choice and decided on a raspberry type of croissant, which had been baked to perfection.  The pastry was flaky and crispy on the outside, while being soft and buttery on the inside.  It also had a raspberry puree filling which was refreshing.  The prices are fair for the neighbourhood and this shop as a whole is a fantastic spot to come on a weekend morning."}
{"text":"The smell says it all even before you walk in. Deliciously crispy butter croissants in all variations. You can not only smell but also see that they're freshly baked since the bakery in the back has large glass windows and you can watch the bakers in action. If you want to sit in, don't expect majorly comfortable seating. It's set out to be a take-away cafe/bakery that also has four square tables and a few high seats by the window and in the back. Feel free to bring your laptop and do some work whilst sipping a cup of Kusmi tea though."}
{"text":"I always go just for the regular croissants because they are just perfect, and I don't have the world's biggest sweettooth. The croissants have the perfect balance between crunch and fluffy insides. They always have a nice selection of other pastries to try, and they have some savory options including sandwiches on house-made bread. Pretty cute, glad they're in the area. The only negative thing I have to say is that their coffee/espresso is not so great and fairly acrid, a shame because a great espresso would complete the perfect simplicity that this place has with its croissants. BUT the baked goods make up for it."}
{"text":"Most beautiful croissants and assortments I've ever seen. The space is also very cool. The latte was pretty good. I'd return"}
