{"text":"Came here just to enjoy drinks. Located right next door to crop stix. I really love the venue! Old music records lining the walls and a DJ booth in the corner playing great 80's music! Fun place to hang out with friends."}
{"text":"I was excited to go to this place. Walked in and we were sat at benches made of wood. I don't know about you, but I do not want to sit on wood.  Especially picnic table style. The fries with gravy on them were incredible! I would get them again easily. I got the Mexican style dish. I think it's the only one on the menu. I tried to get the name but there website is not mobile friendly. So I could not get the name but it was extremely bland. Very disappointing. I do not believe I will be back. I might go for lunch for the fries but certainly not dinner."}
{"text":"Time travel!!!!  I have been to Crop Rocks a few times now and it is just plain cool!. All of the vinyl and the DJ booth look like something out of 1969. VW bus outside that you can wait it. Tons of memorabilia, some local, some signed, vintage Jukebox,  the list goes on!   What I love most about this place is it feels like a normal, locals place.  All of the new Flats I have been to seem over built and trendy but this place feels like it could have been in the old flats, which is pretty fucking awesome!  The food is the same way, its just really well done comfort, bar food. I have had the \"We built this City Chicken\" which is a poutine style dish with pork skewers and is perfect drinking food! the Buffalo Springfield sandwich is also simple and delicious. Friends have gotten the Ribs and Meatloaf and  were very pleased. As for the drinks, the Beer list blew me away, they had Bodhi and Hop Juju on tap my first visit!  Second visit was for Dank Hop Fest on 420 and they had an insane list."}
{"text":"Had our first visit to Crop Rocks this week on the reviving East Bank. The location is great, with a nice view of the water and the West Bank. went with my wife and my visiting mother. We were seated right away as there were still a few tables open on the patio on a Wednesday evening around 7:15. Our server Adrianna (sp?) was great; very attentive and made a couple of good recommendations. We started with the Shrapnel Fries, which is basically fries with lots of toppings. I wanted to try a new Cleveland beer, but they only had Brew Kettle and Great Lakes, which by this time I am sick of both. However, I did try a couple new brews, which I cannot remember. I ordered the Korean BBQ sandwich, my wife had the Born in the USA burger and my mother the Beet salad. Although my wife and I didn't each much after the fries, all three of us enjoyed the food. The Korean BBQ sandwich was excellent, I would recommend.  The ambiance was just okay. They have designed a Rock N Roll vibe and the menu reflects it but the decor is not much more than a man cave collection. The place is a bit small so I am sure it gets crowded on the weekends.   All in all we enjoyed it and would come back after trying some of the other new places. Glad to see some new life in The Flats!"}
{"text":"I have been a fan of the beet salad and deviled eggs at Crop so it was nice to see those items on the menu at Crop Rocks.  The Crop Rocks deviled eggs are THE SHIZZ.  Smoked bacon and some type of wasabi/horseradish filling that is incredible.  There were smears of what appeared to be Sriracha and a sweeter soy sauce on the plate....perfect complements.  The Magic Carpet Ride that night was curry chicken.  Delicious flavors on that plate yowza!  Very large space, almost too spacious for the number of tables.  I feel like they can add more tables.  Our server said we should get our orders in because the kitchen was backed up but then our food literally arrived 5 min later.  So I tend to agree with previous posters that there appears to be a lack of communication between the servers and kitchen staff.  Great DJs spin vinyl from a huge collection of records.  There is a nightclub next door that they keep the door open to so don't sit at the table in front of the DJ booth unless you want to hear a mixture of DJ and club beats.  Service was pretty good."}
{"text":"I love this place.  I live and work in the Flats and this is by far one of my favorite places here.  It's definitely more casual than most of the other restaurants in the Flats - but that just means it's more fun!  The menu items are creatively named references to music: Phis and chips (self-explanatory), the Smoke on the Water (a salmon sandwich with bacon), the Buffalo Springfield (buffalo chicken wrap), the Beet It salad (self-explanatory), etc.  I haven't gotten anything here that I didn't like, although my favorite is the Smoke on the Water (without bacon).  The salmon is always cooked perfectly, the roll it comes on is amazing, the aioli has a really great flavor.  And the French fries are THE BEST.  I think you can sub a side salad if you are so inclined, but seriously, the fries are great.  They have a really good beer selection with a draft list that seems to change pretty regularly and really great cocktails.  They infuse a lot of their own vodkas (blueberry vodka for the Purple Rain, bacon vodka for the Proud Mary, maybe others?) and have their own homemade \"fire whiskey.\"  Their beer cocktails are all really good too if you want something a little different.  The service is really great here, and the bartenders are awesome!  Great atmosphere with a fun and versatile selection of music playing (it can get loud on the weekends, so if you want to have a quite conversation, maybe have dinner next-door at Crop Sticks and then come over here for after-dinner drinks) and lots of memorabilia on the walls that's fun to check out.  As it keeps getting warmer outside, this place will get even better when the garage-door-style windows open up to create an outdoor bar and the outdoor seating is set up again because this place has great views of the river.  One last though, I believe they do taco Tuesdays and on Wednesdays have a trivia night - I haven't been to either, but plan to check it out those night because seriously this place is the best place in the Flats."}
{"text":"We had a terrible time here!  By the time half of our party ordered their second drink the back half still hadn't relieved their first ones! Same with the food.  90% of our party was completely done with their meals before 3 out of our party even recorded theirs! We saw the waitress 2 times for the entire 2.5 hours we were there!  Also it took 2 hours without our food! Then the waitress paid us too much back in change and didn't even say thank you for bringing it to her attention! She didn't thank us for coming in! I was very underwhelms especially because we love crop!"}
{"text":"I've been here twice and my average experience is about 4 stars. The first time went was in the winter on a weeknight ... And it as totally empty. I had the ribs (dry and tough) and my friend had the turkey club (looked good).   But I went a week ago on a weekend night in the summer - and it was packed. The windows were open and the music was great. We had a beer and a delicious Bloody Mary, followed by bacon-y deviled eggs (flavorful and delicious), Phish and Chips (fish was super fresh, and fries were good), and a Korean bbq meatloaf sandwich (filling but not my fav). We sat that bar since the wait was 45 mins for 2! D  Anyway, it's not going to be my go-to waterfront restaurant, but definitely adding it to my list of summer drinking hangouts."}
{"text":"Candidly, I don't get it.  Slow service, overpriced food which isn't very good.  Also, I'm not quite sure what the restaurant is trying to be style wise.  I would not come back."}
{"text":"We were starving after boating and stopped in here for a quick bite to tide us over until dinner because they could seat our group immediately. Well I shouldn't say immediately, the hostess gave us some flack and threw some shade our way for not having a reservation despite the fact that the place was half empty. For some reason she thought they were \"so full\" that we had to sit outside, which was fun with us anyways, so no harm, no foul.   Our waiter seemed to hate his life, but it was about 90 degrees outside, so he was probably just hot (as was I). Service was pretty slow for a group who just had water and 3 appetizers. They originally brought us an incorrect dish, but were prompt to correct it.   We shared the shrapnel fries, crop tots, and flatbread of the day.   Fries were good, they were basically french fries with sloppy joes on top. Flatbread tasted like pizza, but who doesn't like pizza? Crop tots were OUT OF THIS WORLD. Seriously, they tasted like mashed potatoes and macaroni and cheese had a baby, and then was deep fried. Despite the fact that I was having a borderline heat stroke, the cold water and these tots brought me back to life.   Overall the ambiance and service left a lot to be desired, but those tots were worth it."}
{"text":"Disappointing. If you like loud, you may enjoy the atmosphere. If I came across it in a different city, I might have been charmed. But go for a drink, not a meal. The backpack burrito was bland as could be and the tangled up in blue sandwich was greasy and not much else. Fries were the highlight. Tots were mushy and a letdown. Do not recommend. Food not up to Crop standards set by the other concepts."}
{"text":"Super excited about this new venue in the flats!   We came here to grab some food during a Browns game and were greeted by a long bar (indoor plus outdoor, which will be killer in the summer) and a chill vibe.   The server was super sweet and ready to recommend about 4 different beers to indecisive me, which was fantastic. The draft beers were all around $7, so not the cheapest place to drink, but meh... It gets the job done for a downtown location.   We ordered the avocado Cobb salad and the Korean BBQ sandwich. We ended up waiting a pretty long time to get out food even though there weren't many people in the restaurant. (Maybe the chefs were sad the Browns were losing?) When we finally did get our food, it was just  OK. The Cobb salad seemed to be expensive for what you get, And the Korean Sandwich... Again Meh. I was hoping for more texture- crunchy pickles! Nope. Not today. I will say, however, that the fries were super tasty!! Yes, I know- they're French fries, but they were the highlight of my experience.  Anyway, probs won't be going back to crop rocks until I've heard more positive things. I'm more of a cheap beer girl anyway."}
{"text":"Location, location, location - one of the new breed of restaurants on the East Bank in Cleveland. We stopped by boat, with great parking, and sat in the outside bar. A simply great Marguerita, really great, with a friendly wait and bar staff started the evening.   We loved the bar selection of beers and cocktails and enjoyed the evening.  At the bartenders suggestion, we had an awesome appetizer that was the restaurants take on a loaded French fry plate - very good.  The menu is as advertised, sandwiches, salads and some interesting large plates.  We cut our evening short because our dog waited patiently on the boat.  We will be back to try out the rest of the menu."}
{"text":"First impression: meh. The atmosphere was very underwhelming. The cheap wobbly tables with banquet chairs reminded me of a dive bar. The service was friendly and attentive. I ordered the Chicken and waffles dish ( can't remember the menu name) and it was tasty. I'd come here again with friends to drink and try it again. Overall, it was okay!"}
{"text":"One of the new restaurants in the new Flats. The location is great, right near the river. The interior is decorated with rock and roll pictures, albums, etc. We stopped in on a weekday and wanted to sit outside on the patio. There was no waiter service on the patio yet so we had to sit at the outside bar. The bar tender was busy filling drinks for all the people sitting outside so service wasn't super fast. We got a few beers and ordered the burrito and falafel with salad and fries. The food came out fairly quickly, but both dishes were bland, dry and not interesting. Crop Rocks is a nice place to sit on the patio and have a few drinks, but so are all the other new places in that new complex. Hopefully the food quality improves."}
{"text":"The view is amazing inside and outside.  The ambience inside has great flow.  The old Wmms decor. The staff I feel lacks vibrance very dry but on top things. The food is amazing except the green beans tasted fishy weird I know. I can not wait for summer this area going to be amazing."}
{"text":"Excellent walleye and fries, cute place, nice looking bar. Not very crowded on Saturday afternoon, maybe parking issue, very expensive to park near all the bars and restaurants, shame Cleveland charges so much!"}
{"text":"Bland as bland can be, I don't know how this place will be able to keep up with the other great restaurants in the flats. Also, the decor is horrible. I get they were going for the old school rock and roll dinner feel... But there is a right way to do that and there is a wrong way. What they did was the wrong way. Too expensive and no flavor. Worst combination there is."}
{"text":"The only thing keeping this place from getting a lower rating is the fact that they have the Pig Mac from the original Crop. The tater tots were cold, the gravy and cheese fries were definitely not worth the $4 up charge and the service for a Tuesday night when no one was there was pretty slow. The atmosphere is nice and it's a great location but as for the food it was subpar."}
{"text":"This place is kick ass!!! The DJ was spinning old tunes and the service was outstanding. If you like good music then this is the place for you!! The shrapnel fries, deviled eggs, and wings were amazing appetizers.  Great drink selection and the staff is very willing to make suggestions on cocktails they love. I had a salad and added salmon...it was perfection. Rock on, crop rocks!!!!!"}
{"text":"(Preface: I was here for brunch, so my experience was just of the midday food and drink, no hopping DJs, live music or dance parties to be factored in.)  Off the top of my head, I can name two big pluses for Crop Rocks: 1. Awesome outdoor seating with a stellar view of the water and other businesses that populate The Flats. 2. The vast array of music memorabilia, including an interior decoration scheme that boasts over 15k records.  As far as brunch goes, the food was just as the 3-star Yelp descriptor reads: A-OK. I wasn't floored by the uniqueness of the menu, nor did I think that anyone in my brunch party ordered a particularly memorable dish. Lots of \"pretty goods\" circulated the table after first bites ensued. Buuut, service was two thumbs up and my food tasted good enough to clean my plate and feel full from. Overall it was an alright meal experience, but I would definitely try out other places on the East Bank and around The Flats before making a return visit here. A-OK, indeed."}
{"text":"Food was a bit overpriced. $18 for a basic pasta dish?  All the dishes had inventive names which is fun but the menu seemed a bit all over the place: BBQ wings, falafel, burritos, burgers, etc. Seemed puns for dish names drove what they cooked. Also, the pasta was a bit oily and over seasoned.  The decor was meh. They spent a lot on the recording booth and records which look cool but then the chairs and tables are all cheap. Also, the place seemed a bit empty in terms of how many tables they had setup. Kinda felt like I was eating in a warehouse."}
{"text":"I was so excited to finally go here bc I love Crop  but I was very disappointed by the awful service from our bartender.  Honestly, I could not believe how blatantly annoyed she was to have guests on a Friday evening even though the place was not very busy.  She was extremely rude and inappropriate.  My best friend who I was with is a manager at a newer and very busy downtown restaurant and her reaction was, \"This is the exact opposite of how I expect my staff to treat our guests.\"  I haven't tipped anyone less than 20% since like... Well, I don't remember the last time but I bet she's used to getting 5%."}
{"text":"Poor service. Fair food. They were out of lots of items. Screwed up one of the orders and did nothing about it. Very disappointed."}
{"text":"The heart of Rock and Roll is in Cleveland. To be more specific, it's located at 1061 Old River Road.   We headed down to Crop Rocks for a Cleveland Beer Week event Lagunitas was throwing, a Frank Zappa Beer/Dinner pairing. It couldn't have been held at a better venue!  I don't know if I can really speak to the food since every course was a specialty item for the event not offered on the menu, but I can speak to the kitchen's ability. Our courses included deviled eggs, tobacco calamari, \"Cleveland biscuits\" and gravy (which were actually pierogies!), crab cake, white peppercorn & cocoa pastrami ruben, and a salted caramel apple dessert. I'm not a fan of pretty much any of these foods (pierogies excluded), but everything was still fantastic in spite of that!  I was really, really impressed with how well the waitstaff pulled everything off and how well orchestrated everything was - especially considering this is something outside of the restaurant's norm.  Even if the food wasn't good (which it was), even if the waitstaff were uncoordinated (which they weren't), I'd probably still give Crop Rocks a 4-star rating just based on how much I love the idea of having a live DJ spin vinyl while you dine."}
{"text":"Drink service was a bit slow. Took a long time for the server to bring our simple drink order: some beer, glass of wine, and shot of Jameson. Friends got Steve's Infamous Shrapnel to share and they were very pleased. Huge, and I mean HUGE serving of fries, loaded with ground beef (very generous with the beef!), pickles, peppers and onions, BBQ sauce and Sricicha. One friend commented that there could have been more pickles, but overall, they were both pleased. I wasn't overly hungry so I just ordered an app of We Built This City...Chicken. It was much larger than I was anticipating. There was a heaping mound of fries with a perfect amount of gravy and cheese atop. The \"chicken\" came on 2 skewers, 4 cubed pieces per skewer. Very good. Was shocked at the size of it. Very large for an app that was only $10. One of my friends had the Born in the US burger and he was pleased with it, although it was a bit on the small side. My other friend ordered the I Wanna Be a Cowboy, Baby. HE was very pleased with his order: rib eye was tasty and cooked to his specifications, enjoyed the crispy onion straws and mashed potatoes. The interior décor is a little bland, but the DJ area and the vinyl is awesome to look at. Beautiful view of the river from the bar. I'd definitely visit here again."}
{"text":"This Friday late afternoon we stopped in to have fish and chips and a drink.  First off, we ordered a lemon drop martini at the bar, and the bartender said how he was going to make it, with vermuth in it. Yick! Who does that? We requested it without vermuth, and with vodka. He returned with what appeardd to be a mixed drink that was very cloudy for a lemon drop martini.  He asked how it was and i gave him my feedback that it was a bit cloudy and sweet, then, he became immediately defensive about it so i shut up.  We ordered a fish dinner to share, which was dropped infront of another customer who began eating it right away.  The bartender was going to take the plate away from this man and give it to us after the man already had his fingers allover the food. We were grossed out and declined.  I said i want a new dish, not the one someone else was eating.  We got our dish with what looked like less fish on it than the original order sent to the wrong person. This was disappointing.  Maybe if the food runner had communication with the customers instead of dropping dishes off infront of people without even checking there wouldnt be mixups. I asked the bartender for a discount on my bill due to the mixup, and he got an attitude, and replied, \"But you got your food!\" and i said, well, then we wont be back. He said, Ok.  I said, yep.  He then walked away with my credit card and his attitude.  He returned with the check and gave a small discount.  We were both upset by how we were treated by the bartender with such disrespect and disregard as customers."}
{"text":"We started with the 3 apps, wings, tots and deviled eggs. The highlight were the tots, and they were just ok. Had the pork sandwich which was very tasty and well done. Friend had the meatloaf and was also vey tasty. Fries were hot and crispy. Burger was fair at best, very dry and small.  They serve most of the beer (ipa) in a small snifter. While I get serving beer in a proper glass, I prefer an ice cold beer in a Pilsner.  The decor is very cool and enjoyed the music and artifacts. Did not like the cheap banquet chairs. Even if this was on purpose going after a look, it is cheap and looks very bad."}
{"text":"Crop Rocks takes pains to be a real Rockin' watering hole, outfitted with a humungous wall of vintage vinyl and a bar-top carefully filled with even more of the stuff. It is almost a surprise that the staff aren't dressed in vintage outfits ala Jack Rabbit Slim's, given the place's endless fetishizing of all things swagger-centric and power-chord fueled. The menu is filled with dozens of clever rock puns as well (the best being, probably, 'I Would Do Anything for Loaf'). It's all a little reminiscent of Melt or the Hard Rock Café (R.I.P.), though presented in, one might say, a higher key. The other day, patrons were amazed by the helter skelter manner of the bartenders, one of whom shambled up and asked, \"Yeah? What do you want?\" in a decidedly non-tongue-in-cheek fashion as the other staggered around dazedly in his sunglasses. The food was fairly good pub grub, with the French fries--perfectly crisp and well-seasoned-- serving as one small plate standout, and the vaguely BBQ flavored deviled eggs (sans bacon) as another. It is clear that like most Flats bars, however, CR is built for volume rather than high caliber foodie specialization. As other reviewers have noted, the view of the river is quite good, so patrons would be wise to sit outside, away from the bar. The picnic tables are an ideal place for people watching. On a Saturday night in Cleveland, there is little more one could ask for."}
{"text":"Was looking forward to checking out the glorfied munchies approach i read about Crop Rock, and was was not disappointed!  The drinks we got were fantastic and then the Shrapnel fries came to the table and blew my mind. Kung-Fu Fighting \"handheld\" was complex, so i liked it better without the bbq sauce. On our way out i started peeking around the massive record collection and the dude spinning records came out and was gushing about about when he first saw Rick James.  Really great night!"}
{"text":"On first impression, the space was decorated very tacky, like any other \"rock n roll\" restaurant. The radio DJ booth was cool, with a massive vinyl collection, but that was the extent of that. The overall space felt awkward; it was very spread out  and the chairs, tables, cups, and plates were cheap and corny seeming.   It took forever for our waitress to start us with drinks and then forever to get our food, but she was very nice. In this length of time, the house system was BLARING a very odd mix of classical guitar and Spanish tunes, loud enough to drown out all discussion at our table. It was very annoying and uncharacteristic to the restaurant. They later started playing classic rock (relevant to the decor) and it INSTANTLY made it more pleasurable and appropriate.  The menu is broad and average. The food was alright. I had the Haight Ashbury, which was just fine! The fries were the best part of it (just because they were crispy and didn't suck). Honestly; the dessert was the best part, and served on nicer plates. Not to mention, it's way overpriced for stuff you could make at home and present better to yourself.  It honestly feels like the owner of the Crop restaurants is just whipping ideas for restaurants out because he can: quantity over quality, because this was nothing special and I would not go back again. This was an absolute waste of so much space in the new East Bank restaurant fronts that something (hopefully) new and (hopefully) not another version of American food could move into."}
{"text":"I normally hate writing reviews on Yelp, but after how incredibly TERRIBLE our service was tonight at this poor excuse for a restaurant, I can't help myself.   We made a reservation for only 10 people 2 and a half weeks ago. They gave us tables that were SPLIT up so that our party couldn't sit together. When we asked if we could move the tables together, the hostess (who was SO rude from the beginning) told us absolutely not and walked away without proper reasoning. Our first server, who I assume was supposed to actually be bartending, could only take 2 drink orders at a time without getting flustered. I then became angry and spoke with a manager, since we were there on special occasion.  I've worked in the hospitality industry for over 12 years and have been a restaurant manager myself. I now work in publicity for restaurants in the Cleveland area and know how damaging bad reviews can be. I also know how to treat a customer so that they don't go home and write a poor review.   Never in my life have I had a restaurant manager try to BLAME ME for what was happening at our table. He told me that we asked for a \"view\" when we made the reservation. I don't care what we asked for initially - fix the problems that I am bringing to you without talking back to the customer. Ridiculous.   We then got a new waitress, who was obviously training and had no idea what she was doing. My friend waited over 20 minutes for a drink. I then asked for our checks to be brought out with our food because I could only assume how long that was going to take. Of course, I was right and the checks took about 25 minutes to be brought to our table. Let alone the fact that she had no idea whose check was whose.   I get that a 10 top can be overwhelming if you are really busy and packed. But they were not. They had so many open tables. I will NEVER be returning here again nor will I be recommending it to anyone else. Worst restaurant I have been to in the flats yet. You may want to take a look at who you're staffing, from the management to the host, everyone was terrible and had a piss poor attitude."}
{"text":"The view outside is AWESOME! We thoroughly enjoyed taking pictures with family outside. However, the food was less to be desired. The meatloaf that my husband had was VERY heavy and the cheddar mashed potatoes were very salty. I had the pork burrito and it was very bland (had little to no seasoning at all). At our table, I did hear some good reviews about the beet salad and the fish and chips."}
{"text":"Very cool spot in the new east bank of the flats. Menu was pretty simple but looked to have nice twists to your usual. I got the Soul kitchen: chicken and waffles, spicey Demi glaze, greens.  It was good but for me I would rather have simple maple syrup and buffalo sauce. The Demi glaze just seemed to not fit the waffles and the fried chicken. DJ was spinning tunes and wait staff were on point. Hope this place continues for years to come."}
