{"text":"Here's the thing...its local and it's delicious. Did I mention it's local. The owner makes the gelato...hello...this is what makes a city like Calgary a community. Locally grown, locally owned and locally supported.

Fresh, delicious crepes...I had the Montreal Smoked Meat, but next time I'm getting the Ninja (I think the 5 people before me got it and they looked pleased too!)

Service was quick and the food was at my table in less than 5 minutes - and in my stomach almost as fast!

Thanks to the staff and owner for being a part of Calgary and making this city the great place it is!"}
{"text":"I really wanted to like it here but it was a fail. The server served me a warm crepe that was cold on the inside and my husband had an almost undercooked crepe. Behind the counter was a cluster of disorganization with food and non-food it's,s all in a jumble. The cordless phone fell on my crepe and I had to point it out to the server, and she then tossed it and started a fresh one. The utensils were gooped up with batter and when I asked if this was the first crepe of the day, the server said yes...which makes me think the goop was yesterday's goop. Sh wiped the crusty goop on the edge of the Formica counter. Not hygienic.  I will not be back. So sorry as it had potential.  Maybe the gelato is better, but still a dirty kitchen... :("}
{"text":"Walked in on a sunny Saturday afternoon.  I'm so glad this place is still around.  Seems like every small shop in slowly getting replaced by a Starbucks or some other chain but I digress.  Back to the ice cream, or gelato to be exact.  I had the green tea gelato and the dark chocolate sorbet.  Both were excellent and very fresh. No ice crystals in either. Seems like I pop in here a few times every summer and am never disappointed.  Keep churning the sweet delicious, cold piece of heaven!"}
{"text":"Let me tell you all the cons: 
Small seating area
Waited 25 minutes for order
Dicey parking (17th ave)
I've had cheaper crepes 

STILL 5 stars because the crepes were superb and the homemade gelato rocked with over 20 flavors to choose from. The serving size is generous- even the one scoop of gelato"}
{"text":"Went there with a groupon since I wanted to try the place out for a while. Was left a bit confused: i guess i expected the savoury crepes to be folded over, sort of like a tortilla? Since that's how they serve them in Europe. Instead, it was just like a wrap, only with a crepe instead of a pita. We both had vegetarian versions, which didn't blow me away. First, you couldn't taste the crepe at all due to all the other ingredients in it, then we finished me meal off with a gelato, which is obviously kept too warm because it started melting before I could get to it. Also, completely out of sorbet, which is partly the reason I wanted to try the place. Disappointing. 
Then, the decor. Ok, I guess they're going for the '50s look, all the power to them, but is it too much to ask to get a decent table you can rest your hands own without wobbling? I guess so. 
PS. I don't appreciate plastic cutlery in a  place that offers sit-down dining. I didn't even need any cutlery, really, yet everything is served as disposable. Overall, seems like dicey management trying to pass off european cuisine without any knowledge of such. I give this place 6 months. Spend your money elsewhere, perhaps Cibo across the street-can't beat the wednesday 5$ pizza special!"}
{"text":"I like little neighbourhood places like this one.  Some friends and I drove past this place Sunday afternoon while trying to decide on a place to eat.  We decided to give it a shot, especially since there aren't very many crepe places in Calgary.

Initial impression of the place is 'Interesting'.  There are about 8 to 10 seats in an L shape bar-counter style with most of seats facing out the window onto 17th Ave.  Two big menus show sweet and savoury crepes, one above the counter and another on the wall.  There were also two large coolers full of ice cream and gelato deeper into the store.  There was a single guy behind the counter who welcomed us.

We put in our orders, I got a Philly Cheese Melt and the others got a Strawberry Yoghurt and a Chocolate Strawberry each.  The guy then made the crepes fresh to order.  I thought my Philly Cheese Melt was quite tasty but the roast beef tasted a little like store-bought deli meat which wasn't heated thoroughly and so the filling was a little cool.  The flavours of all the other toppings in my crepe blended really well.  The two desert crepes were quite delicious and I would definitely go back for the desert crepes.  The milkshakes were also really good.

In total, 3 crepes and 2 milkshakes came up to about $35 which averaged to under $15 each for a crepe and drink.  I personally don't think the crepes was meal size so a big eater might need a savoury and desert crepe to fill up.  

I would recommend checking this place out.  Good crepes and the owner who runs a one man show in the shop is super nice."}
{"text":"I went here for lunch today. It's a tiny little place with a couple small tables and some counter seating against the window. The decor could use some work -- getting rid of the wallpaper and painting it a bright, fresh colour would go a long way.

Now to the food. I had a smoked salmon crepe. It was really tasty -- generously sized and lots of salmon, fresh cucumber and tomato, along with cream cheese, capers and dill. The only downside was that it also came with raw red onion and green onions, which weren't on the menu description. If I had known, I definitely would have asked for it without. 

The price is decent for what you get. I'll probably go back sometime and try the gelato, which I understand is handmade."}
{"text":"This place is the best when it comes to desserts! Their Crépes, milkshakes and gelato is Great! The staff are nice. Always smiling :) and the place is just cool :)) I TOTALLY RECOMMEND THIS PLACE!:)))"}
{"text":"This is a really small place with seating for about 15. Pretty tired decor too. Had the Hawaiian crepe today. Kinda meh. The crepe itself is the only thing made fresh. The pineapple, mango and custard were all out of a can or frozen. And I think they forgot to put the coconut in or there was so little I couldn't taste. But the place was doing a steady business on a Sunday afternoon.  Not going to write them off completely yet."}
{"text":"Prior to stepping into this lovely little establishment down the road from where I live, I had eaten only one crêpe in my life. While not as committed to my indifference to crêpes as Ricky Bobby in \"Talladega Nights\" by allowing my arm to be broken unless I stated that I loved them, I only went there for lunch one day because my partner, Dan, wanted to go. I reluctantly agreed to go for lunch as, after all, how bad could a \"very thin pancake\" really be.  

Along with my prior indifference to crêpes, I also clearly had an ignorance to the versitility of these delightful food creations. I thought they were only sweet. As we looked over the menu board and I saw the mouth watering pictures on the wall, a completely revised eating plan had to be considered. Dan selected \"The Ninja\", while I selected a Philly cheese steak style one. We were offered the selection of lettuce or spinach inside, we both went with spinach. Dan described it as \"a party in my mouth and everyone is invited\", and I wholeheartedly concurred. My complete foodgasm experience came when I ate my half of the dessert crêpe we ordered that was the Strawberry, Nutella and Whipped Cream stuffed confection that followed. I felt instant regret for deciding to share the dessert crêpe rather than order my own, and Dan felt an uneasy discomfort in taking his eyes off of his half, taking a tighter grasp on his fork and making a low pitched growling sound that indicated his chilvalry had limitations in the face of such deliciousness. Sure, he would take a bullet for me, but share his half of that crêpe? It just wasn't going to happen.

The final thing that we thoroughly enjoyed was the music playing both times we went there. It was surprisingly hip, and not in the ironic T-shirt wearing, beard sporting, waxed moustache sort of fashion."}
{"text":"One word : fantastic. Well. I guess I should say a few more words, since it should be a review. Great gelato, if you were ever in Italy and tried the original stuff, you will know this is just as good. Super friendly staff, always giving free samples of the different flavours. My favorite is  the chocolate one. Simply outstanding."}
{"text":"I have never been to another crepe place before, but I don't think I need to. These guys do it all, Savoury & Sweet and they are really delicious! 

Today, I had the Chicken Ceasar Crepe, which was so so so so good. I probably could have stuffed myself with a second one. 

Crepes are Fresh, ingredients are fresh. What more could you ask for? 

I would recommend this place to anyone."}
{"text":"I usually like to come in on Saturday for lunch, after trying their Nutella crepes for the first time I couldn't stay away!"}
{"text":"Hmmm this is a dilemma.  I love Crepes & Cravings but I cannot bear myself to give them a 5 stars. Not yet.

I know they have awesome gelato but it would be nice if I get to try them.  The last couple of times I was there, the gelato was pretty much frozen and it was impossible to scoop.  It was very disappointing.  Other than that couple of times, the gelato seems to get better...softer...scoop-able.  I tried the super dark chocolate (i think they named it Negro?)  Anyway, despite the name, I love that ice cream!  It's the most flavorful dark chocolate gelato I have ever had.  If you are a dark chocolate lover, it's a must try!!  I also tried the Salted Caramel which was also awesome.  However, I didn't like the White Chocolate one.  It tasted kinda like Vanilla ice cream to me.  

Ah it is just delightful knowing and having a gelato store on 17th Ave!"}
{"text":"owner was very nice and let us taste a sample of almost everything. pistachio and salted caramel gelato is sooooo good. Not too sweet either. Def coming back. Very authentic crepe joint :)"}
{"text":"The music is great, a lot of 90's pop. The staff are friendly. The place is clean. Service is quick. My fav is the strawberry banana crepe with nutella. I get the whipped cream & gelato on the side. The gelato is made in the store, and the flavours are different every time. 

I deducted one star for affordability. $9 is too much to pay for a crepe."}
{"text":"Well, I must say... in 2010, I have had a \"first\".  
My first savoury crepe.  Luckily, Crepes and Cravings was the first to break me in.
To me, crepes are a fancy breakfast that I use to occasionally enjoy at the Hoito in my homeland of Thunder Bay, Ontario. However, I could resist trying my first savoury crepe from the food fare in TD Square, on recommendation of a friend of mine.
Well, after my  first one, I have kept going back!
The savoury crepes at this establishment are presented a little differently than I would expect, but I mean that in the most complimentary way.  The crepe rolls up like a tortilla wrap.  
My first try at Crepes and Cravings was a Mexican fare (which I have since tried a few times).  I have also tried (and loved) the vegetarian crepe as well.
What I like best, is how fresh everything is.  Much like your local sub and pita place, Crepes and Cravings makes the crepes with fresh toppings right before your very eyes.
If you are looking for a healthy, delicious lunch, and you work in the downtown core, you will want to give this place a try.  The staff are friendly, and the food is outstanding.  It's certainly a nice variety from the standard fare."}
{"text":"Move over tortilla, I think crepes are my new favourite wrapper! 

Yes, that's right. Right here in this little take-away crepe shop, you can get a crepe filled with Mexican-style fillings and rolled (almost) like a burrito. The selection of savoury crepes includes a Mediterranean, turkey and swiss and roast beef among several others. I went for the smoked salmon.  The crepe was made fresh and the toppings assembled. I was a little disappointed that the rolled up crepe looked more like a hand roll or a burrito than a traditional fold-over crepe, but it sure was hand-y. 

They filled mine with salmon, capers and dill to the gills, for which I was tickled pink. With the bananas, caramel and nutella on the sweet crepe menu, The price point is on par with a pita, $7-9. For that, and because it's so conveniently wrapped up tight, I could see this \"fast food\" spot satisfying many cravings along this strip."}
{"text":"Great food but won't drive there again.  $40 parking ticket...no where to park.  Stepped inside for five minutes."}
{"text":"The crepe here is amazing!
Had a craving for crepe today and stopped by this small stop and this made my day. 
Ordered the PBJ crepe, which had peanut butter, Nutella, strawberry jam, banana and strawberry. 
It was awesome!!! Best combination ever!!! And the girl was so accommodating when I requested to have the whip cream on the side. 
Will definitely go back"}
{"text":"Sure i'm guilty and biased when it comes to sweets but this sure is one mean thick and heavy crepe!

Ordered the banana split one of course with some healthiness to it, bananas and strawberries, nicely spread out Nutella for that healhty hazelnuts finish ;)  Not to mention the extra caramel I requested, and topped w/ some whipping cream.

For $8.40, even came with a bonus small cup of gelato, which i highly recommend the hazelnut ;)

And came w/ real utensils, the hard kind which was needed to cut thru those fluffy but multi-layered crepes."}
{"text":"Ooh là là!  As of today, we have a little slice of Paris and Italy in lower Mount Royal, folks. 

My best friend learned about the 17th Avenue Crepes & Cravings location at this year's Lilac Festival. They were supposed to have their grand opening on June 11, but due to challenges with construction, they officially opened their doors today.

What a treat. What a find. We started with a savoury crêpe. My friend had the Chicken Caesar crêpe, while I ordered the Bistro Roast Beef crêpe. Preparing the crêpe is a fine art, which requires quite a bit of skill. It was fun watching how they are made. The ingredients are fresh and the size portions are excellent.

After walking off our meal, we returned for dessert. Sweet crêpe or gelato? That was the question. I opted for gelato, especially after hearing how everything is made on-site. Normally, I order \"limone\" gelato (lemon) whenever I try a new place. It's how I test how good a place is.

Their version of limone gelato is the Italian Lemon Wafer, which was made within the past 48 hours. Ooh, with the first spoonful, my senses were whisked back to Italy where I ate three gelato a day (mostly lemon). Folks, we have a winner. It had the same texture as the gelato in Italy - creamy but not too much so. The contrasting flavours of sweet versus tart were as finely balanced as the melodic lines in Vivaldi's \"Four Seasons\". Delcioso!

The big Grand Opening is slated to take place on Saturday, July 2. If tonight's any indication (food and state of busy-ness), this place is going to be THE place to go for savoury crêpes,  dessert crêpes, ice cream and gelato.

Now, if only they'd offer crêpes for dogs, Maestro would be happy.

[July 10/11 update: Chocolate Banana Strawberry crêpe is pretty tasty! Chocolate sauce isn't too sweet. Whipped cream is very creamy.]"}
{"text":"After the Red Mile Creamery closed, I was sad that there wasn't an ice cream shop nearby. But alas! Crepes & Cravings has opened up two doors down. I stopped in for some gelato during my long, hot walk down to the Stampede Grounds on Sunday. It's a good thing for me not many of you know about this spot yet, or at least you weren't in an icy cold treat mood on a blisteringly hot afternoon. I walked in with no line up to worry about.

Two freezers presented themselves, one with ice cream, one with gelato. After perusing the many flavours, I settled on the honey nougat with nuts (pecans? walnuts? I can't quite remember). Get your scoop on a cone or in a bowl, it'll be lovely either way I'm sure.

What I liked best was that all ice cream and gelato are made in-house. That's right folks, our very own little gelateria and creamery right on 17th. Which also happens to mean that there will always be new and yummy flavours churning out of this joint, at least according to the owner.

Now, time for a crepe!"}
{"text":"I'm not a huge fan of crepes (though I can be moved by a good nutella+banana) but am a huge fan of good gelato, and what they have on offer at Crepes and Cravings new 17th Ave location is absolutely superb. I've tried three flavours: the vanilla w/ black cherry, dreamsicle and the limone that Rhona-Mae discusses in the last review. All were exceptional- and by \"exceptional,\" I mean the absolute best I've had in Calgary and, honestly, as good as some I had last month in Buenos Aires, which is a mecca for gelato fans. It's not exactly cheap ($3.75 for a non-huge cup) but the flavours are sublime and the texture and temperature are both perfect. 

They have conventional ice creams there too- separate freezers for gelati vs ice cream, thank you very much- and they also look scrumptious. Not a grain of ice in sight. I hope they can maintain this quality because this is the best we've seen in Calgary!"}
{"text":"Goal: find yummy late night dessert

Outcome: yassssss! Crepes and Cravings come thru!

They're a great local business with home made ice cream! And crepes! And Waffles! Open late night! Could I BE anymore excited?! 

The desserts were super sweet! Pun most definitely intended. I got the Waffles and one scoop of Vanilla ice cream, It was about $10 so that's not too bad considering it was two items on the menu. It was really delicious, fresh and curbed my craving for sweets.

I would give this five-stars but there was only one person working the til and when it got busy she seemed flustered and actually asked me to wait longer when some people jumped the line ahead of me to order and then pay- which I replied I was here first and then she decided to finish helping all of us in one go. 

I would go back but maybe just for takeout because the space is really small and gets crowded really quickly."}
{"text":"They need to brush up on their English. I say this because my friend had s food allergy and they put in exactly what was specified they were allergic to. The crepes are good. There is very little seating in there but on the few times I have been if hasn't been an issue. The milk shakes aren't that great. Nice people though."}
{"text":"When this place opened, I had been meaning to try it out for the longest time as I was only 3-4 blocks away from work.  But days turn to weeks and then to months... and suddenly it's 2012.  Luckily, they participated in one of those Groupon like coupons, and decided to finally give it a try.

I decided to walk in blind, and not pre examine a website or whatever to find out there and there what I should order... and ended up staring at 2 menus (savory and sweet crepes) for about 10 minutes, completely lost at what to choose.  My apologies to the one guy there at the time who was patiently waiting for me to make my mind (or possibly suspecting I had a stroke and was incapable of speech).  

Finally, I made up my mind and tried out this savory crepe, the Mediterranean.  Grilled chicken breast, feta, hummus, olives and so on.... it rocked.  Definitely enjoyed it throughly, and now I'm curious about the rest.  

As I was growing up in Montreal, my single favorite resto as a kid was this savory and sweet crepe sit down resto called the Magic Pan.  It disappeared so far as i know when I grew up, but this place did evoke some similar memories (the grilled chicken in a cream sauce crepe was my fav back then).  I will be back soon, and haven't even had a chance to try the homemade gelato as well!"}
{"text":"Gelato was fantastic! Between us we had four flavours...coconut, rum raisin, lemon raspberry, and chocolate. All delicious, very creamy, and a big portion! We didn't try the crepes but several other patrons had ordered savoury ones that looked very, very good. All crepes were made fresh to order. We'll definitely be back"}
