{"text":"Let me start by saying that there is no way the wife or her family that that do the waiting could get any nicer.  It is clear that everyone here tries very hard and that they have a great following.  I think even being in such a welcoming place wears off on people as I witnessed random acts of kindness while there.  I wan't going to review this place, but decided I owed it to other yelpers as I found it through yelp.  We went for breakfast and granted it was just one visit, but 2 things appeared to be missing: seasoning and cooking with butter.    We had a pancake which as other reviewers mentioned was large and fluffy, but it had no flavor and I couldn't figure that out until my husband mentioned the no butter thing.  We also tried the eggs benedict and the biscuits and gravy and it was all just there.  Perhaps we hit an off day and reading this will give thought to the chef."}
{"text":"I am about a 2 but the waitress was so nice I could be convinced to 2.5. The food was good but what killed it was ambiance. To set the scene...imagine grandma's breakfast nook (floral curtains and hokey wall decor) and Christian Music blasting with the chef singing along. Towards the end of my meal, someone came in asking to use the bathroom. One of the waiters loudly announced that the chef was in the bathroom and that he usually is in there for a while...not a very appetizing thought while eating a hamburger! Up until that point, the food was okay. But, thinking about my whole experience makes me nauseous so, I won't return."}
{"text":"We came down to the valley last month and stopped in for breakfast.  It was as good as I remembered...still wish they could move up to Prescott!  We're going to be down in the valley this coming weekend and are planning on making a special trip to the Culinary Cafe with our son and his girlfriend before coming home on Sunday, can't wait!!!"}
{"text":"Big time chef in his very own, but little, restaurant ! Imagine having an experienced and professionally trained chef almost to yourself. Chef Mark Vojtek enjoys his little (about 35 seats) cafe as a place where he can be it all, share his considerable culinary artistry and have his family around him, his wife Karen will wait on you. He is the only one in the kitchen, does it all in very reasonable time frame and turns out delectable dishes such as...+READ Imagine having an experienced and professionally trained chef almost to yourself. Chef Mark Vojtek enjoys his little (about 35 seats) cafe as a place where he can be it all, share his considerable culinary artistry and have his family around him, his wife Karen will wait on you. He is the only one in the kitchen, does it all in very reasonable time frame and turns out delectable dishes such as his \"fish & chips\", poppy seed tempura battered talapia (now I call that Fried Fish heaven!) with thin french fries, containing 3 large filets of fish and a lovely salad and fresh dinner rolls for under $14. He is a large man, as many chefs tend to be, and told me he hates to leave a restaurant hungry, commenting \"look at me, I like to eat, and since I don't have to pay someone to help in the kitchen, I can afford to serve bigger portions\".  Try his Beef with black pepper Cognac sauce or the Pork chop with black currant mustard glaze, or his hot sandwiches, and the Mulligatawny, a chicken soup base with garden vegetables, tomatoes and Granny Smith apples seasoned with curry and spices.  Closed Monday and Tuesday, serving from 6:30AM till 2:30PM the other 5 days and on Friday eve 4:30 to 8:30 he out does his breakfast and lunch offerings."}
{"text":"I've only ate here once but I want to go back, I remember ordering pancakes, they where like the krispy cream of the pancake world, fluffy, warm soaked up the butter and syrup like a sponge. the place is small and can get packed in a hurry so come early."}
{"text":"Our family and friends love this place!  It's a quaint little cafe with delicious food.  The owners are so friendly and kind.  You really feel like you are dining with family when you are there.    My brother turned me onto this place over 5 years ago and we have enjoyed Chef Mark's food time and time again.  We have also ordered lunches for our company meetings and had them delivered at no extra charge.  We have had Chef Mark out to our home to cook for us and teach us how to make a scrumptious meal.  We have also had Chef Mark create Delicious cuisine for our end of year work parties.  My company enjoyed it so much, we had him back again the following year.    Dining in the cafe you can expect yummy down home cooking with lots of varieties to choose from.  Our family is a huge fan of the deep-fried oreo.  The food is flavorful and hearty!  I love the enthusiasm Chef Mark shares with his diners while he cooks.  My 4 year old loves to listen to the Chef sing.    Having meals delivered for company lunches, you can expect accuracy, timeliness and your food showing up at the right temperature.  While using Chef Mark to entertain and cook for your guests, you can expect a kind, friendly and professional experience.  We have picked fancier meals when we have utilized his in-home cooking and all the guests seem shocked at what he can create in a home kitchen.  The food has always be delectable!    We have enjoyed many meals, including several special occasions with Chef Mark and we hope for many more to come."}
{"text":"Decent breakfast place.  I had oatmeal.  I looked unusual... very thick and milky but it tasted good.    Funky that you have to walk through the somewhat messy kitchen to get to the bathroom."}
{"text":"Not bad food. Made everything from scratch. But I know they can do more to set themselves apart and stand out from other places. It also is inconvenient that they are close on Monday and Tuesday."}
{"text":"It gets better and better every time I go back and that is all the time!   After discovering this little cafe in a strip mall, I have stopped shopping for groceries or making my own coffee, I simply come here for breakfast....it is that good, you can simply give up any cooking skills you may have.   So, yes I gush because I eat here alot and have torn through their menu- eggs benedicts, quiche- its' manly and tasty-, omelettes, scrambled eggs- who knew they could be so fluffy- pancakes - like a krispy kreme and waffles...Like I said, I eat here a lot and it is by far my favorite breakfast spot. The prices are reasonable and comparable to just about any other place in the Valley. Did I mention, I really like their food...!"}
{"text":"This place had been mentioned to me by a friend who definitely enjoys a good breakfast...but he very conspicuously did not mention the name.  After discovering it on my own, I realized why...he wanted to keep it all for himself!    The place is small with a mom-and-pop feel.  There is only one person in the kitchen and they only have as many tables as he can handle cooking for.  The menu is simultaneously innovative and traditional....all of the usual breakfast suspects with a delicious twist and the dishes we tried were very well executed.  The husband LOVED his eggs benedict with chorizo and my kielbasa and onion scramble was buttery and delicious.  The two pancakes that were placed in front of my eight-year-old were each bigger than his head!  If the food weren't enough, the wait staff were wonderful!  It took me a while to figure out who our server was because all of the waitresses stopped by our table to say hello (this may have been because they couldn't resist the cuteness that is our two-month old baby).  Friendly and warm, they made us feel like we were family.  We'll definitely be back!!"}
{"text":"Nice people but the food is really average at best. Pretty bland and nothing we would ever think to go back for.  I was hoping it would be a good find since it's close to where we live and work, but neither I nor my husband were impressed at all.   Their version of a latte was the worst thing I've ever tasted in my life. The regular coffee was so bad we decided to order a latte, and wow, it was even worse. Why not invest in a decent espresso/coffee machine?  They are not that expensive. Even the waitress agreed with me that the espresso machine is terrible and took it off my bill.   This place has potential if they would just put more effort into the quality of their food/drink. It's cute, quaint and has a family business feel to it.  I really wanted to support a local small business, but it just wasn't good enough to go back.   Like I said, very nice people and I don't want to hurt their business by putting a negative review, but they really do need to make some improvements."}
