{"text":"I really wanted to like this place...

I've stopped by here two separate times (2 months apart) and BOTH times their espresso machine was down.  Regular coffee was available in the pump canister like the Toyota dealership down the road.   

It was disappointing that they only have \"to go\" cups and plates/boxes.  It seems like they cared when they designed the interior of this place but forgot the most important part... the part that makes $.  

Ginger is in every pressed juice, so if you don't like ginger, tiene una problema.  

The avocado toast was okay and salvaged a second star for the joint."}
{"text":"I went to Cultivate for the first time today with a colleague for lunch and ordered the Greek salad ($11.25) with: free range chicken, romaine, garbanzo beans, kalamata olives, tomato, cucumber, pita chips, feta and dressing on the side. My colleague ordered the Hungry Bee salad ($12) with: organic turkey, spinach, quinoa, carrot, roasted beets, sprouts, hard boiled egg, organic white cheddar, bee pollen, and dressing on the side. We both agreed it was quick and friendly service, fresh ingredients and delicious! I got a cup of Rising Star coffee to go and it was the perfect afternoon pick me up. I'll be back again soon!"}
{"text":"I visit every time I'm in the area. The staff is always very friendly and helpful. The food is fresh and delicious, and the portions are huge and well worth the money. My favorite items are the avocado toast with egg and cheddar, and the bee berry açaí smoothie to go along with it. Would highly recommend this place."}
{"text":"So we went there at 6:30 one night this week.  The girl was mopping and the rugs were up on the chairs.  We felt kind of awkward.  I said can we still order.  She rolled her eyes and said yes.  We thought the servings were WAY to big. Nice selection of salad toppings.  Ditch the head iceberg lettuce though!  Then we asked if we could eat in, she rolled her eyes again and said yes.  Then when we were eating this young couple came in at 6:45 and wanted to order, rolled eyes AGAIN!  I know good help is hard to find.  But seriously.  Mop when you are closed.  Serve food when you are open.  Also she put mop on counter where food is prepared.  Watch cross contamination.  It's lettuce!"}
{"text":"I'm so glad that they added this place to Chagrin Falls. The location is so convenient and it filled a much needed niche for the community!

Great place to stop in for some trendy healthy options like avocado toast or an acai bowl!  You can also get a juice, smoothie, coffee or tea to go along with your food. Much of their menu is customizable so it's super easy for you add your favorite toppings to a salad or just pick from their menu as it is!  A lot of their food also has fun health food additions like bee pollen which is fun to try and of course makes you feel like you're doing something good for your body!

There is some seating inside so you can eat there if you want, but this is definitely a great to go option if you want to grab something healthy to take with you on the go!  The location makes this spot even better because it's right next to a yoga studio and gym so this is the perfect spot to grab a nourishing smoothie or healthy snack afterward, that doesn't completely cancel out your workout!

The avocado toast is my personal favorite, they are very generous with the avocado and it is so good!"}
{"text":"I was not a fan of the service here. This was my first time trying this place and I mentioned this when I began to order in hopes that she would help walk me through the process and all of the toppings. Instead, I received no reply and felt that she was annoyed at the presence of a customer. No smile or anything and the food wasn't good enough to make up for it. Overpriced."}
{"text":"I will update this review after a second visit. This review is based upon one visit.

No greeting. No smiling. These are the big ones for me...prickly energy. Boo.

No turkey in my hungry bee bowl...despite the fact that the young woman making the bowl turned to read the ingredients off the board as she was making it. There are only 5 bowl menu items...I'm dumbfounded that these are not memorized especially given that there are so few of them to learn.

The spinach, sprouts, carrots, etc. in my bowl were fresh and crisp. And all the ingredients I could see behind the sneeze guard looked equally as fresh. 

The portion was large, though I could have had the same salad from Heinen's salad bar for a couple bucks less and a guaranteed smile and a thank you."}
{"text":"UPDATE:  I keep going back! The Kale smoothie is delicious, and the avocado toast is always better than mine at home.  Oh- and that one worker- she is still very abrupt, but I think she's awesome now! 

All in all, I'd like them to start using more organic items (especially the milk!) and perhaps cut some portions/lower some prices."}
{"text":"Before coming here, I thought this is the place ones goes to cleanse their souls and eat like rabbits. It proved to be the opposite. The portion is very filling. You don't feel loaded with meat, yet still cleanse your souls (or guts).

They are very generous with cheese. Big chunks of cheddar cheese in both orders. Bigger than the hard boiled egg chunks. 

You'll see a connected door to the yoga store next door, but employees assured me the ownerships are not related.

Given the close proximity, a good portion of the clientele are yogis. 

Clean food, locally sourced ingredients."}
{"text":"Love the menu! Healthy and real food and very customizable to fit any dietary need or preference! Delicious too!"}
{"text":"food was just straight up bad. i made my own bowl and it was not good, just tasted like it's been in the fridge for weeks. i also got an iced matcha with coconut milk it tasted grainy. disappointed i spent $14 here"}
{"text":"The shrimp salad was good, but not $12 good.  Found the food to be overpriced.  Nice atmosphere."}
{"text":"Just in town visiting from LA. Popped by after a drop in yoga class next door. 

Firstly, the menu is simple and beautifully curated. The fact that they even had bone broth on the menu got me excited. 

Secondly, the prices. I'm not sure if I've just been paying too much for food in the city, but I was shocked when I saw that the avocado toast was only $4 (what?!) and a flat white is only $2.75. 

And lastly, the food is really, really good. Especially after an invigorating yoga class. 

If you're looking for a good, healthful routine in the new year, try this place!"}
