{"text":"Heads up!  Cupcake Binge is back!  They will be selling their cakes at the Open Door Coffee Co. In Hudson, OH!!! They will be there Thursday - Saturday.  Go support them as they are looking for other locations to sell their cupcakes.  I have been dreaming of these guys coming back for months and now they have!!! Can't wait to get a cup o' java ASAP!"}
{"text":"Most expensive cupcakes I have ever seen
Did not order
Looked ok inside 
Just not my kind of place"}
{"text":"I was very excited to see a new cupcake bakery open up in the area and counted down the days until they opened.  The store is decorated cutely, but it looks like a bar more than a cupcake place. The cupcake flavors are inventive and I was looking forward to trying out some of the different flavors but they have a changing menu and some flavors are only offered once a week.  I do recommend the mexican vanilla cupcake, but the other flavors I tried were kinda boring.  The cake was moist but the cupcakes seemed to be missing something. Like they needed a creme filling or something extra.  The price is pretty expensive considering most cupcake places in the area charge just under $2.00. And they do run on the smaller side. 
 They do have a small wine and beer menu and a few different appetizers other than cupcakes.  I would like to come back in the evening to check out the wine bar.
Overall - For the size, taste, and price.  I won't be back for the cupcakes."}
{"text":"I liked the cupcakes a lot. They're the right size, taste and the place seems nice. It looks like they're going for the \"gourmet cupcake\" thing and I think the wine and beverage offering is nice. It seems like a place to go and hang out, although I never checked if they have wi-fi since I just get my cupcakes to go. 

I'm a fan of the mexican chocolate cupcakes, it doesn't seem like they'd be good, but they're amazing.

I think this is a really good place, I just think the customers in their location won't \"get\" what they're about."}
{"text":"Really nice place.  I like the grown-up coffee shop take on cupcakes.  Imagine sitting by a fireplace having a lovely cupcake and a glass of wine or a warm coffee.  Great decorating and wonderful cupcakes with a rotating selection depending on the day.  Kudos to the friendly owner who is more like a gracious hostess making you feel at home in her shop.  We'll be back!"}
{"text":"Definitely very enjoyable decor and food.  Remember folks, these cupcakes are a treat, so price wise they will be more than Acme's.  Great place for a cupcake, a glass of wine, and great treatment."}
{"text":"I bought a gift certificate for my parents for Cupcake Binge/Unwined for their anniversary. When my parents went there, it was closed. This was two weeks after I bought the gift certificate. I have since emailed, called and sent a message on their facebook page and have gotten no reply. I understand they had a problem with their landlord, but they could have at least returned my calls/emails. Their website has stated since August that they are looking to reopen at another location, but now it is October and I guess I can say goodbye to my $50.00."}
{"text":"I liked their cupcakes - they're good, not great, but better than some of the other places I've been to in the area. 

The flavors that they have are the regulars, other than the Mexican vanilla, which is good. (Like a snickerdoodle made into a cupcake.)

I so wanted to love this place, and make it my \"go - to\" cupcakery ... but I can't. I don't know if it's just me and I'm the unluckiest person ever, but I've been there a few times. I've **tried** to go there about 10 more times, but the other 8 times they weren't open. Despite it being their regular store hours. (Which, I know have changed - I've always checked the website. But even more, I've actually called ahead to make sure they were open so I didn't make the trip for no reason. Still - when I got there? Closed.)

Beyond that, they've never had all the advertised flavors available, and I've been in right when they opened, the middle of business hours, etc. If you're observant, you'll also notice they generally have yesterday's cupcakes for sale if there are any. I totally get it's a business and a day for a cupcake isn't bad. (Although it seems their display is an open one.) But I wish it would be a little more clearly noted. [Or maybe it's just a caveat emptor thing.]

As another reviewer said the cakes seemed lacking. Some of their \"specialty\" cakes seem just like the vanilla. Their frosting is really good - better than some Sprinkles, or Georgetown Cupcake's buttercream, but that wasn't enough to carry the cupcake."}
