{"text":"Great local place!  We have been for breakfast a few times and everyone is always friendly, the food is great and it is convenient and quick!  We will definitely be back!"}
{"text":"Rueben sandwich was very good! Sweet tea on point, Plus they have the best ice. Waitresses were very friendly and service top notch"}
{"text":"What a gem! Incredibly friendly staff, quick service and delicious food at a great price!"}
{"text":"Solid little country diner located in the end cap of a tiny business strip.  Expect fast and friendly service, piping hot food, all at very reasonable prices.  My fried flounder lunch special came with two sides: I ordered the slaw and turnip greens.  All was very good--not spectacular--and filled my tummy for the rest of the day.  $8.95 is a great price for what I received.  This place is a do-over for sure!  PS:  No one called my honey, babe, sugar, or doll.  Yes!"}
{"text":"The food and staff are wonderful! Country home cooking at its finest here and they move the people in and out so we never have to wait long if there is a line. The prices are good and you get plenty of food so if you leave hungry, it's your own fault."}
{"text":"We have eaten meals here at least 40 times including breakfast and lunch. It is very good every single time.  The owner and the wait staff are always so pleasant and fast. They have daily specials that are always delicious.  My favorite for lunch is a vegetable plate because they have the best squash I have ever eaten. You don't really associate seafood with this type of restaurant but try the flounder.  It is fantastic.  Breakfast menu is standard but well prepared.  Pancakes are great but very sweet and almost cake-like.  Glad to have this gem in a rural area."}
{"text":"New breakfast spots can be a challenge to find, so when we were headed out to the country, we happened across D'Anna's (dee-annas? dannas? no idea), and the reviews that are out there seemed to be good, and perhaps more importantly, the parking lot was packed, which is a good sign that the locals enjoy the place, so we gave it a shot.  Upon entering, there was even a line - well, two lines - one was checking out and one was checking in, and that was a bit of a challenge, because knowing which you were in made things difficult. The good news is that even though the place isn't large, it moved quickly, even though it was first-come, first served, so a table for four would have a single person, which is fair, but it means if a bunch of individual show up, a larger party could wait quite a while if a bunch of small tables open later.  After being seated, the service is great, as you would expect at a smaller, non chain locale, and they even offer some specials on the weekend, which is a nice surprise. They are not perhaps what you would expect based on their name - for instance, a \"chicken benedict\" bears little resemblance to the standard eggs benedict - instead it is just chicken on biscuits with scrambled eggs and gravy. No sign of poached eggs or hollandaise. Doesn't make it bad, just not quite what you would expect if you read titles only, so read the descriptions too.  Food comes out rapidly, especially since they are fairly busy, and quality is good. Definitely a good place for breakfast if you're in the area."}
{"text":"We were traveling in this area so decided to try this one. I for one am glad we did. Just want to say if you leave this place hungry its your own fault. I had the Triple Decker Club. Great sandwich. They pile on the fries. Janet had the reubin. We were amazed at the flavor of both.Oh did I say that they pile on the fries? A real 5 star. If you are ever close try it. Remember I tell it like it is.  JH"}
{"text":"Great food with great prices, and always a friendly wait staff! They quickly seat you and the wait for your food is minimal. I enjoy their breakfasts the most!"}
