{"text":"I stopped to have gelato here yesterday and was reminded that this cafe could be so much better than it is. More than once I had a substandard experience here.  The guy behind the counter scooped the gelato in small scoops (flakes) and the flakey scoops sat precariously on the cone .. bits dropped off as I tried to eat it. I thought the size of the scoop was also quite small for the price.  I considered throwing it away and heading to Ed's scoop where the service is always impeccable.  Another time, I had their vegan cheesecake which was stale.  I will likely not come here again."}
{"text":"Another café in the Beaches?!  Yes, but it's a keeper!  For g-free folks, you will understand how I was severely disappointed when its predecessor Wild Earth Bakery and Café shut down because it was the only gluten-free and vegan bakery and café in the area.  Luckily, D'vine has quicky re-opened in its place and still serves several of the g-free and vegan treats. Yipee!  My favourites - peanut butter bars (g-free) and cheesecake bars (also g-free) and vegan breakfast bars are still served... and now they have gelato, too!  Withits allergen-sensitive offerings, the décor is much darker than most café's in this area (incl its predecessor) ... think: leather chairs and heavy wood furniture.  However, this place isn't so chic that it can't be kid-friendly and stroller-friendly and the service is friendly and prompt.  I'm a fan and will have to come back again for more offerings (like the gelato, soy lattés, etc) before fully committing to a 5-star rating.  Nevertheless, we need more of these places in TO so if you were a fan of Wild Earth before, come back, and if you're new to the 'hood, give them a try!!"}
{"text":"I was super excited to try this place, that we went all the way to the beaches for it. However, we left without trying anything after waiting for 30 minutes. Two of my biggest pet peeves when it comes to restaurants are a lack of website with a menu on it and the staff not knowing what's in the food they're selling and serving. Dvine was guilty of both. I asked the girl at the counter whether the gluten free bread was vegan, her response? \"i don't know, probably not\" wow. i asked her if she could check and she gave me a blank stare. After some pathetically apathetic discussion with the guy who was working there, they determined that they would call the bakery which supplies it and find out. I thanked them and then watched the girl go on to serve another customer and the guy potter around for a while. er...?? Finally after another five minutes I told them to give me the number and I would call myself. That seemed to remind them that they had said they would call so the guy went on the computer to find the number. So, let me get this straight...wild earth provides them with goods every day, and they don't know the company's number??? The guy surfs online for an additional  10 minutes then comes and tells me \"I tried calling them, but it turns out the number listed was our number so...\" So you don't know YOUR OWN NUMBER either??? and then they both just wander off!  wow. just wow. For a place that attempts to cater to those with food sensitivities and specifications, this place absolutely FAILS. talk about apathetic, terrible service and just plain stupidity. We ended up leaving without buying anything because i really wasn't interested in giving my money to such a place. I am surprised this geniuses make it to work on a daily basis without getting lost or walking into oncoming traffic."}
{"text":"Not so great reviews, well yeah. It is true that the place may have more potential than have been put to use. I visited only when my friend was working, so I think I am not the right person to give a truly honest review.  Anyway, but what I can say is that I loved their healthy gelato, as the variety was interesting and it really tasted good.   Have tried several of their vegan baked goods, which they bring in from another place, so these are not made on site, as the sandwiches and wraps. My favorite is the peaNOT  delight. It is so amazingly good and sweet. I love it, I love it.   Place looks nice, there are some things for children, TV if I remember correctly, but not feeling the vibe."}
{"text":"Despite a beautiful Elektra espresso machine and beans from Dark City (Cafe Feminino), my cappuccino was substandard, so I can only blame the likely reason, technique. I don't think coffee is a priority here.  My wife and I shared the Grilled Cheese sandwich, which was quite good."}
{"text":"I really wanted to like this place but unfortunately my experiences haven't been the best here.   This café has such a great location and accommodating feel to it that it's truly a shame that the coffee and food is sub-par. I tried a few different coffee based drinks and while none were disgusting  they were definitely not worth the money. I also tried a few of their sandwiches and pastries and was left with the same feeling of wasted money. To make matters worse there were a couple of visits where the service was so slow that I almost cancelled my order.   I tried the place enough times now and might give one more chance but am not too confident that the experience will be any different. An update will be able once I get the courage to visit it again!"}
{"text":"Two words: Breakfast Wrap  Early in the morning walking my dogs I stop by and get the spiced egg breakfast wrap and a cup of coffee.  It doesn't matter what the weather is like, the patio is nicely protected from the elements.  I don't bring my toys here, but ... for those that do, there's wifi here."}
