{"text":"I came here on a Thursday night and while it was quiet, the ambience was perfect for a night out. Korean music is played in the restaurant (not any specific genre) but the volume isn't overbearing.

We ordered a seafood pancake as well as bibimbap and spicy fried chicken. First came side dishes such as kimchi with guksu and a potato side dish.
Alongside, we had the bibimbap served on a hot pan with spicy pepper paste on the side. The rice was crispy and it ranks high on the bibimbap I've already eaten.
Next came the seafood pancake was which nicely presented and tasty. It also had great texture, which is probably the most botched thing about Korean pancakes.
Finally came the spicy fried chicken which was sweet but not too spicy, to the point where I would say children would also enjoy eating it. It was a very generous portion to the point where after our two previous, we had to take the leftovers home. 

Even though I reside on the south shore, this will now be my spot for Korean food!"}
{"text":"C'était un très bon souper que j'ai mangé, j'ai eu des pied de cochon et du ramen. C'est la première fois que je les ai mangés. Je veux y aller encore car la serveuse était gentille."}
{"text":"Dadam is so far the best Korean place I have ever been in Montreal. Everything is like what you will find in traditional Korean homes. 

Bibimbob came with a small soup with noodles (dont expect cheap dashi-based soup. This broth is very flavorful without overwhelming). 

Three side dishes were very impressive and these really take Dadam to the next level. Side dishes were kimchi (of course), pickled vegetables, and korean style egg rolls with vegetables and cheese in the middle (even I don't even put this much effort to make egg rolls at home).

As well we were served with two small salads with delicious salad dressing! I was so tempted to ask what their secrete recipe is.

Galbitang's broth was so rich and i could tell with the meat that this was cooked by hours and hours of boiling. So truly delicious we were very impressed. Bibimbob was so delicious and all ingredients were very fresh. Fried chicken was also very fresh and good with no yucky smell (i can tell when fried foods are fried with old yucky oil. This was definitely fried in fresh clean oil). 

Overall i am extremely satisfied with this experience. For sure going to come back and recommend this place to everyone."}
{"text":"Un petit restaurant koréen sympatique sur ce bout de la rue Dollard à Lasalle qui propose un choix surprenant de restos dits ethniques.
La salle attirante offre un décor simple où domine un grand tableau noir avec le  court menu en francais et en koréen. Nous avons choisi chacun un bibimbap, l'un au porc piquant, l'autre au boeuf et les deux plats étaient présentés dans des poèlons en fonte très chauds comme il se doit. Un plat réconfort délicieux.
En entrée on nous a apporté une petite salade, une soupe miso contenant qq nouilles et un petit assortiment de kimchi bien apprécié.
Tout ça pour 11$ !
On y retourne si on est dans le coin pour essayer les autres plats."}
{"text":"Not many good Korean restos in Montreal. Been looking for ones that have Toronto-level quality. I think I finally found one.

The portions are great, the food is very tasty. Definitely will go back again."}
