{"text":"This place is great. The staff, the food, the fresh roasted coffee selection and the atmosphere is all very inviting and always consistent. I live in Tramonto and once I found this place I haven't been anywhere else. I highly recommend this place, you'll definitely be back."}
{"text":"The food and coffee are awesome. Its a cozy little place with friendly staff."}
{"text":"I love this place!  Im a regular here and the staff is always friendly and knows how to make great coffee! Try the scones, they are delicious!"}
{"text":"I love to support local!!! This is a small coffee shop in the north phoenix area that you must try. It's all about supporting local and giving hard working people an opportunity to succeed. Their staff is sweet, friendly and kind to anyone who walks through the door. Enjoy a fresh cup of mojo, breakfast croissants or tasty wraps. Thank you for supporting local.. you wouldn't be disappointment."}
{"text":"First time going to Daisy Mountain Coffee Roasters and enjoyed to local atmosphere.  Great coffee and danish and we will definitely be going back to support this locally owned coffee shop..."}
{"text":"Great atmosphere and even better coffee! I was in for the first time the other day and will definitely be back. Best coffee in North Phoenix hands down!"}
{"text":"I ordered a sugar-free vanilla latte it was delicious. The customer service was great! The owner came over and chatted with us a bit, very sweet! I will be back for sure!"}
{"text":"I love this coffee shop. Their coffee drinks, smoothies, sandwiches/wraps, and pastries are all delicious, and their service is quick and friendly. They are always running specials and have a loyalty card program. Skip Starbucks and support the local owners of Daisy Mountain instead."}
{"text":"When they first opened up I appreciated buying their roasted coffee for home. The bulk roasted coffee quality is not the same since original owner left.  I have been coming here since the first week opened.  The current owner should know me but never acknowledges me and there are many times you step up to the counter and there is no acknowledgment even as a customer.  For example I come up to the counter; they look at me and then walk away to get something.  I understand you may be in the middle of something but how about an easy \"I will be right with you?\"   They can be really slow on service so expect to wait. Some are better than others. I want to love them (local owned, atmosphere, roast in-house) but as time goes by it is getting harder and harder."}
{"text":"I've tried to like this place for a couple of months now.....I just can't   I am a business owner myself and appreciate supporting small business.    I am particular about my coffee and refuse to drink Starbucks as I find it disgusting.   This place has good coffee, but BAD vibes   I am a regular routine kind of guy and have stopped by this place day after day for atleast a month.    I NEVER get a warm welcome, a smile, or a thank you or a , goodbye.   The girls / woman who work here are ALL less than friendly.   They come off as if you are inconveniencing them.   I can't describe it other than to say I don't feel like my business if valued AT ALL !   I am definitely done going here after today   Again, good coffee, cold environment"}
{"text":"Nice clean place has a variety of coffee to choose from always a paper to read highly recommend this place"}
{"text":"Creative coffee drinks like the Elvis Presley and the Al Pacino are my favorites here!"}
{"text":"I stop here every time on my way back to Prescott. I had the blended Mocha and a Peach Blueberry Scone. Both were terrific! The espresso is really good and I've tried almost all of the scones wth the Berry Scone being my favorite, but all of them are wonderful. The two employees were very pleasant and wished me safe travels, super sweet."}
{"text":"If you want a fabulous place to grab a coffee,  a meal and Wi-Fi,  this is the place! Great vibe,  yummy drinks and food and they roast their own beans right in the cafe! It's awesome!"}
{"text":"We stopped in here during our recent trip to Phoenix visiting family. Being from California, we are huge Peet's coffee fans and if your local to North County San Diego, Lofty Coffee (best coffee in SD) fans. We go out of our way to frequent either of them when we are looking to get our fix.   The two gals that were working on this Sunday morning were really sweet and thankfully, they just had a huge rush so we were the only ones in line. They took their time to tell us about their coffee and how they roast their organic coffee beans etc. It showed they really cared about their job and the art of making coffee. We really appreciated that and it was very cool to see.  My husband got a 2% latte and since I'm prego, I got a small skim decaf latte just to sip as I was slowly weaning myself off of coffee at the time. My husband absolutely loved his latte and because I was just sipping, he ended up taking mine too.He never does that because I always do skim milk and he says skim milk makes the coffee taste watered down so I was surprised.  Luckily I got a few sips in before it was stolen but we were not only happy with our drinks, we were thrilled with the service we received.  We've since told our Auntie and Uncle who live around the corner from this coffee shop to give this place a try--and they've come to love it too. They're still Starbucks loyalists but hopefully they'll see the light soon. ; )  When we're in town visiting family again, we will definitely be coming back."}
{"text":"Owner consistently monitoring progress of this newer venue. Fresh, well-made wraps and fair prices!!!"}
{"text":"Was in the area for a class and wanted to get something to eat that was on the healthier side. It was a cute little coffee shop. They have the create your own sandwich/wrap option which I love since I am a vegetarian. I was disappointed in the size of my sandwich since I did not get any meat. They didn't seem to add any more veggies than are put on a sandwich with meat. I do have to say that this is a common complaint of mine no matter where I go.  I pay the same price as I would if there was meat on the sandwich yet get a much smaller one because they don't think about adding just a few more vegetable. That being said the sandwich was good, many options to choose from as far as what to put on your sandwich. I would return if I was in the area again. I would just make sure to ask for more veggies! I would have given more stars had they gone above and beyond my past experience of most restaurants."}
{"text":"Went for the first time today and was pleasantly surprised! We got an iced mocha and a vanilla latte. Both were delicious with no bitterness. We also got the biggest blueberry scone I've ever seen and it was also excellent. I received very good customer service as well. We will be back! Highly recommend."}
{"text":"Food is good and love the ordering process. Employees are so nice! Love the organic choices. I think about going here everyday!"}
{"text":"Awesome, I came here after the disaster at the Anthem Starbucks. These guys are fast, clean, friendly and do it right, thank god there another alternative to Starbucks"}
{"text":"Great service, great atmosphere, creative menu with worldly coffee options! They were pretty busy and we ordered a bagel breakfast sandwich, latte, two frozen drinks and it was ready in no time!"}
{"text":"Good coffee, terrible service. They messed my drink up the first time, which was understandable since they were busy. I ordered an almond milk latte and that was clearly written on the cup. They gave me an Americano. When I asked them to remake it they reluctantly agreed but it was obvious that they weren't happy about it. They asked what I wanted and I said \"Exactly what is written on the cup, almond milk latte with cinnamon\". As they remade my drink I took a seat and could clearly hear the baristas talking about me and the situation. I personally don't think it was too much to ask to have my coffee remade when they messed it up. The second time, they didn't call my drink when it was ready so I sat there waiting for it when it was on the counter. The cup said \"latte with cinnamon\". Okay. I took a drink and they had used whole milk this time! I can't drink whole milk since I am lactose intolerant, so I brought myself to go in and ask for my money back.  They asked what the problem was and I explained the situation clearly. The barista said she \"didn't know what was written on the other cup\" when I gave the first drink back to her, and it was clearly written on the cup. I honestly just wanted what I paid for. I asked the girl at the register if I could have my money back and she offered several different times to make it for me again, and gave me a VERY dirty look when I declined stating that I would take my business elsewhere.  This is my fifth time or so to this coffee shop and I have enjoyed it every time, but I won't be returning. Their coffee is good but is not worth the bad service and long wait times to get the drink. Save yourself and go to Elevate in the norterra/happy valley area. The same quality coffee with much friendlier and attentive service."}
{"text":"Finally got to choose this place as it closes daily at 3pm.   Staff friendly Ambience pretty comfy.  Coffee made, very good  Coffee made was so good in fact I decided to buy a pound.  I asked for a pound of the same coffee I was served and was persuaded to buy another flavor.  OK I thought I will give that a try.    The girl weighed out a fresh bag of coffee and said hey I have given you a little extra as I know it wasn't your choice.  You couldn't get a single bean in that bag.   When I got it home the weighed bag with contents was just over 14 oz.  I think someone needs to have a lesson how many oz are in a pound.    Other than that I have been back, coffee is still good.  The service is slow but not as slow as the Starbucks next door."}
{"text":"Pastries are pretty good, but their iced coffee is terrible. Tastes more liked iced tea than iced coffee if I had to make a comparison, but I've had much better iced tea even. Hate to say it, I love local coffee shops, but I can't recommend their coffee. Hope their food is better!"}
{"text":"I love little privately owned, mom & pop coffee shops. But this one is EXTRA awesome! Why? 1) They roast their own coffee beans! That's rare. And it's delicious! They're not selling old coffee that was ground and shipped to them weeks earlier. 2) They serve food (sandwiches and wraps) that are made fresh there and taste so authentic and fresh. 3) The employees and the owner are super nice!"}
{"text":"Great people, great breakfast and they roast their own awesome coffee.  Leaves you wanting to come in for coffee everyday!"}
{"text":"Very nice atmosphere, friendly staff, dog friendly ( my dog got a water bowl,) lives up to the name of being a coffee shop."}
{"text":"Great coffee, great food, great atmosphere. Johnny and Renata make you feel special when you come in. Highly recommend."}
{"text":"This place is my go to for coffee, chai, etc instead of the big chain coffee place.  The drinks are high quality, creative & taste so good.  Everything I have tried so far is really good.  The place is really cute & staff is fast, friendly & hard working."}
{"text":"Bait and switch, hire and fire kind of company. Don't expect to keep a job if you get one at this location. Yet another business looking to undercut in every way possible. Decent place for a cup of coffee if you want to sell your soul."}
{"text":"My one and only coffee shop. Staff is SO SO SO nice and make my drink perfect. Love Daisy Mountain Roasters!  Update: Since my last review I am sad to say I no longer frequent this coffee shop.   All of the staff we loved one in particular (Lorien) are no longer here and it shows in the drink making.  Coffee is NOT good. Im sad because I loved this shop so much."}
{"text":"Great local coffee spot, superb coffee.  They have great selection of coffee and different varieties if decaf.  Always fast friendly  service. Doggy drinks as well.  Would definitely recommend for a quick get and go or sit and have a relaxing cup of Joe. We usually stop in our way home from our long bicycle ride on the weekends."}
{"text":"Coffee is pretty good - a little on the super sugary, sweet side for the iced mocha, but overall, I like it.   However, service is severally lacking for what seems to be, \"non-regulars\". On first arrival, we are blocked out of the entryway because some old man and his wife and conversing with a man and his dog. Fine, but please, get out of the doorway.  Then we are waiting in line, and the same man and his wife try to step in front of us even though we have been waiting in line. Really, really peculiar. I step in front and he kind of pops back in surprise as if I should have allowed him to get in front of me. And they talk about millennials having no manners... Yeesh.  We place our order which includes 1 French press and a bagel, among other things. All people in the line behind us get their drinks before us, and not until the line clears does the worker grab the beans for the French press and after we ask sort of \"what's taking so long\", she says \"oh we're busy\". I'm sorry, but we placed our orders before your favorite old man and woman came in and they received their orders before us. A French press has to sit for a few minutes, so an efficient worker would have started making it long before. On top of that, I hear people getting their bagels before us, and we still haven't gotten ours. What is going on? Such a strange, elistist, \"we will take care of you when we feel like it\" attitude in there. It was almost as if they were punishing us for ordering a French press because they had to walk themselves over to the beans to grab them off the shelf. Sorry?   I didn't even hear a \"sorry\" from the worker who was making the French press and taking ages to do so. Because I'm classy, I thank them for finally giving us the rest of our order, to which I receive a extremely fake \"your welcome\".   These people are not friendly - maybe unless you visit them every few days and become a regular. Got a real yucky vibe in there. Philz Coffee would blow this place out of the water a million times over not just with efficiency, quality, but beautiful customer service that seems to be lacking oh so much in business these days."}
{"text":"I came here because I had a gift card and was in the neighborhood. I liked the vibe of this neighborhood place and ordered a breakfast sandwich. I handed them a gift card but it did not go through on the computer. I was asked how much the card was for and I told the man I wasn't sure, maybe $25.  My tasty sandwich was delivered and the staff went on to try to figure out how I could use the gift card. When everything was worked out I was given a new gift card with a balance from the $25 on it. A honest business with good food in the neighborhood. I will be back."}
{"text":"The coffee and scones are awesome. Sometimes you have to wait a little long because the staff is chatting."}
{"text":"Terrible service. Been going here for over 6 months. Several experiences with rude/unfriendly/unprofessional staff led me to send a message over Facebook to the manager. Apologies were delivered and commitments were made to address the person---only to go in the next day and experience it all over again! Appears the owner \"cleaned house\"  this week (which seemed to be a good solution); however, he turned out to be less than \"accommodating\" to his long term customers (like myself). They made the wrong drink and instead of apologizing and correcting it, he argued for 5 min. about how it was my daughter's (12 y/o) fault for ordering the wrong drink and that making her a new ice tea costs him \"a lot of money.\" He then publicly humiliated us by vocalizing (as he made a poured a new tea) that this is a \"teaching lesson\" for his staff. He was sure to mention how he was doing us a favor too!  The only lesson he taught his staff was how to effectively lose valuable customers. Oh, and he taught me how powerful a negative review on Yelp can really be! And for that, thank u!!"}
{"text":"The coffee well let's just say a 10 out of 10 in this department. Staff are a thesaurus of info as it pertains to area and menu."}
{"text":"First time I tried their scones, and it was delicious.  I ordered a Carmel macchiato, which was a bit sweeter than I normally have it - will ask for less next time"}
{"text":"If the rumors are true and Starbucks is moving in across the street- they better get it together real quick. Sign says they open at 6am yet they don't have any coffee brewed or tea ready until 6:20am. Be prepared to wait for your drink...or you can go thru the drive thru at Starbucks (it's probably cheaper too!) Great coffee but so unorganized and lacks management and discipline!!"}
{"text":"DELICIOUS organic coffee! We are from the southeast valley and I wish we had a place like this near us! We will be back on all of our out of town trips!!!"}
{"text":"Daisy Mountain coffee roasters opened a new coffee house in the Tramonto marketplace and it is awesome!  It is locally owned and operated by a family that has a passion for coffee.  They use an in-house roaster which master roaster Al, the owner, uses to create different blends of coffee.  They are all great!    They also serve breakfast and lunch with plenty of good eats to choose from.  They also have teas, smoothies and other drink options as well.    It's a great new coffee house especially for the neighborhood area.  I hope to see you there someday soon."}
{"text":"For the price and offerings at this place, I do wish there could have been a bit more to it being a small business.  I'm all for small boutiquish coffee shops, but besides their own bean roasting, not sure everything is up to par.  Scoop: The place is quaint, it's comfy, but a bit lacking on the menu structure.  People look for two main things for drinks, tea and coffee, menu needs to be clear and distinctive.  The menu was spread out so wide on the massive wall it was hard to get our bearings.  Same with the food.  Our party got a few coffees, iced, there was a protein shake as some point, I got a french press Tanzanian dark roast, it was good, though had a bit of a chalky finish to the texture.  Massive miss: Our croissants were served \"warmed\", but not the right warmed... They were microwaved.  The minute I heard that microwave door shut, I dreaded to see thing.  Sure enough, what is meant to be a flaky, buttery, glorious pastry-sidekick to my french press coffee, was nothing but a floppy and dry \"thing\" that horrified the eyes and the tastebuds.  No need to complain, there is nothing that can be done, it was the way they chose to serve it. (a little toaster oven will do the trick!)  Overall:   The place roasts its own beans which is awesome, but everything else doesn't catch up to the marquee of that coffee shop.  Menu could use some condensing and cleaning up.  The help behind the bar didn't crack a smile for it not being very busy on a Tuesday morning.  They have a good thing to boast about with the bean roasting, but everything else needs work."}
{"text":"I like that they roast their own beans! Fresher coffee always tastes better! My husband and I have been trying to find more local places to get coffee! I got the Elvis and it was a little too sweet but still tasty. My husband got the Pachino and it was really good. Next time I'd like to try their regular coffee."}
{"text":"I don't even care for sweets and I am ABSOLUTELY ADDICTED to the Oatmeal Cookies. Americana is awesome too and the Baristas know what they are doing! Can I get a free extra punch for this review! LOL! I'm addicted to getting my punches too! NEVER got coffee so much in my life! Fair price, too!"}
{"text":"This is a nice place, with very friendly service and top quality coffee.  The owner takes real interest and pride in his blends and roasts, which are done right on site.  Everyone has always been super-friendly."}
{"text":"Such a cute coffee house! Free WiFi, delicious egg bowls for breakfast where you get to pick your own toppings, great coffee, with various sweets for dessert. We picked a chocolate scone for dessert, sat down and ate our bowls and the place got busy. They forgot to give us our scone, so after the rush we went up and asked for the scone and they gave us an additional one for free! Staff is super friendly. Really enjoyed and would recommend."}
{"text":"LOVE this place! Great drink and seriously if you guys do not try their breakfast sandwiches you are MISSING OUT! My husband and I are addicted. Must try!!"}
{"text":"THIS is the place to buy your coffee beans. The owners roast their own beans - organic - in the shop. They have a big selection of roasts and blends to choose from and they can grind the beans for you in-store if you wish. Their lattes are superb and the Al Pacino blended drink is over the top tasty. They also make a pretty good dirty chai - not too spicy. I like to support small business and this is a welcome coffee oasis in a vast Starbucks desert.  While they lack a drive-through, you can speed up your visit by using the cash coffee bar for a quick hot coffee. If you want to order, lines can get long but the baristas are quick. They have a menu of baked goods, breakfast items, lunch items and non-coffee type drinks like boba tea (aka Bubble Tea) and smoothies. There are a few gluten free options and vegetarian ones as well.   I'd make the drive here, rather than a nearby Starbucks, any day of the week."}
{"text":"Finally, a coffee that doesn't taste acidic and burnt (aka Starbucks). Johnny made me a wet cappuccino (apparently a \"dry\" one is pretty much all foam). Nice creamy foam. Tasty coffee. No acidic, burnt flavor. So glad to have an option to Starbucks! Daisy Mountain has breakfast and light lunch items as well. A great stop before heading north."}
{"text":"I've been going there now for a couple of years. Awesome coffee! Great pastries and scones, but my absolute favorite is one of their bagels with their veggie cream cheese."}
{"text":"Although the drinks are nice, the help is pathetic.  I asked for an Al pacino only to find the old recipe (9 mos ago) is no longer the same number of shots.  I then asked why there was no chocolate around the cup, \"oh we do that sometimes, but didnt know what you wanted\" ...seriouslY?  Lastly I said no problem, what's your name, he says NONE OF YOUR business....really?  The new owner needs to get a fucking clue.  your help knowing when they're wrong just made it the worst situation.  As a top reviewer, I will make it my mission to expose everything about a business, and this type of stupidity, by a 20 something kid that had no interest in being honest was enough to get me to flip him off...his attitude was the worst I've dealt with in years and although I know better, I expect better.  Lastly, he hollers at me, I served you after we're closed...yet the sign said open, and the door was wide open...really?  What a worthless waste of 20something space...get a clue kid, if the door is open you own it...don't be a douchebag.  Do NOT waste your time here, the new owner has no flippin clue what his staff is doing and as a result, you're drop in business is due to that...best wishes, looking forward to the next business to take it's place.  BTW, I lived in Seattle 19 yrs...I know coffee...not faux coffee...seriously, if you can see through the pissed off rant, you'll know you're better off going up one more exit to Starbucks."}
{"text":"I was passing through Phoenix on my way back to Albuquerque and coffee was a necessity.  This was not the best latte ever, but it was good enough and not too far out of the way.  The place was really hot, though...not sure why they didn't have their air conditioner on.  I also got a breakfast burrito wrap thingy and found it also to be acceptable, but did not like the pickled jalapeños.  I was really hoping they would be fresh."}
{"text":"Service was good but coffee not so great. I ordered a tall almond milk latte and it tastes like burnt coffee. Kind of a bummer :-/   I had high hopes. Not worth the drive or $4."}
{"text":"Cute place and a great atmosphere!  I got an iced Rolo (a mocha with caramel).  It was super tasty.  The employee that helped us was very friendly.   Definitely will be back!"}
{"text":"I LOVE this place!!! The coffee and espresso are delicious and organic! The staff is super friendly and I'm always greeted with a smile. I'm obsessed with the breakfast bowls and sandwiches. I just wished you were open late!!"}
{"text":"This place is so so. For a coffee house, they need to start doing fun designs on coffees and the hot chocolate should have better flavor. The beans were good.  It has potential."}
{"text":"So glad that Daisy Mountain Coffee came to  town. The staff is always awesome, and the coffee is delicious. :-)"}
{"text":"Best coffee shop in all of Arizona. I seriously love them. Their coffee and espresso is delicious, the staff is beyond nice and the overall feel of the place is so welcoming and casual. No rushing and feeling like you're in the way of 20 other people waiting for their coffee and the staff really take a second to just talk to you while you wait, like normal human beings. It's nice and cozy inside with tables and a couch, if you're a Friends fan then you'll feel like it's your own little Central Perk!"}
{"text":"Best. Coffee. Ever. Cannot say enough about this great place. Great coffee, friendly staff, yummy breakfast items. Almost makes me wish I lived here! For sure will hit it every visit to Phoenix."}
{"text":"Wanted to try a new coffee joint. Wasn't sure what to order so did a iced vanilla latte. Figured that was safe bet. Mentioned it was my first time here and then the guy was so welcoming and asked if I lived in the area. Believe I got an extra punch too. Woo hoo! Coffee was great think I was pretty jazzed up for the day. Yay! Excited to see what the food is all about soon."}
{"text":"Amazing coffee! Better than Starbucks in my opinion. Friendly staff and comfortable environment. Highly recommend for any avid coffee lover !"}
{"text":"Awesome coffee... Horrible service. The batista was super nice to the guy behind us 3 weeks ago and didn't seem to want to have anything to do with us. When I asked about alternative milks she got testy and didn't seem to want to answer my questions."}
{"text":"Best cold brewed coffee I've ever had and the turkey club was unbelievably delicious. I had a great conversation with the owner who is a pleasure to talk to and displays excellent customer service! I will be telling my friends about my experience and I will be retuning for another cold brew soon!"}
{"text":"Saturday morning around 7:30.  I travel full time and have been to hundreds of espresso shops. I go every Saturday to a new place.   The good: 1.  Two employees. One was very nice and pleasant. The other seemed to not want to work there. Not mean or rude, just unhappy. 2. Good menu with a decent amount of choices.  3. Nice interior. 4. Wife's americano was good and her scone was fine.  5. Easy parking.   The not so good: 1.  I asked for a regular latte extra hot along with an espresso brownie.   Latte was only luke warm (about 110 degrees-I asked for 160). It also was very weak with espresso flavor. It was like tepid dirty milk and had absolutely no foam of any kind. It looked like drip coffee with cream. I then watched the barista make the next pitcher of steamed milk and found out why my drink was so poor. She put a pitcher of milk on the shelf of the espresso machine, put the steam tip in, opened the steam valve letting the pitcher sit there the whole time it was heating and never picked up with pitcher to aerate the milk with micro foam. It might be a matter of training or just not caring. I wouldn't know for sure.   2. The brownie was cooked in a cupcake paper wrapper. It tore off in many small pieces because it seemed day old or more.  3. Right away I asked them to reheat the latte.  She told me to set it on the counter and they would heat it up. My wife finished her drink and scone in about 20 minutes. I never got my drink reheated nor did they ever check with me again to let me know why it was taking so long. So I just left frustrated without getting what I paid for."}
{"text":"I come here almost every weekend with my family.  The staff used to be friendlier and the service level has been in steady decline the last few months.  Is the coffee good?  Yes. Is the food good?  Yes.  But if you want to feel like a valued customer, consider going elsewhere."}
{"text":"Nice neighborhood place.  Great breakfast bagels and delicious sandwiches.  We like to grab a few sandwiches on our way out of town."}
{"text":"The coffee is ok, nothing too special or memorable. If anything, the coffee is too sweet. The scone I had was a bit dry. The prices are more than you'd expect for the food, but the coffee is reasonable. It's a nice, quiet place though and I appreciate the display of coffee beans. Unfortunately, I'd rather get coffee next door from the Starbucks at Albertsons or drive to Dutch Bros. I would love to see improvements/changes in the future!"}
{"text":"Stopped for coffee before heading out of town. House blend was really tasteful. I got the sandwich as well that was perfect. Sandwich made to order."}
{"text":"Updating my review but still 3 stars. This place is good. Go on Tuesday's for double-punch on your frequent guest card. I wish they would include some gluten-free options on their menu, sadly they have none.  They also close awkwardly early during the week, 3 p.m."}
{"text":"Tried it on my way to work and glad I did.  Great, modern and chill environment.  Pastries scones were HUGE and looked delish.  Next time I will get one, but had already eaten so I didn't get one this go around. I ordered the Caramel Al Pacino and am seriously hooked! I will definitely be back on Monday and afterwards.  2 thumbs up!!!!"}
{"text":"went w/ a girlfriend this morning.  we only ordered coffee-maybe that was why (self-serve) we weren't really talked to except to tell us the price of our drinks.  It's a cute place."}
{"text":"If this place was open later, it would be the perfect coffee house. You really can't go wrong with this place. The baked goods are great, the breakfast sandwiches are awesome, and the coffee is delicious."}
{"text":"I wanted to love it. Third time here and likely my last. It took over 20 minutes only to give me the wrong order (I ordered iced latte and was given hot after attempting to charge me for a large when I ordered a medium.  Sorry, but you will have to do better. Wait times are long and have witnessed food preparers sneezing into their hands and not washing, prep without gloves, running fingers through their hair.  I would NOT recommend this place. I will go back to SBUX.  Note to owner:  Your indifference is evident in your lack of responses to both negative and positive reviews."}
{"text":"This review is mainly for the coffee. The coffee is some of the best in North Phoenix. I always buy a pound when I'm out grabbing my weekend coffee. Always fresh roasted, always good quality. I usually stick to an Americano or black coffee, but I would definitely recommend trying the Bob Marley if you like those sweet fancy drinks. It's a chai tea latte with banana and coconut (make it dirty with a shot of espresso)."}
{"text":"Best coffee in the valley! I'm picky being from the PNW and was so happy to have found this place. They know their coffee.  Everyone is so friendly here and they actually remember me at both locations. I highly recommend this place."}
{"text":"I usually get the jalapeni (BLT bagel with jalapeños). The bagel sandwiches are good but their service is sooo slow."}
