{"text":"I took advantage of a DealFind voucher but when I called the restaurant, they said they could not honour the voucher and to contact DealFind for a refund.

What's going on?!?"}
{"text":"I sympathize with the other reviewers as i had a similar or worse experience today at this horrible place. I should have checked this page before going there. Anyway, i present the voucher and 5 min later the manager comes up to me and i could barely undeetand what he was saying as his english was like 1/10 but this is what i got from it.. They dont accept those vouchers anymore because of some dilemma they have with dealfind and they overbooked reservations or something. Should NOT be the customers concern. Anyway, just like the other reviewer said, they told me to go on the website and get a refund. DESPITE the hard time they gave us, we were hungry and decided to order anyway.. The weitress (whom may i add was either on a hard dose of methane or just really stoned, and also did not speak english nor could comprehend the menu at the restaurant where she works) had to come back 3 times and have me repeat my order because she couldnt be bothered to write it down the frst time...NOR the second or third.. It wasnt even as if we were ordering so much, only 3 damn items!! But she didnt even have a pen and a pad to begin with. On top of all that, when we came in and waited for a while for someone to seat us, no one did despite the fact that the restaurant was empty in the midst of a mid afternoon, we ended up seating ourselves. Yes i know there were red flags all around but cognitive dissonance prevented us from leaving until we were just literally fed up!!! And we never just up and leave.. Oh and when i asked about those complimentary apetizer plates, she didnt know what i was talking about. This place is hands down shit and i wouldnt recommed it to my worst enemy on earth. What a waste of time. Btw, i dont usually write reviews so you know this lengthy review is the outcome of severe devastation. Im also typing on my ipad which isnt as easy as on a regular keyboard. Anywho, the first red flag was the fact that all tables were EMPTY.. But its definately no surprise !!!!! The weitress herself told us this is not the first incident where people leave hungry and frustrated. Gee u think? I dont know how this place is still holding up quite honestly, but i can see it closing down very soon. I ended up writing to dealfind immediately, basically stating my frustration and demanding a freakin refund. STAY AWAY!!!!!!"}
{"text":"Went there about a year ago for lunch 12-1 and found the virtually place empty. We were competently served large quantities (for the dollar)  of very bland food. Pass"}
