{"text":"My first night in Montreal and this is one of the few late night food spots we could find. The food was decent but, the pricing was a little outrageous.  Buyer beware please be prepared with Canadian currency the will just create a price for you to pay.  As I am now on my second day here I realized that I was scammed out of an extra $5! Is living that hard that we need to rip off visiting out of towners? Im giving one star because the food was decent everything else was highly disappointing."}
{"text":"Very good fast-food pizza. Yes it's pre made and sitting under heat lamps but it's all fresh, very high turnover rate. The two guys there are very nice also. One time when I went I was going to get the all dressed but there were only two slices left. Guy told me to wait a minute cause he was bout to take a fresh one out and give me that instead."}
{"text":"Look, you don't come here for frills. It's basic pizza by the slice. But it's also cheap, big, and tastes surprisingly good - there's no grease dripping off your hands or questionable toppings. And a few days a week, they'll even scoop a handful of fries on top in case you need that extra calorie boost.   Cheap, good pizza. What's not to like?"}
{"text":"It's nearing 4am and I'm drunk and hungry. Well imagine my delight when the lights to this quaint little pizza shop were glowing when returning to our hotel next door. We crushed a few slices of various types of pizza. There was nothing really remarkable about the pizza, but it was reasonably tasty for a reasonable price.  A solid 3 star slice, and even at this ridiculous hour it was actually the namesake of the store, Dany, working the til. A kudos to that kind of commitment to serving the za. This place is indeed, A-OK."}
{"text":"On thing you do not go at this location of Chez Dany is challenge the owner by having your friend rant about having the best pizza down the road - next thing you know the owner is cooking you up a special olive oil garlic spinach and mozzerella pizza and it's 3am.   I will note the pizza is so worth it.   Opening in the afternoon until late, this place offers up pizza, hot dogs, poutine (with baked fries instead of deep dried chips), and baclava to die for.   Oh yes, the owner doesn't seem to mind when you drunkenly walk in demanding poutine at 3:30am.  In terms of late night food you can get any better in terms of food quality and friendly service."}
{"text":"This place is not at the location listed on this website.  It is now one block away.  The current location does not have any seating.  Take away only.  It looks like they are selling pre cooked slices to go and the pre cooked pizza did not look very good.  Based on how the pizza looked and our unwillingness to sit on the curb we passed on this place."}
