{"text":"Came here with some friends for poutine week and they were over the moon over all the beer options (including a non-alcoholic one). A few large screen TVs (which were only showing the bar's logo instead of a game or show) and large picnic style benches and tables. Sharing tables with strangers gives me anxiety but this bar could be a good group place to relax and possibly make some new friends. Since I'm shy about that type of thing, this would not be a go-to place for me. 

Not a fan of the poutine though. I usually love shoestring fries, but everything about the poutine tasted like generic bar food and is really only tolerable when you're drunk already."}
{"text":"I love this pub. The atmosphere and the theme make it a really fun experience. The seating is well arranged so that it is not crowded. The large tables and long benches are very comfortable. They have fuse ball and enough televisions for enjoying a game. The menu is simple and delectable, not too many options but something for everyone. They have vegetarian options. The beer is good and very reasonable priced. They even offer non-alcoholic options. I had a great time there and I cannot wait to go back."}
{"text":"J'ai été rejoindre des amis là-bas après que ma soirée ait déjà commencer il y a quelques heures....Je ne m'attendais à rien...

Et je rentre...les gens sont dans une ambiance de feux!! Des mega longue table à la style \"Octoberfest\" pour accueillir une grosse gang qui veut célébrer. Les filles sont aussi habillé avec un costume d'Octoberfest et on peut commander des MÉGA GIGA PICHET DE BIÈRE...pour une personne :o De ce que je me souviens ils avaient une belle sélection de bière et pas trop dispendieux. J'étais au bar, je parlais aux inconnus les inconnus me parlaient, et tournée de shooter pour tout le monde!! Bref, une clientèle super sociale. 

Côté musique, tu sais le genre de chanson que tout le monde connais et aime chanter fort quand tu as bu un peu trop, c'était ça :) Et très diversifié. Il y a un groupe de girl qui a commencé à danser une danse en ligne et je me suis jointe à eux...Bref, pas super ma danse, mais j'ai eu beaucoup de fun avec ses girls. 

Je vais certainement y retourner en sobriété, voir si l'ambiance est toujours comme ça ou c'est le fait que j'étais pompette...à suivre..."}
{"text":"Was there last week around 10:30PM. There was no food left so I decided to try some cocktails. The Boom Boom Becker sounded good, with Appleton Bacardi, mango puree, citrus juice and ginger beer, so I decided to try it. Bad decision. The ginger taste combined with Bacardi was not pleasant. At all. I barely took a few sips and couldn't continue. My friends tasted it and all couldn't stand it except one. However, the waitress was very nice to offer to give me another cocktail free of charge. I tried the Jagerlicious with Jagermeister, Peachschnapps, cranberry syrup, cranberry juice and soda. It was a lot better, not as sweet as I could've expected a cranberry drink to taste, but at least drinkable. 

Though I tried my friends' beers and it was actually really good. And really cheap too. They come in 1L pint just like in Germany. And I loved the long picnic tables. Great way to socialize (although the music was a bit too loud for that).

Bottom line, don't take cocktails. Do try the beer. Very nice staff. Would recommend if you're a fan of beer."}
{"text":"Je suis allée au Das Bier avec des amis pour une petite soirée, qui s'est finalement avérée bien arrosée. Le prix de la bière est vraiment encourageant et le choix fait changement des autres places à Montréal. La bouffe est bonne mais je m'attendais peut-être un peu plus à goûter l'Allemagne dans les plats \"traditionnels\"."}
{"text":"Un de mes bar préférés, tant pour un petit 5@7 que pour les événements sportifs. Le staff est toujours aimable."}
{"text":"Je suis venue 2 fois à cet endroit et je croyais que cet endroit serait bien pour regarder un match de l'équipe nationale allemande, mais j'ai été extrêmement déçu. Je ne reviendrai plus: le choix de bières n'était pas très bon (beaucoup n'était plus disponibles) et cet endroit semble être prisée surtout par les français..."}
{"text":"C'est un super endroit!

Le concept est cool, la bière n'est pas chère (9$ pour 1L!!). Il y a une bonne sélection de bières allemandes. La bouffe est bonne! C'est surtout un endroit parfait pour un grand groupe à cause des longues tables en bois. 

L'ambiance est géniale avec les lumières tamisées. Le service est un peu lent, mais ils sont vraiment gentils et souriants, incluant le gérant. 

J'y retourne assurérement!"}
{"text":"I was here this weekend and must say I'll be back.  This is the first bar in Montreal that I've seen with such a good selection of German beers on Tap.  The beers are sold by  the Pint or Litre, and the menu is not overly complicated.  Our group had a selection of the food as well, and it was pretty good, but the draw is really the beer.

The staff are dressed in the type of clothes you'd expect to find in a German beer garden, so that definitely adds to the fun atmosphere.  Most of the tables are long picnic style tables, so be ready to make some new friends.

Looking forward to going back soon."}
{"text":"Nice spot. I spent an excellent afternoon watching the Euro game this past weekend. Bar was crowded, but service was great. Excellent bier on tap, including some for as low as $10/litre. Owner was friendly, cleared space for our big group, and gave us some recommendations of other places to visit in town. I could use a Bitburger right now."}
{"text":"Sie wollen ein Bier? L'Allemagne à Montréal via Das Bier, style allemand classique, large tables, parfait pour gros groupes, nouvellement rénové (ancienne Boîte à Marius),  staff habillé typiquement, choix de pintes ou de gros mugs d'un litre, large choix de bières importées ou locales, menu bouffe; currywurst, pretzel, frites. Bon service du personnel. Bon prix. Prost!

4/5 visité en août 2015."}
{"text":"I have visited this place twice before, always with the Montreal Beer Runners. This is such a fun place. They offer arrange events like a week of beer games for Octoberfest. The staff is super nice, the atmosphere is cool and if you come with a group of friends you will have a blast. The bar is made of very long tables (perfect for groups) so I would not come there alone or as a couple but as a group and satisfaction is guaranteed.

About the food, not a lot of Veg options (even the fries is cooked in duck fat) but you do have Ved-dog (7$, ok not great) or nachos (nice portion). If you eat meat..well great beer food selection for you."}
