{"text":"This is the best pizza in the Charlotte area. Judging by the crowd, it appears that a lot of folks agree with me."}
{"text":"OMG!! Best chicken and steak Philly! The pizza is also fantastic yet a bit pricey if your accustomed to chains. I prefer my pizza made to order so I order an entire pizza, not a slice. The kids don't mind though."}
{"text":"Customer service was semi-friendly. 
Pizza slices were huge, and filled with lots of pepperoni (major plus!!) HOWEVER.... It was super super greasy. Literally had to soak about 20 napkins in the grease to be able to eat a slice. The pizza sauce tasted like something from the grocery store, or maybe Pizza Hut (not homemade). The cheese was rubbery, but there was a lot of it - so that's a silver lining right? 

I wasn't very impressed, especially considering the great reviews. I expected more. I've had better pizza in Charlotte for cheaper."}
{"text":"As a kid I used to believe in pizza alot more than I do now. Maybe cause I had really good pizza as a kid (although I did used to actually like cici's lol) but I kinda figured that I just lost the taste for it. Heck I even went to New York and couldn't bring back that love for a good pie. Davinci's pizza has made me believe in pizza again. I haven't tasted pizza this slamming in a long time, maybe even ever. 5 stars no doubt, get your booty down to Davinci's"}
{"text":"when you go to a restaurant and spend 80 bucks of your hard earned cash and you ask for a cup of water and they do not give it to you. it happened to me. well that shows what kind of people you are dealing with there pizza is salty and there sauce is thin they are trying really hard to be like NYC pizza but do not cut the mustard.and there service is awful take the family somewhere else steer away from this place."}
{"text":"Definitely some of the best NY style pizza in Charlotte. Freakin' amazing!"}
{"text":"Grabbed two pep slices while on lunch. They were thin NY style and were very tasty. I went in to this restaurant hoping to get a couple Sicilian Slices knowing they make Sicilian pies but they do not have Sicilian Slices. Too bad. Would be five stars if they did have Sicilian Slices during lunch time (11:00-1:00 maybe)"}
{"text":"Every time that I have gotten something from here, it's a surprise.  We've been ordering for over the past three years as part of our Friday \"let somebody else cook\" routine.  This place was awesome at first but has absolutely no consistency.  The chicken wings are dreadful.  The subs are okay, but the 'Philly' ......... don't waste the money.  I think that this last pizza was the last time I will order from them.  It's sad, because they actually cook the pizza in a actual OVEN - like in old school Buffalo NY.  Sorry guys, we have given you a long try, but it is time to move on."}
{"text":"My favorite pizza place in Charlotte. The pizza is NY style, and the sizes are huge! You order a large, and you get a huge friggen' pizza. The staff is friendly. Even typing about this place makes me crave their food... mmmm...."}
{"text":"My office usually orders Davinci's for group lunches. The pizza that is delivered is always good and filling.  I decided to try them out on my own one day last week and I was highly disappointed. First, the brunette cashier acted as if she was miserable and hated her job. Very blah attitude , she didn't smile at all. Second, my food was TRASH. It was bland and seemed like it came out of a frozen dinner. Lets just say , I will never it this TRASH again!!"}
{"text":"delicious pizza & baked ziti & friendly staff- best pizza I've had in Charlotte! They are always fast too. We frequent this place!!"}
{"text":"Not much to say, it's pretty good NY style pizza.  The slices aren't as outrageously big as Tonys so one of those and a garden salad is a pretty good dinner.  The garlic bread is a bit odd though, pretty much a toasted sub roll."}
{"text":"This pizza is probably the closest thing to NY pizza in North Carolina. The pie is large and in charge and THEY HAVE SICILIAN!! The staff is on the rude side, but always busy so I can understand. The best part is how affordable it is! $14.15 for a large!?!?!? I adore Davinci's"}
{"text":"I have been eating here since they opened up in Davis Lake- I LOVE their stromboli and ham calzones- under $6 for these tasty creations!  I don't quite get the devotion some have with NY style pizza- again being a Deep South girl I don't like to fold my pizza as I would a piece of bread- but their pizza is very good especially considering the thinness and I guess we all love what we are accustomed to.  Their cheese tastes REALLY good on their slices and the slices are HUGE with plenty of pepperoni on them!  Me and the mister were happy to see them open up another location in the UC as it saves us gas in getting to them.  We probably eat here at least 3 times a month and the new location is AWESOME though they are about $.50 or more more expensive here than in Davis Lake on the prices.

The medium pizza is more than enough for two people and the mister usually gets the cheese steak or sometimes the lasagna or ziti.  The pasta isn't out of this world, but for the price it certainly is good.  I like their garlic bread that comes with the pasta items- about an 8 inch hoagie loaf split open and buttered and garliced up before entering the oven.  Their pizza by the slice lunch deals are pretty good and the managers are very friendly.  Give 'em a try cause you can't go wrong."}
{"text":"they serve apizza not pizza. if you know what apizza is and that is what you want, you won;t be disappointed.  

tried several menu items and just stick to the apizza now.  always eat in, never tried their delivery.

staff doesn't seem to connect to regular customers. by the slice apizza can be hit or miss at any time of the day, but whole pies are fully prepared to order and have always been outstanding."}
{"text":"There are many excellent pizzerias in Charlotte, but this one is my favorite! They use fresh ingredients and their dough has an excellent consistency.  They also make excellent cheese steaks."}
{"text":"Pizza was ready on time, was not over/undercooked, wings were nice and crispy but not even remotely spicy. I have been all over the east coast and have had everything from Ny pizza in the Bronx, Greek pizza in Ct., Armenian pizza in Boston, Sicilian pizza in Florida, and everything in between, and one thing I can tell you is that this is NOT good pizza. It is not bad but it is surely not good, it is nothing special, basic pizza is ok when the ingredients are nice and fresh, our pizza had caned olives and mushrooms(or they had been out for two long), plain sauce, and grocery store prepperoni on a thin chewy crust. We just moved to the area and normally my wife makes pizza at home, but after reading the reviews and a really long day we decided to try something new, we will not be ordering from there again. There is nothing special there you would be better off moving on."}
{"text":"Couldn't agree more.  Some of the best Za I've had in Charlotte.  I always get 2 slices of sausage mushroom.  Killer."}
{"text":"This review is about:
- pizza by the slice combos (cheese and pepperoni)
- lasagna
- pizza made to order

I love their pizzas when they are just out of the oven so I recommend to go with friends, colleagues or family and get a whole pie. Their smallest (16\") is enough for three people. I sometimes go with a colleague and we can never finish the smallest pie just between the two of us, which isn't too bad either because the leftovers will freeze beautifully. 

Their pizza by the slice is also very good but they reheat it in the oven and sometimes it is not awesome but just very good. You may keep that in mind and ask them not to reheat it for too long. 

As for the lasagna, my advice (surprisingly) is not to get it, because it isn't worth it. It is also too large a meal since it comes with a salad and garlic knots."}
{"text":"Very good food, including great pizza!   Which is what you want in a restaurant.    The place is clean and well kept.    Their customer service could use improving, the person behind the counter acted if they were at the end of a 16 hour shift.   

My only real complaint is they don't have a location in Cornelius."}
{"text":"Nice big slices of pizza. I got the 2 cheese combo and 1 pep. Pretty good, will be coming back to try new things. Have been looking for pizza like this for the longest. Only downfall is that it is pretty greasy on the top."}
{"text":"I was so excited to try this place after reading the great reviews and it was a cheat day for me. I was greatly disappointed. I ordered garlic knots and a stromboli. The knots were hard and did not have any taste felt as if i was eating regular bread rolls. The stromboli was soggy, greasy and fell apart when I picked it up. I felt as if it was not cooked all the way. This place did not live up to the hype and not worth the calories. I will not return."}
{"text":"Having tried many pizza places in the area I can say this is the best cheese pizza in the area. The cheese and sauce make a great combo here, unlike some other places the sauce here tastes sweet which adds to the greatness of it. The pizza slices are huge and well worth the money. One improvement they can make is the crust, it is slightly chewy and sometimes the bottom can be burnt. But overall a solid 4 star place for great authentic pizza with sizes that will last for the next day."}
{"text":"Best pizza in Charlotte, by far.  Perfect thin crust with delicious sauce and just the right amount of cheese. 2 slices and a drink for less than $6.00!  Can't beat it for a good, quick, cheap lunch."}
{"text":"Awesome hole in the wall find!  Everything we tried was awesome. 

PIZZA is thin and crispy, but the dough has some chew after the initial crunch - exactly how I like it!  We tried cheese with banana  peppers and meatball/pepperoni/onions. When we return, we will probably stick with plain cheese. The only negative to our entire meal was that the onions were placed raw on top of the pepperoni/meatball slice. Those really should have been put on the slice prior to heating up in the oven. 

EGGPLANT PARMIGIANA Hot Sub: The eggplant slices were a bit thick for my liking, but overall the sandwich was delicious. Great bread! The hot sub ordinarily comes with fried eggplant, cheese and marinara only. However, I ordered it with lettuce tomato and mayonnaise on top, and it was perfect! 

CANNOLI: one of the best I've ever had. The cannoli shell is made in-house and it has a subtle cinnamon flavor that makes it unique. It's super crispy, and a perfect base for the not-overly-sweet cream filling. 

SERVICE: the young girl working the register is a perfect representative for this business. She was helpful and patient when I asked questions about the menu. She provided plenty of information which helped me make my decisions. And she jokingly told me bye and that she'd see me tomorrow. Makes me want to go back tomorrow. :)
The guy behind the counter slinging the dough seems legit. There were a steady stream of customers the entire hour we were there, but the guys in the back were friendly and unruffled. 

EATING IN:  nothing fancy here, just 10 or so booths, fluorescent lighting and a soda machine.

This is a great place in the north Charlotte area. If you're around the mall, don't waste time at the food court; take a short drive to DaVinci's instead. You won't be disappointed."}
{"text":"This is the local pizza spot for the Davis Lake area and I adore it's big, sloppy, pepperoni pizzas . . . Folding the mega-sized slices in half and chowing down is a family tradition and we look forward to \"pizza night\" with tasty (and friendly) providers like this in town."}
{"text":"Great food! Just sad I didn't try it earlier being that it's so close to my house. Def recommend."}
{"text":"I'll say if you want a fast meal that better than from a fast food chain, this is your spot.  I have only ever ordered pizza by the slice, and if you get cheese or pepperoni, its great, but if you add toppings, they just lay them on top of the cheese/pepperoni pizza, no additional cheese to hold it on there, so your toppings fall off.  But still tastes really good.  Lots of add-ons available as well like parm cheese, crushed red pepper, seasonings, etc.

The service on the other hand, leaves much to be desired.  Phone service and in person, they act like you're bothering them by being there.  The convenience and the good pizza keeps me coming back anyway though.  The dine-in atmosphere isn't all that great either, lots of people walking around you the whole time."}
{"text":"The pizza is good. However, every time I try to put in an order for delivery, \"we are not delivering tonight\". Wtf! Sooo pissed off. This is the at least the 3 rd time this has happened!"}
{"text":"Have only had others bring me takeout, but have always enjoyed it.  One of the more legit NY style places in Charlotte.

We had some problems tonight ordering.  They gave our pizza to someone else.  Also, the crust came out a little burnt.  But, other than that, its always a pretty solid pizza experience.

Its legit NY-style pizza.  What else can I say.  HUGE.  Canned mushrooms, so maybe go easy or not at all on them.  All other ingredients though, I would recommend.  Try it, you won't be disappointed."}
{"text":"Stealth business. Run like it's in the witness protection program but has really good pizza

I found this place on Yelp and was intrigued by the idea of getting some real New York-style pizza during a trip to Charlotte. 

When I dug a little deeper to try to find a website with a menu, or any other sign this business actually existed, I came up almost empty. At one point I thought \"I have it\" but then noticed the web site I found listed 4 locations -- in Fresno!

I finally just called the place using the number in Yelp and somewhat to my surprise, they actually existed. I ordered a \"small\" pizza and set out in my car to pick it up. 

As previously described, the \"small\" pizza would feed a \"small\" mob. I mentioned to the manager that I had a hard time finding the place on the web, and he replied \"yeah - someday the owner might put up a web site...\"

He also told me that they had another location next to the WalMart on North Tryon Street, which was literally 6 blocks from where I started out. 

In any case, the pizza was: huge, tasty and with a true New York style crust. Excellent!
Worth the hassle, but it sure could have been easier."}
{"text":"It's always great to be transported back to my hometown of Brooklyn, NY. That's what happens when I taste this delicious pizza. I have a select few places for pizza, and this joint is definitely among them. Great spot to get some really good pizza...NY style!"}
{"text":"So I order a spinach and tomato pizza just for the toppings to be thrown on top of the cheese pizza not cooked with it. I went to asked the young lady in front are the the toppings not cooked with the pizza just thrown on top well I stood there for a minute or two because she was on her phone I wanted to see how long until she notice me the guy making the pizza asked can I help you before she did. Will not be back"}
{"text":"I am dying for zeppoles . Its the Brooklyn in me that wants it like NYC. I think this Davincis is better than the one on University.  The crust is thinner and more nyc like. I declare the lack of oil goodness dripping down your arm is a must and you won't get that. But it's a good pizza and I will be back. The zeppoles would be a nice addition."}
{"text":"Ordered a large pie with cheese and I was surprised how great the pizza taste. Similar to NY style pizza that Im having a hard time finding here in Charlotte, however this place is equally great. Fast friendly pick up without a wait."}
{"text":"Delicious Pizza as big as a small child? What can really go wrong? 

Great, unique flavor, cheap and casual dinning: fantastic!"}
{"text":"Best pizza in Charlotte and the price is great considering the huge sizes they have."}
{"text":"Update: best pizza I've had in Charlotte.  Go here!"}
{"text":"Omg this pizzeria is the best ever. Great Pizza to say the least!  And the eggplant parm is so delicious.  I feel like I'm eating in my grandmas house on Sundays!  Try it, you won't be sorry"}
{"text":"One my favorite NY-style pizza joints in Charlotte. 

There are many places around that claim to have \"authentic\" NY-style, but I tend to disagree with a good amount of them. 

The 411 on NY-style... Pies are generally large in size, but moreso cardboard thin. Perfect proportions of Italian GRAVY (thicker sauce, still slightly marina based), cheese, and Italian spices. Pies have very crisp dough & crust, and not saturated by a lot of moisture, as you would find at your local Papa John's or Pizza Hut. Pies are generally cooked at very high temperatures, for a very short time- i.e. 800+ degrees for under 10mins.

That said, this restaurant makes their pies accordingly. Word of advice, if you have an appetite, try to avoid having eyes bigger than your stomach here. Their medium pie is a large at any other pizza joint, and their large is, accordingly, an extra-large. All kidding aside, the large will feed quite a few easily, with leftovers. In addition to their pie sizes, they mimic the above NY-style well. I don' know whether or not they incorporate dough conditioners or MSG's but their pizza is incredibly tasty!

Their overall menu is more of a combination between Italian and finger food. You won't find many lavish pasta entrees, but you can get yourself a philly cheesesteak and some jalopeno poppers. 

Located in the Davis Lake Commons. See their menu online @ http://www.menusearch.net/menus/2271take_out.pdf."}
{"text":"For $2.95 per half-dozen, the big, delicious garlic rolls are unbeatable. While still attaining above average marks, the lasagna, baked ziti, white pizza and salads certainly do not rank along side the best I have ever eaten (admittedly, the white pizza was quite bland) but the portion size and exceptionally reasonable prices make this restaurant a standout as far as overall value. Considering the less than stellar flavor of the entrees and pizza, a score of five stars is inflated.

Service is friendly and expect a crowd during peak times. Thankfully, there is an outside patio to escape to if you like quieter surroundings.

I would have given the restaurant 3.5 stars if permitted."}
{"text":"Good pizza. Huge portions. Calzone was large enough for 4 people to share. Cannoli was made to order. Fresh fried shell and perfect hand piped filling. 

A casual place with DIY drinks and plastic ware. Reminds me of small town parlors in NY."}
{"text":"I go here about once a week with my boys after work. Huge slices of pizza. Very quick service. Booth seating, a few bottled beers. Small outside seating area for good weather days-although you will be gazing into the parking lot of Harris Teeter."}
{"text":"This is our favorite go to place when we are busy. The pizza is great but everything else on the menu is too. It stays busy but not so busy that you have to wait very long. Fantastic food at great prices! The people that work here care about customer satisfaction, are friendly and efficient."}
{"text":"The only place my son will eat pizza!! Yes he has Mommy hooked too!! The Staff is always so friendly and helpful. . I find that to be a big part of a company's success."}
{"text":"Like a lot of transplants, I've missed the great pizza from home. This pizza is the best I've had in Charlotte. 
I ordered a medium pizza with half pepperoni and it was ready for pickup in 20 minutes. For a medium the pizza was gigantic! I can't imagine what the large is like.
Let's start from the bottom up. The dough was thin and the crust was crispy, just like good pizza should be. The sauce was bright red and tasted fantastic. The cheese was just the right amount, not too much and not too little.

I will definitely be returning for more pizzas and recommend this place to anyone looking for a great pizza pie."}
{"text":"Davinci's is one of the best pizza spots in Charlotte.  Not sure why they have no reviews but the pizza is NY style and very good!  They have sandwiches and pasta also, but the pizza is the star."}
{"text":"Best NY style pizza outside of the NYC area. (Chicago style pizza doesn't count, it's in a completely different class). It's thin crust, light sauce, and just the right amount of everything else.

HUGE. Slices are HUGE. 1 slice is easily 3-4 of a \"standard\" chain pizza joint. Did you see the Daily Show clip of Jon Stewart making fun of Donald Trump and Sarah Palin for eating pizza with a knife and fork and he had to fold the pizza up? Yeah, that's this place. 

BF and I split the 2 slice and a drink combo for less than 8$ and it's more than enough food for us for lunch. 

You can tell that they use fresh, high quality cheese and pepperoni. I cannot recommend this place enough."}
{"text":"Love NY Style, and it's not easy to find around here. They don't offer margherita pizza, which seriously bums me out. The closest they can do is tomato, extra cheese, and spinach. They don't have fresh basil or mozzarella. 

The crust is great! The spinach must have been frozen, because it was super wet. They offer beer in the restaurant and have a couple tv's. The turn around was really quick. Slices are huge.

If I were into just basic pepporini, this place would be great. Anything fresh, you're SOL."}
{"text":"This place is one of Charlotte's hidden gems.  Typical small pizza joint atmosphere, but the pizza is frickin amazing.  Ginormous slices, low prices, fresh toppings (seriously, you can literally taste how fresh the cheese is).  They don't overload on sauce.  Service is quick, restaurant is clean.  The girlfriend and I usually get the 2-slice/soda combo to share, and believe that one slice is just enough.  I could eat two, but barely, and I'd feel bad about myself.  $8 for two people to lunch?  Love it.  Just try it!"}
{"text":"Quick service and friendly staff. Pizzas are delicious but their wings are the best! Always get an order of wings."}
{"text":"My favorite white pizza in CLT, and great meatballs too. Teresa always seems to be there taking orders, she is awesome."}
{"text":"They have pretty good pizza here and they deliver to my house which is a plus. The pizza is huge so a small is like the size of a large anywhere else. They put plenty of toppings on top too so no worries in that area. I also ordered their mozzarella sticks which were decent, the marinara was good as well. 
I wasn't too pleased with the customer service when I called to place the order. The first time the girl put me on hold twice for over 7 minutes. I called back a second time and they couldn't get my card number right after reading it off like 5 times. Then they called back while I repeated my address another 5 times before they got it correct."}
{"text":"My wife and I both enjoy New York style pizza and this is the best in Charlotte. The crust is crisp and the interior is chewy if you ask them for it well done they will get a nice browning on the cheese"}
{"text":"My family tried a few places for pizza before we found Davinci's, and we've been ordering from this location ever since -- a solid 4 years. Huge pizzas! Great taste, large slices, fantastically quick service, good prices. We place an order, wait ten minutes, drive ten minutes, and invariably that order is waiting for us on arrival. Give them a try!"}
{"text":"Ok, so I was able to re-visit Davinci's and I had a chance to sample a couple slices of a cheese pizza. First off the slices are huge! Two slices is equivalent to a medium sized pizza from any of the larger chains. The price per slice is $2.50 which is a bargain. Davinci's heats up the slices before they box them up for you so they're piping hot when you eat them. 

I have no idea why the other items on the menu are so flavorless. The pizza is a home run."}
{"text":"Last night was the second time I tried it, and still have the same problem. 1. Dough has an uncooked taste 2.they only have a red sauce for the pizza, and that just leads to much acid in my system. So I will stick to making my own our will stick to dominos who at least uses real Spinach not out of a can! So gross!"}
{"text":"Recently moved to Charlotte and DaVincis is THE bomb. Absolutely love the HUGE pizzas. Do yourself a favor and try it soon!"}
{"text":"This is one of the best pizza spots in Charlotte. Forget the other chains. If you want real NY style pizza this is it. I can't eat a whole pie to myself so what I usually do is nibble on half a pizza for a few days then put the rest in the freezer whenever I get a craven. I just tried the calzone for the first time and it was yummy. Nice and fresh. If you need to order a whole pizza call for pick up."}
{"text":"I gave this place 2 starts, because the service was very good and the waitress kind.  However, as an Italian, rating Italian restaurants come down to two things:  sauce and meatballs.  The meatballs were TERRIBLE - I really believe they were store-bought, processed meatballs.  If they really were made in-house, then the cook needs to back off of the breadcrumbs, because these were bouncy, rubbery meatballs.  The sauce was OK, but I do question if made in house.  Alas, not very good - but perhaps OK for this region not known for Italian food."}
{"text":"Delicious pizza. Hot and fresh and reasonably priced. Very friendly staff also. The place is clean and inviting. Not sure why we don't eat here more. The pizza was so good. May have to put it in weekly rotation."}
{"text":"The pizza was excellent albeit a little greasy. New York style pizza. Service was little slow. Almost as though they didn't care to be there."}
{"text":"NY style by the slice!? YES SIR!!! Everytime I come to this place it never lets me down. The food is great and the service is speedy and welcoming. There had never been a time when I did not enjoy coming here. My food was hot,  cheesy, and ready in minutes. It's the perfect place if you're on your lunch break and you're pressed for time. I'd definitely recommend this place as your go-to lunch spot."}
{"text":"Davincis gets 5 stars because of the 4 things you want from a pizza place. Fast, authentic (NY, not italian) great customer service, and cheap. I'm mostly rating the by the slice pizza. They make a whole pizza and then warm them up by the slice. The slices are New York clones. They are about a foot and a half long, floppy, cheesy, and perfect for lunch. Its like New York but clean. The slices are out in about 5 minutes, piping hot on a full size pizza platter. A slice is about 2.50$ and some change after tax. Its a not-so-hidden gem in north charlotte. The only bad thing about Davinci's is that the parking lot is pretty bad. Its not tight, its just a big shared parking lot, some spots are parallel and some are normal. The way its set up can cause a little confusion, especially when one of the stores nearby I'd having a sale. But that should not stop you from visiting. They also sell whole pizzas which are not proportional to the 'by the slice' slices. They are still really big though and really good. They dont skimp on quality for quantity."}
{"text":"I used to order pizza and wings from here twice a month for about 6 years. The pizza made me feel like I was back in Brooklyn and the wings were flavorful and crispy. Unfortunately the staff and management seemed to have changed during the last couple months and this place is starting to fall off. The first I noticed along with the new faces behind the counter is the cleanliness of this place. It is a a lot  junkier and dirtier than it used to be. There is a lot of flour on the floor, empty boxes stacked up all over the place and just the overall feel seems greasy. The pizza is still pretty good but they might have changed the type of cheese they now use. It just doesn't taste as good as it once did."}
{"text":"So sad that we did not eat here sooner! The cheese to sauce ratio was perfect! Garlic knots on point! It really was like my hometown Ny pizzeria. We will be back again soon! They do offer delivery, but we dined in."}
{"text":"I absolutely love this place! The pizza is fantastic and very generous portions. Its great NY style pizza. I typically just get the cheese or pepperoni but their Davinci Special is something that needs to be tried at least once. They don't shy on the toppings and its full of flavor. For carry out we never have to wait more than 20 minutes for it to be ready no matter what time of day. Highly recommend them!"}
{"text":"Best pizza in Charlotte.

Order a size smaller than you think you need, they make them too big. 4 stars is a stretch for any pizza in Charlotte but this is as good as it gets.

Do not get the apps."}
{"text":"NY style, thin rust pizza. There large pizza is humungous. Chicken wings are breaded and delicious."}
{"text":"The staff is friendly. They always deliver my food on time and warm. The pizza is definitely good!"}
{"text":"From reading other Yelp reviews and with Davinci's being only 5 minutes from my hotel, I decided to give it try.

First off, the slices here are huge.  I took the picture people took for granted, I got the 2 slice with drink combo.  After having both, it filled me for the whole day.  The pizza is very thin and sauce is sweet.  Having tried NY's pizza, this is probably the closest thing in Charlotte that's comparable to it.  If you're in the area try it for sure.

I was skeptical, but the first bite won me over."}
{"text":"I love this NY style pizza.  The only down side is they use(d) canned mushrooms, and not fresh mushrooms.  My wife is a 'shroom snob, and only orders mushroom pizza,  so I have to come back without her.  I typ get just cheese or pepperoni and it's always great."}
{"text":"Their pizza is actually pretty good and we order from here fairly often (but really mainly because they're one of the few that deliver to our area). This poor review is for the awful experience we had last night with our delivery. We ordered a pizza and it came to us in a timely manner, however when we opened the box, it looked like the delivery person threw it in the car on its side and drove it to us like that. The cheese and toppings were completely melted to one side with the other side just bare crust. Then, after it took them an hour to redeliver the pizza, the driver had the nerve to blame us for it. No apology, just said \"oh don't tilt it this time\". Nooooo sir - me walking the pizza from the door to the counter did not cause this melted fiasco."}
{"text":"Pizza is so good . I love that you can get pizza by the slice . Their pretty big so don't order to many ! Garlic knots are really good too"}
{"text":"The pizza tastes great. The service is very fast and the pizzas are HUGE! The garlic knots were very good as well..."}
{"text":"Love the pies here, they're about as close to authentic NY as you get in Charlotte. Keep up the good work."}
{"text":"I wish I could give 3.5.  NY-style pizza.  Lots of topping options, delivery, decent appetizers."}
{"text":"Not impressed with their delivery service.The girl taking my order was very unprofessional and unknowledgeable.They have lost my business and my friends and family..."}
{"text":"Great pizza, HORRIBLE customer service. The black girl at the cash register did not acknowledge my presence when I came up and was very rude when she did. After I paid for my slice, I asked if I should just sit down and she just rolled her eyes at me. No answer, nothing. 

One guy, kind of reddish hair actually greeted me when I walked in and the man making pizzas behind the window actually said thank you to me, but at one point I heard the red haired boy and the black girl get into it because she was yelling at him before he walked out for a delivery. Very unprofessional.

Not to mention how dirty this place was. I couldn't find a table that wasn't filthy and when I ordered my pizza, it was from a pie that was just sitting out on a stool and thrown in the oven for a couple minutes. 

Good pizza, but please work on the customer service."}
{"text":"Great tasting pizza 4.5 and wings are pretty tasty. Nice prices and friendly staff, will definitely return again. Thanks for the great pies !"}
{"text":"BEST PIZZA in the Charlotte area! The employees are also awesome! :) Definitely my favorite lunch stop!"}
{"text":"The best pizza! Thin crust- a small is as big as a large from Pizza Hut. The fried ravioli is awesome. Salads are yummy too! Hmmm Ima go order some now lol."}
{"text":"Definitely good pizza but not consistent.  Toppings are scarce and the price for a pie is high. I would like to see more specials, especially on Friday and Saturday nights or on football days!!"}
{"text":"I'm a native of NYC.  I PROMISE, you'll think you're in Little Italy.  I live in Virginia or I'd eat there all the time!  Sooooooo GOOD!!!!!"}
{"text":"Davinci's Pizza chefs are true artists with crust, sauce, and cheese. If you're looking for great NY style pizza, stromboli, and sandwiches look no further. Great service in a no nonsense setting. Order at the counter and they will bring your food to you. everything was hot and fresh. the dough was crisp, perfectly cooked, and flavorful. Italian sausage sub was hot, the bread was tender and crisp and the sausage was perfection. Outdoor seating is very nice and the price is right. Go check them out...soon."}
{"text":"If you want some delicious NY style pizza, look no further! I've been a customer for a few years and i cannot think of a time i didn't enjoy my food (lucky?).

I've always received great service when i visit. The cashiers are friendly and efficient. I've never had an issue with them getting my order wrong or being rude. 

  You know a place is good if you're able to refer a friend and they end up loving it too.  If you're in the area, be sure to check them out!"}
{"text":"They have really great buffalo wings. But are a little stingy with the Toppans for the pizza"}
{"text":"Very good pizza. I grew up in NY and I would say this place and Portofinos Steele Creeke have the best pizza in town. They do give provide large slices and they are a little oily..but it's soo good. My dept at WF orders from here once a month, I love it."}
{"text":"I love this place.  Pizza is true NY style pizza.  Strombolis awesome!! Cheesesteaks amd Italian subs  awesome."}
{"text":"I've seen  this restaurant for a long time and was reluctant to try it out. One day my wife brought a pie home, and it was one of the best pizzas I had in Charlotte."}
{"text":"Having grown up just outside of NYC, I can honestly say that this is the best pizza in Charlotte ."}
{"text":"Pizza is huge and quite tasty. Fried Mac and Cheese was good but a little bland without any sauce. We were happy they delivered in such a timely manner!"}
{"text":"Just had the best pie since I moved to Charlotte 3 years ago. I am embarrassed to admit that I have lived just around the corner and shop in the same shopping center a couple times a week minimum.  Yet this was my first visit. Foolish me. 

Great chewy yet crispy on the bottom crust. Plenty of toppings. Perfectly cooked.   Yummy. And HUGE. I got a medium special and it was bigger than most large pies everywhere else. 

I did carry out but you can dine in if you choose. Also they do deliver. 

I will be back."}
{"text":"Good pizza, and I'm from New York! The slices are also very large and they have great fried ravioli!"}
{"text":"It was just ok, yes large slices .. But overly greasy. I ordered the garlic rolls(knots) as well and it was just ok. Weird old greasy taste and a bit $$ for the quantity. I also feel for what I ordered two pepperoni slices and garlic knots it took too long to make. I still want to try the calzones ... But as for pizza, I think I'm done here. Still looking for great pizza in Charlotte comparable to what I like back home in Dallas."}
{"text":"Love this pizza. Reminds of New York pizza! :D glad I found a pizzeria near me (recently moved out here)"}
{"text":"Among the best pizza in Charlotte, Pasta is excellant also. Friendly staff. Only negatives, place is small and you order at counter, no beer on draft.  Also the Air Conditioning  never seems to be working.  But those are real minor complaints, the food is bloody amazing."}
{"text":"This is my FAVORITE pizza in Charlotte. I am from upstate NY and love a good New York style pizza. The slices of pizza are HUGE. They have a couple \"combos\" such as 2 slices and a drink or 1 slice, salad, and a drink, or sub and drink. The combos are in the $7-10 range, so very reasonable for lunch OR dinner (you can get the combo all day long). I usually go for the slice and salad combo. The salads are pretty good, and they give you enough ranch for the ever important dipping of your crust at the end! I have also ordered whole pies for takeout and they are just as good when you take them home or eat in the restaurant. 

It is a very casual, family friendly pizza shop with booths and tables. The staff is friendly and if you order anything in the restaurant will bring it out to you after you order at the counter. I have gotten delivery once or twice, and it usually arrives 45 mins to an hour after ordering (this was on a busier weekend night). 

If you like a good New York style pizza - this is the place for you!"}
{"text":"Honestly just some of the best pizza since moving to Charlotte. NY style pizza. Thin crust, bigger than your face slices and simple, delicious slices.

They offer slices and whole pies. The calzones here really make me happy in my tummy. The sauce on the side is a perfect balance of sweet and tangy. And it's filled with tons of ricotta and mozzarella cheese. 

They do deliver but only to a limited three miles. But call in and pick up your order, other wise you'll be sure to wait a bit. 

A small here is like a large at papa johns. They have pasta which I have to try but I've seen dishes and they look amazing too."}
