{"text":"Awesome breakfast!!!.... great little place. Found it on yelp , definitely will go back."}
{"text":"Great food and great owners! Everything we've eaten there so far has been delicious. The biscuits and gravy are our favorite, and the sausage they use is freshly ground. If you're looking to patronize a good small business run by good people, this is the place to be."}
{"text":"Everytime I visit saves diner I'm welcomed by their cheerful staff. The food is great... Soup is out of this world. Everything is amazing. It is a small little diner, and gets packed quickly- but definitely worth the wait. It's not awkward dining solo either Bc of the large counter."}
{"text":"Best breakfast ever.  The friendliest service anywhere and they treat our military, police, firefighters, EMT and first responders with respect and dignity by always asking if you are one of these brave professions.  God Bless Dave's and God Bless America."}
{"text":"What a blessing! Needed to pass some time before going to the hospital to welcome our new grandson so we \"Yelped\" for a breakfast spot! Great find! Food was exceptional, we ordered omelets that were delicious and huge banana pancakes to die for! The waitstaff were all so warm and friendly too! Can't wait to try lunch here. Thank u for the great service! Mariann 4/2/2017"}
{"text":"Everything about this restaurant is fabulous. The food is wonderful (we've tried almost everything on the menu), the staff is phenomenal and makes everyone feel right at home, and it's in a very accessible place geographically. I would recommend this restaurant to anyone and hope to see them expand!"}
{"text":"I can't say enough good things about Lisa and our first experience eating at David's. We had a group of 10 family members meeting for a Father's day breakfast. I had called ahead the day before to see if reserving a table was necessary. Although they do not technically take reservations, Lisa arranged for our wait time to be minimized and prepared a large table to seat all of us together (impressive for just how cosy it is!) and kept a special eye on us and our experience. They take care to provide coffee to those waiting and had pretzel sticks out for the hungry kiddos in our group. Despite having no vets in our party, you can tell they take special pride and care in serving members of the military. Every single member of our group was impressed with their meals- huge, delicious! Their huge, fluffy pancakes are the best i've ever had- the banana pancakes are especially good. The service is just as other reviewers say- the staff is friendly, efficient, and immediately make you feel like family. A huge THANK YOU to sweet Lisa and their wonderful establishment. You MUST make a point to go out and experience this special little slice of Americana. You won't be disappointed!"}
{"text":"One of the best kept secrets in the Pittsburgh area! Wonderful breakfast dishes, including homemade sausage patties, enormous fluffy pancakes, and delicious omelets. The dining room is small, but all the waitstaff are extremely friendly, and the regulars welcome you like an old friend. I will be back many times!"}
{"text":"FRIENDLY STAFF!!! GREAT FOOD!!! HUGE PORTIONS!!! I eat there often. Can't say enough positives. I might cry if they ever close down!!!"}
{"text":"Hands down best breakfast north of Pittsburgh. Slightly pricey but it's okay considering the quality and portion sizes. Recommend going early or be prepared to stand in line. They also feature a few unique menu items."}
{"text":"Davids is my favorite place for breakfast. The food is excellent, staff is very attentive. But, most impressive is the respect and gratitude Davids shows our military, both active and retired, and first responders. When there is a wait, they provide complimentary coffee!"}
{"text":"I travel quite a bit and I'm a big fan of diners. I have to say this place has great food and is very clean and friendly service. As a Veteran I appreciate that they continue to honor us, thank you so much!"}
{"text":"I just happened to be going down the road with some free time the other morning, saw Davids and decided to stop in and have some breakfast. Awesome server \"sold\" the homemade corn beef hash.....the best! Service was so nice and attentive. This is a go to place from now on."}
{"text":"Great little diner service excellent, food simple but good home made selections. Soups are exceptional. The place is small but the wait was worth it.  I will definitely try breakfast next visit"}
{"text":"Absolutely love this place!!! I always recommend it to everyone I know. Home fries and sausage are amazing! Place is small but cozy. Makes you feel like your at home with some good home cooking."}
{"text":"David's is hands down the best food and the best price! The staff is courteous! They are busy, busy, busy because the food is that good! The atmosphere is truly a down home diner.  Veterans get a discount! The restaurant is small, so you might have to wait to be seated, but the wait is worth it!!"}
{"text":"Never disappointing, always busy! Jalapeño cornbread eggs Benedict is unbelievable! Wish they stayed open longer though."}
{"text":"Compared to the other reviews it must only mean one thing, I'm a picky breakfast eater or other people have substandard expectations for breakfast. This place is really close to my house, and I was only there once and that was enough for me. I got the egg and chili mess on a place. It was visually unappetizing and the chili was horrible. Considering the fact they don't serve lunch on Sundays is kinda crappy too. Id rather drive the extra 3 minutes and head down to Ladles."}
{"text":"No doubt one of the best restaurants I have ever patronized.   Parking is limited because of the size of the diner.. but trust me its worth it.  Walking in - if there is no tables our counter space - write your name on the list on the clip board.. and you can enjoy complementary coffee and animal crackers outside while you wait (nice touch!!!)   Its tight quarters inside but don't let that deter you because everyone is super friendly.   I got the two eggs breakfast with the jalapeno cornbread (which I was able to substitute instead of regular bread) and it was so good.   The coffee was pretty good I must say.. rich and full of flavor.  My boyfriend got a waffle with a slice of ham and the piece of ham served was like Easter - thick mouthwatering ham!!   Discounts available for firemen, vets etc.  which is so cool!!   Great food and excellent service.  I recommend 100% Thanks David's Diner!"}
{"text":"This place is absolutely amazing!!!! Its sometimes hard to get in but the wait for 2 adults and 3 little kids, is well worth it. First the staff, Lisa I do believe one of the owners is running around taking care of EVERYTHING, she is a one woman ARMY ( fitting for there USA theme!) Anyway, the place is small but don't let apperance deceive you they pack a punch with scrumptious and delicious breakfast foods. All portions are fit for a king and prices are pretty affordable. Its great for after church on Sundays or before work they open at 6am. Now I've also stopped and got a buffalo chicken salad on lunch break and it was great just like breakfast. Love this dinner, not scared to add flavor and spice and everyone is super super nice. I have never once returned a dish or complained and thats rare for me. They also serve freeze pops for the kids towards the end which usually entices them to eat more lol. I usually get a western omelet with home fries, to die for. Looking to fall outta the breakfast monotony of Dennys and Eat n Park David is the place to be!!!"}
{"text":"Awesome new diner...breakfast & daily specials.    Try the homemade sausage patties yum.   Can't wait to come back and try more of the menu"}
{"text":"Nice little place. Friendly atmosphere staff is always very friendly. Mom and pop type of place only open for breakfast and lunch. A must go"}
{"text":"My husband and I have breakfast dates every Friday morning, so we've tried a lot of diners and breakfast joints in the area.  This is, hands down, one of the best.  We were on our way to an orchard off Rte 28 this weekend and decided to give David's Diner a try after seeing the awesome Yelp reviews.   Those five stars are well-deserved.  Before I address the food, let's talk about the service.  Competent, so friendly, warm, and welcoming.  Our server was great and the owner greeted us when she came by as though we were welcome friends.  This wasn't a place that made you feel like a first-timer.  The people working here were truly lovely.  The food--Hangover pancakes (choc chip) were tasty, fluffy, not overly sweet, and hearty.  Stack of two was plenty of food. My husband said his (big) corned beef and Swiss omelet was one of the best breakfasts he has had and the peppers and onions added to his homefries were delicious.  I had corned beef hash and eggs, which was not on the menu, but mentioned by our server, and it was excellent.  The corned beef was tender, lean, delicious and was griddled with thinly sliced potatoes and a little cream, I think.  So very good.    This was a terrific diner breakfast. We will definitely be back!"}
{"text":"I am almost reluctant  to review this place so favorably, as it seems like such a hidden gem and already a bustling little place, a little hard to get a table. However I guess I should do my part to spread the good news. This non chain little breakfast nook sits right outside of New Kensington right on the river. As we parked and got out for our first try at David's this morning a friendly little crowd were standing outside staring up into the sky pointing and taking pics of the bald eagles flying around. How cool is that? We proceeded to put our name in, and as we waited outside, a very friendly hostess came out to offer us coffee while we waited. She also was carrying a tray of fresh made fried dough rolled in cinnamon sugar, offering some to those waiting to be seated. Yum. We got seated in about 15 mins. The waitress was equally friendly. The menu listed typical home style breakfast offerings with a few unique items such as jalapeno cornbread that the waitress said was a favorite. While that did sound interesting, I ordered an omelette which came a side of home fries and toast. We also ordered a pancake. They made it clear that substitutions were absolutely no problem. The food was top notch and very reasonably priced! My wife and I both were happy to have found this friendly, homey little place and are planning to return soon."}
{"text":"Sorry Pamela's, you been replaced as the Breakfast Champion. Gold goes to David's Diner"}
{"text":"Before our trip to Pittsburgh, my husband and I had to find the perfect diner for breakfast before our journey home. This was absolutely the best place we could have gone and Yelp and TripAdvisor did not lie! The ladies that work there are so incredibly friendly and the good is amazing! We both had coffee (which was your typical delicious diner coffee). I had the biscuits and gravy which were incredible and the home fries/hash browns were some of the best I've ever had! My husband had the SOS (essentially creamed chipped beef on toast) with a side of their legendary jalapeño cornbread and homemade sausage. We were so full when we were done as the portions were huge! We may have to share a meal next time with a couple of sides!"}
{"text":"Best breakfast I have had in a loooong time.  I was so hot I could hard see my wife across the table from the steam coming off the plate.  Can't wait to go back."}
{"text":"Lucky for us, we were visiting family who live not far from David's and I have now had the good fortune of trying them twice! So I will cut to the chase and tell you that the jalapeno cornbread is the bomb diggety. I do not think you can visit without having it. Both times I've been there they have been friendly and the food has been consistently good. We opted to sit outside due to having 2 loud and messy toddlers in our party. Our waitress let us know that they had started serving lunch but was more than happy to still let us order breakfast. Everything was good and everyone was more than full at the end of our meal. One word of caution though- the drinks are $2 and $3 a piece and add up quickly, so careful with refills! I look forward to our next visit to eat at David's again!"}
{"text":"In town for the weekend so followed reviews on yelp.  Didn't dissappoint. Great food and very friendly staff. Made to feel welcome."}
{"text":"Not worth the wait!   Water tasted like it came from the river.  No lemon to hide the awful taste.  Couldn't tell you our waitress's name.  She never asked how the food was.  No conversation from her at all.  Home fries were raw.  I asked for them to be cooked well.  The peppers and onions were crunchy and hard and the potatoes looked like they were boiled and sliced.  Yuck!"}
{"text":"I was visiting this area for two weeks and this gem was suggested to me for breakfast and after checking out the excellent Yelp reviews we checked it out.  We were not disappointed!  We were greeted immediately by a friendly staff and seated promptly despite being very busy in a small restaurant.  David's was decorated with Armed Forces memorabilia and catered to Vets which I found endearing.   They accommodated my small children and even my grandmother who uses a walker.   We ate there three times during our stay and each service was top notch.   The food is all made from scratch and portions were rather large despite normal prices. Notable was the jalapeño cornbread, super fresh fruit cups, and pancakes.  Honestly, everything from the omelets, bacon, sausage, home fries, and even the toast was excellent!   I'll be returning again."}
{"text":"Best breakfast around.  They really love our vets.  Half the time someone I don't even know buys my breakfast.  So I leave my money for the next vet.  Pay it forward."}
{"text":"I love love love David's diner and the staff is so friendly and welcoming. Lisa the owner always welcomes you by name once she knows you and the food is incredible! I love the Never Again!! Open faced omelet with SOS and home fries and bacon and cheese it is INCREDIBLE!!!! The wait time can be crazy so get there early as possible or call ahead that morning or the day before and give them a time! Love it here!!!!! It is a little pricey but the food makes it so very worth it and they give a discount to Fire/EMS/Police and Military!!!"}
{"text":"Great breakfast!  So glad we found this local spot.  Would definitely recommend.  The portions are very hardy and the taste is great."}
{"text":"Friendliest service I have ever experienced in my life and it went along with great food, i had the meatloaf and it is something ill be coming back for!"}
{"text":"All I can say is WOW !!! First time visit ,, I had the corned beef Swiss omelet Awesome !!! Real corned beef brisket slow cooked for 8 hours delicious !!!! I went with my boyfriend who is sometimes picky and a critic of foods because he is a cook guess what HE LOVED IT !!!! Super friendly people who work there everyone made you feel like you were a part of a big family HIGHLY RECOMMEND!!!! We will be back"}
{"text":"This may have been the best breakfast I have ever had.   Little place in the river, long line limited parking, but AMAZINGLY Great food and service.   Everyone is so nice and organized which really shows in the customers.   This is definitely our new favorite place!"}
{"text":"I love this place so much, I hesitate to share it with others!! Quite literally the best breakfast I have ever had. The staff makes you feel like family. Everything is fresh, high-quality and clearly homemade. Bonus: They offer a discount to veterans as well as fire, police, emt, etc. What a fantastic establishment!"}
{"text":"First time visiting the Diner.   I had the bacon cheeseburger and my wife had the My Lisa's Salad.   The burger and fresh cut fries was very good.   The salad had a generous portion of grilled chicken and was also good (mostly iceberg lettuce, could be better with more of a spring mix).   Overall a very good place and definitely going back for breakfast."}
{"text":"Dave's Diner is another joint that I am not sure that I want to share the secret.  I have been to Dave's a handful of times for breakfast and, every time, it has hit the spot.  I have been there really early on a weekday where I sit at the counter and banter with the regulars and I have been there on the weekends when there is a \"wait\" which is never more than 15-20 minutes.  But as you wait there is a coffee station outside to help you pass the time.  To note:  Counter spaces are reserved on weekends when it is busy.  The service is friendly and speedy.  Like super friendly and super speedy.  On Saturday, we ordered Ray Ray's Trash Plate and Corned beef hash and eggs (NOT ON THE MENU, but they have it) and I think the food was out in less than 15 minutes.    I love corned beef and hash, I order it almost everywhere for breakfast.  (See Cafe on Main review).  This was by far the best corned beef that I have had.  It was cut right off the brisket and perfectly cooked and seasoned.  The hash was finished off with some potatoes and over easy, on point, dippy eggs.  We ended up talking about it later in the evening.  I will go back and get it again to add peppers and onions to the hash.  (You can add peppers and onions to anything.  Think about it for your hashbrowns)  There is a discount for military, fireman and policemen.  And make sure to thank Lisa.  She is great."}
{"text":"Another delicious meal at David's Diner! The food is tasty, staff is extremely friendly and what really impresses me is how incredibly clean the place is. I have never even seen a crumb on the floor. Worth every 5 stars!"}
{"text":"Great service and great food here at David's Diner. Located right on the roadside on our way to Pittsburgh Mills we found this charming place for breakfast. It was quite busy and a slight wait of about 5 minutes before we were seated. For those who may need to wait longer, they offer a nice coffee set up right outside their entrance. It is somewhat small inside with about a dozen or so tables, but also offers counter seating as well.  A wide selection of items on the menu will make for something for everyone's appetite no doubt. I know they make their own sausage and have a homemade jalapeno corn bread that is reported to be amazing from those around us. It will definitely be on our 'to do\" list next visit. (see menu photo)  We enjoyed the eggs and bacon and Cub omelette. Service was very attentive and friendly. The restaurant was very clean and charming with the American themed decor. Vet's are certainly appreciated at Dave's. :)   There is also a local produce stand conveniently next to the Diner so you can pick up some fruits and veggies after brunch!"}
{"text":"I feel like I'm just full of 5 star reviews lately and David's Diner is well deserving of another one.    I invited my parents to Sunday brunch, offering them a few locations to choose from.  Sometimes they can be picky eaters but I know they always enjoy a good diner. Based on the few good reviews here (especially Haywood J's) I was hoping they'd pick David's Diner.  And they took the bait.    I should mention that I've requested an update on the Yelp business information.  The address was listed as Pittsburgh 15238 which is more the Fox Chapel area and not the Springdale location where David's can actually be found.  My GPS was confused.  But thank goodness for the awesome photos available from my fellow Yelpers.  With their help we easily located David's Diner by the flag hanging from their red, white and blue sign, just a bit north of the original address we were confused by.    Inside we found a quaint little dining room that included a counter, tables and even a bench for waiting.  The staff welcomed us and were happy to answer questions.  (Yes, you can get egg beaters in place of eggs with any meal.)  My Mom ordered Lisa's Whole Grain Blue Pancakes, Dad a veggie omelet.  I couldn't decide so I asked our waitress if I should go with the Country Eggs Benedict or Ray Ray's Trash Plate.  Without hesitation, her answer was the Country Eggs Benedict.  Decision made.  Lisa (who owns and runs the place with her husband and veteran Dave) introduced herself to us and thanked us for coming.  We could tell they had their regulars, like the people who showered Lisa with hugs on their way out.  It's great to see places like this, places with ties to the neighborhood.  There's an appreciation for the personal business and the business gives that love back to the community.  I'd only just met Lisa but I was happy for their success.  The food was delicious, of course.  The thin sliced potatoes that came with Dad's omelet were just the way I like them.  Mom couldn't even come close to finishing those pancakes.  Meanwhile I devoured those Country Eggs Benedict like it was my job.  We relaxed at our cozy little table, pleased with finding another local gem.  Luckily this time we didn't have to wait but even if we did, David's is worth it."}
{"text":"I went here with my sister for Breakfast because we wanted to check a new place out and saw all the awesome reviews.  The staff was extremely courteous and the service was on point.  I ordered the Bear Hungry Omelette (cheese, Ham, Sausage, Bacon, onions, and peppers) with a side of toast and hash browns.  The food was delicious!  The owner walked over and greeted us after our meal.  I would go here again in a heart beat!"}
{"text":"Best breakfast around, and trust me I've tried them all. Their lunch specials are always great and good value but the real reason to come here is the service. Absolutely top notch, really unique for the area."}
{"text":"Best breakfast in the area! Lisa treats everyone that walks in the door as if they are family."}
{"text":"Well don't think I've ever given a place 5 stars before! The food was amazing and the staff is great!! I I had the shaved stake salad... it had the best French fries on it. Is it still a healthy salad if it has french fries? Who cares .. it was worth it!"}
{"text":"The service was polite and prompt, and the food was pretty good. I got the sausage gravy & biscuits with an iced tea, and you can tell that everything was homemade. $10 for biscuits & gravy and a drink seems a bit extravagant, though."}
{"text":"This place was amazing. We are from Chicago in for a wedding. My cousin told me to come here. Hands down BEST breakfast place I have ever been to. My husband is super picky, and he said, best breakfast bagel he had ever had. I had the biscuits & gravy; it was heaven on a plate. Pop is in a bottle, love that. Very friendly staff, and the lady that was seating was super pleasant. They have a coffee/water station while you wait, and even bags of animal crackers for the kids with hungry tummies. I will always come here when I'm in down. Thank you David's Diver!!!  ~Chitownfamily"}
{"text":"So friendly. So delicious. Glad we stumbled upon this place during our tour of the Pittsburgh area. Discount for vets, firefighters, police, etc. lovely place."}
{"text":"So far all of the reviews have been spot on! The owner greeted us as soon as we walked in. All of the food looks really amazing and the portion sizes are huge! I love fruit and the bowl of fruit was huge! All in all gald we skipped subway to come here."}
{"text":"Great place! They serve spam do it right. Eggs beni with fresh made hollandaise is delicious. And one of the  friendliest waitresses in the biz. I have eaten here several times for breakfast and lunch and its all made in back and terrific experience."}
{"text":"Went here for lunch with family. Fast, friendly and matter-of-fact service, with excellent food! The home made chicken soup was really home made, including the noodles. We got several sandwiches, including the fried jumbo (bologna), all of which were delicious and generously sized. Home made potato chips were also quite good--thinner than others, which I actually preferred.  Overall, David's is a real hidden gem!"}
{"text":"Hands down the best local breakfast!! I feel like I am eating at my moms house...its THAT good!  Lisa and her staff are SO nice and will know your name when you are a regular.  I eat here at least once a week."}
{"text":"Nothing but rave reviews for this spot.   Looks a bit like a dive from the outside but when you step inside the staff are friendly, the restaurant is clean and the food is delicious.   It's a neighborhood diner where literally everyone knows your name.  I felt a little like the odd man out because no one knew my name but everyone was so friendly that the feeling didn't last long.  It's a small place with a handful of tables and a lunch counter with stools.  It can get crowded but they work quickly to get everyone seated.   Also, I saw the owner, Lisa, bringing coffee to those who were sitting waiting which I thought was a really thoughtful touch to ease the wait time.  On both visits, I went for the Light Breakfast of sorts which was one pancake with a fried egg on top and then ordered a side of home fries.   On the second visit I upgraded the regular pancake for a banana and chocolate chip pancake.  That decision was definitely NOT a mistake!  Well, maybe a mistake for my waistline but not my taste buds.   Everything on the menu looks great and you get a ton of food for a great price.  I love, love, love the home fries.   I also really want to emphasize how clean this place was.   No dust on any of the decorations or shelves, no crusted and dried residue on the ketchup and hot sauce bottle on the tables, a clean floor, etc.  You can tell the owners really take pride in their business.    It may be out of the way from downtown Pittsburgh but I recommend making the trip!"}
{"text":"Great breakfast with a classic small diner feel and patriotism to boot - what's not to like? Everything we had was delicious, the portions are generous and the service is quick and friendly. We were fortunate to happen in mid week, when you're less likely to encounter lines, though we were assured by our waitress that if we were to return on a weekend, we'd find it moves along rather quickly."}
{"text":"As we walked in they pointed to our table cause it's that kind of awesome atmosphere where they know you. Already taking a chair away for my Sons high chair to be placed. The wait was about 20s. As always the food awesome! Accommodating for any adjustment requested and hot fresh food. The pancakes are made fresh the biscuits are moist. The gravy is the right thick and tasty with just the right seasoning! Griddle potatoes and eggs the way that was like the first time you had breakfast out in that hole in the wall with your grandfather. Yeah it's that good!"}
{"text":"I went here with my niece for lunch and the food was AWESOME!  I wasn't sure what to get so I asked the waitress and she recommended the Rueben or the meatloaf, another waitress walked by and added pulled pot roast to the list.  I got the meatloaf and my niece got the pulled pot roast sandwich, they were both delicious.  the sandwich comes with house made potato chips and the meatloaf comes with homemade mashed potatoes.  I am planning another trip to try the Rueben.  The staff is super friendly service is fast and the food is all homemade."}
{"text":"This place is really cool. Went there for the first time with a friend. We had an amazing breakfast.   Small place, but clean and organized. The servers were friendly and efficient and helpful. The owner helped me a ton with selections that would not potentially impact my food allergies.   Had the largest pancake I've ever seen, with corned beef that was made in house. They even corn the briskets themselves . . . over an eight hour period!  The hash was fresh, creamy and absolutely delicious.   My friend had the hash as well, with whole grain blueberry pancakes. There were so many blueberries in them that they were squishing out!  Even the coffee was excellent. I can't wait to go back. Have already made arrangements. Quite a drive for me, but so well worth it.   You must check this place out!"}
{"text":"Decent service, full of regulars all the time though. The place has a homey type feel, and the food was pretty good, but for all of the breakfast I've eaten I'd call it a bit pricey for the quality. Not bad."}
{"text":"Hmmm... Hot Cider and coffee while you wait?  Excellent The owner coming out to check if you are present while waiting AND letting you know graciously that they are thankful for you waiting to be seated? Excellent 3 fresh eggs over ham steak and country potatoes served with jalapeño corn bread BEAR style?  EXCELLENT!  Sitting down and being served what you ordered all within 15 minutes?  WOW!  If you are in this neck of the woods, don't hesitate to come in here. I will.  P.S. Dad says so too"}
{"text":"I stopped by this place the other day and it has a good turkey BLT... The inside of David's Diner is not much to look at but it's ok ...."}
{"text":"Driven out here from the city a few times for breakfast and have never been disappointed.  Food is delicious. Service is prompt and friendly. Love being able to sit outside by the river."}
{"text":"The service is friendly and the pancakes are HUGE. Homemade hand-formed sausage patties and fresh blueberries in the pancakes keep me coming back. Kids under 2 get their kids meal for free and we are always given a large box of crayons when we're seated. My husband tells me the reuben is awesome. We love this little gem! But show up early if you want breakfast on the weekend! There are always people waiting for one of the handful of tables. There's almost always a seat at the counter though."}
{"text":"We found David's dinner on yelp while looking for breakfast on our way to Pittsburg. We pulled up to the place and immediately noticed a crowd outside and thought; these guys are obviously doing something right! We got our name on the list and only waited 20 min tops! And BOY WAS IT SO WORTH IT!! My husband ordered an omelet and said it was the best he has ever had! (And that's saying a lot) I ordered a breakfast sandwich and it was everything I thought it would be plus some! My son (7 years old & picky picky eater) ordered pancakes, sausage, and eggs and ate almost all of it! The owner, Lisa, was super friendly and I can't say enough about her hospitality. I inquired about a shirt the waitstaff was very wearing and Lisa came right over and told us she would like to GIVE us a shirt if we would pick out a color and write our sizes down. We offered to pay for them but it was no use... She was more than happy to have us there and made us feel very welcomed (she even gave my son a Popsicle as we were leaving). I wouldn't be surprised if this place is featured on Dinners, Drive-ins, and Dives in the near future! Phenomenal doesn't even begin to describe David's dinner! The food, staff, and atmosphere was everything these Texans were looking for!"}
{"text":"Goto place when I'm back in New Ken.   Recomendations:   Breakfast:  Anything with a slice of ham. Great think cut quality ham you can sink your teeth into  Lunch:  1)Italian hoggie. Best salami ever!!! 2)Fish sandwich, delish but I keep dreaming about the salami :)"}
{"text":"Found this diner while in Pittsburgh for a hockey tournament.  Spoke with some locals while waiting in line who recommended the Never Again and the pancakes.  Once inside, I couldn't resist the Ray Ray's Trash Plate while my son ordered 1 blueberry pancake.    We were warned that the pancakes are huge - - - and they were also some of the best... anywhere. The Trash Plate had chili sauce, eggs, bacon and home-fries cooked crisp on the griddle with cheese... all huddled together in a wonderfully messy and delectable pile of goodness.  Excellent coffee delivered with down home sincere service. The place is obviously very popular and clearly has many loyal local customers. Eat here once... and you'll know why they keep coming back."}
{"text":"First Time here ... Got a hot Turkey Sandwich ...Real Turkey and Real mashed potatoes. Great friendly service!"}
{"text":"very cute place!! Right on the river by the train tracks. Inside is even cuter with antiques with several items to honor our military. Staff is very friendly and nice. This was our first time today and we were greeted as soon as we entered. We had the breakfast menu and we each for different items. All were so good and filling. Portions are large. Definitely a great locally owned place. Can't wait to go back"}
{"text":"Went to Davids Diner with a friend. I ordered the Hash and Eggs and was surprised to be served REAL hash and not something out of a can. The best hash I've had that I didn't make myself. My friend ordered the \"Old Army SOS\" It looked wonderful.   Davids is worth seeking out."}
{"text":"This is my dream diner: cozy, friendly, delicious. The staff is incredibly friendly and knew tons of the customers by name. Sometimes close-knit places like that can feel unwelcoming to outsiders, but they made me feel right at home, even offering me a fresh out-of-the-oven gingerbread cookie while I waited for my food. I had country poached eggs on jalapeno cornbread, which was fantastic. Cornbread was on the moist side but it worked with the dish overall. Good-sized portion but not outrageous. I'm definitely going back."}
{"text":"Good food  Great service. You get alot food..friendly service. I can never finish my breakfast. Give you so much. Clean. Good location. Love they give discount to veterans."}
{"text":"Good breakfast food. Does not live up to the reputation that surrounds it....not to say the place is bad.  Good American diner. Good staff."}
{"text":"Hands down, the best breakfast place I've ever been to.  This is taking into account the other amazing breakfast places such as Delucas in the Strip and Pamelas in Millvale.  I cannot get past the Bear Hungry omelette, it is absolutely huge and amazing with all of their meats and veggies.  The chunks of everything are big and the omelette itself is 4 eggs and over stuffed.  Every plate comes out steaming hot, fresh, and look amazing.  This is a no brainer, worth the drive, worth the wait, worth the money dive diner dedicated to veterans.  The owner is more happy to see me than my own mother.  I will come back 2 weekends a month or more, love this place."}
{"text":"Friendly people and a good, solid breakfast ! Portions are huge so come hungry . Omelets are my favorite!"}
{"text":"I had heard so much hype about this being one of the best breakfast places in the area. I needed to check it out for myself.   I was famished so I wanted plenty to eat. I settled on the veggie omelette that came with home fries and toast. (Once again I started chowing down on my meal and ended up posting half eaten food)I met a friend of mine and we shared a pancake with blueberries.   The portions are enormous and well worth the price.  The blueberry pancake covered a large dinner plate and was ever so light and fluffy! My veggie omelet was packed with green peppers and onions, the home fries were crispy (I also had fried onions & green peppers), my wheat toasted was perfectly toasted. I don't know what brand of coffee they brew but it was exceptionally smooth and a perfect accompaniment to my huge breakfast!   I believe the hype I was given now and highly recommend this diner. Heck if Guy Fieri is every in the area this is a fantastic diner for his show!"}
{"text":"Friendly atmosphere, always greeted as you come in. Great breakfasts at reasonable prices. Pancakes are huge! Waitstaff is friendly & efficient. Highly recommend this diner for breakfast."}
{"text":"I cannot believe my husband and I have waited this long to try David's Diner but we finally did get there this morning.  What a wonderful 5-star experience! We were greeted right away and promptly sat at a table near the window on the side (we must have had great timing as I've been told by others there is usually a wait). Our server was right there with coffee and she got my husband's iced tea, asap. Everyone was super nice and it's quite a cheery, homey kind of place, you feel very welcomed. I ordered 2 eggs, scrambled dry, sausage, home fries and toast. My husband got the 3 stack pancakes with side of sausage, even after our server issued her \"the pancakes are very large\" warning :) needless to say we had to get to go boxes but that is not a bad thing! All was cooked perfectly and it was just a delightful experience. Our new favorite breakfast spot! We cannot wait to return, after 7/9, of course :)"}
{"text":"Been here for breakfast a couple times now. Every time I been here the food has been great. You have to come here with a appetite because the portions are huge. The staff is always friendly and kind."}
{"text":"So, I saw this little place on MSN news ranked as best diner in Pennsylvania! In the Pittsburgh area, everyone knows Pamala's or Deluca's are the Goliaths of breakfast (honorable mention to eat n Park), David's is armed with far more than a slingshot, this place is a howitzer!   I ordered the gingerbread pancakes (I assume they are a seasonal item) and they did not disappoint!!!  A perfect balance of flavor in a fluffy pancake that wasn't dense or cake springy.  These were how pancakes are supposed to be!  (Yeah I know, I should've taken a picture, but they were just so darn yummy). I had a side of scrambled eggs and again the perfect texture and consistency!  Oh and the coffee, perfect, not all watered down like the goliaths. They wait staff was super nice and treated me like an old friend, and for a diner not located near a military base or military town, they are service member, police officer friendly! This is my new must do when I come to the burgh! MSN got this one right!!!"}
{"text":"This is the best breakfast in town. We absolutely love everything about David's. The service is wonderful, the food is amazing, and we always feel comfortable when we visit. The pancakes are large and tasty, and the jalapeño corn bread is perfect--a must try! The only downside is that it's super small, so sometimes you have a wait, but they always make you as comfortable as possible and get you seated as fast as they can! This is a must eat local gem!"}
{"text":"I can't say enough good about this place!! Awesome friendly staff and even better food!!! Highly impressed!!"}
{"text":"FINALLY somewhere that serves HOMEMADE sausage gravy!  Today was our first time stopping after numerous times driving past and seeing how packed the parking lot always was. We are SO glad we did!  The bf got the breakfast sandwich, I had sausage gravy over biscuits and we split an order of home fries and a pancake. As soon as you walk in the door the entire staff greets you from wherever they're standing. Food and service was outstanding!"}
{"text":"Another small gem nestled in the Creighton area along Pittsburgh St/Freeport Rd. David's Diner serves fantastic food and the service is impeccable! While there, i ordered 2 pecan & cranberry pancakes with a side of sausage. The pancakes were enormous, thick and slightly most (thumbs up.) Had i known they were as big as they were, i would've ordered just 1 lol! When my party arrived, David's was transitioning from their breakfast menu to their lunch menu (11:30am). Our server still allowed my party to order breakfast and was super cool about it. Our server was extremely polite and attentive throughout our stay too. Kudos to David's for offering a stellar option for breakfast and lunch. I look forward to visiting again when i travel back to Pittsburgh!"}
{"text":"Great breakfast -- the whole family enjoyed their food. Full of locals and love for the military. The cook did a fantastic job of keeping dairy and other allergens out of my meal."}
{"text":"Food is okay. We waited a LONG time to get in, would not wait again for the just okay food."}
{"text":"I had breakfast at this place this morning. Great food for a meager price. Everything I got was great. One bit of advice be prepared to wait it is a small restaurant and lots of people go here but it definitely worth the wait."}
{"text":"I haven't been here yet, but I'm going to definitely go. Food looks delicious and I love how you pay your respects to everyone who served. God bless."}
{"text":"When I saw 66 Five Star reviews I had to check this place out... Yep, gets a 5-star review from me too!  I travel a lot and get to try a lot of local favorites but this place is something special. First, the food... I am pretty much a 'meat' guy but the fellow next to me had the chef's salad special and it looked amazing so I ordered it... Stellar! Loaded with fresh deli meats and cheeses on a bed of crisp lettuce, green peppers, onions and cucumbers. The ham and bean soup was no doubt homemade, also amazing.  My colleague had the Italian Hoagie with house made chips which he said was one of the best sandwiches he's had.   Now, the place. Super clean and some of the nicest, friendliest people you'll meet. The seating is a little tight but promotes a family atmosphere. For example, the lady next to us asked for some cream for her coffee... I just grabbed the dish from the table next to us and handed it over.  Great place, great food, nice people. This one is a must visit if you are in the area."}
{"text":"Setting aside the fact we waited almost an hour, and that people who came in after us were seated before us, my wife and I still liked David's Diner. I ordered a ham and cheese omelet, which had huge chunks of real ham. My wife ordered a bowl of fruit which was freshly cut and enormous. Enough for at least two people. The only downside was a limited bread selection (no Italian toast? In Pittsburgh?)."}
{"text":"We were passing through town and wanted to try some place local. We are so glad we did!  The food is great. Everything is fresh, hand cut, hand made, and delicious. They clearly care about what they are serving.    The staff was welcoming and attentive. Lisa made us feel like family.  When you find a gem like this, it makes you wish you didn't live 1000 miles away."}
{"text":"Great food! Love the portion size. The breakfast sausage was excellent but the pancakes were average. Great service."}
{"text":"Just good food from nice people at an infancy yet quality place!  Enjoy!  You will feel the loyalty and celebrate your freedom while you are there."}
{"text":"Awesome new business - great breakfast!    Be careful looking for it on a GPS unit.  If you know area it is right next door to John/Jerrys Fruit Market in between New Ken Bridge and Springdale."}
{"text":"First time in at David's and we both agreed that this ranks at the top of our diners with Summit, Fred's and Mamma G's, Nancy's East End.  Here are our new diner rankings:  Service:  1st Place - 3 way tie -  Mama G's, Nancy's, David's   2nd Place - Totin's  3rd Place - Summit  Last Place - Fred's   Home Fries:  1st Place - 2 way Tie - Nancy's, David's   2nd Place - Mama G's  3rd Place - Summit  4th Place - Fred's    Sausage Patties: 1st Place - 2 way tie - Summit, David's  2nd Place - Nancy's   3rd Place - tie - Mama G's, Totin's, Fred's    Pancakes: 1st Place - Nancy's (crepe style thin)  2nd Place - Summit  3rd Place - Mama G's  4th Place - David's, Totin's, Fred's    Food Quality / Flavor:  1st Place - Tie - Nancy's, David's, Mama G's  2nd Place - Summit, Fred's, Totin's    Don't Miss!!!!!! Nancy's  David's Mama G's"}
{"text":"I love everything about David's diner. Starting with the service which is outstanding! The food is so delicious and all of the ingredients are of the best quality. And it all comes together in such a lovely atmosphere. The owner should be congratulated for their outstanding breakfast and lunch service. I will be back as often as I can."}
