{"text":"My star rating is based a weighted average.     The pan sear fois is as good as to my many trips to montreal. 


Fois gras come in a trio.   Pan seared      perfectly cooked and eat it asap     6/5      best in town and decent size ports in 


Salad very basic but ok   3/5
Soup   taste like out of a can 2/5     I usually skip it

Lamb chop are good   but they do not finshed it off I'm the oven.  So the outside cut are cooked to order and the two inside pieces are  undercooked 4/5

Desert     3/5  ok made in house

Service   4/5     fast friendly and they do not up sell   that much  


Oyster   above average    shucked properly with no shells in them like Dianna   5/5

After 9 pm they have  $2 special   on primuim oyster like kushi komouto s.  And not the cheap malpequea or fanny bays.

So go ealry 6   OR after 9 pm  (FRIDAY TO SUNDAY).   It get really busy or just go monday to Thrusday 

Overall a decent experience and I never order the steak (odd for a ateakhouse)   it has a basic taste like a supermarket steak.      I ONLY get the lamb chops with are OK.


Weird  painting on the wall and in bathroom but I go only for the fois gras."}
{"text":"Just when to this place yesterday with my girlfriend Environment was really good. When I first enter, I just saw their beef steak on the display shelf. That's makes me hungry.  The server was very nice and give lots of her suggestions. I just followed her suggestion and the food is really good.  Try their fresh mussels. They don't have that everyday. It's amazing. And the steak was good too and they have another options like add 4oz.  For me 8oz is totally not enough so I chose the 8pz +12oz. at a very reasonable price. Everything experienced there was good and the price is not too high. Will definitely come back."}
{"text":"So went again and this time tried the Bass. This was the best dish I have tried so far. They improved their bread too. It looks like they may be making their own bread (complimentary appetizer) now."}
{"text":"Not bad! Not bad!
I was surprise. The food actually very good. I didn't expect that cuz it is Chinese run steak house. 
I order set dinner for $50. It come with  foie gras (taste good), romaine salad(fresh and variety choice of dressing), lobster soup(taste too mild and too thin), rack of lamb(very juicy and tender). 
Recommend to come"}
{"text":"Quality of food is alright. Seafood is fresh. The steak I ordered was over-cooked. We were surprised about the price they charged!! It was like the price for dinner at a high end restaurant in Toronto downtown core. I personally will not recommend my friends to go there. But if you would like to have dinner at a quiet restaurant in the neighbourhood, then you can give it a try."}
{"text":"Had a really bad experience. Went with a group of 12 people for dinner just tonight. Ordered the sirloin steak as an entree, but the chef apparently \"miscalculated\" so my steak was just hitting the grill while the rest of my group ate their entrees. My steak finally arrived when the rest of the group was served their desserts already. I had ordered my steak to be cooked medium but it came out rare, so I had to send it back. Screwing up the same entree multiple times is not acceptable for a place that's supposed to be an \"upscale steak house\". There was only one choice for dessert -tiramisu - which was part of the menu that I had ordered but I couldn't eat it because of the alcohol in it. Brilliant. I was skeptical about a Chinese run steakhouse, and my experience confirmed it. Will never visit this place again. There are other western restaurants in Toronto that specialize in aged steak - much better options for those who like to enjoy steak."}
{"text":"I would probably give it a 3.5 stars. 

I bought a Groupon deal, which was a dinner for 2 that included one appetizer, one cocktail shrimps, one soup, one entree, and one dessert for each guest. 

Service was pretty good, quite attentive...our waitress has strong accent, I didn't quite get what she was telling me abt sometimes, but I didn't mind...coz it is quite self-explanatory. Of coz I wouldn't expect the authentic French Onion soup there, I think it was a bit a cheese plus French fries then they added the soup...but it is still better than the one I once had at La Maquette. Steak was nicely done, cocktail shrimp presentation was interesting. 

I wouldn't mind going back there, but not too sure if I will pay regular price to go back. One thing I like is their washroom is quite clean, at least the time I was there :)"}
{"text":"I would actually give it 3.5 stars. 

Service was very good and everything was served course by course. The waiter actually comes to check on us to see if we're finished with one course. Then he would clear the plates for the next course. We (my boyfriend and I) ordered two of the $50 set dinners. We had the oysters, tried both salads and soups, the tenderloin and ribeye steaks. 

We went there mostly because my boyfriend wanted oysters and I wanted to go to a place where I can enjoy other food. He wasn't disappointed, there was a lot of variety and were very fresh. The salads were meh. They brought over 6 choices of dressing for us to choose from which was nice; though I honestly didn't like them. I went with caesar to be safe but it tasted a little sweet for me. I did enjoy the lobster bisque very much even though it's not like other ones that I've had. Out waiter brought over a bowl with a few pieces of lobster in it and then poured a thick broth over it. It wasn't \"creamy\" as a lobster bisque should be but I really liked it. The french onion soup was served in the same way with a clump of cripsy onion and cheese together and broth poured over it. That one didn't taste as nice.

Onto the steaks, they were cooked perfectly! We asked for medium and it was actually medium for once (compared to most places). It was served on top of a few slices of zucchini. I wish the steak was a little more seasoned but other than that, it was pretty tasty. I found that the ribeye was more seasoned than the tenderloin...maybe it was just me?

Finally dessert was a small piece of mousse cake and a small square of cheesecake. It was pretty good but was definitely frozen because my piece of cake was very cold in the centre. 

It's not one of my favourite places but would return if I wanted a decent dinner and didn't want to go far (this place is 10 minutes from my place). Oysters at regular price are a little pricey at approximately $3 each, even for malpeques. After 9pm, oysters are $2 a piece. It's also a little pricey because the steaks would be $26 by itself without any sides at all. 

Would probably return every so often. Excellent service, decent but slightly overpriced food."}
{"text":"Don't go here, the servers are rude which is not something you expect when paying a premium.  The food is pretty plain and portions are small and is expensive.

Do yourself a favor and go somewhere else."}
{"text":"Terrible service. It takes a long time for a dish to come. It took us 15 minutes to call a server to ask them where our food was. The food was decent but overall dissatisfied with the service and the time I wasted."}
{"text":"I purchased a Groupon $65 dinner for 2 (5 course Prix Fixe menu).

Food Quality & Price: For the price, I think I'd rather eat at the Keg. See comments of each dish below.
Appetizer (Foie Gras) - Delicious! I don't typically like liver but this was executed very well. There were three small bite sized pieces on toast. The third one kind of smelled and tasted like cat food but the first two were divine.
Salad - Disappointing. Nothing but your standard greens and choice of dressing.
Soup - Between the French Onion and Lobster Bisque, definitely go with the Lobster Bisque. French Onion was only okay (tastes better and costs less at Kelsey's).  The LB was great, really wish I could have more (and more pieces). 
Entree - Choice of B.C. Salmon or Angus steak (New York style - aka super thick).  Salmon left much to be desired, definitely order steak.  The steak is comparable quality to the Keg, though I daresay I prefer the Keg (which comes with cheese/garlic on top and sides).  At Day & Night, none of the mains have any sides.
Dessert - Ice Cream & French Cream.  Looks like little mousse cakes. Nice light finish to the meal.
(Not included in Groupon) We tried the waiter recommended West Coast Kusshi Oyster.  They were small but very easy on the palette. Typically if you order oyster, know that east coast oysters carry a more sea salty flavour where the west coast oysters are creamier and milder. The oysters cost around $20 per half dozen (which is typical).  After 9pm it is $2/oyster!!
On the regular menu, alcoholic drinks average $8 - 10. Filet Mignon (no sides) $32. Rack of lamb $24. Only two soups available for $8/$9 - just to give you and idea. So definitely on the pricier side (slightly higher than the Keg and about the same quality). You'll be coming either for the oyster bar or the experience.

Facility: The establishment went all out with decor. Loungy feel with dim lights and lots of neons. Washrooms were clean. Stalls were actually individual rooms with sinks in them. Ambience was nice (music was contemporary jazz), not too many people but enough to hear a generall buzz of conversation in the restaurant.

Service: Good. I was satisfied with our server who seemed knowledgeable about the oysters. He didn't try to push anything on us. Server was bilingual speaking both English and Cantonese. I would have liked to see him pop by more often or in the vicinity when we needed him and be more friendly. We were kind of stuck in the corner or the restaurant.  Also I didn't understand why he removed our sparkling water at the beginning of service? No hostess at the door when we came in, waited for a while before being received. 

Overall: Great place to try if you're looking for something new. Not sure if I would return for the simple fact that the food is on par with The Keg (a restaurant chain) and the price is slightly higher.  The oyster bar is definitely the major attraction. Do I think it's worth the Groupon purchase? I would say no, but I do not regret buying it for the one time experience."}
{"text":"Tried this time with Groupon.  Very disappointed.  This was one of the good Chinese run seafood and steak restaurant.   However the rack of lamb one thirds is fat.  The Angus beef steak has two large veins running across and hard to cut. The lobster bisque is good, only if you add extra black pepper to it, otherwise it is not tasty.
The best part is the soup is forgotten and half of us had to finish the main course before soup is served. Lol"}
{"text":"My parents have just been raving about this place for weeks now. We didn't have the chance to have a sit down dinner but my parents really wanted to get me to try it while I was in town so we came here to get a bit of takeout from their midnight snacks menu. 
I am just so impressed with the level of service these guys are offering FOR TAKEOUT patrons. I can't wait to have a sit down dinner here. The food, while somewhat pricey on their regular menu, becomes pretty affordable on their midnight snacks menu and on their oyster specials. It's definitely worth the extra money to be treated this nicely in a hometown establishment."}
{"text":"My parents are big fans of this place because it serves good quality steak in a decent combo price vs a la carte options. A combo of appetizer, soup, steak and dessert is about 50+ depending on your choice of appetizer.

I really love their soup (both french onion/lobster bisque) as it's very flavourful.  Their 'salad', no matter how fresh, is a laughable portion.  You will get about 3 pieces of leaves on your plate, though they are generous enough to give you 7 dressings to dry.  Otherwise, the food is on par if not a bit better than your typical chain steak restaurant.  If you aren't feeling like steak, unfortunately there's little options for anything else - if I recall there are only 2 pasta options.  The small pieces of steak looks a bit lonely on a big plate which rarely includes enough greens and veggies as side.  I'd also prefer more steak sauce but am told small portions are provided as to not take away the taste of the steak.  

Their service is super slow and lacking - I understand they want to give you ample time to eat your food and talk to one another, but that does not mean the server should disappear altogether.  There are so few tables and traffic in the restaurant that the server doesn't come by or walk around as often as they should. 

On this note, I have also tried to make reservations before but was told they're fully booked, only to walk in to a half empty restaurant.  It could be that they have a large portions of table for walk-ins only.

In the few months since I've been here, it looks like their dessert in the combo has changed.  This is a small but pleasant surprise to their otherwise limited menu.  I'll be back often as my parents like this restaurant and look forward to other changes and surprises in their menu."}
{"text":"I would say most of the credits would go to the waiter. He served us very well, the service made us felt like we were in a five star steakhouse. 

The food was alright. We bought the groupon deal. All the portions were relatively small. I got their heart salad, which is basically 4 slices of lettuce. Then the main course came and I got their tenderloin, which I couldn't taste anything but burnt. Their dessert taste like some dollar chinese small pieces of cake that I could just pick up from T&T."}
{"text":"Since I gave it a low-mediocre rating, let's start off with the good things. 

GOOD: The place is very nicely decorated, dark, moody, romantic, with nice vocal jazz background music. There's plenty of free parking. The staff are friendly, prompt with empty plate removal, and quick to mention any specials or recommendations. The Foie Gras Pate was quite a tastey treat. Their prix fixe meals seem amazing in value. They cooked our steaks perfectly to order, no messing up! Medium-Rare really was Medium-Rare, and came Au Jus on the side. Dessert cake of the day tasted very nice, seemed fresh. The waiter brought us water without us asking for it, it's something not a lot of servers remember to do these days.. 

BAD: The welcome drink appeared to be the leftover syrup in a Del Montes can of fruit salad mixed with orange juice or something. It was tastey and looked nice, but when we got our Lobster Salad it came with fruit salad that seemed as though it was from a Del Montes can and this is what made us think twice about the welcome drink. The Lobster Salad itself was half a lobster with mayo squirted on, they did not clean out the gills/organs, you can only eat the tail and claw meat. The Claw meat tasted extremely rubbery and funky. Since it's a cold lobster it could have been in the fridge for days.. The Lobster Bisque soup is anything but! It's literally gravy mix poured into a bowl that had 2 small pieces of cold lobster meat. It's not the real cream-based rose coloured lobster bisque soup. We also found bits of mashed potato in the soup, I don't know what's up with that, but it looked and tasted like gravy so we didn't finish it... For the mains, we had 8oz steaks. Cooked well, juicy, flavourful, but I've easily had better at your local mainstream steakhouse. It came Au Jus on the side, lovely. No sides were served with the meat, sadly. Even the pieces of zucchini slices that were on the plate were raw and for garnish only. 

OVERALL: We had a good time regardless, the deal we had was fairly good, I just wouldn't pay full price for the food there. A tad too expensive for mediocre food.

Final note, it wasn't busy on a weekday, but upon leaving nobody said thanks or goodbye as we walked out."}
{"text":"Food was ok and the ambiance was great. But it took us 45 mins to get the bill because the server refused to acknowledge us even though he was serving the table 2 tables to our right. Disappointed...wouldn't come here again if I didn't have another groupon to use."}
{"text":"Everything here went perfectly for me. !! 

Cheapo me bought a Groupon to try the day and night near my house and wow!! I was so impressed by everything such as the design, decor (especially the washroom) literally so cool cause the washroom has like different colors going around and idk its just awesome!!  

They have excellent service !! Always checking up politely and asking how's everything even though it was a Groupon!! ( I hear that you get mistreated if you use Groupon) but no!! Not here they are super nice !!

 Food was soooooo fuccking good !! (Excuse my language) but seriously its pretty good.. Everything tasted fresh..except for the lobster in the lobster bisque ... And they also have an oyster bar with sooooo many oysters to pick from ... Seriously too many..  But the portions were quite small..  There's so much to say but.. 

I'll just cut it short. Definetly give this place a try since they offer a Groupon deal right now !!*note: you will prob be spending approx $110 for 2 ppl*"}
{"text":"One of my favourite places to go to for raw seafood, especially their oysters. The oyster bar is plentiful and fresh (coming from East to West coasts), and you can get them for $2 apiece (minimum order is a half-dozen) after 9pm on certain days. Every kind I've tried so far has been definitely worth it. If you're not into oysters, they have a nice prix fixe dinner-for-two that includes a soup/salad (lobster bisque is on point), shareable raw seafood platter (sashimi lobster tail and assorted fish, jumbo shrimp, oysters, mussels etc.) and dessert. I've had this twice because it's so delicious.

Wasn't so impressed with their non-seafood options however. Chicken breast and steak entrees were both good but not anything exceptional, especially for the price you're paying. Their $10+ smoked moulard duck breast appetizer was a bit saddening, the \"exotic mixed greens\" being a few pieces of romaine and the duck breast tasting kind of like deli ham. I'd recommend you spend your money on their seafood items instead.

Service is a bit slow at the beginning but picks up as you start eating. Atmosphere is nice and quiet, giving a pleasant dining experience. Overall, great 4 star restaurant for your fancy seafood fix."}
{"text":"Ehh.. Had the team buy coupon shrimp cocktail not bad Caesar salad was minuscule steak was not great tough and I could tell it was low grade meat. The lobster bisque was gross the lobster was fishy and hard soup base was average. Waiter was great attentive and washrooms were clean. Sat outside no one was on patio. Pretty much think this place is eh. Would not go back .best part of dinner was my Bloody Caesar, it was delicious"}
{"text":"Their lobster bisque and seafood pasta is probably my favourite. But the price for the quality of their steaks and lamb racks maybe too high. Very comparable to the frozen foods I eat at Costco. 

However their service is very kind. Sometimes slow when it's busy (really really really slow). But the venue and decor is really nice and romantic for a date."}
{"text":"Place looks realllyyy nice

But so disappointing
Me and my boyfriend bought a groupon for a 3-course meal. 
The first course was foie gras and oyster. I had foie gras before in Toronto and in Europe. The foie gras was awful, it was some kind of canned meat, it did not have the texture or smell of foie gras. The oyster was okay, not the best because it smelled a little fishy. 
It also came with lobster bisque, I never had bisque but it tasted like weird water down seafood based. If that's how bisque are suppose to be.. then cool I'm never ordering 'bisque' again.
The second was the angus steak. I ordered it medium rare, it came out raw. The piece of steak was small so there was no point in asking them to cook it again 
Even after the two courses, I was hoping the dessert was redeemable. 
The dessert was something I could have got at Tim Horton. It was some pastry thing with some whip cream on it 
The bill came about 90 bucks -_-

Overall, 2 stars because it didn't get me sick and the server was a nice dude."}
{"text":"I absolutely love this place. Both locations are good. The service is always great and the prices are good too. My favourite is the ribeye. Their steaks are cooked to perfection and melt in your mouth. I love that they have 2$ oysters after 10pm. There is many selections of oysters. The seafood sauce is also perfect. The only problem I've had is that I find the lobster to be cooked weird. But still delicious. 

My favourite thing is that they have wonderful wait staff. Friendly, attentive and available. 

I recommend here anytime !"}
{"text":"I saw this restaurant on Groupon and decided to give them a try during my travels to Canada. I live in Boston so I've had countless premium and expensive steakhouses as well as 4 course restaurants. Those restaurants have costed me over $100 per person not including drinks. I came to this restaurants with low expectations after having been disappointed at 90% of the restaurants during my stay in Niagara Falls,  but I was very wrong. I walked in and was greeted with a nice ambiance of colors and crystals. Somewhat magical and very different. I did not expect it at all. As I was seated, the host was very nice and patient. I want to emphasis that the waitress we had that night was so sweet as well. She came out with a smile and great attitude the entire night(it was like 10:00pm) she attended us very well and as I would have expected from a high end restaurant with a 5 course meal, the meals came with pace but not too fast for you to not enjoy your evening. Let's talk food, the food was so delicious. The apps came out first and I got a trio of foie gras with gold flakes on bread, oyster with caviar on top, and smoked salmon. Best foie gras I've had in a while. The oyster matched well with the caviar but the smoked salmon was just average. Okay on to soup, I got the lobster bisque. Was it the best I've ever had, no, but I think it's a preference thing. Their soup was more hearty than creamy like I've had in the States. Regardless, I found myself enjoying the different take on the soup more and more with each sip. Salad? Yes, you get choices of salad and a handful of dressings brought to your table in cute little jars. I personally enjoyed the special sauce(teriyaki cream). Okay, let's get to the entrees. Hands down, the best cooked steak I have ever had. It was full of flavor and every bite had juices flowing out. This paired well with a little bit of their mint steak sauce. My girlfriend got the NZ lamb ribs, and loved it. The sauce it came with was subtle but enhanced the taste. She was very hesitant because of her lamb cut in the Brazilian steak house at Niagara, but I convinced her to try it here and her eyes absolutely lit up. Can I say also, the presentation of the dishes were very appetizing. Finishing the night off, we got a Napoleon. It's not the normal Napoleon you'd find else where. You get two large puff pastries with ice cream in the middle- unfortunately I was left a bit confused and had a bit of a hard time eating it. With very little short comings, I'm giving this restaurant a five star rating for excellent food, service, and a unique ambiance."}
{"text":"A bit disappointed last night with this place.  Shared a weekend special with dining companion.  Soup and appetizer of Lobster bisque and cocktail shrimp were fine.  Shared the 2 mains of a strip-loin and rack of lamb.  Lamb was good, but the beef was more chewy than expected.  I would lower my ranking to 2 and half if that was available."}
{"text":"If I can, I will give this restaurant a 0/5.

I purchased two Groupon Deals and came here with my family of 4 on a Thursday night.

Below is a list of points I noticed that explains why I am so pissed and will never come back again. Let me know if this happened to you. I am usually quite lenient on service and food, but this place is definitely over marketed and not high class at all. Please read to the end to find out how I got food poisoning. Note: I usually take pics but I thought nothing served was social media worthy. Please reference photos from other guest. 

1. We waited at the front for more than 5 mins until the host came to direct us to our table.

2. Our server was in charge of at least 5 tables. Therefore, service was really really slow and of bad quality. The server NEVER asked us how we thought of the food or if everything was okay. Everything felt quite rushed because the server would just put down the food and leave. Sometimes, he would even expect us to hold onto the plates. Also, the way our server collected empty plates and cutlery was VERY messy. Sometimes, he would collect 2 at a time, but NEVER  every noticeably empty plate at once.

3. My brother asked for a different appetizer because he does not eat seafood. The server replies with \"this is a fixed menu and I cannot change the type of food. I  can ask the kitchen and get back to you.\" OF COURSE, the server did not come back to inform my brother his options and presented him with a duck appetizer.

4. Romaine Heart salad - WTF? It is literally lettuce taken out from a bag unsliced, with 2 crumbs of bacon and 3 pieces of croutons. I would have appreciated bite sized pieces of lettuce.  

5. The lobster soup had no lobster. Maybe 2% lobster and 98% potato. Our server did not offer us grated cheese in our soup; however, after serving the table next to us, the people beside us all got offered grate cheese in their soup. I didn't really mind because I'm not a huge fan of cheese in soup anyways, but the server's inconsistency was bothersome.

6. The steak was the best part of the meal. However, when the server asked my mom if she wanted salt or pepper, the server gave my mom salt after she had asked for pepper. My mom has high blood pressure so she cannot eat too much salt. In the end, she had to trade her serving of steak with my dad. 

7. Questionable dessert - The server literally put down the dessert and did not explain to us what it was. We were curious because the Groupon menu only said \"dessert.\" Anyways, the \"dessert\" was a mock plant. It literally looks like a plant and inside the small plant container, was lots and lots of cream and chocolate crumbs at the top to represent dirt. I was thoroughly disappointed because they literally put no effort into it. 

In the end, the meal costed me ~$240 for four, using two Groupon. I was 30% full and was not satisfied at anything (food and service). Going home unsatisfied, I decided that Day and Night was just worth a try and that I will never come back again. However, the next morning I started vomiting and having diarrhea and later in the day, my parents had the same symptoms. However, my brother was fine. The only reason that can explain this is the Oyster all 3 of us ate from the appetizer. We had all gotten food poisoning from not fresh Oysters at Day and Night. And OF COURSE, feeling so shitty, this triggered me to write this review

Overall, everything about this place was disappointing. I was very close from tipping an unreasonable amount. Please go to Day and Night with caution (good quality and service). If I were to pick again, I rather spend my money at Copa Cobana or Dragon Legend."}
{"text":"This one is much better than the one on Steeles. The food was perfect and service was great.. Except the price and portion. I can easily get something with the same quality with bigger portions for the same price. 

Go for the experience if you haven't been there. I don't think I'll be going back again. I went for my gf's bday, so no choice lol"}
{"text":"I'm surprised this restaurant doesn't have a higher rating. 
My boyfriend & I went here tonight to celebrate his birthday. When we first walked in I was really surprised at how chic and modern it is. It's a smaller more intimate restaurant, which I love. 
Our server was very professional but also tried to joke with us. I enjoyed having him as our server. 
Oysters were on half price so we got a dozen. Our server picked out 3 different kinds for us. All great. The presentation was beautiful! This restaurant really takes pride in their appearance. I loved their glassware. 
We ordered steak as our main. It comes with soup or salad. We both got the lobster bisque. It was good. Piping hot which I also love. We ordered mashed potatoes to go with the steaks, $4. We shared the mashed potatoes and I had a hard time finishing my meal. The steak was thick!! I thought it was excellent. 
4 rum & coke, 2 soup, dozen oysters (on special), 2 steaks & mashed potatoes $116 with tax. 
We will be back!
TIP: If you're going on a date this would be a good choice if they like seafood & steak. Very romantic & fun atmosphere. There's also set menus and free parking."}
{"text":"Well to begin with the place is very nice and the service is good. The food is good but the steak is still a 3 star. The sea bass is really good. The salad is so so. The lobster soup is good. OverLl it's a 3 and half star."}
{"text":"I had many Day & Nights to think about this Steakhouse experience...  The building location is isolated, the decor is romantic, the menu on paper is an absolute steal, all these external features make for a promising night so why do I despise this place?  Three words.  Service.  Food.  Time.

$50.00/person course took a lot more effort to get the order than I've encountered before, it's as if they don't want you to leave while they don't want you to pay money for anything.  When was the last time I waited 30 minutes and went to the restaurants kitchen/bar to flag down my own waiter and tell him I wanted to order my dinner?  

Romaine Heart Salad came after another painful wait time and they literally burned the bacon bits with an atomic bomb.  I'm sure you agree with me that no self respecting kitchen should ever burn bacon.

On top of that, it was a salad with a couple whole leafs of lettuce some shaved cheese and hard as rock croutons served with your own choice of pour your own damn dressing.  Trying to cut the lettuce with a dull knife burned a lot more calories than I was going to consume.

After another while, Oysters Appetizers but that took much longer than I expected considering they're a Raw Bar and had to shuck 6 Oysters.  Soup, you would think is straight forward but not when they came with Lobster Bisque all around while one of my friends ordered French Onion.

After two or so hours in the restaurant, we were worn down and by now wanted some meat, pay and never come back again.  How often would you hear someone want to leave before they eat their steak at a steakhouse?  

Ribeyes came, not as tender as one wishes but by now you could've served us dirt and we'll eat.  My friend didn't even bother reminding the staff about his vegetable side order request.  Dessert was Tiramisee-you-never-again.

Three hours after we step foot into the restaurant, we saw the night skies once again and what a lengthy adventure it was.  It takes a lot to piss me off, so the good news for Day & Night is at least they're successful at something."}
{"text":"My family and I came to celebrate our 20th year of coming to Canada. 

The server was very friendly and willing to help us navigate the menu. This restaurant is very date-worthy so if you have a special someone in mind, the ambience is just perfect. 

This restaurant is known for raw oysters but as they are not in season, we didn't order them. We had Berkshire pork and lamb. 

My lamb meal came with a welcome drink (peach juice kind of thing?), appetizer, salad, soup, garlic bread, lamb rack, dessert, and coffee/tea. 

I had the smoked duck breast and omg it was delicious. It doesn't taste anything like Chinese bbq duck but the game taste is still present. I think the alfalfa sprouts helped freshen up the taste and not make it as heavy, as duck is a pretty heavy meat. I loved it so much. 

The mixed greens was a huge salad but tasty. I love that they give you the entire salad dressing tray so you can mix and match however you want. 

My lamb was well done and juicy but all cooked. I loved it. Seasoning was a little on the light side but I guess it helps not to overwhelm the natural lamb taste. 

The Berkshire pork is not worth getting. We got it because we never tried but it's just tougher pork (because they're wild?). 

My mom's lamb rack was requested to be well done like mine, but hers was actually not. It had juices coming out so we were a bit disappointed. 

I wouldn't recommend dinners ($48/person), but it's a nice place to get drinks."}
{"text":"Very beautiful interior decor. Their crystal ball chandelier is about 20 ft tall, which is so amazing! Even if you don't need to go, please check out their individual washrooms, they are all different, and have LED lighting in each one. The place feels very very lively. We went on a Saturday night. The oysters and scallops were very fresh! We were only there for drinks and their raw bar. The experience was perfect. Our server was very attentive and knowledgeable about the different oysters and gave us  little background info on each one. Thank you."}
{"text":"Meat is high quality.  Seafood fettuccine is good too, one of my favourites.  Only disappointment is the lobster bisque that has gotten worse over time -- first time I had it (less than a year ago?) it was amazing, thick and full of lobster flavour.  Since then though, its been watered down and runs like it too.  Perhaps it was the groupons..."}
{"text":"It's been abiut 4 years since I eaten here but I have to say the quality is just as good as I remember. They have actually expanded to include a full seafood and wine bar including oysters, urchin, geoduck, lobsters and crab. We had the foie Gras set dinner for $50 p/p. The oysters were delicious. The salad was ok. The lobster bisque was creamy but only had one piece of lobster meat in it. I had the NZ lamb and my spouse had the strip loin. Both were cooked to perfection. And the mango ice cream pastry dessert was light and satisfying. Service was spot on. I can't really fault them for anything and I'm usually pretty picky. This place is not busy either which is great Cuz I don't like a lot of noise from too many people talking"}
{"text":"Came here for a family dinner, atmosphere and decor are decent, the lights are pretty dim, so you can't honestly see too much. 

We each had a set course. For starters there was a salad, lobster bisque, raw oysters, and foie gras.  Portions were surprisingly small, but the actual quality and presentation of the food was wonderful.  Along with the tiny salad, they had a a bunch of small jars of salad dressing you could try out - definitely something neat! Oysters were very fresh as well.

As for main course, tow of us had a steak, another one, a lamb rack.  The steak was cooked to perfection, the cut was thick, but it was still juicy and done as we had ordered it, which was medium well.  It wasn't too raw and overall very tender still.  My lamb rack was also done very well, not too raw, not overcooked though, juicy and marinated very well.

Dessert fell rather flat, as their cake/teas were mediocre and nothing special.  Compared to the rest of the meal, their dessert was definitely below the calibre of the other sections.

Overall though, servers were very attentive and the food was generally great.  I'd definitely come back on special occasions as the price is higher than your average dinner."}
{"text":"Our server was amazing! His name was eric. He took the time explaining each dish as he brought it out. The time between each course was minimal. I purchased a Groupon just to check it out and I was very impressed with the entire place! The foie gras was amazing, the soup was great, the steak was cooked to a perfect medium, the dessert was sub par. 
I highly recommend  this place to anyone would is looking for a special place to celebrate any occasion it really does enhance the moment. 
I will definitely be returning in the future"}
{"text":"I took my girlfriend here for our anniversary after seeing the amount of groupon buys I thought it would have been a pleasant experience 6 course meal for 85 vs reg 150 which is what they said. 
So I made the reservations a week in advance and the evening we arrived we had to wait 15 mins for a table. So that was the first issue.
2nd issue was their was a hair on my gf side plate when we sat down finally. They were informed and changed it.
3rd they did not offer us any specials or catch of the day for any appetizers we had to ask about their oysters and the waiter didn't even know himself so he went to ask someone else
4th the first appetizers were ordered and he brought hers and not mine so I was sitting there waiting for bread and mine
5th the foie was on a store bought cracker 
6th the duck liver was not deveined !
7th the soup was thick like gravy and tasted like uncooked corn starch 
8th the main course the rack of lamb was raw in the middle and not medium rare it was pink and uncooked 
9th the dessert said choice of dessert but when we asked he said only tiramisu which was frozen 
Worst experience ever eating out and worse anniversary dinner imagineable I felt horrible I brought her there
Thanks a lot groupon I recommend never dinning there! I will never use groupon again for food outings"}
{"text":"The steak is not worth. Do yourself a favour and stick with the raw bar.

We made reservations for 8 people ahead of time, arrived 5 mins early, but still had to wait 40ish minutes to get a table. Two of us got the got the $50 prix fixe dinner.
 
The 6 oysters were good, probably the only thing we really enjoyed.

The Angus tenderloin was not great. My friend got a tiny blackened lump of steak, she asked for medium rare but it was a bit too cooked to be classified as medium rare... Mine was supposed to be rare but it seemed like it was blue rare. It was pretty bland and tasteless. The steak had a pretty mushy texture. Very strange.

The dessert was a tiny square of frozen Tiramisu that had not completely defrosted. They probably bought it from Costco or something. The coffee they served us at the end was pretty good.

Others at our table felt that the oysters and fois gras were the only things that were really worth going there for.

TL;DR: Only liked oysters and coffee. They try to appear upscale, but the entire dining experience felt cheap."}
{"text":"Used a groupon and came here like many diners on yelp and in the restaurant with a $65 3 course meal for 2.

The appetizer Foie gras  was delicious. The salad was just mixed greens and choice or dressing. The soup we had was lobster Bisque and it was so so. One piece of lobster with a thick broth poured on top. It honestly tasted very bland. 

The steaks were great! Cooked just right and were very meaty. The steak only came with 3 small pieces of zucchini which neither me nor my boyfriend like so it was a little dissatisfying eating a whole steak on its own!

dessert was 2 small pieces of mousse cake one mango and one chocolate strawberry. Both were a nice touch to finish off the meal.

Atmosphere was so pretty and the wait staff were attentive and professional. The music was a little loud and i believe the song was on repeat because there was an awful lady singing the whole night through the speakers! It can be a little tricky getting to the restaurant if you park facing kennedy like we did. We had to walk around and then up the stairs to find the main doors.

nice place and I would come back again :)"}
{"text":"Soooooo goood omg beef tenderloin and steaks did not dissapoint. I had all steaks from their menu. Went here once a week and it is just amazing."}
{"text":"We had a bad dinner experience at this location, mainly due to the poor service. 
The Day & Night Scarborough location is so much better in terms of food & service.

Our waiter, Chuck, was extremely rude and gave us poor service. I don't even know if he thinks his rudeness was being sarcastic or something - it came off as just plain rude. We've visited this location many times before but never had him serve us until now. If we ever decide on coming back to this location, we will request to not have him as our server.

I ordered the jumbo shrimp salad, foie gras, sea bass and dessert.
The jumbo shrimp wasn't fresh - will not order this again.
Foie gras was over cooked.
The sea bass was okay though.

We will probably not return to this location."}
{"text":"This is great for the groupon.
Atmosphere and ambience is excellent with beautiful table settings and a gorgeous chandelier in the middle of the restaurant. 
The food isn't spectacular, but definitely on the nicer side of things.
I appreciated the ability to order half a bottle of wine, which was more manageable for my date and myself."}
{"text":"Let's cut to the chase (for those that read only 3 sentences of each review)...would I go again?  Yes.  Was it the best restaurant ever?  No...but you can compare it to your typical \"Cruise Dinner on Royal Caribbean\".  So for those that cruise...you'll get a pretty good idea.

We had a groupon as well...went as a family of 5, with 3 kids.  This restaurant is for adults, but the waiter was very good with our children.  Don't expect a kid's menu or a high chair...that's not the kind of place this is.  They respected the groupon and didn't make us feel like we were any less a paying patron, and had a special menu for it....which means, groupon is a normal marketing channel for them.  So wait for a groupon if you want to try this restaurant.

If you just walk in, there is a set menu that is very much like the groupon, at $45/person.  With this option, you get a welcome drink, and a coffee at the end.  You don't get that with the groupon which is about $35/person.  So you decide if you want to wait and save the $10/person, or get a couple of drinks with the extra $10.

Oysters were great...lots of choice.  Mondays and Tuesdays are 1/2 price...so go on those days.  It comes to about $1.50 each with the special.  

The Romaine Lettuce salad was superb.  You put it together yourself, and you get a little bowl of REAL bacon bits!!!  They grind fresh parmesan for you...so a star for that!

The bread seems fresh baked...crispy on the outside, soft and steamy on the inside.

The soup (Lobster bisque) was OK.  It was probably the least inspiring of everything we tried.

The steak was very tender.  Loved it.  It doesn't come heavily seasoned, so if you're a \"Salt and pepper\" guy, you'll have to put more seasoning on it yourself.  But if you just like the beef \"au naturel\", then it's perfect!  They got the \"Medium rare\" just perfect...no complaints here.

The rack of lamb was very good.  This was seasoned much more.  I guess not everyone likes the \"natural gamieness\" of lamb...so the mint sauce and the extra seasoning was done very well.  Medium is the rarest you can get it...they got it spot on.

The dessert of the night was a \"Tofu cheesecake\".  First time trying that...and probably last time.  For dessert...I just prefer something really sweet, and this was not.  It left me wanting a chocolate truffle or something.

The ambiance is definitely for couples and business meetings.  It's nice and quiet...anything but a \"Chinese restaurant\".  One can talk normal, and it would seem too loud in that place....which is perfect if you want to just have a nice dinner with your spouse and talk.  

No complaints about the service either....it was as expected for a fine dining restaurant.  They were very courteous, polite, and attentive.  And yes, if you're Chinese, they will probably first speak to you in Chinese...but don't take offense, it's a cultural thing to show respect to address you in Chinese first.  Chinese-speaking folks would be offended if the wait staff addressed them in English first...so just understand there is no winning for them if you're easily offended either way.

Back to my first paragraph...would I come again...yes, and looking forward to it.  This time, no kids...just the girlfriend (which would be my wife).

P.S.  I've been to the other location as well (on Fenton)...This one is many times better (décor, service, and food), so only go to this one."}
{"text":"I went to Day and Night for the first time last evening with my XO.  The restaurant was about half empty and the greeter explained that it was slower because it was the Labour Day long weekend.  

GOOD: The decoration was nice.  Food tasted good and was fresh.  The beef was tender (I order Filet Mignon).  Good service from beginning to end.  We chatted for a long time after paying the bill, and no one rushed us out.  It was good value regardless of whether you order the set menu (my BF did) or a la carte (I did).

BAD:  Chilean Sea Bass was on the menu.  Chilean Sea Bass has been suffering from serious over-fishing and low stock.  Most stocks filing the supermarkets and restaurants are either illegally fished and/or caught from unsustainable fish stock areas.  Most respectable and conscious restaurants and chefs in Toronto and North America do not serve this fish.  I find it unacceptable that any \"nice\" restaurant will serve this item.

I will come again but will not order the Chilean Sea Bass.  I hope they will take this fish off the menu."}
{"text":"The recent Groupon is not a good a value as promoted.  The stated value of $146 is inflated and exaggerated.  The restaurant also overcharged me on HST (based on value of $146) and there was pressure to tip at the inflated value shown on the bill.  I did not have a pleasant experience at the restaurant."}
{"text":"The short version of the review:
steaks are really good, service is attentative, price is on the high side and portions were small so I left the restaurant not 100% full.

The long version of the review:
Chinese run restaurant with a western feel to the decor. Meal starts off with complementary bread.

I myself got the $50 meal and opted for the following:

6 raw oysters - decent size, fresh and tasted what an oyster should taste like

Organic mixed greens salad - very small and came with a varity of dressings to choose from

Lobster bisque - had a small chunk of lobster and was okay in terms of flavour but I have definately had much better lobster bisque soup elsewhere

Certified Angus Tenderlion - the meat was soft and tender and tasted great but I believe they only give you an 8 ounce which was a bit small for me

For dessert you get a super small cube size Tirimisu and mango cake. This is the same crap (excuse my language) you would get at Chinese grocery stores or at Japanese AYCE restaurants.

Coffee or tea is part of the meal and I went with the coffee which according to my father is crap. I'm no coffee expert but my father on the other hand has drank coffee all his life and considers the coffee served here worse than instant coffee. 

Our table also got the $45 meal with the rack of lamb. The lamb was done very well. Really soft and tender. 

Aswell we got the Nordic seafood rice with lobster bisque soup for $26. Nothing really worth mentioning here but not worth the money.

I also got the chance to try the smoked salmon and moulard duck breast appetizers. Super small thin slices for both. Nothing good worth mentioning here either.

Overall I would say there were more misses than hits. If I pay $50 for a meal to any restaurant whether high end or low end I expect to leave at least with a full stomach. It didn't happen here even though I stole a piece of lamb from my sister."}
{"text":"I've been here before.  I've even been a fan since they had their start at 2 Fenton Road.  Then, after a period where they no longer opened, my family and I had visited this location instead.  However, it's been more and more apparent these days, it's no longer the hands down favourite it  used to be.  What could have possibly gone wrong?

All good stories need to be told properly, so let's give it a proper start.  From humbling beginnings, this all started as a simple restaurant on Steeles, east of Midland. Back then, they offered some relatively affordable meals, used simple decor, and showed the use of real firewood, even offered a salad bar to go with their variety of meals. People flocked towards this tiny little restaurant, only frustrated because they couldn't get a table.  Things were great.  They weren't too big on lunch service, at first, but soon, that was offered too.  The ambiance was relaxed.  Spanish/Caribbean music was playing, and the interior was designed as if it was holed out of a rainforest.  That's when it must have changed upper management, because in recent years, especially after purchasing this location, they began a more upscale style of dining.

Good food is without a doubt a fantastic welcome.  They've always offered fantastic steak that you couldn't say no to.  Well, unless for religious or health reasons, you couldn't eat beef, it's a different story.  Even if you were a fad dieter, you would find it difficult to reject this.  So, the main courses were definitely a sure win.  Their service needed a little bit of touch up, but more importantly, they now have a bigger and nicer restaurant to work with.  They can transform the space in the middle into the raw bar that would surely attract many more people, and open up the doors to more than just a large group of Chinese people.  After all, a Chinese-run restaurant tends to usually attract a larger Asian crowd.  With more flexibility and more options, they've clearly opened up the doors to non-Asians as well.  

I guess this is where problems begin.  The old prices and menu are no longer in effect.  So, we're making do with the new one.  It seems like there was no one watching the door and inviting guests in.  We stood at the door wondering what's going on inside, as it was still 6 pm.  None of the other people working in the restaurant made an attempt to acknowledge we were waiting to be seated.  Strike 1.

The seating as expected is strange.  As this location is built in a circle, they've made an attempt to put as many seats as possible, and I think that might have made it slightly cramped.  One server did adjust the seating room, but only because the party to our left was a larger party, thus they pushed the tables together, thus generating more space, and allowed us to be further from the next table.  It's an understandable sign that people are willing to come here more often, thus the need for more seating, but at the expense of less space between tables, I can't say I'm content with it.

Oh, and why the high amount of covers in a night?  It seems that their constant run of the Groupon deal is bringing people in.  The meal offered is actually quite impressive, but considering it's a Groupon deal, I can't help but think no one really goes there at full price for a reason.  That leads me to the next bit.  It's just absolutely expensive here.

Then the question of the food.  I can't help but feel something is missing on my plate.  There's no better way of putting this, but there used to be a lot more vegetables.  Now we're down to 2 slices of zucchini.  I'm not quite sure I understand why there's just 2 slices of zucchini to accompany my 8 oz. steak.  Is food so expensive that I had to be charged a huge amount for a steak, and get only 2 slices of zucchini?  It just doesn't seem right no matter what high end restaurant you're going to.  Is it so difficult to learn to cook some other type of vegetable? Strike 2.

I guess it can be summarized like this, and it works well for football fans, as the review runs like this: it's like a game with Chelsea FC.  They do steak, and most of dinner well, much in the same way Chelsea does football well, but they're by no means stellar.  They play what can only be defined as boring, pointless football, while flashing about their expensive squad full of talented players with no real means of making any effort to show football can be enjoyable. I guess Day and Night is much the same. Flaunted are the decor, the cutlery and the prices, but it's not really done with a flair that makes you beg for more.  You sit back feeling bored, and when the food comes out, it doesn't exude joy towards your eyes.  

Much as I want to be impressed, I just am not."}
{"text":"Went with husband with a groupon. Server doesn't give you attitude for using groupon. At the end of the meal, you will pay the tax $11ish + tips. The restaurant is a little too dark. The center piece decor at the seafood bar was nice to look at. It's a nice quiet restaurant with soft music. 

Strip loin was awesome! Lamb was great! Both are very tender and juicy. 
Husband felt the Strip loin was better than the Keg's. you get about a fists size of meat, not much fat to it.
The lamb maybe its a baby? because the bone is so tiny, I've got 5 pieces (half rack?) and there's a big piece of meat on it, like a ribeye, so that's good!
The main courses' portion was good size, it would have been prefect if we get a bit more veggies on the main course, there were only 2 pieces of zucchini & a chive.  

1st set of appetizer we had the smoke salmon & smoke duck, the portion was small, 1 piece of each wrapping 2 baby romaine lettuce.
2nd appetizer we thought to give the Pan-seared foie gras (duck/goose liver) a try even though we are not fans of livers. The liver was super greasy, the bread underneath it is soaked; the taste is acceptable, not dry. It came with a little salad and the dressing was balsamic vinegar. 
We had the shrimp cocktail as the other appetizer, which is great.  The shrimp was big and fresh and you get 3 pieces of them along with a little Cesar salad & balsamic salad. Wish I had this instead of the Pan-seared fioe gras. 
The lobster soup, in my opinion, is better than the onion soup as the lobster flavor was strong; the onion soup on the other hand is lack of flavor and the fried onion was fried too hard rather than crunchy.
Dessert was Napoleon pastry with vanilla ice cream and strawberry sauce. It was alright.

Overall, the dinner was great especially with the groupon deal."}
{"text":"I purchased a Groupon dinner for 2. 

 I read all the restrictions before purchasing this Groupon. I then tried to make a reservation. The first question they asked if we were using Groupon. If we were, then there was no room available. The availability was only reserved for non-Groupon customers. This was never mentioned in the rules of the Groupon. I didn't realize coupon customers were 2nd class. Grouping refunded my coupon and I will never try this restaurant again."}
{"text":"I have been here a few times now and the staff seem pretty friendly. The reason why I am giving them 4 stars is because the food was pretty average. There is steak but its not as great as a steakhouse. There is racks of lamb but the quantity just wasnt up to my standard.
The one item i had on the menu that made me suprised and wanting more was the nordic rice. It had the tomato-y taste along with seafood that was fantastique. I am guessing its because the seafood is pretty fresh. 
The four stars is for the nordic rice. Always try something new is my motto."}
{"text":"Had a nice dinner here recently. But the food did not really impress me all that much. It was good but I felt like I was eating Dickens/ Firefly food (better) but in a much nicer and beautifully decorated mod environment while things were put in nicer dishes (smaller portions) and prices inflated. The place does have potential to be a 4-5 star imho! 

Service was excellent. Though our waiter kept taking away my utensils when I needed them but no biggie.

I wanted to order the set menu but did not want to indulge & overstuff myself. So I ordered the Salmon for the entree (nice dill sauce). I liked that it was crunchy on the outside but the inside was slightly on the drier side. The soup (lobster bisque) was nice but not creamy enough. French onion soup could be tastier. I feel like a lot of places cheap out on ingredients. I like that they are all fancy & pour the soup in front of u. The complimentary buns were nice & toasty warm...exactly how I like them :) I got to sample a bit of the smoked salmon from the set menu appetizer & it was very nice and fresh but that might have been the only thing that impressed me the whole night. I think Simon C will agree also.

I don't mind coming back at all. It is a beautiful & clean restaurant."}
{"text":"Really quite nice for the location.

Great prefixes to choose from, excellent selection of oysters, great wine list, top notch service - you can't go wrong here. Focus is on seafood and steak, so really, why not?"}
{"text":"I cannot understand why this restaurant doesn't have higher ratings! As a result, I've decided to start a yelp account solely to give this place the credit it deserves. 

Walking in, the restaurant was much larger than it appeared from the outside and had a sophisticated interior design. We were immediately greeted by the host, seated at our table and given our set menus to choose our soup, salad and entree. 

My meal consisted of:
 1. The pre-set appetizer trio of foie gras, oyster topped with caviar, and smoked salmon. Topped with gold flakes and set on a toasted slice of baguette, the foie gras was very buttery with the perfect consistency. Hands down my favorite of the trio. The raw oyster was very fresh that there was no prominent fishy taste that most cheaper ones have and had a generous amount of caviar on top. Lastly of the appetizers was the smoked salmon. Like the oyster, it was very fresh, mild and wasn't too fishy. 
2. The salad options were romaine hearts and mixed greens. I had chosen the romaine that came with homemade croutons and bacon bits. In addition, we were given a flight of salad dressings which was very well presented and came with many different choices. Not much to say about this dish since it was pretty simple but the croutons were good and the salad was crisp!
3. The soup options were between lobster bisque and french onion. I had ordered the lobster bisque but was a bit surprised/confused with what was brought out. They first bring you out a dish with a scoop of lobster pieces before they pour you your soup. Prior lobster bisque I've had usually were pink and on the creamier side, almost like a clam chowder. This soup was brown and a bit thinner than chowder, rather it was similar to more of a gravy in both color and taste. Though I wasn't use to this type of bisque, I didn't mind it and actually quite enjoyed it. It had almost a meaty taste that I cannot properly decipher but did not lack in lobster flavor.
4. The entree options were a sirloin steak, rack of lamb, and salmon filet. After much deliberation between the lamb and steak, I decided with the rack of lambs. It was presented beautifully. Garnished with thyme, grilled zucchini and sauce on the side, it was probably the best I've ever had. They did an amazing job charring the outside while keeping the inside moist and was nicely cleaned. My boyfriend had gotten the steak and given me a piece to try and that too was delicious! Mild in seasoning but so moist and buttery, I still cannot choose as to which I liked better.
5. The chef's choice of dessert for us was a Napoleon. I'm not quite sure as to what that even is, but what we got were two puff pastries drizzled with chocolate sauce sandwiching a scoop of vanilla ice cream and slices of strawberry. The plate was nicely decorated with a strawberry compote and the dessert was strategically stacked to resemble a tower. I'm was never one to have a sweet tooth so the dessert was okay for me. A bit too much pastry for me in ratio to the ice cream, but not too bad that I didn't eat it or hated it. 

All in all the menu was pretty great in my option and really worth the money! I would 10/10 definitely visit again if I were in the area and bring friends and family. Our waitress was amazing and so sweet. She was timely with changing our plates and silverware and it was a pleasure!"}
{"text":"Their steaks are okay but their oysters are pretty good with the price."}
{"text":"- 6 course groupon deal (actually only 5 courses) 
- All courses were fantastic
- Server was pleasant 
- restaurant was clean and modern looking
-children in restaurant were quite loud and distracting. This is not the restaurants fault, more so the parents."}
{"text":"Mediocre steak place! If it wasn't for the groupon I wouldn't come back! Service is mediocre but they try to charge fine dining prices! No wonder they have to offer groupons! My mom & I ordered a medium & medium well but when they arrived at the table both was practically well done! Doubt I will ever come back again!"}
{"text":"Decor and atmosphere is unarguably good. Food and service however... 

You might be fooled by what it looks like inside compared with the food there. The place is pretty alright, right down to their washroom which has stars and stuff all over their ceiling. But i didnt come here to eat their washroom, i came here for their food. Day and Night Steakhouse - so i decided to try their steak and lamb chop racks. Steak was pretty salty but tenderness wasnt bad; came with a side of gravy so i tried to cover the saltiness with gravy... yeah. Lamb rack's tenderness was ok too, not amazing, although a bit on the small side. I guess they are Asian after all.

I felt RUSHED and slightly annoyed with the service. The plates came one after the other without us even finishing one yet. At one point i simply left the next plate on the corner of the table until i was done with the one infront of me.  We came with a Groupon promo so not sure if it has anything to do with that. 

At the end of it, it felt like they're trying to be an Asian fine dining restaurant with a western feel. It was not a horrible experience but considering the price we paid i wasnt satisfied with it. Work on your basic fine dining service first people."}
{"text":"Love coming here for a nice meal!
The perfect place to go for a date or fancy dinner with friends and family!

The meal sets are always a good choice so I would recommend going with those instead of ordering single dishes.

I'm pescatarian, so I usually get their sea bass which is DA. BOMB. For real, you actually have to go try it because it's basically heaven inside your mouth.

The service is very nice and I can sit here for hours without ever feeling rushed to leave! The only complaint I have is that it can be hard to wave down a server sometimes.

There's really nothing much to say but just TRY THE SEA BASS. TRUST :')"}
{"text":"3 stars for food and an extra star for our waiter.

My family wanted to have a New Years Day dinner and we called in for a 7PM dinner but was told there was no space until 8PM.  We arrived around 7:30PM since all the malls have closed and we were going to just check out the menu until our table opened up.  
Turns out the restaurant was half empty.

Our waiter was amazing. He spoke fluent English and Chinese.  He was very patient with our table as sometimes my mom likes to change her mind 3 times within one minute & I'm very impressed with how he handled her indecisiveness.  He always came by to check on our table and refill our bread.  He even asked why I wasn't eating my steak (I was too full from the appetizers) and if he should take it back to the kitchen to be re-done.  

The food: We ordered the $220 dinner set and 4 of the $55 with a dozen of Valentines.
The Valentines were delicious but nothing brag-worthy, especially at $18/half dozen.

The bread was warm yuuuuummm.
The seafood appetizer: 
- Lobster sashimi (absolutely no taste, but the texture + wasabi was dynamite)
- Crab leg: watery and tasteless as well
- Abalone: I rather cook my own
- Mussel: like the ones you find at Mandarin
- Oyster: I believe they were the Valentines as well and meeeeeh.
The appetizer for $55 set menu: I enjoyed it a lot. The shrimp seemed fresh and the smoked salmon was delicious.
The lobster bisque was delicious.  They put a couple of pieces of lobsters before they fill it up.
(do not get the French Onion, it tastes like hot dish water mixed with onions lol)
The steak was nicely cooked (medium rare) and I would've destroyed it had I not been so full (took it home).
Tiramisu for dessert - meeeh, I believe they make them the night before or in the morning as my tiramisu cream was frozen when served.

Overall, this place is a little wanna-be high-class.  They do need to improve on the quality of the food but the overall ambiance is nice (especially the oyster bar in the middle)."}
{"text":"Go here for the experience only. Food is way over priced even with the Groupon deal! Renovation was 10/10 but that's just the superficial stuff, worth one star. 

Service could've been better if the waitress doesn't have a heavy accent and decide from the get go whether she wants to talk to us in English or Chinese! 

Now the food, where should I begin? Oysters... I guess you can't go wrong with this. Additional star for freshness. 

Salads... the variety of dressings which hopefully are not reused as my mom said she saw someone dip and double dip their lettuce leaf. 

Soups... I believe there're only 2 choices; lobster bisque or French onion. Very gimmicky as your bowls are filled with some mushy mashed potatoes (lobster bisque) or some pre-made cracker like onion and cheese (French onion), then the soups are poured from a kettle into your bowl which looks like gravy. So, skip it if you don't like drinking gravy. Yes, it's that horrible! 

Angus steaks are suppose to be their selling point, it was tender but blend. It came with the steak alone on a thin slice of zucchini and NOTHING else. 

If you ended up at this restaurant by force, I would recommend getting the sea bass instead as it was delicious. Star for sea bass!

Definitely not worth a second try as this is nothing but a high end dining wannabe!"}
{"text":"Absolutely terrible experience. They advertise the oyster special and by the time it's 9 pm they tell us it's all sold out.  The steaks were okay but they didn't have the 16 oz t-bone so I had to get the 20 oz, then 30 minutes later they came back to tell me they didn't have that either, so I had to settle for an 8 oz striploin.

The lobster bisque was essentially a bowl with 2.5 chunks of microwaved lobster, and they brought a tea kettle with a brown-colored soup and just filled the bowl with it. Looks and tasted disgusting.

To top it all off, their water cost 5 dollars per bottle, and they didnt have dinner napkins because \"the cleaners forgot to deliver them\"."}
{"text":"I thought it was excellent ! Reminded me of the Hong Kong steak and seafood places there .. I thought the prices were excellent for a 8 course meal the oysters very fresh and love the oyster bar the entire bar was filled with ice and fresh oysters from around the world very well priced and delicious... When they bring them to the table they use beautiful tray with dry ice lcd lights really pretty ... The scallop was very fresh sushimi lobster bisque food, salad with choice of 8 dressings , steak yummy and great dessert and fine coffee ... Cocktails well done and nice wine selection makes this a northern gem ... Well done I will be back"}
{"text":"I am even surprised myself that I am giving a 4 star to this newly opened Day & Night Angus Steak and Raw Bar. 

Yes this is a Chinese owned and operated steakhouse.... but no there is nothing really Chinese about this business from the decoration, attention to details and good quality of food... maybe the only Chinese thing about this place is it is good value if you are into steak! 

Lovely deco and table setting! Love the booth seats, great degree of privacy and quite romantic with the dim lighting...(suck though if you want to take good photos!) 

There are quite a few 5 course menu starting from $45 (if you are into steak order one of those) or you can order a la carte..... we decided on: 

Set menu ($50) that includes: 
- Welcome Drink: Virgin Pina Colada
- 6 assorted oyster 
good choice of Chef Selections, nicely presented, but the waitstaff just would not explain to me what I am having.... I eat a lot of things, but I sometimes would like to know what I am eating... I  know they are oysters...
- French Onion Soup 
Chicken broth based with browned onions and a touch of cheese. Not salty but have good depth 
- Romaine Heart 
Real bacon bits, dressing on the side 
- 8 oz Angus Beef Tenderloin 
With great selections of veggie on the side... I would suggest the beef to cook rare 
- Tiramisu 
- coffee 
freshly brewed by the cup and served in a warm cup 

BC grilled Salmon ($19) comes with a choice of salad or soup 
- Organic Salad was disappointing as it was like supermarket package salad... soup will be a much better choice. Great selections of dressing on the side.. 
- Salmon was nicely done... cooked and seasoned well with a nice creamy dill sauce, surprisingly not dry or fishy at all 

Services was attentive and polite. Food served hot and fast! 

They have a special after 9 pm when oysters and seafood are for $2 each and the selections are great! 

I think I will be back for some oysters?!! They opens till 1 AM everyday... anyone want a steak at 11 pm uptown, now you know where to go!!"}
{"text":"Just went back for a second time and had no problems with the food or service! Love the atmosphere and will be going back again sometime soon"}
{"text":"Not sure why I'm seeing the number of negative reviews here, as the meal I had last night was fantastic. 

This was my second time eating at this restaurant and I started worrying about their declining quality due to some of the reviews I have read, but was proven to be wrong. Let's talk about the food:

Fois gras - perfectly seared on the outside. The fat and juice gushes out when I bite into it. The timing of the cooking must've been impeccable to create this wonderful taste in my mouth. 

Oysters - served on a plate of ice with LED light beneath. They were super fresh and were nicely shucked. No grains whatsoever. 

Jumbo shrimp - also very fresh. Served with a light seafood sauce. 

Lobster bisque - I love how they pour this out of a teapot to keep the soup nice and hot. They started out by putting pieces of lobster in your bowl and then they pour in the soup. Good flavors, they reduced the amount of salt from since two years ago, so I'd say this was an improvement from what I had before. 

Tenderloin - served on two large slices of zucchini. By the way, whoever was complaining about the the lack of slides/vegetables must've never experienced steak in a fine dining restaurant. If you want more sides, you can pay extra money to get them. This is not a Hong Kong style cafe (???) you know. I ordered it medium rare. The exterior was nicely crusted and seared with a bit of salt. The chef timed the grilling really nicely, because even though the steak looked well done on the outside, the interior of the steak was nice, pink, and oh-so juicy. I really could've gone without the au jus but man, that was really good too. I was pretty full by the time I finished two-thirds of my steak, but it was so good that I couldn't help but to finish it! Otherwise it wouldn't have done that steak much justice. 

Dessert - I think it was a tiramisu but am not too sure. It probably came out of a frozen package. Nothing impressive here but hey, I didn't come all the way here for a dessert. I would recommend the restaurant to serve something simpler, like 2-3 scoops of gelato or something. Not that the dessert matters here, but I think they can really finish the meal on a much higher note with a decent dessert without complicating it. 

Overall, this meal was excellent. Don't bother with the Groupon deal. The regular priced menu is totally worth it."}
{"text":"My wife picked up a Groupon for a 6 course meal. I have to admit my expectations were not very high but we were pleasantly surprised by our entire experience. The restaurant is beautiful inside. We arrived at 6:30 pm and finding it almost empty we opted for a booth near the raw bar - it was quite intimate - by 7:30 it was getting busy. Service was excellent, and the food was great. Top marks on presentation. I can't believe people only give this place 3 stars. It's definitely 4+ stars."}
{"text":"I went in on Oct 27 with. Groupon for 2 dinner. The ambiance is very unique. You wouldn't expect that from the appearance outside the parking lot. We were greeted right away and sat an a table for 2. They had a groupon menu with various selections. We had 2 appetizers which were amazing! Perfect size and serving Soup was fantastic and when it came to the steak... OMG, what can I say? It was awesome! It's so tender it melts in your mouth! High quality angus steak just like they say. Cooked perfectly medium rare.  
And finished it off with a nice dessert! 
Overall a very great experience ! Fabulous ! Highly recommended!"}
{"text":"We purchased a Groupon for dinner for two for $89 for 5 course dinner. We were happy with the overall experience. Portions were small as expected, quality of food was good (not great).
Foie gras was good. I quite enjoyed the lobster bisque. I was satisfied with the steak, cooked to my liking (medium).  Dessert of the day was a bit disappointing (don't remember the name but it's puff with fresh strawberries and whipped cream).
We went on a Tuesday night and they offered half off fresh oysters. We got a dozen and were pleased with them. 
I like the decoration, and service was fast and efficient."}
{"text":"Location:  
On the second floor of a really cute two story shopping plaza. It's built on a hill so you can drive to the second story. There's parking at the door but its shared with a church. There's parking at the first story. Don't even bother to try and bus it.

Decore:
The first thing you notice about the place is that it's dark, the second, there's a giant oyster bar in the model's, then as you come in the room, you see there's a giant bubble art installation,I think it's has something like 1600 bubbles about a story high (30 feet?) that lights up with different colours. It's pretty beautiful.

Bathrooms are weird. Like 1980s high end club. There are these golden animal heads that line the hallway to the bathrooms. It's hard to take a picture of them because the area has odd lighting. I just have to say it must be really trippy if you were drunk. 

Ordering:
I like the fact they have set meals. There's a la carte of course but I like having to not think so much. There are different price points from forty dollars to two hundred.


Food:
The food is good. It's a great place to be with friends. If you all get the set dinners you have lots of time to chat and catch up. The soup is neat. French onion or lobster bisque. They add broth to dehydrated(?) Food. Kinda neat. The steak is good, not superb but the prices reflect that. It's great for it's price point. Worth a visit, truly.  

Service:
Service is impeccable. Proper, old school, classy, the kind you get if you go to the old upscale restaurants in New York. One thing, its a little weird how this restaurant does a really old fashioned , upscale service, but the bread basket is cheap plastic lined with cheap printed waxed paper. We comment on it every time we come.


I do like the restaurant, it feels special, it's beautiful, great staff, good food, no one rushes you . THis is why I come back!"}
{"text":"I am IMPRESSED. 5 stars. So very glad we came here.

A relative from Hong Kong came to visit my family, so we took him here for a nice dinner out. It is also close to my home, opens late (gosh I love Markham for that), and it looked beautiful.

I was imagining this to be a typical Chinese steakhouse but it was more than that. When you walk in, you are presented with their raw bar: oysters, shrimps, lobsters, geoduck.... It is dark and intimate here. Their washrooms are beautifully decorated (stars on the ceiling). It's trendy and lounge-like. 

Great staff as well. Our waitress (I love you) says, \"You're welcome\" every single time we thanked her. EVERY single time. Every!!!! She doesn't wait until the very end, for example, when she pours the water... she says it immediately. That and she was attentive to details, very polite, made sure we were happy, gave lots of recommendations WHEN WE NEEDED (not randomly, only when necessary), and was very friendly.

==========THE FOOD

My brother and our relative ordered the set dinner $45/per person. They are picky eaters (oh man, so picky) but they were very happy with this deal. They both enjoyed their appetizers (Norwegian Smoked Salmon, and Smoked Moulard Duck Breast), their perfect steak, and the dessert was actually really good as well (Napoleon ice cream cake).

Now, my boyfriend and I wanted to try something MORE than just soup and steak... but we also ordered our own Norwegian Smoked Salmon $13. Very thick smoked salmon -so sooooo good. 

Alaskan King Crab Legs (1/2 lb) $20 -we had it cold. It came in a large bowl of ice (with icey smoke pouring out). There were multi-color lights inside this bowl that change colors constantly, then the crab legs were sticking out of the ice. It looks pretty cool. The crab legs were very fresh, very juicy of ocean water, and the crab meat was generous. 

They have cheap SIDES -and I ordered a Fettuccine for $3. I was told it will be small, but I know this dinner is already very expensive I decided \"YES I will be cheap and get this.\" Turns out, this $3 dish was quite big (like a dish of extra large fries) and it was filling. Perhaps they felt sorry for me and gave me this much? Or perhaps this truly is just $3!!! 

We also ordered a dozen assorted oysters. She said we could flip the oyster shell over if we decided to order this same one again. So we flipped a few tasty ones over, but before we even finished our oysters she came back with a full list of oyster names and their origin. She wrote it down just for us!! She's so cute. 

You know, I remember oysters being $2 each that night. I'm not seeing this promotion again on their website though.

==========VERDICT
*Food: A+
*Service: A++
*Food presentation and creativity: A+
*Price: $200 late night dinner (we also had drinks), works out to be $50 per person.
*Vibe: A+, love that centre raw bar presentation. Love the very low lighting, the sofa seats, it felt intimate and I enjoyed this setting for a latenight dinner.
*Restaurant hours: 5pm to 1am, A+!!! We came here at 9:40. None of the typical comments like, \"Kitchen will be closed at XOXOXO\" and \"We ran out of that, please order lalalala....\"

Oh and visit the washrooms!!

I am not sure if this true, my friends told me to visit their south location near Pacific Mall for a cheaper meal and better food. Whatevs! It's still 5 stars here for me. I truly truly truly enjoyed our night here, thank you so much for having us!"}
