{"text":"My friend and I were wandering around on a very chilly day. To warm up, we stopped in the nearest coffee place we could find - De Fer! Unbeknownst to us, this place just opened last week or so, but it was still a nice spot. Plenty of seating, clean, updated, and friendly staff. My friend got a cortado and I got a chai tea latte. Both were good. If you're in the area, definitely stop in!"}
{"text":"Last time I went to this location, it was literally an entirely different cafe with a different look, feel, service, foods and beverages. I can honestly say that De Fer is an upgrade to what once was.

The interior design is open and inviting, with brick walls contrasted with brightly colored art and seating. There are flowers at each table and even a playroom for kids.

Not only do they sell espresso drinks, but they also sell baked goods, merch and other goods!

The baristas are very very very friendly, nice and super helpful! They were patient and non-judgmental of all my questions and curiosities. Frankly, this is rare among coffee shop culture.

The coffee was pretty good, though the espresso wasn't as deep or bitter as I personally would have liked but to each their own! The syrup, made on-site, is not too sweet but prominent enough.

Would definitely come here a gain!"}
{"text":"So sad that I discovered this place so late in the game! My friend and I came here to get some work done and the productivity level was so high. The atmosphere is calming. Lots of natural floods the two-story shop. The menu selection has a nice variety and is rather affordable. We sat upstairs and absolutely loved it! We both had the grilled cheese which was excellent. I tried the maple cortado, and it was lovely. Then I purchased a carafe (20oz) of coffee for only $5! My only regret is that I wish I would've found this shop sooner."}
{"text":"The music is too loud and people start yelling at each other. Great place but not for working more for socializing."}
{"text":"A great cafe in the heart of the Strip.  I don't drink coffee but the tea selection is fantastic.  The food menu is limited but tasty, and the staff is knowledgeable and friendly.  They also have a cool assortment of locally made food items ranging from maple syrup to pasta to pickles.

The space is large yet still cozy and inviting.  Seating was somewhat limited when we went on a busy Sunday afternoon.  They now roast their coffee on the atrium overlooking the shop so you have a great view of the process."}
{"text":"Good, not great.  It's a mix of 5-star and 2-star...

Okay, I love coffee, and consider myself knowledgeable on the topic of coffee and coffee houses.  Here's my breakdown of this place:

FACILITY - It's beautiful and clean.  Narrow and very deep, I love the old, exposed brick walls and wooden floors.  It feels like what it is - an old, re-purposed space in the Strip District.  So 5-stars for the space and environment.

COFFEE DRINKS - Quite good.  Espresso is smooth with good, golden foam on top, and just enough \"bite\" at the end of each sip.  I like La Prima (also in the strip) better, though...  And, wow, their drinks are expensive (relative to great, nearby competitors).

COFFEE BEANS - I make espresso and other coffee drinks at home, so of course, I grind my own beans.  They roast their own beans here, but are a bit proud of them:  $20+ per pound is almost double what GREAT competitors charge (e.g., Allegheny Coffee & Tea exchange, one block away; Prestogeorge's, also one block away; Nicholas Coffee in Market Square).

So overall, I'm let down by the unobtainable bean pricing, and a bit by the coffee drinks pricing.  I'm no cheapskate, but this place just feels badly to me, and the notion of ridiculously priced beans in Pittsburgh, in the Strip District, like it's tourist-bait, just doesn't sit well with me..."}
{"text":"Love this new coffee/ tea spot in the Strip! Located on Smallman, it's nice that it's a bit behind the chaos that is Penn Ave. I came here two weeks ago, around 3:45pm, without knowing that they close at 4:00pm. I ordered oolong tea, admired the art on the walls, and got comfy. I checked in on yelp and freaked out a little when I saw that they were closing in a few minutes. Vanessa, who owns the shop with her husband, was working and was SO incredibly kind when I asked her if I needed to leave, since they were closing. Since some other customers were in the shop talking and hanging out, Vanessa said it was fine for me to stay too, as it takes a while to break down all of the machines and clean them. How sweet is that? I was able to sip my delicious tea for 45 minutes and work on some school work and enjoy the calming ambiance of this gorgeous shop. I really appreciated that.

Not only is this a coffee/tea shop, but it's a little market! They have tons of local items like honey, bread, oils & vinegars, jams, salt, baked goods, and everything you would need to brew the perfect cup of tea or coffee at home. Not only that, but De Fer is planning on having cocktails and wine in the next upcoming months as well! Once that happens, the hours will be extended. What an awesome concept. 

Truly a beautiful coffee shop, in a great location, with fantastic owners. Can't wait to come back."}
{"text":"A good, new, independent 3rd Wave Coffee joint with a bunch of enthusiastic folks behind the counter in the former 21st Street Coffee location. 

The specialty drinks lean towards the sweet. There's a cortado on the menu, but it's suburban, with maple sugar and whipped cream. The menu will be expanded to include food. Big blank slate boards on the wall suggest they're planning ahead.

Exceptionally spacious, the location seems to encourage lingering. The chairs and tables aren't quite cozy but, it'll no doubt be a fine coffice for more than a few freelancers. Roasting equipment may move in upstairs, I hear. De Fer will not only be blending and roasting beans, but teas. Indie tea blenders are too rare these days. 

On a slow second-to-opening day, I was offered a taste two distinct espressos, ordered a cortado with one, bought a bag of beans of the other. The bag's blend, Sons of Vulcan, is a reference to steel workers, but also Star Trek, in my mind. It lent itself well to tiramisu."}
{"text":"Love this place! Huge upgrade on the previous coffee place that was in this space.

There is a fair amount of seating (main floor, upstairs balcony, and three sidewalk tables) and the overall coffee-shop design is a clean and simple industrial look. Love little touches like the milky pastel colors for the chairs and coffee cups, lots of natural light, interesting art, etc. Staff is EXTREMELY kind, attentive, and engaging, especially if it's not super busy. Quiet during the day, even if the garage door is up and street noise intrudes. 

Coffee drinks are good. Definitely not as fussy as some places, and there are some interesting sweeter options (cortado with maple syrup and their affogato, for instance). They have a limited menu (some breakfast items, panini, meat/cheese plates, and toast), but also have periodic burger nights. They also usually have some interesting pastry options in the case. Definitely highly recommend the yeasted buckwheat waffle with fresh fruit, whipped cream, and a drizzle of maple syrup. Unexpectedly light, slightly crispy, and not at all too sweet. They also have a cocktail menu, wine, and beer, which I haven't fully explored, but the Tango Nuevo cocktail is of particular note for how awesome it is. 

Small kitchen/play area for kids, which I think is a really nice touch and helps to welcome a different set of customers into the space.

They have live music nights periodically. These definitely get noisy and the staff encourage the customers to pay attention to the acts/do less chatting...so if you're headed to De Fer on a live music night, it's probably not going to be the best time for an intimate conversation with the person across the table. But they're great and feature a pretty wide mix of styles/performers with a vague thematic element to curate the overall event.

For laptop folks--the outlet situation isn't awesome throughout parts of the space, so that's something to be aware of if you're planning to camp. 

Overall, I find it a very welcoming, bright, and thoughtfully managed place!"}
{"text":"Absolutely love this place. The staff are always super friendly and helpful, and they have a great selection of beverages that taste fantastic (seriously, I haven't had one I didn't like, and I've had like 20 different ones.) They also have a myriad of events throughout each month--everything from guest chefs cooking burgers to live music. The atmosphere is usually pretty quiet, and a great place to meet up with a friend for conversation. My favorite drink here is an iced P.A. Cubano, which is sweetened with Pennsylvania maple syrup, but I am also a big fan of their teas, of which they have a huge variety. As far as food, I'd say the best of their sandwiches is the prosciutto one, and their waffles with berries absolutely hit the spot every time. The chai-baked oatmeal is also a great snack. Bottom is if you're looking for a place to hang with someone in the Strip District, sip tasty drinks, and maybe have a snack, this is the place."}
{"text":"Amazing breakfast panini, and great coffee and tea.  Glad I found this place, which is tucked away from from the long brunch lines.  Highly recommend."}
{"text":"Great place to hang out and work. I love that they have coffee and cocktails available! :)"}
{"text":"Went here for coffee and a small breakfast for my birthday, and we will be back! The staff were so friendly and my latte was amazing! The food was very flavorful, we got a pink tarte, basically a large macaron with fresh raspberries and a breakfast panini, i wish we had gotten more! The coffee was so flavorful!  The chocolate for my latte was really good! The staff were so knowledgeable about coffee and seemed very passionate. They even had a small kid play area which was so nice!"}
{"text":"Cool airy and industrial vibe. Lovely teas. Sidewalk tables, great seating for working/studying. Friendly baristas. Everything you need for a great cafe."}
{"text":"Formerly 21st Street Coffee, I was anxious to see what the new shop in the strip had to offer. While De Fer makes better use of the space than the prior tenant, the coffee comes at slightly higher price point than before. We ordered the drip coffee and white peony tea, both of which were tasty but nothing to write home about. Extra points for the friendly & knowledge staff, as well as the little chocolates they give with each drink order. I'd certainly come back to explore the very reasonable priced food and alcoholic drink menu, which sets them apart from the other coffee shops in the city."}
{"text":"The best flat white ever! A cool atmosphere excellent goodies and a nice selection of coffees and teas! Clean great music and very y knowledgeable workers! Can't wait to go back! The other coffees we great too and they have a chai tea that they mix themselves!"}
{"text":"Probably my new favorite coffee house, if you can call it that. Wonderful service, atmosphere, music and prices are not higher than Starbucks. Besides coffee they have an assortment of interesting teas, cocktails, wines, and brunch foods(including waffles!). Good location with lots of parking nearby. I believe they replaced 21 street espresso, and if you loved them you'll love this place even more"}
{"text":"A beautiful space, friendly service, but my drink was of extremely poor quality. I ordered a cortado, which is something that you can find beautifully prepared at almost every well-known craft coffee shop in this city (which there a number of) and I was very disappointed to find the milk steamed quite poorly. I won't pretend to be able to taste espresso clearly through milk, but even that seemed to be rather sour. Additionally, I found it odd that the cortado was not served in a clear glass (something which you traditionally find in most shops) but this is just a matter of personal preference. I think they need to spend some time on barista training. 

 I will reiterate that the staff was extremely kind and attentive.

 My point is this: it is no secret that this place poached this former location of the excellent (although historically notorious for customer service) 21st Street Coffee and Tea. Nevermind my fondness for the former business, I would remain wary of an establishment that selectively engages with a community, but runs out other local businesses for its own benefit, and then can't quite deliver on the goods."}
{"text":"Went to the opening and this seems like it'll be a great addition to the strip! I got a strawberry jam and waffle  love the concept! I love the decor and they have  retail from Strip favorite shops which is a nice convenience! I mean how can you go wrong with everyone favorite drinks - coffee and booze?"}
{"text":"Had to check out this new coffee place in the old 21st coffee space. Totally impressed and we come to the Strip every weekend. Good latte, amazing coffee waffle with berries. Bought tea and maple syrup to go home. We will be back!!"}
{"text":"Beautiful spacious coffee shop. Got the PA Cubano and it was delicious. The front of the shop is a windows that they open when it's nice out. Unfortunately, it was on the cold side today so they were closed up. The place was packed. The coffee was delicious. They participate in the Coffee Passport program as well. Overall, a beautiful addition to the Pittsburgh Coffee Scene."}
{"text":"Great place to have coffee or boba tea.  It is in and out and it is an old garage. Nice decor and good place for studying. I usually bike here so I am not sure about  good car parking. Definitely has good bike parking.  The stuff is friendly and the food I have not tried yet."}
{"text":"I used to make 21st Street Coffee my go to Sunday morning spot. The baristas were passionate and knowledgeable about coffee and took their time to make sure the drink was perfect before it would hit the counter. De Fer has the right idea with the menu and decor but needs barista training. Shots are pulled incorrectly  (they have a scale and timers but not used) and drinks (particularly the mocha) needs a lot of work. Way too sweet, almost undrinkable, and the the milk wasn't even steamed correctly. (No micro foam, very Starbucks like mix mash of some milk and espresso). There's a lot of competition in Pittsburgh. Great coffee shops, talented baristas, and coffee consumers that raise the bar in quality and expectation. De Fer needs to get off on the right foot by surrounding themselves with passionate people. Especially in such an iconic location."}
{"text":"One of my favorite places on the strip. Staff is kind and courteous and the coffee and food are great.  The \"feel\" is relaxing and the decor is great.  I have had several different coffees and they all have been great.  Breakfast always hits the spot and the prices are very reasonable."}
{"text":"We walked here from our hotel for a \"real\" cup of coffee.  My husband had a cup of coffee with a shot of espresso and I had a maple bourbon latte.  After tasting his I wished I had gotten what he got!  Whatever brew he got had almost a slight sour taste but a deliciously nutty aftertaste.  It was really unique and enjoyable.  My latte was very good as well but not as interesting as his coffee's flavor.  The space was large but not very cozy.  Very nice spot however and worth the walk!"}
{"text":"The barista was FRIENDLY AND OUTGOING!! A first that I have seen. The typical staff I run into at local coffee shops treat you like you interrupted their instagram post. The cortado was amazing and so was the london fog. Atmosphere was lovely. We will be back."}
{"text":"I was pleasantly surprised by this cafe! First of all, there are lots of seats so it's a great place to have a chat with friends or do work. The wifi is also very reliable!

The pastries were amazing - I'm a huge fan of almond croissants and I can say that the almond croissant I had here was one of the best I've ever eaten. The service was great as well. The table my friend and I were sitting at was very wobbly, and the workers came right away and fixed the table for us.

The coffee is kind of expensive - an iced latte is 4.25 for only 10 oz, but the quality is good and they have lots flavors.

Overall, I had a great experience here and I'll be coming back soon!"}
{"text":"One of my new favorite cafes in Pittsburgh! I love the bright and relaxing atmosphere. There's plenty of tables and, most importantly, free WiFi so I can catch up on some work while pumping myself with caffeine. I would recommend their lavender grey latte which is amazing! They don't have sugar free syrups, but they do have almond and oat milk for you vegan peeps. Prices are a little higher than average. A small latte was $4.50, but since I'm hanging out stealing WiFi and table space, I can't really complain. Definitely a place everyone should check out!"}
