{"text":"Had high expectations of Dee Thai. Great location, well designed restaurant has a good reputation. Food was good, bit not great. The comparison to Jitrada in Sale isnt favourable for Dee Thai.    My starter, Emerald Chicken was delicious but the main course, Tamarind King Prawn had a strong flavour of fish sauce in it which overpowered the usual sour/sweetness and spoiled it a little for me.    Staff were attentive and friendly which was a definite plus. Wine list was good and we chose one we really enjoyed which was another positive (cant remember what it was though!)    However, we'd still take Jitrada over Dee Thai any day."}
{"text":"i must have gone on a bad night. food and service were cool,not many customers in the 1.5 hrs there. Definately a place to go with a group of friends on a Saturday night."}
{"text":"I love this restaurant. It is stylish inside and the staff are excellent, friendly and make you feel important. The food was as expected from a restaurant in an afluent area and the prices were reasonable for the foor and the experience.  I love thai food and this is currently my favourite thai restaurant."}
{"text":"Dee Thai restaurant is ever so tasteful darling. I was taken there for a  birthday treat and the first thought that struck me was spookily estate agentesque : major curb appeal!! The interior does'nt disappoint either, it is the epitome of elegance with cream, blue and sea green walls, dark mahogany furniture and mood lighting.   Staff wear traditional Thai garb which looks lovely and they just cannot do enough for you. On entering we were led to the small bar area where we had a 10 minute wait despite booking.  Now for the food. It is TOO DIE FOR!! Great portions and it is not simply your classic Thai fare. The chicken satay starter was presented with an exquisite salad and peanut dip, then we moved onto the mains. I tucked into the scallops padnam prik prao and would recommend this dish to seafood enthusiasts anytime! It had a subtle chilli sauce and the portion size far exceeded the typically sad-looking  three scallops on a plate. Hubby had a dish called weeping tiger which was  basically sizzling steak in a spicy sauce; hotter than your usual Thai.  I still crammed in the fresh fruit platter for dessert and Dee Thai do a really good coffee- not your usual Costa fare.  I adored the food but this was an expensive treat and my main thought was \"glad i'm not paying\". It cost in excess of £70 for the two of us but I think what pushed the price up was the cost of the side orders. Stir fried veg was £7.50 and beansprouts were £5.50.   I guess the prices are reflective of the affluent area it is situated in but I think the Early evening offer of £9.90 for 2 courses and rice would be better value. Weekend booking is essential as Dee Thai is a popular venue. It also opens for lunch weekdays from 12-2.30pm and on weekends from 2-5pm.  Great for a splurge and not your usual Saturday night grub. Loved it."}
