{"text":"I was the one that suggested this place, but as soon as the 4 of us pulled up to the small building its in, and saw the door, I refused to go in. I got the creepiest feeling , the one where your instincts tell you don't do it, because we were about to eat dog, or maybe even roadkill. The door's old and has been kicked in a few times, like a hundred or so. Why thay haven't replaced it is beyond me. Maybe their patrons don't care for the esthetics of their dining establishments much. It has a small sign that says 'cash only', ah crap, none of us are cash carriers. So we go in, and ask the waitress where to get cash since they do not have an ATM.   The first thing I spy is the two lovely  deer heads mounted on the wall. The dank interior  reminded me of the small road stops you see in North Dakota, or Michigan. Ones where killers hang out. After 15 minutes my friends convinced me to go in. Deep breath... I was ready for food poisoning. I went to the bathroom first, and found it surprisingly clean. Phew.  When I came back the guys were talking about how cheap the menu was. You can get a meal here for $6, so all of them ordered 2 meals each. I had the hot cakes(2@$4.50), sausage (3@1.95), and 2 scrambled eggs( .75 cents each). Coffee is only $1 with a meal and $1.50 without. Coffee was pretty decent and the waitress made sure it was always topped off.  The food came out, and needless to say it didn't fit on the table. My hotcakes took up the whole 10 inch plate, and I only managed to finish one and a quarter of it. I couldn't finish the sausages, too salty and fatty tasting to me, but the eggs were good.  All in all, everyone liked their food. I would compare it to what a bachelor would make at home. The fries that came with my friends clubhouse were McCain's, I'm quite sure. The service is very friendly, and this is a good place if you're too lazy to make breakfast for yourself, and only have less than $10 to your name, the 4 of us only spent $46 and some change."}
{"text":"Delicious!! Love coming here, food is great and staff are awesome!! Two price raises within six months seems a bit extreme but nonetheless I'll surely be back soon!"}
{"text":"A real gem in the heart of industry. Don't let the outside frighten you, let the inside frighten you haha. Definitely come here and add a few pancakes on the side, don't expect much, expect food on your plate for cheap.  F-YES"}
{"text":"Classic greasy spoon...and by classic I mean that NOTHING has changed here since circa 1970.  The walls are wood paneled, and adorned by deer heads. The kind of place you go if you're a bit down on your luck, getting your auto-glass replaced down the street, or wear ironic t-shirts to show how cool you are.  The food is pretty run of the mill diner fare... plate-sized pancakes from a mix, burger steaks, and hot turkey sandwiches...all at a decent price.  The lady who works the front of the house by herself is quite friendly, and is efficient considering how busy this place can get."}
{"text":"Love it. We stumbled across this sweet gem of a greasy spoon one Saturday morning on our way to Interfaith. So glad we stopped in. This kind of place is right up my alley. It seems to me that there are people that love these kinds of joints and people that can't stand em.   The other reviews all really sum this place up, and there isn't a lot to add to it.  Breakfast is hot and fast, and such a fair deal. With the Lido gone from Kensi, the need for old school diner eats is making me jones for the Deerhead. I haven't been for anything other than breakfast but I'm getting the feeling i'm missing out.    If you're into dive diners, then head on down."}
{"text":"All the indie joints WISH they were this cool. This place is the real deal. Unchanged since the 80s, this is what the Calgary I grew up in felt like. It's also nice to see the menu and the prices haven't changed since the 80s either!"}
{"text":"Wood panels, mounted deer heads, possibly the original tables throughout. Ok, its a dive; accept it! This is a nothing fancy dinner, just simple & basic good diner food for VERY affordable prices. $10 bills and you get a meal, coffee and enough for 10% tip :). I like it cause I've seen people from every walk of life, dine their. To truck drivers from lawyers, to elderly couples and hipsters, to down-and-outers to a couple MLA's, this place is unique."}
{"text":"This is a classic greasy spoon, in all the right ways.  The formica table tops and booths take you back to the 70's.  I almost gave up at the front door when it stuck but gave it a bit of a shove and it opened up.  The lady who ran the front gave me a wave and smile and said to grab a seat anywhere so I took a booth beside the wall facing out.  Bit dim but the sunshine made it better.  Ordered the hot hamburger with fries.  Pretty good meal, two patties, fries covered in basic gravy.  Exactly as described, lots of food.  Coffee was also pretty decent.  Total meal came out to $12 and it was a tasty and satisfying meal. So:  food I would rate as 8/10.  Service would be 10/10.  The lady was friendly, she took time to explain things and kept things running smoothly.  Turnaround time from order to plate on table was about 10 minutes during the noon hour rush.  Parking - a small lot but seemed to be enough for the guests.   I would definitely return.  It's a good place with lots of working class folks, just the kind of place I like for a diner."}
{"text":"If there's one thing I love, it's a diner that has earned every 4 and  5-star review as much as it has earned every 1 and 2-star review.  That place, my friends, is Deerhead Cafe.  I loved it. Will you? Well, read on..  Not knowing much about it, this place had been calling my name for quite some time. I love dives and I was  still I was wondering  \"Is that place real? Naah, couldn't be.. Maybe?? No.. probably just a drug front... I shouldn't go in there.\" But, thank's to the wonderful help 'o Yelp we investigated, went inside, and I'm SO glad we did.  This place is a hipster breakfast wonderland! I couldn't stop smiling and holding back a giggle the whole time I was there. 70's era wood panel walls with matching 70's vinyl booths, with what seemed to be original vinyl. Why reupholster when duct tape will do just fine?? And what would it be without old taxidermy deer heads to tie the room together.  All 100% original vintage without even a hint of irony. Brilliant.  I got the Denver Special - Denver sandwich, wavy McCain style fries, and cream of brocolli soup for $6.75. YES please. It was all great. Classic, straightforward greasy-spoon diner.  It's a Cafe, so... what kind of coffee do they serve here? The coffee kind! It doesn't matter. What matters is the kind staff are always right there to refill your cup.  I recommend you go here for breakfast. I also recommend that you get a little out of control the night before. It just wouldn't be right to experience the Deer Head Cafe without a pounding head."}
{"text":"Oh god this place is a perfect shady diner. Untouched by time and cheap as hell.  Greasy spoon, that good diner coffee that you can tell has been brewed in an old pot infused with coffee taste! Ugh. Can't be beat. ***CASH ONLY"}
{"text":"I was excited to try this place out. Decided to take a group of people out for lunch. When the waitress asked to take my order I thought there was some confusion, I clarified my order. Half an hour later everyone had eaten their lunch and mine hadn't arrived. I asked about it and the waitress said she thought I was just asking if the item was on the menu. No lunch for me. I paid for lunch..."}
{"text":"Come and take a step back in time at this cute little diner. Nothing fancy going on here even the front door was a little rickety, but the deer heads are still perky. I enjoyed a simple bacon and eggs for breakfast and I know it's a good spot good old-fashioned had made hamburger.  Good eats, cheep and cheerful, Cash only"}
{"text":"This place is creepy, and smells of \"old woman,\" no offence to the old women out there, who may also be yelpers...  Ah, I'm guessing by the sludge that this place has never been cleaned, so like since it was built. I mean grime and splatter, but being located in an industrial area doesn't help.  It has character, oh loads of character, and if the food was amazing, I may be able to forgive the sketchiness, but here goes:  Our toast came out 5 minutes before the rest of our brekky, my eggs were overcooked, the hash browns were weird in a way I couldn't put my finger on, and the bacon tasted as if it was cooked last week. When I went to take a sip of my water, I nearly gagged, as the glass and/or water tasted like \"old lady.\" Again, no offence.  It was a place I had read about, and was looking forward to seeing for myself, but I will never, ever go back. However, if there was some weird awesome reality show that took place in this restaurant, I would probably watch it and become seriously addicted to it, for no good reason other than it was creepy and gross."}
{"text":"After my original review, I need to bump up the stars. The place still has a creepy, dated vibe but it has grown on me in a big way. I go back there frequently now for cheap breakfast and brunch. The food is always quick, the coffee is actually pretty decent and the service still has never disappointed.   I've started bringing fellow dive-lovers here for hangover food. :)"}
{"text":"My husband and I love coming to this place.  A total 'blast from the past'..... a small-town diner where the owners work the grill, bus tables, take orders and know all their regulars names.  Yeah, we normally hang out for breakfast at Dairy Land Café, the Daily or  Higher Ground (all in our 'hood), but when we just want to be grubby on the way to the hardware store, Deerhead is where we go.  A shout out to Jane!"}
{"text":"Definately a \"character\" place to attend. It looks just like it sounds, like it belongs in some backwoods redneck area- but the food is super cheap and tasty for the basic fare that you get. I just got the omelette - but for the price the portions were more than satisying and tasty. Not a fancy place by any means but it definately provides an experience!"}
{"text":"absolutely perfect.  grilled cheese, crinkle fries, diet coke in a can, the morning newspaper, a slight hangover, cozy booths, 2 taxidermied deer heads staring at me...how could it NOT be absolutely perfect?  service was good, food came out quick, prices were right. customers ranged from the oldest man in the world, to a 20-something girl in her fuzzy pajamas with dreadlocks down to her butt, to a burly trucker sitting alone reading a romance novel. cannot wait to go back."}
