{"text":"Walked in off street.  Ordered large pepperoni pizza for take out.  Price was something around $13.  Twenty minutes later teenagers and I eat and enjoy it.  Not sure what other reviewers were expecting, but pizza was good and I would go there again."}
{"text":"Nice little family owned pizza shop. I recommend the Village salad and a cheese pizza for carry-out."}
{"text":"I've never written a review on any website but I felt the need to after my horrible experience today with this restaurant.   After calling to voice a concern about an incorrect order and hopefully get a resolution, the person taking calls on the other end proceeded to tell me that they were closed and we could come in tomorrow at 4. After asking a follow up question he stated \"I'm walking out the door...\" And hung up on me. I've NEVER had that happen before and felt incredibly insulted.   Aside from that, the bottom of the bread was burnt. Overall, there was no care taken with my order in regards to customer service and quality. DON'T WASTE YOUR TIME AND MONEY"}
{"text":"Nope.  The place had potential when we first walked in.  It's small, dingy, but quirky.  \"OK,\" I thought, \"it must be the great food that keeps them in business in such a prime location.\"  No.  We ordered a cheese pizza and the eggplant parmesan.  Both had some sort of cheese product that wasn't pleasant at all: chewy, salty and gritty.  I had asked if the eggplant was made fresh on the spot and was assured that it was.  There's no way that it was freshly prepared.  The eggplant was watery, rubbery and a bit funky.  I'm guessing it went right from the freezer and into an old deep fryer.  The one and only bright spot was the dough used to make the crust of the pizza.  Not bad.  Overall, the quality of the food was poor."}
{"text":"Best calzones in the city.. possibly state, maybe even country. Whenever I'm home in Cleveland, getting a calzone from DeGaetano's is a priority. Other food-based priorities include a sub from Dave's, and a pita from Tommy's. Cleveland has a ton of these little gems - I do sometimes really miss these spots!"}
{"text":"Ate there last month.  Waiter sneezed into his hand and then wiped his hand on his apron.  I refused to accept the serving plate that he then brought out and asked him to wash his hands and bring new plates.  After the meal I complained to the manager.  The manager said that the waiter had told him about my asking him to wash his hands after sneezing and that he never sneezed.  The manager then told me \"to get over it\".  I will never go back even though I had been going there for over 10 years."}
{"text":"Visiting from out of state,  we ordered hotel delivery and our order was delivered faster then expected even in a major thunderstorm! Food was hot, salads cold and everything was delish! Classic Calzone with huge pieces of chicken and artichoke hearts, great buffalo wings, pizza and chessy bread! Thanks for a great meal in a storm!"}
{"text":"While recently visiting Cleveland, we frequented an old favorite: Village Pizza. It has been around for decades. We ordered a large thin crust ...which I think is better...my mom wanted extra sauce - which is classically delicious...so it was saucy... But OMG BEST Pizza I have had in years!!!!!  I was not as thrilled with the Pesto Pizza which was dry and one half was way over done... But... The Indians game was on, so...  Nevertheless, the Price is right @ $12.50 for an enormously large pizza!"}
{"text":"Everything at this place is made from scratch with some of the best recipes in town. My family and I have stopped at this place many times over the past 2-3 years and never leave disappointed. The owner is a very hard worker who continually oversees operations at his business, making sure things are done correctly. He and his staff are both very friendly. Our favorites are the pizza with regular crust, the chicken parm and the spaghetti and meatballs. YUM!"}
{"text":"Great local pizza joint. We've done take out on several occasions - really enjoy their white pizza with a number of toppings and the village salad. My husband and I will usually split the salad and a medium with leftover pizza the next day for somewhere around $20.   Of note, their house Italian dressing is worth buying to take home.  The crust is delicious and they are generous with their toppings. Bacon and mushroom tops the list - the bacon is always crispy, which we appreciate.   I was initially put of by the gruff sounding gentleman who takes the orders, but have learned that's just his style and he's truly happy to help. I ate in there recently for the first time and was surprised at the cozy charm of the place. Yes, it's smaller, but I like that. Everything was spot on for the dine-in experience. Will definitely eat there more often."}
{"text":"I did not like this place. Everything was dusty and stained and filthy, It was filled with flies it was dirty and had rubbery disgusting egg plant that I actually had to spit out it tasted so bad. The food was not up to par in the least bit and the cokes well the cokes where watery and gross. The only positive thing I could think of was the salad which the dressing was outstanding! Overall I will never come back to this place and do not recommend it to anyone."}
{"text":"Ok been by this place a million times. Never ever stopped. Last night we did. This is the epitome of a Italian dive. I am saying that as a good thing. Honestly.   The decor and restaurant are dated. It was opened 22 years ago I think it looked the same then. That's really the only down side.   Ordered spaghetti and meatballs. Comes with bread and a salad. The salad is good. The homemade Italian dressing they let you put on and it's good. Good size salad. I was happy with it. The bread is just rolls they were hot and ok but nothing spectacular. We only got 2 for the 2 of us so we asked for more.   Spaghetti and meatballs came and it was also unassuming looking. Tried it and it was delicious. Honestly, the sauce is good. It taste homemade. And the meatballs are some of the best I've had. Really close to as good as my own. Tender very flavorful. Seriously good. I would order again.   Next time I am trying a pizza. They had a decent take out flow going. Pizza looked good. Will try that next.   Service was decent. Not bad not excellent. But more than adequate.   We will be back."}
{"text":"I have been coming hhere for over 15 years. The service & food is great."}
{"text":"Small family run place. The best thing is their pizza - loved the crust. Portions are more than adequate.  Salad was fresh and the house dressing was excellent.  Marinara sauce was a bit too watery.  Noticed a couple of small flying bugs."}
{"text":"This place sucks. Totally unprofessional.  They would not except my gift card after I asked them when we walked in the door :-)  Then tried to have a confrontation with me after I ate there nasty fish and chips. The fish was seasoned with cinnamon,  REALLY WHO DOES THAT!  The cooks were cursing in the kitchen like they were on a street corner sipping Gin and Juice.  It seemed to bother anyone in management.  Find another restaurant.  One kind thing I can say is, the waitress in spite of what was going on stayed focused and was really good.  I was not to happy not being able to leave her a tip."}
{"text":"Small, quaint place. Daughter and I came here for lunch. It took a great amount of time for my food to come. It took even longer for my daughters food to come. I was done with my food, and her food still had not been served. The food is good...but the service is slow."}
{"text":"Absolutely the best pizza I have ever had!  Simply unbelievable. Buttery thin crust and wonderful toppings. Actual strips of bacon on my pizza!  Place looks a little sketchy but head on in. You will not be disappointed!"}
{"text":"Ugh. Speaking to another review here, I live in Beachwood and think this place is awful so it's not a Beachwood thing, just stupid people. Decided to try this out because I had a gift certificate for $10 off... Bad call. WORST WAITRESS EVER! Surly, never introduced herself, just wandered to our table, dropped the menu and 30 seconds later demanded our drink order. My fiancé ordered a beer - she brought it in the bottle, with the cap on. It was not a twist off top. He grabbed her attention and asked for a bottle opener and she looked at him like he was stupid, grabbed the bottle from our table, opened it and brought it back - not a word spoken. No, \"Oh, sorry about that\" - nothing.   We both ordered pasta. I had broccolini with grilled chicken and he tried the spinach ravioli. The menu says they come with salad and bread. A salad was dropped off (silently) - bread never arrived. The food was not good. My dining hall in college made better pasta. The grilled chicken was blackened in the sense that they accidentally burned it and thus my whole meal tasted charred and the chicken was rubbery. The fiancé's ravioli got a \"meh, it was fine\".   I was most put off by the fact that this waitress did not interact with us at all. There was only one other table with customers who also were put off by her sullen behavior and lack of even a basic greeting .... Just strange. And the tip was included in our total so we \"tipped\" 20% when I would have never tipped that much because she seemed mad at us for just being there.   Another employee at the front took our check and handled cashing us out and as we wanted to get out of there as soon as possible, right when he gave it back to us, we signed and got up to leave. From the back, horrible waitress pipes up and in the most she's said to us the entire time, essentially accuses us of trying to leave without paying. Classy.   I would not recommend anyone to eat here. Maybe their pizza is better? I don't know... Maybe carry out is a safer option? Not going to find out because I refuse to waste another dime there."}
{"text":"This place is awesome if you want a pizza delivered fresh, hot and fast! I've never dinned in, so I can't tell you about the staff or the decor. But the Pizza here is I think the best. Not only are you able to get the traditional tomato based pizza, but you can choose from either a white, pesto, alfredo or pesto alfredo based pizza. Instead of Mozzarella Cheese, all the pizza's are made with provolone cheese! Which is a refreshing change with a taste that is unforgettable. This is the best pizza I've ever had."}
{"text":"My wife and I stopped in , we ordered 2 pizzas. The service was fine, the pizza is flippin' awesome!!! You folks don't know what you have here. A + pie!!"}
{"text":"This place was a great dive suggested by the Embassy Suites.  I would suggest the following, get something with the marinara and meat balls.  The owner took the credit for the sauce but said the balls were his mothers recipe.  The fresh mozzarella on the salad was a very nice touch too.  Next time I would go for the meat balls on a pizza.  BTW, they make their own wine, the Cab was excellent, a little sweet but I liked it enough to buy a bottle to go.  Instead of going for delivery I decided to go to the restaurant, this isn't a fancy place, but I wouldn't change a thing.  I will be back!"}
{"text":"Guy that answered the phone was short and direct, but the pizza was excellent.  I asked for a small box to put the left overs in because I had to put them in a hotel fridge.  They forgot the box, and I told them not to worry about it.  10 minutes later and to my surprise, they showed up at my door with a small and medium box.  The pepperoni pizza wow excellent with no complaints.  I prefer more cheese, but that is a preference thing.  It showed up quickly and hot.  Average priced and no specials, but I knew all of that before ordering.  I will not hesitate to order there again."}
{"text":"Tried going to Bowl of Pho on a Tuesday & it was closed, so we opted for this place.  When we went, it was over half-way full- by the way, this place is teeny tiny!  The booths they have must be for kids or for way back in the 40's when everyone was tiny! Next to the tiny booths are normal chairs & a table.  This place could really use a make over!  Seemed like an older couple running the place.  I ordered a calzone & thought it was very good!  It took some time, but I thught it was worth it.  You can get wine to go, but I didn't notice what types/lables.  My co workers ordered spaghetti & meatballs & veal parm sandwich.  I tasted some of the veal & I thought it was really good!  Portions are great!  Very limited seating and while we were there, the pizza delivery guy was in & out- I would say they have a good carry out business.  Since there are so many other places to eat in the area, I probably won't go back, but I did like my meal.  Curious to read future reviews..."}
{"text":"I moved to Seattle a year ago, from Ohio.  For several years when I lived in Cleveland I was probably the most regular customer at DeGaetano's Village Square Pizza.  I am quite surprised to see some of the negative reviews, considering I had entirely positive experiences during my many dozens of times there.  Their white pizza has a taste so magical that I remember my first bite, and subsequently got addicted to it! I would never have found the place if it weren't for the fact that my car was getting worked on for an hour at the Saturn dealership across the street (since closed); I asked the Saturn people if there was a Pizza Hut or something around, and they said, \"No Pizza Hut, but... there's this place over across the way called Village Square, and let me tell ya, THAT is pizza.\"  And boy were they right!  I haven't found anything in Seattle yet that comes close to matching the flavor."}
{"text":"Work team was short on time while working on a project. Pizza was delicious and delivered right on time!!!"}
{"text":"Hot, steamy, yummy pizza - DeGaetano's is close to home, and we've always been able to walk in and be seated right away (I get the impression that they do quite a bit of deliver and to-go orders).  This place does want a makeover - it feels dated, not vintage or retro, despite the rat pack music - but the food has consistently been good, and the service has been pleasant.  We shared a large Caesar salad, and our medium pepperoni/sausage/mushroom/onion pizza filled us up and left enough for a small lunch tomorrow."}
{"text":"Cleveland doesn't do pizza that well but this was one of the better spots in town. Cozy, family-type atmosphere, red-n-white checkerboard tablecloths, that sort of thing. The pizzas were decent but can get very expensive if you get the \"gourmet\" toppings...best to avoid those (though there was nothing otherwise wrong with them). Not worth a special trip but a good local place to hit up every once in a while."}
{"text":"Yelp actually removed my previous review of this place. The reason for it was that they felt it was not indicative of actually having visited the place. Well let me rewrite this so its clear that yes I have eaten here and yes the review is legit. First off how someone can give this place more than one star is beyond me. Let me explain. I have been going here for years. I grew up in the area. The place started as Village square pizza. When I was a kid I remember walking in and the place was set up like an old school Italian place. Red and white squares all over the place. Old wood. This place has not changed at all since. This place sounds nice but its not. In my most recent visit they did away with the white and red table clothes but the its still the same tables, probably the same carpet. They just replaced the old tube tv with a flatscreen the last time I was in there. The food the last time I was in there was greasy. It was most surely not fresh. Just full of grease. Full of grease. Now I have  not been here in a while. One, cause I no longer live there. Two, because it was not good at all. I would only go there to show someone who had not seen the area a local staple. It does not mean the local staple is good. The place never had the best service. In fact the service was long and slow. I barely remember the service because it was something  I want to forget. I just remember it being slow the last time. O yes they serve wine. Out of a small wine fridge they probably bought at walmart. They do have a wine rack. With wine they probably bought from walmart. Do I need to describe the servers and owners? I hope this is enough to clarify that I have been to this place. I have mentioned the food. The look of the place and the service. O the bathrooms are past the servers stations in the back and now well Accessible to those with disabilities. I hope this review is kept up."}
{"text":"I have been here a few times. Always just getting food to go. The pastas (gnocchi and ravioli) is nothing to write home about but is pretty good. The calzones however are amazing!!! The dough is fantastic!!! A must try. (Beware the staff can be moody but they mean well - a family owned restaurant - I hope they never retire)"}
{"text":"From the outside, this place sets the bar pretty low, but then manages to actually clear it...  Yes, it's a crappy-from-the-outside looking little Italian joint nestled in a strip mall.  Honestly, from the inside it looks like the place has existed forever, and the rest of the strip mall was built up around this quaint little place over the years.  The food we have for lunch was surprisingly good.  Two of my coworkers had calzones that they seemed happy with.  I had a house salad with the house dressing, and a white pizza with banana peppers.  The salad was great with the shredded cheese and the bitey dressing.  The pizza was perfectly done and the cheese was just to the point of browning on top, and crispy in the places it had bubbled over the edge of the crust.  You have to approach this place with the right frame of mind.  Is it going to be the best Italian you've ever had?  Doubtful.  What it does deliver is food of decent quality at a decent price."}
{"text":"The owner didn't seem very enthusatic as an person. He showed a little confident in his food but when I actually got to taste it and try it. I didn't agree with him. I ordered the chicken parmigiana  sub as an take out. it didn't wow me at all. Super thick bread and bland chicken and sauce. For an establishment that tries to seem like an hole in the wall Italian restaurant I wasn't convinced at all. Even though I never tried the pizza or anything else. But first impressions are everything to me. Nice try but new energy and food is needed."}
{"text":"Hey, this little place has good food! We've been there three times and had pasta each time. Delicious. There's little in the way of atmosphere, but the food makes up for the somewhat drab and worn interior. A surprisingly good, locally owned alternative to chain Italian restaurants."}
{"text":"My experience with this restaurant goes back decades, and I'm pleased to say that the pizza has only gotten better over time. The only other item I consistently order is the salad or antipasto, and the house recipe dressing is delicious.   Last evening I ordered 3 carryout pizzas for the family (we like well done) and they were perfect. The crust is great, the toppings are generous, and the cheese (provolone) is tasty. On occasion, I'll stay and eat, but can't really comment on table service because I eat at the small bar area. Never have used the delivery service.   I don't get the reviews that are critical of the decor or demeanor of the owner (Joe). It's a pizza place that serves very good pizza. The owner is a good guy who is generally busy multi-tasking to make sure the pace runs well. Period, end of story. Don't expect fancy, don't expect Joe to be your Maitre'd."}
{"text":"Highly recommend eating here if you're visiting town for Progressive training or even if you're a local.  The prices are great and the pizza is extremely tasty.  He also offers other great Italian dishes.    I'm from an Italian family and I'm pretty critical but I've gotta say I enjoyed the food and the chance to support my people and small business.  The owner runs the place personally and is a very friendly older gentleman.  Ingredients were fresh and the taste was authentic.  The crust was not too thick neither was it like one of those wood-fire cracker pizzas, it was just right.  I didn't call ahead, I was a walk in and he quoted me 15-20 minutes for the wait and my pizza was ready in about 10 minutes.  I'm just visiting town but I'll be back before I leave.  He also has his own wine!"}
