{"text":"Good and fairly priced food. The staff was friendly and we received our order very quickly. The wings are crisp and light partnered with a nice sweet sauce and the beef Polish boy was good. This place reminds me of the BBQ spots my family frequented when I was kid. We look forward to our next visit."}
{"text":"I enjoy Del's wings and things, the chicken wings are delicious, the sauce is very good.  The catfish is so damn good, the best in town, The staff is always so nice and helpful.  I ordered a large amount of wings for work and it was all very fresh and hot.  I would recommend this spot to anyone looking for good food.  The only negative comment is the shoulder (pulled pork) sandwich needs more meat for the price.  The meat is fresh and seasoned very well.  They put out excellent food."}
{"text":"Fantastic wings they use a batter on there wings which I love the sauce I tried there hot BBQ sauce very flavorful and the heats not over powering.. look forward to trying other items on the menu.. Now that this place is open I WILL NEVER EVER FREQUENT b & m's  or hot sauce Williams AGAIN.. I give them 4 stars because of the parking in the rare of the building...
."}
{"text":"I won't deny their food is quite good however their customer service is sorry. Last week I stood in line for almost 10 minutes one of the employees said I'll be right with you and when they finally got to me they told me the restaurant was closed. Rude as hell and I will drive the extra mild to get barbeque somewhere else getting treated like that."}
{"text":"Thought I would write a review on this place since I can't get the taste of those delicious wings out of my head. Del's wings are so yummy, airy, light and crispy and the sauce which I think they have two or three different flavors a little on the sweet side but goes really really well on top of those wings and the fries too. I also tried a chicken philly which could of use a little more meat but was still good and worth the money. The prices are good the food is good the staff, which is the owner, his wife and children are nice and friendly. Looking forward to taking the hike back down to Del's for some good eating! Also this is a to go place so no dinning area."}
