{"text":"For a shawarma place, their shawarma is mediocre. Their poutine though, is great. The best poutine I have eaten, so far."}
{"text":"You do not want to eat here I was a past worker at this so called ``restaurant`` from what I seen it would scare you and make you want to sue the place. I don`t want to go on for hours to talk about this trash place but here are some heads up on the things the Owner does   - uses expired ham burger buns and meat, shawarma bread, tomatoes and most of the vegetables are all frozen.  - has baby cockroaches in the back of the kitchen... that's why he doesn't have cameras in the back..  - Lies to all his customers about everything is all fresh the chicken meat and beef meat your eating is all from either 3 days to 5 days old if they don't finish selling it they put it in the freezer and bring it out the next day defreezing it and selling it as fresh meat.  - racist he quoted to me that ``watch out for black people they are crazy you know``.  not just that whenever an Asian customer comes in he always ask me to speak in Chinese to them then he makes a comment about how I look the same as them.  there is way more I would say but ill just end it here. very unpleased with the business ethics of this owner."}
{"text":"Came here on a Friday night and ordered a kebab dinner. First impression when I first stepped in was that it was super dirty and smoky. Was hesitant but decided to try based on the decent reviews of the shawarma despite the shop looking like a hole in the wall. There was one person there working on their own manning both the front end cash, cooking area, and the kitchen in the back. There were four guests ahead of me and two guests behind. Service was super slow as he was multitasking. We ordered and just stood against the wall to wait. Noticed the chicken was burning on the stove and flames were lit as the man was dealing with someone's debit card not being accepted at the cash. Anyway, we waited about 20 minutes and took our food to go. The rice was very fragranced (like a rosemary and thyme?) But was good and the two beef kebabs were enjoyable. It came with a salad which was ok and something that was like a very onion tasking taziki sauce which I asked for extra but didn't end up liking. Overall it was alright for about $12. My only quirk would be with the food handling as I was watching him touch the meat and the salad with the same plastic gloves."}
{"text":"This plaza is amazing- you get food from all walks of life.  Philippines, China, Sri Lanka, Carribean and then this place which thought it was a great idea to round it all. Essentially an Arab place, however they also sell  poutine, burgers, chicken tikka and kebab. So that covers North America as well.  I went for what they names themselves after, the shawarma. It was great. The seasoning was great and not bland. The tahini had a great taste as well. Veggies were fresh. For a whole in the wall. The quality actually shocked me. Value purchase at its finest. Co worker ordered shawarma plate and he said he enjoyed it thoroughly as well.  P.S- Sample the deep fried naan with tahini. 3 out of 6 people who tasted it- bought it."}
{"text":"Stopped by here after work on the way home one evening, this is one of the few shawarma shops in the area but being the only option definitely did not decrease the quality.   The shawarma wrap was was pretty dope to say the least. Not only that it was also decently priced for the size and a bit spicy which I liked. Only downsides are that the shop itself was a bit dirty and they didn't have a bathroom for customer use but if you're getting take out and are in the area I highly recommend this place."}
{"text":"I love this place looks a little weird but try their felafel platter and a beef kabob platter if I want shawarma this is where i crave the most."}
{"text":"Had the chicken shawarma wrap $5 after tax. It looks like a quesadilla. A fat quesadilla. Good amount of chicken in it. Chicken was tender and flavorful, and also had those lovely crispy edges on some of it. Fresh veggies. Nice garlic sauce and tahina. Not a big line up. Amusingly enough, they have Chinese on some of the posters outside. They are run by Middle Eastern people though (not that this is a bad thing. Just reassuring people that this is an authentic Middle Eastern run shawarma place)."}
{"text":"Yo.. I love shawarma. But you guys didn't give me hummus or tahini on my chicken platter.  It's worse because this was during my late night binge eating phase where I was craving good shawarma off uber eats, and you guys just didn't put out. Heavily disappointed by my eating experience.  I also had the runs for a day after, thanks to your probable 12 hour room temperature chicken. I did not feel confident about the food at this establishment. I hope you get inspected."}
{"text":"It's in the name of the establishment!! Simply delicious. I'm honestly surprised this place isn't rated at least 4 stars! The location is in the plaza on the corner of Birchmount and Finch and has a fair amount of parking spots.  The employees working there are there everyday, and are super friendly and generous. The guy that was helping me was pretty funny as he was joking with me the entire time. He also blessed me with extra chicken and gave me some pita chips to snack on while I waited on the food.  I definitely recommend the chicken shawarma plate. It comes with  rice that's mixed with some dill, fresh array of veggies, their garlic sauce, hummus and the chicken.   Just a fair warning though, before getting it make sure you have nothing to do afterwards as you're definitely going to have a serious case of itis.   Definitely going to go back again."}
{"text":"This place has a 143 reviews on Google at a 4 star rating so I thought I'd give it a shot.   It's def a no frills joint and that's reflected in the prices.   Ordered the lunch special. 2 chicken Shawarmas for one low price.   The sandwich was assembled with style and grace. I asked the owner about the soup and he brought me a nice abundant sample.   Shawarma itself was delicious. Very low salt content, fully stacked with all the trimmings, and lightly toasted.   Good food. Fantastic value. But if you're looking for that extra salty nonsense, this isn't your place. Homemade, authentic food st a great price."}
{"text":"got the chicken shawarma, food was bland, the shawarma started falling apart from the first bite. not a great first impression. kebab sandwich was also very bland, the only flavour came from the hot sauce. restaurant looks run down and dirty, wouldn't recommend coming here and definitely won't be coming back. our total came up to $12, we gave $22 so that we could get a $10 bill back, and they asked for exact change. turns out they didn't have enough in their cash register..."}
{"text":"Only been open since spring 2015. Went there with the intention of a burger, ended up with a poutine and shawarma plate. Both were very good. Service was very nice and the food was tasty. Took a little longer to make but that is what you get if you want freshly prepared food so I was fine with that."}
