{"text":"This place is great! I've passed by it many times without stopping and I cant believe I went so long - shame on me. Its a mixture of a polish small grocery and a deli counter. My fiancé loves stopping here for sausage in a bun or schnitzel. All of their deli offers are delicious and different than anything else you'll find in Bolton, from the dill pickle soup to the different deli sandwiches. We also frequent here to pick up pretzels and other different snacks, that are great finds. Lastly, the staff is great, welcoming, friendly, traditional and helpful. Do better than me and stop by sooner than later, you wouldn't be disappointed!"}
{"text":"Food is not half bad but is quiet inconsistent. Good one day not so good the next day.  Don't bother going on the weekend as it's all leftover stuff they couldn't sell during the week.  Worst part is the staffs treatment of customers.  I don't understand why there is a need to belittle customers and make them feel sh?t.  I won't go back because I just can't stand the way they treat people at this location.  I was driving through your town on the way to the Orangeville hospital.  Stopped to get a bite to eat and was treated so poorly that I resolved never, ever to go back to Deli to Go and be treated like I am an idiot.  As far as I am concerned Deli to Go you can GO to HEL?  ."}
{"text":"I work in Bolton, and stop by various places for lunch.
Bolton is a small town, and I would try to rate it relative to other places locally.

Speed read:
1) Polish food and grocery
2) Good price - you can try different food
3) Schnitzel - Great
4) Reuben Sandwich - Great, but pricey, and heavy.
5) Crepes - So so

A hidden gem for a lunch.  Food court type pricing.
I visit this place very often.

They advertise their best Reuben sandwich.  It's a big sandwich that you can share.
It has lots of meat in it, and it is toasted to the right crispiness.
The secret to the crispiness is that they butter their bread both sides.

I found their unadvertised Schnitzel (pork or chicken) to be the best.  Crisp on the batter, and tender and juicy inside.  I recommend you be brave and try other stuff, such as their fish, chicken on rice, cabbage roll etc.

You can skip the crepes, as I had better crepes elsewhere. 
Well, if you are in Bolton, then you don't got much choice. :)

Do you like my review? Let me know!"}
