{"text":"Great customer service, but the food was a bit lacking. After a few bites of the mac & cheese, I realized it was a bit sour and couldn't finish it. I got slightly ill later that night. Seems like a cool place, just be careful what you choose."}
{"text":"I was alerted to Delta Blue's existence and story through Cathy Phillips'  review on Cleveland.com and gave it a try today. I was not disappointed!

It's a small shop in a strip mall with a tight parking lot.  There are a handful of high-top tables for dining in, though everyone gets their food in the same to-go clamshell containers.  I was greeted cheerfully by each of the two front-of-house employees as if I was a regular.  My carryout order was ready within five minutes.

Most of the reviews rave about the catfish, but, not being a fish guy, I opted for the rib tips lunch special.  The special came with a cornbread muffin and two sides (I got mac 'n' cheese and creamed spinach).  I also ordered some of the beer cheese soup.

The food was still piping hot by the time I got back to my office, about 15 minutes from Delta Blue.

Do not miss out on the beer cheese soup!  It was velvety, cheesy goodness in a cup. I cannot praise this soup enough.

This was my first time trying rib tips, but it will certainly not be my last!  They were meaty and the sauce was excellent. The spinach and the mac 'n' cheese were outstanding, though the cornbread muffin was nothing special.  Since it was on top, I ate it first, but I wished I had saved it to mop up the leftover barbecue sauce.

I have been looking for a BBQ joint that is easy for me to get to for lunch and I think this is it!

They don't seem to have a website, but photos of their menu and specials are on their Facebook page.  Do not hesitate to give Delta Blue a try."}
{"text":"I got the $6.50 lunch with catfish, black beans and rice, and collards. Delicious and cheap. I'll be back a lot."}
{"text":"Cornmeal crusted catfish was outstanding!  Black beans and rice and creamy spinach were also very good. Great bargain too."}
{"text":"Drove from university heights to taste the food,, we ordered the greens, which were tough and under seasoned. The Mac and cheese tasted like Kraft boxed Mac and cheese, the cole slaw needed more salad dressing fried chicken was great ribs were tender yet the sauce lacked something the breaded fish was too hard and the sweet potatoes smelled far better than they taste.  I would not recommend this for those who love good food with plenty of flavor.  The staff was friendly and place was clean. It just was not as great as I hoped."}
{"text":"Found this place on yelp while on a business trip. Small little hole in the wall but talk about good food. Everything was delivered hot to our table. The perch and cod had excellent flavor and the breaking was very crunchy. The collared greens had bits of smoked turkey in them that really set it apart. The service was very quick and friendly. Had a good time just talking while we were eating. Will definitely go back to try the barbque some day."}
{"text":"Good fried chicken & sides. Small place for dine-in, but there are a few tables. Most people were getting takeout."}
{"text":"Great local BBQ and fish fry place. Lunch with two sides and cornbread is $6-7.  I like their catfish with a cornmeal breading and their greens. The pulled pork is great too. They do catering and have some huge package deals for game days or parties. Ribs, chicken, fish, wings, etc."}
{"text":"Tucked in a tiny little shopping strip near the Airport, Delta Blue is one of my favorite take-out lunch spots. The food is great and the employees are very friendly. During lunch rush they pre-make their dishes in small batches and keep them in a steam table, and everything stays hot, crisp, and moist, while allowing for speedy service. I have yet to try something i've disliked here, and portions are perfecly sized.

I love this place because it gives you that homemade, grandma's kitchen quality, food and feel with quick friendly service and a really good value with most lunch meals under $8.50.

The only downside to this place is that the space for eat-in seating is a little lacking. Consisting of a couple of high top tables and bar stools in a relatively high-traffic environment during lunch. It's certainly not somewhere to go when you want to eat in, sit back, and lounge awhile.

Love Delta Blue and ill continue to frequent for lunch."}
{"text":"Best Q in Cleveland. The Polish Girl puts Hot Sauce Williams to shame. It's 3x the size for the same price and you don't have to go to the hood to get it. Pulled pork is amazing and everything has the right amount of heat. The homemade bbq sauce is the definition of \"awesome sauce\". This place is a must try."}
{"text":"I'd give these guys 10 stars if I could. I came into town with a group of 6, and was tired of generic \"pub\" food. 

The food was amazing! We had pretty much one of everything - the Mac n cheese and sweet potatoes were MAJOR highlights. All of the meat was perfectly cooked. 

Would definitely go back if I am in the area. 

*Note there is no \"formal\" seating, but a few high top pub tables. The owner and the girl at the front desk are great and made it for such a wonderful experience!"}
{"text":"Decent place for lunch. I had the barbecue sandwich with slaw and fries for $3.99. Can't beat that. 
My buddy had the large gyro and said it was very tasty. Pretty cheap prices, too bad I couldn't try it all."}
{"text":"I love this place. Best seafood and catfish. The catfish is breaded and they service a lot. You won't leave still hungry  They have daily specials 11am to 3pm.  Just remember there is not a lot of seating. For a couple it's the perfect setting.  They do more carry out than in house dining. 
Try it and you will be back"}
{"text":"This place may not be much to look at on the outside, but the food was outstanding! They know the proper way to fry fish to make it flavorful with the correct texture, without being overly greasy. The sides were also a slam dunk. I highly recommend the Mac n Cheese as well as the potatoes augratin. I wish I lived in Cleveland so I could come back."}
{"text":"As others here have said, this is a bit of a \"hidden gem\" in Berea on the way to the airport, tucked into a small strip mall.

All of their soul food dishes appear to be made from scratch, and available as a lunch buffet style of meal. Plenty to choose from, with a ton a great Southern side dishes like mac-n-cheese, greens, potatoes and gravy, etc.  All meals also come with a cornbread muffin on the side.

I had the fried chicken with mashed (red, skins on) potatoes and gravy and mac-n-cheese.  The chicken was lightly battered and really juicy. The potatoes were rock solid, but I was disappointed in the mac-n-cheese after everyone talked so highly of it.

But don't let that deter you from trying this place.  We will most certainly be back."}
{"text":"Some of your best local food are in a hole in the wall, and Delta is no exception. The stuffed tilapia is excellent along with the side of collard greens and mashed potatoes I selected. The restaurant is designed for take out but there are some high chairs and tables for dining in."}
{"text":"Homemade food made well. We sat at a small table on the sidewalk and enjoyed fried fish with homemade tarter sauce and fresh sides. The seafood gumbo was delicious too. Use the directions to find this place close to the airport. It's worth it!"}
{"text":"I went here with my fella and it did not disappoint. The man who took our order was super nice, it smelled great as soon as we walked in! I got the beer battered perch with green beans, mac n cheese  and cornbread..all of it was super yummy and fresh tasting. I was even surprised by how good the green beans were. My boyfriend got the shrimp po boy which he devoured in no time and loved. The po boy came with Cajun fries which were delicious as well! I'm glad I tried this place and I'll be going back! Good seafood for a good price!"}
{"text":"Having never been to this area before I naturally turned to YELP to see what I could find as a good place to eat. Delta Blue came up as number one in the area and plenty of good reviews. I will have to respectfully disagree. The place is small and simply decorated. The appearance doesn't throw me, as often the best food can be found in a place not to be judged by its cover. In the food I was disappointed. I went with one of the lunch specials, Tilapia with mashed potatoes and Mac & cheese. I would classify the food as OK. It filled my stomach and that is about all. I would prefer to have tasted a really good meal than just fill the stomach. They also appear to cater to the take-out crowd as everything is served up in a styrofoam box and a plastic fork."}
{"text":"Delicious! I had the catfish with greens and sweet potato fries...everything was delicious. Great value for the portion. You won't be disappointed with the food but the restaurant is more of just a take out place."}
{"text":"I went to Berea for work and looked this place up on Yelp. I'm so happy I did!

I got the perch, lake perch beer battered. It came with 3 pieces, corn bread and two sides. My sides were Mac n cheese and green been a.

The fish was outstanding and the breeding was even better. The staff was so nice it was crazy. No wait staff and most people were taking it to go but there were a few tables in there. 

I will be back!"}
{"text":"Love the beer battered perch.  Will try some BBQ next."}
{"text":"Favorite place for lunch while working at the south side of Cleveland Hopkins. Easy drive and even in rush hour no problem. Great selection of Cajun flavors and home food. Meatloaf is great. Cajun Shrimp sauce on talapia highly recommend. Also, great chicken dishes. All with 2 sides of collard greens, seasoned green beans, mashed taters with gravy, etc. Less than $10 with a canned drink. Don't expect big tables cause the place is TINY. 4 tiny tables with 3 stools each. They have meal packages so you can host 4th of July no problem. Again, the food is perfect every time I go there. Friendly counter staff and big band CDs always on.
 Love eating lunch from here."}
{"text":"oneof th ebest kept secrets in berea!  Food is awesome!!!"}
{"text":"Good fresh food served all the time. Always friendly and helpful when asked whats in the dishes."}
{"text":"I was highly disappointed. I ordered the fried catfish, and it was not catfish. I know catfish. I just moved here from Tennessee so I know catfish. I also ordered the chipotle chicken wrap combo. There was tons of big hunks of lettuce in the wrap and I could barely find chicken. I was so hoping for a nice lunch. Not."}
{"text":"What a find in a corner strip mall near the airport. This unassuming little place has some great food cooked by the classically trained chef/owner who also used to run 16 Morton's steakhouses in Chicago. I had the cornbread-battered catfish and it was excellent, as was the creamed spinach and cornbread soufflé. The fish was light and it had just the right amount of spice and flavor to not make it too heavy. The floor was greasy and the decor left much to be desired, but the delightful owner's conversation more than made up for it. Definitely give this place a try if you're anywhere near the Cleveland airport."}
{"text":"I had rib tips,collard greens,black beans/riceand yellow cake for dessert.The rib tips were tough and sauce not good at all.The sides of collard greens and black bean/rice saved the meal because they were very good.The place is very clean and has nice sounding tunes from Billie Holiday playing in the background.I will visit the Delta again just to try the beer battered catfish dinner and other menu items"}
{"text":"Fried catfish was scrumptious.  They were long planks, about an inch wide and 8-9\" long.  The breading was light, crunchy with a bit of seasoning.  The tartar sauce is not needed but is really good.  I will get them again.  

Ribs are good.  Especially like the sauce.  The batch we got were tough.  I will want to try again just because everyone else raves they are the shizzle.  I am hoping what I got was a fluke

I enjoyed the mac-n-cheese.  I am on the fence whether or not it's the day-dreamin, must-have variety.  

Greens are perfectly peppery with a bit of a kick.  Yum!  

The portions are generous for the price point.  Good value for this quality.

Oh!   
They did not have desserts available when I was there.  I was told they wouldn't have any desserts until next Monday, 5 days away.  Odd.  


PS The earlier reviews provide good descriptions for the interior part of the joint."}
{"text":"Excellent food, Best fried catfish I have ever had , not greasy and very light. My friend had the lake Erie perch also great.. Very friendly and tasty sides."}
{"text":"Amazing shrimp po boy. Amazing ribs. Amazing..  amazing. I've been to New Orleans and baton Rogue and the Cajun BBQ and jambalaya here are just as good!!!  Will be going back!!"}
{"text":"Amazing food at a great price. Not to mention the gentlemen (I think he was the owner?) working behind the cash register was very warm, welcoming, and overall a really cool guy.

I asked what I should get and he said \"catfish sells the most for me here\". So I had to get the catfish. It was a 3pc meal that came with 2 sides and corn bread ($8.99). For my sides I got Mac n cheese and Cajun fries.

The catfish were unreal, it had authentic southern taste. Very light and battered just right, seasoned with Cajun spices. Of course I still added hot sauce which made it the perfect southern dish.

The sides were pretty good too, they complimented the catfish really well but they weren't overpowering in taste or weight. But the corn bread was amazing!! Outstandingly fluffy and sweet in flavor. The sweetness contested the spice of the catfish and fries perfectly. All in all, a very well priced meal with a legitimate hospitable service. Would go out of my way to come here again and try some more food."}
{"text":"Ate here for lunch several days while working at the airport. Food was very tasty and the lunch specials were good priced. Definitely check this spot out if you like fried seafood"}
{"text":"Tried Delta Blue on a recommendation from a friend. It's only about 7 minutes from my office, and being the lunch connoisseur that I am, I was surprised I had never heard of it.

Tucked away in a small, aged strip mall; the exterior leaves a lot to be desired as far as aesthetic. As you walk in, a similar vibe continues, but then you hear the soft blues music playing, you see the vinyl records all over the wall accompanied with pictures of Billie Holiday and Duke Ellington, a friendly employee that clearly loves her job greets you from behind the counter like you have been coming in every day for years; and suddenly the charm of Delta Blue takes over and you wonder how you're just now checking this place out.

I did have a difficult time deciding what my first order there would be, but eventually settled on the Perch lunch special, with Mac & Cheese, Mixed Veggies, and a Corn Muffin. All for $7.50. First, I love that they give you the option of breading or beer battered, I chose beer battered. Let me tell you, these were the two biggest pieces of Perch I have ever had served to me. As soon as its done frying, they sprinkle some Cajun seasoning on it. They also make their own tartar sauce in house. Every bite was a treat, and my co-workers were quick to investigate my lunch choice as the wonderful aromas were carrying throughout the office. The very next day, two of them went to Delta Blue for lunch for the first time, and had equally great experiences. 

I feel bad for the folks with bad experiences. I guess sometimes, a dish does not turn out good. Fortunately for my friends and I, its all been great. I am looking forward to my next visit, and have still yet to decide on what to try next."}
{"text":"Was watching New Day Cleveland and they did a piece on little joint near the airport. They featured seafood on the piece and showed of some of their menu items. They had me at Shrimp Po' Boy. As soon as I saw that, I got in the car and drove 40 mins for my fix. When I got there, I learned that they also do ribs and a bunch of other soul food favorites. I wanted to make my visit worth the drive, so I decided to get a bucket of southern style fried chicken and mac & cheese.

The place is small. It's really a take out place, but they've got about 4 small round tables if you want to eat there. They've got old school juke box music playing and vinyl records and covers decorate the walls. 

The food? Heaven! The shrimp was breaded in corn meal and drizzled with this chipotle mayo. The fried chicken was juicy and delicious, mildly spicy. I typically avoid the breast at most places because the breast is always dry. Not here! Their breasts are juicy!! (Am I allowed to say that?) The mac & cheese is home made, and it was pretty good.

While waiting for my food, there was an older couple dining in. It was their first time as well. They got the ribs and raved about how \"aaahhmazing\" they were. As if the po' boy and chicken wasn't enough of a reason to go back, now I certainly have to come back and try the ribs. 

My only tiff... the po'boy came with Cajun fries. I'm all about Cajun!! But the fries were just the standard pre cut fries that you get at most concession stands. Would've been much better with hand-cut fries. But this won't prevent me from coming back to try a lot of other things on their menu!"}
{"text":"Visiting for the weekend and this restaurant pops up close to our hotel. Due to such good reviews we trusted that the food would be pretty good. The walleye and catfish was really bland, no real taste to it. My nephew had the chicken which was seasoned pretty well. My daughter had just mac and cheese and fries and she disliked both. The sides had no real flavor either. The cornbread muffin was the only thing that tasted pretty good."}
{"text":"This restaurant is located in a small strip center, next to a convenience store. But, don't let its appearance fool you. Wonderful food awaits you inside at reasonable prices. I had a half rack of ribs that were very tender and tasty. A little messy, but lots of napkins helped. The collard greens were excellent. The home made mashed potatoes were also good. Did not try their Mac and cheese, but looked yummy. I highly recommend this place."}
{"text":"I had intended to try University Grill, unfortunately it was a Monday and they were closed; so I went on Yelp to see what was nearby that hit my fancy and Delta Blue looked interesting so I figured why not give it a try and I am glad that I did.  Just a small storefront located at the edge of Berea near the IX Center Delta Blue is a nice place to get some fish or BBQ.  Decorated with old 45 records and having some high top tables you can eat there or take out.

There is a large menu on the wall as you walk in, BBQ on one side, fish and seafood on the other with a long list of homemade side dishes in the middle.  They also have a number of lunch specials available on a board by the register.

I had the lunch special 2 pieces of catfish, a corn muffin and 2 sides.  The catfish was nice strips of sweet flaky fish with a crunchy cornmeal breading fried perfectly; it matched well with the homemade tarter sauce.  For the sides I had macaroni and cheese and the candied sweet potatoes.    The mac & cheese was OK, with larger then usual noodles and a mild cheese sauce; I think with a smaller noodle it would have tasted cheesier.  The sweet potatoes were excellent, soft yet firm in a nice maple sauce.  The muffin was good, with a mild corn taste and good texture.  Overall a very good deal for $6.50.

Delta Blue is a good place to get some well made takeout or have a quick meal if you are in the area.  When I am in the area and want some fish I will be back."}
{"text":"This place is a total hidden gem in Berea. When you first drive by, it looks so unassuming. I found delta blue randomly & was drawn in because I saw on the board outside they have fried chicken. The fried chicken was crispy & juicy & they have a nice variety of sides. The employees are really friendly too!"}
{"text":"Showed up tonight (Saturday) hoping to get dinner and lunch for a flight back to California o my to be met by a locked door.  I had checked earlier in the week to ensure they would be open to which they said they would be open until 8 or 9 I do 't remember.  Oh well, I was to Donte's Italian Pizza just a few hundred feet up the road four an awesome dinner--and hopefully lunch as I got a turkey Reuben for the ride back to CA tomorrow."}
{"text":"Dear Delta Blue,
I love you. I have family close to your business and want to visit them more often just to drive by and say \"Hey, let's get catfish.\" You make lunch the best."}
{"text":"This place is great.  I have eaten here at least 20 times.   The food is great.   The Cornmeal Cat Fish is Wonderful.    Best fish I ever had.   The people that work  there are great.  Every time we've gone in there they are pleasant, warm and welcoming.  There's a good vibe in there with all the Motown tunes playing.   I really love the restaurant.  You must try the CatFish, Cornbread stuffing, Greens and the Carmel Frosted Cake.  If you Love fish and Soul Food you must try it."}
{"text":"Wow.  I stopped by the Delta Blue today and it was amazing!  I had the catfish and the breading is light, crunchy and superb.  I also tried the candied sweet potatoes and the dressing with gravy.  I am a big fan now as this was my first and definitely not my last trip.  What a gem. I think this place should open other locations and would be such a great addition to downtown Cleveland.  Great conversation and great food was had today at the Delta Blue.  Thank you!"}
{"text":"I needed a quick lunch after landing at Cleveland Hopkins International Airport - so Yelp led me to \"Delta Blue Seafood & Barbeque.\" It's located in a very small strip mall just a couple of minutes outside the Airport.

I ordered the lunch special - meatloaf - with sides of collard greens and creamed spinach, plus an order of the fried catfish.

Meal was served hot and tasty. The meatloaf was hearty and had a nice sauce. Both sides were really yummy. And the catfish was crisp and had a really nice texture.

The staff was very friendly! I'd come here again!

#DeltaBlueSeafoodandBarbeque"}
{"text":"Great catfish. Place is a hole in the wall near a gas station. But I've never had a bad meal here"}
{"text":"What a nice place!  A fantastic change of pace from the ever so boring chain restaurant food! 
We had fried chicken and it was AWESOME! Crispy, seasoned very well, hot and plenty of it!  The coleslaw is great, too. 
We can't wait to go back and try the Lake Erie perch!
Nice people run the place and the music playing is wonderful!
Support local business and try this terrific place!"}
{"text":"Everything at Delta Blue is Delicious! Our only concern is the sporadic hours. Some evenings we want good wholesome soul food, and although they should be open, we get there and the doors are locked. That makes us very sad cause they have the best greens, black beans & rice, and ribs this side of town hands down!"}
{"text":"Small clean space with a personable and professional owner. A short, 7 minute drive from my hotel near the airport. Ordered the catfish dinner with mac and cheese and french fries. Fries were good but the mac and cheese was SO SO good. Should have gotten double. The fish seemed to be breaded in panko and cornmeal instead of just the traditional cornmeal which was different, but good. The tartar sauce was stellar too. Great prices. Or maybe I'm just used to DC prices where the same soul food dinner would have set me back $20 instead of $10. Was all set to go back the next day for lunch but alas, they are closed on the Lord's Day. Sad times because I had to leave town that day without my fix. If I am ever around that way again, I will definitely be back."}
{"text":"Quicker than some fast food places. 

Super friendly and perky lady working the front. Smelled amazing and was clean. Gotta try it.  The catfish was the meal of the day."}
{"text":"Has anyone who liked this place ever have ribs from a restaurant that wasn't a franchise? Terrible!!!! how do you over season corn, and not season greens? The ribs remind me of something my 82 year old polish grandma would serve! They were baked, no seasoning, no flavor, and super fatty. I have never had to put salt and pepper on bbq ribs before, sure they were covered in a colored water that I am sure they call sauce, but that didn't help either. The food in the window that was part of there lunch menu looked good, chops, fish, and all the sides, should have tried one of them instead!"}
{"text":"Let's say, you're stuck at a convention at the I-X Center (at the Cleveland airport), it's lunchtime, and you would rather go hungry than sample the microwaved burgers at the event.
Don't starve. Find a co-worker with a rental car and drive 2 miles to Delta Blue, and you can have comfort food so good, you will be mildly depressed that you have to go back. 
From the menu on the front window, to the mouth-watering hot case displaying mac & cheese, collards, fried chicken, and other good things, this place just makes you feel good. There is also old-time blues and big band playing on what might just be a record player.
I had the fried catfish, 4 bbq ribs, mac & cheese, and collards. The catfish was the standout - crispy outside laced with spices, steaming and flaky inside. Ribs were OK, the collards were average, but the mac & cheese was so cheesy and creamy I wanted to lift up the styrofoam and lick it all out. Probably should have.
Don't eat convention food - take a ride down to the Delta."}
{"text":"Stopped in with my wife on Saturday afternoon after hearing good things about this place. We were not disappointed. It was excellent. My wife had the pulled pork sandwich with mac and cheese and collared greens as sides. She said all of it was very good. I had the rib dinner with fries and slaw and all was top notch. Really nice guy took care of us. It's mainly take out, but they have a few tables if you want to eat \"in house.\" We did and it did not disappoint. There was a lot on the menu I wanted to try, but our waistlines have limitations. As a food snob, I'm pretty critical of Cleveland restaurants, but I highly recommend this place. It's really good value, as long as you understand the concept is built on take out. We will be back."}
{"text":"Still awesome - the lunch deals are great....$7.50 for an entree and two sides with a corn muffin, and it's quick. High fives for Orlando."}
{"text":"Catfish was great. Hand breaded with cornmeal and bread crumbs. Sides I had were very good and appeared to be homemade: black beans with rice and Mac n cheese. Owner was very friendly and the food was great. Only negative was the lack of seating."}
{"text":"This hole in the wall serves some good food. Had the beer batter lake perch and it was great. Crisp crust, light fresh fish. Just the right Cajun spices. I also like the fries (Cajun spice here, too - not too much) and the cole  slaw was the way I like it- not sloppy with mayo. You won't have a great dessert here and no alcohol. Don't be put off by the store front. It doesn't look like much but give it a try. I gave it 4 stars for quality at a low price."}
{"text":"Phenomenal place to get authentic southern style seafood. The fried shrimp with sweet/spicy sauce on the side is heavenly. Only reason for 4/5 is that sometimes they're closed when they're supposed to be open without an outgoing message etc. On two separate occasions I have driven there only to find it closed. That being said, the food is so good that I will continue to frequent."}
{"text":"Got the delta signature wrap, a chicken wrap with rice, black beans, lettuce, tomato and their signature sauce. Spicy yet flavorful. There were many other things on the menu I want to try on my next trip. The place was packed for lunch so that was a great sign. Service was very friendly. Prices were more than reasonable.  I'll be back soon."}
