{"text":"I heard about this new cafe-by-day / resto-by-night back in December and had been meaning to try it out. Last night, I finally got around to it.   I loved the vibe; discrete, tiny little place on a street where you'd never expect to find such a cool resto. The music was great and the service was thoughtful and helpful. Overall very enjoyable, my only suggestion would be to have more comfortable chairs, as the backless small stools are less then ideal.   As for the food, I came in with really high expectations, which were kind of left hanging. Don't get me wrong, the food was good, just not as good as I had envisioned. My favorites were the miso slaw and the caramel porc and egg. I also tried the miso eggplant, which was pretty tasty but seemed a little naked on the plate without an accompaniment. The green curry clams were ok, but a little grimy, which threw me off.   I personally found the portions a little small, while the price added up quickly.   Nice little spot, worth a try if in the area."}
{"text":"Mon coup de coeur du mois de janvier!!! Pour la rentrée 2018, j'ai découvert grâce à mon amie Élodie: Café Denise. Ce café est extraordinaire; minimaliste comme j'aime et intime. On y tient peut-être à une petite vingtaine de personnes. Le service est chaleureux, le personnel avenant...j'aime, j'aime, j'aime. Tous les plats étaient excellents. J'en redemanderais encore. L'ambiance était excellente et conviviale, et la musique, du bonheur pour les oreilles. À découvrir pour les aventuriers gastronomes. Mon seul bémol, les desserts, j'avoue, je m'attendais à plus de choix car je ne suis pas fan du tapioca mais en dehors j'y retournerai très très vite. =) #CafeDeniselove"}
{"text":"This place is a 3.5 for me, but I like to give Biz owners the benefit of rounding up. It's rough out there!  I'd been wanting to check this place out for a while and finally made it happen and I'm glad I did! The spot is tucked in an unexpected corner of mile ex, it's tiny and super chill and cute. The service was warm and friendly and good vibes and the wine list is excellent.   I came with a fellow veg, we ordered the eggplant starter to share and then each ordered the grilled tofu dish. Our waiter suggested rice would be good with both the eggplant and tofu so we added that. I wish they had all been served together in that case so we could have taken advantage of having the rice with the eggplant as suggested.   The eggplant was truly delish. The tofu dish was good, and definitely needed the rice imho. It's nice to have a veg dish on a menu that has lots of protein- tofu and walnuts - the flavours were subtle but good and I felt could have used another dimension to make the dish something really worthwhile and exciting. The eggplant or a green would have need a great addition to make it well rounded.   There were a couple more options for fish eaters and omnivores. I think as full it'll be a while before I try again. But I will be back!"}
{"text":"Made it. This cute little cafe out of the way... really in the middle of nowhere...is a pleasant surprise. The atmosphere is very Mile-end but right in Parc-ex or maybe some will say Mile-ex. I liked the setup and the vibe, but it is very small. We ordered the eggplant and miso coleslaw entrees and they were good. For mains we had the caramel pork and the clam dish. The pork was good, but I wasn't a fan of the clams. The restaurant was very nice but the food was only OK for me.  The price I found expensive given the food experience. It was a very nice experience and it is a good option for the area, so I suggest you try it and decide for yourself. Enjoy."}
{"text":"Superbe place. Les mets sont delicieux. La decoration épurée. Chaleureux!  Ne vous arretez pas au quartier qui est assez vide en commerces juste autour. Je recommande le menu du soir avec les palourdes au curry vert, un delice :) Autre choix genial: le porc caramelisé!"}
