{"text":"Toller Fischimbiss in sensationeller Qualität. Fisch (Vom Besitzer selbst gefangenen Zander) toll gebraten. Alle Beilagen augenscheinlich selbst gemacht. Kaffee und Schokolade Bio und Fair Trade - sogar der Zucker und der Keks!  Tolle schnelle Küche in einfachem aber passendem Ambiente."}
{"text":"Frischer Fisch, teilweise selbst gefangen, zum kaufen und mitnehmen oder gebraten direkt hier essen.  Leckere Salate, netter Service und vernünftige Preise. Was will man mehr ?"}
{"text":"Der Laden ist einfach klasse. Direkt gegenüber vom Deich holt man sich hier nach einem ausgedehnten Spaziergang ein lecker Fischbrötchen. Oder, wer größeren Hunger hat, bestellt sich gleich ne ganze Fischplatte.    Das Geschäft hat neben dem Tresenverkauf auch Sitzplätze. Nebenan ist ein kleines Zelt. Die Preise sind absolut fair, denn hier wird FRISCHER Fisch verkauft - teilweise kommt das auf den Teller, was gerade noch am Morgen frisch gefangen wurde - je nach Verfügbarkeit.    Wir kaufen hier regelmäßig ein. Da weiß ich wenigstens, woher es kommt !"}
{"text":"Top Laden. Frische, tolle Fische und Gerichte. Absolute Empfehlung, vor allem um dort Fisch zu kaufen und daheim auf den Grill zu werfen. Ob man dort sitzen möchte (in einer Art festem und gutem Zelt) muss man selbst wissen. Die Qualität ist aber absolut Top."}
{"text":"Brathering relativ geschmacklos, Bratkartoffel labberig und fettig. Das Ganze nicht billig."}
{"text":"Leider sehr unfreundliche Bedienung (Chefin) und der Fisch mit viel zu viel Panade.  Wir waren schon häufig hier aber nun war es mit Sicherheit das letzte Mal."}
{"text":"Hier gibt es leckeren Fisch in allen Variationen aus Familienhand. In frischen Brötchen werden verschiedenste Fische serviert (Auswahl ob dinkel oder Weizen) und frisch belegt. So wird nichts matschig. Auch die warmen Speisen werden frisch zubereitet und man kann den Fisch vorher in der Theke begutachten. In einem Pavillion kann man sich gut geschützt auch bei schlechtem Wetter das Essen schmecken lassen.  Von außen sieht alles recht unscheinbar aus und wir wären fast vorbei gefahren aber die Fiachqualität überzeugt komplett!"}
{"text":"Die Einrichtung ist ein wenig rustikal,  dafür aber frischer Fisch und leckeres Essen.  Ich komme immer wieder gerne vorbei.  Der Fisch schmeckt hier mit am Besten weit und breit."}
