{"text":"Clean and with a simple menu. The food was good but not great and the service was OK but nothing that you will remember or be inclined to tip heavily for."}
{"text":"This restaurant used to be called the Brown Derby but has now been renamed The Derby Restaurant as of 5/31/14.  The entire interior has been redone and is quite nice.  The menu and food and prices have also been redone and are HORRIBLE!  Don't bother wasting your time!  It's no longer a family type restaurant and the menu has been shortened.  It is really pricey I thought for what you get.  We have been going here for years but will never go back again.  Heck, we even had two of those money saving groupons for this place but gave the other one away to another patron who was eating there."}
{"text":"Fantastic! I had the vegetable plate. The cake was to die for. Great squash, pintos, ocra, baby lima beans and cornbread. We will eat there again."}
{"text":"The service is very bad. The food is mediocre and the owners are rude. I was very disappointed and will not be returning. I've heard very similar experiences about this restaurant in the community."}
{"text":"Brown Derby is a family owned - family style restaurant that is very good and they have the crowds to prove it!   They have quite an extensive menu, something for everyone!!!  Their Greek Salad is the most unique looking salad I've ever eaten.  It's actually \"pretty\" with the way that they line the tomatoes all around the outside of it.   When you add their buffalo tenders to it....wow - it's a great combination!   (Check their website menu for a picture of it, it is a work of art!  http://www.thederbyonline.com/menu.html)   Their vegetables are especially good; the fried squash is THE best that I've ever had.  Their stewed okra with tomatoes is far better than what I've gotten at other restaurants, and the Mahi Mahi with Grilled Shrimp was extremely good.  They also have homemade cakes which are superb!!  The chocolate cake is to die for, as is the Red Velvet, but I haven't tried the other flavors.  There are about 3 - 4 layers on these cakes.  On Fri nights they usually have live entertainment, so it can get pretty busy!!    There was one exception to my food not being up to their normal standards.  It was a Thurs. night, and I ordered their special which was Fried Chicken. It was 7:30 pm when we went for dinner, and I believe the chicken must have been cooked earlier and then reheated, which pretty much ruined it.  On their menu, it clearly states to allow 25 mins for their fried chicken dishes. I'm sure that the chicken is excellent - if you can wait the 25 mins for freshly fried chicken.   That has been my only issue in the 15+ times that I've been there."}
{"text":"The food tasted home cooked, I really enjoyed the potato wedges with home made blue cheese dressing, I also had the grilled pork chops and home made macaroni and cheese, the cornbread was very good too. The waitress was very pleasant and helpful. The owner  made sure that we were happy with our dinner, the place was very clean, I will definitely come back again."}
{"text":"I know this is a family establishment, and I really hate to give a not great review for that reason, but.... We started with the fried pickles and they were good. I orders the Cobb salad. It was poorly presented, the bacon was overly greasy and I could tell it had been sitting all day in its own grease. The grilled chicken on top was dry and over cooked. A companion ordered the beef tips and it was absolutely terrible. The Mac and cheese was bland and the fried squash was surprisingly sweet (not in a good way.)My suggestion, revamp the menu and only offer a select few things that you're good a making."}
{"text":"Food was mediocre. Waitress excellent and attentive and nice. Kid at the register claimed to be owners son and when we said steak was not good he said he hears that all the time. His responses were so rude. We said we would never be back again and he said he had heard that before too! Seriously! He asked how our food was and we responded. We never insinuated that we wanted our money back and he was absolutely the rudest person in customer service EVER. Too many places with fantastic people to ever go there again!"}
{"text":"Just keep driving past this place. The service was awful. We waited almost 10 minutes before we were seated and there was nobody in front of us and the restaurant wasn't that busy. Nobody apologized for the wait, the lady seemed pissed that there were customers that she actually had to seat. The food is extremely overpriced for the quality. It was lukewarm at best but we had waited so long to get our food (and to be seated) that it wasn't worth the time to send it back to be heated. The chicken parmesan sandwich was not good. The sauce was terrible. It looked like it was their spaghetti meat sauce they used. The onion rings were cold and flavorless - like they had been pulled out of the freezer and barely heated up. Halfway through the meal the waitress asked if we wanted more to drink (our glasses were almost empty) and acted perturbed when we said yes to more drinks. If she hadn't poured from the side of the pitcher and kept giving us so much ice we wouldn't have needed refills as often. More ice = less beverage, that's just common sense. I do not at all recommend this place."}
{"text":"Great food always consistent, owner is always frendly,will definitely be back . won't find a better place in monroe to eat."}
{"text":"I stopped by today to pick up a to go order for lunch. The young man at the counter was very friendly and helpful. I ordered the chef salad and my husband had the triple decker club with onion rings. My salad was fresh and delicious. The portion was just right (I ordered the small). The Club sandwich was a hit with my hubby. The onion rings were crispy and not overly greasy. Overall a positive experience. I will definitely try them again."}
{"text":"On Sept 7, 2016 stopped at The Derby around 2:30 for a late lunch. After being served my lunch, a veggie plate which was very good, my server did not check on me again.  All the pepper shakers had been washed at the same time, so there was no pepper at the tables. I found someone to remedy that. I had emptied my water glass and had to go to the back of the restaurant to find a server, not my original server, to get more water for me. She apologized and said she had not been told that I was 'still drinking'.  Aside from me, there were three ladies seated  at a nearby booth. No other customers to distract servers.  I was happy with my food choices but surprised and puzzled at the very poor/lack of service."}
{"text":"We really enjoyed this restaurant! Service was excellent and the food was flavorful. If you like Southern home cooking you should try it. Everything was homemade and cooked to order. Green beans, fried squash, mac &a cheese, sweet potatoes, BBQ, potato wedges...we tried a lot of good stuff. We will be back!"}
{"text":"Employees are very rude!  Would not recommend as we work too hard for our money to be treated disrespected"}
{"text":"The Derby is great place, if you like hair in your food.  We tried the Derby about a year ago and the food was just OK. We never intended to go back.  Last Monday, all the good restaurants in town are closed so we thought we would give The Derby another try. BIG mistake. We sat down and the waitress arrives she looked haggard. We asked if she was having a bad day. She said it was the usual for this place... Hmmm, bad sign. We started off and ordered some wine. While we were waiting to place our order, the table next to us called the waitress over and pointed out not one but TWO HAIRS in thier food. The waitress brought over the owner who told the people \"Those did not come from our kitchen\". The man pointed out that his wife and child both had blond, straight hair and he had silver hair. Both hairs on the plates were black and curly. The owner was actually rude. The man was charged full price for food he did not touch.   We dropped some money on the table and left, never to return.  We found out later they had recently changed the name from \"The Brown Derby\" to \"The Derby\". I wonder if it was because \"The Brown Derby\" had so many bad reviews and a horrible reputation?"}
{"text":"Awesome southern home-style food!  If you miss Grandma's cooking, this is the place to go.  We were in the area to handle some business, and asked some locals for a recommendation.  I had the chopped steak, with rice and gravy, stewed okra and tomatos, and cornbread.  My mom got a vegetable plate.  Their pinto beans and cornbread were to die for.  We live fourty minutes away, and I will be looking for excuses to go back."}
{"text":"I went with three other work friends. I ordered the chicken tender sandwich and side salad with a water. Took a long time to get food and waitress really didn't seem to enjoy her job. Food was okay. Pretty simple and bland. Got my bill and was charged an extra  $.66 for what? I asked the fun and friendly (joke) cashier why the up charge? She said it was because I got the salad instead of the fries or onion rings. I showed her the menu to explain that it doesn't say an up-charge if one orders the salad. She then replies \"Well, that is the way it has always been. We used to charge extra for the onion rings.\" I spent $9.02 for lunch. What a rip off. I would of rather went to Chick-fil-a. I would of had better food AND a better experience. Do yourself a favor, go somewhere else."}
