{"text":"LOVED this little whole in the wall place.  You have to know what you are looking for to find it.  I had the 3 sides meal of a peanut rice dish, cucumber salad and roasted pear quinoa.  SO tasty - reasonably priced and the owner was LOVELY!  I will go back any time I can when in Tempe.    Felt GREAT after eating lunch there...."}
{"text":"This little place is hidden amongst the hip streets of Tempe, Az, but when you find it it is a great spot to eat local grown and organic food. I went there while playing some dates in AZ and was relieved to find this spot cuz it was in the shade with misters on the patio. The people were very nice and knowledgeable about the food. The food itself was fresh and delicious. I had some kind of a veggie wrap with quinoa that came with a side of shell pesto pasta. This place is great and i am going back when I am in town again"}
{"text":"Awesome place with great healthy food. The menu changes daily, but they usually serve some type of wrap or half wrap with options for sides."}
{"text":"This place is fresh. With a combination of a wrap & an item(s) of your choice, you're assured enough choice for your dose of variety. The service was good. The attendant explained everything right in front of everything. The smoothie was a bit costly though.   But overall, this place is a very healthy option for a meal."}
{"text":"This place is a true oasis.  Minus one star because i thought it was a little overpriced for the food they serve. why  is simple local in-season healthy food so expensive in America ?  The people are friendly and vibrant ( like vegans usually are ). Excellent service. And they truly love what they are doing. We can tell.  The food is delicious and has some Indian influence ( spices ). They do not have juices but do smoothies.   Menu changes daily.  They let me sample and choose which was really nice of them to offer.  The sit out area is gorgeous. They have succulents on each table. And you can hear the water from the nearby fountain and sit in an area surrounded by greenery. Absolutely enhances the experience."}
{"text":"I was here recently with a few of my friends. Beware: It can be difficult to find this place, as it's a bit hidden away from the main street. Fortunately, one of my friends knew exactly where he was going.  This place is a tiny store with no indoor seating. You go in, there's a menu and a glass case full of their (changed daily!) food selection, and you order and pay right there. Water is in a dispenser in the front, and they have glasses for you to serve yourself. At the end of your meal, you just quickly bus your own plates.  In terms of service, the ladies working here are great! They're friendly, helpful, conversational, and very generous with the samples. Any questions, feel free to ask them and be enlightened!  For food, most of my friends got wraps (custom and the wrap of the day), whereas I had just eaten, so I settled for a small hummus plate with pita bread. Despite being a small, I still got what I thought was a big serving for a very good price (around $5). Extremely good, and I liked their selection of hummus!  In general, if you're in the Tempe area and are craving some healthy vegan food, make the effort to find Desert Roots. I definitely want to make a return trip already."}
{"text":"Great Prices!! Awesome, Fresh food!! Menu is ever changing so you can't get tired of it!"}
{"text":"Delicious! Wanting to do Meatless Mondays, my boyfriend and I decide to try this place.    There is a lot of protein in the tomato sauce lentils and coconut spiced chickpeas, and the dressings/sauces that accompany the salads are complex and bright. Everything is made fresh daily!  The use of seasoning in the hummus gave it a mesquite flavor - I don't know how she does it!   Plus, while the portions are filling, they don't bog you down, only energize and nourish you. We haven't tried the hot food yet (breakfast burritos or soups) but look forward to doing so."}
{"text":"Incredibly, amazing, bursting with flavor, high quality vegetarian food that will leave you feeling great. The menu is built conscientiously with amazing flavor profiles and such a warm friendly staff. It will make you realize that being vegetarian does not have to be boring, far from it actually."}
{"text":"Very, very good.  We found it by accident, but what a great find!  The young women behind the counter were super friendly and super helpful. generous with samples.  The vegan food choices were cooked professionally and were absolutely delicious.  Please take the time to visit this sweet, little restaurant.  We hope the folks who have started this place do very well for many years."}
{"text":"We're a couple of seniors who have recently decided to make a dramatic shift from the standard animal-rich diet we were raised on. We thought this would be hard, but if places like this were available when we were born, we might have been vegan from birth. Delicious food, prepared and served with obvious love for what they are doing. Do your body, these happy people, and the planet a favor and have a meal here."}
{"text":"This was a great little Restaurant, delisious food very flavourful with a nice atmosphere. Will be going there again!!"}
{"text":"This place is a fantastic little gem hidden away behind the bustle of Mill Ave. They have a wonderful selection of healthy and tasty foods. I always leave so satisfied.  And for dessert their cookie bars are fantastic."}
{"text":"As good as it gets because there's no other place to compare it. No bling here, just authentic great hearty and healthy vegan cuisine. This is a small kitchen hidden in the back corner of a little interior mall on Mill, serving the best vegan fare you can find around town. They have a small covered patio to enjoy your food outside. Every day the menu is different, and the dishes the chefs make are all inspired from their individual, unique talents. There aren't any recipe books, just artists following their flow. They make everything fresh, with ingredients from local farms, and the folks who work there are the real deal. Everyone is so friendly and just naturally make you feel welcome. On your first visit, you'll feel like a long lost friend; one of the family. They're not trying to be found, but if you find them, you'll be glad you did. Those of you who think you can't get full on vegan, just try a full plate. I have friends visiting for Spring Training next week and will blow their minds bringing them here"}
{"text":"I'm not a vegetarian or vegan, but I love great tasting food! It's my favorite place on Mill Ave for lunch. Desert Roots Kitchen has a delicious rotating menu. Get a full plate. The kale salads are delicious. My favorite dish is a garbanzo bean, peanuts, and dates (sometimes they change the legume or nut, but it's always served with dates). The staff is friendly. If you're in a hurry, don't go right at noon."}
{"text":"I wish I had found this place sooner! I've been in Tempe for over a year now and eat out frequently for work, and this is my favorite place! The menu changes daily, and you can choose your own combination of a wrap/half wrap and/or an abundance of sides. The first time I went I didn't know how it all worked and the workers were patient, friendly, and kept giving me spoonfuls of food as they made it to try! Everything was so good and I was thrilled as a vegetarian to have some options in Tempe. My non-vegetarian friends loved it too. You can't go wrong with the amazing food but the quality customer service on top of it all just adds to this place's greatness."}
{"text":"Fresh food, wonderful crew and a great vibe."}
{"text":"MY ABSOLUTE NEW FAVORITE!! Not only is the food fresh made daily and soooo delicious but the staff here is totally worth going for...Heck I even give them all 5 stars for not being open all the times that I want to go there...limited hours closing at 4pm M-F. Not open weekends darn it!!  I love the small outdoor seating with the foliage...it's quite a relaxing place to sit and do nothing but eat! Tucked away inside so you can't see it from simply driving down Mill Ave. Park in the garage off 5th street for 1 hour of free parking and you can walk right into the courtyard where the restaurant is.  I LOVE this place!! Give it a try, even non-vegans will love the healthy tasty treats! Be sure to ask for a sample if one wasn't already offered to you. I drive 30 minutes to get here and Id drive further...but please don't move farther!! You could open another location and make me twice as happy!!  You can find their daily changing menu on their Facebook page."}
{"text":"Best meal I've had since I moved to Tempe in 1998! Actually the best I can remember anytime. All vegan, local grown, homemade \"out of this world\" recipes made with Love, not business. Leslie opened to \"Feed the people\", and everyone is family their, even the customers, they feed the soul. Different unique \"menu\" for lack of a better term, every day... Different \"choices\" perhaps better...Spread the word, this place thrives by community, family..It takes a village!"}
{"text":"No ambiance, only one menu item a day. It was my first time eating here and I hated the BBQ bean wrap they were serving. It just felt like something random thrown together. Won't be going back."}
{"text":"A friend told me about this place. So healthy. So yummy.  This little gem is tucked away off Mill Ave., but worth finding. I liked getting the 3 entree options to pick-and-choose what they had that day. Apparently, their menu changes all the time. Can't wait to go back to see what else they have!"}
{"text":"I'm not vegan or vegetarian and I still love this place! Everyone is so friendly  Some people are confused when they walk in for the first time. You can choose 1, 2, or 3 sides (a full plate), or half a wrap and 1 or 2 sides, or a full wrap with 1 side. There's also a few other options.  The hummus with veggies is a must!"}
{"text":"Vegan food at its best. I had a Mediterranean wrap that was healthy and delicious. Thanks Ladies (and any dudes?) for bringing healthy, sustainable food to Tempe. If you guys were in New York I would eat here every day!"}
{"text":"This place is excellent. I really enjoyed the minted peas and different types of hummus. The food is always very fresh and the staff is really friendly. Definitely try this place out."}
{"text":"These people understand the concept. True power food at a great price point for those who choose to eat right. Loads of balancing flavors and textures followed up with warm and helpful service."}
{"text":"Some of the healthiest and tastiest food on Mill Ave. I love the selection of food and how often it changes. Breakfast or lunch, it's a great place to go.   The staff always greets you with a smile and is more than happy to tell you what they have..what it is..and what its made of. Their wraps, muffins, tropical couscous, and soups are so tasty.   They have great low-cost coffee too! Forget the chains...Eat & Drink local."}
{"text":"Amazingly delicious food. I'm not exaggerating. Also, super friendly people. I'm gonna be sad that I live 12 hours away from this place."}
{"text":"Fabulous unique flavors great quality and plenty of options. I will defiantly be back! Thank you for the great experience."}
{"text":"Desert Roots really has figured it out. The food, a different menu everyday, is not only fantastic tasting, but what we SHOULD be eating- and it's straight up comfort food. The owner is so great, there is a little patio enclosed by bushes and trees and there is really great music playing. The whole thing is perfection.  I'll be back everyday this week while I'm in town."}
{"text":"What's not to love about this new gem in Tempe? It's located in the cove at Mill&5th, which keeps the noise level down, and has a great covered patio for eating/conversing/reading/relaxing etc. The staff is super helpful and friendly (I had no idea what to get the first time I went, but one of the owners kindly explained all that was being offered that day and what other people had recommended). Oh, and the food is amazing too. The menu changes daily and the food is fresh, bright, and light on both palate and wallet. For a special treat stop by on Taco Thursdays for a unique take on an old favorite.    Also I've left plenty of restaurants feeling good, because I just ate a really tasty meal, but it's rare for me to leave a restaurant feeling good about the restaurant itself. The people that run Desert Roots Kitchen care about what they're feeding their customers and it shows.  *Update* I need to say something about the vegan baked goods at Desert Roots. I've had some bad experiences with animal friendly baked items in the past (see overly dry and tough), but the cookies, brownies, muffins and dessert bread at Desert Roots are excellent. All the baked stuff is very moist with the right amount of chew vs. crumbliness. Also, like the rest of the menu it seems like new treats are whipped up every week, but there are some additional mainstays, like the oh-so-amazing apple oat bars,  that remain in the lineup."}
{"text":"Tried this out for the first time today. Loved it. A quaint place with a nice and friendly staff. I was apprehensive that portions would be super small, and that I would leave hungry. This was not the case. Very generous portions and at a great price. You have to love eating super healthy, being full, for around $8.50 or under.   The food is delicious. It is made fresh each day, and all day long. The other thing that was great is there was a big line when I arrived, and I thought that it being a small business, that it would take forever. I had my food right away.  I highly recommend this place.   Simple, tasty, great service, inexpensive, and a cozy atmosphere."}
{"text":"This place is walking distance from my office and I had been curious for sometime. My boss and I went for lunch the other day and it was awesome! We both had a beet salad with almonds, and a kale salad. Great place,  will definitely be returning."}
{"text":"Awesome, great, fantastic... The best place in Phoenix and around for vegan bites. Fresh, healthy, the menu changes daily. My new favorite place. Will go again, and again, and again."}
{"text":"Awesome food selection and a down-to-earth dining experience.  Highly recommend it even if you are not Vegan.  Good food is good food!"}
{"text":"Everything great, makes veggies a welcome surprise.  What a great patio and friendly staff."}
{"text":"This place is a hidden gem on tucked away just off of Mill Avenue in Tempe and definitely my favorite Vegan restaurant in the Phoenix metropolitan area.  The menu is constantly changing so it's always a surprise as to what your options are going to be but I have not had anything there that I did not love (and they let you sample if you are unsure).  The food always taste fresh and you have a variety of interesting dishes to choose from that you are not going to find anywhere else.  The staff there is always super friendly and Leslie is a machine in the kitchen. You can tell she  puts so much love and takes so much pride in the food she makes and you can taste it. I would recommend this place to anyone. Seating is all outside but they have misters to help keep you cool or you can always take your meal to go. My only complaint is that I wish they were open longer during the day and on weekends but that's just me being selfish because I want to eat there all the time :)"}
{"text":"We had a lovely, hearty lunch here. Many great choices, love that it's all vegan so you don't have to edit yourself! Three choices of hummus or iced tea. We had the wrap of the day, a peanutty rice and greens concoction, very filling. Staff was friendly, knowledgeable and gave great tips about the area (since we aren't local). Visit if you can!"}
{"text":"Luv luv luv Desert Roots! The owner Lesley is truly and entrepreneur and is going places. It's tough to find delectible vegan food that you crave! My recommendation is to sample it all because there are just too many choices from mild to spicy. The atmosphere is always upbeat. Be patient if newbies are in line, remember...you were once one too!"}
{"text":"Very good food. Vegan. That is all I ask for in life and this place delivered. Had horseradish kale, peanut cole slaw and lentil mango wrap. $10  I would love to see more of these open around the US.  Oh yeah...order at counter and they have some outdoor seating."}
{"text":"This is the only place near campus that I will go if I want lunch. The food is great. The people who work there are nice. The menu changes, so you don't get bored of the options. I would definitely recommend."}
{"text":"Hmm.  I got a private response from Sally M. at Desert Roots. Here it is:  Judgey  \"I found your review very judgmental. Do you mind when your server who serves you meats or alcohol offensive if they smoke? Cigarettes, although not the healthiest thing on the planet, are not made from dead animals, or GMOs. Eating a vegan diet, for some, has more to do with a cruelty-free way of living, rather than a health choice.\" - Sally M.  Dear Sally M.,  The issue is not that I am judging you for smoking.  I assure you I do not care one lick of an iota if you smoke.  It's that you smoked right outside your restaurant, then waltzed back in and immediately went to serve up some hummus.  My issue is that this is unsanitary, and whether you're serving a veggie wrap or a ribeye smothered in extra GMO meat sauce, just plain gross.    Rebecca"}
{"text":"I'm not from the Phoenix area, and being here has definitely been different from the mountain-town vibes I'm used to. This is the most welcome I have felt anywhere since I arrived. The staff are friendly and personable. The food is fresh and fantastic (and I'm an omnivore).  There's no set menu, everything is always changing. They have an adorable covered patio mostly surrounded by greenery, which gives it a wonderful oasis kind of feel. Stop in to fill up and get refreshed!"}
{"text":"Delicious.. I've been seeing the menus forever and I finally made it in! You don't have to have meat at every meal"}
{"text":"I went here while milling down Mill for a healthy place to eat as a student. Although it was pricey and a small selection, the food was tasty and allergy conscious but not as fresh as I wanted. They serve it to you out of this fridge display case they have in the front. It's a small hole in the wall that is too crowded to eat in, but the plaza outside is charming enough to pop a squat somewere and chow down."}
{"text":"Finally, real food close to ASU. First time here and the food is exquisite. I had the \"Sonoran Bean & Roasted Veggie Wrap\" with a side of \" Spinach Olive & Oregano Pasta.\" The meal was delicious as well as filling. I can see myself spending lots of time on the delightful patio in the future."}
{"text":"Came by because we saw this on the news. Got there and she was actually closed but she still took care of us. Awesome attitude and bubbly personality. Will definitely be back."}
{"text":"Not only does this place look amazing, they're vegan!! The only thing is....i want to try this place so bad & I wont ever be able to eat there because they're mon - fri & if you're not a student, you probably have that 8-5er"}
{"text":"This place is awesomesauce. Something new every day. I go for the plate with whatever beans, greens, and pasta are for the day."}
{"text":"Yum! Food made with love. My dish was spiced well and had a good amount of heat. Would definitely recommend to anyone looking for a healthy vegan/vegetarian option in the Tempe area."}
{"text":"Awesome awesome awesome. We loved this place. The people were really nice and they let you try things before you order them. Everything here was super duper fresh. I love how they make what they want and you just pick from it. No set menu. Kinda neat because when you go there you never really know what you're going to get :)"}
{"text":"Stumbled upon this hidden gem after giving up on fighting the crowd at a food fair in Tempe. Walked into Desert Roots Kitchen with no expectations and immediately felt at home in their green garden patio. The owner was lighting an incense and the smell of spices and herbs mixed in filled the open kitchen. It was a cozy space that made it all the more earthly. The owner kindly welcomed me, explained the daily changing menu and served me a sample platter of literally everything she had. And literally everything tasted delicious. Vegan or not, this is a magical kitchen to visit! The owner and I talked for a bit and I came to really admire her and the kitchen's philosophy of intuitive cooking in which no menu is set until the day of and no measurements are really made. Everything here is effortless!"}
{"text":"Fresh healthy food with a earthy and organic vibe. Great people working there. A little gem."}
{"text":"I was In Phoenix for business and looking for a quick healthy lunch in the area. I am not vegan or vegetarian but tend to eat healthy. I found this place on Yelp and checked it out. It has a daily menu of wraps with a few choices of sides. The wrap was a dill chick pea wrap and I got a side of teriyaki split peas. The portion sizes were generous and the food was delicious! Highly recommend!"}
{"text":"Love you guys to pieces!  Your food is delicious and healthful beyond words!"}
{"text":"The gang here continues to shine big and bright. I do believe this is my favorite place to head out to a guaranteed healthy and super tasty lunch. I do not know how they don't have to turn people away.  I love what Leslie has done here - if anyone would just try it once, they'd be hooked for life.  Support your local businesses, especially those that feed your body and soul with as much care as they doe here."}
{"text":"Amazing food, great people!  It's my new favorite restaurant!  I don't even ask for specific food anymore, I just tell them to give me something awesome cause it's all good!"}
{"text":"Had lunch while in Tempe for a conference. Needing to avoid both gluten and dairy makes it tricky to eat at times.   The staff was incredibly helpful and knowledgeable.   I had the wrap of the day minus the wrap with a spicy lentil dish for a side.  Both were great."}
{"text":"It's difficult to find amazing Vegan food in Phoenix.. You have to search for the gems and this is definitely one.  Had the daily wrap and a side of the most delicious potato salad.   Friend had the 3 side dish meal and we were fighting over who got to finish the Kale salad.   Wish I lived closer,  but so glad to have found a great place to grab lunch when I'm in the area."}
{"text":"We had a really great meal here during the art fair. It was so nice to get out of the bustle. We had several salads, all nicely spiced. My wife was able to get several gluten free items."}
{"text":"This place is so great...everything always tastes amazing, and the chefs are incredibly creative! The best part is you get to try everything if you want to. The staff is soo cool and it's always a great experience when I go here. This place is REAL, DELICIOUS, HEALTHY food if that's what your looking for. And prices are totally worth it."}
{"text":"I work at RioSalado and Mill and have been here a few times. The food is healthy and quite tasty. There's no set menu as the selection changes daily with choices of burrito, salads and dips.  it's a cool idea that really works in Tempe. No real inside eating area, covered outdoor area. Located in a courtyard off Mill. Very casual atmosphere. Great staff."}
{"text":"Artisanal vegan cooking, healthy and delicious in a cozy and calm environment. The selection is limited and varies daily. Excellent hot soups and cookies.  Attention to the open hours only for breakfast and lunch."}
{"text":"Great Vegan place with all fresh items with staff that is super friendly and make the meal that much better. We ate  on the patio and enjoyed the great weather and one of the most enjoyable vegan lunches we have both have had."}
{"text":"Yummy food and a great place to pick up a quick bite to eat!  I take even my non-vegan friends and they always enjoy the food.  It is great to have another awesome vegan option in Tempe!"}
{"text":"This is by far the best vegan deli I have ever been to! The owner and employees are spot on! The taste of the food has a little kick to it but not to much! So I enjoy each and every bite of the numerous varieties they offer! Something new each day is amazing!"}
{"text":"When you're tired of greasy, generic food, COME HERE. It's a breath of fresh air, or rather a bite of fresh food. They put so much effort and care into every dish and you can taste the good vibes. They have a rotating menu, so you'll get to try many different dishes if you return. Their iced tea and other drinks accompany their dishes very well."}
{"text":"As a newly found vegan, iv taken it upon myself to seek out the best spots in the valley for tasty (and of course vegan friendly) dishes. Where others lack, Desert Root makes up. They have a range of foods to choose from; multiple flavors of hummus, tasty veg creations, quinoas, and for those with a sweet tooth, pies and cookies as well. The menu is ever changing and all made from scratch. Inside you'll see an open, clean kitchen full of fresh veggies and did I mention, CLEAN. This place got the 5th star for customer service. The staff is all welcoming and helpful. Aren't sure what to order? Don't worry, they offer samples of whatever you'd like to ensure a happy order. Im very much so looking forward to my next dining experience here.   *note: only outdoor seating is offered*"}
{"text":"Desert Roots is a great little place for a fast lunch.  Since everything is vegan it's one of the best choices in Tempe for something healthy.  Everything I have tried has been really good and satisfying.  The salads and hummus are always fresh and server up deli style from the case. So it's really quick to stop in eat on the patio and head back about your day.  The staff is exceptionally nice and helpful giving you suggestions of things to try and what they have for the day.  It's a little hard to find at first since it's in a back nook off the street, but well worth it once you know here it is.  If you are curious about vegan food or just want something not fried for lunch this is pretty much the best place on Mill."}
{"text":"Went here today with a friend, she found it through yelp. All reviews are completely accurate! Great food, great prices, nice to be able to know that anything on the menu was going to be good to eat. We were able to test out samples from whatever we wanted before we placed our order. Cannot wait to go back again!"}
{"text":"What a neat little lunch area.  With great patio, shade, flowers.  If you don't mind hipsters, to which I'm curious how you got this far already, then you'll really like this place.  One big negative, and I HOPE it's just because I just came at a wrong time, is that it took a real long time to get food.  Only two people were in front of me, but the whole operations came to a halt, and I waited about fifteen minutes before even ordering.    The lady prepping the food was a machine though, and smiling the entire time.  I have a feeling you'll never eat the same thing twice here as the menu changes rapidly, and she's serious when she says, \"I'll put whatever you want together.\"  I had a curry wrap with a pesto rigatoni (it had fancier names, but this is what it was) and it was delicious!  I had some crazy type of sugar cookie iced tea that I'd like to have a gallon of.  I sat outside underneath some nice trees and cute floral arrangements.  ZEN.    So, probably a solid five stars if it turns out that the wait was an accident."}
{"text":"Love this place. I came to the Phoenix area on vacation and am so glad I stopped by Desert Roots. They run an incredible operation out of a small space, cooking a limited selection of wraps, salads and sides that are all superb. This is the sort of places where you can feel the love in all the home-cooked offerings, feels the sort of food you'd have at your awesome vegan aunt's house. Service was great too, the folks behind the counter were a delight to chat with!"}
{"text":"Love it! Fresh, vegan, yummy! Nice outdoor sitting area, quiet, great prices. You won't be disappointed! Cute little place, a new fave!"}
{"text":"The food is delicious and reasonably priced. You can fill up with a 1/2 wrap and a side for about 8 bucks. They have a menu which varies from day-to-day. All their food is vegan and really unique. For example, I had a jalapeno dill pasta salad for a side. Not to worry though, because they insist on giving out samples of the food so you're not stuck with something you might not like! The outdoor seating is very nice and quiet despite being right on Mill Ave. It is *very* hippy-esque."}
{"text":"SO GOOD. people are friendly. This place changes their menu, i don't know how often, but it's amazing. Surprises are awesome."}
{"text":"This is definitely the place to go for the best vegan food in Tempe. Everything is made fresh daily and they prepare all the food in front of you. Very nice and friendly staff :-)"}
{"text":"I was a bit skeptical about Desert Roots Kitchen before going in solely because it's a vegetarian/vegan restaurant, however I decided to give it a try because I learned they have something new everyday. To my surprise, the food served here was delicious!  On the day I went in, they were offering a wrap, vegan soup, coffee hummus, and a few other options. When I told them that I had never been in before, I was offered a few samples. I really liked them all but ended up getting a half wrap, teriyaki rice pilaf, and the potato salad. For a plate of three items, it was $10+tax.  The wrap and sides were all really filling and flavorful. All the veggies were super crisp and everything tasted fresh & healthy. I wasn't able to finish three items so I'd only get a half wrap with one side (or any two items) next time. It seemed a bit on the expensive side, but overall a good choice for lunch."}
{"text":"So glad I came across this place!!!   Super fresh and tasty.  I'm not a vegetarian, but everything at this place blew me away.  And I can say everything, because the 2 guys that were working there let me try a little bit of everything before I ordered.  I ended up getting a chick pea wrap with a side of pasta.  They change the sides pretty much everyday, but you'll never be disappointed.  Yummy iced tea too!"}
{"text":"There is nothing to compare it to. Genuinely friendly, dedicated staff. Ridiculously local sources. Reliable *and* full of surprises."}
{"text":"Awesome food, great people, I will definitely be back!  I gotta be honest, I was skeptical at first, not being a vegan and all, but the food was incredible, and so flavorful!  I like the idea of a changing menu, and going there was like stopping at a friends house for lunch, highly recommend stopping in."}
{"text":"I am so happy we decided to come here. Great service and most delicious wraps. We were here for breakfast and got the fantastic breakfast wrap/burrito. I also got the signature smoothie, which I can't stop thinking about. How many ways are there to say delicious!  We were so lucky they were open when we came by. There was only one person working because others were at a music festival. But, that one worker was so kind, hard working, and friendly we hardly felt like the place was understaffed. I wish they were open more hours.This is food you want again and again."}
{"text":"Outstanding.  The people are so nice and take great pride in their food which shows.  Will definitely be a regular."}
{"text":"I am sooooo happy to have found this place!  I dragged my fella here after noticing it while shopping on Mill.  We both enjoyed the plate special.  It was a vegetarian wrap filled with black beans, quinoa and other veggies.   It was really flavorful!  The 2 sides we picked was some asian inspired noodles...not really something I would pick again, but I just didn't like the spices.  And a massaged kale salad that blew my socks off!  My hubby got one bite of that before I devoured it.  So fresh and delicious.   Verdict: As a dedicated carnivore this is my new favorite place when I feel like being a tourist vegetarian!"}
{"text":"Their dishes have flavor that can keep me, a guilt-ridden unabashed carnivore, going vegetarian for long stretches.  Occasionally I'd prefer the food with a little more cook time (brown rice, occasional legumes). But I think they like things al dente."}
{"text":"My new favorite restaurant in Tempe!  Nice to have healthy food for a reasonable price.  I've eaten here multiple times and have never had any thing but the best.  All vegetarian and freshly made food.  The only problem is that I can never decide what to get because there's so many wonderful options.  I end up getting the 3 sides meal.  Lots of wonderful things done with lentils, kale, and awesome wraps to boot.  I've suggested a recipe book, but they inform me that everything is created from the fly and nothing is written down, great unique combinations of flavors.  Keep up the good work!"}
{"text":"Awesome place- my go to spot in Tempe Fresh, local and organic and delicious to boot!"}
{"text":"By far the best vegan place I've been too. Food is awesome. Owner is awesome. Awesome place. Will definitely come back"}
{"text":"Definitley 5 stars!  It's a little hard to find, park on the street and walk in to the little group of stores behind the walk.  The food is flavorful and slightly spicy.   These guys know what they're doing to please a vegan pallet.   It's my first time here but most of the customers seem to be regulars."}
{"text":"Vegan cafe with great soy parfaits? CHECK I Will be a freshmen at ASU next year and have been mapping out my common food destinations. This is one of them! I walked in to order today with my lovely girlfriend and had the most pleasant dinning experience. I was welcomed by friendly staff and healthy options. I opted for the wrap for $8.50. Definitely a good choice. I did so because I saw a ready burrito there and it looked scrumptious.  I was given some very distressing information.  \"Im sorry but we are out of Mexican rice\", said the man at the counter. My heart sank. This was it. Its all over. We should of settled for the place downtown! But wait, a light shines. \"Why don't you just tell me what you want in it and ill make it for you in the wrap?\" There is a God after all! and he is hiding in my completed wrap of purple pepper, basil, Orzo mixed with coconut lentil soup and fresh green vegetables. This went so well with the alternating bites of my girlfriends delicious soy parfait (3.50) with homemade granola sweetened with honey and fresh fruit.  Top it off with one of their amazing home made brownies and you've got yourself the right way to start your day."}
{"text":"Fresh & tasty vegan meals; soups, wraps, salads change daily. Owner Leslie, and Chris who helped me are friendly and welcoming. An oasis of yummy healthy food in a fast food college town. Check them out!"}
{"text":"This place is a real desert gem. I am an avid meat eater and I don't even miss the meat when I'm having lunch here... makes me think I could actually survive as a vegan. The owner really knows what she is doing! She's wicked smart with the veggies - especially cooking kale and using great spice combinations.    I always get the dolmas with tahini, and if they have it, the kale salad (there are several variations) it never disappoints. The best option is to get the lunch plate with 3 items. It's almost too much food for me, but I can never just stop at 2 items. You are allowed to taste a few items if you can't make up your mind, my favorite special item was the apple slaw - so fresh and tasty.     On top of all of this tasty food, I can't imagine a place that has better customer service. The first time we went in my fiance wanted some fruit with granola and even though it wasn't on the set menu for the day, the owner made something up special for us and it was the tastiest fruit medley I've ever had - ripe, glorious fruit with freshly made granola. YUM.    I honestly have no criticisms... this place is great. My ASU co-workers all agree this is the best spot for a lunch date. I hope it doesn't ever change (unless they open dinner service, which would make my life totally complete)."}
{"text":"Excellent and healthy food that is very good.  I am from out of town and was lucky enough to find this gem.  People are very nice and the menu changes all the time.  It's my place to go to eat when I am in town"}
{"text":"Friendly establishment- The staff was a hospitable bunch. You walk in to a view of smiling faces, a crew excited and passionate about their cause. The food is vegan, globally inspired. Their menu changes every day and they use ingredients that are local and organic. They encourage taste testing. Lots of variety! I enjoyed a chick pea wrap with hummus, veggies and a zucchini pasta. The food was very flavorful! Reasonably priced for the portions and quality ingredients they serve. I couldn't resist the snicker doodle bar which I think was sprinkled with heaven. The tea was truly refreshing. I sat on their patio, the environment was tranquil with good energy. Simply Devine.  P.s - I wish they were open on the weekends!"}
{"text":"For me, I have a palette that enjoys the more flavorful of what DRK has to offer. So I ask them for the more flavorful items, they help me decide, and...buonissime!"}
{"text":"Strong menu selections, albeit few and constantly changing. If you thought you would have never enjoyed eating vegan, think again! Give this awesome place a try!"}
{"text":"Amazing vegan food. So flavorful and colorful, it's just everything that vegan food should be. The food is so good that you won't be missing non-vegan food at all. I wish Desert Roots Kitchen was available in every city that I visit.  The staff are friendly and helpful. There's a small outside seating area. It's not a good place for a really big group, but more of a good late breakfast and lunch spot either alone or with a couple of friends."}
{"text":"Awesome place tucked away off Mill for healthy and satisfying vegetarian food. The people working there were so nice and helpful as well. The menu isn't huge but it's easy to get variety from the different flavors of hummus and different sides available. I loved the maple mustard hummus (weirdest sounding combination, but so dang good) and the lentil wrap. My lunch was filling enough to last me until dinner, which is hard to find with vegan/vegetarian food. I love the small patio with bougainvillea."}
{"text":"Local, fresh, funky with a great peaceful vibe from everyone, employee and patio \"friends\" you make included..."}
{"text":"I was looking for a light healthy meal after cheating last night. I found Desert Roots on Yelp and decided to try something new. I ordered the plate which was 3 choices for $8.50. I got the chana masala, dolmades, and pasta salad. All dishes were very good and flavorful, along with being Vegan so I didn't have to worry about dietary issues. The portion size was very generous, a very good value for the money. They also offer samples that you can try, before deciding on what to order. I would definitely come back."}
{"text":"I love the atmosphere here. The two individuals working were welcoming, offered samples, and made this a place I will be visiting in the future. The food was a filling yet clean lunch option. I ordered the wrap with a side and it was more than enough for one if not two people."}
{"text":"This place is awesome! I'm the farthest thing from from a vegan/vegetarian, but really enjoyed the wrap of the day I ordered (red lentil tabouli I think) and the 2 sides that came with it.  The open kitchen is great and everything is super-fresh and originates locally. This is a great lunch option in the Mill area."}
{"text":"This place rocks! Walking in feels like you are right in Leslie's (the owner) kitchen. New menu everyday, food is prepared fresh and is vegan friendly! Always gluten free options as well. I eat lunch here everyday since discovering it last month. Always tasty, always healthy, and always a friendly atmosphere at desert roots!!"}
{"text":"I've been wanting to try this place for a while since it's a vegan/vegetarian restaurant. The food felt healthy, light, and tasted delicious.  I love that they make the food fresh every day and have whatever is left in a case so you can see what people liked and was popular or maybe wasn't as popular, but you get the sense that everything is good because there's hardly anything left!  Good sign that all the food is good.  So I tried the full plate with a lentil and spinach wrap and the kale salad. I'm mostly skeptical about kale salads because they are often very acidic in order to take away the sharp green bitter taste of the kale. I actually like the green taste of kale, so I really appreciated that this salad wasn't acidic. It was hearty and savory.  The wrap was so tasty. I loved the lentil mixture wrapped in spinach and cabbage and then held together with a wheat tortilla. So good, healthy, satisfying.  I would love to try this place again and see what else they serve.  It felt very community oriented but you have to sit outside if you want to \"dine in.\" I guess it could be cool to take the food to go since you really don't have to wait to get your food.   Can't wait to go back."}
{"text":"The food was delicious and the service was great! I really loved the simplicity of the menu (not too many options) but each food option had unique-seeming flavor combinations and seemed well thought out.  The day I came, they were serving a delicious artichoke jalapeno rice pilaf and fun lentil dishes.  I ordered a 2-item plate and chose the rice pilaf as well as a green chile potato salad that I didn't love.  However, I loved the flavors and would definitely come back again.  The iced teas are delicious too!  Definitely come and give this place a visit :)."}
{"text":"I think I have eaten here probably a gazillion times since I first decided to try it out this summer. It's not very often I get hankerings for the food at one restaurant which can't be satisfied anywhere else on Earth (I used to get that with Lo Lo's Chicken and Waffles, until they realized that most middle-class white people have no palates, and the quality started slipping).  If you bothered to read the above parenthetical remark, you'll note that I am not even a vegan. I'd *like* to be a vegan, because large scale farming processes are usually inhumane, but it's just hard to find the wide variety of culinary experience I enjoy when completely excluding animal products from my diet. That's why Desert Roots is so great: their food just tastes great. It's unique. And you're not going to get the same meal twice. Even if I didn't *want* to be vegan, I'd still eat here as often as I can.  The way the place works is as follows: 1) You walk in the door, and look at the items available for the day. 2) You go with the wrap-of-the-day, because it's going to be awesome, unless you're that person who inexplicably hated the wrap, yet her only other review was glowing praise of the super-shitty Green. 3) You nearly go mad because you're too indecisive to pick which other two items you want out of the four or five sides that look totally delicious. And you want the hummous too! Aargh! 4) You enjoy the hell out of your meal.  That's really all there is to it. This is just well-seasoned, fresh, home-grown food that's not gimmicky, not oversauced, and not something you'll easily find in any other restaurant."}
{"text":"We arrived in Scottsdale and needed a quick bite to eat!   The reviews for This spot were awesome so we had to come check it out.  It's a cute little cafe with about 10 outside seating options.  They had a lentil wrap of the day so I shared this along with a side kale salad.  You can also try up to 3 sides before you pick which one you choose.  I also got to try the green beans and black beans which were both really good!"}
{"text":"Great service and company! I loved being able to talk with the guys working behind there AND the food was great. Got what I wanted and found a place to come back to! Try the Chili-Mac. It was incredible, and the kale salad too!"}
{"text":"THE BEST! This is exactly the kind of food I've been looking for. Thank you Yelp for helping me find it. Desert Roots is not just vegan, it's plant based. The food and drink menus change daily at the discretion of the cook. I can't wait to come back and sample more creations.  My BF and I, both got the half wrap with two sides because we wanted to try as many different foods as possible. The dolma are to die for! The portions are large but you can stuff your face and not feel sluggish. Usually I am totally guilty of adding way too much sweetener to my teas, but the iced teas were so good that adding anything would have been completely unnecessary (FYI: Free refills!). Same with siracha, I tend to drown my food with it, but not here. The foods and drinks are just so fresh, balanced and good that it's completely unnecessary to add any condiments.    The staff is amazing, you could tell they took pride in their creations. When I asked the server what his favorite side was, he compared it to having to chose which one of his children he loved the most. The outside seating was like an oasis, surrounded by bougainvillea vines and the sounds of running water.   My single complaint are the opening times: Mon - Fri 10 am - 4 pm. Please consider being open on a Saturday!"}
{"text":"A delightful oasis with friendly staff, fresh food and a rotating menu with local ingredients."}
{"text":"They're okay, I wouldn't go back because of the price, and limited selection, but they aren't too bad. I had some sort of  spicy cold pasta dish with a side of kale. It was alright. I will venture elsewhere for organic food. They make a valiant try, but its not worth struggling to find their hidden location."}
{"text":"The food is so fresh and delicious here! I love how you are encouraged to sample everything before deciding what to order. Loved the tortilla soup and their wraps are awesome. Each dish is different but somehow all compliment one another and taste good together in the wraps. If you are a supporter of local, vegan, fresh, seasonal, organic food and nice people then I would definitely recommend."}
{"text":"I originally wrote the review below on the DRK Facebook page in early February 2013 soon after eating here for the first time.   Fast forward 14 months and I'm more impressed and happier than ever. The \"always changing, always delicious\" daily selections that Leslie and team produce never fail to please.    Fabulous flavors, incredibly fast and friendly service -- and entirely vegan.  My week isn't complete without my two regular visits to DRK.  That said -- even if you're not vegan or vegetarian -- I challenge you to give them a try. You will not be disappointed (and your body will be very happy with you)!    Original review: Thrilled to have found a place like yours so close to ASU.  Vegan food that's delicious and local -- with fast and super friendly service.  Not to mention the relaxed outdoor patio seating.  Perfect for my break between classes. I'll be back!"}
{"text":"I came in with my two girlfriends who were really not sold on the whole idea of vegan food (or vegetables themselves). The really loved the food! We got to meet the owner Leslie, and she was really nice, and helped us choose some delicious kale salad and yummy dessert bars.   On top of that it is really one of the cutest places in Phoenix. Awesome decor! And fresh ingredients from local vendors. Local = Best!"}
{"text":"Hard to find if you've never visited, but worth the trip! I work in downtown Tempe and this is quickly becoming my favorite lunch spot. The menu changes everyday, but you can check their Instagram if you'd like to see it beforehand! Perfect healthy lunch and you'll typically have some leftovers for later. Everything I've had here has been delicious, and it's a great way to break out of your eating comfort zone. :)"}
{"text":"I thought this place was fine. It's not glamorous at all and the day that we went their blender was broken so I wasn't able to try their apparently famous deliciously delicious smoothies. I got the full plate and it was good, but I felt the portions were a little small particularly what I was paying. As one of my sides, I got a salad and I felt that it was really not worth getting the salad because you get way less food than if I had gotten two more heavier sides. Perhaps they should have done this by weight - otherwise I'm just going to order the three heaviest sides in order to feel like I'm getting the best value for my money. Flavors are good but I expected a bit more."}
{"text":"Great vegan food. Very fresh . We got a wrap and shared it because it was very big. We also got a side of their version of alfredo pasta . We sat on the rustic patio and even though it was 100 degrees outside the misters kept us cool and we loved it !"}
{"text":"I absolutely LOVE this place!! The FOOD is AMAZING, and my customer service experience was equally as wonderful.  The staff is knowledgeable, friendly and they make you want to come back.  I'm definitely a fan!!"}
{"text":"Yummy dishes that I had. Lentil wrap was really good. Super flavorful and needed zero hot sauce or sauce addition.   Atmosphere was mellow and people seemed friendly. Would definitely recommend and return."}
{"text":"I was in a flight lay over in Phoenix and decided to explore the beautiful Tempe downtown on a weekday evening. Found 'Desert Roots Kitchen' on yelp and was enticing by the name and the cuisine. Yay! It was Vegan. Was slightly hard to locate the restaurant but kind of liked the rustic location :). The display said open for Breakfast and Lunch. I saw someone inside(probably the owner) and got excited but she  said they had closed the kitchen in the afternoon. Was disappointed to hear. The sweetest thing was she offered me a display spinach and lentil wrap for me for FREE and asked us to try since we came looking for the restaurant. I was totally amazed!! She even told I would have offered you a soup to try. In every bite I could feel the freshness of the greens and lentils. The wrap looked simple but loaded with lot of proteins. I wish they had a branch in the Bay area, I'm glad to have tried something and the owner was really sweet to have offered the wrap. In my next visit to Phoenix I will surely go back and try other dishes. Recommend this restaurant to everyone who visits Tempe."}
{"text":"I've been here twice now so it's confirmed that the friendly service and delicious, fresh, and healthy food is a consistent experience here. Eating healthy and vegetarian is a challenge, especially going out to eat. There's not a huge selection around Phoenix that fits these tough requirements, so I am pleased to report that Desert Roots is what I've been waiting for!! The people there take a visible pride in what they do, and that's great to see! The outdoor patio is adorable, and surrounded by fountains and foliage, it's an ideal lunch setting. Thanks guys!!"}
{"text":"I am a foodie. I pretty much any type of food. I am not vegan or vegetarian. Although I try to be healthy, I indulge less than healthy options if they are tasty.   That said. Desert Roots is amazing. It's simply some of the best food in Tempe. It doesn't matter that it is vegan and healthy. It doesn't matter that you feel great after eating it. What matters is it tastes DELICIOUS.    Leslie, the owner, puts so much heart into her dishes and it shows. I wish I still worked near by here. I would be in much more often."}
{"text":"A rotating menu consisting of A wrap of the day and many \"sides\" which are really dishes in themselves.   It had been some time since I had venture to this little courtyard hidden away from the hustle and bustle of mill. I was glad to see a small shop brining it back to life. There is a covered patio with a few chairs and inside a counter to order at. (this means summer time may be a problem)  The are a few options including a wrap 1/2 wrap with a side two sides or just many sides. Again the sides are well crafted dishes in their own right and not just chips.   I tried 1/2 of a warrior wrap which was filled with pinto beans and cactus in a green tortilla. It was pretty good which is high praise as I am not a wrap fan. The real star was the peanut and bok choy salad I had with my dish. Rich and great texture.   I was also pleased with the prices, $6.50 for a 1/2 wrap and a side is a bargain compared to other local organic veg places.   If the weather is nice, you can't go wrong by trying this place out."}
{"text":"Honestly great vegan food. The people here are incredibly nice and outgoing. Although I usually stick to their signature smoothie, I love the fact that their menu changes daily and everything is made in house. Great place with great food."}
{"text":"This place is great. They have healthier options on Mill, that change daily. I had half a chipotle wrap and a bean salad with sweet potato that were both delicious. They're newly opened, welcoming and nice. Also, the outside patio is within that little courtyard and is a nice place to sit outside when its cool enough."}
{"text":"I'm not a vegetarian, but this place is excellent.    This space used to be the \"In Season Deli\", another great establishement of 28 years.  However, Desert Roots has picked up where ISD left off.  The menu changes daily and is always fresh.  Although their are some things I like more than others- everything has at worst been good, and at best- been amazing.    A locally owned gem among the commercialism of what is now Mill Ave."}
{"text":"Delicious and healthy food. Very nice staff. Menu changes daily based on what's fresh and in season. Can't recommend this place enough."}
{"text":"A menu that changes every day and they use local fresh organic ingredients! And everything is vegan plant-based. I just think that is so impressive. Their dishes are so creative and flavorful. I usually order a sampler platter of 3 and choosing 3 of their dishes can be hard because everything always looks so delicious. It's all outside seating, but their  patio is covered in a nice courtyard setting. The staff is always very friendly and will let you have a little taste before ordering if you'd like."}
{"text":"Healthy, Fresh, Local, Delicious!  Fantastic Food! I'm not vegan/vegetarian, so don't let that scare you away if you are the same! I would recommend the daily wrap, I have never been disappointed. Also the hummus is great and you can get it with a side of veggies or pita. The employees are friendly and can help you decide what to sample or get because there are usually too many good options."}
{"text":"The one thing that is great about this place other than being 100% vegan, is that you can try any and all of the fillings before you decide on what you want which I highly recommend doing because some of their dishes are way better than others. I liked the teriyaki dish, the curry peas, and the lentil hummus. Also their signature smoothie is very good if you like peanut butter. I also recommend trying the cookies if they have any left. Try to get here earlier than the lunch rush because they can sell out very quickly. The staff is very nice here, better than any other staff I've encountered and they are very accommodating and friendly if you have any questions. Some of their dishes can be quite oily, but the food is fresh and be sure to try before you buy. I have to say that it is quite expensive here too, so that is something to keep in mind."}
{"text":"The food menu is always changing and it is made fresh right there in front of you. Awesome place with a relaxed atmosphere where I can escape from \"Corporate America\" to recharge at lunchtime!"}
{"text":"I LVE DESERTROOTS KITCHEN  Delightful Service, menu, beverages, sweets, atmosphere, and more Mahal for your service to the community Like"}
{"text":"I have come in 3 times now. I think I know what I am talking about....and what I am talking about is the most healthy, organic, and delicious veggie dishes I have tasted. Rather than masking their foods with mock this and Seitan that, this place dishes out ridiculously tasty treats. Come veg out with me  ~Fud/Drink~ The food here folks...so good. They hand prepare everything in store either the day before or the day of. I mean, literally the kitchen is open you can see them preparing the dishes in front of you. Because of the sheer size of the dishes they are doling out (usually at least 6+ handmade dishes) they are prepping all day long. Luckily I have tried both their breakfast and lunch (lunch twice). For breakfast I got a tofu scramble with potatoes...SO GOOD! I had some vegan dressing (from Whole Foods) that I dipped it in once back in the office, and it was heaven in my mouth. There were no byproducts, just straight up organic firepower.  For lunch please see my pics :-) I have gotten a couple wraps along with legume-filled sides. I absolutely adored the Baba Ganouche Salad as well, btw. The best side to date is the Quinoa & Israel Couscous....it is wickedly good. No complaints with my tummy either, which happily enjoyed the deposits of fresh veggies.  I want to point out I am not a vegetarian. I am more Pescatarian than anything else, but I eat a ton of veggies. I think I do veggies really well....but Desert Roots knocks it outta the park consistently. They do have random drinks to choose from, more natural and such...I just opt for water with it being so hot out. No liquor here, btw.  ~Atmosphere/Service~ Top notch service here. They welcome me each time like family and are more than willing for me to try. I see how hard they are working and always give a bit of a tip because it is such a small operation (maybe 5 people working here about?). I have come during off hours, so the atmosphere is pretty quiet, but they have a great back patio and I can guarantee this is an easy escape from the craziness on Mill. Keep that in mind, this is nothing like anything else on Mill, very quiet and relaxing space for the person who is more to themselves.   ~The Downlow/Extra~ Come here and eat some very healthy food...while not overtly realizing it :-D The staff here does an outstanding job and the quality...OH THE QUALITY.... top of the line. 5 stars goes for creativity in dishes, consistency in quality, top notch service, a quiet escape on Mill (who would've thunk it), and for proudly being vegan friendly through and through. Jefe star of approval goes out to Desert Roots!"}
{"text":"Super friendly and delicious. I had the hummus plate-2 scoops (1 of each flavor- they change daily) with pita and a variety of local veggies to dip (cherry tomatoes, zucchini, carrots), comes with salad (various kale/lettuce/sprouts) and 4 dolmas. It was yummy and filling. Also tried both iced teas- apple chai was fantastic. They only have outdoor patio seating, but it is shaded and their misters work well- effective but not drippy- a nice break from the AC. A perfect lunch escape from the office on a hot summer day."}
{"text":"Off the beaten path and hidden in a little courtyard. Hard to find, but worth all the trouble. The menu changes daily, yet I'm sure it's always delicious. They have little tubes that driver a mist on the patio to keep you cool in the heat of summer. Only thing I would have wanted was a bit more food on my plate,  it was great, and I'll definitely return when I'm back in the Phoenix area!! Give it a try!"}
{"text":"Tasty, small vegan joint with a menu which changes daily.  To order, you choose a couple of entrees by looking at them through a glass deli case in their tiny kitchen hidden inside the courtyard.  Outdoor seating on their covered patio is the only option, and it's nice.The potato salad with teriyaki and red cabbage was amazing - could've eaten it all day.  Split peas with turmeric and carrots was a bit bland, not enough turmeric flavor, but great texture. I felt full after eating the \"full plate\" of 3 entrees for $10."}
{"text":"Very friendly staff. Delicious food. Always something new on the menu. Quaint hidden spot just off of mill avenue. If you're looking for something quick, delicious and healthy go here."}
{"text":"Wonderful hidden gem right off Mill Ave. local ingredients make everything taste so fresh. Loved the kale potato salad and wrap.   Great prices and friendly staff. Beautiful cozy patio with shade and tons of plants. Will return 100%."}
{"text":"This place is fantstic. Thr food was fresh and made with lots of love. They were very encouraging of sampling their items so you are absolutely content with your order. Also, words cannot describe the amazing customer service of this estblishment.  I'm sad that I don't live in the state to come here more often!"}
{"text":"Celebrate: there's a great vegetarian breakfast and lunch spot on Mill Avenue, Desert Roots Kitchen, and it offers up a rotating menu of tasty veg-friendly items with local ingredients for peeps who love eating healthily.  The cafe, which has been open for about the past 5 months, is hidden in the plaza off of 5th St. and features a great case of vegetarian dishes, such as pasta salad, pumpkin pudding and dolmas. The spot also serves coffee and breakfast items and a changing daily special, which I got when I went there recently--the pinto bean wrap, with brown rice and peppers.  The joint is order-at-the-counter, and there's a little patio outside where you can nosh. Getting my food was super-quick, and the staff was very friendly. Most meals cost only around $10, and you can build your own meal with a variety of sides, an option I loved since everything looked so good. My pasta salad was really tasty, and the wrap packed a protein punch and was really filling. While the spot doesn't currently serve dinner, the manager I talked to said she anticipated dinner hours in the near-future."}
{"text":"The food is over priced for what you get. Half a wrap and small side for $8+tax?! $10 for a full wrap?! It never tastes like it's worth $10. I could make a better wrap for $1. Plus, the service from the male servers is pretty poor. Never going back"}
{"text":"Everything vegan! So safe and good! New menu every day. I had a wrap and the service is amazing."}
{"text":"An excellent choice if you are looking for extremely fresh, natural food.  Menu changes daily which always provides for a surprise, the owner and coworkers are extremely pleasant.  Nice outdoor seating area!"}
{"text":"This is an adorable little place with the worlds friendliest people working there.  I dropped by for lunch and ordered the salad.  Their menu changes daily but this particular salad was packed with a hodgepodge of ingredients - bell peppers, tangelos, green and red olives, jalapenos, carrots, all on a lovely bed of mixed greens.  I had the blood orange and ginger dressing which was an absolute delight for the taste buds.  I quickly googled a recipe to try and recreate the dressing at home.  To drink I had a blueberry tea which was delicious."}
{"text":"Healthy. plant based and delicious! You can tell that the owner and staff are happy serving up great options to those of us who want something fresh and different. I took a omnivore friend to lunch here and she loved all of the options that we sampled. She even finished her wrap and two sides before I finished my food. Everyday there is a new feature wrap to choose from which you can check on their Facebook page. Everything is tasty so you can't go wrong with whatever you choose. I can't wait to come back for the breakfast wrap. This is homemade vegan food and it is great!"}
{"text":"Best meal we've had during our week long vacation.  The wrap was great, potato salad - fantastic, and side of kale - mmm mmm.  We'll be back."}
{"text":"Staying at the Mission Palms hotel for the weekend, and wanted a quick bite before getting into the board meetings started. This gem of a place had a fresh and interesting menu, and I was grateful for not only the staff's recommendation but also the samples. I'm not a fan of cilantro, so the ability to try the salad that contained some  before ordering was a welcome treat. The food was fantastic, and the atmosphere is quiet and charming. I'm definitely making plans to stop in again when I'm back for the next conference!"}
{"text":"Wonderful place for lunch! I love the idea of the ever changing menu. This place is healthful and a great choice away from a heavy burger or some of the other more noticeable places on Mill. I highly recommend this place and the staff of the restaurant was helpful in making my choices."}
{"text":"My son and I ate here before we moved to Washington state, it was so good. It's such a joy to be around people with heart!"}
{"text":"Apogee of hippie vegan lunch experiences.  Very cool hipster vibe. They have a daily menu that changes and the items cater to the macro crowd. Think lots of beans legumes and savory veggie items.  They always have a couple salads on board too which looked pretty standard.   I went with a full plate plus a full salad which was delightful. They use a flavor palate that played with ginger coconut basil and turmeric. Yes that sort of thing.   The staff is super friendly and accommodating. The vibe is relaxed and the al fresco dining is quite relaxed. There is a heavy peace and eco feel to the place. It is not full service so you'll be putting away your own plates.  It reminds me of a micro Life Alive if you're familiar with the hippy nirvana in Cambridge Massachusetts."}
{"text":"I was back and forth today on what I wanted to eat. In doing a \"healthy lunch\" search on here, I came across this place which I had bookmarked some time ago.  I called ahead of time after looking for a menu online. The lady who answered was very bubbly and willing to let me know, everyday is special here. By that she meant there aren't specials persay but a daily wrap item with a number of side choices available. She read me the whole list of things they had and I couldn't help but to check it out.  It has been awhile since I have visited Mill Ave. I was aware there have been many changes to what is available there but I must have missed the \"No Free Parking\" for anyone, no matter what. I am beginning to realize it is unfair to drop stars for the business due to a decision made by the city. Okay, so I pay my $2 for what I know will take less than 20 minutes. Parking lot off of 3rd st & Ash.  The location is hidden a bit in the court area, it does provide signage if you're paying attention and quite honestly, had I had the time I would have sat on their quaint little patio to enjoy my food. The gent was very friendly, explained the whole run down and chatted as he prepped my wrap for me.   Double dill chickpea wrap with a side of tomato lentil curry. It was difficult to decide on my side... the Southwest Tapatio Pintos sounded really good as did the Pineapple Jalapeno Rice Pilaf. However, if you've read any other reviews, I LOVE curry! With that said, there is not enough curry in the world to satisfy my curry needs. And so, tomato curry lentils... add some broccoli, shredded carrot, green onion, lentils, tomato and not enough curry (for me). The curry is there don't get me wrong, but I would douse it all over, in and on top.   The double dill chickpea wrap, I wasn't sure what that even meant. Whole chickpeas, likely for some substance and a rice hummus like filling? Zucchini, maybe a dash of cayenne, identifiable dill (thank goodness) and crispy crunchy romaine. Gone, in seconds! I feel like I had a pretty healthy bite to eat today. Oddly enough, it's the one time I may say there wasn't enough salt. That isn't to say the flavor was lacking because it wasn't by any means. It just means they likely use an appropriate amount of salt and let the flavors do the talking. Easier to put it in than it is to take it out, I always say so the salt part is really neither here nor there.   Some of the sides are the same as yesterday, which he said everything is made fresh, probably not necessarily daily, depending on their business from the previous day. I am totally good with a next day side although I did notice on their instagram posted menu from yesterdat. I like the thought that this minimizes waste. Rather than tossing tons of food daily, you get a few options that assist the undecisive customer and in the meantime prevent tons of wasted food. So, kudos to them!  My guess is that since the menu is ever changing and if you don't have Facebook or Instagram, it's best to call ahead to find out what they have for the day."}
{"text":"This place is a AMAZING! When you first walk in your are hit with the smell of deliciousness! I found this place through yelp when searching for a place to have a healthy meal. I was traveling for the week and getting tired of big heavy meals. They had exactly what I needed! I ordered the wrap of the day with two sides. The wrap was chickpeas and brown rice and some other awesomeness. For my sides I had veggies and sriracha hummus....hands down best hummus EVER created! There offering change daily, but I suspect they are all equally delicious! The people were incredibly happy and helpful! I LOVE LOVE LOVE this place!!!"}
{"text":"Love this place and the fact that the owner puts her heart into both the business and the food. Lunch today was a combo plate for me- cajun lentils (perfectly cooked, not at all mushy like when I make them myself), jalapeno kale salad sweetened with just a bit of coconut (yum!), and cajun tabouli (not like any tabouli I've had before, but so good). I brought my meat-loving husband who really loved the lentil wrap and ginger potato salad. Great iced tea with free refills. And I found out this place does catering- good to know. Hope to be back very soon!"}
{"text":"Being a recent vegetarian, I'm always looking for new diggs to eat.  I saw Desert Roots popup on HappyCow, and thought I'd give it a try.  Overall, a cute little down-to-earth deli on Mill, with a small but tasty made-from-scratch menu which changes daily.  No in-house seating, but there is a decent outdoor seating area; there are cooling misters, but in the summer you may want to just grab-n-go.  I had the Thai wrap with honey mustard potato salad, and I wasn't disappointed.  The wrap was loaded with rice, beans, greens, and a touch of peanut sauce.  The potato salad was not your run-of-the-mill either, with tasty bits of carrot and celery mixed in.  Since the website is still under construction, I was told to check them out on Facebook for the current menu:  https://www.facebook.com/DesertRootsKitchen   Overall, a win for us vegetarians/vegans, with gluten and dairy free choices as well.  Thumbs up!"}
{"text":"My first time in and it was just what I was looking for. It's a rainy day, so I jumped at the black bean chili. Richly flavored and chock full of beans and veggies that still had a nice crunch. My fresh veggie wrap was absolutely delicious. The hummus melded with the dill marinade into a yummy sauce for the crisp vegetables wrapped in a hearty spinach wrap. My tummy is very happy. Friendly, cheerful staff as well. This will certainly be one of regular spots."}
{"text":"Wowzers! Friendliest service on the planet!! Amazing food. Such a lucky find. My husband and I were in Phoenix on spring break with our 2, 5 and 8 yr old children. Found this through yelp, but almost missed the place because it's tucked back in a courtyard off the street. So happy we persevered and found the restaurant! I can't even begin to describe our experience. We were warmly greeted by multiple members of the staff, then guided through our ordering process. We had a red beet and apple salad, bagel with cream cheese for the pickiest kid, parfait with dark granola and fresh fruit, smokey mac n cheese, a buffalo lentil wrap, citrus cilantro pilaf and hummus with sides of fresh veggies. Because we had children with us and ordered the mac n cheese, the guy behind the counter made sure we knew it was a bit spicy. He also let us customize the veggies to go with our hummus.  The food was ready almost as fast as I ordered it. The few things that were not immediately ready were delivered to our table within a few minutes by yet another very friendly employee and with edible flowers to boot! The kids enjoyed their food so much we got another bagel and parfait. The sides and half wrap were perfect portions for me and my husband.  We spent a little over a week eating our way through Phoenix and Sedona and this was a favorite with most of our party of five!"}
{"text":"I absolutely love this gem of a restaurant! The best feel GREAT vegan food around. Ever changing menu, but the quality is always there."}
{"text":"I loved the set up its so cute! Atmosphere is nice, food was good and I like that they have a ever changing menu which makes it exciting to see what they have each time. Friendly staff too."}
{"text":"Another amazing meal today! A great way to start my week happy food and happy people. A chill patio and great vibes!"}
{"text":"I like this place - fresh, convenient, gluten free options, and healthy.  There is a seating area outside, but beware in summer months.  There is a good amount of shade though.  I would definitely come back."}
{"text":"After riding my bike from Central Phoenix to Mill Ave and forgetting to eat breakfast I was ready to mow down.  Fate and Yelp were merciful; after entering  \"vegan\" into the search field Desert Roots Kitchen appeared on the map not 100 feet away.  I thoroughly enjoyed their wrap, omg! Their generous servings had me full and ready for another workout."}
{"text":"They have a fully vegan menu. The menu changes daily I'm told, so lots of variety. The food and tea were outstanding. The people working there were very friendly and helpful.  I'd rate it 5 stars if they had indoor seating or if their covered patio had fans or some sort of misting system to cool it. I'm not a fan of sitting in 100 degree temps and eating.  Having said that, yes I absolutely would go again! And sit in the heat. It's that good."}
{"text":"Healthiest lunch option on Mill! Great vegetarian and gluten-free selection. The staff is SO friendly. You can tell how much pride they take in their food, and they help you in making your selection. You can also taste everything before ordering it. Love this place!!"}
{"text":"So..the food was VERY good. I really needed to take two stars off for the service. Most of the people there were extremely nice and friendly, but there was one woman who was putting the food together that was so incredibly rude to me.   The couple before me sampled a couple of foods and the woman was very polite to them, even cracking jokes. She gave them a ton of food and sent them merrily on their way. When it got to my turn, she took her sweet time putting ~15 signs in front of the food and ignoring me, asking me to wait multiple times when I hadn't said anything and was just staring from her to the menu. Then, when she finally decided she was ready for my order, she was really rude and seemed like she was so much better than me. Honestly, all I wanted to do was eat brunch in between my classes and I got that with a side of rude service.  Anyways, on to the food. It is SO good and VERY filling. I got the burrito/wrap thing with cauliflower, quinoa and lettuce. It was delicious and I felt so healthy afterwards. I also got their iced green tea which was also really refreshing. I don't really like tortillas, so next time, I think I'm just going to get the plate where you can get a combination of different things.   Everything they make is really good and they seem to be passionate about the food and their restaurant. With the exception of this one woman, I really enjoyed Desert Roots Kitchen."}
{"text":"Let me start off with saying that this place is a gem of mill ave. This place feels mom's kitchen. Everything time I go in there everyone is happy to work there and seem like they have a chill time. The food they have is as natural as it gets. Food is prepared right there in front of you and I'm always asked if I want a sample, which I will not refuse. I always get way more than I should. Another bonus is the outside is beautiful it's a little oasis in Phoenix."}
{"text":"Good stuff. Had lots of food to choose from, and I like how the menu changes daily. I had a spinach wrap with curried rice and lentils with mixed greens and hummus. It was damn good. I will definitely be back here again, can't wait to try breakfast."}
{"text":"This counter-serve plant-based restaurant in downtown Tempe packs a lot of flavor in a small space. The menu changes every day (check Instagram), but is usually full of interesting options including wraps, pasta salads, rice dishes, hummus (usually multiple types), green salads and other vegan options. You order based on how many items you want. I normally get half a wrap and one or two sides, depending on what's available. Most recently, I got a half herb lentil wrap that included rice and lettuce, along with a side of peanut curry rigatoni. You can try items before deciding, which is good because some of the items are very spicy. Whatever you get will be healthy, tasty and vegan!  I love how fresh everything they serve is. I've never had a bad meal. However, they have limited hours (just breakfast and lunch), and typically they are only open during weekdays. It can be hard to get to if you don't work or live in Tempe. They are experimenting with being open on Saturdays now though! They also sell frozen pupusas from my favorite vegan pupusa vendor La PupuSarita. And, there's free one-hour parking at the Hayden Square parking garage just west of Mill (behind the restaurant).   The service is always friendly and helpful. The only downside is that there is no indoor seating. The dining patio is shaded and has misters on during the summer, but it's best to get the food to-go during the summer heat."}
{"text":"Delicious food! I loved everything I tried. The full hummus was really good and unexpected. I love that the menu changes and I can't wait to try something new next time. Everyone was very friendly and the patio area was cute!"}
{"text":"This is my favorite place to eat in Tempe!!!! I love the food!"}
{"text":"From the moment I decided to take a vacation day off from work today I have been planning my schedule around stopping in here for lunch. Since moving to Tempe a few months ago, I am constantly on the lookout for new vegan/vegetarian spots. However, due to their very limited hours, I have never had a chance to make a visit to Desert Roots Kitchen until today.  I didn't immediately notice the restaurant from Mill Avenue because it is tucked away in a little square right behind the big store-fronts on the main sidewalk. Phew! This quaint, quiet location is totally befitting of their style of restaurant. I was pleasantly surprised at how calm the environment was considering its proximity to Mill Avenue in the middle of a school day. The front of the store has some patio seating where customers were easily able to sit undisturbed and read or chat over their meals.   Upon entering, the staff was responsive and very positive. I told them it was my first visit and they explained the menu and encouraged me to sample the food before ordering anything. ...Don't mind if I do!!   Everything I tasted was delicious, fresh, and made from scratch that same day. I ended up getting the Fresh Veggie & Kale Wrap with Lentils and their Garden Herb Spread. It came with a side of fruit, and the size of the wrap was very generous... I'm saving half of it for lunch tomorrow.  It was delicious. The flavors came together very well, and just thinking about those ingredients gives me a nice healthy feeling... a feeling that you don't frequently have after dining on the normal ice cream/burger/pizza fare served up at almost every other one of the restaurants on Mill. I'm incredibly happy with this new health-conscious, vegetarian-friendly addition to a shopping district that was in such desperate need of it.  Now go check it out!!"}
{"text":"I have a lot of dietary restrictions right now and this place is pretty much the only restaurant in the valley that I can eat at. Their staff is friendly, their food is made fresh daily, and there is always something new to try. I wish there were more restaurants in Phoenix like this one. Good people making good, healthy food. Doesn't get much better than this."}
{"text":"Food was great! Love the changing daily menu. If all vegetarian food was this flavorful I'd never need to eat meat. The 1/2 wrap + one side filled me up. The cold pasta all a vodka was super spicy and delicious. The only problem is their method of serving which creates a bit of a wait and  crowded line. Everyone is super friendly. I'll be back."}
{"text":"Love this little spot. Great for a healthy drop in lunch. The energy and friendliness of the place can be felt and the food is delicious!"}
{"text":"I work in downtown Tempe, so among all the places to eat within walking distance, this is by far one of the best in the Mill Ave District. It's a comparable price point to the other healthier locations but I appreciate the creativity put into the daily rotating menu and the quaint courtyard to eat in, away from the street. If you need it to go, you've got it within 5 minutes. My kind of place!"}
{"text":"This place is a huge disappointment for me. Vegan options yes, but also your typical disorganized college cafe. When I walked in, I was directed to a cold case that had a bunch of side dishes. I guess you can shove these side dishes into wraps or bread if you like. Not many gluten-free options, so I was encouraged to try the potato salad. For $5, I got a small tub of the most average potato salad I've had all year. I really wish Mill Ave had a better vegan option, like a Green or Pomegranate."}
{"text":"This place is great. I've absolutely loved everything that I have tried here. The place is hidden so you really have to look for it. It's off Mill but you need to park around the Silvermine/Fuzzys/cafe Boa parking lot and then walk around to find it. I have lived here since 2006, been on Mill a million times, and still had never seen the courtyard this place is in until I went looking for it. Love the blueberry tea! And they let you try samples which is really cool, that way you can test out some of the inventive menu items before you order them. The staff is so nice and welcoming and the menu is super creative, fun, healthy, and delicious. I've recommended this place to so many people and will continue to do so. Well priced too !"}
{"text":"Awesome hummus and vegan breakfast burrito. We sampled 4 different side salads. Each was delectable. The smoothie was worth trip by itself :)"}
{"text":"Awesome spot for vegan food!  Really cool spot and the food was incredible.  Had the breakfast burrito and the cookie dough balls!  Will be back again!"}
{"text":"Great,  friendly place with some healthy choices.  Trying to get back to my normal diet after some GI issues (see previous review),  and didn't want a lot of food.   They were willing to split a \"single item\" and make it half salad and half rice noodles.   It was just perfect.   Tea refills free,  too.   What a great find!"}
{"text":"EAT HERE! The food is here is delicious, healthy, made with love, and locally grown! Plus, the staff is knowledgeable and friendly. They always take the time to cut up small treats for my 7 month old daughter. I always feel welcome and leave with a happy stomach and consciousness.  Their smoothies are AmAzing. Looking forward to my next visit!"}
{"text":"I had a wrap and it was the best thing I have every had. I have to admit that I was a little nervous to try this place because I'm not a vegan but it was so awesome. The owner are super friendly. I can't wait to go back :D"}
{"text":"Super Super Good. Great find. The only unfortunate thing is that we don't live in AZ and can only eat here where we are visiting. The good news is that we will be in town for a week and will for sure eat here a few more times."}
{"text":"Bland. Tiny portions especially the sides for $4.50. The guy couldn't remember our order for the life of him and made the smallest salad and gave me the smallest amount of kale salad. The prices for the smoothies aren't posted on the board either. One side, one salad, one iced tea and a smoothie came out to be $21 and we were both hungry afterwards. Eat elsewhere !"}
{"text":"I wanted to try out a vegan place and decided to give this restaurant a go. This place is unique as it doesn't have a menu. Everything is made the morning of, when chefs can decide what to cook. While the prices run a little high and I didn't quite enjoy what I selected, my healthy eating boyfriend liked the food."}
{"text":"LOVE this place & the extremely friendly staff. It's tiny inside & only has outdoor seating, so either plan for a nice day or take-away. The menu changes constantly which is nice to have new options, & everything is fresh & tasty. It's a great guilt-free, flavorful alternative to a lot of the fried/heavily processed food on Mill."}
{"text":"Breakfast burrito is super good. Service is quick but they were out of bagels two days in a row, even upon opening and they were out of most everything by 2pm on a few days."}
{"text":"I give this place 5 stars for supporting local business... Flavor, I give 3.5 stars... However, I am always on a mission to find the most flavorful food that is healthy and friendly to my body.  This is a must try if you want to step into the healthy, vegan, or vegetarian lifestyle for a day ;)"}
{"text":"Just swung in here mid road trip- well worth it! Stoked we found this hidden gem. Entrance is back in the alley to a quaint patio with greenery and the sound of a waterfall. Fresh local and amazing vegan food. Very accommodating for nut allergy I'll add. Had the breakfast burrito and smoothie, both solid. Will definitely come back if in the area again."}
{"text":"Absolutely amazing. The prices are high, but well worth it because you know this food is FRESH and healthy.  Peanut butter and pickle sandwich? Sounds weird, but was amazing! Thanks for the sample."}
{"text":"They don't have a huge selection, but what they have is delicious. Got a full wrap (hummus with a lot of veggies) and a side (kale salad) for $10. The staff was very friendly. A tasty, healthy meal that's easy on your wallet... Love it!"}
{"text":"Amazing! You come up to this place and you know it is special. Run by a very nice group of women and they make different items each day. I had the three item plate with Kale and Peanut salad, curry and coconut brown rice and pinto beans with squash, and then my friends and I split some oat and apple bars that were delicious.   You can try anything you want out of the cold deli counter and prices were reasonable for food that is not only good for you but made from scratch. I love this place, can't wait to go back!"}
{"text":"I recently stumbled upon this amazing little healthy spot. I ordered a custom wrap and added cilatro pablano humus, quinoa salad, corn salad, wild rice with squash and mixed greens. It was so good I ate the other half that I was gonna save for dinner. Menu changes daily with the veggies that are available and posted on fb. I would eat here every day if I were close enough."}
{"text":"I had a combo platter with stuffed grape leaves a lentil dish and a great salad, which was delicious. Freely made juices would make this place five star material, as the bottles juice was a little tired."}
{"text":"Today is the second time I've come to this place because I have been craving it ever since. I recently became vegetarian and this place has become my favorite restaurant. The food is delicious and beautiful and the ingredients are all local, which I love, and mostly organic I believe. Don't forget to also try the dessert!! I definitely recommend this place and will continue to support it. So good! :)"}
{"text":"This gem hidden in the depths of Mill is lovely. The place is homely feeling and you can see the staff hard at work in their little kitchen. Everyone was so kind. It was good.   Anyways, I got the half burrito with one side. I got some bean burrito thing and some macaroni salad. This was my first time eating a bean burrito that was not refried. I loved it so much. It was a great value all things considered. I will come back for lunch a lot. Trust me."}
{"text":"Really cute spot! 1st time being there. The 2 guys that work there were very friendly and helpful. I got to sample anything I wanted ! He also added a free side dish of chickpeas! The ambiance is retro and artsy which I admire! Will definitely tell my friends about this place and be back to try all the items on the menu!  Thanks guys keep up the good work!"}
{"text":"In gonna give this place as fair a review as I can cus its not somewhere I would normally choose to eat for my diet (lack there of) I'm a big meat eater and kinda picky when it comes to veggies. I came here with a vegetarian friend who loves the place. I tried a couple different things ive never had before. Some I liked and some I didn't but that's just taste preference I could tell that everything was fresh and was packed with flavor. The one thing I was was that it was more customisable. For someone like me trying something new , alot of it was stuff that was pre made or could not substitute out say onions or mushrooms. So I was more likely to not like something then if I could take it out. But for someone who is more onto veggies I'm sure that's not an issue"}
{"text":"Delicious fresh food. Normally not a fan of this kind of vegan blah blah stuff but this was excellent! Had a half wrap and two different salads. $10! The guy behind the counter gave me some samples of the different salads to try, they were all excellent and they change everyday! The guy serving was really friendly, laid back and polite and told me all about the ingredients and where they came from. Definitely a must try place if you are in Tempe for lunch during the week. Will definitely be back"}
{"text":"In town for work at the Tempe Mission and was looking for an alternative to the tons of American (think burgers, college bars, fast food joints) options in the walking vicinity of the hotel. I had no intentions of walking more than 5 minutes in 105 degrees and came across Desert Roots hidden in a small plaza about a 3 minute walk from the hotel.   A humble shopfront with some seating and was warmly greeted by a lady that informed me that the menu changes everyday. I'm not a vegetarian, but wanted a break from the crappy options nearby, so I decided to give it a shot.  I'm not very familiar with vegetarian dishes, so it took me a while to figure out what I wanted. She noticed that I was staring blindly at the menu and offered me samples of all 6 dishes she had prepared and made me try them.   I walked away with a platter of 3."}
{"text":"So delicious!  I work in the area and went there for lunch with my co-worker who has been there many times. I'm new-ish to vegan eating and almost done transitioning to eating that way all the time, so it was great to have interaction with people who are so passionate about great food. I had the wrap of the day, a lentil/rice/curry combo of yummy that we got to watch them mix up right in front of us in the open kitchen. What a cool experience!  The food was great and you can taste the freshness in every bite. When I'm not bringing my homemade vegan lunch to work, you'll find me here!"}
{"text":"Since it seems to be a vegan place I feel the need to clarify I am not vegan and only semi healthy. I like good tasty food but I also like to try fresh healthy options. I ordered the half wrap (split pea) and a side. (Lemon garlic brown rice. The wrap was enjoyable and fresh. The lemon garlic was not so much. I should have sampled it. They offer samples of the sides. My bad. I like the changing menu and the outside seating. No inside seating available. Friendly staff and clean. I can't say anything bad about food other than it just isn't as tasty as the unhealthy stuff. Glad to have this option and I hope they stick around. Now I just need to go find a cookie shop cause my taste buds are addicted to the yummy stuff."}
{"text":"Tucked away behind the busy front-facing shops of Mill Ave, you'll find this cute little covered patio with a delicious variety of vegan options--flavorful and the perfect portion sizes at the right price. They let you taste a couple things before committing and offer a lunch special that allows you to choose 3 different options. The wraps are always winners, and the setting is quiet and intimate- not good for large parties due to small space."}
{"text":"The food was fresh and delicious. They make something new everyday. Great for anyone who is health-conscious and looking for a good clean meal. I was so happy with my experience the first time I went that I went the next day too. Highly recommend this place. It's in a great location too."}
{"text":"Best kept secret on Mill Ave! I want all my vegan and non-vegan friends to check this place out. The Desert Roots Kitchen has a different menu every day. Open from 8:30a to 4p. Every meal made from scratch. Everything was delicious!!!"}
{"text":"This is such a wonderful place! The food is amazing. The people are kind and talented! Leslie is such a great energy person."}
{"text":"The place certainly lives up to its reviews. I am in town for a triathlon with my teammates and I am the only one that is vegetarian. My carnivorous teammates were raving about the food once we started eating! I would recommend this place to anyone and wish there was a vegan place like this on our college campus.  Unfortunately the website was very vague as far as what was on the daily menu, but I enjoyed the surprise and everything I had in my wrap was delicious."}
{"text":"Tough to find. It's off the street, down an alley/walkway. Can't comment on the food because they were closed for the week."}
{"text":"Finally tried this place yesterday for lunch and absolutely LOVED it!!  They are located off of Mill, in a little atrium/courtyard off of the sidewalk. A little inconspicuous but this place is a GEM! They have a different menu daily, but when I went I had the 1/2 wrap (pineapple chickpea) with two sides (dolmas & kale/arugula salad). I also mixed their lemonade and tea of the day!  I really enjoyed this food that was fresh, tasty & affordable! I can't wait to go here for lunch again. They have a nice outdoor seating area that's perfect this time of year!"}
{"text":"Great spot in Tempe for vegetarian/vegan lunch.  The food tastes amazing,  the staff are friendly, and the location is like a hidden little secret.  All around a good, fun place for lunch."}
{"text":"Delish...had the Lentil wrap, Mandarin Lentil salad & super yummy pumpkin cake! Everything was fresh & flavorful. The location is a little hard to find, but well worth it. Prices are reasonable...my hubby & I split a full wrap w/side & were full. The staff is friendly & helpful. I would gladly come here again!"}
{"text":"This place was good and healthy enough but a little expensive for how much food you get. Left kinda hungry still. Also pretty bland but it is expected to be extremely healthy so not too much of a surprise"}
{"text":"We wanted to love this place. The service was amazing. There were less options in the case than in other yelp photos. Some dishes were good (asparagus and brussel sprout salad and the dolmas), some ok (jalapeo spaghetti and BBQ lentils), but the wrap was really bland."}
{"text":"Hands down my favorite restaurant on Mill Ave. The food is fresh, local and made right in front of you. The ladies that work there have a friendly demeanor and are extremely helpful. The menu changes everyday which provides nice variety, although I have had favorites that I wish I could have on a regular basis. I've never had a wrap that I didn't enjoy. It's a hidden gem and is only open during typical business hours which is sad if I'm having a desert roots craving over the weekend or evening. There is hardly any seating area, and it's all outside so be prepared to eat standing up or at another location."}
{"text":"Great food! I'm not Vegan, but greatly enjoy the food here, as well as the people who help run it. Great atmosphere and tucked away so your not on a busy street eating. I try to make it here as much as I can. I especially like that they support local farming and business'!"}
{"text":"Very tasty rice, potato and spinach/ eggplant salad  Great peach herbal ice tea little hard to find. In the alley , a few doors down from Gordon Biersch. glutin free was the latch!"}
{"text":"This is definitely a healthy vegan place. They are serving good fresh vegetables and fruits along with a good selection of vegan proteins. It's not like some places where fake meat and a lot of sauces are used so I feel it should be healthier.  The tastes is very natural which I like but it might seem blend to some people.  The menu is ever changing so it's fun to just try it out every time you go and they actually allow you to try the samples!!!!  The price for the full plate/wrap+1item/half wrap +2items are $10 which is not cheap but it's not too bad. I was getting full even before I finished half of that wrap so it's worthy of the money. For me it wouldn't be my regular every day lunch option due to its price but if I want a good dinning out lunch this would be the place."}
{"text":"Magical! Great food and very yummy iced tea. Staff is always super friendly and helpful."}
{"text":"Total hidden gem.  The food is amazing and for someone who is not vegan or vegetarian, there are so many options!  Can't wait to go back and try more!"}
{"text":"Vegan or not, you'll love the feel of this hidden Tempe gem! Awesome customer service and a new menu daily!"}
{"text":"Really friendly staff and great quality food. Good value too as the portions are large"}
{"text":"First time eating here today. I really enjoyed it. I am not a vegan, but I do appreciate fresh and local food. All food was freshly prepared and delicious! In fact, while my friend and I were deciding what to order, the chef announced a new kale peach salad that he was just finishing up. Of course, I had to try it along with a half wrap and the roasted veggies. My meal was topped with locally grown sprouts.  The only down side to eating here today was the outside seating because it was hot outside. It will definitely be a place to come back when the weather cools down. The patio was cute, tucked in a little courtyard in a shopping center on Mill Avenue in downtown Tempe.  Be sure to check in on Yelp for a free iced tea, which was also very good."}
{"text":"If I lived near Mill Ave. - I would be eating here regularly!  Tasty tasty food.  Its vegan - and its wonderful - take this from a guy that often has meat/dairy on his plate.  Local in-season & healthy food.  The kitchen is open right there in front of you.  The owner/head chef is the cutest little happy woman ever!  The fellow that explains the sides/entree of the day - very gracious.  They have a constantly changing menu where you can do a half main dish (wrap is my experience) and 2 sides - it's been hard to finish my plate really - good portions in my opinion.  The sides are prepped on display - so your only wait is the main entree for lunch.  They let you sample the sides so you can pick the ones you want - I really appreciate that!  A very rare opportunity - the flowers used to decorate your meal - they are edible!  Yes they taste like flowers lol.    Only downside is seating is outdoors under a canopy (no misters) - if it's a hot day just prepare to order take out.    FYI it's off Mill Avenue in a courtyard - walk in and veer right - you just don't expect it to be there .  You clear your own plate when finished.  They have a key for the nearby bathroom inside.  They have books you can thumb through while you eat as well - nice touch.  I'm overall extremely pleased with the staff and the quality/flavor of the food!  If you're near mill - stop in!  Heck, just make the trip - lots to see/checkout afterwards too."}
{"text":"I am not even close to being vegan but I still enjoy their good food. Everything is fresh but portions are a little small."}
{"text":"Setting: day time, Mill Avenue. We're hungry. The situation is all too familiar. Where should we eat? I don't know, do we want sh*tty pizza or a sh*tty burger or some sh*tty Mexican food?  Enter: Desert Roots Kitchen, the tiny, unassuming kitchen of fresh awesome... now, I never have to have this conversation again.  With offerings like huge wraps, awesome dolmas, cous cous salads, noodle dishes, greens, fresh fruit, granola and yogurt parfaits, and baked goods like brownies, cookies and bars, it's reassuring to know that most everything is vegan (even the white chocolate chips in the cookies and the soy yogurt they have available for parfaits) but not particularly surprising. It's all very simple, natural food. No Tofurky isht. Not up in here.  The staff is friendly, helpful, enthusiastic, and most importantly, willing to let you sample things. I ended up with the vegan parfait for a anti-whopping fee of 3.50... the same price as Nami's! Except, Desert Roots uses fresh, seasonal fruit instead if a scoop of frozen berries, gives you about twice as much soy yogurt (but if only they had coconut milk yogurt...), and their lightly honey-sweetened homemade granola actually keeps breakfast nutritious, rather than turning it into a total sugar bomb. I'll definitely be ordering the parfait on da regular.  While we're on the subject of carbs, I'd love to see some additional grainless menu items, because as of now, it's entirely carb-based. I enjoy the idea of pasta and cous cous as much as the next person, but I'd rather not eat much of it, let alone make it my meal. Also, stuffing a flour-based wrap with grains is not on my bucket list. Plus, if I get dessert (and I am getting dessert, damn it), that's flour on rice on flour. Yikes. Hook me up with some vegetable/nut/legume-centric dishes and I'll be an ecstatic camper in the future. Keep the good stuff coming, y'all, keep it coming."}
{"text":"This place has some of the most fresh & flavorful options around. They have wraps, hummus, rice, and pasta dishes. They stick to fresh and local ingredients. Every time I eat here I feel ultra healthy, like I'm in that Seth Rogen meme. The prices are cheap and the portions are hearty.   The menu changes daily and they are pretty good with keeping their Facebook page updated with the menu, but sometimes they forget. I suggest calling ahead with any questions and/or to get the daily menu.  They do have desserts sometimes, but I have not yet had the pleasure of trying them.  The employees are friendly and helpful. It's a small cafe, but the patio seating is prime for warmer months. I suggest carry out during winter, unless cold is your thing. It's tucked in the plaza off Mill and 4th. If you've been to the Escape Room, it's right next door to that."}
{"text":"Being a Vegetarian for a long time, my husband and I are always looking for a great place to eat and were so lucky to find this jewell!   After walking mill avenue and not finding anything exciting, we came across Desert Roots Kitchen.  This is a top notch vegan restaurant.  I asked as I entered for a menu, which they said we don't have one our selection changes daily!.  The choices were fantastic and the owner wonderful!.  After we received our food, they came out to make sure that everything was going well.     Be aware that this restaurant is tucked away, so look closely for it...you will not be disappointed."}
{"text":"Seriously one of the best meals I've had in awhile, and I'm not a vegan, not even close, my favorite joint is Mastros City Hall.   I got a \"full plate\" which is three sides.  I can't even properly describe what I had but here it goes.  One was a wheat pasta with red onion and jalapeos I think maybe a little balsamic in it, a lentil dish, and a rice pilaf with coconut and little pineapple and again I think jalapeos.  I mostly just pointed and said \"I'll take that\".    I half expected to not like at least one of the dishes but they were all stellar!!  So much flavor and spiced perfectly.    This place is small like your closet small and seating is outside which could be a little rough in the summer but there is shade.    Best part, the people here smile and are so friendly and you can tell there is a lot of LOVE put into this food. Oh they give samples too.."}
{"text":"I'm from Prescott, and sadly we have no place this. I wish we did. 100% vegan. I would eat here everyday. I'm here on Saturday at noon, almost no one is here. I hope this place gets enough local support to stay open a long time.   Everything is fresh! I have lentils and carrots. My other half had spinach and pasta. Huge portions. Delicious."}
{"text":"The food is delicious, which is why it pains me to give them only two stars. I've been there 4 times, and found what seemed to be facial hair in my hummus two times! I tried to give them the benefit of the doubt because I know accidents happen, but 2/4 is half of the time that I've been there. It grosses me out so much, that I wasn't able to keep eating. I dig the hippy vibes, but it is a food place so having hygiene as a priority should be something to consider. All of the male servers I've seen have facial hair, and it's just disgusting that it ends up on people's food. Just an FYI. If you don't mind a couple of facial hairs on your food, then have at it. Such a shame because their food is delicious, but I won't be coming back."}
{"text":"Positive, relaxing environment.....staff that obviously cares about the customers, and delicious food!"}
{"text":"LOVE this place. LOVE it. The changing menu, the close proximity to work, the awesome staff - I love it! I'm not vegan or vegetarian... I'm more of a steak and baguette kind of kid, but this place makes me think that I could easily be vegan if I ate there everyday. It's always so delicious!"}
{"text":"This place is fantastic. Five stars for being the only hippy food in the college district. I had the tahini brown rice pilaf, red and green quinoa, and the peanut-date curry thing. It was all awesome,  I thought it was a little pricy for what it was-- other restaurants like this serve three salad plates for 6 or 7 dollars-- but no matter, I loved it and I'll definitely be back."}
{"text":"Hidden in the back of the plaza but once we found it we were amazed. All vegan. Lots of gluten free options. Awesome place with menu changing daily. Ask them for a custom wrap. Any wrap can be made on greens for a gluten-free option. I will definitely be back."}
{"text":"I hate to be the party pooper but as someone who is a healthy cooking fanatic and always on the search for a lighter choice when I'm on the go, this place doesn't put me off the charts on my wow-meter. The portions are plentiful which is very nice considering the price. The ingredients do seem fresh as well and I very much like seeing the open kitchen. The staff has always been friendly, but when it comes to taste, texture and \"health\" I think there is room for improvement.  Most of the salads I have tried, whether potato, pasta or legume based, have been grossly overdressed. The adjective that comes to mind is \"gloppy.\" The chana masala chickpeas had a pool of oil sitting in the middle and the batch was overly salted. The thai peanut vegetables were overly coated with a viscous dressing, though the flavor was decent. Each time I see a beautiful creation and order it, my lips feel coated chapstick after a few bites. The wraps have good flavor, but I don't see the point of stuffing them with rice. Carbs and carbs don't feel healthy to me when coated in a coconut sauce. To be fair, the chili I had last week was fantastic. Earlier this week however, when it was 60-some degrees outside, they had no soup. Seems like an odd special to be missing when the season finally turns.  I think there is terrific potential and I hope Desert Roots fares well. Local food that is fresh made, open and honest, is what I live to support. There is absolutely no doubt that this humble cafe provides better choices than most of the options on Mill. But I can't sing praises quite yet. A few tweaks to thin out the sauce, adjust the seasonings and maybe some better carb/protein combos and I'll be a regular."}
{"text":"Love this place get there early for the gold stuff. Everything is so fresh and amazing! Right off mill go to candy addict and there's a walkway it's back there by the gazebo. Defiantly recommend this place for everyone! Vegan and vegetarian!"}
{"text":"Coolest vegan place I've ever been too. Delicious food that changes daily with what's in season. Very friendly inviting people working there and that just make you feel great. I will definitely be coming back here when ever I visit."}
{"text":"I've been on a solid health kick lately and have plenty of options when i'm home, but traveling for business always puts a dent in my otherwise healthy lifestyle.  Such is the case this weekend, but Desert Roots Kitchen has entered the picture and saved me.  The food is exceptionally fresh, natural and simply feels good the instant it enters the body.  The women that run the place are WONDERFUL - so friendly and radiant.  I absolutely LOVE this place and will be back in A few months... on business, but now with a healthy ace up my sleeve...  NOTE - they are only open on weekdays and close at 4(ish)"}
{"text":"Awesome food and great service. Highly recommend the vegan breakfast burrito. Thank you!!"}
{"text":"They were super nice and accommodating. I had a chickpea wrap and it was very filling. My only issue is the parking - had to spend 1.50 to park."}
{"text":"This place is fantastic!  It is Vegan, so I don't have to worry about asking about anything on the menu.      I was lucky enough to catch them on a day they are not normally open.  Generally, they are only open M-F.  For special events, they occasionally open on a Saturday.  I am so glad they did!  I ordered a red lentil buffalo wrap, which is a full plate.  That comes with a side, so I chose the spicy hummus with pita.  http://www.yelp.com/biz_photos/desert-roots-kitchen-tempe?userid=_jjbwHWLFA5GjWFWGLj4ZQ#O5GJYyEs8eNvjlbChGQ1yQ  I never thought I would be gaga over red lentils, but this dish was delicious!  The hummus was also fabulous.  The dish is so large, I was able to share it (and not even finish the wrap).  That saved us a bit of cash.  Their menu varies daily, so I will be sure to pop in here again during the week.  It is a shame they aren't open regularly on Saturdays, as it would certainly be in my rotation."}
{"text":"This place is a breath of fresh air in Tempe, litterally! Their food is not only all vegan, but it's fresh and amazing.... Everything is made  from scratch and with love. They allow the ingredients to shine, not covering up the beautiful grains and veggies with \"chi'kn\" replacements....believe me, vegan food does not have to mimic carnivore food in order to be delicious.  Everyday the menu is slightly different (actually, a good indication that their ingredients are indeed fresh and real) so, it's always a surprise to see what you are going to get. I have to say though, pesto day (whateverdays they decide to make it) is my absolute favorite...(maybe they can give me the recipe?? :D  ) Each day there is a different wrap made that you can combine with the wonderful variety of side dishes they make. Or, you can just make a full plate out of the side dishes. The people there are also wonderful, you can tell they put a lot of love in their food! Always smiling and happy to serve you, I never get tired of going here!"}
