{"text":"I took a friend of mine to paint tonight for her first time. We had an awesome time!! The staff is super friendly and attentive. I brought my friend for her birthday. She had an amazing time! Everyone sang Happy Birthday and she even got a dessert to enjoy. We loved the instructor and our paintings look great!! We'd love to bring along more friends next time."}
{"text":"This was my first time attending a private event here but I had been to their Henderson location once before using a coupon.  Loved the atmosphere and the vegan food!  We painted a silhouette of the statue of liberty (the group is one made up of immigration attorneys in town) and it was great.  They served salsa with chips, puff pastries, panini sandwiches (using Daiya cheese, a tapioca based soy and nut free vegan cheese), and included in the $30 fee was the food, one drink, and the painting of course.  Can't wait to take my kids to one of their youth classes, I like that there's instruction bit no pressure to be just like the example painting."}
{"text":"Great way to spend one-on-one time with my son & excited to bring home his first of many paintings with Design & Dine classes. Woot!"}
{"text":"TRUST ME YOU DON'T HAVE TO BE AN ARTIST TO ENJOY THIS EXPERIENCE. ...2nd time going (1st was henderson location) and had a blast both times!  Definitely suggest this to the ladies for a \"Girls Night Out\"   Lots of fun and laughter to get your creative juices flowing!  Food was amazing (had the jalapeño poppers and the Caprese Panini with Moscato of course)  Service is great!  Had the same instructor both times (Jenny) she ROCKS and is very good in explaining, encouraging,  assisting and breaking each step down. Brandon (Henderson location) is FUN!   Already planned my 3rd class in 1 month."}
{"text":"Went Saturday night for a ladies night party. First time doing anything like it but it was great! There were quite a few first timers in our party and it would have been nice if things were explained right away such as how food and drinks worked (no bar, guy took orders, no menus when we got there had to ask). The teacher (can't remember her name, the wine got me!) was fantastic at explaining things. Think she mentioned she teaches art and it shows! She was fun and went at a great pace for everyone to follow. She answered all our questions and gave great feedback throughout the class. The drinks weren't a great value but the same as they would be in a restaurant. The food was surprisingly delicious! Most of us ordered paninis and I didn't hear anything but good comments on them. Only problem..most of us didn't know who or what to tip. The guy who brought our food, the teacher, separately or together. Hope we did it right. Well def be back. Great place for a fun ladies night! Bottle and paint combos like someone suggested on here would be an awesome idea!"}
{"text":"Had so much fun here!  Music, fun, yummy food, and step by step painting!  Made a perfect night out with my mom!!"}
{"text":"Jen was a great instructor and the class was fun!! We all had a great time and came it with great looking painting!! Food and drinks were well priced too!!"}
{"text":"I found this place on Groupon. I am no artist but my painting turned out really nice. I like how the instructor broke up the art piece, but sometimes when she was showing a step her body covered the painting and no one could see what she was actually doing. There was a birthday party in the class so best seats were reserved; I ended up sitting In the back. The food was tasty. Although you have to be careful not to put the brushes in your soda or take a drink from the brush cup. The seats are very uncomfortable especially when you need to sit for 3 hours and concentrate. I don't know if I would go back. It's definitely a must try for locals in Vegas; something different."}
{"text":"I've been here about 10 times and enjoy myself every time.  For me, the painting takes so much concentration that, for three hours, no other stresses in my life even cross my mind. Add some wine and yummy food and all the cares in the world are temporarily gone!  It's true that some instructors are better than others but, out of all my paintings, there's really only a couple that I don't totally love. You really do have to just be patient and go with the flow. It's amazing how your painting takes shape during the class, even when you aren't sure that it will. I also enjoy the personal attention. The staff remembers me and they make me feel welcome. I highly recommend a class here for a girls' night out. Also the kid classes are fun, too!"}
{"text":"Great place to have girls Nite out. We hv a great time. The only thing is wish have nicer/ better brushes to paint."}
{"text":"Cool concept, but there are areas that you are lacking that your competition is WAY in front of you in.  1. CLEAN THE GUM FROM OUT UNDER YOUR STOOLS AND TABLES!  2. Make sure when you serve your Spring Rolls that they aren't frozen and cold in the middle.  3. When are you going to have some paintings of better quality?  I have been there 2 times and both times the Artist seemed to struggle with explaining the painting which confused half of the class even more than they already were. I have experienced and painted at a lot these types of companies through out the west coast, and yours is nothing special. I have used both of my Groupons and will NOT return. I would rather pay full price for better quality paintings and gum free stools at your local competitor."}
{"text":"This place is fabulous! The staff is friendly. The service is amazing & all the painters are well educated and you can tell they have a passion for teaching others. I cannot paint at all and they make you feel good about your painting and encourage you. Also the food here is great. The strawberry salad is yummy & any of the stuffed pastry puffs are great!"}
{"text":"This was a lot of fun!  The instructor was great.  I'm not very artistic but she gave very clear instructions, and we had a lot of fun!"}
{"text":"I've been to this location a few times and they are fabulous! The staff always takes great care of us and the instructors give explicit directions and make sure the whole class knows what's going on. They walk around and are very friendly with everyone in the room. The food and drinks are delicious and they bring everything at intervals throughout the class to allow for breaks and socialization with whoever you are there with."}
{"text":"AVOID!!!! I wanted to do this as last minute activity for a girls night out we had planned... I made the reservation at noon on a Wednesday, and the lady on the phone needed my credit card info to \"hold the reservation\".  Within an hour of making it, one of my friends found out she had to work that night, so I called back to cancel.  Her response was, \"Oh, I'm sorry, we don't allow cancellations within 48hrs.\" A.) IF that's the case, that should be explained when making the reservation B.) They told me they needed my card info to hold the reservation, but they charged me right then and later emailed me a receipt. C.) She even told me that switching to another night wasn't an option!!  What?????  I work in the hospitality industry, so this poor excuse for \"customer service\" is truly mind blowing to me.  I've since called back twice to speak to a manager and was told by the girl on the phone (Connie) that the manager wasn't available and wouldn't be back in the office, but \"she's going to tell you the same thing I am\".  So they charged me the cost of 3 people attending a class that we weren't able to go to.  Apparently this is their way of making money.  Which is unfortunate, because instead of gaining a repeat customer, you've lost future business from anyone I can tell this story to.     How they have this good of a rating on yelp is beyond me.  There are plenty of places to do a wine & paint night in town, and they don't have ridiculously rigid policies like Design & Dine does.    For those of you looking for the right one, we finally had our wine & paint night at **Wine & Canvas Las Vegas**.  We had a blast doing it, and somehow ended up with 3 cute snowman paintings despite being artistically challenged.    This is my first ever yelp review, which goes to show that I felt it was important to warn people of their tactics here."}
{"text":"It's amazing to me how good the customer service is here! When I call with a question Christina is very friendly and able help. Then when you get to either studio the staff is there to do whatever they can to ensure you have what you need and you have a good time. Thanks for always making this a great experience!"}
{"text":"My friend and I went here for our second attempt at painting, and we did sugar skulls. After having such a great time at the Durango location attempting Starry Night, we figured a sugar skull would be much easier and more fun, and we were right. Jenny (Jennifer?) was our instructor again, which made us happy as we had already had her as an instructor and knew her sense of humor.   The painting was much easier than Starry Night (protip: try not to make your first painting one of the great masters. I know I had major confidence issues for a while afterward). Once again,  Jenny walked us through step by step, and encouraged us to do our own thing. I saw someone else mention that they frowned on doing your own thing, but I didn't have that issue. Maybe she just had a bad class? idk. The original painting was adorable, but I wanted to do something a little different, and Jenny encouraged it.   We had so much fun the second time around that we got a group of folks together to go to the next class with us. Apparently if you have 5 or more in a group, you can have them reserve spaces for you! And they give you a tiara if it's your birthday, so my little brother and I will be celebrating ours this time around.   Again, I cannot express how much fun this idea is. Design and Dine is brilliant, and if you don't drink, that's okay. They have soda, as well as beer & wine & other choices, and the food is amazing.   Seriously, if you're looking for something to do? Give this a try. It's a great date idea, good way to hang out with the girls without going to a lame bar & having to shout over the music, and you have something to show when you come home. :)"}
{"text":"So far I've been to one class at this location with a friend, and we loved it. Oddly enough, we chose Starry Night as our first attempt at painting, which turned out rather hilariously on my side, but overall it was an excellent experience. The staff is great, and our instructor was Jenny (or Jennifer, whichever she prefers), and we immediately got on board with her sense of humor.   My friend and I had never painted something like Starry Night before, so we had no idea what to expect. Jenny walked the entire class through the painting step by step, and it was SO EASY.   They have a great food & drink selection to go along with your artistic attempts, and my only suggestion would to be to GET THERE EARLY. We showed up *right* at 6:30, and were lucky to get seats together in the back of the room. It wasn't a big deal though, they let you get up and take pictures of the example painting, and do have monitors for those sitting in the back of the room.   It's perfect for date night, a night out with the girls, or just getting out on your own. Keep an eye out for sales on their website & Facebook page, as well as Groupon. I'd rather spend the time and money doing this than wasting my time & money at a bar being bored. Seriously, go try it. I promise you'll love it."}
{"text":"I absolutely love design & dine!  My last two instructors were Veronica and then Sara.  They both were so amazing and so helpful.  Tonight I painted with Sara and she was so sweet and so patient with all of her students.  I came by myself and she made sure to always walk around the room and make sure if anyone needed help or had any questions.  I asked her for her help several times and she was more than willing to help me with a smile on her face each time.  She was so funny and keep the whole class laughing and focused the whole time.  She always taught us to have fun and to not stress.  It was so much fun to paint there.  So I have signed up for multiple classes.  The atmosphere is so fun and upbeat.  They have fun music going, the food is always coming, and so are the drinks... If you wish to eat or drink there.  It is your choice.  I highly recommend their food!  The staff are always asking if you need anything and are always so nice and funny as well.  You never feel like you have to act a certain way in there, come as you are and you will truly have fun.  You don't have to know anything about painting and I promise you, you will walk out feeling like you know how to paint while having a great time.  And the instructors I have had have been more than amazing.  They make it so easy and fun to paint beautiful pictures and they encourage different styles and anything different you would like to try.  \"You are never wrong\", is a good quote they say, which I appreciate!  They encourage individuality and creativity!  They food is amazing.  I love the caprese panini, it is my favorite and also their chocolate croissants are oh my goodness, so yummy.  They have a great choice of wine and drinks.  It is overall a great way to spend you evening whether it be by yourself or with a party."}
{"text":"They just changed the menus in the last couple months and added more yummy stuff! And now you can build your own pannini or pizza...awesome!  As always, the classes are fun and relaxing. It's always enjoyable to see everyone creating their own point of view, even when inspired by one painting.   Join the text club and watch for coupons! It's totally worth it."}
{"text":"Design and Dine...I'd say it is good, clean fun...but you'll probably get pretty messy while you're here!  These classes make finding your artistic side a real treat. Elsa is a great instructor, filled with energy and optimism. She sees beauty in everything and then opens your eyes to the same miracle.  The food is pretty tasty and reasonably priced. I don't drink alcohol I can't speak for the wine, but my classmates all seem to like it. If you are looking for a unique and thoroughly enjoyable experience, I highly recommend it!"}
{"text":"My duaghter and I had so much fun!!  Aubrey was a great instructor! She was nice, funny and helpful. Though I thought the painting was beyond my capabilities it still turned out so cute. Aubrey told us to relax, have fun and just enjoy creating our personal piece. Guillermo provided great food and service and we loved the experience. Going back Friday and sure to many more classes with Aubrey!!"}
{"text":"Last week was so much fun we came back last night! I Brought my mom and sister for an artful evening of food and fun. We were greeted by our instructor Aubrey. Aubrey was so nice & accommodating. Aubrey is such a great instructor who was easy to follow and understand. Aubrey was encouraging and let us know all of our pieces were not going to look the same, that they would be individual pieces of art and they were. All so different, unique and amazing. Guillermo prepaired us delicious menu items. Gina the server was nice enough however she lacked in a couple areas. Gina sat with her butt on the counter, legs crossed and shoes on the counter as well then just stared at us instead of serving us. A bit off putting. Two young girls were in the class and a very inappropriate song came on. Aubrey asked Gina to change it but Gina remained seated on the counter, feet up and disregarded Aubrey as Gina was enjoying the foul music. It was an awesome group and so much  fun was had. However the experience with Ginas counter sitting was a bit off putting and unprofessional. Thanks to the great tasting food by Guillermo and awesome instructor, Aubrey I will continue to paint with Aubrey at Design & Dine with many of my family and friends. Thanks"}
{"text":"Wow i thought i had reviewed this forever ago on here but i guess that was on yp.com  haha.   THIS PLACE IS MY VERSION OF HEAVEN ok thats an exaggeration but if you are anything like me (meaning a single mom who rarely gets to go out for a fun night) this is my go to. I get out once a month and dont even consider going elsewhere after my first experience. This place will make you feel like you are this AMAZING artist and at the end just about everyone (with the exception of the super drunk) come out with something similar to the original even with no skills at all! The food is decent and the staff is amazing.   I want to give a shout out to Christina their administrator as well. That poor girl has been slammed with over 2000 groupons bought that all have to be called in and booked that way. I recommend if you are coming with a group of people with groupons to get all the voucher codes together and email them all in one email to mydesignandwine@gmail.com with the class info. She has been super helpful even with as busy as shes been but that sure could save her and the phone lines and everyone else a lot of time and hassle :)"}
{"text":"I loved this place! It was a very fun environment, funny and interactive staff, great instruction without the pressures of 'performance', and very innovative.   First, I'll begin with the concept. Great place for an amateur artist to play around and create something, but also open for a more skilled artist to explore. The instructor was very concise, step by step breakdown and entertaining as well. The reins are free though!! I took my boyfriend and he ended up deferring from the instruction and painting a dinosaur destroying a city instead of a peacock (since we both agreed halfway through class that his 'peacock' looked more like a dinosaur) haha. Everyone loved it! It is more of a 'ladies spot' having as he was the only man in that particular class, but he actually enjoyed it as well.   The wine/beer and food is not overpriced compared to the overall coast of the experience as a whole. We could have easily spent the equivalent at a decent restaurant without the canvas' and fun experience to take away.   I will definitely be returning at some point to do it again, maybe a ladies night out instead this time. (I won't subject my boyfriend to it in repetition, although it is something fun to try as a date night experience I think, if your significant other isn't intimidated or emasculated by it)   Overall, we had a blast. Definitely spreading the word!"}
{"text":"This place is pretty cool. Drinking and painting is a good mix. Don't wear \"good clothes,\" as my shirt and jeans are now both spotted with paint. I was skeptical about coming here, but we actually had a really good time."}
{"text":"I arrived early as I do every time I have recently. However, tonight was weird. Started off by getting carded which was the first in my many visits. I sat down at 6:15pm, wrote down what I wanted and no one would even walked by me. I was making eye contacted but nothing. I finally reverted to sticking my arm straight out. After a few minutes that got someone's attention and they took my order at 6:35pm. A drink and chips. I asked for my drink at 6:42pm and was told it was coming. Then she proceeded to tell the other server to get it. Now sitting here 30 mins from my arrival time and I can not get a soda. Asked for the managers email address at 6:50pm. My drink arrived at 6:51pm. Right as the people next to me got their second round and we sat down at the same time. I get they are a big group, but I paid to be here too. Food arrived at 7pm. 7:05pm got a refill, yeah, I was that thirsty. Glad I didn't start with a alcoholic drink. I wouldn't have ordered another.  Person who was instructing us decided to do more talking first then showing and talking. Talked and walked around too much then showing the walking around. Unfortunately I let my lack of getting served effect me and it showed in my painting. I did not have a good time. I wasn't able to turn it around and not once did anyone say hey sorry it took so long. I wasn't the only one. They have a dinner break halfway through and some people hadn't even gotten dinner as the break ended. Highly disappointed tonight. I never got the managers email.... Either."}
{"text":"This is a great place to get your creative side on! Amazing instructors and awesome service  I celebrated my mom's birthday here and they made it very special.  I strongly recommend this place!!"}
{"text":"We were slightly intimidated by the detail in our painting. Once we got going and following along we had SO much fun. Robert and the entire team were fabulous. We highly recommend Design and Wine."}
{"text":"I love this concept and am so glad you guys opened this in Vegas. I have not checked out your competition and there is no need. The entire staff is super nice and fun. They create a fun atmosphere and everyone is interacting. I love that you guys have discount deals all the time and a big variety of paintings. I cant wait to do a private party with you all."}
{"text":"An Update:  I think that calling my character and ethics into question and insinuating that I am a liar is a terrible way to provide recompense to a dissatisfied customer.  I was originally disappointed with my experience and now after reading the comment on my review which was provided by by the company I am furious.  I am an actual consumer who went to an actual class. I attended the Wine Love painting class on 06/12/15. I sat at the table closest to the entry way door with my four other friends at the end of the aisle that was closest to the door and I even think I wore a green shirt. I would be happy to dig up the pictures from that night for the company should they deem it necessary to believe that I had a bad experience. I waited until now to write this review and speak my mind because I didn't want to write a review when I was angry, humiliated and frustrated. 6 months later I am still disappointed and so I wrote this review.  It is also infuriating to see other people on yelp have had the same difficulties with the coupons as I have and the business owner was apologetic to those consumers. However, with me she accuses me of being a competitor and just trying to make her company look bad. Of course on the off chance that I am a real human being who was an actual consumer I should do the work to call them and offer them the opportunity to make it right.  As for the coupon, I am aware that many businesses require a coupon to be presented at the time of purchase.  However, I made my purchase transaction online and an innumerable amount of companies offer coupon codes specifically to be used online at the time of purchase without the need to present a physical coupon.  I have often made purchases online for products that needed to be physically picked up from the store and not once have I had to show a physical coupon to pick up my product. It is not unreasonable for me to think your company might offer the same type of discounts in this digital age. Suggesting in a \"rude\" (this was your word) manner that I don't know how coupons work when I have been a consumer for more that 25 years is unreasonable.  For that matter, I have actually forgotten my coupons in the car at two physical stores and the manager of the store actually honored the discount though their policy generally requires the physical coupon to be turned in. That happened at Lowes and Kmart, in case you are curious.  There are lots of companies that value customer satisfaction and understand that a happy customer will return and spend more of their hard earned money. Spending any more of my hard earned money is not something that I will do with this company again.  I hope the $10 and your stick to your rules attitude with no regard to a consumers experience was worth losing my business and that of everyone I know."}
{"text":"Had fun.  Knew going in I was not there to learn to be an artist.  This is a place to go and relax, and let your inner creativity work for you.  Wine is available along with food.  Will go again.  The pictures view the interior appropriately.  Read some of the other reviews, if you're going to humor and laughs, find a comedy club, this was fun and was exactly as stated.  By all means, everyone should go to enjoy and relax.  Great job Design and Dine, thank you."}
{"text":"I love coming here!  Our first class was at the Hendersen office and the second was at Durango last July 22, 2017. Clean facility.  Instructor was friendly and knowledgeable.  Food is great too.  I'm already planning  for our next class!"}
{"text":"We celebrated my girlfriends birthday here with a group and it was an awful experience. I was waiting at Design and Dine for my girlfriend and her friends to arrive and the instructor asked me where my girlfriend was 2 times and it was 25 min before the reservation , which they told my girlfriend to be there 10 min before, so she had plenty of time. The instructor seemed annoyed and unfriendly. She seemed like she wanted us to leave before any of the party members had even arrived. The entire time the instructor told the group to be quiet. We barely talked throughout painting because  she treated us like we were elementary school children. We were trying to have a good time for my girlfriends 31st birthday. Don't waste your money or time!"}
{"text":"They don't have their liquor license...YET, so our group was kind of disappointed when we showed up for Design AND Wine and found it would be minus the wine. Some people were going to leave but were convinced to stay. Overall it was a great experience and the owner was very apologetic that they weren't in full swing yet. They should be getting their liquor license by the end of the month. Will definitely be going back another time."}
{"text":"Three of us gals celebrated our birthdays here, what a great decision.  None of us had ever painted anything other than walls or stick people.  We worried for nothing, the instructor gave such clear step by step directions.  We were assured that there almost nothing we could do that would ruin our painting, and she was right!    We were all treated to a wonderful little birthday dessert that tasted like a little piece of heaven.  We didn't know they served food and had eaten prior.  Next time we'll try something from the menu.  A good time was had by all, we will be back."}
{"text":"Great place.! The instructor was fun. The servers were attentive and offered great advice on your painting . I've been to this location twice and I haven't been disappointed. I will definitely come to this location again.!!!"}
{"text":"Fun and relaxing! Would definitely recommend! It's a great way to spend a few hours, especially when they offer the $20 classes."}
{"text":"Loved it! Had a wonderful time, and will be back again. The food was wonderful, and the instructor is great on teaching the step-by-step process to all levels of students."}
{"text":"Love this place!! You don't even have to know how to paint =D The staff is amazing,especially Rachel! She always accommodates my request. Love their cocoanut balls Mmm yum yum. With all that said if you need to relieve some stress,have some fun or both...try Design & Wine!!"}
{"text":"Jessica was awesome!!! She made it a fun experience and it was easy to follow her directions. The food and beverages were excellent! The entire staff was professional and very attentive! Overall the entire experience was very enjoyable and I can't wait to go again!"}
{"text":"Interesting experience.  Surprisingly (with my lack of painting/drawing talent) my pic came out very close to the original, as did most in the class.   When i went it was very crowded and I realized a big problem is the lack of space as people place their food on the same area as their painting supplies.   The workers there (who often did double duty as paint assistants and servers) were very polite and helpful. Instructor was good. The food options were all yummy but if you're watching your waistline you probably want to eat first. Almost everything was made with butter smeared throughout (paninis, etc.) Also, beware large parties of loud women.  My friend and I were annoyed at how the women near us wouldn't shut up about non-related BS.  And how they were louder than the instructor so we couldn't always hear what she had to say. Also, I felt the class was a bit long.  Maybe 2.5 hours and more concise directions - and a shorter dinner break would work better.  I was getting bored by the dinner break which I think was WAY too long btw.  And lastly, it would be nice to have a late night option since so many of us here in Vegas work graveyard hours and are used to eating dinner around 9 pm or later.  Otherwise, totally worth trying if you've never done it."}
{"text":"Second time for my husband and third time for me on April 9, 2015.  We went to the Summerlin store again and enjoyed the evening.  We had a lot of fun and we came home with some nice \"art\" work to hang on our walls at home.  We will be back in the future."}
{"text":"My first time & was nervous that my painting would look like a hot mess. But it is very easy to follow, and truly anyone can do it. The food the service and the instructor is very good. It's a fun time. Everything on the menu ranges  around $7. Would recommend any day."}
{"text":"We had a great time! Suzanne, our instructor, was awesome. Her dry sense of humor was really fun and she was helpful as we had questions. She was patient with us while still making sure we would end on time. The drinks and food were also great! (We just had dessert items.)  The server was super nice and friendly and we had a blast. We will DEFinitely be back! It was a great mother-daughter date."}
{"text":"My daughter and our friends decided to do a paint class for mothers day. We had so much fun! And they have a yummy little menu.  We tried the baked brie appetizer & flat bread pizzas. And the desserts looked amazing! (we didn't indulge) Our instructor was so funny and made it even more fun with her great humor.  We will definitely be back!  Sign up for their emails, they have some great deals!"}
{"text":"Fun place for a different date night or girls night out. Instructor was great-very helpful and friendly. Everyone who was there seemed to have a really nice time. Food was so-so but it's not like you're going for the food. I'd go back. It was a fun time."}
{"text":"Oh my goodness where to begin? Atmosphere was so fun! Food was great! Drinks where on point! Went for a girls night out will definately be doing it again as we discovered our inner Monets our first time! :)  Amazing the variety of people there were couples, families, mom and daughter! So many different ideas for people to go with that may enjoy this event! Can't wait to go again!"}
{"text":"I went here for my friends birthday with a group of people and the instructor was rude! The instructor constantly told us to be quiet, I felt like we were being scolded. She didn't want us to say a word the entire time. She was rushing us throughout the entire night. The server even noticed how the instructor was being  rude and seemed embarrassed . This was my first time doing anything like this and it should have been fun and the group made the best of it, but I will never go there again."}
{"text":"Awesome experience! So good I am going back this next week :) Instructor was great. I do not consider myself an artistic person, but i DID IT! Anyone can do it. I recommend it. One small disappointment was the fact that wine was not included. The name kind of leads you to think that it is. But, wine and appetizers were an option  and the salsa was so delish."}
{"text":"Terrible instructor , I came here on my birthday and rented out the place for 17 of us. The instructor made us feel rushed since we entered the door. She continuously spoke about being home in her \"fuzzy wuzzies\" referring to her pajamas , she obviously didn't want to be there. She was extremely rude the entire time told us to be quiet and pay attention because she didn't like to repeat herself. She made us feel very unwelcomed  and spoke to us like we were children . My father wears a hearing aid because he is deaf in his left ear and he asked the instructor to repeat her self because she was speaking so quiet and she rolled her eyes and said if he was listening the first time he would have heard, then my aunt told her that he can't hear that well and the instructor got even more frustrated. This place is a joke , I've been spreading the word since and so have all of my friends and family. Don't waste your money! Since going here I've been to Pinots palette and they give you complementary cheese and crackers with your wine as well as excellent service!"}
{"text":"It's a great place with fun and friends.  I have been to several of the other painting places and this one is by far the best and most fun.  The instructors are hilarious and they give you actual tips to make the painting work.  I also like that's it's very clean and well organized!!  Great idea for a girls night out!!!!"}
{"text":"This was our second visit and sadly the staff was a hot mess this time.  My girlfriend and I arrived 20 mins early to grab good seats & put in our food/drink orders and the paint hostess forgot to give us a menu until the last minute, we like literally had to ask for one just as she was starting...so goes getting there early.  The painting was done at a good pace, the hostess tried her best to keep it fun but she was no comedian, just asked a sh*t ton of questions which was getting a little annoying.  So my girlfriend's beer came out pretty quickly but my moscato didn't come out until much much later, I had to remind the server about it & it still took awhile.  Our sliders came out at a decent time, tasted pretty good but our flatbread pizza never came out.  The server brought out my cheesecake & I had to let him know the pizza never came out & since it was nearing the end of the painting I had to cancel it.  To top it off they forgot to bring out my friend's dessert.  She was determined to try it so she had to remind the server about it and we waited until the painting was over before they brought out the damn brownie.  Perhaps they need to devise a better system or staff appropriately for a Friday night event, this was supposed to be a fun & relaxing night out not a frustrating one."}
{"text":"Had a great time at Design and Dine on N Rainbow. The staff was great! Definitely going back!!"}
{"text":"I would definitely do this again in the future, I enjoyed myself and the 3 hours flew past. The instructor was helpful and patient, things moved pretty smoothly. The class was packed I believe every seat was taken and I didn't have a over crowded feeling. Wine/ drink prices were reasonable but I was under the impression that with these paint and sip class that at least one glass of wine was included, however that was not the case.  They also served appetizers and finger food type entrees, which also were fairly priced, All in all my fiancee enjoyed herself and that was all its about LOL. I did notice that they have a couples night and on the website they have a kids painting party which i think would be a great idea for kids so 4 out of 5 stars because I like wine and wanted a free glass LOL but 5 out 5 on service and experience."}
{"text":"This experience is fun! It brings out your creativity and artistic side.  If the session starts at 6:30, I suggest getting there around 5:30 in order to get a good seat in order to get closest to the artist to see the painting and get your drink order in.  The staff was very friendly and on top of everything."}
{"text":"Was a little irked that I bought the yelp special for $30, thinking I could save $5, towards the normal $35 per person fee. But I could NOT figure out how to use the Yelp coupon, So I just bought two from their site normal for $70 then to find out they had $19 specials!!!!!! I could of spent only $38 on the two of us!!!!???? Very frustrating as I still have my unused $30 Yelp special I have not figured out how to use! Grrrrrr! Other than that confusing mess....class was fun, I painted a Picasso and all while drinking a couple glasses of wine. Come early so u can pick your seats. You do not want to be sitting with your back toward the instructor. Pain in the neck to be turning around to see what she's doing. I will go again but will look for their $19 specials which seems to be on all the time !"}
{"text":"Attended the class on 2/28 lead by Elsa. We attended for a friends birthday and it was great, they sang happy birthday, they even had a small menu to choose from for apps and drinks. The environment is great, very calming. Elsa is a great teacher, she walks around gives feedback on how to make the painting better and keeps every one engaged. Definitely would recommend!!! They even have classes for kids and couples which I loved!"}
{"text":"This was my 2nd class at this Design and Wine location.   This is a good night out for a group of friends or a good date night, but be prepared. The classes vary greatly depending on who is teaching and who is attending. My first class was quiet, slow, and we finished early. My second class was incredibly loud and much longer. However, I did like the painting better.  The staff is incredibly kind. Each painting can look complex, but they make it doable. Perfectionists tend to get frustrated here, though.  Personally, I would not order any food here, but they do tend to encourage you to do so. There is always a break in the middle of the class for dinner. I would actually prefer if they offered an afternoon class instead.  If you're looking for something different to do, check it out. Look for a Groupon or special, though. I don't think I would pay full price for a class."}
{"text":"Second time doing this with the ladies, first time at this location. Super fun, love how they give step by step instructions and the servers are always fantastic! We are going to try to make this a monthly thing."}
{"text":"This was a fun spot for a little wine and paint birthday party. The staff was great, very accommodating and entertaining. It was new for me to have a real meal in addition to painting, but they made it work. I had one of their paninis and it was delicious!   The only star I knocked off was because the set up has it so that there are two long painting tables. It makes the space a little tight but intimate. Sometimes I had to move or stand up to see what our artist had just painted. However, they do have a camera on the artist's canvas and a TV closer to the back of the room for those sitting back there. It wasn't anything that hindered my experience, though. They had a handful of different designs and my friend felt special on her birthday. I think 90% of the groups that were there, were there for a birthday. The staff gave all the birthday people crowns, even the men - it was hilarious!  Great spot for friends, and a huge plus that differentiates them from other \"wine and paints\" is that they serve meals."}
{"text":"Had a blast with a couple of friends when we did our paint night a few weeks back!  My food was great, nice Italian panini sandwich.  The menu was basic panini sandwiches and some appetizers, which was great because they weren't huge and didn't take a ton of time to eat during our little painting intermission.  This was my third painting party but first with this company and it was just what I expected compared to others that I've attended.  Best part was getting a light meal and intermission!  Definitely plan to go back at some point!"}
{"text":"Came here for a private kids birthday party. Have been wanting to try this out for awhile. Awesome experience. You get to try and paint a selected painting while drinking some wine and chowing with friends. An instructor demonstrates how to recreate the painting and you get to take your creation home.  Not sure I would recommend this for little kids as it was quite messy, but the kids did have fun. I would definitely return with a group of adults though."}
{"text":"Such a fun activity! Everything is amazing. I have been twice. My only tiny little criticism is that there is not a ton of variety with the food. BUT the smores panini is to die for. ;)"}
{"text":"Had a great time with co-workers. I really thought I would have a difficult time painting since I'm not artistic.   The instructor was awesome and the wait staff was also great. I had 2 glasses of wine and pretzels they give you. The instructor give you a step by step so your painting can come to life.  I left with a painting I was very proud of and I will be doing this again.  But I do have one suggestions and that is to lower the music a little bit especially when the instructor is giving directions."}
{"text":"I went on the Thursday, September 22 2016 for my birthday. We had so much fun! The instructor Lelisa I believe was very good. She took her time and explained everything. The staff was very nice and accommodating. I would highly recommend to friends and family. They sang happy birthday and gave us a dessert with a candle. We had a blast"}
{"text":"The food was great. The servers were so wonderful & the instructor tonight was so fun and made the picture we painted (that I was a little intimidated by) so easy. I'll be going back again :-)"}
{"text":"1st time going and we had so much fun!  I have never painted before so didn't have very high expectations for myself, but my painting turned out amazing! The food was great.  A nice selection of beers and wines.  The servers and the teacher were all so great.   They give you plenty of time to finish your painting without making you feel rushed!"}
{"text":"Absolutely LOVE this location!  It's convenient for me and always a big hit.  The food is good and Elsa is AWESOME!!!"}
{"text":"I walked in and they had room for me. I decided all of a sudden at the last minute that I was going to do this. To my surprise there was so many people that were there so many smiles that were being made by playing with paint.I had a very good time and I made new friends. I think I'm gonna like this this is going to be a new thing for me. I want to get out of my own box this is a way to do it had a fabulous fabulous amazing time thank you very much for being there for me \"V\"."}
{"text":"This was my 2nd time attending design & dine. Obviously I will attend again. Always a good time and doesn't hurt that the wine is good as well. The instructor was awesome. Kept me and my bestie entertained the whole night. Planning a 3rd trip."}
{"text":"I really liked painting with the artists at Design & Wine. My friends and I have been thee times and have some awesome artwork to show for it. The set up is good, the food is good and the drinks are reasonably priced."}
{"text":"It was a really great experience. Bring your patience because i tell you what, I didn't see my picture shining through until I saw it through a picture. It looked a hot mess. The serving staff was pleasant. Bill has personality. I felt rushed and my hand hurt from fanning so much but I cannot wait to go back. I love all of my friends pictures and it was a great experience. Thanks Design and wine, you guys were great."}
{"text":"My daughter attended a birthday party here, and they just handled it all so well.  Miss Meghan managed the crowd of 8 year olds and their younger sibs and their parents like a champ.  She even drew a special cartoon for my daughter, which was super sweet.  Great food, great service, and everybody had a wonderful day!  Thanks for everything, and we will definitely be back (because there's wine)."}
{"text":"This place is excellent.   There was a tiny snafu about which location we could go to (bought tix for a private party and had to change plans around), but it was quickly and happily remedied - I'm HUGE on customer service. Great job there.   Melissa, the painting instructor is AWESOME, funny, fun as hell, and easy-to-follow. Can't say enough.   Food/drink service was top notch. My glass was never empty and seriously, everyone that works there is so ......friendly!   Ok so here's what I LOVE. I can't explain how this happens, but everyone - friends or strangers - treated each other like old buddies. There's a great energy there, it's comfortable. It's a great place to meet new people - I did!   Love the concept of Design & Wine: tasty food, talented instructors, friendly staff, positive vibe all around. It's perfect for dates, birthdays, ladies nights...   Coming back next month to do the purple fairy forest thing :P"}
{"text":"What a wonderful time.  Everyone is so very friendly.   What is better than drinking and painting with friends and family.  I cannot wait to come back and try the family class   I think that it is fantastic way to spend quality time with them"}
{"text":"Went here last night for girl's night out, and we had so much fun! Sarah was the instructor, and she was very pleasant from the time you walked in the door!! She had so much energy throughout the whole night, and cracked a few jokes as she went along. (Some dirty jokes too, but aren't those the best?!) lol. It was my first time at this location, and I can not wait to go back again! Highly recommended."}
{"text":"I went here on a girls night out and it was so much fun! I am not an artist..at all...but by the end of the night I felt like Picasso! The teachers are very helpful and patient and help everyone make a masterpiece. BIG props to our instructor Mandy! She was awesome and really instilled confidence in all of us. I LOVE my new artwork and can't wait to go back and make some more. The food was AMAZING! I didn't know what to expect from vegetarian/pescatarian menu, but I was blown away by how good it was. Our group tried a bunch of items off the menu and we loved all of it...there was even some plate licking going on!"}
{"text":"Wow, what a difference! Gave it another shot and had an awesome experience!   I thought I'd booked our session, only to find out when we got there that I'd had technical difficulties in booking (my fault). Rachel took great care of us and found us a spot in the class.  The paintings were very cool, and Andrea was such an amazing instructor! In an earlier lesson, I felt rushed and ignored. Not this time - Andrea answered questions, went at a reasonable pace, and gave tips if anyone was having problems. The food was tasty and we weren't rushed to finish, the wine was good, the red velvet cake was delicious... This was an excellent time, well worth it! Thank you so much, Rachel, Andrea, and Carlos (who serenaded those with birthdays with a Spanish birthday song on acoustic guitar!)!"}
{"text":"I loved this experience! My husband and I went here for a date night and painted a sunset. Both of our pictures turned out pretty good. The instructor was very funny and she was a great teacher. Anyone can follow her lead and get great art in the end. They sell wine, beer, and food throughout the lesson and they have a few breaks in between painting. I loved it, and I'll definitely go back again soon."}
{"text":"It was the first time I ever tried a place like this but it sounded fun so I went with a friend. As soon as I walked in they were super friendly and the instructor was very patient and clear. This was a fun experience and recommend it to anyone!"}
{"text":"I brought my daughter and her girlfriend for Sunday's Bottomless Mimosas and we had a great time. Our instructor was Avery and she was fantastic! She went over everything, helped all of us in class with whatever we needed. Took time with anyone who had questions or needed assistance. She was genuinely funny and a great instructor!  We'd take a class with her again any time. And they celebrated my daughter's (and another guest) birthday. She enjoyed and so did we.  If you're looking for a relaxing activity that includes a mimosa (or a glass of wine) then this is the thing to do! And the food is always good too."}
{"text":"Lots of fun great fun good wine and food........my only objection is that the music is too loud in all locations as I have been to all  if your in the back you can hardly hear the teachers but im always happy to paint and the teachers are so fun  always meet nice people   if it is your B DAY  your treated with a surprise"}
{"text":"About a week ago I was in the Summerlin location we painted Swirly Leaves, the teacher was great the staff is so nice Eran is charming I have never seen someone always smile and he does....plus he is so kind friendly and not to mention handsome as well.    A nice menu of wine food to buy and enjoy this class was so much fun......."}
{"text":"I went June 11th it was fun nice people attending nice staff good food desserts wine, Maria was a nice instructor....will be going again June 17th   I would recommend to come and see how talented you are if not you will learn to paint   Hope they post the Cheery Owl painting from the 11th soon"}
{"text":"I bought a groupon as a little birthday gift to myself and as a first timer to this, I was definitely not impressed. The quality of the instruction, the food, and the wine were average, nothing that would blow my skirt up.   The instructor whom I rather not put on blast   because honestly I feel like he didn't know what he was doing versus being a complete a**hole, was just \"OK\". He wasn't confident in the paint ratios, he wasn't very clear on the instructions and it made it even worse because he kept trying to talk over the excessively loud music. We had to ask him to turn down the music multiple times so we could hear him even though we were all seated in the front.   Now, the food was not worth the price. We ordered the spring rolls & the jalapeño poppers (if you want to call them that) and not impressed at all. The spring rolls were tasty, but really? Only 3 small spring rolls for $8?! And the jalapeño poppers my friend ordered didn't even have jalapeños in them! They were just baked puffed pastry with a jalapeño taste to them. Once again, 3 - 4 small \"jalapeño poppers\" for $8! Geez!  The Pinot noir wasn't very good, tasted like a cheap wine....a glass for $7! Plus a can of soda is $2.50, which is the same price as a 12 pack mind you. On top of that, the server that was there messed up our order, he forgot my friend's soda, and she had to ask for it after 10 minutes of waiting, plus when we paid, he got the bills mixed up with the people across from us, giving us their change. It wasn't a fine dining restaurant with a packed dining room, so it shouldn't have been that hard to get things right.   So all in all, my painting didn't come out close to the original because I started to do things on my own because the instruction was confusing and unclear, but it wasn't a total loss.   Would I recommend this place and would I go back? Maybe if there was a different instructor and server. And maybe if they let people bring in water or their own drinks/food within reason like other painting places in town."}
{"text":"Total Blast! This has become our favorite GNO! ( Girls Night Out)!  The environment is casual and fun. First timers always appear nervous until their first brush stroke however, they are usually the most excited at the end of the class! Robert, is one of our favorite teachers. He is a nut and keeps the class lighthearted and on pace! The \"Servers\" keep the food and drinks coming. You never feel interrupted by them. In fact, they are totally amazing and on top of it! I would personally go weekly, instead of monthly if I did not have a job to interrupt the fun ;)  If you are looking at the reviews, you must be interested......so, GO, you won't regret it. You may even hangup your paintings eventually!"}
{"text":"Total Blast! This has become our favorite GNO! ( Girls Night Out)!  The environment is casual and fun. First timers always appear nervous until their first brush stroke however, they are usually the most excited at the end of the class! Robert, is one of our favorite teachers. He is a nut and keeps the class lighthearted and on pace! The \"Servers\" keep the food and drinks coming. You never feel interrupted by them. In fact, they are totally amazing and on top of it! I would personally go weekly, instead of monthly if I did not have a job to interrupt the fun ;)  If you are looking at the reviews, you must be interested......so, GO, you won't regret it. You may even hangup your paintings eventually!"}
{"text":"My sister and I went here for the first time today. I choose Design and Wine simply because I felt that their paintings looked more fun than the other paint and wine places. I am so glad I did. When we walked in the instructors for the evening were at the door greeting everyone. They asked if it was our first time and even joked with us a bit. During the class Melissa was helpful and fun! She was very approachable and her instructions were clear and concise. We just didn't know what to expect so we followed her instructions to a tee and ended up with wonderful paintings. Other people were more adventurous and did their own colors. Maybe next time we will.   Melissa went around to each person to see if they needed help and was available whenever needed. She is definitely an asset. The servers were also very nice and I apologize that I did not think to get their individual names but I was very impressed with them. I definitely suggest checking this out if you get an opportunity. On the way home I was already trying to figure out another time to go back."}
{"text":"There was a review from a Francesca C 5 days ago that i completely disagree with. I know the instructor she had as I've had her many times and i go to class 3-4 times a month and she is one of the funniest, easiest to get along with people. She's from the Midwest they are all nice there. There is only so long you can be there so if she asked you to be quiet it was so you all could finish. Looks like all your paintings turned out good so she really couldn't have been bad or they would have looked like crap."}
{"text":"I've painted at several of these type venues in town.  This one is by far the worst.  Here's why:  - location is tiny.  Think 2 car garage size.  40 or so people crammed around long tables facing 90 degrees away from the instructor, plus food, drinks, and paint.  Messy and lots of spills, easels toppling over, etc.   - the platform for the instructor isn't high enough.  YOU CAN'T SEE!  There is a TV monitor on the ceiling, but there's a light in front of it creating a glare, plus the room is so small that it doesn't help.  You either crane your neck to see around the person in front of you, or give yourself a headache trying to look up.  - no reserved seating, so you have to go early.  Check-in was a complete mess because the staff got confused about which seats were already taken, so we just stood there for a while.  - no sinks or places to wash up.  Want to know how you rinse your brushes? with a water cooler and a trash can.  - no places to store your purse or bag.  You can't put it on the floor and there's no room to put it next to you because it's so cramped.  There is a small shelf that looks like it's intended for bags, but staff didn't mention it, plus only the people sitting right next to it would be able to use it securely.  - no outside food or drinks.  This place is more focused on selling food and drinks than painting.  It was really distracting to have waitstaff running around constantly.  There's nowhere to eat because it's so cramped.  Also, how can you eat finger food like pizza and sandwiches when your hands are covered in paint?  - bathrooms were gross! put in a fan or at least clean them before the class starts.  - no helpers.  Most painting venues have staff going around to give you more paint, paper towels, offer help, etc.  I had to ask a waitstaff employee for paint since I ran out.  He rolled his eyes and grabbed a plate from a no-show.  - poorly paced.  Seriously, we spent 90 minutes taking breaks to eat and paint a background.  When it got to the actual detail, the instructor rushed us and kept skipping ahead.  - worst of all, the instructor.  I won't use her name but will call her S.  I suppose some people think her sarcastic Cake Boss-esque humor is funny, but I found her rude and obnoxious.  She would just say stuff like \"paint a yellow line\" whereas most instructors would say \"mix 2 scoops of yellow and 1 scoop of orange, add 2 drops of water, and paint a line the width of a pencil about 6 inches long\".  I get that you're encouraged to be creative, but that's why we take the classes: to learn.  We need that guidance.  Maybe if she'd reduced the number of eye-rolling dirty jokes and spent more time guiding us with the actual painting experience, my painting wouldn't have wound up in the trash.  - The class started late, but she went over the top calling out a few people that came in late.  She kept talking about wanting to go home on time.  I don't think anyone was finished at the end.  We were trying to finish but both S and the waitstaff started throwing away our paint.  - Perhaps most insulting was a canned email sent afterwards, inviting us to leave a positive review on Yelp and to address negative issues via email.  Maybe that's why the reviews here are so positive.  I can give them 2 stars simply because the music level was reasonable, unlike some other venues that think they're a nightclub.  Aside from a social media contest to give away a bottle of wine, they weren't too annoying with photos and social media like other venues."}
{"text":"A group of my friends for moms night out decided to come in for the first time because we had a coupon for $10 off the session. So one of the girls went on line and paid for all of the tickets at one time. She entered the coupon code and paid the amount that was showing as due. OK so we are all excited and met up at the studio and the girl at the door said they couldn't honor the coupon unless we had it with us.....so my friend had to drive all the way home to get it. The only reason she didn't bring it with her was because no where on the coupon did it say you must present coupon....I mean for crying out loud obviously we had a coupon cause we used the code when we purchased the tickets but whatever we were all settled in....or so we thought. Then we were approached because we only had one coupon. OK and the problem?  The coupon didn't specify one per customer. ...when we used the code online it took it for all the tickets. The manager came over and said no 3 of use owed an extra $10 each. We explained our side and she said it would be at the managers discretion. ...OK let's talk to the manger....well surprise surprise she was the manager and she said nope pay up!  So now we have a super bad taste in our mouth with how this was handled before we even started. OK so time to pay the tab....to our surprise the manager must have changed her mind cause when we each received our bills no extra charge!  Wow that was nice she must have realized how poorly it was handled. Well that was short lived. ...a server was sent over to collect our tabs to \"fix\" them. Yep brought them back with the $10 charges. It's very easy to say we absolutely won't be coming back to your facility especially with other options in town. To bad too because we plan lots of girls night out, which are usually a bigger group cause we all work at a local hospital. Very poorly handled situation. ...sure hope the $30 you made tonight makes up for all the business you just lost.    Oh yes we also received a punch card that said....buy 9 and 10th session is free!  But then they announced that it isn't actually free like the card said but it's $3.99. Lol ridiculous!   Sent on a Sprint Samsung Galaxy S® 5"}
{"text":"This is definitely a different experience,  but I say that in the best way possible!  Lots of fun and a friendly environment.  There is a Menu you could order off of for food and drinks. I only had water and some asparagus puffs. They were ok. Not worth 6 bucks for 5 little puffs that were nothing to write home about. Everyone on staff seemed great.  One smart ass guy amongst the employees who went around making jokes about people's paintings. He was just kidding around but I think it could be taken the wrong way.  This place is definitely worth a try with friends or for a date night.  They even give you a frequent painter card so after so many you get one free. Neat place."}
{"text":"My friend Shannon and I had the best time! Both first timers, and wow, was this fun! I have never painted before, and I was pretty sure it would turn out awful but the instructor was so good, I was very pleasantly surprised! The food was yummy, the instructor was awesome, and the staff was so friendly and helpful!!"}
{"text":"First time painting here. It was a great experience, and Melissa was a great host. There were many first timers as well as veterans, and various age groups. The pace Melissa went at was perfect for all.  We didn't have lunch, but did spring for desert. The chocolate croissants were delicious. Served warm and flaked to perfection. Will be back for sure"}
{"text":"Jen is awesome! She explains what brushes you need and where on the painting you use them BEFORE you even start painting. She also calls the brushes by what they are, rather than numbers, which eliminates confusion. I have been 6 times and planning on many more! I have heard from friends about other paining venues and I'll stick to Design and Dine. The Henderson location is the best! It seems bigger and not so crowded. Plus there are a lot of hair dryers! Do it! You will keep coming back for more, like me!"}
{"text":"Today I went to Design & Dine, the Las Vegas location. SO sad to say not only is new ownership not vegan, the employee (Avery) that checked us in made a very snide remark about vegans to me. As she checked my name off the roster she said \"Have you been here before? We aren't vegan now, we serve real food now.\" She laughed sarcastically. She was also the paint instructor for this session.  I let her know I was vegan and that she should choose her audience more wisely if she doesn't know the person or their lifestyle choices. (She also played music that had pretty explicit lyrics during the class, and kept referencing getting drunk or vegas-y activities.  Very uncouth.) I was shocked at what an unprofessional and ignorant thing she would say..not even one minute that I was in the door! Had I not already paid online, I'd probably just leave.  So..needless to say, my family and I won't be supporting this business anymore."}
{"text":"This place was fantastic, this was my first time ever doing anything like this and my experience was pleasant. Everybody has there own station with brushes, paint etc... There was a good amount of men and women joining us that night. A fun atmosphere in general. The instructor was rather funny. She was nice and easy to follow, i enjoyed her personality, she was perfect for the job. She lead us step by step and even walks around every here and there to answer questions while you are painting. It was 3 hours long but i was so concentrated and enjoying myself before i knew it, it was over. Me and my sister ordered the chips with salsa as a snack while we painted."}
{"text":"I signed my daughter up and her best friend for one of the $19 specials last Friday night. They both had a great time, their paintings came out really cute, and they said the food was delicious. When we arrived the woman that greeted us was very friendly and helped me get my daughter and her friend checked in quickly and efficiently. The location itself is small and in an older shopping center. I think this is probably better than a location in one of the trendier shopping centers where I'm sure rent and overhead are much higher.  I appreciate the fact they have specials and also their menu items seem to be priced well. I also noted they have a lot of vegetarian and vegan options.  I will definitely be coming myself to do a painting when I see when I would like to do."}
{"text":"This was my first time designing and dining and I had a blast! I went with my BFF and we truly had a great time! It was a packed house and the other patrons were awesome! Our instructor was amazing! She told a few funnies and really kept it fun! I'll def be back!"}
{"text":"This was my first time doing anything like this and I had the best time ever. Thanks to my friend TLott for the invite and I am definitely going back. Jen made it super easy to follow and gave the best tips and encouragement.  Bill was the best at taking care of all of us as well. Thanks for the great experience."}
{"text":"The food was okay but the experience was awesome. I really liked how they took some time to let us finish the painting. Will come back again!!"}
{"text":"I patronize all the businesses in town that offer painting classes.  Design & Wine is top knotch.  In addition to the instructor in class there are always additional artists working who are there to assist you if you need help.  The paintings they teach you to do are always cute and with their skilled instruction anyone can complete a nice looking painting.  They serve food and wine at this establishment.  The food is delicious and very reasonably priced.  If you order wine they give you a small portion of spicy pickled vegetables to munch on.  If you order a canned soda with a glass of ice they will give you free refills.  Most places that serve beverages in cans do not do that.  They recently installed a camera positioned on the artist teaching and then a monitor half way back in the room so those in the back can see what is going on.  None of the other similar businesses in town have such a nice feature.  This is my favorite place in town to take a painting class.  You have to check it out."}
{"text":"I went to design and wine for the kids paint class. It was nice but the only thing I didn't like is the class felt rushed.  If some kids aren't done painting she keeps on going but other than that it was good.  My kids loved it."}
{"text":"This place has it all to be AMAZING! But they are on a down hill slope. The service for the drinks and food was decent. They weren't very attentive. They advertise a food drink and paint but they take your menu from you when you order a drink and never come back. They don't tell you that whatever you mark on the menu \"like a sushi menu\" is all they will be serving all night. When the teacher got started her introduction was longer than what she explained for most things we were painting. And for a three hour class you at some point would hope it wouldn't go over and \"Jen\"s class went at least 20 min over. I had a great time but there is defiantly  room for improvement"}
{"text":"Loved it! Lots of fun! The staff knows how to have a good time! The instructor was very good!"}
{"text":"I loved my experience here! The food is amazing and our instructor was hilarious! There was a group of about 18 of us from the salon I work at, and let me tell you we are not quiet or entirely well behaved when wine is involved lol. We spend about 2.5 hours between eating, painting and after pictures and never felt rushed to leave or scolded for being the crazy hairstylists we are. I am going to go back ASAP as a girls night out! It was an incredible value for the experience we had. Absolutely unforgettable!"}
{"text":"I love the relaxed atmosphere and the fact that you can order food too! It a competitive price for great paintings!"}
{"text":"My Kids took me here for my Birthday. .. I reluctantly \"rolled my middle aged eyes \"  and So I said Sure. This was The BEST TIME I've had with my adult kids!!  The People who work here are Awesome!! Food and Drink But the People are Great.. We'll be Back!"}
{"text":"Anytime you put wine with something creative and fun, it's the perfect setting for me. A friend asked me to come along with her and I wasn't exactly sure what to expect. However, it was exactly what they say it is: Design and Wine.  When you arrive you check in and they provide you with a menu to order food and wine. Then, you get settled with your canvas and they brief you on what to expect. Don't worry if you can't draw worth a lick - they've been expecting you and know how to walk you through creating something halfway decent, step by step. Run out of wine? No worries, someone is walking around making sure you're getting your fill.  And somehow at the end, you'll feel pretty proud about what you've created. Mine is actually hanging in my living room. :)   Tip: there is usually a discount on Yelp or Facebook."}
{"text":"Terrible instructor .... Needs better customer service! Extremely pushy to get us out early!"}
{"text":"Best place to relax and have fun. Look for the groupon online! My cousin and I had an amazing time and enjoyed making our painting . Kids are welcomed so that's great as well!"}
{"text":"My friend had originally planned to come here with her friend but her friend got sick so I took her spot. My friend is a Design & Wine veteran so she had answered my 20 questions and she gave me a brief summary and some tips so I knew what to expect coming into this class. I felt immediately welcomed by the cute, brunette instructor. Our class was full with 52 painters. There were only four men out of the 52 painters.  We put on our silly aprons which had big boobs and a sexy figure silhouette so we got a few laughs from that. We placed our food & drink orders. The server was outgoing and friendly too.   Throughout the class, clear instructions were given. I kept on running out of paint but there are people who bring you more paint. You can follow the instructor to a tee or if you're a Picasso wannabe, you can add your own creative touches.  The class takes three hours with a break for dinner. I feel bad for saying this but the food (grilled cheese tomato panini and the chips) weren't very good. However, I did like the salsa. I wasn't expecting good food from a painting class so whatever.  After three hours, my masterpiece was completed. No surprise here. It just confirmed that I paint like a 3rd grader. Out of curiosity, I walked around to see other people's paintings. There were some professional paintings, a lot of decent ones, and a few more horrific than mine.   Overall, it's a fun way to get in touch with your inner Van Gogh with your girlfriend(s). If you're a desperate, single male, this might be a good place to pick up women (har har). They have couples nights here and private parties. Everyone is so freaking nice and friendly here too! I'll be sure to come back with some painting noobs!"}
{"text":"A friend of mine got a Groupon for this a while back so we decided to check it out. I wasn't sure what to expect since I am not the most talented artist, but I love to create! It was a BLAST! The staff was SO friendly, the atmosphere was fun and relaxed. I wasn't made to feel silly for wanting to use other colors and add other details to my piece; they just got me whatever colors I wanted. I will definitely be coming back!   Great job, guys!"}
{"text":"I don't get to do these very often but they really are so much fun.  I love that they have 3 different locations and they offer the same paintings at more than just one location if it's too far out of the way.  In addition to Groupon partnering with them, they offer discounts all the time, and even have a punch card.  I can definitely see myself doing more of these, with friends, with my daughter, or even just by myself for some Mommy time."}
{"text":"Amazing time and experience. The staff is friendly and the helpful with the people like me that can not paint."}
{"text":"What a wonderful fun experience. We cannot wait to book our next painting. Melissa and staff keep up the great work! You were all entertaining and awesome. Thank you for a super fun Night. = )"}
{"text":"Wow what a change since the last time I reviewed. Horrible experience and even worse customer service! I'm not hard to please, especially when I'm trying to just have a fun and laid back night out with my girlfriends. They clearly do not care about having return customers and they certainly have lost myself as a future patron as well as the 5 other ladies that were with me. Sad to see this drastic change since my last visit :-("}
{"text":"Had a blast.  Fun and relaxing.  Can't wait to do it again."}
{"text":"Should be called design & soda. They don't have wine. You can't bring wine in. The instructor was slow an boring. We finished our boring painting early and left. I sat twiddling my thumbs more than I did paint.  NEVER AGAIN.!!!!!!!"}
{"text":"I really love design and dine. They go step by step and have amazing artists! They serve great food and it's just a good time overall!"}
{"text":"Went here for a private event - the location is great because it has a private party room large enough to accommodate approx. 30 people. It was fun, interactive, messy, and delicious all rolled into one night. From start to finish - will last about 3 hours. Before you start painting you pick your food items- appetizer (served 20 mins into even), entrée (which is served during a short dinner break), dessert, and of course wine or beer. All the food tastes great - a variety of sharable plates and Paninis .  Overall great place to have a birthday event or even girls' night out."}
{"text":"This place is a sanctuary for those who love to paint, are new or not so great at painting. There is a very enthusiastic instructor name Val who will guide you through each step. It was a very fun environment and loved how my paint turned out. The room is a bit small and felt very narrow. They serve food and drinks at Additional cost. We started at 6:30 pm and the class ended by 9:15 pm. Be prepared to stay there for 2.45 hours. The only con is you don't have much space to move around."}
{"text":"Update:  I've been twice, so far.  Had a great time.  This time we bought Groupons.  Super nice girl (Sara) booked our reservation over the phone.  This location was on Durango.  Again, it was a little hard to see the details.     This was my first time. I was really happy with my finished painting.  I do wish that I could see the instructor's canvas and technique a little closer. I will definitely come back.  Love the special pricing. So worth it for a fun evening.   This location was on Cheyenne.    Oh, BTW, towards the end of class they usually have drink specials ;)"}
{"text":"Had soooo much fun.  Maybe a better/bigger camera/viewing screen.  We couldn't see the brush strokes, etc., since the screen was so little.  The instructor and wait staff were great.   The wine and appetizers were also good."}
{"text":"I've never been to a place like this, but when Jadira told me about it, we just had to check it out!  We even invited a few friends along... needless to say we all had a blast!  Pros: *  Extremely friendly staff (everyone interacted w/ us throughout the night).  *  Easy to follow painting instructions that is perfect for all painters of all skill levels. *  They serve food and you guessed it...wine!   *  The menu had healthier food options and even has Vegetarian options! *  Decently priced  *  Clean and inviting atmosphere  Cons: * No wine license as of yet, but in the defense of Design & Wine they are not totally open to the public as of yet.  We got invited to special soft-opening.  Overall:   This place is awesome.  The layout is spacious and everyone is friendly.  Everyone had an incredible time and we got to share our paintings with everyone.  This is definitely something different to do in Vegas and is good for all age levels and skill levels.  It's something that we'd definitely do again and highly encourage others to try.  I can't wait until their grand opening.  They'll have their liquor license.  I imagine the experience being triple the fun! =)  Tips:   * Dress comfortable.  Classes are 3 hours and you do not want to be uncomfortable * A little paint goes a long way.  Half a pump of whatever color paint you get is plenty. * Bring your camera so you can take Kodak moments of your Design & Wine night! * Add Design & Wine on your FB for special deals and promos!"}
{"text":"I never thought that I would be reviewing a painting gallery but this place was actually pretty awesome. My wife booked us for a special painting session for the victims of the Sandy Hook shooting. The entire experience was humbling and I was happy to be apart of it.   This is one of those date night, take a class together, or just do something for yourself kind of places. It was very relaxing. There was no pressure to be some world class artist, just have fun. They feature a cool menu that has some different items such as smores panini, vegetarian options and several different drink options.   I have never painted on canvas before and doubted that I had any creative ability whatsoever, but the step by step method they utilize to get you through it was awesome. If you found this review then listen closely...WHAT ARE YOU WAITING FOR. Go try design and wine, gentlemen your lady friend will love you for it. Ladies your guy friend will not be disappointed, trust me. ENJOY!"}
{"text":"It was my first time doing one of these Paint Night activities and it was a BLAST! All supplies are provided, (easel/canvas/paint brushes/paint/apron) and they entertainingly walk you through the entire process. The teacher walked around giving suggestions on how to make your painting better, which was helpful! They also have a menu to order food and drink off of which is reasonably priced. If you're like me, i got paint everywhere so eating while painting wasn't really ideal lol. It was a great place to host our team building activity. Found out they also have kids classes on Saturday and Sundays, definitely would like to bring my kids to check those out!"}
{"text":"First time here today Sunday July 25. , kids painting class. , all I can say is excellent , fun fum time. My kids loved it. The instructor  was awesome , great with all the children I cannot wait to take my kids back and I'm scheduling a adult class as well  thank you for a amazing experience"}
{"text":"Visited Summein location, it was fun but seats are uncomfortable for a 3.5 hour painting class. The all men serving staff that night was very attentive and brought my wine out quickly. I'll visit again :)"}
{"text":"Celebrated birthdays here on Friday & we had a blast! The staff was very friendly, funny, & helpful! We will definitely be back soon!!!"}
{"text":"We had an absolute blast!  The girls were lots of fun and were very aware of anything we needed and kept the fun going. The paining was more fun than we expected, especially since we had never done anything like that before. But....the food was absolutely horrible!  We came hungry and were anxious to eat the great food that was advertised, and that food didn't exist.  They had appetizers which came out of the microwave and tasted slightly better than cardboard (we got spring rolls and poppers). The paninis were only slightly close to what was on the menu and reminded me of hot pockets stuffed with old canned mushrooms which seemed to replace the avocado listed on the menu. I hate to be so negative after such a fun experience, but we were forced to eat horrible food because without eating, drinking was out of the question.  So I recommend eating before you go."}
{"text":"This is one of my favorite painting spots now! Met up with friends and we had such a funtastic time! One of our friends never painted before and was very apprehensive about it, when she saw the final result she was amazed of how wonderful she could paint, actually the instructor was very easy to follow and took her time and reminded us that we were not in a race and it did not have to look exactly like hers or your friends. The staff is very friendly and attentive we ordered our wine and food, the wine was brought out immediately and the food followed shortly, the food was delicious and the dessert was divine! Although, it was a full class the seating is comfortable, the place is clean (a sink to rinse your paint cup was a plus). The music was great! Overall it was a picture perfect time and \"I will be back\" :) I encourage you to try it, even if you think you don't know how to paint (like most of us thought)."}
{"text":"This place was awesome. I thought I would walk out of this place with a horrendous painting. But it was easy as 1, 2, 3!  I will definitely be coming back and I wish I would have came here sooner!!"}
{"text":"There is a groupon for wine and canvas that is $25 but you must make a reservation online. The voucher code does not work on mydesignandwine website to make the reservation. I wanted assistance I speak to someone about why the voucher wasn't working and if I could place the reservation over the phone since I bought the groupon already. I started my first call at 10:00am. It's now 5:34pm and I still have had no point of communication. I've emailed them through the contact information online as well and still no response. Having called over 10 times throughout the day but there's not even an option to leave a message because the mailbox is full. As great as this would have been the lack of customer service is very very poor because there is no way for a customer to even receive service with the number provided. This is ridiculous and unprofessional. It requires a reservation to book this wine and canvas night which requires arranging my schedule but I can't even confirm the reservation because there is no one available to speak to. This has been a terrible effort to put forth in and will clearly not recommend this place and tell groupon about this as well."}
{"text":"The instructor seemed a little awkward and she did not do well with telling us instructions. We were doing a beach with a chair and she barely helped us. And every time she \"showed\" us what she was doing she was standing directly in front of her canvas. There are other places that will stand on one side to show the side of the class then stand on the other side of the same canvas to show the others. Her phrases of \"I know this is frustrating\" was so disheartening because she knew she wasn't teaching well. I saw at least 4 people who didn't even attempt the chair. And her painting compared to the one she was going off of was terrible. Overall just an unnecessary stressful paint night. But it makes sense that they're always discounted. We won't be back.  I honestly wonder how are these instructors qualified for teaching these classes??"}
{"text":"We have been here twice and had a blast both times. The paninis are delicious and Melissa is a great instructor."}
{"text":"Great fun! Fabulous food and wine and people! Super easy for even the horrible artists like me!! We've been here 3 times already!"}
{"text":"Sooo much fun! I am not a painter but when I looked at my finished canvas...I had to wonder if I was a secret painter that painted in her sleep lol.   The idea of painting, eating, and drinking is marvelous!! There were several couples and lots of ladies with their friends. I went solo and had fun by myself.   The instructor was nice,patient, and funny. After giving a painting instruction the instructor would walk around and make sure you were keeping up, helped you out with any part you were struggling in, and gave loads of complements.   They also have a frequent painter card. You know what that means...I'll definitely be coming back so I can get my free paint on!"}
{"text":"So much FUN! It doesn't matter if your a skilled painter or a newbe. You will leave with a wonderful painting! I have been to both the Summerlin and Henderson location and both are great!   The instructors do a great job and explaining how to recreate the painting. They also stroll around and give amazing compliments and extra help to those that need it.   I have never ordered food or drinks ( I know, shocker!) but I have heard the  horderves and wine are yummy and pretty reasonable in price.   Tip: make sure to arrive early so you can snag a seat up front. If not, it's a bit hard to see...but each studio has a monitor that you can view the instructor on."}
{"text":"A weekday booking has much less people but it was still super fun!  Meghan, our instructor is hilarious!  I dunno how she makes technique look easy, but then again she's got the experience.    One must definitely be creative minded and interested.  Although they do say even if you aren't, your final art piece looks like you are.  I recommend a 'dab' at this/these class(es) anyway.  Maybe you didnt know you had artistry in you ;)  Yes, for an occassion this event could be a cool booking to get together.  But you don't need an occasion honestly.  Celebrate yourselves for no reason and enjoy the creative bonding.  The fees posted are for the artwork.  Food, beverages, and alcohol are served (additional tab); so have a card or extra funds ready if you'll be dining as well.  Also, good idea to have tip funds for the instructor."}
{"text":"I have attended twice now & I've enjoyed myself each time. It was therapeutic, fun, and an overall nice atmosphere. It's great to do for any occasion really!"}
{"text":"Went to the one in Henderson & really enjoyed myself. I don't consider myself creative or artsy and although my painting didn't come out the best it was still better than I thought! Would recommend to anyone :)"}
{"text":"I went here last night for the first time. I will admit I was nervous and thought my painting would be horrible. I was wrong! The instructor walks you through the basics, step by step, and before you know it...you have a painting. I brought my husband who wasn't crazy about the vegan food (he'll live). I can't wait to go back and try the date night painting. I do wish they offered a better deal on the wines. Maybe a couple can purchase a bottle of wine to share rather than paying $7 for every glass. The wine prices would be my only complaint but still worth going."}
{"text":"A great time.  Go with someone or by yourself, it will be fun no matter what.  The instructor was fun and the place is nicely set up!"}
{"text":"i've gone many times and each time it's FABULOUS!!!!  The teacher is awesome, patient, and fun!  Food is great and painting is super cool!  Great with a friend, a group, on a date, or even by yourself!!  Will always come back!!!"}
{"text":"Went here for my birthday in August and we had a blast! Can't wait to go back. Food was good and drinks always make things more fun."}
{"text":"I really wanted to take my friend out on a Saturday night. We went this past weekend for the True Love painting. She needed it more than anyone else I know. I felt like this activity would be right up her alley...and it was. We both got really into it. The host was fun and had a great energy for this activity! The group was very diverse in age and the crew was geared very well towards the younger side of the crowd. However, they did try their best to connect to us all which did not go unappreciated.  We ordered chips and salsa and I had the Italian panini and a glass of Pinot Grigio. All of it was mediocre at best.  Over all, this was a lot of fun and I will be keeping an eye out for more deals like the $19 one I got. Thank you D&W!"}
{"text":"This place is amazing!!! They offer a full food menu and beer/ wine and soft drinks. We shared spring rolls, hummus, an Asian salad, a caprese sandwich and the chocolate croissant. Everything was delicious!!!  As for the art class... I have not painted an actual painting since art class in middle school and I still had so much fun! Thanks to the awesome instructor (named V), it was much easier than I thought it would be. For someone like me who is not artistic at all, my painting still came out pretty good! I definitely plan on going back again soon!"}
{"text":"I've been here at least 10 times.  If you are looking for something new to do with your friends, this is it!  Regular price is $35, but you can get deals and coupons from Facebook or Groupon, or if you sign up for their weekly newsletter.  You can get $5 off, $19 classes, etc.   It's a 3 hour class, but it normally finishes early depending on how everyone does.  I think of the 10 classes I've been to, only 1 allotted to the whole 3 hours.    The paintings may look hard to do at first, but they are really easy.  The instructor will go over each step, and it's really easy to follow.  Their panini sandwiches come with pickles and chips.  If you are here for dinner, that's what I would get.  I also recommend their chips and salsa and asparagus rolls.  You get free dessert on your birthday!  Sometimes you can find a deal where you get free dessert or appetizer.  Wines are only $5.    \"Date nights\" are fun to go to with your significant other.  Good for groups."}
{"text":"A little wine, laughter, the company of good people, and a chance to express creatively, Awesome Night! I took my girlfriend for her birthhday for something a little different we were amongst several others that were celebrating birthdays so the mood was festive. We both had a great time, the instructor was helpful and entertaining and the server was great. We were both happy with our choice and plan to come back with a bigger  group next time."}
{"text":"I have been there a couple of times and just love it every time.  We just did the kids painting class and my family had a blast.  I can't wait to hang our little pieces of art at my house.  Thanks for bringing something so exciting for little ones to do...   I love going with my friends and enjoying some fun time and of course lets don't forget about the WINE!!!!.. Now I am only missing to go with my husband that will be the next date!!!!"}
{"text":"Staff was friendly but the experience was eh. They were really pushing for our picture to be taken which I was not okay with. The instructor was nice but continuously said terrible jokes, she even admitted they were terrible and continued, it was so awkward. I liked the painting and had fun with that but I've been to a different business with the same exact service and had a better experience. Wasn't a fan of the long breaks or that the food was on a set schedule and if you requested it ahead of time you couldn't get it until the scheduled time."}
{"text":"Super fun! Great artists and teachers. Good equipment, clean establishment, helpful staff and lots of paintings to choose from. Had a blast! Will definitely be coming back!"}
{"text":"I love Design & Dine! Im not a good painter at all, but the step by step instructions is awesome & my painting is amazing afterwards. Great scene!"}
{"text":"I came here at the invite of a friend.  I believe she had already purchased the deal through Groupon or Yelp prior but was able to add myself and another person for $20 each.  I arrived about 15 minutes prior to the scheduled start time.  I was given a menu and opted to just order a flavored beer for $5.  I did notice that there was a sign that said no outside food or drink.  That's fair.  No one said anything about my bottled water and I would have been a little irked had I been forced to spend $1.50 on another one.    The instructor for the evening, Megan, I thought was really good.  She introduced herself, went over her background and explained the process.  It really is step by step and she leads you through it giving you options along the way.  We took one 20 minute break so people could catch up or ask questions.  This was my first time attending a wine/paint party.  It's a fun, affordable evening with friends and you get to take home something you made.    My major complaint would just be the brushes.  Being that the majority of people are first timers and novice painters quality brushes would be nice.  Mine were frayed and I didn't feel comfortable getting too creative because of what I knew would be a bad outcome.  Meagan even cut fraying from my angle brush.    When it comes to seating try and sit as close to the front as you can so you can see the instructor and not have to rely on the one small monitor they have hanging from the ceiling.   As far as the food goes I didn't order any but people around me did.  Basic bar bites that didn't look that appetizing.  I imagine it's more of a frozen to oven kitchen preparation versus actual cooking.  Add to that I didn't notice any kitchen smells."}
{"text":"I have to say, I'm a little confused as to why I was not served wine during my visit...  I mean.. Design & WINE.  Hmm...  In addition, another con would be the layout of the studio.  You kind of have to break your neck a little just to see the artist at the front.  Maybe if they arranged the tables so that they're forward facing, I think I'd like that better.   Nonetheless, my experience here was a delightful one.  Came with a few friends and I'd like to think they enjoyed themselves as well.  Definitely a place where friends can talk, bond and enjoy each others company."}
{"text":"First let me say, I am a very picky person when it comes to service.  I believe that in the service industry you should always give 100% because that is what keeps people coming back.  Well Design & Wine always gives that 100% and more and they keep me coming back.    I found this company on Facebook and was there the first night they opened and have watched this company grow over the last year.  Their goal is to make each customer happy and to leave there with great memories and a picture they would be proud to display( I display all of mine).  Yes, I have been there several times over the last year and have taken many family and friends with me and they always have a great time too.  In fact several of them have been back....without me!  I have gained confidence in my skill of painting because of the instruction I have received.  The staff is busy when they have a sold out class, but never to busy to stop and answer your questions or show/explain how to get the most from the brush strokes.  I don't think I'm ready to strike out on my own yet, besides I love the atmosphere, the food and most of all the staff!  If you are looking for something different to do, without having to go to the strip, the clubs or the movies this would be it.  I highly recommend this activity and this company.  It seems a little pricey but if you like them on Facebook, they run specials all the time that you can catch to help defer the cost.   I am a devoted fan and look forward to many, many more experiences."}
{"text":"This is a great place and we had a fun time but im not sure if i will be going back anytime soon. After paying $35 to register you would think it would include the WINE, but when i arrived i soon learned that if you wanted wine you had to pay for it by the glass, and mind you this was not cheap wine. $7 a glass. The food was a bit difficult to eat as there isn't a lot of room for your paint, brushes, food, and wine so i felt a bit crammed. During the dinner break they forgot my friends food and later her dessert and we had to remind them about both. By the time she got her food the break was over and she had to stuff it in quickly, and we never received any sort of apology. The class was a bit fast-paced but the instructor Sabrina was very helpful. When it came time to pay my friend and her mom had coupons for free entrees and an appetizer, however the waiter refused to accept them, claiming you had to enter the coupon code when you registered online for the class. Which is COMPLETELY ridiculous since the $35 registration fee does not even cover food or drinks.  My friend and her mom both had separate checks but my friend handed the waiter both checks and the cash to cover them. She received her change and left it as a tip, but then was accused by the waiter of only paying for one check. They were obviously confused but he kept insisting she cheated him out of money. It was completely ridiculous and she refused to give him any more money, explaining she already paid for both checks. I don't think i will be back after spending $57 for dinner, wine, and a paint class myself. And the service really turned me off."}
{"text":"I had fun here with my group but if your self conscious about your painting you may not want to go to this location. The teacher was outright rude! I accidentally dipped my brush in the water and added it to my canvas instead of the plate so my painting had drips on it. The teacher called me out and put me and painting on blast instead of the whole class as told what not to do. So embarrassed. Probably will visit a different location next time or go when that teacher isn't teaching. I want to say her name is melissa."}
{"text":"I was hesitant on coming here for a bridal shower since I'm not an artist but I'm so glad a friend of mine convinced me to go.  We had a great time!  I definitely recommend this place for an evening out with friends or significant other.  Our teacher \"V\" was great.  She made everything easy.  I will definitely be returning to this place SOON!"}
{"text":"I wanted to try Design & Dine for the longest time and when I finally made it there with my girlfriend I was super exited! From the moment we walked in till the the very end we had absolutely fabulous experience. Painting instructor, hostess, cook as well as server were awesome!! Food and drinks were very good too.  Overall we had the best time and paintings came out great too.  Can't wait to go back!  PS They made me feel very special because I went there a couple days after my birthday. As well as the rest of Birthday people :)"}
{"text":"I got to the Design & Wine nice and early, but had turn around to go home for my coupon. After getting back to Design & Wine they told me I need 4 coupons for everyone in my party. NO WHERE on the coupon states that it is for one person only. On top of that it lets you use the coupon online for as many people as you want. The Manager came to talk to us and was really rude. Then said its up to managers discretion. She made us all pay the extra and not use the coupon but for one person only. I will never go to this place again. I may try their other locations but not this one. So instead for them honoring the coupon, they will lose out on all 4 of us never returning and paying 35 bucks. We will try other places because this isn't the only painting place in town. Poor customer service."}
{"text":"Their cancellation policy is ridiculous! We had a family emergency and weren't able to attend the class and before we could even explain our situation the lady in the office that we were speaking to on the phone  talked over us saying there is a 48 hour cancellation policy and there was nothing she could do. Not even let us move our spot to another night. I mean it's a little ridiculous when airlines have a better cancellation policy than a freaking paint store."}
{"text":"My husband and I went on date night and had a blast! Our instructor was Melissa and she was friendly and full of energy. However, Melissa was a little fast and slightly vague in her instructions, but gave us plenty of time to paint each step. A finished painting was hanging that we could refer back too. Drinks are average price, $5 for beer and $7 for wine. Last call drinks are half price! We ate before going so I did not have a chance to try any of the food, but there is a 20 minute dinner break half way through for everyone to eat. There were a lot of people munching on appetizers throughout the painting class. This is something I will absolutely do again, and highly recommend it for anyone looking for something fun and different."}
{"text":"For my first wine and canvas class Design and Dine made my experience great. I celebrated my birthday along with 2 other women and it was a lot of fun. The instructor was awesome and very easy to understand. I think everyone in my party were first timers and they all enjoyed themselves, many wanting to return for another session. The menu was very affordable with many options to choose from if you're a wine or beer drinker there's choices for you. They gave out \"Happy Birthday\" tiaras to us and had special dessert with a candle. Everyone sung Happy Birthday! I felt special and I'm sure so did the other ladies. Overall, it was an amazing experience and I would recommend this to anyone that wants to try it for their first time or doing a birthday event! I'm Picasso reincarnated;)"}
{"text":"If you haven't been to one of these type of venues, this is the layout.  Serving small plates and wine during breaks, an instructor gives you step by step instructions on how to make your own work of art on canvas.  I went with a girlfriend of mine, but there were couples, a mother and son...a cross section of very nice people who wanted to do something different with their weekend.  The owners served while we painted over a three hour time span.  The time flew by!  I am not an artist by any stretch of the imagination, but still came out with a decent product that's hanging on my wall now.  Enjoy! PS Only reason that it doesn't have 5 stars from me because they didn't address the fact that they didn't have a liquor license yet (found out from Yelp).  They do now have one."}
{"text":"I had a great time trying out the Henderson location today. All of the staff were nice and helpful. They go at a slow pace so that everyone can keep up with the process.   I will definitely be back. I enjoyed the atmosphere & the painting was therapeutic"}
{"text":"Tonight was my first time at a paint party! Megan made it fun and easy to follow or add your own touches! The servers were great & so friendly too . I'm definitely going back - fun & really enjoyed painting Butterfly kisses on canvas - great colors!"}
{"text":"I love this place. Every time you get a beautiful masterpiece that you never thought you could create. I would give it 5 stars, but this last time, they were really late serving our dinner. We got it after the break, which made it really hard to eat it because the instructor was really fast. I mean really fast! Plus we were sitting in the seats where we looked at her back the whole time, and we weren't able to see what she was doing. By the time we could, she was on the next step,so that was frustrating. With that being said, it is still a great night out. We'll be back Saturday for Starry Night. The food is excellent and the service is usually great. It really is a great value for your money."}
{"text":"Went here with my girlfriend to celebrate our anniversary and I am so glad we did. The staff was very kind and helpful. Our art instructor Kery was extremely supportive. We will definitely be back to paint another painting!"}
{"text":"Enjoyed this place so much, easy to paint the things they are teaching you with everything provided.  Will be doing this again. The only thing is that the teacher goes a bit fast other then that really good for any type of  group gatherings."}
{"text":"We called to reserve our seat to get the yelp $19 deal. The women I talked to was very friendly and helpful. This was a fun experience. When class started the sample painting looked hard. Our instructor was amazing! I wish I remember her name, I am sorry. The instructor went step by step and she made it so easy to follow. She would also wait for everyone, so no one is left behind. She also walked around to check on everyone's work and answered their questions right away. My boyfriend is not really into painting but he really liked it. After painting I felt accomplished because I would have never thought I would be able to paint that well. I know it's not perfect but it's ok. The instructor also reassure everyone that it's ok not to be perfect, just have fun. Which is nice because my painting didn't look like hers. We got the salsa and chips, it was ok. I felt like you can get the chips and salsa from the store. But you get refills on soda and water, which made up for the salsa and chips. Also you can order wine here. Don't forget to keep your stamp card, you get your 10th one free. We will love to come back and paint again. Thank you for an amazing night!"}
{"text":"Omg why is this so fun and therapeutic??!?!! And while I enjoy wine I enjoy mimosas more. And FOOD!! This place had both at pur Sunday tulips class and while it is a time commitment of about 2.5 hours, it's a fun way to catch up woth friends and make memories and take home a price of wall art to remember it by. So much fun and the food is decent and brought right to you quickly as you paint and fairly priced. Find a painting you'd like to make on their website checking out the event calendar. For $35 We got unlimited mimosas, all the supplies and instruction. Food was extra cost but again, decently priced. So fun, try it!!"}
{"text":"The employees were very nice and helpful but the food was disgusting. Not to be rude but it was the grossest food I've ever had. I had a mushroom & cheese panini, jalepeno peppers and something else that I've forgotten.   I'd suggest going for a delicious dinner elsewhere if you want to get your paint on. It wasn't really my scene, but others seemed to really enjoy it and there appeared to be a lot of regulars.  If you are expecting an upscale dining and paint experience, you will be disappointed. This is more like being in your artist friends basement and her heating up apps in the microwave. Nothing wrong with that, but FYI."}
{"text":"I came here with two of my girlfriends for a girls night out. After check in we looked over the menu to order food and drinks. I ordered the chipotle panini and a glass of peach sparkling wine. My friends ordered a moscato glass and water. The staff is super friendly and helpful.   V was our instructor and she was super sweet and helped anyone who needed it. I haven't painted since art class in high school and was pretty discouraged by my painting but V helped me out on fixing what needed to be fixed.   Staff came around often to refresh food and drink orders. Last call gets you a half price drink. If you bought an appetizer and entree you got a free dessert.   They stick around to take your picture with your friends with your completed paintings and take pictures throughout the night to put on their Facebook.   Overall a fun experience. Will definitely come back."}
{"text":"This was an absolute blast!  We attended the Ladies Night and it was so much fun to harass the teacher the whole night! A group of us from work attended together and it was truly a great night out, as well as a great bonding experience. I love that they truly walk you through every step of your painting and although he's giving the same instructions to everyone, they all come out differently.   If you're a type A personality, you might have a hard time doing something like this - but just throw caution to the wind and dive in. The end result leaves you feeling like you can accomplish anything and you have a beautiful memoir to hang when you're finished. :D"}
{"text":"great set up...plenty of space...good food, and room to eat it!  well lit, plenty of supplies...LOVE!"}
{"text":"i love both locations...this one is just a bit better, more dryers, better water station...i like checking in at the back of the room, rather than fhe front... great food choices, nice wine, super service...really love this location..."}
{"text":"Came for a birthday party and I was so nervous because I can't paint. Melissa was amazing! She was kind and gave great instruction. The wine and food tasted good as well and I left with a beautiful picture! I'll be back!"}
{"text":"I found out about Design Dine through Instagram, it seemed like a fun date idea so my boyfriend and I booked a reservation. Neither of us are painters & didn't know what to expect but when we got there the instructor Chris was so awesome, he gave step by step instructions, we had so much fun! We got to choose our own seats when we walked in & right away we got to order wine & some appetizers that came in a matter of time. We had an amazing time painting, drinking, & mingling with the people next to us. Definitely would recommend this place."}
{"text":"I'm kind of stuck on the rating I want to give this place.  The interior is stupid nice... The design and set up is nice and room allows you to see whats going on and keep up.  The staff is really friendly and guides you along as you paint. The class is quite long but I liked that, I didn't feel rushed and  was allowed to take my time to paint.  They have drink and food items to purchase, I felt the food was a little bit overpriced, not alot just... a little bit.  The crux of review is that there IS NO WINE !!  I know the license is a work in progress but its called Design and  Wine.. I can't lie, I was looking forward to sippin on something  tasty when I got there.. ehhh.. It was fun, none the less, and I would go back again in a heart  beat, they made me feel like I could really paint ....!!  I just feel the the name is a little, misleading.... thats all.."}
{"text":"I have been here a few times & have always had a wonderful time! Tonight I'm sharing it with my Mom & Girls!! Ornament Night is on!!"}
{"text":"We made reservations two weeks in advance. My friend flew in from California so we could try this place. When we got there they only had one reservation for us. My friend showed them the confirmation numbers but they kept saying WE had made a mistake. How can we have made the mistake when we had our reservation/confirmation numbers? I told them instead of arguing with us just add an easel to the end of the table or set up another table for us. They said they DID NOT have extra easels!!!!  An art place without extra easels???? Unfortunately, I do not remember the names of the managers. One was nice the other was a total idiot.  There are much nicer places like these in town, with better looking ambiance, not so cramped in and way better service."}
{"text":"My sister brought me to Design & Wine on a surprise sister date night.  It was so awesome, we had such a great time. Melissa was the best, she gave easy to follow instructions for completing the painting.  I would love to do this again!!!"}
{"text":"This was actually way better than I expected. First of all, in September, the new Green Valley location was only $19, which I think is a good price. The food/drink is not really a great value, but it's ok. Beers were $5, glasses of wine $7, paninis $7, and desserts $6, I think. I wish they would run specials, like entry for 2 and a bottle of wine for $50 or something....  I really want to be artistic, but I just don't cut it on any creative level, so when I saw the painting we would be copying for the night, I was like, \"no way. That is way too hard!\" The instructor takes you through everything step by step, with what brush to use, how to mix a color, and how and where to apply it, so yours doesn't exactly look like the original, but I thought mine came out pretty good! Good enough to be proud of and hang up in the house!  It's definitely a woman-scene. The night I was there (Wednesday!), every single seat was full except for my friend's because she got sick (about 50 people, total). Of that, only 2 were men. One looked like a boyfriend who came on a date, and one was just a random single old guy who sat next to me.   Overall, it was a fun evening. I won't become a regular, but I might do it again some day."}
{"text":"Went last night using a Groupon and had a great time even though my painting skills are subpar. Aubrey and Bill were great. They were funny and so personable. I had a custom flat bread pizza that was delicious and a yummy glass of Pinot (it possibly helped my painting skills)"}
{"text":"We are waiting out front of the n rainbow location. We've prepaid for the class. We've called, emailed and there has been no response. We are sweating out here waiting and are extremely disappointed."}
{"text":"This place is GRRRRREEEEAAAATTTT!!! Made me into a Carmel-colored Picasso in 3 hours! Great idea for a date night or ladies night! Can't wait to do it again!"}
{"text":"So much fun. My 6 yr old went for one of the kids art classes and she absolutely loved it. They do step by step painting instructions and also they're super friendly. There's a girl that speaks through a head piece microphone, and there was a guy taking care of the food and drinks for everyone. He was pretty much a waiter. My daughter had a lot of fun. I watched and helped whenever my daughter needed any guidance or suggestions, although the girl on the microphone did a great job keeping all the kids interested and involved in what they were doing. They had a full room. It was sold out and from what I have noticed the kids class sell ot pretty quickly. Cant be the $19 price for 2hrs of painting plus cookies and juice. They have a decent menu of foods and appetizers. And also drinks. I got the chips and salsa which were good. The salsa could have been a little more spicy but I'm guessing they dont make it very spicy due to the fact some people cant handle spicy. They took pictures at the end of the class and the girl that did the class made us feel welcomed and we will definitely be going back. Its close to home and a great price plus my daughter loved it. Thanks Design and Dine. Also my husband and I have already mentioned we would like to do a date night there some time soon."}
{"text":"Love this place!! I painted with design and dine 3 times last year and decided to try another painting place. Well they definitely were not as professional and fun as design and dine. anyone  wanting to try another place than this one, don't do it. Brought my boyfriend this past weekend and he loved it as well. Will continue to go back"}
{"text":"I was very disappointed. I had THREE glasses of wine completely spill and break on me. The server was very sorry. I continued with my painting for about a hour and half with a soaking wet back and shorts. The manager said he would take one drink and dessert off my bill. First, let me say I ordered a lot of food and four glasses of wine. When I got the bill I had 8 gasses of wine on my bill and no dessert taken off. When asked the manager said it was too hard to change the bill and thats all they can do. I 100% feel like my bill should have been taken care of."}
{"text":"I went to the new location in Summerlin and the only thing that does not give it 5 stars is that they do not have an alcohol license yet. Since I was a beginner it was refreshing that they make all levels of painters welcome. The food was yummy and the food service was great. I went for my birthday and it was so nice that they give you a Happy Birthday crown, sing you happy birthday, and give you a free dessert. They really know how to make your night special."}
{"text":"I need to come back here one more time to give this place a completely fair assessment.   My friend reserved the place for a private birthday party. 1. She picked the most difficult painting possible 2. I was starving and they do not allow outside food or drinks due to the fact they also have a food option.   Location is easy off the 215 and pecos. Tucked away in a shopping center with CVS and 24 hour fitness.   painting instructions were getting a little muddy in the end and would of liked more detailed instruction. She was losing half of us as we were getting overwhelmed by the difficulty of the painting.   The biggest improvement I would like to see is on their food. The flat bread I ordered - the ingredients were so processed I might as well ordered dominoes, I couldn't eat it because I know it would of caused indigestion. and I was starving- so that didn't help my cause with my experience. Please improve food quality if you are going to hold us hostage 3.5 hours without any other food options allowed - or just skip the novel food idea altogether.   I still prefer the district location due to restaurants around it to eat prior to walking over to the paint session."}
{"text":"The cancellation policy for this place is awful.  It's a nice place and it's fun but I will never spend my money here again.  My sister bought tickets for us and our mom about a week ago.  Now I have an awful cold and was hoping I'd feel better today, but I don't.  So we are just out $35.  Their policy is that you have to cancel within 48 hours.  Their reason- they have people knocking down their doors to paint and they have to turn people away.  The class tonight isn't even full, so there goes that theory.  Painting is not that important.  Doctors offices don't even have 48 hour cancellation policies.  Lesson learned.   One, I will never come here again out of principle.  Two, I will go to Pinot's Palette, which is right down the street, and not reserve our spots too early in advance because life happens!"}
{"text":"This location is by far my favorite I always have the best time with my girlfriends. Painting, wine and laughs.   They walk you through the painting process, skill is not required or needed. The offer a decent collection of sandwiches, appetizers and desserts. The wine is always good and the food runners adorable. My favorite painting I did was a Charlie Brown tree at Christmas time.   Plenty of parking and look for them on Facebook to take advantage of discount codes."}
{"text":"We painted Lightening Bugs on a Saturday night.  The instructor was new and she told us that upfront.  The class seemed to move slow, probably due to this, but it was fun anyway!  However, the class started and ended on time, so she kept us on track.  I've painted there several times and always have a great time. The crowd was especially festive that night with lots of birthday celebrations!  I also love that you can get a nice sandwich and dessert while you paint, and the cost of it, along with beer or wine doesn't break the bank."}
{"text":"This place is definitely fun and the staff is full of energy. I think the point of this is to have fun and a few drinks more than painting a decent picture. Mine and the group I was with came out good but the person teaching you the steps would go too fast and then walk around to check on people and then go to the next step. Kinda hard to keep up but it was still fun. The food could be better and lacked flavor but it wasn't terrible. If I went again I would prefer eating out somewhere before coming here to get better food. The spring rolls were only ok, the chips and salsa was pretty good, the jalapeño and turkey sandwich was only eh. Id like to try a different paint place but I'd come back here too."}
{"text":"I've been here several times by myself and my daughter but this time I decided to take the other kids and hubby to the kids paint day.  We all had a blast! Everyone had a great time and the free juice and cookies were a nice touch for the kids! I'll never get tired of going to Design & Wine! Addicted!"}
{"text":"These guys are just awesome. I have known the owners Avi and Rachel for a few years since 2007. Great human beings to begin with. Very resourceful and genuine people. Big hearts especially for animals. Charity oriented. Funny and caring. They have created a very nice environment for fun and drawing and a little bit of wine. Take your wife and or husband or your gf and have fun getting a drawing lesson. Their food is great as well. I remember Avi when he was thinking about the concept of this business and now it's been created for a few years. Living proof of its existence. Go and have fun at this place. The instructors are super fun as well. If u have a group of people even better. You will not forget this night and take your camera too."}
{"text":"Such an awesome experience! Food, drinks, and entertainment were all great! Melissa was super funny and the staff was so attentive. Would definitely recommend this place! Had so much fun and they made painting so simple with their instructions. I went to the North Rainbow location with my employees and we all had a blast."}
{"text":"I'd like to express what a great time my friends and family here. We were able to hold a private event for my bridal shower, and were given such care and attention. Our teacher showed great excitement to teach, and great patience with such a large party. Food was amazingly delicious, the drink selection pleased everyone. I will recommend this business for birthdays, showers, and other private events. And I will be back for more painting practice."}
{"text":"We all had a great time! It was the perfect girl's night in Vegas. The environment is laid back and fun. It pays to get there early so you can sit close to the front. The instructor was knowledgeable and clearly had a passion for art. Tip! Order the bubbly raspberry wine it's amazing."}
{"text":"Great experiece. Good for beginners, mid and experienced painters,  including kids. Step by step guide to building an awesome painting.  It was a little warms at this location due to AC issues but it was tolerable. Good food and deserts, there was more to drink than wine. The instructor walked around to lend tips, which was helpful and personable.  The servers were pretty good too they kept the food coming. I would definately recommend and go again."}
{"text":"I have now been twice to this location. Once with my husband for a date night and then with my daughter for the kids class. I had a blast both times! My daughter enjoyed painting for the first time and my husband even enjoyed himself and he hates doing things like this.   I would recommend this place to other people looking for either a date night, girls night, friends night out, or even the kids classes with your children!! It was a great experience and we will be returning for more painting fun!!!"}
{"text":"Hi my name is Jackeline Lozano from Henderson,was  awesome,i have fun and was easy, sure I will comeback soon!!!!!!!!!!!!!!! :) :)"}
{"text":"We really enjoyed it. It's the first time I've ever painted in my life and I was very nervous. The instructor was AWESOME. I forget her name. She had a big headband on. I really really liked her. She was positive and patient and very encouraging. I also want to say that the waiter/bartender was great. He was silly and fun and did a great job keeping all our orders straight no matter how many times we asked for something. They were a great team and we are looking forward to going back.  I would only add the small suggestion that I wish they had better seats. No back support was difficult and the seat was a little high and narrow (depth wise).  I also want to say that I was so pleased to find out they have an animal-friendly, plant-based menu. I was very impressed. We are looking forward to doing it again with a bigger group of friends."}
{"text":"A few friends and I came here for my first ever paint and wine experience. Ok so my painting might have ended up terrible and nothing like the example, but the experience was great. We booked our class prior online and were able to score a discount code for some extra savings. They also handed out loyalty cards at the end of the class for future sessions.  Once you get there it's first come first serve seating so it's best to show up 15 mins prior to ensure you can seat your group together. They provide you with the canvas, paint, tools and an apron. The drinks & food isn't included however. Wine runs about $7 a glass and beer was $5. All the food options were vegetarian so if you're a meat eater I recommend an early bite beforehand.  The two people running the studio were great! Super friendly and helpful with any artistic questions or guidance. I'd love to come back here again and hopefully have my artwork turns out a little more appealing next time."}
{"text":"I have been several times now with several different friends. It really makes for a great evening out. You can expect step by step painting instructions while beverages & appetizers are served in a 3 hour session. The staff is friendly and the patrons are usually pretty friendly as well. It really is just a great time."}
{"text":"We had a great time at Design and Wine on Saturday night. There seem to be several of these painting class companies now. I don't think that's a bad thing. I believe there's room in Vegas for all of them to coexist.  I've tried Wine and Canvas twice and I thoroughly enjoyed them. The advantage of Design and Wine (try to keep the names straight) is that they have their own physical location complete with a food and drink menu. And yes, they have their liquor license. As your hosts might tell you, your brushwork just improves when alcohol joins the party.  I can't rate their food because we were still full during the class. I did enjoy a glass of unidentified Merlot. I'm not sure if it improved my artwork, but I walked away fairly happy with the result. Our particular painting turned out to be rather complex. There were many steps involved to reach the end product (definitely more than my previous two pieces). As a result, we felt a little rushed at times. Keep in mind that the class even went half an hour longer than scheduled. I have no complaints, however. The instructor did a fine job of guiding us throughout the evening.  So overall, they get five watercolor stars from me. If I could make a suggestion, it would be to ditch the single TV monitor in the ceiling and have a TV monitor on each side wall instead. Since each row of painters faces one of the two walls, it would be right in front of them."}
{"text":"Very disappointing. I've painted at multiple locations over a dozen times. This is the first time I've been to this location.   First, it's not in Summerlin. I would consider Craig and 95 North Las Vegas.   Second, there was an honest booking mistake where I thought my friend we booking reservations for both of us (she made a same day reservation) but discovered once we arrived that she had only booked 1. There were 2 other women there that had the same issue. Being there were no spots left open, both of us couldn't stay and paint. Our choices were for big of us to leave or one of us to leave while the other painted by herself. Even though they were completely full and had one other person waiting to see if they can get in, no refund was offered.   I understand the 48 hour cancelation policy, however, we offered our 1 spot to the other duo waiting.  Design and Dine would not be out any money and would still be at capacity. Instead, we got a rude employee who came over with an attitude and said \"what's going on here\"?  And then said she was \"too busy to deal with this and we would have to call the office\" then walked away.   We were just trying to make it right due to a scheduling mix up and there was another patron willing to fill the spot. I didn't think it was too much to ask.   I will not return to this location. Perhaps not to this chain being there are a dozen others in the valley (and not all the way in NORTH Las Vegas)."}
{"text":"Who doesn't love a good painting night? You can not only paint but also get drinks and food as well.   On arrival they already have all the paint you'll be using, paintbrushes and canvas set up. Prior to starting you order your drinks and food on a piece of paper they give you. I didn't order any food or drinks. The process in the beginning before painting takes a little long because of everyone putting in their food and drink orders which was not a plus for me.   The painting process was great. Instructor was friendly and taught each step of the way.  There was a period where they took a break for people to eat and drink which I was a bit annoyed since not only me but other people who didn't order anything had nothing else to do but just sit there.   Overall, the painting is not as intimidating as it looks. The instructor is great and the rest of the staff. Great activity to try with friends at least once."}
{"text":"This place was a lot of fun. The good isn't the best but the atmosphere and the people are all very nice. We will definitely be back."}
{"text":"Loving my time with friends and our GREAT instructor Melissa!  What a great opportunity to spend time with friends."}
{"text":"I absolutely love this place!! My friends and I have been here 3 times and each time has been so much fun. The first 2 times they didn't have their liquor license yet but it didn't change the experience for me at all. Each of my paintings came out awesome and I always look forward to going back!  Pricing: a class is 35.00 but there are often specials and discounts running. A class is about 3 hours long so it's pretty cheap for a fun night out   Staff: amazing! The artists and servers are friendly and accommodating. On my most recent visit, I had an injury and they were wonderful about making sure I was comfortable! The artists are great at explaining everything and making sure that everyone is feeling good about what they are doing. Plus they are all super friendly and fun!   Food: they have a decent menu. A lot of \"carb-y\" food so not great for those of us who are carb free but I think it's worth it for a cheat now and then! The cheesecake is delicious and I love the Alfredo toast! The service is quick and the prices are decent.   Drinks: they now have their liquor license so a variety of beer and wine are offered. They also have water, soda and coffee. The drinks come quickly and they offer free refills on non-alcoholic drinks!   I highly recommend this for a night out or private party! Good times and great people!!!!"}
{"text":"This is the second time I go to this place and I love it!   It has 3 locations which makes it very convenient depending on what side of the city you live in. I went to the one in Henderson and this is my second time at this location.   I got a great deal on groupon but I called and they said they price match groupons so that's great. The alcohol is not include in the ticket but they're prices are not bad at all.   They have appetizer, entrees, and desert. Each comes in a set time and drinks are provided through out the class.  The painting class itself is so easy to follow it's fun there good music in the background and the instructor was vey patient.  Definitely a place to go with your girlfriend and even host a private party. Five stars for sure!"}
{"text":"Loved it here! The food is great. Our painting was a little difficult but they made it easy and they turned out perfect."}
{"text":"The paint class itself wasn't too bad. The teacher seemed new but good enough.  The problem was with the food and service. Upon arrival, I was told there would be a free glass of wine. So I ordered a glass, which I didn't plan on doing. The wine was brought to me. I took a couple sips and then the waitress came over and asked if they lady at the door told us we got free wine and we said yes and she told us that that was wrong so great, now we're stuck paying for the wine. So I asked if we got a free dessert and she said yes so I was like great. We filled out our paper and picked a dessert and we were brought the dessert we picked out then they asked if we were allergic to peanuts? Which I'm not, but I don't like them. So then here comes our apparent free birthday dessert of chocolate and peanut butter which I'm not a fan of so I didn't eat. So the bill comes and there's a water bottle charge, which whatever I'll take. But then there's also the wine and the dessert we picked. I'm just pretty upset about that. Definitely dampened my experience to spend so much on food and drinks that I didn't want or was expecting to be free. This experience is making me reconsider coming back versus going to a different company who doesn't have this kind of communication breakdown or cheating system where people order items expecting to not be billed for them then being billed anyways.  My suggestion would be to go to another company that takes you to a restaurant where you'll know exactly what you're getting and still getting to do the painting."}
{"text":"What do you get for your mom who has everything? The lady who says, \"Don't get me anything. I don't need anything.\"   THIS!! My mom and I had so much fun celebrating her birthday here. We were a couple minutes late and were able to jump right in and catch up. SUPER fun. Can't wait to go back!"}
{"text":"Not happy with the customer service of this company    I couldn't go to a class which wasn't full on a weds night and because of their policy wouldn't give a refund or offer another class.  I was in the emergency room and all they could say was sorry.  By not going, I did not stop another or even a group from going that night.    Shame on you customer service should come first always and it seems to be going down the toilet in Las Vegas."}
{"text":"this place is so awesome, i found my hobby. food and drinks are well priced great. staff is awesome. love Jen. she is so encouraging and friendly and hilarious. if you need a girls night out this is the place to go ladies...AAA+++"}
{"text":"Awesome night! Great instructor,  great service,  great wine and good food! Def recommend for girls night out.  Next time going to try couples"}
{"text":"Sit down, relax, have some food and a glass of wine.  Ready for some fun!?  This place is fantastic and the first of its kind.  Often duplicated, never replicated, Design & Wine is the place to be.  Order a drink, take a load off and enjoy yourself.  I'm a terrible painter, I'm not ashamed to say it.  You know what goes great with no artistic ability?  Alcohol, and lots of it.  I enjoyed myself so much and look forward to coming again soon."}
{"text":"My daughter brought this as a gift for me.  I wasn't able to make it so I gave it to my son and his girlfriend (18 yrs old).  They said they had an absolute blast.  Everyone was very nice and accommodating.  The others that attended were engaging and made them feel very comfortable.  They both said they would definitely do it again and that I need to buy another one and use it!"}
{"text":"I attended my first painting class at Design and Wine last week with my 17 year old daughter. As many of you with teenaged daughters know, it is always a challenge to find something they're interested in doing with their mothers! I am artistically challenged, unable to draw stick figures. Jen was an amzing and entertaining instructor who released my inner Van Gogh!  The experience with my daughter was one I will cherish forever as well as our masterpieces! Many thanks to Jen and the staff for a memorable evening. We are planning another event and even taking Nana along with us! Many thanks for offering a fun filled, casino-free atmosphere for locals to enjoy :)"}
{"text":"I've been to several paint parties but this location far exceeded my expectations.  This time I took my adult children and we celebrated the birthday of one. The service was impeccable! As soon as we arrived we were treated like royalty. Everything was explained to us on how to order food & drinks to what to expect. We had a section reserved just for us and the ladies made my son feel soooo special on his bday. They sang Happy Bday, gave him a crown to wear and dessert with a candle.  The place was neat, clean and had cute little touches.  The background music, drinks and instructors made it such an enjoyable experience! I will definitely be going back! Most importantly my kids put there cell phones down and really got into painting.  They said mom, thank you for thinking of such a fun thing to do! We had an awesome experience. Thank you Design & Dine!"}
{"text":"My gf and I were excited to try this place. It's in our neighborhood & seemed like something we'd enjoy. Well, we went in & were told that \"Design AND Wine\" had no liquor license. We wanted the full experience we talked about for several weeks. After all, Nobody notified us in advance that Design AND Wine could serve no wine. We said we'd like to change our reservation for a later date when they had their problems worked out. Even though they were unprepaired to open they were completely unapologetic & unwilling to be flexible or accommodating in any way.  I hate to be a negative reviewer. But they really left me no other option. I hope my gf leaves 1 too. There are way too many entertainment options in LV to accept such poor customer service & attitude."}
{"text":"Had a class reserved, but found out just hours prior to it that my friend who was accompanying me was arriving later than expected. I called and explained the situation and was told that there were no refunds, no credits...period. I wasn't looking for a refund, just a credit to use at a later time. On their website in the FAQ section, the late arrival policy isn't clearly stated, just that 'you may be asked to reschedule for another session,' which to me, sounded as if they were willing to work with you. Anyway, back to the phone call, it was recommended to come, if able, before 7:15pm. We got there at 7:00 and were caught up within minutes. The instructor was wonderful and so were all the 'artists' in the room. Waitstaff was attentive, but food was just mediocre. I'm glad I didn't let their strict no refund/no credit policies get in the way of a good time, sometimes you just have to roll with it..."}
{"text":"We seriously loved this place. This was so much fun for a little mommy night out. The staff was great and so energetic. It was just amazing how the instructor walked us through every stroke and yet every little artist that was in there had different pieces. That is so awesome!! We totally enjoyed ourselves last night and we can't wait to do it again!!"}
{"text":"I went with my sister and some friends. We had so much fun. We are already planning our next visit. We did the sugar skulls and at first it was difficult but our instructor encouraged us it was going to look great in the end."}
{"text":"I had an amazing time at Design and Dine last night! The teacher was very patient. She broke down the painting into easy steps and demonstrated each step. She also provided enough wait time which did not make me feel rushed. It was very easy for me to follow. The teacher was also funny, and we did our painting in laughter. I felt quite calm when I painted. It was therapeutic for me. The waiter at Design and Dine was very friendly and attentive! The food was also great! Design and Dine is a fabulous place to go either by yourself or with a party! Totally loved it!"}
{"text":"I have been to D&W for three painting classes, and each one has been a great time with friends. You can't go wrong with wine and painting! They usually offer discounts on Groupon or through email, making the price even more cost effective! (It's usually $35 for a 3 hour class).  Being a fine artist myself, I would expect some more tips for the unexperienced, but the instruction they do give is sufficient for beginners.  If you want an affordable, good day or night out with friends, co-workers, or family members, this place is geared toward all ages to bring out your creative side!"}
{"text":"Went out with my cousins, our first time and not one of us is a painter, but you wouldn't be able to tell with our finished product.  Great instruction, great atmosphere, good wine (I would suggest more finger foods, like grapes, cheeses, easy foods).  Our instructor was fun, thorough and very encouraging!  The servers doubled as assistants and were equally as encouraging/friendly!!  I'm going back again and will continue to go back with family and friends!  Too much fun!"}
{"text":"Always a great time! I've gone about 15 times and just checked out the new location. Henderson location is so big. We had a great time with the staff as they were very prompt & organized. I went from a 4 person staff for the very first day we painted to two locations and a lot more staff. So happy to see them expand. Rachel and Avi are amazing people. I've had girls nights, date nights and birthdays. This place is suitable for all occasions :)  * BRING BACK THE STUFFED PEARS* ;)"}
{"text":"I've been seriously dying to have a paint night and finally made it happen this past Saturday. I purchased a Groupon and immediately used the voucher for the Tahiti Sunset painting session. Christina was the painting hostess/coordinator and she was awesome! She was very upbeat and made the class exciting! She sang along to the songs and made sure everyone understood her step-by-step instructions. Honestly, I felt like it was a little challenging while painting but I was happy with the results. They serve food and beverages (including beer and wine!) and I loved that concept so much. I would recommend this place to anyone willing to try something new or channel their inner Van Gogh or Picasso. I'm already planning to do this for my birthday!"}
{"text":"Another Groupon steal for $24! Once I seen there was an upcoming class where a sugar skull was going to be painted, I signed up for the class ASAP. Design & Dine has three locations in the valley, and I attended the Las Vegas location on S. Durango in the shopping strip that houses Zaba's and Checkers. I've done maybe 4 painting classes total (not all with Design & Dine), so I'm pretty familiar with these types of classes.   PRO TIP: Get here early! The class started at 6:30PM and I walked in at 6:17PM. It was already really packed and I had to sit towards the back. No worries though because Design & Dine has a TV screen hung up on the ceiling that's focused on the instructor's canvas to allow those in the back to see what's going on.    The instructor leads the class step-by-step to recreate a painting on canvas. For the skull, she gave everyone a lot of leeway for creative expression. For the most part, everyone will walk away with a canvas that's similar to the instructors. I always feel like I'm behind at these classes but eventually catch up. There's a 15 minute break offered to the class but it seemed like most people took this time to continue working on their canvases.  Food and beverages are available to order. The menu was mostly composed of salads, wraps, and sandwiches. For those eating, you kind of have to multi-task and make room on the table where you're painting. The servers take your orders at the beginning of the class and bring out the food during the break.   GOOD TO KNOW: They have a stamp card. The 10th class is free!  Worth a Return Trip? I'm a big fan of group painting classes and the fact that you get to take a piece of art you created home with you at the end of the night. Design & Dine is well organized and the instructor, Jennifer, had a great sense of humor and was easy to follow. Only suggestion I'd make is to lower the volume of the music and stop skipping songs midway. I can only take so much Top 40 guys.  YELP 100 CHALLENGE 2015: #192"}
{"text":"This was a fun place to go. We got there and ordered some food, which was actually pretty good, then sat down and started painting. The teacher was precise and didn't rush anyone. Overall it was a pretty fun place to go."}
{"text":"I loved it, went with 2 girlfriends and we had such a good time ! My painting is not great , but it was a fun experience . The instructor Elsa was great , and Marcos sang a beautiful song to 2 birthday girls ."}
{"text":"Loved the fun atmosphere and the service provided with the food as well as drinks! Highley recomend it."}
{"text":"we had a great time. even my first picture that I painted was good. the second time was better, not as nervous"}
{"text":"Went there for the first time this past weekend. Was expecting a fun experience and quality food and wine.... After all the name is design & wine.  1st -  the wine is horrible.... When I saw the bottle it was one you can buy at walmart for $2.97 a bottle and they charge you $6.00 a glass.  2nd - food was subpar frozen and reheated and stale chips.  3rd - I did not feel like instructor was helpful to everyone -- I needed some guidance and she walked past and said oh no it is good. I wanted a pointer not a comment to appease me.  It was a one time experience and I don't think my sister or I will ever be back."}
{"text":"Like the others below I was disappointed that they didn't have their liquor license when I went, which is why I gave it 4 stars. However they just got their license this week, so I imagine the experience will be even better going forward.  My boyfriend and I took his Mom to one of their classes while she was in town. We arrived right on the hour and found it difficult to find 3 seats together, but he sat next to his Mom, and I was across the isle, not far. I'm sure if we'd showed up a little early seating wouldn't have been a problem so that was our fault. There were several people who weren't there on time, and I thought it was kind that they waited a little bit to get started so those people wouldn't be totally behind.  Our paining was of the 'Welcome to Las Vegas' sign. Apparently this was one of their more difficult classes, which we hadn't known when we booked it, but they made it feel super easy. The instructors were very nice, one lead the class while another walked around and helped. I even got a compliment from one of them on how well I was doing, which was nice because I felt like my painting looked terrible compared to the instructor's.  They were patient and went step by step with simple instructions. Our painting had a lot of measurements but they made it so simple and easy, providing rulers and even paper cups to help with the circles. In the end we were all 3 pleasantly surprised at how good our paintings turned out. It made us feel like we had some real talent (which we don't), but we felt so good with our finished products we are definitely going back again!  The only food we ordered was a pizza, which honestly was not good, but others ordered sandwiches, appetizers, etc. that actually looked amazing. The only thing that could have made our experience better would have been a glass or bottle of wine, but now we have that to look forward to on our next visit!  Can't wait to go back!"}
{"text":"I have to say that design & dine was amazing !!! I had a great experience!!! I wish that the drinks were a little bit more lower in price but overall it was great ... I loved our instructor she was fun and full of energy and she even was singing while she painted!!!"}
{"text":"Always, always a good time. Audrey taught our class Stars & Stripes- a flag with easy details. I learned a quick and easy way to make Stars- better instruction instead of 'winging it' They have a new menu, which I recommend the flatbread. Easy to eat and paint, too! Emma kept our drinks full and food was hot and delicious.  Get the free punch card and get a free class after 9 classes.  They offer monthly specials and pictures scheduled are for novice to master painters. The instructors are always there to provide assistance.  Great place for friends and couples for fun night out!"}
{"text":"Sooooooooooooo much fun!!!! This was a hearts desire if mine wanted to try and do this and was able to last night. My goodness what a blast! The instructor was awesome the wait staff was great. My husband and I had an awesome tune would totally go back again!"}
{"text":"Our first time and it was super fun! The instructor was wonderful and funny, the wait staff was accommodating and the food was actually pretty decent. Painting wasn't as difficult as I thought it would be. Easy to follow due to the wonderful instructor.  Lots of photos taken too! Oh and it was my birthday so I was brought to the front of the class and received a bday pastry with a candle and the class sang Happy Birthday . I definitely recommend taking a class! ! Amanda"}
{"text":"I have been to all three locations and they are all great. Food is fresh and reasonable . They have deals all the time once you start going. So many different choices and creative paintings. The instructors are so friendly and always helpful. It's so fun to do with someone or by yourself."}
{"text":"My first time going tonight ! Let me tell you they have the best customer service and the lady who helped us paint was super fun !!! I would definitely come here again !"}
{"text":"Such a blast every time! Have never been disappointed. Great for all occasions and the food and service is amazing!! All of the painters are awesome but Melissa is exceptional!"}
{"text":"I'd like to give this 5, however the small piano type bench seats with no cushioning were ridiculous. My daughter is pregnant and it was almost unbearable. I'm actually surprised I did not read any other reviews regarding this as I heard and watched more than 15+ people get up numerous times and complained of their backs. This was a 3 hour class and both our backs has been hurting since last saturday. My other complaint is when I've been to other locations, they welcomed your artistic side of personalizing \"ad libbing\"  to your painting. I felt a little annoyed that I was on more than one occasion, corrected if you will, it was a little embarrassing in a room of people. Also it seemed like we were working with old paint, gummy and constantly having to water down, never had that experience. All in all the staff were very friendly, the food was great, fresh salsa yum! The atmosphere was bright and cheerful. Prior to this we scheduled another paint night at the same location for May, hopefully I'll have a chance to leave a better review / experience. I have had nothing but great ones at all the other affiliated locations."}
{"text":"So much fun!! I went here to celebrate my mom's birthday for the low price of $19. Then they hooked her up with a birthday crown and cake!! The painting instructions were relatively easy to follow. It went a little fast, but really everyone has their own painting pace. And there were always moments where we could ask for help from the instructor as she walked around to see how we were doing.  The food tastes really good. The portions are okay. But I'm not gonna give 4 b/c of that. That's silly. Free refills of sodas though!! I had 2 hehe. All in all, it was a really fun time. Got to sit and commune with the random strangers around me! It was a really nice atmosphere and everyone, stranger, server, and teacher alike were so kind and sweet. Needless to say, but I shall continue with it anyway, my mom had an absolutely wonderful time and thoroughly enjoyed her birthday present. (I enjoyed it lots too!!) Got to keep our paintings too    Some Tips:  Food is expensive - trying to save? Eat before you come and just snack or drink soda/beer (free soda refills!!) | Not trying to save? Chow down! The food is amazing. Small proportions for the price doe.  Bring a seat cushion - the seats aren't all too comfortable. Especially if you don't have a lot of meat on your bones  You are going to get paint on you are your hands. They supply aprons, but wear expendable clothes.   Be patient. You're not gonna like your painting right away. Remember, you're not an artist (or maybe you are). In either case, take a deep breath and just keep at it, but don't freak out. It'll turn out nicely. Still think it sucks? Ask for help or for another's opinion. The littlest change can make the biggest difference.   The S Durango location allows 13+ children/teens/young adults  Check in on Yelp!! - great savings to be had  Change your water every now and then once in class  HAVE FUN - Don't come in with a judgey attitude. No one likes a sourpuss. Just sit back, relax, and enjoy~"}
{"text":"My friend and I came here for a girls night out and absolutely loved it! We went on Monday April 14 and painted a palm tree scene. It was a great night with wine and appetizers and girls night socializing.  We loved our paintings and only issue is I wish the pace was a little slower while the instructor showed us what to do since we have never painted. Overall, we will definitely come back!"}
{"text":"This place has a very friendly atmosphere. The instructor was friendly, always smiling and telling jokes. My painting turned out better than I expected.  I would suggest they have bottles of wine a group could purchase rather than keep getting class after glass. Had a fun night painting for a novice painter."}
{"text":"We had a great time!  I really didn't think I'd make a good student!  But I did pretty good!!  I love my painting!  V was an awesome instructor, she has great energy!"}
{"text":"A group of friends and I celebrated a birthday here last night. Chris was our instructor and he was awesome! The service was great and prices are reasonable! Will definitely recommend this place to friends and family!"}
{"text":"What's better than learning how to paint? Getting served wine and food in the process!  I am such a big fan of this whole concept. You get to buy admission to a painting you want to learn how to do and while learning you get to sip on wine and munch down on appetizers, entrees, and desserts.   I received my first ever Design & Wine admission as a gift from my best friend. The actual class started at 6:30, but we arrived at 6:00 thinking it was going to be packed and that all the good seats were going to be taken. Fortunately, it was pretty much empty and we were able to get good seats and reserve some as well. After checking you in, they give you a sheet in which you place your orders. They have appetizers (not too fond of croissants), along with entrees (sandwiches mainly), and desserts. My eyes trailed to the alcohol section and of course me and my girls had to get their moscato. It's super sweet! The instructor even offered a happy hour deal towards the end of class causing us to get another glass of their moscato ;)  The painting lesson itself is pretty easy. They walk you through everything and even lend a hand when needed. They go over the different brushes and what to do if paint is running on your canvas or if you need to change your paint water.  You can go on their website and choose what painting you want to learn and even reserve certain dates for special events. It was my first time going, but will definitely not be my last.  PS: definitely look into their date nights. You and your significant other (or best friend) can work together and paint a big canvas. The painting is usually something long that will take up 2 canvases. One paints the left canvas and the other the right - when put together it becomes one picture."}
{"text":"Absolutely love this place!!! Come here 2 times a month!!!  definitely a good girls night, fresh desserts made in house!!! Erin (the chef) is amazing.!!! I love him!!"}
{"text":"This was a really great experience! The instructor was very helpful and funny. Overall my wife and I had a result good time. I would recommend that you check their website before you go so you know what you will be painting. My wife and I painted the same picture but with our own twist. You can also make group reservations and paint with all of your friends. Definitely going to do this again! Paint night date night with my wife!"}
{"text":"I went here for my birthday with my mom and best friend. We got there early and ordered our drinks and food and mingled a little. The paint class started right on time. The instructor was super nice and fun. They did some fun games and they did some things for me for my birthday. I am glad I tried this class, it was fun and relaxing. I will definitely be back."}
{"text":"I booked a class for my family and myself nearly a month in advance.  We were looking forward to this family night out.  I took the time off work and rushed home to grab my 2 teenage boys for the class.  Upon arriving we were seated, then shortly afterward - a staff member, came to us and said \"I AM GOING TO HAVE TO ASK YOU TO LEAVE\" b/c my son's were minors and it violated their liquor license policy..  He then went on to tell us, \"You can call the owner, I'm sure they will take care of you later.\"  I was beyond shocked, because my sons and I have painted in the past at the Henderson and Las Vegas locations without incident.  They even offer kids classes on weekends and they even have; \"adult classes for 13 year olds and older\" as a disclaimer.  My sons felt the unjust treatment and told me, the host made it seem like we did something wrong to throw us out like that. -- None the less, I spoke to a Christina not too long afterward who was just as rude and unsympatheic -- She offered to reschedule the class at another location and added complimentary food and drinks.  -- Like; this is it.. Take if or leave it..  I reluctantly rescheduled for another class and I'm hoping I won't have to write another bad review for this business.."}
{"text":"This place is AWESOME!!  A good time was had by all!  You walk in, see the picture for the evening and then quickly think to yourself \"Yeah, there is no way that mine will come out even close to that sample\" AND then the waitress comes to take your wine order which helps ease the tension.  By the second glass of wine amongst laughter with friends you miraculously have a painting that resembles the sample and you are rather impressed with yourself!  Book it and do it with your friends!!  You will be glad you did!"}
{"text":"This place was so great! Everyone needs to try design and wine! My girlfriend saw the groupon and wanted to try the place out - I was hesitant being that I am awful at painting - but she convinced me and we made reservations to go. They recommend you arrive early, to get a good seat (we chose one facing the instructor, so we didn't have to keep turning back and forth to watch her instruct). They lay everything out for you, with an apron, painting palette, canvas, and some fun music! It was mainly a \"girls night\" feel, but there were a handful of couples there for date night as well. The instructor did a fabulous job making everyone (who hadn't painted previously) feel comfortable and like they could do it. Only thing: this location doesn't have their liquor license yet - I'm excited for them to finally have it, so I can indulge in some wine at the same time as painting :] such a great time, even for people who have never painted before. And then you get a piece of art to hang on your wall, that you're super proud of because you made it yourself!"}
{"text":"What a fun experience. My friends and I all decided to purchase a recent Groupon for this place for a fun girl's night out. Not being the artistic type, I wasn't super excited about the painting part but I was really excited to spend quality time with my girlfriends.   All the instructors and waiters were amazing. Incredibly friendly and attentive. They supplied us with refills on drinks and paint regularly and were always there to help if we needed assistance on a our painting.   The food options were pretty great as well. Everything is cooked on site and luckily everything tasted good and was reasonably priced as well.  They serve appetizers right away but the entrees don't come out until about an hour and a half into the three hour session. Important to know in case you come here starving like we did, but we learned that the hard way. Still not too bad a wait.  The whole class was fun and entertaining. I feel the only thing that could probably be improved upon is the class size. I think that fact that the class was on the large side made it stall in parts and it was hard to keep everyone on the same page, especially when a lot of the students were imbibing on wine and other spirits.   We still had a blast and look forward to planning another outing here soon. My office is even looking into renting the place out for a private party, which would be a lot of fun."}
{"text":"I planned a night out for myself and my lovely coworkers here. I made sure to reserve our night ahead of time. They tend to fill up quickly.   I found out why soon enough. The staff is amazeballs! Our teacher was funny, patient and eager to praise us for our artistic skills. The food was great, and reasonably priced. The wine selection was good too.   I will be coming back. This place is too much fun to pass by!"}
