{"text":"I was here New Year's Eve with some some friends and it was packed with there being only one table left. We immediately got cups of water, silverware, and menus. The menu has an extensive list of sweets from ice cream all the way to creme brûlée! There is even a page with savoury foods.

 I ordered the Pink Lady which was amazing! I finished it almost immediately only to order another ice cream treat. I forget what it's called but it had chocolate waffer barrels sticking out of it and once again was delicious. 

The bill was relatively cheap and we all had a great time. The staff was very friendly and always ready to take your order."}
{"text":"After reading the negative reviews I had my doubts but I still wanted to come and try it out because the ho fun looked so yummy. And I was right!  Their food quality is high and fresh! For Sure a clean kitchen. We got takeout: 

- mix and match : coconut ho fun , sago, honeydew & coconut sauce, it was SO fresh and delicious!! Delicious
- mango supreme : delicious and fresh
- egg pudding - amazing!! Tastes super fresh  
- seaweed fries : good, but couldn't taste the seaweed
- wasabi fries : loved it! You can taste the wasabi mmmm !



I would for sure come back and have all of these again except for the seaweed fries. The place is super cute and a nice atmosphere. What a yummy experience. Btw, takeout was super fast."}
{"text":"Having read several other reviews, I am highly amused by the trend of being denied water despite multiple requests -- a trend that persisted during our visit today. We, a party of four, asked for water once, and were given two glasses. Fine. We asked again, and were given none. We then went to refill our two glasses ourselves, only to have the waitress apologize to us (???). 

The patchy service extended to the eating utensils. Some items were presented with one utensil, others with none and yet another with four. 

To be fair, service depended heavily on the waiter or waitress. We stayed for over 2 hours, and different waitstaff came in for their shift towards the end of our visit. The service then was excellent. Extremely polite, attentive, and helpful. 

The desserts are innovative and delicious, but on the pricey side. However, if you're looking to try something novel, you're certain to find something here piques your interest here. The coconut ho fan is as odd as it is amazing -- strips of coconut flesh cut the the size and width of rice ho fan. There are combinations of \"soup bases\" (eg. coconut milk, watermelon juice, mango juice) and different toppings. The Taste of Uji is a nice combination: green tea ho fan, red bean, mochi sago and coconut milk. 

The fries are also super crispy and tasty!  

The seating is not that spacious, so I wouldn't recommend coming with a party of larger than 8. The ambiance is great for chatting though. It's casual, the lighting is not too bright, and there is soft Chinese pop music playing in the background."}
{"text":"My friend got the custom. He put mango, mochi and coconut sauce in it. The mango was nice and ripe and the coconut sauce was good but the mochi wasn't really what he expected. It wasn't really mochi and tasted like rice cakes. 

I got the taste of uji which was green tea Ho fun with red bean, mochi and coconut sauce. Again the mochi was not actually mochi. The ho fun didn't taste like green tea but rather like rubber with a slight coconut taste because of the sauce. If it were just the red bean in coconut sauce, I would have enjoyed it more. 

The service was quick and the server was nice but iverall, not a good experience and probably would not go back."}
{"text":"The decor is nice, but you may be seated on short, comfy stools around circular tables if all the tables with seats are taken. Nowhere to put your jacket in that case. 

Putting that aside, I have been here many times and have tried enough on the menu. 
Today, we ordered: 
a green tea molten cake, mango supreme drink and a creme brulee.  
The green tea molten cake hasn't failed us yet. It takes about 15 minutes to prepare. Priced at 7.99? Man, I really need to take note of prices.
Creme brulee (original flavour) closer to $6.25 and was pretty good but a little bit too burnt on top. They also offer a green tea flavour one. - tad pricey for what it was
Mango supreme drink has mango sago, diced mango and pomelo. We've had better here, but that's because the fruits aren't in season. Can't really blame them. Price was $4.99


In the past, we've had egg pudding(the pudding is actually in the egg shell... Pretty cool and then it makes you wonder how they cut it like that haha), ho fun, bbq fries, mochi balls(malteser wrapped in mochi) and many other options. 
My verdict: This place is worth a try even for snacks as they have actual food. You can also make your own bowl of dessert- it's too hard to explain. Sorry, I got to leave you hanging there, so you can go try it. :)"}
{"text":"Not used to sitting on stools to eat on such a small table and I will have a missing order almost every visit. Take out is better."}
{"text":"Have been here a few times. Love the egg dessert thing. We get 2 per person each time. Some of the other desserts are interesting. It's almost always really busy. Service is hit and miss, but usually not bad. I would not recommend the serradura though. It is REALLY dry. 

Great place to hang out after dinner with a few friends though!"}
{"text":"The desserts are okay. Make sure not to use their washroom because there is only one toilet for both male and female customers, so gross. Cash only."}
{"text":"Our last visit here was over a year ago thanks to the many dessert place options in Markham! We arrived around 8pm on a Sunday and the place was empty. DH went in first to check if they're open, lol! Turns out we were just early as by the time we left the place was almost full. 

We had the a) Maltesers mochi - nice, chewy mochi with a Malteser in the centre. 8 on a plate, great for sharing :) The mochi weren't even in size though. b) Black sesame soup - too sweet and too thin :( c) longan and goji berry hot drink - good! d) green tea molten cake - lovely molten centre but the cake itself was on the dry side. It goes well with the vanilla ice-cream and red bean that its served with as the green tea flavour was a little bitter. 

Service was quick. Prices on the high side. Not sure if we'll be back soon unless it's for the specialties like the hor fun and panna cotta."}
{"text":"Definitely a place to go to, I found this online because they open late..till 2am!!!! Yay, it's perfect. I only really got the green tea molten, I love green tea flavour desserts, and this one was more on the bitter side, which I love, makes the green tea all the more real. I was craving sweets, but not too sweet. The ice cream and red bean balanced out the green tea taste, the best part is the oozing out \"lava\". 
The interior is small and cozy. Perfect for late night desserts. 
Green tea molten was $7.99
Egg pudding $1"}
{"text":"Not good. We ordered 4 diff desserts -- 2 mango variation, 1 fruit sago grassjelly, 1 hot tradition sweet soup, as well as a rice. Not good in terms of taste; the sago was not even well cooked. There was not even water served until we requested."}
{"text":"Second time around, the service was SO bad. I think it was because we were in a smaller group of 4. The last time we had 8 in our party, and we were taken care of really well.

I ordered the same thing I had in my previous visit, a Mango Sago Mochi Dessert. The waiter took my order, told me about the $1 surcharge to add Coconut Ho Fun to my dish (which I happily accepted), and retreated to the kitchen. 

Then she returned to let me know that they couldn't add Ho Fun to my dish. I explained to her that I did it the last time around. She proceeds to the kitchen, and returns with a tiny bowl which she tells me she will fill half way with Ho Fun for $2.

Umm, do I want to knowingly get ripped off? No.

Beyond that little hurdle, we literally had to beg for water the entire time we were there. It was a weekday night, and only 3 other tables were occupied. No excuse for the poor service."}
{"text":"WORST ORIENTAL DESSERT HOUSE EVER!

Horrible servers. Asked for water gave us 1 cup for 5 people! They must be drunk
ordered a Maltesers. On the picture it shows in a 2x3 with a chopstick on the side. Expectation was about 1 inch diameters. When it came... it came in a cheap plastic box. not even served on plate. and i'm being generous saying it is 1cm diameter. This has now became the MOST expensive chocolate i've ever ate. $1 for one Maltesers. Garbage!

Horrible Product, Horrible Service. you guys were lucky making my money once."}
{"text":"An awful attempt to copy the Dessert Kitchen franchise in Hong Kong. The service is really bad, you literally have to constantly wave down a server / waitress to order something. Now onto the dessert, everything lacked flavor. The only good thing was the egg pudding but $1 per egg, I question whether that is worth it. Anyways, my friend and I ordered the summer festival and mango fever. Both mango flavor desserts were not sweet, it was ridiculously bland like as if it was almost watered down or something. The jelly (hor fun) in the dessert was somewhat unique in terms of texture but it was suppose to be coconut flavor in which I actually didn't taste any coconut at all. I was super disappointed. I would really suggest that they improve on enriching their flavors. Overall dessert ideas and presentation is great but definitely NEED to step up their game when it comes to service and quality of their food items. I mean... the ratings says a lot..."}
{"text":"I used to go to this place every weekend because they have the best hk style dessert that I've known. But I stopped going to this place because for almost a year they don't have anything new which became boring to go there for dessert after a while. This place is a great idea for dessert tho, it is tidy and clean and most importantly delicious dessert. I recommend their egg pudding, roasted caramel pudding with little jelly within and basically everything else is great! Their lunch menu is pretty nice too, bbq pork with rice is so tasty."}
{"text":"Came here on a Friday night at around 12 am and the place was pretty packed but we got a spot. The little mini stoools were SO...SO... SOOOOOO uncomfortable. I almost fell over a few times ahaha when I tried to move (I'm just a tiny Asian though but imagine if someone who was more normal size sat there..) so we decided to share \"the pink lady\" but when we ordered it, we had to repeat our order THREE TIMES cause the waiter forgot his notepad the first time, then his pen the second time. When it finally arrived, it was a melted slobbery mess :( but whatever we ate it anyway.

But the worst thing that happened was when they have us back bills, a toonie, and ten cent for change....but our bill was just $7...  If their service was amazing I wouldn't have mind giving them the toonie... But since it was not... I kinda got pissed and just threw in my loose change from my wallet and just took everything else with me. 

Like my bf said.... We will never be back at the Shit Kitchen again ;)"}
{"text":"I would like to give this place 3.5, but I can't give half stars :(

Came with a friend because it's her favourite place to eat desserts and chill. Why not? I asked her to order for me, so I guess I can't really complain if the food didn't agree with me. She ordered the refillable rose tea which was really nice, Maltesers which was AWESOME, lava cake which I found a bit bland and undercooked, a cute little egg pudding, and a Snow White for me which was good. It's pretty good to sit and study for awhile but nothing too special.

Bottom line: It's okay, could be better. Try the Maltesers :)"}
{"text":"4 of us came to have some dessert, and found the service really slow. Our desserts all came at different times, one after another ( 10-15 min wait after one arrives) so it was awkward as one person would have their dessert while the rest of us had to wait. 

We ordered the mango roll, original creme brûlée, popcorn chicken, watermelon sago, egg, mochi w/malteasers, and the matcha noodle looking dessert w/coconut milk ( forgot what it was). The only thing that was good was the mango roll, and the creme brûlée. 

The place was not too busy at 10pm so we got a seat fast. It is also a cash only place which we found really inconvenient. 3 stars only because the mango roll an creme brûlée was good and if not, I'd probably only give 2 stars."}
{"text":"The place is very small, and dessert was so-so.  Tried the egg pudding, durian in mango sago dessert, and the home-made jelly noodles - and didn't think it was memorable or particularly delicious.  All were kind of taste-less and expensive!!  The durian dessert was 8.99 plus tax and tip!!  Service is decent, but I don't think it can make up for the expensive and mediocre food.  Just not a place I would re-visit."}
{"text":"So my friend and I drove to a few different dessert places on a Tuesday and there were lineups everywhere. Finally got to this place, got the last available table. They don't have too many of the traditional Chinese desserts, it's more of a fusion style which can be hit or miss. 

We ordered two of the egg pudding in egg shell which is cute and a dollar each so good to try but definitely would not pay more for them. 

The mango molten, which is pudding with minimum mango bits and some mango sauce that pours out like a chocolate molten lava cake. Taste wise is not the best but kind of fun to eat! 

My friend ordered the traditional sesame glutinous balls, it is served in ginger and sugar water (some people might not like) but of the desserts ordered this was my favourite. 

Taste: I've had better
Presentation: most of the stuff is pretty and quite interesting
Seating: more suitable for small parties of 4 or less
Ambiance: it's pretty if you don't mind the light-bulbs strung along some of the booths sticking to your hair (which of course happened to me)."}
{"text":"We were looked for a dessert place last minute, and everything was closed, but LUCKILY this place was open. We were expecting an ice cream or something but we got so many amazing desserts such as the Mochi, chocolate molten, mango molten (AMAZING. highly recomendad if you like mango) and many more."}
{"text":"So a friend recommended to come here for desserts. 

Dessert Kitchen offers a GREAT range of desserts and savoury snacks as well. We ordered the mango rolls and egg pudding. On paper, the mango rolls looked pretty delicious. It reminded me of 'cheong fun' or rice noodle rolls and indeed it was made with that. For me, the mango rolls and the texture of the rice paper didn't seem to work for me. It was thicker than I had imagined. I would be all up for it if it was a mango crepe. 

The egg pudding is as simple as it gets. The pudding is very smooth and delicious and cheap too! I'll try something else next time."}
{"text":"Follwoing a pork filled fiesta UYE hosted by Edwin A. a group of sluggish, stuffed, and mildly uncomfortable yelpers (myself included) venture into Markham a touch further to this relatively new cafe. 

Despite it being a Monday night, the place was slammed with early 20-something's gossiping, laughing, joking and enjoying a general good time. Seemed like a fairly hip spot for us to moan and groan on awkward height seats. 

Surprisingly many of our group took to the selection of Chinese desserts without much hesitation, myself, I opted for a bottomless pot of their jasmine tea to help with rapid digestion and to hopefully alleviate this feeling of impending doom I had. 

The pot came swiftly and presentation was great, teeny tiny tea cups (about the size of a large shot glass) while the see through pot, filled with loose leaf, sat atop a tea light stand to help maintain the teas warmth

A small container of melted liquid honey was served alongside and the cutest little micro whisk for stirring. Cool! Between the tiny tea cups and the baby whisk my pinky finger was perma-poised out and up! (Pinkies Up!)

This place was good and likely somewhere I would return to try some desserts when I don't feel like death. 

Great place to hang out with friends. Come any night open late.

One additional note, due to the high volume of popular restaurants and businesses in this plaza, parking is extremely difficult and congested."}
{"text":"Dessert Kitchen is always packed at night but I do not see what the hype is all about.  Service is very bad here and food itself is nothing to write about.  Also portion is quite small too.  Server never got us water and when our rice came never gave us utensils and we had to ask 3 times before it came.  The dessert we ordered wasn't good at all especially the green tea creme brulee.  The Mango Molten cake was okay but not worth the price. Also got 2 egg pudding $1 each which were okay.  I also got the Summer Featival -Mango ice cream + yogurt + mango $6.50 which they use plain yogurt that was too sour to complaint the mango which I didn't like and it was pretty small."}
{"text":"Food was ok, drink menu is small. There are definitely better dessert houses in Markham and North York that would make this place pale in comparison.

The seating needs work, it's uncomfortable to sit on stools for longer than 30 minutes (yeah I realize I sound really old saying that). Mostly gave it 2 stars because THEY DO NOT ACCEPT CASH! Didn't think Markham still held by those kind of practises, but who on earth carries cash around these days?! We literally used our credit cards to try to take cash out of an ATM because that's how infrequently we take out cash lol."}
{"text":"?????????????? ?? ???????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
???????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????"}
{"text":"Some people would be thrilled to have their kitchen filled with desserts, so I would definitely give their name a thumbs up! Overall, good service with unique desserts makes this kitchen a good choice. 

One thing I do like about this dessert joint is that it is open late, everyday. Sometimes you just want dessert, but places close around 10pm. That makes planning difficult, so Dessert Kitchen definitely has 1 up on the other places around. 

Another plus is that they have very unique options. Not all of them are that great, but it is definitely something that makes this place worth visiting. The dessert noodles are extremely interesting, but don't taste like much. They have some really good snacks, as their fries are super crispy, just the way I like them. The Green Tea Molten Cake was really good, paired with some ice cream and red bean. 

Service is pretty good as the space is very small, but once the tables are filled, it may be quite difficult to get a seat. So if you're looking for some Asian inspired desserts on the more unique side of things, head over!"}
{"text":"It's a decent place to go to for Chinese-style dessert. Fortunately, we arrived just after 9 PM just before the masses arrived and were seated right away. I had their classic creamy mango sago dessert with the pomolo bits. It was a tiny bit more sour than what I'm used to, and I'll chalk it up to less sugar than it's usually made with, which is all good in my opinion. I would come here again just because I'm a sucker for this stuff.

A lot of families bring their very young kids here even well into the night, which is all fine by me, except that it gets annoying when the parents start to let the kids play on their phones with the volume turned on to the max. This distracts the kids enough to let the adults talk without having to entertain their children, I suppose. Ah well, that speaks more to the clientele than the dessert place itself. I would come here again."}
{"text":"Horrible desserts. I ate the mango sago,grass jelly with Mango sauce and mango slices. The mangos were super sour and the plate design was so bad that my food kept falling out when I scooped it. In addition to that the server didn't even know what was good or couldn't offer a recommendation and was speechless at first then said everything was good...."}
{"text":"Been here a few times before, nice cozy place, their desserts and HK style snacks are great. 

Brought some items for takeout this time for a party, called ahead and the order was ready when I arrived, so no complaint there. 

Got some chocolate mochi & egg puddings. I had them before and they tasted great as usual, egg puddings are small and cute in an eggshell. 
Also ordered some mango & mango/durian rolls. I enjoyed the mango ones myself, but I don't eat durian however my families loved the mango/durian rolls.

They accept cash only (no debit either), so make sure you bring cash.
Will definitely be back when I need a quick dessert fixing!

Food: 5/5
Service: 5/5
Price: 4/5"}
{"text":"Ordered the green tea molten cake was over cooked, very disappointed. Mango fever was good."}
{"text":"I  got egg pudding ONLY! Environment is ok but some other product such as rice and others is not worth it. I agree with some people said that u have to ask for water!! Yes, u have to!"}
{"text":"Visited this location after dinner the other day. Wasn't impressed, but I probably had high expectations. I was excited because a couple of friends said that this place had amazing deserts. 

When we arrived, we sat at a corner seat. It wasn't that bad, except that the opening into the kitchen was by my head. It was extremely annoying. 

Wanted to try the assorted fruit in a watermelon shell, but it was $14.00 for it. Maybe I'm cheap, but $14.00 for some cut fruit in a watermelon shell wasn't all that worth it. Went for the mango dessert. Was disappointed. 

Pros.

Egg pudding was unique. It was in an egg shell
Open late

Cons

Seat was crappy, kept getting annoyed by the window into the kitchen
Mango dessert/pudding wasn't very good. 
not impressed with the service."}
{"text":"I'm crazy about this dessert place!

I've had dessert here sit-in twice and take out once. All three times, the desserts were good quality and very tasty. Their ho fun is a must have, same with their egg custard desserts. I would stay away from the fries, though. They are known for desserts anyway!

I always order the mix and match: mango sauce, mango fruit, and ho fun. The coconut ho fun is chewy, crunchy, and delicious. I like the green tea ho fun more, though, because it has a green tea taste but also coconut taste at the same time, as they're made from young coconut. The entire bowl is a good portion, and it's not too heavy or filling at all which makes it a perfect sweet ending to your meal. Tip: avoid the ice cream, it's the low quality kind that comes from a giant tub.

Their egg custards are also very tasty. They are so cute - made in an egg! I could eat 2-3 in one sitting. But if I'm having a dessert like the mix and match too, I will only have one. It's super creamy and yummy!

Their mochi maltesers are very interesting. It's a creative concept - but I think they make their mochi too thick. And it tastes exactly what you'd think it tastes like. Still a cute dessert, I would give it as a unique gift for someone who doesn't come to this area often!

I also tried their seaweed flavour fries once. I would not get it again - although it is only $3.99, they came very hard like they were double fried, and not good at all. Reminded me of Costco fries but harder! And flavouring was so so.

I personally have not encountered their poor service as I've read in other Yelper's reviews. I find that the waitress always brings over stuff when needed, and we always got water without asking."}
{"text":"Came awhile back for a little Chinese dessert snack because the friends were craving it. Dessert Kitchen was also nearby to a restaurant we were eating. 

Price was relatively decent and service was decent. They greeted us in Mandarin but they also understand English. I'm not sure about Cantonese. We sat on the small table with circular chairs... There was a booth available but when we asked to sit in there, apparently it was only for groups of 5 and more. 

The menu was easy to flip through and also had items of matcha, red bean, and mango flavoured items were a few that I remembered. Our food items came relatively fast and it didn't take long. 

I was super full but I only tried the Egg Pudding which were like $1 each! So darn cheap for dessert! It tasted good for $1, very simple and I found the plating very interesting. It's actually in egg shells and it made me wonder how they made it.

My friends also ordered a couple of mango items. One of them is like a molten mango cake with cream; once you break it, the mango flavour comes out. Another of the food item is a rice roll or cheong fan, and they add slices of mangoes in it, along with (what I'm assuming) to be mango drizzle. Tons of mango flavoured items that day!!

So far, I find this place decent. I didn't eat much so can't comment much on the food. The good thing is that they are open late."}
{"text":"Dessert here are amazing loved it! Very crowded so be prepared to be squished. Cash only 

Green tea lava cake - best we've had but to be fair it's also our first time. We loved it. Green tea flavour was strong. Cake was moist and lots of lava goodness

Green tea creme brulee - lacked green tea flavour 

Summer drink - just sprite and juice mixed together nothing special 

Popcorn chicken - big disappointment took so long and it's a small portion. It was oily as well but quite flavourful but wouldn't get it again 

Mango sago lychee with mochi balls - lacked the mango flavour part of the dessert and they forgot the mochi balls make sure to check! They did top it off after we brought it to their attention 

Mango durian roll - finally a roll without whip cream with we think it taste away from flavours from the fruit. It was quite good but really expensive. Something to try once but wouldn't get it away because of the high price point"}
{"text":"Dessert Kitchen is a small restaurant with roughly about 10 small tables.

Food:
We had their egg pudding.  It was \"interesting\", worth a tryfor $1 each.  It has a hint of asian taro flavour to it.

Green tea creme brulee - not very strong green tea taste.. just like any other regular creme brulee.  Would not order again for the price of $6-7 dollars plus tax

Coco lover (icecream served in a martini glass) - chocolate and vanilla icecream with hard cold brownies and some cookie crumbs and chocolate sauce and peanuts...

Atmosphere:
So the restaurant feels very home-run.  They have an open window from the kitchen to the seating area so you can pretty much see how they make the food.  So I pretty much saw how they made the Coco lover from all the store bought materials that I could normally get from no-frills... a regular tub of icecream, plus a chocolate stick from that tin can you received from Christmas, and some chocolate sauce in a squeezable bottle.  I also saw how the lady brought into the back a frozen bag of any regular brand of fries from the outside freezer to the kitchen...

Washroom:
I cannot understand why they have to leave all those detergents and 2 mop buckets in the washroom when across the washroom is a staff area of supplies.  A presentable washroom speaks comfort to customers.  In this day and age, when people eat out not just for the food but also for the experience, the comfort of the washroom is a key factor in that experience.  Keep it presentable and comfortable for the customer!

Bottom line is:
Would I go to this place for dessert again?  Probably not by my choice."}
{"text":"Came here to grab some dessert takeout. It was completely empty on a Sunday evening around 6:30pm. That always make me worry that ingredients are not the freshest and/or stale. Anyway, ordered a box of their maltesers mochi and some egg puddings to go. Glad that neither of the desserts were too sweet but honestly, nothing special. Texture of the egg puddings did indeed feel a bit stale. Wouldn't come again."}
{"text":"The place is cute and cozy

Service - it was very nice and friendly, knows the items available. The speed of the food was perfect timing. The place was half full.
Rice - the rice was a bit too hard and dry, and not enough meat for the portion and price as well (7.99)
Dessert molten cake - it was delicious, I don't like chocolate but I didn't mind this one, the exterior was a but crunchy and inside was spilling out, but the ice cream was not hard/cold enough, it started melting really quick.
Drinks - the cups are on the smaller size but it's nicely made, not too sweet."}
{"text":"Friendly staff and fast service. The egg pudding is not too sweet which is how I like it. I like this place over nearby dessert house because this place makes it just right (natural sweetness and simple, not sugary)."}
{"text":"Went in on a weekday around 10pm, it was 3/4 packed, got a table right away.
Ordered ???? (Serradura) $4.99.  It was disappointing.  The so-called biscuit pieces in between layers were like eating some kind of flavoured powder, and the \"cream\" layer is basically ice-cream.  It was frozen and really hard to scoop in, and it was very dry when chewing.  The ice-cream basically semi-melts in your mouth, and the 'powder' just makes the whole texture really dry.
DEFINITELY WOULD NOT RECOMMEND IT."}
{"text":"Tried this place out on a Wednesday afternoon. Table setting and chairs have it a nice atmosphere. We tried their mango sago, seaweed fries, steam rice roll and sweet dumplings. The mango was pretty good as well as the fries and rice roll but nothing above average. The dumplings were a bit bland. 

Will probably be back to try other items on their menu."}
{"text":"Very disappointing... The pictures look really good but everything was bland. Their \"famous\" egg pudding was super bland and their \"famous\"  coconut ho fun was nothing amazing. The texture was good, chewy but bland. I was so not impressed that I didn't even finish my dessert and I usually finish my desserts. Staff is very friendly. But Limited seats and glass wear. They didn't have enough cups for water. Because of the limited seats I felt like they were kinda rushing us out. Brought us the cheque even before we asked for it. And felt like they kept pacing back and forth our table. Dont think I'll be coming back here."}
{"text":"We've gone here many times and raved about how good the Mango Supreme was .  We are a bit disappointed today as we told our friends and suggested we go there for dessert.  Very disappointing as the sesame rice balls were too doughy and hard and the mango supreme was rancid!  If this was the first time I would definitely not go back.  Not sure if we'll go back now either... :(  Too bad.  It was one of our favourite dessert places!"}
{"text":"Dessert Kitchen has always been the go-to place for me after a dinner out with friends. It's pretty full on weekends in the evening and the restaurant is small, but they have great desserts and a lot of mango flavored treats which are super delish. Their egg pudding (which is really cheap!) and mango rolls are fantastic. 

The only two issues I've really had with this place is that they're always busy when I visit (in the evening on weekends) so on a few occasions the server forgot to ask for our orders or took a while time to get back to us. Also their serving sizes for the ho fun desserts are on the tinier side. But the food is amazing!"}
{"text":"Restaurant was not too busy at 9pm.  Started getting busy around 10.

We had mango pomelo with sago, mango rolls, fried squid balls and popcorn chicken.

Really liked the mango desserts.  The mango rolls came like dim sum rice rolls except the rolls were made of some coconut jelly ingredient.   Tasted great but portion was small.

Squid balls were really good.  Popcorn chicken really is popcorn chicken.  Much smaller nuggets than papa chang.  Lots of chicken skin and very crisp.  Once again, portion smaller than what we are used to.

Overall, taste is very good but portions are small so a little pricey.  Service was good.  Hot item menu (steamed rice) looks interesting.  Next time will go back for dinner and small dessert."}
{"text":"This is an average dessert place. I had the original creme brûlée - had better at other places. 

The portion size of the deserts is on the smaller side. 

The restaurant is small and some of the chairs is not comfortable. 

There are better dessert places out there to spend your money"}
{"text":"I think this place is going out of business soon... 
very disappointing 

Compared to when this first opened, their portions and quality of food were okay... but now they're getting chincy with their portions and costs gone up..I feel like anybody can make watered down coconut/Mango sauce, pea sized mango pieces and put in \"plate\" and call it a dessert.. (it was more like a soup)

Malteser Mochi balls were alright, exactly what they are and tastes like what it sounds like 4/5 for correct advertisement. 

Egg custard shells were very basic/ no distinct taste where u can tell it's their very own recipe. 
3/5 (price was 1/each)

Meh.... would not come back here"}
{"text":"At first I like their egg pudding and mango desserts. Their rice and the desserts look great but their taste was ok hit or miss. H"}
{"text":"Staple asian dessert in Markham, which is a treat. The place is very cute and unfortunately very small. Needless to say, this place is LIT in the summer. Every asian in markham is piling out of those inconvenient doors to dessert kitchen. (the doors are messed.. the first one is push and the 2nd one is pull.. they're too close to each other and they touch when both are open at the same time.. jeez) 

The desserts are okay.. some of them are so good and others are 'wtf, you're charging people for this??' The egg pudding in the egg shells are so cute and definitely yummy, but a dollar each?! Try 50 cents instead. It's definitely not worth a dollar for 2 bites of pudding in an egg. The portions are very small! Definitely 1/4 of a size smaller than most asian desserts. My fave is the mango ho fun.. so filled with mango, sago and their specialty- ho fun! It's this chewy noodle-like thing in the desserts, and I love the texture of it! I really like asian desserts because they're not sweet at all, and most of them are made through fruits. They also have a durian series *___* drooool. Mango durian sago.. oh goooodness! I definitely want to order EVERYTHING. 

Prices are high, considering that everything is so small and can be made so cheaply. Not going to lie, still good though.

+ Service is bad.. when it's busy, they're running around like chickens with a head cut off. Last night, it was only us two in the whole place and the girl working stood behind the counter the entire time, not looking up from her phone. It took us over 4 minutes of raising our hand and saying 'excuse me' and she still couldn't hear us. We ended up having to go up to the counter to pay and apparently I ended up 'scaring' them because I came out of nowhere.. LOL.. not a fan of that!"}
{"text":"Cute desserts, large menu, and good presentation!
I tried a few of their desserts and found them all yummy, and not too sweet.
Place is pretty small, but very cozy. 
I would come back again!"}
{"text":"Place was busy around midnight Saturday. The place is very small seating for 20-25 ppl max. The desserts we ordered were the egg pudding $1 each was really good these are supposedly limited so we got a set of 12 was right on spot loved it. The seaweed fries were simply delicious it was overpriced with the small portion. The dessert we ordered were mango supreme which was OK nothing wow the mangos they had were not in season so it had a sour taste. Also ordered mango sago which was different for me the taste was very fresh but no flavor couldn't taste the mango, green tea or even the watermelon syrup. Overall the desserts didnt wow me much the pricing is a bit higher only thing I'd come back for is the egg pudding !!!"}
{"text":"Great place to come to after work. Very clean and nice contemporary atmosphere. Very few dessert places have durian, his is one of them. I love the homemade dessert ho fun noodle. Very light and not so sweet"}
{"text":"My girlfriend ordered the Mango Supreme with lychee and mochi sago which was mediocre at best. I ordered the Malteser mochi which was disappointing as well. We were the only ones there at 12am on a Saturday night and before we even finished our desserts they started putting up the chairs to close. Food was disappointing and atmosphere was boring. Won't be going back."}
{"text":"Has the purple glutinous rice with coconut milk and it was too watery,not sweet enough. The green tea \"hor fun\" they made was too bitter,maybe their green tea powder was too strong. They do a better job with their snacks than dessert,which I find was a disappointment. I have a sweet tooth, so I gave this place maybe 3 or 4 tries,but their desserts don't WOW me anymore."}
{"text":"This place was so much better when it first opened up. Portions are small, their warm sago dessert was so watered down. I would not order any of the meals again, was not great. Snacks are okay, the cold desserts are pretty good. My personal favorite is the wasabi fries. If I was in the area and craving something sweet, and have cash on me, I would probably go here."}
{"text":"THEY ONLY ACCEPT CASH

Desserts are just meh. The good thing is it's open till late night, so if all your favourite dessert places in Markham have closed for the day, you can come here as your last resort if you need to get some sweet in your system.

We go Green Tea lava cake, Chestnut pudding and egg puddings.
All of them were meh, their desserts are a little low on sugar. The egg pudding looked really fancy but wasn't very tasty, green tea lava cake wasn't bad and chestnut pudding was meh.

We also got Apple Pear tea, which was literally made with Apple and Pear in hot water and added sugar. It was pretty sweet, and non of us liked it.

Service was fine but cash only was a big turn off. Would probably not be returning."}
{"text":"WORST SERVICE EVER!
I went there with 4 other friends. 2 of us were there first. We waited for about 10 mins for our other friends. During this time, the waiter never gave us water. After our other friends arrived and ordered, the waiter still did not bother giving us water. I finally decided to ask for water. I had to ask for water 2 times before I got water. On top of that, he just gave us 4 cups instead of 5! We asked for another cup of water twice and he never gave it to us. Also, the waiter was on his iPhone the whole time texting away. The table beside us came later than us and left earlier than us because they were also pissed off at the lousy service.

Food wise, nothing special, the egg pudding for $1 is pretty good. The hazelnut dessert is a bit dry. Do not get the chicken wings, nothing special about it.

Hopefully you will get a better server than the one we got if you decide to go. Wifi PW is \"desserts\". They will give it to you if you ask them."}
{"text":"Definitely not a place I would recommend if you're looking to have some good comforting Asian dessert. They have a neat little Chinese desserts menu and they all look great in photos, but they definitely do not taste all that great. Our dessert soups tasted very watery and had clumps of starchy bits in as though it wasn't quite comes through or mixed right. The colors are great but tastes quite bland.
Service is good and they are friendly, but there's better Chinese dessert close by. They've got some rough competition :/"}
{"text":"After having a great experience at some other local Markham restaurants, Dessert Kitchen was a little underwhelming. The service was good, but the food left a lot to be desired. We tried a lot of their offerings from the egg pudding, green tea molten cake, and mango desserts, but it just left a lot to be desired. They also have a wide range of teas to choose from as well. The tea shop is small and only has a limited number of tables. Overall, I think there are some better options available."}
{"text":"After karaoke we decided to get some dinner and dessert. Very small food selection only wooden tin rice, mix and match noodles and a some appetizers. It's definitely a dessert place that for sure.

We got the popcorn chicken, chicken wings and a apple fig soup. For dessert, we got the mango molten pudding and egg pudding. The popcorn chicken was a large portion but it was so-so would not recommend. The chicken wings 5 pieces was good. The mango molten was ok, could have been better with more mango flavour. The egg pudding came in the egg shell very unique. But it tasted like regular pudding the only thing special is the presentation.

Overall, it was okay the only thing I would recommend is the chicken wings and mango pudding. I will probably come back again and try the other desserts."}
{"text":"The desserts are pretty good. Green tea molten cake was the best item I tried that night. The rest of the desserts are all solid choices. The staff are super slow and not very attentive. Its a smaller place and can fill up. The SOLE washroom was cluttered with a lot of useless stuff as someone else mentioned. Would come again if no other options available."}
{"text":"The dessert is okay, average like any chinese dessert place. They had stacks of canned mangos out in view of the customers, so that didn't look good, after seeing my mango dessert it was obvious they mix real mangoes with canned mangoes. 
Also wasn't a fan of the seating, only the tables along the walls had back leaning chairs, the row of tables in the middle of the restaurant were stools with no backing, it wasn't very comfortable to sit long."}
{"text":"Soooo many varieties of Durian asian desserts. This alone has me sold! So if you're like me, look no further.

For the 90% of the world that doesn't like durian, this place has wonderful mango desserts too like crepes, panacottas, sagos, and lava cakes. The green tea lava cake is great if you need strong tea flavors in your dessert. Specialty items include green tea noodles and coconut noodles to put in your soupy dessert. 

The cute pudding in the eggs was flavorless and cold - not too creamy/flavorful as it should be. They are $1 per egg but not worth it! 

This place is also open until 2am every day so makes for a great late night eats. Have not tried their savory dim sum style foods but they have them."}
{"text":"Best choice if you are looking for morden hong kog style dessert.  This place do get busy after 8:30pm.  I tried their rice and dessert dish.  Like the instant noodle Lo Mein esp with the dark soy sauce,  the cha siu is very good with the salty egg.  Love thier green tea molten cake,  rich of green tea flavour,  sweetness level is just right.  The malteser wrapped with sticky pudding is also one of the highlight.  I also tried the durian cheese,  is a must try if you like durian.  Its hard to find durian cheese in toronto,  so this is my place for this kind of cheese cake.
Service is good,  staff are friendly,  and clean.  This is my 4th visit already."}
{"text":"So many little desserts to try on the menu. It took me forever to decide what to get but we ended up getting the following:

passion fruit drink $3.99 - okay only
yam and tapioca dessert in sweet coconut milk served cold $4.99 - nice light dessert
creme brule $6.25 - tasted really good and loved the caramelized sugar on top

and finally what can best be described as what look like green noodles with red bean mochi and a sweet coconut milk served cold $5.99 - tasted good when you combine all the individual items into one single spoon full.

Everything tasted good. Even though the portions were a decent size for dessert I found myself wanting more.

The place is on the small side so the tables are placed very close together. Its so close that you are pretty much dining with strangers and hearing all their conversations. Both tables beside us spoke Mandarin so I didn't understand jack all. Too bad cuz I'm pretty sure I would have heard some good stories from the way they were chatting it up."}
{"text":"Another one for today! So came here around 7pm and there's no sitting down blessssss. Although it was my gf and I the service was a meh haha. We ordered the egg pudding which is heavenly, but not worth $1 for one. Then ordered the mango molten and mango fever, which were quite good actually. My mango molten I thought would of been a mango cake but it was pudding with mango chunks. Kind of sad it wasn't actual cake :(. Paying for the bill took a while as the waitress didn't look up for some time.. and one of the people preparing the food came to us instead. Took maybe 3-10 mins to get attention while being the only ones there haha."}
{"text":"Came here on a rainy Tuesday afternoon and was surprised so many people still came for desserts. This place is as popular as people say it is. I ordered rose tea , mango coconut pudding and some malteser mochi balls ( apparently made fresh daily!) The mango coconut pudding was delicious, but the rose tea wasn't. The tea comes with two cups and to add another cup was 0.50 cents. The rose tea looked beautiful , it was in a clear teapot with candle lite underneath to keep the tea warm. However the tea did not have a strong taste of the roses.. After a few pours it was watered down. Malteser mochi balls were affordable and was a nice snack. Will definitely come back to try some other desserts!"}
{"text":"Go-to place for molten lava cakes! Love that they have both chocolate and green tea molten lava cakes. They require 15 mins to prepare but it is worth it. I have also tried some drinks and pudding there but they were nothing special. Service is standard. Only big complaint is cash only!!"}
{"text":"I came back again on a Saturday and was quite disappointed. It was a full restaurant and service was extremely slow. No one was served water. A lot of microwave action in the kitchen.
It'll be nice if they can better staff the restaurant in peak hours."}
{"text":"Nice atmosphere. My friends and I went on a Monday around 2 pm so there was no one there. 
We ordered: 
Egg pudding (soo good!)
Wasabi Fries (fries with powered wasabi salt. Delicious if you like that spice up in your nose wasabi taste)
Pink Lady (strawberry icecream in coconut milk with honeydew and tapioca) 
???? mango tapioca with sago 
And beef balls 

Everything we ordered was pretty good. I would definetly recommend those things on the menu. Especially egg pudding!"}
{"text":"Tried the Taro panna cotta with Green tea ice cream, each layer taste fine, but doesn't match with each other, so i would not try this anymore"}
{"text":"Dessert Kitchen is a dessert place and one plus is that it's open fairly late.  They have a reasonably large menu with various desserts and drinks.  I wouldn't go here for a meal though.

They get points for presentation.  My girlfriend got a grape dessert with ice cream, cream, cheerios, chocolate sauce and jelly.  It looked absolutely amazing, but she was very unimpressed with how the grape sauce on the bottom tasted with the cream with the grapes.  I got rice noodle rolls and it was very dry and not squishy at all.  The sauces also didn't go well with it at all.

My girlfriend got a drink that she was super excited about but they told her they didn't have any.  She ended up with a float (ice cream plus coke) but she didn't finish it.

I'd honestly skip this place if you know of a better place to get dessert.  It's really not worth it here."}
{"text":"You know it's a bad sign when you come here at night and you're the only customer.

It was dead quiet inside, with some soothing song playing in the back. It really felt more like nap time for me, rather than dessert time. Service here is nothing more than what you would expect from a Chinese operated store - minimal, bland, no small talk. We took a bit of our time to go through the menu. Decent amount of choices, but nothing stood out, and everything was so overpriced. 

We got the Egg desserts that came in the egg shells, and a ice-cream sago bowl. The sago bowl came shortly. It looked .. unamused, something that took no skill to put together and serve it to a table. The taste was mediocre, there was nothing from the bowl of sweetness that would make me want to go back. The egg tarts arrived, oh boy were they mini and disappointing too. 

All in all, it was really a spontaneous visit and I would not be back. It's overpriced, lack of uniqueness, and there are many options within a 10 minute drive from this location."}
{"text":"Been a regular at this dessert place since they were at the other location. 

There's a huge selection of desserts here. They range from a set menu to customizable dessert. I love their crème Brule here. Its creamy and not too sweet. But it's nothing too special compared to other places. I've tried the Green Tea molten cake, it was okay. I'm not a huge fan of lava cakes. Their egg pudding is unique but I don't really like it here. It's more solid than soft. 
I've also tried their mango fever with coconut hor fun. This is a unique dessert, probably only found at this dessert place. The coconut hor fun is chewy. The mango syrup tastes like bottle mango syrup but they add fresh mangos to this dessert. 

Snowy festival - was probably my favourite dessert there. There strawberry ice cream tasted really good. The golden submarine is pretty good too. I like how the bananas are caramelized. My friends like getting the summer festival or the mango supreme but I don't like the taste of the mango syrup.  

Mango golden rolls tasted really chewy and was topped with again fake mango aka bottled mango syrup. Didn't really like this. 

If you're not craving dessert, they have appetizers and some dishes available for you to choose from. I've tried their pork steam rice. It came in a cute wooden thermal pot. It was pretty good, something comparable to the ones you get at dim sum restaurants. They also have customizable rice or noodle dishes which are pretty tasty too! 

Overall, one of my favorite dessert places in markham. 

This place is cash only!"}
{"text":"My friends and I had a real good laugh coming here for desserts. Their food quality plummeted and no effort was evident in plating/presentation. It's as if the kitchen didn't even bother trying. Maybe they changed owners or staff? Because the portions downsized and the use of ingredients was lousy, I found their menu overpriced. Another red flag for me was the slow and inattentive service. Water refill took forever and my friend's water never came until 40 minutes later (though we asked the server twice). That's a big no no for me!

I'll let the pictures speak for itself. Overall it was an unpleasant experience this time but I'm willing to give my old favourites-chocolate mochi and egg pudding- another try."}
{"text":"It's Monday and Tendou is closed (ugh!)... we have decided to give Dessert Kitchen another try since my last visit was 3 years ago.

I really enjoyed the barley drink (???) on their seasonal menu, even though it was $3.99. It was a touch of home away from home for me... my grandma used to always make this :)

But other than that, the fish siu mai was quite disappointing. They were chewy like bubble gum and ridiculously tiny compared to the blown up size on the menu :/ It looked like the microwavable ones you get at 7-11.

Baked taro sago dessert was SO dry. Zomg, why you so dry D: What happened to the creaminess I had 3 years ago! We did not enjoyed that at all :(

Service was great in the beginning but then it turned sucky because our initial server went to make Malteser mochis. We were left with dudette who seemed to be annoyed about something.

Yeaaa... no."}
{"text":"pretty nice place, the desserts TASTE okay but some of their presentation is pretty bad. (take a look at a couple of the pictures).

also, there is only one washroom for both males and females, which surprisingly wasn't that bad. I guess it works because it's a pretty small place.

to be honest I don't think it was worth the high price. next time I will probably come to just have a bunch of egg puddings. they're cute and they're a dollar each and yummy. :D"}
{"text":"Pretty good dessert place. Everything on the menu called out to me. I give it one less star because I've had better sago/mango at other places.

Definitely try to egg pudding! It's only $1 for one so don't hesitate to try something different if you haven't before ! It's pretty cool too!

Had to try the mango molten $5.99 because who wouldn't?! Mango flows out of the damn dessert...so yes of course I would. The outside jelly was not so sweet but when paired with the mango liquid, it was pretty good! I probably wouldn't order it again after the initial phase of OH WOW! But definitely not bad at all. 

Did the \"make your own\" dessert. Chose grass jelly and sago as my base (extra $1 for more than one base, fruit or sauce), mango as my fruit and mango sauce. All for $4.99 + $1 for extra base. It was deliciously sweet. Definitely not enough grass jelly (it was like a spoonful) but at least the mango was sweet even if it is winter. I've had better, but this is definitely a dessert to order when you're there.

Small restaurant so I can see it getting busy at night on the weekends ... Tonight was slow just us and another couple. Staff is friendly and prompt. Would come back!"}
{"text":"CASH ONLY

I really liked the Taro Panna Cotta that came with il green tea ice cream and there are lots of options on the menu

Didnt care for the egg pudding but it is cute and only $1 so why not? Do it for the gram, amiright?!

DO NOT order the green tea molten lava cake or you will be terribly disappointed. There aint nothing flowing out of it....just a dry green cake."}
{"text":"came by yesterday for around 2:30pm or so as a group of 4. we ordered quite a bit actually. 4 egg puddings. mango supreme w/ lychee and mochi sago, mango supreme w/ durian, tong yuen with durian, steam rice rolls, and i hadn't had any food all day so i ordered chicken w/ instant noodle and curry sauce.

the desserts were good. i really like durian so i have no issues with that. not as impressed with the food though, but to be fair, it's a dessert place? 

i was just extremely hungry. there's not much too the steamed rice rolls, it's pretty much what you expect, but the portion was pretty small considering the price you pay.
the meal i ordered was interesting. first we ordered fries, but they couldn't make any fried food because the pilot light on the deep dryers were out. that's about half the food options. so i decided to try my luck with rice. rice was being made at that time so the server advised me that it would b at least 20 minutes before i'd be able to get my rice dish so i declined that as i was starving. i ended up getting the instant noodle dish as mentioned above. for the sauce i asked about the swiss sauce. server said it was salty so i decided to go with curry. surprise! curry was also salty. instant noodles are cooked but are then drained and served dry as well. the chicken was a bit overcooked, some parts tasted like a jerky. it was just dry and salty, i would've preferred it being served with soup.

if i rated based on desserts alone, i'd maybe give it a 4, for food i'd give it 2 so i will balance my review out at 3."}
{"text":"I've been here multiple times and if it wasn't for their one dessert, I probably wouldn't come here often. I finally decided to stop being lazy and do the review; I visited on a Friday night with some friends. I, personally, had the following:

1. Pork and Preserved Egg Steamed Rice ($7.99) - it came in a cute rice container, so props to them for their presentation. The actual food, on the other hand, is a different story. There were 4 pieces of pork in there and if it wasn't fatty, it was dry, so they were really hard to chew. I've had preserved eggs before and I know how salty they can be, but these seemed saltier than the usual. I ate it with rice and even then, I had to drink water almost immediately. They have a few pieces of lettuce and they pour soy sauce over the rice (albeit unevenly). If you come here for dinner, this would not fill you up, but it's a decent size for a late night snack; nonetheless, thoroughly unimpressed.

2. Matcha Molten Cake ($7.99) - this is the dessert that I come here for! It's a matcha lava cake with vanilla ice cream and some red beans. I loved this for its strong and bitter matcha taste. Since my initial visits, the matcha has gotten weaker, but still good. The ice cream and red beans are way too sweet in my opinion, but I guess that helps to balance it out. There was a visit where the lava was non-existent and there were other visits where the lava was perfect! Weird, eh?

The service was mediocre. Inattentive, unknowledgeable of the availability of their items first-hand, and our particular server wasn't very patient when we were ordering. We were a table of six and our items came out one by one, very slowly. It was 30 minutes before the entire table got their desserts and the first item that came out had already gotten cold. 

All in all, I'm quite disappointed with this place. Service, food, CASH ONLY... if it wasn't for that matcha cake, I would steer clear of this place. So that's that. Give it a try if you really want to, specifically if you like matcha, but otherwise, I would go across the way for tendou matcha & desserts instead."}
{"text":"This place has many fusion and classic Chinese desserts 
This place is a great place to come for a nice health hot drink that will make you feel better, been here more than once I can recommend the mango fever for those who really really love mango and for those who love cake or taro they got that too! Seating is somewhat limited but they also have take-out if needed! 
If you haven't tried this place you should !"}
{"text":"I've been coming regularly to Dessert Kitchen for many years, but mainly because of the restaurant's close location to my home.

I like bringing friends to eat at Dessert Kitchen because there aren't a lot of people there. It's a quiet, small place with lots of privacy. 
 
Usually, there is only one person who works at the place, which makes service incredibly slow. Today I was lucky to go while the man was working, because he's very friendly, and cheerful. Plus, he makes the desserts/food two at a time. The other woman working there is grouchy, and makes the desserts super slowly. Today my group had to wait approximately 40mins for 6 dishes. 

The desserts place offers a lot of options on their menu, and there are a lot of 
mix 'n match choices. Most of the food items are mediocre, and a little expensive for the price, but they usually come out looking stunning. Sure to wow. I have a few favorites which include the Yakult Pannacotta, and \"Joy of the Party\"(Icecream Sundae). They also serve Hong Kong steamed rolls which can be found in any Hong Kong restaurant, but are still very good, and worth a try if you've never had them before."}
{"text":"Small cozy cafe great for small groups and somewhat satisfy that sweet tooth. Here's the verdict for the items I've tried:

- Chocolate Molten Cake: The BEST molten cake I've had yet! The cake is not overly sweet which nicely compliments the vanilla ice. Cake is soft and not too moist. A spoonful of cake covered in molten goo and some ice cream is a party in your mouth!

- Egg Pudding: $1 each served in an egg shell. It's alright. Not too memerable in taste. Cute dessert though.

- Mango Golden Rolls: My friend was not able to describe the texture of these rolls and he was right. I couldn't even describe its texture as it was very unique. It's not starchy or chewy.. It's similar to that of lychee jelly but not as soft. Interesting texture and I enjoyed this quite much.

- Black Temptation: A bowl of goodies containing grass jelly, lychee jelly, coconut milk and chocolate ice cream. Very similar to the bowls you'd get at Sugar Marmalade. It sounds like what it tastes. Not overly sweet either.

- Cold Chicken Wings: Seasoned with vinegar and red chili peppers. Not much meat on these wings but, the flavour makes up for it. A very traditional dish where its flavour is difficult to find elsewhere. 

- Brown Sugar Ginger Milk: Tastes like what it sounds. Literally ginger milk with brown sugar in it. Served hot, perfect for cold winter days or something to heal a sick body.

Overall, it's an okay place to chitchat with a small group of friends or with a date over some sweets."}
{"text":"Desert Kitchen is a place that I don't go often and if I do, its because its the only thing opened. Don't get me wrong, its not bad, but not outstanding either. 

The only thing I get here is the the (pick your own) dessert option they have. You get to pick the soup base, sago, rice balls, fruit, ice cream, etc. I always get mango soup, rice balls, mango pieces. If you've ever been to ???Hui Lau Shan in Asian, its basically the mango dessert that they have. 

It's a decent place for modern Chinese desserts, most items are fairly priced and the seating area could possibly fit 20 -30 people?"}
{"text":"The service is good and I appreciate the effort to come up with more unique desserts like the maltesers wrapped in mochi and the green tea \"fettucine\" noodles, but the quality is just not there. I recently had one of the mango desserts and each element was lacking - the ice cream was very artificially flavoured, the mango pieces were tiny and not fresh, and the lychee pieces were hard. Ber"}
{"text":"Cozy, cute little desserts shop very reminiscent of those pristine, visually appealing Taiwanese cafés geared for lovey-dovey teen couples and giggle hoards of high schoolers. Tucked between two shops in a Markham strip mall on Highway 7, Dessert Kitchen lives up to the expectations created by its own name. The menu offers both desserts and light Taiwanese-inspired meals, but the true stars are obviously the sweets. 

The extensive desserts offering ranges from green tea melts to sponge minicakes to durian (!!!) specials, but many come to DK for the egg pudding. At $1 an egg, filled with a pudding that tastes like egg-tart, there is no guilt in this sweet palate pleasure. 6 egg puddings are enough for most appetites! The puddings are served in the eggshells--amazing presentation.

For the most picky of us, there is a build-your-own-dessert section, that allows customers to combine yogurt or ice cream with the toppings and the syrup of their choice. 

Service is quick and polite. Note: CASH ONLY.

Would come back and order a dozen of these egg puddings, if it wasn't for the long commute fr downtown Toronto. There is public transit that stops close to the mall--Markham's VIA bus system."}
{"text":"Back here again with a group of Yelpers for post UYE event.

Service was surprisingly good and polite. A huge improvement compare to my last visit!

I tried 2 of their desserts and some of their tea. The desserts was ok, I expected to be a little better as it is call Dessert Kitchen?!

Not a good place if you want to hang out and chill a little with your friends as it could be busy with people waiting for tables... I don't mind coming here again if there is no queue for a table."}
{"text":"Pros: ambiance is great for small gatherings (4 people) and dates, the red bean sago and egg pudding was great! I also enjoyed the seaweed French fries! 
Cons: I wanted to try the green tea molten lava cake so badly but sadly, it was disappointing. You can taste the powder of the matcha and the Snow White princess drink was misleading. It's really a hit or miss, some things were so good others weren't. The service isn't good, they take their time and they don't seem pleased to serve. 
Overall, I would still go back for a bowl of red bean sago and good company!"}
{"text":"This place has a nice atmosphere and good service. It is quite small and cozy. I ordered a Mango Supreme Drink. I was a bit disappointed because it had so much ice cubes in it. I thought it was pretty unique that it had some pomelo bits in it but that wasn't enough to justify the price ($4.99) and small portions. 

I might give this place another try because they had a nice little make your own dessert where you choose 3 items (a base, a fruit, and a sauce). I was considering getting grass jelly base with mango and mango sauce."}
{"text":"Came here for dessert of course but they do have regular food to eat which I will come back and try out.

Tried the mochi Maltesers and the matcha lava cake.  Both were super yummy since it wasn't too sweet.

I would come back to try the other desserts for sure."}
{"text":"i tried this dessert place yesterday with my friend. We've heard mixed reviews about it, but wanted to try it, nonetheless. It wasn't too busy when we got there around 845pm. By the time we left though, around 10:30pm, there were tons of people. 
The place is really small, with only small tables for what seems like a max of 4. One table could probably sit 6 people, but they would be really squished.

My friend and I ordered the egg pudding, malteser mochi and pink lady.

Egg pudding was nice and creamy. The presentation was really nice and unique. They served the pudding in an egg shell. It seems a bit pricey though, $1 for one. The portion was super small, literally one bite and it's all done!

Malteser mochi wasn't really special. Seemed quite expensive for the amount of mochi. The mochi is really small, also one bite and it's finished. Basically a mochi wrapped around a malteser chocolate. The mochi tasted very fresh, and malteser was...welll, a malteser. They served it in a take out container..I guess it's for people who can't finish it and want to take it home? 

The pink lady was interesting. Not very sweet. It had strawberry ice cream (I wonder if it's home made..very strong strawberry taste to it), tapioca, mochi, coconut milk and honeydew. I couldn't really taste the coconut milk. This dessert wasn't as sweet as I thought it'd be, but it was good to try it. I think if I ever go back, I might just get the strawberry ice cream alone. hahaha."}
{"text":"Service: After reading reviews, I didn't have much expectation for their service. However, it was not really bad. When we asked for bowls, we got bowls without further asking. We didnt ask for water, so didnt have that problem to deal with. 

Food: We ordered a lot- Swiss Chicken Wings, 2 ice cream sundaes, mango fever, create your own, egg pudding and a BBQ pork rice with salty duck egg
The chicken wings werent sweet at all. They should rename that dish to soya sauce chicken. Mango fever had coconut ho fun in mango sauce with mango and sago. The coconut ho fun didnt seem fresh and wasn't very strong in coconut. The mango sauce and sago was good. Egg pudding was good.  Other things can't really comment since I didnt eat them but my friends seemed to be pleased.

Recommendations: Definitely the egg pudding! Go on a rainy night so not many people. 

Overall: Wasn't extremely pleased with the coconut ho fun. May potentially come back to try the mango rice noodle."}
{"text":"TLDR: Yummy desserts, but nothing you can't make at home (unless you really can't cook)! 

Came here on a Friday night around 11PM. It's great because we were looking for dessert places, and this was one that was opened till 2AM! It's a cute, small little dessert boutique (home run) with maybe 10 tables at most. They also do savoury foods - kind of like a build it your own menu (rice, meat, veggies). But we came for the desserts!! 

My friend and I ordered a couple items - green tea creme brûlée, molten mango, coconut taro sago, pink lady (drink: sprite and strawberry ice tea), and egg custard in the egg ($1 each). 

Everything was pretty standard, prices were less than many dessert places, but not by much. Service was nice :)"}
