{"text":"This is for the patio. It may be up there with the black bull for me. The hostess was -eh- about seating but everything else was great."}
{"text":"Okay, I loved it.  
We went for brunch on Easter Sunday, and enjoyed not only great food but also amazing service. And I don't think it was just because it was a holiday.

For many reasons [vegetarian, health, blah blah blah] I decided to have the egg whites with fresh fruit and cottage cheese from the \"wellness\" section of the menu.
It sounds pretty straightforward - yes, boring - but whoa! The eggs were sooo tasty! Seriously I have never had egg whites this flavourful.  
The fruit - blackberries, strawberries, orange and a garnish of physalis - was juicy and sweet, with a light layer of low fat cottage cheese underneath.  

And a real bonus as far as I'm concerned: the lovely hot coffee was refilled time and again.  I always appreciate that.

My dining companions feasted on eggs Benedict Royale with generous portions of smoked salmon; the lobster and shrimp omelette; and an open-faced omelette covered with prosciutto.

With side salads, lightly toasted bread for the table and coffee all around,
our bill came in at under $65 for four, and that's including tax.
Really.

p.s. here we are, eight hours later, saying \"mmmm, that was a nice lunch!\"

=========

The first time I was at Destingo, I had the toasted farro salad with mushrooms, tomato, zucchini, feta and more, tossed in a lemon vinaigrette.  It was so delicious, I ended up hunting all over the city to find farro so I could make it myself.

Simple or complicated, the food that I've had at Destingo has been outstanding.
The service was attentive, thoughtful and smooth.
And their patio, right on Queen, looks perfect for people-watching.  
Next time."}
{"text":"I came here for summerlicious and it was a 15 dollar set lunch menu. Now for 15 dollars for a 3 course i was not expecting big portions or super high quality food but boy was i wrong. Everything that we had tasted amazing! I didnt even eat my entree and i had to pack it up because the mussels i had as an appetizer were huge. The service was also really great. They kinda tried pushing the drink menu which was a little uncomfortable but besides that i had a lovely time. The patio is great for people watching also due to it being right on queen st."}
{"text":"Walked by this restaurant many times and today thought we would stop in and have some food.  What a mistake!!!  We ordered the standard breakfast and such disappointment.  The food arrived cold, our plates were mixed up and the portions were the smallest I have ever seen in my life. When the waitress came by to ask us how we liked our lunch, we said we didn't, the only good thing was the beer. She offered free dessert, but we weren't interested so asked if she could give us a discount and she took one of the meals off of our bill.  We were pleased with that, but doubt will ever go back. There are way too many better restaurants in the neighbourhood."}
{"text":"Im probably not going back to this restaurant. I went here for a summerlicious dinner for a friend's bday party. The waiter informed us that there are out of the apple struddle  only to tell us an hour later that they werent out. They were out of the tiramisu instead. The entire time we were there workers from the servers to the chefs in the kitchen kept dropping bottles, glasses and plates. Our server also took forever to get our orders which meant that it took them forever to make the food. The food overall was really good except for the fact that the size of the ice cream in the apple struddle was very small. It wasnt even vanilla ice cream like it said in the menu. Not going back :/"}
{"text":"2.5/5! Cute place, decent size patio and it is good for large groups. Overall the ambiance and service was good but there are definitely better food options in toronto. If you eat there I recommend the Shrimp Burger or french toast."}
{"text":"We stopped here because the patio looked pretty cool.
Service was poor and they ran out of pretty much everything on the menu.
We will never go back again. Not even on a really sunny day!"}
{"text":"I had Saturday brunch at Destingo with a few girlfriends because it is in my neighborhood and I always pass by. The space is really nice and they have a huge patio outside when weather permits. The girls that work there are really friendly, however, the place it still a bit disorganized. We had to ask them several times to bring us something because they kept forgetting and it was not super busy on this day. My eggs benedict had good flavors but was warm not hot. We shared desserts at the end and they were way too small for 10 bucks a pop. If this place worked out a few kinks it is capable of being GREAT because their space and location is ideal. I might be back again in the hopes that they will be more organized"}
{"text":"Tldr; wtf come and eat!

We were the only party seated here on a Thursday night, which is silly! You, the reader, should be here! 

Stellar items were the prosciutto di bufala appetizer, the gnocchi (very fresh and perfectly cooked), vitello destingo (veal with baby scallops, mushrooms and rose sauce) and tiramisu (omg so good). They were delicious, and we were able to pair them well with their extensive wine list. We also had the beef carpaccio, but it wasn't so amazing, though once I had it with the buffalo cheese from the prosciutto dish, it worked much better :)

Great and attentive service.

My only complaint is that some of the wood tables are a bit slanted, so mind your drinks!"}
{"text":"I've been to Destingo twice so far. I live in the area and love being able to just walk down the street to the restaurant and enjoy it's large patio. 

The food: First time I came, I had the sangria and also the mushroom pappardelle. I was underwhelmed by the dish. I was expecting more mushrooms and more DIFFERENT kinds of mushroom, but it was JUST brown button mushrooms. Nothing special. 

The 2nd time I came, I had brunch. I had the margarita fritata and an americano. The coffee tasted weak and watery. And the fritata was so mediocre, I can make better. The basil and the mozzarella didn't taste fresh either. 

I'm so disappointed that the food wasn't better. The location of the restaurant is great, as is the space that they have. I would much rather wait in a long line for Terroni than come here again."}
{"text":"Horrible management!

Booked a reservation for July 12th, and drove all the way to this place to try it, and the doors were locked! Nothing but a sign that said \"We are closed today, july 8th due to water issue.\" 

This just left me feeling annoyed.

1. Came here for nothing
2. It was 4 days past the \"water issue\", that was plenty of time for the managers or staff to call  guests that had reservations and inform them."}
{"text":"How could you not want to sit and have a drink to people watch and look like the cool Queen Street West goer at Destingo? Well if you thought just that then this place is for you. If you're serious about your food and know your Italian cuisine quite well then look else where....perhaps something a little more authentic like, Terroni just across the street. 
The real estate is incredible, but unfortunately for Destingo, that's it. The name is actually ironic, for me, as it means...destine to go...yet I don't think it's destine to succeed, not with that quality of food. I was extremely disappointed as I had watched this place transform into what I hoped to be a go to spot for me in my neighbourhood, yet it just did not meet my expectations at all. I am Italian and have a great appreciation for Italian food, especially that its been the menu of my life and consider Terroni Toronto's staple for Italian food. Too bad for Destingo, Terroni is right across the street from them and Terroni's menu, quality of food and service, is without a doubt authentic Italian.  
I had started with the caprese salad, and believe me it's hard to screw up caprese   salad, but the oil, presentation and quality of cheese and tomatoes were horrible. No love in that dish at all.
Secondi, I had the risotto de mare....oh boy. That was a miss altogether. I'm not sure where they inherited that recipe for the sugo, but it tasted like Classico from the glass jar (I'm sorry, but it did)
I did not dare to venture for the dessert. I was so turned off my friends and I had to leave. We all left with half full plates for the waitress to collect, with no doggy bags. (I did pick out the fish in my dish to eat as I do not like wasting once live food) Although I did feel like that dish was a great insult to the fish that had been cooked in it, very disappointing.
I did have high expectations for this spot as the online menu looked very appealing and appetizing and the patio is (again) just beautiful. Come the fall and winter when the biggest attraction is their patio and food doesn't meet the standards, I don't think they have a chance. I hope Monika reads the reviews and really kicks it up a notch to compete with the other great Italian resto spots in the near neighbourhoods, otherwise she doesn't have a chance with her current dishes.
Best of luck Destingo!"}
{"text":"I came here for Summerlicious lunch with 2 other friends and the experience was okay, but not amazing. It was pretty quiet for a Thursday lunch, with more the half the restaurant empty, but the food took quite a while to come out (between the appetizer and main, it took around 35 minutes...).

For the starter, I had the mussels, and I was surprisingly pleased with the large portion as I was expecting around 5 or 6, but the dish contained at least 12 mussels. The tomato sauce went well with the perfectly cooked mussels. 

I had the Chicken Panini as the main, and it was okay; bread was a little on the burnt side personally and I didn't really enjoy the salad on the side (it was green leaves with a vinegar sauce). However, my friend who ordered the Fettuccine Alfredo does not recommend it at all, as it wasn't anything special, just plain pasta with alfredo sauce that tasted like those frozen microwavable foods (Michelina's) you can make yourself. Even though the menu did just say there was only the pasta, it would have been nice to have some garnish on it, or even some vegetables.

For dessert, I had the tiramisu, which tasted good, but again, not amazing. The coffee cake was a little too wet for my liking. 

Overall, I wasn't too impressed with this restaurant and the meal, it wasn't anything special and wasn't worth the long wait for the food."}
{"text":"I recently had the pleasure of enjoying a Sunday brunch at the newly opened Destingo in Queen West.  

Destingo is a casual Italian restaurant which is open for breakfast, lunch and dinner, seven days a week.  It has a modern Italian rustic look with its exposed concrete walls, bright paintings (including a set of rustic Italian blue coloured wooden doors hanging close to the bar - making for quite a statement piece!) and wrought iron fixtures; but above all else, it has a spacious patio facing Queen Street which gives it that true European feel, allowing one to relax and people watch while enjoyin a meal in good company! 

While perusing the brunch menu, I was quite impressed with the selection as there appeared to be something for every taste, including many healthy options such as greek yoghurt with seasonal berries, srambled egg whites, rolled oats, granola and various fruits including grapefruit.  There was also an extensive selection of beverages including fresh juices and smoothies, as well as specialty teas and coffees.  

For those with a more 'traditional' brunch taste, there are four choices of eggs, including the following:

-'The American' (included 2 eggs any style; a choice of pea-meal bacon, double smoked bacon, pork sausage or chicken sausage; homefries; a choice of organic multi-grain, whole wheat, dried cranberry or plain white toast)

-'The Italian' (egg white frittata with tomato sauce; fresh mozzarella and basil; choice of house salad or homefries)

-Omelette (choice of lobster/shrimp or garden/seasonal vegetables)

-Eggs Benedict (choice of pea-meal bacon or smoked salmon)

I went the 'traditional brunch route' and ordered 'The American' with scrambled eggs, pork sausage, homefries and dried cranberry bread.  When my dish arrived I was overly impressed by both its presentation and taste!  It was clear that the pork sausage patties and cranberry bread were made fresh in-house --- as if someone's nonna had given these western breakfast staples a home-made Italian twist!  Paired with a house made Americano, it was as if I had been transported to Italy for that moment in time!

Overall, the portion sizes, presentation, service, quality of food and value for money were above expectation!  In fact I don't believe anything on the menu is more than $15-16, which is on par with most casual restaurants offering brunch in the city; however, not many of them can compare with the unique offerings of Destingo.

I can truly say that I was extremely satisfied by my new discovery in Queen West!  Perhaps Destingo is true to it's meaning in that I was truly 'destined to go' there....  Whatever the case - I am happy to have come across a new option for brunch, and I look forward to returning.  As for lunch or dinner, I would be curious to see what they have in store...."}
{"text":"I have been here many times for brunch and a few times for dinner. Always great service and food. The seafood omelette for brunch is amazing - great flavour, perfect size. Kid friendly, without being a \"family\" style restaurant which is nice. Great patio in the summer. I did have an issue once with it not being open when they said they would be, but contacted the owner who apologized and dealt with the issue in an extremely professional manner. Highly recommend, for the brunch especially."}
{"text":"This review is for my visit to Destingo's on July 29th. 

My partner and I were looking for a place to eat in the area after discovering Terroni's had a one hour wait time. Both of us were craving Italian food and we'd heard good recommendations for Destingo. 

When we arrived it was not too busy, we were initially greeted by a female waitress - very friendly and seemed attentive to the customers who were assigned to her. This review may well be different if she ended up being our waitress for the evening.. however this was not the case! 

Instead we had a male waiter, menus came relatively quick but it took a while for him to take our drink order. From the looks of it, the guy was catering to two tables (including ours) while the other waitress took care of the rest (3 - 5 tables out on the patio area).  My partner ordered a Ginger Ale, and given it was a pretty hot summers day, I ordered a refreshing cider. My initial choice was out of stock, no big deal, so I ordered a pear cider instead. We also ordered our food at the same time, a Margherita Pizza for the both of us to share, an Agnolotti Pasta dish for my partner and I ordered the Chicken Parmigiano with a side of vegetables. 

The ginger ale came out pretty quick, but no sign of the cider. The male waiter was barely around at all, throughout the course of our entire meal for that matter. The lady waitress brought the Pizza to our table, and I had to ask her about the cider which still hadn't arrived. She was really nice and apologetic and brought it over in no time at all. 

The pizza was very nice - I have no fault with this at all. Decently sized to share between two. 

When our mains came out the pasta was good (according to my partner), the taste was good but the portion was a little on the small size. 

The Chicken Parmigiano was very big in size, the taste was okay but nothing amazing, however the side of the vegetables was extremely disappointing. 1 baby potato, a thinly sliced zuccini and 2 tiny chopped grilled peppers hardly constitute a \"side\" in my opinion.

The waiter did not ask us how the food was. No refills for our water, and at no point did he ask if my partner wanted a refill on the ginger ale (which she finished pretty early on into the main course). He spent most of the time stood over by the cash register paying zero attention to his customers at all. When my partner went to use the washroom he rather rudely said \"Over here\" multiple times, getting louder each time in a rather rude manner when she was looking over at the kitchen (which itself is pretty nice - open concept which is a really neat idea) when he had already told her where the washroom was earlier in the night.

On a food level, based off of the food we had last night I'd give it perhaps a 3 star, but unfortunately the service we received from the gentleman waiter was so bad it really does warrant a 1 star. 

I overheard a table over from us thanking the lady waitress for a wonderful evening for the attention they received and for making their night enjoyable. I wish we had her as our server for the night because ours was the polar opposite!"}
{"text":"I wasn't sure what to expect with Destingo but their menu looked good, and was full of simple Italian fare which I was craving. They offer a range of pizze, pasta, sandwiches, salads, etc. Typical trattoria goodness. 

They did not disappoint, the flavours were perfect and the service was excellent. They had only enough clams for one pasta serving but their seafood-based pastas overall are buttery heaven, pizza had excellent amount of topping for each bite and the crust was perfectly crisp, light and also buttery. Our server was patient and accommodating, and came around just enough without being overbearing. 

Prices are fair and portions were just right for lunch. I would go back for more, but next time I'd like to try their brunch."}
{"text":"One member of the wait staff was attentive but the service was generally poor. That's about the only good thing we can say for this place. We went for Thanksgiving dinner and made reservations. However, we weren't seated as soon as we got there and the worst part was they told us they ran out of turkey and soup only after we were seated. (we would have left otherwise) In other words, out of the touted Thanksgiving menu, only the pumpkin pie was left. It was very disappointing. The chicken substitute was a small piece of grilled chicken breast - no effort to make it seem like a roast turkey substitute! And yes, we had to pay the same amount as if it was turkey. The hostess did not even apologize or anything. Safe to say will not be coming back to this place again. I even had to register in Yelp to write this."}
{"text":"Queen West is one of those neighbourhoods where you're bound to find a great place to eat.. on every corner! I have yet to visit Destingo so Winterlicious was a good excuse for me to see what they're all about.  Yes, it's hard to judge a restaurant during this time as service may be compromised, but my dinner at Destingo was close to perfect.

This Italian trattoria is located at the corner of Queen St. West and Palmerston Ave./Tecumseth St., easily accessible by the TTC street car or by car.  It's large space that is open concept with a trendy bar on one side and an open kitchen at the back of the restaurant.  Even though the space is large and open, the tables have a good space between each other for that privacy and it didn't get too loud with it being pretty full that night.

The servers were knowledgeable, prompt and friendly.  The drinks and food arrived at a good interval between each course as well.

Complimentary bread with butter - loved the sun-dried tomato loaf.. totally delicious!

The Grilled Calamari with caramelized onions, kalamata olives, capers, local grape tomatoes and roasted garlic was tender and bursting of flavours. The acid from grape tomatoes balanced everything out well.  I order 'calamari' often at different restaurant for appetizers and this has to be one of my favourites.  The olives made it unique. 

 Destingo's Verde Salad is made of arugula, Ontario granny smith apples, toasted walnuts and Parmesan in a champagne-pear vinaigrette was absolutely delightful.  The arugula leaves were fresh and I loved the crunch from the apple slices and toasted walnuts.

New Zealand Lamb - tender lamb in a fresh mint sauce, served with roasted vegetables came with 3 chops. The lamb was tender and went really well with the mint sauce!

Chicken Parmigiana - breaded chicken breast with a spiced tomato sauce and fresh Parmesan cheese was probably my favourite of the night, even though it was my sister's entree. Crispy breading with soft melted cheese under the tomato sauce was super comforting!  The veggies on the side were tasty and seasoned well.

Molten Chocolate Cake was a simple and sweet finish to our meal.  It wasn't too chocolatey or sweet, which I liked as I find many molten chocolates to be overly rich.  Blueberries on the side was a nice touch.

The Tiramisu was light, spongy and creamy! I couldn't get enough of this!  It wasn't overwhelming with coffee at all but with just a hint, which I liked.

Overall, I had a great experience at Destingo for Winterlicious this year.  Great food, great space and great servers made it a memorable dinner and I will be suggesting this spot to my friends and probably going back for a visit soon for the Chicken Parmigiana."}
{"text":"Restaurant: Destingo
Cuisine: Italian
Location: Queen West
Address: 741 Queen St W
Price Range: $15~

1: Poor 2: OK 3: Good 4: Very Good 5: Excellent

Food: 4
Service: 4
Ambiance: 4
Overall: 4

Extra information:

* Open for lunch and dinner
* Takes reservation
* Good for large groups
* Family friendly
* Patio at front
* Serves alcohol

Destingo is a traditional Italian on Queen West that serves delicious, sold home style Italian food. I remember passing by this place couple times thinking I need to come back when the weather gets warm. It's very rare to find a restaurant especially on Queen west with such a spacious patio that can cater more than 6~8 people.
With floor to ceiling windows on one side of the room with high ceiling all through out the restaurant, Destingo was brightly lit and pleasantly spacious to my liking.
Laid back and not too overly fancy, I felt right at home seated next to the window and I was ready to eat!

We started with Pimms cocktail and house red wine. I am really starting to like this perfect summer cocktail, Pimms- with cucumber, mint and lemon.

Ordered: Bruschetta 4/5

* Baguette, vine tomatoes, fresh basil, garlic and evoo
* 4 pieces for $3.95

Ordered: Beef Carpacio 4/5

* Lemon infused herb oil, capers, shaved asiago and arugula for $12.95
* This was a nice appetizer to start the meal with
* capers and grounded pepper on top added the necessary seasoning 
* This would be perfect for quick lunch with some bread on the side


Ordered: Grilled Calamari 5/5

* Caramelized onions, kalamata olives, capers, local grape tomatoes and roasted garlic for $14.50
* I believe that everything deep fried tastes so much better but in this case, I couldn't love this more.
* Calamari was cooked so tender yet juicy
* Simple, clean taste with some salad on the side
* Roasted garlic and kalamata olives added nice depth to the flavor

Ordered: Funghi Risotto 5/5

* Fresh porcini mushrooms, truffle oil, saffron and grana padano for $18.95
* I've been craving good mushroom risotto for the longest time and this def hit the spot
* It was rich and hearty without being a heavy dish
* Risotto was cooked just right with bursting funghi flavor throughout

Ordered: Vitello al Florence 5/5

* Veal scaloppine with button mushrooms in balsamic cream sauce for $19.50
* This was a dish I was excited to try and it def lived up t my expectations
* Thinly sliced veal was cooked tender and it melted in my mouth
* I think this was my first time trying balsamic cream sauce and I loved it
* It was like light mushroom cream soup but with bit of tangy'ness

Ordered: New York Steak 3/5

* 30 day aged 10oz new york steak in peppercorn red wine demi glaze for $28.95
* We ordered this medium rare but it came out more like medium
* Honestly every other dish was so delicious that this didn't impress me that much
* I'd say it's best to stick to Italian dishes at Destingo cause they do it well

Ordered: Tiramisu and Creme Brulee 4/5

* All desserts are $7.95
* We were so stuffed by this point but we couldn't pass up on dessert
* Creamy tiramisu and the creme brulee was a perfect way to end the meal
* I personally preferred creme brulee over tiramisu

Summary: I really enjoyed my meal at Destingo, it's nice to sit at a restaurant where it is nice and bright without being squished into a dark corner surrounded by so many people. As I mentioned before, they do have one of the nicest patio on Queen West so def check them out and make sure to try them out!"}
{"text":"Pros:
- Best service, the servers were so attentive. We originally sat outside but it started raining, so they stationed outdoor umbrellas above us but it wouldn't cover us completely so they helped up move inside. 
- The tomato, prosciutto, mozzarella, basil appetizer was so good with the bread
- I had the risotto and it was good but a lot and very rich.  Luckily I got to eat my bf's red sauce seafood  pasta (I don't remember the name) and it was good. 

Cons:
- none

Notes / Tips: 
N/A"}
{"text":"Breakfast is pretty standard fare.  Reasonably priced.  Service is really hit or miss here - sometimes it has been great - other times, not so much.  Menu has some interesting items like the pork pancake thing and more standard fare like \"the american\". The panchetta fritata was good.  The staff seem to turn over and seem to be very inexperienced, maybe some bad management?"}
{"text":"My girls and I went here for their summerlicious menu and we sure weren't disappointed. Other than the fact that it took 40 mins for our main course to come out from the time we ordered. We had the fried calamari which was amazing and on point, the verde salad which was arugula apples and vinaigrette also uh-mazing and the daily soup which was roasted sweet pepper was my absolute fave. Overall all three appetizers were great and would strongly recommend. Main course 
1. Fettuccine Alfredo subbed in a rosé sauce was ok nothing amazing here. 
2. Veal - this was my fave it was well done and would recommend to everyone 
3. Tilapia- lemon zesty fish that's what I'm talking about. 

Because our main courses came out late & we were in a rush we had to take our desserts to go. Our server was great considering she was serving almost six tables all by her self. The chef was also great considering he was making food for about 25 guests all by him self. 

Tip for management time to hire some more people!  Other than that it was all great and I love the patio! Will return for he regular menu soon."}
{"text":"We visited on a warm summer night and it was raining on and off. We opted to sit near the overhang of the patio so we could move inside easily if need be. 

We had two different servers visit our table who didn't seem to be communicating well. We looked at the menu and contemplated leaving because of the table near us with very noisy children, but we were too hungry look for something else.

The fried Calamari was decent. I liked the spice of the Jalapeno aioili. We shared the Parma Pizza and while the toppings were good, the crust was a little on the floppy side. I think that there are better options for pizza in the neighbourhood, but the nice open patio is a draw.

I might come here again just to sit on the patio for cocktails and a snack with a girlfirend, but then again, there are other patios."}
{"text":"A group of four of us came here during summerlicious. I was the first to arrive, was greeted nicely and seated on the patio.

The quality of food was mixed, but this tends to happen during summerlicious. The salads ordered were enjoyed, the calamari was okay. The chicken and veal were overcooked. I enjoyed my agnoloti. The mango mousse was okay, and the tiramisu was slightly frozen on the inside.

Overall, not a great experience but was with good company so still had fun. I don't think I will go back."}
{"text":"Tonight we enjoyed the summer lictous menu.   Great value.  Food tasted great.  All in all a great place.  We even brought our dog.  He sat outside the patio."}
{"text":"I lost my heart in caramelized onions and melted gorgonzola. 

While running errands in the neighbourhood and trying to avoid the draw of chicken and waffles at Harlem, I stopped in my tracks in front of Destingo's massive, street-side patio. It's big and the furniture is shiny so I couldn't help but zombie shuffle towards the shiny.

The service was great from the start with menus, water and an offer of beverages immediately. The latter seems to be a lost art these days or my patience for a cold beer on a hot patio has grown thin. Wait, maybe it is me.

I initially thought  the menu was ever-so heavy, but after downing my roast beef sandwich (w/ caramelized onions and gorgonzola), my attitude changed: sure it wasn't on a panini as listed on the menu, but that was clarified in person and it was still worth every penny. 

Tap selection was small - Stella, Bud (what?) and something that escapes me - and a bit price-heavy at $7.00 for a pint of Stella, but it was cold enough and tasty enough to warrant a second.

I could see it being a regular hangout it was much closer to my office, but it's unfortunately not, so I'll have to find an excuse (and more cash) to run errands in the area."}
{"text":"NOPE. I should've listened to the yelp reviews. I was stubborn and went anyway because it didn't look so bad.. plus I was super hungry so. I'm one to always finish my food and not waste. I didn't finish my plate this time. There was a wasp flying around our food on the patio for a good 20 mins and no one came to help. Poor food&service. that is all."}
{"text":"A new brunch spot on Queen West that formerly houses a furniture store, the restaurant had maintained the open concept look and the decor can be described as industrial.  Red wine seems to be an ongoing theme as varietals of red wine grapes span across the lighting fixture covers and art on the wall (for sale) have names such as Cabernet Sunrise - that and being asked whether we'd be having wime at brunch.  Talk about an eye-opener? The space has floor to ceiling windows which let in a lot of natural sunlight.

We stroll in on a Sunday afternoon to a relatively empty brunch service which means service is attentive. 

The coffee mug is reminiscent of metal cannisters you'd find yourself enjoying a cup of hot chocolate out of on a camp trip; juices are served in mason jars. Juice is freshly squeezed with no added sugar for the health freaks out there. 

The menu consists of baked goods, yogurt + oatmeal, omelets, bennies and for those who don't feel like eating breakfast items, a short list of pizzas, pastas etc.

We opt on the Porchetta pancakes with Jack Daniels syrup; no doubt skillet-made as it is massive. Perfectly crisp on the outside and very fluffy on the inside - it was a winner.

My dining companion opts for a Shrimp + Lobster omelet with fennel cream - great seafood flavors in the omelet with substantial chunks of seafood but I just wasn't digging the hummus-like fennel cream that tasted like anything but.

All in all, a good brunch place in the 'hood but nothing mind-blowing."}
{"text":"Great for brunch on the weekends.  Try the lobster omelettes and the power drinks.  Good, tasty, stuff all around."}
{"text":"2 stars for the excellent patio and service. Apart from this: menu was full of dust, table was full of dust, calamari was hard - seemed frozen and defrosted in the microwave, and ravioli had no spinach as stated in the menu. After working at 70 hour week you're simply to lazy to complain and make a fuss. We enjoyed the weather and our alcohol."}
{"text":"Waiter was so rude and standoff ish we didn't even look at the menu we walked out , high point we food a great place near by... We've been to Destingo before and we went to queen west to go there... Will never return"}
{"text":"Bottom line ... pretty decent food; tasty sauces. Would perhaps return if not for the service. Summerlicious effect with small portions.

Just went for Summerlicious. Group of 7, 6:30 PM reservation on a Sunday evening. 

Bad sign first off ... our server introduced herself, asked if we wanted water (not if we preferred tap or sparkling, whatever, just if we wanted water at all?), and then proceeded to disappear for the rest of the evening. Really. We saw her walking back and forth all evening, but she never approached our table again. At least two different other people served us instead ... which is fine, unless somebody introduced herself and told you she was your server. 

As we waited for our friend, we eventually wondered whether we could get drinks, and made eye contact with a server. We asked if we could order drinks, and he was like, \"Oh, of course!\" and took our orders. This was about 15-20 minutes after our initial reservation time. 

As we ordered drinks, I asked if we could have separate bills, knowing not every place can accommodate, and he said, \"yeah, of course.\" When we got our bill (different server), it was one bill and she apologized for not being able to separate the bill, but we could pay with multiple cards if needed. Okay! Don't mind that ... if you can keep your story straight. 

One of the busboys kept our glasses filled (until dessert), which was appreciated, and offered fresh pepper for our first and main courses. 

We had to ask for bread, only after we noticed some other tables got bread. Appreciated the presentation, with warmed butter for spreading, but again, we each got one tiny slice, which meant we all kept eyeing the board, wondering which half of the group got a second slice. 

Suffered a bit from the Summerlicious stereotype ... portions skimpy. 

The caprese salad came with one sprig of basil, like a garnish. Perhaps a different style? The grilled calamari was tasty, and came with a generous side of greens, which was excellent. 

The lobster agnolotti was tasty but the portion was a little mean. The lamb with mint was three very skinny slices. The stuffed chicken and snapper dishes fared better. All around we did enjoy our dishes, which were relatively simple but well-executed. For $25, what can you really ask for? If you have a more modest appetite, this is perfect; if not, perhaps think of dropping into Sud Forno down the street for a pick-me-up.  

With all the hard surfaces and polished concrete, this place is INSANELY LOUD. The patio is wonderful; we were seated inside, but near the window. That's probably the main draw."}
{"text":"The service was nice -- attentive and cheerful staff. I came here for Summerlicious. I had called the day before to try and get a reservation and got the impression they were very full, though there were many free spots once we arrived. 

The portions were larger than I expected for Summerlicious, and in particular, the pizza was a full size. They did pack it up for me to go. Overall I found that the food was simple, no unexpected spices but nothing particularly sophisticated either. 

Would recommend the pizza (if you're looking for a big eat) and the tiramisu, but not so sure about the apple strudel."}
{"text":"I was invited for a media preview dinner of Destingo's Winterlicious menu last night however my opinions are my own and remain honest as always :)

Overall, the food was very tasty and the service was friendly. The owner Monica is very sweet and seems to sincerely love her restaurant and customers. 

Simple and comforting Italian flavours is the best way to describe the food at Destingo. The margarita pizza was thin and crispy, with just the right amount of savoury tomato sauce, melty mozzarella, and tender fragrant basil. The house made bread studded with sweet sundried tomatoes was so so yummy. I could have easily eaten the entire loaf if someone let me ;)

I enjoyed crispy and tender fried calamari, and the arugula salad with apples and a light champagne vinaigrette. I really loved the caprese salad, with fresh mozzarella cheese, tomato, and fruity olive oil.

The main plate with pasta, veggies, and steak was awesome. Everything was cooked and seasoned properly, and the meat melted in my mouth.

To end the meal, we were tried a trio of desserts. Apple strudel with ice cream, tiramisu, and a chocolate mousse in a chocolate cup. Being a chocolate lover, I enjoyed the last dessert the most but they were all really delectable.

Overall, a solid choice for Italian food on Queen West. I look forward to returning!"}
{"text":"Absolutely awful. Worst service I have had in a very long time. Breakfast took at least 45 minutes and it was not worth the wait. I just had a simple bacon and eggs, both that were undercooked. I was given two whole potatoes instead of home fries and order chicken sausage that was really salty. My husband had a Benedict that arrived without hollandaise. The patio is nice but would not return."}
{"text":"I went to this restaurant with my sister, last night. First impression, the decor is beautiful, yet somewhat intimidating as well. walking through the patio to the front doors, i felt like i was being watched by the diners all around us. We asked if we could sit inside but near the opened \"windows\" (folding glass doors). We both pointed at a table for 4 that was available. The hostess/server stumbled over her words: \"uhhhh...mmmm...uhhh..how about any of the tables for 2 over here?\" as she gestured to the other side of the room. My sister and I were like: \"uhhh...well, ok... i guess this table?\"  We both agreed that, THAT was a turn-off. As we looked over the menu i noticed that several items that caught my eye, were NOT exactly \"italian\". But hey, I work in an italian resto & having to eat italian food everyday, probably made me want those other items instead! We decided to share. we opted for the PEI mussels w/ white wine broth, the shrimp burger on a pretzel bun, & even though we both didnt want to, we decided we HAD to order something ITALIAN so that we could rightfully judge & critique the \"italian-ness\" of Destingo. We ordered the quattro funghi pizza.
The mussels came, we were both disappointed by the lack of broth/sauce that came with the dish. Usually, having ordered mussels in other restaurants, there'd be some broth to spoon over the mussels (or enough that you'd want to order bread to sop up the rest of it) Sadly, it seemed that the mussels were probably cooked in a \"splash\" of white wine as evidenced by the lack of liquid in the dish. all-in-all, they were quite tasty, albeit slightly too salty and lacked the pool of liquid that usually comes with mussels.
our next dish to share was the shrimp burger. not too sure what part of italy serves up a shrimp burger on a pretzel bun w/ LETTUCE & tomato? (my sister & i both wondered if arugola shouldve been substituted, or something to make it more \"italian\", but hey, im not the italian chef!) otherwise a pretty good NON-ITALIAN burger. a little difficult  to eat, & hard to share, as it was maybe the size  between a slider & a regular sized burger? the shrimp patty kept on sliding around on the lettuce & tomato. And the texture of the patty may not agree with everyone. Being chinese, and having eaten my fair share of shrimp balls etc growing up, we didnt mind the almost uniform texture of the patty. the fries that came with it, were supposed to be truffle oil & parmesan. Working in kitchens, i KNOW what truffles smell like- i was disappointed when i couldnt even taste or even SMELL a HINT of truffle oil on those (McCain?) fries!! the fries werent bad, they were good if you're NOT expecting it to be truffled up!

Then, the last and final ITALIAN dish to be served! the quattro funghi! Unfortunately, my sister and i didnt realize that the pizza came with prosciutto so  at first thought that they had mistakenly given us the wrong one. Our server, politely told us that the pizza COMES with \"freshly sliced prosciutto\" . BIG disappointment. My 1st bite, i thought: reminds me of the pizzas we used to make as kids at bday parties -- the tomato sauce? blech! we were both trying to remember the 4 types of mushrooms that came on this pizza besides the button mushroom & that button mushrm & that..button mushrm...oh & yay! an oyster mushrm..&...a...button mushrm...is that a shittake mushrm? uuhh... maybe? later on, we reread the menu online & the 4th mushroom was supposed to be portabello. i guess button mushrms KIND OF qualify? as portabello mushrooms are actually large cremini/brown button mushrooms. we definitely DID NOT see any lge looking button mushrms! the pizza had been cut into 4 pieces. After finishing 1 slice- i didn't want to finish my portion. my sister insisted.  one bite and i couldnt do it. the tomato sauce was too \"canned\" tasting for my liking. the cheese? both of us were like: \"cheddar?\" im SURE it wasnt, but if both of us came with the SAME conclusion?!? it wasnt orange, id give them that. i had to pick off all the cheese, & the prosciutto was WAY too salty & overpowered the mushroomness for the pizza. i KNOW prosciutto is supposed to be salty, but i think b/c the pizza itself (either the crust, or the sauce) was already oversalted=not a good combo unless you have no taste buds that detects saltiness. 

It was during the course of the pizza, when a large party came in & sat on the side of the restaurant where my sister & i had wanted to dine. I NOW understood the reasoning behind our server's lack of accommodating us w/ the table we had wanted to eat at. HAD she explained, our first impression wouldnt have been as negative. All she needed to say was: \"unfortunately, we would love to seat you at
that table but there's a (insert explanation)\" 

we decided we'd give a-go w/ dessert. we shared the tiramisu. not bad! probably what Nonna would make- if i had one! ;)

if authenticity is what youre looking for, Destingo is definitely not it."}
{"text":"Service : Friendly but orders screwed up. Red wine served too warm. White without an ice bucket.
Food : Many things tasted \"off\". VERY off. Veal and Salmon particularly. Are those calamari (perfectly evenly uniformly breaded) from a bag ? Me thinks so. Seasonal vegetables on a menu in Canada in March ? Yeah, I did get a couple of carrot pieces on the plate.
Ambiance : Great if you are coming in for dental procedure. 

There are so many better places to gather and eat, go there instead.

PS This is not a robot paid review.  I actually ate at Destingo and thought you should know."}
{"text":"Went for brunch and found food, service, atmosphere and prices to be great! Not sure what the some ppl on here are talking about re food and being pricy unless they find $12 expensive! NOT!"}
{"text":"When this opened on queen street west., I was excited. It has a lovely, huge outdoor patio and a beautiful interior. Beyond that the execution falters to the point of disappoint.

If I can't remember anything about the food other than it was banal and have made much better from similar menus, I can't say much.

I recommend it for lounging around with a few drinks and people watching but beyond that customer service was in extremes. On one hand the bussers were overly attentive while my waiter  with the red frame eyeglasses, took forever and then charged for a beverage I ordered and never received.  

As ten was getting closer, we were constantly being asked if we wanted anything while we were talking over coffee. It was excessive. We assumed they were closing but in fact they closed much later. Perhaps because there were so few people there they wanted us to leave.

I am on the fence about returning. There are certainly plenty of places to choose from. Their patio led me in but the result of that experience makes me feel disappointed every time I see that place."}
{"text":"Surprisingly big and comfortable was this spot on west Queen West which I've walked by tons of times but never patronized. With a great patio and an appetizing caprese salad, my capaccio was tasty and memorable.

Great service and a cool, laid back vibe made this a slot I'm going to check out again soon."}
{"text":"I've eaten at Destingo twice and have enjoyed both meals. My first experience was a bit of a fluke. It was a lovely Sunday (Mother's Day). My friends and I were roaming around Queen West, enjoying the nearby Canadian designer shops. We liked the Destingo's patio and decided to give it a try.  Boy are we glad we did. The food was a welcome delicious surprise which we thoroughly enjoyed. The sauce for the gnocchi was really flavourful... a welcome change from the bland cream sauces served by  many Italian restaurants these days. The grilled calamari was perfectly cooked and seasoned. We also enjoyed the arugula and pear salad. Yum. 

I returned to Destingo the next Sunday for brunch with some other people and was not disappointed. The frittatas were delish. The service was attentive without being intrusive.

So in conclusion, I'd recommend you stop by Destingo. You'll have a great dining experience with lovely food and good service."}
{"text":"I really, really wanted to love Destingo, but it just didn't work out that way. 

I came by here for brunch this weekend, super excited to order off the menu. There was so much delicious sounding goodness: how ever could I decide?!

I started off with the Morrochino (listed as espresso, \"rich chocolate\", and steamed milk). To my surprise, the \"rich chocolate\" turned out to be Nutella. Not that I don't love Nutella but I'm not fond of the fact that my server didn't even tell me about the menu change. Two other people from my party ordered it, the but the other three that wanted it were told no because they were \"out of the glasses they serve them in.\" They went with lattes instead, but guess what? Ended up with the same glasses ours came in. Not top notch customer service. 

I went with porchetta pancake. As soon as I got it I regretted my choice. SUPER heavy. Caked with pulled porchetta on the bottom but wayyyy too much meat (and I love meat!) I wasn't a fan of whatever sauce the porchetta was covered in. On the bright side: the dish is served with a jack Daniels maple syrup. Gettin drunk on pancakes? Yes please!

I tried the panettone French toast: it is more panettone and less French toast. Not really battered like French toast normally is. Get this if you're looking for a sweet, dessert like treat. 

We wanted to hang out and grab more coffee after we ate, but our server disappeared. 

Overall, wasn't impressed."}
{"text":"We were hungry and were looking for some good food and found this. Ambiance was good and food was OK to. We ordered Pasta, Pizza and sandwich . nothing extraordinary but it was good enough."}
{"text":"This place has SO much potential to be a 4+ star joint, but service and management have been so poor the couple times I've been here, that I feel generous even giving them a 3.

Last time, my aunt made a reservation for 8 of us. I got there early and no one seemed to know anything about it. They quickly threw a few tables together inside. When my aunt arrived, she reminded them that her reservation was for the patio, so again they sloppily threw some (dirty) tables together.

Anyway, we started off with some beers, sangria, and bruschetta, all of which were delish. Our initial server seemed clueless, and then another server took over who was better... But there was little to no communication between the two of them. The second server took our dinner orders.

Luckily my family is awesome, so we managed to entertain ourselves for the 40+ minutes that it took for our food to come out. Another family, who had arrived at the same time as us, apologized to us on behalf of the restaurant (lol), as they had finished and paid for their meal while we were still waiting on ours.

Food finally came, and was delicious. I got the veal (vitello carciofo)... It was cooked to perfection in a yummy sauce. Everyone else enjoyed their meal as well.

I wouldn't recommend coming here in a group larger than four, because it seems like they're too disorganized for that. The food is really good... Service and management are not."}
{"text":"This is a little overdue as I went this past summer (August 2014). My boyfriend and I went for a brunch here on our one year anniversary weekend! We were walking down Queens Street and the outdoor patio caught our eye and we decided to try it out. The patio was great, the chairs were not comfortable but I was not so horrible we couldn't sit. I wouldn't recommend the patio for any tall people because my boyfriend is 6'2 and he did not have enough space in the tables for two on the patio. 

We ordered a mimosa and and a bellini and they were both up to par, nothing super crazy. I had the Porcheta pancakes and he had \"the Italian\" an omelette. I was pleasantly surprised at their servicing size for the pancake. It was 12$ and it was huge. It was only one pancake but it was great. They didn't skimp on the Porcheta and it was cooked quite well. It unfortunately wasn't piping hot but the morning was brisk so who knows. It was still delicious. The Jack Daniel's syrup was just ok, nothing amazing it tasted a little muskyier than regular syrup. I didn't eat much of it, the pancake was amazing on it's own.

My boyfriend enjoyed his pancake, I had a quick bite also and it tasted fresh and very well cooked. Compliments to the chef!

It wasn't busy for a Saturday afternoon and the food was really fast. I know that we will come again, but maybe sit inside!"}
{"text":"I decided to give this place a try because of the numerous great reviews on yelp.   I should have read it more carefully as the good reviews were attributed to their brunch menu.

I went to lunch today with a friend.  The entrance was decorated beautifully and the interior decor was beautiful.   The restaurant was pretty empty when we were there (should be a sign for the worse to come). Their lunch and dinner menu was the same.  Hmm...  shows you how much thought they put into their menu.   Before we even sat down to look at the menu, the waiter asked us what we would like to drink,  which I felt was a little rushed.  Anyway, I asked for a specialty tea and was not too happy that I was served Lipton.   Don't label it as \"specialty\" if there is nothing special about it.  RSquared cafe across the street have better teas than them and cost the same!  Anyway,  with the place looking as nice as it was, I would have thought the Owner would have better taste in teas.  

Anyhow, we ordered the following:  Beef Carpaccio to start, I had the Mushrooms Parpadelle and my friend ordered their Seafood Spaghetti de Mare.

Their Beef Carpaccio fell a little flat with some arugula in the middle and slices of Asiago cheese.  Nothing spectacular.    Terroni's tasted better for the same price.  

My Parpadelle was a little undercooked and bland.   I could have easily made this dish myself.  Basically, some buttered mushrooms, olive oil, and the pasta.

Now comes the worst part - my friend's seafood spaghetti was just horrid!!!  A couple of mussels, octopus heads, and shrimps sprinkled on top of spaghetti coupled with a really bland white wine sauce.   The pasta was soooooo sour and fishy!  I don't know if they overdid it on the lemon to mask the fishy smell.   I am pretty sure the mussels were NOT FRESH!  It was really horrid but my friend was too nice to say anything.   I took a bite and couldn't even swallow it because of how fishy it was.

Note:  they didn't give us our bread until after we finished our appetizer.  A little disorganized.  Oh, the bread,  also not so great.  A little bit stale.  

This place could do so much better in this hip neighborhood.  If they want to survive, they better try to fair well with terroni and the other restaurants in the area; or else, in a couple of months, they will be squashed like a little bug!  

Destined to go?  I wish I hadn't chosen this place in the beginning."}
{"text":"One of my favourite neighbourhood lunch spots! The owner Monika is very friendly! Some of the other servers are nice too.

They have a beautiful patio in the summer. 

Destingo serves up delicious Italian food like sandwiches with truffle fries, and a variety of delicious pasta dishes, like lasagna, gnocchi, spinach and cheese stuffed pasta in rosé sauce... My favourite sandwich is the chicken one, and it's hard to choose a favourite pasta, but the gnocchi, which comes in a garlicky white sauce, is definitely up there. 

They also have some tasty red wine, as well as great beer options for beer drinkers. 

This is one of my favourite lunch spots!"}
{"text":"Really tasty food - calamari and bruschetta were super tasty. Had the margarita pizza which was simple but had great flavour. Overall prices were reasonable as well. Would definitely go back."}
{"text":"Went there last night for Winterlicious.  Between the 4 of us, we had pretty much everything on the menu and it was all delicious.  For $25, you can't go wrong. Lively atmosphere and hilarious waiter also a plus."}
{"text":"Drinks only - we ordered the Lime Margherita's. 

FIRST: We weren't asked if we wanted them frozen or on the rocks. 

SECOND: Instead of tequila, lime etc (It's pretty hard to f**k it up)- we got \"Palmolive\" soapy tasting syrup, blended with water and some crushed ice. My taste buds couldn't locate the tequila. The soap syrup was strong.

THIRD: SO SOAPY TASTING! WTF??? Feels like i was going to burp soap bubbles."}
{"text":"I just had the most amazing meal ever this restaurant is awesome . The Valentine's Day menu was out of this world, Desserts just to die for and the service was fantastic. I will be back and highly recommend it . Kudos to the owner and staff... Keep it up !"}
{"text":"BOTTOM LINE: Great patio, solid food.

Perhaps Destingo worked out a few of their problems from their recent opening, but my DC and I had a pleasant experience compared to the first few reviewers. Service was good, nothing to complain about.

The most obvious selling point is their incredibly spacious patio that's put to good use! There's not many along Queen West - at least none that have such an amazing people-watching vantage point - so it's worth it even for that. 

My DC and I stared with their PROSCIUTTO DI BUFFALA, which came with ample amounts of buffalo mozzarella. I definitely recommend this as a sharing platter to start with.

We both enjoyed our mains: I ordered their FUNGHI RISOTTO which was rich and creamy, and had an even truffle flavour throughout. The saffron gave it a warm auburn colour to it. My DC ordered the PARPADELLE ALLA MARSALA which came with nice big chunks of mushrooms.

Finally, we both ordered cocktails with our meals. I forgot the name of it, but I got the girly gin+prosecco cocktail that came in a martini glass, but allow me to qualify my order by saying it came with a manly 3oz of gin. :P

Overall, I quite liked Destingo and would definitely come back to try their other dishes."}
{"text":"We passed by Destingo (@destingoTO) so many times since it opened but have never been. I was lucky enough to be invite to a dinner and got the choice of à la carte or they'll bring out multiple half dishes for us to try and of course we went with the latter since they know what's best on their menu right.

This place is definitely underrated serving good casual simple comforting Italian food, nothing fancy

Love the spaciousness, no chair bumping and the huge open kitchen with amazing smell whiffing through the restaurant.

 Grilled Calamari
~ caramelized onions, Kalamato olives, capers, local grape tomatoes, roasted garlic
~ Perfectly cooked calamari with simple delicious ingredients, what else can you ask for?!
~ Perfectly delicious!!!

P.E.I Mussels 
~ choice of house made tomato sauce or white wine sauce
~ They served us the white wine version and I thought it was rather oily... Wish the white wine flavor was more prominent.

Gnocchi four Destingo
~ potato gnocchi, four cheese cream sauce
~ There were not the fluffy/airy gnocchi that I come to expect from most places, they were more solid/packed but perfect with that extra creamy cheesy sauce here.
~ This was barely a half portion for our tasting, shared between the two of us and I really doubt I can ever finish the whole serving if I order it as my main.

Al Gambero
~ shrimp patty, lettuce, local tomato, seafood aioli, red onions on a pretzel bun w/side of Destingo fries that's seasoned with Parmesan & truffle oil
~ Recently featured on Postcity in their Toronto Best Sandwich section (here) and I was thrilled that we got to try it. They advice that they'll change the name to burger since no one ever notice this under their panini section. 
~ Thought it was a good change from the regular beef burger but the patty here was a tad too thin for the buns and all that fixings. 
~ Love the pretzel bun here, not only does it look great but also love the slightly tougher texture compare to a regular burger bun. 
~ The fries was served with a mayo dipping sauce but with the salty Parmesan and flavorful truffle oil, it was pretty good just on it's own.

Rigatoni Bolognese 
~ veal tenderloin ragu, tomato meat sauce, Parmesan
~ Perfect simple pasta dish that I crave from time to time. Nothing fancy, just made right.

Vitello Destingo
~ veal scaloppine w/ baby scallops, cremini mushrooms, sundried tomatoes in a rose sauce
~ Although the sauce was delicious, it was a tad strong/intense for the super thin piece of veal.
~ Wish it was served with some sort of carbs or maybe just less sauce.

Apple Strudel

Tiramisu
~ Ususally not a fan of tiramisu with all the cream and mushiness but that aside, the one here are very light and not very mushy and I liked it so much that I actually finish it almost entirely on my own.

Crème Brûlée 
~  I have never been a big fan but I do enjoy it once in a while and this one was made just right. the perfect creamy consistency with just the right thin caramelized sugar coating (hate when it's so thick that you have difficulty breaking through)


Verdict :
~ Casual, Simple & Delicious Italian Food
~ Affordable, good portion and great spacious space
~ Can't wait for patio season and go back for their brunch"}
{"text":"Such a disappointment.  I had high hopes for this spot, as the patio was gorgeous and the menu was just to my taste.  They had a number of dishes that sounded wonderful and with such a well curated menu, gorgeous patio and well styled interior the food was sure to be as wonderful.  I was eager to fall in love with this place and make it my neighbourhood favourite.

The love affair was over as quickly as it began.  The first sign was the wine.  I ordered the house red, which in most spots with a menu like this, can be a perfectly lovely option.  I could barely drink it and had to send it back for an alternative.  

As we moved on to the appetizers my hope returned.  The bruschetta was quite tasty as was the caprese salad.  My dining companion had a salad.  The descriptions of the salads sounded incredible, but what arrived was average at best.

True disappointment set in during the main courses.  My dining companions had Risotto Funghi and Penne Arrabiatta.  I had Linguine Caccio e Pepe.  The risotto was deemed decent, but nothing to write home about.  The penne had no spice whatsoever and may have been considered a decent dish if it was simply intended to be a pomodoro sauce.  The linguinie was swimming in water like they couldn't even be bothered to drain the pasta.  With such a well selected menu I had high hopes that this linguini would be similar to the real Italian versions I have had, but no such luck.  It was just plain bland.

Frankly, this place confuses me.  The setting was so nice and the menu so well selected I felt like it was designed by someone who knows Italian food and knows it very well.  However, the restaurant felt like it had been left to people who know nothing about the food and didn't get taught to cook it, to run it.  I have read it is owned by former staff from Vaticano in Yorkville.  I have been to Vaticano a few times and quite liked the food but it really wasn't even close to the standards or quality of that spot.  The menu was probably more current and the ambiance great, but the execution totally flawed.  

I still have high hopes for this spot and hope that whomever designed the fantastic menu will return to show the staff how to cook and execute what they envisioned, so that this spot can be all that it should be.  Otherwise I think it is going to be a flop.  With great spots in the area like Gusto with much higher quality food, this place is not going to be able to compete unless it steps up its game."}
