{"text":"This pizza is very good. Great prices. 

The slices are square cut. They almost remind me of school lunch pizza. Thats all you can get here. Strictly pizza so dont come for the variety! :)

Price is per slice plus toppings. I recommend the bacon! Super yum. 

The only reason I gave 4 stars is that the hours seem to be hit or miss lately. Its better now that the pretty kitty isnt next door (or worse for guys lol)."}
{"text":"I grew up on this pizza and it is still my absolute favorite. I love a crispy square cut and this is the place to get it!!!"}
{"text":"Best Pizza in the Burg.  Worst service in the Burg but fortunately I go there for the Pizza and not the service.  Square cut, old fashioned crust. Great cheese and sauce. We order extra so we have plenty for Breakfast too. You can also order the Pizza without the cheese melted and then put it in the oven at home to melt the cheese. Also good option if you want to freeze it and eat later.  A must stop on all my trips to Pittsburgh.  But be warned, you can only buy Pizza and can not eat in. No tables add to the charm of this takeout joint."}
{"text":"Grew up eating junction with my family. Square cut by the slice deliciousness. Light crust, somewhat spicy sauce, and very good cheese. No part of this pizza stands out above the others. Just as good cold or warm as it is hot. The quality is a hit or a miss sometimes, but when it's good it's great. If you like cheesy pizza you should order it with extra cheese. You're going to need lots to drink with this pizza though!"}
{"text":"I used to regularly eat their pizza when I was younger & spent my summers here at my grandparents house. I haven't been back in years & I honestly expected a huge change in flavor, but was pleasantly surprised to find that they still had great pizza. 

I would definitely recommend having a few slices. They're soft and crunchy. Yum!"}
{"text":"Pretty disappointing.   You can buy by the slice,  which are square.   Extremely average pizza,  I would not recommend to a friend (or even an enemy)."}
