{"text":"Really great new panini bar in Erin Mills. Prices are reasonable and the Paninis are great. Pasta dishes are a bit lackluster but that's not their signature dish. Wines are all around $20/bottle, and there are daily specials on drinks and food items. Very happy to have them in the neighborhood. My only criticism is that the food service is too quick - appetizers and main course often arrive almost at the same time. Take your time ordering to prevent this."}
{"text":"DiSavino's is a great little restaurant in West Mississauga. I usually go there for lunch when I am in the neighbourhood during the summer.  I find the prices here to be quite good and the pricing on daily specials is very good! For instance I believe that they may still have kids eat free on Sunday, and 49 cent wings on Wed.  (Ie. tonight)

Tonight I tried the spicy sausage penne.  The noodles were done perfectly, and the sauce and sausage were very spicy true to the dish.  I have had the Paninis here as well as the spaghetti and meatballs and both were very good.

The servers are always very friendly and have helpful suggestions.  Overall this is a good laid back place to go for good foods, good portions and at a good proce."}
{"text":"Ok, went in Last night for the first time...wings 49 cents, enough said. So .......4 guys in the kitchen.....I believe one was a manager, nobody wearing hair nets. Tables and chairs full of dust, floors dirty......cob webs on the windows and the alcohol menu. We ordered 2 cokes $1.89 each, the waitress brought us a couple cans and glasses. I can't believe how empty it was, yet our waitress took forever and didn't seem to act like she wanted us there. Service was soooo slow that I kept thinking....maybe we should have just went out for subs. That being said, the wings were some of the best I've ever had. I only ordered 10 and really wanted more but the waitress took so long that I lost the mood to order. So I took my bill and went home mad and still hungry, I give 2 out of 5 stars only because the wings were outstanding."}
{"text":"Went today with a gropon. I really rate this a 3.5 not 3. The food was fresh. The server was nice. The decor was pleasant. However the food was blandddd. So that really takes down the rating for me."}
{"text":"Nice place for a good, appetizing lunch. The specials are great, especially the panini with a drink a side for 9.99 which I've ordered both times. 

I've been here twice and I've been satisfied both times however the speed of the service could use some improvement. It took about 30 minutes for my panini to arrive despite limited patrons in the restaurant and I was on a work lunch so time was tight. The servers were friendly, social and didn't delay a bit with the drinks.

I have to say my steak panini the first time I came was very average: just sauce, oniony, and a few pieces of chewy steak. However, my second visit I ordered the veal and it was very tasty. The little dipping sauce that comes with every panini order actually makes a huge difference in flavour.  I've yet to try the soup but the fries were fine, even though one time the server admitted my fries were sub standard and he hastily whipped up a new batch for me. 

I can't really say much about the decor besides it looking very typical of a sportsbar with the TVs and flags albeit a little crammed. A solid design, but I primarily came for the food.

Overall, I really enjoyed the food and although I've only tried the panini, I recommend that for anyone who wants a warm, delicious lunch with nothing but time to relax."}
{"text":"100th YELP Review :D

So excited to write a review for this place that I'm currently still chewing their veal sandwich add I start typing. 

Came here with my mommy and sister in law armed with a $30 Groupon without much anticipation because Groupon has let me down almost every time so far.  

We came in and were welcomed and seated about 15 seconds later. I told the server about my Groupon and she proceeded to inform me how it will work and I can show it to her any time at all.

We ordered a veal sandwich,  hot sausage sandwich (I love how they have 3 different levels of spice to choose from, but wish their hot sauce was  slightly upped) and a mushroom flatbread.  

They have a well priced menu with a great sandwich plus side and pop for $9.99 combo. We ordered 1 gingerale and asked to switch 1 to a coffee and she was very accommodating.  

The pizza has delicious mushrooms and minced garlic (nice touch) on top. It was crispy on the bottom and the cheese was melted but not falling off which was great. 

The veal sandwich was not the best I've had but I liked how after 10 mins the edges of the veal cutlet was still nicely crispy. The sandwich itself wasn't over sauced which was great.  

The hot sausage I didn't try but my sister in law said it was delicious. 

Their chicken gumbo wasn't very authentic but it packed a nice punch and the okra was a great touch. 

Salads were fresh and well dressed. 

For me the service stood out the most. Our server Sharlene  was perfect, her customer service was spot on. FRIENDLY but not fake and she checked in on us the perfect amount and was accommodating for everything. She made sure our bill was exactly the right amount for the coupon and got it just .06 over. Very sweet and professional. I'd come back just to experience the service again.  

Quick interaction with the other server tells me it runs in the restaurant. The place is small but lively and there's a huge patio. Wing specials and cheap $20 bottles of wine equals awesome!

Can't wait to come back :) Blissfully Stuffed!"}
{"text":"Nice little gem in Mississauga/Oakville spot. Place is tucked in a little plaza so it may be overlooked easily by many. I don't see ever seeing it getting busy because if it's location. That's too bad since they serve really good food.

The decor is a modern style, booths and television set up. Well lit and clean with friendly servers. The menu didn't have a lot of choices which made it easy to choose what we want.

The girlfriend got the meatball hot panini and I got the philly steak panini. The downfall was, the order took about 15 min to get to us, pretty slow for a slow place restaurant. It eventually got to us, and it was worth the wait.

Both the meals were flavorful, tasty and very well seasoned. The sides of fries or salad was a delight since they give you a handful. They also serve the sandwiches with a level of hotness bonus points for people who likes spicy goodness. For 10 dollars, I would definitely go back and try another meal.

If you are around the Oakville/Mississauga dundas and Winston Churchill, try this joint. You Won't be disappointed."}
{"text":"This is a new place that just opened up recently so I'm gonna be gentle. 

The service here is great! The food is okay, nothing that you can't fix up at home. Every night here they have some sort of special and I came on a Friday So it was half price nachos. For some reason the nachos weren't so great. Then I got the mild veal panini with provolone. Since this is in fact a panini bar I have to try their paninis, right? The veal was kind of dry with not much taste to it. Other then that though our waiter was really nice and attentive! 

Not sure if I should come back, but I really want to try their 49 cent wings on wednesday. I'll keep you posted yelpers!"}
{"text":"Good not great. The sandwiches are mediocre at best, but the antipasto app is great. I always order that when in there. They have $.49 wings on Wednesday and also have daily specials that are also decent. 

Service is quite good as it's never too busy for the amount of staff. 

Place is cozy an inviting. Sufficient tv to watch a leafs game, which they also have food and drink specials when televised. 

Tip. After 8 every night is half off apps"}
{"text":"Always enjoyed the food, paninnis are great and the Mangia Tutto special is a good deal, but the evening service is slow and the food was not its usual fresh and delicious self! Lunchtime is so much better!!"}
