{"text":"Food tastes just OK, but portion small !! Came at 2:45pm and asked for lunch !! But the staff only give us tea time menu and dinner menu!! Finally we order 6 tea time dishes for 3 people and cost us $36 and more!! But we didn't feel full !!"}
{"text":"The food is quite comparable against similar restaurants above 16th avenue. Usually the service is okay (on and off), it's a busy restaurant during lunch hours since pricing is around $10 per meal. A pretty good deal with soup, a main and a drink. Food rating 3.5 star, considering there's not much above 16th avenue.

As for service, I'm giving them a 1 star due to my own experience with service. The menu was a bit confusing if you're relying on English. Thus the confusion during ordering - server was raising her voice and concerned herself in correcting and made sure the whole restaurant can hear that I had ordered the wrong item, instead of explaining. Just wanted a simple plate. After that, the server couldn't cool it off and started to be rude towards the whole table of 6 until we left. I'm glad she got what she wanted in announcing her knowledge with the menu and lashing her waitressing stress towards our table. 

Personally will not return, similar to better restaurants below 16th avenue. I'll save my family a better experience elsewhere."}
{"text":"Visit here for lunch and afternoon tea mostly.  Great price.  Awesome food choices on the menu.  A mix of Hong Kong style cross western.  For lunch, best thing is, if I decided to skip the carbs they replace it with a few more veggies. 

Always top notch service, quick and polite."}
{"text":"I love this place the food is always delicious. Some staff may have difficulty speaking English but other than that its a very good restaurant to visit ... after noon tea has the best deals!"}
{"text":"Restaurant has comfortable decor that's good for family, business lunch, even couples. Food quality is as good as one would expect from a hk style western restaurant, maybe better. Good value too."}
{"text":"My favorite HK style cafe! I come here every weekend  Great food and love their HK style tea. Cash only thou"}
{"text":"This Hong Kong style eatery is a step above most of the other ones that I've been to. First off (and this is a definte must for any HK cafe), the tea and coffee are very good. They have afternoon tea speacials that include main meal, coffee/tea, choice of two soups, and garlic bread. Believe me, after this, you'll be uncomfortable full - though in a good way. I've had the curry brisket with rice, pork chop spaghetti with tomato sauce, Portugese chicken, chicken wings, and a couple of the noodle soups.  All were very good. Like I said, this place is a step above the average HK Cafe. Yes, I'd say it's a little more expensive than average but you get a lot and the food is good. Service is above average, not great, but it's usual fairly busy so the servers tend to be running around a lot. We've only tried lunch, never dinner."}
{"text":"Last time I went there with my in laws; service was extremely slow... We were there for 2 hours to have LUNCH :(.  This is the reason why I stopped going there... 

Until yesterday (2 years later... Haha... Yes, I remembered; I don't know why) 
The waiters and/or waitresses had no facial expression, a blank face but I don't mind at all... As others mentioned, they are like pricey Cha Chan Tang so i don't expect much.  Again, food and service took longer than regular HK Cha chan tang but we were able to finish our lunch in a hour.  

Caesar salad was fresh, the dressing was on light, vinegar not creamy side which I like.  I personally don't like the creamy, white Caesar dressing.   Right amount of dressing tossed with their own baked croutons no bacon bites.  
The chicken steak seasoned well, tasty, juicy & tender.  
Hot lemon tea or lemon water came with 3 slices of lemon (regular cut/thickness) which was pretty generous compared to others (super thin ones) that I could taste the lemon flavour.
I like the texture of their shaghetti, just al Dante; perfect with any sauces. 
Well, it seemed like most of their lunch deals are at around $9.99.  I don't mind because the food quality is much better than a lot of Cha chan tang and we don't feel rush to finish our meal.  

Yes, I am pretty sure we will go back again."}
{"text":"Garlic bread is ok but the mushroom soup is a bit watery.

I ordered a lunch set of assorted seafood with spaghetti in tomato sauce. The lunch set comes with the complimentary mushroom soup and a slice of garlic bread. The garlic bread is good, toasted and warm. The mushroom soup however is a bit watery to my expectation.

Shortly after, the main course of the seafood with spaghetti arrived. There are a lot of seafood in the spaghetti. There are clams, fish chunks, two big scallops, many medium size of shrimps and a few rings of calamari etc. There are plenty of spaghetti on the plate as and it's quite filling. They are generous in terms of portion size. I can't finish everything. On the other hand, the taste of the tomato sauce that comes with the spaghetti is lean on the light side. I need to add salt and pepper to enrich the taste.

After the main course, it comes with complimentary tea or coffee. I ordered a cup of hot lemon tea. Again, they are quite generous to give me three slices of lemon in the tea. Normally, I will see only two thin slices of lemon from most of the other Chinese cafes. 

Conclusion, the taste of the food is not too bad. I will come back once in a while."}
{"text":"Come here often, great food great service, but try to avoid being served by the rude not tall chubby lady who treat us like jail cell inmates.  Sad to see her bringing one of my favourite restaurants down."}
{"text":"Been to this cafe twice and both times it was very empty. I'm guessing it's because the food here is just average and the servers are not very attentive. The price is pretty cheap but sometimes even their soup is not very warm. Compared to other chinese cafes, there are better places for sure. Also, this cafe is located in a plaza with a big food court so I guess more people go to the food court as there is more variety of food and it also tastes a little bit better. I would also choose the foodcourt next time."}
{"text":"I came here both for lunch and dinner, and I thought it was a fairly enjoyable experience. If you want an affordable and filling lunch I would recommend coming here. They have ample lunch and afternoon tea specials, and food comes quick, and despite the relatively lower pricing the quality of the food is still fairly good! In terms of dinner thought the prices do increase substantially with dinner specials starting from around $15, BUT you do get what you pay for since your meal comes with a drink, salad and dessert ( which isn't just a ball of ice cream, I got a pina colada pudding when I went), and the size of the entree itself is also very hefty. In terms of food alone I think this place does deserv a good 3.5-4, BUT it was lowered largely due to the slowness of the food during dinner time as well as some service issues. For the food during dinner time, I think we waited a good 30min before our entrees rolled out, and I think people around us were waiting about the same amount. However the restaurant was neither busy or newly opened so I don't quite understand why the kitchen would be so behind. Now for service, I noticed that during lunch time a waiter was just looking at his smartphone while putting utensils away. I also found it disturbing that he was cleaning utensils right in front of me which basically involved him wiping them down after taking them out from a pitcher of water with a dirty cloth. I find that problematic because 1) it didn't seem very clean 2) I don't think this is something for customers to see out in the open. Normally these things don't matter to me when I'm going to a HK style cafe BUT Dickens has always tried to go down the \"higher/more expensive\" route, so my expectations for service would be higher as a result. Overall, pretty good place to go for lunch, and may dinner on occasion."}
{"text":"Been here a quite a few times, and have been trying to get myself to finish this review. They offer quite a wide variety of food options and seems to be similar to a Hong Kong style cafe, but a little better.

The restaurant has a good amount of tables, but you'll find a lineup whenever you go around lunch or the weekends. Lighting is a bit dim in parts of the restaurant, but you can still see you food is the most important thing for me.

I typically find myself here for lunchtime, which has me ordering off their lunch specials. Quite a good deal for their price as you get your meal, soup (with garlic bread), and a beverage. I typically get one of the pasta options, and the food is usually okay. Their borscht soup is one of the better ones in the area, with good flavour without being too sour and lots of ingredients.

Service is usually quite good as well, as servers come around and everything gets done quickly. Some areas of the restaurant aren't in view of their bar/kitchen area, so those are the less tended to spots.

A good place to come once in a while for lunch, but that's about it in my opinion. Lots of similar restaurants in the area, so if you're into this kinda food, it's worth trying/exploring."}
{"text":"HK style menu.  Price is not bad especially if you have the 10% discount card.  My favorite is the pork knuckle / hock.  I would give this a 3.5 star as i do tend to come back."}
{"text":"This is my second time coming here and I still love this place!! The food is always good and their HK style tea taste just like the one I have in Hong Kong. The prices are very cheap which makes everything taste better.

I had a very simple noodles with sausage and scramble eggs. Yum!!! It comes in huge portion too!! Look at the pics! Yum!"}
{"text":"Let's get the bad stuff out of the way:
The cream soup is bland. Hardly any taste. 
The garlic bread is soggy  
The Hk milk tea is on the weaker side 

Now, onto the good stuff:
Generous portion! Enough for two meals. 
Service is fast. 
The restaurant is nice and quiet (on a weekday)

Let's face it, I didn't come here expecting awesome food. It's just this place used to be my childhood favorite. And as I grew older, I suppose my palate got more refined hehe, and I like to venture out to try other food. But once in awhile I like to come back to good old Dickens.

Bonus: the most exciting part about your lunch could be eavesdropping on the conversation at the next table. You never know what you are gonna get...."}
{"text":"Dickens Café has been around for some time as a business.  But several of their locations disappeared off the map for a series of years.  

Dickens is Western food prepared to suit Chinese taste buds, not dissimilar to a Hong Kong Style Café though the food is predominantly more Western than the former.  

While there was a big sign on the exterior mall board, there is no signage attached to the mall.  Just walk inside and you will find it.  

You can order either lunch/dinner sets or à la carte.  

We came for dinner with my uncle and aunt and they ordered the Set Dinner for 2 which included 2 soups (choice of cream soup or \"Borscht\"), a bread basket prepared à la Chinoise (e.g. the bread is slightly sweet), a Shrimp Linguine and Chicken Steak with beverage (choice of HK-style tea, coffee, or lemon tea).  

I opted for the Red-Wine Braised Oxtail (choice of either rice or spaghetti).  The oxtail was very tender, and the rice soaked up the sauce nicely.  It was a thin sauce as opposed to a thick sauce.

My cousin ordered a Shrimp & Garlic Angel Hair Pasta which was very good.  The sauce was creamy and the pasta was cooked to a perfect al dente.  

I loved their (warm) bread.  It didn't even need butter.

It is definitely a pricier alternative if you're looking for Chinese-style Western food, but the service was great.  Our glasses were always refilled with hot tea when they were nearing empty, and the servers took away our dishes promptly and came to take our post-meal drink orders quickly."}
{"text":"Really enjoyed coming here. Service was pleasant and atmosphere was comfy. They accept cash only. Food was great. Quantity and quality was perfect. Small place so depending when you go you're going to have to wait. Menu has a variety of dishes but not to much that you are overwhelmed. We ordered the curry beef and the pepper steak. Curry was a little spicy. Not a first but the more you eat, it creeps up on you. Very accommodating for babies. Down side, the bathrooms are in the mall."}
{"text":"Always good HK style lunch and dinner. Been going to all the Dickens cafe for as long as I remember. Parents were very close to the original bosses of Dickens and once they left Dickens to retire, it started switching hands many times so we've been on and off but looks like they are starting to bring back the Dickens quality we have expected when the original bosses first came up with Dickens cafe.

You can get a VIP card for 5 bucks and get 10% off your bill everytime which is a pretty nice perk and it works on all Dickens cafe locations.

They have a good afternoon tea lunch pricing but there won't be bread or soup provided with the meal. Most dishes cost about 5.99 with drink included during this time. Definitely worth a visit in this location or the one in Scarborough."}
{"text":"I visit Dicken's once every few months and I am a fan of this restaurant.

They consistently give serve me big portions of good to excellent quality food and the menu offers a large selection of items at relatively inexpensive prices.

In my most recent visit, I ordered a Chicken salad for lunch.  They served me a salad on a big plate with a big helping of chicken, some cashews, lettuce, tomato, cucumber and raisins.  The salad was light and refreshing to eat and the seasoning on the salad was just right.  Because of the large portion, I felt pretty full after lunch even though I was eating salad.

This place has some specials (I have a friend who has VIP membership and gets 10% off the bill every time they eat here), and they give you a complimentary drink if you order from the afternoon tea menu between 2:30-5pm.

The restaurant is a little bit dark inside and usually very busy.  The service staff prefers taking orders in Cantonese, though they also speak English and some mandarin. 

I have consistently had excellent food at Dickens Café.

4.0 / 5.0"}
{"text":"\"Ok!\"
I usually go here, price is pretty fair.
Perfect for dinner!!!
For weekends/busy nights I recommend for coming here early like 6-7 pm!"}
{"text":"More commonly known as ????? or Cousins Cafe in the Scarborough area.  This Hong Kong style cafe is located inside a shopping plaza and offer a large variety of HK food for a small price.  Definitely consider this as one of the best cheap eats in the area."}
{"text":"Food is okay typical hk cafe style food. Nothing really to rave about and the waitress mixed up my order which didn't help. Lots of restaurants like this in Richmond hill. Would I come here again? No"}
{"text":"Top notch for service and food! Well-mannered and courteous staff. The menu is very similar to most HK style cafe and I was surprised to see breakfast items being served at 12:30pm still. We ordered the breakfast with 3 kinds of meats and the baked chicken ala Portuguese style on rice. Both came with drinks and the baked rice had the extra soup & garlic toast - very nice touch!
The food was plentiful and it's refreshing to see fruit served with the breakfast, very western style. The price was $8.99 and I thought it was really decent since a drink is included. 
I would definitely come here again!"}
{"text":"Good prices for pretty decent-sized portions!! Service is fast and the food is your typical HK style tea room food. You can specify what kind of pasta you want if you are ordering from the pasta options! Neat!"}
{"text":"I've been here for both lunch and dinner and have had their specials both times. Every time I've gone the food has always been filling, and I've always had leftovers to bring home. It's kind of nice because you're paying for two meals. Although, food the next day is not always the best, I'm the type who does not like to waste food so I bring it home anyways. 

The appetizers, main course, dessert and the tea/coffee at the end especially really fills you up. I was excited to have the lobster bisque, however I thought it required a bit more flavouring. I had to add some more salt and pepper in it. Other then that, everything else tasted great! I realize every time I've ordered the specials, they do not have a lot of vegetables, so more vegetables on their dishes would be nice. 

There's also a VIP card you can get if you go there regularly. I do not come here regularly so I did not get it for myself. I find I always end up paying more every time I get these VIP cards so personally I do not get it. 

On a side note: I remember coming here with my friend once, and she happened to have knew the people who worked at this cafe and got the 10% discount anyways without the VIP card. Maybe I should go with her to this place more often ;)"}
{"text":"Went to this restaurant for the first time today.  This is not your typical cheap H.K. style cafe, all its lunch menu items start at or over $10.00.  The decoration is more of western style than typical H.K. style cafe.  All the meal comes with daily soup, if you are willing to pay $1.00 or $2.00 more, you will get other types of soups.  Hot drink is also included.  We ordered a Pork Chop in Gravy Sauce with Egg(chose of cooking) and Rice, yummy.  Downside is it was too thick for me, about 3/4 inch thick.  The other item was Baked Chicken with Cheese and Fried Rice. My wife said she was satisfied with it, I tasted a bit and had to agree with her.  The servers were friendly, hard to find in H.K. style cafe.  I would recommend it to any one who likes H.K. style cafe."}
{"text":"Nothing special.

Ordered for dinner:
Ox-tongue combo ($20.99);
German pork hock combo ($16.99).

Positive reviews on Yelp are quite unbelievable...NOW.

Either these reviewers like bland food or never ventured other HK cafés."}
{"text":"Came here for afternoon tea (2:30 to 5:30pm). This place is considered a Hong Kong style cafe in my books but at a higher level. They do have many dishes that are comparable with expensive Italian restaurants.

Curry chicken with rice $6.99 - nice portion of meat and a tasty sauce

Salmon and chicken with angel hair noodles in cream sauce $6.99 - smoked salmon was fresh and tasty. The cream sauce with chicken and noodles went well with the salmon. Portion size was decent.

Deep fried chicken wings with potato salad $7.99 - chicken wings were done really well. Didn't really like the potato salad. It had no taste.

Seafood spaghetti $6.99 - nice amount of seafood for the price.

Meals come with drink but we upgraded to Horlick for $0.50 each and iced milk tea for $1.25

When compared to other Hong Kong style cafes the prices here are on the high end. Usually during afternoon tea in other places the prices are lower or the same but include soup and iced milk tea.

When compared to Italian restaurants the prices here would be considered very lower. So I guess the price could be considered high or low depending on how you look at it. Quality is definately a step above your standard HK style cafes."}
{"text":"This is a great place for a quick meal. Service is efficient, good tastes great, portions are large, and the prices are cheap (under $10). The milk tea is wonderful here, so I recommend any menu item that comes with soup and tea."}
{"text":"My favourite place for spaghetti for an HK style cafe. It is the best Chinese run cafe that I've experienced so far. Service is great and yes I have their VIP card. 

The soft Italian garlic bread and soup is a delightful appetizer. Their mousse desert ends the meal off nicely. Meal combos include appetizer, desert and a cup of milk tea.

All of this could be had at a reasonable cost. Wifi is also available. It just can't get any better."}
{"text":"Another cha-chan tang, this one is another of my family regular fall backs. 

coming here for Lunch is a better deal - since they have soup, garlic bread and drink to go with your entree - plus it is usually way too much food for me to finish - so I almost always have leftovers for lunch the next day. 

Favorite dishes is their curry anything and their pan-fried fish with veggies. 

Their dinner is more pricey and comes with almost the same stuff as lunch - minus the garlic bread for a regular roll and add a dessert - sometimes a slice of cake or a pudding of sorts.

They also have free wi-fi as well -and a VIP program which is worth the $10 since you usually make it back within 2 visits or if you are my family and go every other week."}
{"text":"Cheap HK cafe food with lots of selection and lots of MSG....want an alternative to McD then go here....they have $7 lunch combos that come with drink and soup
Get urself a free sing Tao newspaper and enjoy the canto drama on TV"}
{"text":"Its your typical Chinese western style restaurant with pork chop and steak. Ordered the curry veal which was pretty salty, the waitress were nice enough to exchange our dish with another but generally speaking all 3 of our dishes was nothing special and a little bit pricy...oh yea they also offer complementary soup, so we got the crème soup that came with shredded crackers on top....the crackers were stale, thought dickens would have better quality food but they went down hill just like how this plaza is going down hill as well"}
{"text":"4 star for service, 3 star for food. I had a craving for spaghetti and meat sauce today, so we drove up to this restaurant which we haven't visited for a year (or two)

 We also ordered braised oxtail in red wine sauce. The spaghetti was just like how we remembered it (even brought back some childhood memories- I used to eat that a lot back in Asia growing up!) the oxtail was not very chewy, but it could have been more tender. The oxtail came in a set course with soup, bread, a drink and a small piece of cake. The cake was light; we ordered hot ovaltine for our free drink but it was too watery. 

Service wise, we dont ever remember Dickens servers being this polite, ever. So that made it an overall pleasantly surprising experience."}
{"text":"3.5

Thanks to the wonderful Jennifer K for helping me out with the name of the place and it's listing on Yelp.

Pros:
Nice Decor
Prices are cheap

Cons:
Portions are smaller

When I first got here, I searched high and low for an English name to the place.  All it says on the sign was \"cafe\".  Everything else was in Chinese.  The menus provided no help as there was no name on that as well.  Finally, I found the dine safe certificate and it said Dickens.  I quickly proceeded to use this name for Yelp.  Luckily for me, resident super yelper Jennifer K sent me a message helping me out.  Turns out Cafe is the real name of this place after all.  

Located in the Dynasty Center plaza, this place can be tough to find if you don't know about it ahead of time.  We only found it by chance because were driving around looking for a new place to try. I really liked the decor of the place.  It's got an outdoor garden patio type of feel.  There's a lot of greens in the motif.  Despite being a HK style cafe, it feels much more lade back and very family friendly.  While we were there, there were about 8 tables occupied and all but one of them had children as well.

I ordered the fired noodle with beef with scrambled egg sauce and my gf got the baked rice with fish in spinach and cheese sauce.  All entrees here come with a drink and soup of the day.  The food comes out pretty quick and pretty good as well.  It won't blow you away but it's more than serviceable. The prices are pretty good too.  They have lunch specials here for under $6 which is amazing.

All in all, this is a nice little place to go to.  It closes at 9pm so late dinners will be out of the question.  I do like the quiet nature of the place.  Will definitely be back in the future."}
{"text":"If I were to describe Dickens, it would simply be luxury cha-chan tang.  Dickens is by far the priciest HK style cafe I've been to.  It's worth it though if you ask me!!

Pros:
\"Higher quality\" HK style cafe food
Big portions

Cons:
Prices are a lot higher than other HK style cafes

I've always wanted to try Dickens.  I've heard many things about it in the past.  Being the long weekend we took a trip up and finally decided to have a bite there.  When we come in, we're greeted immediately and shown a table.  The staff seeing we have our little one with her seat in tow, bring a blanket to put over the chair she would be sitting on to keep her seat from slipping.  That was very nice and seemed like something they do automatically.

One look at Dickens menu lets you know they don't mess around.  The prices are definitely higher than any other HK style cafe I've been too.  I've never seen a lunch special menu with nothing under $8.99.  We ordered hoping it would be worth it.  We were not disappointed.  

I ordered the pan fried chicken steak and my GF had the baked fish on rice.  All lunch specials come with soup, garlic bread and a drink.  Most places you only get a drink so it already justifies the price increase a little bit.  When the food came out, I was very impressed with the portion size.  I've never had a chicken steak so big before.  It was very tender too.  The spinach and mushroom cream sauce it came with was one of the best I've had as well.  My GF's baked fish came with the exact same sauce but with lots of shredded cheese on top.  Both dishes were very good.  They weren''t stop the presses good, but you could definitely feel like the food was of a higher quality than you would expect at other HK style cafes.

One thing to note is that drink you get with your meal.  Unless you specify it, the drink will come at the end of your meal when the staff sees you're done.  I guess they are trying to be like western restaurants in which they always ask if you want coffee or tea at the end of your meal.  We didn't know this since it was our first time.  If you're someone like me who likes to have a drink at the same time, please note this.

I noticed that some people complain about the cash only thing.  I never came before when they didn't do cash only, but you should assume all these HK style cafes are almost always cash only so it's not a big deal for me.

All in all, Dickens really impressed me.  It was an overall very good experience.  I will definitely be back If I'm craving cha-chaan tang and want a little bit more than usual."}
{"text":"I came here for lunch and I have to say their lunch specials are very decently priced. All meals came with soup, garlic bread and a drink for under $10. The baked chicken with wine sauce and cheese is by far my favorite dish. It took a while for us to be seated so I'm giving this place 4 stars. Will definitely be coming back!"}
{"text":"Now known as Cousin Cafe, this little HK cafe has all of the classics. Their set lunches come with your choice of soup (usually a choice between Chinese style and Western style), entree, and drink. Most of the meals are under $10 which is a really good deal! They accept cash only.

The meal started off with a savory Chinese soup which featured chunks of chayote and apricot kernels and was very tasty. My entree was the baked pork chop and rice. I actually ordered it because of how amazing it looked at the table next to us. The sauce was really good. It wasn't overly tomato-y and was a bit creamy and definitely dreamy. The entire top layer was covered in pork so I didn't need to ration between meat and rice. To top it all off, there was a generous amount of melted cheese which is definitely necessary. The pork pieces were also all meat with pretty much no bone or inedible parts. It did have some veggies on it that I could have done without but the undesirables are easily picked off (get out peas). I had a milk tea which was rich, smooth and hot. Perfect for winter!

The only thing I wish they could change is to use something a little more environmentally friendly than Styrofoam for their take out containers."}
{"text":"3.5 stars. Loved the value and service. Hubby and I ordered the dinner special for two. The price was approximately $40 and we each got a lobster bisque soup, entree of choice from menu (I picked baked fish), mussels, small dessert and tea. The baked fish was excellent and fresh. It was made just right and I ate it all except for the rice which had to be packed home (generous portions). Mussels were super tasty. My hubby usually doesn't like seafood much but ate lots of it. HK style tea...can't go wrong there unless there is seriously something wrong with the establishment. Dessert was the typical hk style type dessert. Little sugar and boring as hell. 

Service was great. The waiter was very efficient and we got our meal very quickly. 

We will definitely be back again soon. Lots of parking in the parking lot."}
{"text":"This is definitely a hidden place you wouldn't just pass by and notice it if you didn't look it up.

I happen to work nearby and needed a dose of HK cafe, luckily I searched and searched on yelp and found this place! 

If you're expecting excellent service, this isn't the spot for that. This place is super laid back and their service is... meh. The food is good but prices are cheap, and that's good enough for me! I'd definitely come back here since I work close by, because food is served promptly and they've got cheap lunch specials."}
{"text":"Been here a few times with the family. It's a great cafe with great value and service that, on occasion, would visit even if the drive is a little further.

Their menu is extensive and not only good for high tea, but their dinner menu is nice too...  quite westernized. Quality is a lot better for a HK style cafe. Food is \"fancier\" than the typical... serving grilled/smoked salmon, seafood, and even steaks. Today I had a light lunch... smoked salmon salad. When they mean light, they are really not kidding... felt like a couple of leaves with the meat set aside. Thus, I would have preferred a more hearty salad in a mixed bowl despite their lovely plating especially for $9. Overall, food does not feel like the fast food crap at other chachangtangs. Even drinks (iced) are served in a larger cup. Drinks (typically coffee, milk tea or lemon tea/water) are usually served after your meal (many comes with your meal) but you can request for them to serve it earlier.

Finally, a chinese cafe without crappy service haha! Servers dont give attitude or rush you to finish, and the waiter/waitress can understand english as well. Like others have mentioned, quick and polite. 

Dimmed lighting and clean. They also have a couple TVs on running the Chinese channels. Disappointed that their wifi never connects though.

Will be back!"}
{"text":"Very nice Hong Kong style cafe.  Came here for dinner on a friend's recommendation, and we did not leave disappointed.  The daily set dinner is a great deal...lots of food for around $20.  The kids meal is also a great deal at $8.  The service is swift, and friendly.  Highly recommended."}
{"text":"This is the same old Dickens I remember from my high school days.

I haven't been in years (Phoenix is a lot closer to my house) but was in the area this past weekend and decided to swing by for lunch.

We shared the baked fish on rice with tomato sauce, and the porkchop on rice with egg. The servings are still huge (lots of leftovers) and both came with a soup and drink. The meal was delicious and as good as I remember it being. The only thing I wasn't super keen on was the clam chowder. It was oddly creamy yet watery at the same time. I would stick with the borscht next time.

Service was friendly and quick and prices great.

Would go back!"}
{"text":"I wanted to try this out for the second time with a friend. The first time when we were there, both of us had food poisoning when we got home. I have ordered a baked chicken cream sauce with spaghetti, and my friend got a shredded chicken and ham on cream sauce with spaghetti. I had a shadow of a doubt, and I wanted to try it again, risking to see if the food quality is the reason why for the food poisoning... so I wanted to give this another try.

Last night around 9:15 PM, they refused to service us because they said \"last call is 9:00 PM\". If you're going to open a restaurant, do not put your closing times at 10:00 PM. I would be much happier to spend the remaining 45 minutes until closing in the restaurant, but I guess I couldn't do that. I guess the 2 star reviews on here are true. The food is not at it's best, the portions are little, and the price is overpriced for HK cafe styles.

I am safely going to say, I won't come here again. I would not recommend anyone coming here. I wouldn't even want my other friends or family to eat here and have food poisoning."}
{"text":"Love this place.  Amazing western style food.  A little on the pricey side, but you get a lot more than most Chinese cafes in Richmond Hill.

Their soups and garlic bread which come with the combos are very filling as well.  I usually need to take the main entree home because I'm so full from the soup."}
{"text":"This is a \"New\" Hong Kong Style Cafe that opens up at the location used to be Rural Restaurant and Dickens.

There is no indication of their \"English\" name on their frontage sign but only the word \"Cafe\". It does have a Chinese Name \"?????\".

Typical Hong Kong Style Chinese Cafe menu opens daily from 7:30 am to 10 pm. Afternoon tea time definitely good value as any set orders over $4 (over 50 different items to choose from!), you can get a free upgrade to Red Bean Ice drink or a cold drink!

Meat Sauce Pasta ($4.95) has chunks of meat went down well with an Iced Milk Tea! 

If you looking for some where that is affordable and decent in Scarborough, this cafe is a good place to be!"}
{"text":"There are a lot of \"Dickens\" around in Richmond HIll and Scarborough Area.  And this is one claim to be the authentic, original Dickens Cafe.

This location used to be Red Ants Restaurant, so the new owner kept most of the set up and deco, and just put on a new coat of paint.

They do have specials for any time of the day: lunch, afternoon tea and dinner set.

There are 10 lunch sets for one to pick during my visit. Priced from $6.99 and up. Which includes a choice of soup, garlic bread and a drink. 8oz Angus Steak for $12.99 seems to be a good valueI decided on the Curry Chicken with Rice ($8.99)

The borscht soup does taste fresh with tons of veggies.. however, without the usual kick of other borscht soup. Though it is really enjoyable.

The Curry Chicken and rice, I found it just tastes ok. The rice is a little hard and cold... however the Curry chicken though tender is a little cold, same with the curry sauce. There are no steam coming out to fog my camera len, so I know it is not hot :)

But overall all the items I was served were ok.. did not go WOW... but taste ok.

Service though is nice and friendly.

I will be back to try out other things on the menu.. I though remember to ask them to make it at least warmer.. they can just put them in the microwave for 30 sec before bring them to my table!

There are 10% off coupon in some of the Chinese Newspaper, so look for one before going!"}
{"text":"My family and I frequent Dickens quite often due to the proximity of the restaurant, fast service, and variety. 

My mom and I usually order the grilled salmon with potato salad and fruit. I really like the grilled salmon but for $16.99 I wish they gave a larger portion. They are generous with the potato salad, though I would gladly trade the potato salad for more salmon. Granted the $16.99 includes the entree, drink, soup, and bread - but I still think Dickens runs on the pricier side for an HK cafe. If you want lobster bisque there's an extra charge on top of the combo price opposed to the standard borsh or cream of broccoli soup but it is quite good has decent lobster chunks in it. Overall, food is standard. Nothing outstanding but not terrible either.

Service is efficient and the waitress is friendly. Meals come quite quickly.

Parking is never an issue and neither is finding a seat in this restaurant.

Get the VIP card. It's worth it if you plan to come more often."}
{"text":"I guess I have had my hope too high, with so many people telling me that Dickens serves higher standard of HK style Western food.  We ordered the set combo for 2 people ($55).  The texture of the Peppercorn Angus Steak Striploin was off.  It had been processed in a way that the meat texture was not there; it was likely a frozen steak.  The peppercorn sauce was good though.  The sea bass was fatty, but the sauce was non-descriptive.  We figured that it was based on powder milk or cream, because it upset the stomach of my BF.  Both of us liked the cooked vegetables that came with the entree.  The lobster bisque didn't have much lobster taste, as well that it did not have enough cream..  I didn't like the dessert and the coffee.

The services was fast.  The cafe was clean.  The food portion was big."}
{"text":"Service: 3 stars at most - they leave you for long periods of time without tending to you. For example, we were left to sit there for over 5 minutes without being given menus. 
Food: 3 stars at most - I had ordered the rib eye steak for about $20 only to be given the tiniest piece of meat I had ever seen for that price. Despite the sauce/gravy next to it looking hearty, it had little to no taste until I made use of the pepper and salt they provided at the table. 
Value: 2 stars - bill came up to around $35 for two lunch sets, one was a curry dish and the other was the aforementioned steak. Although it did come with soup and a drink, I would not say this is good value for a Hong Kong style restaurant as the food was at best, OK. 

I will not be coming back here because everything was at most, decent. There are plenty of other places you could go to with better food, better service and definitely better value."}
{"text":"I love coming here for lunch because they have different lunch combos everyday and portions are very good! With the lunch menu you get coffee/ tea, soup (either cream soup or borsch) and garlic bread on top of your meal. You can replace your soup with salad for an additional dollar.

I've come here so much to the point I purchased a VIP card for $5 to get 10% off my meals for as long as the restaurant is opened. 

Definitely recommend this restaurant for a nice Hong Kong styled meal. I usually have some sort of pasta when I come here."}
{"text":"I absolutely love this place. It's my go to brunch of afternoon spot. Traditional hk style dishes and prepared with no msg and real ingredients (not artificial).  

It gets really busy around 12-1pm so it's recommended to grab a table earlier or make a reservation. 

I usually get the curry pork chop - there are several good hunks of pork chop and is totally delicious. They also have beef, chicken, ox tongue.  It's a bit spicier than most curries I've tried at Asian places but tastes very good. 
The pan fried fish is good as well - very flavourful with a healthy side of veggies. 
Every meal comes with a soup and garlic bread to start and a tea/coffee to finish.  It's included in the price."}
{"text":"Been coming here since my high school days when they were at a different location.  The food is more like fusion of western and HK style.  Portions are huge and delicious! Price is reasonable."}
{"text":"Big drop in my review based on my last time there.  They changed their policy to be cash only and the quality was just a bit off than what I normally expected.  *Sigh* they used to have a higher standard of HK style food, now it's just dropped down to blah.  Then again L'Arc de Triomphe and La Piazzetta Ristorante which also had a higher standard of HK style food also went down hill the last few times I went.  I do hope that Firefly isn't affected, that's about the only high end HK place I haven't gone to lately.

I recently ordered the meat sauce and spaghetti there, which is my benchmark dish for HK cafes, but the last time I went there it didn't taste like their normal fare which had a tinge of something that made it special.  The last time I went there it just tasted like the meat sauce and spaghetti you get normally from other HK restaurants.

The place looked gloomy the last time I was there as well.  It felt like it was bought by a new owner who didn't really care much about it.  It reflects in the decor and the taste in the food.

Per my colleagues comment, it may be an off day for the chef because I normally go there only on the weekends.  So I may give it another chance in the future."}
