{"text":"The service felt rushed, our server did not seem interested in being friendly. Didn't come back to see if things were fine, just picked up the empty baskets after half an hour. For the price paid, the burger was small and I didn't feel like paying $2.40 for fries when 2 of the burgers came with them. And on top of that it was somewhat dry, obviously was done on a hot plate and not a grill. Overall, not an experience I expected from a burger place. I can definitely make much better burgers at home and I won't forget the extra bacon I asked for..."}
{"text":"I'm all for a dive of a burger joint. But I have to be honest: this was one of the worst burgers I've had. It didn't taste like any meat I've ever had but it did remind me of one thing: the liver my mother used to make for me as a kid. Burger was dry and gritty and had that aftertaste of liver. Man, I felt like going to get another burger elsewhere to get rid of that taste. Sorry, maybe it's an acquired taste but I grew up in America where it's pretty hard to make a bad burger. Just because you been doing it for decades is no excuse."}
{"text":"The service  was surprisingly  really good for that type of restaurant: smiling, helpful and efficient staff.

The burgers were really good and the multiple other types of burgers I wanted to try on the menu makes me want to go back. I would choose this restaurant over any fast food restaurants and the service  is really fast!

To add to all this the decoration in the restaurant is really nice and brings us back memories.

I will be back for sure Dillalo Burger!"}
{"text":"There was no burger....it was fried ground beef spooned onto a bun.  Cheese was unnoticeable.  Fresh lettuce and tomato if you like toppings.

The poutine has a nice cracked black pepper taste to the gravy.  The curds were old....no squeak.  

Go to Burgundy Lion across the street.   The poutine I saw and smelled immediately Dilallo looked much much better."}
{"text":"This used to be my go-to burger place, as they had good quality burgers and I really liked the customization options they offer for their burgers. The meat was well-seasoned and juicy, the burger itself wasn't too big, and the fries were ok. They're also very affordable!

Lately the quality has plummeted, burgers come to me sloppy and mushy, nowhere near as flavourful as before, and the fries/poutine are woefully undercooked. I usually toss the fries out as they're practically inedible. I put 3 stars instead of 2 because the price is hard to beat with the customization options and variety of burgers to choose from, but I doubt I'll take a chance on Dilallo again after multiple consecutive bad experiences with their food."}
{"text":"We came here solely off Matthew P and Rho's reviews. Being from the US specifically the South, there is nothing we know better than hole in the wall burger joints. I am always up to the challenge of testing these out. 

Diallo's was great, this was our last meal in Montreal and not only was it the most memorable, it also came out the cheapest. My wife and I both ate burgers, poutine, and black cherry sodas and together it was under 20CA. 

The burger was big and tasty and we finally got to eat poutine for the first time and really enjoyed it. How can you go wrong with cheese and gravy on french fries? 

The friends we visited are there on work visas, and they have added it to one of their new local spots to frequent. There was also a table of just 4 neighborhood kids around 10 years old that had each ordered a side of poutine. I think that is a testament to the local trustworthiness and value of this place."}
{"text":"Les meilleurs burgers économique à Montréal  avec le Patati & Patata point final.  

Pendant quelque mois cette institution à fermer pour cause de rénovation. J'ai eu peur....  surtout dans cette vague de transformation en Bar/Resto branché ou en Condo de luxe de tous se qui se trouve dans ce quartier
Les burgers sont excellant un des meilleurs rapport Qualité/ $ ! :))
J'aime aussi les hotdogs Michiganles burgers de poulet et les clubs sandwich....    
Pourquoi 4/5 .... les frites elle manque de goût et la viande des hamburger aurait avantage à être mieu assaisonné. Mais ça c'est une question de goût :)"}
{"text":"Incredible burger. A must try, and once you do you will be a repeat customer!"}
{"text":"So Dilallo's is easy to miss. Walk away from the Belle Province and the Thai express and go about one block east of Atwater on Notre-Dame and enter into burger heaven. Yes the burger is greasy, is it falls apart when you eat it. But guess what, it tastes awesome! Once you taste what this little place has to offer it's hard to turn back."}
{"text":"They have really good burgers - nice and juicy, not too big, reasonable price ($4.90+tx for a cheeseburger). You can add extra toppings like fried onions and such for an additional fee. I like their onion rings too. Their fries are very mediocre, I found them to be quite bland and unexciting. The texture is similar to McDonald's fries, for comparison. Also, I ordered a portion of half onion rings/half fries but it was really more like fries with 4 onion rings, so keep that in mind.

Service is friendly and efficient. Dilallo is a nice, no-frills burger & sandwich joint. Nothing too spectacular, but I'm glad to have it in my neighborhood. Note that it's cash only!"}
{"text":"This spot is the epitome of awesome local, mom and pop, hole in the wall burger joint.

I'm actually appalled there aren't more reviews for this little gem. 

Their menu isn't large, but it has all the standard items, plus some notable extras, that any burger establishment should have.

I ordered the number 3, a cheeseburger with poutine and a cott black cherry soda.  Their burgers are no larger than an in and out burger, simple and unpretentious. The tomatoes and lettuce are fresh, and the meat is a deliciously odd, solid but kinda crumbly consistency. That aside was an absolutely yummy burger. 

They've also got some really good poutine. I may not be a poutine connoisseur  but believe me when I tell you that prior to that day I had so many kinds of poutine, I can almost label myself an educated and practiced, albeit short-spanned poutine expert. They made me some right-on poutine with creamy gravy, lots of cheese curds, and fries done right. 

Oh and their black cherry soda, perfect addition to that meal. Can't get it here in the states either, go figure right?
 
Also tried their Michigan dog, which is basically a beef dog with toasted white bread and topped with a hefty helping of meatsauce. 

One thing I also noticed is that they separate your checks per person to ease with paying at the end. 

Really loved this place. They've got a few locations but never derail from their un-franchised persona. No frills, no drama, just a great burger from a local spot."}
{"text":"Mon dieu que j'ai été déçu. Je pensais manger LE meilleur hamburger de ma vie...mais non. Oui c'était bon, oui c'était cheap quand même mais il marquait un je ne sais quoi. J'aurai donné un 3* mais la serveuse était tellement désagréable. Une madame dans la cinquante-soixantaine qui travaille le samedi. Elle était bête mais plus que bête. Je crois que ça l'a offusqué que je lui demande s'ils avaient Interac...elle m'a montré sa machine ATM (tse ceux avec 5$ de frais...) Bref, ce que j'ai commandé a été servi quand même assez rapidement, mais j'ai l'impression que la boulette manquait d'épices et d'amour. Les frites cependabt étaient délicieuse. 

Il y avait moi et ma mère comme cliente et madame la serveuse parlait de sa vie au cuisinier. Ce n'est même pas elle qui est venu savoir si tout allait bien, c'est le cuisinier. Quand les plats sont arrivé elle nous les a presque lancé sur la table. De la grande classe... Je crois que la madame avaient ben hâte de finir son shift.... 

Bref, à éviter."}
{"text":"J'étais sûre de rentrer dans un casse-croûte authentique avec les fameux Burger connu par tout Mtl...mais non. 

Avec des collègues nous sommes aller dîner là-bas. Sur la porte d'entrée on y écrit 18 et +. On sait déjà que c'est louche..tsé un casse-croute 18+...pas normal. Alors on rentre, un décor sombre et simpliste on s'assoit à proximité de la fenêtre pour avoir de la lumière (La vitamine D est très importante). 

Le serveur nous accueille et est très sympathique, rien a dire sur lui et le staff qui connaît les habitués. Malheureusement, on se rend vite compte que c'est plutôt un bar ou nous sommes...avec des loteries vidéos en arrière et le 3/4 des clients qui connaît le staff. Le menu offre des burgers choix de patates ou poutines et d'autres petits trucs de casse-croûte. Je fini par prendre un Burger régulier avec poutine. On nous sert cela sur un plateau en métal, avec la poutine et le burger emballé. 

C'est la que tout mon estime envers cet endroit est partie. Non mais qu'est-ce qu'ils ont de spécial ses burgers? Je trouvais cela tellement normal...même fade. Le pain n'avait pas passer sur un petit four..donc froid...et une galette .bien simple...Par contre, le burger à une méga tranche d'oignon non cuite..alors watch out les reflux gastrique. La poutine, les frites étaient délicieuse, mais la sauce..mmm un goût un peu trop salé, avec une épice particulière..je ne sais pas mais ça se démarquait et perso je n'aimais pas cela. Avec le coke c'était autour de 14$ mon petit trio....et une chance que j'ai pris la poutine sinon j'aurai eu fin après 1h. Ah pis okey...la j'en rajoute un peu, mais le ketchup sur notre table n'avait plus de ketchup :( Bref, je ne retournerai pas. Mais merci quand même au serveur ou gérant très sympathique!"}
{"text":"Voici, c'est simple, je suis un amateur fini de Dilallo. Depuis plus de 45 ans je recherche le goût unique du légendaire buck burger. Un peu d'histoire : le \" buck \" est né a ville Emard dans les années 1970. Son coût original de un dollar ( en anglais \"  a buck \") le rendait très attrayant pour mes amis ados et moi même, en fin de soirée, à la recherche du munchies idéal.
Le buck comprend une tranche de capicole, un piment banane, une viande que je crois mélange de boeuf et de porc , un pain burger quelque peu chauffé à la vapeur, une tranche de tomate et une tranche d'onion énorme. 
Un peu gras, un peu piquant à cause du piment, simplement délicieux comme dans mes souvenirs.
Le resto de la rue Notre Dame n'est pas celui de mon adolescence mais il capture l'essence d'une époque disparue. Les serveuses souriantes (ou non ) qui appellent tous les clients du sobriquet \" cher \" la clientele de tous les milieux, les tables collées, les prix doux en font un incontournable du quartier du marché Atwater.
Amenez votre visite, vous leur ferez découvrir le vrai Montréal."}
{"text":"Grosse nouvelle!!!!!!

Il y a un nouveau Dilallo - aka Montreal's Best Burger - juste à côté du Métro Fabre, sur la rue Jean-Talon. À la place de l'ancien café italien, le nouveau resto-bar sert des Burgers Dilallo jusqu'à deux heures du matin!! Et il y'a un service de bar complet avec des écrans géants pour les matchs de hockey ou de soccer! Le proprio m'a assuré que la viande provenait directement du Dilallo de Ville-Émard et ça goûtait a peu près la même chose. Seul hic, il me semble que les prix sont un peu plus élevés qu'au resto original, et même qu'à ceux du resto sur Notre-Dame (5.75 le Buck Burger)."}
{"text":"This is a classic burger joint which is has been an institution in Saint-Henri for over 85 years !!!! I still remember having these burgers when I was a kid.

You can really get a lot go value there and eat under 10$. Although they have a large selection of unique burgers with different peppers and mostly Italian dressings I always go for the classic burger. Whats so special about it ? Aside from putting the bun upside down, I would say you get a really good quantity of meat and the the patty isn't just a frozen patty overly processed and already seasoned it is pure Canadian beef and made in the restaurant. All the vegetables are also always fresh but my favourite ingredient is the bun !!!! You can get it steamed and moist or dry and crispy it's simply delicious !

Finally the sides well they do have good fries but if you love onion rings they are definitely amazing and super crispy not too oily.

I will definitely keep going back as you get a lot of bang for your buck and it's nice to see a restaurant successful for such a long period because they put a lot go care in their reputation and never serve something they wouldn't it themselves which is their motto !"}
{"text":"Aye, your boys back.
This place is a bang. Real talk. The burgers are to the point grade a diner burgers. Also the prices are mad cheap. The negatives are the fries are basic but that's cool fam, but the drinks smh bruh. Cans? You know its all about them glass bottles.

All in all an enjoyable place to eat."}
{"text":"Dillalo Burger est un excellent fast-food qui n'a rien à envier aux grandes chaînes et qui nous ramène à l'essentiel de ce concept. On n'y réinvente pas la roue et il ne faut pas s'attendre à y manger quoi que ce soit d'original. Cependant, les hamburgers et les frites sont excellents. La clientèle est principalement composée d'habitués, des travailleurs manuels pour la plupart. L'endroit est toujours plein de clients et, le service, plus rapide que dans bien des McDonald's. Si vous passez dans le coin, Dillalo en vaut le détour. Cependant, assurez-vous d'avoir de l'argent liquide, puisque le resto n'accepte que l'argent comptant."}
{"text":"We were new to town and craving a burger. We ordered 2 burgers, fries, one black cherry soda and  a spruce beer. Delicious."}
{"text":"There's a new burger joint in the neighbourhood! I had heard of this chain and even eaten once or twice at one of the other locations. The decor is gorgeous. On one side, there's a full bar, complete with big screens to watch the game. The lighting's well done, dim but not dark, and the service was quick but somewhat rushed.

The food was good, though somewhat small and dry.  Overall, the experience was good, definitely not a waste of time, and next time I want to watch a game. Suggestion: a few desserts on the menu!"}
{"text":"Burger bien gras. Il est simple mais fait la job.
Juste a côté du théâtre Corona donc parfait en encas de pré spectacle. Les frites sont dans la moyenne.
Au niveau du prix c'est plus que correc.
Le service n'était pas extraordinaire quand j'y suis allé mais on ne vient pas pour ca. 
Pas grand chose à dire de plus !"}
{"text":"Nice little burger spot in the St Henri/Atwater hood. The burgers are cheap and delicious for the price. Beats fast food restaurants by a landslide. The waitress was great and it seems like she's been there for a long time. If you want a cool diner burger bar, can't go wrong here."}
{"text":"This place was pleasant & friendly and burgers were great- so tasty & fresh!  The fries & poutine were so-so; nothing amazing.

Great for a quick, cheap lunch for a family.

It is cash-only (though they have an ATM machine on the premises)."}
{"text":"Good burgers, reasonable prices and fast service - what more can you ask for in neighborhood diner/burger joint. I was staying in the neighborhood on a visit to Montreal, and after a long day of hiking Mont Royal in hot/humid weather I just needed some good American comfort food. They also offer the \"trio\" option, where you can get a hamburger, fries (or poutine), and drink for reasonable price. I will admit though, the poutine was pretty average by Montreal standards. All round a good experience if your in the neighborhood looking for some quick grub."}
{"text":"I'll admit the excitement was real when I came to Dilallo Burgers and I have to say after eating their burgers and onions rings, I was quite satisfied. Price tag was less than $9 and I ordered their trio which consisted of a standard burger, onion rings and soda. The burger was good but it's smaller than expected... the patty was seasoned well and the burger came together. Yummy. The onions rings were really good!

Overall, a decent place to have lunch."}
{"text":"Not gonna lie... first time I came to Dilallo Burger, I thought that they had served me my burger the wrong side up. But then I learned that they've been on that upside-down vibe since way before Stranger Things made it cool. I didn't realize that flipping it could make a burger taste better, but the proof is in the pudding. 

Honestly, no matter what you order, you can't go wrong. But if you need to try just one thing from this St. Henri institution, it's gotta be the Buck Burger. With capicole, cheese, hot pepper, onions, lettuce and tomato, it will make you say: \"where the buck have you been all my life?\" 

In the immortal words of Missy Elliott: \"Is it worth it? Let me work it. They put the burger down flip it and reverse it.\""}
{"text":"Don't eat here. I made a delivery order and there was a long hair in the patty of my cheeseburger. And afterward I had an ache in my stomach. The non hair containing parts of the patty was also dry."}
{"text":"I came to this burger place because my friends were craving for fast food and didn't want to go to McDo. It's very fast food style and the service was quite bad. The burger tastes okay, but nothing fascinating. There are a lot of WAY better options for food, even comfort food, around that area. Wouldn't recommend this restaurant."}
{"text":"Same Old Dialallo

The place is frozen in time. Again, I through the 'one of the best burgers' thing around but this is the godfather of burgers and after years not a speck has changed.

 The bearded lady is still at the counter(part of the charm) and the Buck Burger ranks up there with the Manzo on the Montreal bucket list. 

An absolute must.

waka waka"}
{"text":"J'avais faim. Il était tard. On était en plein milieu de semaine. Nos choix étant un peu limités puisqu'on ne voulait pas nécessairement un gros souper avec service aux tables, nous nous sommes rendus au Dilallo pour terminer une soirée qui avait déjà été mouvementée. Une fois arrivé, on a vite compris qu'ils étaient sur le point de fermer, mais ils nous ont quand même servi en peu de temps.

Nos hamburgers étaient exactement ce que l'on voulait à ce moment là. Rien de super compliqué. Ça n'est pas un endroit pour un burger gourmet, mais plutôt une version \"fait maison\" de plusieurs chaînes de fast-food. La poutine qu'on a partagée était aussi bien bonne avec plein de fromage et des grosses frites qui me font penser à celles des roulottes à patates. C'est un endroit à visiter si vous avez une envie de fast-food bon, pas cher et rapide."}
