{"text":"I am gonna say this is a great greasy spoon restaurant,  It was a very nice clean restaurant we was there around 11 the place was well kept I like little home style family restaurant.  We had ordered a 6 oz. sirloin cooked medium well to me that has not much red in the middle and mine was right my partner ordered his Well Done he still seen red in the middle the only quam that I have about the restaurant is that they could have a little more sharper knifes to cut the meat.  He waitress was really nice an an courteous."}
{"text":"I'm VERY Pro-diner/greasy spoon and dive bar....that is what makes this hard to do:  I pass this place almost every day at some point. The awning gives the place great curb appeal and I finally took it upon myself to go there with two little ones in tow....  First off, as soon as I walked in, it smelled like musty death. Like water damage and abandonment. The carpet was my first suspect for the source because it just looked guilty.....you'd have to see it to believe it.....  I wasn't about to let that stop me though.  Veggie platter: Obviously not as described in the menu. Nothing fresh about it....obviously bought-in, dainty and sad breaded creations. Lowest bidder anyone?  House Salad:  Oh my. CANNED MUSHROOMS on a salad?! Moldy pepper chunks. Bad bad produce.  Cheeseburger (off kids menu): Missing cheese, seeded bun the size of my head (very kid-friendly), and the patty was dryer than my humor)  Fries: Adequate  Chicken tenders (Kids menu) : Actually not all that bad.   Service: Meh  I just felt dirty and felt like management could care less about the health or happiness of their customers.   BOTTOMLINE: If you need a good laugh or are drunk and looking for adventure....here ya go! If you are there to eat and aren't drunk.....don't."}
{"text":"Updated: I ordered from here tonight. I'm actually embarrassed for them. The food was just throw. In the box. No utensils, no napkins, no butter no syrup none of the stuff that comes with a dinner, so salads, bread etc left out. Not even any sour cream for the I guess potato skins you can see the pic, awful looking. Completely different then the order below. Wasted money.       Very good! Three ppl ate for less than $30 (delivery, eat in would've been like $23). We ordered once last month and then again last night.   We have had breakfast: Eggs (always scrambled best bet for to go food), pancakes, French toast, Belgian waffles (awesome), toast,  home fries, etc. My only complain would be their bacon could be crispier. Big friggin deal right?   Also we got children meals, good portion and sooo cheap, considering kids are just going to mooch off your food anyways so why spend a lot on their meal lol.   We also had tilapia and fries. Surprisingly good, fish is always a tricky one. The tilapia was crispy and yummy, if it was frozen it wasn't for too long bc it still tasted pretty fresh. I tried the beer battered fish too, same crispy and good. The portion is on point and you get a lot of stuff with their meals, soup, salad, veg and fries. I actually took it to work today lol.   I used Skip the dishes, which is great Bc you can see the driver the whole time right up to your door. My neighborhood isn't great so this is a better option for me. They packaged everything well, it's kinda like you at at the restaurant everything you need is in that bag. Condiments (yeah they aren't cheap with butter, syrup or ketchup), cutlery and enough napkins. I will definitely order again great option for being hungover on a Sunday."}
{"text":"I love this place because I am one of the night owls of Cleveland and will patronize businesses that stay open 24 hours.  I do not care for the neighborhood but it is what it is. The food is decent and the prices are great."}
{"text":"The service is horrible! Not a very welcoming place to eat.. the waiters complain about everything in front of the customers. Skip the dishes provides more business to this place and all I heard from the workers was complaints about skip the dish calling! \"I am so close to throwing the phone out the window if skip the dishes call again\" Also didn't bother walking all the way to the customers table to get the order they just yelled it from across the room! I believe this will be my first and last time coming to this place! And it won't be an option for me to order from skip the dishes"}
{"text":"Great 24 hour diner in Cleveland. I've never gone during the day, but their combination of menu/price/quality/hours are perfect for late night food cravings. I usually just go with a hamburger and fries, but they have great breakfast food available at all hours too.  Really hits the spot after a night out.  Will definitely be going back."}
{"text":"Ordered for first time tonight.   Food not as pictured on line. I called and supervisor would not come to phone. Tomatoes rotten. Chicken rubbery. Pita bread soggy.   I am so disappointed.   Do not order from here."}
{"text":"It was ok.  I was excited about the prospect of a solid late night option but the food was kind of lacking.  Cheap and 24h though."}
{"text":"Do not eat here if you are hungry in the near future. Slowest place I have ever been to with an empty restaurant."}
{"text":"Your usual greasy-spoon diner...and I like it!  To me, this restaurant yells \"Goodfellas\" only because there's many windows at this place. I would come here for Bible Study and I'd never order the same thing twice for breakfast.  It's great for a Sunday Breakfast and that's what makes greasy-spoons like Dimitri's stay in business...serve breakfast and you'll see people!"}
{"text":"This restaurant is disgusting! They have people strung out on drugs working there (because that's what we all want herion addicts cooking our food) I ordered eggs along with a few other things that gave me food poisoning and had me vomiting throughout the day! What a disgrace! Tighten up Dimitri's!"}
{"text":"Terrible food and service.  Server repeated order back to me and still brought it out wrong ..twice, all the while acting like it was my fault.  Rude ,  used some terms of endearment which were not at all, then didn't even take lousy cup of soup off bill after waiting 1/2 hr for lousy grilled ham and cheese on rye, which first came out on white, the 2nd time was a grilled cheese.  Would love to give no stars, but can't.  Owners need to hire non family to work there, only explanation for the lousy lazy service."}
{"text":"I used UberEats to order from here. I ordered a side order of Cottage cheese and when it arrived, it was in a Styrofoam cup and was about 2 spoon fulls, and at the very bottom of the cup was a long black hair.  then to top it all off the meals i ordered was for me to take with me that night for my lunch and dinner at work since i work 3rd shift and do 12 hrs each shift.  When I went to sit down and eat my lunch there was no utensils in the bag.  So now at 2am I am not able to enjoy my meal cause I am not able to get any utensils from any where.  So I basically worked 14 hrs with nothing to eat. And when i complained to Uber about it the only thing they said they could do was tell the restaurant of my problem and tell me to give them a thumbs down review on their site."}
