{"text":"Awesome food. The breakfast sandwich was perfectly balanced; just the right amount of spice. Clean facilities and friendly wait staff. Go now!"}
{"text":"Fantastic place for brunch in the Junction. I very much enjoyed the Salmon Jonny; perfectly poached eggs on tasty cured salmon and cornmeal cakes. Very friendly service. Highly recommended!"}
{"text":"The buttermilk chicken with waffle is so amazing, actually everything is awesome at Dirty Food"}
{"text":"Amazing food & amazing mimosas. The vibe of the restaurant is sweet and quaint. Waiting time is not exaggerated and definitely worth it... Great first experience and will definitely come back !"}
{"text":"All I can say is Yummy. Food was out of this world.  Servixe very attentive.  Only issue was length of time to get food.  Kitchen is small and it is very busy.  But so worth the wait.  Must try"}
{"text":"Way back at Thanksgiving we traveled to visit family in Toronto and decided to check out Dirty Food.  I've been slacking on my reviewing lately, so it's taken some to get this one written up, but let me tell you I still dream about this meal!

The breakfast'wich was pretty out of this world. A slightly spicy andouille sausage patty, perfectly cooked fried egg, cheese, a few greens, all sandwiched in a delicious bun. Home fries!  Ketchup and hot sauce on the table.  Other dishes our partied ordered included the chicken and waffles, the eggs jenny and the day's special of sloppy joes.  Everyone was super satisfied with their choices.

Although they have a full kid's menu, my toddler was quite satisfied with his own buttermilk biscuit, toasted and buttered, and a few bites of our meals. Bonus points for serving it on a plastic plate for him, an unexpected but much appreciated special touch.  They also have a booster seat available, another nice touch."}
{"text":"Tiny but tasty little brunch spot. 

SHRIMPCAKE BENNY ($16): 2 poached eggs w/ gloriously golden runny yolks atop crispy shrimp cakes (with chunks of shrimp and potato), dill-hollondaise and crispy fried capers. More dill and more salt (more capers) would have made this dish perfect, with a dust of fresh ground black pepper and hot sauce. (*bonus points for having a real pepper mill). Ordered with....

1/2 & 1/2 (+$1): SPICY FRIES + SALAD: Salad was mixed greens and julienne beets with a smoky tasty dressing. Spicy fries were the only real disappointment. Not spicy OR crispy... just room temp fries sprinkled with seasonings. Would not order again.

BISCUIT & GRAVY ($16): 2 pcs of extremely crunchy fried chicken smothered in white sausage gravy & served on a toasted buttermilk biscuit with delicious collard greens. Tip: ask for extra side of collards ($5).

Will definitely eat here again."}
{"text":"Me and my friends found this restaurant while searching for brunch places in Toronto. All the reviews and menu options looked great so we decided to come by on the Family Day weekend. I had emailed a couple days prior to see if we could make reservations, but they replied saying it was walk-in only.

The restaurant is quite small, so expect a line up! We had to wait almost an hour before getting a table. The food was really good, but I'm not sure it was worth the long wait. I ordered the Gravy & Biscuits (with fried chicken). the flavours were really great, but everything seemed to have been fried/toasted for too long. It was too crunchy which made it hard to eat.

I would go back, but order a burger or something else."}
{"text":"I would arguably say, best brunch in the The Junction. Always busy and never fussy. Dirty Food has a laid-back feel to it including their menu, which I would say eats like gourmet stoner food aka. the perfect hangover food. At the time I had a beet-cured smoked salmon Eggs Benny (the menu has since changed). The Grilled Cheese: deep fried pickles, goat cheese with spicy fries. Yes. Am I high?"}
{"text":"This ''twas the best brunch ever if I'd say so myself \"exquisite taste as a person coming from America to Canada for the first time\""}
{"text":"TL;DR Cozy Brunch! Lovely Cocktails~ Wholesome Food. But alas the service is hit or miss and the buttermilk chicken and waffles weren't really marinated in buttermilk :(

FOOD (4/5) 
BLESSED CANDIED JALAPEÑO CRISPS! Such a unique garnish to call your own. The buttermilk cornmeal pancakes were lacking in someway and I'm not sure how, maybe a distinct sauce for it??? I know there was syrup already there but it didn't quite fit for the dish. The buttermilk chicken was probably just battered in buttermilk instead of marinated and I heard the burger was really good and juicy - my friend 2k18.

SERVICE (3/5) 
I didn't really feel welcomed at first by one of the servers??? It seemed like she was already done her shift and was like OMG I WANNA LEEEEEAVE, but the server who came after made me swoon because they were so nice and charming. Definately hit or miss.

ATMOSPHERE (4/5)
Very tiny brunch place, no upstairs, the decor was lovely. Not too loud just a casual amount of speaking. Wasn't quite so sure about the music choice (I'm sorry LOL if there wasn't any or if there was I can't remember). Kind of hard to close the door behind you when you come and go???

Cocktails (4/5)
Their gin and lemon is crazy refreshing and the dirty ceasar with PICKLED BEET JUICE omg you guys are killing it with the theory craft here. 

Would love to come back and amp up my review and experience more cocktails and crazy flavours! Thanks for having me and see you soon~"}
{"text":"Our new go-to breakfast spot with the little one. They cater to kids very well with plenty of booster seats and even a secret stash of books that the kids can entertain themselves with. The kids meals are reasonably sized and priced and come with plastic plates cups and cutlery. This is one of the only spots we can take our 2-year old to where she never gets upset. 
Oh, and for the adults the food, servers and prices are great too!"}
{"text":"We looked for a place online as we were en route after a 5K fun run, and decided to try it. It was busy when we showed up, but were assured tables would be clearing out soon. We had coffee across the street (awesome independent coffee joint there, take note) and they texted us when our table was ready.

LOVED THIS PLACE!!

We had trouble ordering because everything on the menu sounded so yummy. We harangued our awesome, maximum chill waiter about the fine differences between all their side potato offerings -- the house breakfast variety was like a kind of mess of scalloped potato (delicious, one of us had it), and two of had regular fries (delicious also, homemade).

I had the fried green tomato grilled cheese, which was terrifically greasy and cheesy, and a pint of Great Lakes Karma Citra IPA. Two of us had the grilled cheese and we wondered whether the sammie would have been as good without the battered coating on the green tomato. Perhaps it's been tested and the coating helps maintain the integrity of the sandwich, given all the oozy goodness. Not sure, and no matter, this is a great sandwich. I can't wait to come back here and try more things -- I was happy with my plate and still jealous of everything my dining companions had. 

Good prices, nice vibe. Open kitchen -- you will leave there smelling like your breakfast ;)

YAY DIRTY FOOD!"}
{"text":"I came here for Christmas Eve day breakfast. I was afraid it would be packed but luckily we got the whole restaurant to ourselves for most of the morning. I have to say, their food was really spot on. I ordered a shrimp cake benny and it was my first time having eggs benedict in a really non conventional manner. The exterior was crispy, and the shrimp filling was soft and crumbly. It was so tasty and a really good combination. Talk about low carb (sorta) ! My boyfriend had the pierogis, and I got to sample some...well more like I requested to try one. The pierogi was slightly charred on the outside and the potato filling was really good. 

Service was attentive and the staff were warm and welcoming. This is always bonus points in my books. Nothing worse than unfriendly service

 Dirty Food is a nice casual breakfast/brunch spot in the Junction neighborhood and I highly recommend trying any of their bennys, especially the shrimp cake one!"}
{"text":"I am not exaggerating when I tell you that this is probably one of the best brunch spots in Toronto. It's a small restaurant with a small menu that makes a big impact in my heart. I came in and was super confused because no one greeted us. (They were pretty busy) After an awkward minute, I went up to the cashier and asked if there was a waiting list (there was). Thankfully my sister and I were able to snag a seat at the \"bar\" for two. (My advice to newcomers is, if you are not greeted within a minute or so, go up to the cashier and ask for a table or if there's a waiting list). The staff at this restaurant made the experience so enjoyable. My waitress in particular was so skilled at making drinks and it was such a treat to watch her make some of the cocktails right in front of me!
 
I ordered an Eggs Benedict (Eggs Jenny). Instead of the Peameal Bacon, I had Fried Crusted Green Tomatoes. To be fair, the tomatoes were much more sour than I expected, but I still loved the dish overall. You absolutely have to get your meal with home fries. I have no idea how they did it, but these are the BEST home fries I have ever tasted in my life. They are peeled very thin, have a nice crunch but still semi soft. They are seasoned with this seasoning that was the definition of divine. I also had a taste of the Chicken and Waffles. I am normally not a fan of jalapenos, but candied jalapenos are something I can get down with! The chicken was fried beautifully. It was moist and tender. The waffle with the maple syrup complimented the chicken so well. 

I am coming back for sure!"}
{"text":"Solid food.  Good service.  If you are looking for breakfast or comfort food, this is a great choice.  Be warned of limited seating as the place is small and it's closed on Wednesdays (which is a bit odd to me).  With that in mind, one of the top choices to eat said food in the area."}
{"text":"Came here to try it out, service is amazing. Food was really good, big portions for what you pay. We had the breakfastwich and the Johnny cakes.  Both really good.
If your in the area it's a must"}
{"text":"I had the shrimp cake benny with craft creme soda and dude had eggs jenny with black cherry craft soda. 

This is a brightly lit, skinny brunch place. Very vibrant and cute ambience. It's a very date-y place. 

Server was nice and came to us at frequent but not annoying intervals.

I really liked the shrimp cake!! It had fried capers and came with a choice of home fries or greens or fries, from which I selected home fries. The shrimp cake was springy and tasted fresh. The eggs benny on top of it was cooked just under medium, and the yolk seeped through the moment my fork poked into it. The yolk was extra orange too, which just means the chicken had a high carotene diet. The hollandaise was just right, no need for more salt. The yolks were extra nice to look at.

The bennies were definitely beautiful. They seasoned it just right and I wasn't dying of thirst. I def prefer the shrimp cake benny over eggs jenny. Jenny had some bacon but it was very fattening. 

Their soda was nice but I prefer Wildly Delicious from Distillery. 

Defo reco here for a cute brunch date.  

Deducted 1 star because it wasn't like life-changing, but it was definitely really good. Also, there was hardly any air circulation. It gets heated fast in there."}
{"text":"This small restaurant is delicious, consistent, and very quick! I've been here over a dozen times now and I have yet to be disappointed :)! Even on a rather busy Sunday, I've never waited more than 20-25 minutes to be seated. The wait staff are very attentive, knowledgeable, and friendly.  I've eaten quite a few meals here but below are some comments of my most frequented selections:

Smoked Salmon Jenny: This is an eggs Benedict on their \"Johnny Cakes\" (flap jacks I believe). The dish is very good! The poached eggs are always wonderfully runny and the hollandaise has a nice little spice to it. They are topped with a few fried capers and dill. It's a really nice balance and nothing powers over the other. I usually  get a side of their home fries (which are great dipped into their homemade hot sauce) 

Burger: Their burger is a gem in this city! It's very tall and the patty is thick, juicy, and packed with flavor. They seem to change the toppings to be seasonal - I've tried two types and they were both delicious. I usually order this with a side of their spicy fries. Sometimes they have poutine specials so I've requested a side poutine with it as well (I hope they start making poutine more often, it's great there!).

Breakfast'wich: This was pretty good and flavorful, but I found the other dishes a bit more filling! Still a great dish, though

Pierogis: Very fluffy and stuffed! Would definitely recommend these if you're not feeling a standard breakfast fare.

The Basic: I've had this with their fried green tomatoes and poached eggs. The tomatoes were surprisingly very flavorful and crispy - not too heavy either. Eggs were poached very nicely.

Every weekend they do specials! Some I've tried include -
Steak and eggs - delicious! There was a large cut of steak cooked a perfect medium rare.
Rack of Lamb and eggs - also delicious and perfectly cooked. Served with sunny side up eggs, pesto, and house potatoes.
Poutine - their homemade gravy was very rich and tasty. Cheese curds held their shape and melted just a tad - fries crispy. 
French Toast -  this was served with some fruit compote. It was a bit heavy for my taste but the flavor was all there. I just prefer French toast that is a bit fluffier

Overall, a great place for brunch. Yummy, straight forward breakfast food, friendly servers, and a very laid back atmosphere. It's very kid/family friendly, too."}
{"text":"John and Leslie were great- we had a celebration for a family members' birthday. They were personable and the food was DELICIOUS!! They took care of the folks who had food things: GF, vegan, and vegetarian. Salmon was so yummy!"}
{"text":"I wish I could leave no stars since we didn't even get a chance to try the food due to the rude waitress/greeter that came toward us when we walked in. Came in this morning for brunch with my husband but her nasty attitude made me turn right around and go to Junction Local down the street instead."}
{"text":"No need for an extended review here. The food my friend and I ordered was of adequate proportions, very pleasing to the eye, and fantastic to consume!
We'll be back again, and again"}
{"text":"Really friendly and accommodating staff. Unpretentious atmosphere but high quality, very large, and delicious breakfast/brunch foods. Recommend."}
{"text":"Eggs Benedict were very good! Probably the best I ever had
Salad and potatoes were very tasty, potatoes were fried in a little potato stack- crispy on the outside and moist and soft in the inside
Only thing was the eggs benedict were on an English biscuit which made it very delicious but also quite filling! I was full after half but I managed to finish it all in the end :) I'm a slim girl but with an appetite
Eggs looked like free range as well, yolks were very nice and orange. Place was not too busy, we came around 1 on a Saturday. Decor was nice, table good for insta photos and food came quickly"}
{"text":"As mentioned before my Friend and I like to go on foodie adventures when we get together. I especially love it when the place is within walking distance of her place and she's never heard of it. That was the case with Dirty Food.

We came here on a cool, crisp spring day which was a good thing considering it was a Sunday and there was about a 20-30 minute wait. It's not possible to wait inside for a table without becoming a complete nuisance to the servers and patrons. We walked outside for a bit before becoming that nuisance. Things moved pretty quickly in terms of clearing tables and seating waiting guests but they never hurried their patrons which was nice to see.

The menu covers most of the breakfast staples. My friend had the \"Eggs Jenny\" and stated it was the \"best eggs benny\" she'd ever had. Not being an eggs benny fan myself, I am trusting her word on that!

For my brunch: I ordered the grilled cheese sandwich. I must admit it was good but not great. I think my main issue was I learned that day that I did not like fried green tomatoes. Therefore, I cannot speak unbiasedly about the sandwich. The accompanying salad was very tasty.

The cappuccino's that my friend and I ordered were presented so well, we had actually been ogling them during our wait (when the servers were bringing them for other customers).

All in all, our experience at Dirty Food was really great and I would not hesitate going back and trying something else off their menu."}
{"text":"Had a sloppy joe sort of thing and it was fantastic, would go again. Restaurant embodiment of the 100 emoji."}
{"text":"Let's just call it dirty service.. if I can leave 0 stars I would.. didn't get a chance to try the food because of the rude waitress/greeter. I walk in and it's busy so I expected to wait. There was one couple ahead of me and they sat down at a post in the front. The greeter walked to the front where we were standing, I greeted her with a nice hello and she did not acknowledge me, brushed past me to get to the other couple. Not a huge issue as they were there first, until after she greeted them she continued to brush back past me as I tried to get her attention, like I wasn't even there. I wanted to give them a chance as my wife looked them up and saw the great reviews, but I didn't see how I would be able to if they pretended like I was a ghost."}
{"text":"The food is fantastic and the service is great!  We will come back soon."}
{"text":"I love this place. The food is phenomenal and the staff is so cool. Spicy fries amazing, so are all the potatoes here. Basic breakfast with sour dough and andouille sausage is fantastic.  Try the homemade hot sauce.  Seriously the rest of Toronto could take a lesson from this place. They really get it right."}
{"text":"This place is small, but delicious! We came on a frigid Saturday morning about 30 minutes after they opened. We were seated immediately, but the place was packed about 15 minutes after we arrived, with a small line (and it was COLD out). The service is friendly and attentive, and coffee flows freely (it's not overly strong, but still good stuff, and cheap!)

I ordered the grilled cheese (delicious with lots of cheese, and a fried green pickled tomato on the inside). The chicken and waffles sandwich had delicious crispy chicken (not dried out of overly oily at all) with fresh waffles. I got the grilled cheese with a side salad (just your average side salad), and my friend got the side of potatoes (AMAZING! We found out that they are sliced thin, baked in a pan with butter, but into cubes, and the deep friend...ORDER THESE!) 

PRO TIP: if you want to order half potatoes, half salad, it costs extra, but if you and your friends are okay sharing food, one of you should order potatoes, and one can order greens and you're all set!"}
{"text":"This restaurant has been in existence for about a year now, and it does not disappoint! The food is delicious and the service is down to earth, friendly and knowledgeable. I ordered the breakfast sandwich and substituted the fattier option for the fried tomatoes (albeit it's probably not that healthy either haha). It was amazing and the price was right! My husband ordered the gravy sandwich, which was amazing in its own right."}
{"text":"Really great brunch! Was seated in less than 10 minutes on a Sunday so that was a plus, waitress was very friendly and the food (got the breakfast sandwich) tasted delicious. Make sure to get a side of the fried pickles. Also good coffee!"}
{"text":"I had heard good things about this spot for over a year. My wife and I were headed to the hospital to deliver baby 2 and she was hungry so we got two breakfast sandwiches to go, the sausage kind.

The bun was insanely good, soft and golden and delicious. The sausage patty was \"holy crap this is the best sausage patty I've ever had\" good, and the two kinds of hot sauce were killer. The suicide one was my fav. The potatoes also, basically scalloped potatoes without the heavy sauce. Unreal.

Run, don't walk to this spot. Good enough to eat in your car parked on the wrong side of Quebec en route to the hospital! Have at 'er."}
{"text":"best brunch ever. 

starting with the homemade cinnamon buns...came out cold and after standing outside in -10 degree weather we expected something to warm us up. But oh my goodness! What a delight. The sugar and cinnamon in a crusty sweet goodness off of the bottom and cream cheese frosting was to die for. Didn't need it warm at all, the flavor was amazing. 

Also had the eggs Jenny. I'm a sucker for a poached egg and hollandaise and this did not disappoint. On top of a biscuit that was cooked well through out. I was the last to receive my meal because our server said there was an issue with the hollandaise. Really appreciate their commitment to serving a good meal and not just trying to get it out on the table to push people along. 

Last but not least...apple cider bourbon. Perfect blend for a late morning drink. Enough to keep warm and not strong enough to know you drank too much at brunch. Loved this place! Can't wait to go back to TO for this meal. 

Only taking off a star for the longest wait. Wouldn't take a reservation but it seemed as if they had for certain parties. Still worth it all in all, but next time will call ahead."}
{"text":"Best brunch ever! We arrived on a Saturday around 11am and only had to wait a minute while they bussed a table. We had mimosas, which come with a mini bottle of champagne ! And I had eggs Jenny with home fries, everything was absolutely phenomenal! Our server Ciaran was excellent as well. I will for sure be back and highly recommend dirty food!"}
{"text":"We came to Dirty Food Eatery with high hopes seeing many 5 star reviews on Yelp.

We stood there for over 5 minutes, without anyone looking at us, signalling us or greeting us. We had to stop a waitress (one who passed us 5 times and didn't even give us eye contact) to ask if we can sit at one of the 2 empty tables. 

Turns out they have \"a long wait list\" and were waiting for customers to return their calls and come in... 

Having worked in the restaurant industry for over 5 years, I was very turned off by the service. They should have informed the incoming customers instead of letting them wait without context of the situation, especially since there were empty tables right in front of us.

TLDR: bad first impressions means we won't be back anytime soon"}
{"text":"The food was really great, and the place had a nice atmosphere! I ordered the Eggs Jenny and the Dirty Food Cesar. The only thing that would have made it better would be if the biscuit was a little larger, it was a little small compared to the toppings. I also found the hollandaise to be a little bland but it wasn't the worst, I've had some pretty bad hollandaise in my time. My friends also really enjoyed their meals and the service was fantastic!"}
{"text":"Service 4*
Food 4*
Ambiance 4*

Brunch... it was good. Not a ton can go wrong with a breakfast place if you can serve eggs and hash browns hot.
It is very small so seating is limited.
A bonus..the mimosas!

Will definitely be back!"}
{"text":"I actually used John and Leslie from Dirty Food Eatery to cater a home party for me for 13 people. I will tell you they both exceeded my expectations!! John was the chef and the dinner he absolutely delicious!! Great chef! And Leslie was more than accommodating and met all of our culinary needs. The menu included scold and hot appetizer to start. The Ahi tuna was so fresh and delicious. We also had stuffed mushrooms 2 ways. One vegetarian option as well. The salad was delicious and the dressing was to die for. Cooked to perfection!! The entree was Salmon with a cauliflower purée and fennel which was delicious. Our vegetarian got stuffed eggplant ( heard it was awesome) and our non-fish person got chicken (again heard it was delicious). 

John and Leslie obviously knew what they were doing and we noticed how calm they were!! All and all it was a delightful meal so please try their restaurant as well which is open for brunch daily."}
