{"text":"This place is really amazing , specially they are one of popular chain fast food in China . Service is great and chicken is crunchy and crispy. Moreover taste amazing. Fully crowded and highly recommend this to all other"}
{"text":"Stumbled upon this place and tried their popcorn chicken with medium spicy ($6.99). Overall the taste was good and it was spicier than we expected, however the portion could have been bigger for the price.

A few tables and clean seating. It wasn't busy when we went. We would have appreciated if they provided self serving water at the counter."}
{"text":"As of time of writing, there are 3 other \"large fried chicken\" places within a few minutes of walking on Yonge, two of them opening up less than a month or two ago as well. So there's a lot of competition.

If you disregard most of the items on the menu, this place is pretty good.
I tried the original, szechuan, and the cheese chickens, along with the popcorn chicken and wings.

The original is alright. You can add some pepper and spice on top, but the meat itself doesn't have any particular flavor to it beyond what you would expect from fried chicken. The thickness of the chicken is not too bad. At $10, it's priced the same as its competitors.

The cheese one is folded in half, and feels a lot smaller than the others. The cheese is just some generic cheddar thing similar to the cheese you get at the theatres. I'd pass on this one unless cheese-with-anything is just your thing. However, for $14, I can't say the extra $4 is worth the cheese.

The szechuan flavor has a slight numbing feel to it on your tongue. The difference here is the meat is a bit more flavorful because it appears to be marinated in the spice. I enjoyed this one the most. It's an extra $2 on top of the original, but there's a bit more flavor if you like spice.

Their drinks are just huge mark-ups on generic 2L bottles that you could get from the supermarket."}
{"text":"As a native of Taiwan (also known as the birthplace of gipai) I approve of this place! Really tasty fried chicken, crispy fries, and the peach oolong is also really good! I ordered the spicy friend chicken and I think I like it better than hot star fried chicken!"}
{"text":"Of all the fried chicken places on Yonge, this is the one we continue to come back to. Excellent food and excellent service! The cheese chicken is a must-try and the drinks are really tasty, unique and refreshing."}
{"text":"I'm just going to put it out there: Diyijia is my favourite Taiwanese vendor for portable, fried chicken slabs of crispy happiness.  

I'll be short here to not get carried away by my usual verbage. I have tried Hot Star and Cheers Cut too, both of which cater similar products at nearly the same prices. The difference? The flavour, texture, and impeccable devotion to service.  Now, I'm not here to put down the other competitors, as their items are also great fried finds.  Diyijia just has a special place in my stomach.  

I ordered the jumbo chicken in spicy and original.  I had one of them boneless and I kept the other with the bone in. This was during the grand opening week, so I was blessed with a BOGO promotion which cut my bill in half and left we putting forward a mere 16 dollars for 2 jumbo chickens and 2 drinks (50% off).  As excited as my frugal soul was, it wasn't the affordability that won me over, though it was a great gimmick to garner extra exposure! The chicken flesh, concealed by crispy skin, was tender, fresh out of the fryer and juicy. Even the original one was more memorable than the flavoured TFC (Taiwanese fried chicken) I've had elsewhere.  Portion-wise, it was slightly larger than the slabs you get at Hot Star and Cheers Cut, so for the same price, it's quite a bang for your buck! Also, I love how you have the option to have your chicken boneless or with the bone in.  This feature isn't found elsewhere, and it accommodates those picky eaters who hate being surprised by the bone at the bottom of their chicken slab.

The workers also think from the viewpoint of the consumer. Unlike other TFC vendors, Diyijia has disposal cutlery and plates for diners to use.  In a way, they are encouraging diners to feel comfortable eating and sharing their large portions of chicken, thus making this a great spot for family and friends. I mean you would like a knife to halve your chicken instead of getting burns from using your hands, and a plate is always welcome when you don't want grease smearing all over your face from taking a deep dive into hand-held uncut chicken. Sanitation and safety are all checked off here!

However, nothing's perfect. There are two caveats I want you to know: One, the spicy chicken is more salty than spicy, so don't go ham for that if you're perculiar with your seasonings. Two, the drinks are made with cheap juices and you can taste how low quality they are. There doesn't seem to be a rule against bringing in your own drink, as I saw other diners slurping their bubble teas from other shops without any concern from the workers. As such, quench your thirst elsewhere, but make sure you buy some chicken first!"}
{"text":"I tried their Bone-in chicken with 2 chilies and all i could taste was spicy and quite bland. However, their Szechuan flavoured chicken breast was much better. Luckily i was there for the buy 1 get 1 free special, or i wouldn't have tried 2 flavours. There was no lineup when i was there at about 11pm on a friday."}
{"text":"This new fried chicken cutlet chain from China is welcomed here. Went yesterday during their BOGO. Tried their Cheesexplosion chicken, Szechuan jumbo chicken, popcorn chicken, sweet potato fries, and rose lemon drink.

Cheesexplosion cheese was like cheezwhiz, the cheesy sauce of your childhood, so it depends if you like that. I do and wish it was stuffed even more with the sauce. 

Szchuan chicken was triple the size of the cheesexplosion, and the spice was really good BUT not spicy enough. I asked for more sauces but they just had ketchup (at least for the first few days).

Popcorn chicken was average, not special but delicious. Same with sweet potato fries, they were a good amount and delicious but nothing out of the ordinary. Their drinks are very sugary if you like that.

Service is going to be slow, looks like they are still working out the quirks of running this brand new location, but the workers there were very enthusiastic and shouted hello to everyone who entered the restaurant. I just happened to stumble upon this during their BOGO grand opening sale. Awesome."}
{"text":"I ordered the cheesplosion chicken. The chicken wasn't too oily and not too dry, and the cheese was tasty but not too overpowering or strong. While the service was good and the food was also good, and compared to other stores such as Monga I had a much better experience, I didn't find it particularly impressive or memorable. That said, I would still consider returning."}
{"text":"Do NOT order the chessplosion fried chicken.....  really bad cheese........ this is such a bad representation of Chinese food...... super embarrassed....."}
{"text":"The very popular Taiwanese Fried Chicken has finally come to Toronto and everyone seems to love it! I came by during lunch to see what the big hype was all about as it recently opened and they had a BOGO free promotion. I ordered the Cheese explosion fried chicken and the Szechuan style fried chicken. There BOGO free promo came with a free drink. You spend quite a long time before you get your order as I waited nearly 40 minute to get my fried chicken. I got my free drink first and thought it was quite sweet and really nothing but syrup in the drink- wouldn't order their drinks as they didn't looking appealing for $5 each. The fried chicken isn't cheap either at about $11-$13 depending on which one you get. Personally, I don't think it's worth all the hype for this fried chicken as I've had better. To be honest, I didn't find the chicken to be overly amazing. The Szechuan fried chicken was just alright and had a nice spice to it as it will get you sweating. The cheese explosion fried chicken seems to bring the most hype here and that's what it all was- just hype. In my opinion, it was just a large piece of chicken with cheese in it and it didn't really enhance the flavour of the chicken. Overall, I felt the fried chicken was mostly all hype especially the cheese explosion one. Your money is better spent elsewhere for the money you are paying."}
{"text":"Food: 3 Stars
Service: 3 Stars
Ambience: 4 Stars

There seems to be quite a number of fried chicken places opening up in Toronto recently. I did not notice this place until recently so decided to give it a try as we recently had some very good chicken at another chicken place.

The offerings here is mainly (surprise surprise) fried chicken with some snack and drink options. You can order your food by itself or as part of a combo which comes with your choice of drink. The drinks are not your usual carbonated beverages but rather different types of fruit slushes and sodas.
We ordered some non-spicy wings as a snack as well as a lychee drink. We liked the drink as it was not overly sweet and refreshing. The chicken itself was pretty good with the batter being my favourite part. The meat was pretty good but when compared to another chicken place that we visited just recently the overall taste here just falls a little short. We were also a little put off when we found a long strand of hair sticking out of one piece of our order. The staff apologized and replaced the piece promptly but we could not enjoy the food as much as we were paranoid that other pieces had hair in it as well.

The service was fine here. The staff was friendly and took the time to explain the menu to us. The food came fairly quickly and was brought to our table by the staff. Seating in the restaurant is ok as there are several tables as well as stools along one side of the wall.

I probably would have given it a better score if not for the hair in the food. I will update the review if I decide to come back here to eat in future."}
{"text":"If you want to spend nearly $14 for a medium sized piece of chewy fried chicken processed cheese stuffed inside be my guest. That doesn't even include a drink or the fries. With all the competition around this place won't last a year. I don't know what the hype is all about.

Cheesplosian
Seasoning 4/5
Chicken 1/5
Cheese 2/5"}
{"text":"The chicken is the best chicken I ever try, love it!
I've been here for many times and tried almost all the chicken. My best love is Szechuan chicken, cuz I really like it's special Chinese spicy flavor. Truly recommend!!!"}
{"text":"I was excited to try another Asian fried chicken place. Overall, I found that Diyijia is pretty comparable to Hot Star, but with more variety.

I tried the Szechuan and the cheeseplosion flavours. The Szechaun was delicious and I really enjoyed the layers of flavour. It also had just the right amount of kick for me. For true spice lovers, it probably won't be spicy enough for you. The cheesplosion, on the other hand, was underwhelming. It looks and tasted like they used cheese wiz, not to mention the fact that it was super awkward to eat. If you try to take a big bite, a giant \"explosion\" of super hot cheese leaks everywhere and you could burn your mouth if you're not careful.

I also tried two of their drinks. I would recommend trying the rose lemon soda. It's a bit on the sweeter side, but has a really unique rose flavour. The passionate fruit slush was pretty basic and underwhelming.

Currently, the wait time was fairly long. I would recommend checking it out if you stumble by when there isn't a line. However, while the chicken was good and satisfying, I don't think Diyijia is anything super innovative and worth the half an hour wait."}
{"text":"????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????dd??"}
{"text":"Have been here four times already. We were heading down Yonge Street and stumbled on this restaurant on the way and decided to give it a try. We ordered their Original chicken bone in and  popcorn chicken combo. Comes with fries and drinks. 40 cents extra to upgrade drink size to large which we did.

I must say that Original chicken is massive. About 1.5 times the size of Hot Star. Quite juicy and thick. However I kinda like the taste of Hot Star chicken better.

I've visited this place 3 more times since. I likr their Sichuan flavor chicken the best."}
{"text":"I tried this place on its first week of opening. First of all, the staff bring kids into the kitchen. This is not hygiene and not acceptable. And they let the kids to sit on the counter next to where they prepare the drinks. I was disgust about that. Second, the flour coating is super thick. I ordered the cheesy filling one and took me 3bites to get to the meat. Last of all, the wait is super long. I got to the store at around six and didn't get my fried chicken at 7:15. The taste is ok but I don't think I'll return."}
{"text":"I think its pretty safe to say that the giant flat fried chicken trend that recently came over here from Asia is one of the best trends to ever come over, why? Because this chicken is absolutely incredible and I hate you if you don't agree with me (I don't hate you, I'm sorry). I made my first ever trip to Diyijia on Sunday after enjoying similar chicken many times at places like Hot Star and Cheers Cut and it was a long time coming (well, not long, but at least a couple of months). This place is pretty spacious inside offering plenty of seating and from what I experienced had a pretty friendly staff. I ended up ordering the original fried chicken in boneless form with an ice cold grapefruit lemon soda. The food didn't take too long to come out and whatever time it did take was because they seemed a little short staffed at the time (Not at all a complaint). The chicken itself  was absolutely delicious. This chicken has so much flavour that it leaves you drooling, literally. The juice was really good but I totally saw the bottles of Presidents Choice behind the counter so the price tag definitely made the drinks not worth it, however, they did quench my thirst. 

Overall, Diyijia was a great choice for dinner and they make some dang fine fried chicken. I highly recommend giving this place a go if you enjoy Hot Star, or even if you don't, because its awesome."}
{"text":"This is more of a 3.5 star than 4 star review. 
Location opened up a few weeks ago.  Items offered are similar to other Taiwanese Fried chicken location such as Hot Star.  Service was friendly, patient and helpful while I was deciding on what to order. I decided on original bone in chicken breast combo'ed with fries and large Hibiscus slush.  The chicken was bigger than what I got at Hot Star but the seasonings I ordered (plum & 1 chili) wasn't noticeable.  The chicken did taste good, crunchy and was moist.  I did find it hard to eat though as it was put in a small thin bag and half of it was flopping out of it.  Would be great is they put it on a plate so we can eat it with a fork and knife, and also have different sauces on their condiment area so we can dip our chicken into it.   After a few bites of the chicken I got bored of the flavour and started dipping it into ketchup.  The other items that came with the combo were both disappointing.  The fries were the greasy processed fries you get at cafeterias, and the Hibiscus slush drink was too sweet and the ice wasn't full crushed.   I would comeback here again just for the chicken."}
{"text":"Portion is quite big, good deal for its price. Chicken is really crispy, better than hotstar! I find their spicy level bit spicier than normal, I ordered the jumbo chicken with low spicy and was very spicy I had to take rests lol"}
{"text":"Came here on opening weekend and tried the Szechuan and Cheese stuffed chicken, as well as their passion fruit slush and rose lemonade.

FIRST OF ALL, be warned that if you order the cheese chicken, apparently it takes longer to prepare. I get it, but 40 mins (p sure other ppl were averaging like 15 min waits) was a bit ridiculous for putting a piece of fucking Kraft singles between chicken. Also if I'm paying 14 bucks I should be expecting real cheese. The breading on this chicken was also super thick for some reason, like I would say 1/3 the width of the chicken all around, so you can't even taste the chicken. Hot Star does the cheese chicken infinitely times better.

The Szechuan chicken was actually good, breading wasn't overbearing, the flavor was much better and they gave me an extra piece idk if by mistake or not but that was a plus.

Passion fruit slush was delicious, idk what else to say about it.

The rose lemonade wasn't bad, however I saw them make it and they were literally pouring president's choice lemonade into the cup LMAO"}
{"text":"Overpriced fried chicken ($14 after tax) that is too salty and with very thick coating (thickest I've ever seen). I would not recommend people coming here."}
{"text":"In terms of taste, I like this place better than Cheers cut and hotstar. Their spicy is a buildable spice that slowly gets spicier. So far I've tried the cheese explosion, the jumbo chicken, popcorn chicken and szechuan chicken, I liked everything. Be careful of the cheese one, I burned my thumb cause the cheese spewed out! 
I've also tried their rose soda, it's really sweet but it helps with the spice from the chicken. 

Price wise, it's not the best value as their chicken pieces aren't that big but it's still my favourite taiwanese chicken place on Yonge so far. I have yet to try Monga but the grease smell outside the door keep deterring me from walking in :(

This is currently my go-to for chicken but I have a hard time pronouncing the name LOL"}
{"text":"I came in during one of their BOGO deal days, and I'm so pleased with their quality of chicken. I ordered the regular boneless jumbo chicken just to see how their basic chicken is like.

I was definitely not disappointed. The chicken was tender, juicy, and very well seasoned. In addition, adding the deep fried element really brought it to new heights. I enjoyed biting through a crunchy exterior to meet a warm and succulent interior."}
{"text":"Nice little place with actually quite a bit of seating for its size. Finally got to try the cheeseplosion and it felt kind of average. The portion is quite large and there is a lot of cheese inside. The meat is moist and well seasoned. The cheese I feel like lacked flavour and I think they might be better off using cheese whiz like the original philly cheese steak places. I feel like hot star has a better crust flavour but its greasier than here.

I think I'll try the Szechaun chicken next time. The Cheesplosion probably just wasn't for me."}
{"text":"Tried the cheesepolsion chicken and schechwuan jumbo chicken. Chicken fried perfectly and very juicy. Has good flavors base on what you chose. The cheese was melting hot and goes well with the chicken. Service was fast and friendly."}
{"text":"Another great fried chicken place on Younge. I stopped in here and got a popcorn chicken. The food was done relatively fast. The chicken was really good. We stayed and ate our meal there. The restaurant is really neat and clean. I enjoyed my meal here."}
