{"text":"Dom's is one of our favorite go to places for good food and nice people. Dom's gives so much back to the community, which makes going there even better! Friendly staff every time."}
{"text":"At the old location everything was great! Since moving to the new location standards have gone down. Ingredients or change in recipe i do not know which. The location is nicer for sure. Seems they fell in the same trap many do...with expansion comes poor quality."}
{"text":"This place has the best pizza by far in the area.  They consistently win awards, and rightfully so.  Could eat here everyday."}
{"text":"Love the new location. Very neat and clean. The staff was very friendly and a lot of smiles. The wings were crispy with good flavor and pizza was good. I got vegetable. Wish the mushrooms were fresh and not canned but it tasted good. The dough is thinner crust and I like a puffier softer crust but overall I enjoyed the meal and atmosphere. I will be back!"}
{"text":"Great family place with great prices and good food.  We love the white pizza and the lunch specials are also good!"}
{"text":"Came here today for the first time. Pretty great little spot in the middle of Trafford. I had a burger and fries and they were really good. My wife had a vegetable pizza and really liked it. The interior is very clean and welcoming. Plenty of televisions with sports all over them. Great spot and will definitely be stopping back soon."}
{"text":"They make a great pizza at Dom's. I really enjoyed it. Going to be expanding into a great new location and I can't wait. Good food and good people. Just what the area needs. I highly recommend it. Best in the area."}
{"text":"I had the pleasure of trying Dom's Pizzeria's Food Truck and no doubt now one of my favorite food trucks!  Probably wouldn't ever patronize the restaurant since Trafford is a bit far for me.    I like the variety of the food truck menu.  Fried Dough, to French fries, steak hoagie and of course pizza!!!   I was torn on what to order and had a peek at what others were ordering and everything looked delicious.   I went with the \"pepperoni pizza\". I am a fan of the smaller size pepperoni.. you get more flavor with each bite.  The sauce was flavorful and just right - the garlic flavor was there but not too overpowering.  I am pretty much a fan! ! Thanks Dom's Pizzeria!"}
{"text":"Very good.  I had heard about Dom's before, but just moved to Trafford last year.  So we decided to give it a try.  The pizza there is very good.  Some of the best in the area to be sure.  We haven't tried anything else there, but have gotten the pizza at least 10 times already.  We got it for a big party, and many people commented how good the pizza was.  We always get it to go, but they have a nice seating area if you want to eat there."}
{"text":"Had a great experience, placed a large order for a baseball team & families. Order was ready on time and tasted great."}
{"text":"First visit and not our last!  Pizza, wings and calzone were great.  Service was good as well, thanks Katelyn ( sorry if spelled ur name wrong)"}
{"text":"Let me start by saying the flavor of the pizza was awesome. Service was decent considering the circumstances . A ufc fight was going on which was a plus. The pizza I got was paper thin which sucked because who likes a piece of pizza that is like a wet piece of paper. If they would add a few more ounces to their dough to make there pizza a bit more sturdy, they would compete for the best pie around. Oh yeah and the shrooms were canned too which is def not a plus in my book ."}
{"text":"I don't understand why but everything I've gotten from here makes me sick. The burgers make me feel like I'm going to throw up. The chicken wings make me sick the next day and the pizza gives my intestinal problems. I do not have a sensitive stomach, but something about this restaurant just makes me sick. I do not recommend."}
{"text":"Pizza..... Thumbs up! Cheese,Sauce, and Crust all delicious. Plus Real Pepperoni!!!!"}
{"text":"Tried Dom's for the first time the other day and I was impressed. Hoagies are cheap and really well made as well as all their appetizers. Cool Pittsburgh/local sports atmosphere and the staff are all really nice. Would totally recommend this place to anyone in the area"}
{"text":"There is a boy there benny i beleive. Great kidm very respectful. He is the man. The food is good also. Best Pie around. Awards to show"}
{"text":"Last time we ordered for pick-up we were told that the prices online wouldn't be honored on their website because they \"Weren't responsible for what's on there\". Not sure who IS responsible then. Second time, dined in. Ordered a large white pizza with no tomatoes. Pizza came and we were informed by the waitress that they did make it with tomatoes because she didn't know tomatoes came on a white pizza and she hoped that it was ok... and that was that.

Still will order because the pizza is too good to miss, if it's made correct, that is. Bread sticks are a hot with us as well."}
{"text":"The last two times I ordered take out the food was discusting; except maybe the soup and fries. Though the wings tasted good, they were too hard and too cooked, down in the greese way too long. They should take the skin off and make with a lught breading; would be like more homemade and be a lot healthier. The zucchini planks also was in the fryer way too long and parts were even burnt. I don't mind spending money for good quality food; in fact that is what I expect from any establishment I am paying for food. If it isn't going to be good quality food and somewhat healthy then I really don't want it. I would have been better eating a bowl of cereal or oatmeal at home. I don't care how tired and hungry I am; I will not order from them again. Ever since they moved to that location where they are now they, tbey went down hill. I am tired of paying for frozen foods that I can buy in a grocery store much cheaper. The only think they actually  homemade or fresh make I think are the soups and their pizzas, and maybe some of the pasta dishes. Also, the bread maybe and the pizza dough. Truthfully, I rather pay a little more and eat at Parente's; a little more pricy, but better quality food and a little mote tasty."}
{"text":"Been enjoying meeting lunches over the last few months here. Food is good and reasonably priced. Very few customers at that time so it's quiet. Waitress is extremely sweet. We had 11 peeps there recently and the only thing marring our visit and made a bad impression was when the owner criticized the waitress in front of us because of birthday cupcakes.  1: He has no desserts there, and  2: our group surely made him money at lunch that day."}
{"text":"Love Dom's! Several of us stop after Saturday mass at St. Regis. Pepperoni pizza with pepper rings and a couple of glasses of wine later, we are happy campers. Great, friendly service,  too."}
