{"text":"My boyfriend and I had our date night here at Doma tonight. 
It was an interesting and daring food adventure. 

Before commenting on the food, let me address the ambiance of the restaurant first. The service was friendly, good knowledge of the food, and generally very pleasant. I do want to mention the noise level of the restaurant though. It seems by where I was sitting, I got all the echo of everyone's voice and it got distracting very fast. 

Now food. Both of us went for the tasting menu. The plating of the dishes were very \"instagramable\". However, every dish except the amuse bouche, are in one plate and we had to divide that into our own side plates. Therefore it's a bit awkward at times. 

The quality of the dishes we had were inconsistent. While we thoroughly enjoyed the octopus salad and beef dish, the pork didn't go well with the sauce (it enhanced the natural pork's \"meaty\" flavour) and the seafood ravioli seemed underwhelming, as the ingredients didn't go well together. 

All in all we enjoyed the experience. Would I recommend this place to a friend from out of town? Maybe not. But it certainly was not a waste of money or time."}
{"text":"10 out of 10 will go again.. had the tasting menu and it almost melted my face off with greatness .."}
{"text":"For tldr; service very good, presentation of food was okay, but flavours were lacking and could have been bolder. For more details, read on:

The service was prompt and pleasnt, and the atmosphere was really enjoyable. We had limited time to eat but were interested in the tasting menu - our server told us the timeframe was realistic, and sure enough we were out the door almost to the minute when we said we needed to finish. Top marks for that.

That being said we were a bit disappointed though in the food itself - the presentation of the dishes was all right, but we found the flavours were not as bold as we hoped. We felt nothing stood out about the food as exceptional. We regularly eat Korean food and found that a lot of the bolder flavours which we normally enjoy so much were muted too much in the dishes. Meanwhile the French influence felt similarly subdued - the flavours were nuanced as in French cuisine, but lacked a wow factor. For each dish see below:

The amuse bouche was good, but the sweet potato and mushroom starter was a bit heavy given the main dishes that followed featured heavily in root vegetables. 

The grilled octopus was perfectly cooked and well seasoned - though the slaw, which sounded great on paper, was quite plain. 

The duck dish was the biggest misstep to us. The dumpling served with the duck was very good, though not so spectacular that you couldn't something similar at better dumpling-specific restaurants. The problem was the duck breast - the skin wasn't crispy, and the meat itself was in my wifes case raw in the centre to the point of being inedible (read - grisly and chewy). This was a real shame to us, as the purees and accompaniments to the dish were very good otherwise. 

The bibimbap was quite good, it used quinoa and black rice, which we found was a nice balance to the flavours - though unlike most Korean restaurants in Toronto we found the spice and other flavours not as bold. 

The Kalbi bourguignon thankfully was excellent. I especially liked the inclusion of the chili peppers to the dish - though I feel as though they could have added more to make it stand out from traditional bourguingnon. 

The mackeral en papillote was a nice fusion of the French and Korean influences with the gochujang on top - however we felt the fish itself could have done with a bit more salt, and the daikon given was too large in proportion to the fish offered. 

The bread pudding was very nicely done - though we felt maybe a bit full at this point with all the other starches included in the other dishes. 

The rice cake ice cream divided our opinion. My wife enjoyed the dish and felt it was the most original on offer, similar to mochi with a different presentation. I did not enjoy it, however, I found the rice cake too tough and plain. Your mileage may very. 

Overall good service and we didn't feel the value was bad for the variety of the dishes given, but the flavours of the food itself didn't live up to the price."}
{"text":"Was really excited to try this place tonight but was extremely disappointed. From the service to flavour profiles to portion sizes, it was not worth the $$. We shared 4 dishes and had two drinks and our bill came to $175 and we needed to go home and have something to tide us over.

If you are looking for Korean food go to a Korean restaurant, if you are looking for French food go to a French restaurant. DOMA is a great concept but the execution was extremely poor.

I would not go back or recommend this place to anyone."}
{"text":"Excellent meal. Great value $65 for the tasting menu and it was fun to try a little bit of every dish. 4.5 stars overall considering price point, taste, ambiance and service.

The highlights were the Grilled Octopus and Mandu scallop+sea bream and watermelon gazpacho amuse bouche with a hint of spice. Complex, well balanced and delicious.  

Pork Belly and the 'Kalbi beef bourguignon' were probably the most 'korean'-like dishes.

Could have done without the deconstructed black sesame cake (but I have yet to like any deconstructed dessert dish). The matcha green tea sauce over the fresh berries and strawberry sorbet was a nice touch; simple but a wonderful finish.

Staff was very attentive, even when restaurant was full.

Probably the best 'Korean fusion' cuisine that I've tasted (at many places that I have tried, they just use random kimchi or too much korean hot pepper gochujang paste that taste disjointed with the rest of the dish).  

Doma seemed to strike the right balance. Most dishes just had a hint of korean flavours or spices that accentuated rather than overpowered the dish. 

We went in without high expectations (since generally don't like 'fusion' concepts), but were pleasantly surprised.

Refined dining with a korean twist in a down-to-earth but trendy, Canadiana/Scandinavian-decor restaurant. Could maybe have better outdoor signage.

All in all, we would come back to dine at Doma and recommend to friends and family."}
{"text":"Enter a seemingly simple building, the interior boost of simple elegance, just well done enough it look classy. We where greeted by the manager and the chef came to greet us to make sure they could accommodate our gluten free requirements. All the staff was very attentive and service was friendly. Anticipating every need you had. The food was amazing; we enjoyed several dishes as appetizers and some of main course portions. When the octopus was served my dining companion asked for it again instead of desert. It was marinated for 6 hours and then cooked vacuum sealed. These guys know what they are doing. The Korean French fusion is done in a young a sophisticated way, unlike anything else in the city. Job well done.  Of all the places i have been to in Toronto this would be the best. Highly recommended"}
{"text":"Doma
Small Korean/French fusion restaurant tucked away at the corner of Clinton and College. Simple yet Modern Decor, not many seatings, to die for food and great service.

Their menu is fairly small that changes every season which keeps me wanting to go back every season. They do a tasting menu where you get to pick one item from every section of their menu (I believe there's 4-5, app/main/etc..) This is not what we did as we wanted more from one section than the other. It is recommended to order around 2-3 dish per person. We had 8 dishes between 4 people which included one dessert that we shared and everyone felt satisfied with the dinner.

Beef tartar was one of the best beef tartar I've tried in the city. With an interesting seasoning including gochujang it really added so much to the beef that melted right in your mouth.

Grilled Octopus was to my suprise amazing. I'm actually not a huge fan of octopus but they did a superb job with it. Even the bedding of salad that the octopus laid on was spectacular. To any fellow anti octopus people you must try this here if available as it really did catch me by suprise.

Kimchi Gnocchi was good but nothing special. Definitely my least favourite of everything we ordered but was still very good.

Seabream with mandu(dumpling) is to die for!! The fish is cooked and seasoned perfectly. Fish melts right in your mouth. Dumplings were filled and cooked to perfection.

Poached oysters was good and interesting.

Truffle Bibimbap was different which I enjoyed. It was simple yet intricate. 

Last but not least the duck was really good. It didn't have the signature duck smell which can be really offending if cooked wrong. 

Banana icecream with peanuts was nothing too special that I'd rave about.

Overall dinner at DOMA was fantastic. I would highly recommend DOMA to anyone who wants to try something different and appreciates good food."}
{"text":"We both ordered the tasting whole menu and a bottle of Pinot noir (which paired very well with the food, so good job!). Overall, the food was good-to-great, though it leans quite heavily on the French side of Korean-French fusion. I yearned for more Korean. The crudité platter was fine, the shrimp and (I think?) sea bass was great (though my shrimp was a bit flabby), and the bibimbap interpretation was warm and earthy. But I would have liked a bit more brine and a wee bit more heat. The dishes were great but suffer from too-similar a flavour tone plate to plate. 

Service was... odd. They were attentive, but something was off. I left feeling I had worn the exact wrong thing for this fashionable crowd, as dishes were explained to us as if we had never heard of Korea, much less tasted the food. Dumplings were described to me as 'ravioli' at the start, and then each Korean-specific ingredient was translated to us as in European terminology. I think they thought we were from a sleepy suburb. No other table near us was treated that way. 

The wine bottle was shown to my male partner for inspection and tasting (but I'm the Pinot nerd in our relationship). It is always better to ask who should taste, regardless of who put in the order. The small room (formerly Acadia) suffers from the same acoustic issues as its predecessor, where you can hear everyone but your companion and the server. So, I'd suggest not sitting in the centre. 

Would I go back? I'd be interested to see how I was treated were I not dressed for my wedding anniversary and was instead looking more my usual style, but there are other places with food as good or better who don't seem to judge customers. So, a weak 'maybe.'"}
{"text":"I took my husband here for his birthday and thoroughly enjoyed the French inspired food with a Korean flair. We opted for the  $70/pp tasting menu which was a reasonable price for the calibre and refined technique of the dishes. 

To start my husband had the octopus which is a dish we normally don't gravitate to but glad we did. The octopus was cooked perfectly and the sauce had a really nice and bold flavour to it. I had the beef tartare which was still very good but could use a little bit more kick or acid to it.  Next we both had the duck (duck breast and duck confit dumpling) which were both tasty and an interesting way to present duck two ways. We also both had the beef striploin on pomme puree with creamed greens and homemade chips. The steak melted in my mouth and was cooked a perfect medium-rare, and was quite a large portion size. To finish we had the Mont Blanc (never heard of mugwort before... sounds like something from Harry Potter but it's actually like matcha green tea) which was a nice end to our dinner. 

The service was very nice and attentive (I think they must have refilled my water about 10x!) and Chef Kim also popped in and out of the dining room to greet guests. It's always fun to meet the artists who've created your artful meals!

Overall we were thoroughly impressed and happy we chose Doma for our birthday celebration!"}
{"text":"Went to DOMA for a second time last night. The first time experience was well beyond expectations, last night was ok. A bit disappointed that they stopped the tasting menu format where you get to try every course format, instead you choose 4 items amongst appetizer, second, main and dessert category. Our first experience was amazing, hot items sizzling hot, almost every dish was surprisingly good, the amuse bouche was so flavorful.  Second time, there was no amuse bouche. It was very busy for a Thursday night, maybe their staff was a bit overwhelm by the traffic, a couple of the hot items out luke warm and the wait staff didn't get a chance to refill our water. Taste was still good, especially the sea bream w prawn & ravioli. Price point is still good at only $70 for tasting menu. Portion is just sufficient, but I wish they offer maybe an option where you can pay more but get the fuller experience. Hope last night was only a temporary lapse, I like this little place."}
{"text":"Went for a birthday dinner back in May and got the $65 tasting menu plus drinks. Well worth the price for being able to try their entire menu offering and for 9 dishes. Read some previous comments on how dessert people were only able to pick one - we were able to get both without asking and saw other patrons received the same. My favourite dish was the Ushun Mandoo and the Rice Cake Rolled Ice Cream. See more pictures and details on the blog: https://wywhitneytam.wordpress.com/2017/07/10/doma-toronto-tasting-menu/"}
{"text":"Nice staff, decor and presentation, however the portion sizes were very small -two ounces each plate. I had the duck and my friends had the beef, which had two, one ounce servings each. Our waiter suggested three to four plates to share but even then it's a lot of money for such little food. Hopefully, the chef's next menu takes this into consideration. Wait staff was polite and  mixed the drinks themselves, often asking each other how to mix certain drinks. I had the Old Boy, which was flat and mainly salty."}
{"text":"Dinner: 4.5/5

DomA was good to great on everything from service to taste. I can't say anything was avg. But nothing was mind blowing, though there were some candidates who did come close. We didn't do the tasting menu. The menu changes regularly. 

Pro-tip: Sit by the window to see folks getting turned away from Pinky's Ca Phe across the street :p"}
{"text":"*4.5/5

Decided to do the \"Tasting Whole Menu\" for $65, which was a bit misleading because when it came to dessert, we were told to only choose one of the two.

I didn't like that Tasting Menu for multiple people came on shared plates instead of per person plating.

The menu is very inventive and not your typical Asian fusion dining. In general, all the food was delicious, with the meat dishes being fantastic!

My favorites were the:
1. Pork jowl, doenjang, heirloom carrot, fingerling potato, lotus root, perilla, yuzu, gochujang: Very thick cut of jowl grilled with some charring on top, which I appreciated as the char added a bit of extra flavor.

2. Duck breast, duck confit, foie gras, mandoo, duck jus, persimmon, red chili, hazelnut, cauliflower puree: The duck breast was perfectly cooked, flavourful and went so well with the sauce.

The menu changes monthly so it will be great to see what they come up with every month, and if they can maintain the same creativity."}
{"text":"Very friendly staff, simple decor, great ambiance. But the seatings can be more spacious.
For $65 you could try everything on the seasonal menu. Almost every item was delicious and combines Korean and Western elements harmoniously. The portion size wasn't big, but still filling on account of the variety.
The salad was very refreshing, the ribs were super tender and flavorful. Desserts were interesting and not overly sweet. Perfect meal."}
{"text":"Pros: Nice staff, passionate chef, great decor, creative dishes.
Cons: portion, hence giving three stars, which otherwise would have been four.

Not a food critique but because of the staffs aspiration and passion, I'd like to leave a few comments.

Favourite: 
Grilled octopus - bold flavour, tender octopus, blends very well with slaw-like cabbages. 

Ok: 
Cauliflowers- buttery and savoury quinoa bed blended nicely with cauliflowers, but felt like the bitterness of mugwort overpowered the dish

Least favourite: 
Duck - three pieces of duck, personally difficult for me to chew and it hurt my jaws afterwards. Couldn't really taste foie gras inside the dumplings, felt that the skin was too thick. Left a strange after taste in my mouth which I found myself drinking lots of water afterwards.

Dessert: 
Yangaeng - nice texture, simple flavour. Black sesame seed wasn't too overpowering, great presentation.

Toasted rice gelato - has a good flavour but texture can be improved. I found the texture to be quite icy, where I was expecting it to be more smooth.

Yakgwa- top and the bottom piece of the yakgwa was separating as I was trying to cut the piece in half. It was very hard to chew and didn't have that sticky savoury taste that would come with a typical yakgwa. 

Green tea rice cake : out of the four, this was honestly a disappointment. I felt like it was just a piece of fried rice cake seasoned with sweetened matcha syrup... personally felt that match didn't blend very nicely."}
{"text":"This was epicurean brilliance at its best. To begin with, Korean French fusion in Little Italy? That alone was enough of an intrigue to get us there. And no regrets. Holy cow, WHAT a night of amazing tastes. We love good food, and are most impressed by creativity, a sense of fun while we eat, and feeling like the restaurant and everyone in it is passionate about its food, and this was it. You pretty much need a reservation. We were probably the oldest people there, in our early 50s, and LOVED that most of the place was populated with 30-40 somethings, all of whom seemed as equally interested in food as we were. This place has a great, informal vibe. It's all about the food, not about being seen. There is a tasting menu for $65 which allows you to taste everything on the menu, and this is definitely your best choice. The wine list is well thought out, and reasonable. The cocktails are all priced at $13 and WOW what choices. SO original. I had their version of an Old Fashioned, and it was spectacular. At the end I was curious and fished out the candied mandarin from the glass. The three of us shared it and OMG, it was such a treat. The food was incredible. Each dish was a twist on a familiar, sort of. Our favourite had to be their take on beef bourguignon, which included soy sauce :) The menu is small, and ever-changing, with equal emphasis on meat and seafood. Not one dish even remotely disappointed. The staff here are all working so hard to give the diners a perfect experience. We loved every minute of our evening."}
{"text":"Came here with a friend on a quiet Thursday night in December, just a few weeks after their opening. The restaurant was pretty much empty, making it feel like a VIP dining experience!

The menu changes each month, but popular dishes might stick around from the month before. We had:
-Butternut / yam soup with sticky rice doughnuts: I wanted to lick the bowl clean! Unique combo of flavours with a salty kick from the soy-milk foam

-duck 2 ways with duck breast / dumplings: this dish was okay, but the portion was *so* small. The cauliflower complemented the richness of the duck well

-parchment wrapped Spanish mackerel: I wasn't a fan of this dish, the sauce (Korean inspired with heavy chili powder taste) was overpowering

Overall impression: 
DOMA is a bit of a mixed bag - it's almost upscale dining but won't empty your wallet, with dishes encompassing a tug-of-war between French and Korean flavours and preparation techniques. Come here if you have an adventurous palate, or bring a foodie with you."}
{"text":"Had a birthday girls dinner here in sept 2017. Overall great atmosphere - cute cozy simple/minimalistic decor. We all got the tasting menu and it was amazing. Everyone loved it & we were all stuffed in the end! interesting twist in korean/french theme!"}
{"text":"The pork jowl, doenjang, heirloom carrot, fingerling potato, lotus root, perilla, yuzu, and gochujang were yet another amazing dish.  The pork jowl was slightly charred with its fat scored slightly -- it was beautiful; too bad I wasn't able to capture these details in the photo.  The gochujang was spicy enough to give a small kick to the dish but otherwise didn't take away the natural flavour and slight seasoning to the pork jowl.  The pork jowl was fatty but tasted incredible -- so fatty, moist, and well seasoned.  The yuzu was also a great addition to the dish by adding a light tarty flavour.  Yum, this was definitely one of my favourite dishes of the night!"}
{"text":"When I heard that DOMA was going to tackle a fusion between Korean and French (a combination I had never imagined), I knew I needed to try it.  

The menu includes a $70/pp four-course tasting menu but we opted to order a la carte. Our waitress told us that the menu changes seasonally. The restaurant is modern and simple and I appreciated that it was on the quieter side despite being fully occupied.

We shared the red lentil soup (which was vegan!) to start.  A little bowl came out with \"sweet potato donuts\" and some other vegetables.  Our waitress then poured the lentil broth over top of the vegetables.  I appreciated the unique presentation and that the concept, while still a soup, was unlike any other soup that I had eaten before (and I love soup).

We shared the gnocchi kimchi.  As a gnocchi lover I was curious to see how the kimchi would be incorporated.  Turns out it was baked right into the noodles. I loved the gnocchi itself - perfectly crispy on the outside while being fluffy and pillowy potato on the inside.  I didn't love the flavour because I found it a bit fishy (even though it was vegetarian) and I hate fish.  It kinda grew on me as I was eating it but it was a bit of a let down for someone who loves gnocchi as much as I do.

We shared the truffle bim bim bap which was amazing!!! The base of the bowl is brown rice and Korean mushrooms and truffle pieces.  We tried to eat it as slowly as possible to savor its rich flavour.  My husband enjoyed the sea-bream (since I don't eat fish I didn't try but the presentation was beautiful).

Since the menu changes, I would love to go back!  The service was also excellent.  The waitress was very knowledgeable about the menu and was willing to make modifications for us without compromising the dish."}
{"text":"One of the best restaurants we've been to in a while. I thought the idea of mixing Korean and French could just be gimmicky, but it's executed really well. Everything we ate was exceptional. The octopus and perch really stood out. Portions are small, the 4 course meal is suggested. Small, but good selection of beer. Service was fantastic - felt like a formal dining experience even though the restaurant had a very casual feel. Will definitely be returning."}
{"text":"We came here for the Seoul de France event, hosted by U-Feast. The event was $70 (taxes and gratuities included) and came with 5 courses along with wine pairings. Being regarded as one of the best in Toronto, this was an opportune time to dine at Doma. 

The courses were as follows:
- Moolwae (Korean-style ceviche): catch of the day / sour gochujang / microgreens / cabbage/ cucumber / radish / noodles
- Waldorf Salad: creamy perilla seed dressing / apple / walnuts / celeriac / goji berry
- Spicy Honey-Glazed Chicken Roulade: mixed nuts chicken veloute / charred onion / chili oil / seasonal vegetables
- Beef Striploin: crispy black truffle rice / roasted garlic puree / kalbi sauce / seasonal vegetables
- Mugwart Tiramisu: mugwort / vanilla / mascarpone / honey ice cream

French meets Korean, or Korean meets French, I was pleasantly surprised with the overall menu. The rhythm and pacing of the meal was fine, and the courses were plated consistently, each with plenty of white space on the dish. There were a bit of inconsistencies on the doneness of the striploin, but I guess it could be a bit of a challenge preparing it for approximately 40 diners at the same time.

From my understanding, the menu changes every month with a few items staying on the menu for the following month. The menu for the event was different from the current menu. If I were to make some recommendations, I would add the Moolwae, Beef Striploin, and Mugwart Tiramisu on the menu. The Moolwae (Korean-style ceviche) was packed with a surprisingly amount of heat for the first course. Inconsistencies aside, the Beef Striploin pieces that weren't overdone tasted great, and the sweet kalbi sauce was a nice accompaniment. The Mugwart Tiramisu, which was described to us as tasting similar to matcha, was a bit bitter, but it worked well with the honey ice cream and mascarpone. We both wanted another one!"}
{"text":"The service is immpecible and the food is beautifully presented and delicious. My only issues with this restaurant:

1) The portion sizes are very small for the price charged per tapa. 
2) This is more French cuisine with a hint of Korean. I was hoping for the other way around! I think there could be more strong Korean influences and flavours, rather than a hint here and there. 

Overall, this was a positive dining experience and some of the best service I have received in awhile...what I ate was tasty but honestly, I did leave craving more - even providing an option or two of a dishes that heartier and more filling as a 'filler' (rice or noodle inspired for example) would be helpful."}
{"text":"Really good food but prices are a bit expensive for what you get (small portions). However giving it 4 stars because the food WAS really good- Korean/French fusion. Service was pleasant. If you can sit on the left side do, we were sat on the right side and the ambience was a lot less nice."}
{"text":"excellent...felt more french than korean....$65 for the the entire menu is a good deal in my opinion...drinks a bit ovepriced ($13 for a cocktail), but maybe that's standard for higher end restaurants? stand to be corrected

worth checking out for sure"}
{"text":"A true standout amongst the many high caliber restaurants in Toronto. Every dish was a jaw dropper, from the octopus and pork belly to the calamari stuffed with jambalaya and sweet potato gnocchi. WOW. Chef Paul Kim is brilliant. He greeted our table. Ambiance is warm and minimalist, very intimate. Service was excellent - waiters were attentive and authentic. We will be back.... many times."}
{"text":"I went to DOMA with a group of 5 to try the tasting menu. The restaurant was small and the decor was very plain and bare-bones. The service was excellent and attentive. Now onto the food - I felt that $65 for a tasting menu was a great deal, however I do agree with other Yelpers that it would have been nice to have fewer sharing plates and more individual plates. The plates were all very beautifully presented and I appreciated that the chef came out to talk to us a the end of the night. Some of the dishes were OUTSTANDING - these included the little Korean pancake amuse bouche, duck two ways, grilled octopus salad, and sticky pork ribs. The duck was really moist and flavourful, and the ribs were sooo delicious. Other dishes were a bit of a miss for me - I didn't love the eggplant, fish, or mille-feuile dessert. The rolled ice cream dessert was very cool, unique, and refreshing with interesting albeit slightly muted flavours (i.e. 9 grain). I actually think that instead of the tasting menu, it would be a better idea to just get the outstanding dishes mentioned above."}
{"text":"Pros: genuine staff, dedicated chef (he came over to speak with us 3 times during the meal), simple decor, creative dishes.
Cons: it stinks of mould from the basement - try not to sit too close to the stairs. 
Staff kept telling us which are their favorite dishes as they served them... not sure we care.

Tasting menu was lovely - however, if you aren't a salt fan, beware, because everything is quite salty.
Drinks are creative and very pretty - not sure they exactly matched with the food. At times the tastes seemed to compete.

Favorites from the January tasting menu (which we were told changes every month): 
Grilled octopus and slaw salad - crunchy, great flavors.
Cauliflower  - very buttery, with quinoa.
Duck - prepared a few ways.

All the desserts were beautifully prepared... we wondered why the bread pudding was so GIANT - although it was delicious, it was almost like they were trying to fill us up at the last possible moment."}
{"text":"Surprised me with everydish. I chose whole menu tasting and could not believe that there would be a bigger wow after each dish, from the first appetizer, all the way to the dessert. I am going back in December. Maybe one more time this month."}
{"text":"Beautiful plating and lovely atmosphere. 5 of us had the set menu but everything came in 2 plates of the same size, which were awkward to share. Although plating was well thought out. Some items lacked in preparation techniques e.g. Beef tenderloin was not tender enough, berry dessert was dull, everything was just missing something. After $65++ per person, none of us were full."}
{"text":"3.5/5.

Every dish that my party had was, at the very least, good. I'd even go as far as to say that the arancini balls and octopus items were impressively tasty (sweet potato gnocchi and pork belly dishes rounded out our order). But what takes this restaurant down a notch for me are the extreme mark-up and somewhat inattentive service. You're essentially paying $15-20 for items that take mere minutes to finish. Service-wise, empty plates and glasses were left on our table for long stretches of time. 

I really appreciate what this restaurant attempts to do as the food itself is inventive and interesting...but if you're either extra hungry or extra cost-conscious, this may not be the joint for you."}
{"text":"November 2016 Menu

Everything was so good that it was difficult to keep myself from licking the plates.

Let's start from the beginning. I had some questions regarding the menu, and in no time did a very helpful gentleman from the restaurant text me to make suggestions from the menu to accommodate my pescatarian diet. 

The inside of the restaurant was very spacious and clean. Really like the minimalist decor--lovely wooden flooring and furniture against white walls for contrast. We were greeted by a cheerful girl with very cool red glasses whom had made an effort to make us feel welcome while giving us brief background about the new restaurant.

Was met by the unexpected appearance of Paul himself whom had left the kitchen to greet his guests at each table and explain about the ingredients he used for his creations. I'm not sure what the proper etiquette was, but it was certainly a nice gesture and it made us feel valued as customers.

My goodness! Each dish was presented beautifully; like an edible work of art. We ordered the:

Yam, asian sweet potato, portobello, shiitake, black mushroom, shimeji, truffle, dates dish ($14) -- The sweet taste of yam coming together with the mushroom smear tasted really nice and woody with the small potatoes. The only thing about this dish was that I couldn't taste any truffles at all, but it was good nonetheless.

Scallop, fish, prawn, clam, perilla seed,  korean chili, kimchi, yellow zucchini, peas ($24) -- Highly recommended. Was advised by Paul that he would go to the fish market himself and select the catch of the day. Not sure how to explain the flavour, but it was creamy and aromatic infused into the fish but tasted especially good with the seasoned and fried rice cakes. Never had it cooked that way before. Everything was good expect there were was only 2 scallops and 2 of the clams still had sand in it. 

Duck breast, duck confit, foie gras, mandoo, duck jus, persimmon, red chili, hazelnut ($26) -- SO really loved this one. Was told the duck was tender and medium rare. The gastronomy between the savoury and the sweet from the persimmon really shocked tastebuds. Most importantly was that the dumpling had more duck in it. A fantastic dish for meat-lovers.

Really liked this restaurant and see lots of potential. The food was phenomenal, would had been a bit better if the portions were a little bigger but If I had to comment about the food, would have to ask what is this black magic f**kery? Sooo good.

Thank you and will definitely come back again for a second date and try the cocktails."}
{"text":"We booked Doma a month ago for Valentine's Day. Its a Korean/French fusion restaurant, was one of the top new restaurants in 2017 so decided to give it a try. The service was excellent the moment we stepped in the door and throughout the meal. The staff came over to talk to us and explained to us each course, refilled water, overall was a wonderful dining experience! 

It's a fixed tasting menu, 6 course for $80/pp. All the dishes had unique flavours and the ingredients they used went well together! Was so excited when each course came! The presentation of the dishes was nice and they had cute cutlery! Our favourite dish was the pork tenderloin! The meal lasted for about 2 hours and we enjoyed it very much! Each course came out at a good pace and we were so full after! Would definately come back again!"}
{"text":"Second time coming back, and wow, this place never disappoints! Korean fusion ... every dish was delicious ! Staff were so friendly & welcoming & they have a very nice and intimate ambience.  
Perfect occasion to celebrate my close friend's birthday !! 
Highly recommend anyone to try."}
{"text":"The food was fantastic! Traditional Korean comfort food transformed into delicate, shareable dishes. Between the four of us, we did the 7-plate set and topped up with 2 more. The octopus salad was a hit amongst the group- ultra tender served with a honey Dijon slaw. My favorite was the braised lamb which served with crostini. I can't wait to come back!"}
{"text":"Amazing food and the tasting menu is well worth the price for people who can't decide what to get on the menu. Every single dish tastes good except the desserts. I believe the chef is better at cooking then making desserts. Services are excellent as well. Overall, it is a nice place to chill and hang out at night. I would definitely recommend people to visit when they are in town."}
{"text":"I tried the tasting menu and think it was an impressive amount of food for the price! According to the server, they change their menu every month. 

The duck confit and octopus were my favourite dishes. The octopus is coated in honey butter which makes it very rich and sweet. I kind of wish it was a little more charred or crispy though. The different flavours in the slaw were well balanced - tart, crisp and a little spicy at the same time. The duck confit was just so tender and skin perfectly crispy.  

Least impressive course was the gnocchi. It was a bit hard and the mushroom sauce was nothing memorable.  The desserts were both a variation of a tea flavoured ice cream which were both delicious but a little repetitive.  

Service was great and it's a great spot! Would totally come back to try what they'll come up with in another month!"}
{"text":"Food was okay. Service was terrible. They claim the tasting menu takes '2 hours'. We were there for 3.5 and had to leave before desert was even stored. 

We literally waited 45 minutes between courses. This restaurant was a total let down."}
{"text":"It is a small contemporary restaurant that specializes in korean fusion. Came here to celebrate a friend's birthday and we decided to try the tasting menu for $65pp. The menu changes monthly, although the popular items might be kept for a longer period of time. We got to try most things on the seasonal menu and they didn't disappoint! They were all beautifully presented (instagrammable), inventive, and tasted delicious. The servers were friendly and knowledgeable about the dishes. We went in without high expectations and we were pleasantly surprised with the food and service. I look forward to coming back in another month. Highly recommended."}
{"text":"This restaurant is amazing and delicious. The chefs takes really care of their presentation and their food is a work of art. It's hard to eat the food because it's so pretty. I did the 4 course meal for $70 which is alot of food. I would suggest many ordering 2 dishes instead. One appetizer and 1 larger entree instead. My favorite dish was the duck. Their duck dumplings were the best dumplings I ever had. It was also my birthday and the staff added a special touch to the meal. :)"}
{"text":"Their food is interesting. My favourite is the sweet potato gnocchi. I think it's a must try. Pork belly wrap , skirt beef, and lamb are all very tender and soft. It's 130 for 7 dishes. Very good deal and good portion for two people ."}
{"text":"Korean fusion resto with a contemporary decor makes Doma a stand out Resto in my books. 

We didn't opt for the tasting menu as we all had a late lunch.  Between the 3 of us, we ordered 4 dishes to share. We had the tofu steak, kalbi, fish and shrimp with dumplings and grilled squid.  My favourite was the fish/shrimp with dumplings for flavour followed by the kalbi for creativity.  The kalbi came with thinly slices of pickled radish for wrapping. It was delish! 

I enjoyed the meal and atmosphere but I didn't enjoy the bill.  The four dishes cost $100 before gratuity.  A bit expensive for tapas size dishes."}
{"text":"I'm a self-admitted food snob and, over the years, I've conditioned my palate to a certain level of refinement that is hard to appease. So when a friend suggested dinner at Doma, the new French-inspired Korean restaurant in Toronto's Little Italy district, I was fascinated and intrigued by the notion of two dominant food cultures coming together as one.

Tucked away on a quiet side street, Doma's large white windows offered a glimpse into what could easily be mistaken for a charming French bistro. While it may have been cold out, the soft lights and aesthetically-pleasing decor inside promised us a warm welcome. And one we very much received.

As I scanned the menu, it became apparent why this was presented to us as \"French-inspired Korean or Korean-inspired French cuisine\". This menu was not one, but both. Owner and chef Paul Kim, originally from Seoul, is a first-time restaurateur who studied at the acclaimed Le Cordon Bleu culinary institute. Doma is the product of a beautiful marriage between his Korean background and the French cuisine and culinary techniques he mastered, and it is an absolute winning combination.

To really experience the breadth of Doma's menu, opt for the $65pp Chef's Tasting Menu which offers a taste of all the incredible eight courses (beverages not included). From the steamed bun amuse bouche, filled with mushroom, caramelized onion and sweet doenjang, to the Butternut Squash and Yam Soup served with a side of sticky rice donut, to the Jeolpan, Grilled Octopus, Mackerel en Papillote, Duck in Two Ways, Beef Striploin and desserts, every bite was an explosion of textures and flavours.

The winning plate for the evening was undoubtedly the duck -- perfectly tender slices with the right amount of fat and crisped skin, cooked to moist perfection and accompanied by a duck confit dumpling. Every bite made us yearn for more.

Doma's menu changes every month, at times retaining the more popular dishes. Given the level of skill and attention required to create every dish, the $65 tasting menu is an incredible deal and makes for a truly memorable meal. It is no surprise that Doma has been considered one of Toronto's Top 10 new restaurants.

Service is friendly and flawless, and Chef Kim even makes a brief appearance to serve a course and provide some background. The cosiness of the atmosphere makes for a charming restaurant that's perfect for date nights and intimate special occasions. By the time we left, the restaurant was teeming with couples and groups of friends - each one eager to be swept away into a world of cultural fusion and micro-regional cuisine."}
{"text":"We'll this restaurant was amazing and not that molecular foamy stuff.  Just gorgeously fused French and Korean.   Staff was attentive, almost too much as we had to ask them to slow down the delivery.  This tasting menu was to savour not to wolf down. Wine was comparatively expensive for very common brands but drinkable.  Presentations were creative and after two hours we were full.  Lovely evening to celebrate our anniversary."}
{"text":"A lovely Korean-French dining experience in a cute, cozy space. My friend and I made reservations for a 6pm weeknight and thankfully so as the room was completely full by 7. Staff suggested 4 plates for two people if ordering a la carte so it was actually a better value to get the tasting menu than individual dishes. It was $65 per person and worth it if one considers the restaurant as $$$$ rather than $$$. 

There were 10 courses in total in a sharing style: an amuse bouche, 3 starters, 3 entrees, and 2 desserts. They were all pretty, inventive and delicious - we could definitely taste the influences from both cuisines. We were worried that we'd go hungry given the generous negative space in the plating but we were actually stuffed by the end! We also got the New Generation ($13) cocktail and the citrusy, earthy flavours nicely cut some of the richness of the food. 

The service was nice although the pacing was too fast at the beginning. Overall it was a splurge for sure but worth it for a special occasion. As the menu changes monthly, I'd love to try it again someday."}
{"text":"We had just an all out excellent meal here. The tasting menu seemed a great value as others have said. The standout dishes were the fish and vegetarian dishes. The ushun mandoo and especially the grilled octopus. Flavors were like nothing else in the city, bright and interesting, but still light enough that the whole meal didn't overwhelm. I find a lot of fusion places overly sweet or not well balanced, but this was not the case. The meat dishes were perhaps a bit more pedestrian, but overall this was just an outstanding meal from the first course to dessert. The interior space is simple and elegant. A small but interesting wine list that paired well with food, and I very much enjoyed an Asian take on a whiskey sour to start. Friendly but not overwhelming service. My only issue: the restaurant has very minimal signage outside, and it's not immediately clear which door you enter. But once you're inside, everything was just tip top."}
{"text":"This is a pretty fancy place hidden behind a street of generally more casual spots. Food was good, but portions are tiny. Ordered 3 plates to share between 2 people and we had to grab some extra bites afterwards at a bar. It's also expected that you share everything, so each dish would normally come one at a time. You have to specifically request that it not arrive that way if you want everything to show up at once.

The highlight was the pork belly - very flavourful and the sauce was great. I'd say this is a unique spot worth trying once."}
{"text":"Interesting concept but a little too overpriced for what you get. The place is very cozy and the service is great. What stood out are the Korean pancakes for $12... huge margin on those for the restaurant... very little value for patrons."}
{"text":"This was the best meal I've had in a while. We had the grilled octopus, uhsun mandoo (fish/scallop/prawn), bibimbap and pork belly. The only dish I wouldn't order next time is the bibimbap, however if order any of the other three in a heartbeat. These dishes are put together with finesse. Oh man!! Great date spot for sure..."}
{"text":"WHAT TO TRY?

Their menus change every season and the plates are shareable style. I recommend trying the tasting menu if your budget allows (~$55) because that way you can taste the whole menu. Usually ppl who come here for the very first time usually order the tasting menu because you never know when you'll come back. Tucked away on the corner of the street, the restaurant's front is very subtle and hidden so ppl may miss it! The restaurant transformed a house into a restaurant and now houses Doma. Look at my pictures to see what kind of food I had in March this year. The menu may have changed for the season already though! But overall I thought everything was nice about the restaurant. I loved the presentation of the food, I loved how they combined French cuisine with Korean cuisine and I loved the creativity with each dish. 

LAST TIP? 

Try the tasting menu. Can't emphasize enough but it's a good deal to try out all the dishes on their menu."}
{"text":"Well fantabulous. What a great surprise. Finally a tasting menu that is well worth it! 
I get pretty frustrated with tasting menus that have the fancy hype about it, focused on the plating and giving you the bare minimum of hardly any bite fulls to fully taste it and also fancy prices with out the fancy taste. 
But Doma did not disappoint!
It can be a bit hefty for the tasting menu but I am glad I did it - got to taste the whole entire menu and as I mentioned worth it. Amazing. 
My favorite was the Tuigim and the Ushun Mandoo. Quite flavorful and every bite was a new experience. Good size portions to get the full taste. I was pretty content with it all and left fully satisfied. 
I would and have recommended it to friends as well. I would go back and I now know which I would order. Hopefully when I do go back that the consistency will be there, because I have given some places great reviews because I was blown away, only to come back, order the same and have it taste not as good as the first time. 
I've read that this place is korean - french but this yelp section says Korean Canadian. 
Anyhow a great fusion of flavors, right down to the deserts! 
The ambiance during the day was bright and airy and simple. Staff was friendly and service was  efficient - fast but not pushy."}
{"text":"Doma is a fusion restaurant in Little Italy that specializes in Korean and French inspired dishes. I came here to try their seasonal tasting menu that consisted of 9 courses and cost $65-a very reasonable price for this style of dining, in my opinion.

Although tabbed as Korean-french fusion cuisine, I would say that the flavours of the dishes were predominantly Korean inspired. While most of the dishes were good, none of them stood out exceptionally. My two favourite ones were the Grilled Octopus and the Uhsun Mandoo. The octopus was super tender and tasted amazing, while the Mandoo was a medley of different seafood that all tasted delicious.

The service here was great and our server was able to explain what each dish was when it came out. Food allergies were accommodated for as well. Overall, a great place to spend a few hours sampling food =)

The tasting menu rotates every month and changes with the season. I would highly recommend doing the tasting option, as it provides the best value and experience (we were more than stuffed by the end of it!)"}
{"text":"Meh... good technical skills from the chef but food felt short. The wine list is pretty ordinary. Amuse bouche was a mess. Tartare was not cut properly --sharpen your knives! Octopus was delicious but the coleslaw accompanying it had no dressing (or taste). The daily fish dish was the highlight of the night. Great service... but don't go for the food!"}
