{"text":"Domino's is one of many takeaway food options in Airdrie town centre. There is no sit in option here, you have to either get a delivery or go and pick it up yourself. Inside the shop is a counter and a couple of benches. You can take in the delightful views of South Bridge Street while you wait as the front of the store is big windows. Of course Domino's is part of an international chain so the pizza you get here is the same as you'll get anywhere. I personally quite like their pizzas but I don't think they're as good as Pizza Hut and the staff tend not to be very friendly."}
{"text":"Today I ordered a pizza there, with no cheese because I'm lactose intolerant. They made it rather quickly, but there were a few concerning things about this particular establishment. 

The staff began yelling in their native tongues at each other while I was waiting, which made me incredibly uncomfortable during the 10 minute wait for my pizza, which I had sadly paid for before receiving, so that escaping the unprofessional, noisy establishment without getting ripped off was impossible. Someone was also making horking noises while they were making my pizza, which freaked me out and made me wonder if they were spitting in the food? 

There was only one table inside, and a bench, so it's not really a dine-in place. 

Despite my fears and all of the strange things they were saying, I decided to brave it and eat some of the pizza. The mushrooms weren't the freshest, and I definitely won't bother coming back to this dive-in pizza joint ever again. If you have to get some Dominoes, I recommend ordering ahead of time unless you, for whatever reason, actually enjoy listening to people screaming at each other."}
{"text":"Honestly get people working in there that know what the difference between thin Brooklyn crust and thin crust pizza. Manager said my husband should have asked for the cracker crust. I'm sorry I've worked at dominoes ten years ago and we order dominoes twice a month in mississauga; where is cracker crust advertised online? Nowhere
Also girls wearing jewelery working with food."}
{"text":"Dominoes Pizza only has a take away option - their pizzas are great, dear but great. They have a full menu and their deserts are tdf!"}
{"text":"Not sure if our delivery is always from this location or the one on Williams. They're always so quick and everything we order is always fresh  but sometimes the bread turns out to be stiff but other than than always happy with my order."}
{"text":"Probably the worst Dominos location I've ever ordered from.

Entered my address on the website and it entered as a completely different address about two blocks away. This wasn't a big deal because the driver called and apologized for getting it wrong, asked for the new address, and said he'd be at the new location. Hour passed and he never showed up. Called the store and the manager claims the driver delivered the pizza. After a big of a struggle, the driver, talking to the manager, throws me under the bus too and claims we put the wrong address down (it said the correct address on the receipt email we got). Got fed up with the bs and hung up the phone, no pizza at 1 am."}
{"text":"I ordered a medium pepperoni and mushroom pizza online for take away. I drove over, paid and saw once I got home that they forgot the pepperoni. When I called the best thing they said they could do was give me two free toppings next time. So annoying. I won't be ordering from them again."}
{"text":"Super glad Domino's is in this area. Staff is great and quick! Sparked up a good convo when I had a pizza delivered. The guy loves How I Met Your Mother! Pizza was warm and tasty. Pizza Pizza who? Domino's is awesome."}
{"text":"We only ever order from here because it's convenient, but I'm done with them now. The last two times we ordered, the asshole driver said we didn't give him our buzzer code, even though we did. He was incredibly rude about it both times, too. The second time I actually took a picture of the screen when I was filling out the online order form to prove it to him. After he left, I looked at the pizza box and saw that my buzzer number was printed on the label so I guess he's just stupid on top of rude.

On top of the general dickishness, he forgot the 2 litres of coke we ordered, so he went back to the store to get it and we had to wait half an hour for him to come back. (This place is only about a block and a half from my apartment. I could have walked there and back in a fraction of the time.) We called the manager and he was also rude, raising his voice to my husband. We ended up getting the coke for free, so we got to have that with our cold pizza, but that's not good enough. This particular Domino's lost a customer."}
{"text":"This is the last time I order from here. My reasons are the following: 
-thin crust pizza arrived cold and 15 minutes later than the time indicated in the email after I placed my online order
-driver kept coughing which kind of grossed me out. He is handling my food after all.
-in addition to the delivery charge, which is almost $4, they have the gall to charge $1.50 extra for paying by debit.  This was not mentioned anywhere online. How convenient.... spring the charge on the customer at the last minute. 
-The debit machine didn't even work and I had to run inside and hold it near the window to get a signal. Well, that didn't work and a reboot of machine was required. Took several more minutes. Pizza is getting cold... 
-I was so annoyed by the debit charge that I deducted it from my usual tip and left $1. This has become my policy for all companies which charge a debit fee. 

Clearly Dominos and I are not a match and I'll be sticking to Panago next time I want a hot pizza and no debit charge. The have  whole wheat dough available and use better ingredients."}
{"text":"Man, this location is kinda in the middle of nowhere. Luckily it was here though, or I would have gone hungry before a concert!

A tiny store, with no sort of organization whatsoever. Walked in with about 10 other people waiting, scattered around the counter. Couldn't tell if they were waiting for pickup or ordering. The cashier made no effort to assist customers coming in either, so there was quite a bit of just standing around. 

When we finally ordered, we didn't get a receipt, didn't take our name down for the pizza, and didn't give us our drinks. We had to ask her afterwards to give us our drinks, which she kinda just confusingly gave us. 

When our pizza was ready, they didn't have any names down, so she they didn't even know who to give it to. I just ended taking it and leaving. 

All in all, not a good location, with confusion and disorganization throughout. I won't be back unless I end up in the same predicament..."}
{"text":"It's Domino's. Remember this, and your expectations will be met. Only have ordered take-out, always on-time, hot, and correct."}
{"text":"I meant to write a review about this place last week. We ordered 2 med pizzas and dipping sauce. Usually the pizza is good from here and we enjoy it. What turned me off of them this time was that when the ordered came i asked for the bill. The driver said it is on the box. a sticker is your bill. I said that is not a bill it just says the total of the purchase. I want the itemized bill. I want to see what you missed on my order. How can I complain about not getting something if you don't give me a bill to prove that I ordered it. Plus when i payed the driver $40 bucks he shot me a dirty look when i asked for change. ( i was going to tip him after i got the money back)  I need to call head office about this."}
{"text":"Ah, the Sherbourne Dominos. We've had such highs and lows. Crests and troughs. Hot gooey cheesy pizzas and tears. Let's examine:

HIGH - Your pizza is always hot and delicious, and I'd have a hard time finding fault, compared to the other options: Pizza Pizza's crusts are super lame, and their pies always find a way to give me a stomach ache; Pizza Hut is just oily grossness; Magic Oven is bonkers overpriced; Pizziaolo has an odd quality disparity between their in-person slices and their delivery pies. Relative to the competition, Dominos' delivery pizza is consistently and reliably satisfying. 

LOW - The time I paid for a gift card entitling me to a free pie. They didn't have any cards in person, so they wrote it on my file, and on a receipt I got to keep. Then months later they refused to honour my free pizza because the deal was expired, even after I explained multiple times that they never gave me this information, and I never even get a proper coupon that would have displayed this important tidbit. Worst part is that they knew exactly what I was talking about - clearly ONE UNCLAIMED FREE PIZZA was written right there on my file, because when I called they were like \"Oh yeah, your free pizza. We can't give it to you.\"

HIGH - It's not unique to this Sherbourne location, but I LOVE crafting my own pizza on the Dominos website, and I LOVE that it doesn't count as extra ingredients when you halve different toppings. One XL pizza = Two distinct S Pizzas. 

LOW - Dominos doesn't have a lot of non-protein options, which burns us as Pescetarians. We're happy there's anchovy, but we'd love to see the addition of some broccoli, spinach, basil - any number of classic pizza toppings would be most welcome. 

HIGH - There's nothing like Dominos' sweet web deals. Their Canadian facebook page always posts must-get 50% delivery sales.

LOW - What is up with Dominoes_[dot]_ca? If I accidentally type the 'e' at work, I violate the web filter, and it's tagged \"pornography\". I don't know what's on that page, and hopefully I never will, and also hopefully I don't get fired for trying to satisfy my melted cheese needs, but anyway - it's DOMINOS without the e, thank me later."}
{"text":"Ordered delivery. New $1.50 surcharge. Thats ridiculous.  The delivery driver gave me coupons and requested a good tip because of that. Kinda pissed"}
{"text":"We popped into Dominos pizza after realising we needed some dinner but didn't have the time to cook.

There's not much you can say about the choice as each Dominos has the same choice as the next, but the experience can vary.

After placing an order for a vegetarian supreme and side of garlic bread pizza we were were surprised to see the sad pizza and sloppy garlic bread pizza when we opened the box back home. The pizza was cooked round the edges and the underside, but the middle was sloppy with the vegetables and mozzarella cheese falling off the limp base.

Since we were running short on time we decided against phoning in a complaint as a replacement pizza would have just causes further delay to our night.

Looking back at our visit it was clear that some of the staff were new and getting trained by other staff, whilst taking phone and counter orders.

On the plus side the vegetables were fresh and the parts of the base that were fully cooked were tasty, unfortunately the poor preparation turned a good pizza into a poor dinner."}
{"text":"This place rocks! EVerytime I go there it is sooo busy. I see why. They are so friendly and there food is better than any other Domino's Pizza I have been to. They have sandwiched they put in the oven too. Yummy!!"}
{"text":"We have ordered from this Dominos before as we did yesterday and we love the food. The only thing I would suggest is to have bags to carry the food out with. My wife went to pick up our order and we had many small boxes to carry. When asked if they had a bag to carry,the gentleman said no. He did offer to help my wife to the car,but when she said no he didn't open the door for her as she had to make 2 trips to the car. Not a huge problem,but a suggestion so people can have an easier time to carry out, unsure if they were out of bags,or they don't have bags.... Again,the food is always good.."}
{"text":"so i live literally around the corner from this dominoes and this is where we have to order from. On 2 occasions these place just straight up F**KED with us.

First issue: The first time we tried to order from there they would not answer the phone. So we called another locaton who proceeded to call them. We were told to try to call sherbourne again. We did and still they did not answer. We called back the second location and after they called sherbourne again the second location had no choice but to deliver to us because sherbourne did not want to.

second issue: We place our order, literally (and im not even exaggerating) not even 5 mins later realized we could have got a better deal with garlic bread added so i called right away. The guy proceeded to tell me it was too late to add it to my order because the delivery guy was already on his way to my house......i questioned the fact that it does not take 5 mins to cook a large pizza. He then told me it takes 7-10 mins and that i made my order earlier then i thought. We went back and forth on this because this was not true. Even my BF was like \"wtf is this guy talking about?\" in the time i was on the phone with the guy the delivery guy should have been at my place. I hang up the phone and wait. 20 mins goes by and still no pizza.... I called back furious. He then proceeded to tell me that the delivery guy had 1 other place to go to, which just happened to be the address 3 bulidings down from me.....i laughed comically because if that were the case he would have been at my place within 15 of my order not 30 (time had lapsed from argument and order) 
So all in all not only did they lie to us about adding bread to our order but they took way to long to drive 1 block west lol

i would never order from here ever again, like if you dont want to work at dominoes and do your job then dont ....."}
{"text":"Efficient in time that's about it. Female cashier didn't acknowledge me to wait one second when she picked up the phone after less than one full ring. Pizza had almost no sauce and very little cheese  often missing places with cheese or sauce altogether. Unacceptable, clearly cutting corners won't order again."}
{"text":"Yummy best pizza. So cheesy and delicious the wings are good and this place is cheap. Always worth the money. Delivery is also fast and it comes so hot and fresh. Steam is coming out the box. I had the chicken alfredo pizza. So bomb. Mouth watering  I'm never disappointment with this one in comparison to all the other over priced pizza joint with hard and thin crush. Domino's pizza is just right."}
{"text":"Horrible services I ordered a Philly chesse steak pizza and a hair came with it a driver was rude he said under his breath kiss my ass"}
{"text":"Well Dominos certainly has improved on their pizza in recent years.  It's more than tolerable now. This particular location is a nice small take-out place where you can order and go.  There is a convenience store next door so if you need to top on your snacks while you wait for your order it's nice and handy.

My only qualms with this location is that it's looking like it's seen better days."}
{"text":"My girl likes Domino's every once in a while; perhaps it's the cornmeal. This place is fast and friendly, but the neighbourhood is pretty sketch.

We order for pick-up, which is fine by me because there isn't much else to do around the area."}
{"text":"At considerable expense, we ordered 10 large pizzas for a little kids' party. We chose Domino's because they offer a thin-crust pizza that is cut into squares. Even though the order was confirmed for pizzas cut into squares, we instead received pizzas all cut into huge pie-shaped wedges that were totally unsuitable for little kids to eat. The huge wedge cuts also meant that we didn't have enough pieces of pizza to go around. Also, the pizza was very, very brown, nearly burnt. A very frustrating waste of money that also made the party disappointing. Total failure."}
{"text":"You guys fucking suck. I've called 4 different Dominos and they all transfer me around to different places. You suck"}
{"text":"Think this was the 1st time ordering from this Dominos. Ordered delivery & follow up w a ph call as I wanted the pepperoni on top & a crispy pizza. I spoke with \"Vic\" who assured me the pizza would be crispy. When it was delivered it was the exact opposite. Is was soggy & undercooked. The driver called the store when I said to \"return the pizza\". I spoke with the owner & we settled on $10.00. In fairness I did eat the pizza but the enjoyment was greatly reduced & I threw 1/2 away. Do yourself a favour....don't order pizza from this Dominos location is u want it crispy!!"}
{"text":"My visit was a few weeks back and I forgot to write this review....went in to pick up my order and I only had a 100 dollar bill to pay the first employee told me they couldn't take such large bill but then James came and said he could brake it no problem. Also my order of wings never got done so he apologized and took them off my bill and got them done really quick. Great employee....happy he was able to help not sure what the outcome would have been if he wasn't"}
{"text":"Been ordering pizza's from all over Toronto on a weekly basis for some time now. Decided to retry Dominos as I was getting bored of some of the other pizzerias. Placed order online only to find out there was a fantastic deal of $14.99 for a large gourmet pizza. What a steal! Love the user friendliness of the site as it's idiot proof. The tracking your order and progress of your pizza is genius!

Pizza arrived prompty as the tracker makes it visible as to where my pizza is and the estimate was spot on! Ordered the chicken bacon alfredo pizza. 

Opened the box and the pizza was hot and dangerously cheesy. It was my first time trying a pizza without the traditional pizza sauce and I was pleased with the outcome. Alfredo sauce was spot on. Every bite was a wonderful experience.

Overall was a great experience and I will be ordering again sometime soon."}
{"text":"I came here for for takeout pizza and chicken wings that I ordered online. The customer service was poor and unfriendly. The people who worked there did not talk to me once while I was waiting for my pizza. They all kept on talking and laughing in Tamil. Finally I have to go up to them and asked them where was my pizza and chicken wings.

The pizza and chicken wings were okay. The pizza kept on falling apart."}
{"text":"Worst pizza and wings ever. The wings must have been boiled and then some runny watered down spicy liquid over them. Not like anything resembling honey garlic. Pizza was cold, soggy and undercooked. To sum it up, terrible food and over an hour for delivery."}
{"text":"This place is absolutely horrible. We ordered a pepperoni feast pizza and there was barely any pepperoni on the thing! The pizza was also way too salty and the crust was so soft. Ugh!"}
{"text":"Avoid this establishment and their delivery service at all times! Their delivery car parks constantly on the bike lane (462 Sherbourne Street). This business is endangering everyone on the street. I don't want to imagine how serious they take food safety if they act like this on the road."}
{"text":"WORST DOMINOS LOCATION in Toronto.
Ordered a pizza that took 2 HOURS to arrive. After 4 phone calls, where someone who identified themselves as the manager but clearly had ZERO customer service skills, did absolutely nothing to help the situation. Since my first phone call, approximately 1 hour after ordering, the \"manager\" kept telling me it would be just ten more minutes until my pizza would arrive and that he promised me it was already out for delivery so there was no point in me walking to the store to pick it up. BTW Google maps says that my house is a 3 minute drive from the store. On the third call he put me on hold and assured me he would call the driver and get him to prioritize my order. (wouldn't that be your reaction after the first or second call?) While I was waiting to hear back i was hung up on. Then, when the driver finally arrived after 2 hours and 4 phone calls, the driver had NO IDEA that my pizza had taken two hours. When the pizza arrived, it was hot. HOT people! do u know what that means?! There is no way the pizza had been driving around with the driver since my first phone call. So clearly this \"manager\" just lied about the pizza being on its way, lied about contacting the driver to prioritize, and most likely lied about the pizza being made when it was ordered in the first place. It is possible that they had a new pizza made and delivered by another driver because someone forgot about the original order or there was a mistake somewhere down the line but why lie about that? If he hadn't continuously told us \"10 more minutes, 10 more minutes\" we would have just told him to cancel the order or that we could come pick it up. I was never offered anything, and when the pizza arrived the driver insisted we pay for it and since we had to leave to catch a train by the time the pizza got there anyways we told him to forget it and take the pizza back. Obviously we have made a complaint with corporate and they have been great but I will not be ordering from this location again, even though it is the most convenient for my location. 
SO SAD :("}
