{"text":"I had an individual Pan Pizza and it was very good.  Next time I forgot to say \"pan\" and found the flat pizza to be hard and sub par.  Service varies from good to fair.  Atmosphere is Italian, with lots of Rat Pack pictures all over the walls.  It says they take reservations, but I heard someone say to the hostess that they had been told that they did not take reservations.  So, I guess a reservation is a maybe yes and maybe no, depending on the day.  All in all, it was a good restaurant.  Worth a try.  For the reviewer who found the crowd to be older, well, this is in Sun City."}
{"text":"I read the two good reviews here on Yelp, so I was looking forward to a good Italian dinner.  Unfortunately, it must have been an off night.  The waitress didn't want to be bothered and the meatballs and the tomato sauce on the spaghetti didn't have much flavor.  That's the test of a good Italian restaurant for me.  If the sauce is good, they usually get thumbs up.  This sauce wasn't \"bad,\" but it was bland and watery.  Even the bowl of spaghetti wasn't drained properly so there was a dripping, runny mess at the bottom of the paltry bowl of pasta.  This place is right around the corner from my house and Dominic is my brother's name!  So I was really disappointed."}
{"text":"First time at Dominic's....good food, good atmosphere!! We will be back!! Get there early, seemed like a really popular place! Filled up quick!"}
{"text":"First time. We walk in. Wait to be seated. Asked if we want booth or table. We say booth.  Then told sorry they are reserved. We sit, then in walks two gals, no reservation. They start to seat themselves, we inform them you have to wait to  be seated. Waitress or hostess ask them how many and  they are directed straight to a booth supposedly reserved. We walked out. Will never go again."}
{"text":"On Feb 4th, 2015, part of our family dined here. We were in town for my second oldest daughters wedding. The food was delicious, the atmoshere great, and our treatment unforgettable!! Doni, our waitress was so attentive to our requests.  We returned again early the next week and enjoyed ourselves as much as the first time.  If I'm Peoria again, I'll be back.  Thanks for the memories!!"}
{"text":"I went in with my boyfriend, and it seemed the service was less than friendly.  I had the misfortune of going on a Saturday night, and having to bear witness to the \"entertainment\" of what I assume to be one of the proprietors.  Yikes.  The elderly people seemed to enjoy themselves, but this place just wasn't for me.  The food was by no means terrible, but I found it bland and forgettable; I  wouldn't call it any better than 'average'."}
{"text":"Decided to try Dominic's last night and were we glad we did! Very friendly and attentive wait staff...our water glasses were kept full which I like. All 3 of us tried something different-chicken parmigiana, chicken Marsala & baked penne and throughly enjoyed our meal. The bread is great, homemade chicken soup was tasty and had to try the cassada cake which was very good. We enjoyed the musician playing the keyboard & singing and there were quite a few couples dancing. We will definitely return!!"}
{"text":"Went to this place by myself. about 7:30 on a Wednesday night. Stood at the lectern that says \"wait to be seated\" for about 10 minutes. No help whatsoever, even the owner walked by without acknowledging me. Finally took a seat at the bar and asked another patron what the deal was to get seated. He said that the lady that does that has the night off. Okay. I finally got the bartenders attention and asked for a table. She was of no use so I just ordered carry out from the bar. I had the chicken marsala and it was horrible right down to the canned mushrooms on it. Could have used an axe to cut the chicken it was so tough. Needless to say I have had way, way better chicken marsala. Not one of my better restaurant experiences."}
{"text":"A great find to say the least. We were greeted by a very friendly hostess and seated immediately. It's a loyal local's restaurant. Our waitress Patti was better than super. Was most helpful in assisting with our order. She was friendly and very efficient but still made us feel as friends. The dinner salad was typical but was very very fresh. Husband and I both had different chicken dishes-- very tasty. We stuffed ourselves with a delicious cake dessert which was wonderful. Patti told us they have a band on Friday and Saturday nights. It was nice to have a nice quiet uninterrupted dinner. Put this on your must to try."}
{"text":"Excellent. Freshly baked bread. Good portions for the prices. Good sauces. Everything was cooked fresh. Mother ordered shrimp scampi. Said it was excellent. I had the Chicken Parm with fettuccine Alfredo. Very good. Not too noisy. Owners are from New York so you know you will get fresh authentic Italian food. Will definately return."}
{"text":"This restaurant is geared toward the older generation, however the food is old school and done right.  Try the Tomato and Mozzarella salad, so good!  They have open mic night and dancing on the weekends."}
{"text":"We went to Dominic's last night for dinner. I found the food to be just ok. Nothing special. I had Chicken Marsala with a side of spaghetti. The best thing about it was the bread and side salad that came with it. The spaghetti sauce was very watery and didn't have much taste. The sauce on my chicken was also very thin - I've had Chicken Marsala before at other restaurants and the sauce was thick and flavorful. Another friend had spaghetti and found the sauce to be tasteless and thin. i wouldn't recommend this restaurant when there are so many others out there that have really good food."}
{"text":"What an incredibly vibrant and fun place. Went on a Friday night and everything about this place screams a great time. A band who actually sang in Italian, patrons who danced, homemade food and great decor. I had the stuffed manicotti which was so good i just kept eating even after I was full. For dessert we had the pumpkin cannoli which melted in our mouths. The service was perfect. We will definitely be making more visits here."}
{"text":"What a precious gem of a restaurant!   It's a little hard to find but so worth looking for. Their lunch specials are perfectly proportioned and scrumptious.  The waitress was super friendly and helpful about the food preparation and menu.  We'll be back!!!"}
{"text":"Nothing special, just average.  The food was served hot, but had minimal flavor.  It appeared few spices were used.  The server was very friendly, but not real attentive.  Spent most of her time with a customer looking at a laptop.  The bread was good.  I have had more flavor at Olive Garden."}
{"text":"We had the wedding soup which was awesome! The fettuccine Alfredo with shrimp, was probably some of the best I've ever eaten. The lasagna was good and the fresh bread was wonderful. I would absolutely suggest this restaurant."}
{"text":"If you are 70 and love American Italian food this is your place! Came in on a Saturday and there's older women dressed up ready to dance the night away.  I'm not big on Americanized Italian food but my party was all elderly besides myself and my husband and they all loved every bite.  Cute family owned place."}
{"text":"Just came home from dinner at Dominic's. Got a few recommendations to try it so tonight we did. I am very pleasantly surprised. everything was fresh, tasty, high quality and service was perfect for a family owned Italian restaurant. Décor is semi authentic kitschy old Italian. Food was good/ very good. Definitely will be back."}
{"text":"One fine day My girlfriend and I stumbled into Dominic's by chance and had lunch on a weekday. She had cheese raviolis and I had the lasagna . We enjoyed our delicious meals and great service very much. So much so we returned several times .If you can go on the weekend when they play music you will have a great time dancing and having an amazing meal in a warm friendly atmosphere."}
{"text":"Wonderful place. Good food,great service, along with fair pricing. Plan on going back a lot"}
{"text":"Lookin' for a GREAT lunch at an awesome price... When in or near Sun City, look no further than Dominics Bistro.  So, for $7, yes that's SEVEN dollars, you get Fresh Baked Italian Bread, a fresh green salad, an entree and a drink. I love the Lasagna lunch special. Its great!  Did I mention all that for $7 bucks... Of course the service staff is great too. Tiffany never lets my tea get empty, and always offers more bread to dip in olive oil.  I have taken my business co-workers as well as friends here. And, although they don't YELP, they all shared my big TWO THUMBS UP, or rather 5-star review. So, for less than a fast food place would charge, and with fresh tasty entrees and a salad, come to Dominics... maybe I'll even see you there."}
{"text":"What a delightful find! Not only was the environment welcoming and super friendly, but the food was out of this world! Debbie, the manager / owner made a point of coming to the table and introducing herself and giving us a little background on the history of the restaurant. I enjoyed the manicotti, while my boyfriend enjoyed the meatball sandwich. He's Italian, so when and Italian man says the food reminds him of his mother's cooking, you know it's good! Will definitely be going back to sample other items on the menu. Thank you Debbie, and all the staff for a great dining experience!"}
{"text":"This is a fun place to have fun ..!! Any anniversary birthday engagement wedding and divorce Parties are so much fun to celebrate with good n live  music  to dance  I lol give 5 stars plus 5 more..!!"}
{"text":"Best Italian food I have had in a long time. The atmosphere is great and the employees are very friendly. I had the chicken parmigiana and was it was delicious and had great flavors. Also my favorite part was the cannoli that I had for dessert!!! Excellent food and service and hot and fresh food comes out."}
{"text":"AMAZING!! This was our second visit. First visit we had a sit down dinner in the dining area. The steak and side dishes were DELICIOUS and service even better. Our second visit was specifically for happy hour which offered generous pours of wine and an exceptional offering of food. We had the steak & fries and calamari. You can't beat the $10 price for happy hour food especially when you're served with healthy portions filled with an enormous amount of flavor!!"}
{"text":"where do i start well first off we had reservations and when we showed up the hostess wanted to make sure that we were out by 8 since they had live music and i guess they weren't much of a fan at the idea of kids being there.  i decided to order the spaghetti with sweet italian sausage or so i thought. the sausage was so over cooked it looked almost like slim jim beef sticks in my pasta. the wine selection was very lacking i decided to get their most expensive bottle of wine which came in at 21 dollars and tasted watered down."}
{"text":"Quaint and lively Italian bistro! Great atmosphere and energy!!  Refreshing to see such vitality in Sun City!   Enjoy fresh baked bread,  authentic lasagna and traditional Italian cassata cake!  My personal fave is the Chicken Piccata..tender chicken topped with light fresh lemon butter and capers compliments the pasta and homemade tomato sauce.  You can then dance the night away to live entertainment Wednesday,  Fridays and Saturdays!  Friendly and welcoming locals and a great house band."}
{"text":"love the food and entertainment..nice to have a place in sun city here you can dance and relax. i have met a lot of nice people there. great staff!!!!"}
{"text":"This place is amazing!  Good food great service!  The spaghettini w meatballs is so delicious and they give you fresh hot bread, and a choice of salad or soup!  Salad w Italian Dressing is very yummy!"}
{"text":"I stopped by with my hubby and a business friend for lunch today. Very cute little place with lots of fun Sinatra memorabilia. It took about 10 minutes to get our drinks but we were sitting around talking when she came by the first time. After we got our drinks, it took another 15 minutes or so for them to get our order. Once our order was in, our food came out in just a few minutes. Server was very polite, and all the staff was talkative and friendly. Food tasted great, sandwiches were fresh and the wedge fries were hot and tasty. What a great atmosphere, and especially if you want to go for a little music entertainment in the evenings. I would recommend."}
{"text":"Excellent service, food and atmosphere. Serendipity brought us here, and it was a pleasant surprise. We will definitely be back!"}
{"text":"Great atmosphere, great entertainment, wonderful service, and Great Italian food all six of us were very pleased with everything. Would highly recommend this restaurant to all! But most important great place to spend with your friends!"}
{"text":"I went about a week ago.  I enjoyed a very pleasant evening.  I have a service dog and she is small breed so sometimes I get some unpleasantries when I go out with her.   Dominics was fantastic.  I don't remember my servers name but she was a young blonde girl.  She was friendly but not over the top.  Her service was very efficient, and I would be happy to have her again.  I ordered the tom moz appetizer.  It was excellent.  Often I think the sauce is too sweet on these meals.  This one however was perfect.  My chicken Alfredo was very good.  However, re-heated the next day it was out of this world.  Next time I go I might order one for carryout for the purpose of eating it the next day.    I got the highly reviewed Cassada cake.  It was good and I might order it again but the  dinner food was outstanding and made it dull a bit by comparison.    A few people from a large group slow danced on the dance floor, which was very cute.    I only recommendation would be to offer a few more wines, given that this is an italian restaurant.  I understand wanting to keep it fresh but even if they were available only by the bottle a better selection would be welcome.  On the flip side I did love they have spirt offerings as well.  This made up for my disappointment over the wine."}
{"text":"Went in for a quick lunch, quick and friendly service and good prices. I had the Italiano sandwich which was delicious, and my girlfriend had the cheese ravioli with mushrooms which she said was 'bomb'!"}
{"text":"Good food. Great service! If you are under the age of 70 you will get a real kick out of this place.  Made my day! ."}
{"text":"I would like to start off by saying OMG \"The Bread\" it's hands down the best warm crusty Italian bread I have ever had! I felt like I was jetted back in time with theRat Pack style decor and music. Which is a good thing. When did people stop dancing and smiling and having fun? Well not at Dominics. Everyone if they were not dancing were obviously enjoying the music. Oops did I forget to say Live music. The service was amazing and friendly. We never had to ask for anything. And being married to an Italian for 30 years we both give the food a very strong thumbs up. Go and support this locally  family owned and operated Sun City business and tell them Susan sent ya! We will be regulars. After 10 years in Arizona we have found our place for Italian. Oh and lets not forget the Cassada cake. Moist and delicious. The perfect end to a perfect meal and perfect evening!"}
{"text":"What a great little place! I went with the parents for dinner this evening and I am impressed. I had the Chicken Picatta, mom had Chicken Parmigiano and dad had Lasagna. All of us enjoyed our dinner and were happy with the portion size. We had dessert as well and that just topped everything off. The Cassata cake was one of the best I have ever had and Dad had homemade peanut butter and chocolate chunk gelato. We will be back! I can't  wait  to  take my husband here."}
{"text":"Service was excellent everyone was friendly and the food was amazing be sure to try the Casatta cake"}
{"text":"Great Italian food, best lasagna I've had in the valley, the bread with sesame seeds is amazing/"}
{"text":"My GF and I went here a couple of nights ago and it was pretty empty. I think we beat the Sun City rush.. lol  We were trying to find somewhere \"New\" that was good and we stumbled upon this place because of all the Google+ positive reviews on Google Maps. We had the chicken Marsala (OK) and Parmesan (Good). Personally, I like Elephant Bar's and Carrabba's Chicken Marsala better. The Chicken Parmesan and Marsala was better the next day as left overs. Their bread was Excellent. It melted in your mouth and they kept it coming. Lastly, the service and staff were extremely friendly.   Overall, the food wasn't bad, but it just didn't catch either of our fancy's enough to come back to give it another try. Maybe we got the wrong items."}
{"text":"Great food, wonderful people, live music is soo fun even if you are just people watching.  Love the decor, my grandfather was a huge Sinatra fan so looove all the Sinatra pics! The bread is fabulous!! Pizza and wings are amazing!! Best bleu cheese ive ever had!"}
{"text":"Not as special this time. Eggplant parm. sandwich was not generous. Roll was just average. Same for the service. Wedding soup was good and coffee too.  Decor  of Movie memorabilia is interesting."}
{"text":"I am one of the many who missed this awesome place during my time in the West Valley and recently discovered it to be one of my favorite Italian restaurants in Arizona.    I've been here a few times and I found that Everything on the menu is really good.  The sauce is just right, it's not too sweet and just perfect.  Out of the few things that I've tried, just a simple bowl of baked penne was my favorite.    I would like for the restaurant to have a meatless lasagna but, this is personal preference only because the sauce is really yummy and I like those flavors combined."}
{"text":"Hands down my favorite Italian restaurant! The lunch menu is priced not to break the bank and the food is fantastic, the High-Standards music they play and all the \"Rat Pack\" era memoribilia is great. If you like home styled Mom & Pop italian food look no further."}
{"text":"This place is fantastic! We were going to get our food to eat, but for some reason we stayed and ate there instead. The atmosphere is alright, kind of weird but pretty cool at the same time. As usual, as a creature of habit, I got the Fettuccine Alfredo and it was great! When I say great, I mean it! It was creamy, delicious, yummy, goodness! The bread was delicious too, I could have eaten a whole loaf.   We met the owner and maybe his daughter (?) and he was such a nice guy, he was friendly and really great to talk to. He was so welcoming and he was honestly happy to talk to us and we just chatted about Denver and about our vacation.   We ended up getting a couple of desserts too, and the Cassata cake was pretty freaking amazing.   If you are looking for a place to go, eat here! I can't wait to come back to AZ just to eat here!"}
{"text":"Went on a Saturday night. I'm originally from an area where there's an authentic Italian restaurant everywhere, so I have high expectations, I guess. The place was totally packed--standing room only.   People were really dressed up with panty hose, heels, dresses, leisure suits, etc. I later realized it was because they were there to dance.  The food was good, but not great. I liked the flavors but my eggplant Parmesan was a little crispy on the inside and a soft on the outside (breading). :( It' s not an easy dish to cook.  My husband didn't really like his meal--can't remember what he ordered.  Our white wine was warm. The cassata cake was delicious, and I may sneak back sometime for a quick slice.  There was a talented local band that played country-western music. (I think that's the genre--I have never heard any of those songs before so I may be wrong.) It seemed like the place was packed with seniors waiting for the band to start, because they pounced on the dance floor the second the music started. The dance floor was packed. They were ballroom dancing to this country-western music--no matter what the song or speed, they had a ballroom dance for it. I have personally never seen anything like that before--I come from a generation that didn't do much partner dancing, and I have never seen people dance to this particular music. It was cute and they seemed to be really, really enjoying themselves. (However, not the NY Italian experience I was hoping for.)"}
{"text":"This is not a good place to dine!!! Small portions and the food is. Mediocre at best!!  Closes at the late hour of 8 pm."}
{"text":"Just ordered take out for lunch from here.Came for dinner months ago and had great fettechini alfredo. I tried to order that for lunch. But alot of menu is not served at lunch time. So I Went with lasangna with meat sauce. Im so so dissapointed. The size was a joke. extremey tiny ( sample size actually) not even  half the size of a regular size piece. Not good when your sides are bigger than your main dish. It came with  a  side house salad and a mini loaf of bread. ( bread lovers might appreciate) but I didnt order bread.. But bread was very good.Anyways. Lasangna was really good  too but it was literally a tease even a nice salad and loaf  of bread do not compensate  for sample size lasangna portions. Notice size was not much bigger than plastic fork in background"}
{"text":"We LOVE Dominic's and have been in twice in the last few weeks. We are new to the area. Today was our second time in and the waitress remembered where we like to sit and even what we ordered after one visit. They have great lunch specials, yummy food, and excellent customer service!"}
{"text":"This was the last night of my six day birthday celebration!  I could not have been more happy to spend an evening here with such good friends!  We couldn't have asked for a better venue and the food was soooo good!  Two of my four dining companians had the sausage and peppers and both of them raved about it.  They both like some heat so I assume there was heat for the taking.  The other two of us  of ordered Chicken Marsala and Chicken Piccata.  I know we both scraped our plates clean!!  Plus the bread is so good!  The wait staff was really good too.  And they took about 8 pictures of us to get one that we all looked good in.    The music started at about 8:15  That's when the great people watching starts, which I love.     What can I say?  The food us really 4 stars.- the waitstaff it incredible and  if you dance or not - it's fun to stay for the dance-floor show!!"}
{"text":"I had the pleasure of being introduced to this place this past Saturday. The food was good, the service was very good, and the music was fun. The decor was dated, but, if you're like me (who will take good food and service over ritz any day) this was a great place. The menu is simple, but between the five in our party, everything was great. The service was given with a smile and the sangria was good. I liked that the entrees were offered at lunch 'size'. The music kicked in and the dance floor was hopping. The live music was from two fellas, a keyboard and bongos. However that may sound, it was fabulous. Great voices. Musically skilled. It is in the heart of Sun City, so if you're afraid that age is catching or if you're looking for the price tag of your outfit to be noticed, this is not the place for you. However, if you're looking for friendly company, good food, and a fun time, go. Maybe I'll see you there, because I'll be going back!"}
{"text":"The best part about this place was the price.  The lunch deal is a good deal but it's not the highest of quality.  I think it is strange that they only give you a tiny cup of ketchup and mustard when you need the bottle.    I would probably return simply because of the price of the food but they could definitely improve the quality of their lettuce and flavors.  The lettuce was limp and the hamburger was bland and could use some seasonings.   The service wasn't great as I was in a small group of three during lunch but it was difficult trying to get the attention of the waitresses even though there was only one other table in the entire restaurant.  I liked the look of the restaurant but I think they could really improve their business if they just improved the quality of the ingredients and flavors."}
{"text":"You know you're in a great place when it's located in the middle of retirementville and it's still hoppin' after 11pm.  And I'm not the youngest one there.  This place is one chic little bistro that is family owned.  The owners are the sweetest people ever, and they were more than accommodating for our party of 7.  The atmosphere of the entire place is one of joy and good humor, and mingles smoothly between contemporary and rat pack era.  And I don't mean the kind of rat pack era that makes me feel like I'm still a fetus.  Ever been to a restaurant you didn't want to leave?  This is one of those places.  But what's atmosphere without good food?  Dominic's doesn't disappoint.  The menu is pretty simple, but everything looks delicious!  I had the chicken parm, which was a perfectly cooked moist piece of buck-buck I've ever had.  The marinara is perfectly herbed.  Most everyone else had the eggplant parm, which I tried a bit of, and found a new love.  I already know what my next meal there is going to be!  I also recommend the house dressing on the salad - it tastes almost like a tomato viniagrette.  The fried ravioli were also drool-worthy.  Okay so now I have to start a new paragraph just for the dessert, which was the Cassata Cake, hand made by the daughter.  The first thing you think of is, 'this is my future wedding cake'.  It was moist, and had just the perfect sweetness in the frosting without being too cloyingly sweet.  And as if it needed any improvements, the occasional chocolate chip that wandered into my mouth made it just that much better.  The house band was excellent all night, and if you feel like the cake is expanding your waistline, just hop up onto the dance floor and shake your money makers.  Every 15 minutes of dancing allows you to eat another slice of Cassata Cake.  No Lie!  This place is large party friendly, good for all ages, and only parties into the night on Fridays and Saturdays.  Get there early, or miss out on seating!"}
{"text":"Completely over priced for the quality and quantity.  Decor was kitchy.  Music from the 40's...would have been more OK if one was in a piano bar mood I think.  Waitress was nice and on point, so no fault there.  Problem was the upsale...my bad as I should have asked the price difference between chicken and veal. 4 tiny pieces of veal with less then 2 cups of spaghetti  $18.  House made cake was yummy for $5.  House brand wine was undrinkable.  Mini meatball soup came with dinner was good but barely 1 cup full (literal cup).  Dude at bar hacking up his guts was a real turn off.  I say keep that at home and not in an eatery.  Common sense.  So, not sure on this place.  Willing to try pizza next time or lunch at the more reasonable prices."}
{"text":"First time eating at the restaurant Saturday night March 12th. My wife had the penne pasta and meatballs, she enjoyed it, but not the best. I had a pizza, pep and sausage. It was ok, nothing I would go back for. The hostess however ruined our first experience. Susan, very unprofessional and snotty. Live music was good. Enjoyed that."}
{"text":"Went to dinner last Sunday and it is The Best Italian Food in town hands down! One of the few places that every dish from the fresh baked bread to the main entree has flavor. I had Chicken Parmesan, other family members had Lasagna and NO ONE left hungry or disappointed."}
{"text":"Great food , family style resturant dancing untill 12:00 PM owners pleasant nice people.x"}
