{"text":"Chain store with pretty good salsa. Don't get excited ahead of time though.  Menu is typical tex-mex. Beer selection is pathetic.  Visited on a slow night. Pretty empty. Bartender was a combination of surfer dude meets mister femmy.  Waited 10 minutes for a drink then 30 minutes for fajitas (which was the special of the day).  When they did arrive, the steak was charred to a crisp, the chicken barely qualified as chicken and the peppers & onions were barely cooked and totally flavorless.  I sent them back immediately. The manager did come over to discuss. He looked as though he was in a different time zone and offered a meager apology.  I was very clear that waiting 30 minutes for what arrived was totally unacceptable. He said he agreed and left....that was it.   A new plate arrived within minutes and was much better. Not great but a far cry from the trainwreck that was their first attempt.  When the check came, it was for the full amount. Not so much as even a few bucks knocked off for my wait and terrible first dish.  While they did bring a better second plate, all in all the bartender, manager and other staff were preoccupied with things other than taking care of patrons.  Will not be returning again.   A"}
{"text":"This restaurant is closed. Went for lunch on 5/11/2014 and place was closed and signs had been removed from building. Too bad, it was a decent place for Tex/Mex"}
{"text":"The food was really good. I ordered the Presidente. I love their chile rellenos. The service was OK, but the wait for the food was very long, especially considering that they weren't very busy"}
{"text":"Ok, to be fair, I live in San Antonio, home to some of the best Mexican food in the country.  That said, I was disappointed in the fare at Don Pablo's.  During an extended stay in Pittsburgh, I had a serious hankering for some Mexican food.  I found Don Pablo's food to be just so-so and way overpriced.  Mexican restaurants are like Chinese restaurants - the fancier the place, the lousier the food.  Better off going to Giant Eagle and getting the stuff to make your own."}
{"text":"For a Mexican chain this place is decent.  Tasty dishes every time, and good service.  Once we ate at the bar and had awesome service (tip).   Don't expect authentic Mexican food though, if that's what you're looking for.  The closest you'll find that is Texas.  The noise level in this restaurant was a bit too much for us however."}
{"text":"I only visited this place once at the request of my then future in laws to take me and my husband out to dinner.  It was a Saturday about 6:30, and the place was moderately busy at best.  lots of empty tables and booths.  I ordered the Shrimp Taco Trio that said it came with buffalo sauce and the shrimp was fried.  I asked for the shrimp to not be fried but grilled and no buffalo sauce.  The waitress was a bit clueless.  She sort of repeated me and I said yes no sauce and grilled shrimp, and my husband even repeated yes not fried but grilled shrimp.  Well it took about 45 minutes for our food to come out, and wouldn't you know it the shrimp was breaded.  I said \"excuse me these are breaded, and I asked for grilled.\"  She immediately says somewhat defensive that is the way they come.  I said I wouldn't have ordered them if you told me that, I don't want breaded shrimp.  i was trying to be nice but she was seriously ticking me off, but the in laws were there and well we all know about that, so I said can you take them back and ask to have them grilled.  She was like well I can check, again I was like would you please?  She leaves comes back five minutes later and says well they can do it but it will be a little bit of a wait.  Well hell I already waited 45 minutes for 3 taco's why not wait longer.  OK fine. So she leaves I tell everyone to go ahead don't wait for me.  My father-in-law got the ribs which were ice cold!  He says to us, these are cold like they made them up ahead of time in batches!! However, they aren't the type to complain.  I disagree you wait 45 minutes and pay $16.00 it should be at the least hot.  Well funny thing is the wait was only about 5 minutes and she brings out the tacos.  Guess what cold!  At this point I was like forget it, I don't want my in-laws to be embarrassed because again they aren't the type to say anything, so I let it go.  I am not sure what everyone thought of their food but I wouldn't go back.  Funny thing is the booth directly behind us were having the same issues as they asked to speak to a manager because all their food was cold too!  HA! Well at least they got a free desert out of it!  Adios Don Pablo's!"}
{"text":"this place is closed.... hubs and i got here ready to eat and there are signs on the door that its closed"}
{"text":"No, it's not authentic Mexican food.  Feel free to complain, but only if you're an authentic Mexican person.  Otherwise, stop letting bizarre hang-ups on authenticity stop you from enjoying what's in front of you!  Yeah, it's a chain.  I generally shy away from reviewing chains, because, well, it just seems kind of pointless.  However, Don Pablo's is worth giving a little shout to, at least.  The big square brick building houses a cavernous, open interior.  I'm not sure why they had to build it this big, but they sure did build it this big.  It's a little bit echo-y inside, but that actually helps, because the surrounding noise gives you a decent sense of privacy at your table.    Other reviews rate the food as lackluster, but I disagree.  I'd say the food has plenty of luster! Their queso dip is downright excellent, their entrees are well-prepared, and they have a decent selection.  The food's a bit salty, and really heavy, but if you're getting Tex-Mex, you're going to have that.  I'd have to say every time I've been here, the service has been decently fast, as well.  I would say that it's a little pricier than I might expect out of a place like that, though.  But only a little.  Don Pablo's isn't a bad choice at all!"}
{"text":"Never had a bad experience here but it's never blew my socks off either. They have really good margaritas and Sangria's so i tend to grab one every time i go. Like all mexican fast food (not taco bell) they bring warm chips and salsa to your table while you wait for your meal.  Tacos and burritos are good but like the fajitas the most. Something really fun about putting your own food together at the table. I tend to go chicken not too much into steak and the shrimp is kinda boring in taste. Never had a sandwich here but why would you its a mexican joint.   I love the way they decorated the place though. I can say it does have an authentic Mexican look with brick walls, bright colored paints and music that's festive but not distracting. It's good for large groups and the 30 feet ceiling makes you feel like your actually on the streets in Mehico!! They have decent specials as well during the week and for lunch so if your on a budget you can get a decent meal for under $8. Enjoy!"}
