{"text":"This place has everything!  And it's cheap!  They've got a nice cheese and meat counter, lots of imported Italian goods, and house-made treats, pasta, and other foods.

Here's a tip: try their chocolate-covered almond biscotti.  Mmmmm."}
{"text":"Good prices for a specialty grocery store. If you appreciate a fun assortment of deli items, this is the place for you!"}
{"text":"Jane is so right. The food and prices may be great, but who wants to eat dirt with it? I've seen someone mop the filthy snow tracked floor then put the bucket of water on the deli counter. No thanks. I'll pay a little more for sanitation. There are other Italian grocery stores close by."}
{"text":"I *used* to think Donatelli's was a great place--they're incredibly cheap, the premade foods like crab raviolis are delicious, and they have awesome chocolate covered pretzels and biscotti.
Then I saw one of the deli members drop meat on the floor, pick it up, and stick it right back in the case! Also, a whole tray of meatballs and sauce from the hot bar was spilled all over the floor. They just scooped it right back in and I only hope it wasn't served! The place smells awful and the workers are grumpy. There's a lady there who's always screaming and cursing and some fat guy that's just as bad. The LAST experience I had with Donatelli's was when I bought a tub of \"freshly packed\" soynuts. I got home, cracked a brew, and reached into my beer snack to find a WORM!!! If you value your health as I do, do not eat anything from Donatelli's that  was packed there."}
{"text":"A fine Pittsburgh establishment for Italian foods. A bit small but full of good items to eat."}
{"text":"If I can buy something here, I do.  Their produce is  always fresh, their deli has high quality meat and cheese, their grab and go is good and affordable.   They even have house made frozen pasta, sauces, and soups that are DELICIOUS.  If they're out of bread, we don't get bread.  The staff are friendly and helpful, even letting me know at checkout if there's a better option for what I already have.  Also, they carry Turner's milk which is the best milk.
Great job Donatelli's!!!  I love that you're my neighborhood store!"}
{"text":"Donatelli's Italian Food Center, Inc is next to O Yogurt in Bloomfield-Little Italy - Best prices and fresh food ever. We cannot wait to go back. Really awesome. We Love Our HOMETOWN PITTSBURGH :) YOU HAVE TO STOP here. I mean they have \"EVERY THING\" and it is really the BEST PRICES anywhere :)"}
{"text":"I'm a huge fan of this place.  The prices are great and they have a great selection of food.  their lasagna is great!  Always a great selection of produce...and really fresh.  Great selection of bread too.  I think they bake some of it there and also offer Breadworks products.  

I would have given them 5 stars, but there are a few things that bother me about this place (I hope the owner reads this).  They don't stay open late enough!!!!  they close at 6.  I would understand this if I went in there at 5.45 and the place was dead, but there is constantly a line at the deli and the checkouts.  You'd think the owners would want to maximize their profits and stay open later...because they would obviously do the business.  Isn't that usually the goal of business owners?   Also, when you go in later, the deli employees can get a little snippy...like getting you a pound of cheese is a huge inconvenience to their clean-up.  In my opinion, you should always treat the last customer as you would the first.  Another problem is that when you go in later, they completely shut down their hot food section..a mistake as that is the time people would stop in for a quick dinner to take home.  If they would stay open, they could get the business of those who work during the day!

All in all, Donatelli's a great little place, just not very accessible."}
{"text":"I dislike going in here but I do it often. Something just pulls me back in. 

The cashiers are generally friendly but incredibly slow and it is a rare occurrence to see more than one ringing at a time. This causes the line to basically wrap most of the way around the store then causing 'traffic jams' in aisles.

The store is small and heavily packed with everything Italian. The hot foods section is quite a hit or miss. Some things are delicious, some atrocious. The have a frozen section to buy various pastas and sauces. The pastas, mainly ravioli, are great. However, the sauces not so much.

If you're looking to get in and out quickly, I wouldn't recommend it but you have a few spare minutes, go for it."}
{"text":"This fish sandwhich is no joke! 2..yes 2 tilapia are fried until golden and put on a roll that all together weigh almost a lb! Long story short that sandwhich was delicious...ONLY 2 BUCKS and some change...and put me and my bf to sleep! 

Be sure you're ready for it...better yet plan your day around this sandwhich."}
{"text":"Nice article in today's PG about Donatelli's (and Groceria Italiana). But beware  -  a lot of products at Donatelli's are on the shelf  WAY  beyond their expiration date.  And yesteday the cheese \"cooler\" was so warm that the packages of goat cheese were almost liquid... and produce often sits rotting... But there are other virtues and values to be had, so be a smart shopper when browsing there!"}
{"text":"Overall a pretty great place. They have boars head, which is apparently rare for PGH. a big selection of prepared foods like salads, parmesans, pastas, etc. large build a hoagie menu. Massively diverse olive bar(s). And other italian specialty foodstuffs, along with produce. Prices are pretty fair too. The staff is generally good and knowledgable about product.  However, the one gruff lady with the hair net in back of the deli. I get it- \"its a deli, oldschool, quick and efficient, ya in ya out, and no time for pleasantries\". Except its 2016, she certainly isn't quick, and customer service is what can make or break a business' reputation. Place is great minus that one lady. Definitely patronize them. Worlds better than any deli around."}
{"text":"I'm shocked there are so few reviews for Donatelli's.  In reading the few reviews here, it seems people either love it or hate it.  Yes, it's an older building that might not be spotless and is overflowing with so much product that you can barely move around.  But it also gives me a comforting feeling, like the store is a blanket I want to wrap around myself.

Speaking of comfort, their foods are worth the visit.  They have good meats and cheeses at the deli as well as hot food items (one of these days I will get that fish sandwich).  Not hungry right now?  Check out all their frozen pasta items.  On my most recent visit, I picked up a 2 foot hoagie for $6.99, mostly because it was a great deal but also because sometimes I want someone else to make me a sandwich (and they used those good meats and cheeses from their deli).  Don't forget to pick up some bakery items on your way out.  I highly recommend the biscotti.

Bottom line: If you're wandering around Bloomfield looking for some unexpected surprises, there's no shortage and if you stop in Donatelli's you won't be disappointed."}
{"text":"A year ago I moved from Lawrenceville to Bloomfield and one v. nice perk is being within walking distance to Donatelli's.

As many other reviewers have mentioned, it's amazing how much amazing stuff they pack into a relatively tiny grocery.  Barrels of cured olives, great deli department, ready made fresh Italian delicacies, and a nice selection of produce are the stand outs.  They have the best potato salad I think I've ever had, and their tortellini salad is also v. good.

As I mentioned, it's a tiny store and it can get cramped.  You need to be patient, particularly at the deli counter.  There always seems to be six or seven people behind the deli counter doing \"stuff\" but only one or two workers actually waiting on people.  It's particularly bad from 4:45-5:00 p.m. on because they even though they are still open, and even though the store is packed from people getting there from work, they've started the clean up for the day.  

The check out lines can be long, as they usually have one register open.  The last three times I was there, the cashier missed something of mine (I buy usually 5 or 6 things max) on the counter and didn't ring it up.  So you can stand there and invent swear words and glare at the cashier, or you can take a deep breath and say to yourself, \"Serenity Now!\".

Food:  5 stars.  
Yucky waiting/delays in waiting/\"Sam, I've got a void at the counter\":  3 starts."}
{"text":"I've now been to Donatelli's multiple times, and have sampled several of their products, so I feel that I can review it comprehensively. Overall, I've been pleased with most of their products, the prices, and the customer service and atmosphere, hence the 4-star rating.

As others have mentioned, the space is rather cramped and chaotic, esp. during peak business hours (e.g., Sat. around noon, when I last stopped in).  The layout when you walk in is a bit strange, to the point that I inadvertently ended up behind the counter on my first visit.  (Stay to the left and you won't have this problem.)  The most crowded section of the store is the deli counter, where you can obtain not only meats and cheeses, but a variety of made-to-order sandwiches and sides.  If you visit the deli counter during peak hours and are feeling indecisive, take a number right away--trust me, you'll have plenty of time to decide what to get as others are being helped.

As for the grocery products, there is enough variety that you can find several versions of most Italian ingredients you'll need here, as well as other general grocery items like milk and ice cream. In general, prices are very reasonable-- generally less expensive than Groceria Italiana.  Unlike Groceria Italiana, a good portion of the product consists of commercially-available brands--albeit many that you wouldn't encounter in a mainstream grocery store like Giant Eagle. Having said that, the main attraction for me is the made-in-house items, such as the fresh pasta, the sauces, and the biscotti, as well as the hot meals.

In the interest of brevity, here is a list of products I've bought at Donatelli's, followed by price, recommendation, and comments:

Grandma's plain sauce ($3.65): Recommended--Better flavor and seasoning than commercial jarred sauces (e.g., Ragu, etc.)  Also, I like that Donatelli's makes meatless red sauce, unlike Groceria Italiana, since I don't eat beef.

Lobster ravioli ($9.99): Not recommended--After following boiling directions (necessary to avoid curdling cream sauce via baking), pasta was good, but filling was mushy.  Also, included imitation crabmeat, and I'm not a fan of imitation foods.  I'll be sticking to Groceria Italiana's handmade ravioli from now on.

Ricotta pie ($5.49): Recommended--Though this was my first time trying it, I was favorably impressed with the flavor and texture.

Biscotti ($3.52): Recommended--I've only had the spumoni biscotti (a flavor I haven't seen elsewhere), but it tasted fresh and was good.

Italian bread ($1.50): Recommended--Soft and fresh, and inexpensive

Hot food from deli counter: Recommended--I had the half pound fish sandwich ($2.49) and a half pound of the white cheddar bake ($2.99), and both were very good.  Notably, the roll was proportional to the fish, so the sandwich didn't fall apart, as is common at other PGH eateries serving fish sandwiches.

Despite how hectic Donatelli's can be during peak hours, I've been impressed at the friendly service that I've received at the deli counter and checkout.  If there's one drawback, it's that waits at both counters are inevitable during these times.  Of course, if your schedule permits, this problem can be avoided by simply visiting at non-peak times.

While Donatelli's may feel kind of cramped and may not seem as immaculately clean as some big box grocery stores (at least for the section the customer sees), this is part of its charm as a neighborhood ethnic grocery store.  I'll definitely continue stopping in for certain Italian grocery items, such as the plain sauce, biscotti, and bread, as well as for inexpensive, delicious hot lunch items."}
{"text":"Yet another review for Donatelli's?  

Well let's take a look at the January specials.  Imported Polish ham for $3.99 lb.  Polish ham at an Italian store?  Okay!  Fresh homemade pasta for $2.49 lb!  Gonna be having some veal tortellini with spicy Italian sausage and my homemade marinara sauce for dinner tonight.  Nicholas coffee for $6.99 lib.  We all know that Susan doesn't resume the form of a human female until she's had that 2nd cup."}
{"text":"I bought several cookies and candies at this Italian grocery store. The prices were a little high, and the taste was just OK. The cashier was polite."}
{"text":"My father and I love to come to Donatelli's when we are in Pittsburgh. It is hard to find any Italian food in the area that matches the quality of the food that we are able to find in NY. The staff and the food have been wonderful here. We hope to return in 2018!"}
{"text":"I love this store and have gone here often over the past few years, however, lately there is a lady behind the deli counter that is a total b**ch when I come in. The last time I came in and tried to use a coupon I printed from their web page, she yelled at me and told me I couldn't use it unless I bought a pound of lunch meat. Fine, although the coupon doesn't say that, that's okay. I wasn't rude back, but she glared at me the rest of the time I was in there. When I went in again recently, there was no one in the store and someone was in the back making sandwiches for me. Another employee asked if they could help me (I wanted to get lunch meat while I waited), and she quickly said, \"No, she's already waited on\", and glared at me again. Fine, but when another lady was partially through her order, she asked her, \"is there anything else I can get you while you wait for your other stuff?\". Really? As I've worked in customer service before too, I am never rude or demanding to employees. What is wrong with this lady? Seriously? Maybe next time I'll go somewhere else."}
{"text":"I also tried this place for the first time on a Burgh Bits and Bites Tour. They make their own ravioli from scratch and use an archaic pasta machine to stuff and cut it. The process is impressive and delicious. My first choice for homemade ravioli is Groceria Italiana (completely made by hand and more generously stuffed), but this is my second. They're also conveniently sold at the Macaroni Company in the Strip if you can't make it out to Bloomfield. Try them with Macaroni Company's own tomato basil sauce - to die for."}
{"text":"This Bloomfield wonder is a Pittsburgh original.  I love the meatball sub for $2.29 and the vat of olives for $3.99 lb.  They have the best prices on lemons and Nutella.  I buy bread and fresh cheese here as well as fresh pasta.  I have never seen the staff serve off the floor but you never know.  What I don't know won't hurt me, I hope."}
{"text":"After visiting Donatelli's today as part of a Yelp Event, my husband and I returned to purchase Cheese Ravioli, Grandma's Plain Sauce, and Chocolate-Covered Almond Biscotti for dinner. After having tried all three this evening, I can definitely recommend Donatelli's food and look forward to having these items again!"}
{"text":"Excellent prices, nice staff, and good food, but Donatelli's is a little chaotic and cramped. I love the small neighborhood vibe and the biscotti is delicious, but we've found cheese in the cheese section with expired dates (by well over a month), and it just doesn't feel like the cleanest operation to be handling, making, and selling food. Of course, as people who shop the Strip District, etc., we're not going to get too hung up on that. Just be certain to keep an eye on what they're stocking and make sure it's fresh!

The prepared foods are good, and the deli has a decent selection...not to mention their absurdly-affordable sandwiches. It's generally cheaper than the other Italian market nearby, Groceria Italiana (ex. the same half-gallon of milk was 30 cents cheaper at Donatelli's), and has more in terms of general grocery items, coffee (they sell Nicholas Coffee!), and snacks, so if you're looking to do a more extensive shopping trip, Donatelli's is probably recommended. My wife and I prefer Groceria italiana's pastas, desserts, and atmosphere, but we shop both on a regular basis. They're different enough to coexist, and both are good options! Check it out!"}
{"text":"I have eaten more meatball subs from this joint than I care to admit, and after polishing off another one for lunch, I figured it's high time I reviewed this place! The sub rolls are soft, the sauce is not over-seasoned nor sweet, and the meatballs are tender and delicious. Also, the subs are super affordable (perhaps why they're a frequent impulse purchase for me!).

Donatelli's has a great selection of cheeses, frozen pasta/sauce, and pickled/marinated veg, but isn't going to beat out a traditional grocery store on price for most groceries. No, my friend, you come here to get fresh mozzarella, a hot sub, imported charcuterie, or hard-to-find Italian sweets (baci, torrone), not to do your weekly grocery shopping. The staff aren't usually on hand while you're browsing, but they're happy to help you find anything if you track them down. One even referred me to another store on my quest for pasticiotti (an Italian pastry). While the store is smaller than Penn Mac, they pack a lot of the same treasures (including fresh bread from Breadworks), and the meatballs alone are worth the trek!"}
{"text":"Donatelli's has some of the best prices for produce, deli meats, and Italian goods in Pittsburgh. Though, I found the general quality of the produce to be mediocre. For some of the produce offered at outstanding prices (such as the red onions), it involved doing some searching to find fresh items.

I think it's a good neighborhood grocery store fir Bloomfield residents It's more worthy of three and a half stars than three stars."}
{"text":"Read great review of their meatball sub. Stopped by for lunch, at lunchtime, stood in line to find out they had no meatball subs. I got a terrible rubbery spicy chicken sandwich instead, and my coworker got an Italian sausage sandwich that she said didn't even seem cooked. Disappointed."}
{"text":"I've worked in the area since 2010, but I only recently visited Donatelli's for the first time. I bought a 2-pack of the sub sandwiches that were in the deli casing to share with my husband, and it was a great deal for only $6.99. Unfortunately, I took them back to work only to discover the lettuce and tomato were frozen, and the bread was soggy. I showed it to one of my coworkers who lives in the area, and he warned me that he has got sick several times from their turkey sandwiches... although, he still patronizes weekly! I was hungry, so I ripped off bits of it and ate what looked edible, but I didn't get sick from it! It's a good place to cheap fish sandwiches, especially instead of Armand's. I loved Armand's, but $15 for a fish sandwich is just ridiculous. When you can get 2/$5 fish sandwiches, no one can really beat that. Also, I'm guessing the place has a problem with shrinkage as there are cameras all over like Fort Knox, and signs that say \"we reserve the right to search your bags\" galore! I guess it is an impoverished area, but still awkward. I look forward to being a patron again in the future!"}
{"text":"I love this place. Love that I can walk to it, that it has an amazing deli, some amazing frozen marinara sauces, and that the customer service is just great.

I tend to come here for their fresh breads on Saturday, their grandma's marinara, and just the random things that I may forget at the regular grocery store. Oh not to mention they have 3 types of prosciutto!! Three!!  Anyway, they also have a ton of nuts, and sweets, as well and a boat load of olive oil. One thing that they are limited in is their produce, don't expect to get anything too crazy here.  Either way, this place is just clutch in order to have a good Italian dinner prepared at home. That or just to pick up some milk, eggs, and some deli meat!!

I totally recommend this joint!!"}
{"text":"I wish there were more small neighborhood grocery stores around like Donatelli's.  I've shopped here for many years, but more so in the last couple of years.  I like coming here for the fish sandwiches and other prepared foods.  They serve a wide variety of Boar's Head deli meats.  I've noticed that lunch meat bought from here doesn't last very long once you get it home.  I think maybe it's the deli counter where the meats are displayed and unwrapped that keeps them from being their freshest.  Be sure to read the signs out front and back by the deli for weekly sales and specials.  You can find good deals throughout the store on all your favorite items.  I never do any major grocery shopping here, mostly lunch trips for my coworker and I.
Today I bought two 1/2lb fish hoagies, 2 juicy Sunkist oranges, one roma tomato, a bag of pretzel rods, a big bag of Wise potato chips and a 1/2 gallon of Turner lemonade all for $10 and change!  Try buying all that at Giant Eagle for cheaper...won't happen!!
Pretty small inside, so no room for shopping carts. Grab a basket by the door.  I noticed today that they have a wide selection and good prices on olive oil, which often seems overpriced to me.  You can usually find the staff hard at work around the store while shopping.  Everyone is friendly and helpful.  Back at the deli counter they know me as the guy who always tips for service.  I give 2$ everytime a friendly face waits on me :)  I can tell they don't get tips often because they always express their gratitude for my kindness.  The store is convenient for Bloomfield locals who might be in walking distance.  There is no private parking, so grab a spot on Liberty and check out Donatelli's and other local businesses in Pittsburgh's Little Italy neighborhood!  Ciao!!"}
{"text":"This place is hit or miss. It needs a really good cleaning for one thing.  If you are open till 6 wait on people till than. Do not close stuff early. Or have all your help cleaning at 5:30. I do buy things here but..."}
{"text":"Another place I can't believe I've never reviewed. I come here so often it's like a second home. Being half Italian and growing up eating the finest feasts, coming to Donatelli's for supplies brings back the best memories of my Nana's kitchen. Everything is fresh---always!!! So many local foods to choose from as well as Italian imports. For a small market they have an extensive selection of anything you may need with great prices."}
