{"text":"This place is terrible:  -chefs constantly like to loudly spit derogatory terms in Chinese  -the boss and his friends were smoking inside the restaurant   -rude, unattentive service  -inconsistent food quality (on the bad side for the most part)  -cheated the weights for fish  -their steamed rice is rock hard and dry  -charged unreasonable prices  -delayed our orders"}
{"text":"Great. This is the best Cantonese dish that I have in Toronto for my life, only the decor and staffs are need do something better."}
{"text":"Food is consistently good.  Price is reasonable. Service needs improvement.  Establishment needs major renovation, especially the bathroom.  Needs to get rid of their carpet.    We visit Toronto annually and have been coming here for the last 5 -6 years.  We've dine in as well as order out.  Our visit in 2015 we were served by one of their worst waitress.  I think she was a new hire.  The woman appears to hate her job.  Our food were practically thrown at us.  Brought us the wrong order but act as if she'd done nothing wrong.  We came back again this year.  We had planned to order out since got there late and did not want to wait.  They did not have a take-out menu so I asked to \"borrow\" their regular menu for my friend to browse (since I cannot read Chinese) before we placed our order.  The skinny old man refused to loan me the menu.  He said \"You cannot take the menu outside of the restaurant, you have to come in.\" What is the big deal with a customer taking a menu out of the store?  It's not like I was going to sell their menu.   I can tolerate the bad service but this is just ridiculous."}
{"text":"Cost: reasonable Quality: good - 85% Decor: poor - 55% typical old and ugly chinese restaurant but if you are there for the good food right? Staff: poor/fair service - 60% again typical of this type of Chinese restaurant, you are not there for service Value: good - 80%  Keeper? Yes we go there frequently for good food (again not for the decor and not for the service). The restaurant is kinda hidden in a not very popular area. Good luck finding it but it's worth your while."}
{"text":"I love coming here with my family for a nice dinner that doesn't cost a fortune. We love their giant lobsters and roasted squab, their service is good and the food quality depends on what you order. They are open very late and is a good place to hang out with friends for a Little midnight snack as well."}
{"text":"Been here a few times.   -make sure to make reservations during holidays -food is pretty good -a little pricey  -a little cramp"}
{"text":"Located in a small plaza, this restaurant is hidden and can be easily missed. However, don't underestimate the dishes. We ordered some of the specialty dishes of Toi San and was impressed with the \"wok hai\".   Food: Crispy chicken- chicken was crispy on the outside and moist on the inside.  Toi San yellow eel rice in hot pot - 2 dishes: Serve a soup made with eel boned and a n eel rice cooked in the hot pot. Toward the end of the rice dish, can add water to the crispy leftover rice and enjoy another way of eating the rice. Pickled vegetable steamed pork belly- The pickled vegetables bring out the fatty pork flavour Overall, all the dishes tasted great with a good portion size. If it included a dessert soup, this would bring it up another level.  Service: Dishes are prepared fast and after you're done, they will hand you the bill since there are lots of people waiting. It's not a place to linger after. Some of the dishes have no English translation and are pasted on the wall in Chinese."}
{"text":"I have to say Dong Kee is a hidden gem! Such a small restaurant in a tiny plaza, who would've thought. I have been living in this area for many years, yet this is my first time here.   We got here at dinner time, so it was packed. Waited 15 min for our table, not bad. We can tell the restaurant is old, they do not have the best decorations or atmosphere, but there must be a reason why it is so busy here. Good food maybe? We got a 4 dishes combo, with a stir fired vegetable, half a chicken, 1 lobster and steamed fish. I am not enthusiastic about Chinese style lobsters like my mom, but I have to say dong kee's lobster is the bomb! I've never had more than 1 piece of lobster in other restaurants(I am lazy), yet I finished half of the dish here lol. The chicken was pretty good as well, not too oily and very lean. Decent steamed fish and vegetable.  I heard they have many other signature dishes and specialized in seafood. Will definitely come back for the lobsters and try out more dishes."}
{"text":"Food is good. Better to eat in than take out because the proportions for take out are smaller if you order more than one box of the same item. They accept only debit and cash."}
{"text":"I always like eating here for Chinese food. The food is always so tasty. It has a lot of \"wok flavour\". Lots of strong flavours, which is something I love about Chinese places like this one. Portions are definitely smaller and service is not very attentive but the food makes up for it in my opinion! Food always smells and tastes great. Definitely good for late night dinners."}
{"text":"will not ever go there again, small portion of food, bad customer seevice, not decent price, and if you can read chinese google it up, yorkbbs.ca has a photo of a rat in the resturant, they dont even appoligized to the customer according to the post. that make me firm of my decision. not recommanding."}
{"text":"This is my go-to late night place since a lot of other popular ones in the surrounding area have closed down. This place is literally a hidden gem. If you overlook the decorations and focus on the food then you will enjoy this place for what it offers: Amazing Chinese food.   Must Order: Fried Shrimp Hot and Sour Soup (only had it twice out of the hundred times I go when it wasn't as good) Mussels Fried Fish   It does get busy and sometimes rowdy at night when the party crowd comes out. Prices are very reasonable."}
{"text":"You can really get a good meal here for a decent price, especially if you're with family. Dishes are decent sized and pretty delicious. Their broad noodles are super delicious!! Also, their peking pork chop with onions seems to be a top dish here as well (I see a lot of tables order it & I've ordered it as well-- it's good). This restaurant does serve complimentary soup, but no complimentary desserts.  It does get super crowded & loud though, and the service here needs some improvement. I was waved off and ignored by several waiters/waitresses several times in one night (and this happens quite often here I'm afraid). Parking is pretty difficult to find as well...   Food here is a 4/5. You get a lot of bang for your buck if you eat here, but service... I would have to give it a 1/5."}
{"text":"Would have rated 0 star if possible.   I am a frequent here. Din-in a couple times a month as they open till pretty late at night.   Today my boyfriend and I came for the lamb stew pot. After we placed our order the server told us they are doing a promotion, if we spend $30 before tax the lamb stew pot will be $10.88 instead of $36.xx. We originally also ordered two steam garlic oyster ($4.99 each), but was told after that they were sold out of oyster which we asked before placing the order. Anyway we decided to order two more dishes ($12.95 each), two bowls of rice ($1.7x) and a can of coke which is a bit more than $30 before tax. After we finished the whole pot and one of the other dish (at least 30mins), our veggie dish still haven't arrive. We asked our server to check on it and she came back saying they are cooking it and told us we still need to order another dish to be quality for the promotion. I told the server our bill should be more than $30 before tax and ask her to double check. She came back and told us the boss said they don't earn anything form the rice nor the coke, thus those cannot be counted. I questioned the serves as they never mentioned that when we place the order nor it was stated on the promotion poster. The serve replied if I didn't mention about the promotion, you wouldn't have known anyway. I was pissed with her reply and the fact that we weren't told about their \"policy\". Anyway since my boyfriend didn't want to argue, we decided to order another dish. Note our veggie dish didn't arrive at least another 15mins. After we finish all our originally order dish, the newly added dish still haven't come. We again check with our server and was told they didn't place the order. We ended up sat there for a whole 15mins(total 30mins) just to wait for the dish, and we have to warp it as take out. Super disappointed with the whole experience today. NEVER COME BACK again!!"}
{"text":"I've never felt so disrespected at a restaurant ever lmao.  Although I frequent this restaurant and still would return anyways because the food is actually pretty decent, I'm giving this review solely based on this one negative experience I had.   Forgot the occasion but it was busy and my family tried to get a table without reso. We were quoted 30 minutes, fine. After about 45 minutes they said \"soon\" and then finally after hour and 15 minutes you told us to just leave as they do not have enough tables to accommodate their resos LMAAAAAO. First of all if you were so booked up could you have not accepted our name on the wait list second, how is it that you don't even have enough tables readily available for those who reserved one. People who booked a table still had to wait upwards of a hour for a table and even then people were not being turned down. Ended up going down the street a bit to a different restaurant who treated us like we were friends for years :')   But to be honest their crab lotus rice thing is bomb af so I 'd come back for that."}
{"text":"Great place for REAL Chinese food. It always has that great taste for every dish of theirs. They are known for their great prices and chicken and in Cantonese, \"Wok Hay\". I come here a lot because it's the place my parents love most. They like it here because of the nice servers. The servers are awesome and always help you out in deciding what to eat. Food comes really fast, unless it's a busy day so that's understanding.   Thanks for reading!"}
{"text":"A good place to eat an informal dinner. Has lots of basic and classic cantonese dishes. A good \"seew chow\" place. Dishes used to be cheaper and bigger before. Need to bring someone who reads chinese to order the dishes hanging on the walls. If I don't go with my hubby, then I just order the same old stuff that I can remember the names of. We especially like the big clay pot of eel rice, garlic spare ribs, stir fried clams and roasted pigeon. You get soup of the day with your dinner too. Service seems to be better from the gentlemen here, the ladies are all expressionless."}
{"text":"I've come here twice, first with a large group (13 people) and the second time with a party of 6. This place is constantly busy for dinner so either make reservations or come early if you want to avoid waiting (and snag a decent parking spot). The service was better the time the second time I came (note: it's a typical old-school Chinese restaurant) but the food was really good on both occasions, which is what matters more to me!   We ordered Beef Tenderloin in Chinese Style, Crispy Sweet & Sour Pork, Steamed Chicken with Vegetable, Clams with Spicy Sauce, Chow Mew with Salt Fish and Minced Meat. I wanted to order roast pigeon but they were already sold out (7pm on a Sunday night). The second time we ordered Crispy Fried Chicken (Half) and bunch of our favourites from our first visit. They have set meals but they are more expensive than ordering a la carte.   Both times we got free soup to start off our meal but they couldn't guarantee it was free of peanuts so I didn't give my daughter (who has a peanut allergy) any. Using peanuts in soup is common in Chinese soup recipes, so this is a common risk in Chinese restaurants. Make sure you order white rice to accompany your dishes so you can enjoy the yummy sauces that accompany each dish!  The restaurants actually has two levels but I noticed that they seem to fill up the first floor before sending people downstairs. Or perhaps they allocate the bottom floor for reservations, I'm not sure.   I really enjoyed the flavour of the dishes we ordered and also appreciated the very reasonable prices! There were many other dishes that I want to try, so I will be making more visits in the future."}
{"text":"Summary: busy Chinese restaurant offers classic and modern Chinese dishes in a quality, old-school manner, which includes a loud atmosphere, big portions, wide variety, and regular servers who have an easy rapport with the families that mark this as a regular go-to spot.  Top Must-get: fried rice (any) Top Regret: running free chicken  At a time when more and more local Chinese restaurants in the area are \"cha chan teng\" and \"customize-your-own-noodle-shops\", Dong Kee stands out as an old-fashioned favourite: yes, it can be a bit oily, and yes, sometimes there's a pinch too much salt, but for the most part, your dinner dishes come as you'd expect.  Last came here on a Tuesday night - packed house. We had to wait in the narrow entry hallway to wait for a seat. We were the third group waiting - got our number (#18) at 8:18, were seated by 8:28, and had our order by 8:40 - but we only had three dishes plus a rice, so take that with a grain of salt.  The places comes with complimentary soup (varies) which is a nice touch.  The \"running-free\" chicken wasn't particularly special (bit dry), but still we gulped it down. They're also really generous with their ginger onion sauce, which is nice. More positively, the beef dishes, fried rice, fried noodles (ho fan), and Chinese veggies were excellent.  The sweet and sour pork was actually very good - a good balance of crunchiness and flavour, with a decent meat:veggie ratio, which I highly value (it's not called sweet and sour peppers/pineapples, people).  The restaurant is pretty big but can get full, and it's popular among many families. They've got an array of large circular tables, and the few times I've been, many of them are occupied.  Worth coming back to!"}
{"text":"Our family went out for a dinner. We ordered many dishes, and all of them tasted so delicious! My favorite dish was the rice cooked in a clay pot. We got 2 portions from this dish: the soup and the rice. Non of the dishes failed us. Besides the excellent food, the customer service was brilliant! The servers were super friendly. They happily provided everything that we asked for. Overall, this place has given us a pleasant experience. Definitely recommend, and come back in the future for sure. Love it!!!"}
{"text":"I have been here several times back when I was a wee little kid. Never really liked this place tbh. But I wanted to go out and eat dinner with the fam and my dad LOVES this place so I was like meh, okay. Why the hell not? Who knows, I might like it now that I'm not a kid? RIGHT? LOL NOT REALLY SON. NAHHHH  I'm still not feeling this place. Food was okay. Service was pretty good (but I don't know if that is because my dad knows the owner and servers really well so..:/) Interior and overall environment.. eh. Could be better. For some reason, I don't ever feel clean coming here LOOL.   Noise level wise, it can get pretty loud. They're usually pretty packed so no surprise there.   I have absolutely no idea what the dishes I got were called so I can't even do a breakdown of what I thought about them (sad life.) BUT I do recommend yall to get this chicken dish. It's pretty good. Really flavourful and not too salty which is a plus. I think that's it. Oh, they also give out complimentary soup (HELL YEAH BOIs) but I'm like 89% sure they forgot to add in salt cause it was bland as hell. (or maybe because the other dishes I got were so salty ((and probs MSG overload)) I just lost all of my taste buds)  Would I recommend this place still? Meh, sure. I mean it's still okay and other yelpers love it so why not."}
{"text":"Had an overflowing lazy-susan full of the go-to dishes mentioned by others (not the pork belly so will have to go back) and every item was delicious and well executed. Maybe I've been to too many southern Chinese restaurants and my tolerance for everything but the food has changed but the service was decent, definitely fast, but friendly and attentive enough. The four stars are for the long hallway/waiting area, and the Chinese script menu items taped to the wall."}
{"text":"I use to go there every weekend when their food was cheaper. After tried so many dishes, I have to say that there's not a single dish made me down. That's not easy for any restaurant."}
{"text":"Ordered chicken hotpot, fried fish with sauce, sweet sour ribs, dongkee stir fried seafood. Everything so tasty. Bill comes to $75. Portion is small, but compare to the price, reasonable"}
{"text":"Service was non-existent.  Food was rather plain. We had ordered the typical sweet and sour pork. What we received was a plate of deep fried pork, barely any pineapple or red/green peppers. And it was just sweet not sweet and sour. The restaurant is rather crowded and extremely loud.   The price is fairly reasonable. $55 total for 5 dishes (on the smallish side) and 3 bowls of rice. Soup was complimentary and was also bland.  It is most likely we won't return. We have been to similar Chinese restaurant where the food and service is much better."}
{"text":"Look more comfortable with the new renovation and nice wok hei foods. Anyway, the dishes look smaller now...."}
{"text":"CASH ONLY  It was a dark and stormy Scarborough night...  So a couple of friends and I have been trying to hunt down another place but have been unsuccessful for a number of reasons. Driving down Midland, we had to come up with a plan B given that is 9pm, raining, and we can not find the place we originally came for.  First rule of dinner club: you look for crowded places. We see Dong Kee, it's packed, and we wander in...  Brilliant. It was packed but the staff efficiently got us all seated after a short wait and our order taken. For the three of us, we had: honey pepper short ribs, salt and pepper mushrooms, Pork Neck (!!!) with Lotus and Okra, Singapore Noodles, and Salt Fish Fried Rice. Plenty of food for three. Damage: $38:00. No complaints. It was great. Even the fried rice was good with it being light and not clumpy. The mushrooms were fried (who woulda thunk it) and delicious, and the short ribs and neck (!!!) were on point. Even the noodles and rice (which tend to be an afterthought) were fantastic.  The menu was huge so even if the above does not appeal to you, there should be something for you to like.  Will definitely be headed back. In a situation like this, I think 4 stars is a compliment in that food this good deserves to be compared to the best for its price range. It it the best Cantonese (big up Wayne for narrowing this down for me) I have ever had? Of course not but I will be headed back definitely.  REMEMBER: CASH ONLY."}
{"text":"Food is 5 stars! But i gave a 4 for overall due to tight space, long wait, feels very warm in here too.  Highly recommend to come here with your family so you can try more dishes. This is not a fancy place for a romantic date. It's strictly for foodies who want a tasty chinese dinner. The food is amazing! Make reservations as they are packed here for a Tuesday night even."}
{"text":"Me and my friends had been talking all the time about the Toi San Yellow Eel rice and decided to go there as a group to try it out.  Dong Kee is a hidden gem in the Scarborough area.  We ordered the Yellow Eel rice,  pork belly with pickup cabbage, wind sand chicken, and vegetables.  The dishes came out quickly and it taste awesome.  The rice came in a big big clay pot that can serve 5 to 6 people.  The yellow Eel mixed with green onions and rice and it smells good.  Definitely worth ordering.  We were surprised it also came with a yellow Eel soup.  The pork belly taste awesome and it is so soft that melt in my mouth.  The wind sand chicken skin was fried but the meat is soft.  It is cooked in perfection.  The only down side is the service because they are too busy serving many customers and some time you might get lack of attention.  Overall I will come back for more food."}
{"text":"In my opinion, this restaurant serves the finest southern Chinese cuisine. Ignore the service, the decors, the location, everything... just the food!! I never had better.   We got the eel rice cooked in earthenware pot, \"tone choi\" stir fried with fermented bean paste, wind sand chicken, and preserve vegetable steamed pork belly. Each one of these dishes were cooked to perfection.   The eel pot rice is full of flavour, not too oily and just the right texture, rice not too hard not too soft. \"Tone choi\" is a popular vegetable in Chinese cooking, usually stir fried with fermented bean paste. Usually the problem with this dish is that the veggie become too fibrous, two reason that can cause this, 1. it's cooked too long in low heat, and water gone out of the vegetable or 2. the restaurant didn't pick the right produce. No problem here, veggie is cooked just right with great texture and amazing wok flavour. Chicken is deep fried but not dry at all, even the white meats is moist! Finally the preserved veggie pork belly, amazing! I can eat maybe 5 bowls of white rice with this dish. The meat is so soft and succulent that you can literally pull it apart! Maybe I'll just call it Chinese pull pork from now on.  I'll definitely be back and the only reason I'm not giving it a full 5/5 is because the service and atmosphere is not that nice, but then again this is typical all Chinese restaurants. It's ok, just go, go for the food only. You won't regret it!!!  Taste ***** Price ***** Portion *****"}
{"text":"Food: 3/5 Service: 2/5 Atmosphere: 2/5  The redeeming quality is the food. Flavours were fantasic. Classic Cantonese style foods. But, I find the portions to be a tad small. And, I had a dish of pork where it was littered with onions... Could hardly find the meat. The soup that they serve at the beginning of the meal is extremely watered down.   I came on a Saturday night (crazy busy), and service was scattered. Servers were very prompt with you... Unless you're a frequent customer, of course (I was not). Not much to say. If you've been to a fair amount of Chinese restaurants, you'll get it.   The restaurant was incredibly loud--to the point it got intrusive. Like I mentioned before, if you've been to some Chinese restaurants, noise is quite typical. But wow, I haven't found a place THIS loud in a while. The place looks a bit dated, but was relatively clean. Could definitely use some renovations, as the layout of the place was awkward at best."}
{"text":"Don't expect a fine dining experience and you'll be okay.  Staff: Top marks for the speed of cooking. I think we got the first 3 dishes within 10 minutes of ordering. No problems clearing dishes, getting refill on tea/water, etc.  Ambience: It is a tight space and it is definitely not aiming very high in terms of appearance. But I came as a group of 6 and got seated at a table for 10 so I can't complain.  Food: We got the dinner for 6 which included a soup, a steamed lobster (small), sweet and sour chops (very tasty but lots of bones on some parts), two fish dishes (didn't seem very fresh), chicken (good), and a couple of veggie dishes (good again!). We also ordered a stir fry e-fu noodle which was very soggy and probably overcooked since the noodles fell apart.  Overall the food is okay, the food comes super quick, and place could use some work."}
{"text":"The portions were pretty small compared to standard chinese restaurant portions so it allows for more variety. My chair is literally back to back touching with the table next to ours so yes, the place has no privacy what so ever. If you're looking for a relaxing dinner or on a date, try somewhere else because it does tend to get noisy since majority of their clientele is the type that just want to talk while enjoying a beer. wouldn't really consider it a family restaurant but more like \"Feeling some beer and gossip so i'm going to call up the squad\" type of restaurant lol. service is pretty good. no complaints or anything that stood out but it is what it is~"}
{"text":"Great place! Fresh seafood. Live shrimps and steamed fish amazinggg. the black chicken soup stew is bomb too. Friendly enough service. Not the cleanest establishment though."}
{"text":"Great food but if you don't speak Chinese it hard to get service here. They have a variety of well known dishes like (Taishan Eel fried rice(special order call in to order first), beef tenderloin w/ beef short ribs in sizzling plate, Lotus wrapped crab over rice in bamboo Steamer).This place is very busy on the weekends so call to book if you have a large group. They also have a little room in the basement if there is a group that has more than two table."}
{"text":"We love coming here for the yellow eel fried rice-there are few restaurants in Toronto that can make this dish taste like home!   Not going to lie, their food is a lot better than other chinese restaurants. All the dishes are very flavourful and has \"wok hei\". But ofc, chinese food is usually very oily so it's no different here. One dish I highly recommend is obviously the taishanese yellow eel fried rice, which comes with a free soup boiled with eel bone, tofu and cilantro.   Reason why I gave a 2* is because of their shitty customer service. Every time we eat here we always feel so rushed. Today specifically, about 30 mins into our dinner they randomly gave us our bill without asking if we are ready to pay. Despite its our choice of when we pay, it was so disappointing to see the bill without asking for it. Also the waitress occasionally asked us if they can take the dish away even if there are food on the plate and some people are still eating. I get that they are busy but they can't compromise their customer service to accommodate new guests. I just find it really rude to disrupt our dinner that way.   One tip is that they are always busy so call to make reservations. I called them 5 times and they didn't pick up. On my 6th attempt, they somehow called me back on a different phone number...which was confusing."}
{"text":"I really like this place. The food is excellent. It doesnt matter what time we go, it is always busy. The food portion is big enough. I feel like its worthed only if we go with at least a group of 4. The only downside will be the deco."}
{"text":"Your typical Chinese restaurant. Very little meat on the chicken and there's no after meal soup."}
{"text":"this place isn't bad. everything is pretty much standard chinese food.  the one dish that stood out for me was this hot bowl? dish or something? whatever but it had. a steamed egg or tofu type thing? i don't know which one, it was shaped like tofu would be but tasted like steamed egg.  i don't know where i'm going with that but i have a funny story.  my brother in law who is white was at dinner with us. and i was debating with my sister about the name of this place as i was checking in on yelp. I asked, 'what is this place called?' she said, 'Dong G-E-E' Then i saw on yelp it was called dong kee, so i said, it's not dong gee, it's dong kee. and we debated for a good 30 seconds. and the token white guy says donkey? So when these deep fried ribs came out and he asked what kind of meat they were, i said donkey."}
{"text":"I don't know why? But every dishes I ordered from Dong Kee tonight made me feel like having some ice cold beer?!  Maybe it is the fresh from the wok vibe? Maybe it is the atmosphere? Just maybe all the dishes I ordered has this saltiness.. but in a good way?  Dong Kee really reminds me of an authentic Hong Kong eating experience: the smell, the noise, the hustle. The dishes here starts from $5.95, portions are small in a good way, because I ended up ordering more dishes and able to try out more things on the menu.  Fried Fish in Teriyaki Sauce ($5.95) - so crispy you can even eat the bones! Vegetables in Hot Pot ($6.95) Taiwanese Stir Fried ($5.95) - good with beer! Sirloin Steak with Garlic ($9.99)  All nicely done, hot and savoury.... Where is my BEER!!?  Dong Kee for sure is not a romantic restaurant to impress your date, but is a great place to come with a bunch of friends for a midnight or after party snack since it closes at 4 AM everyday!!  BTW, the fish tank at the back are packed with lobster, eels, crabs and fish.... Dong Kee full name is really Dong Kee Seafood Restaurant.. When you order your seafood, it is as fresh as it can get..   Anyone up for a midnight snack?"}
{"text":"First review. I've been a frequent customer to this joint with my family but I visited without my family first time today. It was not what I expected.   Called in advance to make reservation and ordered a bowl of eel rice, and specifically told them to NOT TO PUT ANY ONIONS IN IT in it in the phone call. When the food came there was evidently green onions and other types of onion in the rice. We tried to suck it up and just pick it out as we go, but as I look around the bowl, there seemed to be more onions in it than we thought. Talked to one of the server and she said there is usually another layer of green onions that goes on top but they didn't put it in this time, and whatever onions we see in it was needed for cooking the eel. We tried to cancel/return it but it was an obvious no, and I never would expect a Chinese restaurant to do so in the first place. So we decided to buckle up and suck it up and pick out every piece of onion there is. In the next scoop, I found a piece of plastic bag in the bowl. Once again I called the waitress over and this time they took it back.   Now like I said in the beginning, I've been to this restaurant numerous times with my family and the food has always been good - zero complains about the taste of the food. Accidents do happen (i.e. the piece of plastic bag) and for a Chinese diner, I think the servers handled it okay. But if I ask for no onions and you put onions in it, don't be making up some excuses after to cover it. If you can't do it (not putting any onions in) then just say no over the phone. Will I go back again? Yes, hell I found shrimp shells at Joey's one time and I'd still go back. But messing up my order and then trying to cover it up is something to write about."}
{"text":"A local Yelper designated this as our late night spot for some post-drinking vittles. So it was that past 3 am**, we wound our way over to this unremarkable-looking restaurant that turns out pretty tasty Chinese food and keeps late hours, not so common in this area.  Plain setting, fast service.  The dishes are smaller than usual but also priced accordingly, economical.  Perfect for a small group to share without being too filling.  Our orders were fried pork intestines, Taiwanese stir-fry, clams in black bean sauce, and plain congee.  Our hosts knew exactly what to order, good selection of dishes with nice contrasting flavors and textures, great taste overall.    Enjoyed this one, worth going back to.   **corrected by Jennifer K, my memory not being as reliable, lol ..."}
{"text":"This Chinese food is pretty good. A bit pricey though.  Had the stir fried beef rice noodle. Sweet and sour beef,  Drunken Chicken ,  Calamari Stir fry noodle . HK style ginger and scallion stir fry lobster . BBQ Spare ribs , Braised Pork Belly,  Tofu EEL soup and the famous EEL pork belly clay pot rice . The clay pot rice needs to be booked in advanced and takes 30 minutes to prepare .   Everything was very tasty and crispy.  The best was the slow cooked braised pork belly was so tender it just melts in your mouth though was a bit cool when it arrived . HK style ginger lobster was very flavorful. Only thing was the EEL clay pot rice . Just didn't taste right with the rice . Though the rice is best when it's near the end.  The pieces that's stuck to the pot is very crispy.  The bill was over $350. Will fill you up.  8 people and two kids."}
