{"text":"it's our second time to eat at this restaurant and the service is good. food is great and affordable. They also serve upland rice/violet rice--yum yum. Me and my husband will keep coming back to this place for sure."}
{"text":"A regular here. This is the best traditional Korean restaurant in downtown Toronto. Only Makkal Chon and Song Cooks in the outskirts would be better. You get a wide variety of bon chon and the kimchi is fairly young in the fermentation process which is something I prefer. You can't go wrong with the bossam, gam ja tang, and yu gae jang here. Highly recommend"}
{"text":"it's been a long time since I was here. I arrived just after 8pm and got a seat immediately. service was prompt and we ordered the dolsot bimbimbap, la kalbi ribs and tofu soup.  the bimbimbap came first and it was hot, and tasty. lots of greens and some beef. the stone bowl was hot which made the rice crispy at the base. The tofu soup was full flavored and came with pork and a whole egg. best tofu soup in a while. slightly spicy but not too spicy; my 2yr old enjoyed the tofu. the short ribs arrived sizzling and was not chewy....well that really depends on your teeth. I enjoyed it....best korean meal this year. highly recommended. come early. place was packed by 830pm"}
{"text":"This is hands down the best place at christie! If you're serious about eating korean food with no msg, this is the only place that I know that will deliver. Every single meal.  The owners are great people, and their food is always on point. I go there for a good samgyupsal meal or some other table cooking stuff. Beer + Soju + makolli + korean BBQ. Too good!  But Doo Roo Ae is the real deal. You have got to try it out!"}
{"text":"The first time I went I got soft tofu stew. I loved that they gave me a lot of side dishes and they tasted great. The stew also had a lot of vegetables and seafood and I found it addicting. I ordered the bossam the second time I ate there which was a little refreshing. The pickled Napa cabbage went well with the soft pork belly and it was a little spicy from the radish mixed with hot pepper sauce. Overall, the food was good and worth the price so I would definitely come again."}
{"text":"Want to try different Korean spot in Korean town on New Year day, while browsing around snow started to fall, therefore decide to move in some place warm and end up dining here.  The place is clean and I notice majority of patrons  and wait staffs are Koreans, which should be a good sight right.  Order pork bone soup as usual.  The service is slow and there are only two staffs serving the area.  In about 10-15 minutes they deliver side dishes first.  The portion is about right and the flavour has hit the mark, very delicious and I'm glad that they don't skimp on the portion.  Pork bone soup was serving a few minutes after and there are three big bones inside.  The broth is packed with flavour and not too spicy at all.  It was probably the best I've had in old Korean town area.  The stew includes a bowl of purple rice which is good.  Although the service is slow, I wouldn't mind wait a bit for them to get the stew right.  The service is slow and robotic.  Price is fair in the area.  They don't serve too many variety of stews but I'll definitely come again to try other stuff."}
{"text":"Great food and completely undaunted by our loud but lovely table of 20. Highlights the table cooked pork. 1 thing, I think we all would have preferred to cook ourselves but weren't given the opportunity really"}
{"text":"Hands down the best kimchi jjigae I've ever had was at this place. Their broth is SO delicious. I got the tuna kimchi jjigae and although there was only a little amount of tuna, I wasn't bothered because the both and kimchi were just so delicious.  The side dishes were plentiful and super yummy. Their fried fish cake was unlike others I've had. I believe they fry it in a hot oil which added to its flavour. The banchan we got were bean sprouts, cabbage and radish kimchi, spinach, broccoli, fish cake, cucumber salad. SO MUCH! I had also ordered the seafood pancake which was just okay. It's made with more egg than flour which some may prefer but I'm not one of them.  The place was clean, casual, quiet with some good bops playing in the background. Bathroom was also clean. Went around late afternoon so it was a bit slow. The staff was eating their lunch so service was a little slow in the beginning but it wasn't a big deal. Everyone there was very friendly.  Will 100% be back to this place, it's my new favourite!"}
{"text":"I alwayyyyys order their fried mackerel. The best dish on their menu! Their tongsiuyo is also good but a little bit spicy. Soups are pretty good.  As always , I thoroughly enjoy their many many side dishes! Amazing :)"}
{"text":"Excellent restaurant among a myriad of Korean restaurants in K-Town. It stands out due to quality side dishes. Well seasoned and delicately prepared. Authentic flavours. Kudos to the chef."}
{"text":"Came here for lunch. We ordered the seafood tofu stew and bulgogi on rice. Portions were ok size, however the food was very average. I also found an eyelash in my stew, and my husband had an eyelash in his life bulgogi!! When we asked for another serving of one of the side dishes, the waiter brought us little scraps of potatoes. Definitely not worth the rating."}
{"text":"The bbq is really good and the price is perfect. I have been a lot of Korean restaurant, this one is the best quality/price. They provide soup and a lot of cabbage leaves. Other food are good as well."}
{"text":"Large portions, reasonable prices, nice decor. Visited here with my wife and 15 month old son. Would definitely recommend to others."}
{"text":"So my regular place was closed for a few days so I ended up here.  Inside it is really nice, clean and modern enough for a Bloor West Korean restaurant.  I ordered the pork bone soup with rice, was not asked how spicy it was. Something I did not realise straight away and must shamefully say that it was a bit spicier than i prefer the broth to be and it masked any other flavours that might have been.  The sides were plenty, including some pancakes, which I have never seen any restaurant give as sides.  The portion was generous with 3 bits of pork bone. Was really only the broth that ruined it for me, otherwise really good."}
{"text":"After eating my Custard Taiyaki, I came here by myself for a quick dinner. The waitress just asked me to sit on a four-people table, then she brought me a cup of tea.   The tea was amazing and I obviously like it a lot! I annoyed the waitress many times to ask for more tea lol!   I ordered a Tofu Stew with Pork.  There was just one person serving but side dishes and food came fast.  Korean pancakes on a quite a big plate (for side dishes) came first. I actually was a bit disappointed as I thought they only gave pancakes to one person tables. But no, the other 6 side dishes followed with my stew! That surprised me, wow that's a lot of side dishes!!  Unlike other Korean restaurants nearby, rice came in a small bowl (instead of placing rice in a big pot with water) and an egg had already put into your pot. Tofu was super super soft! There were lots of pork to make you full! Also, one of the differences between other Korean restaurants is that we do not get to choose how spicy for the stew. And therefore, in my opinion the soup was not spicy at all but was perfect with rice.  That was really really full; I am very satisfied with the food and service.   Additionally, sofa is comfy and washrooms are clean and neat too.  This fantastic meal made me so full that it made me so sleepy as well ahaha!"}
{"text":"I waited 30mins just for my pork bone soup and pancake and the food is not even average, honestly I can make better one. The servants just kept us there and didn't  even have time to get us hot tea. I rly don't understand how the 4.5 stars came. Worst experience I have with a korean restaurant. This restaurant is on my blacklist."}
{"text":"Best authentic korean food in Christie. Highly recommended. The price is excellent considering the food you get."}
{"text":"4.5/5! A solid Korean restaurant with all the staple go-to korean dishes such as pork bone soup, bibimbap, and rice dishes with a side of delicious meat! I got the dolsot deopbap with kimchi and pork and it was good with a geneorus portion of meat and not-so finely chopped stir fried kimchi. I got a base of white rice which wasn't overcooked. Overall, the portion was large enough that I ate until I was full and saved more for later.  As for the side dishes, Doo Roo Ae is definitely a great choice! They gave us japchae, kimchi, cucumbers, potato, fish cake, pickled radish, beansprouts, and seaweed with broccoli which is way more than your typical korean restaurant. As for the service, the ladies were super nice! One was also making dumplings live! In action! Which is cool! To know! That they make! Their dumplings! In! HOUSE!"}
{"text":"Walked in on a whim on Saturday night and found my new favourite K-town spot.  + Our group was greeted promptly with hot corn tea and menus, which was great because it took a very long time to read through them, and we were hungry. + While we sipped Soju and waited for our food, we received a plate of DELICIOUS FRIED EGGS, on the house. WHAT. + As previously noted, banchan is bountiful and includes a pickled root vegetable that blew our minds. + Unlike other places, the menu offers (amongst its dozens upon dozens of dishes) only a dolsot ($9.10) or regular ($7.10) bibimbap of the beef/veggie variety. I was able to swap the meat out for tofu with no problems at all. + I ordered the tobokki (rice cakes with fish cakes, $9.10) \"normal\" on the \"hot-normal-mild\" spicy scale, thinking, you know, \"normal\". Guess what? \"Normal\" is also hot. IT'S SUPER HOT. I'm leaving this as a plus even though I literally nearly died, in case you like your food spicy, and also because it came with an egg too. WHAT. + Haemul Pajun (seafood and green onion pancake, $8/$12) was so tasty. Small was plenty. Good for sharing. + I tasted the Doenjang Jigae (soybean stew, $7.10) and it was really yummy, like a super hearty miso.* It came with purple rice and would make the perfect lunch and I'm totally getting it next time.  *Note for those with dietary restrictions: the stew had seafood in it although it was advertised as having only tofu and vegetables - a plus for me but obviously not for a non-seafood eater. So if you have any concerns, double check with your server."}
{"text":"3.5 rating because I noticed the menu is a bit overpriced compared to some other places.  This was my second visit to doo roo ae. I'm currently sick with the cold and I just wanted some hot stew to fill me up. My bf suggested I eat samgaetang (ginseng chicken soup) because apparently it's really good for you when you're sick and helps fight the heat in your body. So I came here today because I don't really know a lot of restaurants in the area that serves samgaetang. I only came here based on one of the review I read here.   Once I got the samgaetang, I noticed they don't put a whole lot of ginseng, I would say just enough and they're a few pieces. The chicken was really good and you can dip it in the salt and pepper provided. The soup however was really flavourful, I think I almost drank the entire broth lol. All in all, I think it was a great choice as it helped eased my cold for a bit. Recommend!"}
{"text":"We are regulars here. This place always serves the best Korean food I can find around this area.  Their menu is vast so I come here all the time but order something different every time. I love that they are open until 2am. So I come here around 10-11pm after work to have late dinner. Definitely recommend!"}
{"text":"The service was great. Our party of 10 was seated quickly, as we had made a reservation earlier. They also let one person from our party order first, because she had to leave much earlier than the rest of us.    I ordered the kimchi stew (kimchi jigae). The stew had kimchi, mushrooms and tofu in it, and came with a bowl of purple rice. I would consider the kimchi stew to be only a tiny bit spicy (but not really), because I can handle a bit of heat. I also liked the side dishes that we were served. There were garlic stems, kimchi, Chinese brocoli, sprouts, and pickled veggies. I also tried their seafood pancake (Haemul-pajeon) and it tasted great. It was hot and went really well with the soy sauce that came with it.   My coworkers seemed to like their dishes, too. The cold buckwheat noodles (Mul-naengmyeon) was very refreshing, and the dumpling soup (Mandu Guk) was very hearty.   10/10 would revisit to try some of their other dishes!!!"}
{"text":"The perk of this place is that they open on Sundays when some of the better places nearby arent open... Lim ga ne, imonay, sunrise... Went here a few times on sundays and really nothing tasted all that great to mention."}
{"text":"If you doo doo on Doo Roo, then I must call you cuckoo.  While walking along Bloor street in Korea Town, I spied with my little eye a sign that said Doo Roo.  Out of pure curiousity, I walked in and saw a nice spacious area that was quite clean.  I took a look at the prices and I think they were reasonable.  They seemed slightly more than the other shops in Korea Town, but not a lot.  This place had much better atmosphere so I completely get it.    I ordered the Soon Tofu which is mostly tofu with some seafood and a cracked egg cooking in the soup. It was $7.10 so not as cheap as some other places in the area, but still very reasonable.  However, it was more than worth the price because of the banchan/side dishes you get.     They gave me 7 side dishes!! It was crazy!  1. Some kind of Korean radish pancake - very yummy 2. Spied bean curd - decent 3. Potato salad - pretty good, but I have no idea what this has to do with Korean food. 4. Pickled cucumbers 5. Sprouts 6. Some kind of green veggie (not seaweed) 7. Kimchi - which tasted like it was made in house - very good but not too spicy.    They also offer free refills on these but I didn't want to be too much of a glutton, so I only asked for more kimchi.    As for the soon tofu, it was loaded with fresh tofu, wasn't too salty and came with purple rice.  It had a delicate natural flavour without being too overpowering.  Delicious.    Also, the service was wonderful.  So what did this all come to with tax? $8.00.  Yep. That's it.  What a steal.    Verdict: I'm coming back Doo Roo!"}
{"text":"Very friendly and a great spot for your korean food fix. My friends and I ordered the bibimbap and loved every bite! The side dishes were amazing and will definitely be coming here again."}
{"text":"Food is the key. Attentive staff and things keep coming on. Seriously tasty. Good for large groups.  Nothing much on the outside but step in and you want be disappointed.  Recommend everything on the menu!"}
{"text":"Really authentic Korean food in affordable price!! Because the owner, chef, staffs of DRA and even most costumers are Korean.  Although the staff made some mistakes for my order. I found the ginseng chicken soup for sale on the window and decided to taste it. But    it charged me for regular price because he told me the promotion was over yesterday and haven't taken it down yet. I thought that it should remind me before my ordering.  The chicken soup was so good and luxury because there were lots of ginseng and sticky rice stuffed inside. My friend ordered beef bibimbop was also very delicious. Side dishes were my favourite part when I came to have Korean cuisine. Of course does this restaurant."}
{"text":"Totally hit the spot. The service was great and I love the $9.99 meals. So worth it for the amount of food you get. Absolutely delish! Will be coming back again!"}
{"text":"Mixed feelings about this place.   The food is actually pretty good but a bit more pricy than other places in the same area. I would still recommend for the food.   The service is so so. Not sure if they don't care or just slow. But don't go there if you are in a hurry."}
{"text":"Visited here as Sunrise House beside it was packed. Japchae, served before other side dishes, had too much black pepper.   Pork Soon Tofu was pretty good, but I still prefer Buk Chang Dong's. Nice that they give you 8 side dishes and the waitress was attentive and friendly."}
{"text":"I went in this place around the time it first opened and they were having their opening promotion going on. 20% off or something. I got the Bossam and the gamjatang and they were sooo good. The side dishes were plenty, the place itself was nice and big and the service was awesome. I have now come to this place sooo many times that now u can say I am best friends with the owner hahaa. Their BBQ is soo good too. The owner always comes and grills the meat for me which is awesome since I tend to burn the meat lol. The service is exceptional. These days it seems to be getting more customers and I love that it's getting recognized by more people. I would def recommend this place to you guys. Bossam and the BBQ is a must try!  Love this place!!"}
{"text":"The Service: My first experience with this place, was on a weekend, we stood at the front of the restaurant for 5 minutes, no one acknowledged us or even looked our way so we left. I figured they were just very busy so we decided to try again another time.   I came here with my partner last night and was told to sit anywhere... in the front of the restaurant. The restaurant is divided into two sections, the main part of the restaurant with booths and a longer line of tables on the opposite end. Then, there's a divider and a more casual sitting area in the very front of the restaurant. We asked if we could sit in one of the booths and the server gave us a very curt \"No.\" Why? It wasn't busy, there were 3 booths open!   I don't know if it was an age thing, or a casual dress thing. There was another group of girls who were ostracized to the front like us.They were trying to get the server's attention for a very long time to get their bill. One of the poor girls sat with her hand up in the air for 10 minutes.  , The food: The food was delicious. We got a small order of soondae to share, I got the shank bone dumpling soup with noodles and my partner ordered the pork bone soup. My soup had a very simple taste but was very well prepared. There were a lot of side dishes and they were all very tasty. I ended up taking most of my soup to go because I filled up on the side dishes.   In terms of taste, this place was one of best I've tried in downtown Koreatown. The portions are very generous too.   Verdict: Would I come back? It's close to home so I may begrudgingly come back. Dinning out is more than just about the food for me, so this won't be my first choice.   TL:DR The food is good, the service is not friendly."}
{"text":"I'm a regular here and I'll gladly keep coming back!   First of all the side dishes are very fresh! I love their Japchae, Sweet Potatoes and Spicy Cucumber!   Their menu has a wide variety of dishes and the portions are huge and the prices are competitive. The food is fast and the service is pretty good, besides the waiters, every now and then the owner will walk by tables and confirm that everyone is doing well, she'll even tell you that her husband is in the back cooking :)   I'd recommend this place - the food is fresh, great prices, service is friendly, and its location is convenient."}
{"text":"Posting this review only because of the Rude Hostess/Server! We left the restaurant because of her attitude and didn't want to try their food.   We arrived at 10 pm and there were literally 4 booths and 1 small table next to door empty! We asked her to be seated... She said there is only 1 table for you! (The one next to the door) and she left us alone to do her job!!   We waited 10 minutes for her cause apparently she was the only person who could have us seated. Then after she came back to serve the customer who was sitting next to us, we said it's cold cause the table is close to door, if it's possible we sit at one of the booths. She goes. No if you are more than 6 ppl you can sit at the booth! I said but you do not have any other customers and there are 3 other booths! If a group of 6 comes, they can sit at the other ones! She showed us her frown and said no no and then again she left!!! That's it!   We waited! Another guy cam from kitchen, I'm not sure whether he was a server or not. We asked him to be seated at the booth. He politely said yes why not and went to prepare the booth for us. All of a sudden the lady came over and stopped him doing it and they started talking in Korean! She had frown on her face all the time and her attitude to customers was grossly disgusting and unprofessional. The guy apologized us and said she doesn't let him prepare the booth for us!   All the time the customers were looking at her and wondering why she didn't let us to sit at the booths and no new customers came during that time! We finally left the restaurant and went to another Korean restaurant across the street and spent our money over a better taste food with well behaved servers!   Lady! I don't know whether you are the owner of the place or you are a server, you need to change your attitude towards the customers!"}
{"text":"Food poisioning. Don't know why or how. Had kimchi and beef bokkeumbap with \"fried\" egg, with side dishes of kimchi and soybean. The taste seemed fine, and for a pricier menu compared to others in the area, I didn't assume anything bad.  For the past four hours I've been liquid-shitting my brains out. I wish I was making this up   I've eaten this dish and similar banchan from at least 5 other restaurants in the area so I don't know what's up with Doo Roo Ae and my stomach."}
{"text":"Was in Toronto over the weekend and went to Korea town. There are plenty of Korean restaurants, but we decided to go with this one. They had the best kimchi I've tasted! All of their \"ban-chan\" was delicious. We had their mandoo, kalbi, bibimbap, and soon doo boo jigae and all of it was very tasty. But, their banchan, was really the best."}
{"text":"All of the dishes were bland, tasteless. Weird mix of seasoning that produces very bland food - not a healthy bland taste, but one that lacks any flavor. do NOT go here."}
{"text":"4.5/5 for me! My friends and I decided to grab a late lunch/early dinner yesterday afternoon as we were really craving some Korean food. My friend had already been here and rated it 3.5/5 previously due to their higher prices. However my friend and I thought their prices were so reasonable for what we got after trying it for the first time.   Atmosphere was great, the restaurant is very clean and spacious and looks quite new. There were plenty of other seats but the waiter let us sit at a giant booth and we were all so comfortable! There were also quite a few people eating there when we arrived.   Food was delicious. No complaints on my end. I had the pork bone soup (8.99) and oh my goodness the portion was huge! Like I'd say it's about a 1/2 size bigger than the usual pork bone you get at other restaurants. It came with purple rice and was very tasty. I asked for not too spicy and they made it the right spice for me to handle. Friends had tonkatsu - also good, pretty standard and can't screw that up but it was a huge portion as well. Spicy cold noodles - good as well but friend commented that there was too much hot sauce for her but she enjoyed it. We also started with a bigger sized japchae as part of one of the side dishes - pretty good and a nice touch which made me feel like the slightly higher price is worth it. We also ordered a seafood pancake to start and it had a nice balance of squid shrimp and veggies. The rest of the side dishes came and there was quite a few and the server consistently came by and asked if we wanted side dishes to be refilled. Great service!  At the end when we asked for separate bills, I had asked if we can split the seafood pancake 3 ways on each bill and usually most Korean restaurants wouldn't be able to do that but this one was able to fine.   I'll definitely come back to this restaurant to try their tofu stew next time or one of their other dishes since this experience was great."}
{"text":"Tbh, I can't really discern between all the 4* Korean places in Koreatown.  In comparison to the last one I went to and Doo Roo Ae, there is literally no memorable difference.  It's not as though one place serves certain dishes that the other does not.  So this area is highly competitive when it comes to Korean restos of the same caliber.  Dishes are decently priced, service is relatively quick and no-fuss, there are plenty of banchans that are served/refilled to your desire, food arrives promptly, and it is solid.  Simple as that.  I ordered the soon tofu and it was less soupy, more tofu.  Rice seemed to be a mix of purple/white, broth wasn't overly salty, & egg was already broken into bowl.  I didn't try the bibimbap, but it looked good.  I had leftovers from both dishes, so portion-wise, it is generous!  Perfectly acceptable Korean resto to check-out, but again, very similar to other high-rated restaurants in the area!"}
{"text":"3.5 STARS +++++++++ Have been there before and it was a better experience (before), based on what we ordered.  It was at least a five star experience then.  We ordered one bibim nyengmyeon for Hubster and one hwae bibim nyengmyeon for me.  It was gorgeously presented, no question.  But the gochu-chang was ridiculously over the top very sweet.  It is supposed to be sweet but not like candy!  In Korea, the gochu-chang has a slight sweetness but this was crazy sweet.  The ingredients were OK.  The panchan, except for the kimchi which was well-fermented and strong was lacklustre.  Portions of main course were large.  Oyi kimchi portion was microscopic.  Service was alright.  I will go back because this place is clean and the food is generally good.  Will order a ttukbegae next time.  They serve some very traditional Korean dishes which I have not seen in a long time - which will be good for the winter."}
{"text":"This place has an extensive menu which is a plus. They offer many a la carte options as well as table cookings.  For two people we pick chicken wings, oxtail soup and spicy braised pork ribs.  - chicken wings comes with fries which is great. Fries are surprisingly crispy. Wings are tasty, well - seasoned  - oxtail soup only has thinly slices of meats and doesn't have oxtail with bones in it which dissapointed me. Wish there are more meat too  - spicy braised pork ribs are very good. Meat falls off the bone but not too tender and still have textture to it. Def will order this again when I'm here  - the purple rice here is a turn off. The ratio of purple rice to white rice is too little, i barely see any colors. But i dont think this affect much to the overall quality of the food  - price point is slightly higher but u get new and clean atmosphere with bright lights.   Will come back if im around this area"}
{"text":"My friends and I went here on a Saturday night and it was packed! Everyone enjoyed their food and although it's a little more pricey than other Korean restaurants, they give you more food.  I ordered the bossam and fried squid. The bossam was really good although a little too salty for me and I liked the squid a lot too (it had green onion in the batter I believe, and it was freshly fried when we got it). The only downside to our meal was the sweet and sour chicken dish which had a lot of batter and not much chicken.  The service was fine and I will probably come back in the future :)"}
{"text":"Unfortunately I didn't have my phone on me, or else I would've taken pictures. My friend and I came on a recommendation from his friend.  The side dishes were interesting...there were about 8 of them, more than the average place. The potatoes were amazing, the kimchi was terrible, there was a large bowl of glass noodles, yummy pickled cucumber, a weird green squash (we think), anchovies (chewy but not too fishy), bean sprouts, and another with spinach or something dark green.   The server put the water on the table for us to help ourselves, a smart move due to the hot and muggy weather outside. However, she was a bit slow for everything else, as it took a while for her to realize we were out of water, that we were done eating, and failed to ask if we wanted separate bills.   I ordered the bimbimbap (not dolsot, hot stone, as it was hot outside) and my friend ordered the squid hot plate dish. Usually for bimbimbap, the white rice is underneath and you mix it up and eat, but my rice came on the side and it was purple/red bean rice. I like the stuff, but it was strange that I had to put in my rice. The hot sauce was left with me to decide how much I wanted to put in...it wasn't very strong so I had to pour in a lot. My friend complained that the seafood wasn't fresh and that there were some alright pieces and some not-so-good tasting pieces. However, it was just the right amount of spice. It took a while for the server to return with his rice, since the dish came with a bowl, but he was waiting at least 3 minutes (when usually rice is made in bulk, so it shouldn't take that long...)  Some things I noted: there was no ddeokbokki on the menu, the rice was purple, there were no napkins, nicer decor than my regular place (but that doesn't mean much).  All in all, an alright place. However, I still stand by my favourite Korean restaurant, just down a block or two!"}
{"text":"I am not a fan of West Bloor Korean--I much prefer North York.  But this place was awesome!  I had bo sam, grilled mackerel and dwang jang chiggae.  Everything was awesome including the side dishes.  The place was clean and the service was above average.  I would suggest dumping the table BBQ (too much smoke) and the horrendous K-Pop."}
{"text":"This time I had bibimbap. it was 8.30 pm and very busy time and it showed. sadly ruce was overcooked and purple-ish? , bulgogi was very sparse and the whole meal (which I eat without the hot sauce because I am not into hot) lacked flavour a lot. Worst bibimbap I've had so far, this time :( service was fast and polite but I didn't get water, just hot tea which was too hot to drink and I don't like hot beverages. The day was quite hot also. People next to me got water without having to ask."}
{"text":"Very nice spacious interior compared to others at Korean town. Staffs are very friendly, great service. Very generous about side dishes. The only two things I'd say can be improved... The japchae noodles were a bit too salty for my liking, and the pork bone meat was not soft enough. Other than that, it's good overall! :)"}
{"text":"I don't have a go-to in Koreatown because although every place I've been to has been great, none has really stood out over the others. We had a church service in the area on Good Friday and wandered around afterwards trying to find a place that would accommodate the 20+ of us, and Doo Roo Ae fit the bill. There weren't many staff working but they were attentive, efficient and took great care of our huge group despite us showing up unannounced. Family style is definitely the way to go if you're in a group and we enjoyed everything. They were generous with their banchan as well. We were all happily stuffed for less than $20/person."}
{"text":"Amazing here. 5/5. Probably one of my favourite Korean spots in the area for high quality and very authentic Korean food. The pork bone soup is very good here - from what I remember, they add lots of pepper and it's quite spicier than most places. The side dishes are quite standard, with the exception of the japchae which they always serve much more of - it's very good - the entire table will chow down on this fast as soon as it's served. The kimchi is also great and always fresh, and it has a good amount of spice to it. Service is always top notch and they accept card here!"}
