{"text":"I'm a big fan of the french dip with \"Pauls homemade chips\", you can't go wrong with anything on Dorians Menu.   Dorians is a true hidden gem of Matthews, NC IF YOU haven't been to Dorians for lunch, do it TODAY ! you can thank me later"}
{"text":"I have heard people say it's really good so I went and tried it out.  I was in the mood for a fish sandwich and noticed they had one on their menu.  I got the fish sandwich combo.  The fish is placed on a Kaiser roll and comes with homemade potato chips.  The fish itself is ok and tasted a little on the bland side.  The sandwich is just the Kaiser Roll and fish.  When I bit into the sandwich all I could do is taste the bread because the roll was thick (after all it is a Kaiser roll).  I added tartar sauce for more flavor.  The homemade potato chips were good.  You can taste the natural flavor and there is a dipping sauce that comes with it that takes the taste of the potato chip to another level.  Overall if I went I would try something else, but I would stick with the potato chips.  The service is ok, and the range in price is $6 to $8."}
{"text":"Super nice staff, great food. My favorite is the French dip N Paul's \"chips\""}
{"text":"I've been going to Dorians for about five years now. The ladies that run the business make you feel like family. One day I will get my picture put up on the wall as well. I always order the corn beef. They know me by my order and when I call. The house chips with the homemade ranch is something that you want. Whatever you do get the sweet tea. It may be warm at first but asked for a cup of ice and it will be chilled and ready to be sipped!"}
{"text":"My lunch was extremely bland. I ordered the souvlaki and the chicken was rubbery. Very disappointing."}
{"text":"Dorian's is a quaint little spot nestled off of Independence Blvd. in Matthews. My wife and I went there based on memories from eating at Dorian's years back when she attended school near by. The decor was nice, and the service was great, but time must have erased from my wife's memory how bad the food was. The burger I ordered was obviously a frozen patty, and the onion rings tasted like they also came out of a bag or box. The chicken and fries my wife ordered were both under cooked. Needless to say this will most likely be the last time we visit this quaint little place in Matthews. I do give 2 stars for the excellent service we received though."}
{"text":"Dorian's is a hidden gem in Matthews! It's tucked away so that you might miss it if you aren't paying attention. We were greeted warmly and seated immediately and the server was knowledgeable about the menu. My husband and I each ordered a burger and we were very pleased with our food. You could tell the meat was fresh and burgers were hand pattied. The fries were crinkly and crunchy and freshly cooked. There were many other appetizing items on the menu as well.  If you're in the area, give Dorian's a try!"}
{"text":"Delicious place for lunch; one of the hidden gems of Matthews. Absolutely wonderful deli meats, sandwiches, and the chips with Ranch are to die for. Friendly family-run staff as well. Have been here several times and gotten something different each time- all wonderful!!"}
{"text":"Lunch on Feb 24   Had the special -- Fish Sandwich.   It came with homemade tarter sauce, coleslaw and homemade chips.   Look at the pic at the size of this meal -- that cost $6.25! Value and tasty.  The fish was hand battered before fried and there was 3 big pieces of fish on this sandwich.   So impressed by this little sandwich shop!"}
{"text":"I've been stalking this place for about a week now.  I finally found it this afternoon, I got there right before it closed.  Such nice people I passed it and didn't realize it, so the owner came out and flagged me down so I would know where to go, sweet right?   Any who I ordered my food the wait was a few minutes if that, I got it to go.  Got home and it looked very good I ate it, it was a little bland needed some pepper or extra mayo. Other than that it was good, the chips were really good homemade chips. Since I stalked it, I feel it's only right to go back and I will it was good and the people were really sweet, you don't find that too often."}
{"text":"Food was soooooo bad I couldn't even eat it.  In fact I took a picture of the gyro (definitely worth the thousand words).  You couldn't pay me to go back."}
{"text":"Just had lunch at Dorians with some friends. It was a first time for me but repeat for the friends. The food was great and the service was great and friendly too.  I had the euro and onion rings. My hubby had the Ruben sandwich and said it was the best. We will definitely be back."}
{"text":"Service was par, food was terrible. The food had no flavor at all. Got the chicken salad sandwich with potato salad. Both equally bland and horrible. Didn't even eat 1/4 of it. Even the \"homemade\" were disappointing.  Wasted $$. Will not try again"}
{"text":"A truly unlike stop! If you aren't looking for this place, you will miss it. Tucked away, this is a hidden gem of Matthews. Dorian's Deli & Grill reminds me of Tom's Resturant from Seinfeld for some reason. Maybe it's the staff that works there, or the home-y feeling you get as soon as you walk through the door, but there's just something about this place that puts you at ease.   With a pretty extensive menu (they only serve lunch), I opted for a Ruben and homemade chips. I was pleasantly surprised with the meal.   Decent sized portions. the chips alone would make you come back for more and the friendly demeanor of the staff is the cherry on top.   Because they're only open for lunch, finding a seat can be a little bit of an issue (or parking in the lot) but don't worry a lot of folks order at the counter and take their good to go."}
{"text":"Had lunch there today 12/23/15, and it was very good.  Price was reasonable, and the owners and staff are very nice.  They run specials toward the end of the week; fish sandwiches and taco salads along with other things.  The fish sandwiches are very good and much better fish than you can get in a seafood restaurant.  The French dip and chicken salad sandwiches are unbeatable.  Pauls chips are made daily and no one can beat them.  Really good food, you can't go wrong at this deli."}
