{"text":"I agree with previous reviewer that compared to similar spots, they are definitely top. Nice people, very clean. Great food. Shawarma is my go-to. I come at least once a week."}
{"text":"Pretty good shawarma and kabob spot  I'd opine that their kabobs are slightly better but the true hit here is their jalapeño hot sauce with goes great with everything.  I was lucky enough to have one of their regular patrons point it out to me one day and now I go here specifically for the sauce.  I'd buy multiple bottles if I could.  Goes well with kabobs, shawarma and even the rice lol.  Almost gets a four star overall due to it as I'd give the sauce 4.5/5  Most definitely worth a try if you can deal with the minimal heat it has. Tasty hot sauces are hard to find and this one goes quite well with their offerings."}
{"text":"Great food..!! Especially love their spicy chicken Kabab... Their French fries are amazing with all the hot sauces and garlic sauce. The beef was a lil undercooked but over all great food.. N last it is completely Hand Slaughtered Halal..!!"}
{"text":"I'm giving this place a 5 star, because between the peers, this place really stands out. You get good portions, very reasonableprices and good service. I have been going there for a while and the new owners really elevated the quality of the place, the food, the service. It's a great quick-lunch or a take out place, you get what you see, good quality and good tastes good."}
{"text":"Been going to this place for years, my go to is the chicken shawarma plate with extra garlic sauce. It always hits the spot. Portions are generous and quality is consistent, never had a bad meal. Staff is super friendly and everything is displayed so you know it's fresh!"}
{"text":"Was driving along Steeles today and saw all the signage. On the grass, on the building, in the parking lot and it seemed busy at lunch. So why not ? Inside is a very clean and efficient daytime based Middle Eastern restaurant. The meats are fresh, service enthusiastic. Customers of all cultures were here during my lunch. So Toronto. Will be back. Beef Shami dinner ruled."}
