{"text":"We went for lunch here and ordered two pains dosas and two ghee dosas. The service here is lacking. They seated us but did not give us a menu. We had to go look around and grab it ourselves. Took them a while to grab our orders ( there was only one other family other than us there and three waitresses). Finally they brought us the two plain dosas after close to 30 mins of waiting. The dosas were COLD! And the waitress didn't mention anything about the rest of our order. Didn't mention that we had to wait or it's coming ( it arrived after 15 mins). The waitress was very stand-off ish. Not approachable and rolled her eyes when my husband Clarified our order. We even had to ask twice for cups of water.  On top of allll that, the waitress gave us the wrong amount of change. But after a horrible experience, we felt it was better to just leave the place. DO NOT EAT HERE !!!!"}
{"text":"Took my Mom who loves South Indian cuisine for lunch. We ordered Medhu vada, onion pakora, spinach dosa, plain dosa, madras masala dosa, cauliflower dosa and tea. The appetizers were tasty but not good value for money. We got just 3 pieces of pakora for 4.25 and 3 small medhu vada for 4. The dosas were good, and perfectly cooked. Nice job there, however sambhar portion was very small and all chutnies were watered down and runny. The tea was served in steel glasses and it was difficult for us to hold on to it as it was too hot. The tea was not bad but definitely not worth 2.50 . Overall it was on ok experience. The waitress was friendly and helpful. The place is clean and decor is good. They need to work on portion sizes for their appetizers and not be stingy with sambher. And chutneys should not be this runny."}
{"text":"To start with, my first time experience was disastrous! I visited Dosa Rama along with my family and friends around 5pm in the evening. There were only a couple (4 maybe) of people at that time. We ordered Appetizers and main course. The waitress was really sweet. While we waited for the food, we could hear men yelling at each other inside the kitchen and we also noticed the music (instrumental flute) was horrendous. The food (starters) took ages to reach our table. It was under cooked. Then came panner butter masala and naan 45 - 50 min. Omg, it was bad. Legit! \"The panner butter masala WAS BAD\". Not to forget the less quantity. Sad part was we never got any of our dosas that we ordered. We decided to leave the place immediately. My overall experience was 1/10. 1 for the waitress who served us with a pleasant smile. Hope the management takes a look at customer reviews and serve better. #disappointedcustomer"}
{"text":"The restaurant was nice cozy and clean. The service was courteous and friendly. We ordered the Mysore Masala Dosa, Mint Masala Dosa and they were both very good. Would definitely come here again."}
{"text":"Dosa rama you need to buckle up! Your dosas are just average. I am a true south Indian , your place is neat, your staff was good , but ur dosas lack the taste."}
{"text":"I went here to try the dosas! We ordered the mushroom Dosa, onion dosa, palak paneer, and samosas. From this experience I learned to stick to the usual dosa not to try anything new! The onion dosa just had chopped up onions on top of the potatoes not even sautéed! The mushrooms dosa was beyond terrible it had his unusual taste. Lastly the palak paneer was defiantly not what I had expected it to be. The waiter was very nice about it and didn't charge for the palak paneer since it had burnt paneers in it . I didn't complain about the dosas as it may just have been us not liking what we ordered.  On the other hand, the samosas were good! The service was good and friendly, Nice interior but washroom needs a clean up. I think I will pass on going back here but it was just what I had experience, maybe it won't be so bad for others!"}
{"text":"Dosarama has good quality of dosa. worth trying..good ambience, friendly staff focused on providing customer satisfaction..."}
{"text":"Pretty decent vegetarian South Indian food in the markham Scarborough area. South Indian food includes dosas (crispy Indian crepes with or without fillings), rotis with curry, and some nice apps. I like the spacious seating and the food overall is flavourful and the dosas here.  It's vegetarian food, but overall good! They also have rotis/parottas with curry or crispy puri which is light and airy!  I've been here 3 times and overall good, especially in the area for a sit down restaurant! Sometimes they don't have everything on the menu but it's decent overall.  It's got its rustic charm, decent  food overall."}
{"text":"Nice sleek new vegetarian dosa restaurant on the edge of Markham. The menu is very diverse, it has alot of great options. I wouldn't say unique options, as I've seen all them before in other South Asian restaurants.  The dosas are the perfect size. One is enough to share for 2 I would say. All the dosas we got had a potato curry inside of it which was a nice surprise. They were perfectly crisp and very cheap.  I loved all the external curries we got. The paneer was absolutely delicious, and was the perfect size especially since we were eating it with already filling dosas.   I would skip the appetizers and drinks. The vadais we got tasted the same as any other cheap south Asian eat place. The lassi was also alright, not too unique.  The best part of this place was the price! We order 3 dosas, 1 curry, 1 lassi and a plate of vadais and the bill came to under 50$! What a steal! The service was good, nothing to say. We got all our food in under 15 minutes."}
{"text":"We went there for lunch buffet on a weekend. The restaurant had very few people. Overall the food was bad. I am generally generous in terms of accepting mediocre taste. But unfortunately the food was way to bad. The dosa was too oily and we were searching for poori in the oil! The vada was cold and hard, so was the idli. I am not sure how good the food is, if ordered off the menu! They really need to get things right."}
{"text":"I have been there for the Sunday buffet.  It was crappy. Waste of time and money.  Not many items are in the menu. Only very selective items and taste was horrible. Too much oil in everything I have touched"}
{"text":"My husband and I decided to give this place a try after our regular dosa spot was down for renovations. I'm so glad we did!   The service was friendly and just your usual service. Waitress was quick and made sure everything was fine after we took bites. No complaints about service here.   The restaurant is a vegetarian restaurant so you won't find any meat items here. But, the food all looked delicious at nearby tables. We just came to get our dosa fix on, so we only ordered Dosa's. I ordered the Mysore masala dosa and it was delicious. The chutneys were a good add on of flavour as well."}
{"text":"The buffet was cold and in very unheigenic conditions.  The plates were dirty and had food stuck in corners.  Food didn't feel fresh and definitely not tasty.  Basic things like idli, Sambhar or rasam was not made well!  A less oil dosa waa super oily.  Complete dissapointment. Waste of money."}
{"text":"It's a simple no frills Dosa place - that's the one line to describe the place. The theme is around Ramayana and hence the name Rama. It's in a market place and there is enough parking. Seating is comfortable and the service is quick. The dosa's are pretty good and comparable to the other places  in Toronto. They have various options out there for you to chose from. We were a group of 4 and all of us chose a different kind of dosa - mine was a Mint Chutney Dosa which I liked very much. The service is quick and the host was friendly. The washrooms can be kept more cleaner - I don't know why restaurants ignore that important factor, especially the Indian ones, as folks eat with hand. Overall a good place if you are craving for some good Dosa."}
{"text":"I wanted to give this new dosa place a chance. Reviews so far were mediocre but  that could be growing pains for a new place. I ordered masala bonda and the mini dosa platter. The masala bonda was tasty and served with 2 chutneys. Only complaint was that it appears to have been reheated in a microwave - which made it really hot. But the taste was good. Chutneys were also tasty. That's when it started to go downhill. Asked for some more chutney - the waitress got me a small amount maybe 2 spoons worth. The dosa platter arrived - plain dosa, vada idli sambhar and three chutneys. One of them tasted of old coconuts - it was borderline rancid. Sambhar was off - taste was not that good. Dosa was crisp in parts and not others. Mediocre. Asked for the check. Found that I've been charged for the extra chutney. Don't mind paying but she should have informed me. When I pointed this out to the cashier, he agreed with me that this was not good - but did nothing about it. Told him that he would get zero tip and a poor Yelp rating and left. No need to go here again not with solid places like Nilgiri and Saravana in the neighbourhood."}
{"text":"$9.99 Weekend Buffet: Good selection of dishes, great service, affordable/reasonable, \"clean\" healthy food, clean environment."}
{"text":"Loved this restaurant! I been going here since its has opened and it has progressively gotten better. New variety every time. Also like the fact that it is fully vegetarian. The atmosphere is nice and the staff are friendly. The thali has your typical south indian specialties."}
{"text":"The waitress forgot my order and then made me my dosa after we had already finished my boyfriends...   The dosas were delicious, but there was a piece of plastic wrap in one of my chutneys ...   We then ordered kulfi... but it just tasted like plain Chapman's Vanilla ice cream. No cardamom or almonds as the menu stated. You can't fool a fellow Indian girl.   I was really hoping to like this place but IT WAS A HOT MESS. Not recommended."}
{"text":"Maybe I went on a really good day compared to the others. I am not a huge fan of vegetarian food. However, my mom and sister took me here for a weekday lunch buffet. I was very impressed.   I had like 7 vadais multiple curries with poori, dosa, different types of rice.   For $8-10 there is no way I could complain for the amount of food at that quality. The price point is the equivalent if a foot long sub. Definitely come here instead."}
{"text":"Is Dosa Rama a pun on Dollarama or it is named after the god Rama, the seventh avatar of the Hindu God Vishnu?  I walked in because I thought it was punny. Based on the religious decor, it is likely the latter. I have a feeling the owner may not have appreciated my pun.   My companion and I walked in during the buffet service. The buffet option is $9.99 on the weekend and $7.99 on the weekday.  Needless to say, it was busy. The service was decent nonetheless. The staff was friendly. Service was prompt.   We had sweet coconut appam moments before entering the restaurant and did not feel we can justify unlimited dosa. The risk of food coma, far outweighs the notion of economy. We made the responsibile decision in avoiding a situation with a \"diminishing return on investment\" and shared a rava onion masala.   The blend of semolina and rice rava onion masala crepe was gigantic. It is filled with an impressive amount of masala potato. It was flavourful. Consistency of the tomato chutney, coconut chutney and mint chutney were thin and watery. The crepe was very thick relative to other dosa restaurants. While it had the same crunch, it lacked the finesse of a typical rava masala dosa.   Rice crepes being served to other diners, seem light and crisp! To determine whether this is the case of \"grass is always greener on the other side of the fence\", I may need to come back with my stretchy pants a lunch buffet."}
{"text":"Third visit to Dosarama and it has shown a steady decline. Lunch buffet is below average compared to others in the area. The place looked filthy with food littered all over the floor and the buffet area towards the back, next to washrooms, smelled of, guess what?  Hope they clean up their act, literally."}
