{"text":"I really wish it was better.  We had the greasiest BBQ we've ever eaten, especially the brisket, which was in an inch of grease.  The sausage was better.  The ribs have some potential but were badly overcooked.  Even the loaded potato with brisket was swimming in grease.   The service was very friendly--I do hope the food can get better."}
{"text":"Great brisket tamales on Thursdays. Service is quick & pleasant. Beer is cold. Yea!   The owners are really colorful to talk with.      Don't forget to save room for the 'buttermilk pie'. A strange concept for me, but man is it good!"}
{"text":"This is a neighborhood restaurant owned by a couple who are working hard to get a local neighborhood association to give them the OK on running an outdoor smoker. The city was fine with the smoker however a number of neighbors expressed concern. So the meat is currently cooked off site at their smoker and brought to the restaurant.  I've gotten their brisket and Thursday special tamales numerous times and found them to be great. I've called ahead and gotten it to go on the ride home, and it was always ready to go on time. The brisket is actually better to me than other brisket I've had from a number of regionally well known BBQ places in the Austin Texas area. It's correct that you don't get the whole slices, but our family has found the meat is delicious and the chunks are big enough to enjoy, but with no cutting.    Hopefully the on site smoker gets the green light soon, but in the meantime, we look forward to continuing to enjoy their brisket and tamales."}
{"text":"I so desperately wanted to like this place. I'm originally from Texas and crave good BBQ. There are 4 things that I look for in a good TEXAS BBQ joint: 1. Must have brisket (and the brisket must be tender and fall apart, also it shouldn't be too fatty or dry) 2. Must have sweet tea 3. Must have white bread (I know it sounds ridiculous if you're not from Texas but this is a staple in EVERY Texas BBQ joint, believe me) 4. Must have good sauce for the meat.  1. They do have brisket and it wasn't too dry or fatty. It didn't seem quite as tender as I like it but it was fairly good. 2. They do have sweet tea.  3. The plates didn't come out with white bread. Fine, I thought. I'll just ask for some. Nope. No white bread or any bread on the premises. They have cornbread which was very dry and spicier than I expected. It was not my favorite. (For anyone who hasn't had BBQ in Texas -- you use the bread to make a little BBQ \"taco\" with the brisket. Take a slice of bread, add brisket and sauce and then fold in half.)  4. They do 2 sauces and they were ok. Nothing spectacular.    Double S, if you're listening, you could easily get a loyal customer. Just offer some bread with BBQ and consider adding other meat options. I'm a bit surprised there was no chicken. Bread and chicken would get you at least 2 more stars."}
{"text":"We were a party of 8 BBQ lovers so got a variety of entrees and sides- ribs, brisket, brisket sandwich, fries, potato salad, coleslaw, corn, cornbread. Most of our party found the food OK, but there were a lot of missing notes- they did bring butter for the cornbread when asked, but didn't have honey. No hot sauce on the table, just 2 speeds of BBQ sauce, have to ask, and it's a sriracha  not tabasco or another well known brand. No peppers for the heat fans. BBQ sauce is on the sweet side, needs a hit of more vinegar to balance. Personally I found everything too salty and so did my kids - salt is to enhance the flavor of the food, not be the flavor.  My ribs were very tender, falling off the bone, but again, over salted. Service was very attentive, since we were the only people there at 6:30. OK but we'll probably try a different place next time."}
{"text":"Fantastic!  Ribs tender, great dry rub, no sauce needed.  Quick service and great brews to wash it down."}
{"text":"We really wanted to like this place but it just fell flat.  We went on a Thursday night and had the special brisket nachos...they were disappointing to say the least.  The chips were very bizarre and overly greasy,  they had lots of real cheddar cheese melted all over but they were baked so long that the cheese harden and you could barely get the chips apart.    It was served with a good amount of sour cream and but very little salsa.  The salsa was just poured over top so there was nothing to dip it in.  The brisket itself was tender but tasted heavy of beer, which I am not a fan of.  To top it all off the nachos were served in a disposable aluminum pie tin.  All the utensils and plates and cups were disposable.  This is very frustrating to me,  I hate using disposable because t is so wasteful. And it makes it feel you are getting takeout.  Not to mention the forks were on the table in with the BBQ sauce so who knows who had already fingered them, gross!  All the drinks were out of a can.  They had a bar but basically nothing behind it, not even a soda machine.  We were extremely disappointed and will not be back.  We left and split a pizza down the street a Pizza Bruta which was much more satisfying."}
{"text":"Great BBQ. Good prices and large portions so you can take it home and have it for a second meal even. Highly recommend."}
{"text":"Went on date night here, staff were friendly but only one other couple was there. Other couple left, leaving the place empty apart from my friend and I. Clear, plastic small cup to serve drinks in, even the wine. Got the gumbo and it tasted like it was right out of a can, almost no flavour. Friend ordered brisket, no sauce on it, did not taste fresh. Halfway through dining experience around 8:30 PM, music and TV abruptly turned off. My friend and I were confused but continued to pick at our meal. Shortly after, the lights shut off but neither of the workers said anything to us. We took that as an indication that they were closing. After paying our overpriced bill, we left and both decided that we would likely not be returning."}
{"text":"Unfortunately we were very disappointed as we had been looking forward to some good BBQ in our neighborhood.  The food had the taste of a franchise chain  The BBQ  tasted as though they used artificial smoke flavoring.  They tried too hard to replicate a stereotypical BBQ joint. Service was excellent and friendly!"}
{"text":"Went to the Double S after a family recommendation.  Had the Brisket sandwich, fries, and Gumbo along with a few Shinerbocks.  Gumbo was great and very smokey, Brisket was well cooked and delicious (BBQ sauce is great) and the fries were excellent.  Service was good and the owners were very friendly."}
{"text":"Brisket was tough and dry, frys were crispy and hot .  Service was good,  also had baked tater was soggy,  toppings were ok Not sure if we will be back, a bit pricy"}
{"text":"Family from NC here for a visit, we wanted some brisket and boy, did Double S come through! Some of the best brisket my family and I have had. Tender, flavorful....the female owner attended to us for our to=go order, she was so nice! They were also the most fairlypriced takeout bbq that we found. I will definitely return, Double S is excellent!"}
{"text":"Stopped in to this place last night, and it was perhaps a little depressing.  It was a cold night, and there were only a few tables full of people dining.  The place is rather small, but they do offer some room at the bar.  The decor is what you'd probably expect from a place called Double S BBQ.  It's a fun, cozy place to eat some BBQ.  The food was fine.  We both ordered the brisket sandwich, and used different sauces.  I opted for the original sauce, my companion doused his brisket in the hot barbecue sauce. The sauces were fine, but nothing that really wowed me.  The  brisket was nicely cooked, and tasted quite nice.  A decent portion of meat was served, but the hamburger bun it was served on wasn't the best.  It kind of fell apart.  The sandwiches were served with a truly ridiculous amount of french fries.  Way too many french fries, enough to feed 2-3 people.  There was a pickle spear hidden under that mound of fries, and I did enjoy that.  It just took awhile before I even noticed it was there.  Perhaps offering the option of a couple sides instead of a pound of french fries would be better.  I was disappointed that they don't offer barbecued chicken.  I know that might not be the traditional protein for BBQ, but it's what I wanted.  They had a limited amount of beer, but we both found something that met our needs.  Our server was nice, and was very attentive.  She was great.  The person behind the bar stood around looking very anxious, as if she were hoping that more patrons would come galloping through the door.  They didn't.  Because it was a cold, windy night on Monroe Street."}
{"text":"Visited Double S on a weekend. Small establishment. Pretty quick seating. The service was charming - true to its mom and pop billing. The food was good. The ribs were tender but I wish they had a bark. The beef brisket but a wet style. If you're looking for Texas beef brisket I think it mostly will matter what region of Texas you're looking for. Overall, good food. Would make another visit but I'm not sure it beats out the best of the local competition."}
{"text":"Absolutely delicious! Probably the best BBQ I've ever had at a restaurant. The brisket was awesome, hubby had some ribs. The sides are simple but spot on. We had pie for dessert-so indulgent! The only thing I wish they had on their menu was mac and cheese. I feel like some good BBQ and mac n cheese goes together like peanut butter and jelly, right? Also-I wish they would use real plates and cutlery instead of paper plates and plastic forks. Just seems really wasteful. Anyway-the food is awesome! I highly recommend giving this spot a try."}
{"text":"It's hard to go wrong with bbq, so when I heard of a new joint opening on Monroe street, I knew I'd be checking it out sooner than later. The space was small and the decor did not wow, but overall the joint is cozy. The menu was pretty limited with choice of ribs, brisket or sausage  being the big ticket options. I had the brisket, and found it to be a pleasant choice, but nothing remarkable. The sandwich came with a giant plate of fries, and I wish that it included some sides. You do get one side if you order just the meat. The barbecue sauce was very sweet, but the hot bbq sauce had some good flavor."}
{"text":"Double S needs a little more Madison vibe in its Texan groove.  I chose my birthday dinner to try this place for the first time. My husband and I with our kids (5, 2, and 3mo!) grabbed a very small table that was just a bit too tall for the cool eclectic chairs, and already way too crowded with sauce caddy and huge cast iron paper towel roll. None of us were really comfortable.   That's kind of the theme for the whole place. Everything looked good but in practice it just didn't quite work.  I know bbq is traditionally served in disposable tableware, but the amount of flimsy useless paper small plates, Styrofoam bowls and plastic forks were really off-putting for a restaurant on Monroe Street.   Service was great, but I was bummed to see the generic beer selection and lack of milk. Pizza Brutta next door has Organic Valley milk boxes, surely they could do the same!   As for the food, because you can put up with a lot if the food's great, but its... not. Not bad, and not over priced or outright inedible, just, meh. The cornbread is chewy, the corn is soggy, the ribs were blackened and a little stringy but juicy, the brisket was moist but a little tough. Two sauce selections, original and hot, both I'm assuming mass-manufactured offsite for SS since they contain HFCS and come in store-branded bottles. Original had good flavor and a nice black peppery bite that I enjoyed.   If I'm really hankering for bbq and don't want to drive across town I might get a meal to go sometime, but I probably won't come back with my family."}
{"text":"Very good! Lots of fries with meal! Very polite and close to Zoo! VERY clean bathrooms with plush toilet paper!"}
{"text":"This place absolutely hits the spot. The meats are delish and we love the different sauces. The jalapeño can not be missed. Excited to try the pie.."}
{"text":"This is the first time we have been here for lunch on a Sunday or anytime really. It's a cosy small place with a friendly server and good beer selection. I had the brisket sandwich and I substituted potato salad for the fries. Bother were very good. For once there wasn't onions in it which I hate. The brisket was smoky Texas style and I added some of the regular sauce which was not that flavorful for me so I added some of the hot sauce and that was much better. The worst thing here is the bun. It soaks up the liquid  from the meat so fast that it was saturated and gummy on the bottom before I had taken a couple of bites. They either have to get a different bun or toast this one it before putting the brisket on it. Other than that it was very good. It was a little pricey at $11 but it was a big quarter pound of meat so worth it. Give it a shot if in the area."}
{"text":"We went with open minds and big fans of barbecue. We were not expecting to be floored, but also found ourselves quite underwhelmed. The food was on paper plates which we didn't mind and service was pretty quick. The food just fell short. The jalapeño popper came with \"smoked\" bacon which really was burned. We like char but this was not that. We had to send it back. We got another one which was a little better but not by much.   We got a plate of ribs and thought they were over-salted. We like salty food and think this was too much for us. We were not impressed with the rubbery cornbread.    The BBQ sauce was okay, but not great. Three star ribs, not much more. What was delicious was the potato salad. That was a star of the plate.  We will not be going here again, however good the potato salad was."}
{"text":"The Briquet has great flavor and they serve Shiner... Cant get any better than that. The owners are also very nice people. They were very accommodating when I told them I was in a hurry to catch a flight."}
{"text":"We wandered in on a Monday night around 7:30pm, and it was completely empty inside, which meant we got seated immediately and wherever we want.   The decor of this place is overdone Texan, but I find that kind of effort charming. Each table had sauces (a spicy and a regular) along with a roll of paper towels. I like that it's the kind of place that expects you to get dirty with your food, as BBQ should be.   I ordered the brisket with a side of fries and the my friend ordered the ribs with a side of potato salad. My friend liked his ribs, but I was less than impressed. It was fall off the bones but no bite and cooked until the bones themselves chipped. Meh. Not my type of rib. Similarly, my brisket was just okay. The portion was generous, but instead of long slices of brisket, it was chopped up and there was no bark or smoke ring.   BUT, the staff was friendly and attentive which made our dining experience pleasant."}
{"text":"My friend Todd and I are BBQ aficionados and self proclaimed experts.  We have taken on the weighty task of reviewing all of the BBQ options in Wisconsin.  We also make a point to try BBQ in every city and state we travel to, and between the two of us we've probably covered all 48.  By far our favorite thing at Double S was the buttermilk pie.  Nothing different about it than standard southern buttermilk/custard pie, except that it might just be a hundred times more amazing.  It was a REALLY good rendition of something classic.  Our second favorite thing about Double S was the sauce.  It's a very sweet sauce, but with a lot of flavor.  It worked well on all of the meats and the fries.  We both tried the brisket and ribs, and I also tried the smoked sausage.  We would not go back for the ribs alone.  They werent bad, they just werent exceptional.  Too tender (probably as a result of smoking offside, storing, and reheating).  They had a decent amount of smoke flavor, but little flavor other than that, and if you're going to serve ribs without the sauce cararmelized on, they had better be able to stand alone on flavor.  The smoked sausage was solidly good.  The brisket was also if you like Texas style.  The sides were also very good.  The fries were seasoned perfectly.  The pinto beans I would call \"southwest BBQ style\" with various chunks of meat.  The prices were slightly more expensive than our regular BBQ stops, but nothing outrageous.   Bottom line, we were pleased, but did not feel they dethroned our two Madison favorites (#1 That BBQ Joint and #2 Smoky Jon's)  I hope the neighbors will eventually allow them to smoke meat on site."}
{"text":"The brisket journey though Madison continues!  We love BBQ.  I like my ribs and hubby likes his brisket.  This review focuses on the brisket because hubby has some very particular preferences.  I'm not as fussy nor a rib connoisseur so I'll pass that task to someone else.  Brisket can either be served wet or dry.  Double S serves a wet BBQ.  To pull off a dry BBQ, you really have to know how to smoke a brisket properly.  We feel that serving it wet gives you some \"wiggle room\" in the prep.  The brisket at Double S had more of a pot roast taste and texture.  Hubby was pleased it wasn't fatty as often is his experience with brisket.  And although tasty, it did not measure up to a perfectly smoked dry brisket.  The restaurant was nice, well decorated and bathroom up to date.  The main downside of Double S was the limited menu.  We were surprised the standard BBQ chicken and BBQ pulled pork wasn't part of the menu.  But perhaps this allows them to attempt to specialize in the brisket, ribs and sausage (the 3rd entree which we didn't order)."}
{"text":"We stopped in here for lunch based on the smell. It was a decent BBQ joint, but the menu was pretty limited. I had the brisket sandwich, my husband had a baked potato, and our friend had the ribs. For the price they give a fairly large portion, and the service was good (granted, we were one of two tables at the time). The decor was interesting and the restrooms were clean. Overall, we enjoyed ourselves. The only thing stopping me from giving 5 stars is the lack of pulled pork and wings on the menu. I'm not a huge fan of brisket in general, and theirs was good, but when I think BBQ I want pork to put it on."}
{"text":"We stopped in last Saturday for lunch and bellied up to the bar.  I give credit to the owners to try to \"Texan\" up the setting although I think they went a little overboard on the decor (ie. placing \"outhouse\" over the bathrooms).  Props to them for sourcing their sausage from Texas as well as offering Lonestar.  Foodwise, I found the 2 meat plate very underwhelming.  The chopped brisket barely offered up any of the notes of hickory or cherry that it was smoked over.  No discernible smoke ring, no bark and was not as tender as it should be.  Living in Texas, I understand that it takes a certain talent to turn out good brisket.  This wasn't the case here.  The sausage was good, however.  It had a nice skin that popped when biting into it and a mild yet rich flavor.  The cowboy beans were also unforgettable.  Perhaps the fact that Double S can't smoke onsite leads to the issues at hand. The real shame was the price of the 2 meat plate ($16.99).  For the quality and taste of the food, it comes as no surprise that we were the only ones in the restaurant at noon. Although critical of the food, I can't say enough about the server that assisted us.  She was extremely was extremely hospitable and friendly and checked in with us a few times. It's a shame as Double S is within walking distance of my home.  Perhaps, I will come back from the buttermilk pie that other reviewers rave about but I think I will pass on the bbq."}
{"text":"This adds another fine place to dine along the Monroe St. strip. Gumbo was hearty and warmed my insides up. The Texan Tater with brisket on top was another nice choice of comfort food. ..and who can deny Bacon wrapped poppers?"}
{"text":"Come check the Double S out. It's a husband and wife local joint. The Wife have of the Double S, Sarah grew up in the neighborhood. The husband half Shon, may be a Texan, but he's a progressive Texan... A retired Union negotiator.   The Que is delicious. I had a plate with brisket and a half sausage link. The Brisket was tender and juicy. But boy howdy the link was the stand out. It was subtle, yet begging to be devoured... not to mention the half link hangs off both sides of your plate.   If you are in the neighborhood - and there are a lot of reasons to be in the Monroe Street neighborhood, check out this decidedly local yet authentic Texan BBQ joint."}
{"text":"Had the smoked chicken from their truck while at an event at the Alliant Energy Center. Baked potato too. Awesome! Some of the best smoked anything we've ever had."}
{"text":"You guys, I can't say enough good things about this little gem on Monroe St. As soon as you step in the door, the warmth envelops you along with the twangiest classic country tunes you've never heard. The decor is whimsical and appropriate Texas cattle ranch meets Creole, as is the food. Lunch service at the relaxed yet convivial bar is almost instantaneous, delivered with real and friendly conversation with the owner more often than not. The gumbo is my go-to, decadently spicy-rich flavor with a ridiculous amount of melt in your mouth shredded pork and sausage slices. I've also ordered the potato salad and coleslaw, the gluten free catfish fish fry, and have been tempted by the owner into a slice of buttermilk pie. All outstanding. Go. Go now. Thank me later."}
{"text":"Service was fine, Jalepeno poppers were really good.  Portion sizes were good.   I hear the pie was pretty good but did not have any.  The brisket reminded me of chuck beef thrown in a crock pot with beer and chile peppers much like you would a texas style chili before adding a thickener.  Not bad, but not really what I'm looking for in brisket.  Price point is a little high for what you get - 14 bucks for brisket/1 side.  I'd be paying 8.50 at porktropolis (RIP) for a similar meal.  The kicker, though, is that they were out of ribs at 11:30 AM (and this is really the reason that I think people like this place from what I have heard from friends).  There was nobody there.   What."}
{"text":"Brisket was fine but wasn't as tender or moist as I was hoping. The dining space is definitely unique and memorable.  I was immediately wary because as I walked into the joint at 1:15 on a Tuesday afternoon I realized I was the only patron and there was no front-of-the-house staff. But as I waited I did observe several gold and silver medals on the wall as well as a Best of Madison 2015 Bronze Award so that offered hope.   The brisket sandwich was underwhelming and smothered in fries with a disappointingly small amount of sauce. The bun was a run-of-the-mill sesame and not warm, in fact slightly cool. The fries did have a nice garlic salt seasoning.   Unfortunately it was just meh overall..."}
{"text":"I'm sorry but this was awful.   All the food tasted like it came straight from a can or a super value tub from a discount grocery; the bread disintegrated into a soggy mess.  Everything was served on thin paper plates that soaked through with grease and stuck to the table.   The owners should check out New Orleans Takeout just down the road and see how similar-ish food can be done well.  We want you to succeed but this isn't getting there. Suggestions: get better quality plates; cook food fresh and vary what you offer if it means you can offer higher quality; make it seem as if  On the plus side, the decor was fun."}
{"text":"Stopped in at Double S BBQ on a whim, didn't even know it was there until we drove past. The decor is pretty cool and while it's a smallish space it's very warm and welcoming. The staff all seem to be very friendly and I was really hoping this was going to be a great new addition to the Madison BBQ scene. Unfortunately the food just didn't deliver for me and I think some big chances might be needed to get me back to Double S.   I started with iced tea, which was not very good. Very bitter and sort of chalky. An inauspicious start, but it's just iced tea, no biggie. I was a little surprised that is showed up in a disposable plastic cup, but I thought maybe that sort of fit with the BBQ theme. By the end I realized they serve everything on disposable serving ware. Again, not the worst thing in the world but it certainly doesn't add anything to the dining experience. The menu is quite limited, and a BBQ restaurant that builds itself around a Texan theme should not offer brisket only in a chopped form. Where are the luscious slices of smoked deliciousness I was hoping to have? Despite that I did try the chopped brisket and found it to be woefully dry and lacking flavor. My wife had the chicken and sausage gumbo and it was also lacking in flavor and would have benefited hugely from some spice. The fires were at least seasoned well, but I do think they started off frozen and were really nothing special.  I didn't try to sausage or the ribs, but honestly I don't know that I saw enough promise to go back for another go round. Hopefully this is just growing pains of a new restaurant, and I think they're smoking off site for the time being. Changing that could potentially make a huge difference."}
{"text":"I wandered into Double S BBQ with my husband on a chilly evening, excited to try some barbecue. It was cute with rustic decorations inside. There were several tables available, with a few people watching a football game on TV, so we were seated quickly. Our server was friendly and chatted with us throughout our meal.  We had a couple of Spotted Cows, and perused the menu. There are options for your traditional meat plates with sides like most BBQ spots, as well as some sandwiches and a few Cajun options. We chose different brisket plates, and the server described the two different sauces and chatted with us while we waited briefly. The food was out very quickly!   My star review mostly stems from the food, which wasn't the greatest. The brisket was bland, and I found myself dousing it in sauce. There was a sauce that was \"hot,\" but as spicy-food lovers, we didn't think it hit the right amount of heat. I didn't like my cornbread at all, and gave it to my hubby, who did say that he enjoyed it. I felt a little disappointed because I had basically eaten a plate of meat (that I thought was just ok) and no side.   The server encouraged us to try the buttermilk pie, and since I had some extra room in my belly, I agreed. We split a slice, and it was pretty good. They say it is award-winning!  I'm hoping we came in on an off night, but I wouldn't jump at a chance to return, despite the friendly service and great location."}
{"text":"I've been anxiously awaiting the opening of this place since seeing their sign this past Spring.  Today was the day to give it a try, and I was very pleased with experience.    We got takeout, but the short wait for the food gave me a good impression of the space.  Warm, low key, cute without being kitschy.  Decent beer and wine selection.  Solid space overall.    We got the ribs, brisket, potato salad, coleslaw and cornbread.  The portions were just right, very filling without being gut busting.  The ribs were awesome, juicy, flavorful, falling off the bone decadent and great with a little sauce.  The brisket was decent.  Well seasoned and flavorful, but a bit dry.  We dunked it in the rib drippings, which was a pretty great idea.  I love sides, and was not disappointed.  Fresh, balanced, classic picnic flavors.  The creaminess of the slaw and potato salad balanced well with the meat.  Yum.  Looking forward to many more ribs in my future!"}
{"text":"Checked out this BBQ place on Saturday for lunch. Very busy is always a great sign. My husband had the 2 meat plate: beef brisket and pork ribs. Shocked he could not finish all of the super tender meat! I chose the Texas Tater...a huge baked potato with tons of cheese, sour cream and brisket. We both loved the food! They could use more servers, especially on the weekends.... but service was friendly and speedy, too.  Had to buy a take home bottle of house BBQ sauce."}
