{"text":"Cool atmosphere, quick friendly service, sup par pad thai. Good meat, overcooked noodles, no heat."}
{"text":"I wished I had better things to say. I was so excited when Dragon I opened on State St, having a range of fusion food and serving bubble teas too! Unable to contain my excitement I organized a mini dinner session with 2 other friends.   The first signs that something was weird was that our waitress did not take down any of our orders; she merely 'remembered' them. We decided to start with the korean spicy rice cakes. But we waited forever and our appetizer did not come. One by one the main course was served, and by the time we were all done, there was still no sign of our appetizer!   I wish I could say that the appetizer was the only eventful thing that happened. But one of my friends ordered the korean spicy tofu soup (she's vegetarian). What they served her was korean spicy soup with beef. And so she spent half the time picking out the pieces of beef from the soup. Another of my friend had the Vietnamese stir-fry noodles, which took more than 25 min and we had to remind the waitress, otherwise we would go hungry. They did give us a complimentary fried rice, which we did not order. My guess is that the waitress probably 'thought' we ordered it, so the kitchen made it and decided to give it to us for free. By that point we were too fed up to even ask about our missing appetizer.   Ever since that experience I haven't gone back for another shot. After sufficient time has passed for the memory to fade I might go return to give them a second chance. But right now I can't bring myself to say positive stuff about this place."}
{"text":"There are so manny good asian restaurants in Madison - why would anyone chose this place? Even Nam's Noodle, the other restaurant by these owners, is ten times better.  We went on a weeknight. There were many tables available, and we were seated quickly. However, the two dishes my boyfriend and I ordered (Salt & Pepper Shrimp, and a Bahn Mi) were both unavailable. The waitress let us know, unapologetically \"Oh, yeah, i should have let you know the vietnamese sandwiches aren't available. They've never been available.\" Really? Then update your menu. The least you could do is cross out that page.  The food we did get was ok - not horrible, but I don't see why anyone would pick this place over the other asian places. I was excited to try a karaoke place right on state street; I will not be going based on our first experience."}
{"text":"I had the sliced beef pho and it was alright, except it was $7.95 for such a small bowl. It makes it seem as if the bowl is bigger, but really it's cylindrical from the bottom and has a wider top. Maybe I would have gotten a better price had I gone to a legit pho restaurant, I'm not sure because I'm not from Madison.   There was more broth than noodles and there may have been like three slices of beef in the size of elephant ears. Our first server who greeted my friends and I was generally nice, but her coworkers...not so much. Perhaps they were new, I wouldn't know. We had to ask for two waters at least three times from three different people. I honestly could have gotten up, grabbed the cups from the shelf, and poured my cup of water that was in the pitcher next to our table, in less than a minute rather than what? Almost five minutes, maybe longer?  Plus, the staff are pretty rude to their chef too. He rings the little bell to let them know that food is ready to give to customers and this one girl snaps back at him, \"CAN YOU HOLD ON FOR A MINUTE?\" Like really? We're right next to you. Take it down a notch and he's just doing his job. If the food is cold, it's on you. It's also confusing when they refer to the number of the food rather than the name. Here's an example of my friend's order: \"Who ordered an NS-09?\" The heck is that?! It was a type of vermicelli Vietnamese soup. Are we supposed to remember the numbers? C'mon now.  Not the greatest place and my complain is mostly about the staff. The pho again was okay. It just seems like another restaurant more tailored to American tastes and likings rather than ours. Just saying.  Again, hope this helps :)."}
{"text":"The food here is subpar. Some of the dished were were too sweet while some were just tasteless. The service was also not great as there were only 2 waiter covering 10 tables. Not recommended if you have a choice to go to somewhere else."}
{"text":"Great food. I love the Singapore noodles. Korean andVietnamese dishes are great. Thai dishes are OK. Chinese dishes taste like most American-Chinese dishes, if you like that style of food."}
{"text":"When they first opened they were pretty good, and I used to order from them all the time.  They then switched chefs and now they are terrible.  When I ordered over GrubHub, they did not read the instructions, and I ended up throwing up all night.  I ordered a green tea latte with soy milk, and specified in capital letters that I am lactose intolerant, and cannot drink milk.  When I called they said that they did indeed use milk and did not charge me for the green tea latte. But, I never ordered from them again.  Also, their Korean food has really gone downhill.  They are too lazy to use Korean sesame oil, and make all their non-Chinese food taste Chinese.  I think they should try a lot harder to pay attention to detail and try to make a dish taste at least remotely like it's supposed to."}
{"text":"came back to  this place last week again. the pai thai (hopeful spelling correct). i ask them to to put more egg and beef also veggie. its a lot for one person to finish. but the price was really nice. i like their ginger tea. it make you warm in this winter."}
{"text":"I have eaten there 5 times, this time the service was just not that good. Food is good, but the server made me feel invisible.  5 stars for the food, 2 star for the service"}
{"text":"Nope.  All the food here is so, so, so bland. I've never had a meal here that didn't make me wish I had spent my money somewhere else.  HOWEVER, they gain a star for very good bubble tea. I've heard the karaoke here is a lot of fun as well! But the food just isn't good."}
{"text":"Awful. Don't go. Horrible service. The chicken is sinewy or rubbery depending on the dish. Sometimes it's invisible. Worst Asian food I've ever had."}
{"text":"Just horrible service and food. If I am the manager of this restaurant,  Im gonna fire them all. Do not waste your money!!!!"}
{"text":"We came in for lunch here. The restaurant has two levels. We we're group of 9 adults and a kid. The place was pathetic. We were not given napkins or silverware. The green tea came in plastic cups because they said their dishwasher did not come today. The pho was poor and trying to eat with aplastic spoon was a challenge. Would not recommend this place for service or food!"}
{"text":"Nope. Nope nope nope nope nope. And not because I'm asian and I know good asian food. Just nope. I am capable of eating Americanized Chinese food and realizing it still tastes good, but this was just not delicious for anyone's palette. I got the appetizer spring rolls and the zhia jang mien or however the spelled it. It shouldn't matter how I spell it cause you just should not eat anything that seems like it could sound like that. So I know how these noodles are supposed to take. What I was served was nothing of the sort. I can't really explain what it tasted like, but it was not good. Furthermore, I asked for it extra spicy, and I think their extra spicy is milder that the chipotle medium. Which for an asian restaurant, is unacceptable. To make my dish edible I basically emptied an entire bottle of sriracha onto the plate. The appetizer was no better, When I bit into it, I couldn't identify any flavours or ingredients. I could see the carrot in the spring roll but nothing else was really identifiable visually either. The sauce was also watered down and not as tangy as it should have been. Oh how disappointed I was.  I was excited, there were so many good old asian favourites on the menu. (they even had congee! albeit without english subtitles, how are people expected to know what theyre ordering?) Now, the excitement has left, and I am just left with a huge hole of disappointment in my stomach where homey asian food was supposed to go."}
{"text":"weil i was actually hoping to get some real cantonese food here, but it disappointed me. however, in general, the foods here are good, just don't expect them to be authentic chinese foods. and i like the decoration here too. it didn't really feel like i was eating in a chinese restaurant. and the staffs were really nice. btw, if you are looking for a cup of real cantonese milk tea, you would probably not want to have it here. because it tasted like the one i make at home with mile tea powders.."}
{"text":"NOT FOR VEGETARIANS, I can say that for sure. We went in and were greeted by polite but somewhat immature waitstaff saying that we were the coolest couple that had came in there loud enough so everyone could here. Then we asked our waitress which Vegetarian entree she would recommend since they did actually have a vegetarian section. She mentioned she was a vegetarian when she started but then really struggled to actually recommend anything. This should have been a sign but I Though maybe she just had communication problems and gave it the benefit of the doubt. We ordered two dishes one was a cilantro Chilli entre and one was a mixed veggie and both were flavorless and terrible mostly consisting of Bok Choi which was under cooked and unchewable. One of the entres went back immediately because it was cold. Pretty disapointing considering we dont get out much and this was supposed to be a treat for us.  The ambiance was terrible! Apparently they have Karaoke rooms upstairs that you can rent for $32 an hour (WHAT?!) in traditional Korean style. The sounds of flat off key singers coming accross terrible sound systems boomed through the building. Not only that but there was a table where all the restaurants office supplies were sitting out, like tape scissors, stapler and such. This was the right in the center front of the restaurant where your eye normally is focused on. I dont want to see your messy desk area, its unprofessional! The table we were sitting at had a split in it which came apart as we were leaving dumping my water all over me.  I cant say that the meat entres arent good because I didnt try them but the ambiance issues and annoying staff are reason enough not to waste your money expecially considering there are so many great restaurants in Madison."}
{"text":"So, Dragon I looks nice, with dark wood floors and (oddly mismatched) furniture. It's doing the fusion thing, so essentially Korean/Thai/Vietnamese. I am seated by a hostess/server who does not appear to understand much of what I say to her and given a room-temperature, plastic water cup.  I open the menu and decide I want to have some oolong tea, some kimchee, and the pad Thai with shrimp--\"extra, extra spicy,\" I say while she nods along in empathy.  The kimchee appears a few moments later. It's fine. I then note, with some trepidation, that the server is bringing a giant, steaming styrofoam cup from behind the bar. I pray silently that this is not my tea, but of course it is: around a quart of boiling water with a teabag, about which she helpfully instructs me, \"Take this out in about two minutes.\" I let the urge pass to explain that at most restaurants, the staff makes the food and drinks for you. The combination of far too much liquid and the insulated cup means that the tea doesn't cool down enough to drink until I'm ready to go.  The pad Thai arrives. It is big, but nothing else good can be said about it. It is oddly sweet, smothered in three times the appropriate quantity of crushed peanuts, barely features any shrimp, and appears to be the inverse of the spice level that I asked.   As I grow tired of my molten tea and boring food, I await my check. But my server and another staffer are instead sitting at the bar having dinner two feet away from me, so I have to wait. The price for everything ($20) would actually have been reasonable if the food had been any good, which it really was not.  And so, dear Yelpers, I have learned that I need to check with y'all before eating anything else on State Street in this town, as looking up the rating may have saved me. Tourist districts are always like this, building business cultures where hardly anybody tries hard, because they've got your money and don't care if you come back. There will be more tourists tomorrow and more students next year."}
{"text":"I'd seen the menu at Dragon I and was very excited to try it. Pho is one of my favorite foods and I had a friend who highly recommended this place.   We arrived on a Monday evening. There were a few patrons, but the place was mostly empty. We were seated promptly. The ambiance is nothing fancy, but everything was clean and casual. I did notice there was still Halloween garland on the pillars.  Our waitress was friendly and offered recommendations when asked. I ordered the pho with meatballs, dumplings, and a milk tea. My dining companion ordered a beer and squid.  When the pho arrived, it came with a small dish of bean sprouts, jalapenos, a lime, and a couple of basil leaves. Usually pho comes with a larger assortment of condiments, but it is not necessary because pho is all about the broth. The broth was tasty, not delicious, not full of the depth of flavors which I associate with pho. It was good, but not great. The slices of beef and the meatballs were all very good, but without those layers of flavor in the broth, it was just disappointing. The dumplings were also tasty, but they reminded me of the dumplings I get from Costco. Nothing special and at well over $1 per dumpling seemed a bit much. I did enjoy the milk tea; creamy, had substance and good flavor. The salt and pepper squid were also fine. Again nothing special, but certainly adequate if a little overcooked.  That all being said, I will go back. There were numerous other dishes on the menu which I would like to try. I'll just set my expectations lower."}
{"text":"The responsibility of the critic is not merely to take things for face value. Our task is to find the truth and unravel the underlying potential value that the establishment potentially could have. With this review, I hope to do much so.   Dragon I holds itself in a prime location of being at the heart of State Street where the hustle and bustle takes its hold. When one walks into the restaurant, the lights above strikes a fine balance of illuminating the room with a shroud of mystery. The dark wood complements the table very nicely with the finishing touch of a dark cloth adding to the eeriness and mystery of the restaurant. While upstairs, there's a larger seating accommodating for larger groups of patrons where most other establishments lack.  Beyond the decor and the ambiance, one must inebriate and submit themselves to intoxication of the night before, and with that intoxication, it must carry over to the day of indulging oneself at Dragon I to maximize the experience. This ritual is an absolute must.   Once browsing the menu, one finds themselves postulating and contemplating while reminiscing the previous dish that they might have regretted or enjoyed previously at Dragon I. I highly stress the importance of still being intoxicated due to the night before to enjoy the high of a rush that the restaurant offers - the grand experience of Russian Roulette when you glance over the wide array of choices in the menu. The thrill of the unknown. The high risk and high reward. You never know what potentially sub-mediocre dish could envelop taste buds and coax them into submission of either distaste or purely the satisfaction of \"it's ok.\" This is where Dragon I thrives and the real value that it offers."}
{"text":"I had the vegetable lo mein, with an addition of tofu. It was the best lo mein i have ever had, hands down."}
{"text":"We had to come here because everything else was packed and we had limited time. Not a good choice. Everything was very processed and/or tasted like it had been frozen. We even got dishes that were recommended. Skip this place at all costs!"}
{"text":"Food is okay.. if this was based on food alone I'd probably give this place 3 stars... but wtf. The delivery Dude tried to extort a cash tip after tipping 20% thru the app. #shame"}
{"text":"Dragon-I is pretty much all-around bad. Went in for dinner last night with a group of 6 people. Right away you notice that the setup is awful and cramped with no clear walking lanes. The service wasn't much better. Our waitress didn't know the menu, consistently forgot things, and would leave us completely unattended for 30 minute stretches. The food was just ok. The egg rolls were decent but the pho was completely devoid of flavor. Nobody at my table especially enjoyed their food and the word \"bland\" was thrown around quite a bit, which is shocking when you consider we were eating sweet and sour chicken and pad thai.  I would avoid this place until they get their act together."}
{"text":"I like the environment. It was nice and clean, which is always appreciated!! The food is okay. For appetizers, I got the chicken wings and honestly, it was plain/bland. It didn't taste like anything, I don't even think there was a pinch of salt. Lol. I also got the chicken pad thai. It wasn't good but it wasn't bad either. It didn't taste like pad thai tho."}
{"text":"I'm a bit of a fan more than I was. First impressions of the place from 2013 were a bit lower but upon having it delivered tonight, I'd bump it from 2 stars to 4 stars. For vegetarian fare, I really can say the General Tso's Bean Curd(Tofu) was excellent. It also is one of the few places that have good vegetarian spring rolls. Bubble tea is always a plus too and I liked the different kinds I've had here. Only thing I find disappointing is it seems the orders are not completed properly. Like tonight we received rice instead of Vermicelli...nothing critical but to the wrong person on the wrong night, it'd probably knock it down to 2 stars. One thing also about the menu is the \"fresh soy milk\" for $1.50. I ordered it intrigued liking american style soymilk and also chinese imports like canned Yeo's or the black soy milk...to my surprise, it was just a can of Yeo's. \"Fresh\"...seems strange to describe this. It's a can from China...fresh kinda implies it restaurant made(soymilk/tofu isn't difficult to make believe it or not from raw soybeans)...Was disappointed but didn't ruin my meal or something."}
{"text":"We came here to eat because we had to drop off a friend back to school. The place looked nice inside. The decor was nice n appealing. The seating was a bit weird and confusing. We ordered Viet pho to eat. They all came out at different times. One took way long then the other. So while waiting our food got cold while 20 mins later out last meal came out. We were disappointed with our orders and asked what was going on. We talked to a couple waiters and the problem was not solved. Finally we got the manager. She was very nice. The waiter over heard our complaint again n with our own chopsticks he poked around our soup. At this point I was done and did t want anything to do with this place ever again. I ate two bites before our complaint n the food was just OK. Never again will I go here or recommend this place to anyone. Horrible service and horrible workers."}
{"text":"My experience at Dragon I was a bit confused.    The dining room and menus are beautiful and that, combined with the pricing (most dishes around $8-10 and up - pretty standard for decent Asian food in Madison, I think) left me expecting food that was better quality than takeout, but not exactly fine dining.    I ordered the Korean Beef Kimchi Fried Rice and I was served within 5 minutes of placing my order, which means it had been made before and just reheated.  Portions are also huge.  It was pretty greasy and, although I wasn't expecting authentic Korean food, there was nothing kimchi about it.  Furthermore, when I hear \"Korean beef\" I expect some pretty good quality beef, but the beef was a really poor, flavorless cut and I ended up just picking it out and eating the rice (and occasional radish).  Not exactly worth the $11 I paid for it.  As for the service... I don't think the servers are necessarily rude, they just haven't been trained at all and have obviously never worked in a restaurant.  My server wasn't rude, but the whole experience was really awkward.  All in all I would say that Dragon I is a beautiful dining room with high prices for takeout quality food and I probably wouldn't go back.  There's much better Asian food to be had in Madison in this price range - and there's cheaper takeout, too."}
{"text":"I am a regular to this restaurant. I'm going here at least once or twice a week. They have huge selections just like other Chinese restaurant. Foods are generally good and kind of fusion, i guess. I have been in Korea, Japan, Vietnam, and China before coming to Madison, so I'm a big fan of Asian foods.  Based on my experience, some dishes are really good. my suggestions are...  - Korean bbq short-ribs, also known for Korean LA Galbi, if you like korean bbq especially. - Curry Katsu Don, which is pork wrapped with fried flour like tempura and japanese curry sauce as side. - Korean kimchi fried rice (??).. The name might be wrong since I don't remeber exactly.. It was fried rice with Korean Kimchi and red pepper sauce. It was actually kind of sweet rather than spicy. So, i guess it was fusion.  However, i didn't like some dishes.. - Korean spicy noodle soup.. It was not even close to Korean dish (i have some expectation when it comes to Korean dish since i tried a lot before) The taste was really weired. It was more like chinese spicy soup mexed with red pepper sauce... which is very unappetizing. My friend didn't even touch it after tasting. - Pho. it was ok, but nothing special there. I suggest you to order something else since u can get pho in other places."}
{"text":"Good variety of Asian inspired dishes with friendly servers. Decent seating on the sidewalk for small groups. Everything on the menu is numbered , so makes ordering easy... Just say which letter you want and it magically shows up. :)"}
{"text":"I ate lunch here yesterday--or stated to--and realized pretty quickly that the pork chunks in my dish were raw in the middle. I alerted my waiter, who argued with me that the pork could not possibly be raw due to the fact that it was deep fried. Did not finish, not going back. Trichinosis? I'll letcha know."}
{"text":"The pho hit me at the right spot after an insane hangover. Also they definitely challenged me with the size of that bubble tea. One problem though, what is up with that tapioca? Either they are not boiling it right or just getting the wrong brand. But with everything else, I am quite satisfied."}
{"text":"Two words--surprisingly good. I had my suspicions as I walked in--the place looked too nice and the menu had very misspelled English. I sat down, looked around and saw the international students: aka people who actually know what is good food and what is bad. So, I ordered a dish and wasn't disappointed.  I got the kimchi beef dish which was surprisingly good. They put the food in a small metal mixing bowl so yes--the portions were generous. I had no qualms about the food. Also to the reviewer who was upset about the lack of vegetarian dishes--it's an asian restaurant. What did you expect?  Yes, the staff is pretty inexperienced. They are not very good at placing your order or filling your water not because they are rude, they just don't know what they are doing. Flag over the waitstaff and ask for what you need. They are pretty nice about it.  I'm totally willing to forgive some UW students who don't know what they are doing because of the delicious food the cooks are making."}
{"text":"I've been to dragon i twice. As other people had mentioned, the service needs to change. The staffs were friendly but they seemed like they don't really know the menu.  Also, my friend won a gift certificate to Dragon I during a cultural festival. However, the owner set the expiration date a week after we received the certificate. It seems like he wasn't too willing to give out that certificate and hoped that we won't remember to use it before it expires.  When we were there, we ordered beef pho, chicken curry, and kimchi fried rice. Overall the food quality was good but I think their food is a bit overpriced. It is worth to mention that they have karaoke there. It is not a bad place to go with your friends to hang out on a weekend night."}
{"text":"I don't know why we continue to eat here. I always think to myself, \"Hey, maybe it will be better this time.\" It never is.  After a night of drinking, this place somehow ends up being on our list of restaurants for hangover pho mostly for it's convenient location on State Street. Every soup I've had here has tasted extremely watered down and I feel like I would be better off just eating instant pho. I've tried a couple of other things that aren't pho including the salt and pepper squid which always seem to be just way too salty. The only thing I've had here that was palatable was the kimchi fried rice, but even that isn't anything special.  The cleanliness of this place is kind of questionable, I've been served food on dishes that weren't the cleanest. Service here is also usually pretty slow despite the fact that this place always seems to be pretty dead.   If you want pho, don't have a car, and don't mind walking a bit, I would definitely try Nam's Noodle instead. If you do have a car, Saigon Noodle isn't that far either.  Something tells me I'll probably still be back again, but my gut tells me it won't be any better."}
{"text":"The Good: Dragon I is a great place to eat with friends. Pho is one of my favorite foods and my friends were delighted to discover pho in Madison. Even when we are not craving pho, we are always happy with the other options such as lettuce wraps, pad thai, and cashew chicken.   The Not So Good: Dragon I's service is disappointing. Whether it be slow or incompetent, I am continuously shocked by the quality of service.   The Highlight: Pho No. 1. Even after eating it each week for six months, it is still my go-to."}
{"text":"Lacks in flavor and the meat felt like rubber. I got the pad Thai with beef. I couldn't even continue eating it. Was by far the worst pad Thai I've ever had."}
{"text":"Pretty good food, lots of different asian dishes. They don't always have everything on the menu but there is always something good to order. The pho and the calamari are my personal favorites, the spring rolls are pretty good too."}
{"text":"Dragon I has a wide-ranging menu; lots of favorites from Chinese, Thai, and Vietnamese menus, as well as bubble teas and other sweet beverages.  Food prices are average for State street.  The place was packed on a Saturday night, and staff had trouble keeping up.  Overall it seemed like they were not able to deal with dinnertime rush, which resulted in confusion about who was serving which table and a server having to go around to different tables asking what diners had ordered the dish in her hands.  Plus, servers seemed confused about what to do when there were people waiting for tables.  I saw a group of 3 waiting for a table and they were browsing through menus while waiting. Then the server told them that they wouldn't be able to accomodate their party and they left, clearly disappointed.  As for the food, the food seemed a little off as well.  For example, my Vietnamese rice noodle salad really should have come with more veggies to liven it up a bit rather than just lettuce, cilantro, and a bit of carrot.  The pieces of beef would have benefited from being cut into smaller pieces, since you don't have a knife at the table and you are kind of strugglign with tearing off pieces of beef with your teeth.  Overall, it was all right, but Dragon I can't seem to keep up with their customers."}
{"text":"This is a great place even you just go by yourself. I love the jade mountain bubble tea and pineapple chicken &shrimp rice."}
{"text":"The waitress had very bad attitude, and I got absolutely no service after placing the order! The food was below average. Don't waste your money and time here!"}
{"text":"My co-workers and I ordered for delivery which they took forever, but they forgot my coworker's appetizer. My seafood fried rice had chunks of squid and like 4 shrimps plus a fried egg on top of the rice! The rice tastes burnt not worth the 10 dollars I paid for. Spring rolls wear ok iv had better."}
{"text":"I came here on a rainy Saturday.   On a day like that the only thing that seemed right to order was the pho.  I haven't had pho since moving here and to be honest I was a bit apprehensive about it because pho has to made just right to be good.  Well this place had it right.  The pho as phenomenal!!  It was perfectly seasoned and the noodles were great.  The meat was tender and delicious.  The man ordered the pad Thai which he loved.  He did remark however that though he ordered the highest spice level he could barely tell there was any spice in it at all.  With that said however we both enjoyed this place.  We enjoyed it so much that I would even venture back despite the fact that I generally don't court restaurants on State Street.   I also ordered the strawberry and kiwi boba which I didn't particularly care for.  I am used to boba being served almost like a shaved ice treat but this was more like a smoothie with boba in it, a big no-no!!   All in all I loved this place and I will definitely be back!"}
{"text":"I really should have updated this review a long time ago.  When Dragon I first opened the food was consistently good but the service was indescribably awful.  Actually, it was pretty hilarious.   I once waited for 45 minutes because, unbeknownst to me, they were waiting for a frozen block of seaweed salad to (partially) thaw.    In any case, that's all in the past.  The original clowns who were worked here are all gone and now it's really quite well-run.  And the food is generally--though not always-- pretty decent.  Definitely a good choice for a big bowl of pho."}
{"text":"Stopped here on a whim on they way to Noodles to try something new. It was better and more expensive than I expected. Not huge portions, especially for the price. The staff seemed eager to please."}
{"text":"Not sure how I feel about it contrary to the comments I made with the pictures I took. I ordered the Vietnamese spring roll. I really like them! They were fresh and I believe made to order. The dipping sauce had the right amount of spice and flavor.  Now, on to my actually meal. I ordered fried fried with sesame chicken. For starters, my boyfriends soup came out a good 3 minutes before my food did but that was fine. No biggie. His soup was pretty good. My food on the other hand wasn't. My chicken was overcooked and very hard. I couldn't even finish half of the chicken. My rice was the same. Tasted old and was barely warm. Basically it was just white rice with soy sauce. No vegetables or flavor at all.   Not only that, but no server came and asked us for drinks. Just gave us water which again wasn't a problem, however, if I a paying $30 for a meal for 2, I expect better food and service. I was sympathetic because it was only 2 servers and 1 person working the bar and it did get pretty busy but there wasn't much that I felt made me dining there a great experience."}
{"text":"On a whim, my coworker suggested we pick this up for lunch. I had already had a mediocre experience with this place and was a little hesitant, but my coworker was persistent.   For $10.50 I was extremely hoping for something with a little more substance to it. That was before I tried it. After the first bite I was hoping for anything else at all. The two separate times I've purchased from Dragon I it was for chicken. Perhaps their beef plates provide less to be desired, however I should think not."}
{"text":"I enjoyed the food because it was delicious and well presented for what it was worth. I would definitely go back, just not in a group of 9 or more. I could see why the waiter had trouble remembering who had ordered what items, but it was also likely that he didn't bother to try remembering. This confusion made leaving the restaurant take a lot longer than it should have. Next time when I stop in Madison, WI again, I'll give it another try and it might receive another star."}
{"text":"Probably the worst dining experience I ever had. The rice cakes that I order were too hard to chew, sent it back to the kitchen because that's not how it should be. however it came back out with nothing changed and it looks like it was just sat in the back, while the lemongrass chicken wings were way undercooked, the only thing that was okay was the potstickers. Will never come back again."}
{"text":"I'm here currently and the two waitresses are on their phones. They were greedy with their condiments for the pho. Four of us got pho and they only brought enough for two. I asked for more and she rolled her eyes. To add to that, our waitress gave us a pitcher of water and told us to top off our own glasses. And finally.... We found a fly in one of the phos and she said it was from the basil we added to the pho. There should be no flies in the food to begin with. ACTUALLY, after I posted this we found a SECOND FLY, a bigger juicier one. I'm done with this place."}
{"text":"I really wanted to like this place- I was counting on Dragon-I to bring good pho and Asian food to State Street, where there is a very hungry market for this kind of food.  Getting right to it:  Food Quality: D       I have eaten at nearly every Asian restaurant in Madison, and being asian myself, I cook Asian food often.  I enjoy all kinds of Asian food from splurges at Lao Laan Xang to very humble bowls of pho.  Disappointingly, Dragon-I's food was appalling.  I ordered a bowl of pho and the lemongrass chicken-  Both were awful.        The pho was scummy (it had remnants of leftover fat and other gross substances) because they hadn't skimmed the broth and cleaned the soup bones properly.  This left a gross film of fat all over the bowl and my mouth.  There is no question about it, this is the worst pho I've had ever, anywhere.  Also, the pho was served with a bizarre ladle to sip the broth instead of the conventional spoon.  Clearly Dragon-I is more focused on gimmicks than food quality.      On to the lemongrass chicken:  I ordered this with the pho but the restaurant served it to me way after I was finished with the pho.  They brought out my check before the entree actually got to my table, because I had been done with my pho for a while and they thought I was done eating.  The lemongrass chicken itself was disgusting.  It contained no lemongrass whatsoever and most closely resembled a chicken dish you would get in a Chinese restaurant in a mall (it tasted EXACTLY like your standard-mall 'bourbon chicken').  It did not resemble a freshly cooked entre at all.        Finally, I ordered a mango bubble tea.  I watched my server make it from instant powder, it cost me $3 or $4 (I don't remember the exact price).  Anyways, if you are going to charge someone this price for a drink, at least make it from scratch.  You can go next door to the Tea Steepery and order the same thing for the same price and it is much, much better.   Dragon-I is not aware of how much they are lacking competitively to other restaurants in the area.  It is really sad that Dragon-I\"s food quality cannot match that of their interior.   Oh yeah, one more thing:   MY PARTY (of 2) WAS THE ONLY PARTY IN THE RESTAURANT AND THEY STILL MESSED UP MY ORDER AND THE FOOD STILL STUNK.    The food was not even mediocre- it was bad.  It is disappointing that one cannot get a decent bowl of pho in the campus area anymore since Asian-One is gone (RIP Asian-One!!).  Oh well, I guess I will still have to drive to willy street or to Saigon's to find pho-hapiness."}
{"text":"I ate here with my sister during the huge snow storm and I do so appreciate that they were open because we were hungry! I used to eat here when it was Chins and I was surprised at how different the space looked! Our server was very nice and really helpful.  We ordered eggrolls and dumplings, both of which were really tasty. I ordered a rice bowl with beef and my sister got a curry dish.  First of all the entrees came out about 5 minutes after the appetizers which made it hard to shuffle around the food and left both of our entrees lukewarm by the time we got to them.  I thought my dish was good but just good.  Heavy on the heavy sauce which left that as the only flavor left.  My sisters veggie curry was so hot she couldn't eat it.  She's not incredibly adventurous when it comes to heat but enough to be able to enjoy a standard curry.  The waiter happily brought her something else (a veggie stir fry) which she liked better and appreciated very much.  Overall, the place was fine.. it filled the need for the day but there are about 20 better Asian influence places to eat that are in that area"}
{"text":"A so-so place for Asian food. You can get Chinese, Vietnamese, Korean food here. Don't know if they are actually authentic, but try do taste good. Personal favorites: kimchi beef fried rice and all the congee."}
{"text":"Went here with some friends to rent a karaoke room. The waitress showed us to our room and set it up but did not give us any menus for food until we asked. When we ordered we had to go downstairs and stand awkwardly by the bar for them to finish our drinks and then pay them directly. This wasn't a big issue but it felt unprofessional honestly. The waitresses were friendly enough but not very accommodating I honestly felt like we were unwanted there and the staff seem a bit careless. I didn't have food but the smoothie I got was alright though they ran out of tapioca bubbles."}
{"text":"Vermicelli salad tofu with tofu egg roll was ehh... Not tasty at all, very disappointed.  Service was almost non existence.  Good thing I'm just visiting..."}
{"text":"Awful. Bathroom smelled terrible, no soap or towels, and when I alerted our server to this he told me to use the one upstairs. Never mind that I just watched one of the cooks leave the same bathroom where he couldn't possibly have washed his hands. The service was lazy and the tofu and vegetables that we ordered were soaked in oil and flavorless. The rice tasted like it was cooked in weird butter. There are so many better Asian places on state street, this place was worse than the Chin's it replaced."}
{"text":"Admittedly, I have never tried Dragon I's food.  This is a review for those of you hipsters out there who can't get enough irony....and kind of like to sing.  I was looking to try something new for my birthday bash last weekend.  What I stumbled upon was a private karaoke lounge, tucked away in the upper lair of what I had previously assumed to be exclusively a bubble tea restaurant.  Or an exclusive bubble tea restaurant, however you want to look at it.  Recognizing that this was a chance to broaden my horizons as I entered into another year, I immediately walked in to put my name down for a room, which was then written on a scrap of paper smaller than a post-it note. Needless to say, I had my reservations about my reservation, but I also knew I was on to something great.  The song selection keyboard was in another language; the songs available were from the 80s, 90s, and early 2000s, which means essentially anything post-Backstreet Boys was non-existent.  The music videos to accompany these throwbacks were of bears climbing up majestic mountains or wolves howling at a full moon.  The only downside was that the drinks were a little weak, but that didn't stop my friends and I from having a fantastic time.     Overall, belting out karaoke classics at the top of my lungs in a private room made for an awesome birthday celebration.  I consider this birthday party at the Dragon I karaoke lounge to be the most entertaining, and therefore, my favorite to date."}
{"text":"the food was ok. This one star is for the service it's absolutely Bad. I went there twice to pick up my order the waitress had that attitude and have to almost yell the price at me twice????? Didn't give me the change herself??? excuse me ??? I didn't say I want to leave tips ok?????"}
{"text":"Ordered Korean Beef Fried Rice with out the Spicy Korean sauce.   This is not Fried Rice.   It's beef with white rice.  Called the restaurant and all they did was argue with me.  Very disappointing."}
{"text":"The have a good karaoke place! As for the food, I tried their beef plate and it was good. I don't really like their pho.  My dining companion is crazy about their bubble tea."}
{"text":"I was skeptical to eat here since most of the reviews have at least one negative comment in them, but very glad I decided to!  Our service was great, two different gentlemen waited on us and both were polite and attentive.  I had the egg rolls appetizer and Basil Chicken and my companion had the fried dumplings and Red Curry with Squid.  All of our food was hot and tasty.  I loved the basil chicken, it had lots and lots of flavor and a little spice.  Serving size was generous and I brought enough home for lunch today. The egg rolls were crispy and piping hot when they arrived.  I tasted my dining partners curry and it had great heat and the flavor was yummy.  The place is clean and I really don't have a bad thing to say except there are so many items on the menu it is hard to choose just one item!  I will definitely go back to try a few more things.  If you were disappointed with your first visit, maybe give them another try?"}
{"text":"Worst asian food ever! My family and I went here for lunch - huge disappointment. We all love asain food so we were excited to try a new place while visiting UW. All six of the dishes we ordered were aweful. We started with crab rangoon (a safe choice and hard to screw up). It was greasey and tasted as if fried in old, dirty oil. They may have used motor oil for all I know. Here's the funny thing: it was the best item we ate for lunch, but it was aweful too. We all had a chicken dish, except my son who had pork dumplings which had more ginger and a mystery ingredient than pork - yuck! Four of the five chicken dishes had very little chicken. I would estimate 1/2 to 1 ounce of chicken (3 bites). My daughter's boyfriend ordered orange chicken because the restaurant was \"out\" of sweet and sour chicken. How is that even possible? He said his orange chcken didn't taste like chicken at all. Hum? My \"chicken\" was flavorless as if it was boiled and sitting in a vat of water until it was time to add to the dish.   This place ranks as the number 1 worst restaurant I have ever eaten at, especially because all six dishes were so bad. It was also the worst $80 I have ever spent. The service was so poor too. When we asked the waitress if the the food was good, she replied, \"uhm, you decide\" in her asian acent. She did't provide appitizer plates, forgot the condiments for a few dishes, however she did keep the water glasses topped off. After the meal, the manager asked us if our meal was good (everyone's plates were still nearly full) and we replied, \"the food wasn't very good.\"  We expected him to say, \" ya, we hear that a lot\", but he just nodded and walked away. Maybe the restaurant is named Dragon 1 because it is the number 1worst place to eat in Madison. I can only pray that there is not a Dragon 2, 3, or more. There are many other asian restaurants in Madison and I would strongly suggest any of them."}
{"text":"Although the service wasn't all that, but I think that's just part of our culture. We can either be REALLY FRIENDLY AND POLITE, or just unintentionally rude. They gave me a great suggestion which is their best selling fried rice the Korean Beef fried rice. On point!!"}
{"text":"I'm surprised by the 2.5 stars that this place has received. The food is good. We ordered basil rice platter, singaporean noodles and chicken fried rice and they were all good!   We were a party of 6 and the server didn't take note of the order. Instead he remembered everything with the specifics! We were worried that the food may get messed up but it all came out great!"}
{"text":"The set-up of the restaurant is not so great.  The front door doesn't have a second door so anyone sitting near the door was freezing.  I had asked the waitress to move me to a table further away from the door since it was so cold and the place was relatively empty.  She sat me down and said, \"Oh, sorry for the weather.\"  Um...k?    I had the pho last night.  It's actually pretty decent tasting, almost on par with the popular Saigon Noodles on the westside. However, the pho came in this ridiculous bowl that would make it difficult for anyone who really loves to eat the noodles with the broth, to eat both together.  My dining companion's dish also came in a ridiculous bowl that didn't really work for her vermicelli noodles.  The waitress wasn't that great; she forgot to bring me an actual spoon to use and left me with a ladle.  She also forgot to bring out the condiments (bean sprouts, basil, lime, jalepenos).  When I asked for it, she gave me a weird look and said, \"Oh yea... I'll go get that for you.\"    All in all, the pho was decent and I'd probably come back for it.  The service wasn't great and the food is overpriced, but I guess it has to be that way since it pays high rent on State Street.  I'd still be more likely to go to Saigon Noodles for pho and spring rolls over this place though."}
