{"text":"Very tasty food here. Delicious and nutritious. Staff are polite, courteous, and attentive. Great selection of good meals and snacks."}
{"text":"The sandwich was good, however it better be for $10 and that doesn't include a drink.  I asked directions to a washroom and they said they didn't have one.
The man at the counter said I had to use the one across the road at ST.Mike's Hospital......WTF."}
{"text":"Now, I may be completely biased because my father has been with the company all my life..

But if you want a good hot meat sandwich, this is the place to go.

If you're not feeling very meaty, there are tons of salads and the best cream cheese by far, none of that philadelphia ridiculousness. I recommend checking out the Druxy's at Bay and King (inside the CIBC building), a new salad bar has opened where you can chose your ingredients, there has to be at least 30 or more toppings to chose from. choose your own dressing, your type of lettuce (spinach is the best) and enjoy!

Go deli!"}
{"text":"I don't usually write reviews but  what I ate today is certainly not BBQ pulled beef.  It was diced hotdog with green peppers and onion.  The bread was stale and it was one of the worst things I've ever eaten."}
{"text":"This places consistently tries to rip you off. Every time I go in there they try to charge a different price for the same thing. I think the guy who takes the money might just be pocketing the extra $1-$3 he adds onto the price."}
{"text":"Meh. Good sandwich but a bit pricey for a sandwich. I mean... it's just a sandwich."}
{"text":"Twice in a row now that they cannot get a simple breakfast right.  And I'm ordering off their \"breakfast specials\" that are posted.  First time was a breakfast burrito.  It was just a clump of egg in the middle of a tortilla and had some much water leaking out that it was a complete mess to eat.  Today I ordered a grilled cheese with bacon and tomato.  I get back to my office and open up my bag - it's grilled cheese with EGG and tomato.  Who puts egg in a grilled cheese? I repeated my order to the person at the counter twice.  Then she repeated \"bacon and tomato\" back to me.  And I already paid on the other side where the cashier/manager has no idea if my breakfast is being made correctly.  I could go back and get it remade, but it took quite a long time to make the first time around and who has time to order everything twice? 

And at $6.25, this grilled cheese was no bargain.

There are other options downtown in the core.  I'm unsatisfied with what they churn out.  I won't be back."}
{"text":"Good spot for a quick sandwich in the Eaton's Centre. I go for the egg salad on pumpernickel (vegetarians can choose from egg, hummus/veg or grilled cheese). It's one of my favourite spots for egg salad - not too creamy and you can top it with whatever you like. Warning (@Nicole M) they always try and add more mayo to the bread, so if you're like me and don't care for mayo on mayo, I'd pay attention to that. They also have soup, coleslaw, salad, chips baked goods available to make it a combo."}
{"text":"You ordered a toast and they won't even butter it and the thing is they do not have butter only margarine.  The servers are all grumpy and only pleasant to other people, i.e., doctors mostly (suck ups). Starting with the bald guy.  I try to avoid this place as much as possible."}
{"text":"Been going to Druxy's on Liberty for years.  Never been ripped off.  Granted they (Druxy's corporate) have changed their pricing over the years, but the staff are polite and honest.  Don't be a dick, Theo."}
{"text":"I love the grilled cheese sandwiches from here - I always get mine with tomato and a good amount of ketchup on the side. For about 3.50 (after tax) it makes for a great small lunch/snack. I had their roast beef, but found it a little too salty, but I don't like most processed meats anyway. The staff here are the best though, really friendly. One time they gave me salad dressing for free, and I vowed to commemorate their kindness."}
{"text":"Worst experience here with the staff... It should be all you can topping but it was more like a little topping and the staff even complained when I asked for more dressing..... I mean how cheap can you be??? Will NEVER return there ever again"}
{"text":"I got a salad from here :-) all you can handle topping, it was good!! With a small salad, you will get a big portion... It was so big that I ate half for lunch and left over for dinner :-)"}
{"text":"If you happen to be walking down Queen Street then this is a great place to stop for lunch. The staff is super friendly and make you feel very welcome and comfortable. The only reason I did not give it 5 stars is due to a higher price than you'd expect for a sandwich and pickle ($10) although the sandwich ingredients were tasty and very fresh"}
{"text":"Druxy's has really evolved nicely over the years. They've got a good selection of breads (mostly Silverstein's), fresh ingredients, and good prices. My cheese sandwich (havarti!, lettuce and tomato), a pickle and soft drink was under 5 bucks. 

They also offer 4 or 5 soups, all with displayed nutritional info.

The staff is friendly and efficient."}
{"text":"This location has amazing staff that are honestly so passionate about the freshness and quality of the ingredients they use. Prices are on the higher end but for the location it's pretty average plus the portions are very large."}
{"text":"Love this place!!

First of all, the value is amazing. So many other build your own salad places in the Path charge obscene amounts for salads and even more for adding toppings. A small salad at Druxy's is around $7 after tax and you can add all the toppings you want at no extra charge. You only have to pay extra for \"protein\" (chicken or tuna), but since the chickpeas, cheeses, nuts and seeds are all free, I never need to add extra protein. I have only tried the build your own sandwiches once, but the price, freshness, and quality were all tops for that as well.

But most importantly, the people who work here are awesome. Everyone always seems so genuinely friendly. They don't rush you if you're having trouble deciding, they don't skimp on toppings, and I've never seen someone so make a sandwich so carefully and precisely. 

They also seem to take to heart the sign on the register that says \"keep smiling\". The man who is there every day has this booming voice and hearty laugh and is always so friendly. Even when I'm not eating there and I walk by and see him interacting with customers, it makes me smile.

Well done Scotia Plaza Druxy's!"}
{"text":"I'm going to give this place a four, it's on the higher end of 3 so I'll round up.

The salad's I guess could be considered pricey but the small salad and how generous the staff are with the toppings make up for it. I certainly know how to get my moneys worth.

I need to get my lunch protein intake, omega 3 and some fibre veg. Here is an example of what I get:

- Spring Mix (not too much to over kill the taste)
- Salmon 
- Broccoli
- Cabbage
- Green Peppers
- Black Olives
- Flax Seeds
- Sundried Tomatoes
- Parmesan Cheese or Feta (Depending on if I'm feeling Italian or Greek that day)
- Bacon (Real Bacon)
- Egg
- Buttermilk Ranch or Balsamic Dressing (usually ranch as I prefer the fat over the sugar in balsamic for ketosis diet)

So for under $10 and with the fixings -- definitely worth a 4 out of 5. 

The other person who gave this place a 1 out of 5 is a TOOL. Who orders Chicken Shawarma at a Druxy's? dur dur. Same guy who probably orders the burger at Red Lobster."}
{"text":"This place has the worst service I have ever seen! The staff stands around like sour faced zombies. To get service you have to wait until a slow moving , disinterested slug behind the counter realizes that you aren't giving up and wanders over begrudgingly to take you're order , this is you're chance to run. The food is terrible! It matches the service , so at least they're consistent. Better to be hungry than totally pissed off."}
{"text":"I like Druxy's anywhere but the one at Scotia Plaza. This location does not match the quality of the other ones I know, yet they charge you extra for everything.
over $1 for a slice of cheddar (package)
I rather walk to the one at Commerce Court."}
{"text":"I like the soups here, for $3 - 4, you can choose from 10 different soup.
The best thing is they are all healthy choices.
I never had any of the sandwitch, but from the looks of it, it's pretty good."}
{"text":"I had the lasagna and cesar salad for $6.95. Great price but definitely a frozen lasagna but the salad was nice and fresh. The staff were friendly with a nice touch of humour about them."}
{"text":"I've been here so many times and I'm a huge fan.  This deli never lets me down.  The food is always fresh and tasty.  Whoever thought of bread meat and cheese as a portable meal was brilliant but these guys perfected it.  Coming here has been my happy place for such a long time so keep up the good work and i will be back again soon."}
{"text":"You're probably wondering why a Druxy's deserves a review?  I mean, they're all over the city and you probably think they're all the same.  Well you're right.  Most of them are total shit and taste like hospital food... except for this little gem hidden away in Commerce Court.

The main draw of this place is unquestionably the staff.  It stems right from the owner all the way down to each individual server.  It's like they're all apart of some secret cult, cuz every single one of them is a complete joy to speak to whether you're ordering breakfast, making a gargantuan sandwich or salad.  Come lunch time, you can literally hear the hot sandwich guy yelling and singing \"HOT SANDWICHES! GET YOUR ROAST BEEF HERE!\" from around the corner. 

The setup is very simple, you order what you want, sandwich or salad, but the beauty is you get to stuff them with whatever you want.  UNLIMITED TOPPINGS!  No big deal right?  It wouldn't be but they have almost every topping you could hope for.  Pine nuts, sunflower seeds, green onions, chinese crispy noodles, THEY HAVE BRIE!

I once made a \"grilled cheese sandwich\" that consisted of havarti, cheddar, smoked salmon, bacon, onions and tomatoes.  Heart attack and a half for sure, but a satisfying breakfast nonetheless. 

Anyways, clearly I'm excited about this place and I just want them to get the recognition they deserve.  They really take the extra step to make you smile while you're ordering your food.  They provide you with free wifi and they don't care if you just sit there and enjoy yourself.  Hell, they even come around and offer you complimentary tea or coffee if you stay long enough.  In a crowded hub in the financial district, where vendors take your money and try to get you out the door as quickly as possible... that's saying something."}
{"text":"Druxy's my new BFF! 

This Druxy's is located in the cave that Scotia Plaza calls its food court, but regardless of the dim location, the service rocks and it serves great food every morning at breakfast time and at lunch time. It's always opened when I get to Scotia Plaza, so that's bonus points from me... I'm at work EARLY and it's comforting to know that I won't starve if one day I forget to eat breakfast and have to wait until everything opens at 9AM or 10AM.

Druxy's in my good books ever since they came up with the most brilliant idea: \"Design your own Salad\" with ALL the toppings you can handle... and they mean it. The girl who serves me each time keeps the toppings coming until I say stop and at that point, she will add the toppings to my choice of greens. There's a large variety of delicious and fresh toppings for you to add to your choice of green: spring mix, spinach or lettuce. The Salad comes in three sizes, I usually find the small would suffice, it's 24 oz I believe. However, one can never have too much greens... so go for the medium or large if you're lacking your daily veggie quota. 

One downside is if you're a meat eater or tofu lover, it costs more to have such protein added. However, if you're ok with chickpeas, there's no extra charge for that. But really, if you have a fresh melody of toppings with leafy green goodness, would protein make the party better? Naw, I don't think so. Don't overdo it."}
{"text":"I popped in today for my first time after dreaming about corned beef sandwiches for months. 

And I was sort of disappointed.

While the staff were really nice, the food quality just wasn't there. The corned beef was really soft and almost slimy. And for $10, the quantity wasn't there either. I mean, you go to... even Pickle Barrel, and you'll get a healthy (heh heh heh) amount of food placed in front of you. Here, though... for $10, you get a pretty small sandwich and a solo pickle wrapped up (kind of lazily) in some saran wrap.

Overall? I might go again, but definitely not for the $10 meat sandwich. They have salads and soups which might be worth while? Oh. And what took it from a 2/5 to a 3/5? One of the staff says \"beauty\" after everything you say.

\"Mustard?\" \"Yes, please.\" \"Beauty.\"

\"White or brown?\" \"Brown.\" \"Beauty.\"

\"Drink with that?\" \"No, thank you.\" \"BEAUTY.\""}
{"text":"Pros: Some staff very friendly, lunch special not a bad deal, clean, fast. 

Cons: Some staff unfriendly, portions could be a little more generous. 

Verdict: Would recommend."}
{"text":"I love me some Druxy's.  Yet it must be noted that all Druxy's are not equal, you will find the good, the bad and the downright ugly if you frequent more than a few of em.  However like other reviewers have noted this location is among the finest in the city.  The staff are super helpful and they have the most incredible \"Wicked Thai\" soup.  I'm not sure if this is a Druxy's staple, as I have only ever encountered it at this location, yet if it isn't, it should be.  The soup is a delicate balance between the sweet and spicy with creamy coconut richness bringing it all home.  It is hearty and light at the same time and can be trusted to aid in combating the roughest of night's out.  Although I must state that this is by no means a \"hangover soup.\" It is just as good, if not better when one possesses the full range of cognitive abilities needed to appreciate it fully.  

I should mention that I have never been successful in purchasing \"Wicked Thai\" after 1:30PM.  It sells out with almost certain regularity.  So if you want some....and you do, hit up Druxy's before say 1:00pm.

This is something you need to try!!  Let me know what y'all think."}
{"text":"A bit pricey for a sandwich, but it was good!  Apparently, Druxy's idea of breakfast is a custom made grilled cheese, which I had for lunch since it's served all day.  The base price is $2.75, which includes bread and sandwich, but that's not much fun.  I had mine with ham and tomatoes, and it was delicious!! Combined with a bottle of vitamin water, the total bill was about $9.  Good thing they take credit cards.  I supposed that's the average price one pays to eat lunch downtown.  

There are 9 different bread options.  9!!  I went with French and it made a great grilled cheese.  Other toppings you can add to your sandwich include (but not limited to) egg, bacon, sausage, turkey, salami, lettuce and peppers.  If grilled cheese isn't your kind of breakfast, they also offer peanut butter and banana, lox, oatmeal and assorted pastries.  They also have lunch items like custom made sandwiches and soup.

The shop is small, but there's seating for about 10 people. The employees are nice and efficient at their job.  That's a plus for me since I didn't have much time to scarf down my breakfast/lunch."}
{"text":"This will be a quick review as I come here for one thing and one thing only! Grilled cheese!! I get grilled cheese with avocado and sprouts on dark rye, no butter needed. It comes in under 4.00, so when I don't have time to make lunch this is a great cheap option. Quick lines too!"}
{"text":"Don't order takeaway from this place. They got the salad orders all wrong and didn't send any soup. The order was a handful of dishes so not difficult!"}
{"text":"I've had better experiences with Druxy's elsewhere, but not the one inside Eaton's Centre.

Ordering the salad for the first time, you have the option to top it off with as many toppings as you wish, with an additional $2 for each protein item you add on.

The salad selection didn't look fresh or appealing at all. The lady behind the counter kept insisting my options were only limited to the veggy side, excluding the fruits and nuts options, which I later found out was not true.

The lady didn't even try to fill the salad bowl to the top and seemed hesitant when you asked for more of a particular topping. 

If you're a Druxy's fan, avoid this location. I've had better."}
{"text":"I've been to several Druxy's around the downtown area and I have to say, this one is the best I've tried. The staff are friendly and patient with your orders. The salad selection is fresh and ranges with everything you can think of, compared to the other Druxy's I've been to.

I ordered the small salad ($6.00), complete with over 40 toppings to choose from. The staff kept encouraging me to fill it up to the very brim. And best of all, they tossed it together so all the toppings and dressings was spread out.

I've never been excited to eat salad, but this location changed my mind. 

Definitely a hidden gem. Go try it out!"}
{"text":"Yes, I agree with the comment below. This location is absolutely filthy, and will do anything to charge an extra buck. The owner just doesn't have the same standards as other Druxy locations. Also, the coffee is terrible and the food is way over-priced. Plenty of clean sandwich shops within the Path."}
{"text":"Great option for salads!

$6.50 for a \"small\" salad. Small is in quotes because 
a) the bowl is about 7\" across and 2.5\" deep and 
b) you get unlimitted toppings. That includes nuts, cheese, egg, fruit and BACON. They don't skimp, either! 

Only down side is that their balamic isn't that good... I put up with Fresh Fast Food's salad shenanigans just for their to-die-for balsamic! 

Today I had a serious hankering for an avacado club sandwhich, but given the great price of this salad and the tightness of my pants I decided to meet my craving in the middle with a salad creation:
-Romaine/Spinach
-Bacon, Avacado, Cheddar, Tomato, Mango, Green Onion, Carrot
-dressed lightly with Balsamic & Ranch

I don't know if it was really that much healthier, but it was darn good!"}
{"text":"3 stars for a great selection of breakfast & lunch hot/cold items that can be ordered regardless of the time on the clock :) Feel like pierogies at 8 am in the morning? Soup? Veggie Patty? Go for it! If the door's open and its anywhere on the menu, you can have it :) That's a nice change from Tim Horton's & Mcdicks.

I ordered the cream cheese & lox on an everything bagel. The lady working the hot table today was very nice and we had a long chat so I understand if my service was a little slow...I don't mind getting a little networking on the side with my order! Sadly, however, I didn't get much lox on my bagel which, again, I'm going to chalk up to the result of being distracted throughout our chat (perhaps it was just a small oversight). Still, the cream cheese & lox & bagel all tasted fresh and when I dipped it into my small butternut squash soup, the spices from the soup added a little kick to it which was nice.

Washed it down with a pineapple ginger drink. The lady's service was good but the guy working alongside her wasn't pleasant at all - oh well. I'd still go back. Will review and update again sometime in the future.

P.S. Patio on both sides of the entrance doorway. Room enough to accommodate a large table or family. Some tables have umbrellas for shade and comfort.

P.P.S. TV inside plays CP24 so you can get briefed on the news while you grab breakfast before work/during lunchtime. Quiet enough to bring your laptop in and get some work done although I'm not sure if they have wi-fi."}
{"text":"Stopped in for a quick snack. Ordered a grilled cheese sammy with tomato on whole wheat. The sammy was pressed very flat and I normally expect the cheese to be traditionally warm and gooey. Far from it. It hit the spot though as I was quite hungry for a snack."}
{"text":"2.5 stars

I've come here a number of times for lunch as I work at the courthouse next door on occasion.

I love the salad options, getting to pick whatever you want in your salad, and the ingredients seem fresh; well the vegetable portion at least.  The protein is pretty gross.  I have had the chicken before and it's just frozen chicken slices warmed up in the microwave.  Bleh.  

The reason why I give them such a poor rating, however, is that at lunch time it is such a shit show in there.  They are understaffed and don't seem to have any organization.  I have stood in line waiting to pay, thinking I pay first then have my food made later.  Then I will see people just crowding around the food area and the servers will start making their orders before the people who have paid.  It's such a clusterfuck, I have walked out a couple of times as have other people.  There is no organization and the customers are not told what to do.  

The place needs to be swept/mopped once in awhile though, and the couch/table section desperately needs to be replaced.  It looks like a couch and table you'd find in a college frat house.  

It's okay if you are in the area and need something quick on your lunch break, with few options around you, but I wouldn't make a point of coming here."}
{"text":"If you are looking for an inexpensive sandy, this place does the job. Although the veggies definitely are not deliciously fresh, they aren't gross, mushy or wilted either. Just lacking the colour and flavour, know what I'm sayinnn?

Anyhow, i got the tuna. It was filling and held me over til dinner time. It wasn't an \"OMG, so good!\" experience, but it's a cheap sandy place in the eaton centre, so what do ya expect?"}
{"text":"A fast-food option that is at the very least healthier than the choices at the nearby golden arches, although probably more expensive. I had the 6oz corned beef sandwich ($10.45), which comes with half a pickle but no sides or drinks. You get your choice of bread, cheese (Swiss, smoked Gouda, cheddar), and mustard (hot or reg). Toppings include bell peppers, cucumbers, lettuce, tomatoes, or raw onions. The meat is taken out of a large steamer, sliced in front of you, weighted quickly, and packaged on the spot. Since the sandwich was under the hot-sandwich section, I expected it to stay warm for the 5 minutes it took for me to walk back. However, it was already cold when I unwrapped it again so I found that confusing. Is it false advertisement or am I understanding the word 'hot sandwich' incorrectly?

In all, not a bad sandwich even though it was cold. 6 oz was a lot of meat so I will probably get the 4 oz cheaper version if there is a next time."}
{"text":"Full disclosure: I didn't eat there. What I will say, is, I set out to satisfy a craving for a decent smoked meat Sammich for lunch, but immediately paused outside the door; The place was empty in downtown Toronto at 12:15 in the middle of the week.

A lot of travel has taught me one thing: If the locals are staying away from a place specifically designed for a quick lunch in a busy downtown area, you're looking at a big, red flag."}
{"text":"The sandwiches prepared for you, I feel comfortable being a vegetarian. I don't trust anything else pre-cooked and laid in a buffet format. After a while, it's all hotch-potch, if u know what I mean. You have to like what you see before you dig your spoon or fork in it."}
{"text":"This is the perfect spot if you're looking to get sick. I should know because I was sick for almost a week after eating their 6oz corned beef sandwich. 

There's no saving graces here. The food sucks and it will get you sick. What's worse is that's in a god damn hospital. Convenient I guess.

Honestly, this place is a disgusting embarrassment. I'd rather eat out of a garbage can than go here again."}
{"text":"This place isn't really great anything special. The food is quite average and the service is not anything special either. Got a bagel sandwich for breakfast and ended up having to wait for the owner to finish his own personal conversation with someone else to pay. This was not ideal as I was hoping to be in and out...and just eat my sandwich. I think it might just be worth it to take the hit and wait in line at the timmie's down the street."}
{"text":"Make your own grilled cheese.  Yes.. you heard me.  Make your own grilled cheese.  Not in the sense that you are cooking yourself.  More along the lines of you pick the bread, the cheese and any additions you'd like.  I read the sign and wanted to pinch myself.  I then quietly went inside and asked the server, \"is it true?\"  

I asked for caraway rye, smoked gouda and peppers. She didn't hear me and put cucumbers, which I decided to say \"ok\" to, just to add a sense of adventure, but insisted I still have the peppers i asked for.  Once the sandwich is done, I inhaled it's heavenly scents and took a tiny bite, small enough so that when I take a picture of this magnificent creation, people will not see my chomp marks.  Once I finished taking the picture, I devoured this sandwhich in a fit of joy and satisfaction.  In fact, I ate so quickly, I still had room in my stomach and helped myself to a bowl of their chicken noodle soup.  I was impressed by the cute little bowl and cover they used.  Once seated, again I ate my heart out! 

Good quality, yummy ingredients!!!!! Why not 5 stars? I wish the server would have listened to be a bit better, I did have to repeat myself and I'm pretty sure my New York accent isn't that difficult to understand. Also, it was in a food court, not the ultimate dining experience."}
{"text":"I'm always on the lookout for good lunch spots in this neighbourhood, but I never thought to try Druxy's because I'm not really into meat-y lunches (I'm not vegetarian, but don't really eat a lot of meat). Came here with a co-worker who introduced me to their create-your-own salad bar. $5 for a decent sized salad with lots of great toppings - *avocado*, different kinds of cheese, fruit, veggies, nuts, etc. They also do grilled cheese sandwiches -- you can pick your bread, type of cheese, and extras (tomato, bacon, ham, etc.)."}
{"text":"I'm not sure how I feel about this place. I would rate it a 2 and a half star. I got samosas from there today and everytime I purchase them the price changes. Also they were pretty sloppily (you know what I mean) put together. They were falling apart and semi soggy. 

On the upside they are priced reasonable enough for LV. It's really close to where I work so I'll likely be back just will not be getting samosas from here again. Better options in the area imo."}
{"text":"They definitely don't cheap out on stuffing your breakfast bagel. But the taste was very bland considering I got a western."}
{"text":"This Druxy's is in the lobby of Princess Margaret Hospital.  Catering options are limited there-Tim Horton's or here.  I can't cope with Tim's coffee anymore so started popping in here instead.  I've only had coffee and snack things so far.  The rest of the food is like any Druxy's I think.

Coffee is decent but the 4 star rating is more for the staff.  They are so friendly and cheerful.  One woman in particular tends to be on the cash register in the mornings and truly does brighten my day.  Yesterday's exchange:
Me: Extra large coffee please.  It's one of those days.
Her: I thought all the days were like that?  Haha!
Too true....
She doesn't have to be so cheerful and smile so genuinely, but she does and I feel energized leaving-even before I've sipped my coffee!

Prices are good too-$1.25 for a large coffee, $1.50 for the extra large/jumbo sized."}
{"text":"There is a server at this location who is consistently rude to all customers. I work on the 7th floor of the building and this has been mentioned by almost everyone at our office. Today, she said \"who's next\" to the back of a clearly formed line to order sandwiches. The customers pointed her to the front of line, where I was next. She came up to me and yelled \"SPEAK UP!!!\" in an angry tone before I even had a chance to speak. Everyone in line just started laughing at how blatantly rude it was...but this is how she always is. I WON'T be going back to Druxy's because of her. (description of the worker: middle aged woman of Asian decent, about 5'2, dark hair tied back)"}
{"text":"The rudest, most obnoxious, miserable and unhappy staff.  Tall bald guy very rude to customers - I could not believe that no one challenged his rude behavior.  This is what happens when they are they only game in town, i.e. people have no other choices when they are stuck in the hospital taking care of a loved one.

The cashier tried to hurry a woman up in front of me who was in a wheelchair so she could move on to her next cu$tomer.  SO DISRESPECTFUL and heartless.  This, in a hospital setting?!  Unbelievable!!

GO NEXT DOOR TO MOUNT SINAI FOOD COURT and avoid this place like the PLAGUE!!!!"}
{"text":"We had a gluten free BLT and egg cheese ham.
Normal, regular tasty food, good coffee, fast service. Great for grabbing a fast bite.

Prices from 2.75 to 10 for regular roster of sandwiches, they also serve soup, Mac and cheese, vegan options.

Has about 14 seats.

All good :)"}
{"text":"These sandwiches are really stuffed full of smoked meat that is shaved fresh when you order. You can put all kinds of fresh veggie toppings. They have 2 different types of rye you can choose from. Much healthier than Subway. The service was very friendly. I recommend this place for sandwiches if you want a healthier option than Subway. The staff at the Subway nearby are very very rude so I have no problem going to Druxy's and getting a better sandwich for less."}
{"text":"if you're visiting the hospital and have to hang around for a while, you will quickly find you have very few choices in the immediate area! 
For me, this Druxy's would be the #1 choice. The value for the quality and amount of meat is decent as for most Druxy's (this is no Katz sandwich though), and the quality of everything other than the meat is meh!
What earns this location an extra * is the staff! On my visits they have been known to be extra generous, and even stay open a littttttle bit past closing time (6:30) to make a last sandwich!"}
{"text":"I come here to get coffee almost everyday on my way up to the office, coffee is good and they have a good selection of sandwiches and soups but not enough of a variety for lunch as I would hope. the service can get slow but they are very friendly and overall I like coming here in the mornings to get my coffee and sometimes a grilled cheese to go with it."}
