{"text":"Great Restaurant, great service, great food. Recommend to anyone. I asked for medium rare and I got it. Quality of produce it top notch. Thank you, we'll be back again."}
{"text":"Went and eat here Saturday. I ordered the rib steak after asking asking the waiter what size and grade the steak would be. He told me it was a 16 oz 1855 grade steak which is top quality. The complete opposite of what i got. The steak was a measly 12 oz steak and definitely a regular AA grade steak and not the 1855 I was promised. I'm a butcher and know a steak when I eat it. Don't be fooled by the false claims advertised by this restaurant. 

Thanks Carmelo and company for my wonderful dinner..."}
{"text":"Amazing! Great food. Great ambiance. Bring your own wine place. The meat is top notch as it's connected to Boucherie Agga so you know you will get the freshest cuts of meat. The 34oz Tomahawk steak is melt in your mouth good! Bring a friend or two to eat it.... It's really big. Let the carnage begin... Lol!"}
{"text":"Love the location with plenty of parking. Great friendly environment. Love that they carry in store to buy and bring home items that they serve from pasta to the meat. 
Menu changes every week so order the item you really want as next week it's gone.!! Lol
They also have a permanent meat menu. Also lunch menu. 
Summer addict is the frozen coffee café crema!!!"}
{"text":"Don't you just love discovering excellent eateries in the places you least expect?  That just so happened to me tonight.  If you drive out to St-Leonard, hidden in a strip mall you will find the BYOB Du Boucher À La Table.  The menu is Italian and is meat-centric as the name might suggest. On a Saturday night the place was packed so you might want to play it safe and reserve.

The vibe is that of a casual eatery with a little bit of fine dining thrown into the mix.  Here you eat at communal tables and there are no menus.  Everything is written on chalkboards.  If you're just two (as we were) then you might want to sit at the counter which overlooks the kitchen.  Here you get a front row seat to see the chefs whipping up the delicious food you are about to eat.  As someone who loves cooking myself I enjoyed watching how a restaurant kitchen works.

Like I said before the menu focuses on Italian food.  I skipped the antipasto because I wasn't too hungry bt they have the usual ones for an Italian restaurant. For the main course I got casareccia with boar ragu and it was to die for!  The pasta was cooked al dente and the sauce itself was loaded with boar that had been braised to perfection.  I also tried a mouthful of my father's lamb and it was so tender it didn't need a knife to cut it.  In addition to bringing your own wine be sure to bring your appetite because the portions here are huge and I can promise that you won't go home hungry.

As for the prices they were fair.  Most of the main dishes were in the $20 - $30 range and when you consider the portions and quality of the food it seemed reasonable.  The overall experience here was a positive one and I will definitely be back in the future to try more of their offerings."}
