{"text":"Great service. Came on a Friday to watch the soccer game with a handful of friends. Beer selection is limited but solid, no personal favorites. I can see how service could get spotty with only one or two servers working the floor but Ali was an angel.

I enjoyed the laid back environment and friendly employees. Will visit again."}
{"text":"If you like beer... drink beer here. Its like getting punched with an eagle fist in the mouth, but in a good way."}
{"text":"This was my first time to Dubina Brewin Co, I saw the Groupon deal online and couldn't pass it up!

We got a few flights of beer as well as the Ham & Cheese sandwich. Sandwich was great and the whole menu selection is awesome and very well priced. Enjoyed all of  the beers on tap, especially the Zizkov Kolsch and the Havasu Hefeweizen.

Being from the Northwest, I very much miss the abundance of craft breweries back home. I was very excited to have this new brewery open up so close to my home in Glendale!

The space and location are good, I'm excited to see this place grow and will definitely be returning regularly to support Dubina Brewing!"}
{"text":"Thrilled to have Dubina in my life. 

Bell Road IPA is the shiz. Don't care for IPA normally but this super-hoppy beer (7.3%ABV) is so, so good with one of their very special 'Soft Jumbo Pretzel's' ($5.99) which happens to be baked locally. It arrives with a side of melty cheddar and spicy mustard and is always perfectly salted. 

Service is friendly and down-to-earth. They even have a giant JENGA for the kids to toss around.

It's worth a mention (although they are unusually modest about this) that Dubina was just declared the Arizona Brewery of the Year by The New York International Beer Competition. http://bit.ly/1xD9gOE"}
{"text":"I visited this new brewery with my wife and daughter. We ordered a flight of beers to see which ones we would order. All were very good, and we each ordered a different one. We also ordered a Brat, and it was fantastic!! It tasted like a real brat with veal in it, and we all enjoyed!! I will definitely be back for more!!"}
{"text":"Awesome to see something such as this in the West Valley!
Loved the hefe! The stout seemed a little light for my taste but the others were pretty impressive. Can't wait for more food!"}
{"text":"Best beer in the west valley and great happy hour proves.

Previous issue with over billing was corrected by management and turned out to be an error with no bad intentions.  Appreciate the efforts of management and service team to make this right!"}
{"text":"The place sucks! The food was cold. The coke was flat. No real options if you don't drink beer or are a designated driver. The Waitress was rude. Hope to never return. Dive bar-ish in a dingy parking lot. Don't waste your time"}
{"text":"Went with a friend to watch some college football... Loved it! Great vibe, great staff, and great beer. I ordered a flight to sample some different of beers (it was way more beer than I expected, for only $7), loved the IPA, loved the Pumpkin Ale, big fan of the Pale Ale.  I'm not a coffee guy, so that one missed the mark for me, and I found out I am definitely not into sours.  

Overall, I can't wait to go back.  They said they're about to expand the kitchen, which will make it even easier for me to stay even longer.  Couldn't recommend the place enough."}
{"text":"They have good beer. I really liked the stout made with snow, but the sour they had tasted awful. Sours are hard to get right though so i wont judge too much on that since it was probably one of their first tries. I would rate them higher because the people are nice and i love small craft breweries, but the food needs some work. Everything ive tried so far had been pretty bland and since their food is on the pricier side for a bar i would expect a little more. The fries are the worst though, never crispy :("}
{"text":"So, we had a Groupon for 4, but our friends bailed out on us. Decided to go anyways since the Groupon was about to expire....they gave us 2 yummy appetizer pretzels, which was nice, but did not give us the extra flights, which really was no big deal, since the only beer we really cared for was the Dubina Ale, a nutty brown ale, which we chose as pints as well ($10 for 2). Good malty flavor, and not too carbonated, comparable to Oak Creek nutty brown ale. We also ordered the fries, fully loaded, yummy, since they put on grilled onions, spicy cheese, (real) bacon bits, and a homemade spicy hop sauce. The owner came by and checked on us a couple times, a real plus. The place was not hopping on a Saturday afternoon, but maybe it was due to the music?? They were playing some emo-new age angst ridden garbage that seemed way out of place in a sports bar atmosphere, a definite minus. Would I go here again? Only if I am in the area, since it is a long trek to Tempe after having a couple beers."}
{"text":"No lite ale beer, no cold wine,  I asked for some lime juice,  and got a look of \"what's that's?\" Last time for this place."}
{"text":"What a find! 
Family owned and run,
Friendly, attentive, enthusiastic servers,
With a neighborhood hangout feel to the place...

We had the housemade fried pickles, homemade pretzel with cheese and mustard, tasted a flight of five of their nine beers: 
Bell Rd IPA, Dubina scotch ale, Nitro milk stout, Bolotnik Russian Imperial Stout, and Blood Orange Bell Rd IPA. The last sounds perhaps odd, but the orange really goes perfectly with the hops. IPAs were well balanced. 

Delicious Philly cheese steak on pretzel roll, generous serving of fresh salad instead of house made pub chips. Fresh Caprese salad was so fresh and tasty.

With great food, great beer, great service, we'll definitely be back!"}
{"text":"We were so disappointed today when we arrived at Dubina. We walked in and picked a seat near the bar at the long top table. Both waitresses made eye contact with us several times but never came over. We were ignored for over 10 minutes. At one point one of the ladies started rolling silverware at the hostess area. We have been here before and we were excited to go again, however we ended up leaving."}
{"text":"Great brew.  Descent hot wings! Good service!  Awesome beer!  Love all the German brews!"}
{"text":"Had a great experience here! Loved the service and food.. & My boyfriend liked the dark beers. I recommend the bruschetta and the pretzel!"}
{"text":"I REALLLLLY wanted to like this place.    I had wanted to try Dubina for a year, since noticing them in the old Skybox location.   The environment was a bit off from what I expected.  A low ceilinged bar filled with very quiet, almost somber 50somethings.  We walked in, sat down and tried to place our order.   They were out of both of the first two beers I tried to order.   Strike 1.  We get our beers,  and while not bad at all, they were nothing special.  We decided to order dinner.  After we decide what we will have the waitress informs us they are out of fries.   Who runs out of French fries?  Fine, we will have onion rings.  Our food comes out.  Strike two.   My philly  was horrible.  The meat was almost black, and so salty I could hardly eat it.  My wife's salad had so much blue cheese, you couldn't taste anything else.   Wow, strike three.  I ask for my check, deciding to go a mile down the road to Rock Bottom (great food and service).  I get my check and wow...  $60 for that CRAP.  I will not be back.   Now I undefended why there are never more than a few cars in the parking lot."}
{"text":"Great beer and food. I love their selection of brats. Wednesday night trivia makes this the place to be!"}
{"text":"Food is ok. Service is really really lacking.  They even told us that coming in, hey its kind of a long wait  

They have one waitress for the whole room. About 35-40 people there when we arrived.  A meal and drinks that could have been served in an hour took us two hours, and it was not worth the wait.  

Not sure what the owners are doing.  If they are trying trying to save money on labor, well they will end up losing customers, and money, because no one likes to wait 

So, best to try other Glendale options until this place gets some serious service, not that Glendale has many good options."}
{"text":"We tried Dubina for my husband's birthday celebration and it was perfect! It's a great local place that's hitting the ground running. It's not a fancy place with a glitzy menu, but the items we had were all well done (you won't go wrong with the local brat). They also had enough variety of beer on tap to please all kinds of beer drinkers. I really enjoyed the pumpkin ale, the gose, and the imperial IPA, however they all brought something different to the table. The atmosphere is also low key and the service is friendly. We will definitely be back and are happy to have this family run brewery in the west valley. Support your local brewery and check this place out!"}
{"text":"Great to have a local brewery over in Peoria/north Glendale area! Tried a flight, all were good to very good, none bad, none amazing. Pretzel was a bit greasy but fries were tasty. Atmosphere leaves something to be desired. But good friendly local place, will go again."}
{"text":"Everyone was super nice and we felt very welcome. The food and drinks were perfect and the staff was attentive. The owner even came up and spoke with us for a few minutes. It was a very personable experience that made me look forward to visiting again."}
{"text":"Wonderful music selection... Especially if you're in your mid to early 30's. Played dashboard, brand new, hellogoodbye, and old blink 182 to name a few. Good beer and food too!!"}
{"text":"Super dope. Highly recommend. Good chill atmosphere and the stout was terrific. Good food. Good people. A good time!"}
{"text":"Their sliders and soft pretzel are amazing!"}
{"text":"Love hole in wall joints and this place didn't disappoint. Loved the beer flight so I got a chance to try 5 of 6 of their brews. Ate way too much but was worth it. The Dubina nachos were to quote Guy Fieri out-of-bounds. Pretzel was great, fluffy and big. And the brat I had wow that was true German. Can't wait to go back and try more food and probably have another flight LOL."}
{"text":"Great people, and the food is ok. I need to go back and experience since the equipment upgrade, but the beer has been lackluster. The IPA was a solid choice, but the last time that I was in the bartender served me a glass of yeast. Literally. Offered to try to clear it up, was unable to, and ultimately acted like I was out of line for a glass full of trub. Cloudy would have been an improvement. 

I'll be back, and update my comments accordingly."}
{"text":"So, I literally just got home from Dubina Brewing Co. Normally, I don't write reviews, but I felt compelled after my first experience there to write something. I am thoroughly pleased with my experience. 

I went alone on an unusually slow Saturday night for a bar. I sat at the bar and was promptly served by the bartender. The beer selection is small, but quite nice. The Pom-granite Sour was my favorite and I have never had a beer like the Ye Olde Smokey. Additionally, I really enjoyed the Blood Orange IPA. For food, I had the Dubina fries, which were tasty and a good addition to the beer. 

Honestly, the worst part of my experience was the man that was an offensive drunk. However, I was very pleasantly surprised to have not only management, but also staff, speak with the man about his behavior in a patient and polite way. They both asked him to be courteous with his language to other customers for the comfort of their other customers. It is the first time, in a very long time, I have had staff make efforts to make all their customers feel comfortable. 

I will be going back and soon."}
{"text":"The staff is very attentive and friendly. The beers were mediocre but the food was much better. It takes awhile to get the recipes tweaked and right. Worth a trip here."}
{"text":"Where to start? I love this place. I feel so lucky to live down the street. The grilled cheese is great. The beer is usually on point (they run out of the good stuff). But that just means I have to come more often. I accept that. I highly suggest giving it a try, no matter what kind of beer you typically like"}
{"text":"Lives less than 1/2 mile for 2 years and never ate here.  My parents said that the burgers were good. My sister got a promotion so what better way to celebrate than burgers and beer.  First we get to the restaurant and its seat yourself...bad for large parties.  There were only 7 of us, took about 10 minutes for a large dirty table to be cleaned.  From here it all went downhill....

First we all sat and took about 15 minutes for a serve to come.  We finally got sodas and beer and life was good, but that didn't last.  We had to go to bar for beer refills. Finally we got those.  Food wise...we got 2 pretzels for an appetizer.  One was hot, fresh and delicious and the other was cold and so-so good.  Disappointing but decent. Drink refills were slow and usually empty, but the server had a lot of tables and did her best. Finally after 1 hour and 10 minutes half the table gets food.  The wait continues....everyone finally got food and my order is wrong.  My husband ordered the bacon cheese brat, it was okay.  Everyone else got burgers.  The burgers are good, but they need another option besides the pretzel bun.  Best thing on the menu....FRIES!!!  Those little golden crisp delicious potatoes are delicious!  I finally got my burger about 15 minutes after everyone else.  My food was hot which was good.  We never got the onion rings my sister ordered.  The manager and server were very apologetic for the issues, which seemed to be happening to a lot of tables.  The food was ok, living across the street...I'm not sure I will come back. 

On a side note, everyone at the table who had beer raved about them!!!"}
{"text":"Great place!  Good beer and food. Had the Kraut Brat and IPA. Both were very good and a great price. Wait staff always active and Allison behind the bar was knowledge and attentive. Definitely will be back!"}
{"text":"Really glad to have a brewery on my side of town instead of driving for 30 minutes to the others in the valley. Dubina is a solid brewery and they are really maturing into some good brewers. They are expanding their food menu as they go as well at the atmosphere. They seem to get better and better every time I go, really glad they are doing well and I will continue to give them my business."}
{"text":"The beer here is pretty good! I am glad they have growlers in, so I can take my beer home with me. I havent tried any of the food but i will go back and give it a whirl. Good service, atmosphere is OK. Good luck Dubina, we hope you are here to stay! :"}
{"text":"Sliders and hot pretzels are delicious. Pretty great beer and that is coming  from a Michigan beer snob! Highly recommended. Amy is a great waitress as well."}
{"text":"Wow just wow..  Great beer and food.  Don't let the curb appeal keep you out.  If I lived closer this would be a must..."}
{"text":"Went on a groupon. Had the beer sampler and the beer was average. Three out of the total of six available beers were IPAs so not much variety. Pretzel tasted like a big piece of gummy bread not like a pretzel at all. Only positive thing I can say is the waitress was very nice. Won't be back."}
{"text":"A brewery in the northwest valley, what's not to love!  Good beer and food, so u cant go wrong.  I enjoy the pretzel with a blood orange bell road ipa.  Not your typical ipa but very tasty.  Support local breweries!"}
{"text":"They've the best Blood Orange IPA I've had here in the valley freshly canned! I will be back very good stuff!"}
{"text":"Still love this place and friendly Elizabeth wax my bartender their new menu looks good, but I liked their first menu better as the bruschetta was Awesome!!! And it was so fresh as the guy told me he went to the Farmers Market several times a week which was  huge a plus for me. I still love this place and frequent it when I'm up this way. The groupon was great and we bought 3
Bell Road IPA is coming back so I'm excited for that...needs shuffle board and I'd be here every free night and weekend day I had! Or maybe Big Game Hunter"}
{"text":"The onion rings are delicious. The beer menu wasn't fully represented which was a bit of a bummer. The brats were slightly overpriced.Very small crowd on a Saturday. I was hoping for more of ambiance. We will give it another shot though as it would be nice to have a successful nonchain brewery on the West side."}
{"text":"Great local craft beers friendly staff and the food is pretty good. This is exactly the type of place the West side is missing. Can't beat leaving here with a growler to go!"}
{"text":"This place is awesome. Great beer, great service, bruschetta was amazing.  I will definitely be back. Alli is the best bartender, she was insightful about the beer and a great joy to chat with."}
{"text":"Let me state that this review is based entirely on the service. Not the beer or food. We have been to Dubina before and enjoyed it. That's why we went again on Sunday Sept 3.
We met some friends there, we were a table of 4. Our friends and 1 table as well as 2 people at the bar where the only ones there. Right off the bat our friends said don't expect fast service on the beer. They waited for quite a while.
When the sever finally came she (she never gave her name) made a trip for water, then a second one for our beer order. We waited a good 10-12 minutes for our beer. She said she would be back in few to take our food order. another 10-15 minutes passed. In the mean time 3 other tables came in. She waited on all of them. And took the order of the table next to us. I then stopped her and asked if we could place our order. She said yes and would be back shortly. Again we waited. 10 more minutes passed. More people came in. Still we haven't ordered.
The final straw was the table next to us got their food order before we even ordered! Completely unacceptable.
She finally came over to take our order and we told her we were done. Please just bring our tab, we are leaving.
Another 10 minutes with nothing.
Finally my friend went to the guy at the register and asked for our check. He said he was having problems and it may be awhile. 
She told him we were done and wanted to leave. He told us to go ahead and leave. Beer was on the house.
This server had no organization or priority skills. She did apologize that she was the only one there but that is no excuse for waiting on others while we sat and sat. Over an hour wait, 1 beer, 1 water, and never took our order. It wasn't that busy, I've seen other servers handle larger crowds with ease.
I may never come back. Too bad I really like your beer."}
{"text":"My wife and I visited Dubina Brewing Co on a Sunday and had a late afternoon beer and meal. My wife ordered the flight of five different beer selections, while I ordered the Bell road IPA.  I enjoyed my IPA, and the aroma was very pleasant; while the flavor and drinkability was average.  I tried each of the flights with my wife and noticed the following:  The Sours were very sour (good job!), the hefeweizen had the typical cloudy banana aroma and flavor, the Gose and amber also had all the characteristics of their respective types.

I ordered the fish and chips and my wife ordered a burger.  My meal was subpar and the fish was not cooked completely and heavily battered.  This was disappointing.  My wife said her burger was OK and cooked a little darker than the medium she requested.  In short, the food leaves a lot to be desired.

The service was slow.  After finishing our meal, we waited for 15+ minutes for the waitress to take payment.  We were the only group in the bar, minus a group of patrons there for what appeared to be a painting class.

On the whole, it was nice to visit a new local brewery in Phoenix.  I am not sure if we will return or if I will search out their beer however.   For the typical bar food and beer, this place fits the bill."}
{"text":"Kudos to new management.  We had experienced not great service...beer running out...in the past several months.  This time there were many beers and even guest taps.  The fried zucchini was awesome..so we hope it makes it to the new menu.  Also nice to see the canning machine working...because it seemed to break down soon after old management had purchased it."}
{"text":"Had a great time at your place on Friday night. Enjoyed all the beers and the friendliness provided by the staff. I have always enjoyed coming in and will continue to do so! Cheers."}
{"text":"Looking for a low key place for conversation or to watch a game while enjoying one of a kind microbrew?  If so, this is your place!

I've become a regular here...really haven't tried the food so I can't comment on that but love the microbrews.  You can find them at some taps around the Valley too."}
{"text":"Just had and excellent meal accompanied by three great beers.  My wife and I both had the bratwurst with fries, a pretzel and two flights of beers.  While we have different taste in beers we both enjoyed their nitro Brown and their oatmeal stout .  We had been to Dubina right after they opened and decided to find out how much they had improved.  Fantastic."}
{"text":"We had stopped by a nearby cafe for lunch and afterwards thought we'd do a quick search for any brewpubs in the area. This place popped up in our search so we decided to drop in and check out their beers.

It's in a small strip mall and nothing to look at from the outside. Inside they've done a good job of adding a little character to a generic building. You pass by the fermentation tanks as you walk in and there is ample table seating or you can opt for the stools around the bar.

We ordered a flight of beers along with a pint of their Havasu Hefe. Hubby loved the Daytripper IPA and the Arrowhead Double IPA (hophead) while I enjoyed their hefeweizen. For a small brewery they offer good beers and our server was friendly. Glad we checked this place out."}
{"text":"Great to see a new brewery take \"flight\". They have so many experimental brews and offer samples of everything. Build your own flight or let the experienced server build it for you based on your preferences. The owners chat with you and enjoy feedback on their progress.  If you live in the halo'd north valley this is a place to experience. Plus they have life size jenga, total win!"}
{"text":"My wife and I really like this place and visit it often.  The beer and food is great and prices are reasonable.  Some nights can be understaffed, so may not be the best choice if you are in a hurry."}
{"text":"I would say the only good brewery in the west valley. The staff is friendly without being pushy and they have a good selection of different rotating beers. I like a place where I can just relax and have a drink without loud chaos going on. I would like a little more selection on the menu items but they're new so we'll see what's to come."}
{"text":"A nice pub-like atmosphere in the center of 67th Ave and Bell Road. The restaurant set-up was nice and kept with the pub theme. Staff was friendly and helpful. The beers were ok and reasonable prices. Food was so-so. I ordered the dry rub wings that were ok. Tastes good at first, but as leftovers, it lost the flavor. My husband ordered the fish and chips. His chips were more like the sizes of a store-bought fish sticks. He said it wasn't bad, but the fish size was ridiculous and it was set next to a pile of homemade potato chips. We also ordered the Dubina nachos which is their house made potato chips, cheese sauce, bacon, onions, and buffalo sauce. Again, so-so. The chips were not bad, but I am certainly not jumping up and down with excitement. Will definitely go back for a pint with friends."}
{"text":"Yup. Yelp has it right. Good all-American burgers n sandwiches. Interesting (and good) Chardonay. We didn't order beer."}
{"text":"The Vanil Kova Porter is the best porter I've had since moving here from Chicago. And that includes Pusch Ridge Porter from AZ Wilderness Brewing."}
{"text":"Finally made it over to Dubina.  Been meaning to give it a try for years.
It is in the old Sky Box building in the corner of the plaza on NE Bell and 67th Ave.

They made pretty good use of the space.  There are a couple of leather chairs when you walk in and a homemade extra large jenga game set up.  There are several high top bars and one long high top table that can probably seat about 20 people.  They threw an epoxy on it and it is very inviting to sit and drink beer at with a large group of people.

We sat at the long table and the bartender came by quickly to welcome us and give us menus and quick run down of the happy hour.  I didn't catch her name but she was petite and had red hair.  Very friendly and helpful.

We ordered a couple flights and a pretzel.  The flights came out very quickly as did the pretzel.  

The first beer was a gose.  It was pretty good.  Tasted just like a gose should.  Light with a little bit of puckerness.  Easy to drink.  The next was the Bell Rd IPA.  I was not a fan of it.  The alcohol really came thru the profile with some grassiness.  The next was the pilsner.  I'm really not a fan of this style in general but it was probably as good as any for me.  Next was the blood orange IPA.  This beer was really good.  In fact we ordered a single of it after the flight.  Very well balanced, good aroma and hops, and very easy on the palate.  Ended with the blueberry wheat.  It was also pretty tasty.  Fruity and refreshing and easy to drink.

The pretzel was fresh and tasty.  The nacho sauce tasted like it came out of a jug from smart and final.

I would come back here again if I was in the area to see what else they have on rotation and due to the excellent service."}
{"text":"I tried 7 of the 8 beers on offer (the coffee stout was out).  Everything was correct.  The real standouts were the imperial IPA and the Gose, a wonderfully unique sour beer in the German style.  The wings were excellent.  Support this Arrowhead micro;  you won't be disappointed."}
{"text":"This review is for the beer only! Bell Road IPA is great. By far one of the top two local IPA's. The food looked good but we didn't eat. Maybe next time."}
{"text":"The Guns and Goses is a terrific sour ale. The Imperial Stout was rich and if you like pilsner you'll Grandpa's Pils. The burgers and homemade chips are delicious. This local micro brewery is worth the stop. Sunday is all day happy hour.  Check it out."}
{"text":"Great selection of beers, good food and solid service. The maple strong ale is excellent!"}
{"text":"Good beer, IPA is very good great Bartender, tried some wings but it was OK. Beer is very good"}
{"text":"Great folks,  great beer. What more could you ask for? They have a variety of brews,  but only their own. No commercial or even other local brews,  but trust that you will love them. The fries with extras are amazing,  too. You'd pay twice this for it for anywhere else and  it wouldn't be better."}
{"text":"Came with a Groupon. Glad we did! The flight was good and the food. Would have given 5 stars but I felt like the atmosphere was missing something. Maybe some music?"}
{"text":"This is a jewel that I might have overlooked because it is located where a couple of other places didn't succeed. If your view was tainted by anything you experienced over the past 30 years in this location, forget what you ever knew.

This is a brewing company, and the beer is great. So is the food, which runs to brats and burgers. But they are delicious, and the menu goes way beyond bar food. The large screen televisions make this spot ideal for watching the game and indulging other senses. It's open and roomy, so bring a crowd. The service is solid, so you will be taken care of.

I want to see this fine little local spot stick around. It's the kind of community gathering place that exists only in our memories."}
{"text":"Burgers  & Beers are great! If you go, ask for Amber. She's a fantastic server! If you get anyone else. Good luck! We waited over an hour before we got service."}
{"text":"Best brewery in NW Phoenix. Absolutely. If you like craft beer this place just rocks. Can't decide if the IPA or IPL is better. Both high end. Brats, wings, burgers I tried all excellent per price. Great staff, love this place. Growlers A1."}
{"text":"It's good to know that the east side of the Valley does not have a monopoly of good local breweries, and this spot in Glendale is evidence of that. As expected, it serves decent pub fare (I really liked their bratwurst and sauerkraut in a pretzel hot dog bun) and a good selection of locally brewed libations.  The service is very friendly and efficient and kids need not be left at home if you want to come here, as it's also a family friendly establishment."}
{"text":"Amazing service. Great beer, and the hop sauce wings are off the chart good! Highly recommend the IPA."}
{"text":"It's hard to determine whether this is a restaurant or a bar it seems more like a restaurant but the focal point is definitely on the micro brewed beers. We tried the sliders the bratwurst the wings the flight of beers and the pretzel and the pretzel was amazing the bratwurst was very good served on pretzel roll with spicy mustard and sauerkraut the flight of beers was good there's nothing wrong with it and we will definitely come back again. We loved the local aspect of using locally sourced ingredients and our favorite beer was the Bell Road IPA First Avenue."}
{"text":"I always enjoy going to Dubina Brewing Company.  The staff is friendly and well-informed about their beers.  The beers themselves are first rate and they always seem to have a guest beer or two on tap.  The food is good and seems to improve everytime I visit.  The kitchen has no problem making a substitution or with a special request."}
{"text":"The service and beer were above average.   The food was good....not great and the atmosphere was unimpressive.  If you're into craft beers, this is the place for you.  Overall...not a bad experience."}
{"text":"Wow, this place was a surprise. We had a groupon that expired today and debated going but I'm glad we did. It didn't look like much from the outside but it was wonderful. The beer flights came out fast along with a super friendly server who went over our selections in detail. I had the apple walnut salad with the homemade raspberry vinegarette, which was by far the best I've ever had. The wings were really great as well. The atmosphere was fun, people were playing some kind of jenga with giant blocks that eventually came crashing down, fun to watch. I'd go back in a heartbeat. Can't think of anything negative about the place."}
{"text":"I really love visiting the breweries. But it was not so easy to find brewing company around here. Dubina was close to our place so we decided to visit here. We ordered beer flight and pitcher of pilsner with pretzel. The food was great and beer was so nice! Also staff was so friendly."}
{"text":"A great deal of what Dubina brings to the table has great intentions, but so much of the execution is off the mark, its hard to find a lot of redeeming qualities to bring me back.  The west valley absolutely has the capacity for more great locally based microbreweries and Dubina conceptually should fill that need beautifully.  And its not just for the sake of good beer offerings, but this is the probably the only restaurant I've seen in the Phoenix metro advertising a Czech emphasis.  The small collective of brewers who opened this place did so thanks to the confidence of those who funded their Kickstarter campaign.  Perhaps overtime they'll be able to improve upon their business model, but thusfar there's a lot of improvement needed.

I came here with some co-workers and friends after work on a Tuesday.  The first thing that's off about this place is the location.  Its located in the back corner of strip center which happens to be tucked behind another strip center on 67th Ave just north of Bell.  It would be super easy to pass this place by as there's virtually no street visibility and even when you arrive the signage is tough to make out.  I can forgive such an inconvenience if the rest of the experience is decent.  When I walked in however, the interior was equally puzzling.  It's a fairly large, dimly lit, expansive space with seating for probably at least 50 people, but in a space that was probably meant for closer to 80.  There was maybe a half dozen people there when we showed up for happy hour around 5pm and didn't get any busier the rest of the time we were there.  It seems like the owners couldn't quite decide if they want this space to be a brewery, a sports bar or a sit down restaurant.  There's a way to balance each of these objectives, but the oddly positioned TVs, wide open spaces, and quiet vibe inside leaves one feeling a bit confused about what they're going for.

When we showed up they had 5 different brews of theirs available that day.  They had a pair of IPAs (a dark and a regular), a hefeweizen, a pale ale, and a brown ale.  They offered those individually or as a 5 beer flight (I got the flight).  In reading reader reviews, it seems like the soft pretzel and ultimate grilled cheese were favorite dishes of regulars so I went with those.  Total price for all of these items including tax, tip and a 10% happy hour discount on the flight and pretzel came to about $20.  

First off, the beers.  I'm not a huge IPA guy, but their regular IPA was pretty decent.  Not overly hoppy, but enough bitterness to remind you it was an IPA.  The dark IPA tasted much more like a stout than an IPA.  Not bad, just a little unexpected.  The Hefeweizen was pretty much like most hefeweizens I've had.  Good, but indistinguishable.  The pale ale was also somewhat average and I was actually a little disappointed in the texture of the brown ale.  I usually like ales, but this one just didn't agree with me.  On the food side, I know they're only now starting to expand their menu offerings, but I was very disappointed with what I got for the money I paid.  The soft pretzel was decent and the accompanying spicy cheese sauce was a nice touch, but honestly it was just a salty pretzel.  Not sure what folks were so excited about.  As for my main course, when you call something the ULTIMATE grilled cheese, you better mean it.  Sadly, I don't feel this lived up to the hype.  The three cheese blend was fairly tasty, but honestly I was hoping for a whole lot more cheese than I got.  

On the plus side, our waitress Sydney was friendly with us and for the most part was attentive to our table (save for a long wait for our bills).  I don't enjoy giving such negative reviews and generally look for the most redeeming features of any business I patronize.  But there was just too many red flags for me to overlook with this place.  I wish Dubina had chosen a smaller location with more street visibility as those two things would solve a couple of big problems aesthetically.  But in lieu of that, they really need to kick up their food menu a notch.  I get that not all of their favorite beers will be on rotation everyday, but the food menu should at least have enough great offerings that can draw folks on a regular basis.  And how about serving true Czech food?  I have no idea what that entails, but it would seem to follow the theme that helped launch their brewery in the first place.  I hope Dubina does improve overtime and eventually becomes the brewery the west valley wants (even needs).  But until some big changes come about, I won't be venturing here for awhile."}
{"text":"First off, the people that go to a brewery to try the beer so that they can tell everyone else what is wrong with it.....your lame. Nobody liked you to begin with. Stop trying to be cool by putting other peoples work down.

With that out of the way, the owners & employees that I have talked to at Dubina aren't pretentious beer snobs themselves, which makes this place cool right from the start. They make beer the way they want to. All of the beers that I have tried there, while some may not have been my style, have been good. The food menu isn't huge but has good bar/brewery food sourced locally. Who need 15 different kinds of burgers anyways. 

What I like best is that this place didn't open in a big, shiny, look at me fashion. They are not over extending themselves with fancy furniture, extravagant decorating, or a huge food menu, which makes them more likely to succeed as a family Mom & Pop type business. They are doing it as they go which to me is smart, and its getting better. Just yesterday I noticed that they had some new lighting which made it a little less bright and really added to the ambiance.  

I dig this place. Its laid back, friendly and they truly appreciate your business. They love to talk about their beers and brewing. Jan Dubina was even nice enough to let us host a soccer viewing party tomorrow for my AZ United soccer supporters group La Furia Roja. She's letting us hook up a laptop to her Big TV and stream the game. This is my local brewery hangout from now on."}
{"text":"I'm hesitating to give them a 5, but only because I want to keep this place to myself! The food is always a hit with me and my husband, and the beer is a MUST - my only disappointment is when they run out! The staff is so warm and friendly, truly happy to work there and share with customers the great selections they have to offer. I'll be there tomorrow, and looking forward to it!"}
{"text":"So many great selections. Awesome staff as well, cool man! We totally loved it. Close to home as well. Thanks!"}
{"text":"Nice clean place, great craft beers and a new expanded menu. Prices are also very reasonable for the area and the offerings. The staff have always been extremely friendly and attentive when we have visited. There is nothing else like it in the area and I am glad they are so close to home! I'm hopeful they will have some berry beers in the spring (hint, hint)."}
{"text":"We celebrated my 50th birthday with friends and family at Dubina Brewing Co. This place is a real gem. The family and staff was so accommodating and took great care of all of us. We did a tour and beer tasting which was fun for everyone that participated. Our friends and family that had never been are now big fans and plan on returning. Thank you Dubina for your hospitality and making my day extra special!"}
{"text":"Decided to give it a try and we were very dissatisfied with the beer and the food. The beer is below average and not even served in a cold glass. We even tried the beer sampler and we laughed at how awful the beer tasted. Four of us ordered food and the server brought one of our parties food and then went and took another tables order before bringing the rest of our order. We had to get up and ask for napkins also. The owners really need to work on improving this restaurant or they will be closed in a matter of months."}
{"text":"This place was amazing! The beers were delicious and the appetizers were so tasty. The best bruschetta I have ever tasted! We ended up ordering three rounds of it. Very clean and chill establishment."}
{"text":"We are always looking for new places to try and Dubina Brewing is worth visiting.  Their beers are outstanding.  I love IPAs and they have 3 that are among the best. The food (anything on a pretzel bun) is very good. The staff is very friendly and helpful if you have any questions or want to try a couple before ordering. We'll be making Dubina one of our regular stops."}
{"text":"Great atmosphere. Like hanging out at a friend's place, only with great chew & brew! We brought two growlers home."}
{"text":"I;m an EV gal so I was FINALLY on the W side today and stopped in!!!  Love, love, LOVE the digs!!  Spacious, not loud, a few tvs, and nice overhead tunes.  I like the use of small kegs with a piece of wood on the top, for coffee tables.  My server was very attentive, knowledgeable about the beers and friendly.  I had a pint of the Nitro Stout....a sample of Snoatmeal and the Quad Collaboration!  All....fantastic!!  I was one of the few in the taproom....so mid-pint a gal came around to ask how I was doing, how the beer was...  THEN...informed me she was Jan, one of the owners, they are a family run brewery.  Then....just kept on.  Very kind!!  I am bummed this is about a 90 mile RT stop but....when I head west Dubina will DEFINITELY be a stop!!!  Great beer!  Great people!! Great atmosphere!!  Thank you Dubina!!  **side note**I did enjoy the Dubina \"story\" on the menu!!"}
{"text":"This place is great! I hope they offer a discount on weight watchers because I'll be eating their Dubina fries as often as possible!!!! I love local craft brews and these guys are doing a good job."}
{"text":"The beers here are quite good, but I found them to be a little on the sweet side across the board. The bratwurst was fantastic, and I'd like to come back just for that."}
{"text":"Beer is fantastic. Service is horrible. In fact I haven't even eaten anything yet because I've been here an hour and haven't even received my food. Good place to grab a growler but unless you've got awhile don't stop to eat. Finally cancelled order at 1 hour 10 mins. They brought us a bill for the beer but just as we were going to pay they came out and comp'd it. That is the only reason I may actually try it again sometime."}
{"text":"I feel very mehhhh about this place. I've been dying to try it and it wasn't what I expected. 

Pros:
Very fresh burger, buns are excellent!
They made me Dubina fries which are no longer on the menu and those were spicy as hell...but really good!! I dig the beer cheese. 
Very friendly, helpful server
Good specials 

Cons:
When I walked in, my initial thought was whoa...this is kind of a dump. It could use a little sprucing up inside. 
Stick to the burgers as far as food goes. I had beef and bacon tacos which I would expect to be great. If there's bacon in it, how can it be bad right?! Wrong. They were very bland but I'm not a big baby so I just dumped hot sauce on them. Nothing a little Tapatio can't fix!
Beer selection is severely lacking. They only had 6 or so to choose from. We sampled almost all of them and I can honestly say I didn't like a single one. They were out of the one cider that they carry too so I went with a mixed drink.  
Menu is small and pretty basic. 

I didn't hate it, but I was disappointed enough that I most likely won't be back. I don't think we can be friends, Dubina. You're just not my type."}
{"text":"Location is a bit weird but I'd definitely recommend it.  It was a little awkward at first because we were 2 of the only 4 people there (Sunday afternoon) and the only table server was complaining a lot about schedules, etc. We sat at the bar, though, and the bartender was all-around sweet, nice, and nerdy, and because the beer was tasty, we ended up staying there while the bar filled up. That was a good move, because a busy brewery is a happy brewery.  We didn't eat much, just pretzels, but they were tasty enough. There are some big leather chairs to sit in and sip your beer, and I was tempted, but I think the bar is where it's at. A decent option if you want some locally brewed beer."}
{"text":"I liked this place. We thought it would be dark, but it is quite open and light. Very friendly staff and we enjoyed talking to the bartender, Dan, who was very knowledgeable. Then one downside was the beer selection. The Imperial IPA was our favorite, but it's not a traditional IPA. It's very citrusy without much hop bitterness. The stout was a bit watery. Just lacked body, and I would say the same about the Brown we tried. I hope this place makes it, but they need to keep working on their beers and maybe offer some quest taps as well."}
{"text":"If you're in the area, you gotta stop by Dubina Brewery ! They got good beers with amazing staff.

I ordered nachos but didn't know it had gorgonzola cheese on it... looked great, just not a fan of gorganzola.  BUT, staff overheard me saying I wasn't a fan of gorgonzola and brought me nachos with beer cheese !! How awesome."}
{"text":"Holy Crap! I'm literally high cause I ate so much. Perfect service, food and beer was exceptional, I have nothing bad to say about our visit. Not sure about the bad service comments listed? Sara, although running the 7+ people at the bar, was all over our table and deserved the 20%+ tip we left. We'll be back!!!"}
{"text":"What a wonderful surprise.  Jennifer and Amber were great hosts. Most of the beers were great. Loved the oatmeal stout. Best brats I ever had. The fries were great. A must do.  PS. Move that blockgame outside and sell growlers off ALL your beers"}
{"text":"I came for the soft opening so I added an extra star I normally wouldn't give. The beer was good but definitely unexpected flavors. I really wanted to like the imperial ipa but it was more citrus than I imagined. I liked the prices at $7 a piece though! Happy hour prices seem far as well! The food was just... Not great. The pretzel is pretty pricey for a small section and that is probably not 'beer' cheese, more like regular cheese? We also ordered the ultimate grill cheese and it could have been grilled for another two minutes or so. The decor is not modern in any way but we'll give that time!"}
{"text":"Located in a little bit of an obscure location, you're unlikely to just stumble upon Dubina. It only comes up on Yelp when searching for breweries. It's a shame, because it is a great pub serving awesome microbrews and some of the best pub fare in Glendale that many more should know about!

We went for lunch on a Saturday. I ordered the Flurry of Punches and my wife the Snoatmeal Stout. Both were delicious! I had the spicy Gorgonzola burger, my wife had the Hawaiian, my kids the cheddar cheeseburger and the cheesesteak. All burgers were served on fresh pretzel buns. Every single bite was delicious, and only a few fries were left behind.

The service was bit lacking, hence 4 instead of 5 stars. There was only one sever when we were there. She was awesome, except that she was tending the bar and serving all tables by herself."}
{"text":"Alley gives this place 4 paws up. Super friendly environment and plenty or kids because there was a party today.  She especially liked the large Jenga at the entrance.  She enjoyed a snack and the cool concrete floors.

The beer was really good. The blood orange IPA was great.  All of the beers with fruit flavors tasted good.  Possibly the best gose style beers in the valley.  The regular IPA was smooth with minimal if any back bite.  

The pretzel was good but there wasn't enough cheese.  This place was worth the drive so if you're in Phoenix drive to Peoria this place is worth it!!!"}
{"text":"Bell road ipa is a solid beer. Don't know what happened to the bratwurst but it was very tough on the outside and fries were a little stale. Would still go back because the people that work there are so nice. Maybe get some brats from Schreiners"}
{"text":"I have been here several times and have always had a great experience. The menu is not huge, but the food is fun and tasty. The beer is awesome, the list changes fairly regularly, and the get craft beers from other local Brewers as well. This is a terrific place to support the local small business:)"}
{"text":"Pretzel buns always sound awesome but are a huge let down  till I came here. Anything on a pretzel bun at dubina is awesome. Beer is good too and everything is afordable."}
{"text":"Food was good, atmosphere not that great. Went on a Saturday night and you could hear a pin drop it was so quiet. Kids enjoyed the giant Jenga but felt like they were scaring the crap out of people Everytime it fell because it was so quiet. Server was not very engaging at all with anyone at our table."}
{"text":"Two visits and both times the sever/bartender treated us like a burden and the service was slow as well.  Get some employees that want to be there and your sales will increase, but treat customers like a burden and they will go to Peoria Artisan or Rock Bottom or Richter Aleworks or maybe even Oggi's."}
{"text":"This place is amazing!!! I'm from California and I'll come here EVERY time I visit. Their beer is amazing their prices are incredible and their food is delicious! They are making a whole bunch of improvements and I can't wait!! Sara is the nicest most incredible bartender I have ever have! She makes you feel like you're drinking with a friend. Ten stars!!"}
{"text":"Let me start with this; the $25 Groupon is absolutely a waste of money. We went this weekend expecting something cool for $25. Turns out the tour and two flights you get don't actually cost $25 themselves. The flights are $7.50 a piece. To that point, on the tour, they kept talking about how great there blood orange beer was. But they didn't have any on tap and said they wouldn't for a while. They have five local beers on tap. Three sours, a pilsner, and a milk stout. The pilsner and milk stout were the best, but the bar was low. The sours were just about undrinkable. The tour was approximately 15 minutes and went into their kitchen and one other little nook with their tanks. The kitchen made me glad we didn't eat there. It was dirty and everything they were making seemed to come pre-made and they just reheated it. They made a big deal about how they \"listen to their customers which is why they make the blood orange beer.\" But, again, no blood orange beer to be found. It was a strange tour and not worth the time or money."}
{"text":"We were very excited for a local brewery but were totally disappointed in Dubina. The names and descriptions of their beer sounded great but when we got our drinks it was....not good. My \"candy cream ale\" lacked any sort of mature carbonation, zero head and my husband's beer tasted like dish soap. The regular hop flavor was lost behind a foul
bitterness that made it hard to drink. The atmosphere was bland. We won't be returning."}
{"text":"I've only been here about five times, but they've always delivered on great burgers and brews. You can even chat with the brewer and owners. Nice small family type atmosphere. Not a large menu, but they have what I want at a microbrewery - IPA & Burgers & fries. Being a small non-franchise brewery, you can get a variety of beers that will vary each time you are here. I've even had an India Pale Lager (IPL) hehe."}
{"text":"Major disappointment! I was really hoping have a nice local brewery close to me, but this one was just average. I was super excited about there Vanilla, which was just released, and it was a ok. The beer was average, but it was almost warm. It didn't taste as good as it could have because it was not cold. Nothing is as bad as a warm beer.

I also had the milk stout, and that was a huge let down. The bar tender was kind enough to give me a heads up that the batch did not even turn out the way they intended it to, but they still served it. It was not a true mile stout by any means. It was almost lite, and had no body.

I was let down but I also had high hopes. I think this place has potential and will grow, but based on what I got it was just average."}
{"text":"L OV E this place! Their home brewed beer is one of a kind. 
Definitely check out their taco Tuesday's - they do a new taco every Tuesday. 
The fresh made chips are great too."}
{"text":"Went in for the first time yesterday. The staff was extremely friend and knowledgable. Great low-key atmosphere. Looking to becoming a regular."}
{"text":"I hate to give this ranking, but I've been to many breweries and this one has the worst beer selections I've ever had. We tried multiple beers this day and they all were very bitter or sour. Usually I can choke down a beer when I don't like it, but these I could not. I also understand what beers I like and which ones I don't care for, so I know what to order. Will not be coming here again."}
{"text":"I like this place.  All of the employees are friendly and attentive.  The bar tenders are very knowledgeable about beer in general and they really know the beers they brew.  It's a cool family owned atmosphere and I love seeing small businesses succeed.

I have tried many of their brews and they are all quality.  I like some better than others but thats just a matter of taste. They have a great selection of beer and I feel it's a selection that spans a wide variety.  

If I had one criticism it would be that the food isn't quite on point.  Since I have only ordered from the appetizer menu I will make a point of ordering a sandwich or something next time.  Of all the appetizers I tried the pretzel is the best.  

I will definately be back and I would recommend this place to anyone wanting a fun small brewery experience."}
{"text":"It's a decent place, has a way to go as far as the quality of beer. Food is actually better than the beer,  believe it or not. People working there are nice so I can't bash the place too much. The beer just left me with a big \"meh\""}
{"text":"Modern micro breweries are so different from each other they are hard to form a generalized mental image of. Everything from just a handful of taps with a chalkboard listing to full on restaurant. Some with no food, some that serve something to eat as an afterthought, some that try but just don't have it down yet in the food department and some that could survive with the food and bottled beer. This place to me would be the latter but I am glad the also have the good beer. Mind you, I wasn't here when they were first getting the food idea going. My mental image of the place is the company picnic. There was a group of families with young kids in one area. Mom's were watching over their kids playing Jenga in another place, then there was a quiet group of 4 spot tables that mostly kept to themselves and then there was our group for a graduation party at a community high top that made mingling very comfortable. Oh, and they had a bar too. The only thing missing were the horse shoe pits. I had a couple of glasses of Pilsner which, to me, tasted true to it's origins. I wasn't feeling a burger and fries so I got the grilled cheese sandwich with a salad. Very good! I've heard the service isn't always good but that evening we had great service and when it came time for the party cake they brought out plates and forks and a cutting/serving tool for us. Definitely a place the West side is lucky to have."}
{"text":"I think they need a few more production runs to work the kinks out of their process. They have pretty cool ideas that tend to be executed poorly. Some of the worst beers I've ever had were at dubina. I'm not sure why they are willing to ruin their reputation by selling beers that came out horrible. A barleywine with 1.050+FG is disgusting. 

The only reason they're getting 2 stars is because it is nice to have a microbrewery presence in glendale."}
{"text":"I am the first to admit that rating beers is entirely subjective but our recent and first visit left me questioning whether I was just being picky.
My husband and i were in town for the night and were excited about trying out a new brewery. Based on the Yelp reviews we decided on Dubina since it was the closest to our hotel. 1st impression wasn't all that great but I don't tend to judge a place just by first looks.
This rating and review is both on their beer and atmosphere. I ordered the kolsch and my husband ordered the blood orange IPA. I didn't enjoy it, same goes for my husband. I prefer light beers but this beer tasted very closely to a watered down Stella Artois. The place could use a little bit of a spruce up. The customer sitting area was packed  with plastic wrapped kegs and cardboard boxed cans. I don't know, this brewery didn't tickle our palettes.

We had 1 pint and headed over to Richter Ale Works. 
I am tempted to rate it 1 star but I just can't. Maybe we went on an off day/keg."}
{"text":"This place is fairly new, I guess about a year I think. They are getting better with each round of beer and food. I'm a big fan of Sahti brew and the Hibiscus and I think soon the maple will be back. They have changed the food menu and they continue to get better at each step. I personally think its a great place with great help (Allie and Elizabeth), owners when available spend time talking and just working the crowds. Great beer, great atmosphere and great staff = enjoyable experience."}
{"text":"A nice relaxing spot for a beer and some good food. Service was fast and friendly and food was very good. Dubina fries and the Hawaiian Burger were both awesome. Will definitely be back soon!"}
{"text":"I have to knock it down to 4 stars but bump it up to 5 because it's still unlike anything else nearby and it reminds me of drinking at the VFW/American Legion.

If they manage to get the service issues handled time to look out for a bigger spot to expand into because at that point...their skills will be complete. Sometimes, service is slow, plates and glasses sit on the table way too long for my comfort level and there's not a lot of friendliness. No one is salty or rude, just a couple \"not really warm\" servers in rotation. Let's make N. Glendale fun, y'all! Be welcoming n shit! For now, the beers and the food and atmosphere make up for it as far as I'm concerned.

I'd drink their Sahti and Dubina Ale all day. The Blood Orange (when it comes back) is crazy good and the sour beers remind me of drinking kombucha instead of beer (I'm one of those freaks who loves kombucha). Recently they've had a blueberry and a pomegranate sour on tap. Try a flight if you're unsure. 

The wings w hop sauce are my favorite wings in AZ. Thinking about them right now makes me crave those delicious chicken appendages and their tangy, slightly hot sauce. Their burgers and brats are pretty good, and they come served with ample crispy fries. I'd still have to recommend getting it started with a pretzel appetizer, however, I opt for the spicy mustard in lieu of the cheese. My personal preference, but your mileage may vary.

Dubina is great for getting a large group together and playing Cards Against Humanity or Jenga or to catch a Dbax or a soccer game on one of the TVs. Everything on the menu is $11 or cheaper and they don't mind splitting your bill.

Closed Mondays because it's still a family business. Come out and support a local business the next time you want a beer or a glass of wine!"}
{"text":"Local in house brewed burs.good morning Glendale coffee stoot an the beans are from cartel coffee"}
{"text":"My wife, brother and sister in law went last night to the soft opening. We all were very impressed with everything. The service was very fast and the brews were great! We started out with a flight just to have a sample of everything. I was very happy to see that they portions poured were pretty big, but also the price was awesome. Most places will charge you double for less beer. I loved the Milk Stout and it was delicious! My sister in law loved the Dubina Ale. We didn't have a chance to try the found but it looked good. The staff was super great. I wasn't expecting the service to be that quick. Usually openings stumble and they didn't seem to have any issues. We will definitely be going back. Especially once the Vanilla Porter is finished! I am also looking forward to picking up a few glasses once they are in stock as well as some t shirts."}
{"text":"We ate there yesterday and really enjoyed the food and beers.  I ordered a make your own veggie burger with pub cheese, celery, lettuce onion pickles and tomatoes and it was fantastic!!  My boyfriend had some sort of meat sandwich and loved it too.  The beers are delicious as well, the bell road orange IPA was super fresh as well as the extra dry IPA.  I had a flight and liked them all.  The service is good, and it's a friendly atmosphere."}
{"text":"Great beer and great people hear. The brats are awesome. Just a great spot to spend a hot afternoon or evening."}
{"text":"Currently my favorite place out in Glendale! Absolutely worth checking out."}
{"text":"In town from CA for a Cardinals game, we were looking to try the local brewery scene.  Dubina has the bonus of food and their beers were pretty good.  The place was empty on a Saturday night which seemed a little ominous but the staff seemed happy to be able to clean up early.  The kolch was yummy and brought a can home which was really good three weeks later.  Dubina was a \"safe\" brewery...nothing spectacular but nothing horrendous either."}
{"text":"Awesome food and awesome beer at a great price! Sara is the best!! :)"}
{"text":"Great service, unbelievable food, very friendly, will definitely be a regular now!!!!!"}
{"text":"Great beer and food. Both IPAs on tap are very well balanced and their food is very tasty!!"}
{"text":"first time in and I loved every single one of their beers. there burger sliders and fried pickles were also amazing, we will definitely be back on a regular basis now that we live in the area."}
{"text":"Really lucky to have this place in the Arrowhead area. It started out a little slow with a limited menu and decent but not spectacular beer, but this place has REALLY taken off in the last few months due to an expanded and improved food menu and the hiring of a head brewer. Seriously, if you love beer do yourself a favor and get a flight at Dubina. It's not well-known now but it will be. Waaay better than the other local micro-beer joints in the area!"}
{"text":"We visited when this place was less than a week open and I have a feeling they will just get better. 

The first thing I noticed was how welcoming the staff was. We had dropped by to try a growler (got the Kolsh) thinking they would not have a food menu. We saw they had a food menu (two kinds of grilled cheese and a beer soaked brat). We decided to return for dinner. 

We came back that might and the place was nealy full. The dining room / bar had been bright during the day and was well lit that evening.  There was a giant ginga game int the front that a couple of friends were playing (and our server warned us it would be loud when the blocks came down). The staff was as friendly for dinner as they had been when we dropped by to get a growler. 

Despite Short Leash Dogs food truck in the back, I ordered their brat on a pretzel roll and my wife ordered a grilled cheese sandwich. I also ordered a flight of their beers which came very quickly. 

All the beers were good bordering on excellent. I liked the Kolsh the best despite being a hop head and ipa fan. The imperial ipa had 120-something IBUs but still tasted a little sweet or malty. Everything else was true to style and tasty. 

The brat on a pretzel roll came with kraut, onions, peppers, and spicy mustard. The brat and toppings were delicious but overpowered by the pretzel roll and would have been much better on flat bread. (The pretzel roll was listed as fresh baked which I'm sure was true, just not at the brewery). My wife's grilled cheese was savory and buttery on sourdough. Either the brat or the sandwich would have paired well with any of the beers. 

This place is really young but also super friendly. If I could give half stars they would be 3.5 but I'm giving them four because I really want this mom and pop craft beer (or son and mom) place to take off. They are good but they will be great!"}
{"text":"Their beer surpassed expectations. From their IPA to their Oatmeal Stout and specialty Ale, all where great brews!

Fall Maple ale/9.5%-smells like maple syrup

Oatmeal Stout/8.4%-Stout brewed with Flagstaff, AZ snow with raisins and maple.

Ye Old Smokey/5.25%- oak smoked wheat

Bell Road IPA/6.7%- Citra, Simcoe, cascade and Amarillo hops"}
{"text":"This place was fantastic. The bartender was so friendly and informative. Their assortment of sours was also absolutely delicious (we ended up taking a few cans home.) We felt welcomed the instant we stepped foot inside. Definitely will be coming back next time I'm in town."}
{"text":"A hidden gem of a craft brewery. Small selection of craft beers with a quality taste. The chicken wings were tasty. There are a few TVs with sports games playing. The place is clean and roomy.  There is a mixture of tables and bar top seating. The service of our bartender Amber was \"phenomenal\"."}
{"text":"BEST PRETZEL BUNS EVER!!! I should end my review right there. Seriously these are amazing locally crafted and brought in daily baked masterpieces!  Unlikely 99.99% of pretzel buns these are not dense at all! Very fluffy actually and with the perfect outer texture.

On my first visit I got the sliders. You get 3 and it's plenty of food if you're not super hungry.  You might get a little more bun than ordering a full size burger...  On my subsequent visits I keet getting the same thing. BBQ bacon burger with fries. The meal comes with chips but you can upgrade to fries for a nominal cost. The buns, oh those pretzel buns...OK I suppose we can talk about the rest of the food here...

The beef is very flavorful and the fries are the thin but not too thin shoestring variety. Perfect match for a burger.  Dubina is a serious burger joint and you'd never know that driving past this place...how many times did you drive past the restaurant and never even noticed it was here? They should have a kid standing on 67 th ave with a burger costume like on the TV show Bob's burgers! 

Lastly the beer! Can't come here without trying their homemade suds. This place is one of those restaurants that makes their own beer on sight. My favorite is the Russian stout. It's their strongest (% alcohol) of all their beers right now. One and you definitely feel it not to mention the amazing flavor!  Delicious!  Selections change with the beer so there's usually something new to try. 

Enjoy! 

***be sure to check hours before going, no weekday lunch hours & closed Mondays***"}
{"text":"None of the beers are session / lighter end of the spectrum (under 5%). Far too heavy to accompany a meal and not great for much else either unless you're intent on getting plastered after a couple of rounds. Strange."}
{"text":"Awesome beer and service. Best IPA I've had through my travels-arrowhead. Not to hoppy and still potent. Haven't had the food. Only gave 4 stars because the ambience is lacking, could use a more youthful appeal and better decor. Great prices and good tasting beer. Needs to replace their growlers, bummed we couldn't leave with the arrowhead in hand :("}
{"text":"We had ordered from here through Uber Eats last week and it was pretty good. So, we drove down to check it out in person. We ordered a pretzel with beer cheese, the Dubina nachos and a hefeweizen to start. The pretzel and cheese was delicious, the nachos were amazing..but the beer was terrible. Didn't taste like a Hefeweizen at all.
The service was pretty terrible and non-existent. So, we loved the food but will just order from Uber again."}
{"text":"Love this spot! Great beer, never too crowded and good food! Not to mention the low prices"}
{"text":"If you are looking for a relaxing atmosphere (no blaring loud music, then you)where you can have a few pints and good conversation, this is the place! Bratwurst and Brussels sprouts was delicious! Definitely recommend"}
{"text":"I'm an avid beer drinker and spend most of my travels scoping out new beers and breweries. I chose this brewery based on yep reviews. The initial observation of this place is that it looks like some 70s bar that hasn't been touched since the 70s. The aesthetics needs some work, or bar rescue. We tried multiple beers and didn't enjoy any of them- which is a first.  I keep reading about these burgers and pretzel buns but the menu we had was small, had only deep fried appetizers and a variety of brats. Overall not impressed and will not be returning"}
{"text":"I had a beer flight and remember all the beers, minus the blood orange one, were good.
I was most impressed with the coffee inspired brown ale, it the best brown ale from any local brewery I've had. In fact I can't really remember a brown ale I liked as much as this one. Definitely worth a visit if you love beer and better than most breweries in this neck of the woods."}
{"text":"Wow... Jared, thanks!! What a great tour, tasting and yummy beers. So glad you are with a distributor and your beers are available around the valley! Dubina has really joined the ranks!"}
{"text":"Ok I'm. Ow finally giving Dubina a 5 star rating. I k ow I've had them as a 2 the. 3 but I've been there a few times more and they fully earn a sold 5. What changed my mind was when the owner, Jan Dubina, sat down next to me and started talking. She is a great person and has is retired from a career in LE. The beer has been getting better and they are starting to can their beer. Just an overall positive environment for beer and beer lovers!"}
{"text":"I didn't know about this place till now. Regardless of some of the reviews Yelp helped me find a local brewery that wasn't miles away! An my first hand experience was great! The burgers were good and same with the beer! However I was a little upset that their blood beer wasn't available. But the lady tending the bar explained that it's the top seller! So coincidentally I'll probably be back to give it a try! PS I wish they'd make a stronger sour!"}
{"text":"Great beer and food! Come here for a great IPA and good service. Giant Jenga is a blast!"}
{"text":"We came in a few weeks ago for trivia night. It was so much fun and the guy leading it was awesome! 

While I am not a big beer drinker, I am glad they have a few wine options. We started with the Dubina nachos, which were good and loaded with bacon and cheese. For dinner, I ordered a plain ol' cheeseburger with a side salad. The burger was delicious!

I would love to come back for trivia again and to try one of the brats."}
{"text":"Great brewery! Didn't make it for the food, but the beer was awesome! Had the pils and scotch ale, both were very tasty! Highly recommended!"}
{"text":"This place is pretty new to the craft brew scene.  They have awesome pretzels and the food is alright. The beer is mediocre at best. The only beer they had this I liked was the red ale. The brown ale wasn't bad either. All the rest just seemed like the recipes weren't well thought out or clones of originals. The place was clean, the staff was friendly, and the setting wasn't bad. Just not a 4 star, but close. It's worth going to try something new."}
{"text":"My wife and I decided to go to Dubina Brewing last night for our anniversary. I'm a big fan of good beer and we had never tried this place. The reviews looked promising, however the experience was one of the worst I've ever had. When we arrived we sat at the bar and brought our Groupon out.  After learning the available beers, we got our flights and then the bartender vanished for over 20 minutes. 

We ordered some food. The pretzel came out fairly quickly, however the bratwurst never made it. At times, we looked around the dinning room floor in hopes of finding our server and did not see a single staff member anywhere. At other times the bartender walked right by us without even a glance our way. 

After 50 minutes we left without our food to find another place to eat dinner. 

The only good thing I can say about this place is that the pretzels where ok. 

Obviously, we will never be going back to this establishment again."}
{"text":"Nice place, if a bit uncomfortable, the food was pretty good. Will go back for a tour at some time. The Blood Orange IPA is very moorish. Cheers"}
{"text":"Ah Dubina! Where the journey began, we ventured in with a couple of friends. We weren't sure what to expect and walked in to a large space. There was jenga available but we chose not to play on the trip, we probably had a deck of cards or monopoly deal. We ordered flights which were interesting. This is not the place for you if you are a strict tradionalist when it comes to beer. Then again craft probably isn't your thing if you're a tradionalist.... Every offering was not only unique but surprisingly accurate being dark enough to appear almost as a dive bar the expectations weren't high. We were surprised though by the quality of what we recieved. I wouldn't recommend the sours but I personally say that of all sours in general."}
{"text":"Let's start with the service. Everyone we spoke to and all the several around out were super nice! Great customer service! 

Good not so good. I've had bar food many times but this time I rate the a 2 out of 5.  Ordered the burger sliders. Meats was red and the bread was your below average. No toppings or sauce. Nothing to run and tell everyone about.  Chicken wings were again slightly under cooked.  And the taste were not the greatest to brag about.  

Beer was okay different strokes for different folks. Would I return again not really but the service was great."}
{"text":"I bought a Groupon for a brewery tour and flights for two.  My husband made the appointment for the tour, Sunday at 2 pm, which was also listed on their website as a tour time.  We arrived at 1:30, thinking we would have a pint first.  There were two people working, one behind the bar and one working the floor.  There was no music on.  The customers seemed \"local\".  The bartender brought us menus and then was off to fix a bloody mary, which took a long time to make.  She had to retrieve a huge jar of olives from the pantry, put the olives in the drink and then returned this-now-opened jar of olives to a dry, uncooled, pantry.  I'm pretty sure those should be refrigerated after opening but I'll stick to my business...it took us over 8 minutes to get a drink.  We advised we were here for a tour.  She seemed surprised and said that no one was here to give us a tour.  She asked if we had scheduled it.  We had.  She asked who we spoke with.  We did not know.  She asked if it was male or female and what time of day we had made the appt.  A LOT of questions.  Then she advised that maybe the owner's father was coming in that he could give us the tour.  We were not sure if we were getting a tour or not at this point, so we ordered food.  The owner's father did show up and approach us at the bar.  He was hard to understand and vague; I'm pretty sure he was intoxicated.  He seemed to dissuade us from the tour, which at this point was not hard to do.  The food was good.  Sunday is all day happy hour with $3 apps.  I had bruschetta and caprese salad.  They were both fresh and tasty.  My husband had a brat and fried pickles; he said they were the best fried pickles he'd ever had.  I didn't even know that was a thing.  I hoped these pickles had been in the fridge unless the jar was just opened.  The Beer was AWESOME, which is the point, right?!  So I would go back for the beer except that, because of the weird service, I won't go out of my way to return.  I feel duped out of a tour that I don't think they wanted to give."}
{"text":"Family owned, great atmosphere, excellent food, and exceptional craft brews. I come here often and have never had a single bad experience. They also host work parties, retirement parties, etc. with a reservation and are very accommodating. Very Police/Military friendly establishment. 

Their wings are EXCELLENT.

The blood orange IPA is EXCELLENT.

All of their seasonal craft beers are amazing as well. Most of them are small batch so you gotta get them while the getting is good."}
{"text":"Great food, beer and service! Stopped by after a long day. Great atmosphere! Plenty of tables. Will definitely be here again! Had the Pumpkin Pie Ale and Good Morning Glendale Coffee Stout. The pumpkin beer is one the best I ever had. Not much pumpkin but the spices (cinnamon, nutmeg, etc).  The coffee stout is based from Cartel Coffee here in town. Both are definitely worth a try!"}
{"text":"This review is brought to you by Andrew C's Brews Cruise UYE! Don't hesitate to join up once a month in some day drinking with your fellow yelpers. 

Anyway, Dubina is a pretty gosh darn good brewery that I'm elated to have in Glendale. Bell Road is absolutely full of drinking and dining options, so if a local business can last this long, that should be your first sign it's legit. 

The beer is good, and of course this is what matters most. The IPA packed many hops, but not *too* many. It was floral as well. The pilsner didn't quite have that 'bite' to it--the carbonation on it and all their beers is very fine--but I enjoyed the relatively mild taste. They make great sours as well, with some refreshing fruit flavors. I feel their beers are above average, and they deserve much praise for creating a foundation of conventional, go-to brews that can please anyone. 

Not to say everything they have is ordinary. There was a smoky, savory beer on the menu. I did not try it, as I don't care for those, but rumor on the block is that it tastes like a smoked sausage. Strange, but commendable. If you're feeling brave, it's not like you'll be blowing a lot of money trying new things. The pints I had were five bucks each, which is certainly less than what you'll usually encounter at similar establishments. 

Another cool thing here is a modest food menu of wings, brats, and burgers. These weren't extraordinary, as they are obviously mass-produced, store-bought ingredients. But that doesn't mean they aren't decent. The burgers are large and kinda tasty. Fries are loaded with garlic salt and will leave you thirsty. Do try their hop sauce as well. It's all rather inexpensive as well. 

Overall, I find Dubina to be a pretty cool destination I wouldn't hesitate to recommend. That being said, it is unusually rough around the edges for a place that's been open for about 2 years. It looks brand new. Decoration is sloppy and incomplete. Menu could probably use some more signature items than just slathering ordinary food in their very own sauce. I hope that in the future, this place finds the inspiration to achieve its full potential. I will see what the future holds as I periodically cheers to good beer and a great staff."}
{"text":"Great beer, great service!! Elizabeth, a bartender, is super friendly and very attentive. I'll definitely return next time I'm on the west side!"}
{"text":"Been waiting months for this brewery to open. Very friendly atmosphere, attentive staff and most importantly,  beer with great promise. 
While the food menu is a little scarce, they welcome you to order pizza or anything else and have it delivered. They also have food trucks come by on selected days which is great. 
I only wish they offered wine or allowed byob. It's difficult to talk my wife into stopping  in for a pint or two afterwork when there is no vino for her to partake in! Happy wife, happy life."}
{"text":"Typical Phoenix strip mall location.  Have to love it when a plan comes together-NOT. I had read that this place was going to offer Czech style lagers and Czech cuisine, sorry but milk stouts and candy cream ales are not Czech and neither are grilled cheese sandwiches.  The beer really is just like typical homebrew and is certainly not up to commercial standards. Come here with your expectations set low and you'll be ok but dont expect a real brewpub."}
{"text":"Tried Dubina on a brief tour of North West Phoenix last weekend and it was promising.  Little bare bones on the inside but friendly staff.  They advertise czech style beers but I wasn't precisely sure what was czech about them - tried the pils (ok i guess czech) and the hefe.  The pils was fine but I found the hefe fairly watery.  Tried a sauerkraut brat which was good if a little dry.  However particularly in this corner of chain restaurant/bar land it is a welcome alternative and nice to see that nano-breweries are popping up in the most unexpected of places"}
{"text":"Pros: 
Great staff that's friendly and knowledgeable
Beer is very nice and has a different taste than some other local brews. Tried the hefe, the wheat and the very tasty candy cream ale.
Nice to have decently priced food. Most of the menu was under $8. 
Inside is very clean and welcoming. For a brew pub, it is large enough to come in and stay and watch a game.

Cons:
It's kind of hard to find tucked into an unattractive strip mall.
Outside is kind of scary and looks like an old dive bar.
Parking might be hard on a busy night (I went during the day)

Overall, I was impressed and will return. Compared to other local breweries, this place is clean, welcoming, doesn't stink of stale beer and provides a MUCH NEEDED injection of good local run business into the Arrowhead area."}
{"text":"10/10/17: came in for taco Tuesday with the wife. They have a couple of dark beers we like still on tap and the tacos looked decent. 

terrible service as always. Only 4 tables occupied.  We were the 4th table. Tacos came out cold. Tortillas were like cardboard. How do you mess up heating up a tortilla?  The meat was decent and the salsa helped washed down the dryness of the tortilla. Overall...taco Tuesday was a bust here. $2 is a great price for the tacos but I rather pay$3-$4 for something that would have me begging for more. 

My wife would rather not even come to this place anymore.  I still enjoy the beers, but it's getting harder to convince her with the consistent let down of service and food."}
{"text":"15% off appetizers during Happy Hour? Is this for real? Do people people actually come running to get .90 off an order of wings? Clearly ownership has no clue or is playing some ironic joke."}
{"text":"This is my first time here after the soft opening. Still here, first beer was the Hefe. Absolutely delicious with a very strong banana flavor. Might be my favorite Hefe I've had. Now I'm currently sipping down the Dubina Ale. This is also a fantastic brew. Very good flavor that goes down easy. I can feel the buzz creeping up and I am very happy about this place. As it gets more established I could see this being my favorite brewery in Phoenix. Keep up the good work! 

Only reason I didn't go five is because I'd like a couple more kitchen options. But hey!! They are brand new."}
{"text":"Took a tour of the brewery for my birthday. My 3 buds and i had flights afterwards. The serve very tasty beers and simple bar food. Nothing pretentious about this place. Great spot to stop for lunch on a weekend."}
{"text":"The Gorgonzola burger was good . The Brat was kinda greasy. The garlic fries were lame . Just poured  minced garlic you can get from Costco on top . The regular fries better. Service was good beer was limited options but good.  I would prob drive farther for more options on beer and food. The ambiance was like a hole in the wall pub but if you make it up in the beer and food that is ok, but neither impressed . Was moving out here soon so we were checking the local brew pubs and local shops. It was just ok for me."}
{"text":"After several weeks of wanting to try out Dubina, I finally met up with a friend here on a Friday evening. We both wanted to sample the beers, so we ordered the flight. 
Three out of the five were IPAs (not my favorite, but I wanted to be open minded and give them a try), the other two samples were Heffs. Keep in mind that I am by no means an expert in beer, but the whole flight was not very good overall, too bitter in my opinion, and the 'carrot cake' Heff tasted very basic without a hint of the carrot cake that I was expecting. 
The atmosphere inside the brewery was lacking, just a large open room with tables and chairs, a bar area, and some booths off to the side. Nothing special. 
Especially on a Friday evening, some live, or even livelier music on the radio, would have added a little something more to the bleak atmosphere. 
The food smelled good (although we didn't order any).
I'm glad I got to try this place out, but wouldn't go back."}
{"text":"My class bought me a Groupon for this place so I decided to make the drive from central Phoenix down. Loved the decor and the beers. We had a few flights of beer as a group and loved every beer we tried. I personally love sour beers so the fact that they had 2 sours and a gose made me very happy. Out of the 2 sours I loved the mango best, but the hibiscus was still tasty. I just prefer extra tart and the mango delivered. We tried the fried pickles which were good and didn't have too much breading. Our server was great! I'll definitely be back with some friends."}
{"text":"I came here on a whim with some friends and was pleasantly surprised! I wasn't very hungry so I shared a plate of sliders and the Dubina fries. The sliders were tasty but the fries. The fries! They were so good and I am still thinking about how good they were. The service here was amazing! Our waitress always made sure our waters were full and one of the the owners was walking around checking up on tables. Overall great experience. I'd definitely come back!"}
{"text":"Dubina has come a long way since the beginning, in beer quality, food & ambiance. Please do a couple things.. Have your blood orange bell road IPA as a standard beer. It is my all time favorite beer! Also, please offer more food specials during Happy Hour. We can get 10 awesome wings & many other appetizers for half price at Mellow Mushroom, along with 20 oz beers for $3.75. I want to support the smaller local guys but you must have some good deals!"}
{"text":"Husband was very disappointed, we came to check out a few breweries in the area for a even and definitely this place will be scratched off the list. Hair was embedded in the burger very disgusting. Cook/chef has long hair and the waitress was very apologetic and embarrassed."}
{"text":"Ownership has changed, but the staff and the quality are still top notch.  Looking forward to improvements on top of the current quality."}
{"text":"Best fish-n-chips that I've ever had... anywhere! And I absolutely love the Maple Ale! Try the fried pickles! They're phenomenal!"}
{"text":"Eh....not too impressed.  We needed somewhere to go after the Padre game, so we looked up breweries/brew pubs on Yelp, and this place popped up.  It was pretty close to the Peoria stadium, so we headed on over.  We walked in, grabbed a table, and placed our order.  Me and my buddy went with a small garlic fries, and he ordered a flight of beers.  Here is how they were.........

Garlic Fries-  Meh.  The fries themselves were good, but then the garlic they use was bad.  It was cold, and tasted very \"wet\" and \"vinegary\".  It just wasn't good at all.  We had to pick around all the garlic to enjoy the fries.

Beer Flight-  My buddy ordered 5 beers.  He only liked one of them.  He flat out couldn't drink one of them, and had to choke down 3 of the other 4.  They had a \"smokey\" type beer that was absolutely horrid.  I took a swig and almost instantly spit it up. It tasted like drinking a beer with a cigar ash in it.  It was disgusting! I don't know how they could serve that and who in their right mind would enjoy that.  They also had a maple type beer.  Tasted like maple syrup which was very weird.  My buddy said it wasn't the worst brewery he has been to, but it was up there. 

Service was friendly, and the owner came around and introduced herself and welcomed us etc.  That was a nice touch.  Sadly though, the fries and beer were sub par so I would probably never come back.  I do hope they succeed though...its family run and owned and the place was pretty full while we were there.  Someone must like it, right?  Sadly, it just wasn't us :-("}
{"text":"Came here for the beer. Had myself a grilled cheese. Left happy. I tried the Ale and the Milk Stout. The milk stout is exquisite! Creamy delicious but not too thick and has good malty notes on the tongue. I will definitely be coming back."}
{"text":"Dubina's brewery is amazing!  Their beers are all made here and are very delicious!   The menu has a good variety of items! Try their pretzels, amazing appetizer (the dough for them is from a local place)  atmosphere is a nice restaurant /bar feel to it. The service is very good and very friendly!  Also don't forget to check out their happy hour $1.00 off beer flights!!   Check out Dubina's!"}
{"text":"The beer here is not just pretty good, it's awesome.  As a beer snob, I usually hit up the stores looking for something new and interesting.  The beer at Dubina has never disappointed.  The menu is sparse, but the staff is always prompt and polite.  I wish they had more choices for beers, I've been in when there's only 5-6 choices, but I'd rather have 5-6 great beers and 10, with half subpar.  I'll be back for sure."}
{"text":"Was there for happy hour on 5/8. Great selection of beer, great service, and the food was GOOD. Our table had the nachos, brussels sprouts and fried pickles for appetizers.. which we all enjoyed. Yum! The group had tacos for taco Tuesday, which they wolfed down, and I had their burger. BEST pretzel bun I've ever had...great burger, period!! I had the blood orange IPA which was just ok, only because it reminded me of a grapefruit which I'm not a big fan of, but the others beers were good! (I tasted others at the table) *The place almost seems like they are in the middle of a move. Appears messy...maybe the look they are going for?? I don't know, but I was headed out when I noticed, so they'll get a pass as I'm not still there to obsess about it. I'll be back!!"}
{"text":"Just used a groupon for date night and man are we going back! Service was outstanding. Food was amazing and drinks were sooooooo good! Highly recommend the brauts and the beer flight!"}
{"text":"We came here on a Sunday and it was a bit slow, but this place has a lot of potential to be really fun.  I tried all 6 beers they had and my favorites were the Pumpkin and the Maple ones.  I'm sure they rotate stuff seasonally so not sure how long those will be here.  We also tried a soft pretzel with cheese.  It was really good- buttery with just enough salt and the cheese sauce really made it perfect.  The building this place is in is a dumpy strip mall, but the inside of the brewery is huge.  It might be even too big, but maybe that's just because we were there on a Sunday.  Customers and staff were very friendly and we made small talk with everyone.  They said they will be adding to their food menu since they only have a few items right now.  They also said they were going to get some acoustic musicians come and play so I'm excited to come back for that.  Go check this place out and support local business!"}
{"text":"Who would've thought that a little brewery in BFE would have tasty beer? Not me..... as we pulled up to Dubina I was dubious to say the least (see what I did there....ha!). It looks like a crappy Irish pub from the outside. The inside decor isn't much better. But..... the beer was good! I had a flight and really enjoyed their goses. The husband enjoyed their IPA. The prices were reasonable. I would definitely recommend!"}
{"text":"I want to start on a positive note, the server was friendly and our pretzel was tasty! The beer on the other hand was bla:/ The mister D stout and the vanilla porter were good... The other beers unfortunately were very bad. I would recommend this place to people who like basic beers like bud/colors but want to be hipsters and say they went to a brewery. Maybe I'm just use to stronger, tasteful beers and these were just too plain for me and other people will love them? Another negative about this place is the location, it looked like an old Chinese food place went out of business and they took it over. The worst part was it smelled like a bowling alley again, maybe that is just something that would bother me. I would recommend checking out wilderness brewery or O.H.S.O those will definitely not disappoint."}
{"text":"So, I went to Dubina a couple times a year ago when they first opened and noted the fact that they were just starting out and that their beer needed to be improved as they went along. Happy to report that they've done that and the beer is now much improved. 

Due to a power outage a few weeks ago, as the bartender explained, there were only a few beers on tap. They unfortunately had to dump several batches due to the outage - sucks and hopefully they can recoup that in no time. The beers I tried were all solid and true to style. I had the IPA, the Hefe, the Black IPA and the Gratzie. Now that last one isn't really for me (HATE smoked beers) but my friend was able to polish that off for me and enjoyed it a lot. The staff was super nice, even giving us a little tour of the setup. Very unique and creative setup for the space since there is a combo system and the obstacles such as ceiling tiles and not having high ceilings throughout to combat there.

I'd come back, maybe even try some food next time - so the review is just beer/service for now. More to come."}
{"text":"This place had a few great Groupon deals. Three flights of beer and 3 different types of brat. The bacon  brat and the tomato basil were the best! They come out on a huge pretzel role , load on the toppings, and surrounded by tons of yummy fries. I also liked their selection of beers that they had on tap."}
{"text":"Glendale's hidden gem...shhh. ..don't tell anyone.  House brewed craft beer, fantastic bratwurst, and the Dubina fries are unbelievable."}
{"text":"I had time to check out one brewery while visiting the Phoenix area.  Unfortunately, good Yelp reviews led me to Dubina.  

I had a 5 beer flight, and honestly not even one of them was an average level beer.  Carbonation on all seemed low, nothing was incredibly true to style, and the barelywine was flat out horrible.  If I had to pick a least offensive, it'd be their brown.  It was fine.

Beyond the really awful beer, the place has a weird vibe.  Dark & generic.  Shades pulled, drop ceiling, couches.  Weirdly open space.  I didn't get what they were going for.  I kind of assumed the decor came from a previous business that used the space, maybe.

The service started out good, but it took forever to get the check.  Asked for it, but the server waited on other tables for about 15 minutes before bringing it back.  The owner actually ended up handling it for us, as she was going around talking to the tables.

The good?  Prices were okay, especially during happy hour.  The pretzel was decent, and the food looked good.  One of the owners also dropped by to chat and she was a lovely woman.  

I wish this place the best of luck, but the beer has a long way to go.  Dial back the ambition on the higher gravity beers and try to get a few simpler styles first, maybe."}
{"text":"What a fun place.  Stopped in to hear some great jazz and had a fantastic blood orange IPA.  The staff was exceptionally friendly and you felt like part of the family.  You must check it out for local beer!"}
{"text":"This Czech family microbrewery is growing on me. They are doing better at consistently having their popular brews available, in addition to experimenting with new products that make return visits fun for aficionados."}
{"text":"We tried this place on a whim and we were very impressed! Nice little family owned brewery. The beer was great! Food wasn't anything to turn your nose up at either. I had the spicy gorgonzola burger and my husband had a brat. Their fries are delicious! I have nothing bad to say about this place. We will be back! Ao glad to have a good local place closer to the west side of town!"}
{"text":"Always a great tasting selection of beers here and the gal serving it up is super nice and always takes good care of us! Actually everyone that works here is always friendly., place is super clean too, we love it here! It's our version of \"Cheers\"... :-) 
waiting for someone to shout \"Norm\" one day - real random like"}
