{"text":"Great food, great service, and great atmosphere!!!
My new favorite spot!!!
I really like how fast I was waited on after being seated. They have a vast selection of beers!!! Prices are reasonable and the wings!!!! I KNOW why the Gold N Bold sauce is award winning!!!"}
{"text":"Hands down favorite place to eat! The buffalo chicken pizza is addictive. Love sitting in the bar, but I wish there were more beer/cider options for people with gluten allergies! I'll catch wicked weeds gluten freak sometimes and of course angry orchard... But it gets old pretty quick."}
{"text":"This was the first time that my husband and I went to duck worths. Our food was delicious and the service was excellent. The Italian sub was especially delicious.  This will definitely become one of our regular spots."}
{"text":"I love this place. Just our speed, yummy stepped up bar food, and lots of TV's to watch sports. I enjoy the beer selection, and even though it's a large building it still has a wonderful atmosphere."}
{"text":"The new Duckworth's has a great selection of draft beers.  That alone could have been enough to make it a favorite, but . . . .

The first thing that set me off was being required to show driver's licenses before we could be served alcoholic beverages.  My wife and I are in our sixties.  I know that Taco Mac does the same thing, and I do not go there for that reason.  A manager-type told us that the policy was based on some other bar getting sued for serving alcohol to someone, apparently with a suspended or limited license because of a DUI conviction.  I am not buying it.  The law does not require a bar to check for DUI convictions.  It requires a bar not to serve alcohol to people who are intoxicated.  It is a basic skill everyone who works in a bar serving drinks must have.

Then I was excited to read in the menu, \"We hand-patty our burgers from fresh (never-frozen) ground beef then grill them to order.\"  It is not true.  I tried to order a burger mid-rare and was told they would only serve burgers well or medium well.  They do NOT grill burgers to order.

The menu also has an enormous selection of food items (do these people never watch Restaurant Impossible?).  Our selections (I chose a buffalo chicken wrap over a burnt burger and my wife had a flatbread) were satisfactory -- no better.

With our bill we got a note saying that patrons who post a review on Yelp will get a $10 gift certificate.  No wonder the other locations have so many good reviews!  Does anyone want my gift certificate?

It is an attractive place.  The service was good.  The beer selection is awesome, and can be viewed on electronic tablets, which were cool.

But I do believe my 61+ years have earned me the right to enjoy a beer without showing a driver's license."}
{"text":"Love the momoo's special wings!  When will you start selling it by the bottle?? :)

My only complaint is that you don't serve soup!  Atmosphere and all other foods/beverages, as well as the service, are all fantastic!  Thanks for a great experience."}
{"text":"Don't come by on Sunday to watch your favorite NFL team.  70 TVs all showing 3 games.  We asked to switch 1 of the TVS showing the same game side by side and was told they could not because all are preset.  Looks like we find somewhere else to spend game day."}
{"text":"Duckworths is by far Huntersvilles best bar. Great prices! The rolled bold gold and mommoos wings are incredible! I would recommend this place to anyone."}
{"text":"This was our first visit to this establishment. Food was great, service was excellent, Amanda was courteous, friendly, prompt and professional. Will visit again when in the area."}
{"text":"Great food and great service here! 

I was impressed with our server's, Keith's, attention to detail. He appropriately made sure we weren't in need at all times.  He even anticipated the exact way we would be splitting the bill. 

As an appetizer, I ordered bacon/cheese fries that were absolutely delicious. For my entree, I had ten, in-bone wings. The wings came out in a timely manner, but it could have been a little faster.

Overall, I will most definitely be returning to this restaurant. I can't wait to try more of this delicious food!"}
{"text":"You can always count on a great meal at Duckworth's. The Philly cheesesteak supreme is awesome and so are the onion rings and the Philly cheesesteak pizza. The beer's on tap selection is amazing! The only negative is trying to get a table on a Friday or Saturday night is a very long wait..."}
{"text":"Great philly cheesesteak and lots of options on tap.  They did run out of some as the day went on."}
{"text":"On a jam-packed Friday night we had a manager come by to ensure we received the proper amount of attention (customer service) and to ask if we enjoyed our food and drinks.  Our visits are always great!"}
{"text":"Great food, unfortunately a male bartender treating me as I was bothering him.  How hard is bar tending?  Smile, serve me a cold beverage, and take my money.  I'm there to enjoy good food and cold drink. I shouldn't have to deal with bartenders who have bad attitudes."}
{"text":"Well I was really looking forward to eating and drinking here due to the large menu and beer selection. The beers and the selection were great but the dining left a lot to be desired. The service was awful. The fried pickles were the saltiest I've ever had and they give u a side of ranch without even taking the lid off. I know, it's a tap house. The flatbread was good except for the fact they forgot to add the jalapeño bacon which is what gives that flatbread its name on the menu. The philly was nothing special, just ok. Needless to say the food is about average to over priced and not worth going back. If u want to watch a game and drink beers then this is your place."}
{"text":"We loved this place! We were in town for a week and nearly ate here everyday. The menu pleased adults and children. They didn't try to air condition you out of the building. Simon was the best. Ask for him for the friendliest service."}
{"text":"Yummy azz food and all of the best beer in the land. Hope is an amazing server, love her!"}
{"text":"Good atmosphere, killer beer choices and great place to watch sports. 

Note: I ate the Smokehouse Philly cheesesteak and it was horrible.  The BBQ sauce was caked on so much you couldn't even taste the cheesesteak.  The bread even fell apart because of the amount of sauce. I should've said something to the manager who came by and asked how everything was but I didn't. DO NOT GET THIS and stick with the original cheesesteak."}
{"text":"We love this place, by far my husbands favorite place  !!! Amazing draft selection and only 3.50 drafts on Monday and Wednesday. A Must try if your around the area"}
{"text":"Best Wings ever - worst boneless wings ever - stick  with tradition and get them char grilled - management will fix any issue you have and you will leave happy"}
{"text":"Decent food, not great. BBQ was dry. Philly Cheesesteak was also dry. Lots of great beer selections. Waitress was quite knowledgeable and helpful."}
{"text":"Really enjoyed my first visit. Staff was friendly and food was delicious.  Got the chicken fajitas for two and it was more than enough for us. Want to try the beer next time. Have a ton on tap!"}
{"text":"Ate at Duckworths for the first time today and wow was it good. My wife had flatbread that I tried and it was delicious. Myself, being a wing fan, had to have the Gold wings. They were rated #1 in the Charlotte wing contest and I can see why.They were juicy, seasoned just right and totally awesome. All in all Duckworths was a great choice and we will be visiting again."}
{"text":"Not all Duckworth's are the same! This one, luckily, is a good one! Great for kids if you don't mind all the TV screens. Great beer selection. And they have great daily food specials"}
{"text":"We were driving back to Ohio, was headed to another restaurant when we saw Duckworth's. We decided to try it. The atmosphere was great, hubby loved all the tv's. I loved the music. Our waitress, Chelsea, was very helpful and our food was out quickly and yummy. He ordered a Philly steak sub and I ordered a chicken wrap with sweetie potatoe fries. Those fries were the best I've ever had! Definitely a stop if driving back through the area."}
{"text":"Best watering hole in the area. 100+ craft beers on draught with frequent rotation. Charles the beer sommelier is superb. The food pairs very well - best wings in town (try the lemon pepper) and nachos the size of a manhole cover. Lots of other great bar food for all tastes."}
{"text":"My wife and I love coming here for their wings! My wife loves the \"Momoo's\" flavor and my favorite are the \"Sweet n Bold Gold\" so we usually order 24 of them and get 1/2 one flavor and 1/2 the other flavor. They have a great beer selection and will let you sample something if you can't decide which beer to order. Our last visit here couldn't have been better. There was very little wait for a table, the food was perfect, and the waiter, Simon, was very attentive and helpful."}
{"text":"The bar staff tonight, Hannah, Michelle, and Jack made sure we had an excellent dinner and experience. They attended to our request and were personable without being too involved. My wife and I enjoyed our Friday night out and our thankful to them for their customer service and care!"}
{"text":"I really liked the atmosphere and the food. Beer selection is awesome however the young waitress had no idea what a light beer was and I ended up with a dark one."}
{"text":"I think I just found my favorite place to watch football! 
Tv's everywhere,Good Food,Best beer selection, & GREAT SERVICE! 
Did I mention it's Super Bowl Sunday?! I will definitely return! Keep up the good work guys !!"}
{"text":"It was late evening and my wife and I were heading back to Charlotte. Saw the place and we decided to stop and get food. To walk in this place you think its just another bar..... no big deal. Do not let looks fool you! The food is top of the line. The ribs that I had were perfectly cooked, along with everything else. The vegetarian plate missed a little, but when I said something to the waitress (Annemarie Manchus) she, without missing a beat voiced my concerns to the manager (Michelle  Simmerman) who came out to our table and made it her mission to find something on the menu that would be more appealing to my wife's cuisine choices. She didn't miss a step either! Attention to detail by the waitress as well as the manager was top notch, and I will not hesitate going back there just to set in Annemarie's section and have her serve us again. Bravo to both!! And see you soon!"}
{"text":"Pork and wings platter was excellent. Staff were very friendly and accommodating. Huge selection of beer!"}
{"text":"This is the best place,,My wife and I saw this restaurant on yelp..I had the fajitas & they were excellent they were better then chills..The service is fantastic..Our meal was paced just right in between our salad & main course..The manager did come to the table & ask how was everything & we told him was great..We ordered the chocolate cake and that is the best desert ..we will be back sooner then later"}
{"text":"I went here for my first time tonight for dinner. I was very pleased to see a nice restaurant come in after O'Charleys. The atmosphere is nice- half of the restaurant is bar themed and the other half a dining room which seemed to be sectioned off very well. I liked the idea of the drafts for each table in the bar area and there are more TVs that you can even look at! I sat in the dining room. Our server was very friendly and polite, but we could not understand what he said no matter how many times we asked him to repeat. I ordered the Baja tacos which were a bit spicy but delicious. I was disappointed to see that I only got two tacos and my brother got the Philly cheesesteak for the same price which was a MUCH better value. I have nothing but good things to say about this place and I will most definitely be back. The only thing I didn't like was that there were two managers that stopped two times, as well as the serve that stopped to ask how everything was. It was nice to see as a patron that the staff is really ensuring a quality experience, but I do think this was a bit overboard and took away from dinner conversation with my family. Also, I heard the manager apologizing to a table behind us and in doing so he bad mouthed one of the employees which I thought was really Unprofessional and tacky.

Overall, 4/5 stars. Delicious food , fast service during high volume sales, and neat environment."}
{"text":"When we were moving to the area from Boston, we came here because it was next to the hotel. 

The whole experience was awesome. Great food, super friendly waitstaff, more drink options than there are years in two lifetimes combined."}
{"text":"Well the service has greatly improved and the manager always comes by our table to make sure everything was good. This has became one of our regular spots. The cheeseburger with jalapeño bacon is delicious. And you must try the sweet potato fries."}
{"text":"Food was great. Nachos and grilled salmon salad were great. Will be back.
Made a return trip last week and we were not disappointed...wings, fried peppers, and pizza were fantastic. Can't wait to return"}
{"text":"Main stream food, high beer prices, good selection, but you will pay dearly for them. Too many food local places around Huntersville that you could go too. Don't get me wrong, the food is good, it's just typical bar food, from a chain, that they are very proud of. The beer prices keep me and my friends away."}
{"text":"Great food and great service! Enjoyed stopping in on my trip to charlotte from WV! Will definitely recommend"}
{"text":"I went with three stars because the manager actually stepped up but we still left frustrated.  We show up with a party of 9 that includes three small children.  We were told 30-35 minutes before we could get a table.  After 45 minutes we were told the table was not ready.  As we crossed the hour mark and just prior to us leaving, we were told our table was ready.  We were taken to back to back booths, not a table.  This could have been done 30 mins prior and we stated that we wanted to eat together at a table.  We suggested moving a table up against the booth and this worked.  

After asking for the manager, he came and gave us two free appetizers but the frustrating part is that I have no problem paying for the food. I would rather have someone tell me that Friday night is not a great time for parties and I would have come back another time or expect the team working the front to provide accurate wait times.  If that amount is exceeded, then a simple walk outside to inform us that existing customers are spending more time than expected is not too much to ask.  At this point, we could make a decision about staying or not.    

So, we sit down at our table slightly aggravated because of the experience up to this point.  The beer was great and they have a large selection.  I went with a philly cheese steak and it was great.  Due to the large number of customers I won't put that much fault on our server because I could see that he was busy.  What I will say is that most restaurants that work well have a runner that can assist with drinks refills and plate removal.  It also took an unreasonable amount of time for us to get our food.  We all had sandwiches/salads so it shouldn't have taken as long as it did.  

I'm sure that the experience would have been different if we were a group of four but I would appreciate an upfront notification that you are not in a position to handle a large group rather than try to accommodate and fail.   

I'm not saying that I won't return to this restaurant (I was really excited about the beer club) but I do know of other area restaurants that have given me and my family a better dining experience."}
{"text":"We went to the new location in Huntersville twice since they had a soft opening last weekend.  The food was excellent as it always is and the service was really good.  They are new so I think everyone is still learning the ropes a bit, but the managers and wait staff are on top of things.  And like I mentioned before, they haven't missed a beat on the food.  We've had alot from their menu - pizza, wings, cheese-steaks, chicken cheese-steaks, kids meals, fajitas, specials and i am sure some other things and we've never been disappointed.  The quality is good and it is a very nice option added to Huntersville - Welcome!!!"}
{"text":"I frequent this establishment about once a week and have always been served by a professional friendly staff. Michele, Olivia, Kenzie, Jack, Hannah and Hayley have always done an awesome job taking care of me when I come in after work. They always take a moment or two to see how things are going. Great service.
The food is good and reasonably priced. They are also very knowledgeable about the multitude of varieties of beers they serve. They always have a good recommendation as to a new beer I might like to try. I give them 5 stars. Thank you, Rich"}
{"text":"Food excellent!  Service friendly. Nice selection with reasonable prices. Long list of draft beers."}
{"text":"The service was good and there are no complaints.  

The menu is big too big in my opinion both the dinner and beer menu.  I just wonder how you keep that much food and beer fresh?

We had wings and a Fajita, salad both very good.

I will say for the most part the prices are reasonable but I did notice a few items are way out of line.  I think the nacho app. is $13.99? 

Nice addition to Huntersville and nice to support a local business."}
{"text":"We go there often, and we always enjoy what we order. Of course, the craft beers & ales on tap add to our visit."}
{"text":"Two visits was enough.First visit great waitress, good service but cheesesteak lack seasoned and was dry.  They put the cheese on the bottom touching the bread so the cheese doesnt melt over meat. Great beer selection served on warm glass (drink a beer on twin peaks) . Second visit went to order to go and have a beer while waiting. The 3 hosts told me that I can order the food with them then go seat at the bar and order the beer there. Basically I have to pay two different tickets.  I told them I need to see the menu, then they told me that itwill be better if I order everything at the bar if I haven't decided.  I sit at the bar order a beer, 2 minutes later no beer, they need to see my driver license.  If they going to card everybody then do it at the door.  2 minutes later my delicious beer on a warm glass.  Ask for the menu and another bartender brought it because the other forgot.  I finally order the food went out directly to the host area and I don't know how much time was there sitting, until a host realize it was from me.  10 minutes to get the check because is gameday and the only two bartenders can't handle the volume. 
Summary in a gameday dont sit at the bar.  Dry underseasoned meat cheeseteak was only the one time I will try it.  Chicken wings were good. On a busy day enjoy your beerin a warm glass.  The beer sampler 4 glass of 6 oz also in a warm glass."}
{"text":"Loved it. Went there for brothers birthday last weekend and came back a week later. Seem to be target on with guest service and good food.  I had the strawberry chicken salad last week and the chicken philly tonight. Oh and font forget the coconut cream cake. We'll be back:)"}
{"text":"Just fair. Inconsistent food, poorly trained staff and need to fully clean tables before seating."}
{"text":"Love coming here to try new beers and the Philly cheesesteaks are awesome! I definitely suggest the fried banana peppers too.. Get those as an appetizer every time I go"}
{"text":"This place is excellent!  Highly enjoyed the burger with applewood smoked bacon, LOVED the garlic fries. and their BBQ is great too!  Fried pickle chips are yummy, though I would guess they are frozen.  Nachos are absolutely ENORMOUS, though the bottom layer is mostly chips, they're still really good (with pulled pork)."}
{"text":"Always a great place for a quality sandwich, a cold beer and a seat for any sport you're looking for. They specialize in cheesesteak sandwiches. Lots of variety."}
{"text":"This restaurant has the best tasting food and I was so impressed with what all they include in their side salad.  The staff is great.  The only issue was the restaurant was extremely cold and the people next to me even asked that the temperature be moved up some.  It would also be nice if there were more sides such as vegetables to choose from but the food that I ordered tasted fantastic."}
{"text":"This is one of the better locations of Duckworths. For watching sports it does the job well but a lot of their items are overly fried and overly greasy."}
{"text":"My husband and I had heard many good things about Duckworth's.  We had been to the Mooresville location and knew that the Philly Cheese steaks were really good.  Sunday, Duckworth's had a special for chicken Fajitas so we ordered the Fajitas along with a Philly cheese steak.  I would defnitely get the Philly cheese steak again but would pass on the chicken Fajitas.  There was barely any chicken but there was too many onions and peppers and grease.  We ordered a slice of coconut cream cake and it was delicious!  Haven't had anything at a resturant like that before.  We will definitely be back but will not order their Fajtas special.  Glad that Duckworth's is in Huntersville. They were very busy but the service was fast."}
{"text":"We went to Duckworth's for beers, so I can't speak to the food. But the beer selection is amazing. They presented us with an iPad that served as the beer list, and they had craft brews from all over the country (both in bottle and on tap). I was miffed they didn't have Fat Tire on tap (yes, there are a hundred choices, but it's nice to have an old familiar on standby) but they're one of the few bars that recommends choices based on other types of beer (so they have two or three options that would work for fans of Fat Tire, for instance). As a beer novice, it was really cool. My biggest knock on the place was an utter lack of spirits: they have one specialty bourbon (Knob Creek) and little selection in terms of the bar. 

The service was great, and our waiter was really friendly. I was a bit irritated that he couldn't get the Bobcats game on quickly, and we only caught the last :20 of overtime, but, to his credit, the guy busted his butt to get the game on, and stuck around to watch the last few seconds with us (it was really slow). 

In short, I like it, and I'm looking forward to going again so I can get a sampler."}
{"text":"Beer selection is great if you can get one, (the service for our table of 12 was horrendous) & some of the food is decent, though came out sporadically over a 45 minute wait time, & mostly under par quality, even for fried bar food. We arrived around 3 pm, a time when there were more servers than patrons, yet we still couldn't get decent service.  Never again, as this place is over rated."}
{"text":"Food is pretty good for bar food, but nothing that I have sampled is stellar. They also have an impressive beer selection.

Lots and lots of tv's as one would expect so if you're looking to see an obscure game, they should be able to accommodate you.

We have pretty much ruled this place out because of the noise level. I know, I know, it's a sports bar. But this is my review, so I think it's a fair comment. I like to converse with my wife during dinner and I find hearing very difficult at Duckworth's."}
{"text":"Went here while visiting family since they offer a variety. Appetizers we got 2 orders of wings and fried banana peppers. The wings were average but the banana peppers were a hit. Definitely worth a try. Good selection on the menu but the fajitas were the winner at our table. Everything was hot, fresh, and delicious. The sweet potato fries were also excellent. Like this place gives you a choice of sweet or salty. 
Lots of tvs and a large variety of beer. Would be a great place to go watch your team play. Definitely will go back. Wish they would put a location in Raleigh."}
{"text":"Great smokehouse philly. Thursday nights kids eat free.
The wings are really good too."}
{"text":"Came on a Friday at lunch time with some colleagues (total 8 guests). 

Noise level is on the very high end of \"average\", to the point of making it difficult to have a normal conversation. 

Waited more than 20 minutes before a server show up, and only after asking a supervisor if we could have a server take our order. Afterwards waited another 20 minutes before the food came out.

However, food was rather good."}
{"text":"The food is always excellent here. The reason for the rating is because the server at the bar (woman, brunette/dark hair) repeatedly coughed and sneezed into her arms/hands. Repeatedly. And never once washed her hands after. We watched and waited for her to practice at least a basic level of hygiene, and she never did. We finally just canceled our food order and left about five minutes ago.

This is a huge red flag, especially considering food safety concerns at other establishments recently. Coughing/sneezing is fine, but every employee should immediately wash their hands after. We'll never come to this location again."}
{"text":"Just moved to Charlotte from Orlando, Florida. This was my 1st time visiting Duckworth's and I was VERY impressed by our server's friendliness, promptness and knowledge of both the beer selection and food menu. The place was VERY clean, the food was freshly prepared and delicious and the environment was fun."}
{"text":"Great beer menu and enough TVs for all kind of sports fans. Not a bad seat in the house. The salads have huge proportions and will fill up most men. Great place to come for game day."}
{"text":"One of the better sports bars around here, got in the morning to catch some European soccer. Was mostly empty at that time but it was a good experience. Friendly staff and good food."}
{"text":"Best bar at the lake!!! Great beer, great food!!!! Bar tenders are the best!! Get the mamoo wings."}
{"text":"First time visiting. Excellent! Great bbq taste. Great atmosphere. Great location too. Service was friendly and prompt. Would come again!"}
{"text":"This place is always packed. The food and service are always good. Large selection of beers on tap. Fun place to go with a group. Fish tacos are excellent!"}
{"text":"Fresh fries  are the best , & I also enjoy the deserts (Coconut cream cake )"}
{"text":"Great food great service and I'll return again and again. Boneless wings were out of this world. The philly cheese steak was delicious and was so large I had to take it home."}
{"text":"Great Experience:  16 of us descended on Duckworth's for lunch.  We had a reservation.  As we walked in the manager sent us to our prepared location.  Lance our server greeted us with a warm friendly smile.  His service throughout the meal was attentive but not disruptive.  Drinks and meals orders were taken and delivered with accuracy.   My steak salad was flavorful. The portion size just right and the price/value good.   For those that ordered beer they appreciated the wide selection.  If you order pizza be prepared to take the extras home.  Give Duckworth's a try.  Feels like home with the family."}
{"text":"Ate at Duckworth's for the first time this past weekend & was impressed! The iPad beer menu is very clever & the restaurant itself is not too sports-bar-y despite all the TVs (which is nice.) I had a very yummy chicken cheesesteak while the hubs enjoyed the smokehouse cheesesteak. We also joined the beer club (although the server didn't offer it, we had to ask about it.) We will definitely be returning, even if it's to rack up beer points!"}
{"text":"It was okay, but have had much better and with better service. We went for a late lunch, so it was pretty empty. Ordered a Philly, since that's what they're known for. Not only did it take forever to get there, but it was wrong. I ate it anyway to avoid another 20 minute wait. It was extremely overcooked and dry, had to dip in barbeque sauce just for taste. The other two in my party had decent enough sandwiches, but I won't seek it out to go back."}
{"text":"The shizzzzzz! Everything about the place was excellent. Genuine NC dishes, great service, awesome beer selection, quality grub. Gotta love it.

I've been back a few times since I wrote this 3months ago and wanted to updated this review. Yep, they're still the shizzzzzz!"}
{"text":"Tasty food with great service... starting with the very welcoming Hostess, Grace and continued by an ultra helpful Waitress, Hayley. Chicken Sandwich was fantastic and the Donut Holes are a delicacy. Can't wait to come back!"}
{"text":"Really good food. I had the salmon and grilled veggies. Was awesome. Great drinks and prompt service. Clean atmosphere. Save room for dessert...that's also amazing. Was really impressed with my meal and their menu. Definitely recommend."}
{"text":"Delicious cheesesteaks--lean meat, onions & melted provolone--generous portion on a fresh roll.  I lived in Philly for four years.  This is as close as I've had outside of Philly.  Crisp but tender sweet potato fries.  Great beer selection.  Was there on fall Saturday--lots of football games on many TVs.  Quick friendly service.  Whether taking family & kids out to eat or hanging out with friends to watch  the game, I recommend Duckworth's."}
{"text":"Not a fan at all.....I wanted to like, because I've heard so many good things, but they fell far short. 

My first impression was watching them ID a 70 year old man for a beer and when he didn't have it, they made him take his cane and walk across the parking lot to his car to go get his license. Just awful....no common sense.

The food is nothing to rave about. Average bar food. Poor, poor, poor service. Bartenders attitudes are horrendous. Its like you should feel lucky to have them serve you.

Don't waste your time."}
{"text":"Kaitlyn was a wonderful polite and efficient server. As usual, the food was great. The thin crust Buffalo blue cheese pizza and the same chips are one of our favorite. Keep up the great work Duckworth's!"}
{"text":"I have been to 500 bars in my life.  This is the best bar and grill I have ever been to.  The food here is OVER the top good.  The craft beers in general and the sheer amount of them are unreal.  If you guys like nachos their nachos are GREAT and enough for 4 people.  The waiter Ray was AWESOME.  What a good dude.  The prices are amazingly reasonable.  YOU HAVE TO TRY THIS PLACE."}
{"text":"This is my favorite restaurant to eat at. I eat lunch at least 3 times a week. The  staff is very friendly and the General Manager always makes you feel welcome. You should try the ribs they are the best I have ever eaten."}
{"text":"This place is always great the smoke house philly is the best, plus you have a lot of beers on tab"}
{"text":"Great place to eat! Fun atmosphere and the hostesses are really kind. We came on a Friday night and it was really busy but we were seated after 20 minutes. We ordered the chips and queso and the chicken quesadilla for an appetizer. Plenty of food and it was delicious. For the main course we had wings and a Philly cheesesteak. Definitely worth coming back for."}
{"text":"Came in at 6pm on a Sunday night.  No wait.  Four servers in our section (empty handed, not busy) and not one said a word to us.  We waited 10 minutes for someone to take our drink order before we left.  Too many good restaurants in this area to mess with that."}
{"text":"There's literally one million tv's in this place. Definitely a destination to watch any sports game. I love the plexiglass garage doors that open the bar area to the outside elements. Perfect in the spring. They have a pretty extensive menu. Plenty to choose from. Seafood, pizza, checken, Philly's. A little bit of everything. It's bar food and it's pretty good. I'm not a regular but I would go back to hang out and watch a game. Duckworth's is a good alternative to going to your local wing joint to watch a game. I had a small canadian bacon pizza. I was surprised how good it was for a place that doesn't specialize in pizza. I didn't pay close attention to the offerings on the cocktail menu. It's a beer kind of place...obviously."}
{"text":"Awesome bar and restaurant! My friend and I sat at the bar for dinner and enjoyed ourselves very much. The beer selection is outstanding, many options are local, but there's something for everyone and from everywhere. Really neat. We had Wooden Robot Brewery's 'Good Morning Vietnam' which was a blonde ale with vanilla- very good! 

We had an order of medium wings, with extra char- definitely worth the extra charge for that. Fantastic flavor. Wings are fresh and not frozen, very tasty. Went well with the beer.

I had the Carolina Pulled Pork Platter with Boardwalk French Fries (fries with Old Bay seasoning). Delish! I asked for more BBQ sauce and the bartender happily obliged. Smothered it with some tasty sauce, it was excellent!

Really cool that they have iPads for their immense beer selection on draft. The iPads tell you all about each beer and even suggest pairings and combos.

I'll be back- great environment!"}
{"text":"Great wings. Amazing Phillies. I would order takeout as they are always slammed which can often lead to long waits and less than optimal service."}
{"text":"Great food and extensive beer list!! Loved the iPad menu option. Great to see so many people here on a Monday night!"}
{"text":"I love Duckworths.  We have been going to the Park Road restaurant as well as the one in Ballantyne area before this one opened, but the one in Huntersville is worth the drive, it really puts the other two to shame.  It is large inside and has a mass amount of tv's - great because we love watching a bunch of games!

Each location has been great with service and have never pushed us out for staying at a table for an entire game.  Servers have always been attentive to our needs or our wants. 

We were here just this past Saturday and I'm already craving this place again!  The food is fabulous!

Food reviews:
Apps:
Fried Banana Pepper Rings: We loooooooove fried pickles, so that is a norm for us to get if it is on the menu, which is is at Duckworths, but the Banana Pepper Rings are like fried pickles with much more flavor!  Try these, you will not be disappointed! 

Entrees:
We have had a lot of their food:
Philly's: They are awesome.  My favorite is the philly supreme, but I have tried others, including the buffalo chicken philly.  Just bursting with flavor! Kevin got the buffalo chicken wrap before, but the philly is much better.

Fajitas: The smell of the fajitas are awesome when a server walks by with them!  They taste just as great as they smell, well worth it!

Jalapeno Chicken:  I had this one at the Park Road location, a bbq chicken with jalapenos and cheese - fabulous!

BBQ: Good, not the best compared to bbq specialty places, of course. 

Drinks:
Lots of beer choices, but being a huge peach fan, they have a fabulous peach martini that I like to get.

I can honestly say that I have never had a food I did not like and look forward to going back! We have introduced this place to our out of town guests and hope to get more people on board with loving Duckworths as much as we do!"}
{"text":"Well so I have to say \"Well done\" you have redeemed yourself Duckworth's. Even though you were very busy, the food was hot and very good. I will have to say you need to get the ribs, they were falling of the bone."}
{"text":"Duckworths is a good local spot, although they are beginning to go more corporate. The service is super spotty, but the food is usually consistent. Hopefully this won't change as they begin to go more corporate. 

It is expensive. Besides Bad Daddy's, probably one of the most expensive sandwich/burger places in the area. A Philly cheesesteak, which is one of their specialties, will run you about fifteen bucks. Not overly huge or anything either. The burger lunch special that they have on some days is eight bucks for a burger, fries and a drink. Get the tater tots! That's a deal but otherwise, even a Cobb salad will run you around fifteen bucks. 

I've found the best way to go is by getting their fajita chicken nachos. These are around $16 but they are a really big portion. I usually go and split them with one other person and have it as my meal. It'd be ridiculous to have it as an appetizer unless it's a large group of people. I do not like being charged extra for salsa, that should just come with it. It's a good, local restaurant that usually has pretty consistently good food. Surprisingly, their fajitas are good too. Just expect to be spending a pretty penny on rather ordinary food, although it tastes good."}
{"text":"After seeing Logan, my group of five decided we needed some beer and food. After tossing around a couple sports bars in the area, we decided on Duckworth's. What a great decision!

It was close to 10:30pm when we walked in. We were greeted with smiles and seated immediately. What was most impressive to me was the beer selections! The list is so large that they house it on an IPad! Each beer comes with a short description and an ABV. It makes it very easy to select what you want and is a great opportunity to try new brews.

The food was good as well. A step up from your average bar food. We got the Insalatta Capresse appetizer, the Buffalo Bleu Chips, and the Chicken Tenders with chips as our side. Do yourself a favor and order the chips. You can tell they make them fresh in house! And the ranch dressing is fresh as well. I could have easily eaten an entire plate of chips on my own!

We will definitely be back."}
{"text":"Only reason for two stars is the beer was good. My food, BBQ and wing combo platter, was cold and they forgot fries I ordered. Wife's salad was wilted and beginning to rot. Manager (Sean or something like that) basically called her a liar when he said they got lettuce in today but he'd take it off the bill anyway. We are regulars and I've brought business guests here but after tonight we will take our business to any number of other places around that actually care about their customers."}
{"text":"So, I was searching for a casual dinner and wow this one is open till 2 :D.

Staff was courteous
Food was delicious, there is a good range of beers to select from. We ordered a beer, grilled Salmon and veggie burger. All were delicious (just the veg petty could be more crispy).

The manager came twice to check if everything was fine.
All in all it was a nice experience and yes I'll go again."}
{"text":"This is probably our favorite place to eat (and drink) in Huntersville. They have a lot of menu offerings, from delicious entree salads to steaks to pizzas, and they're famous for their cheesesteaks. The pizza is really good, especially for a non \"pizza place.\" 

I really like their salads and pizza, and I had a great steak there, too. My husband enjoys their cheese steaks. The fried pickles are the best that I've ever had. My sister was also in heaven over their NC BBQ sauce (vinegar-based). The rack of ribs is HUGE. Everything we've had has been really good. 

But of course their draft beer menu just can't be beat. They also have great specials each night, and it is a great place to watch one or more games, too! Friendly service, good food, good specials - we will be coming back a lot!"}
{"text":"From CLE travler...If you're traveling up or down 77 from anywhere make the stop. Great beer selection, food and staff."}
{"text":"After an extremely disappointing lunch at Fox and Hound last Sunday this week we decided to try out Duckworths Huntersville it's definitely worth driving the two exits up (or down) 
I feel the need to disclaim that I was a server/bartender for 10 years so some things I find important in a restaurant experience others may not.
First off the hostess was friendly and upbeat and we didn't have to wait at all even though the place was busy. Then came our waitress, Hannah, who was fantastic. Very attentive, prompt, did everything a waitress could possibly to give good service. Then we got our wings which were great but apparently the pizza needed a little more time (we hadn't even noticed it was running behind because apparently that's how good the standards are here) so the manager comes over to apologize and takes the pizza off the bill for our wait!! She felt bad because the pizza was for our young son, she was very sweet. We literally waited 25 minutes for side salads at Fox and Hound the previous week and had to track down someone to get them for us! 
Overall my husband and I were SO impressed with this meal we will be coming back again and again to Duckworth's. Good job guys"}
{"text":"I travel to North Carolina from Vegas for work, and because of the office location this has been a go-to spot. I can't say that's a bad thing at all! The pizzas here are good, and the wings are very well cooked and quite spicy when you ask for spicy. That's a good thing; most places tend to think that spicy means something besides what the dictionary says it means. 

The buffalo blue cheese chips appetizer is amazing. I'm not typically a fan of blue cheese dressing but these have an excellent balance of flavor.

The beer menu is quite extensive and the service has been quite good each time I've come here.

I have absolutely no complaints at all about this place. It has become a staple of my business trips and I'm glad that a place like this is around. Sometimes if I'm stuck at the office late, this place is always open when I'm done when a lot of other places are closed."}
{"text":"The food here is delicious! They have such a wide range of items on the menu that is is difficult to choose what to get. I have had various appetizers and entrees here that have really just been amazing. 

If I had to criticize one thing, it would be the service. While the service is not bad, it is a little slow at times. But, that could be because they are always so busy. This place is packed always...definitely get there early if you don't want to wait for a table. But while the service may be lacking (and only slightly), the servers are always very friendly.

Can't wait to go back!"}
{"text":"Met a friend of mine, who flew in for a job, she was staying at a hotel and they made the recommendation. 

I was glad they did the food was wonderful everyone at my table ordered something different and it was all really good.

Service was great she kept the glasses full and checked on us often. 

If your in the mood to watch some sports finding a tv with the game you are looking for wont be hard at all. Tv's are everywhere. 

I would definitely go back and recommend it to others."}
{"text":"OMG! I believe I have found the best wings on the East Coast. . . Was driving off highway 77. Sawyer  a sign that said grilled food and tap house"}
{"text":"This rating is purely off beer and service as we didn't eat there, but the beers on tap selection is insane! I have never seen so many options! Also you can sit at the island and pour yourself one when you sign up for a card, which I found to be very neat.
Friendly bartenders and people in the bar with 27! tvs so you never miss a game! Fun place!"}
{"text":"Good place for lunch.  Brunch is very good and usually a packed house.  Entire crew is efficient, knowledgeable.  Never been for dinner so your on your own"}
{"text":"I've been back already.  Still extremely busy, but they are handling it well.

Me and a buddy showed up on a Friday night a little before 8pm and were seated right away, NICE!  Our waiter was extremely energetic and enthusiastic.  We ordered a couple IPA's(so many to choose from) and some fried pickles.  Our server came back quick with the pints but, by the time he had gotten there 2 different servers had tried to hand us someone else's food.  I'm not a fan of seeing my food get close to someone else's hands or face.  Then we saw our fried pickles going to another table, I made a little come hither motion and we quickly devoured these fried pieces of goodness.  It shouldn't take long before these people know which table is which.

We both ordered the classic cheesesteak.  Our server tried to upsell us on double meat for a buck more but we declined.  It didn't take too long for the cheesesteaks to come out and in that short time our server came by to see how we were doing once and tell us our food we be out soon.  He had many other tables as well, so the effort was appreciated.  The manager came over and asked how we were as well.  Almost too much attention but, being that they are new, I think it was the right move.

Our cheese steaks came out but, they were the small ones.  We just assumed that he assumed 2 hungry looking guys would want the larger cheesesteaks and he never asked.  I found it ironic he tried to upsell a lot of meat for $1, while he didn't try and upsell some meat and bread for $4.  It was enough food as is though.  Really good cheese steaks.  A little spicier than I\"m used to at the other locations but, I loved it.  As soon as they were demolished we went back into the beers.  The flights are the way to go.  More oz/$ and you can sneak in a couple high gravity beers as well.  I did this a good 2-3 times before it was time to go.  I left quite satisfied.

I've yet to be able to actually park in their parking lot due to the sheer amount of people but, you can park on the \"street\" out front.  I doubt Zaxby's wants any of the carryover and I'm sure that will be an issue if it isn't already.

I'll be back again and again.  A little pricey for bar food, but solid eats and a ridiculous beer selection in a convenient location."}
{"text":"I cannot believe it took my wife and I so long to check this place out. The food was tasty. Don't expect fine dining and you will be satisfied. Pub food, great selection, decent prices. We had chicken tenders, smothered fries, mozzarella sticks, and a burger. The atmosphere is off the hook. A craft beer enthusiast's dream. It was fun looking at the selection on an ipad. An overwhelming amount of drafts available. The customer service was awesome, from servers to bartenders to managers. Just one negative, the beer prices.  No pints, just 14 oz pours or smaller. And the 14 oz pours start at $5.50 with most being pricier. That is my only complaint. We loved it though, and will be heading back a lot more. Monday/Wednesday $3.50 drafts."}
{"text":"We love Duckworths. Their beer and food is always great. Massive draft beer list - you can find pretty much anything you want. As for food, we always get the moomoo wings. They are some of the best wings out there. With a nice grilled flavor and their special sauce, it is a meal to die for. Highly highly recommend ordering them. This time around I tried the Fajita Chicken Philly and was satisfied, but not overly impressed. The bread was soggy and the contents of the sandwich seemed almost thrown together without much thought. The side of garlic fries are great and would recommend getting those as well. Overall, get the wings. Eat it!"}
{"text":"The brewpub war is on in Huntersville!  

Here's the tale of the tape.  Two small franchises with lots of passion for good beer!  One hails from Atlanta GA, while the newcomer is a young local franchise hailing from Mooresville NC!

In one corner, (or west side of 77) in Huntersville, you have Taco Mac.  Over 100 beers on tap, great beer rotation and good atmosphere .  But like every good fighter, this one has a weak spot as well: the food.  The food is OK at best, but let's be honest, no one goes to Taco Mac for the food.

Head over to the east side of the 77, and you have the new location for Duckworth's. It doesn't pack a punch on beer quite as big as Taco Mac (74 by the count on the website) .  Nevertheless, the selection is very well rounded.  But the real winning punch here is the food!  Can't go wrong with any of the wings, the flat bread pizzas are always excellent, the sandwiches are top notch and the daily specials very tempting as well.

If I was a judge in this fight, I'd say Duckworth's wins by decision."}
{"text":"Great craft beer selections that change seasonally. Jalapeño bacon is good on anything! Awesome place to watch football"}
{"text":"First time tasting fried pickles & they were delicious! Tasty beer, salads and caprese!"}
{"text":"Something has changed.  The food has absolutely gone to shit, and the good wait staff has disappeared.  We normally ate here at least once a week. Started noticing a decline in quality.  Thought we'd give it a break a few weeks ago but decided to go today before the circus. 

It was great while it lasted but we wont waste the time or money here again."}
{"text":"Great food,  great friendly service.  Our second time here and now it's our new favorite place when we're in Lake Norman. We had the cobb salad and oriental salad.  Lime martini was great!"}
{"text":"Great beer selection and an awesome bar area if you're looking for a place to catch a game with friends. The atmosphere during the most recent men's World Cup was incredible. I would recommend the wings or any Philly."}
{"text":"Terrible service. Group of five on a Sunday evening when the place was not busy. It took a very long time to get our food, then we didn't see our waitress for easily 40 minutes. Had to ask TWICE for someone to get her to bring the check.

The other people in my party enjoyed their food, but the menu isn't particularly interesting.

The ladies' restroom was dirty and out of toilet paper. Not impressed with this place in the slightest."}
{"text":"We had eaten here in the past so we were delighted when we found out the branched it into more locations! The staff here is beyond helpful and didn't bat an eye at my exhausting order and substitutions! The food was definitely not a disappointment and they went above and beyond to make sure that the allergy was a non-issue! We will definitely come back when we are in the area on our next trip!"}
{"text":"I can't say anything bad about Duckworths!! Their beer selection is off the charts. And their food is great. Haven't tried anything I haven't liked. Service has always been great as well. 5 stars all around!"}
{"text":"We went to the new Duckworth's in Hunersville for the first time on 08/03/13.  They really did a great job of re-doing an O'Charley's.  There are tons of TV's.  It more TV's than I think I've ever seen in a bar/restaurant.  We started with fried pickles.  These were very good.  Great batter, great taste... I only wish they provided more.  But, for $4.99, I'm not complaining much.

The male had the cheesteak supreme.  It was average.  This company was known for cheesteaks and ice cream before the beer product line was introduced so I thought I'd try their specialty.  Again, it was okay.  The garlic fries as a side were awesome.  Great taste.

The female had a shrimp fontina flatbread.  It was incredible.  Very, very good.  In fact, I've heard other people at my place of employment comment favorably on Duckworth's flatbread.  

Finally, the beer.  Tons of beers.  They can load a card with 32 ounces of beer and you can walk to taps and pour your own selections without having to get a bartender or waitress involved.  I didn't try it, but many others were.  They put a lot of money and thought into the concept.

Overall, this was a good experience and we'll be coming back.  Great addition to the Huntersville food scene."}
{"text":"Friendly, quick service and great tasting food! I've eaten the buffalo chicken hoagie, sweet potato fries, roasted veggies; all of which are always very good. It's definitely a good, local place to visit for pub style food and atmosphere in Charlotte."}
{"text":"Stopped in to eat with some friends. Weren't real hungry so we just split a Margherita pizza. I wasn't expecting much just because this is not a \"pizza place\". It was actually really good though and enough for my wife and I to share. We will definitely go back to try even more of their menu."}
{"text":"We love Duckworths!  Always good food, great service and an amazing selection of beers!  Perfect for a casual date night or family dinner!!"}
{"text":"The food is really great at this location and its convenience to my house is one reason we continue to frequent it about every 3 months or so. However, the service is almost terrible every time we go there. 

Once, we were given a pager and were waiting when another party came in, same number as our small group, and was seated way ahead of us, even though they don't accept reservations! Another time they were so short staffed it took almost an hour and a half for our food to come. They are short staffed almost every single time we go. I would much rather frequent the one in Uptown if I am near it. The chicken fajita quesadilla's are amazing and what keeps bringing me back though. The menu is quite large and extensive too!"}
{"text":"A bit pricy for what they offer (basically bar type food). And I really would have liked to order the loaded nachos but it was just for me and they were $15.99, and they were not willing to do a half order. And the wings? I could only order 10, not 5. In other words, be prepared to pay for more than you can possibly eat. Lastly, it's annoying they card everyone. So card anyone who looks under 40, but older? A waste of time and inconvenience..."}
{"text":"We ate there last Monday for our Anniversary (one of our favorite places) and again the food, service and beer were outstanding.  We also had a wonderful server she was very attentive and friendly.  We will be back again soon. Thanks for always being consistently great!"}
{"text":"Wings and Sweet Tea -- oh my!  Very tasty and fresh.  We were there for lunch on a Monday -- the place was empty. The service was great and I'm sure when the place is busy is a lot fun.  We'll be back the next time we're in town!"}
{"text":"Duckworth's is a fun place to go with lots of menu choices that are wonderful. I'm not an IPA beer person, but my son loves this place for all the selections they have! He raves about it. We've been there about 5 times in the last 3 months and it's always a treat. Garlic fries are super, as is Cameryn's Cheese Nachos, Steak and Chicken Fajitas and hilly Cheesesteaks are fabulous. The Chicken fajita was a tad too spicy for me but you get plenty of it. 

What I especially like about this place is that it has a consistent good score from the Health Department or I wouldn't be there. That is the first thing I look for when going in ANY restaurant. If it's lower than 95.0, it's bye bye for me. 

This place does good business and the workers are constantly flying by! They don't just stand around like they do at some places!"}
{"text":"They're nice when you walk-in and take your order and the customary checking-in on you on how everything is while having your drinks/dinner. But as soon as that check drops on that table, all the pleasantries and warmth also drop. Wait staff and hostess pretended they didn't see us leaving thus did not say thank you goodbye. Fake Southern hospitality, I tell ya.

As for the food, I wasn't expecting remarkable since this is really more a sports bar than a gastropub. Food is drenched in sauces and smell permissible when it is served hot. But once the food cools down, you can smell that it is spoiled or close to being spoiled.

And as mentioned, this more of a sports bar; place is loud to make you drink more and there are way too many TVs to zombify you while having your food and drink so that you won't notice that the food are barely edible without the sauces."}
{"text":"Excellent beers on tap, friendly service looking to please, and good food.  If you are looking for a place for a bite and a cold beer, this is the place."}
{"text":"A really good place to go for lunch. I usually get the Philly Cheese-steak but my co-workers get other items and love it."}
{"text":"Very exciting to have a place like this in Huntersville.  Superb beer selection with all the toys of at-your-table-taps and ipad based self serve stations.  Food was very good, although a little hit or miss...the friend banana pepper app was crazy good (have I missed this in other restaurants?  Twice as good as fried pickles), while the chicken nachos were average.  Other entries in our group were good to great.  Seemed to me that the menu was overly large, if they focused in on fewer items and made them stand out, Duckworths moves to 5 stars."}
{"text":"Great environment, eclectic menu, and friendly staff. I love the iPad to look at beer options! I had the cheesesteak which did not disappoint. We will be adding Duckworths to our rotation for sure."}
{"text":"I have to be honest. We ate here back in November but I wanted to sober up before I did my review. Well, here it is a month later and I have forgotten what we ate, but I do remember the food was excellent. And the beer!! Oh My! the beer! when you are seated, they give you an ipod with all the different beers. Geez,that didn't take long! 
I figure I must go back soon and do a proper review.All I can say for now is, you will not be disappointed."}
{"text":"Okay just to start off we usually come here atleast twice a week for 2 years and even arrange our work meetings here. The last 3 visits have been terrible and I will not be returning. My nachos were burnt and they made it into a hassle to make new ones so I just ate the burnt ones. I've been here 2 hours for nachos and a pizza which is ridiculous. They brought out the nachos with no buffalo sauce and when I mentioned it they brought out a bowl for us to pour over it?? The pizza came out with chicken on it and I asked for no chicken bc were vegetarian. Waited 30 min for another one. Refills have been slow also. Not sure what's happening to this place but I'm soso sad that we have to say goodbye to it! Hopefully they get their stuff together!"}
{"text":"Had a great experience in the Huntersville Duckworth's - kudos to the manager -Shawn!  We love, love, love their wings - no one in the area makes them this crispy and so full of flavor!  Kudos because I got the steak salad and Shawn came to the table to see if everyone/everything was good and noticed I hadn't eaten much steak.  It was \"ok\" but not great.  Shawn wanted to make it right (it was medium to well and I ordered medium rare).  Thank you Shawn and Duckworth's!  
I've also had the Philly cheesesteak and being from PA, I can tell you this one is just as good!
For beer drinkers, their selection is fantastic!  Duckworth's is a great dining experience, never disappointed!"}
{"text":"Beer selections from local breweries is definitely a plus.  Great food, great beer selection and plenty of tvs to watch all your favorite teams."}
{"text":"This is my second visit to a Duckworth's and my first visit to this location. The staff is very friendly and they have good timing. I was greeted and seat with no wait. My waitress gave came out quickly with my drink and gave me the right amount of time to look over the menu. I ordered the grilled shrimp with grilled veggies. It came with rice and garlic bread as well. My meal was delicious. The shrimp were char-grilled to perfection. At fist I was thinking I would need sauce but they were so flavorful and moist they did not need it. The veggies were well seasoned and not over cooked. The rice was unusual. It had wild and brown rice plus veggies, beans, and corn with a tasty seasoning. The garlic bread was light and crispy. It was a little pricey but worth it. The waitress made sure I got out of there quickly since a storm was coming. I would eat here more often if there was one in WInston. ;"}
{"text":"Leah was the absolute best! The food was hot and delicious! I will definitely return when visiting Charlotte."}
{"text":"This is my 5th time to Duckworth's, first time at the Huntersville location.  The food was fabulous and the service was spot on.  And the cupcake sampler?  Absolutely the best!"}
{"text":"We went here for dinner (there were 6 of us). The service was great, and so was the food. It's pretty unusual that everybody is happy with their food when we dine out. We will definitely be back."}
{"text":"Newest Duckworth, like the original, only slightly more convenient that Mooresville. A favorite at any of their locations."}
{"text":"Craft beer heaven. Stellar selection of local, regional and national craft beers. I don't know how many taps they have. I should have asked. But the hostess handed me an ipad running a simple app which I could browse and search. It was a breeze to type in \"ipa,\" for example, and see their selection filtered on that.

I had a smokehouse philly cheesesteak, and my father had the philly supreme.  Both were fantastic, as were the housemade chips. There menu is basically bar food: pizza, burgers, fajitas, sandwiches and a few other things.

On Monday most of their drafts are $3.50, which is half off the price of the Imperial black IPA I tried.

We weren't there to see any sporting event, but there are TVs everywhere, so it would be a great option for that. The bar layout looks like it could accommodate large groups.

The staff was very friendly, helpful and we were served incredibly fast.

This is a great choice if you are looking for a nice place with a casual vibe, beer and beer-friendly food."}
{"text":"Duckworth's is a great restaurant that has a lot of variety of amazing dishes. Among my wife's and my favorites-
Brisket tacos- pork tacos with a delicious salsa and veggies
Chicken philly supreme- Philly cheese steak with chicken, onions and mushrooms. 

If you are into flat bread pizzas they are also very tasty! 

Their service is quick even when crowded, and the customer service is top notch! 

For those of you that are craft beer fans there is ample variety of various types of brews, and the iPad with beer information and beer lists are very detailed!"}
{"text":"Awesome staff. Get here early for a late night event.. it gets crowded . We like the menu a lot . I go with all the burgers. But they have salads, lots of sandwiches...Wish they had a true fish sandwich tho. Lots of tv's for sporting events."}
{"text":"We started with tater tots which are probly the best I've had.  The wife had a 4 piece supreme pizza and I had the hot Italian sub.  Both very good and well made  

The service was outstanding and the place was packed.  

The only thing I could say to the negative is it's loud but it's a sports bar so that is expected.

Good service, food and prices make this a great place to eat."}
{"text":"Best fajita chicken quesadilla I've ever had.. great service, great atmosphere highly recommended"}
{"text":"One of my favorite places to eat! The food is always good and always out fast! Chicken quesadillas are delicious and the garlic fries are my favorite. If you like beer, you will love this place. They have many different kinds to choose from and if they don't have what you want, they will bring you samples that are similar so that you can choose another kind."}
{"text":"Excellent. Food was delicious. Service was great. Beer selection was phenomenal. Management visited our table and took time to answer our questions about the restaurant. We will be back."}
{"text":"Listen the parking lot is often full and the reviews are great. But here's the thing, I really have never (been 5 times) had anything worthy of ordering again. I prob have been with a total of 10-15 others over these 5 visits and no one was overly impressed   All VERY mediocre at best to me. Sorry."}
{"text":"I had been to Duckworth's back in the day when I used to live in the area. We were excited to try another casual dining option when we moved back, but we weren't overly impressed. My fajitas were oversalted."}
{"text":"Our third time going, and unfortunately it feels as if each time it is getting worse and worse. 

Our first time was great, every beer we asked for they had!  Specifically a coconut cake beer which was amazing. Too bad they haven't had it since. 

The second time, my wife and I brought a visiting friend here. And they really messed up our order. Brought out the wrong appetizer. (Never bringing out the right one, just crediting the mistake) as well as bringing out one of the wrong meals as well.  Needless to say our friend was not very impressed with our raving review, and we totally understood. 

We went last night (Wednesday) during the $3.50 draft night.  However I was asked to choose a beer 3x because everyone I chose from the iPad, the server Hayley said they were out. Of course this was over about a 18-20 minute span because she had to keep going back to the bar as well as service other tables. Very disappointing. 
We also placed our order for an appetizer (wasn't asked about the meal yet because she wanted to bring over some sheet about a brisket burger, that was never brought over).  Well our appetizer (mozzarella and tomato salad) was brought out, and finished before we even ordered dinner!  During this time, I had finished the first beer and was waiting and waiting and waiting for the second one. 
The part that really set us back, could of been our fault, however it would of been a nice gesture from the waitress to inform us... My wife ordered a beer she thought looked interesting. It was a wild berry beer called ciasco. The beer was great, however it was served in a 750ml bottle aka $24, not $3.50. So we were very set back by it especially since we were wrapping up dinner. Now we had a huge bottle of beer to drink before leaving since we didn't want to waste it. When you first come across the beer on the iPad the price is not shown. You have to actually tap on the bee to see the description of it that shows the price.  Again, obviously our fault for not tapping on the beer- however when you assume it's $3.50 beer not, why check? 

The manager came over and asked how the meal was (just like they do in all restaurants). He needs to roll up his sleeves and help his staff though. When he came over, both my wife and I had two empty beer glasses. Should of asked if we needed anything or wanted another drink.    

As for the food, it's great.  We've ordered something different every time and have loved it. This time we ordered the smoked brisket tacos, bbq chicken platter, and for dessert the coconut cake and chocolate cake. All very very tasty!  I did notice from last time and this time, the portions for dinner are insanely different.  My bbq chicken came with a decent size breast, a ton of fries, onion rings and two pieces of bread. The brisket tacos my wife ordered were much smaller. 2 tacos with a handful of tortilla chips. So make sure you ask about the portions, or just stick to the platters if you want your money's worth.  


In conclusion, this will not be our go to anymore, as the experiences keep getting worse, and \"all of the beers on tap\" is very misleading, since they usually don't have them all It's too bad because the food is so tasty."}
{"text":"Amazing food and service, would come back again and again! If you haven't tried their Philly Cheesesteaks, you need to do yourself a favor and get one!"}
{"text":"Early dinner. We are staying next door and this is a short walk across the parking lot. Places seems busy. A mix of families and folks having a cold one after work. 

So no happy hour tonight but most drafts are $3.50. Wife had wine a decent pour. 

We split the bacon chicken wrap - we each had side salads. Overall it was good. Wrap was hot - although it could have used a bit more time in the press. 

Salad nice - not a big serving of dressing but it at least keeps the calorie count down. 

Waitress very friendly. So I'd say it's worth a try when in the area."}
{"text":"Had the specialty pizza of the day - excellent choice. It was a nice mix of spice, top it off with an IPA (recommended beer). 

This was our first visit - look forward to anymore."}
{"text":"Consistently good food and PLENTY of tv's!!! One of my favorite local restaurants..."}
{"text":"Have gone here multiple times and am continuously impressed with the beer selection. Seriously, one of the best draft selections in Lake Norman. Plus, $3.50 drafts Mon and Wed!Though the electronic beer list isn't always working, the staff is happy to help answer any questions or troubleshooting you may need. Awesome staff, plenty of TVS, and excellent beer. If you're in the mood for sampling craft beers while watching a game then this place is for you! Will definitely be venturing back for more beer and maybe a meal or two!"}
{"text":"Great selection of beers on tap. I ordered the BBQ chicken flatbread and it was delicious. Only downside was that it was so packed on a Tuesday night....but I can see why."}
{"text":"Great service and good food. We had a fantastic server named Sam who continually checked in on us and took care of us. When we stepped outside during the game, our table was accidental cleared. Our server made sure to take the drinks and food off our bill. Very pleased with everything today."}
{"text":"We stopped in on the weekend for lunch and had never heard of Duckworth's. My husband is a beer lover and was blown away by the selection. He sampled several and appreciated that option before committing. I had the salmon salad and it was the best I have ever had. Huge potions. I took half home for dinner. Our server was Justin and we were in on 8/1. He was very pleasant and cordial. The manager came by to check on how our meal was. Always a nice touch. We will definitely go back. The \"hops\" growing outside the entrance was cool."}
{"text":"If you ever come here make sure you ask for Jess! Great service and great food even though it was late night. Had the Meatza with loaded and garlic parm fries! Everything was hot and amazing!!!!"}
{"text":"The food is very good. I only have two complaints: 1) please pour me an entire 16oz draft & 2) wish they'd keep the local brews always in-stock.

The BBQ pork sandwich is great, as are the Bold Gold wings. Highly recommend"}
{"text":"My husband and I stopped by Duckworth's on our way home from the hot air balloon festival. What a great find! We skipped the line at the door and grabbed a table in the bar area. Service was wonderful, food was good, beer was great!"}
{"text":"Duckworth's has an impressive list of beer.  I love stopping by and having a beer but their food isn't the greatest.  All in all, if you value good beer and want decent beer, this a great place to try."}
{"text":"Service was great. Food was amazing. Had the Buffalo Chicken sandwich. As good or better than Mooresville location."}
{"text":"Wife and I on a business trip and stopped here for dinner and it was excellent in every way. Wow, 115 beers on tap!!! And great food too."}
{"text":"Everything at this establishment was on point. New to the area and came for dinner. They had beer and wine choices coming out of their ears which was awesome. Menu was on point. I had a mini pizza which was cooked to perfection. Service was very friendly and very prompt. Manager was on the floor making sure everyone's meal was as they wanted it. They have a beer club to join which will definitely bring us back. Definitely worth it. And a million tvs to suit any sport or game you want to watch."}
{"text":"This is my second time going to Duckworths and enjoyed it both times. Tommy served us both times and we got great service from him! He was engaging and made us feel like he'd known us for a long time. It's ironic that months later he remembers serving us. Food was great as well. Managers came and asked how things were going at least twice! I will continue to come back and I recommend it to anyone."}
{"text":"Traveling through and this car was recommended.  Great choice of beer!  Would have gotten 5 Stars but to loud for conversation.  Good bar food"}
{"text":"Excellent food and beer selections on tap. My husband and I had dinner this past Sunday. I had fish tacos and he tried two types of wings. The wait staff was prompt and knowledgable. The bar manager rounded to ensure beers were good, promoted an upcoming beer special, provided a sample and introduced us to the beer club. We will be adding this location to our weekly visit list. Much nicer than our Mooresville experience."}
{"text":"I've been to Duckworth's a few times during my travels to the Charlotte area, and enjoyed my visits every time. This is a great place for pub/bar food, with huge, delicious portions of all of the classics as well as a few twists. I love the atmosphere, the many screens, and have always enjoyed the apps that I've tried. The entrees are also quite good...most recently I had the salmon, which I would recommend."}
{"text":"Thought the burgers were like hockey pucks and the wings rubbery.  Would not recommend."}
{"text":"Duckworth's is a great place to go in Huntersville! The first thing I noticed when we walked in was the \"pour your own beer\" tables. Pretty awesome! Four types of beer on the tables and another dozen or so on the wall. Plus at the regular bar they have over 130 beers! So many that the list is on the iPad.

They also have so many tvs, great if you want to watch a game. But the weekends are insanely crowded.

The food is very good for a sports bar, with different tastes for everyone. I enjoyed my salad ( I know, why would I get a salad at a sports bar?!? But it was a few days after Thanksgiving and I needed a break from the gluttony). I hear their wings and philly cheese steaks are good too.  We will be back soon for great food, service and of course beer!"}
{"text":"I stopped in for dinner and sat at the bar. I was met by an awesome bartender. Great selection of beer! I had the BBQ and it was amazing! Great service! The manager came by to check on me. He was polite and professional. I will definitely come back."}
{"text":"Duckworth's had been recommended to us multiple times since moving to the city, so my husband and I decided to check it out for an easy date night. It has a chain restaurant feel, but it's anything but your boring local  Applebee's. We went on a Friday night, so it was definitely busy, but we would have only waited about 20 minutes for a table for two. BUT we ended up grabbing two seats at the bar, which includes the full drink and food menu. 

The Drinks! Now, the drink selection was amazing. They have the lists on iPads and I really appreciated being able to browse the full menu and click on each beer to find out additional information that you usually wouldn't get from a drink menu. The beer selection is MASSIVE and is a nice mix of local beers and beers from other states. We each had two beers and loved them all. 

The Food! We had the fried pickles for an appetizer, which were probably the best I've had since moving to Charlotte. Then for dinner, I had the Philly Cheesesteak Supreme and he had the Carolina Burger - all the food was delicious! 

The atmosphere was great, the staff friendly and efficient, and the food and drinks were delicious. What more could we ask for! We'll definitely be back in the future."}
{"text":"Pretty mediocre, with so-so service. It's a beer place and I made the mistake of ordering a gin and tonic - which was something the bartender had never made before. Stick with the brews!"}
{"text":"Kaitlyn was awesome.  Have only come here two times before although I live close by.  She was excellent.  She explained things on the menu to me.  Took the time to listen to me and I talk alot.  Made my dining experience wonderful!.  I am doing this survey because of that.  I will be coming back."}
{"text":"Ok, I reviewed duckworth's before but I wanted to post a review about my visit today. We always like coming here but today was hectic! The lady at the front was crazy and telling me that no one was getting up to leave so the wait will be long, we found a place at the bar for dinner and then was ignored for 20 minutes by 3 bartenders while they put up glasses and went to the kitchen. 
My dinner was a 2 1/2 out of 5, the lettuce was wilted and warm like it was sitting in the hot kitchen for  a while. I did mention this to the bartender and she said they keep the lettuce out while the meat is cooking to finish the entree so that's probably while it was warm. My thoughts are it was sitting out longer than that if it was wilted. 
Other than that, it was my only real mediocre experience here at duckworth's and I hope the correct the preparation. Next time I'll probably order something other than a salad."}
{"text":"I was talking about the one in Huntersville. We all got food poisoning. Shawn was the head chef. Now he's general mgr. food comes out cold waiters/ waitress big turn over. Bar someone is constantly slipping.  Food 
Is 1/2 cooked. I sent it back waiter forgot it! Done!!To say the least we won't be going  back EVER!! It sucks! Shaun still works there! Now look at the health grade! By the way their desserts are frozen not made fresh!
We did go in recently last week. Mr. Duckworth was there himself. To say the least he saw us waiting for 15 minutes just to get our drink order it was after lunchtime we just walked out! Like I said the place sucks! I'm done !!!!!Enter at your own risk! !"}
{"text":"Wow. I started my visit with a pleasant greeting by our server, Daniel. He was AMAZING! Such a great and genuine server. Have you been out to eat lately ????? That is really hard to find these days !omg. So I appreciated Daniels amazing service throughout dealing with my extraness as a person. I received amazing appetizers- Mild wings and chicken nachos ! COME HUNGRY, because these appetizers did not disappoint. Chicken and steak fajitas were also amazing. Not lacking flavor whatsoever. I will be back. Especially since I forgot to order my strawberry cheesecake layer cake for dessert to go."}
{"text":"We used to love this place.  It was good food for a good price with great customer service.  Unfortunately the customer service has fallen way off the mark.  My wife even commented that she thought the place had been sold to another owner because there has been such a difference over the past 3-6 months.  Most recently our family went and were told that we had to wait 15 minutes for a table even though there were 4 empty tables right in front of us.  They said they couldn't sit that many people that quickly because the servers would get flustered (there were 4 of us).  We will not be back.  Its so disappointing considering where they started."}
{"text":"This place is legit.  Great beer selection.  We tried a few flights so got to try 8 different types.  Chips & salsa were great too.  I'm a fan."}
{"text":"I'm giving 4 stars for food and 5 stars for service, with an overall 4 star rating because I can't give 4.5 and I can't honestly stand behind a 5 star review. 

We came on a Friday night at 6 pm and we were seated almost immediately. (People who arrived 15 minutes after us had to wait for a while... So I would suggest arriving on the early side of you're impatient). 

I ordered BBQ and wings because all I ever want to eat is BBQ and wings. Breakfast, lunch, dinner. Not kidding. The menu boasted \"#1 in Carolina's BBQ Contest\" so I expected to be impressed. Overall, I was underwhelmed. The shredded pork was *okay* and my wings were totally dry and not saucy at all. My date got spring salad with salmon and it was awesome. His son ordered wings with BBQ sauce and they were WAY better than my traditional wings. 

The reason why I give five stars for SERVICE: one of us was served the wrong meal. When we alerted the wait staff, they rectified it immediately -- even doubling the size of the original order. The manager delivered the replacement meal and even changed the cable station on the big screen TV from golf to Sports Center at our request. When we got the bill they didn't even charge us for meal that was corrected. 

This type of service is hard to come by these days and will definitely bring me back in the future."}
{"text":"Duckworths is such a great place for friends great beer and to get your tummy full the staff is amazing and everyone truly cares!!!! We love Duckworths"}
{"text":"Came in for dinner and waited less time than we thought. I had the bbq pork sandwich and it was good.  My husband had the ribs and they were awesome. I also had a blueberry lemonade vodka drink that I liked a lot. I would definitely come back...and next time I will order those ribs!"}
{"text":"Friendly staff. 
If you are a Yankee, the cheesesteaks and wings are reminiscent of back home. 
Big draft selection--over 100 choices. 
Daily lunch specials $5.99. 
$3.50 drafts on Wednesdays this location. 
Not a big crowd just before noon time. Picked up as lunch hour progressed. Seated immediately and drink order and food came quickly. 
Fish tacos were fab, on soft, thick corn tortillas. Great Mango salsa. 
Good stuff"}
{"text":"The food was much better than I thought it would be. I was happy with the service and atmosphere. 
They have 150 plus beers  on taps and tons of TVs."}
{"text":"Everything did not go all that well on our visit, but the attitude of the staff and management more than made up for it.  We sat at the bar on a busy Saturday night and ordered drinks and dinner.  Our dinner was taking a while and the bartender stopped by to say our food should be out any minute.  

A few minutes later the manager stopped by apologized; told us there had been a mix up in the kitchen and that our order was now going to be out soon. The manager delivered our meals and told us that they were on the house and profusely apologized again for the delay.  The food was hot and very good.  We had a buffalo chicken Philly - shredded chicken with a good buffalo zing, and a shrimp flatbread. 

Our server was attentive and caught that our food was not there before we said anything, and she and the manager wanted to make sure they did everything to take care of our issue.  

There are televisions with about any sporting event you'd want to see and it's a lively and energetic atmosphere.  There is something for every age and taste.  I'm not a big beer drinker, but they had a large selection on tap, and ample wines and other spirits."}
{"text":"We sat in the bar and had a fantastic, awesome server, Doug. He was very knowledgeable about the beer selections. We had nachos, which were good, but had a few chips that tasted microwaved. Then we had the original Philly Cheesesteak, which
was a one of the best we've had. We also has the Asian Chicken salad which was average. The manager, Nancy, stopped
by our table and was very friendly. She even changed one of the TVs to hockey for us."}
{"text":"Friendly staff - great food - good atmosphere. I tell ya - good customer service means so much to me - the wait staff here has been selected well. They have the best garlic fries - ask for extra garlicky if you like that sorta thing - the chicken Philly cheese-steak is also crazy good. It has a semi sports bar atmosphere mixed with casual dining."}
{"text":"We went here for dinner this weekend and loved it! Great food and a great ambiance. Definitely will be coming back soon."}
{"text":"We enjoyed an inexpensive bottle of wine as we dined on a Philly cheesesteak, a delightful salad and crisp, hot potato chips. We took home a 1/2 rack of ribs for my son, complete with plenty of fries and onion rings. Oh yeah, we finished the bottle of wine tonight.

We were treated wonderfully by the waitress and the manager came by to greet us and ensure the service was superb. We will surely return."}
{"text":"Date night with a strong desire for a good beer landed us at Duckworth's tap house . Our waiter Randy was very knowledgeable in  beer styles . He was attentive and always on point. The wings were fried crispy with just enough sauce to make my mouth tingle. As I finished my last few bites, we were greeted by \"Nancy\" she just wanted to check in regarding our meal and the service. I am giving this place 5 stars for service, selection and quality. I will definitely be back!"}
{"text":"Great eclectic mix of beers in draft and the beer club is great. You get an iPad to read up on you suds of choice. I've tried a lot of different fare here and they are good. Standouts for me are the fried banana pepper rings and the bold and gold wings!!"}
{"text":"Beer selection is great. Food is just OK. Service each time I've been has been pretty mediocre."}
{"text":"Really great beer selection and the food is better than \"bar food\". I got the fish tacos and was really impressed. I would definitely go back and it could eventually get to 4 star level but I hesitate to go that high right off the bat."}
{"text":"Great craft beer, nice rotating selection. Great wings and food. Always a good choice and right down the road."}
{"text":"menu makes a big deal about the philly cheese steak.  mine was dry. didn't realize a side salad was $2 extra - my fault for reading the wrong side of the menu.  kid had a flat bread - thing was huge.  tasty."}
{"text":"This place is 5 stars for beer selection.  However, we had the most uninterested waitress in the place. They have 12 draughtd you can pour yourself with a little swipe of your personal little debit card. If you want one of the 100 behind the bar you need to wait until your waitress feels like coming over. I dont think all of the service was the same. Im pretty sure we just had crappy luck. Another good thing is their sampler paddle was only $6...where I come from they are $10+
Also when we left out crappy waitress was in front of the door smoking. I think management should fix that. It is gross."}
{"text":"Amazing beer selection, waitress was terrific and food was mediocre, and couldn't make up for the lack of service and concern from the bartenders. No eye contact, other than asking us what we wanted seconds after sitting on the bar stool, didn't care that with over a hundred on tap selections it might take a moment to look at the list.  We had a different time getting their attention to order, and impossible to get them to acknowledge us to check out."}
{"text":"Service was terrible. I usally like the food but they brought out the wrong food. Then a different server brought the correct food and it was half right. To top it off the first plate that was served was brought out to the table beside us. And before we left another server tried to bring us some one elses food. Our server disappeared for I dont know how long."}
{"text":"I was at Duckworths on Friday night. I've never had a bartender so rude in my entire life. She acted like she was having a bad day and did not want to be there. I ordered my beer and had some questions, none of which she could fully answer she just kept shoving samples in my face. Maybe she was tired but it makes me not want to frequent the place. This bartender had very short blonde hair and no personality. Having worked in the industry myself I would have called off work if I thought my mood was going to effect my customers experience. I probably won't be back but if I do, I will refuse to order from her!"}
{"text":"I have been here at least once a week or every other week for the past few years, I cannot believe I have not reviewed this establishment.  Beer club - well worth it if you like tasting adventures, I have the tee shirt :-).   Always good local and not so local craft beers.   Staff is great, manager has been by my table a few times to see how it is going.........

Food, my favorite in order:

1.  Smokeshouse philly.  The large is obnoxiously ji-munguss.   So take a ton of steak, mix in bacon, onions, smokehouse bbq and spicy cheese, top it with onion strings and you have a mess.   I add whiz to make it authentic philly (I like to think).   No doubt, it ends up in my beard, on my shirt, everywhere.

2.  Buffalo Chicken Pizza - forget the Ranch, go with bleau cheese!  Winner winner chicken dinner.

3.  Wings - good size, cooked perfectly!  Yum, not very hot, just right!

4.  Nachos - good luck, this is a platter for four.  Makes me happy just thinking about it!

So, FYI, Friday and Saturday and game days, be prepared to wait.  It sucks, but get over it."}
{"text":"After another stop here, arranged purposely during our trip further south, I feel compelled to update my review with a simple \"Holy Crap! This place still rocks!\"  Amazing. I don't know how you couldn't just love this place. Comfortable bar, outdoor space, open air, great service, amazing beer selection (still 112 on tap! Although the bartender told me the new place Uptown has 150 on tap!!), and really good food. And Wednesday is still $3.50 draft night.  I sampled probably 5-6 beers before I settled in....

Can we just talk about the jalapeño bacon for a moment? Spectacular. Really makes a sandwich pop! And my cheesesteak this time was a 7\" one (12\" seemed too big) and was fabulous!!

I really could come here once a week or more. I am a HUGE fan!!"}
{"text":"This place to sum it up in a single word is \"AWESOME\" It has a super beer selection and the food is consistently good. Everything I have ever gotten here is delicious. I highly recommend this place to everyone."}
{"text":"This was close to hotel and had good reviews so I though I would try.  
   I sat at bar and drink water but if you like beer they have more than a few to choose from. 
   I ordered the brisket tacos.  Not comparing brisket to that cooked in Texas it was very good.   You know if you're famous for that food it's hard for somebody to out do you states away.  Regardless the brisket tacos was very good.  Staff was also very good.  
   The only stumble I had was, I was wanting something sweet to take with me.  So I decided on the cupcake sampler.  4 different type cupcakes. This way if their is one I don't like I can just try another one.    I noticed when the bartender handed them to me the bag was cold.  Ok I though.  Went back to my hotel room.  Opens the back and the plastic carrier they were in and bit into a really cold cupcake that was a bit sticky. Like almost slimey sticky.  
   I would recommend the restaurant but not the cupcakes.   If you want cupcake they have better and cheeper ones at the grocery store.  
  I almost gave 3 stars but most people go to drink and eat.   So I'm letting them slide on the strange and not good dessert."}
{"text":"Holy beer selection.  So many they had to put them on a tablet.  Had the BBQ and Wing plate.  Bbq tender and lean extra eastern nc vinegar dip on side.  Bold gold wing sauce amazing. Also don't skip the garlic fries."}
{"text":"Good place to watch sports.  They have a ton of televisions.  They have a huge menu but if you ask the servers, they will steer you away from the items that are basically warmed up.  My son loves pulled pork but apparently, they are not smoking/making it here.  They get it out of a bag and warm it up.  I've started just ordering the pizza.  It's good.  I also like their potato chips.  

My husband has had some bad experiences with their chicken breast.  Weird and rubbery.  He had to send the chicken sandwich back twice because the chicken was inedible (he never sends food back).  He was told that he wasn't the only one that had sent back chicken that night.  Today he had Chicken Fajitas after I told him not to order the chicken.  He said most of the chicken was good with just a few fatty pieces.  He did mention that the tortillas were hard in places but I reminded him that it's not a Mexican restaurant.  Haha

Service is good and like I said... there are a ton of tv's."}
{"text":"Our experience was great. The food was delicious. The service was great. We had a very short wait when we arrived  our server (name forgotten) was very attentive. The food was delivered quickly. Among my favorite menu items are the sweet potato fries (sweet not salty), the backed beans, and now the coconut cream cake. We will back very soon."}
{"text":"The service was superb as was the food!  Thank you for an awesome dining experience!!!"}
{"text":"Great Food and service. Needed a \"Happy Birthday\" embarrassment moment for husband but the server said they don't have one yet. An golden opportunity as well as priceless moment that I was ready for the thrill. Overall, great, great and great."}
{"text":"There are rare times in life where you have an \"oh my god\" moment at a restaurant. This is one of those few locales, where anything, and everything is top-notch. 

Service is always superb, the ribeye is great (order the garlic fries), the chicken quesadilla (add the bacon) might be the best I've ever had, anywhere.

Almost forgot - fantastic daily specials (and beer/wine specials).

Check out this place... but don't come too often, as I still want to get a table without a long wait."}
{"text":"Hannah is probably the best bartender I have encountered at lunch! Such a great breath of fresh air! She made a recommendation (philly cheesesteak...YUM!) and is on top of keeping my drink filled!"}
{"text":"Awesome sports bar to watch football at. Big menu with lots of variety. Great for groups and happy hours! Huge drink menu on iPad. Tons of tvs!"}
{"text":"Pretty good food and extensive menu. Nice place to go when everyone is craving something different. They have made errors on out take out orders before that's why I didn't rate 5 stars."}
{"text":"Love this place. Beer selection = top notch. Food is great as well. Highly recommed the buffalo chicken pizza."}
{"text":"I love this place overall. It's loud a little bit but except of that it's fum , great drinks and good looking people."}
{"text":"I've always supported this place because it has a ton of taps but we consistently get subpar food and service here. Today was the straw that broke the proverbial camels back! After enjoying a few brews I was told they would not fill my personal growler! It's probably the most awesome growler ever but that's besides the point... Point is there's allot of cool bars w taps that will fill my growler and by being greedy over your deposit money you turned one of your loyal patrons away. If not for beer selection this would be a two stars."}
{"text":"Very laid back vibe. Tons of beer to choose from on the iPad menu they give you. Had the steak salad and it was very tasty. It's a sirloin on top of a bed of greens with tomatoes, cucumbers, and blue cheese crumbles. Asked for the steak to be prepared rare and it was. Cooked to perfection; something that does not happen very often a chain style restaurants. Servers were awesome and very attentive but not over bearing.  Back to the beer; whatever style your looking for they have it. From local breweries to well known breweries they have what your looking for. Great place to grab a bite and a brew with some friends!!"}
{"text":"Very pleased! Tucked behind a Zaxby's I almost didn't find it, but hidden restaurants are my favorite! It's a very nice restaurant with plenty of seating which is why I have to deduct one star. Nothing annoys me more than a hostess telling me where I HAVE to sit. I witnessed it a couple more times with other patrons requesting different seating and being denied by the hostess. 

Ok on to the food and it didn't disappoint. I ordered the St Louis Style Ribs and they were phenomenal! Very meaty and extremely tender! The hand cut fries were good, but could and should be served hotter. The baked beans were tasty but the garlic bread that accompanies the meal was a bit hard. 

Their prices seem reasonable and the service although a bit slow was friendly and professional. I don't drink, but they provide your table with an iPad for you to browse through their wide variety of beers. Their menu is big and I look forward to trying some of their other food items. 

We also ordered the Strawberry Shortcake Cheesecake which was O.K."}
{"text":"Great service! Nachos were phenomenal and beers were delicious!! Our third time here and it gets better every time!"}
{"text":"This place is essentially a mini Disneyland for Beer. A lot of local and specialty beers on tap... actually 112 different beers on tap to be exact. They have a serve table and serve wall too, were you can pay per ounce and pour your own. Giving you the ability to try several beers without breaking the bank :). You can ask for the iPad Drink menu which gives you a lot of info on the individual beers and wines available. 
However this isn't a one trick pony, Duckworths is going to be a great and much needed restaurant for the Huntersville area, for the simple fact that nobody is willing so far, to dish out the shear variety and atmosphere that is offered. If Burkdale feels old hat, or you just don't feel like scrambling for parking, give Duckworths a go, 
and you'll agree it's not just another brick in the wall.

Other Highlights:
Wine Cruvinet
Better food than local competition (Try the Philly).. like way better
70 TVs placed throughout the entire restaurant
Screened (OUT MOSQUITOES OUT) roll up garage style doors for when the weather is sweet outside."}
{"text":"Great experience for my first time. Prompt service and great food! Just need D9 beer!"}
{"text":"Very nice place! Reasonably priced menu with a ton of selection. A place you can take the whole family and loud enough that it's kid friendly. Wings were awesome!!"}
{"text":"Super busy on a football Sunday, we were seated right away! Server was pleasant and got our orders in quickly. (Photos of meals
Posted already.)

We ordered an app, cheesy nachos, when they came out it was chips and queso, which we thought that's maybe how they did their nachos, never have eaten here before, only drinks.

The manager came out and apologized that our app order was wrong we did not care at all and they took it off the bill, which was very nice and did not have to do at all.

Everyone enjoyed their meals, pulled pork was DELICIOUS! My friend had the ribs and LOVED them.we can't wait to go back and try more.

They have a coconut beer we had before, to die for, but not on the menu any more :(

Still 5 stars for the great service and tasty food!"}
{"text":"Fabulous experience! The service was wonderful, Monica is amazing. The chicken nachos, absolutely amazing! The chicken is blackened and there are two pounds (literally) on them. Every chip is covered with toppings, and the serving size is really huge! Excellent experience!"}
{"text":"What a great place!  We were recommended here by the guys at Ass Clown Brewery and I am so glad we went!  Being from Atlanta, and being a beer lover, I frequent Taco Mac a lot, and this is what Taco Mac should strive to be!.

First off, the beer.  The variety they had on tap was awesome, and all craft.  Even a decent amount of \"limited\" stuff like Troeg's Mad Elf and Olde Hickory's Cedar Aged Irish Walker.  They bring the beer menu out to you on an iPad!

Now the food:  
We started with a potato skins appetizer, which really was a large baking potatoes quartered length-wise and then loaded up.  They were very tasty.
I wanted wings, so I had a 10 piece of the boneless wings in their award winning Sweet & Bold Sauce and they were fantastic.  That was $9.99.  Now, here was my only disappointment, the wings came with no sides, so I had to order a $3.50 side of fries.  That aside, it was all very good and served quickly.
My wife had a ribs/wings combo, which was a 1/2 rack of ribs and 5 healthy wings, and hers came with two sides for $16.99, very reasonable!  

Now, we came in at around 4:00PM, so the place was practically empty so that may be why our service was so good, but we were waited on immediately and the manager stopped by twice to make sure everything was good.

All in all, our bill for the two meals, the appetizer, one beer and two sodas was right at $47 before tip.  I think that was pretty good."}
{"text":"Food was very good and reasonably priced.  Would have loved to experience their extensive beer menu, but that is kind of difficult on my one hour lunch break from work."}
{"text":"Love this chain!!  Made it up this way last weekend and the place was packed!  Very cool and inviting sports bar atmosphere.  We sat at the bar since there were four seats available.

ALWAYS a great selection of beer.  Local as well as national and international favorites.  Bartenders was super friendly and quick.  I also had the oriental chicken salad which hit the spot.  The dressing was super sweet so it is good it comes on the side so you can control how much goes on the salad.  Not too expensive and definitely will be back!!"}
{"text":"It's nice to go to a bar that isn't blasting music on a Tuesday night and had a great beer selection! Mozzarella stocks were good and the bartender was attentive and polite. I will be back!"}
{"text":"Love it.  I like the fact you can order a la cart as I still like to eat out but have a very restrictive diet!"}
{"text":"Food here is consistently good.  Cheeseburger is awesome.  Brisket Tacos are done well.  Beer selection is very good and it is a great place to hang with friends."}
{"text":"Stopped in here for a quick appetizer and beverage with some co-workers one night. The nachos were a little too heavy for us, but their beer selection is on point. My only complaint was that it was a little busy and we had a hard time tracking down our server for the bill. The high top tables at the bar area also felt a little close together, but hey, I get it. More seats, more money. Just not the relaxed vibe we were going for that night."}
{"text":"It was my first time here this afternoon and I'll definitely be back. Both Grace (hostess) and Kim (waitress) were attentive and friendly. I ordered an order of wings, half medium and have Parmesan garlic. Both were great! I'm only sorry I didn't get pictures before they were devoured."}
{"text":"Beer tap galore and incredible food! Great atmosphere for sporting events and an awesome staff.  Bring the family or even come solo... You will not be disappointed.  My first time here, I'm outta st augustine fl... And I promise you I will plan all future trips to this area so I end up here at some point!  Absolutely fantastic!!!"}
{"text":"Our first time here and we were excited. The decor is great and the feel of the place is great. Service and staff were awesome......food...the food not so much. Cheesesteak was a bit dry, roll was decent, cheese was at least hot. Fries were like warm and bland. Ribs that we ordered were perfect though, sides were just meh. The beer by far is the best part here and that's understandable as this is sold as a Taphouse. We will give it another try later though."}
{"text":"I love this place, especially when I get a late flight here like tonight.  Outstanding brews on tap.  Currently drinking something from home, Stone Tangerine IPA, and it is tasty and reminds me of home.  Full dinner menu to complement the bar.  Oh yes, it is not limited to beer as they have a full bar.  Quite a treat for a road warrior.  Definitely my home away from home in Huntersville."}
{"text":"Will only cook your burger how THEY want it (overcooked not juicy). Employees threw the owner under the bus for his bad policies of not cooking to what the customer wants. It's cardboard or nothing here. AVOID!"}
{"text":"Lots of great beers. The garlic fries were tasty. Stayed at a hotel across the street and probably my favorite place within walking distance."}
{"text":"Quite a surprise for a bar. Went here after seeing that this place rates really high in Yelp and TripAdvisor. I ordered the burger and it was pretty good. Very fresh and tasty, my only complaint is that this burger was enough to keep me full for the rest of the day (which is not a bad thing though). The fries and the burger remind me very well of Five Guys. The service could be a bit more faster and the ambient is really nice. There are self-service taps for craft beers which you can choose from an iPad. I found this system to be pretty cool! I will be definitely be coming back here for a beer, watch a game, bring the family. With so many taverns around Lake Norman this one is surely working its way to the top!"}
{"text":"I don't think I've ever had a bad time at any Duckworth's.  This location is no different.   Huge selection of beers and really a beer nerd haven.  The bar is pretty large here so finding a seat shouldn't be a terrible problem unless it's game day I would assume.

The bar service was quick for our food and our drinks.  We were there on a pretty busy Saturday night and I had the steak salad.  I've had it before at other locations and here it was just as delicious.  

The highlight of my night were the specialty rare beers they had on tap which tells me their beer manager is doing a great job."}
{"text":"Good luck getting a remote control at this place. Came here to watch a soccer game and had to ask 3 times just to get to see the wrong match. Never mind I asked for a manager twice and no one ever asked me which soccer game. Making assumptions is cool I guess."}
{"text":"Want beer? 113 taps! Want sports viewing? 75 TV's! Good food? Yup,got that,too! Seek this place out if in the area---great experience."}
{"text":"I love the summer salad with chicken.  It's always consistently good.   There's a great variety of options on the menu and our group always seems pleased with their food."}
{"text":"If your not looking down at your plate then you will definitely be looking at a TV LOL. They are everywhere!!!! I wish they had the tv on more channels.  They only showed UFC, softball and baseball on all those TV.  It's a really loud noisy place so when talking to the people at your time you have to talk loud just to hear each other. The food is pretty good. We had the charred garlic parm wings and Cesar  salads. The top shelf Long Island was NOT strong at all. The wait was about 20 minutes on the weekend. Food came out fairly quickly."}
{"text":"Mediocre food and extremely slow. The only thing this place has going for it is the great craft beer selection with tons of tvs but with 4 breweries within 5 minutes of here I will go elsewhere"}
{"text":"Tried this place on a whim looking for something new for lunch besides fast food. If you are near I-77, exit 25 this place is great. Out server, Anna, was a great help showing us the layout of the menus.   We had the philly cheese steak and carolina burger. Great taste, fresh and messy. We'll be adding this restaurant to our list of favorites."}
{"text":"Unusual for this place.  This time we had a terrible experience.  Sat down with a table of 10 at 7:00. Half the party was served at 8:00. The other half didn't get food till 8:20.  When we finally got the food, we got the wrong sides. It's too bad because the food was pretty good and the wait staff was trying. It appeared that the restaurant was understaffed and completely disorganized.  This one is on the management. Too bad..."}
{"text":"I've eaten here before so I know it's usually better- definitely a bad experience this evening- slow service- we didn't have beers for thirty minutes, never got water or silverware and had to ask a second waitress for our refills and napkins. Beers were warm and flat and food was cold.  Poor experience this evening"}
{"text":"Food is always served hot, and I'm happy that they are going to be open until 2 am again. It means a lot to be able to drink good beer and have fresh food late at night. The bartenders make this place what it is."}
{"text":"Best sports bar  in Huntersville.

Great atmosphere, food was delicious...especially the sweet potato fries. No more taco mac and their terrible food!!!

My husband even approved of the beer menu.

I can't believe someone gave this place 1 star....that's hilarious."}
{"text":"I've always had great food & drinks here.  A couple of times I've been here, our waitress seemed to forget about us and we had to flag her down.    The wine is expensive!"}
{"text":"We had a terrific dinning experience at Duckworth's Grill & TapHouse.Our server Rachel was excellent.She served our Beers,appetizers and main course with perfect timing .we ordered the fried pickles,The Big Bad Burger special,four delicious cold microbrew draft beers at a very reasonable $3.50.For desert we had the  four cupcake sampler.All this for $60.00.We will definitely be back again and using our DuckWorth Beer club rewards card!"}
{"text":"If your a beer  lover you need to try out this place they have some 115 beer  options 

Service was quick and attentive and no wait but it was an hour before close too.  lol 

We started with their house Cabernet and one of the 115 beer choices and the buffalo blue cheese chips! They were really good! Thin cut house made chips with just the right crisp non greasy lightly salted covered with blue cheese dressing finished with a drizzle of buffalo sauce = yummage! 

We decided on wings - so we sample the garlic Parmesan; Bold n Gold; and Asian Sesame! My least favorite was the Asian sesame as they lacked much flavor! What I do like is they are not breaded and perfectly cooked with crispy skin and moist inside.  My favorite was the garlic Parmesan!!! 

Our waitress was a Chatty Cathy but on top of it service wise and really knew the menu well.  We will definitely keep this place in the rotation!"}
{"text":"The Chrizo burger is great and we are so happy that it is a part of the menu now. It is really good paired with the Birdsong Jalapeno beer but they were out today. The growler options and prices are very reasonable too. The family loves coming here and this is the 3rd location that we have visited in a few months, and all were great!"}
{"text":"Great spot to attend. 

The apps were delish, hot wings and fried banana peppers. 

We ordered a couple of beers & a lemon drop. So yummy! And love the glassware.

The location is great far off from the airport."}
{"text":"Came here Saturday for the first time. We were meeting up with some friends from Winston and they actually chose Duckworths for the beer selection.  We were not disappointed! It was pretty crowded Saturday at 6:30 when we arrived but we didn't have to wait to be sat in the dining room. They had a huge selection of beer and they will let you sample any of them. I wish I could remember our waitresses name because she was awesome. She never acted annoyed to bring us samples and she kept the beers coming and she put up with our shenanigans all night lol. My sister and I shared the nachos-FYI they are huge, enough to feed 6 people. Honestly though I was not impressed, I've had better nachos other places but I will try something else next time. My husband got a burger and said it was the best he'd ever had. I look forward to going again."}
{"text":"Menu has a little variety from tacos, to BBQ and wings.

We decided on the Nacho \"Appetizer\". 15.99 and a full pound of meat. The thing is it came with some problems too.

The chicken is cut so finely it's almost non-existent, the guacamole tastes like it came out of a bag (it was not fresh at all), there was so much cheese the chips were soggy and greasy.

However it was okay enough for a quick snack, although we will not order it again."}
{"text":"Busy place with a nice selection of craft beers on tap.  Regular beer in bottles. Extensive menus with wings, pizza, salads, sandwiches , burgers you name it.  Ship the chips and Queso if you like Tex met.  Salsa was different not bad but was not fresh.  I had the Salmon Salad.  It was a bit dry very flat.  Flavor was good but char grilled was a bit much.  Greens www fresh.  I chose the olive oil infused with garlic dressing and it was very bland.  Dining companion had a bacon chicken rap with fries and it looked good and he said it was biting special.  Fries were think and crispy but a bit too much salt for my taste 

Small wine list and not that great, it's really a beer drinker paradise.  

Place is loud and very busy.  Not enough staff to handle the amount of customers.  We waited 30 minutes for a table for 2 in a Monday night at 8pm.  It's not like there are 0 restaurants around, it's just that new I assume.  

Come here for the craft beer, but dine somewhere else"}
{"text":"I order takeout here and they always get it right. LOVE the garlic fries and mommoo's wings. Very friendly staff, too."}
{"text":"We just went to Duckworths for the first time in Huntersville North Carolina. I really enjoyed the beer list. They had very unique beers all around the country cannot find any places. The food was fantastic. It was very crowded so I recommend going on a weeknight or very early on the weekend. Despite the crowds our server was fantastic and we had a great experience."}
{"text":"I had the best boneless wings ever!  I tried the sweet & bold sauce. We also has the fried pickles. Service was also really good."}
{"text":"I love Duckworth's in general, but this is my favorite location. The service is always great and the food is too! I love their weekly specials, numerous beers on tap, their nachos are HUGE, the wings are great, the pizzas are pretty good in addition to their cheesesteaks and fresh cut fries. I can't forget my most favorite salad, which is their Summer Salad- a bed of fresh greens, grilled chicken, fresh strawberries, blueberries, mandarin oranges, cranberries, candied pecans all topped with their house garlic vinaigrette. 

No matter the occasion- game night, quick bite, or casual meal, they have something fit for everyone's palate."}
{"text":"Went here with my boys on the night before Thanksgiving. Lauren was very helpful and knowledgable about the beer selection! Highly recommend."}
{"text":"Decided to try the place for the first time and was quite disappointed. We got a Cobb salad, which should've been tastier, and a margarita flat bread. The salad was super bland. The flat bread was so mushy and we couldn't even pick it up to eat it. Not only that, but it was so average. For the $30 I paid today I wish I went somewhere else. If I ever go back it'll only be for the drinks there."}
{"text":"My husband and I have been here before. Service has always been good, beer cold and food good, as well. Tonight that changed. It took 20 min to get seated in a booth that was empty when came in, then once we ordered it took almost 30 minutes to get our food. My Cobb salad was not good, at all. And what I mean is the lettuce was limp, slimy and dark. The crispy chicken was obviously pre-packaged (Tyson frozen would have tasted better). The blue cheese dressing was bland. 
My husband's pork and wings combo was luke warm, Texas toast was hard as a rock and he ordered fries, they brought slaw.
When I told our server why I didn't eat my salad, she said she would have it taken off. The manager, Shawn, came over, half apologized and basically called me a liar. Said the lettuce was fresh and delivered that day. It may have been delivered today, but he received it bad. 
I am a customer service professional, you never blame the customer."}
{"text":"Alison was a great server. I was trying to select a beer so she brought 5 samples....and would have brought more. Fast and efficient. Food came out fast, hot and GREAT!  Philly cheese steak was awesome. Fries....to die for. Ask for Alice (manager). Got a connection to those Jersey Boys.....cool stories.  A not to miss eatery."}
{"text":"Being a craft beer lover, I was happy to see Duckworth's in the neighborhood when i was in Huntersville for another event.  I just had to stop.

I have only been to the Park Rd Duckworth's so that's what I have to compare it to.  This one is well above the Park Rd location.  There are so many differences.  First off, parking.  Parking at Park Rd is limited and that actually forces me to go elsewhere sometimes.   For this location, it is in an old O'Charley's in suburbia so there is plenty of parking!

Then there's the draft beer selection.  They have a wall of taps behind the bar, at least double what the Park Rd location has.  Also, they have taps out on the floor where you can \"Pour your own beer\".  There's a process for that, you have to get some sort of card and then use an iPad to select your beer and then pour.  Looks like a great setup  but I just had the server bring me my beers.

What I loved about this place is the short list of bottled beers.  The Park rd location had more bottled than draft, or so it seemed.   

As for food, this is where I wasn't impressed.  I just ordered a couple of apps.   The fried pickles were extra fried and really had no flavor.  The smothered fries with bacon were soggy.  and the bacon bits were tiny.  

Service was decent.  My server was quite busy.

So overall:

Accessibilty: 5 stars
Beer Selection:   6 stars
Service:   4 stars
Food:   2 stars

Average rating:  4.25"}
{"text":"The staff is friendly. Pretty standard pub fare. The drink menu comes on an iPad which was pretty cool. They have onion rings as an app but they don't come with any sort of dipping sauce according to the waitress we had. The grilled chicken sandwich was alright until I bit into a HUGE piece of cartilage so chewy and big and absolutely disgusting I had to stop eating it and ended up throwing away a whole half of it. The French fries appear to be homemade, those were absolutely delightful!"}
{"text":"There is nothing horrendous to lament about. But there is also nothing worth bragging over either. We got the signature fried chicken sandwich, fried banana peppers and shrimp tacos. They were all ok. Service was ok. There is no reason to recommend this place but if you are in the neighborhood it won't ruin your day"}
{"text":"Get the wings!  Fajitas are quite tasty too. Lots of beers to choose from and tons of TV 'so to watch. It's pretty noisy so bring the kids!  Best wings ever and I'm a picky wing eater. We will be back again. And,again ;)"}
{"text":"Food is good!  Beer is great!  The bartender is awesome - Michele!  She has been here since they opened and is the absolute BEST!  Thank you Duckworths for hiring great people and it keeps me coming back again and again."}
{"text":"The atmosphere is nice but the food was just ok.  I wouldn't consider it family friendly but a good place to go and hang out with friends."}
{"text":"Love this place. Great beer selection! Kid friendly. Date friendly. The atmosphere is great and the kitchen staff is willing to customize your order around allergies."}
{"text":"Stopped by Duckworth's for the first time for lunch with no specific expectations. Upon arrival the hostess Grace was extremely friendly and attentive as she sat our party. The expansive choices of beer were extremely impressive. We ordered the Philly Cheesesteak and Baja Tacos both meals were very delicious. The staff was courteous and the food was served promptly. I would definitely recommend and will certainly return."}
{"text":"It's a sports bar.  They have a pretty great beer list and a lot of tv's but I've never loved the food.  A great place to watch a game but if you are wanting great food, I have yet to love and highly recommend anything I've had.  With that said, I'll go back & keep trying to find something to love.  Service can be slow but it is still a good place to take a group.  Good location in Huntersville."}
{"text":"We stopped here tonite for a pint and appetizers. Excellent beer Selection, and you can even get a flight sampler. iPads on the table with beer selections that you can email to yourself for later. Awesome place!"}
{"text":"Food is always good. If the parking lot is full, you might have to wait longer than you want for your food to arrive.
I've had burgers, cheesesteaks, pizza and  grilled veggies."}
{"text":"Great place to eat and enjoy a fine selection of beer. Each employee goes over the top explaining their system and the setup is fantastic.  Definitely be going back."}
{"text":"Great place to eat! Food was delicious and the wait staff very attentive to our needs! I will definitely come here again!!!"}
{"text":"Food is sub par, not even good bar food, great ambience, beers are high priced. Good parking."}
{"text":"Traveling abroad has spoiled my beer taste buds and it is great to finally find a place that carries those hard to find bottles of greatness!  They have an extensive beer menu and the food is just as great!  They card everyone, as it states on a huge sign before you even walk thru the door, so have your ID ready.  They have Ipads that explain each one of their beers.  The prices are cheap compared to a majority of other places, at least up north.  I strongly recommend this place and the server Nathan was awesome, I would request his section."}
{"text":"Fun place. We needed a restaurant that had a good variety of choices and this place fit   All 5 of us were happy with the apps, drinks, and meals
They are known for their wings so we had to try that. Arrived hot and cooked perfectly 
Steak salad was a winner 
I was told the burger and fries were wonderful 
Kids liked the pizza
The salad was big
Not too noisy 
Perfect to eat and hang out not rushed out at all"}
{"text":"Duckworth's has an amazing draft beer selection, literally around 150 beers on tap. The mommoo's wings, well done with blue cheese and fries are the perfect game day meal. The Barbecue sandwich and Carolina Burger are also some of my favorite menu items. Great place to watch NBA, NFL or College games. With tons of TVs and good service, it is a great spot."}
{"text":"Just OK. Its really just OK... lol  Service is spotty and the food tastes like it was frozen and just heated up. Nothing to write home to mom about. Good beer selection, so if you are going just for the beer then it is good."}
{"text":"Get the nachos.
Just do it.
I got some salad with grilled chicken and the chicken was burnt and the waitress never came back to check on us so whatever, the nachos made up for it."}
{"text":"I needed a place to chill and stare at a TV. They had plenty of those. 

The service was amazing. My waitress was always around and attentive to my needs throughout the meal. 

This was my first time in, so I had to go with the burger. They make their patties fresh on the spot and it was evident. Each burger patty is pretty thin so they make up for this by doubling up. Good call. 

I think there are 120 plus beers on tap and they use an iPad to showcase each beer and what you can expect from color to taste. 

Well worth the trip and reasonably priced."}
{"text":"Love duckworths. Always get good service . Awesome beer selection good food and a great kids menu. Never had bad service at this particular location and come here regularly with my daughter."}
{"text":"Love love this place. The food is always wonderful, attractive, and reasonable. Service was great. This is why I keep coming back."}
{"text":"Our favorite local bar/restaurant. Best wings in town (get the sweet and bold gold). Unbelievable draft and bottled beer selection. There is usually a bit of a wait during peak hours and on game days, and for good reason - grab a drink at the bar and they'll buzz you when your table is ready!"}
{"text":"Duckworths is just a great staple to stop into and grab some food/beer - never seems to disappoint.  There food is so/so for a chain and they always offer a wide variety of beer.  This location is kept very clean and has an open bar area to sit in."}
{"text":"Great beer selection! I love that they have TONS of tvs. This place must be slammed during football season. Tried the wings and I can see how they are award Winning. The garlic fries are amazing. I had the double Applewood cheese burger and although I'm pretty sure  it's insanely unhealthy, I enjoyed it. I would definitely be back here again."}
{"text":"Great bar food. Honest hot wings were hot & tasty, my jalapeño chicken was okay, my husband's rib eye steak was to die for. The garlic fries are great & ask for extra garlicky,  they are even better. Cupcakes finish off a perfect meal & the beer is endless."}
{"text":"Pretty good food, so many beer options. It looks like it gets pretty busy in the afternoons, especially on football days but the wait staff is great. Will be back!"}
{"text":"March 22, 2018. I had lunch here as I usually do. Ordered cheeseburger special with garlic fries and a side of ranch dressing. A waiter runner (not my waiter) brought my food, sat it down and turned and walked to another table. She left so fast I didn't even get a chance to ask where my dressing was but she didn't even bother to ask did I need anything. I thought ok, maybe she will come back after she drops off the other plates she was carrying. Nope! She never stopped back by. But nor did my original waiter. I said ok maybe someone will come by and check on me. Never happened! I finished eating my food without ever receiving the dressing I asked for. No drink refill. Nothing. Soon as I finished my original waiter comes up and ask me how was everything I said the food was great but the service was terrible. I told him no one came to check on me the entire time I was eating and I never received my dressing. He didn't say a word. I said just bring me my check please. He runs off. He must have told one manger because the manager comes and asks me if everything was ok. I explained and told him how I'm a regular and has never had that bad of service eating here. He was very apologetic and offered to excuse my bill. I said no I will pay because the food was fine but the service was terrible. He said no your bill is on us because service is everything and it wasn't good so it was on the house. I said thank you and we talked a little more and told him I will be back and he said they are working on improving the service. He was very appreciative of the feedback and ensured it would improve. I have to say I truly enjoy eating at Duckworth's I love their burgers and fries but I've seen over the years so many new people and service is hit or miss. It wasn't always like that and I hope they can get back to a solid service team."}
{"text":"The drinks were weak and I never got the jalapenos that I asked for but the burger was delicious and the garlic fries were awesome.

I tried to count the TV's but lost track after 50 so if you're a sports fiend these guys can satisfy your need.

2013 #185 / 365"}
{"text":"What a terrific bar! With 112 beers on tap it's hard to go wrong. We just happened to walk in on a Wednesday night when all drafts were $3.50! Dangerous, huh? The bartenders will let you sample anything until you find what you like. 

Really great atmosphere with a lot of open air seating in screened in areas plus a huge bar. They also had tablets all over the bar highlighting their extensive draft list. You can even choose favorites & email them to yourself. After a long night of $3.50 drafts, one could see how you might forget a thing or 2!

Food? Let's start with the jalapeño bacon that comes on or can be added to just about anything. It is as good as it sounds! I got the bacon on a chicken club & hubby got it on a Philly Cheese Steak. They actually had several Philly options on the menu, which made my guy happy. Really good bar food. 

We met the manager at the bar & begged him to open a Pittsburgh location. He said he's concentrating in Charlotte for now. Turned out this bar is relatively new. Considering it was crowded, seems like people know a good thing when they see it."}
{"text":"We stopped in around 9:30-10p after attending a birthday party on the lake. We were greeted by friendly hostesses and seated immediately. Our waitress was very friendly and helpful. We've come here at least 5 times in the past so we're pretty familiar with the menu. I ordered an Angry Orchard and my husband tried one of the many beers on tap. For our meal, I ordered the grilled salmon mixed green salad and my husband ordered the grilled Caesar chicken wrap with fries. We also ordered the caprese salad as an appetizer but our waitress forgot to bring it out before our food so we simply took it home and enjoyed it the next day. Our food was great!! My husband's fries weren't as warm as he likes (they were fine to me) so he asked that our waitress bring out warm fries. She graciously agreed to, and promptly brought out a new order of fries. I would recommend this restaurant because it has a relaxed atmosphere, PLENTY of beers on tap that they'll let you taste before ordering, the staff is very friendly, and the food is very reasonably priced!"}
{"text":"My wife and I chose to dine at Duckworth's Grill & Taphouse by recommendation from a friend of ours. It was around 7pm on Thursday evening. They were very busy which is a good sign and we decided to sit in the Bar area. Our server was Kelli who later let us know it was her first night. My wife ordered the House Pinot Noir wine with her grilled Salmon and I ordered an Allagash White Draft Beer along with the Buffalo Chicken Pizza. Everything came out in a timely manner and we were overly satisfied with the quality and value of everything we ordered. Kelli made the dining experience fun and relaxing and she seemed to enjoy working there. We will definitely be back and recommend to all that are looking for a casual restaurant in the Ballantyne area. Great atmosphere, TV's all around with any sports game you could imagine, excellent Beer options on Draft, daily food and drink specials and relaxed dining atmosphere."}
{"text":"This was my first time here. I ordered the full rack of ribs with fries and 
slaw and garlic bread. Ribs were okay, bread hard not much garlic, slaw 
was good but fries were horrible. No flavor and over cooked! A great place watching your favorite sport or drinking. My husband ordered a burger. He said it was good. May go back again and try something else."}
{"text":"Go for the beer! Repeat, go for the beer! My mister and I capped off his Valentine's brewery crawl with what intended to be a quick bite to eat, but we ended up staying much longer due to the iPad loaded with tasty adult beverage options. The variety on tap is topnotch, and I appreciated that our waitress offered to grab samples for us to try. Between the huge beer list and the televisions wrapped literally around the place, there is a lot of fun to be had at Duckworth's. 

Now, the only miss for us was the food. I ordered the shrimp with fontina flatbread and my mister ordered the margarita pizza. Both were just okay, and frankly a little on the greasy side. We had a bit of a wait for our food, but without us even bringing it up, the manager stopped by, apologized, and offered free appetizers or salads for our wait. Gold star for customer service on that one."}
{"text":"Great food. The Carolina BBQ is awesome. Huge variety of beers on tap.  Most from local Breweries. Great service. Awesome bartenders."}
{"text":"Excellent beer selection! Phillis, wings all great, try the fried pepper rings! If ever even close to this area againI will be back!"}
{"text":"Huge menu, great appetizers, and extensive beer list. The service was amazing and quick. Four stars only because two members of our group ordered chicken philly sandwiches that were served pretty burnt :( other than that, great experience and would come back"}
{"text":"I'll upgrade my previous reviews based on atmosphere, service, and ribs. 

I sat at the bar with a friend, and it was an enjoyable experience. I ordered some kind of Avery beer (not the same Avery beer at Parry's/this was darker), which was enjoyable. For food, went with the Ribs and Wings combo. I wasn't blown away by the Lemon Wings like everyone else I have spoken to (including who I was having beers with), but here's the breakdown:

Ribs: 5
Wings: 3
Fries: 4
Atmosphere: 4
Service: 5

Regardless of your menu intentions, when you go to Duckworth's, you should always expect good, not amazing. But that's still better than a lot of other options, especially if you're a beer drinker. However, the beers are expensive."}
{"text":"We do not understand how it took us so long to discover this place! I truly believe that Duckworth's has mastered every single item on their menu and they show consistency every single time we go in no matter what time of day or what day of the week. The food is absolutely delicious and mouthwatering it's never disappointing. The chicken wings are AMAZING! Make sure you get mamoos flavoring. They are definitely worth it and do not skip on them. Their blackened chicken sandwich is extremely moist, flavorful, and out of this world! We went in with the larger group and finally ordered the nachos. They are huge and so worth it!!! Get them with chicken! Honestly I have never gone in and been disappointed. They really know what they are doing here and they should be extremely proud of it. We are so happy we found this restaurant and we are already regulars. Honestly just go in and order what you feel like because this place is not a disappointment. Oh and they're flat bread pizza is amazing!"}
{"text":"I've been to the Park rd and Mooresville locations so I pretty much knew what to expect from this one. It didn't disappoint. Good beer selection, large menu with dishes you won't find at typical chain type places. The cheesesteak with the fried egg is really good."}
{"text":"Great Carolina  BBQ!  We haven't found any better, and a great price!  Salads are excellent too.  We love the beer selection.  This is The Place for great food and beer."}
{"text":"This place is terrible and has the worst service ever. I have waited an hour to receive a pizza that was burnt when asked if they could make it again and was told that that's how all pizzas come out. Manager wouldn't come to the table and speak to me personally. After the waitress walked away and came back with menus I was going to order something else but decided It was to late to do so. I also had to pay for drinks that cost me almost $6.00 that barely got drunk.This is complete crap. The manager there Shawn is awful. I will never be back again. If only I could give this no stars I would. Stay away from here."}
{"text":"The size of the new Duckworth's large.  We dined on a busy Friday night and was seated immediately.  Service was exceptional.  They are completely hi-tech with their drink menu on an IPad that accompanies you to your table.  Family friendly atmosphere and the number of TVs will entertain everyone.  Start with a house favorite the homemade chips and ranch and the whole family had cheesesteaks.  The garlic fries were money!"}
{"text":"So....much...beer! 

I'm visiting family nearby and they know how much I love craft beer so they brought me here tonight. So impressed by the beer list! Loved that they give you an iPad to check out the selection, what a cool idea. It's especially awesome because you can click on all the beers to see the ABV, pour size, Beer Advocate rating, and a general description. And it just so happened that I was here on $3.50 draught night so I was pretty psyched.

The food was okay but not remarkable, solid selection of bar food. It kind of struck me as a better version of Buffalo Wild Wings. I got a Cobb salad (which was supposed to come with mixed greens, but the 'mix' appeared to be romaine and iceberg) and it was huge!

I wish I was staying in the area for longer, I would love to come back here!"}
{"text":"Cheese steak yummy.  Loaded fries OVERloaded.  Sweet waitress and manager made a point of stopping at our table and asking how everything was.  

I was starving and now I'm full and satisfied! 

Family friendly.

Great menu/ something for everyone (and a long list of beers)"}
{"text":"This place was fantastic! Walked in at 6:15 on a Friday with no wait! Waitress suggested the pizza special (chicken carbonara flatbread) and boy was it yummy!!  Food arrived quickly and was hot! AND free wi-fi! My 2 year old and her iPad were happy about that! Will definitely return to try the delicious looking strawberry shortcake cheesecake for dessert!"}
{"text":"So, if my wife were writing this review, it would have gotten 2, maybe 1 stars but, since I'm writing it, I'll give Duckworth's a break.  Now, I did see and taste what she ordered and get her point but, why order blackened shrimp tacos at a place with a menu that offers, 6,000 different options and will likely only get a few of them right?

I got the original cheesesteak and knew it would be fine as I've had them at the Mooresville location. Guess what, it was good!  I particularly like the choice of many different cheeses, including Whiz on the sandwich.  Now, on the the aforementioned tacos.  These things were bad.  Shrimp?  Rubbery, frozen tasting and not even close to blackened.  Boiled in some mildly spicy something perhaps?  Maybe, maybe not.  All was served with an overly slimy mango salsa inside too thick corn soft taco shells.  Ick!

On the service side, things were good.  Fast, with a smile, appropriately chatty... Most of what you would expect.  I like what they've done with the space and the extensive beer selection so, will come back for sure for apps and beer.

All that said, this place looks like it will make a killing here in Huntersville.  It's not a chain (well, not in the zillion locations sense of the word anyway), serves food that the majority of folks will find good enough and the place seems well run.  My suggestion?  Remove about two thirds of the menu and focus on getting a more reasonable amount of items perfect. For me, I'll be sticking to the wings, cheesesteaks and beer side of things and enjoy good service and a lot of TVs during football season.  My wife?  Not sure I'll get her back here."}
{"text":"Great food, great beer, great service, and great atmosphere!  I had their Philly Cheesesteak without bread and onion rings...it was delicious!  I bet it's a million times better with the bread.  My sister got the queso which was the perfect mix of cheese and tomatoes; however, the chips were a little too salty at times.  The waiter we had was fantastic too!"}
{"text":"For this type of a restaurant (family and group friendly with plenty/TONS of beers on tap, tons of food and many TVs), this is 5-star. Went here for the first time today at lunch on a co-workers recommendation. It was great! Their soda machine seemed off (like maybe too much syrup dispensed?), but the beers were flowing.

They have great wings, fried pickles, homemade chips, burgers, pizzas, flatbreads, salads and tons of other \"American\" food offerings. I went with the philly that had jalepeno infused bacon, and wow! it was spicy, so make sure you have plenty to drink, but it was amazing. 

Also, for the side, I was told I just HAD to try their veggie medly. What? I wanted fries or onion rings... but I did it and boy am I glad. For the record, my philly had a few onion rings on top, and they were not impressive. But I've heard their sweet potato fries are great too.

Now, back to the veggies. Usually, as a side they're bland (flavorless) and either dry or oily. These were enither. They were quality/fresh veggies (squash, zucinni, peppers) and were deliciously grilled to perfection.

I cannot wait to go back. Also, they have a HUGE wall with beers on tap. Whatever they don't have on tap they probably have in the can or bottle. They also have a bottled wine dispenser (keeps their open wines fresh!). Some of the tables have self-pour taps (neat!) and they lend you an Ipad with their many drink options.

This is in the old O'Charley's building in Huntersville, across from the public library. They did a really nice job of rennovating this place. The only other complaint I have, which my firend warned me of, the floor is very slippery (potentially dangerous). Hopefully they fix that soon, especially with all the beer they serve.

I cannot wait to return with my husband. He'll LOVE it. If you like House of Beer (but wish it had great food) or like Taco Mac's setup (beer taps, TVs), then you'll LOVE this place. Glad to see it here - would love to see the Mooresville locaiton rennovated like this!"}
{"text":"Always awesome!  We go here regularly.  The food is great, especially the fajitas and the staff is extremely accommodating!  I definitely recommend Duckworth's Huntersville, NC!"}
{"text":"Pretty good food, however take out is spotty. The wings are really good. The flatbreads are okay. The burger I got was small and not worth $9-10! So small and bun was hard."}
{"text":"Tons of beers to choose from and the food is really good! Great salads too if you want something lighter. If not, try the fried banana peppers!"}
{"text":"Friends suggested Duckworth's Grill & Taphouse for a place to meet for dinner and I am glad they did.  We were immediately greeted by a friendly hostess and quickly seated at our table.  We started with an order of the loaded nacho's which is piled high with all kinds of goodness like cheese, onions, tomatoes, jalapeño peppers, sour cream & guacamole. When they say this is for sharing, they mean it.  By the time our entrees made it to the table we were already full from the nachos and we all just asked for to-go boxes.  

Duckworth's has a great atmosphere and  is a good  place to kick back with friends, a few drinks and a pile of nachos."}
{"text":"Lots of beers - lots of choices!!  I sat at the bar and I needed a guide.  Lauren was there to help me through the JUNGLE of beers!!!  After I picked the first one, I was disappointed.  She poured me samples of some others in my taste range and we found the perfect beer.  Candice followed up with great food service and EXCELLENT follow-up on the beer AND the food!!  If this is the level of service that you get when you first walk through the door then this is definitely somewhere you need to go when you're in Huntersville!!!"}
{"text":"The food here was great! Service was quick and the beer selection was wide. All 6 people in our party enjoyed their dinners - most had the Philly cheesesteak! Highly recommend this restaurant!"}
{"text":"Just popped in to have a burger. Waitress was super nice and the burger was great. Nice selection of beer on tap"}
{"text":"Oh..I like this bar! My fiance and I love coming to Duckworth's! We live right up the street so it's very convenient in our neighborhood and just divey enough for us to relax but not gross at all. DW is a relaxing bar with tons of beer/drinks and great service. Food was ok. We had Carolina BBQ sandwich and grilled salmon. You might need to skip this but relaxing with awesome drinks instead.

The atmosphere is clean. Good for family and friends just to have a chill night out. Portion and prices are reasonable. Drink more beer here!"}
{"text":"Absolutely love this place! They have the most beers I've ever seen on tap! 112 at my last count! Wow! 

The food is always good, the service is always top notch, and beer is always cold. What more could you ask for? 
This location is much better than the Mooresville location in my opinion. Definitely worth the 20 minute drive for this place! :)"}
{"text":"Love this bar!

Other reviews state that it's a loud bar. They are right. But it's not obnoxious loud, just people having a good time at a bar loud. I won't say that it's not family friendly but I would pick and choose what company to keep when you're here. 

I sat at the bar area and had the perfect seat with a great bartender. There are multiple TVs above the bar that are very big and clear. The only downside is that there is no TV sound so it takes away from the sporting event being watched. Also, there are no purse hooks at the bar #thestruggle. 

They have IPads for drink menus which is pretty neat. They run a little on the slower side but it doesn't take away from the experience. 

They have a ton of beers on tap of all ranges. The bartender assisted a lot with helping my small group find the perfect beers. I also got a Sex on the Beach and a Royal Flush shooter. No complaints- made perfectly. My bartender was excellent- wish I got his name. He definitely had a big hand on the night being a fun one with no added stressors. 

Food is also very good. Our group munched and didn't order any entrees but I definitely will be trying some items in the future. The friend pickles are delicious and perfectly seasoned. Everyone else had wings and destroyed them. I also got the cheesy bacon fries and they had Old Bay Seasoning on them- delicious! 

If you want to hang out with friends/family, this is the place to come. Prices are reasonable. Food and drinks are good. I would suggest carpooling if you want to come on a weekend night because parking can be on the ridiculous side."}
{"text":"The wife and I love craft beers, so this place is right up our alley. Over 100 beers on tap, with a nice influx of new beers pretty often. Wide selection of bar-type appetizers and entrees, but she and I are stuck on their Cheesesteaks and pizza.

The supreme cheesesteak with peppers, onions and mushrooms is excellent, but my wife loves the Smokehouse Philly, blended with chopped jalapeno bacon, BBQ sauce & Pepper Jack cheese. They don't go too heavy on the BBQ sauce, so it adds a nice flavor without being \"gloppy\" or soggy.

The big surprise for me is the pizza. It is honestly some of the best I've had in the area. The crust has a nice crisp to it, a good flavor and you can taste a little olive oil brushed on the crust, and they don't skimp on the toppings. The supreme is good, but the meat lover's pizza is fantastic. It's more expensive than Domino's and Pizza Hut, but you get what you pay for in this case.

We always go on Mon. or Wed. night when almost all the draft beers are $3.50. On Monday's, they have a deal on Fajitas (never tried them) and they offer a special on their pepperoni pizza on Wed. ($8.99 for a large). They also knock $5 off the meat pizza on Wed., which makes it a really good deal. I can't speak to the other items on the menu, other than that we did have the Blue Cheese-covered potato chips as an appetizer once and really enjoyed them. 

The other thing we like about the place is that there is a nice bar area, and then more of a family-style seating area as well that works well for the different clientele (we always sit in the bar area). There are flat-screen TV's everywhere, so it's a great place to watch a game. Service has always been great as well.

It's a regular go-to spot for us."}
{"text":"The server I had seemed a little pre-occupied. There was a group of 3 of us and our drinks stayed empty before she would come back. It was later, about midnight so the store wasn't packed. She took our order and didn't come back until after our food was brought out by someone else. Then didn't come back until we were done. Then another 5 minutes passed and she finally brought our checks. The dining experience was not good at all. The food was great as always though!"}
{"text":"We are visiting out of town, Yelp gave it great reviews stating it has a near perfect rating. We were not impressed, it was moderately busy. We did go on a Sunday night. Appetizer we had the fried pickles, decent. Entrees: Carolina BBQ sandwich and chorizo burger. The sandwich was not good. My friends burger was yummy and I was sad about my choice. Garlic fries were okay. We had mixed drinks, but after the very juice filled drinks we switched to a bottle of wine. We spent an hour after she cleared our plates waiting on a check. Not impressed."}
{"text":"This place is AWESOME! We had the fried basil burger do die for! Tuesday 1/2 off bottles of wine... Beer samples too. Will definitely be back!"}
{"text":"Food is always great and they have the best selection of craft beer that I've seen. Highly recommend."}
{"text":"Great food and service. Everything was cooked how we wanted it. The server was friendly and seemed glad to accommodate the requests of the 2 young children with us. We will return."}
{"text":"The ambience is nice. The idea or 100+ taps is nice, but the food (wings aside) is god awful. Everything is over cooked and tastes as if you  burned it on the grill too long."}
{"text":"Finally got there last Saturday to check it out.  

The beer list is amazing.  That is for sure.  But I felt a little cheated by the way they price and serve the tap beer.  Only 14 ounces vs. a full pint yet the prices are the same as at other similar type places for the full pint.  Same thing with the special beers.  11.5 ounces vs. the full 12 ounces at other similar places.  Kind of felt like they were trying to sneak one by you although it does say the size of each beer on the printed tap list.

The food was average bar food.  I only had the wings and some onion rings, but what I saw at being served to the other people sitting at the bar near me look no better.  Their \"Jumbo Wings\" as stated on the menu were average size, and average taste.  The onion rings were clearly out of a frozen bag but OK.

A high point was the bartenders were friendly and attentive.  BUT, as I watched one of them inexplicably moving clean beer glasses from a shelf on one end of the bar to a shelf on the other end of the bar for no apparent reason, I was shocked to see him repeatedly put two clean glasses under his arm in an effort to carry as many as he could in each trip.  The end you drink from right up into his arm pit!  Completely unacceptable.  I am sorry but I cannot ever go there again for a beer having seen that.  And who know what else is going on there."}
{"text":"I was super-excited to see that Duckworth's was opening nearby. I've been to the Mooresville location and was a fan of the place, particularly the beer selection. Having a location close to home is great, as Duckworth's makes for a good casual place to have a casual dinner and beer. 

We headed in on a whim at around 6:30 on Wednesday night and the place was hopping. The interior was a bit too loud at first, but our table ended up being away from the bar area and was much quieter. While it's a sportsbar feel, it's still a family-friendly place and there were plenty of kids running around.

Despite the heavy customer flow our waitress remained attentive and did a great job.I initially assumed it was so busy because it was still relatively new, but the Wednesday $3.50 draft special was probably the reason. The beer selection is expansive, and almost a headache to read. The front cover does mention which craft beers to try based on which of the more well-known commercial beers you prefer, and is organized alphabetically by brewer, along with the type of beer it is (stout, lager, etc.) Most of the drafts are usually between $5-7, and most of these can be used for the $3.50 Wednesday special (though we were only charged $3.24 for whatever reason.) I just wish the beers were better organized. I would love to see them separated by type of beer, to make it easier to find the kind of beer you are in the mood for.

The menu is all over the place, and reminiscent of something you would find at an Applebees or Chilis, but with better quality food. There are burgers, wraps, sandwiches, salads, fajitas, tacos, steaks and plenty more. I ordered the Chicken Bacon Wrap ($10.99) which was some chicken breast, bacon, lettuce and honey mustard in a wrap. The chicken wasn't dry or rubbery like you get at some chain restaurants, but the bacon was like those canned bacon chunks as opposed to a nice thick strip. The wrap itself was a good-sized portion and I was content with it. As a side I got the vegetable fried rice which was some rice cooked up with peppers, corn and some other veggies. It had a good heat to it, which only made me drink my beer faster. 

The missus' got the Vegetarian Fajita ($9.99) and it came out on a massive plate. There was a huge helping of rice and veggies to stuff into the flour tortillas. She really enjoyed it, and had a ton of vegetables leftover for dinner the next night. 

The Chili's across the way is going to be in trouble with Duckworth's now in direct competition. Why go to some huge chain for mediocre food when you can get slightly better food but waaaaaaaaaaay better beer? Next time we're in a last-minute pinch for a cheap meal Duckworth's will be the place to go."}
{"text":"We have eaten here a couple of times, but this past Sunday was great. The waitress was very personable and the grilled chicken wings were awesome (and extra spicy). The atmosphere is family friendly but they also have a great bar area and lots of choices on tap."}
{"text":"We (group of 10) walked in around 6 pm on a Saturday night and sat down immediately at a high-top table in the bar. Our server was wonderful...got our drink orders then food orders quickly, checked on us frequently, refilled our waters as necessary, all while having a great attitude, despite our large party and separate tabs, etc.

Everyone at our table really enjoyed their food and several of my friends have been back since! I know I can't wait to go back!"}
{"text":"We went for dinner and it was packed! All the TVs were on and the entire place was full. That being said, maybe they shouldn't just put tables wherever to accommodate people waiting. Our table of 4 was in a place where there was such high traffic and the servers were constantly bumping into us. Maybe, just maybe, don't put a table there!! We got the loaded nachos and they were huge! And delicious! We all got salads for our main course and we were all full. I think I'd like this place better if it weren't so busy."}
{"text":"This local chain is good if all you're looking for is beer and some apps. While their food is actually pretty good, I feel like the pricing is disproportionate to what you get. The beer selection is off the charts though, my boyfriend and I frequently go here on Friday nights to watch whatever sports are on and throw back a couple new craft beers we've never had before."}
{"text":"Service has been great lately and food outstanding. No complaints at all. Just wish it was closer to my house."}
{"text":"Rib high recommend !  Environment is good beer is good. But food wait for long time.   Was be there 2PM. Not busy at that time."}
{"text":"I really enjoy this place, and love how close I live to this location.

Yes, this is a sports bar, so there are tons of TVs...Yes it is loud.  Their food for a \"sports bar\" is amazing.  If you're a beer lover, they have tons of beer on tap and in bottles. They know how to do a cheese steak!

Hands down, easily the best BEER bar in the area"}
{"text":"I go to DuckWorth's once a year when I am travelling in NC.  I don't know whether my impression has changed because I have or perhaps they have.  What was considered unique and cool a year or two ago has become commonplace and that is where this is lacking.

The industrial Craft Beer bar is here to stay.  At first, walking into a place with over 100 craft beers from all over the world (and some not so crafty) was cool.  Everything you could want and ask for.  However, while this was unique at the beginning - over time the concept has been copied and is no longer unique.

All of this is saying is my last experience I was underwhelmed but maybe it was me.  First, the beer selection is great but the waiter/bar tender has to be a little more creative than \"What do you like?\"  I like all beer, what do you recommend, why and how is it different from something else.  I settled (yes that is the right word) for a brown ale - forget which one - which was good but not really anything I remember (as testified in previous line).   I switched to another beer - hoping to improve the experience but again it get my motor running.  

Now was the time for the food to jump in and make it a remarkable night. I went for one of the flatbreads - it was good but needed more.  This was the problem - at that time I really couldn't find anything on the menu that would stand up and complement the variety of beers.  I ended up with chicken wings which were good but I think those should be eaten with Bud or Yingling.  

Oh well, vibe was okay but again a little too industrial.  Good place to go, but no longer a destination in my mind.  Maybe I am just moving on ...  I hope not."}
{"text":"One of my favorites,  good food,  great service. Keep up the good work.  Good wings and sandwiches and beer selection."}
{"text":"It's nice to have a new place to go in Huntersville!  What a great selection of beer on tap and anyone can find something on the menu since there are so many options.  The food has been great every time we go.  The only negative thing I can say is if you sit in the bar area the service isn't that good."}
{"text":"If you want to sample beer from all over, this is your place! You get an IPad to scroll 100's of different Beers. The food is NOT your regular bar fare. I highly recommend the Buffalo Chicken Philly. Flavorful with onions and ranch sauce along with the awesome bread it's serviced on! I always ask for an extra cup of Buffalo sauce to really dose the chicken! Their house made chips are a great side!

A lot of other options- recommend their pizza and salads if a sandwich isn't for you. Have been here many times and service has always been very good!"}
