{"text":"This place is an absolute gem. The food is amazing, the staff is extremely friendly and service is quick. I had the Haus Stickers, Haus Noodle Soup and Xiao Long Bao ( soup dumplings) and everything was soooo good! If you live in Madison or just happen to be visiting, make sure you stop by this place."}
{"text":"Good Food, but WAY OVERPRICED!!  I have been there twice since it opened, mainly because I missed authentic Chinese food.  I've only had the noodles there, and they are very authentic and taste good.  However, this restaurant definitely skimps on the amount of \"other stuff\" you get with your noodles.  My noodle soup consisted of just noodles and some spoonfuls of broth plus tiny amounts of canned veggies and strings of pork.  Flavors are good, but in my opinion not worth the price.  I'm only going to be coming here for cravings, definitely not going to be a regular.  If they dropped the price I'd probably be a regular."}
{"text":"Hilldale has three of my favorite restaurants including Dumpling Haus. I love the seasonal veggies and xiao long bao - reminds me of how my parents made it. It's a little expensive compared to what prices are in China or select Chinatowns in the U.S. but this is Madison so you can either get reheated and shrunken dumplings from other restaurants (which aren't that much cheaper) or you can get fresh good quality food at Dumpling Haus."}
{"text":"Not entirely sure why a chinese restaurant would name it self a \"Haus\", except maybe that it's a pun - \"Bao haus\", maybe?  Anyway.  Overall, it's a nice, minimalist space, with good dumplings and noodle bowls, run by the former proprietors of Yen Ching.   The menu is similar to their old restaurants popular Sunday dim sum menu - Beijing style dumplings, shao mei, a few varieties of steamed bao, and some slow-cooked meats.  The large noodle bowls are a welcome addition - fresh, soft noodles tossed with toppings or in soup.  The tomato and egg noodle bowl is a particular favorite; hearty and savory but not leaden.  The noodles with pork and black bean is heavy on the salty fermented black bean sauce,  which I happen to love but realize may not be to everyone's taste.  A few of the soups are near-misses, though.  The \"pork with pickled cabbage\" is a simple broth with diced pork and Chinese preserved greens, which is admittedly a classic dish but in this implementation none of the flavors really come through.  The dumplings are steamed or boiled, so for the most part are a bit heavier than what most people expect from a potsticker-type wonton.  The filling is a nice balance of pork, soy and seasonings.  The bao are all steamed, and as a nice touch the various buns use differing doughs depending on filling - a slightly flakier one for the BBQ pork, a fluffy dough for the vegetarian, etc.  The BBQ pork filling is a just a bit too sweet, but the other fillings are well executed.  The side dishes of the slow-cooked pork and slow-cooked beef are, however, really underrated and under-advertised.  The beef is a sliced piece of what appears to be a brisket or some other tougher plate cut, braised for a very long time in soy, rice wine and star anise.  It complements a plain steamed bun very nicely.  Even better is the pork, a red-braised hunk of pork belly that is meltingly tender (although very fatty - it is pork belly, after all).  The biggest drawbacks to this place are the counter service, which while in theory would work just fine, tends to be a bit haphazard during peak hours, and the price.  It's a reasonably good value, but everything feels just about a buck-and-a-half too expensive, especially considering how often they've run out of specific items during my visits."}
{"text":"Excellent food! The food takes a few minutes to get to your table but it's worth it as they make it 100% fresh. Just the right amount of sauce/broth to noodles. The dumplings are hot and delicious as well as the steam buns! We typically order the peanut glazed noodles (hot), pork and black bean noodles,  shrimp dumplings, and beef steam buns. The employees are wonderful people, always friendly and great with kids. The place is very clean and has plenty of high chairs as well as booster chairs for smaller children."}
{"text":"What a disappointment. $9 for 10 dumplings and they were barely lukewarm. Not to mention skins practically as thick as the filling. Honestly, you'd be better off buying frozen dumplings from Asian Midway Foods on Park Street or the Garden Asian Market in Middleton and cooking them yourself."}
{"text":"Love, Love, Love this place.  Can't comment on all the dishes since I always get the same 2 - wonton soup and haus stickers.  Nothing warms you on a cold winter day like that soup.  Dumpling are so good.  Just the right amount of pork. ginger and there is a crunch- so so good.  The owner and her staff are so friendly and lovely.  Such a treat!"}
{"text":"This got me excited when they first open but it took me a while to post this review cos I had been undecided. My first experience was meh. But my boss said this is a good place, and convinced me to give them another chance, which I eventually did. So here's the verdict.   Noodles are great. I had the haus noodles which I quite like. The broth is light but flavorful, with a tad of sweetness to it. I also enjoyed the pork riblets and the combination of leafy greens. Very healthy and satisfying. My bf had the dan dan noodles, he said it was too sweet for him.   We also tried their soup dumplings (xiao long bao), they were nicely made, but unfortunately they stick to the bottom, so getting them out individually without breaking the skin and spilling the soup was a bit of a challenge, but it could be done. That said we found the soup to be a lot less flavorful than the ones in Asia/Chinatown, it was also kind of sweet. Plus the skin was kind of thick as well.   One thing I noticed for the food they serve is that they are leaning towards the sweet side, which suits the western taste better. We noticed the majority of diners were non-Asians.   I do like their tasty dumplings are good, though kind of overpriced. It would be a good place to go to once in a while but not something I frequent on a regular basis."}
{"text":"Authentic northern Chinese noodles. This is my favorite Chinese restaurant in Madison"}
{"text":"DumplingHaus was good. The service was fast, the restaurant was clean, and the prices are reasonable. Not the best Dim Sum I've had (what do you expect in the Midwest?) but nice, unpretentious atmosphere and the food is good. Nice big windows and ample seating give the place a pleasant atmosphere. XLB are tasty, though tend to fall apart more than they should. There's an awesome glass wall that makes it fun to look into the kitchen and see them cook.  I highly recommend the XLB (xiao long bao) and pork dumplings. The tea comes in one very large mug, enough for two people to easily share. The water and utensils are self-serve on the side of the restaurant, so feel to grab some water while you peruse the menu."}
{"text":"I was disappointed by the potential of this place. We had the jiao zi, xiao long bao, and wonton soup. All bland! Nothing had taste. We were expecting yummy beef/chicken rich broth. Nothing. It was very underwhelming. The wonton soup had no flavor.....tasted like water. We had to dunk everything in chili paste or soy sauce. Then you had  to bus your own table which is okay but dishes were to be placed in the opposite side of where the trash goes."}
{"text":"For the prices ($7-9 for dumplings or soup), I was disappointed. Perhaps knowing that the cost of what I ordered in Beijing was about 1/12 the cost of here didnt help. The XLB were pretty tasty-- the broth and meat inside were good, but at $7 it was just too much. Haus special soup was average. Barbecue pork buns didnt quite have enough filling I thought, but the little they had were pretty good. I would just suggest lowering the prices or increasing the amount of food, otherwise it is mediocre."}
{"text":"Just opened this past weekend and we tried it for the first time yesterday. The staff was so friendly and patient with giving suggestions for what to order. We were so happy with the food. We'll be back again soon!"}
{"text":"The food was alright, not earth shattering. More than anything the service was terrible! They screwed up out order, and instead of making our food immediately, they spent a good 10 minutes of trying to figure out how they messed it up. So what should have been a 15 minute wait for food, we waited over 30. To top it off, we weren't offered any consultation or compensation for the additional wait."}
{"text":"Excellent dumpling house in any city, and amazingly enough it's inside the indoor section of Hilldale mall! They make the dumplings fresh daily and it shows. The potstickers (Haus sticker) and bbq pork bao's are excellent. Wonton soup was also great. I've spent time eating Dim Sum in Seattle, Chicago, and Dallas chinatowns and was a regular at a dumpling house in Dallas, and the dumplings here matched the best from elsewhere. Wonton soup was also nicely flavored and with fresh ingredients. The shrimp dumplings were our only order that was not wonderful (still not bad though). Note it's not dim sum. You order at the counter and sit down and then you're served as they are ready. Best to share. Next time we'll try a noodle bowl and the shaomai."}
{"text":"Ordered dumplings, a tofu salad, and some noodles for takeout. Can't remember exactly what we ordered but it was delicious.  Nice friendly service with a smile.  I liked it."}
{"text":"Delicious dumplings and fried rice right next to an awesome shopping place! We've tried all the veggie and shrimp items amd each one is delic-some! (delicious and awesome) Great for a quick take out and dine in with friends, family or couples."}
{"text":"Happened upon this gem on a trip to Hilldale mall.  Was not even planning on eating when I walked by but I love bao's and noodles so I figured I would check it out.  Upon walking in I loved that it was an open kitchen concept and I could see all the food being prepared.  Seeing everything being made from scratch had me very happy to happen upon this establishment.  I figured I had found an excellent spot when looking at the patrons in this packed restaurant in very Caucasian Madison, WI that I was the only Caucasian in there at that time.  I ordered the pork shaomai, haus bao zi and the house noodle soup.  All I can say after trying all three of them is wow.  This might have become my favorite restaurant in Madison.  The broth in the soup was incredibly flavorful and the soup had the right amount of braised beef and bok choy to make it a very filling dish.  I had given up on finding a good bao in Madison but this place changed that.  Their bao was borderline orgasmic.     Can't wait to go back again.  The only problem I have with this restaurant is it has ruined eating Chinese food anywhere else in Madison."}
{"text":"I really like the dumpling haus.  I love the soup dumplings - as good as any I have had anywhere - and I love the more homey items like the tomato omelette! My husband's mother makes this for dinner all the time, but I had never encountered it in a restaurant before.  The place is cute and clean.  Yum!"}
{"text":"When I want a hot bowl of soup, from really nice folks, this is where I come.  This is not your typical Chinese restaurant.  Food is light and fresh and very good."}
{"text":"I absolutely love this place. They have high quality food that is authentic and super, super yummy! We had the Haus Stickers, which are their potstickers. The flavors were layered and complex. We also had the xiaolongbao which were phenomenal. The juice inside was so yummy. The noodles were delicious, as well. Prices are decent, here too. Can't wait to go back and try more!"}
{"text":"Ordered the fried rice and shrimp dumplings and I had more than enough food for two meals. Go for the shrimp dumplings - very fresh and delicious."}
{"text":"Dumpling Haus has the best northern Chinese food in Madison (bar none; there isn't any other).  The owners William and Jenny are from Beijing, so all of the food is authentic (Jenny's aunts have a restaurant in Shantong province where they make 5,000 dumplings a day! Dumpling Haus has cracked 1000).  I just returned to Madison from NYC and ate at two of the \"best\" Shanghai restaurants in Chinatown (dumplings) and they don't hold a candle to Dumpling Haus.  Their Zha Zhiang Mein (noodles with black bean sauce) compares to the Zha Zhang Mein King restaurant in Beijing, the place to go.   Two things to the people who complain about price.  First, it's in Hilldale Mall. Second, if you've paid any attention, the cooks are the same people everyday, skilled cooks, who make an actual living wage. They make all the dumplings there. They aren't frozen (Timo).  So if you want real, good food, it has to be made by real, good cooks. If you want crap from a can, it will be cheaper. You can't have both, at least not in the U.S. (Yes, I know there are some exceptions in SF, but that's because they can hire skilled people at rock bottom wages).  And I agree with the posters who say: rate the food, not the price. Mention the price if it bugs you.  Great dumplings and noodles. Worth the price."}
{"text":"I seriously love this place, it's very nostalgic for me. Their fried rice really hits home for me. EVERYONE HAS TO TRY THEIR FRIED RICE. Words can't explain it. When you first get it, the rice is still white so it doesn't look like your typical fried rice but it's packed with just the amount of flavor and not too strong. Their wontons and haus noodle soup is perfect during the fall and winter when you're feeling under the weather. I always have to visit here 2-3 times a month because I love it so much! Will always recommend this place!"}
{"text":"One of my favorite places to eat! Lots of fresh, bright flavors, not too heavy. Reasonable portions and prices, and efficient service. If you go when it's not busy, it can be pretty fast. Be aware, taco bao are taco shaped, not taco flavored, and they're delicious. But you really can't go wrong."}
{"text":"I love this place, I know the owners from their previous restaurant \"Yen Chings\" and they have went from classic Chinese dishes to these new and fresh dumplings, wantons, and noodle dishes but brought their delicious soups along (which I am very thankful for).  I love the people who work here they are super friendly and very funny :)  My favorites are: Hot and Sour Soup  Haus Stickers Veggie Wontons  Haus Noodle Soup   nomnomnom :) enjoy!!"}
{"text":"It's okay.  I think a lot of the buzz is coming due to the fact that the restaurant is new.  The dumplings are very fresh, and although the restaurant is very modern, open and pleasant to the eye, there aren't  many places to sit.  I've been to Umami Ramen and Dumpling Bar on Willy Street and really like the ambiance, service, and food much better."}
{"text":"Great Hous Bao Zi.  I have travelled all over China and really enjoy the buns (Bao Zi) here!"}
{"text":"My Korean friend, who used to be married to a Chinese person, and I went here hoping for a really good meal.  The food was terrible and very very bland.  So pretty much authentic Chinese food.  What made it worse is one year later I saw one of the employees leave the men's room without washing his hands, so again, very authentic.  EWWWWW!!"}
{"text":"Excellent place for nice healing soup. Came here after a procedure at the Gastrology Clinic down the road. Felt like I was getting healed right there. Clean, friendly and inviting environment."}
{"text":"Excellent food, casual environment. Had a variety of dumplings and baos, and they were all tasty."}
{"text":"My favorite neighborhood dumpling spot. Located in hilldale made me a little wary but the staff were friendly and attentive. The food was top notch. I especially enjoyed the Wonton Soup and BBQ Pork Bao. Taking home some red bean bao for dessert."}
{"text":"The dumplings and the noodles are quite plain: I can't say it's yummy, neither it is bad. It is kind of Chinese food, but something must went wrong..."}
{"text":"Yay they have multiple Baos and dumplings. We shared the dumplings (jiao zi), pork and chive baos, and black bean pork noodles (zha jian mien)...or the basics, it seemed. I'll review the noodles first. I have to admit I am slightly addicted to the Korean version jjajangmyun and this was my first time with the Chinese antecedent. I found this to be a little too salty and definitely lacking the flavors that make me eat jjajangmyun every single time I eat at a Korean restaurant. I really can't speak to the quality of the Chinese version but I don't think I'll be ordering this again before I try more on the menu. Too salty, too oniony, just not quite there for me.   The dumplings I had with them on the side were delicious and I could sit and eat those all day. Full of flavor, cooked perfectly, and plump.   The bao was also really good. The dough was some of the best I have had...as someone who has never been to China. The filling didn't quite seem to fill the cavity but it tasted great. Real standard but delicious.    Finally, the red bean bao. These did not disappoint. I am looking forward to trying Chinese custard so I will order those next time but will keep ordering these if those don't turn out to be incredible.   Overall, this is good bao and dumplings. We got the basics this time, but we are looking forward to going back and trying other ones.   Also, their water container is imported from Italy and is awesome."}
{"text":"I tried their shrimp wonton dumplings. It comes in a soup. I loved it the first time, but not the second time. So I guess its worth trying once. I probably won't go back...  They have nice workers though, I left my $400 engagement dress (had just bought from Macy's) in there and when I came back I saw one of the workers had kept it for me."}
{"text":"The dumplings serving sizes I thought were quite expensive for the amount I paid. For ten dollars you get 9 dumplings which to me sounds very expensive for such a simple dish. The 9 dumplings they give are not very large either and I myself am not the most voracious eater. The food they make is very simply and easy to make but they are definitely over charging people. For someone who grew up eating Chinese food, there really isn't anything terribly extraordinary about the food here. If you want to waste your money here at least the food is authentic Chinese food. Note, when going I did not see many Chinese Clientele if that's any indication."}
{"text":"I stopped here for a quick dinner whilst Christmas shopping. I love dumplings and don't get them very often so I was delighted to find this place. They have great prices, I'll say that right of the bat. 8 dumplings for $7 =   I ordered shrimp and pork dumplings to share with my boyfriend and the barbeque bao. You order at the counter and then sit down and wait for them to bring everything out. The chairs aren't the most comfortable, but the dining area is very clean. The dumplings themselves are obviously the small side and they don't have much for flavor. The bbq bao tasted like they were filled with sloppy joe filling. Overall I enjoyed the meal, but I won't be going out of my way to eat here."}
{"text":"A very decent little dumpling house. I find myself making excuses to get out to Hilldale despite being an Isthmus-dweller -- much better bao than most places in town and the dumplings are a cut above.  If you're used to most of the downtown Madison take on pork buns, get the 'taco bao'. This is somewhat confusing as there's a lingo difference -- the pork bun at dumpling haus is probably not a char sui bao as I'd hoped, but more of a minced sausage filling (though also very delicious).   Overall it is casual and unpretentious, serving tasty, fresh food."}
{"text":"Dumpling Haus, near Macy's in the Hilldale Mall, is my favorite place in Madison to get fresh Chinese comfort food (no typical greasy Chinese food here). The prices are a bit high, but the quality of the food is about worth it to me. The restaurant can fill up fast during peak hours, but I've never had to wait long for a seat. It's a quick-casual, order at the counter operation.  My favorite dish so far is the sesame noodle kick, which is a simple sesame, garlic, and ginger noodle dish with diced scallions and sesame seeds on top. It has so much flavor that I don't even miss the meat (and I don't typically order vegetarian dishes). The taco-style bao with pork was also very tasty, although the pork seemed a wee bit overcooked; next time I'll try the chicken. I loved the white fluffiness and heartiness of the bao itself, though. If you're feeling under the weather, do your stomach a favor and try their chicken noodle soup. With fresh noodles, rotisserie chicken, greens, and a nice hearty broth, it's a great comfort dish.   Their nutella bao is excellent. They also have custard and red bean varieties that I haven't tried, but are probably just as good."}
{"text":"Pros: Very affordable price.  Tasty noodles and soup.  Cons: Short list of menu. American Chinese foods."}
{"text":"The soup dumplings are better than the ones in Chinatown in San Fran!  Friendly owners and great food!"}
{"text":"OMG this place is so goody! We went for lunch and I got the Pork Shaomail dumpings they were so good. My nice got the Haus Jiao Zi dumplings they were also very good and we got an order of Fresh Veggies to share. OK your probably thinking what I was thinking cooked fresh veggies no big deal, but wrong they were delicious. After we ate we went to a movie. And decided to call in an order to go so we could have some for dinner as well. This time we got the Sesame Noodle Kick and the Peanut Glazed Noodles cold. Both were so good. This just shows you how good it is when you want to eat it twice in one day:) Can't wait to go back and it's sad that it's too far from my work to go for lunch. It's just not fair:("}
{"text":"I was here for a friend's wedding (we're from Pittsburgh) and we had our nails done in the salon across from the dumpling haus. I knew I had to try it! So the next day I dragged my boyfriend with me and it was totally worth the drive out. The dumplings taste like the ones my mom makes by hand and the bao zi (steamed buns) reminded me of food we would get in Taiwan. Yes, its a little expensive, but if you want something authentic and truly homemade, then you won't mind shelling out a couple bucks. We had the Haus Dumplings, shrimp dumlings, haus bao zi, and the BBQ bao zi. You have to dip them in the accompanying sauce or I mixed soy and the hot pepper sauce they provide. The place was packed and the food took a little bit to come out. But you could see them making your order so you know it was fresh. I only regret is we couldn't come back to try the noodle bowls and tofu salad. Next time we make the trip out to Madison, I hope to come back and try everything else!   **This is not Americanized Chinese food! No General Tso's here! If you would like to try the REAL stuff, give this place a go."}
{"text":"I'd love to give this place more stars because the owners are very friendly and hard working and because you can tell it's very family owned and operated but the few times we've eaten there we haven't been wooed.   We've had the pot stickers,  bao zi, and noodle dishes (Black bean & pork noodles, dan dan noodles,  and tart cabbage and pork noodles) and none have really wowed us with flavor. My black bean and pork noodles came sans black beans and the pot stickers have been inconsistent with the temperature and quality of the fillings.   It's definitely an unique eatery but I don't think I'll be a regular here."}
{"text":"Food was tasty but overpriced for what I got. $14 for a smaller bowl of noodle soup with four tiny steamed dumplings. Nothing on the tables--has to go to cash register for chopsticks or silverware, even napkins. Ordered water which I never received. Orders placed at cash register and you take a number. You self bus your dishes, but not everyone did. Good food--awful service."}
{"text":"Went to Dumpling Haus for the first time tonight.  Ordered the pan-fried dumplings, BBQ Bao Zi, and sesame noodle kick.  The dumplings were excellent- filling had nice flavor, sauce was good.  My husband had the Bao Zi.  He says it was a little dry, but edible;  he'll try something different next time.  The noodles were also quite good, flavorful but not too spicy.  Service was friendly and quick.  I'll go again."}
{"text":"I've been coming here since they were at their old location, and I like the fact that this is clearly a family-run restaurant who has their own, efficient way of doing things.  Service is relatively fast even during peak hours, and the food is consistently of good quality.  For lunch, we had the xiao long bao, pork siu mai, haus bao, and the pork and black bean noodles.  As for the xiao long bao, the dumplings are too close to each other and the wrapper falls apart, consequently taking the soup with it.  I've had better soup dumplings elsewhere, but it fills my dumpling craving when it comes around.  The pork siu mai were piping hot, and when you take your first bite, the meat falls apart in your mouth (in a good way).  The haus bao were delicious, with the bread on the outside super soft and perfectly done, making eating it like biting into a cloud. The pork and black bean noodles are also super yummy; I'm not a huge fan of their noodle soups but this is a dish that I come back for in addition to the dumplings.    If you've never been, I would say that DumplingHaus is definitely worth taking a visit when you find the dishes that resonate with you!"}
{"text":"My friends and I ended up here when Umami had too long of a wait for us.  We're glad we ended up here.  Good sized menu and staff was really friendly.  Service was quick.  Portions were very generous and prices reasonable.  I had the haus noodle soup with beef and haus stickers.  I really enjoyed both items - lots of flavor to both items.  Usually I need to add salt to everything, but not here.  We also ordered the Haus Bao Zi, Veggie Bao, Peanut Glazed, and Chicken Lo Mein.  We all thoroughly enjoyed all of these items.  Pork didn't appear to be a scary mystery meat in the buns as it does at other places, which is a plus.  Would definitely come here again."}
{"text":"Dumpling Haus is an excellent dim sum place.  Everything I've had there has always been freshly prepared, consistently and precisely executed. Dumpling Haus could hold it's own with restaurants in DC or San Fransico."}
{"text":"Pretty expensive, and nothing spectacular. I was expecting the soup in the soup dumplings to be more flavorful. It was kind of like store-bought frozen soup dumplings, but less flavorful."}
{"text":"Good food, reasonably priced.   Unfortunately they don't really do take service (bring out your counter order), so no refills on your drinks.    Portion sizes were small - plan on ordering 2 dishes per person or maybe 3 for 2 people.   If you are expecting fried dumplings, they can do that for a gyoza-styled dish.  However most are steamed dumplings.   I liked my shrimp and my wife's pork shaomai, but the Nutella Bao was a great dessert.   Open seating worked out for us - we pushed 5 tables together and sat 15 for a good meal and great company."}
{"text":"I'm so glad we came here. We just ordered 4 kinds of dumplings and some buns. They we're all very good but the pork dumplings and soup dumplings were our favorites. Next time I'll order noodles too. The kids loved the Nutella Bao. If I lived Madison I'd eat here a few times a month. Friendly fast service too."}
{"text":"??????? ?????dumpling haus?? ??????????? ???????8? ????? ???????? ?????? ?????????????? ???? ??????? ??????bbq bun ?meat paste bun?? ????????????? ????????? ???????????"}
{"text":"FANTASTIC AND AUTHENTIC BEIJING CUISINE!!!!  I lived in Beijing for about a year and since I have got back I have been searching and searching and searching for the food that I ate there every day and took for granted. I have eaten chinese food in Los Angeles (seriously, I drove for hours and hours to try a *good* restaurant). I have eaten chinese food in NYC. I have tried chinese food in \"authentic\" restaurants in Minneapolis and San Francisco. Dumpling Haus is the  one that reminds me the most of the flavors of China.   I went for 2 of my staples in China. Ji Dan Chao Fan (egg fried rice) and Xi Hong Shi Ji Dan Mian (egg and tomato noodles), and they were fantastic, authentic, and reminded me of sitting in my neighborhood restaurant in the middle of January in Beijing.   Once I received the bill I was reminded that I am not in China. But eating here is much cheaper than buying a plane ticket back to Beijing.   To the people hatting on this place because of prices: Just mention it in your review, don't base your review on the price. Yelp is about the food. The place is in Midvale mall... it's supposed to be pricey. DUH."}
{"text":"Great casual noodle bar that I forget about too often because of its' hidden location in Hilldale. My noodles have always been hot, tasty, and satisfying without being heavy. The staff are friendly and the dumplings are not spectacular but, for Madison and for a quick weekend lunch, very good.  I like the space (plenty of tables, tight but not stifling), but I'd go here quite a bit more often if it wasn't back in the mall, an area where parking can be tight. Dumpling Haus, add a downtown or east side haus, please!"}
{"text":"Been here twice. Food was decent. But being Asian. I know my Chinese food. I cook frozen dumplings at home all the time. I can't say that the price justifies the number of dumplings ($9 for 10) or its taste given how a bag of 20 at Asian midway is like $3.50.   Noodles here are authentic though. The reason why I still come here is because i like how their noodles taste. Still... 8 bucks for a bowl of noodles that cost less than a dollar to make is absurd.   BUT that being said, the store is in hilldale and I'm guessing rent isn't exactly cheap. So prices are justifiable but hard for me to stomach when their fares are cheap street eats while visiting Shanghai and Bejing.   Bottom-line: average dumplings / great authentic tasting noodles / Bank breaking price ( I dont feel I'm getting a bang for my buck here, more like a poke)"}
{"text":"The absolute best tart cabbage/noodle soup and dumplings EVER!  It was awesome."}
{"text":"As a chinese, this is really a rip-off. SO EXPENSIVE. :|   But it is quick, and some items are pretty good. so ok, I come here if I'm in a rush to watch my movie and the other places are busy.  Seriously, I'm such a small eater and I'm really hungry unless I come with a group of friends and order a huge variety of things. The peanut noodles are good. BUT it's just sesame oil and peanuts, and there is only half a portion in there, for $8. BOOHOO.  Ok, so what's worth eating here. Get the buns, it's filling. And if you miss dim sum, they have decent pork shu mai and prawn dumplings (ha gau). *Shrugs*  I think the steamed dumplings here are ok. The skin is too thick for me. And the fried ones are similar too :( boohoo. Go to Umami if you want to get good dumplings."}
{"text":"Location is perfect is u r shopping or after a movie. There are multiple kinds of noodles and steamed buns are tasty. Not expensive, self-service. Will come back soon."}
{"text":"It's strictly passe-able by Madison Asian standards (low), but not acceptable given the price range."}
{"text":"The Dumpling House is our kids' favorite restaurant! Their Haus Noodle Soup with beef is stellar, but the star item is the Haus Jiao Zi--they are, literally, the best dumplings I've ever eaten. The Pork Shao Mai and Mini Wonton Soup are also huge hits.    The food is great and the atmosphere at Hilldale Mall is low-key & easy to manage with small ones in tow. What makes the Dumpling Haus really special are the owners: my middle son actually tells Jenny that he loves her and they always have time for a chat with us when we are there."}
{"text":"I ordered the HausNoodleSoup and it was good. It's not authentic but for an Americanized Chinese restaurant I was satisfied. I had a few dumplings and they were good but not amazing. If you're looking for a quick place to eat, a variety of food, and average Chinese food, this is a good place to go!"}
{"text":"Small portions, high price, slow service..."}
{"text":"Good service, okay food. I've eaten here twice and the first time, it was good. I tried couple of the noodle dishes and though it was simple, it satisfied my taste buds. The second time I went back to this place, seems everything has changed. I ordered some of the same noodle dishes (sesame noodle kick, black bean pork noodle, peanut glazed noodle, and haus lo mein) and all of the noodles (same noodles in all dishes) were too soft and overcooked. Not much flavor so all were completely bland and mushy. Probably won't go back."}
{"text":"5 Star for Dumpling and 4 Star for their Noodles.  Overall Good place to eat at Madison, WI."}
{"text":"Traveling thru Madison I took the time to find some good chinese food. Thankful for previous Yelpers for this one. Wow! The dumplings were delish but ...the broth! The broth is essential  and this hit the high mark.  I had the 8 shrimp dumplings in broth. Thinly wrapped succulent shrimp won tons popped with flavor as I bit into them. A side of sautéed vegies completed my light meal.   Happy happy happy."}
{"text":"Wow, wow, and more wow.  What an amazing place and maybe a new favorite for me and my wife. Simply amazing.  We tried a little of this and a little of that off the menu and I will say right from the start that the Haus Noodle Soup might have been one of the best soups I have had in a long time...simply delicious and by far the best thing I had all night.  In addition to the soup we tried the Pork and Veggie Won Tons and they were awesome as well as the Bao Zi that the owner brought out for our daughter.  So many delicious looking things on the menu and only so much room in the tummy.  No need to worry, I will be back many times to sample it all.  Thank you for a wonderful night."}
{"text":"I've been here several times and the food was just \"ok\". Other reviews say that the braised beef Taco Bao was AMAZING, and I am going to disagree. Not a lot of flavor at all. However, the look is cool - The \"Taco\" refers to the open shape of the dumpling, not the seasoning / flavor. I do however, recommend the Black Bean and Pork Noodles!  Lots of seating. Across from Sundance at Hilldale. Can't order online (yet)."}
{"text":"This place is such a nice spot for lunch, especially in the fall/winter. I was really craving some soup one day and happen to stumble upon this place. Ordered the Haus Noodle soup and it was scrumptious. I am not a huge dumpling fan in general but I really do think their dumplings are nice. The interior is modern and fresh and I enjoy being able to sit at the bar and watch the chefs make the meal. It seems like it's a family owned and operated establishment and you can taste that in the food.   The only downside to this place is the location. It's hidden inside the stripmall without any external access."}
{"text":"The restaurant is clean but we're not very satisfied with the food. We ordered pork shaomai, shrimp dumplings and pork sticker. Only the pork shaomai is good. Maybe we expected too much about the \"Chinese\" flavor. The price is also a little bit higher than what we expect."}
{"text":"Woot woot! My 100th review!  I stopped in to DumplingHaus while trying to kill time around the Hilldale area. Since it's in a mall I was expecting the usual food court fair but oh was I wrong. This place is super yummy!! I ordered the Sesame Noodle Kick and contemplated ordering a few dumplings, but honestly I'm glad I didn't because the serving was huge! Plenty of noodly yumminess to fill my tummy. These noodles were so good, just the right amount of spice and sauce.  Can't wait to come back and try something else!"}
{"text":"I'm probably biased from all my San Francisco dumpling eats. But I did take out one night when I was in Madison for work.  FOOD: I got XLB and Haus noodle soup with pork. XLB were pretty good - harder for me to judge because they are a hard take out food. But they come with a nice vinegar-y dipping sauce and I thought dough to meat ratio was good. Noodle soup - also a hard take out food. The pork was tasty. I like that there were a lot of veggies too. But the noodles were just ok - nothing exciting.  I saw some bao come out and they looked tasty. Wish I had gotten some to try.  SERVICE: About what's expected from such a casual mall restaurant. Since I did take out, I can't comment any further.  ENVIRONMENT: Located in Hilldale mall, the restaurant is very casual. Order at the counter, grab your number, and take a seat. There's tables and some seating at the bar. Nothing fancy."}
{"text":"Try the shrimp dumplings!  They are delicious, as are the noodles.  I would recommend not going here if you plan to eat vegetarian though, most of the vegetable dishes are a bit on the bland side."}
{"text":"Last Sunday my niece and I stopped by Dumpling Haus for much needed dumpling goodness! When we got there, the place was packed, which I believe is typical.. on a Sunday afternoon. We spent the time sitting at the counter watching the folks in the kitchen cook and dish out such delicious meals one after another, that itself kept my niece quite entertained and the various games we played while waiting.  The wait time was about 25 minutes from the line  to and actually waiting after ordering. Food: Impeccable and every bite was delicious.. I might've ordered by listening to my rumbling stomach and got carried away, but as always I have no regrets. We got sesame kick noodle: spicy and delicious!! Haus stickers X2: bite size and tasteful. Haus Bao zi: so soft and filling and just biting into heavenly/savory goodness.. And lastly egg rolls cuz y not!  Everything was delicious and would definitely recommend this place!"}
{"text":"Noodles were good but not much flavor from the sauce.  Had meat balls with it and they weren't very memorable either.  Tried there special iced tea.  Pretty watered down.  Wasn't bad but wasn't that good for the $$ they asked.  A little pricey."}
{"text":"There is no taste to this fried rice. I don't even taste salt. All this is, is white rice with cheap salad shrimp and eggs. I paid $13 for this fried rice and $37 for all of this. This is poorly made Chinese food. The dumplings were dry and didn't have a lot of flavor either. The beef was just ok as well. If you real great tasting dumplings go to dim sum in Chinatown in Chicago. This was terrible food for the amount I paid. This place is not all the hype that it is on yelp."}
{"text":"Worst Chinese Restaurant I've experienced, period.  I'm overly generous in giving a one-star rating to this Dumplinghaus.  The food was not fresh, and saturated with SMG.  We had dinner at the restaurant last weekend, and my entire family had diarrhea shortly afterwords.  The restaurant was also very greedy, charging each person a tea expense even though our kids did not drink tea.  Stay away from this restaurant."}
{"text":"Just awesome. I've spent a long time looking for consistently and legitimately delicious Asian food in Madison and I think I've finally found it in Dumpling Haus. It's not your typical beef-and-broccoli take-out by any means, instead focusing entirely on noodle soup and dumplings, mainly bao. The steamed dumplings here are without a doubt the best that I have ever had, and the noodles are almost up there. My one complaint is that they don't have many items on the menu that aren't filled with pork, making it difficult (but still enjoyable) to eat kosher or halal in here.  The man behind the counter is so warm and friendly that I'd find myself frequenting this place just because I wanted to see his business succeed. And from the looks of it, he's doing pretty well. A serious congratulations to the owners is in order for taking a cuisine that has been bastardized a million times over in America, and making it into something refreshing (both the idea and the food itself), simple, and unique."}
{"text":"I am Chinese, and these dumpling rival those of my mother, which is saying a lot.  We love that the place is staffed by true Chinese and that everything is made by hand.  A few things are Americanized on the menu, but are also very good.  For those not a fan of red bean, try the Nutella bao.  Amaaazing!  Only complaint I have is the price.  Much more expensive than dumplings at most Chinese restaurants, but it is well worth it."}
{"text":"Delightful owners and delicious food.  I can't recommend this place highly enough.  The taco bao is favorite of ours."}
{"text":"We tried the Dumpling Haus for lunch on Sunday. The name made me wonder if there was something German about the restaurant, but it's strictly dumplings, bao (steamed buns) and noodle bowls. That's fine by me. The space is airy, open, and bright with windows that allow you to see the cooks making the noodles and dumplings.  You order at the counter, pick up your utensils, and they bring you each dish as it's prepared. Bus your own tables after you eat.  We ordered the haus sticker dumplings, the curry beef bao, and the shrimp dumplings. The texture of the haus dumplings was really good and they were perfectly fried. They definitely felt home-made. The green onion in the filling was over powering. I didn't like the taste of the shrimp dumplings at all. Something just seemed really off about them and I would not order them again. The texture of the steamed buns was slightly chewy and sweet. I really enjoyed the curry beef filling and I would definitely order those again.  Price-wise it seemed a little high for what you got. However, I really did enjoy seeing the open kitchen and watching them prepare the food. I'd go back if all I really wanted was dumplings or steamed buns."}
{"text":"They moved outside!! It's roomier and service seem to be faster. Flavor is mild but tasty. It's managed by a bunch of older people who seem to know what they are doing. Home cooked meal!!!"}
{"text":"Wow is all I can say about this place. My step mom is from Beijing and I enjoy dumplings that she prepares and not only did they do an excellent job and everything we tasted from the house dumplings to the housemartins the more recommended exotic things like the taco buns are spectacular as well we had for dessert red bean buns and all I can say is the next time I'm in Madison I will definitely come here."}
{"text":"The menu had a decent variety of dishes. I did enjoy the dumplings and pot stickers however, the service was awful! Our server was so rude and disrespectful. Not worth going again."}
{"text":"The food here is very plain and traditional like you would find in Beijing China. It is not your 'Americanize Chinese food\" you would find at some China Wok or Buffet on Main Street where it is filled with sodium and blah dark sauce. The dumplings, bowl of noodles, and bao was hot and fresh when served. The dipping sauce for the dumpling was  good (soy with a hint of vinegar just like in China). The fried rice here was very traditional like you would find in the restaurants of China. As expected, there are soy sauce and hot sauce widely available for you to make it to your liking when ordering the noodles, dumplings, fried rice, etc.  The service staff here are helpful with the menu recommendations if you don't know what to order. Lastly, they are very sweet  after putting my left over in a box, one of them came over and gave me a bag to carry my left overs as I was leaving - how helpful!"}
{"text":"A-OK is a good description for our experience of the food, decor and service on an initial visit to Dumpling Haus.  I had the Sesame Noodle Kick and my husband the Veggie Lo Mein; we shared one order of pork dumplings.  All dishes were hot and fairly tasty.  The Veggie Lo Mein was a little bland but some soy chili sauce brought out a little more flavor.  Service was quick.  Since patrons order at the counter and are expected to take dishes to the back upon completion of the meal (which sometimes does not happen), we expected the food to be priced a little lower than it is.  Overall, it was a decent fast food experience but also a little expensive.  The above dishes, along with one beer, was just over $30--$15 apiece for a fast food meal."}
{"text":"Well.  There were items I loved and others I didn't - at all.  Absolutely loved and adored the pork belly taco bao.  So good.  Would go back to have a million of those.  The bao sampler was a big ol' miss - I didn't really enjoy any of them.  They all seemed quite dry and lacking in flavor.  With that said - my kids (3 and 19months) liked them, so great.  We picked a noodle bowl which was really delicious and I'm eager to try more on the noodle side.  The little dumpling add ons were also a bit of a miss.  Maybe we chose poorly on some items.   Who knows.  Regardless of the couple of misses I liked what we liked so much that I would go back to try more.  Bonus - honeydew tea. Delicious!"}
{"text":"On my constant quest for trying new places for lunch, I found myself at the DumplingHaus. I wish I could help with what I had... um, a dumpling? Yes, that's obvious - I believe the guy gave me the house special. Surprisingly, chopsticks aren't that hard to use (when you read the instructions on the paper wrapper they come in).  I am a fan of dumplings now, I just need to get better at learning what I'm ordering and find ones that I love, not just enjoy! I'll be back for sure!"}
{"text":"The Wife and I decided to try DumplingHaus at Hilldale Mall for dinner last night, a brave decision since I've eaten more than my fair share of dumplings in China and haven't found any quite as good here in the States. Suffice it to say, we were VERY pleased with the experience.  Landing somewhere between a fast food restaurant and a sit-down restaurant, the DumplingHaus nevertheless delivers a good experience. Customers order at the counter in the entrance, then find a seat and wait for the staff to bring your food to your table. We were there at 6:30pm, the height of dinner, and only waited about 5 minutes to get a table and another 5 or so to get our food.  We shared an order of their Haus Jiao Zi, which are their homemade Beijing-style dumplings. I found them to be delicious -- they reminded me of the best dumplings I've ever had, which I got at a back-alley restaurant in Beijing -- and The Wife's eyes got big when she tasted her first one. I also ordered the Peanut Glazed Noodles (cold, not hot), and they were delicious. The peanut sauce was thick and plentiful, which provided a saucy flavor burst in my mouth. The Wife also ordered the Sesame Noodle Kick, and found the flavors of the sesame sauce, green onions, cilantro, and peanuts to be delicious.  All in all, we were very happy, and The Wife is insisting that we need to go back at least once a week to try more of their dishes."}
{"text":"Hmm I did not enjoy my dishes. The first time I went here I got the this cold noodle. I told them to make it extra spicy. They didn't. The flavor was bland and non existing. Going for a second bite. I found a hair in it. I looked at the cooks, none was wearing hair nets. And it was a short hair probably came from one of the men that was working. Why don't they wear hair nets or caps?? I told one of servers about it. She didn't apologize or nothing. I just left without asking for a new one or a refund. Wasn't worth trying to eat it the second time.   Wanted to give them a second chance. Went with someone there after few weeks later. We tried the bun with pork inside. It was $7 for 4 buns with not much meat inside.  We both concluded that we were eating something tasteless. I kept dipping it in sauce to give it some flavor. Totally done going to this place. Every time the food taste so bland like your eating nothing."}
{"text":"I always enjoy my food here. It's casual, inexpensive, and easy to share different dishes to try a variety of items. The Nutella bao and custard buns were a nice treat to end the meal! Yum!"}
{"text":"I don't think this place is bad. I think it's catered to be a quick and clean restaurant like an Asian Panera for Americans. But I can't say it's good and that I'd ever come back. We could see Asian ladies making bao buns. I'm sure their recipes are very different at home.    If you're a foodie who likes authentic ethnic cuisine, don't come here. It's not just Americanized chinese food but extremely Americanized food. It's like going from eating stone oven pizza in Italy to eating microwave pizza rolls in America. No wonder I couldn't spot a single other Asian person in here.   -green veggie wonton - steamed instead of fried. they were good but very salty.  -pork and bean noodle - I had a noodle since I'm vegetarian, and the texture was too soft, almost soggy but my boyfriend said it was okay.  -tofu salad - literally just tofu with sesame oil poured over it, green onions, and corn flakes   My boyfriend and I just wanted to try a new place in the area but we received the recommendation from non-Asian friends about an Asian place.   3 stars because it was very clean and presentable and the service was friendly."}
{"text":"Both the beef brisket and pork belly versions of taco bao were delicious. BF really enjoyed his beef brisket soup.   Dumplings were just okay because quite  a few were stuck together so the soup spilled out when I tried to grab one."}
{"text":"I ordered the shrimp dumpling (har gow)...I know it's a rip off but I had a major craving for it.   The dumplings are seriously half the size of a normal size har gow (the pics on yelp are probably really zoomed in). The shrimp was overcooked..it tastes almost like it was made from a frozen package.   If this is your first time eating har gow, you should really try it in a real har gow in SF, NYC or Chicago."}
{"text":"I love the location of this place, but unfortunately it just wasn't that great. Here's the run down:  * Gyoza: It's unfair, but my grandmother makes the BEST gyoza, so I already had a high standard. These were good. The skins were a little more limp than I like them and the meat didn't fill out the entire dumpling, but it was just okay * Xiao long bao: This comes with a good amount of them, but they are quite small and the juice inside wasn't very flavorful * Sautéed veggies: You really can't go wrong with vegetables in garlic, so even though I liked this dish it wasn't enough for me to really get behind dumpling haus and the price was pretty high...  I do like that they have a nice seating area and self-serve condiment section to grab all your fixings for hot sauce, soy sauce, or vinegar. But overall the quality of the dumplings and the price wasn't too worth it for me.   Happy dumpling eating."}
{"text":"Cute local place with lots of options. The fried wontons are delicious! They have a Nutella dumpling desert that sounds amazing but was actually kind of disappointing, would be better fried instead of just steamed. Also be aware unlike most Chinese places this one is super expensive!"}
{"text":"This is a great place to eat before you go out to eat at another restaurant.  I'm serious,  it's really fresh and good,  and totally unsatisfying. Overpriced for what it is, but it is good."}
{"text":"The theme of this review is that DumplingHaus is overpriced, but the idea is smart.  DumplingHaus, as its name implies, offers a variety of Chinese dumplings and baozi (a larger type of steamed dumpling with thicker skin). The Chinese dumplings are around $8-$10 for around 8-10 dumplings. That's a dollar each. These are literally the same dumplings you can get at an Asian grocery store. I usually pay $8 for a bag of 30 dumplings. Doing the math makes me very confused at DumplingHaus' pricing level. The baozi is a similar hilarity -- $6 for 2-4 baozi. You can buy larger baozi than the ones they serve here for less. Another specialty here is their noodle bowls. You definitely won't get full on one bowl of this as they really cut back on the amount of noodles and toppings you get.   Now, I mentioned that the idea is smart. I give credit to that. That is why DumplingHaus get two stars, rather than one. They are smart because other Chinese restaurants don't offer these variety of dumplings and boazi. Most people are unfamiliar with what they are, so DumplingHaus instills curiosity of people passing by their cafe in the mall. If your curiosity overtakes your practicality for an instant, I won't blame you."}
{"text":"Don't you HATE it when you live 45 miles away and you're going to Madison for a quick trip and you decide to give Dumpling Haus a try because love bbq pork bao.  You place your to go order and patiently wait.  You get in the car and you open the box of goodness but they're too hot to eat so you wait.  A few miles away you finally get the change to take that first bite.  WHAT????  This isn't what I ordered  Where's the sauce???  Where's the pork????   WTF!  what i got was some plain meatball inside a steamed white bun.  GAWD DAMN IT.  too far down the road to go back.  7.99 into the trash!!!!!!!!!!!!!!!!!!!!!"}
{"text":"I think the overall eating experience that I had here was a 3, but since I appreciate this place being here and I'm excited to come back it gets a +1. Also, for our first time we tried all of the basics which were...just okay. Not spectacular. The haus bao zi filling was like a meatball that didn't fill in the inside of the bao. But then the bao itself was fluffy and light in taste. Yumz0rs. The red bean bao was nice, both inside and outside. Tried the black bean & pork noodle bowl which I didn't think was great in comparison to other jajamyun I've had. The dumplings were okay; maybe a little too wet.   This is what I thought was great: first of all. Real bao! Thank you! We decided to come here after having gone to Umami and having to deal with the stupid slider trend. Also, with a name like dumplinghaus, a pretty cool logo and all hipstery in the inside ...I don't know what type of people you'd expect to be running this. But in the cash register there was a Chinese grandpa, cleaning the tables a Chinese grandpa, a bunch of old Chinese people yelling at each other in Chinese behind the bar. Great, no? I'll be back soon! :)"}
{"text":"Finally had the opportunity to try this place. After reading all the reviews on here, my expectations were really high. But I have to say I was left a bit disappointed. Like other reviewers have stated, the food is very authentic Chinese food. This made me really excited. The menu has plenty of options and they all sound very good. I ended up getting the barbecue bao, the taco bao, and the black bean & pork noodles. Everything tasted wonderful but there were a few grievances. The barbecue bao barely had any meat, the filling was mostly a barbecue flavored paste. The same thing with the noodles, there was hardly any pork, it mas mostly black bean sauce. I must admit both were very flavorful, but the lack of meat was very disappointing. The taco bao was the best. The pork belly was delicious and they didn't skimp on it. But I think it is a bit pricey for only two pieces. My food came out really quick, which was nice. There isn't much service as you order at the counter and have to get up to get your food once it's ready. I hope the lack of meat was just an random oversight. I will be back another time to give this place another chance, as I really liked their menu."}
{"text":"Order and pay before sitting down. Seating is first come first serve, when busy it can be a longer wait for a table. The food is awesome, I recommend the BBQ bao. The dumplings weren't my favorite. I've tried several of the noodle bowls and have enjoyed them all. The seaweed salad is delicious. They have a hot sauce that is self-serve by the water, I suggest trying it out. You can watch the food being made. You don't have to clean up after yourself, when busy though the tables don't get cleaned right away which can add to the wait time. Next time you're near Hilldale stop in and check it out!"}
{"text":"Growing up in a Chinese food culture, I thought DumplingHaus, by its appearance, would not be \"authentic\" enough for me to enjoy. Oh my, I was wrong.   We had sesame noodle kick, tart cabbage and pork soup, and a serving of haus bao. The sesame noodle kick (or dan dan noodle) is very good, better than I expected. 4 different kinds of baos in small plate is perfect for an appetizer. Cabbage and pork is a kind of noodle soup that you do not often find in American Chinese restaurants, so I really appreciate that.   The open kitchen makes the restaurant unlike many other Chinese places. It's very clean and you can see all the actions clearly. The staff are professional and very efficient. The ambiance is cozy and modern. Apparently they have done some good design work to cater to a younger crowd. The menu is also designed in a way very easy for non-Chinese people to understand. Very good job with that.   I consider the price is slightly on the higher end, but mostly due to that I can make most of the items myself at home. You can find good frozen dumplings and baozis from Asian groceries, and they are super easy to prepare. This probably explains that why such an authentic place draws fewer Asian crowd than I imagine--because we can make these stuff at home.   Other than that, the food was really memorable. The location is super convenient. Perfect for a rest stop in Hilldale mall. If you are new to the dumpling and bao world, you will not be disappointed."}
{"text":"Tried the Dumpling Haus last week for the first time on my 10-year old daughter's recommendation, since the other restaurant we wanted to go to was closed for the month of February.  My daughter told me these were the BEST dumplings EVER!  As much as I love her and want to trust her opinion, she wasn't right about this.  Maybe their dumplings are appealing to 10 year olds, but the prices are nuts.  One small bowl of wonton soup for her, one bowl of the Haus noodles for me, and one bowl of edamame that we shared for an appetizer = $23.00.  Put on a decent tip ($4.00) and that's $27 for not much food.    The wonton soup was tasty with a very light but flavorful broth.  The Haus noodles, which I ate with beef, was mediocre.  I requested rice vinegar and added chili paste to give it some flavor.  The proportion of noodles to broth was very high.  Maybe they should call it a noodle plate instead of a noodle bowl.  There was maybe 2 ounces of beef added to the bowl. The beef looked and tasted like it was thickly sliced processed lunchmeat.  I really wanted to like this place since the owners ran the former Yen Ching near the intersection of Midvale Blvd and the Beltline for many years, and the food there was consistently good and the prices were reasonable.  I don't care how much my daughter begs me, but I will not be returning to the Dumpling Haus.  She can beg her dad to take her there on the days she is with him."}
{"text":"The dumplings and noodles are delicious, and the tea is really solid, but the ambiance is terrible for dates or friends groups to be able to hear each other (high, echoey ceilings) and the door lets in drafts of cold air every time it opens. It's not for eating while shopping the rest of Hilldale, either- the food is designed to be eaten in the restaurant. Definitely needs some redecorating."}
{"text":"I just love this place. I've had their bao buns and their ramen, and both are overall fabulous. The BBQ pork is classic and as good as I've had it any other place. They are also very affordable; their seaweed salad was less expensive than any sushi restaurant's prices. My husband and I loved the Sesame Noodle Kick. I only didn't give them five stars because I think the Seasonal Harvest soup was pretty bland, and I had to add sauces to it to coax some more flavor into it -  would be a good one to have if you are sick and yearning for a noodle soup, though."}
{"text":"Food: dumplings are 4 star. Buns are 2 star. Prices seem to be the same as Umami...which is a lot better. I wouldn't avoid it, but I'd only eat there if I were already nearby and hungry. Didn't have noodles so maybe I'll go back for some."}
{"text":"DumplingHaus is a fast casual Chinese restaurant in the suburbs of Madison that offers decent vegetarian options. The friend I was traveling with and the friend we were visiting tried to go to a different Chinese place in the suburbs of West Madison, but it was closed! So on the way back, I was Yelping quickly, and stumbled upon Dumpling Haus. That's so like Madison to name a place XYZ haus.  I ordered the veggie bao, veggie wonton, and sesame kick. The sesame kick is a wheat noodle with a Sichuan style peanut sauce. It wasn't too spicy, and it had this great freshness because it was topped with green onions and cilantro. The veggie bao and wonto were filled with a mix of vegetables: it's hard to say what it was. Not sure what went in, just that it was vegetarian.  The filling was tasty. I would say the wonton was better than the bao, just in terms of taste. The bao are fluffy, and come with a different carb to filling ratio than the wonton. The wonton wrapper was thin. Both dishes came with a dipping sauce, which tasted like soy sauce diluted with broth.    What's the difference between a Chinese wonton and a Chinese dumpling? I don't know, but growing up, my family bought wonton wrappers and made our own dumpling wrappers. We also ate wonton in a broth. Finally, we folded dumplings and wonton differently, and DumplingHaus was spot on with their wonton folding!  There wasn't really anywhere to sit during the lunch hour: it wasn't too busy, but the restaurant footprint is not big at all. The place seemed pretty authentic. The lady that brought out our food spoke to me using only Chinese. It's kind of amazing that these Asians are running this shop amidst a very suburban outdoor shopping area, complete with massive Target, a North Face store, etc.  I'd definitely come again if I was in the suburbs of Madison. I love wonton and haven't had wonton since become vegetarian."}
{"text":"Amazing dumplings but kind of expensive. Very much worth it. The staff is great along with the food!"}
{"text":"Small placed tucked away in the Hilldale mall. Low key, informal. Order and sit type of place. Nice assortment of noodles and dumplings. It won't blow your mind away but they do what they do pretty well. When you have a craving in Madison, it hits the spot."}
{"text":"How do I put this delicately?  I like Mom and Pop shops - obviously.   However, I don't like Mom and Pops eyelash's in my food, which is exactly what I got with my Haus Noodles.  It's bit too pricey for what you get as well - $35.00 for noodles, one taco bun order and one house dumpling order.   The bun was really heavy in the hoisen sauce but that's about it (flavor wise). nice and fluffy dough with it but other than that it was difficult to enjoy anything else.   The dumplings were okay but there was this strange sandy texture I couldn't quite put my finger on.  All in all, if you prefer bodily follicles with your bland noodles with a side of meh dumplings made of sand, then this is the place for you!"}
{"text":"When I found this place in the middle of a mall next to a Macy's, I was momentarily afraid that I had been misled by Yelpers who hadn't really seen a \"hole in the wall\" Chinese place before, and that I would be fed Americanized Chinese fare.  Then the old man at the register asked me in Mandarin, \"Whaddya want to eat?\" and proceeded to ask me which part of China I was from, and I felt a little more secure.  As it turns out, despite the Germanic name and the European square white plates, the food is really really authentic. I've never before had dumplings that so closely resembled my mother's. I don't know if I would say that it's the finest Chinese food I've ever had, but it is really authentic comfortable, simple home cooking.  I would definitely recommend this place for a little bit of Asian comfort food.  (Side note: I had the Haus Jiao Zi and Haus Bao Zi. I see that the menu includes some stuff like \"Taco Bao\" and I have no idea what's up with that, but I would vouch for the dishes I had.)"}
{"text":"Their Dumplings are pretty much the best one in Madison and it's a very clean store with a friendly environment.  I would give it 5 stars, but I'm a bit annoyed about 2 things. First, they have been steadily increasing their prices and for no particular reasons. Dishes that used to be 7 dollars are now 9. Also, they hide this by not showing prices on their main board. Instead, they have a hidden board in the back of the store with the prices. A bit annoying for a person like me who likes transparency.  Again, the food is really good, but the pricing and transparency soso."}
{"text":"I've eaten here several times.  The food is ok.  I've always felt like the dumplings weren't quite a full meal; I'd really like if there were side options with them.  I would rate them a three except for the pricing.  Yesterday, my boyfriend and I went to get a small dinner and paid $21 despite not ordering beverages (they have free water)."}
{"text":"The Haus noodle soup and the Haus bao are my favorite food in all of Madison. Their fluffy bao just make me so happy I make sound effects when I'm about to eat them."}
{"text":"This is a good place for a quick fix, the dumplings are good and there are a few tasty noodle bowls too. This is not a place for groups, even 5 people in your party would be too many. The XLB and 'house' offerings are the best in my opinion, there is hot sauce for everything else. Very casual atmosphere I like sneaking in on a Sunday morning or for a quick snack while shopping."}
{"text":"The chicken dumpling were very tasty. The warm noodle soup was satisfying after a long day, it could have been better if it was little more hot."}
{"text":"It's good for what you can get in Madison. The roots of the chef is Northern China, so the dumplings are decent. It's nice that there are some dim sum like dishes---shrimp dumplings and pork sumai. Until the market expands, it's one of the better dumpling places in Madison. However, it is overpriced."}
{"text":"This place did not live up to the reviews.  It felt more like a cafeteria than a restaurant. The shrimp dumplings were good; that's the reason for the two stars.  The soup dumplings were disappointing; very small and very fragile.  They broke open and leaked out what little soup was in them, and the meat tasted like processed bologna. The food was just disappointing. We won't be going back."}
{"text":"Pretty good place for a decent light meal.  All the noodle dishes are good.  I like the Sesame Noodle Kick, but you gotta add chili garlic to really get the kick.  The stickers are tasty and they give you a decent amount.  You can go off menu and get a large bowl of chicken fried rice that is well made but again needs some kick.  I've had better bao.  The barbecue bao is forgettable.  Tastes like canned meat.  The rest are pretty good. Where they really need to up their game is with drinks.  Cans and bottles only.  Can't understand it.  Everything is made to order so it takes a while, and it isn't cheap."}
{"text":"This place is overrated and overpriced. The bbq pork buns were okay, the curry buns tasted better than their bbq buns and was much more flavorful. Their shrimp dumpling wasn't that good either, I had better frozen $5.99 dumpling trays from Asian Midway. For the price you could get a better meal elsewhere. It was recommended by a friend but I don't believe I'll ever be going back. There's nothing really special about this place, it's just really expensive mediocre food. 2 drinks, 1 order of shrimp dumplings, 1 order of bbq pork buns, 1 order of curry buns = $25.  What a disappointment."}
{"text":"This is one of my favorite places to dine!  I love all of the dumplings especially the soup dumplings.  My absolute favorite foods here are the taco bao with beef or pork and the haus noodle soup with beef or the chicken noodle soup.  The soup broth is tasty and nourishing full of crunchy vegetables and noodles and the beef is tender and thin.  This restaurant is authentic, delicious and a must when in Madison!  Be sure to try the almond cookie for a small desert it is only a quarter."}
{"text":"Food is very good however the prices and service are horrible. $20 for some noodles and potstickers for one person. The employees constantly frown and are extremely uncommunicative. You place your order at a counter so there are not any waitresses. The decor is minimal. The food is simple so why the inflated prices? They need to post the prices on the menu board. I swear they make up the prices as they go. Nothing is itemized on the receipt. I felt ripped off."}
{"text":"Fresh, friendly and very tasty. We had the Sesame Noodle Kick (rich and spicy noodles done al dente) with the Veggie Bao Zi (4 steamed buns filled with tender greens). The person who took our order was very friendly and offered helpful suggestions. We are soon to be regulars here. A great addition to the west side dining scene."}
{"text":"Honestly these are the best, most fresh dumplings i've had in the USA.  I'm not native to any of those places but the dumplings here are better than any place i've found in Chicago, NYC or San Francisco's Chinatown.    I could not recommend this place more."}
{"text":"Amazing fresh dumplings, fried rice and gao buns.  Definitely a come back for some more buns."}
{"text":"Enjoy the buns and dumplings.  The noodle bowls are average at best - lack flavor.  Reasonable prices and good customer service."}
{"text":"The two times I've been here since moving to Madison have been wonderful! Yes it is a tight space in the Hilldale mall, however the food is worth it!"}
{"text":"Great food and great interior, but really overpriced.   I've tried their black bean noodles and their spicy peanut noodles.  I must admit, I'm a little addicted to the spicy peanut noodles.  $8 seems a bit much for such simple noodle dishes but I find them to be extremely filling, even though the portions don't look huge.   I've also tried their regular haus dumplings.  No complaints on the dumplings, but they're the same thing you would get anywhere else, and at $3.50 for three of them...?  Pass.  They have really cool and creative flavors for different dumplings and steamed buns, especially their dessert ones.  But, as other reviewers have mentioned, you're paying $1-2 per dumpling which is just crazy.  But I guess they can get away with the high pricing in their neighborhood they're in.  They get extra points for always seeming to advertise gluten free options on the menu.  My gluten free friends appreciate it."}
{"text":"The bao buns are amazing! When in Madison we always stop here while shopping. We had the taco bao, xiao long bao, and the haus bao."}
{"text":"Don't get me wrong, the food here is great and authentic. The issue I have is the price. You can get similar meals for half the price at other restaurants in Madison. My guess is you're paying the \"being in Hilldale Mall\" tax, because they have a great location and I'm guessing rent isn't cheap. Everything I've tried on the menu has been great and very authentic, but if I want something more than just dumplings then I'm spending more than $10, which seems excessive to me.  There happens to be another Chinese restaurant in that same mall that has more reasonable prices. I recommend that you treat yourself to Dumpling Haus if you're with a group of people (so you can share dishes) and don't mind the price once or twice a month, but if you're watching your spending go elsewhere."}
{"text":"We order the Veggie Dumplings and the Beef Curry Bao and Veggie Bao. Everything was delicious and surprisingly made my husband and I very full. The Bao was soft and fluffy and just melted in your mouth once your took a bite! I wish there were more meat options other than pork but other than that, it had a nice selection. We will definitely come back to try the noodle soup and others!"}
{"text":"Dumpling Haus is a great, fast quick fix for your dumpling cravings. They have a good variety, vegetarian options and noodles for those non-dumpling people (how can there be people not into dumplings). The dumplings are hot and tasty and the perfect option for the shopper who doesn't want to spend too much."}
{"text":"This place is amazing. A little bit on the pricey side, but the portions are huge and the food is delicious. My faves are the haus stickers and sesame noodle kick(and it sure does have a kick!).   Go here. Eat noodles. Be happy."}
{"text":"In my humble opinion, the best thing about channels like the Food Network and the Travel Channel is that they have given ethnic foods a platform to showcase their rich cuisine.    The Dumpling Haus in Madison, Wisconsin is the very definition of forward thinking Asian cuisine that is rooted in treasured family recipes and that showcases one of the world's most perfect foods - the simple dumpling.    The house made Haus Stickers, Shrimp Dumplings and Haus Jiao Zi were expertly made, and when you bite into their delicately soft shells your mouth will be immediately TKO ed with rich flavors and textures whereby you will taste each ingredient separately (unlike many dumplings which only \"Haus\" a mushy pork flavored center).   But the real show stealer is the Taco Bao!  Inside the soft doughy shell is a perfectly cooked and textured slice of rich pork belly -- I am sure there were other things too, but I got lost in the slice of yummy yummy pork belly.     I also tried some of the noodle dishes and took home some Bao, all of which were really good; but lets be honest - you should not waste premium tummy space on anything but the dumplings and the all mighty Taco Bao.     If you ever find yourself in Madison, Wisconsin - forget the cheese and eat dumplings instead --- at the Dumpling Haus!   Insider note:  Ask the Haus for a side of Chinese mustard and dip any of the dumplings in the mustard before the soy sauce and you will get a extra special flavor boost."}
{"text":"This place is a hidden gem in Madison and I wish more people know about it. It is one of the only places to get traditional Chinese noodles and bao zi in Madison and it is delicious! This is a casual little shop that reminds me of the food that my grandma would make, everything is freshly made and you can even watch them make it in the kitchen while you're waiting. My favorite is the Haus noodle soup! The ribs in the soup are so tender and the broth is full of flavor. We always get dumplings and/or buns with our noodles for a complete experience."}
{"text":"I'm giving this place an upgrade!  I went for the Pork Shaomai and the Sesame Noodle Kick this time and it was a good dinner, albeit pricey.  The noodles were especially delicious, despite not having meat. I'm quite the sucker for cilantro and red pepper. I'll be back to try their other dumplings!"}
{"text":"Everything you could want! Large, bright, cheery restaurant. Prices a bit high but food tastes fresh and homemade. I've had several menu items and all were great."}
{"text":"This place has great location, modern interior, and awesome service. The sweet Asian grandpa made the experience warm and inviting. What brought the rating down for me was the food; I was disappointed with the texture of the noodles. Granted it's not called the \"noodlehaus\", but I could tell how overcooked the noodles were from the first bite. The xiao long bao were passable; some were filled with soup yet others were a bit on the dry side. The best dish we ordered was the taco bao with braised pork - large portions, tender pork, and thick sauce! A dash of sweet peanut sauce would have enhanced the experience though. I would come here if you are simply looking for a meal cooked by grandma, but not if you are searching for some delicacies!"}
{"text":"I love getting dinner here before seeing a movie at Sundance. The tomato cilantro soba is consistently delicious and satisfying. You can tell that the staff is committed to making excellent food."}
{"text":"If one is not a pork eater, my my will it be tough to order much here, but you will find a couple things. And I do mean a couple.   Two orders of shrimp dumplings, and an order of Nutella Bao (you get 7 dumplings each order, and 3 Nutella Bao)..  Shrimp dumpling was good, but I wanted something else with it, like veggie or something.  The Nutella Bao was the star.  The buns are made by hand, as we sat at the stools facing the kitchen and watched everyone making the orders.    Next time we will try the \"beef taco\" which is not taco at all, but beef, cilantro, onion, and spices stuffed in the steamed bun.  I also want to try the egg custard Bao.    Like other reviewers, I agree that the price is a bit much for food that is traditionally street fare.  It was $25 for our meal.    I will be back though, I love the Bao - and I want to try the noodle dishes as they look excellent."}
{"text":"I decided to visit Dumpling Haus yesterday after discovering that they served BBQ bao, an item I've been craving since a first had one in San Francisco years ago.   My dining companions and I decided to try the BBQ buns, shrimp and haus dumplings and the Nutella buns for dessert. Everything was quite tasty, but I would have liked a bit more filling inside the buns, as the dough was a bit overpowering.   The star of the meal for everyone at the table was the shrimp dumpling. The bite-size pockets of goodness were amazing and so full of flavor! Definitely a must try.   Overall, the food was tasty at Dumpling Haus. Although the pork buns weren't as great as the one I had in SF's Chinatown, the dumplings were enough to ensure that I will be back again."}
{"text":"I always order their chicken/vegetable lo mein, its a huge serving of thick noodles with a combination of vegetables and broth, served warm. And fresh edamame to have as an appetizer.  Their staff is extremely friendly!    Love their Nutella boa (bow) to finish my meal. They're served warm with a dough like outside that surrounds the stuffing, they have them with meats, but I love this unique twist."}
{"text":"This place is so good....and even better in their new location.  Their food is so fresh and never disappoints.  I love the egg and tomato noodles and the veggie/noodle soup is the best especially on a chilly night.  I am not a fan of baos in general but my husband loves the taco bao.  This is a go to for take out and a Madison essential."}
{"text":"It offers a lot of variety but the food tastes clearly frozen and rewarmed. It possesses no authenticity in asian cuisine. I got the dumplins and a bowl of noodles. The dumplings were definitely bought frozen from a store and the noodle soup was bland."}
{"text":"it is a so great restaurant. I love it. Kitchen is so clean. And food xiaonongbao I ordered is very tasty."}
{"text":"I love this place!  The service is great and the shaomai is my favorite.  I have never been disappointed with any meal here.  I like the new bigger location.  This is my favorite restaurant at Hilldale."}
{"text":"The dumplings I had here were hand made and completely reasonably priced. I can't say they were the best dumplings I've ever had or anything, but the effort behind the food was there. The dessert buns were okay, but a little heavy on the bread. The food will satisfy you, but it won't wow you."}
{"text":"I ordered a tofu salad and I got tofu with cornflakes on top. WTF? It was really good. WTF!?!?  The soup dumplings (xiao long bao) weren't half bad, either."}
{"text":"First of all, don't go to a place called \"Dumpling Haus,\" not order the dumplings and then write a review about the mediocre noodles/fried rice/etc.   This place is delicious.  I really enjoyed the dumplings.  The reviewers who complain about the skin being thick must have never had fresh handmade dumpling skins.  They do tend to be a little bit thicker than machine rolled ones, but they are also more tender.  The dumpling skins here are only slightly thicker than machine rolled ones, but they aren't \"as thick as the filling.\"   The food is a bit overpriced for what you would find in LA, where competition for Chinese food is fierce, especially in the San Gabriel Valley.  But I find the prices about right for Madison.  Seriously, I rather pay 9 dollars for 10 appropriately portioned delicious, fresh, handmade dumplings than $8 for overly sweet and greasy General Tso's chicken, no matter how much of it they stuff into the styrofoam container.    We ordered the dumplings (jiao zi), pork baos, and zha jian mien (fermented bean sauce noodles).  The dumplings were my favorite and the baos were also tasty.  I didn't find any unpleasant \"yeasty flavor\" that another reviewer mentioned, but also steamed buns should be a little bit yeasty.  The dough should be just a little bit over risen before it goes into the steamer so the fragrance of the yeast is there without it tasting like sourdough.  I miss that fragrance, and it's one that you don't find in your regular sliced bread.  The noodles were overcooked though, which was unfortunate.    I really wish I had known that the \"taco bao\" wasn't actually some fusion attempt at putting cheese and ground meat into a steamed bun, but instead what sounds like a delicious slice of pork belly.    It's casual dining.  You order up front and bus your own tables.  The decor is cute and reminds me of a trendy Taiwan place if it were half the size with the same number of tables."}
{"text":"The food here is absolutely amazing! Try the haus noodle soup with pork, the haus sticker & xiao long bao (soup dumplings) - you won't be disappointed! In addition to the delicious food the staff is very friendly and service is quick! I will definitely be back & highly recommend that you come & try it out!"}
{"text":"Yummy food, but on the pricy side and if you prefer meatless prepare to order ala carte...still worth it cause its dee-lish."}
{"text":"Had the worst experience here and I would never come back again. Dumplings, wontons, buns, etc. are very easy food to make but it tasted terrible here. If you are Asian you might just feel offended. The broth was bland. Nothing had flavors at all."}
{"text":"Pretty solid, straightforward, inoffensive Chinese dumplings. Would recommend.   The quality of the food is great. The buns and dumplings hit all the major sort of flavors that you'd expect from this sort of Beijing or Hong Kong style of meat+dough, but doesn't do much more than that.   One thing I'd comment about is that there's a bit of a strange, machine-like consistency to their dishes. Like all of their dishes have been made a little too identically? The noodles in their beef noodle soup don't have much \"personality\" in terms of texture and the flavors of the soup and dumplings don't have anything particularly bold to them. But honestly, that's not too bad on occasion. It's not the kind of place you'd go to try to get \"authentic\" or whatever and that's fine. I'm trying to avoid flexing my Chinese-upbringing on this review and say \"these things should be like blah blah blah\". There's a lot of dissent on these things, even within my friends and family. For the local market, you'd want that general appeal.   It's good food and is the most casual place to eat in the area, especially if you don't want to commit to sitting down and eating. The price is what you'd expect from this sort of upscale-ish place without the labor market of a big city, so don't expect a real deal. But the food is decent and more interesting than the usual pub fare.   Sometimes you just want a meat bun, and that's okay."}
{"text":"Stopped in and ordered a take our order for 2.   25 minutes later I was checking in with them, and they said it was almost ready. 3 other parties that came in at least 20-25' after me received their order. I checked in a total of 3 times in 45' and they claimed 40' is what I should expect for steamed dumpling/potstickers.   Still took 10 more minutes.   Not much of an apology...."}
{"text":"First thing's first: Dumpling Haus is located in Hilldale Mall, so make sure you don't drive past it looking for a standalone restaurant. Now for the review:  When you first walk into Dumpling Haus, you are greeted by a clean, modern, but not pretentious atmosphere. The chalkboard menu obove the counter is fairly big but also straight forward: it's just noodles, dumplings, and a few other dim sum items) If you look straight from the door, you may see somebody making dumplings by hand (so you know that they're fresh). However, you may or may not be greeted by the person at the counter; she may never make eye contact with you even while placing your order. Manners aren't terribly important to me if the food is good, but it should be noted.  We ordered xiao long bao soup dumplings, shrimp dumplings, black bean pork noodles (because it sounded similar to korean black bean noodles, jiajang men), and sesame kick (because it sounded similar to dan dan noodles). After ordering, we brought water and sauces to our table since it's self service.  The food came out pretty quickly, but it wasn't good. Both noodles had no texture to them and very little flavor. The shrimp dumplings had a fragile, mushy texture to it with very little flavor. The xiao long bao was ok. Maybe I ordered the wrong things, but the food did not live up to my friends' recommendations.  Since the menu is so big, I'm going to have to come back. I really want to like this place."}
{"text":"Great dumplings and noodles and friendly staff. Last time we were there we had red bean paste and egg custard dumplings, both delicious.  It's difficult to find good Chinese food in Madison, so I am happy I found this place!"}
{"text":"I love Dumpling Haus! My favorites are the peanut glazed noodles (I usually order them warm, with extra veggies) and the veggie bao. Both items are vegan, ordered normally. The peanut noodles are very saucy, and the sauce is flavorful without being overwhelming. The buns come with deliciously prepared greens (spinach, or maybe bok choy, or both?) and are served with a yummy and light tangy sauce.They have several other vegan options, too, like the sesame kick noodles (my boyfriend's favorite,) veggie wontons, veggie fried rice, veggie potstickers, and veggie lo mein (and possibly others I have not tried or asked about). I did not care for the lo mein, as it was too garlicky for my taste, but my boyfriend liked it. It's a great place to go for a quick lunch or dinner, or we get takeout there and it usually only takes 15 minutes. Definitely recommend this place!"}
{"text":"If you're looking for super amazing flavorful brothy noodles and soup, this place can be a bit deceiving...  Their location and atmosphere is not bad at all! But when we got our food, it was actually quite a disappointment. Not much flavor quite frankly in any of the 3 things we got: BBQ Pork buns, Xiao Long Bao, and Pork Cabbage Soup and Noodles.  The pork buns were very bland with not much aroma-ful flavor to it, and the pork cabbage soup just didn't taste as juicy and savory as one would imagine it to be just by looking at it. The Xiao Long Baos were probably the best out of the three - there is soup inside the dumplings, which make it juicy. But honestly, the wrapping was still sort of stiff and the inside was pretty plain. I know that Xiao Long Baos are hard to make, so I'll give credit to them for making it as good as they could make it. But still.. overall the eating experience here was not up to my standard! And I've eaten at numerous noodle and Asian restaurants. Would I go here again... unfortunately probably not :("}
{"text":"My absolute favorite dumplings. They're always delicious and service is very good. Their new location is super nice too!"}
{"text":"It took over 45 minutes to be served a bowl of noodles in sauce. The sesame kick noodles were advertised as being spicy, but were very bland. $8 for a bowl of noodles in sauce is too much."}
{"text":"Not bad! The dumplings remind me of stuff I might be able to get at home. I ordered their classic potstickers and a bowl of pork noodles. These are done in in the Chinese style - the dumplings have thicker skins and are pan-fried, while the soup noodle has thicker noodles, clearer and cleaner broth, and pork with bone. I will say the noodles could have been more savory, even if it's a soy sauce-based broth. The dumplings were really nice though, well-seared with a good crunchy base, and the meat filling has a nice savory helping of pork and veggies. It's probably the closest thing to real potstickers I've gotten in Madison yet. (It helped that I was able to speak Chinese to them, and they had vinegar which is the traditional sauce that goes with potstickers.)  If there's a life lesson to be drawn, it's that you should get dumplings when the place is called DumplingHaus."}
{"text":"Not a bad place for a first timer looking to try dim sum. The menu is pretty straight forward I don't remember seeing anything that would be unappetizing to a first timer (chicken feet). Even though I like chicken feet. But anyway... It was very easy to order and the prices were very reasonable. I spent $40 for me and a friend and we were full. Me and him eat like pigs so the portions are good in that aspect. I don't fully remember what we had but it was all good. The shrimp dumplings and a pork dish were all very good. The beef curry dumplings were ok. What really surprised me was the fried rice. It's was very light and flavorful but wasn't plain and boring. The rice and other ingredients seemed to be fresh as well. The place is clean and feels more like a cafe than a restaurant. It's a great place to experience dim sum for the first time and I would definitely go back to try more."}
{"text":"My first visit experience was Five stars! But I really wanna try another menu before give them five stars. I had BBQ Bao and it was good. I also had Blackbean & Pork noodle bowl, it was soon good! Fair price, vegetarian menu, clean place and friendly host. I highly recommend this place for everyone!"}
{"text":"Slightly out of our comfort zone but glad we decided to give this place a try. We ordered pork dumplings and their chicken fried rice. Both were very tasty and fresh. Looking forward to trying them again soon!"}
{"text":"Okay, I REALLY wanted to like this place! I am always looking for somewhere to get fresh, flavorful dishes...but I just felt like this was a bit of a miss.   I ordered the Seasonal Harvest noodles with the add on of 4 haus dumplings. The noodle dish is vegetarian and changes depending on the veggies available. I am A-OK with vegetarian dishes, but not flavorless ones. This seriously tasted like plain noodles in water with carrots and bok choy. That's it. There was no seasoning whatsoever. The veggies were fresh and nice...but I was glad that I had gotten the dumplings(which were decent, but not amazing) to supplement. The melon green tea was refreshing, and sadly, my favorite part of the meal.   The man got the pork potstickers which, again, were okay but not amazing.   I agree with the comment that prices seemed high. The noodles were around $9 with the mini order of dumplings an additional $3.50. Considering the fact that I left half my noodles(and not because I was full), it was spendy.   I would like to go again and try the bao, and maybe a different noodle dish. Like I said, I REALLY wanted to like it. I hope to get the chance to update with an improved review in the future.  *And as far as the review from C.L. about ordering non-dumplings from a place called \"Dumpling Haus\", I don't think that a place called the \"Chicken Shack\" has an excuse for having a crappy steak, if they choose to put a steak on the menu.   If dumplings are the only thing you do well, then maybe you need to just stick to dumplings."}
{"text":"A little confusing for first-timers. The menu is written on chalk boards and is tough to tell how many of each come in an order, whether it's dumplings, bao, or wontons. We ordered what I thought was a reasonable amount of food, but what we got left my wife and I still feeling a bit unsatisfied.   Overall the quality was good. We had the pork dumplings, haus bao, and cream cheese wontons. The noodle bowls that we spied at other tables looked good as well. Service was fast, which was nice.   I would rate Dumpling Haus as average. Good food, but not good enough to get me to make a special trip to Hilldale just for the dumplings."}
{"text":"I have the pork dumpling which is really pretty good it was fried with a nice brown crust . is a little bit on the pricey side for what you get but otherwise pretty good"}
{"text":"Really solid place.  I'm typically pretty biased in my judgement of Chinese cuisine but this place gets a thumbs up from me.  In addition to the standard dumpling potstickers and bao zhi you'd see in a big city China Town, this place also has some really great authentic noodle and soup dishes.  My wife and I had the chicken lo mein and it was as good as my mom's!  As others have noted, the prices are a bit steep but they must have to have higher prices to cover the costs of the premium location in Hilldale.  Still, it's a great weekend spot or place to grab lunch on a weekday."}
{"text":"Pretty good place in Hilldale mall! Very unassuming because it's very authentic Chinese food in a mall area and it was pretty packed when we came on a Friday evening and waited about an hour from walking in to eating (so expect long lines and don't have anywhere to go afterwards!). The soup dumplings are delicious albeit very small and pricey. We also tried two noodle soups that had very light flavor and tasted very healthy. The noodles were good but I personally felt like it was something I could have made at home: flavor was light and a little lacking. However, the beef slices in them were excellent. Tender and succulent and all around delicious.   Overall, a pretty pricey place for what it is, but the food is tasty."}
{"text":"I must have had a really high expectation. We ordered the Haus noodle soup and black bean and pork noodles. They were both 80% noodles 10% meat and 10% others. Although the noodle soup has more meat. The haus stickers taste weird as well. I also ordered the custard baos and they were not that good either. They have really good bao dough though. So if you like baos, come here. Dont come here for noodles, u'd be disappointed."}
{"text":"The dumplings and boas were really good, but the pork and bean noodles were enough to drop to three stars.  It was gelatinous, flavorless, and there was no sign of black beans.  Reminded me of the corn starch laden food at the crappy Chinese restaurants."}
{"text":"This is a decent place for dumplings. The service was pretty fast and friendly. What more can you ask for?  The wrappers sucked for their xiao long baos because they easily fall apart and you'd lose a lot of the soup, but if you're careful enough to not have it break apart on you, the taste is actually pretty decent. It's not DIn Tai Fung good, but it's good for Madison. I feel like you kind of have to lower your standards for most Asian food when you're out in the Midwest; I'm okay with it as long as it's edible. The dipping sauce isn't quite what I expected either, but it's decent enough. They'd do much better if they can buy a decent bottle of Chinese black vinegar and just add in a few pieces of raw ginger strips. It's also quite expensive for such tiny dumplings (quite smaller than what you'd normally get at other Chinese restaurants) at 8 dumplings for $7. However, I will note that I'm not sure if there are other restaurants in Madison that sells these (as this is the only Chinese restaurant I've tried so far in this city).  We also got to try their egg custard buns. This was also pretty decent, but they don't taste all that much different from ones that I'd buy frozen from Asian grocery stores, so I can't really justify buying this here. Four buns for $5 is a bit expensive.   We also tried their noodles in black bean sauce (listed as black bean and pork noodles). Believe it or not, I've actually never tried the Chinese version of this dish; I've only had the Korean version. I thought theirs was pretty decent as well. I'd have wanted the noodles to be able to pick up the sauce better though.   The Haus noodle soup was the most disappointing dish for me. This is their take on the Chinese beef noodle soup, and it tasted very bland to me. Not only did it taste bland, the beef was also overcooked so it was a bit tough. They also chopped up their bak choy in small bite-size pieces, which I found very strange. Perhaps this is what their clientele wants, but it's not what I'm used to and I just find it unnecessary.   Would I come back? Probably not. In short, go ahead and order the noodles in black bean sauce, but that's it. Everything else is not good or extremely overpriced."}
{"text":"We ordered chicken lo mein, pot stickers, pork wontons, and siu mai, but only the lo mein is acceptable.  The other food tastes no better than the frozen food you can buy from a supermarket.  Never come here."}
{"text":"Ever since visiting Taiwan years ago, I have not found a dumpling or steam fun worthy of that region. Until now. Along the lines of Din Tai Fung this has to be the best steamed bun restaurant I have been to since timeline. The Buns were soft filled correctly and yummy yummy yummy."}
{"text":"It sucks that the dumplings stick to the pan, but they are super delicious. One order isn't a lot of food but that is OK since you're eating lunch here"}
{"text":"Awesome bao and noodles!  This is a place I frequent and recommend to people all the time.  I highly recommend: 1. Haus bao- filling is really flavorful and the bun is the best combo of soft and warm. Like a hug from your mom. 2. Haus pot stickers 3. Noodle Kick Everything I've tried has been really good, these just happen to be my go to favorites  The service can be slow at times, especially if you go at peak hours (weekends at dinner time).   This is totally an aside, but one of the employees can add up your order (with tax) faster than I can think. I am impressed by this everytime."}
{"text":"I just moved here and wanted to try something that reminded me of Chicago.  I ordered the Xiao long nap....soup dumplings. These were so hot when they came out. I had to let them sit so I didn't burn my tongue. The sauce for it was ok.   I also ordered the black bean and pork noodles. This was pretty filling and I was able to take half of it home for lunch the next day. The sauce was not too salty and it had just the right amount of fresh green onions and cucumber slices on top.   This is a smaller place and probably not the best for extra large groups. You can serve yourself water. You'll have to ask for forks if you need them but they only offer chopsticks next to the water counter.   There is also outdoor seating...a couple of tables.   I'm definitely going back for the Xiao long bao!"}
{"text":"This place is quite authentic. It's sort of took me back to China in a way, you don't get that much in Madison! Soup dumplings were very good. The noodles were on the light side but the flavor was not bad. They are slightly pricey and it can add up but I think it's worth it. The family that ran the place was really nice"}
{"text":"Dumpling Haus is great compared to your other options in Madison.  It provides a nice solid choice but I cannot say that is the best when compared to all the other dumplings I've had over the course of my life in other cities!  Got the...  nutella buns- you can't really go wrong with nutella. so this was a tasty treat  Haus Noodle Soup- it was good but didn't have a amazing quality about it that would make me want to order it again  Xiao Long Bao- these were my favorite among what I got. I'm a big fan of soup dumplings. These aren't the best I've ever had but if I were craving some I would come to dumpling haus to get them.  It's a cute shop, all those steam from the dumpling making make the windows of the restaurant front steam up like crazy!"}
{"text":"It seems to be Madison's only real dumpling offering in the Dim Sum category if Chinese and Asian style dumplings.   I've sampled versions menu items on various occasions. This place is the only place I know of for at least 100 plus miles where when can get a steamed pork bun. I've enjoyed the pork buns but found I prefer the steamed curry bun. The pork buns are good, but tend to be a little too sweet.   I've also sampled a variety of the dumplings. They are OK but seem to be a bit inconsistent, if not bland in there preparation. I also find the space itself can be hot... As in warm environmentally.  The service is pretty decent for what it is - you order at the counter and get a little table number to display.   I'd like to go back and continue to explore the menu. It's quick and inexpensive. The servings come in multiples, so it's a good place to explore the me use with 2, 3 or 4 people."}
{"text":"The Xio Long Bao is amazing here. Nice little dumplings that have a great tasty pop of soup as you bite into the dumpling. Only place that I know of where you can get these in Madison. Their soups are also very tasty and delicious. The owners are supper nice, they will split the soup for you if they know you are sharing it. Hands down best place in town to settle your cravings for quick, easy, tasteful dumplings or soup."}
{"text":"If you are looking for a no-fuss, quality spot for some of the best dumplings in town (from literally the nicest old man owner in the entirety of Madison), head on over to DumplingHaus.    I have been enjoying their house dumplings since they were located across the street inside Hilldale Mall. Their portions are relatively large; I would recommend three entrees for two people and then treating the food like tapas.   When I'm in the mood for something a little bit heartier, I will get their cold peanut noodle dish, which is essentially thick noodle, peanut sauté, freshly sliced cucumbers and crushed peanuts.   The interior looks like a scene out of Zoey 101 (a reference for all of my millennials out there), meaning that I would not call DumplingHaus a place of authenticity, but rather somewhere along the lines of funky."}
{"text":"Hands down the best Chinese in Madison!! Just happened to discover it after I was done shopping in Macy's.. Love the food here!! Must try shrimp wanton soup,dumplings,lo mien,fried rice!! I have tried Chinese before but i was never happy but this one stands out!!"}
{"text":"Let's start by stating unequivocally that the dumplings, bao zi and noodle bowls are nothing short of fantastic. The meats appear to be high quality with none of the nasty, low-quality cuts that bring down the ratings of so many Asian restaurants. The vegetables are fresh and when combined with meats to create their fillings, complement each other fantastically. The place is squeaky clean and the staff is friendly and thorough in describing the entrees for customers with questions. Dumpling Haus falls short of a 5-star rating only because (1) the ordering system is inefficient with just one register, which resulted in a long wait behind dine-in customers while my takeout sat on the counter getting cold; and (2) the quantity you receive for the price leaves even my young kids still hungry after paying $9 or more for an order. I highly recommend checking it out if you have a little extra time on your hands and money in your pocket."}
{"text":"Ate here for lunch while shopping at Hilldale.  I was with another person and shared an order of pan-fried Haus dumplings. These were excellent and I would definitely come back to try other dishes. Dumplings are made fresh and you can definitely taste it. The only thing that I would change would be the ordering method. The restaurant had menus that you would expect at a full-service place, but there was no formal seating or waiter service. I would recommend a menu board that explains dishes better instead of having those available at the front. But that is a very minor detail. Go and check out this place!"}
{"text":"PROS: Best dumplings in Madison, I daresay CONS: Slightly pricier than expected  Self-service, order-at-the-counter type of venue. Tasty, authentic, made-to-order Beijing-style dumplings. Okay sesame noodles. I will definitely be back for more dumplings in the future."}
{"text":"Tried the Dumpling Haus for the first time today for a late lunch.  So, so delicious!  We started with the pork steamed dumplings (forgot name), then I had the Sesame Noodle Kick and my husband had the Pork Lo Mein, we finished off with the steamed buns with the red bean paste for some dessert.  This ended up being quite a bit of food, but I'm proud to say we ate it all!  I loved the open feeling of the restaurant and being able to watch all the food being made.  Service was great too - every table was full and people kept rolling in, but the employees were very efficient and the wait for our food was not long.  All our food tasted fresh and everything had great flavor."}
{"text":"So-so fully Americanized \"Asian\" food at Hilldale prices.  The Haus Noodle Soup was ok, but after eating at Saigon Noodles or Hong Kong Station, you'll really wish you were having soup there, rather than here.  My kid had the Lo Mein and all I could taste when I tried it was salt.  Dumplings were pedestrian.  I've eaten here 2-3 time previously (focusing on buns and dumplings) and it was all forgettable.  Reminds me of the \"Chinese Restaurants\" in mid-Missouri that I thought were awesome when I was a kid, before I knew what good Asian food tasted like."}
{"text":"Xiao Long Bao is fine. I will give 3.5 out of 5. And the cold noodle(I forget it's name) is good.   This restaurant is in Hilldale Mall and is very easy to be found. People are friendly in there.  Actually this is my first time in Madison and this makes me recall the life in China."}
{"text":"I love the concept of the Dumpling Haus. It's basically a quick stop for dumplings and noodles. I ordered the pan fried dumplings, shrimp dumplings, and soup dumplings. Overall, it was nothing special but a nice place to eat if you have a craving for dim sum. The dumplings were balanced in flavor. My favorite was the soup dumpling.  The look, feel, and spaciousness of the restaurant gives off a great vibe. Space was well-taken care of and really clean. Customer Service was A+"}
{"text":"Victor B. mostly nailed this one. I can't believe all the gushing reviews here. The food here is really terrible and despite the name you can get better dumplings in the frozen food aisle of any asian market.  We tried some bao zi (buns) and guo tie (potstickers) and the peanut noodles. Both the potstickers and the buns had the same extremely bland filling. We pulled the filling out of one and it also had an unappetizing rubbery texture.  Furthermore, the buns had a slightly yeasty flavor to their dough that neither of us enjoyed.  Oh and they served soy sauce mixed with ginger and some other herbs with our bao zi and our guo tie with nothing. This makes absolutely no sense and should obviously be swapped. Who puts soy sauce on their bao zi?  From there we moved on to the peanut noodles which were probably the best thing we had, but it required some work on our part. There is a chinese peanut noodle dish topped with a sweet soy sauce that I tried to replicate with normal soy sauce. It elevated it to edible which is more than I can say for the other dishes.  The biggest problem here though is the price. Peanut Noodles were noodles and some cucumber slices in a rather small serving size for 8 dollars. Our other items were similarly overpriced. You can get much better, though slightly unorthodox, potstickers at China Wok for close to 2/3 price and get a larger serving.  However, I give the place a lot of credit for its interior design. It's nice and bright and the bar setup really works for a place that serves their fare. Too bad their decor is let down by their product."}
{"text":"We stopped after a movie and had the shrimp salad with tofu which my friend found too salty, and too heavy on the tofu; the pork dumplings which were tender and tasty; the hot and sour soup which lacked depth and was too gelatinous; the shrimp dumplings which tasted old and fishy, and the wonton soup. In this, the broth was way too salty, but the wontons were tender and tasty. So out of five dishes, one and a half were good enough to go back for. But is that enough? Eh, maybe we'll try again. Maybe not."}
{"text":"Amazing dumplings, perfect place when you want either a small plate or a full bowl of noodles. Love this place!"}
{"text":"I. Love. Dumpling. Haus. I have been going here for several years and never get tired of it. The food is delicious, the service is fairly fast, and it is easy to buy multiple things to share even between two people. It is an odd restaurant to have in a mall, but it makes it a hidden gem. Hilldale is now getting a make over so maybe Dumpling Haus will get a remodel, too. I highly recommend the meat-filled potstickers, veggie bao, and the house bao."}
{"text":"Not sure if they just didn't make a good batch, but my friends and I were not very impressed by this place :/ The service was fast and I liked the presentation of the food and the decor of the restaurant, so I wanted to like the food as well but it kinda fell short.  It's not bad by any means, but the food just didn't taste very 'well made'. I got the beef noodle soup...the noodles seemed low quality, the broth was quite bland, and the beef was alright.   The dumplings were a bit more redeeming, but still nothing to write home about in my opinion. I enjoyed my experience there but for the price, I don't think the quality was there.  If you're super into dumplings or want some hot soup, I'd still hit this place up, and maybe your experience will be a bit better than mine! Overall, not a bad place, but I'm not sure if I'll be returning."}
{"text":"I stopped in here last month for a quick lunch while shopping, after reading a bunch of positive reviews here. I'm finally posting my unfinished draft in finished form. My impressions are as follows...  The good:  Really low chairs at the tables, for less messy noodle slurping Gluten free options in noodles and dumplings Ordering is done at the counter, but signs inform that no self-table-bussing is required Condiments all at hand in one spot: water, chopsticks, silverware, napkins Quiet and bright, bar seats available Open kitchen, you can watch it all being prepared  The meh: Coke products Ground and formed kibble-like pork bits. For $8.50, I expected real pork pieces or slices in my spicy pork noodle bowl. Flavors are good, but average, fairly \"comfort foodish\"; no dramatic standout flavors. I have a feeling they cater heavily to parents with little kids/elderly clientele, based on my fellow diners and the somewhat bland flavor of the food. I added rice vinegar, white pepper and chili sauce to make my soup taste like more than just vaguely oniony pork broth with noodles. Green shreds of what was called cabbage on the menu board, but was more like a sparse parsley garnish in appearance and amount, were the only other things in the bowl.  Marconi lights hang from red cords, Swedish modern tables and chairs, spare but comfortable layout and design and low music volume make a pleasant dining space.   I'll come again another time and try some other entrees."}
{"text":"Some people may think my rating of four stars for DumplingHaus is too high, but let me explain.  DumplingHaus is located in Madison, Wisconsin, which -after living for about five years there- is not a city known for Dim Sum, let alone tasty Chinese food. Although the city has increased the number of Chinese restaurants since I've lived there, it still is far less than other large mid-western cities. That's why DumplingHaus' prices are so high. There's no competition!  I rolled up into DumplingHaus with my Asian crew, and we got dumpling wasted! Where was DumplingHaus during my college career? Below are the dishes we feasted on:  Shrimp Dumplings - Very tasty, but I don't think I would order it again.  Pork Shaomai - The pan-fried dumplings stuffed with pork, veggies, ginger, and scallions were delicious. I regret not eating more.   Wonton Soup - Solid dumplings with a very tasty (and not too salty) broth. This is perhaps the biggest surprise I had eating here. A small serving for the price.  Barbecue Bao - The bun filled with roasted barbecue pork was good, but not great.  4 Servings of Xiao Long Bao - The soup dumplings filled with pork and ginger were very good. So good, that after the initial serving, we ordered three more. For only the Xiao Long Bao, that's 32 total dumplings. *Note: Be careful when eating. The soup in the dumpling will burn your mouth.  Overall, all of the dumplings and bao are great. After our meal, we had an opportunity to speak the owners. I asked them if the dumplings were fresh, and they said that they make their dumplings from scratch the day before. They are then put in the freezer at night so they are ready to be steamed the next day before being served.   The food isn't the best that I've ever had, but given that it's Madison, WI, it would be difficult to find a better place. But that's not to take anything away from DumplingHaus. The food is delicious, and I wish there was several of them in the Twin Cities!   I would get my fix every week."}
{"text":"My (teen) daughter and I had a wonderful dinner - both loved it.  Our meal Haus (Pot) Stickers, Haus Noodle Soup, Black Bean & Pork Soup, and Beef Curry Bao, The often picky teen  made happy-eating noises all through dinner and talked about her Haus Noodle (with pork and veggies) soup all evening and into the next day.  I was impressed with the Bao which was really fluffy and flavorful, but also substantial and made a great meal. Haus Sticker dumplings were good and the Black Bean & Pork soup which was okay but didn't wow me with flavor (I was also disappointed that it was not a broth soup, but noodles with a black bean and ground pork \"sauce\" - served \"spaghetti-style\" for lack of a better analogy with a thickish \"sauce\" over noodles).  It was our first time there, so didn't realize that each dish whether a dumpling, bao or soup is basically a meal's worth so ended up over ordering - on the upside, we have lunch again today.  Would be a good place to go with several friends (tho beware limited seating) and just share several plates.  Owners are very nice and friendly. Will go again!"}
{"text":"The dumplings I ordered were so good! I got one with beef and one with pork and that was really the only difference in taste even thought they were separate menu items. Totally NOT complaining though because they were delicious and even though I went yesterday, I want to go back today. ADDICTED."}
{"text":"MOAR BAO ZI. MOAR.  Despite the super anglicized name, DumplingHaus seems to be a typical mom-and-pop Chinese restaurant. The adorable gentleman at the cash register reminded me of my grandfather, really! So much so that I was THIS close to ordering my food in Chinese...but I could only really read half of the Chinese text on the menu so I didn't want to make a fool of myself.   Anyway, I didn't have very high expectations for the food (seriously now, who would expect a place called \"DumplingHaus\" to provide high-quality, authentic Chinese food?!), so there wasn't much for the restaurant to live up to.   I ordered the cold peanut noodles and a plate of veggie bao zi. Neither of the dishes was very complex, and I am 110% positive that the veggie bao zi came from some plastic bag from a frozen foods aisle, but I'm not complaining - they hit the spot!   I've since picked up some veggie bao zi from a local grocery store, so I probably won't be back any time soon, but it is good to know that a Chinese restaurant like this exists in Madison!"}
{"text":"Honeydew tea is very refreshing!  I love this place because it is so different.  It is authentic.  It is not my usual burger or pizza place...well, mostly because it has neither of those items.  But it does have a great variety of noodle dishes, dumplings (hence the name) and well, other stuff I have not tried.  When I feel adventurous I like to go here.  It is pretty sad that red bean paste is me stepping out of my comfort zone but it is good!  Everything is really clean and efficient as well.  We got our food within 10 minutes and it is all really fresh.  Good prices as well!  4 dumplings was $8 and then 8 wontons, a soup and the tea all added up to be less than $20.  Nom nom nom..."}
{"text":"So delicious! As a vegetarian, they have great options for me. I really love the veggie bao & Nutella bao!"}
{"text":"So I finally made it to the DumplingHaus. Tucked away near Macy's in Hilldale mall with a very German name is not where one would expect to get some good dumplings - but here we are all the same!   The whole place feels very modern with a red and white Ikea/Crate & Barrel feel...it's set up like a standard fast casual restaurant. Order, they have everything written on a board as well as a bunch of specials!  Once you decide grab a table and set yourself up. Grab some utensils, chili garlic sauce, soy sauce (if you need), and some napkins. Have a 5 minute conversation and your order will be served up - piping hot!  We tried the House Bao as well as the Xiao Long Bao. They both were amazing. I loved the Xiao long bao - the ginger really came through. I do think they could have included more soup and they were not served with the correct spoon - but this is minor note as I was having soup dumplings in Madison!   The House Bao had a light and fluffy dumpling quality with a very good quantity of filling. I loved dunking it in the vinegar with a little of the chili garlic sauce - so good!  This place became crowded quickly but turnover is also pretty good so not too bad of a wait at any given time. A lot of people had noodle bowls so next time I will get some of that action. But as far as the dumplings go - yum!"}
{"text":"My boyfriend, Mom and I stopped in here for a quick lunch on a Saturday afternoon. We heard good things and figured we would give it a try while in the area. The seating was limited  around 2:30 pm but we managed to find a table for 3.  I honestly didn't spend enough time reading the menu and kind of just ordered based on the vegetarian recommendation of the guy running the register. He was very nice and tried to offer me several items that he thought were great. I settled on the peanut glaze bowl and veggie wontons for us to share. My company both got the black bean and pork dish.  None of us were really impressed with our noodle bowls. In my opinion they should have more veggies otherwise it's just too much noodle for my taste. Mine was garnished with cucumber slivers but not enough to add any flavor. Broccoli would have been nice. Their bowls were bland too, and I think the pork should be sliced and not tiny chunks like another person mentioned.  The wontons were okay but I have had better. I think they were filled with just seaweed or possibly spinach? Couldn't tell but the dipping sauce was good.  All in all, I was pretty sad that I spent $27 dollars there for 2 of us to eat (I paid for two meals and the wontons). I left wishing I had spent that money at Noodles and Co. or anywhere else for that matter. I don't live in the area so I won't be back, but it's possible they have other items on the menu I would enjoy."}
{"text":"\"This is going on our regular rotation.\" Wisdom from my oh so critical boyfriend as he slurped up Peanut Glazed Noodled and Jin Xiao steamed dumplings. When it came to the Nutella Bao, however, there were no words. Just small mutterred sounds of happiness and yeah ok, some silly sound effect as we played with the pillowy bounceable Bao. Go. Its a casual atmosphere. Wear your sweats and dive in to comfort food."}
{"text":"We love this noodle soup and dumpling place. My daughter and I come her to share awesome comfort food"}
{"text":"This place is incredible! I had the Haus noodles with beef and it was delicious! 10/10 would recommend! The food is incredibly authentic according to my companion who had just been in China for 6 months. He had missed the dumplings and was very satisfied with what they offered. Beware though that bones are kept in many of the dishes because that is how it is traditionally served in China. They also do quick and easy takeout!"}
{"text":"This place is such a hidden treasure. I still stop there when I come back to Madison (I live in Chicago) because I'm straight up addicted to the Harvest Vegetable Soup. It's a simple soup that basically tastes how a warm hug feels, if noodles and baby bok choy were involved. There are many other great things on the menu too, like their dumplings (of course). The prices are a bit high, but you can tell from the flavors that they use high-quality, fresh ingredients, so for me it's worth it."}
{"text":"I've been twice this month.  A pretty good sign that I dig it.  And although I've oft compared dumplings to lovely lady food, the place is filling.  I will agree with many who've said the prices are high given the ingredients, but I'm happy to pay for things that take a gentle hand. I wouldn't dare try stuffing delicious meat and veg into a small pocket, sealing that up, then lightly pan frying it. No way. And so I'm glad someone else has it down. I do with the menu was more protein rich, but on my last trip, I discovered you can take whatever protein they have and add that to whatever dish you like. So for example, if the spicy noodles get you going but you'd like some chicken... ask them. They seem happy to accommodate."}
{"text":"I can't explain how much I wanted to love DumplingHaus and I was so excited to try out their new location. I have such a soft spot for dumplings, bar, and noodles and the fact that DumplingHaus offers all of it in one place is enough for my heart to soar. While the place itself has open tables, decent ambiance, and easy ordering from the counter, the food itself just didn't deliver for me.   I tried the cold Peanut Glazed Noodles and while it was a good sized portion for $8, there just wasn't enough flavor for me. The noodles were a little overcooked and heavy, and while it was something I could eat with no problem, I just didn't feel like I wanted to keep going.  We also ordered the Xiao Long Bao - they came out hot and looked like the perfect pockets of heaven I know them to be. Now, the best/most challenging part of eating XLB is picking them up with your chopsticks without breaking them and delivering it to a spoon successfully, the ones here were a whole new level of difficulty. They really stuck to the dish and more than half of ours broke, no matter how gingerly we picked them up. The meat inside was also a frightening pink color. The taste was fine, nothing phenomenal but I was a little heartbroken over the experience.  Overall, I think DumplingHaus has a lot to offer but needs some adjustments to get there. I think I would return just because no other place really offers some of their items readily, but I hope they take a look at some of the reviews and get DumplingHaus to the level of stardom I know it can be!"}
{"text":"DumplingHaus is a small little Dim Sum shop in the outdoor/indoor mall in Madison and is a pretty small, great little place for lunch if you're in the area.  It's more than just a few notches better than any food court stall, and serves decent Asian dishes really, really quickly!    Since this was my first time there, my friend and I went all out, and ordered the cilantro-tomato soba, shrimp dumplings (can't remember their official name), the Haus Buns and the Barbecue Pork Buns.  For me, the shrimp dumplings were the best part, covered perfectly in a wrapper and really vibrant with shrimp-y shellfish-y flavor.  There was maybe 8 of them in a classic dim sum steamer and man, they were just excellent!  The dipping sauce that came with them only served to amplify their deliciousness to the next level.  On the other hand, the buns were sadly a huge disappointment.  I came in expecting them to be housemade, but after taking a bite out of them, I knew immediately they came from a classic frozen package of buns you can find in practically any good Asian market.  The flavor was fine, but having made bao like these before from local markets, I knew immediately it wasn't quite what I had dreamed of.  Sadly since 3 barbecue pork buns were something like $6.95 at the restaurant, I couldn't help but feel ripped off since a frozen bag of 12 or so cost a few bucks less than that if you were to actually buy them at a grocery.  All that said, it was still a nice experience, the food came out quickly, and the staff was very friendly.  Maybe the extra cost isn't so bad when you know you're paying for the quick convenience of it all!"}
{"text":"Very good place for Chinese dumplings, in Madison. Small soup dumplings are delicious. The guy at the counter is not surly as another reviewer said, but simply a normal Chinese restaurant guy. It is also not true that the prices are not posted. You pay first at the counter and cash register,and then they bring your order to your table. Highly recommended, if what you want is Chinese style dumplings, and you happen to be in Madison Wisconsin."}
{"text":"Right up front, I need to say that, despite a lot of gastronomical adventurousness that I have, it does not translate to Chinese food.  I like Chinese food, but I always eat the same thing--potstickers.  My wife introduced me to the Dumpling Haus a couple of months ago.  Wow!  The ingredients are fresh, you can watch them prepare their food, and it comes out fast.  I freakin' love this place.  It may not be the absolute greatest food I have had, but if I am going to have Chinese food, this is the first and last place I am going in Madison.  Noodles and dumplings!  This place was made for me."}
{"text":"I've been here twice in the last week. I'm probably going to shoot for three. That alone should tell you what you need to know about it.   The bao are simply amazing. I insist you try the taco bao, even if it scares you a little. It's fresh, crisp, and amazing. The flavors are perfect. When I ordered it with my husband, he turned his nose up at the idea like a 3 year old presented with Brussel sprouts. I'd had them before, so I knew he would be proven very wrong in his assumption. I was right. He got to try a bite of mine, and attempted to steal the whole thing. I had to fend him off with a chopstick. I've also had the beef curry bao and the BBQ beef and pork. All very good, but that taco bao...  My husband ordered the peanut noodles, something an allergy prevents me from eating. I had to sit across from him while he raved about how awesome they were. *Please note I ordered these to go for him when I went back without him. They do **not** reheat well, but are good cold*   It can get a little pricey if you order a couple of different things, but is well worth it. Try the honeydew iced tea!"}
{"text":"I'm a sucker for dumplings of any variety, and these are among the best in town. I've been here about 6 times in the past 4 months and look forward to every visit.  Xiao Long Bao is the perfect food - soup dumplings with great sauce, ideal texture, and served at the right temperature. Bao Zi are also good - the Barbecue one has great filling. Noodle bowls slay - only other place in town that's nearly as good is Umami. Everything I've had on the menu has been top notch.  Low-key interior, usually very clean, staff always friendly, and the price is right. Lately for lunch I've been getting Xiao Long Bao and a soda and with tip it is about $11. I'd come here during shopping at Hilldale, before a movie at Sundance, or (as I do), for lunch during work. It is a bit crowded during the noon hour, but I've never had to wait for a table."}
{"text":"I had worked part time at Hilldale Mall, so I have been to this establishment many times.  I had tried to find something to LOVE at Dumpling Haus but I wasn't wowed by anything.  The Veggie Noodle Soup is nice, especially during the cold season.  The potstickers are nice but not super special.  I just didn't get excited about the Dumpling Haus as a destination.  I have a friend who lives and dies for the peanut noodles with chicken served cold.  So that means I ended up there more than I wanted.  But during the Wisconsin Film Festival, I grabbed the Curry Beef Bao on a whim.  OMG, it is so flavorful and delish!  The fluffy bun is a nice contrast to the slight kick of the curry ground beef.  I have had it a few times since early April and it has not disappointed.  I have finally found my go-to item at the Dumpling Haus.  :)  Side note:  The family that runs this business is so nice and helpful.  They are the real reason I have eaten there as much as I have.  This is a local business that deserves to keep growing."}
{"text":"Used to like this place.However today... very poor value for the money. Prices are no longer posted, it appears that the old guy at the counter makes up the numbers as he writes down your order.and surprise surprise .. No printed receipt... hmmmm  How legal is that? No posted prices, no receipt.  Never coming back."}
{"text":"I brought my friends from China here and they were blown away to find such traditional Chinese food in Wisconsin. I was so happy they loved it! And I did too!!! Beautifully decorated and in a great location. The menu was even written in Chinese and English. There is even a viewing window of the chef cooking!!! So cool!"}
{"text":"The best baozi in Madison! I like to have bao and noodles there, especially in the morning. If you want to try some Chinese special, you should go there."}
{"text":"I rave about this place all the time by word of mouth, so it's about time I put it online. Any place that serves authentic xiao long bao is a rare gem in the U.S. The delicious dumplings are served directly in a metal steamer and there is that unbelievably rich soup that bursts out after your first bite. Mmmmm...just like the ones in Hangzhou and Shanghai.  The dessert buns, house dumplings and all the other items on the menu are delicious too. Nothing is drenched in corn starch or fried. This is good 'ole northern China cookin' right in Madison! The cooking staff is straight from Beijing and makes all the wrappers by hand from scratch. Prices are a bit high if you want to be really full because it's hard to just order 1 of anything here. The Asian drink selection is great too. All around awesome place right in Midvale Mall, where there's ample parking."}
{"text":"After eating here, I feel a little unsatisfied.  The food tastes good but it doesn't quite hit the spot!  The \"Haus Stickers\" are tasty but don't have a great enough contrast between crispier bottom of the dumpling and the inside. To me, that's one of the best parts about the dumpling.  If you want something more virtuous, the Seasonal Veggie soup has broth, noodles, and vegetables, good for a cold day or if you're feeling a bit under the weather.  Super light flavored broth--again, it feels a little lacking in complexity.   The employees are charming and it's a good quick option in Hilldale but more flavor and texture is necessary to lure me to the Haus."}
{"text":"Great dumplings much cheaper and less pretentious than the hipster place across town."}
{"text":"small, quick, and good = my kind of place. shrimp dumplings and sesame noodle kick were awesome. wish I could take this place home with me."}
{"text":"Delicious veggie dumplings. Quick service. My go to place for take out when traveling between the hospital and west clinic. People are also very friendly."}
{"text":"Great food in a neat location. I got the mix of the buns and each of them was amazing. The noodles are made fresh and the noodle bowl was huge! It's a bit pricy but you get a lot of food. The guy taking my order reminded me of an Asian version of my grandpa and he was sure to check on my satisfaction. It was adorable. I would come back here for dinner but there was too much food for me for lunch."}
{"text":"We were visiting from out of town and wanted ramen. Through Yelp, this was the closest location. Not knowing what to expect, off we went. When we realized it was in the mall we were a bit skeptical. Since we really wanted ramen and we had limited time, we went for it.   What a surprise!  While they did not have traditional ramen, they did have noodle soup. The dashi (soup base) was perfect. Not too salty and flavorful. We added on pork shumai and shrimp dumplings. They were excellent as well.   The atmosphere was simple being a mall restaurant, but the food was great.  We could see where the food was being prepared from scratch, which was a nice add. We would go back next time we are in town."}
{"text":"We love dumpling haus! We were here two days in a row a couple weeks ago. My son loves their shrimp dumplings. Their house dumplings and soup dumplings a really good too. The wrappers are very delicate not too doughy with just enough filling. The sauce they come with is super yummy too (make sure to get the hot chili oil on the back counter).   Their noodle dishes are really good too. My husband likes the sesame noodle kick and I love the black bean and pork noodles. Taste very traditional like you would get in Chicago's Chinatown.  Service is also excellent. The gentleman at the front counter is always super nice to our son and gives him an extra fortune cookie. The prices are a little high; if you start to order noodle dishes plus dumplings you bill can get quite high. But they are located in Hilldale and rent is probably through the roof and the food is always amazing so I don't mind paying a little more for good quality."}
{"text":"The Best: The Sesame Kick Noodle and Xiao Long Bao (???) also known as soup dumplings are a winning combination that will have you coming back again and again! I've taken several of my friends here with this combo and no one has been disappointed yet. Certainly one of my more favorite Asian style comfort food place. Highly recommend!   Side-bar: do you know how to eat soup dumplings? Place one dumpling in spoon being very careful of not ripping the skin. Dip the dumpling in the delicious sauce, and nibble the corner of the dumpling. Drink all the savory soup and then eat the rest of the dumpling!   Other Food: Bao zis (??) are okay, black bean and pork has a creamier texture that can also be enjoyable. Other dishes are good but get the winning combo if you want something delish!   Services: Water, napkins, and utensils are self-serve. Speed is usually pretty quick, depending on how busy it is. Would estimate ~10 minutes from order time.  Other: restaurant is family-ran, restaurant owners are from Bei-Jing I believe but their menu features dishes that are specialities from different cities like Shanghai and Southern provinces."}
{"text":"Never had dumplings like these before! Lightly steamed and filled with all wonderfully spiced fillings-- too hard to decide which tasted the best!! It was a great place to get a quick bite to eat while shopping the Hilldale shops. Enjoy the time here!!"}
{"text":"Potstickers are not very tasty, yet the veggie Baozi is not bad. Veggie tofu is a relatively authentic Chinese food."}
{"text":"Pretty tasty food in a nice setting in the Hilldale Mall.  The bao were sweeter than I thought they would be and the dishes we had were saltier than I was expecting.  I had the Spicy Sesame Chicken Salad and my fiancee had the Black Bean and Pork Noodle Bowl.  Service was friendly.  Definitely worth a trip."}
{"text":"I finally got to taste their shrimp dumpling. And it was okay. The sauce was not my favorite at all.  I'd give it the benefit of a doubt so I may try other menu and might have a different opinion. As for now, a three-star rate is sufficient."}
{"text":"It's pretty good. My favorite dish would be the Taco Bao! You gotta have it!"}
{"text":"Good for a quick noodle dish and the only place I know of in Madison that serves a big variety of dumplings/steamed buns."}
{"text":"Dumpling Haus is by far one of the best places to get Chinese food in Madison. While their menu is more limited than other restaurants, it just proves that they keep fresh, quality ingredients around. I spent a summer in China recently, and the food here reminds me of the quality food you find in those random hole in the wall restaurants. I am definitely making it my summer goal to try everything on the menu!"}
