{"text":"Just based on their pastries. I was just stopping to see their lunch menu on the way to another lunch spot. The girl was so nice that I decided I wanted to buy something. I bought two pastry raspberry and something else thing ma bobs and woooweee. That stuffs like crack. And I dont even enjoy pastry things. This is on a whole other level. Be warned."}
{"text":"An excellent new addition to the neighbourhood! The kitchen offers sandwiches, baked goods and take home. We got a roast chicken with two beautiful sides and two biscuits. Every item was just right, but the chicken especially was epic with salty, crispy, lemony goodness. Decent price too- how often do you get a top-notch dinner for two, with leftovers, for $25 taxes in? The hours are a bit tricky because they close at 7 pm and aren't open on weekends but it's good for stopping by after work to grab something on the way home. Definitely check these guys out."}
{"text":"They care about their food and vibe and costumers.  The first time: Friend and I had the Meatloaf Sandwich and Chicken Sandwich .. both were full of flavour and the meat was perfectly tender, we couldn't stop talking about it while we sat there staring out the windows at the passer by's (excellent feature).  The second time: Today I walked in and ordered their \"Summer Intern Chicken Sammy\" to go, and the girl who was working was very kind to me and made me feel confident in myself! It really put a pep in my step. Ya can't ask for better costumer service than a genuine vibe like that.   Their deals are also really playful and decent (like $1 extra for a freshly baked cookie of your choice) .. I strongly encourage people to check it out to sit in and enjoy the atmosphere, or get it to go and eat it in a park."}
{"text":"I finally joined Yelp just to review this place... Stopped by for lunch with a group today and was thoroughly impressed with this great addition to the neighbourhood. We had the breakfast sandwich, roasted chicken sandwich, quiche and a few sides. Everything was incredibly well crafted, with all or mostly-home made ingredients. Far from ordinary and a great alternative to \"convenience\" food like subway...  The owners both work in the kitchen and at the front and are exceedingly helpful and friendly. Having a peanut/nut allergy I had lots of questions and they were very careful and accommodating (they do have nuts in the kitchen, though). Baked good looked spectacular!"}
{"text":"I'm a big fan of DPK. The chicken dinner is delicious and grabbing one for takeout is a great alternative to eating out. It's disappointing that they're only open on weekends but their food is so delicious, you'll just have to forgive them..."}
{"text":"This place generates high expectations, perhaps because of price or perhaps because of aura.  The soup was uninspired and the roast pork melt was smallish with flavours compounded to the point of being indistinguishable.  The pastries looked amazing and it appears that the chicken dinner garners some respect, so I may well revisit the place."}
{"text":"I am a sucker for a good sammy, and this place is serving up some really tasty ones. I originally wanted to try the daily special that day but there was a ton of cheese mixed in so I opted for the Turkey Intern and I'm not mad about it. It was really good. Like so good that I am craving one now. You even get a cute little salad on the side!  Next time I want to try one of their pot pies which also sound really good. The trouble with writing reviews while you're hungry is that you just want to eat everything you're typing about. ahhh the struggle.   Anyways this place is so adorable and if you happen to be in the Dundas West/ Ronny area totally check it out."}
{"text":"I was wandering around with a friend from Dundas West station and stumbled upon here. An excellent place with awesome sandwiches, great service, and a neat little atmosphere. If you're ever looking for lunch, Dundas Park Kitchen is a great bet.  I picked up the Meatloaf Melt sandwich and it packed a tonne of taste! When you have meatloaf, you don't really expect refined flavours but I was really impressed with its quality. No idea what cheese they were using was but it was delicious. My friend got one of their pot pies and a salad which he told me he enjoyed as well.   We also had one of their galettes (I want to say it was bumbleberry) and it was also really good; we scarfed it down embarrassingly quickly.   The service was also quite on point. The woman working at the front asked us how our food was and seemed to actually care about how we were enjoying it. There's not a whole lot of seating (it's really only a few stumps near the window -- but it's a nice view from the stumps) but otherwise, it's a good space.    Definitely check it out if you're ever in the area and need lunch."}
{"text":"The sandwiches seem to be all the hype, the quiche is good too, but I really liked \"The Special\" - parmeal bacon, pesto, mushrooms, cheese.... Amazing flavour and very fresh. A bit oily though, due to excessive pesto, but was totally worth it. Very limited seating, so best to do takeout"}
{"text":"Great little cafe! The people there are soo friendly and that's what I love about visiting bakeries in downtown. The lady helped me decide what to pick and I ended up getting the gluten free chocolate walnut cookie and apple galette. About $6 in total.  I love galettes and this one doesn't disappoint!! The pastry is crispy, soft and buttery, and the filling is not too sweet! Too bad that you can probably eat this in a couple of bites  I didn't like the cookie though. It was very gooey (like marshmallow) and it was like eating a macaron- overwhelmingly sweet."}
{"text":"4th time is the charm, finally open. Nice staff, chicken pot pie very good, 11 bucks (w tax) for small is too pricey. Baked goods look terrific."}
{"text":"I woke up this morning craving soup and googled \"best soup in Toronto\" only to be directed to Dundas Park Kitchen. What a fantastic find. After one trip to DPK I'm already a fan.  Lots of great lunch options, too many to choose from. I opted for a roasted chicken sandwich and a tomato soup with cheddar croutons.   The soup was FABULOUS! It was definitely one of the best tomato soups I've ever had. It was so flavourful but not too tart like some tomato soups can be. I could eat this ever lunch. Even though I want to try the other soups that DPK has, I may have to opt for the tomato soups again because it was that good.   The sandwich was very good as well. It had roasted chicken, sun-dried tomato, Portuguese cheese, crispy prosciutto and lettuce. It was very good. The bun made it a little difficult to eat, it was still very good.   The soup was definitely the shining star of the meal. Next time I may just opt for a meal sized soup and skip the sandwich.   I love the look and vibe of the place. The staff was very friendly. I will definitely go back."}
{"text":"I had an UberEats delivery from here, Turkey Chili.  Very good turkey Chili, good ingredients, light taste, none of the 'hyperchili' spicing.  However: a small cup of chili was almost $14 delivered.  Delivery fee is $2.  $12 for a cup of chili? No, just no."}
{"text":"At the Wychwood Barns Saturday Market, Alex and I started bantering a few years ago and I knew I had met a classy guy in every way. Caring cook, family man, optimal employer, smart, observant and willing to stretch and discuss. I drop by for the pleasure of his company and the friendliness of his staff, both at The Barns and at The Kitchen.   I am always happy that I did and by the way the food is the same quality as the people who produce it. I don't like to buy food from people who are unhappy. This has never been the case and the food....never disappointed."}
{"text":"There are a lot of things to love about Dundas Park Kitchen, a tiny little bake shop, and lunch counter just outside of Roncesvalles Village. One of the things I love is just how hospitable owners Melanie Harris and Alex Tso are.   Everything is made in-house, from scratch using locally sourced goods are included in all of their baked goods, pastries, loaves of bread, soups, and sandwiches.    Their menu changes seasonally and I'd highly suggest getting your hands on one of their galettes. I'm not normally one for sweet things, but ooooh boy. Whenever I get my hands on this, it makes me so happy."}
{"text":"Loved the cob salad ! Although not traditional definitely hit the spot. The regular seemed small at first but was jam packed with with chicken ! Didn't realize that they had gluten free sandwiches ... They seem to be the main event so I'll get that next time."}
{"text":"I want to give this place 4 stars for the food. Delicious beef pot pie - steamy, juicy beef with peas and carrots inside, side of a well dressed salad topped with alfalfa sprouts, peas and beets. I've tried their chicken sandwich on a separate occasion and a bite of my friend's meatloaf sandwich (I'll have to get my own next time, it was a quite good!). However, I give them only 3 stars for lack of organization. While waiting for my pot pie to heat (~ 10 minutes), they could have given me the root beer or the cookie I ordered/paid for. By the time my food came, they had completely forgotten about my drink and I had to remind them which one I ordered. My pot pie combo also came with a cookie. I ordered the birthday cookie, which they also completely forgot about, and I left the store without it. I only remembered when I got home! I was going to give it to my fiancé tonight as a dessert..."}
{"text":"This place is never a disappointment and it gets better and better every time I go. The chicken sandwich is amazing. I usually steer clear of chicken sandwiches as I'm always disappointed by how dry the chicken can be but this place gets it so right.   I have yet to try the pastries but they look so delicious.   Service is great and fast.  I strongly recommend this place.   Be warned though, there isn't much seating. So it's best to take things to go and enjoy them elsewhere."}
{"text":"I've lived in the area for almost 10 years and just now found this hidden gem! The food is fresh and so tasty. I had a curry soup which was made from scratch - fantastic! The Turkey Intern sandwich was the best sandwich I've had in years. All topped off with a chocolate chip cookie with a pretzel on top. Divine!  Highly recommend this place. Service was perfect. Music great. Food exquisite!!"}
