{"text":"Not only is this a Portuguese Churrasqueira but they also have a limited selection of produce, breads, pastries and rice pudding.

The hot table selection ranges from rice,  potatoes, fried and battered fish, shrimp and of course BBQ CHICKEN!

You can buy a whole or half bird and have a choice or mild or hot sauce (however you always get hot anyways :P)

They can come across as a bit aloof ( I don't think most of them speak English)but don't let that bug ya! The food is awesome."}
{"text":"Count your change.  Tonight I was significantly overcharged for the THIRD time!  Coincidence?  ...I think not!   Have spoken to several people who have experienced the same thing.  If you are not Portuguese the chance of you getting ripped off by the employees here is FAR greater.  When I complained on a neighbourhood Facebook group about being stolen from, others came out of the woodwork to complain about the same thing.  Buyer definitely beware. Also, they buy flowers and plants from thugs who drive around on bikes stealing them from porches. Their patio is full of plants. They (BBQ Chicken Place) then sell them to make a profit.  Not cool."}
{"text":"The story of Eduarda's BBQ is so sad. In the beginning, many years ago, for $5.50 they would give you half a chicken, rice, and potatoes, and a magical secret sauce (it was Frank's Red Hot Sauce). Then gradually they have raised the price over the last 10 years to around $10.

Which is fair, considering the chicken is sooooo good. But you can't eat the rice there anymore because the workers don't know how to properly clean out the tray, so mixed in your rice are solid bits of rice from last week.

Also, bring exact change! Because they don't take credit or debit. The last time I was there I only had a $20 bill, and they owed me around $4 in change which they said they didn't have. So I waited around for five minutes until a customer came allong and paid with coins."}
{"text":"Who doesn't love Portuguese chicken?  This place has it and although it's not as good as Cantanhede O Bairradino, it's still pretty decent.  The place is very small, so you'll be looking to get take out here as it's set up for a quick grab and go rather than a sit down restaurant.  

The chicken is fairly tender and although I've had it served a little dry on me a couple of times, I find the hot sauce helped out with that.  The sides are great and they give you plenty!  The typical rice and potatoes are the main ones and they taste just as good as the other places around the neighborhood.  

This is a nice place to stop by, but be warned it gets hot in here, during the summer.  I believe they just have a few fans blowing and with all the ovens and cooking, this place gets sticky!  A nice stop and family owned business for sure."}
{"text":"A whole chicken dinner with rice and potatoes for 9$! Yes please. While this place may not be as nice looking as some of the other Churissico places in the neighborhood, it does a steady business with the locals and the food and bread is quite nice.

 Even the pork cracklings are delicious!"}
{"text":"Large thumbs down! So, not only has this place overcharged me for things (chicken, lemons, beverages) that customers ahead of me paid less for... hmm... but now that it's summer again, they've taken to letting drunk customers harass neighbours. Three times now, I've been verbally harassed by the drunk men (or employees?) who sit outside with their bikes locked to the fence. Not a nice community place. Scary and unsafe."}
{"text":"I have driven by this place numerous times, and finally checked it out.  The lack of Yelp reviews reflects the true local character of the place, which has been here a long time.

Local regulars in line suggested I try the chicken and rice, so I went for it.  Here's the verdict....

1. The chicken and rice is delicious. The server brought a whole chicken straight out of the oven, removed it from the spit, and chopped and sauced it on the spot. 

2. The chicken is flavoured with hot sauce if you want. The regulars suggested I ask for extra hot sauce.

3. The food is all take out. There were some great looking fried pies by the register I plan to try next time.

4. They do take credit cards. I did not have cash and flinched a bit as I was reading the other review while in line.

5. A half a chicken with hot sauce and a huge plate of rice  (enough for 3 people, but I ate it all) was 8 bucks out the door.

6. The service is nothing grand, nor is the restaurant itself. 

In conclusion, this is a solid four star place. It is a great value, and the chicken is delicious. I will be back."}
{"text":"Good food for good prices!
The lasagna is very good, so are their potatoes.
Although there is no air conditioning, there are places to sit so it is good for a group."}
