{"text":"disapointed.  not only did the food take forever like 20mins to come out (for two salads) but also ordering took a long tine as well.  not enough check ins with the waiter.   i had asked for the salad to be cheeseless and a substituition of avacado and no gluten due to allergies.  i ended up getting a salad with cheese on top after waiting so long for food to come out.    i tried scrapping off the cheese but ended up getting sick afterwards.  when the waiter came to check in and asked \"hows the food\" i mentioned they forgot to take off the cheese.  instead of apologizibg we went into a debate about what he heard while taking my order which was actually more inferiorating experience because even if he did not hear what i clearly ordered his first and foremost response should be an apology or even a mention of a small discount.  to me THAT would be good custoner care not some stupid subtle passive aggressive debate about who was right.  extremely disapointed.  the salad otherwise was good.   would have appreciated some gluten free options besides salads."}
{"text":"Summerlicious 2016 Lunch Review:  Came here today to try their Summerlicious lunch menu ($18). Love the atmosphere, cozy, lots of TVs, definitely a nice place to chill / hang out.  Appetizer - Green Pea Soup - served hot. Very tasty. I really liked it.  Main course - Beef sliders - 3 cute little beef sliders. Pretty average taste. Presentation looked good though, but very average taste. Bun was toasted perfectly. Just A-OK.  Dessert - Mango sorbet - Was a nice big scoop of sorbet which tasted really good, and very filling.  To drink, I ordered a Pina Colada. Tasted good but there was zero alcohol in it and was very disappointed in this.  Food was average, but was worth a try, since I have never been here. I liked the service and the comfortable setting though.   Chef came and asked us how the food was, which was a nice touch. I appreciated that gesture. 1+ star for that.  Review 87 of 100"}
{"text":"One of the most terrible dinners I have ever had. I ordered the French soup, the mac & cheese side dish, and the broccoli side dish.I waited a long time and when the soup and the mac & cheese showed up it was barely tepid it so I think they forgot about it. I sent it back to get warmed up. The mac & cheese had that crusty sort of look on the top as to when it's been sitting for a long time. The server seemed hassled Buy my request and certainly did not apologize or comment at all. Then the broccoli came out and he said \"oh this is just been cooked for you.\" The plate was really hot but the broccoli was cold. Sent that back too.  Eventually the three dishes came back to me. There was some hot spots near the bottom of the soup and Mac and cheese but the top was still cold.  I guess their microwave doesn't work very well and they definitely didn't put it in long enough. By that time I was too hungry to even talk about it so I just stirred it up as best as I could ate it slightly warm. Paid the bill. No apologies from the server, didn't even ask if the second attempt was hot. Zero stars if I could."}
