{"text":"One of the better places at this food court. My usual eatery at this said food court. The food is cheap,  good,  and quick.  At lunch the good court is a mad rush, and this place is especially busy. Nevertheless it is worth waiting inline for. The BBQ duck and chicken are good,  but the hot plate menu is great. I especially recommend the Malaysian style noodles,  the beef  with mushrooms and noodles,  and the spicey porkchops on rice.  Bring your own drink to save some $ as its a food court. I sometimes go for a bubble tea from one of the other vendors."}
{"text":"- decent little run of the mill chinese bbq place in the middle of an industrial area. - it's ok....  but considering where this is located, it's a gawd-sent if you're craving this kind of grub. - food court of this \"mall\" has about 7 different options for chinese eats..."}
{"text":"Let's face it. Dynasty BBQ Restaurant is not in the best mall in the world. But where does this type of food vendor belong? It's located in the middle of a line of other food vendors at Dixie Park's food court. Tip: It gets busy between 11:30am - 1pm. All the workers in the area rush in to buy their food and seating becomes very limited.  I eat at Dynasty often. I'm used to the ducks and pork hanging in the window as I used to visit Toronto Chinatown frequently back in the day. I always order a combo dish: Roast pork and soya chicken on rice while wife has the roast duck and soya chicken on rice. Drinks are on special for 2 for $1.50. Comes with a side serving of veggies and a soup. Around $15.50 for two!  They have a menu of other stir fry and bbq meals but I like to have a little variety. Their noodle stir fry topped with seafood or other meats are just as good and cheap. Great value and really good bbq for a very reasonable price."}
{"text":"Accidentally found this place while I was searching for food... Unless you know the area well, who'd know that there was a decent sized Chinese food court located in this building?  Super cheap eats, and much like most Asian food courts, you get value for money.  Still on my quest for the best Hainanese Chicken I ordered it from here.  It was decent, but like most places they don't serve the Hainanese Chicken rice this dish is famous for and substitutes it with just regular rice.  But overall if  you're in the area and looking for fast cheap Chinese food, this sure beats faux asian."}
{"text":"Yes this place hangs ducks at a small window to the side to let you know that yes they are legit, like Spadina Ave Chinatown legit.    I had ordered two dishes from here.  One was the duck on crispy noodles and the other was salty shrimp on fried rice.  Both dishes came on a sizzling plate but weren't necessarily steaming all over the place when we received them.  Both were dishes taking up most of the size of the tray and damn they were both heavy.    It took two trips for me to carry each since each is a full tray with the hot plate on top of a piece of wood (you know so the plastic tray doesn't melt).  While the shrimp was full with head, crunchy and hot it's what I expected.  The rice that came with it was fine but the star of the duo was the duck on the \"nest\" noodles.  That was good, fatty and yes it was what duck is.  Both dishes together were not even 20 dollars and each was enough to feed 2 people or more.    Good value here for special dishes like these the other places nearby don't have.  I don't know if the place next to it is affiliated but their sign looks almost the same."}
{"text":"Tasty Chinese BBQ - reasonable prices. We have also ordered large trays of Singapore noodles for parties. Love the garlic ginger sauce.  BBQ pork, soya chicken, roasted pork, duck. Friendly owners."}
{"text":"so my dentist is near here so I end up buying a cheap meal almost every time I come.  It's about $5.50 for many items.  We ordered the yang chow fried rice and the singapore noodles.    The noodles were spicier than I expected and needed a bit more salt or soy as it was just spicy and lacking but I've cooked the dish so I knew how to make it taste better.  Everything is the the styrofoam containers so the portion is huge for the price.  It  was $12 for the 2 dishes.  that's pretty good considering I pay $8 near U of T for good nosh..now nosh I don't have to 'fix' up.   The yang chow had the same problem to me...just lacking a bit of something..not that i needed msg in the dish but it needed salt or msg...to make it just taste right too.  I've never had a yang chow with corn in it though LOL...some frozen veggies I got diced carrots, green beans and corn in my mine, that I could do without.  I think next time I'll try one of the other vendors.   This is the only one that has bbq  window though so if you're looking for duck or pork, then you can get it here and at these prices, it's not too shabby.  Quick like the fast food drive through."}
{"text":"I thought that the food stalls might be closed on Saturdays but of course not the stores are open for business all week.  A popular place for workers during the week but I was nearby and was hungry.  I had their BBQ pork dish and it was moist and juicy with a ice crispy skin.  Simply chopped with a sharp cleaver and served over rice and bok choy.  I filled the little paper cups with hot garlic sauce and siracha to dip the pork in.  They offer a ton of dishes and look at the photos and wait 5 minutes for your order.  The staff was busy filling up catering trays with food so it looks like Saturday they tend to a bunch of parties."}
{"text":"Located in the Dixie Park Mall. This place isn't bad, but I feel like quality of the food has gone a little downhill since they switched owners. There are quite a few other places lined up here besides BBQ Dynasty, all trying to get your business. We used to go here quite a bit to get some take out for dinner when my Mom didn't feel like cooking. My siblings and I used to love getting noodles from here because it's cheap and tasty. Since I've moved, it's rare to come here but on my day off and being in the area, thought I'd stop by.   Mall was so dead. I guess for Easter Monday? Expected a bit more people because usually this place is packed with people after work.   Ordered fried Shanghai noodles and fried tofu. Not amazing but it's pretty tasty if you have a craving for some cheap Chinese fried noodles or chow mein. I like when you eat it for here, it comes on a hot plate. Other than that, if you're looking for something fancy, go elsewhere. This is food court style Chinese food!   The owners here are also really nice despite mediocre food."}
{"text":"I came here for lunch on a Saturday afternoon. It was a late lunch for me. I had to drop by my workplace to pick up an item that I had forgotten to take with me on Friday.  I crave comfort food these days. It's yeung chow fried rice at Chinese establishments. It gives me a way to compare all eateries at the food court.  You get huge shrimp in the fried rice. I do like the fried egg, carrots, peas, and green beans in it, too. I love green beans, which you don't normally see in this fried rice at a food court.  It was tasty. You get a huge portion. I also got a can of Diet Coke to wash everything down. If you buy two cans, you pay $2.50. I only needed one, but I remember this detail for some reason.  This eatery gets busy. I got number 25 as my pickup order, which happened to be the same number on the menu. I would say that seven minutes later, my food was ready.  I will come back here for the fried rice. I will try to sample other menu items, but this one was yummy that I may stick with it for a bit.  The folks here speak Cantonese and English. You can also order a party tray of food if you are hosting a bash.  (56)"}
{"text":"Ok typical Chinese BBQ food located in a food court at Dixie Park. Usually very busy during the lunch rush as the nearby office workers have discovered the food court and it's very cheap prices.  I would have taken a photo of my food but I was hungry this time and forgot and started on it already..."}
{"text":"Situated in a down-market Asian mall, this is the best offering this food court has, and one of the only good Chinese BBQ spots I've found outside of Toronto's 3 Chinatowns.   Have tried loads if variations of the usual \"and rice\" combos involving one or more of BBQ pork, roast pork, soya chicken or BBQ duck. The portions are more generous on the meat when you eat in, but the take out isn't bad too.    They make noodle and other Chinese dishes too but here I stick with the reliable BBQ dishes. One of my favorites is the BBQ duck which I normally get with chicken. Great crispy skin, loads of flavour, and generous pile of steamed rice.  The place doesn't look like much but the food comes out hot and tasty."}
