{"text":"Asia Plaza is home to our favorite dim sum spot (Li Wah) and our favorite Asian supermarket (Park to Shop), so we were very excited to see the that there was going to be a new restaurant opening in the facility, and we eagerly anticipated the opening of the E 30th Street Cafe.

In Cleveland, Asian restaurants that cater to the palates of Asian clientele are few, and given the location, we were hopeful this would be a place to add to our repertoire of Asian dining options

The interior was pleasant enough - it was clean and modern, but that's about where the positive aspect of the dining experience ended.  Things began to head south when our waiter, a youngish Asian man, approached simply reeking of cigarettes and with an oral hygiene issue that would cause fainting spells in most dental professionals.  I should note here that I was dining with my partner who is also Asian, and has more tolerance than I do for the niceties that one is accustomed to in most Western restaurants, and even he was rather disturbed by this waiter.

Because his English was very challenged, my partner ordered for us in Mandarin.  It was a cold winter day out, so we both decided to go for soup.  I ordered the Hong Kong Style Beef Tendon Soup and he got the Taiwanese Beef Noodle Soup.  We also ordered some scallion pancakes, which are a great accompaniment to soups.

There were only about 3 other tables that were occupied, and it was pretty much exclusively by Caucasians.  Given the light crowd, the wait for food wasn't bad - about 10 minutes, and we entertained ourselves with the cheesy Chinese soap operas that were playing on the big screen TV.

My soup came out first, accompanied by the order of scallion pancakes.  Immediately I noted a \"off\" smell coming from my soup.  It looked fine, if plain, but it didn't smell right to me.  Shortly thereafter the waiter brought out my partner's soup, and it pretty much smelled the same as mine.  For those who are unfamiliar with Chinese style soups, ours should have been very different, and yet is was as though they threw a few different contents into the same soup broth and called them by separate names.  The broth was bland, virtually transparent and just didn't taste right,  We both tried adding soy sauce, vinegar and other condiments to liven it up, but nothing really served to improve the flavor, or lack thereof, of our respective soups.

Fortunately, the scallion cakes were there to cleanse our palates and they tasted just fine, but I did find them to be disappointingly small.

Neither of us finished our soups; it just wasn't worth it. The only saving grace, if you can call it one, is that the prices were pretty low.  The soup was $6.95 each, if I recall correctly, so it was no great financial loss.

I think the E 3th Street Cafe may suffer from an all-too-common Asian restaurant syndrome of trying to be everything to everyone.  The menu included sushi, dim sum, and an array of foods from different Asian countries.  They also had the sickly sweet and goopy Chinese-American foods that no Asian born person would recognize as being part of their culinary heritage.

You may have noted that the breadth of our food selection was rather limited, but based on what we saw other people order and what we tasted, we both felt confident that additional visits wouldn't change our minds about it.  I don't want to see them fail, and I hope for their sake they learn to focus on the things they do well (not sure what that might be), and drop the ancillary stuff.  Hopefully, someday soon, an Asian friend will come to us and say, \"I found the greatest place for ...\" and then we might give E 30th Street Cafe another chance ... but not without much skepticism."}
{"text":"This is a great place for reasonably priced Dim Sum. I suggest getting the stuffed eggplant (it's to die for), sesame balls and sticky rice. The absolute best is their mango pudding.

Yeah, the waiters aren't supermodels and the food is not super gourmet, but it's delicious and simple, and I do enjoy the Chinese soap operas on their big screen TVs.

I have a complete review posted on my blog (http://whatsincleveland.blogspot.com) with pictures of the interior and of one of their dishes."}
{"text":"A delicious Chinese restaurant that is somewhat puzzling, since it is owned by the same people who run the Li Wah restaurant in the same building... and has overlapping menus, and sometimes, it even seems like the food comes from the same kitchen!
The food can be authentic or it can be disgusting, very hit or miss. Some of the items did not taste fresh. Maybe this is the place where frozen leftovers from Li Wah get reheated and served? The sweet and sour tofu was obviously very Americanized-style, excessively sweet and glazed in layers of thick sauce, worse than even some take-out places. But the mildly sweet tofu pudding was nice. 
The interior of this place is nice, although somewhat incongruous with the large screen TVs in one corner having ESPN on and the other corner with a Taiwanese soap drama.
Overall, this place is not bad, but has potential in improving the quality of the food."}
{"text":"This is my go \"ghetto Asian\" food spot.  The menus effort to tackle the entire Pacific Rim from China to Japan and Thailand is kind of a mistake and if you avoid those dishes which I have found to be subpar there is some great food to be had.  I love the dim sum lunch specials which are 25% less than dinner of the weekends.  Service is nice but distracted."}
{"text":"Everything was very delicious. The dim sum wad quite good. Also try the roasted duck."}
{"text":"On the back side of of Asia Plaza, just off of Payne Avenue, is a little restaurant next to the Park to Shop Asian Grocery, I've always wanted to stop in...

I'm glad I did.

The East 30th Street Cafe is a small, inconspicuous Chinese/Szechuan restaurant with a diverse menu and a very pleasant atmosphere. The staff was very kind, and the food was really great! I had their General Tso's chicken lunch special, and for under 10 dollars, I got a really generous portion, a cup of soup, and an eggroll and drink. I was impressed. The restaurant is bright, cozy, and a great place to stop for a quick bite or an intimate dinner. They also have dim sum, sushi, and various other treats. The only problem I had was parking, which, when the plaza is busy, is at a premium. However, it's worth the hunt for a parking spot. 

Check out the E.30th Street Cafe and discover a little gem hidden in the heart of the city, and afterwards, visit Asia Plaza for all sorts of great surprises."}
{"text":"Okay so I have to admit I was pretty terrified walking into this place- the two reviews before me didn't sound great at all. But, the reviews were years ago and there were only two so I wanted to give this place the benefit of the doubt. Boyfriend and I come here at 3 PM and expectedly, it was empty. Great, maybe I'll get some better service. We order the mapo tofu, black bean spare ribs with rice, and crab rangoon. The waiter that served us was higher than a kite and forgot our crab rangoons completely. We get our black been spare ribs (served on a bed of rice in a casserole dish)- the dish was like 85% rice! Whattttt. I didn't pay $10 for rice :( the amount of spare ribs is maybe 2 portions of the $3 spare ribs at Li Wah. The mapo tofu wasn't spicy at all. For those of you who don't know, in Chinese, the \"ma\" in \"mapo\" means numb, meaning the dish is so spicy, it numbs you. This dish wasn't even mildly spicy, and you could tell the peas and carrots they used were previously frozen. Service was poor even though there were only three tables to be served. Waiters stuck to themselves and didn't notice when we waved them until another couple pointed us out for them. Will not be back here again."}
{"text":"The rating I gave this place is for the \"cafe\" style Chinese food I get. Hence the name, East 30th Cafe. This place has the best Vietnamese Pork Chop with rice dishes ever. You get two large pork chops, an egg on some rice, and pickled veggies. I usually get this when I come, or one of the casserole dishes. It's reasonably priced too. 

If you want good authentic Chinese food, just take a quick walk inside to Li Wah (the owners are the same, so they won't be offended if you choose to go there). The dim sum there is decent too considering Cleveland dim sum sucks. 

Those of you who are reviewing this place for it's pizza, sushi, korean food, or any non-Chinese/non-Chinese cafe food, please go away. Why would you ever go to a Chinese restaurant and not order Chinese? You go to a Japanese restaurant for good sushi and a Korean restaurant for good bibimbap. It's common sense people."}
{"text":"I'm pleasantly surprised by how great this place is! I took my family here on a weekday night and there was literally no other customers in the restaurant. Uh oh. This may be a bad sign, but we took a chance and sat down anyways. The service was quick and friendly and we got our food within 5 minutes of ordering!! To start off, the restaurant gave us free Chinese herbal soup, which was so delicious that it brought me back to my childhood in China. We ordered two dim sum dishes, the black bean spare ribs and the chicken hands. These are two of my favorite dim sum dishes and this place did a great job making them! The only complaint I have is that each tiny dish was $4. Too expensive for dim sum, man. But still, if you're craving dim sum though, this place serves it day and night! We also ordered the Peking duck. Yum! The duck skin was super crunchy and the sauce was a combination of sweet and savory. We ended our meal with the spicy braised fish. Sadly, this dish was neither flavorful nor spicy. We ended up just taking this dish to go and added our own spice and flavors to it at home. You're better off getting this dish at Wonton or Szechuan Gourmet. 
Aside from a few complaints, I liked this restaurant and will be coming back again!"}
{"text":"I took my mom out for her belated birthday dinner here only because she wanted to use the gift certificate she got from an event she attended. This place is fairly new in the Asia Plaza. It's near the store called Park to Shop in Chinatown. Plenty of parking spaces out and plenty of tables inside. The decor is very modern with traditional Chinese paintings. They even have karaoke. 

We ordered their sweet n sour pork ribs, mixed vegetables, and their  japanese tofu with xo sauce. The ribs comparably were different than other places I've been to. I didn't care much for them and the other two dishes were extremely salty with lots of MSG. The prices were overpriced and food selection is not that authentic. They also had an American menu with sandwiches you can order,  pizza, and so forth. A good plus is their sushi. I don't know if I want to come back because the sushi prices were a bit pricey. We had waters and the lemon wedges were not even an inch.  No lemon slices to squeeze. 

For a new place in town, they could also fix the spelling on their menus. That's kind of annoying. If you can't tell, I'm a grammar freak. After our meal, we had red bean dessert but it was so watery that I barely touched it. It gets 3 stars cuz it's just ok food, not the best or authentic."}
{"text":"Wish I could give negative stars. Yes, it was that bad. Hope we don't get food poisoning."}
{"text":"Took the family there over the weekend for some dim sum. Not bad for Cleveland.

It looked like a typical Chinese restaurant in decor, which involved some fong shui, some western style booths, and lots of old fashion but cheesy Chinese wall hangings. But we were not there for the ambiance. And for that matter, we were not there for the service, which was more than adequate, we were there for the food. 

There were about 50 choices for dim sum including dessert. We tried about 10 different things and all tasted great. We liked the roast duck and the spare ribs. The portions are typical dim sum size and prices are averaging $4 per item. 

Watch out for the neighborhood, which appeared that it would not be too friendly at night."}
{"text":"I wouldn't call this szechuan food at all - I think that's miss-labeled.  Food is just ok, though the menu seems to have an identity crisis as others have mentioned.  There's food from all parts of the world, where we only had food off of the chinese menu.  The steamed fish was AMAZING, but was off the chart expensive :).  The rest of hte food was just ok.  i was quite disappointed in their stir fry vegetables (just the leafy green, chinese ones), which had absolutely no flavor and seemed to be cooked in too much water...I didn't think Chinese restaurants ever messed those up.  Decor and service is very solid for a Chinese place - very new and comfortable."}
{"text":"The restaurant is located in the same plaza as the Park To Shop market and Li Wah. I've been here twice, and to be honest the food is average. It's not my favorite place to eat in CLE, but it's decent enough. I've only tried the Chinese/Thai food here, it seems as though they have a mixed array of options on the menu (a bit scattered and all over the place in my opinion). I would recommend the Thai fried whole fish (see my pic) if you go there. The sweet and sour ribs are good, and also the Jade tofu (I think these were special request items, I don't remember seeing them on the menu..but it was a while back so I may be wrong). The rest of the food was not very memorable."}
{"text":"This newly minted Chinese (Asian is more like it) restaurant is clean and  classy. Since it opened recently in December of 2010, I've been trying to get myself in there and try some of their offerings. So here's what I did notice, the restaurant, part of the Li Wah family of restaurant. Which is just a earshot from East 30th. Most of us knows that Li Wah serves decent dim sum and many have written well of that business. Why they decide to open another eatery in the same plaza is beyond me.
East 30th, seem to encompass a little too much asian in a small menu. Appetizer section starts the confusion.The offering starts from Spring Roll to Summer Roll. If you are of the discerning crowd when it comes to Asian cuisine. You notice that they are of really different genre of asian food. They try to incorporate Far Eastern cuisine (Chinese and Japanese) with shots of vietnamese and cambodian food in the mix.
On the menu, are items from shrimp dumpling noodle soup, sushi and sashimi to beef pho. The dishes (from the \"Chief's Specialty section) I had was decent. It was the fish filet and vegetables with rice. It's taste good but it was not something I write home about, just yelp about ;-)
 Ultimately, East 30th, is trying to be the jack of all asian cuisine but really it's the master of none (yet). So let's hope they hone in on something and make it so good you'll drive for miles just to get your fingers on it. Good luck, East 30th."}
{"text":"This place has all the traditional late nite fairs. When you want some home cooking (cafe style) you won't go wrong here."}
{"text":"This restaurant is in the rear section of Asia Plaza (Payne Ave.) and is one of my favorites.

They serve a large variety of Asian food but I have my favorites. Their prices are very reasonable and the food I like is very tasty!

My go-to dish is their Vietnamese Pork Chops over rice. The price for this huge meal is merely $8. You get two pork chops, a fried egg, some pickled vegetables, cucumbers, rice and sauce for the chops on the side. 

They also serve dim sum at all times of day, made to order. 

If you have a family that likes different Asian foods, this is the place to come because they serve Thai, Japanese, Chinese and even some American food (for the kids)."}
{"text":"We went here when Li Wah was very busy and there was a 20 minute wait. We decided to try this out since we were super hungry and didnt wanna wait but it was kind of a mistake. If you want dimsum walk past this one and go to Li Wah. Their dim sum wasn't very good and you have to wait awhile for them to cook it. The dim sum wasnt fresh, you can tell when you bite into it and a bunch of water comes out from the the freezer burn gushes out. The good things were the red beef bbq. It was pretty good. The chicken feet was very bland and didnt taste fresh."}
{"text":"This place really isn't all that bad.

It's a newish restaurant located in the same building as Li Wah and Park to Shop.   In fact, it's owned by the same person as Li Wah.  The restaurant is pretty clean and has a fairly decent flow of customers on weekdays.   I've gone here twice.  

The first time I went, we ordered a bunch of dim sum; the second time, we ordered more traditional Chinese dishes.  Both times, my friends and I were relatively satisfied with the food.  I would say it's pretty comparable to Li Wah - not the best in the world, but fine for Cleveland.  Unlike one of the other reviewers, I did not think the soup had an \"off\" smell.  They also supposedly have sushi, some other cuisines and Americanized Chinese food, but the feel of the restaurant seemed Chinese to me, so I was hesitant to try any of it.

The service was a bit sparse and they forgot to bring out one of the dishes that we ordered, which was kind of discouraging.  But I think I might still come here on occasion, just to mix things up a bit.  Wonton Gourmet gets tiring after awhile."}
{"text":"mediocrity
pizza, sushi, chinese food
none of it done well

In a word, \"avoid\".  Ordered delivery of 2 eggrolls, a \"deluxe\" sushi platter, Tom Yum soup, and a sechuan chicken entree.  
Eggrolls were nothing special, way too much anise and 5 spice.  Tom Yum was positively wretched. The sushi was not for me, but good for cats.  And they do not even use sushi rice for the rolls.  Blech.  Sechuan chicken was a bland gloppy mess.  I'm not going back.  

Carry on."}
{"text":"This establishment is in one of my favorite areas of Cleveland.  Nearby to so many other fantastic restaurants, this place is decidedly average, and I'm okay with that.

On a Sunday morning I woke up with an Asian food itch that I just had to scratch.  Looking around online at all of the options available, I ran across the E.30th Street Cafe and thought it's generic grab-bag of eastern dishes would suit.  The wife and I got on the shoreway for a quick trip from Lakewood, and we arrived in the parking lot in under 20 minutes.

We ordered sushi.  Yeah... I know...  ordering sushi at such a place is frequently a recipe for disaster, but this was actually decent.  The knife cuts were a bit sloppy on the sashimi, but the rolls were well executed.  Don't get me wrong, it's no Shuhei, but it actually managed to beat out the garbage at Sushi Rock by a fair margin.

Interestingly enough while we were eating, a pair of gentlemen came in with a bag of vegetables, and the bag was carried off to the kitchen.  I don't know what was in the bag exactly, but what came back out of the kitchen did smell rather good.

This place is one of those places that's trying to be everything to everyone, and ends up being pretty average.  The prices of some things are out of whack, but then other things are comparatively cheap.  Give it a shot.  At the very least when you're done eating you can stop in to the Park to Shop to stock up your pantry."}
{"text":"We came here after finding out all the other Chinese restaurants were closed. So glad that we came upon this place! We ordered the shrimp rice roll, curry vegetables, fish filet with broccoli and pork patty with salted fish rice casserole. Everything was surprisingly delicious. After reading the reviews, we were a little hesitant to go in and glad we did! Service was very friendly. Will definitely return when in the area!"}
