{"text":"Great for groups. We got the largest bowl of hot and sour soup ever and it was pretty good. Meats and veggies were cooked nicely and even the fried rice was better than any take out I've had. You can taste the wok, in a good way."}
{"text":"E Pan is one of my favorite Chinese restaurants on the Spadina strip.  Fresh ingredients, knowledgeable servers who are not afraid to recommend new items to try and an extensive menu of items cooked with attentive care.  This is an above-average spot amongst a street filled with mediocre options.  Very recommended."}
{"text":"I can't comment on the food this time...we were waiting for our meal but ended up watching in horror as the restaurant host chatted on the phone while PICKING HIS NOSE!   He looked a little dumbfounded when we asked him to wash his hands (since he would be serving our meal) but decided that it was smarter to leave!!"}
{"text":"I had dinner with a group of 10 at E Pan last night. This restaurant is a steep step up from most others in its vicinity - very clean, friendly staff, tasteful decor. It's a regular favourite dining spot for most of the people I was with but this was my first visit.  We walked in, 10 of us, on a Saturday evening, with no reservation and we were seated immediately with no fuss. Menus, tea and water were brought out swiftly. Throughout the meal, tea and water was replenished frequently without us having to ask - great service.  Since we each picked one dish, I don't remember the names of everything we had but I'd say 7/10 were excellent and the other 3 were quite good. The meat was tender, veggies seemed fresh. The dishes that stood out as being my favourites are the breaded grouper (I think?), the deep-fried squid, the terrific spicy beef hot pot, the sauteed greens (I forget which, specifically) and the stir-fried tofu. We also had these giant oysters - one each. I'm not a huge oyster fan but my companions seemed to think these were great.  The one very minor negative thing I could say is that of the 10 main dishes we ordered, the last two arriving at the same time were very similar beef dishes. It would have been better to have these two come out at different times to spread the beef through the meal, but maybe since the dishes were similar, they took the same amount of time to cook? This is only a small complaint.  Final price for 10 people to stuff themselves silly (soup, 10 main dishes, a giant oyster each plus complimentary dessert) was $167 including tax.  I definitely want to go back - it's good enough that I'd even bring my Chinatown-hating parents! Who will join me for the $34 Peking duck set?"}
{"text":"Sat down, famished, at 1:30pm. There were two other tables filled in the restaurant. We were ignored for a good 20 minutes, then brought a dim sum menu. Ignored a little more. Other family enters, other family gets serviced quite quickly. Finally our order gets taken, but then there comes more of a wait. Seriously, the only reason we came here was because Rol San was packed, and now we know why.   Can't say much for the food because we left after getting tired of being ignored (2:30), but the table next to us didn't seem to have major complaints. They did, however, tell the elusive waiter that he had forgotten two of their dishes. He was surprised."}
{"text":"It's a great place to enjoy a meal with friends and families! Dishes are tasty though a little too much for girls. One thing not that perfect is the delivery is quite slow. In a positive way, you have more time talking with your bros face to face while you wait for the food. Anyway it worths a shot!"}
{"text":"Love this place.  They're very accommodating of large groups and whenever I'm in town I go here with a big group of friends (and pre-order a peking duck).   Don't expect them to re-invent the wheel. At these prices, I'm psyched that the food is delicious and true and the service is lovely.  Our favorite waiter always takes good care of us."}
{"text":"Family day. Cute! Chinese Girl and I have no close by family. Her's, a bit farther.Or is that further? Our plan was to hit the Eaton Centre and clothes shop. Well, she'd clothes shop and I'd hold stuff. It's a role I understand. We found our way to Spadina. We were going to get Bahn Mi but the Cute! Chinese Girl was a little frustrated the Vietnamese workers couldn't explain their food in Mandarin. We made our way north to some Szechuan restaurant.   \"What's that smell?\" wondered Cute! Chinese girl.  \"I think it's burning incense.\"  \"It smells like public washrooms in Beijing. Can we go some place else?\"  \"Sure.\"  We went across the way to E-Pan. They had a lunch special. $8 constitutes a lunch special in the city. Fair enough. Portions were quite nice. The corn and chicken soup was good. You only get two dumplings but whatever. I had the crispy beef with sesame and it was exceptionally good. Move over lemon chicken. General Tso,  turn in your silver stars. Crispy beef is my new culinary overlord.  Service was good. Decor is clean and modern. Lunch for two was $20 even with tax 'n' tip."}
{"text":"I have been here a couple times for lunch and once for dinner, both in large groups. The staff are very accommodating and don't give me sass just because I speak Cantonese with a terrible accent. When I came for dinner, we ordered the dinner for 10 (I think it was less than $200 for a zillion courses, we had tons of leftovers) and they let us do a bunch of modifications for the vegetarian people. I have even been here with a vegan person, and again, they made sure there was something delicious for him to eat.   The $8 lunch special is a good deal. You get a choice of soup (hot & sour or chicken corn soup), dim sum/appetizer (shrimp, pork or veggie dumplings; spring rolls and a few other choices), and an entree. I've had the tofu with enoki mushrooms and eggplant which is decent, although the sauce is a bit salty. The time I came for dinner, we had Pecking Duck (2 styles -- in the 'tortilla' wraps and then chopped up and put in lettuce leaves... I call it Chinese tacos). It was really good! The fried rice and chow mein are great too.   All in all, a convenient and low-key option for big parties!"}
{"text":"My review is about their delivery service, and the overall customer service or lack thereof.   I made a small order and I was told that because the restaurant was busy it would take 5-10 minutes more than the regular 45 delivery time.  After waiting 90 minutes I gave up and cancelled the order. 10 minutes after cancelling I get a call from the restaurant asking if I want to wait just 30 more minutes to get the food. Seriously?!?!  I'm not sure if I was more offended by the wait time, the ridiculous call to ask me to wait more, or the fact that they didn't apologize at all when they called."}
{"text":"Oh goodness, where to start? My great uncle took my family there our first night in Toronto. The first course was soup, which was really good- went back for second. The second was... Beijing Kao Ya! Or, known to westerners as Peking Duck. They even brought it out and cut it in front of us. It looks so juicy and definitely did not disappoint, both with the crepes+skin+onion+hoisin sauce, and the accompanying sauteed duck with lettuce wrap. I don't remember much of the other dishes, other that they were good. There was another one- mushroom and bokchoy- soooo good! I kept going back and back and was really sad that it was gone. Overall, very splendid. You should go with a larger group in order to, well, order more dishes."}
{"text":"Man this place is horrible. The exterior looks modern for a Chinatown restaurant anyway but the inside is your typical Chinatown restaurant. The service here is quite slow as well. I've never had to wait this long for food to come out in Chinatown. We ordered the dinner for 2 which came with soup and dessert. The soup was very barebones compared to other places and the dessert watery gunk. We ordered some chinese vegetables and it was alright but crazy oily. We also got the fish because for a dinner for 2 combo, it was pretty cheap. Bad idea. It tasted so old. All in all, this was one of the worst chinese restaurants in the area that I've tried."}
