{"text":"Sunset at the tiki bar is as good as it gets besides the Union!"}
{"text":"I wanted to love this venue as it was close to where I grew up and my parents used to attend their fish fry often. The entire building is very outdated, not in a charming way. During the approximately 10 months after booking and before our wedding day we worked with 4 different event managers due to turnover. Most of our plans had not been saved other than a few emails we had so we needed to rehash the plan with each new manager. The owner/board member was rude and unprofessional. He stated that he does not give money back because all of the brides just want discounts for everything. The small freebies he offered as a consolation for poor service/experience ended up being charged on our final invoice (eventually corrected). The slightly lower room rental rate quickly rises since they charge a fee for any of their existing decor as well as the bridal \"suite\" which is a storage room with a bathroom, table, and couch on the bottom floor only. I would highly suggest paying for a more expensive facility that includes a reliable event manager and offers existing onsite decor at no charge. The final event manager we worked with was pretty good but did not make up for all of the rest. I would not recommend this venue for any event, especially a wedding."}
{"text":"I like the Tiki bar in the back and their food is ok. Mostly like them for their location and view of downtown."}
{"text":"Perhaps 50 years ago institutional food was served with white tablecloths and cloth napkins; so if you are seeking a great place to entertain grandma, head on over to the East Side Club for the \"famous\"  Crandalls fish fry.  Two plates of cod, fries and the  iceberg garden salads complete with one half wedge of tomato and two rings of onion, 2 beers and tip $50."}
{"text":"I'm not even sure where to begin. We arrived around 6:30 and were told there would be a 40 minute wait. That quickly turned into an hour and a half. At that point a worker that was not on the clock started clearing tables because he couldn't stand how long they had been sitting there dirty. There were also a bunch of open tables with nobody seated and a list of people that needed to be seated. One of the bartenders seemed super nervous. I asked for the beer list, or what they had in bottles, and she became very unsure of what to do. We eventually grabbed a table on our own and then sat there for a good half hour before service came. She took our order and then the waiting continued. After a while she brought us an order of curds for free because of the long wait. She eventually came back to let us know she forgot to put our order in. Five minutes later we left with our order to go. They comped it, but it was a solid 3 hours of pure chaos. The staff was really chaotic and unorganized. Nobody knew what to do or what other people were doing. The owner was in the kitchen and on the floor serving when she should have been managing and keeping people on task. We love this place in the summer. When everything is outside in they backyard, but this was our first and last fish experience. The service was awful, the staff was unsure of what to do, and the food orders were underwhelming. Do not order the catfish. We got three pieces, but I think they were half pieces that fell apart. There was literally almost no fish. We got the wrong sides. The chips were uber oily, and they filed the plastic to go cups about an eighth full of tartar sauce so we ran out immediately. Like I said I love the backyard in the summer, but I'd skip the fish. At least until they get their shit together."}
{"text":"Love going to fish fry, tiki bar and sunset series. They have really improved over the years, and it is a great experience."}
{"text":"The East Side Club reminds me of a cross between a VFW hall and the bars my parents took us to* as kids in northern Wisconsin in the 80s and 90s. 

I've only hung out in the basement bar and the beautiful outdoor lakeside lawn. I'm not sure if the banquet hall has been updated, but these areas look the same as when they were built decades ago. 

I've been to the bar for a cancer fundraiser and a chili cook-off. The chili cook-off was disorganized if you were a newcomer - most people seemed to be regulars and knew the drill, but as newbies we had a heck of time getting any info. The people cooking chili were serving some people, so we tried to buy samples. The only info we got was \"you have to buy tickets and they'll send you through.\" So we went to the ticket table and just got stared at while we tried to buy a dollar's worth of tickets (samples were 25 cents). We were then wordlessly handed them after asking again. We went back to try to get a sample. \"Not ready.\" Oooookay. We finally talked to a friend who explained samples didn't start until 1 and everyone had to line up and the people being served were probably just friends of the entrants. Not sure why the three people involved in the cook-off that we spoke to couldn't have shared this info, but alas. 

The bar itself has Bud and Bud Light on tap, and a rotating mix of cans (Spotted Cow was $3). There's also a small selection of liquor (vodka and raspberry Pucker seemed to be popular) and a couple of wines. 

I've had better luck on the lawn in the summer with their Sunset Music Series (if that's still happening, it's been a couple of years since I've gone). The setting on Lake Monona is gorgeous, their \"tiki bar\" offered some super cheap bottles (I think cider was $2 my last visit), and the inclusion of food carts made for a tasty and inexpensive dinner. BYO chair and enjoy the sunset. 

The ESC does have a bocce league that intrigues me every year (but that I often don't remember until it's too late to sign up). There's a mix of member-only events and ones open to the public. It's also available for event rentals. While the building might lack the wow factor, the view more than makes up for it. 

*Didn't grow up in Wisconsin? It's totally legal and totally normal to take your kids to bars during the day or for dinner, especially in small towns where the bar might be the only place serving food at night."}
{"text":"Just got married here,  the management and staff were so helpful and easy to work with! And the location can't be beat! Beautiful views and, access to the lawn.  Thanks so much for being a part of our special night!"}
{"text":"the tiki bar is fun! (open in the summer every night from 4p-10p with the exclusion of possible friday and saturday night weddings that rent it out privately)

but the fish fry on friday nights is definitely worth skipping. cold, bland food for too much money. full of elderly people, which usually means it's just bland and cheap, but it was $24 for my husband and i to have the buffet (which is the only option on fridays, don't know about other days). i love fish frys and this one was highly disappointing.

BUT i'm still giving this place 4 stars because the back yard and tiki bar are pretty stellar and they have a sunday brunch that i'd still like to try out. i wouldn't go there for dinner again though, but if you want to drink a beer and sit by the lake (assuming that you don't already live on a lake), this is the place to go! friendly staff and gorgeous views of the capitol, especially at night."}
{"text":"\"We'll never go there again\". Literally these are the words we just exchanged after getting home.  Maybe if something about it was good.. The service? No. Terrible. We got our salad, waited 15 minutes, got our wine and then 39 second later, our fish. Maybe if the salad was good? No, the \"wedge\" was lettuce, carrots and bacon. The fish fry? Tasteless and Luke warm. The only good thing about this place was the nice older bartender who served our bottle of wine in a beer pitcher :)"}
{"text":"Pssst. Tiki Bar nights. Limited selection but darned fun with one of the best views in Madison. If you don't believe it then all the more for me!"}
{"text":"Tickets were $40 for all you can eat and certain drinks.  A lot of restaurants here with awesome bites of food.  I only made it through 1 of 3 levels before I got  full.  2 more hours to go so I can work up another appetite...lol.  It was a but idyl day and awesome event.  I will certainly attend next year.  The event was from 3-6 p.m.  We got there a little after 3 and the parking lot was full.  Had to park across the street down in the neighborhood."}
{"text":"We just hosted our daughter's wedding at the East Side Club and they did an excellent job.

Everything was set up as we asked. We had reserved the upper part of the building and the views were absolutely amazing. The ceremony was on the lawn, lakeside and it suited our needs well. They even cleaned the goose poop off the dock so that the wedding party could take pictures.

The manager Jen was easy to get a hold of to answer questions and was very helpful with all of the details.

Our bartenders Jon and Angie were amazing. Any question or concern that I had they were ready to assist in any way that they could.

Thank you for making our daughter and son-in-law's day a success."}
{"text":"This review is pretty much just for the outdoor area of the East Side Club. The lawn in back, the Tiki Bar, etc. 

What a fun place! Right on the lake - typically a bit cooler and breezier than other parts of town during the very hot months. I played in a Kubb League here for a couple summers and it was always a great setting and very accommodating for all of us. 

The service, be it at the inside bar or the Tiki, is always friendly and usually pretty quick. The huge lawn offers plenty of space to spread out. There are lots of tables and chairs as well so you can usually always find a comfy spot to sit. 

I definitely recommend checking this place out. It's great to sit and relax and watch the sun go down on the lake."}
