{"text":"The only time I've ever walked out on a meal - I chose a few items that were the least frightening, and tried to eat it, but just couldn't do it. Stuff was cold, crunchy, chewy and had a very off taste to it.  I can't understand why anyone would accept this, it was completely unacceptable. I can't even begin to describe what this was, it was nothing like food that's for sure. They should be ashamed of themselves, so unethical to serve this to people. Robbery."}
{"text":"I am normally a huge fan of chinese food; sticking to the more Western items on the menu, so when I heard that we were going there for a group meal with my co-workers I was pretty excited!  Unfortunately,  my excitement ended quickly when we were ushered into the private room, which felt cramped with over 20 people in there. The room felt hot when we arrived, then cooled down and felt a bit chilly later on. There seemed to be no middle ground!  The food caught me completely by surprise. I picked up 4 chicken balls, deep fried shrimp, and noodles. The chicken balls were dry and I mean dry as in I needed a glass of water to get them down. The shrimp tasted okay and the noodles were also dry and not fresh.  For dessert I grabbed some ice cream. It would have been nice to label the flavours. You get a choice of 16 flavours.  Overall, the restaurant was very busy as we came in at noon. The price was $12.90 for the buffet which is reasonable.  Just wish it was a little beefier in the quality department."}
{"text":"I don't know why we returned here as we've had previous poor experiences already.  Went for the AYCE buffet cos we got excited looking through. Decent variety and reasonable price. Too bad everything was COLD! So much promise, but a total miss. The only things hot were the dimsum items that were part of the AYCE, and those were below average.  If you must come here, stick to the dimsum menu where your food will at least arrive hot and fresh (hopefully anyway)."}
{"text":"I brought my wife here and we love Chinese food, but we didn't even like the food here. Food was either too salty or just bland, crab legs=salty, bean sprouts =bland, fried rice =bland, the dim sum tasted like cooked spam, and the sushi was only cold when it first came out, and the service was no good at all.  We won't go back, for $22 each the food should be great and the service should be great, but it was not. And the place was not clean and the plates were not clean either. we regreted our decision to eat there, my wife went to bed 8 hours after eating and was still complaining of a sore stomach.there are far better Chinese restaurants in Calgary."}
{"text":"This restaurant never fails to impress. We've been coming here for almost three years for the buffet, dimsum, a-la-carte and have yet to come to a disappointing experience. The buffet is always fresh, hot and tasty and is a very reasonable price for such quality food. I especially enjoy the steak, crab legs and sashimi on weekends. My family comes here for family gatherings every weekend and it's always packed. No surprise for such great food. Always worth the money."}
{"text":"we all know how a cheap Chinese buffet restaurant taste like... Therefore, I didn't expected much and I was willing to lower my standard. However, This restaurant was a downer. Service was not bad, price was cheap, restaurant itself was maintained clean, but the food was BAD. I could not see any kind of authenticity or effort. Normally there's 20+ kinds of foods in a buffet so I can stick around 3~4 favorite food after first glance. However, I couldn't even find one good food in the restaurant so I ended up with eating white steamed rice along with Sriracha sauce. Thank god they had Sriracha sauce."}
{"text":"Rediculous,  23pp for a tasteless buffet.  Chinese is hardly represented here.  The buffet is hodge podge,  a huge dissapointment."}
{"text":"We stopped coming here a few years ago because the quality had got so poor. They are under new ownership and the food is good again. Give them a try,  you won't be disappointed."}
{"text":"Very low end! The food the service  and looks dirty"}
{"text":"The service is horrible!! The food is nothing special to be putting up with such terrible attitude and service. I would not recommend this place to anyone!!"}
{"text":"Nom nom nom!   I'm a sucker for a buffet and this place is wicked. They serve high quality food- amazing sushi, perfectly cooked calamari, and some of my favorite Chinese staples- ginger beer, fried shrimp, and shrimp fried rice! They even had a prime rib tonight. For $22 that's a hell of a deal.  Service was great, and I left with a full belly. If you're in the mood for Chinese buffet, this place has everything you need!"}
{"text":"As a Chinese, I don't think this restaurant should be rated that low... Foods here are actually OK, match the price."}
{"text":"Decided to go for buffet lunch today and I regret it.  The dim sum was so bad that it didn't taste fresh.  The siu mai and some other meats had a stale taste to it.  Curry cuttlefish was so soft it disintegrated as soon as I sunk my teeth into it.  Deep fried stuff had that old oil taste to it.  Vegetables were overcooked and salty.  Can't remember what else I ate as my stomach is still churning.  Thank goodness they didn't charge me for the amount of uneaten food I left behind... will not likely return for the buffet."}
{"text":"Food was decent, but portions were small, and some of the severs were rude and unsafe. The waiters and waitresses served food over my head and my tablemate's head. I had a nearmiss, and my tablemate got hit in the ear with plates. The server did not apologize and they continued doing it all night! All they had to do is say \"excuse me\" and wait for us to move before delivering the food on the table."}
{"text":"While in Calgary, I could not pass up the opportunity to get some ginger beef.  ET might not be the best Chinese food, but it was tastey and actually had some good flavors going on!  I liked the ginger beef but actually really enjoyed the sweet and sour pork. I also liked the spring rolls. Nothing was truly outstanding-knock-your-socks-off, but I did not feel ripped off either like with some restaurants.  The restaurant itself was clean enough, but is a little dated and could use a facelift.  The service was good and the staff was friendly."}
{"text":"This has long been one of our favourite places for a quick meal in Calgary.  With their recent renovations, it is much more comfortable and seems cleaner and is definitely more attractive inside.  The food is pretty much the same as always; there's standard Chinese buffet fare such as ginger beef, sesame chicken, a variety of noodle and veggie dishes, some curry, wings and so on.  They have an excellent selection of dim sum, which is always my first stop!  If you are a dim sum fan, there's can't be beat.  They also offer a selection of soups, a small selection of sushi, a basic salad bar, and an array of desserts.  Service here is iffy.  Sometimes you get a very attentive server and sometimes not.  On our most recent visit we had terrific service, but this is hit or miss.  Sometimes your drinks are always kept refilled, empty plates are whisked away immediately, and the bill arrival is prompt.  It helps if you are seated close to the buffet/wait station; the times we've felt like we were forgotten we were either seated next to the windows or in the back room area.    I will note that if you want fresher food, you need to eat at peak times - close to noon and six p.m.  Late afternoon or late evening the food is often badly depleted or has that stale been-on-the-buffet-all-day taste."}
{"text":"Wah! So many negative reviews. They recently renovated the place and my family decided to come here for dinner. The interior looked really different from before. It's more modern and they took out the bbq stand but more importantly, the food was really good.  We ordered the Peking Duck combo which came with a complimentary soup (nothing special) and a choice of rice or noodle dish; we opted for fried rice. We also ordered beef with Gai Lan and Peking style pork chops, but we probably shouldn't have 'cause the Peking Duck combo was a lot for 4 people. The most meat we've ever had for a Peking Duck combo. Typically, restaurants will give you 2/3 of a duck worth of meat but this place gives you a whole duck.  The fried rice had pineapples to keep it from drying out. The Peking style pork chops were impressive because they cut out the majority of the fat out. Could have used a little less sauce though. The beef and Gai Lan were as good as any other decent Chinese restaurants out there. We enjoyed everything we ate.  The food in the buffet looked pretty good too for a buffet. The egg tarts looked similar to the ones at Ginger Beef up north. Even the sushi bar had more than just California rolls.  Hopefully, people will give this place another shot especially when the Peking Duck combo is currently on special for $33. Such a steal."}
{"text":"Ok, so i have come here twice now. both times the service was horrible.... its a buffet.... all you need to do is bring us drinks and our bill...   The last time we went the server sat us at a table where the guests had gotten up to get their \"food\" so you need to leave some one behind and take turns getting food.   If all you want is water you should be ok, Getting refills is almost impossible.   The \"food\" is terrible. Its all very soggy and tasteless. Both times i cam here I felt sick for two days afterwords.  The decor is dimly lit and dirty.   it's very over priced on top of this. Save your money , go somewhere else."}
{"text":"My husband and I are here for the dim sum and they served us food that was in the process of going bad (you can smell it). We asked the waitress to smell it to see what I was talking about and she asked me \"what's the difference?\" Yep, we are not coming back or recommend this restaurant. I wouldn't even give a star but you need to to post."}
{"text":"Wow, don't know why there are so many bad reviews! Bathrooms are hella clean and it's a pretty good buffet"}
