{"text":"A few people have told me that Eastview is the best pizza in Ottawa, and I don't know what they're talking about. I was on just-eat, craving pizza when I saw this place so I had to order it. I got a large combination pizza, it was PRICEY, $27 in total and that's a lot if you ask me considering there are many more affordable options with pizza that tastes exactly the same. 

The pizza was big, they were pretty generous with their toppings which is nice, but just like every other pizza place in Ottawa it was nothing special. The dough is the same, the sauce is the same and they use that same pepperoni with the weird taste, hopefully everyone from outside of Ottawa knows what I mean. On the plus side the delivery was fast and friendly and they had no problem with my half combination half Hawaiian request.  If anyone can suggest me a place that doesn't taste identical to every other place here I would love it. A good pizza place shouldn't require dipping sauces to make it edible..."}
{"text":"This is, by far, the best pizza takeout in this side of town. I used to pass on pizza when ordering in, until I tried Eastview. It was recommended by a friend, no regrets. 

First, it is a family run place and at least one of the owners is always there. The quality of the ingredients is top notch, vegetables always fresh, real cheese, fresh crust. Friendly service on the phone and fast delivery. I always ask for different combos, like vegetarian without onion and extra feta cheese, or thin crust and easy cheese, they never made mistakes so far. 

My family and I now always look forward to pizza nights!"}
{"text":"Eastview actually has really good pizza, but I don't really think it has that great of a selection. Their toppings are pretty standard, nothing crazy here - pretty much the same as all the other pizza places in Ottawa.

They do have sandwiches, subs, burgers, pasta, and other munchies. They have a really wide selection of these foods, and I think they take up more of the menu than pizza actually does. It's the same as the pizza, though - nothing really special or out of the ordinary about the specific menu items, it's just that you have more to choose from."}
