{"text":"Best Lake Erie Fish Fry around. Soups and wings are very good also. Servers could use some polishing up."}
{"text":"The only thing good about this place anymore is the staff. Go someplace else to eat. The owners have no pride anymore in the food they offer."}
{"text":"If you are thinking about going here, change your mind and go else where.  I have eating here my whole life.  I'm done.  The place is dirty, it smells and I got bad service  right off the bat.  Bye Bye Eastland and good luck, your gona need it."}
{"text":"The main reason I frequent here and invite friends here to join me is because of the bartender Tevon. He really is a great asset to this establishment. I like that the new owners are constantly updating and cleaning the place. It has a nice neighborhood bar feel now rather than the dive bar feel it used to be. The food menu is much better than what was offered before. The fact that they removed the keg coolers and put in a draft system shows that they are adapting to the trends. They offer a fantastic variety of craft beers on draft! Their daily specials are also a great value. But make sure when you stop in you ask for Tevon. He provides great service along with a slew of laughs. Keep up the great work!"}
{"text":"I've always loved this place. We never drink alcohol, just come for late night conversation and great bar food!"}
{"text":"Ok so I've been to like 5 different places during lent to try fish fry's.. Well this is my second week in a row at Eastland Inn, why? Because BY FAR they have the best perch fry in town! Not only is the perch great the baked potato and French onion soup were awesome as well ! The staff is great , the service is great! The new owners have done a great job!"}
{"text":"Don't drive by. It's not just a bar. The staff is very friendly. Food was great. Crab legs every day. They will accommodate your requests."}
{"text":"Nice beer selection, good variety of liquor.  The clam chowder was fantastic (and I make my own from scratch with fresh clams, their broth, cream, etc.), the burger was very good, fries were from fresh potatoes.  Service was very attentive, obviously the bartender and waitress cared.  We will def. return."}
{"text":"Great local bar and restaurant.   The decor may not be anything to write home about, but it's a very comfortable atmosphere.  The food is excellent as well.  The menu is very diverse and goes well beyond bar type food to include finer dining.  However, the nacho's and burger there are awesome.  My favorite thing to do is get their burger with the chili and coleslaw they make on top to make a carolina style burger."}
{"text":"Ye olde standby! I love divebars with some history and the Eastland has some stories to tell. I love yelling at the bartender and laughing at the karaoke on the weekends. You'll see a little bit of everything walking in the door,  but never more have you felt like home.  Hit up the Friday fish frys if your looking for a good starting point.   TL;DR  classic bar"}
{"text":"Had a really nice lunch here, on a recent weekday with co-workers.  New management / ownership seems to have led to some quality food changes.  Service was prompt and the food appeared to be prepared fresh onsite.  I opted for the Friday fried perch lunch special.  The plate came with three pieces of fish, fries (but you have a choice of sides), cole slaw and a roll.  The fish seemed to be breaded in a light corneal batter and was not heavy yet quite moist.  Their tartar sauce was tangy, just the way I like it.  Fries were pretty \"standard issue\".  Roll was warm and slightly yeasty (nice!).  I am usually not a fan of chopped cole slaw, but their version was crisp and the slightly creamy and vinegary slaw sauce was super-tasty.  Others at the table also enjoyed their meals...BBQ brisket sandwich on a pretzel bun, tuna melt and a homemade eggplant parmesan.  Based on my group's feedback, I'm sure we will return!"}
{"text":"I've driven by this place so many times and never stopped in until now, don't make the same mistake. Once you walk through the door you will immediately feel the the hometown vibe that you don't find very often. It's so straight forward long straight bar to the left tables to the right a few TVs, a few beer signs and a lot of friendly people. This definitely could be my local hangout.  They're famous for their Lake Erie Perch and let me tell you a lot of places in northeast Ohio claim to serve authentic perch from the lake due north but few consistently do. This is no doubt the best fried Lake Erie Perch I've ever eaten, lightly battered, fried perfectly, it's truly heavenly. I'm not a huge fan of side dishes when I'm eating fish this good but the fresh hand cut fries were awesome.  There are a few other things I found to be exceptional here.  The service - the prices - and the homemade warm chocolate brownie with vanilla ice cream with whipped cream (this is a must try when they have it)  I can't wait to return......"}
{"text":"Excellent Lake Erie perch; lightly breaded and not greasy. Very friendly servers.  Great clam chowder too. Plus a totally comfortable   room. My kind of place!"}
{"text":"My boyfriend and I had our first date here nine years ago, so we do still stop back from time to time, although it isn't a go-to place for us.  We stopped back this year, and while the décor has been updated and really looks nice, we weren't knocked out by the food that we ordered.  The Dirty Nachos, always one of my favorites, are no longer called \"dirty\", but they seem pretty much the same, except that you now have to pay $1.50 for a dip that used to be included in the price.  The flatbread pizza was pretty tasteless, kind of like eating a large cracker with toppings, and the chicken on it had an odd chewy texture.  Pretty disappointing overall......"}
{"text":"The place is dirty, it smells, and I had some lousy service the other night when they were not busy.  I have been a loyal customer for 30 years.  I'm done.   They could be great but instead they choose not to be."}
{"text":"Let's see... The Eastland is a place where you can get a burger, soup, perch, crab legs, pasta, steak, grilled cheese, mussels, or chicken wings. You can also get a bud light, or a Guinness, grey goose dirty martini, a bottle of wine, or a single malt on the rocks. How can they fit all that variety into one-room place that also holds karaoke contests some nights and genius trivia contests on other nights?  The first time I came here I was actually about 2 or 3 years old and it was the free peanuts that brought me in (and my parents). Now, they still have chex mix sometimes, but it's the $5 pitchers of Killians on Monday nights that does the trick.   You don't really need a calander to know what time of year it is when you're here, the place dresses itself up like its going to a cinco de mayo party or 4th of July cookout. The first time you come, you feel like you meet everyone that works here. The next time you come, you get a lot of handshakes, hugs, and 'welcome-backs.' It just feels like that kinda of place.   Welp, my crab legs are here, so you're going to have to imagine how good they smell and be jealous. Signing off."}
{"text":"We just ate here again, a few days after our first dining experience and I don't know..... we just like this place. Really good solid burger that was chargrilled and done right with regular fries. My wife and daughter both had salads, one with salmon and the other with Cajun chicken which they both really enjoyed. Had the Sam Adams seasonal which complimented our food. Nice! The nachos were a bit dry but overall the food and service were perfect. Small but homey and clean (immaculate stainless steel tables) inside and with a Duo on Wednesday nights entertaining at 7:00 with pleasant relaxing music right next to us and we were still able to converse at normal volume. Cool!"}
{"text":"Great food and staff!!  Love meeting friends here for a drink and good time!"}
{"text":"LOL this is a great towny bar! Sometimes it is packed, sometimes empty but who cares the beer is cheap and there are usually no tools there! It is cool to see them decorate for each holiday too! We go as a fraternity group to just chill or for meetings and it is perfect. We love Rhonda and she evens cuts a few deals now and again."}
{"text":"Even as a college student, I'd look for chill dives to escape the douchery that oftentimes took over most of the go-to bars around town.   Eastland Inn was one gem where I found my oasis away from it all.   This is a hole in the wall, but without the sketchiness that usually comes along with that title. It's small, homey and warm. Good brews, whiskeys and some of my favorite grilled cheese around!   I just feel like this bar is always filled with good people, whether they're townies, college students, whoever. It's very much like a family-vibe. Not fancy stuff--just a down-to-earth pub. Cheap, strong drinks too!   Now, typically I'm not a karaoke-kind-of-gal, but I have to admit that it's a blast here! I think they do it up on Fridays, and since the place is so small, it's a whole bar activity. Plus, most people choose pretty interesting songs to sing, which makes it even more fun!  If you ever find yourself in the Berea area (I don't know why you would... I haven't since college), definitely check out this little pub."}
{"text":"Amazing. My mom saw this place on the way to pick up my son from BW. So for her bday we went. The waitress was great and the food was fabulous. My son had a burger and I was waiting for him to lick the plate. The perch was phenomenal. We will be returning."}
{"text":"I don't do this too often but I eat out a lot so here goes.... 1.  My beer was stale, must have gotten warm then cold. 2. Chili was bland and crackers were stale. 3. French fries were soft and mouchy, actually inedible. 4.  BLT was very good. 5.  My wife's sandwich was just ok. 6.  We'll never go back."}
{"text":"Local place with very good service and live music on Saturday nights. Good food, not gourmet, GREAT prices. Wide variety of craft beers, nice pour on the wine order, bartenders make excellent drinks. Nightly specials, our surf and turf order had steak cooked to perfection and crab legs. Key lime pie for dessert was just right."}
{"text":"We stopped by on Friday with our adult children.  The place was woefully understaffed and the food ( perch dinner) was awful.  I ordered a Guinness...really, learn how to pour a Guinness or don't serve it.  I've been coming to the Eastland Inn for at least 50 years and I don't think I'll be going back.  Is it the new ownership?  Not sure but it really isn't the same as it's been in the past. Sad."}
{"text":"This place is really changing. The new owner is really trying and it all seems to be working. It has a new décor and an updated menu.   One of the best things that has changed is the nacho chips. They make their own and they are delicious. I always order extra cheese and it makes for a gooey mound of pure delight.    I hope they keep going and continue to grow and expand. It always nice to have a neighborhood bar so close that has good a food and friendly faces."}
{"text":"This was an occasional stop back in my grad school days, and I recently returned for the ever-popular fish fry. The portions are prodigious. The place is cozy. Yes, that means small, but it's also cozy in the best sense. The servers are exceedingly attentive, the prices are fair, and the food is good. There's a reason it's popular."}
{"text":"What a fun bar!  For being so close to a college, this never really became a \"college bar\", so I enjoyed going there with my friends when we were seniors, to get away from the drunk, groping freshmen.  Be prepared to find a lot of townies there though.  Friday nights are the best because they have karaoke!  Drinks are reasonably priced and moderately strong."}
{"text":"Nice homey joint. The wings are a reason to come back not mention grilled cheese on a cold day. The place is a great find. Sit at the bar and watch a ballgame. What more could you want!?!"}
{"text":"What a great find! Wonderful food! Outstanding service! Cozy atmosphere! Helping a friend who grew up in the area (the Inn is at the end of her street). Stopped in to check the place out. It has changed a lot from what she remembers!  Started with the fried artichokes - a revelation. I could have had a double order for dinner. I had french onion soup. I rarely order this out; since it is usually a disappointment. Not in this case. Just perfect. For dinner I have the Friday Special of fried perch. So very good. Lightly fried and fresh. The perogies as my side were great. Dessert was a lemoncello sundae with fresh baked biscotti. Please may I have some more - not that I had any room.. A perfect meal. And the service was just right - friendly and efficient!  Serving sizes were ample, prices were reasonable, and the place was immaculate.  It is one of those places that I couldn't understand how we were able to get a table. The place should have been packed with a line waiting to get in. Instead it was just full and we were able to get a table quickly.  A wonderful find in Berea!!!!"}
{"text":"I thought this would be a friendly place to eat, and I was very disappointed.  The waitress was so rude. We waited ten minutes for a table that was sitting empty the whole time we were waiting. Then when we finally got to sit down and order it took a good 45 minutes for our food to come out, and the waitress didn't check on us once that whole time. Not to refill our drinks or anything. It was loud, uncomfortable, and the service was awful. The food was good, it was just hard to enjoy it after such a long frustrating wait. I love the idea of checking out little hometown spots, but this is the type of place that makes you scared to try someplace new."}
{"text":"The Eastland Inn is in a historic old house in Berea.  Very rustic and has tons of charm. The food is hit or miss. There are some real winners on the menu however.  The perch dinner on Friday nights never disappoints. There are people lined up out the door during Lent for the perch, seriously! The clam chowder is also really good. I usually get a cup with whatever I'm having. The burgers are sometimes good and sometimes not.   I can really take or leave the food but it's usually good so if your in the neighborhood check it out"}
{"text":"Haven't been there in over a year, last time wasn't so good. I heard they had new owners and some of the menu changed. We went this past Saturday night and we were more then pleasantly surprised. 1st of all the drinks were very reasonably priced and the staff could not have been any friendlier or accommodating. The menu still, had some of the old favorites like Chicken Paprikash which my wife had. It was far better then the last time she had it. We started with the stuffed fried artichokes as an appetizer. My wife not a big artichoke fan gave in to me and we shared it, she is now an artichoke fan, they were fantastic. I had the Pasta Provincial with mussels, it was what pasta in garlic sauce should taste like. our dinners also came with a choice of soup or salad, I had the clam chowder which was creamy and seasoned correctly. Usually I need to add pepper at most places, this was just right. After dinner we moved to the bar area and listened to the band for awhile. Overall great experience that I think will get even better as the owners continue to improve it."}
{"text":"I live around, so I went with friends to take a drink. I forgot my wallet so my husband came back for it to our home meanwhile the other drinks were ordered. Then I showed them my green card, cause I'm not American. The waitress looked at it and showed to another waitress and then they said that they can't sell me a drink with that card. I told them it was a green card, what's more legal than that? She asked me for drivers license. I said I don't have, so they denied me the drink. I was almost freaking out so pull out all the IDs I had in my purse, including my original country ID and I said, don't you have to know how old am I, What if I'm passing by and I'm not from Ohio? I can't have a drink? I am a 26 years old woman, married and a neighbor and I felt bad... the girl realized they were making a deal for no reason and they finally ended up selling me the drink. Oufffff, finally. Other than that, music it's very random, there's some karaoke and food looks good, very home environment. It's more of a loud place than a chill place."}
{"text":"I used to go to the Eastland Inn weekly for their Tuesday burger specials, and at the time I was never anything less than impressed with how good those burgers were.   Somehow I fell out of the rhythm of these lunch stops, and it's been at least a couple of years since I checked the place out again, and I am happy to report that the burgers are as good as they used to be.    I don't know what it is, there's certainly nothing fancy about either the food or the presentation, but somehow every burger I've ever had there is the perfect combination of soft fresh bun, crunchy lettuce, tart tomato, and a burger that is just the right proportion with a well melted slice of cheese on top. It sounds like something that shouldn't be that difficult to do, but somehow they manage to do it consistently well here.  The end product is perhaps the best burger in this part of town, seriously.   They've also updated their menu some since my last visit, lots of new items and sandwiches clustered around the general category of bar/comfort food.  One standout from these new items is the Beef Brisket sandwich - a soft thick pile of brisket in mustard bbq sauce on a grilled pretzel roll- a seriously good sandwich.    Eastland Inn has been around seemingly forever, and it has the well worn edges of an authentic neighborhood bar.  It's unpretentious, homey, and the food is surprisingly good.  Definitely worth your while to check it out."}
{"text":"Great place for a night out, I'm especially a fan of the surf and turf special. Never had a bad experience with the food or drink and the fact that they serve pineapple juice is quite unique and nice. Karaoke and live music nights are also a nice touch. Just wish they had less cramped parking."}
