{"text":"I'm usually quite verbose in my reviews, but the vitriol that would flow in regards to this place would overwhelm my hippocampus. Therefore, brevity is my friend.
This place is AWFUL. SERVICE IS HORRENDOUS. DIRTY. FOOD might taste alright, but I'VE FOUND HAIR IN MY DISHES ON BOTH VISITS. THEY'VE BEEN REPORTED TO HEALTH OFFICIALS OFTEN. BLECH!

They even changed their name to try to escape the bad reviews!"}
{"text":"Best Chinese food in Calgary.  The food is fresh and never too greasy.  The portions are big and they do not skimp on the good stuff.  We've only done take out.  People who work there are friendly."}
{"text":"Food is decent.... But service not so much and waitress always expects tips... if you don't give then enough they will ask for more even thought they don't deserve it sometimes..."}
{"text":"I read on Chowhound that this was a good choice for Chinese food in the northwest, so my friend and I drove over one Friday night.  When we arrived we found the restaurant to be packed with Asian families, so we had high hopes for the authenticity of the food.  Unfortunately, they were unable to accommodate my vegetarianism.  Feeling bad that I'd dragged a friend to a restaurant that couldn't accommodate me I ate the only thing the server said they could do- a hot pot with vegetables and deep-fried tofu.  It wasn't great, but it wasn't bad... but more importantly I'd been hoping for something less greasy and more interesting.  Also, my friend would have happily shared dishes family-style with me if they'd had enough meatless dishes to make it work... but the ONLY thing they could offer was the hot pot.  If you do head to Edgemont City make sure everyone in your party likes meat! 

The atmosphere is fine, and it's nice to see all the families dressed up and sharing dishes.  We found service to be quite rude, but in hindsight it may have been the language barrier.  Prices are very average."}
{"text":"Food: 8/10
Service:8/10
Price: 7/10

Food was good, well seasoned. I have been going here for years and food has been consistent. The dishes have been getting smaller but has been a trend in most Chinese restaurants in Calgary. The waiters are honest with their recommendations and all the food was on point. Their \"crab meat and fish stomach\" soup is a little bit more expensive but it is because they use real crab meat and is noticeable in the taste. 

Service is very good especially for being a Chinese restaurant, they are attentive and honest about food recommendation. 

The sizes of the dishes are fair and appropriate for the price. They do not skimp out on the meat on the dishes like other Chinese restaurants. 

Overall I would recommend this restaurant to friends and is great for large family dinners."}
{"text":"Made reservations for 7pm with preorder of food as we were going there for a double birthday dinner. Arrived at 645pm only to find out they gave away our table to someone else. Waited until 8pm before we got a table, which didn't even fit the 16 of us. They arranged for 2 tables instead,  then they put food on the table before we even sat down or got ourselves arranged. There was no service, had to walk up to the waitresses to get any service. Food was mediocre,  the whole steamed fish looked like just a bunch of leftover scraps rather than a whole fish, the chicken had parts which were still bloody and raw, the shrimp chips were burnt, only good dish was the birthday peach buns. When we paid, they had the gals to ask for more tip after we paid (we gave them 5% tip because of our long wait and rude service). No apology for the long wait, no discount, no nothing for the HOUR wait for a RESERVED TABLE WITH PREORDERED FOOD. The only reason we stayed was because it was the restaurant my grandfather really wanted to try. If there was a 0 star rating I would rate them 0. NEVER GOING BACK AGAIN."}
{"text":"New ownership this place downhill. Go somewhere else. They messed up on the order and did nothing to fix it still had no problem charging. Will not be returning."}
{"text":"4 of us ordered 5 dishes! Cashew shrimp with mayo and fried chicken with fried onions on top tastes really good. The corn soup is salty. Scollops with veges also tastes good. Price is moderate."}
{"text":"Food wasn't too good. Shrimp was super salty, rice was dry and cold, sea cucumber was bland and dessert was literally sugar and water."}
{"text":"Been here several times since my cousin, aunt and uncle live in the Edgemont community. This place is pretty decent and authentic Chinese food in a community of Cantonese, comparable to the Chinese food we have down in LA. One of the things I like most are the roasted squab, we've ordered that on multiple occasions. Everytime I come up to Calgary, a visit is a must and it's always pretty crowded so my uncle always calls in advance to make a reservation."}
{"text":"Food was better than expected. Some items did take a little longer. But otherwise everything was good. Didnt offer desserts tho."}
{"text":"If you want and enjoy authentic Chinese this is the place. There are so many dishes that I, my friends and my family enjoy that I would be posting a menu to list them all. Some of my favourites are the salted egg shrimp, the house special and all their tofu dishes. The prices for the quality and quantity are excellent. On Fridays and Saturdays, either get there about 5pm or make reservations, as the place is packed. On Mother's Day, you must make a reservation if you want to eat as it is so busy. I have taken everyone that has visited me to Edgemont City and everyone has stated that is was some of the best Chinese food they have eaten outside of China."}
{"text":"Our family has eaten here several times and every time at supper hour , this place is packed with Asian families enjoying their meals here. We really enjoy the Peking Duck meal and a favorite is also the ginger beef here as well.   I would make a reservation if you have a group of people going.  We have always enjoyed the service and especially the food here.  Very happy with this restaurant !"}
{"text":"Came here for a family dinner, the usual every time I come to Calgary. We ordered the 10 dish special, came with soup and 10 dishes plus dessert and unlimited servings of rice. I'm guessing because it was a busy night, they were a bit careless with their food. One of the dishes served was sweet and sour pork ribs, my cousins who had it claimed it was uncooked...

Otherwise, the seafood here was pretty good. The waitresses here are not attentive as usual.."}
{"text":"The service was terrible. I went there with mom and after we orderded, we waited for 50 minutes. We asked the waitress politely about our food, and they did not respond to us. Thus after 50 minutes of waiting, we left there because the waiting was ALMOST AN HOUR and sevice was just ABSURD. During the hour that we waited, other tables were filled and their food had been all served."}
