{"text":"Ordered a regular straight up breakfast-3 eggs sunnyside up, bacon and potatoes.  Eggs a little runny (not a fan of the clear film on top) and bacon was overdone but potatoes were good.  Service was courteous and prompt. A decent place to go for a quick meal but nothing to write home about."}
{"text":"I enjoyed my eggies benedict, the holondaise sauce was delicious and not salty like so many other sauces. The service here is fantastic & the ambiance is great to hang out right on the Danforth with family and or friends."}
{"text":"I wanted to like the new bistro on the Danforth, I really did. My spouse and I stopped in today, his second time (he liked it the first time), and my first. The server was lovely, and really accommodating. However, the food was terrible. My omelette was rubbery and tasteless, and my toast was dry and obviously cheap store bought bread. Even worse, my spouse ordered smoked salmon on a bagel. The smoked salmon, which should be cold and pink, came fried and greasy, making the bagel soggy. The coffee was tasteless too, and no we did not have colds...it was brown water. I am not willing to go back, as there are so many good places to eat in our neighbourhood. Sorry Eggies."}
{"text":"Came by after our CN Tower climb ravenous and tired. This place was perfect, we missed the breakfast rush, plenty of tables, service was fast and very friendly. We were happy with our portion sizes and even though they messed up one order, they quickly fixed it. The food was delicious, we all ordered the special , and we all left fully satisfied. Only gave it four stars because the price of the Orange juice. 3$ a glad is pretty steep for a medium sized glass, especially when you can order a mimosa for the same price. All in all it was a great experience and I'll be back most definitely"}
{"text":"I wouldn't really try anything on there menu that's has eggs lol but I did have fries. I give this place 5 stars for two reasons. 1. The server was amazing super friendly and funny and helpful I would so kick it with him again.  2. THIS PLACE HAS $3 BEERS ALL DAY EVERYDAY!!!! I have hit jackpot on this hidden gem on the Danforth"}
{"text":"I was walking along the Danforth and came across this new restaurant so my husband and I went back the next day for breakfast. The server was very nice and very attentive (maybe a little too much at times). Both my husband and I enjoyed our breakfast (Eggs Benny and Mediterranean Omelette); the breakfast potatoes were really good and so was the orange juice (which is freshly squeezed). Unfortunately the coffee was pretty bad- very watered down."}
