{"text":"I had the venezuelan version of the bandeja paisa for about $20, and i enjoyed it, especially the fried plantain. The arepa came with it was great too.

A tiny little bit pricy, and the service was a tiny bit slow, but having been to Venezuela and colombia, i wouldn't take this as an affront -- it's just part of the authentic experience. The food more than makes up for it. :-)

Good place. we need more decent central/south american food in toronto!"}
{"text":"So delicious!!  We had La de Pernil and Chicken Llanera.   Outstanding!  Very filling but not overwhelming.  LOVED the Tequenos!   Very reasonably priced.  We will definitely be back."}
{"text":"I had a groupon that I needed to use. The food was a pit expensive, the prices aren't listed in the restaurant but an arepa goes for $12-14. They are big but very bland, even with the sauces. The yuca chips were very nice but for $7 it's a little pricey. I think everything is overpriced. Even with the groupon I paid an extra $20 for 2 arepas and a side of yuca."}
{"text":"I am from South America and you can get a bigger arepa with all the fillings in 10 mins; at this place we waited for half an hour for just one arepa, and we were melting because there are not enough fans! 

And $15 for that tiny arepa? Please stop being that greedy! I know your target market are Canadians and not latino people but seriously? At least make it a combo with plantain or yuca. 

The taste was very good! Especially the cheese!  (looks great on my picture.)

--- The owner replied to my negative feedback, asking me to visit the restaurant one more time. I highly appreciate his interest, and for that reason, I will visit El Arepazo again!"}
{"text":"So damn expensive! If you feel like a $14 sandwich, this place has decent Venezuelan food. A full side of yucca fries is delicious but it will run you another $10. If you have money to burn, eat here. Otherwise, take a pass - your wallet will thank you!"}
{"text":"Posted hours are apparently suggestions; don't expect them to be open even if their website and sign says they are. We drove across the city to eat here. The lights were on, the door unlocked, 3 hours before scheduled closing, and we got immediately kicked out. Also - don't bother if you are disabled or elderly, we are evidently not welcome here - completely inaccessible. Disappointed that I dragged myself up those stairs for nothing. We won't be back.

Edited to add: the owner has messaged me multiple times now, even after being asked not to contact me again, to \"urge\" me to take this review down. Apparently they had an equipment issue on the night I visited. They feel they didn't owe me any explanation whatsoever and I disagree. A simple \"we are having equipment issues, sorry\" is not a lot to ask in the name of customer service. They also refuse to admit that the location being 100% inaccessible to disabled people means we are not welcome. Not sure how someone is supposed to feel welcome when they cannot physically access the restaurant. The intent of this review was to warn other disabled people not to bother because of lack of access, and I stand by that. I am very disappointed that the owner feels this behaviour is appropriate, especially after I asked not to be contacted again. After reading other reviews, I see that I am not the only person who has been contacted and asked to remove a negative review. The owner feels my review is unfair as I didn't try the food - but half of a restaurant's business is customer service, and my experience of it was very poor. Based on other reviews, I am not alone in this. Yes, business owners are just people - but so are disabled people, and we have a right to proper access. If a business does not provide that access, they should be prepared to be called out on it. If you value disabled customers, you would ensure that they have access to your business."}
{"text":"Recrate your venezuelan experience of try a southamerican food that you will love.  Arepa, tequeno and Malta polar are the best. 

This place is great. Recommended"}
{"text":"3.5 stars

Having bought one of these discount vouchers when Yelp reviews to El Arepazo were limited but relatively positive, I held on to the voucher as I saw increasing criticism from more Yelp reviews.

But...the voucher was expiring, and I wasn't gonna waste it.  Perhaps it was my low expectations, but our visit to El Arepazo was A-OK!  

We ordered two Arepas (pulled pork and grilled chicken), and this cost us roughly $10 on top of our $20 voucher (which cost $10? if I recall).  For an actual output of $20, we were satisfied by what we received.  While some reviewers had complained of measly portions, we found our arepas to be very generously filled with meat and queso fresco (and grilled veggies in the case of the chicken arepa).  The pulled pork was very flavourful, but the chicken was a bit bland, but that may be personal tastes.  Each serving comes with a couple of sauces on the side to help amp up the flavours.  We found the actual arepa to be on the greasy side though, so mostly picked out the fillings.  The prices without a coupon might be considered on the high side for many (would have been $30 for 2 arepas only;  no sides, no drinks).   

Other reviews complained of long wait times.  This was not the case for our visit.  We went after lunch hour (around 1pm) on a weekday, and our order was up within 15 minutes.  Additionally, service was friendly.  

All in all, a better than expected visit."}
{"text":"Don't come here hungry
Took half an hour to get our food, with no updates from servers in between"}
{"text":"What do I have to do to enjoy delicious Venezuelan comfort food? Look no further than El Arepazo! Clean and bright with friendly staff who always care about the customer. I love the amount of food they provide in a single arepa, I was full on the LA DE PERNIL before I finished it. The pulled pork was fresh and plentiful as was the cheese - so good! 
Thanks for the tip from Talia, she suggested the meal since the pork was just prepared, it saved me some time in my day. I expected a longer prep time for the fresh food but it came 5 to 7 minutes with the best salsa in Kensington. Look for me again!"}
{"text":"I came here yesterday... so disappointing. Their menu no longer has any items other than arepas, I asked and was advised that they only sell arepas? No sides, no menu selection pictures posted inside - just a small laminated menu index card you mark off. They did have a drink menu written. Staff kept telling me to add more toppings when I already knew what I wanted... sketchy. I asked for water, which was not provided. Ended up taking my order to go. Here's the kicker, they are clearly not using P.A.N. (a previous picture shows they have it in the restaurant, when I went I didn't see any), when I ate the arepa literally 5 mins later walking up the street, it was soggy and made with what appeared to be regular flour? It was the weirdest thing. So bland. I've grown up eating arepas and I am not certain what this was.. but an arepa it was NOT. I threw it out after a few bites... SUPER WEIRD!"}
{"text":"Vey disappointed.
My daughter had to get up to ask for every single thing, straws, forks and knives...
I had PABELLON , the meat was very greasy. The server didn't explain  us we could choose grill or fry arepa.  My daughter had PLATANERA,  but the plantein wasn't enough mature how is support to be, whoever she end up eating just the plantain bu not the arepa and cheese, our guest had the CHORIZO and she said with was good, The salsa was delicious. 
The bill came for $46 which I consider expensive for three arepas of that quality.

Will I eat there again? I may try their vegetarian options, but not sure. I'm may go for something esle since I'm in Kensington market."}
{"text":"I think what this place is great for is for its laid back feel. But the food and the ordering process need a bit more work. To order you had to go to the cashier and choose from a menu that was provided. There were many ingredients that I didn't know what they were as they had no descriptions provided, hence we had to keep asking the host what each and everyone of them were, especially since I was choosing veg ingredients and I was concerned about picking meat based products. The host was helpful but it was a bit awkward for us to keep asking many items on the menu. The food is average. Not the best Arepas I have had in town. The flavor was lacking in the Arepa buns themselves and the dish just felt like a bun with ingredients put in like a subway sandwich rather than a well thought out dish. The flavors could be more authentic and rather than making the customer make their own, having few but well thought out Arepas on the menu with good authentic, playful flavors would really make this place much more memorable."}
{"text":"This place was a great disappointment. Visited during the week for lunch. The first thing we hear is all the items that they are out of and the 'mechada' (shredded beef) would take another hour to be ready. We ordered the pork arepa, which was tasty (though on the salty side) and cachapas, which were NOT homemade as they should be, but rather out of the package. Prices I thought were high, but portions were big. I don't think I'll be coming for a second visit."}
{"text":"Pros:
- Food tasted great
- Good size portions
- Sugar cane juice mmmm
- Clean and bright

Cons:
- Service was a little slow"}
{"text":"I wanted to love this place, but it's just not quite there...

I bought two Groupons randomly, because it sounded interesting and I've never had Venezuelan food before. 

It's cute, has it's own character, and fit right in to the Kensington vibe. My first visit, on a weekend around 7, they were low on cornbread so told us we couldn't get the sliders (a tasting plate of 3 arepas with different fillings). We ended up getting a chicken one and a steak one instead. They were the size of an adult male palm, decent, but not incredible. Similarly with the taste, decent, but not spectacular. I have no idea what \"authentic\" arepas should taste like, but were on the bland side for me.

My second visit, on Sunday evening, I was told the wait time will be 40+ minutes - so I went somewhere else. I did appreciate the heads-up though.

Overall, the staff seem very nice, the decor is a bit fun if a bit on the utilitarian side, and the food is decent. But I probably won't go back without the Groupon discount, especially when there are so many other good options around the area for South American fares."}
{"text":"The waitress was great but the food was very salty and expensive I paid 51$ for 2 arepas and 1 juice, I won't go to that place again"}
{"text":"I bought a voucher via Travelzoo - $18 for $40 of food for 4 people. 

Our table only order two different types: La Llanera & La Reina. 

- La Reina was delicious. Easy to eat and you can taste the grilled flavours from the chicken.

- La Llanera was tasty but the steak was bit chewy. Chewy meat in an already messy wrap made it harder to eat. I wouldn't order this again as I prefer the chicken filling, but happy to have tried it. 

Overall, the arepas were hot and the cornbread was crispy which I personally enjoyed. Though filling, it is on the expensive end for what you get, so the voucher was quite helpful. The service is a bit slow, it took about 15-20mins from the time we ordered to when we received our food - so if you're looking for a place for a quick lunch, I wouldn't recommend this place. 

We wanted to order Mexican coke but they didn't have it (not sure if they ran out and had none). We ended up drinking the free water that was provided by the cash. it was maintained with ice which helped with the summer heat! 

I don't have anything to compare it to but as a first-timer, I was happy with my experience here. Would recommend."}
{"text":"Looking to try Venezuelan food? Then look no further! This restaurant was my first time trying Venezuelan cuisine; I didn't even know what an Arepa was (lol). I noticed this restaurant was recently added to the Grabb App so I decided to give it a try. It is located in the Kensington Market area of Toronto. Their signature dishes are the Arepas! Food made of ground maize dough or cooked flour prominent in the cuisine of Colombia and Venezuela. It is eaten daily in those countries and can be served with various accompaniments such as cheese (cuajada), avocado, or (especially in Venezuela) split and used to make sandwiches (thanks Wiki). 
 
Their Signature Arepas include the La Llanera Arepa (savoury steak with avocado and melted queso fresco), Chorizo Arepa (homemade sausage with melted queso fresco and avocado), La Reina Arepa (chunky chicken and avocado salad), Chicken Llanera Arepa (grilled chicken breast with roasted red peppers, avocado, and melted queso fresco), and Veggie Deluxe Arepa (fried plantain with avocados, tomatoes, black beans, and melted queso fresco).  
 
Service was really quick! I ordered take-out using the Grabb App and it was ready for pickup within 6-8 minutes! I ordered the La Llanera Arepa and it was really good! The steak was juicy & tender! The condiments & toppings made it even better, especially the avocado! 
 
The reason I am not giving them 5 stars is because the Arepas are a bit pricey for the amount you are receiving. I personally like to eat a lot so the portion I received was not enough for me. Maybe if they came up with an Arepa combo like adding fries and a drink, then that would justify the cost of the meal. 
 
El Arepazo is a new restaurant located at Kensington Market and I'm sure they will work out the kinks for the prices of their menu. I will definitely come back here because of my new love for Venezuelan cuisine!"}
{"text":"The food is delicious! We ordered arepas, one with chorizo and one with pulled pork. They were both delicious! We also got a Pisco Sour, same thing.

Service is slow and sort of amateurish, so be warned. We didn't care though, and will come back!"}
{"text":"We ordered papelon con limon but it was sold out, tequenhos but they were sold out and yuca frita but it was sold out as well... We went to the restaurant at 6 on Sunday. Anyways we ate cachapa with cheese, it has a good amount of cheese and it was ok but a bit over cooked, the arepa was not fresh, the mandocas were ok and the strawberry lemonade was not a lemonade really.

The prices were a bit higher than other Venezuelan restaurants in Toronto and the quality is lower."}
{"text":"Came here on a morning when we decided to visit Kensington Market. Since I was looking for a special Colombian or Venezuelan place to go I looked up El Arepazo before we went. 

I have visited South America (especially Colombia) plenty of times and have always enjoyed Arepas. El Arepazo has the finest that Venezuela has to offer. We had the Arepa de pernil, Arepa de Pabellon, Arepa de Camaron and Arepa de Chocolo or Cachapa as they call it here. They also had authentic Coffee and Postobon Manzana. 

Everything was more than delicious. The most authentic place to go to if you crave Arepas. Thank you so much for the great meals. We were so stuffed we didn't eat anything else the entire day. Once more if you're in Toronto make sure to visit them and yes you should totally go out of your way to eat here as it is completely worth it!"}
{"text":"I grew up in Venezuela and I found the food to be very disappointing. The tequeños were pricey and burnt. The orange pernil was gross, I wish it had just been normal pernil instead of sweet orange flavored.

out of the arepas, i think the chicken was the best one compared to chorizo and steak"}
{"text":"I've thought about leaving this review for a few days and I think for the best of El Arepazo it may be good for you to receive some honest feedback. I have been visiting you since you were down the street in the mini food court location. I know your sandwiches and have loved them many times. This past Saturday I came with a friend who has been with me to your location as well and our experience was bad. Maybe it was a one time deal. There was a staff meeting going on inside...maybe that's why our food was made without the specialness that you usually make it with.  We ordered platanos maduro with queso and we could tell that some of them were made from unripe plantain. The cheese on it wasn't melted on it either.  We closed the foil up so it could heat up and melt it a little - that didn't work. It felt like our dish was thrown together, which is how it normally looks and we're fine with that but as long as it taste good.  We were disappointed.  I noticed this time you use plastic cups to serve people at a table (you're in Kensington, a place where an example is to be set) and cheap napkins - when I would need only 1, now I need 20.  We will come back eventually to see if this was a one time deal but til then, we will go have Arepa's at other restaurants.  It sucks because when we do visit downtown, we have a lot of places to choose from and we chose you. All the best for your future."}
{"text":"Arepas are fairly tasty here, but the wait is quite long. I've tried the shrimp arepa and it's nice, they give you quite a few shrimp and it's pretty stuffed with other things. Prices are a bit steep for what you get, but it comes with the neighbourhood. 

On another occasion I came for the yuca fries. They're also pretty good portion size wise, and they give you lots of different dipping sauces to dip in, though I really only like the green salsa sauce and the red spicy sauce. The mayo was a bit too sweet for me, and the garlic sauce the garlic was a bit too overpowering."}
{"text":"The pulled pork was sold out. We had patacones (plantain cups filled with delicious stuff), llanera (steak sandwich with corn bread) and plantanera (sweet plantains with queso fresco). It was all delicious and super tasty. We will definitely be back."}
{"text":"Loved this place. Was crazy busy when we were there, alot of take out, but service wasn't compromised. Food was great. The arepa was fresh and delicious. Chicken breast done ot perfection with a topping of cool avocado. Will definitely be back."}
{"text":"Great place to eat Venezuelan food staples. The wait for the food, a bit long, understandingly if food is being made fresh. Will return for sure. Would like see empanadas on the menu.:-)"}
{"text":"Came here with a Groupon on a weeknight and the place was empty, which made for a great, quiet experience. 

The La Llanera - their steak with avocado and queso fresco - is apparently their bestseller, but I found it incredibly basic. I'd skip it. 

The La de Pernil - slow-roasted pork with avocado, queso fresco, and mustard salsa - was more flavourful. 

Yucca fries were delicious and the mandocas (fried donuts) was my personal favourite of the night."}
{"text":"Very delicious arepas! Loaded with delicious toppings including avocado, plantains and black beans. The service was good and the food was delicious as well!"}
{"text":"Always amazing ! 

The best arepas and salsa verde  in the city 

Had the la llanera and the pabellon - both were out of this world 

Great comfort food"}
{"text":"Third time eating in at El Arepazo. Came with three out-of-town guests to sample some of Toronto's multiethnic cuisine. Ordered 4 full sized arepas to share: la de pernil (pulled pork), the perilla mixta (mixed grilled chorizo, beef, chicken, queso), la reina (avocado chicken salad), and la de camaron (shrimp).

La de pernil - pork was very tender and not dry. Could have used more seasoning but portion of meat was very generous and had an overall good roast flavour.

Perilla mixta - a very delicious mix of grilled meats. Seasoned well and was flavourful.

La reina - I order this every time because the combination of creamy avocado and chunky chicken is a perfect match. However, this time it seemed there was too much avocado and not enough chicken. Also, the chicken was shredded rather than in chunks, so there was a lack of texture contrast.

Camaron - great seasoning on the shrimp though the portion was small compared to the other arepas. 

Tips: At around $13-$15 per arepa, it can get a bit pricy if you want to try different arepa fillings, so I recommend sharing with a group. Go during off peak hours to ensure you get a table. They do smaller size arepas for about half the cost of full size ones. If you let the friendly staff know you are sharing, they will cut them in half for you."}
{"text":"This  place is at the less crowded part of Kensington with a patio on the front.You are handed in a sheet to choose the Arepa sandwich that you want, you can choose different toppings as extra. Toppings include Havaarati Cheese , avocado, satue onion etc. You have to choose the right topping otherwise your sandwich will be dry and even though the arepa is very delicious and  their main ingredient is high quality,  your combination is a failure. Ask them to help choose the right combinations."}
{"text":"Found this little gem at Kensington Market and I'm so glad I did! I ordered the Chorizo Arepa and the Mandoca. 

The arepa was delicious but the Mandoca was to die for! I might have to go back and order more of those next time. 

The only thing I have to say is...the place is really tiny and it was really hot in there. No air conditioning or fan. My girlfriends and I were melting. 
Service was also a little slow too but the food was definitely worth the wait."}
{"text":"Friendly vibes and good food, great place to try some kinds of food you may not have eaten before.

4/5 - Venue
4/5 - Food
3/5 - Overall

I visited this location to pickup a food order from an app, and thus I might not have the full experience of dining in the restaurant, but I'll review what I can.

Venue: The restaurant is tucked away on a quiet street in Kensington, and you might miss the front if you don't look carefully. The inside is far from large, but houses several small dining tables, and a small bar. Not spacious, but a cozy spot for a nice meal and conversation. Latin music plays in the background most times, and there shouldn't be too many people in the restaurant past 7:00pm. Only complaint is that there seems to be a tendency for people to drag snow and water into the restaurant, and the interior was a bit too chilly for the winter weather.

Food: I ordered a large arepa with chicken tinga, avocado and chimichurri. However I received one with mozzarella instead of chimichurri. It was still very tasty, but I would have liked if they could have clarified with me before substituting a topping. Around $12 - $15 for a large arepa, they are on the pricier side of a \"sandwich\" and will not fill you up if you have a large appetite. Otherwise, the meat was tender and flavorful, and nothing was overly oily.

Overall: As indicated above, a quick note to let me know that they had run out of chimichurri would have been no problem. Service was otherwise friendly, and they made my food order on the spot."}
{"text":"We had not been here before, but chose it since it close by and to watch the World Cup on their large screen.  Seven of us - each tried a different arepa.  We waited over 30 minutes for the meals.  One of the party had to wait almost 40 minutes.  It wasn't that busy.  The waiter seemed confused and he definitely wasn't organized.  The food wasn't that good and didn't go back. Our experience may have been unique but I wouldn't recommend it."}
{"text":"Had a seafood shrimp arepa and I was very disappointed. I was really looking for something new but this was just a total mess. 

It was all over the place, the shrimp and squid were crazy tangy and the bread is went soggy. The guac sauce they give didn't taste good either. 

I showed my Venezuelan friend and she said it wasn't even a arepa.

Overall, I'm disappointed and wouldn't come back."}
{"text":"Decided to give this a try. I've only had frozen arepas so I was stoked to taste the real, fresh thing. The server helped me out a lot and made some great suggestions. I appreciated the fact that there were gluten free options. There was a lot of food, the texture was incredible , and the flavour was amazing. I can't wait to try new combinations."}
{"text":"Service could not be more epic.  Great food selection and now a Full liquor license.  Please come here!  If for nothing else than a shot of tequila and the pumping Latin tunes!  Music videos are like soft porn to cray sick Latin beats."}
{"text":"Tried this place out for the first time.  My friend and I ordered 2 arepas which we shared: Reina Pepiada ($12) and La Llanera ($12 as well, and apparently they only had pulled beef today).  The filling for Reina Pepiada was more like a shredded chicken avocado salad (not chunky at all) and was decent, but needed more seasoning such as salt.  The other arepa was just OK as well (not great), and the filling was very wet and messy.  I think the best thing I enjoyed out of the Llanera arepa were the queso fresco and the avocado.  Even the accompanying hot sauces were just OK.

In my opinion, Arepa Cafe on Queen St. is so much better (not to mention cheaper too).  The Reina Pepiada at Arepa Cafe (for $10) has large chunks of chicken and avocado, and is ooooh so good.

Even though I bought a Groupon voucher worth $20 for El Arepazo, I had to pay an extra $9 including taxes for the 2 arepas.  So in theory, $29 for 2 arepas that were so-so?  That is outrageous."}
{"text":"First time trying venezuelan food and definitely not my last! Brought a groupon ($11 for $20) and tried out their arepazos. I had the charizo and the steak. I'm not a fan of mexican food but venezuelan food is a something new and delicious. Portion sizes are generous, so one arepazo will fill you up. They stuff it very generously with avocados and melted cheese! We also had stuffed plantain cups which was good but probably won't be re ordering as the fried plantain cup was quite flavorless. With two fresh juices, our bill came out to $55, minus $20 from the groupon. Will definitely be coming back to satisfy my new found arepazo craving!

Also, the staff were very kind and helpful with the menu and suggestions."}
{"text":"I was disappointed. First off the was no smells coming from inside so that should have been my first clue. Normally you can smell good food a mile away. Second after placing our order it took like 30 min to get our food even though there were only 2 other people inside and Lastly, the arepa itself was just meh. The outer corn breading was hard, there was plenty of avocado tomatoes and cheese but barely any meat and i mean with the time it took to cook the food i would have thought they were back there with a fresh pig. It also lacked flavor even with the hot sauces and mayo/ketchup? they gave us. If i lived here i probably wouldnt come back."}
{"text":"I was looking forward to trying this place out because of the mostly great reviews.  I got a Groupon for $20 and went on a Friday at dinner time. Place wasn't very busy at all, but they were sold out of the pulled pork (what my hubby wanted to try).  He settled on a chicken one, I got a vegetarian one.  Service was slow, and I didn't find the person at the cash to be very helpful. I asked how it worked, do you get a side? What are the different veg options? She just waved to the menu on the wall, which didn't really describe the differences.  With the Groupon, it cost an extra $1 for the 2 arepas.  My hubby liked his, but mine was bland. I used both sauces and one of his.  He was still hungry so ended up ordering a platter with 3 items - sweet plantains, tostones and yucca.  Lots of greasy food to fill him up, but that cost another $17.  Without the groupon, it was $38 for what is essentially street food!  I was underwhelmed by the experience, thought the food was meh and overpriced.  If you are looking for a similar meal with fresh authentic food, better dining atmosphere, friendly service and cheap alcohol - go try La Bella Managua."}
{"text":"Sandwiches were pretty good, they were really really greasy though and because of that it was difficult to actually taste anything else other than grease. It also took a very long time to get our order even though it was not busy. We ordered the chorizo one and the steak one. The sandwiches were pretty much overflowing with chorizo and steak and ingredients! It's a bit pricey for a sandwich, I think they're around $14-15 each but they do fill it with a lot of stuff. Because it was so full and greasy, it easily fell apart while eating so it was super messy!"}
{"text":"I can see why people would like this but for me it was overpriced and pretty bland. The arepa itself is tasteless but the filling is really good. I would get a taco instead. My least favorite place in Kensington so far 

Not for people who don't like messy food. It's basically two inverted tostadas but way less flavorful"}
{"text":"This place is ridiculously Amazing!!!
The food is soooo freaking tasty and the portions are really big, every single time I have been there the food is just great, I love it
I will definitely keep coming to this place and bring all my friends.
No place in Toronto makes Arepas like this ones, Seriously guys you gotta eat here!"}
{"text":"So disappointed. We came in, grabbed a table and were given menus. 10 minutes later and once we're ready to order, they kicked us out because they had a \"20-people party\". They later tried to excuse themselves saying that it was a \"mistake by a bus boy\" who apparently \"didn't know the place was booked\". Even if this were true, their customers shouldn't pay for their \"busboy's\" mistakes. It makes absolutely no sense, and there have been no further attempts to make this up. 

I had been coming to this place for years since I arrived in Canada back in 2011, but will NOT be going back."}
{"text":"The food is great -  it too complicated, just made with care. La pernil is my favorite, but all the arepas are excellent. It's slightly expensive, but they have constant Travelzoo promotions to take the edge off, and even without, it's worth it."}
{"text":"Tasty and filling, but got indigestion from it and the service and layout of the place wasn't worth $28 for two sandwiches."}
{"text":"One of my little routines when I do my grocery shopping in Kensington Market is to stop and buy a plantain arepa in the Latin 'quarter'. Well, to my welcome surprise, I found out they had moved out from that common space to their own storefront!

Well done, guys!

I love the plaintain and queso fresco arepa. It's the combination of the sweet plaintains and salty cheese that delights my taste buds! I also love that the arepa is gigantic! Just one arepa and I am satisfied till next day!"}
{"text":"I have been getting take out from this place for a while now. I have tried pretty much all their arepas. I have never had Venezuelan food before so I cannot attest to the authenticity but they sure serve up some delicious stuff. Their arepas are very filling with a generous amount of avocado. They have a super tasty grilled queso fresco filling. I really like their chorizo and chicken llanera arepas.

Their sides are also equally mouth watering. My favourite is the tostones - salted deep fried plantain served with some amazing garlic dip. The service is really friendly and welcoming. This is pretty much my go to place for Venezuelan food."}
{"text":"We had an expiring Groupon voucher, so it was no surprise we found ourselves at El Arepazo the other day.

I opted to go with an item from the \"Signature Arepazo Arepas\" menu: Chorizo (\"Home made sausage with melted queso fresco and avocado.\")

(I should note that the menu also says that you can \"choose your chorizo\" but I wasn't offered that option.)

Anyway, it's a pretty damn tasty sandwich. The chorizo had been cooked so that certain portions had developed a little crust, which only heightened the tastiness factor. The creamy avocado and melted queso fresco was a perfect compliment, while the arepa itself was hot and fresh (and maybe a little too greasy, admittedly).

My only qualm would be the pricing; it's a pretty small dish and the menu price is $14. Maybe if it came with a side and/or drink I could justify such an exorbitant cost, but as is, I doubt I would return because it's just not a substantial enough meal for the money."}
{"text":"This is one of a very few Venezuelan restaurant we have in Toronto. It's a small almost like a fast food kind of restaurant where they serve Arepas. 

I did not have too many vegetarian choices. We had a cassava chips and a vegetarian black bean Arepa.

It was huge serving. The taste was a bit blend. I never had Venezuelan food before so I am not sure of the originality of it but for my taste but it was average. 

Cassava chips were delicious. 
Try their habanero sauces."}
{"text":"Second time having Arepas in Toronto. Walking through Kensington St you have a ton of food options. Since my last visit they've changed the menu to a la carte. This time we stopped by in the afternoon.

I ordered the shredded beef option but everything else was an additional charge like avocado, tomatoes, and grilled onions. They even removed the plantin fries. The sauce option was great I tried the green one that tasted like it had guacamole. 

I love apresas and am sad I can't find this back home."}
{"text":"If you like healthy and tasty food, come here. I had a cheese arepa with avocado on the side. Delicious! We sat on their patio to eat, chat and do people watching. The staff was friendly. I plan to return don't miss this jewel in Kensington market!!!"}
{"text":"I was, personally, sent a message by the restaurant, which I think is inappropriate, as are the comments contained.  My response follows:

Hello Denny, I am sorry you had such a bad experience at my restaurant, I remember seeing your name on the voucher Saturday night. Saturdays at lunch time are usually the busiest times of the week so it can sometimes take 40 minutes to prepare an order

Though I think some of your comments are unnecessary, such as mocking our use of plastic cups and our staffs' handle of English. Please remember that you got a huge discount on the meal by using two vouchers, which we probably barely broke even on serving you. In Venezuela it would be considered uncouth to try to complain about everything you possibly can about an independent family restaurant while getting a 50% deal.

     * * * * * 

My response:

I purchased, at the restaurant, 2 sandwiches and 2 appetizers (guacamole and fried cassava), the full price of which, with tax and tip comes to $44.20.  For lunch.

I had prepaid $20 for a $40 voucher, not including tax and tip (and I tipped on the full amount, not the discounted amount, of course).  I didn't use $2 that I had prepaid.  I ended up paying, out-of-pocket, $29 in total.  I think even that sum would warrant water served in glasses rather than flimsy plastic cups (the disposable kind).

I commented on the poor communication skills of the server because it directly resulted in our getting a ridiculous amount of avocado and wasting the bulk of the 2 appetizers.

I just checked the pants I wore than day and, yes, there is a HOLE in my pants.  I bet the restauranteur, having found time to respond personally to me has not yet taken the time to remove the splinters that stick on the seating surface of the picnic table on their patio.

I wish I hadn't gone to this restaurant.  It is the worst dining experience I have had for as long as I can remember.  I think it is inappropriate for the restauranteur to privately send me a message, criticizing me because I was HONEST about my poor experience at his restaurant.

I wish I had read the reviews of this restaurant before purchasing the dining coupons.  I can see that others have complained about the poor service and bland food, and that was some time ago.  That gave the restaurant time to FIX the problems and yet they have not.

It seems rather foolish to use a site like Buytopia to bring in new customers to your restaurant and treat them so poorly, let alone chastise someone because they chose to be honest about their experience.

In Venezuela, I am told, were I to detail honestly the actual experience I received and PAID for, I would be \"uncouth\".  Well, in CANADA, it is uncouth to complain to a customer because he had the temerity to speak about about the poor dining experience he experienced.

It was my best friend's 70th birthday and what was supposed to be a special event was very disappointing, to say the least.  As you might suspect, I would never return nor refer anyone to this eatery.

Take some responsibility.  Fix the numerous problems.  And $50 would be nice, too, to replace my pants."}
{"text":"Went here again. I ordered 'la llanera' and was I ever so pleased! It was an arepa filled with absolutely tender, flavourful chunks of steak paired with tomato and thick slices of avocado (seriously, they put at least a full avocado in there!). Ughhhhhhh. I need more.

In regards to my last review, they ran out of tequeños the night before and didn't even have any for lunch the next day! I was sorely disappointed, and so were my party members."}
{"text":"Came back here after getting a really bad black bean arepa a while ago, and our arepas were pretty good! We got the Fresca and the mixed meat one, and although the fresca was a little cold (probably from the tomatoes) they were both good. My boyfriend really liked the meat one.

Another nice thing is that our arepas were on the house because the arepazo owner saw that I had posted a picture of the bad arepa I had gotten before. This place still isn't as good as it used to be before it moved, but I may go back again."}
{"text":"I had heard of this place and heard how good it was.  
And was very satisfied. The flavors were awesome. I had a vegetarian Arepas with Avocado.  Black beans. Mozzarella can't recall any other ingrediants. But they did have some sauces if you were interested. 
The bread was soo fresh
It's pretty full with ingrediants and so be prepared to eat with your hands and get messy.
Can't wait to go back"}
{"text":"They were sold out of steak and pork by noon. How is that possible? And the llanera (steak arepa) is their most popular arepa. Though, 30 minutes later, while still waiting for our order, we heard people ordering the steak, and their order was put through. So I approached the staff and asked if we could get the llanera instead of what we had ordered, since originally, it was the llanera we were interested in. And though we had yet to receive our order, they would not accommodate the switch. We also asked for their tomatillo salsa - a staple - but they were out of that too. In sum, we spent over an hour here - 30+ spent just waiting for our food. And ultimately we did not even get the food we really wanted, and the service was lacking. With so many great food options in Kensington Market, skip this one. 

Addendum: 

Heard from the owner, and if you regularly share your dining experiences online, you may have noticed that feedback from owners tend to fall in one of two categories; 1) professional and willing to rectify the situation - i.e., take responsibility and eager to learn and grow, and make the customer happy; 2) defensive and rude. The response I received in this case fell closer to #2. Too bad. But then again, the response only reinforces my review and experience."}
{"text":"The waitress was super nice and love the Arepas. Also had the tequenos, were super-delicious. Love the Cuban music but rather had to listen to Venezuelan music to have more Venezuelan experience. Over all love the experience and the food was delicious"}
{"text":"This is my second time visiting this restaurant.  
When entering you can seat yourself anywhere and they provide a menu where you circle what you would like. 

I got the empanadas and Arepazo with chorizo, black beans and fresco cheese. The Arepazo is huge, is great to share or bring home for later. The empanadas was just filled with black beans which didn't taste that great. I thought it had some sort of meat filling in it but i didn't bother to look at the menu again.  
My friend got the Arepazo with chorizo, avocado, fried plantain.  The food takes awhile to come out. 

Service here is okay, I would make sure you let the sever know what you want all at once because they tend to forget about you. 

Overall, I would come back if I was craving some Arepazo."}
{"text":"We were in Kensington Market and stopped in because I saw a sign that advertised their Summer Cocktails. We were able to sit at the bar and were helped immediately. I'll let you know that it's lively in here, and by lively I mean loud. They bump loud Latin music and the overall vibe made me feel like I was back in Tampa. We ordered some mojitos because the bartender said they're really good. She didn't lie, they were good. Who knew I'd get a killer mojito in Toronto? 

After a couple of rounds we decided to order an arepa to share. We initially ordered a chicken one but they were out of chicken so we opted for steak and Havarti cheese. When the arepa came out it was stuffed with so much meat and the meat was perfectly seasoned. Damn, this thing was delicious! 

I saw a lot of reviews where people said the service wasn't good. I can see how that might happen because the girls that worked there were, sometimes, so engulfed in the music and the vibes in here they got a little carried away with the party. So, no, they weren't the most attentive staff but they were nice enough. Also, I feel like they kinda nickel and dime you with the whole Create Your Own Arepa deal. You pay a base price for just meat and the corn sandwich deal and everything else is a fee. So we paid a $1 extra for a bomb Havarti cheese that was dripping out of the arepa when it arrived. I've never paid extra for cheese on an arepa before so that was a little off-putting.

Anyway, I enjoyed the vibe, the food, and the drinks here. 3.5"}
{"text":"This is a nice little place that serves Venezuelan food. I have come here a couple of times for their tasty sandwiches. Great service and great taste!"}
{"text":"The food here is consistently good. I discovered it on Groupon. The first time I went, the person serving me wasn't overly friendly, but the manager stepped in and was nice. Also, the two times I went they were out of the pulled pork arepas that I really wanted to try. I have had the shrimp and avocado, and the chorizo arepas and they were very good."}
{"text":"I think they changed the menu vs what you see online as now they have no sides or set arepas - it is all build your own arepa and you just fill out a checklist of what you want on it and submit it. 

I got mine with sweet potato, tomato, black beans, caramelized onions, mushrooms, avocado salsa + added my own green chili hot sauce at the end and it was incredible. Great bang for your buck too as it's huge and can easily be split between two people if you aren't super hungry or want to eat other stuff in the market. 

Gluten free and gluten free friendly. I'm deeming it to be celiac safe (tho they don't advertise that they are) as I didn't get sick at all afterwards and I am pretty sensitive. 

They screwed up our order at first, and service was pretty slow and alcoholic drinks way overprices, thus the 4 stars.

but food is great and will definitely be back!"}
{"text":"El Arepazo's menu is pretty standard for arepas. They offer a 'slider' version where you can get 3 smaller arepas, so thats what I wanted.  When we tried to place an order for that, they said today we're not offering that.  So what they could offer was that we could order 2 regular sized arepas and they could cut them in half.  I don't see how that would have been the same as the slider version.  They still charged me the same regular price as getting the regular sized arepas, and I still got to try one flavour less.  They made it sound like it was a favour they were doing me by cutting it in half for us.  We ordered a side of yuca fries, because the hubby never had them before, a la reina, and a la de pernil.

The yuca fries came first, they were massive chunks of deep fried yuca.  I've never seen them served like that before, usually they're cut smaller.  If you have never had yuca fries before, they're starchy, kinda like potatoes, but supposedly healthier.  Accompanying dipping sauces was a red sauce, slightly spicy, and a green sauce, not spicy.  I didn't like the yuca fries, seems like they used old (old aged, I don't mean unfresh) yuca, so it had fibres that you can't eat.

The la reina arepa is like an avocado chicken salad.  The version that I've had at Arepa Cafe had chunks of chicken mixed with a chunky avocado mixture.  This one at El Arepazo had chicken that was the kinda like the texture of canned tuna.  They may have put the cooked chicken in the food processor?  Their description of the arepa was supposed to have chunky pieces of chicken.

The la de pernil looked more promising, looked like there was real meat in there.  Their menu describes this arepa filled with Venezuelan slow cooked pork with avocado, queso fresco, and mustard salsa.  But unfortunately the pork was bland.  I put on tons of the red sauce and green sauce, and it helped a tiny bit, but not enough.

Don't waste your time here.  If you're at Kensington Market try out the other restaurants instead.  If you really want an Arepa, head down to Arepa Cafe on Queen West."}
{"text":"They moved from original place to a much bigger and better place just down the street in Kensington market. However, the staff Jenny, and the owners are still as amazing as the old place .

I took out of town guests to this place and they were really really happy with the food and service. I love this place, food, and staff. 

Highly, highly recommend it!"}
{"text":"El Arepazo recently moved from the Latin American Food Court location in Kensington Market to a new independent location. The arepas were delicious! It was a Venezuelan party in my mouth! While I cannot attest to the authenticity, I also have no benchmark for Venezuelan food. I just know it is happy belly food.

My companion and I placed an order for two arepas (Chorizo and La Reina)  and shared them like true Asian decedents (FYI Asians always share)! 

The Chorizo arepa is filled with delicious homemade sausage with gooey melted queso fresco and fresh avocado. The second less greasy option, La Reina, was surprisingly just as good, if not better than the aforementioned. The chunky chicken mixed with flavorful avocado salad tasted refreshing. 

Although I have never been to Latin America, El Arepazo is definitely my favorite Venezuelan  restaurant in Toronto!"}
{"text":"Good, plentiful, filling food. I'll  be back when I'm in the area."}
{"text":"The world famous Johnny Tocino brought me here. Kensington Market is full of gems, but this place makes you want to rob the jewelry store and tell em make me a grill.

I had the steak sandwich, which made me dance the salsa and the cha cha all at the same time."}
{"text":"This place is a hidden gem! My partner and I came here on a Saturday afternoon after many hours spent at the metro convention centre for a show so we built up a good appetite for a nice lunch.

We bought a Groupon randomly for this location. We had never heard of it prior to that. We are really happy we did and we would definitely return in the future with or without a Groupon. 

We ended up ordering a shared plate of meat combined with homemade chorizo, chicken and steak. It was sooooo yummy! And it came out very hot and the plate was full. This item also came with a full plate of fried yucca (like french fries) and they were also very good. We found the amount very filling, we didn't even finish the entire meal and ended up bringing it home. 

We also ordered 2 different freshly made drinks - one Coconut drink and the other was sugar cane. The coconut one was very good. It's made with milk and on the sweet side. The sugar cane one tasted more like iced tea - not sure if we would order that one again. 

This place was great and we will definitely return! Can't wait to try something else from the menu as everything seems freshly made in house and tastes fresh."}
