{"text":"Junk persian fake mexican food. Very disapointing. Typical toronto style fraudulent mexican food don't waste your money on this overpriced old-el-paso."}
{"text":"I was really excited to try this place as there aren't any restaurants with a fun vibe in the area. The restaurant itself is nicely decorated with a lot of seating. There was a dj when I went on a Friday night and it just seemed a little much. Mexican music would have been nice, but he was playing really loud Drake. Got steak tacos (pretty good, and the meat was done perfectly) and pastor enchiladas (also good). We also got Pico and chips, the pick was bland, but the tortilla chips were good. The portions are pretty small when compared to other Mexican restaurants. When I asked the server about the obviously missing refried beans and rice, I was told this was their temporary menu. I can understand that, but we paid the full menu price even though the sides were missing. I'd come back in a few weeks once they've settled in."}
{"text":"Great Mexican food and good atmosphere. Service was a bit slow but worth it! We got the chips and guac to start that was a huge portion! I got the carnitas tacos and my boyfriend the chimichanga. Both were very big portions and full of flavour. Will definitely be returning!"}
{"text":"Just so bland. Four different dishes were ordered and though the portion was huge, it just lacked flavour. It may be owned by the same owner when they were in Unionville under a different name ... but it's definitely not the same food at all.

Pro:
Live music
Cheap drinks

Con:
Very bland overall
Where is the beans and rice?! It's been replaced by fries and salad ..."}
{"text":"Nice to see a fresh restaurant replace the cafe that had been empty for ages. We went on a weekday afternoon so the service was quick. We couldn't get the guac nachos because the avacados were too hard so we settled for regular nachos which weren't bad but came with a size of cold cheese whiz. We ordered a veggie burrito and a chicken quesadilla. The burrito was filled with the weirdest vegetables like asparagus and was cold. The chicken in the quesadilla tasted like it had been pre chewed. Not the best food, but nicely decorated. Would be a good place to get drinks."}
{"text":"We tried the restaurant the day or so after they opened their doors. This is a freshly renovated space with a bunch of large tables and tables for two and a few high tops and loud Mexican music blaring. They didn't have their liquor license yet so we had water and soft drinks, no margaritas :-(  We ordered chicken enchiladas and thought they were good and fresh tasting, and seemed to be authentic Mexican in their construction as flavour. There is an assortment of mild, med and hot sauces available to add a kick to your meal. The service was friendly and the cook/chef came out o the kitchen and asked us how we liked the food. I'll try them again when they get the liquor license and try other stuff on the menu. Until then 3/5"}
{"text":"Stopped in after driving by a few times. Love the decor, service was friendly and quick, and the food was great! Large portions, great big goblet size margaritas!

The true test - the guacamole & salsa was delicious, fresh, tasty, we will come again!"}
{"text":"Perplexed as to why this establishment continues to get rave reviews. When my party and I visited in February, the service was extremely slow. We waited about 20 mins just to place a drink order and then another 20 for food. Without any exageration, it took a good 40 mins for any food item to come to our table. We kept having to ask for more things because we were being neglected. The quality of food was very poor. There were hard fragments in my ground beef like when you purchase bargain meat from the grocery store. I'll be taking my business to Mexican Amigos in the future. The only plus was the live music but I could get that at Rhapsody across the street and have a much better dining experience."}
{"text":"I enjoyed my visit, but have a couple of reservations as well.

My friend and I had intended to dine at Rhapsody (Hungarian) across the street. We met there at noon sharp for lunch. According to Yelp and the hours on their window they open at 11:30. They were closed however. We waited five minutes and nothing. I called their number at 12:10 and it went to voice-mail. The kitchen lights were on, but no one could be seen inside. We walked over to El Bocho.

The restaurant has a nicely done tropical decor, a patio and a love for the Volkswagen Beetle. El Bocho is a Mexican name for the beetle and the car is on the mural.
The sole waiter was serving four tables and doing OK-ish, but service was not the quickest - nor too slow. 
Unfortunately, they have followed the trend and have sixteen (or is that twenty five?) TVs on their walls... I don't get it. It makes any restaurant unclassy. Do people really need to watch TV even more than they already do when they go out? How about conversation in lieu of Wi-fi and television sets??

I ordered the Quesadilla with carnita, which is slow cooked pulled pork, and is listed at $15. The quesadilla wrap was semi-crispy and very thin. I liked it. It was tasty and seemed as non-filling as possible; however, is it authentic? I wonder. The carnita was good to begin with, but it soon became soft and mushy. My advice is to eat it as quickly as possible. The food was not spicy or hot and needs the sauces on the tables if one likes the quesadilla made hot. Is that authentic? I wonder. Finally, the included side was a garden salad. The salad was fresh and tasty. The sauce was light and refreshing. However, is serving a salad and not beans or rice authentic? I wonder.

According to the waiter the owners are an Iranian and a Mexican person. This may be, and probably is, the whole truth. I have no reason to not believe the answer or suspect the waiter at all. With that said, me suspicious me wondered whether he added the Mexican owner."}
{"text":"New place, just opened recently, looks family owned, nice decor, and Reno. 
Soup was delicious, the refried been Appetizer with chorizo delicious, tacos could use something else, something missing. Chicken mole really really dry, the beans that came with that tasted burnt, but the first batch was excellent. 
Every thing seems really fresh!! Which is a plus. 
They are brand new, probably why it's a bit slow. I wish them well, nice to see authentic Mexican food. 
I will be back for sure."}
{"text":"We loved the appetizers - especially the guacamole and nachos. The mains were very good. Finally, another addition to the lovely restaurants in the downtown core."}
{"text":"I was quite excited for a Mexican restaurant in Richmond Hill and was horribly disappointed with the experience. 

There was one waiter scrambling to look after 5 tables that all came in at once. As a result my Mojito took over 15 minutes to come. 

I ordered the enchiladas and it was 3 tortillas with pieces of pork inside. Nothing else. NOTHING. There was some sauce drizzled on top but that was it. Soooo disappointing. 

When we asked for guacamole we were told the avocados were too hard to make it."}
{"text":"We got an assortment of everything when we came.  Had the Quesadillas, chicken enchiladas, guacamole nachos, and bean nachos.  All of the food was quite good.  The restaurant was empty when we ordered.  Taste was pretty good and definitely made in house.  Will definitely be back."}
