{"text":"This review is for take-out and food ONLY.  I had arrived late night from out-of-town and came here based on the Yelpster recommendations and pictures posted.  I CANNOT RECOMMEND eating here.  First, this bar with basically a taco table/bar out front (but primarily a bar) is in the middle of a clubbing/nightlife zone (I didn't know this ahead of time).  Parking is wherever you can find it but basically good luck.  Signage was not clear.  
I had called ahead to pick-up to go and I should have known things were going to go South when I had to repeat my order 3 times because the music was soooo loud.  I was told it would be ready in 15 minutes.  I arrived on time only to be directed by the lackadaisical bartender to an unstaffed taco bar; someone showed up within a couple of minutes but it was explained to me that my order wasn't ready because they couldn't hear me!!!  WTF???  Why order ahead over the phone then???  My order of 3 chicken tacos and chips & guacamole was ready relatively quick and service was friendly and since it was so late in the evening, I remained hopeful.  The cost for all of it was $14.00 but check-in on Yelp to get a deal, FYI. I thought the chips & guacamole were terrible.  The picture posted on Yelp of the guacamole basically sold me on coming here but I got very watered down sauce from a bottle IMHO instead (see my pics).  The chicken tacos were IMHO, tasted at best, average to subpar.  I did not think they were \"street tacos\" by any definition but Gringofied tacos for earnest 20-something bar hoppers.  I felt the chicken was somewhat over cooked and you could taste that it had been on the re-heat for a while.  The salsa bar that I was directed to was sad and everything looked like it had been sitting out for a LONG while and basically there was nothing left anyway.  I was not even offered \"fresh\" pre-packed salsa even though my order was to go. So I had to literally scrape what I could...and even then I'm sorry I did.
I gave them 2 stars for trying service and food and mainly because I was informed that this was a \"new\" place in the \"soft open\" period with the hard open scheduled for the week of January 28 -February 3, 2018.  They have a LONG way to go but I would NEVER RECOMMEND it or go back based on the food and service I experienced."}
{"text":"These were the best steak tacos I've had in a really long time. Great taco bar to make the tacos your own. And totally great prices on the tacos and the full bar was stocked really well. I chowed down all 3 tacos and I'm taking 3 more to go. All I can say is 'you go boys' and keep up the good work. Bravo"}
{"text":"This food is pathetic we came late night and the meat is cold and the service is super bad.. the owner before was better the meat tasted like rotten rat meat from thanksgiving. I'm sorry please close down and don't try this.. she served me plastic meat no cheese no sauce no nothing.. why couldn't you tell me before I ordered . Waste of money this place should re consider what they sell and change the menu to Cat meat or Rat meat.. pathetic !!"}
{"text":"It may just be for summer, but they now have $2 bottles of Dos Equis lager and amber beer. They have a new cook, but the still have the same rambling menu and the chicken is still not white meat. They also fired the best part of the bar which was the bartender from Alaska. Apparently he was caught chugging a bottle of JD, among other things. Otherwise, place is still usually empty (before 9 at least), so good for elbow room when drinking and watching the Dbacks this summer."}
{"text":"Good food, super nice staff. Go for the street tacos and margarita. Yelp says my review is short... blah blah blah blah."}
{"text":"I'm on board with el chameleon. Fries are hot, waiters are hot. $5 pitchers and good tunes."}
{"text":"Wadaa! Tacos started as a small window inside of Barny's Boathouse in Oldtown Scottsdale. Miguel Sanchez made fantastic tacos. When Barny's closed down, Miguel reopened a bigger location right in the entertainment district in oldtown. After a disagreement, Miguel and his partner split. Miguel kept the name, his partner kept the location and renamed it Mr. Mesquite. That brings us to the present.
 
Chris \"Barney\" Barnett has opened a new bar, El Chameleon right next to DJs in Oldtown... and he and Miguel are teaming up again! The front patio is a Wadaa taco stand and open till 4a! So we have come full circle!
 
I will post a photo of the new menu which goes beyond beef and chicken to include el pastor and beyond tacos to include quesadillas, nachos, ribs, chips and salsa and even desserts.
 
There new fixins bar also got an upgrade including two salsas, there amazing guacamole crema, a very tasty pico de gallo, and even charred onion and chared jalapeno both of which were super flavorful.
 
I completely recommend you come by El Chameleon and Wadaa! Tacos, meet Chris and Miguel and enjoy some good eats!"}
{"text":"I wish I could do 3.5 Stars. The special for both days we went to the bar was 2$ coors lights. Both days we went there they were out of coors light. Then when you ask what other beers they are offering they tell you that you are paying full price for anything else. we had one bartender during the day on Friday who was very polite and gave us some other drafts for the same price which was nice. But then Saturday the male bartender basically told us to get lost. Either way. Service is average. The beer glasses aren't cold. Tacos are average. Better places to be."}
{"text":"Staff: one gentleman in particular is very cocky and rude. Seems in line with the rest of Old Town staff BUT this place does not have the clout for such poor customer service. 

Update: Spoke with Jenny and she was very friendly and seemed genuinely concerned about the incident. She took the time to hear me out and it was appreciated. Made the perspective of the establishment a bit different."}
{"text":"Just moved to Scottsdale and on my first day my dad and I  stopped at El Chameleon for a few drinks after moving things in since it was right next door. We liked it so much that we came back later in the day for food, and came back the next day. The tacos are great and the staff is super friendly. Its a great atmosphere with excellent drink specials."}
{"text":"Update: came back here for a second time and we had food from the taco bar (on patio) as opposed to ordering from the kitchen in the back. Food was much better and the tacos were delicious. I would come back for more of those for sure.


Grabbed food here around 8pm Sunday night before heading back home & I was not impressed whatsoever with the taste. Presentation was neat, but the wings were sub par (way too much flour), the fried chicken sandwich also had way too much flower and no taste to it, and lastly, the grilled chicken sandwich wasn't all that bad, not once again, little to no flavor.... you guys can do better. Hoping he next time I stop by your other menu items might be better. Otherwise, nice and clean bar/restaurant with friendly staff."}
{"text":"This is my ninth time going here. I can honestly tell you that it is the most underrated bar in Scottsdale. First, Tatianna has the best drinks because she actually knows bartending. She knows cocktails and shooters. The food is good and when I say good I mean the tacos, quesadilla, and the wings. T.J. Was here on one of the industry nights and he had friendly pours for us industry people. If you're a new person. Just busting, a regular or if you're hungry after a night out you just visit here!"}
{"text":"3 tacos and a beer for $10 every day, what's not to like? Put your own taco toppings bar and the environment is open to the outdoors. Full bar as well."}
{"text":"Disgusting tacos.  Precooked, bland meat, no cheese and with the redeeming quality being a seemingly nice salsa bar, except that everything tastes like water.  No grill in sight and young blonde girls building the tacos that have no idea how to cook.  Horrible, blaring music to top it off.  Their value proposition is cheap food, albeit gross, and cheap beer.  No one wants that.  They should get a jump start and begin the going out of business sale.  It's only a matter of time.  Just sad."}
{"text":"Better deals than their next door neighbors at the crazy clubs, and the food is great for the weekend! Their southwestern egg roles are very good and the $5 big margaritas are the perfect addition!"}
{"text":"Noooo don't order food here. Food poisoning. Steamed shrimp didn't seem bad. The chicken provolone sandwich was undercooked and the \"avocado\" was smeared guac, soaked mayo lettuce and ugh. $50 to hell tonight. Damn"}
{"text":"Terrible.  Most ignorant bartender on the planet. When I told him my drink was terrible he said \"oh\" and when I asked for something else he told me my choice was not good and that's why the drink was bad? Are u kidding me? What ever happened to pleasing your customers"}
{"text":"I work nearby and when i get my blt craving I order a BLT and sweet potato waffle fries.  very good and always friendly staff."}
{"text":"Bomb!!! and great deals!! Good place to pre game and get some late night food! Tacos are great!"}
{"text":"Tatyanna the bartender was amazing. This is a wonderful little spot with great deals on beer($5 pitchers), beer pong, and darts. It's the perfect place to go if you don't want to deal with all the super wasted people & rude/busy bartenders in Old town but still want to have a fun time on a Friday night."}
{"text":"We stumbled upon this and it was AMAZING! It is a fun vibe that is inviting to kids until about 10pm. We did the taco bar which was great for everyone. The 11 year old said \"best mexican ever we are coming back everyday we are here\". Didnt get to enjoy them but the drink specials were second to none.. Highly recommend for day, night, kids, adults only."}
{"text":"the best tacos in old town on the set! fuck mr. mesquite they suck and they're meat is dry as hell."}
{"text":"I had very friendly service, topped off work some very tasty tacos. Great toppings, which you get to hand deliver to your tacos."}
{"text":"Pretty good taco place. Would like to see the night environment. Food was good but tacos could have been bigger. Salsas were not spicy :("}
{"text":"These tacos are everything you want and need after a night in old town! 
and for $3 haha take my money :) 

My boyfriend ordered the house burger and fries, that was also great! These could be some of my favorite restaurant French fries!"}
{"text":"Totally love this place! Great food and atmosphere! Employees are all awesome! I plan on spending a lot of time here. Food is super tasty. If you're looking for somewhere to hang for the evening or just stop in for a bite to eat, this is your place!"}
{"text":"Food is delicious here. They've got that down. 

I'm confused by the service model. Been here twice, once for lunch and dinner. both times it appears no one is working there for a few minutes. Eventually someone comes to greet you, take your order and you don't see them again until food is ready. It seems like it's two company's, one that does the food and the other tends the bar. This place is half outdoors and half indoors, Fairly warm inside since they keep a wall open to the weather. But hey the food is good if you can overlook a lackluster service experience. I'll definitely come back for more tacos!"}
