{"text":"This place is ahhhmazing! Hands down the best mexican food around. My fiancee and I come here almost every week. The owners are super nice and down to earth. You'll definitely end up waiting a while for your food, but it's obviously fresh and totally worth the wait. AND they make the best margaritas! If you're looking for some amazing authentic mexican food, you've found it!"}
{"text":"What a lot of people don't understand about El Conquistador is that it is on par with the Soup Nazi from Seinfeld. You do not go there for ultra-friendly and speedy service, you simply be happy that you are seated at a table about to eat some of the best mexican food in the world...maybe second to Los Dos Molinos, but hey that's all the way down by South Mountain. Mark and Maria are wonderful people churning out some incredible food. My all time favorite is the El Conquistador burrito enchilada style. It's filled with steak picado, chile relleno and beans and smothered in yummy green sauce."}
{"text":"This place is a complete disaster.  I went there with my wife and my 2 year old daughter and when we arrived the restaurant was very busy.  After sitting down for five minutes we finally got menus & after ten minutes waters and chips and salsa was delivered to the table.  This seems to be a constant theme if you read the reviews on this restaurant.  After fifteen minutes a lady server came to take our drink order, drinks were brought quickly and then she took our food order.  Food took about 25 minutes and when it was delivered my refried beans were cold as if they were taken right from the can and my chimichanga was luke warm at best.  My wife's food was OK according to her.  I tried to get her attention for the refried beans but she would not even look at our table as she WAS THE ONLY SERVER ON IN A FULL RESTAURANT.  She never checked on our food and since she never went back to our table I had to walk up to the counter for a refill on our drinks.  All the while she never came back or acknowledged our table for the rest of the meal.  I have never experienced this ever in a restaurant and we were really disappointed.  Since she wouldn't come back to our table and this fiasco was well over an hour and a half we said we would leave them $20 and call it a day.  They should have comped our meal anyways but I would at least give them the food cost.  I was loading my daughter in her car seat when the server whom I had not spoke with or made eye contact for sixty minutes came out to our car and asked me what was wrong.  Well where to start?  Horrible service, bad/cold food, having to get our own drinks, etc....Anyways I told her each one of these things and she literally poked me in the chest and told me to leave or else she was going to call the cops.  I told her at that point to go ahead and call the cops.  She then went inside and we left.  Oh and I did offer to pay for the balance I was relieved that someone actually cared but way too late.  Anyways if you want bad/non existent service, bad/moderate food, chasing your own drinks & not having a server ever check on your table while you are dining then this is the place for you"}
{"text":"I was a long-time customer here back when they were on 32nd Street and I wrote a previously glowing review based on those 6 years' worth of experiences. Since they moved to 7th and Thunderbird the food quality is horrible, the portions are small and the service is awful. Last time I was there , there was a ton of gristle in my quesadilla. The tortilla soup that used to have nice giant chunks of avocado had four paper thin slices. I believe the food quality problem is due to their longtime cook quitting. I also don't appreciate the bickering between the owners. They seem to be extremely unhappy with each other and it shows. They are either sniping at each other or complaining about the city taxes. That attitude is backed up by the weird little 'anti-man/male' decorative signs. I wish I could retract my previous recommendation as I do not recommend this place now. I haven't been back in almost 2 years and don't plan on ever going back."}
{"text":"Tried out El Conquistador on a Monday night, first warning sign was that at 6:30pm there was not one person eating dinner in the restaurant.  I was already there so decided to give it a try anyway.  Got a burrito to go, got home and took one bite and had to toss it.  It was not edible.  I would not recommend it."}
{"text":"Stopped in for a business lunch and was pleasantly surprised.  The food was great as well as large portions. **. This place is a hidden gem for mexican food. ***. With the AJ's closed next door now it can be missed. 
- all of my business associates as well as I  were extremely pleased with the food, service, and the price. 

-- salsa is fantastic."}
{"text":"On a Friday night no one there, should have been our first cue. When we sat down it was 10 minutes before anyone acknowledged us, than another 5 minutes to get menu. We left without food because it was looking pretty bad. Unless you have no problem waiting a long time, don't bother!"}
{"text":"Worst service. Confused attendants. Kitchen nightmares type of place. Are other reviewers members of family or paid for."}
{"text":"100% recommended, the music... The food .. Everything... My favorite restaurant in all Arizona, it remind me of my lovely Mexico!!"}
{"text":"This is by far one of the best in Phoenix. Yes, sometimes the service is a little slow, but the food and cleanliness are great.
A few whining reviews seem to be normal for all restaurants."}
{"text":"This was the first time I have been to conquistador. I am torn on my rating and I wish there was a half star option. With that being said I had to choose 3 stars. 

The food was very good and it was freshly made. I ordered the carne asada burrito with beans and rice. I have zero complaints with my order. The steak was tender, burrito was fresh, and the rice and beans were great. 

Our server was an older man who was nice, although it almost seemed like he was trying not to be. Maybe he is the owner and mad that he is working and can't find good help?  

We waited nearly 10 minutes to get water to the table and in az that's just no good. One bowl of chips and salsa arrived at our table 5 minutes after the water. In a Mexican food restaurant if this is promised in the menu please get it to the table.   No water refill and no chip refill. 

Food=good 
Service=could improve

Nice neighborhood place that I hope survives. I will give it another try and hope for more."}
{"text":"I honestly hate giving 2 star.  I feel bad I really do.  This was a strange and unappealing dining experience.   We walked into the resturant on a sat at noon for a quick bite.  Our first impression was that the place was closed despite having a sign that says open.  We glimpsed an older gentleman working at the back and were unsure if he saw us as we were not greeted.  We had to walk to th counter and say hello three times before he acknowledged us and then just responded to my question of \" are u closed ?\" by telling us he previously \"had 2 customers just leave who sat all morning\".  It was a weird feeling to be responded to a clearly hinted question that the greeting was not warm or friendly.  Inside the menu there are several disclosure such as customers only get one bowl with salsa, nosubstitutions for dishes.  The door outside showed a sign of no pets and no use of bathroom except for paying customers.  The in the ladies room there was a sign for a reward for a The person who is stealing candles from the ladies restroom. I honestly felt like a criminal in that restaurant and began to suspect that the service was more intend on treating us like undesirable customers rather than good paying customers.  I started to have a really bad feeling and wanted to leave except my boyfriend was very hungry. I ordered a chimichanga and my tacos the two orders came out and the server who I think is also the owner was confused as to which of ours was what and only brought out only 1 at a time.  The food was bland tasteless canned or frozen. My dining partner complain that he could not chew through the beef in his tacos.I honestly didn't want to eat it. For the price not worth it.  I could of had a better meal and mcdonalds.  Won't be back."}
{"text":"Great chicken & spinach enchiladas with green sauce.  Chicken cheese crisp is the best in town.  Good deal."}
{"text":"Over priced for the lack of flavor.  The chips were very bland, we kept adding salt to the sasa. I had a taco and cheese enchilada w/beans and rice.  Half of the food tasted canned or defrosted. The meat was rubbery and bland, my husband actually made a game out of how long it took him to chew the meat.  I had coffee with bad creamer, got a new coffee still got charged & couldn't drink the second one.  We won't go back."}
{"text":"This is a true mom and pop restaurant. The food here is amazing and the staff be it quirky and feisty are wonderful genuine people. Prepare for a leisurely meal if you are in a hurry kindly mention it up front Or come back when you have more time. 
 Not only is the food wonderful Maria recognizes me warmly every time I come no matter how much time has passsd.. Everything is good but the mole is border line sinful."}
{"text":"The owner seemed a bit out there like he didn't know much about restaurant. The food was good and the owner was nice."}
{"text":"The food is great.  The green chile is my favorite (spicy).  The el conquistador tacos are very good too.  I hear that the Chile Relleno is awesome also. 

I normally don't like mexican food rice however this is the best I've had.  The beans are just OK (nobody beat Rito's beans).

The service is spotty depending on who it is.  Mark normally serves and is a little tight with the chips! (Even though u pay after the first bowl).  Maria, on the other hand, is a fantastic server and quick.

The prices are a bit steep for a family style mexican food restaurant.  I've left there sometimes wondering how the bill was so high.  But the food makes up for it and my family goes there at least once a month!"}
{"text":"As lovers of Mexican cuisine and residents of Phoenix for 40 years, this is the best authentic home-cooked Mexican food we have found in the valley.  The food is light and flavorful and not over seasoned with salt and cheese.  The owner Maria, personally oversees every meal and her warm and witty personality adds to the experience.  The decor is clean and tastefully decorated.  Although the atmosphere is casual, we give this restaurant a five-star rating!   John and Heidi"}
{"text":"There are so many good Mexican restaurants are n Phoenix, but I have to say this is one of the very best!!!! No matter what you order it will be great Mexican food."}
{"text":"Food was tasteless. beer was warm and the service was awful. Very slow food took forever there. there  was one other customer in there"}
{"text":"Food is hands down delicious! Service is slow and sometimes rude. They are bad with answering their phones & bad at realizing there are people in the restaraunt! I the service was better I would give it 5 stars!"}
{"text":"My family went to eat at El Conquistador on Friday 1/23 at about 7p.m.  It took us 10 minutes to even get menus. 10 minutes after that, we still had no water, chips and salsa or place settings and there were many other tables in the same situation.  It looked like the two owners were trying to wait on all of the tables themselves so there was no end to our wait in sight. We ended up walking out never to return which is unfortunate since we are Moon Valley locals and try to patronize nearby businesses first."}
{"text":"This is my fav Mex restaurant outside of Mexico. Maria and Mark are wonderful hosts who always remember my friend and me. Mark's margaritas are the best. Maria is truly a gourmet cook. IMHO, her mole sauce is the best ever (Mexico included). Chicken mole enchiladas are my HG. Don't know how she gets the chicken so tender. 

This is not a chain restaurant. No one is rushing you or pushing you to rack up your tab. It's tucked away on the SW corner next to the closed down AJs, so a little out of the way. But if you're looking for an authentic experience, give them a try."}
{"text":"Ok in my review you will see the use of \"great flavor\" over and over because that was about all that came to mind. 

This is a great mom and pop place where you feel like family. One of the owners talked with our table like he knew us for years even though he just met us. The salsa tastes fresh and flavorful and chips were nice and crisp, very much home made. I ordered the soft taco Carne Asada plate with rice and beans. Rice and beans tasted very authentic with great flavor. Carne Asada wasn't dried out like most places and had a nice flavor as well. 

We'll definitely be back!"}
{"text":"Excellent service, very clean and could be my all time favorite Mexican Food restaurant.  I got an open face quesadilla, \"Cheese Crisp\" with green chili for an appetizer .  The cheese was very good and the chili's were fresh. I highly recommend getting that.  They also serve the best crispy shredded beef tacos I've ever had.  This is not a chain.  This is the real deal."}
{"text":"The food is good but not great. We live in the neighborhood but even so, as other reviewers have commented, the service is so bad we just don't go there anymore.  When we did eat there, we made sure we had cash and kept track of the prices for what we ordered so we could just put cash on the table and leave since we could never get the check - even if there were only a few other customers!  I don't know why the husband and wife owners don't hire ONE server. It seems as if they really don't care which makes me wonder why they even bother.  They could increase their sales many times if they simply rendered average service."}
{"text":"My mom was in town visiting and we were both craving Mexican food. We stumbled on the place by accident, but it was actually very very good.
We seated ourselves in the bar, chips and salsa were delivered to our table in less thank two minutes. Our server was a little busy but we didn't mind, we were busy catching up.
Food was very good! I had chicken fajitas and my mom had some type of enchiladas and we both had a margarita. Ordered a burrito to go for my husband, he demolished the whole thing. 
We will definitely return!"}
{"text":"Wife owner worked very hard. Avoid the crazy husband.  Food was decent. Margie's were weak on the tequila, but good flavor. Carne Asada tacos were good. Chimichamga (chicken) was the best pick. Grilled chunks of well-seasoned chicken in a golden crusty tortilla.  Good salsa (both regular and hot) and guacamole and chips"}
{"text":"Had to stop by Big5 for a sleeping bag and saw El Conquistador on the way out of the parking lot. Figured I'd stop in and have a quick bite and be on my way. 

When I walked in the door the first room was completely empty and there was a woman standing and staring at me. I turned to look at the sign and turned back around. She still said nothing. I asked if they were open and she said what did the sign say? I said it says open (but why the hell are you just staring at me like you are not). She finally says there is a large party coming in and to sit in the other room. I said sure. Both rooms are fairly small. The decor is pretty whack. Old office looking carpet and old booths. I'm a fan of tile in restaurants. Spilled food and drinks just don't come out of carpet and especially old office looking carpet. The tables are covered with that cheap vinyl red sticky covers that also never look or feel clean. The benches were old and had tears in them. There were 3 gentlemen in another booth and other than that the place was empty. 

We were brought menus and drinks fairly quickly but no salsa. Another couple came in and sat down after us and were given chips and salsa immediately. Our waitress came back and asked if were ready to order. Still no chips and salsa. About 15 minutes into our \"quick\" lunch we were finally given a small bowl of chips and a couple of salsa. The salsa was ok. Nothing special. Same for the chips. We placed our orders and in comes out in about another 10-15 minutes. 

I had the El Conquistador burrito. Its a pretty large burro filled with a chile relleno, steak picado, and guac. It was ok. Really nothing good or bad. For 7.50 I expect greatness in a burrito. The wife had a bean and cheese burro w/ enchilada sauce. They were very tight on the sauce and cheese. It was the overall theme of the place. Very tight. For extra chips and salsa it was 1.50 according to the menu. 

The waitress came by another 15-20 minutes later and asked how we were. I said we were ready to go now. She didn't take our plates and she didn't bring our bill. Another 5-10 minutes goes by and I finally get up and walk to the man at the front and ask him if could pay him directly. Our waitress, who's now talking on the phone, with our dirty plates still on our tables and check no where to be found even after I asked for it, makes a statement to the man that I am ready to go. No b, I was ready to go 20 minutes ago when I told you I was done. Now I'm ready for an apron cause I've been here long enough to get paid. 

From the conversations I heard the man and woman own the place. Good for them. I wont be back and don't recommend anyone else going back. I saw a newspaper article on the wall that AZcentral or New Times recommended it as a top 10 Mexican restaurant in town. Maybe it was good before they moved to this location. Maybe they lost some key staff members. Maybe they know something I don't. I doubt it."}
{"text":"Yes, sometimes the service can be slow. If you are in a hurry, I'm sure that there is a taco shop somewhere close to you. If you are looking for THE BEST Mexican Food restaurant in Phoenix, El Conquistador is it. I cannot recommend this place enough to everyone I know. The old location used to be close to my house, but we still drive 15 miles out of our way to come here every week. The food is consistently outstanding. My favorite is the enchiladas verdes con pollo. Delicious!!!"}
{"text":"It was terrible service. And after waiting 20 minutes to be waited on we were told they were out of margaritas on Cinco De Mayo. So my husband ordered a beer and I ordered a water and we waited another 10 minutes for it to come out only to be told they were all out of food! Seriously!! Very disappointed. There were maybe 15 people in the whole restaurant."}
{"text":"Simply the best.  The flavors and consistent quality of Mexican food is simply unmatched in the city of Phoenix."}
{"text":"Prepare to savor each bite when you visit Mark and Maria's - you'll have the opportunity as things move at their own pace here. Nothing wrong with that as the food is amazing. Just learn to work the system and things work out very nicely, ie be prepared to order, go to the counter to pay your bill! Only place in Phoenix I have as a 'must visit' on a weekly basis."}
{"text":"What a little gem of a place in Moon Valley! Food was fantastic and the owner Maria was super sweet. I felt like I was getting a home cooked meal! Love our new neighborhood spot."}
{"text":"YUM!  Absolutely excellent delicious food here!  I'd had plenty of good authentic MX food (plenty of mediocre ones too) but honestly, I just had one of the best MX dishes here! 

Yes while the wait could be a bit longer than usual (only cook and waitress - who are owners) ... the food is well worth the wait!

To start out, the 2 dishes of salsa that accompanied the chips are fresh, homemade and delicious.  Spices added in with the salsa provided a nice aromatic balance of flavor and had a small kick on the spicy one.  Once I tasted the chips and was already very impressed with the salsa, I knew that this was going to be one yummy lunch and I was right!!

I had the taco with guacamole, and my friend had the chimichanga and both were just absolutely delicious.  After having stuffed ourselves with chips and salsa , we looked at the 2 generously portioned plates and thought that there would be no way we can finish the food... boy, but it was soooo good we cleaned our plates!  pig!  lol

The owners were warm and friendly and up kept the place very well.  Interior is nothing fancy fancy but clean,bright and well organized. 

Will DEFINITELY be back!  :)"}
{"text":"The only reason that I can even begin to imagine as to why reviewers say it's nothing special is because a) they were expecting the typical Mexican food. This is Halisco style food - not the same! Think of it as more of a gourmet style Mexican restaurant. And b) they ordered the chicken tacos. Admittedly, they sort of suck. I've been coming here with my family for years! After they moved across town to the new location, we followed.

Ambiance: It's a CUTE restaurant with an old town Mexican theme. Subdued lighting with eccentric and rich coloring.

Service: You are evil spawn if you don't like M&M. They work hard and are the loveliest people ever! They are friendly and remember you if you go there often enough. He looks angry but I swear he's super nice. She's so warm and welcoming and knows my order every time I go in.Thanks.

Food (and none of it is greasy!):
+ Pork chop/cube with green sauce: INCREDIBLE. OMYGOODNESS. They're soft. They're savory. They're moist. They couldn't be better. They make me want to sing my praises from the rooftops of Phoenix.
+ Chicken tacos: Skip them. They are kind of disappointing.
+ Chicken tortilla soup: AMAZING. Seriously. I have yet to find one that's better. It's spicyyy and will clear your sinuses! Mmm.
+ Refried beans: Fantastic. The best I've had, and believe me, I am well versed in Mexican food. If anyone knows beans, it's me.
+ Chips and salsa: The chips are freshly deep fried, so they're wonderful and crunchy. The salsa is great. One is chunky and mildly hot, while the other is super smooth and super hot. Both taste amazing.

And the best of all: their always-spotless utensils, plates, and tables make me endlessly happy. So clean :')"}
{"text":"Food is amazing but service VERY slow. The owners serve and make drinks. So if there's more than 3 tables full,  expect a long wait. Last time I went I called my order in ahead and that helped"}
{"text":"sad to report lose to this area but CLOSED at this location now but expected to be open Wednesday at new location & 7th and Thunderbird"}
{"text":"The food is HUMBLE and features some Jalisco dishes that many people are looking for,such as Bistec, Mole, Menudo, Birra, and Posole. My meal I had recently here was Steak Poblano. The steak was fork tender and covered with fresh tomatoes , Poblanos , & onions .Everything seemed fresh and the place was very clean. They make their own tortillas here daily and Howard Seftel had them on a top ten list according to the menu here.

Meals that I tried so far have been carefully made  and were not greasy. 

Service is usually good, but sometimes it goes European Style. (your order gets taken,food comes out and that's it.....that is how it rolls. It's a Mom and Pop business.

3.5 stars"}
{"text":"Greeted by some of the better chips and salsa in the area and followed up with a  menu of solidly executed classics.  One tip though, Mole is only served on Tuesdays and Weekends They also do some great things with pork and green sauce."}
{"text":"So....You say you want authentico?? My family secret shhhh! This place is owned by a lady named Maria. We have dubbed this place just \"Maria's\" we have been going here for year's!! When the white folk's around me say let's go to Valley Luna I have to school them on what's real food. This food is pure Jalisco and it is what it is! If you want some good home style cookin' in this part of town I would stop in for a bite! You better believe that this place gets busy for dinner so plan accordingly or don't go at peak times for those who don't like crowds. This is a nice little place w a bar and tv's. My sibling's would live here if they could my sister swears by the green chili burro, not for the weak as it brings the heat. I don't eat meat so I get the norm cheese enchiladas, chile relleno, etc all super in my book. I will take pics soon in the meantime here is a recent write up about the place http://www.azcentral.com/ent/dining/articles/2008/03/20/20080320elconquistador.html

P.S. Closed Monday's"}
{"text":"My boyfriend and I visited this place for the first time today. It was fabulous! My boyfriend is a VERY picky eater. Well, he finished everything on his plate. I had the fajitas and I loved it. The owners are wonderful, friendly people. We enjoyed the food and talking to them. I never write reviews but this little hidden gem has great authentic Mexican food! Check it out for yourself. The owners, Mark and Maria, will make you feel right at home."}
{"text":"I was desperately in need of mexican food one day at lunch or else I was going to rip someone's face off... it was just one of those days and luckily I drove by this place.

Definitely 5 stars for Maria, who I gather owns this place, as she was really nice and inviting. I needed to get my food to go, which wasn't a problem and I ordered a carne asade burrito which came with a side of beans and rice - oh I also got a bag of chips and salsa too! That was a plus, especially since I wasn't expecting it.

When I finally got to sit down and eat my food it totally appeased the burrito beast inside me. There was a lot of food and the rice was delicious too. I think I spent around ten bucks...not too bad. Also, just a note - they only accept cards with a $15 minimum so if you plan to spend less than that, bring cash!"}
{"text":"Maria was super nice and inviting. 5 stars for service and ambiance. This place was clean. The rest room was clean. 

The chips and salsa were excellent, hot and chunky salsa. 

Food: I had the two soft taco meal with rice and beans. I mixed the tacos one with Chicken and one with Beef. The beef was carne asada on two small corn shells. Topped with pico. The chicken was chopped into cubes and was \"day old\" at best. It was not fresh. Topped with pico.

The rice was good but I have had better, the beans were ok but really lacked flavor. 

The \"lunch\" was about 10 bucks and I felt cheated. Maybe I am not a Jalisco style fan?"}
{"text":"Very good salsa very friendly staff we go here pretty often would recommend this place to anyone"}
{"text":"Yummy! 

While waiting to get our nails done, my friend and I happened upon El Conquistador...I ordered the Carne Asada ala Tampiquena and horchata. 

The little lady (from previous reviews I'm assuming it must be the lovely Maria) that runs the place is a hoot! The homemade salsa is fabulous, and the flavor of the carne asada is incredible. She is a great cook! The atmosphere is pretty laid back, we were there around 6 or so on a Saturday night and it wasn't very busy...but it should be! Prices are reasonable, the food is delicious...I'm happy we wandered in!"}
{"text":"The Mole is so good I wish you could get it every day of the week!  Their red sauce is another reason to go there, very good!"}
{"text":"If you are sensitive to tobacco smoke, skip this place. It is located in a strip mall right next to a cigar shop. The inside of the restaurant REEKS like smoke. I couldn't stand it, we had to leave. The smell made the food unappetizing because it was so overwhelming."}
{"text":"First time and wanted a taste of authentic Mexican food in the moon valley area! Place is nice and quaint and Maria the owner served us, very nice lady. I had the pork green chile and very tasty with lots of chile! Good thing for the tortilla to cool down my tongue !"}
{"text":"Took a few years break as El Con had moved but I recently found out they moved back closer to where we live and we are BACK!

Like a best friend you've not seen in a long time only to find out they are just as great as they had been, that's what it's like eating at El Conquistador again. The owners even remembered my favorite item on the menu! Maria's guacamole, chili relleno soup, El Con burrito (currently best value in Arizona) and flan all deserve every bit of my wife's and my gratitude. Come Tuesday we hope to return for the Mole - it's amazing. If you are looking for fastfood....this is not the place for that, but if you have the time to relax......go."}
{"text":"I've been coming here for about 2 years now and more recently about every week or two. I introduced my Fiance to this place and he loves it! His favorite thing to order is the Albondiga soup! I have not had one meal that I did not like either. The chips and Salsa is great! They recently had another waitress beside the owners, but to be honest we don't mind waiting for the quality and taste of the food! It is amazing and worth the wait!"}
{"text":"Based on the review on azcentral.com we decided to check out El Conquistador.  We we entered the restaurant it was busy but booths were open.  Once we sat down we must have waited around 15 minutes until we received a menu and ask for our drink orders.  Once we ordered it took around 35 minutes for us to receive our appetizer.  And dinner followed shortly there after.  Not once during dinner did anyone ask us how our meal was or refill our drinks.  We had to eat our entire meal without a beverage.  We tried several times to get someone's attention but were unsuccessful.  We must have waited another 20 minutes to receive our bill.  

Our meal was adequate (chicken fajitas, kids quesa and a gringo combo platter).

The service was  poor and I would not go here if you are in a hurry.   Based on the reviews I expected more.  You would think after the reviews they would hire more help.  

I would not go back or recommend this restaurant to friends or family.

Maybe the owners should read others reviews about service.  It might help them out in the long run."}
{"text":"I'm giving El Conquistador 4 stars for the food but 1.5 stars for the service. I wanted to LOVE this place, I really did -- I know that it is a mom and pop place, and it has a fantastic review already on Yelp and in the AZ Republic. I thought I would be a cooler Phoenician if I could make this my new \"my place.\" 

Perhaps we hit on an off night (just a random Saturday), but our service was horrible. I was taking my neighbor out for dinner, and her comment was that \"we could have died back here and they wouldn't notice.\" We waited at least 5 minutes before anyone came over to give us menus or take a drink order. We alerted them that it was our first time in the establishment and asked for recommendations, which were given but wtih minimal enthusiasm. We tried giving \"the eye\" or \"the nod\" and stopped short only of getting up to refill our own drinks during the meal. 

On the plus side, the food was very good and I have been craving it since my initial visit! I had a combination plate that let me taste a yummy chili relleno, taco and enchilada -- all were fantastic. My neighbor got the special (seafood enchiladas) and raved about hers as well. 

I will definitely visit again, but if the service isn't any better then maybe I'll turn it into my new special \"my takeout place.\""}
{"text":"Absolutely excellent. The kind of mom & pop restaurant that makes me smile. Great chicken/spinach enchiladas, first rate refried beans, okay rice, good, generous frozen margaritas. I'll definitely be back and work down the menu!"}
{"text":"I would give this place 2.5 stars but I will round up to 3.

Very conflicted feelings.

I have gone here a few times when they were located on 32nd and Greenway. Every experience was a little different.

The good-
-Sometimes the service was good. Maybe it depends on their mood. When it was good it was usually the wife who was our server. She kind of reminded me of one my aunts. Warm, slightly teasing, calling us \"bambinos\". 
- I have always liked the food. I have had the chili relleno and enchiladas entrees. Both were a solid 7 out of 10. The beans are very tasty too.

The bad-
- When the service was bad it was usually the husband. Not friendly. Slow. Wouldn't refill our waters and soft drinks. Yet seemed attentive and talkative to other tables. Made us feel like total crap.
- Slightly overpriced.
- Charged for extra chips and salsa.
- My husband didn't like the food.
- Probably my worst experience was when I called at lunchtime to place a to go order. She said they couldn't take the order because they had a huge table of people. Just flat out refused. Guess what I wanted? Just a bean burrito! It takes 30 seconds to make.

I didn't miss them when they moved across town."}
{"text":"I am sure the owners are nice so I hate to write this.  The service is bad.  Only the owners work the floor.   And the food is not good at all. It gets good rating I believe from people that live in the neighborhood.  For the life of me I don't know why they just don't make it order at the counter because the service is so slow."}
{"text":"Came here by chance one weekday evening. Nice casual atmosphere, friendly service. The salsa is hot, the menu is small and concise. 

I ordered the carnitas tacos, my girlfriend had the carne asada tacos. Both orders came out quickly. The rice was especially good. My pork was a little tough but had a really good flavor. Her steak was also tough but had a good flavor as well. 

Not much to complain about. Very reasonable prices, good service. Good food. Not stellar but worth a trip for sure."}
{"text":"Let me frontload by saying that I'm the kind of guy who normally slathers whatever entree he gets with the house salsa.  

This is not that kind of place, and you won't go away thinking that the chips and salsa were the highlight of the meal.  That's because the food here stands on its own without needing to be drenched in a pool of anything.

Mark and Maria are the kind of people you trust as soon as you meet them - they are genuine and caring.  They made me want to be a regular before I tasted anything.

And the food is the best part: in many visits over many years, it has never varied even a little bit in quality or flavor.  I have my favorites that I order pretty much every time:

Bistek Picado Burrito (Green Enchilada Style) - lovely mix of fillings delicious with or without the topping

Red or Green Posole (weekends) - the gold standard of red posole - order it at the holidays and bring your pot

Ceviche (weekends) - no canal shrimp here - fresh Mahi Mahi with the perfect kick

Flan - this is what you always hoped you'd get since you started ordering it years ago - one bite and you'll realize that Maria loves you.

Don't stop with the food - get to know Mark and Maria - they offer something for everybody.  If you like colorful and outgoing, talk to Maria.  If you like droll and funny as hell, talk to Mark.  Great, great people.

P.S.  If you are staying at the Pointe Tapatio, skip the resort restaurants and come a few hundred yards up 7th Street.  Viva Jalisco!"}
{"text":"This is a locally owned mexican restaurant that definitely has some good dishes and salsa.  However in these times I think that you need to excell on each level.  A restaurant can't rely soley on the food.

Located on the northern side of Bell Road in a newer strip mall the outside looks very inviting.  As you walk in the decor is neatly situated and the atmosphere gets you excited for some possible good mexican food.  After your initial look around when walking in a little confusion may settle in. No one will greet you at the door and you wonder if you should wait to be sat or just seat yourself.  With more observation you'll notice a sign far away from the front door saying \"Please seat yourself.\"  

So you look for a clean cozy table and seat yourself, which is not a big deal at all.  Next you have to wait for someone to give you a menu to see what they actually serve.  You would think that menus would arrive very shortly, but I found out that on two occasions it took upwards to five minutes for them to arrive.  I am an understanding person , I can see the place is busy,and I love mexican food so I patiently wait with a smile.

I could go and on about how long it took for my experiences here.  What I found out on two lunch visits that the owners are the servers as well.  No problem at all with this if you are good at what you do and are speedy.  However when each server has over a ten table section and can't get you in and out in a timely manner then it's time to hire some help.  Or maybe change your concept of the restaurant while having customers go to a window and order their food.

I'll remind you that the food is really good, but everything takes forever.  My recommendation is to try takeout."}
{"text":"So deeply saddened to find out via Facebook that Maria passed away today. She will be lovingly missed. God Bless You Maria and Mark"}
{"text":"Hard to review the food here, we never got served! Came in Sunday afternoon, probably 5 tables. We sat down ourselves, as the sign said, however we sat there for a good 10mins. No one came to our table, no greeted us, nothing. There was a woman and an old man walking around aimlessly, I assumed owners?!? 

We just moved to this neighborhood and we were hoping to find a good Mexican place. But no luck with this place. We walked out after waiting and waiting! 

I'll drive to La Piñata over this place any day!!! Go try them at 7th Ave and Missouri, great attentive service! And the food is outta this world. The atmosphere is so much more too. Lo siento El a conquistador!"}
{"text":"Blah."}
{"text":"I give the ambience of this restaurant more like 3-stars.  Our waiter was I believe the co-owner of the restaurant.  This place is definitely a \"mom-pop\" restaurant.  The owners were both very much there and very friendly.  I was very impressed with the food.  I had the shredded beef tacos with rice/beans.  The rice tasted like the rice my mother-in-law makes so definitely a family recipe.  The beef was excellent.   My husband had the carne asada and though the quality was excellent.  The margarita wasn't so great--too sweet but overall, a place I'd go back to."}
{"text":"It was ok...literally took 30 min to get chips/salsa/water after I had initially been seated...they were way understaffed and when my food came out it was just the average/typical Mexican food you can get anywhere in Phoenix.  However, the chips and salsa were delicious and it has a cute atmosphere."}
{"text":"I'm originally from Indiana, and so I'm a gringo transplant. That means my tolerance for spice tends to be a bit on the lower side. El Conquistador's food was spicy, but it was so delicious I couldn't stop eating.

I'm not certain what food some of the reviewers were eating, as it was very obvious to me that nearly EVERYTHING we were served was freshly prepared and made in-store.

There were four of us in our party. I ordered the carne asada ala tampiquen, which came with a cheese enchilada (I got the green sauce), cebollitas, rice, and beans; roommate 1 (a New Mexican native) got the pork chile verde, while roommate 2 and roommate 3 got a carnitas burrito enchilada-style with red sauce.

Before getting into the food, I'll point out the reason why I'm giving a 4 instead of a 5: The service. Now, the older gentleman to whom other reviewers refer was there, as was his wife (I'm assuming they're the owners), and they were both very friendly, but refills on our iced tea were a bit slow. I can't mark them down more than a star for that, though.

On to the food! Chips and salsa are standard Mexican restaurant fare. El Conquistador only does one bowl per couple per table complimentary, and I'm fine with that. The two salsas provided were both very fresca; I loved the fact that the chunkier salsa used Mexican oregano rather than cilantro, as it gave it a very rich taste. The other salsa was good but different - it almost tasted perhaps like it had a bit of bitter chocolate in it, which wouldn't surprise me given the region.

My steak tampiqueña was perfectly-cooked and seasoned, and paired nicely with charred green onion on the hot flour tortillas provided. The guacamole on the side was very obviously fresh (you could smell the avocado, and it had a nice amount of lime juice - something I prefer in my guacamole). The cheese enchilada was velvety and delicious, and the green sauce on it had so much flavor to go along with the heat that even these gringo couldn't stop eating it. The rice also had a good flavor, and the beans had a nice texture and a fresh taste.

I did get to try a bite of the pork chile verde, and it was succulent and spicy - seemed obvious that it had probably been cooking away for several hours, it was so tender. 

I did not try the carnitas burro but I did try the red sauce. I'm not generally a huge fan of red sauce, because to me it often seems like the cooks try to cover up a bad base sauce with too much chipotle and\or heat. But this red sauce was amazing - it had a delicious fresh tomato-y tang to it and just the right amount of spice.

I'm glad that I decided to check Yelp and give this place a try, because I think it's now my new favorite Mexican restaurant in the neighborhood."}
{"text":"So glad they are back in the neighborhood. Maria has everything fresh - cleanest place in town you could eat in the restrooms - Best Tortillia Soup ever - Food is cooked to order so do not expect it when you walk in the door this is no Tacco-Bell"}
{"text":"Food was good, but $24 for lunch is a bit steep.  One burrito al a carte and a lunch special plus a beer and a soda..  

Service was great.  I'll go back and try something else around dinner time.."}
{"text":"This place is a gem that I don't think many people know about.  My dad and I have never been disappointed by the food which is always fresh and authentic.   The salsa is homemade and delicious.   It is family owned by a nice couple who always make us feel welcome.   Give it a try!"}
{"text":"This place is wonderful. They would have gotten five stars but the salsa was not too wonderful. The owners are super friendly though and the dinner was great. Had chile rellenos the first time and a vegetarian burrito the second. The burrito was gigantic!"}
{"text":"I read an article from one of the local tv stations, the owner was going to have to close to take care of their husband who has Alzheimer's. The owner had won rewards for their food in the past. To me, this seemed to be a good restaurant to go to show support and taste some good food. 
The first chips and salsa are free with your meal and any other chips or salsa you are charged for. The meal was typical Mexican food.Nothing special. We are still glad we went t support the family."}
{"text":"This place is awesome! The salsa is very fresh and delicious with a kick. The food is the same. I had the chicken enchiladas and they are amazing. Do not come here in a hurry to eat and go, it is laid back so come relax and enjoy. I did!"}
{"text":"Going to have to knock this place down a peg for the bad service.  What most reviewers are saying is true; great food but slow and inconsistent service.

Maria is a doll but seems easily distracted. Her husband is surly and an incompetent bartender.  On two separate visits my wife and sister in-law ordered margaritas, in both instances the husband (not friendly enough to clue you in on his name) \"forgot\" to put the tequila in the drinks. In my four visits he seemed to hate being there."}
