{"text":"The first location on 18th Ave and Van Buren is still open which is awesome for the fact that both locations offer excellent food. The new location has expanded its menu to fried food, seafood options, bar food and a superior dining area. 

The weekends will be a great addition to downtown Phoenix with Live Music, Dj's and affordable drinks.

This is not a Taqueria, it's an Authentic Style Mexican Cuisine Restaurante and that's what separates itself among many who offer traditional Mexican Food.

Tell them David sent you, also CHECK IN and you'll receive a FREE fountain beverage! :)"}
{"text":"El chino the michelada's are so good and place is nice .. the food is good ;) I did hope they had dessert but not this time :( 
Other than that it's cool place to be and good music"}
{"text":"So first let me say I was very excited to try this restaurant. Went on a Tuesday around noon. Food was okay. If our service would not of been so slow. Probably would of helped my review. I mean our appetizer came last. Then here is the kicker. I ordered a Caldo design rez to go. Took so long to get that to go. Lynn the manager graciously apologized. But I get all the way home. The Caldo had no meat. No meat. So I paid 8 dollars for vegetables. That really just completed my unhappiness of this new restaurant. I did call to complain and Ralph the owner did offer me free lunch next time. But I think next time I will wait for Comedor Guadalajara to be open. Sorry chino I hope the nite club part of the business is better."}
{"text":"It a great place but needs fans. It's too damn hot in here. Could have more drink selection"}
{"text":"Great food! Great service! I see hard working Gente! Always a good time! If your hungry for good food this is the place to go! Nothing positive things to say with one exception! Tonight I saw a young lady, a bartender girl I've never seen there before, belittle a guest for not tipping! Sadly the womens leaves but the crowd of people who sat around her never received service because the bartender was mad one person didn't tip! I sat there for over 20 min with no service! I will absolutely being going back as long as that snotty rude blue eyed devil isn't serving! I wouldn't take a drink from her if I was on my death bed and needed a beer to survive!! Chinos is the place to be for positive people who appreciate a hard working and well deserved restaurant!"}
{"text":"Great menu with many delicious entree's to choose from. Best Carne Asada in town! Friendly owners and staff that make dinning at the restaurant a great experience! Highly recommend."}
{"text":"Couldn't wait to eat here. Went here over the weekend around 10:30am and wasn't impressed. They mentioned they had been open since 9am but they were still setting up tables and some lights were still not on. We ordered the street tacos. The carne asada was dry and the tortillas were a bit hard. The chips and salsa....the chips were a bit stale but the salsa was ok. We also ordered menudo which was bland. The rice was also bland. The waitress was very friendly and attentive but looked like she had just rolled out of bed. Just wasn't what I expected. Not sure if I'm giving it a second chance. I was disappointed."}
{"text":"Maybe I came at the wrong time when the place just opened, we came at around 1:00 pm in the afternoon, for the price the food in my opinion was not very good, rice tasted like tomato sauce, beans straight out of a can with lots of cheese, and green chile was full of fatty beef and had absolutely no heat or flavor, I don't know maybe I'll try it when they got their top cooks in line, but the food I ate was terrible"}
{"text":"El Chino was horrible! We went on a Friday night and had a green burrito; which was delicious and craved it... so went back and either we were in a dream or the cooks changed or who knows... it was horrible and tasted like canned meat, it was dry with no flavor. The red burrito was flourie and sweet. Don't waste your money. This isn't meant to be rude but as expensive as things are in these days, we try to spend money wisely... There's other places to try"}
{"text":"Grubbing at my favorite place to eat gorditas and drink margaritas. I love that they have live music and it's family run, locally! So good. Ask for James the bartender- best drinks!"}
{"text":"I don't usually do reviews, however this really needed to be done. Just opened and the bartender is horrible, acts like he's never bartended in his life!! So slow and incoherent!! He did not know any of the ingredients, my food came out completely cold, I wasn't offered anything to drink. I was priced $4 for guacamole. No one else was in the restaurant and we waited 30 minutes for a to go order that was sooooo simple. I asked for no pico in my burrito and he failed to mention that the guacamole had pico in it. What if I had an allergy to it and it was never specified that the guacamole had pico in it!! Save your money and your time!! The female host was the only thing in there acceptable and caring!"}
{"text":"if i could rate this place a ZERO i would. so we called and made a reservation for 4 people before we were even seated the 2 men working the host were very confused and started to aggressively explain to us how a reservation works like we were children and proceeded to call my girlfriend sweetheart i'm sorry but that's very rude and creepy of them to do the man was wearing a fedora hat Avoid talking to this man and because of this incident i will never try there food and will never return to this location."}
{"text":"Excellent spot with good margaritas, excellent table side guacamole and cool vibe. Tacos are great but have had a couple mediocre entrees as well. Definitely recommend."}
{"text":"El Chino Restaurante Y Cantina will become your new favorite Mexican food restaurant! Not only is the food amazing, the service you receive is just the same. The restaurant offers two sides to choose from. If you sit near the kitchen, you can see everything being freshly prepared by some passionate chefs. There are options on where to sit, there's the restaurant side, the cantina/bar side or a patio on either side. Wherever you choose to sit, you'll love. The entire restaurant is family friendly and perfect for meetings, birthdays, breakfast, lunch, brunch. dinner, you name it! Once you walk in, you'll be surprised! Try it for yourself ASAP!"}
{"text":"This spot has a lot of potential. The parking lot is packed. Has really good music. Only thing I would recommend is at a certain time move the long tables on the dance floor, so people can dance. Food looks great but I didn't come to eat. More beer selection would be nice hint Blue Moon. Excited to come back to hopefully give you 5 stars."}
{"text":"I had a great time. Food was decent and the drinks was good. However, I enjoyed the music the most it was a good mixture. I will definitely be returning. I work right down the street."}
{"text":"Best place in Downtown Phoenix ! Full bar & awesome employees! Carne Asada tacos are to die for! Owners & managers are super nice and very understanding! You'll always be satisfied when you walk in!"}
{"text":"Amazing food! Be sure to try the beef enchiladas and don't miss out on the rice and beans. The Cadillac margarita did not disappoint. Nice family, delicious food, and our new go to place for Mexican food."}
{"text":"1 star not even deserved..  horrible customer service from the bartenders, horrible service from busser over all a horrible experience. I shouldn't have to pay money to be treated like dort.. Worst experience ever! dissatisfied customer! Will never step foot in the place again!  What a waste."}
{"text":"OMG!!!
I freaking Luv this Place, stop in for Happy Hour after work... now I'm in Love...Prices are Unbelievable(in a Good way)..Great Atmosphere, Good Music,The Owner is Welcoming:)..Good Food...Last but not Least..Bathrooms are Clean"}
{"text":"Took my parents tonight for their anniversary. They were excited to try something new. We got sat at a table right away. There was a party with kids running, LITERALLY running around. Silly spray being sprayed near and on food prep area.After 15 mins passed I had to find a worker just to get menus. 20 more mins pass and no waitress so I got a scrap paper and wrote my family's orders including drinks found another worker and gave it to him. Food came and not all of it arrived at the same time some not at all. Parents were nearly done before I asked for my soup to go cause I hadn't even received it and its on the menu as the soup offered daily. The #7 states 2 chili rillenos rice ans beans, my brothers only got 1...waitress said management told her you only get 1 if its bigger 1...lol who decides what's bigger and where does that state on the menu you get 1 unless??? Funniest thing I've heard in a while. My brother paid and I left before, but was informed the meals were free...100% appreciated.I understand resteraunts get busy but, that does not excuse the TERRIBLE service. I regret taking my parents here,would have been happier at Chipotle"}
{"text":"We came in for a \"late\" lunch take out order a little before noon. The place looked pretty dead and no one really greeted us. We were finally approached and offered a menu to look at. My parents had been to the other location and heard about their lengua burriotos. We were sad to find that they didn't serve them at this location. 

Our order was taken and we sat down to wait. The guy in the kitchen worked hard and got our order done. There wasn't really anyone in front of us. He rang the bell to signal our order was done and no one went to get it. He probably rang it about 4 times over the course of 5-10 mins to try to get our food bagged. The girl finally came to package it up and then we had to wait for our check........... Which took about another 5 mins. 

My green chili burrito was pretty tasty. A bit on the salty side, but the tortilla was good. And it was a good sizes burrito. 

Overall, I honestly wouldn't choose to come back because of the service, or at least I know what to expect if I come again and not be in a rush to leave. I still do want to try the other location!"}
{"text":"Decided to try the restaurant today for lunch. There were only about three other parties there at the restaurant when we went for lunch. We ordered our food and mine was brought out and then the waitress said that it would take a little bit longer for the other order to come out. She said something about some food just coming in and it wasn't in their computer yet and she did not realize that when she put the order in. She said she had to walk in the back and  give the kitchen the other order. It took about 5 to 10 minutes before the other order was brought out and I was just about finished with my meal. We ordered a Coca-Cola and that seemed to be watered down. When they brought the chips and salsa out they were very skimpy on the salsa. I think picante salsa had more flavor than their salsa. I was not very impressed on the food so I don't think I will be going back. I also feel their prices were too high the sodas were $2.50 each."}
{"text":"I know this place is new, but...... for being new and trying to build a client base in a new established Hispanic  neighbor.  The service wasn't the greatest. I will try this place again now that they are finally kicking up. Post review to come"}
{"text":"Well what do you call someone who keep doing the same thing and getting the same result...You got an insane person.  As the previous reviews mentioned this place is horrible oh all caps. HORRIBLE.  We went expecting breakfast and the waitress even confirmed they had breakfast but then sadly said no.  For enchalida and two soft chicken tacos we waited an hour for our food.  So you decide"}
{"text":"There is nothing like their taqueria, but this is the next best thing. Best Carne Asada in Phoenix!  Nothing else compares. Their hot salsa is amazing as well."}
{"text":"Very friendly waitress, we came in hungry around 11am Sunday and anything with eggs was scratched from the menu. It seemed like they were setting up for the day but had been on for a couple of hours. There was only one other table,we waited a little long for soda and tea with no napkins at the table and no towels in the men's room. I ordered the red Chile burrito and it was very very very good,torilla was perfect and a good sized burrito. Guacamole and salsa was spot on. My partners green chili burrito didn't have very much flavor and a lot of fat,she didn't like the rice too much but beans were ok and tortilla Excellent. We'll try them again after they get it together on the menu and staff."}
{"text":"New favorite bar with grown ups - no youth's.. The live music Saturday and Friday is amazing. I don't love the oldies music so much but the cumbias and hip hop I loved to dance to. Only had drinks which were priced nicely- kitchen closed at 10 but they have street tacos that were delicios. Loved it will go back for sure."}
