{"text":"I steamed up the tamales yesterday and they were great, a mix of chicken and beef tamales.

When I was a little kid I got tamales from a truck at the beach and I loved them. I thought that was how tamales were, factory made tubes of really yellow corn meal with consistently round tubes of ground beef in the middle. The tamales at El Charro are the definitely handmade variety, and could not be more authentic or better. Shredded chicken or shredded beef perfectly seasoned.

Go in and order a dozen for pickup in a couple of days, or maybe some will be available right then. Steam them up for a couple of hours and you will be very happy."}
{"text":"In Champaign-Urbana, this is THE best Mexican taqueria (maybe the only one?).  I had a killer craving for chorizo and eggs one morning to cure a hangover.  Not only was the chorizo perfectly cooked with the eggs, but it came with delicious beans, rice and a very generous helping of tortillas to eat it with.  I also bought some candy and a strawberry Boing! drink and the total was only $7.50.  Very reasonably priced and worth every bite!  Breakfast this great tasting would cost a lot more anywhere else.  

Everything tasted delicious, and I am excited to try their pozole (a hominy soup) and tamales, which the (really nice) guy working said was all homemade in the shop.

BOYCOTT CHIPOTLE AND QDOBA!  Go to El Charro and eat real Mexican food."}
{"text":"The outside of the building and the interior is disconcerting, so the first time I came in with a friend, I didn't expect a whole lot.  

Then I ordered steak, chorizo and chicken tacos and what I found was fresh ingredients and some really authentic, tasty Mexican food.  The meat is always cooked to order, and the lettuce is always green, tomatoes fresh and corn tortillas are delicious.  All the tacos come with a slice of lime and adds a lot to the flavor.  Sometimes if its not busy, they'll add in some fried green onions.The guy that is always working there taking orders is always friendly and recognizes me from coming in before and even offered some free nachos and homemade salsa my second time coming in since I had been there the day before.

I've only tried the assorted tacos there, but their 1 dollar taco deal every Wednesday makes it worth checking it out.  Plus, if you are a HUGE fan of Valentina hot sauce as I am (check it out!) a similar bottle from one at Schnucks selling at about 3-4 dollars, sells here for 99 cents.  There's some generic grocery items on the shelves, and a huge fridge that has Coke bottled in Mexico (has real sugar and tastes better), assorted Jarritos and other drinks.

My only gripe about the place was the overall dirty feel of where people eat.  I gave it a 3/5 because the tables are dirty, garbage was almost full and haven't been cleaned.  They're pretty understaffed, so there is a wait time for wanting to pay, and probably why the tables look like they're never cleaned.  However, the cooking area and food storage is easily visible when you come in, and you can tell that, thankfully, it is sanitary and clean."}
{"text":"Tried this place the first week in C-U. After having read the reviews, I was expecting more. The woman at  the counter was friendly, but the food was disappointing. Ordered enchiladas verdes (chicken) - not the best, not the worst... but the place was so dirty, I couldn't finish my meal. The floors were so greasy/dirty you could slide to the table...the tables hadn't been wiped in who knows how long, and the garbage was overflowing (and we were the only ones there at the moment). There were flies all over the place. The produce looked so sad and wilted. The canned goods should be the same as anywhere else, but it doesn't seem like it's much better stocked than the Meijer or World Harvest for what I typically buy. I'd prefer to go to Chicago for canned goods, tortillas, masa, etc. (Tortillas and masa keep very well in the freezer) or if in a pinch, buy some from a restaurant that gets its goods from Chicago.

Bottom line- the food isn't anything remarkable and the lack of cleanliness is disconcerting."}
{"text":"Very, very nice owner.  Proper tacos.  Best place in town for lengua tacos.  I'm a regular.  I like Maize, too, but I prefer El Charro."}
{"text":"Ate here for the second & last time a few days ago.  My wife & I both had 'Mexi-belly' the next day.  I think it may have been the hot sauce bottles which are kept in an upright fridge.  Customers help themselves, the containers are then replaced for the next customer & I don't think they're ever sterilized.  I noticed that my container felt oily.  There's a great deal of finger licking with this sort of food & this an excellent way to spread bacteria.  Shame 'cus I liked the place.  I hope he reads this & rectifies the problem."}
{"text":"No frills, but that's not what you go here for. Great tamales, the cueritos de cerdo tostada rocks, and the tacos are good, too. The owner is as friendly as they come."}
{"text":"I have been to this place a few times since moving to Champaign, and it has yet to disappoint. Their steak tacos are savory and the salsa tastes like the one my grandmother makes in Mexico. Their horchata is also delicious, and a regular craving for me on a hot summer day. Every time I have been to this establishment, there is always a place to sit and I am comfortable while I eat. Highly recommend this place!"}
{"text":"After living in Arizona and California I finally found some great tasting authentic Mexican food in Toronto."}
{"text":"I like this store because they sell some mexican groceries and also have mexican food ready-to-order. The staff was helpful. I give this store an A for effort, however I wish they carried more of a selection of Mexican brand items."}
{"text":"Mango Con Chile

The sweetness of the mango contrast deliciously with light sprinkle of salt and the  chili sauce. 

$4.25"}
{"text":"Slowest service I've ever had. Not crowded (total of 3 tables--1 with only 1 person) but still took over 30 minutes to get our lunch delivered. Waitress also did not know anything about menu items."}
{"text":"NOM NOM NOM NOM NOM

this is what happened to the tamales I bought from El Charro. 

I would give 5 stars for the food deliciousness level, but i would give 3 stars for the wait.  I called in advance to carry out and I still had to wait 15 min just to pay."}
{"text":"The cook and waiters are nice. The prices are good. Every time I eat here I order carne asada tacos & chips and salsa. They're understaffed though."}
{"text":"All costumers waited more than an hour for their food. The waitress didn't even took our order and was hiding behind the bar after we asked her. We just paid our drink and went out.
As we were paying we told the cashier about the bad service and she just said \"I know\" and \"Sorry\""}
{"text":"Came here for the first time last week for a hooked deal (2 tacos + rice/beans for $5) and was pleasantly surprised by the tacos. The tortillas are delicious but when I asked where they get it from, the waitress said she did not know and walked away. 

Pros: 
1. Tortillas/tacos are delicious! 4/5 
2. Salsa and chips are really good.. on the spicy side. 4/5 
3. $1 taco Wednesdays 
4. Sauces that come with the tacos. 
5. Reminds me of King Taco in Los Angeles. 

Cons: 
1. The ground beef tasted a bit off last time I was here. 
2. Chicken was dry and adding salsa did not help. 
3. Service can be slow. First time my friend and I went, we were the only ones there and was still slow. Takes some time getting things such as water, straw, fork, etc. Or maybe I'm just a needy customer.  
4. Ambiance/music - an ant was crawling on me while eating. Mexican music can get loud."}
{"text":"This little taqueria reminds me of the ones back in chicago. A hole in the wall but the food definitely makes up for it. I recommend the lengua with their homemade hot sauce. I've kept for a secret long enough. I always get the tacos with a jarrito."}
{"text":"Amazing food!!! My husband and I tried this place last week and this is our third time coming here. Super tasty food and very filling portions. Definitely the best value for your buck. 
I tried the tortas and it was like a burrito - lots of wonderdul ingredients but much more traditional than a burrito. Will definitely be coming back soon for more!"}
{"text":"Holy smokes the food here is Sooo good. So authentic has so much flavor. Like literally you can taste that the tortillas are not store bought. They have a great range of items to choose from. I have been 2x and was never disappointed."}
{"text":"This place doesn't even resemble any of its photos on yelp. The restaurant was dirty and greasy. There were dirty pots and pans everywhere. I regrettably ordered quesadillas, thinking that it would be quick and easy. They weren't quick and weren't enjoyable. I would not recommend this restaurant."}
{"text":"They made really good food, had fast and friendly service and gave us free tequila shots. Needless to say it is a fantastic place."}
{"text":"The owner of this place is really friendly and he makes an effort to get to know his customers. The employees are definitely juggling a lot of tasks at once, which makes them not be able to provide the best customer service. This business had grown a lot in the past three years but because of that, they resort to skimping out on food in tacos. The food is really good and based off of the taste of food I would recommend coming here but don't expect the three tables to be clean. I would also recommend coming here during the weekends because their specialty food is good. If you want a authentic food this is definitely the place to try."}
{"text":"The shrimp, seafood really, taco was very good. 

Met an Indian family from Brampton that were there due to a Facebook post, for the sole reason of getting some fancy mango, that was carved into a flower and dressed with spices ... it looked really good."}
{"text":"Great authentic Mexican, a new go-to in the neighbourhood. The various salsas are all delicious and interesting, and a great appetizer with chips while you wait for your food. This reminds me of when I lived in Southern California, would recommend!"}
{"text":"Amazing food! The most authentic Mexican food I found in Illinois! Sure it's not fancy pancy, but their food and friendly service is the best. The salsas are great with their tacos."}
{"text":"Glad I stopped in on my way to visit friends in the area. This little Mexican eatery serves up popular street foods (tacos, burritos, quecas, huaraches, pambazos).  I thought it was going to be one of those Mexican fusion places hyped up by hipsters like...(cough), Seven Lives, but no it's definitely authentic, run by a young Mexican couple.  The place is sparsely decorated with little sombreros, flags & lucha libre masks.  The owner tells me they pick up a new mask each time they go home to Mexico.

I tried their carne asada huaraches which is a flat bread topped with seasoned grilled beef, refried beans, onions, cilantro, tomatoes & a wedge of lime.  Very tasty but oily & messy. Definitely use a fork & knife for this and don't forget to add their homemade hot sauces for that extra kick.  The huaraches was more of a snack and not for someone looking for a big meal. The owner also points out tacos are only $3 every Tuesday. Be back soon El Charro for Taco Tuesdays."}
{"text":"Along with the container market 707 nearby on Dundas, El Gordo's collection of street food vendors in Kensington always makes me salivate just thinking about it. And if you see people walking around with El Charro's signature Mango Rose treats on a stick, you won't be far from this little piece of heaven in the city. I'm not sure if they have the Salvadoran version of pupusa or the Mexican gordita, but this is Toronto so call it whatever you want. Be sure to drop by El Charro when in the area, or look for the churros banner on pedestrian Sundays."}
{"text":"I have to say, when I first came to Champaign-Urbana, I heard about many different restaurants from different people, but none of them were Mexican. As much as I like it, Chipotle doesn't count. I have eaten lots of somewhat authentic Mexican food in my life time, but I honestly never expected to find a place like this!

It's a pretty easy place to miss. It's a tiny brick building that says \"Mexican Grocery Store\", and the interior is certainly isn't going to win any awards for cleanliness. But I wasn't fooled, I could tell right away that this place was going to serve me true authentic mexican cuisine.

The menu above the counter might be hard to read, but they had a very nice selection of meats to choose from for their tacos. I tried Carnitas, Shredded Beef, and Chorizo tacos. All of them were quite delicious!

But the food wasn't the only impressive part about this establishment. When my friends and I went, it was manned by just one person, and he was extremely friendly to boot. He really deserves a medal for the effort."}
{"text":"Yes.

Gracias a dios que hay una restaurante semiautentico en Champaign!

I wasn't disappointed by my delicious Milanesa torta, and the staff was friendly and helpful, they didn't mind our loudness, and they had real Mexican coke.

Only offering Manzana Lift would make things better.  Plenty of spice staples are available, and you can even get a nice selection of nopales (cactus), if you're so inclined.

Great place, one I'll be visiting quite often."}
{"text":"El Charro has changed a lot in the last few years! The grocery part of the store is gone, though you can still ask Alejandro for items such as chorizo or Mexican Coke. In place of the shelves are more tables and even booths; there are new murals on the walls and what looks to be shaping up into a bar in front. There are now laminated menus at each table, and both sit-down and to-go orders will get you chips and fresh salsa while you wait for your meal. Alejandro continues to be super friendly, and there are always specials you can ask about that are unlisted. Still my favorite place in town for a taco!"}
{"text":"Definitely the most authentic tacos I've ever had in Toronto. Corn tortillas... 5 kinds of salsa (including habanero!)... mouth watering steak tacos...

Had their lunch special once too, a Mexican style sandwich that I can't remember the name of, totally convinced me to try something other than tacos and burritos once in a while. 

Go here!"}
{"text":"This place is great. The food is awesome, the atmosphere is wonderful and the people are so nice. It is a little weird coming in at first, as they seem understaffed and a little dirty at times. Also the food is cheap!! I highly recommend El Charro, steak tacos are great."}
{"text":"I really love this place. The food is simple and packed with good ingredients. I've been pleasantly surprised at how tasty everything is. My fiancé ordered the cactus and mushroom huaraches and I ordered the chicken tosta; both of which exceeded expectations. 

The food is obviously cooked with care; it's not greasy or quickly thrown together. The chicken is reaaaally good and not at all like the tasteless pieces of meat you get at other places

We've had our fair share of Mexican in the city and in terms of taste, you really can't beat this little place. 

Go for the food...go for the service...just GO!!"}
{"text":"Once a grocery that served food, now a restaurant that still has some grocery items. There is a good reason that the restaurant portion of the place has been growing ever since they've opened. It is good, simple Mexican food. The menu is basic but everything is freshly made and everything we've tried has been very good. We often get takeout tacos de lengua on dollar taco Wednesdays. The owner and chef are run ragged on Wednesdays as this is right in an area full of student apartments, but the quality is always good. 

We've also tried their burritos over time, and the ones we've had (vegetarian, tongue, and al pastor) have all been large and tasty. They make their own tortillas and you can tell. They are always soft and fresh. My personal favorite, however, is the pozole. Personally, I think it is among the best in town.

The restaurant itself looks to be a hole in the wall, which I think hurts its business a bit. Plus, it is across the street from El Maize, one of the gourmet Mexican places.  But, El Charro is as good as El Maize for any of the usual suspects-- tacos, burritos, hurraches, gorditas, birria, etc. Plus, they have the advantages of lots of tables, they have parking, and the wait is fairly short. Almost anything is made with your choice of meats: carnitas, tripas, chorizo, lengua, pollo, bistec, or barbacoa (and maybe one or two other options), so you can see that this is definitely not competing with Taco Bell. This place is good.

You usually get chips and salsa even in take out orders. If you eat there the chips come quickly and have always been hot and fresh: lightly salted and not too greasy, The salsa is always \"mild\" although it is freshly made in house and \"mild\" can have some variance. There is a choice of hot sauces on the table if the salsa is too mild, and I have a hunch you can ask for something spicier. If you order queso with the chips they ask how hot you want it; after all, everything is custom cooked here. 

All in all we like El Charro a lot. Authentic and tasty, but with a sub-par location and across the street from one of the hottest Mexican places (not to mention, Fiesta Cafe is just a block away), El Charro often gets overlooked. But with easy parking (behind the building, so you have to look for it), great food, and very pleasant owner and staff (who are happy to chat if they aren't busy), we like it a lot. I don't think it's reputation will improve unless there is a serious upgrade to the appearance of the exterior, with its cheap paint job, hand painted sign, and largely unadorned windows. But, some of the best Mexican food I've ever had has been in \"dives,\" many worse appearing than this (I remember one place in LA that had dirt floors and merely whitewashed walls, but great food). 

It is family owned and operated, and they are always there and usually working hard."}
{"text":"Over the weekend we ordered takeout from El Charro and had a good experience. I ordered the beef and cactus/mushroom soft tortillas. I made sure they were made both gluten and lactose free and I thought they were good for the low price. I didn't find them as flavourful as other tacos I have had but it is worth the price sort of speak. 

All over, everyone thought their food was good but none of us thought it was exceptional. 

If I'm ever in need of cheap tacos, I definitely know where to go."}
{"text":"Yes they have Burritos but I think the best part about El Charro are the more traditional Mexican dishes like Tortas, Pambazo and Huaraches. I got the Torta Charro which combined all the other Tortas into one. This sandwich like dish had all kinds of flavour between the buns - breaded chicken, beef, fried beans, guacamole and savory pineapple pieces to top it all off. Definitely coming here again."}
{"text":"Always willing to check out a Mexican food place that offers something approaching authentic. Thee place is a hole in the wall, but don't let that deter you from entering. The food is the draw, and what food! I loved the Huarache (I had the carne asada) - it had tons of meat, and plenty of flavor. They also line up thee sauces for you and offer tortillas so you can taste the sauce before you take the plunge - very thoughtful!
Yeah, this is Mexican street food, but two things: it's at street food prices and it's damn good!
Looking forward to return visit!"}
{"text":"I highly recommend this place, to me this is the very best Mexican food in Toronto. Absolutely delicious food, reasonable prices, served with a smile. What more can you ask for!"}
{"text":"El Charro is a little Mexican grocery and restaurant that makes up for lack of ambiance in flavor. The restaurant itself has authentic and cheap Mexican fast food- delicious tacos with succulent meat on tender tortillas with cilantro, giant burritos, and other delights like spicy tamales on the weekends. 

The grocery has staples like plain old salt mixed in with Mexican imports. The produce sections has avocados for all your guacamole-making needs. There are also lots of Mexican sauces, candy, pastries, and other snacks. Not too many people seem to know how much better this place is than other local competitors, so check it out."}
{"text":"Best shrimp tacos I've ever had. I loved the ambience. Such a good Mexican variety from sweets to salty."}
{"text":"Mexican is my favorite cuisine and I have tried most restaurant in town. This place is one of the good ones. They don't serve the typical Mexican restaurant food. Their prices are good and quantity is decent. However, not a place to take your date, it's a very tiny place, seats like 10 people."}
{"text":"Alejandro made me the most incredible huaracha (mexican flatbread topped with the goods...means sandal in Spanish)  The onions and cilantro were fresh as always.  Must get the carnitas on the weekends.   The only other place I saw huaraches was at Rick Bayless's Frontera fast food place at Macy's on State St.  Rick Bayless ain't got shit on Alejandro.   

He recommended all these fantastic Mexican places for me in Chicago.

As always if you are curious as to how carnitas tastes or the awesome tongue or pastor, he's usually very helpful with samples.  Treat him right and he'll take really good care of you.

The guac was the best I've ever had.  Even better than my own.  His ingredients are much fresher than what I can get...no fair.  Tons of yummy cilantro.

Best place on campus hands down.

I miss this place so much; one of the few things about school I miss."}
{"text":"i haven't tried every mexican place in champaign but i'm just going to go out on a limb and assume el charro is the best out there.  it reminded me of chano's back home in los angeles, good solid taqueria food that isn't culinary brilliance but is most definitely authentic and delicious.  the milanese torta was awesome - it was perfect proportioned and neatly put together which is a must when it comes any type of sandwich for me.  the tamales are smallish but yummy.  i was also very very excited to see la lechera (the best way to top berries, hands down) and all the different flavors of jarritos! yay for el charro for giving me a reason not to miss home as much as i potentially could have!"}
{"text":"VERY underrated place! Just driving by or walking past it looks like kinda dumpy or not so inviting if you will. Saw a deal on hooked for 95 cent tacos so I thought I'd give it a shot. Got 2 chicken tacos.... AMAZING! The chips and salsa that was brought out was also phenomenal! Sure, maize is good but this place stands right next to it and holds its own!"}
{"text":"I had a chicken burrito combo and the burrito was great. The burrito doesn't have rice in it so it's lighter, but it's really flavorful and the tortilla stands out. It's nice and toasted with a crunch on the outside and adds to the flavor itself. There's a good mix of grilled and fresh greens inside too. It came with a side of rice and beans which were just fine and kind of underwhelming. The combo came with a glass bottle soda so it's really reasonable for $7. I'll definitely grab a burrito here again!"}
{"text":"This place is good for a quick bite of lunch. The food is not exactly authentic but the ingredients taste fresh and flavourful. The 4 hot sauce you can choose from the side is a great touch to personalize your food! I got the Bistek Burrito and the steak was really good, I also didn't feel sick after eating the burrito which is always a plus (due to MSG, or too much processed food). Would go again and try the pollo next time + their spicy rose mango!"}
{"text":"I recently found this place and have been back multiple times. Specifically on Wednesday when they have their dollar tacos special. The beef, chicken and pastor tacos are each a dollar every Wednesday. I recommend calling ahead to order so you don't need to wait, also I highly recommend the pastor tacos. They are extremely flavorful. The beef tacos aren't bad either, but I prefer the pastor tacos. The chicken tacos were pretty mediocre in taste in my opinion."}
{"text":"Best tacos and tamales in town, also, the best price. I absolutely love the place, the food is so good,and the owner is about the nicest guy ever. 
If you want ripe avocados, do not waste your time at any other grocery store.
It looks like everyone else has said it better, so I will just state that; I concur, and thank heavens for El Charro."}
{"text":"As a kid from Texas, Mexican food is my go-to comfort food. We finally have a delish option: on Broadview just across from the Broadview Station. I sampled the guac and a couple of taco flavours and I'm happy to report total satisfaction. The food doesn't come very spicy-hot, but the selection of sauces can change that to your own preferences. They make their own corn tortillas and horchata. They also have bottles of my fave Mexican pop Jarritos in lotsa flavours. My fave is tamarind."}
{"text":"Delicious. In town for a day. Had carnitas tacos.  More than worth it. Wow. Salsa also great and friendly staff."}
{"text":"Interesting when a place has been near you, yet u never discovered it..
Okay, Maybe not that interesting...
Friendly staff, terrific tacos.
Also tried huevaches (?), w chicken, really messy, also good."}
{"text":"It's a small grocery store & eatery. The tacos always hit the spot. Pozole (pork & hominy soup) on the weekends is a special treat. I like mine with plenty of lime & cilantro. Horchatas are huge & there are refills. The storefront & the interior are small and not necessarily clean looking. But the food is fantastic & Alejandro is super nice. There are a few tables/chairs if you want to eat in. The tv is usually on quite loud. I've come here many times with friends & had many fond memories over shared meals."}
{"text":"Cons: lower quality ingredients than surrounding Mexican restaurants, eating area is a bit dirty, portion size

Pros: immensely cheap prices, regular specials, friendly service, plenty of seating, more \"authentic\" taste and feel

My first experience with El Charro was a good one. They were having a month-long '$1 taco' special and so I ordered 5 tacos (credit/debit card minimum is $5): 2 chicken, 1 steak, 1 lengua, and 1 chorizo. All tacos come with onion and cilantro as well as complimentary chips and salsa. The tacos are small but that's fine given the price. The tortillas used for the tacos are fantastic.

Lengua - I was pleasantly surprised with the lengua, as I am aware that lengua quality varies largely across restaurants. Although the meat was sparse and it wasn't as good as you'd find in a larger city like Chicago, it was more than acceptable.

Steak - This had to have been my least favorite. The whole time I was eating this taco I thought it was my chorizo taco. The meat is so finely cut it starts to resemble ground beef. The meat lacked flavor and was sparse, same with the lengua.

Chicken - I have mixed feelings about chicken. It was not typical chicken you'd get at a Mexican restaurant, but instead comes in small cubes. It does the job and tastes fine, but it leaves a bit more to be desired.

Chorizo - A bit greasy but you get the chorizo taste. Acceptable.

All in all El Charro was a good experience. Although I warn that I would not be surprised if the quality/experience was not as consistent as say Maize or Burrito King. Recommend."}
{"text":"Came on a quiet Saturday afternoon for a late lunch and high expectations. I had read on this Yelp site that it was better than Maize, that it was hidden treasure, more authentic, etc. I was also told that El Charro was there before Maize, and had been the original staple center for Mexican food in that area prior to Maize moving in. The pictures looked good, the menu looked reasonable, and the reviews made me hopeful that I might find this place a \"hidden gem.\"I was so disappointed. 

I ordered 3 tacos (barbacoa, carnitas, and steak) and a pork torta with rice and beans, directly comparing them to some of the menu items I had at Maize Grill. First of all, the complimentary chips basket had STALE chips. Maize has really puffy, thick, crunchy chips (albeit oily because they just came out of the fryer), but the chips at El Charro were clearly store bought, cold, and stale (not crunchy at all). Secondly, the taco meat was just...not flavorful at all. It was like eating flavorless mush, and I had to saturate my tacos with hot sauce to make it flavorful or salty at all :( . Finally, the Torta dish came with really dry beans that were all clumped up and not anything like the pictures they have of the rice and beans on this Yelp page (and I LOVE rice and beans because I usually make a bean dip with the leftovers to eat the nachos with). Granted, today could have been a bad day for them, but the beans were just awful, and the torta itself was 50% bread, 30% lettuce, and 20% meat (with the meat itself being, like the tacos, utterly flavorless). Once again, I had to douse everything in sauces to make it taste like anything. Ended up not finishing anything I ordered. 

On the bright side, the tortillas they used for the tacos were pretty good, and the bread they used for the torta was decent. On the bad side, some things were clearly not fresh, and everything was pretty flavorless. 

Sorry El Charro, I really wished I could've given you an amazing review, but I really was disappointed. 2 stars because at least it was cheap."}
{"text":"Unique and authentic mexican spot in the heart of old Toronto! After visiting Mexico a few months earlier, I could not stop craving mexican food. The tacos were made fresh and the spicy mango roses were just too good to be true! Absolutely loved it! Got half my instagram friends to check this place out. Definitely a gem of a food spot"}
{"text":"Got the Huaraches on recommendation from the server.  Was not disappointed!  I had the carne asada version.  The tortillas are handmade in store, and you could really taste it.  The flavour of the marinated beef, guacamole and fresh salsa all blended together was a delight in my mouth.

I really got an authentic Mexican feel from this place between the decor (Mexican art and Mexican wrestling masks) and the menu (which included more than just the burritos and tacos you see at most Mexican fast-food chains).  You could tell that the ingredients were fresh and the recipes likely passed on from family.

They had fresh homemade tortilla chips and a variety of salsas to try while you waited for your food.  I didn't try any this time, but I will next time I come in.  

Although the inside is small, There's a few high top seats if you want to eat inside, and a small table with 4 chairs.  Friendly service as well.  

Looking forward to trying a torta next time!"}
{"text":"Real authentic Mexican dishes, right in the middle of C/U.  Been here a few times now and everything tried was spectacular.

Got spoiled in CA with taco trucks serving scrumptious goodness everywhere.  For being in Illinois, nothing else outside of Chicago can compare. 

Don't be put off by the looks, or worry too much about the floors/tables.  The grocery store and food counter are unassuming and homey (homely?).  Everything is super cheap for the quality and quantity.  

It's a non-corporate family venture, the same folks are always working.

If it looks good, and smells tasty,
just eat!

Alejandro is really friendly, and he's kinda super hot as well.  He'll help you figure out something to try if you are unsure."}
{"text":"I visited El Charro on a Tuesday with a friend who has a taste for Latin American cuisine.  According to him, this place had fantastic authentic tasting tacos for an affordable price.  My friend sounded like he knew what he was talking about, and in combination with the positive reviews on Yelp I decided to give this place a try.  It was Taco Tuesday when we arrived, apparently one of the few places in Toronto that actually does Taco Tuesdays.  The place is fairly small, and looks like a hole-in-the-wall.  However, the Mexican décor inside was a nice touch and the place has a good atmosphere with everyone chatting with each other.  The place was packed with a modest line-up, and there was also a decent number of patrons dining in.  It took about ten minutes for us to get to the cashier, and we waited for our food for approximately 15 to 20 minutes after ordering.  I ordered a beef, chicken, a Chorizo, and Pastor taco.  I wasn't happy about having to wait this long for our food, but my friend's confidence made me excited to bring the meal back home and enjoy some authentic Mexican cuisine. 
 
I don't consider myself to be well-versed in genuine Mexican food, but the tortilla had a very strong floral corn aroma that overpowered the taste of the meat and condiments. The filling itself was a little bland, lacking in seasoning and salt.  The floral flavour in particular took away from the tacos. The only one that I can say I really enjoyed was the Pastor, as it had some enjoyable seasoning to the meat.  Next time I might try the burrito instead.  In all fairness, my friend that I was dining with claimed to thoroughly enjoy his meal.  Perhaps I caught them on an off-day, or maybe my sensibilities and tastes just don't coincide with authentic Mexican cuisine."}
{"text":"The friendly cooks at El Charro offer a nice variety of items along with the standard tacos and burritos. The mushroom and cactus huarache is a filling vegetarian option -- the corn tortilla is piled generously  with black beans, pico de gallo, guacamole. Along with bottled juices and pop they serve horchata and a cucumber lime drink; both could benefit from a little less water in the mix. Try the different salsas they have lined up at the counter--a range of heat levels, all tasty."}
{"text":"I had a delightful experience at El Charro, the worthy rival to Maize right down the street, and the undeservedly forgotten of the two. When I came in, I talked at length with the person greeting me (may or may not be the store owner) who helped me choose a dish and gave me tons of complimentary chips and salsa as I waited. I absolutely loved the chips, which were crunchy and uncharacteristically full of flavor for chips. 

When I received the food to go and paid for my food, the person stopped me before I left and filled the rest of my bag with the chips. It's sometimes hard to find such friendly, personal customer service like this, which I appreciated wholeheartedly. The carnitas burrito I ordered was absolutely phenomenal. The best carnitas I have ever tried."}
{"text":"Great Mexican street food. Small place with not too many places to sit but for a quick bite or certainly to go this place is great!

Busiest at lunch time of course but even then only takes about 10 minutes."}
{"text":"Perfect hole in the wall spot for great Mexican grub!
I ordered the 3 tacos for $10 and you can mix and match chicken, beef, pastor and chorizo. They are SO fresh and served on corn tortillas and a wedge of lime. 

The joint is super tiny and great for grab and go (only sits about 8 ppl). Just be prepared to wait a bit for the food. It's made fresh to order so could be about 10mins or so. But worth it. 

It's in Cabbagetown and worth checking out."}
{"text":"This place could have potential but they just don't do anything with their food,  including seasoning.  Torta was dry and flavorless and had barely any 'steak'  on it.  Also,  my friend got a twist tie in her food soo theres that."}
{"text":"We stopped here because my daughter was craving Mexican food. I had just finished my lunch so I didn't participate.

She ordered soup and three tacos which came with a drink. She was expecting a little bowl of soup and what was served was big an hearty, filled with beef, chicken and chick peas. She couldn't stop eating it and had to take two of the tacos home because she couldn't finish. 

I'll be going back for sure so that I can sample the food myself. The proprietor was friendly and helpful and the place was cute and cozy."}
{"text":"Great affordable mexican food. Place is small, but on a nice day you can take it to go and enjoy it outside! Had the tinga palambazo as the server recommended, very good. Soggy bread with lots of flavour inside. Would go back to try other things on the menu!"}
{"text":"This tiny food joint is the absolute cutest! 

My boyfriend actually recommended this place after seeing a friend posted a Snapchat story about these amazing rose mangos! 

When we arrived we were so fascinated with all the Mexican the decour, it was absolutely authentic. We just ordered the rose mangos so I can't comment on the actual food like the tacos and burritos that they also sell. 

The rose mangos were really delicious but quite messy to eat it's not something that you can walk around and eat. You have to sit down and enjoy it. 

Ps: make sure you grab a lot of napkins while eating this."}
{"text":"This place is great. I have Mexican food in LA several times a year, El Charro does it up right. Cool luchador mask decor and excellent service. They had Jarritos and Mexican Coca Cola too. Had the Chicken Burrito and added shrimp to it. Very flavorful. Also the Pastor Torta was delicious. Can't wait to try the tacos! Will visit again and again. Nice one El Charro!"}
{"text":"If you're looking for cheap, authentic Mexican food, this is the place. Yeah, the place isn't the greatest-looking place to eat, but the food is fresh and flavorful. I really like the different choices of meat on the menu besides just chicken and beef. My friends and I ordered some chips and guacamole as starters and the guacamole was very fresh. 

In addition, the place is also a grocery store with meat, spices, avocado, and etc. The price isn't too bad at the grocery store at all. The avocado seems fresher than the ones you would buy at the big chain grocery stores. If you want a recommendation on something from the grocery store, I would ask the owner who works there. He's super nice and friendly."}
{"text":"Best tortas I have eaten in Toronto, considerably better than San Cosme in Kensington. The breaded beef (milanesa) was outstanding, as was the chicken version, which I hadn't seen before elsewhere. Generous sandwiches on a big, fresh, satisfying bun - a welcome contrast to the drier bun I had at San Cosme. Self-serve salsas were excellent. Friendly service. Only con is lack of a bathroom."}
{"text":"The best carne asada around these parts!! Steak milanesa sandwich is so good! The menudo is like grandmas. The taco and burritos are really good too!! Purchase beef chorizo from there alos... and GOOD! No issues with this little place!! Great job!"}
{"text":"I went here with a friend for lunch and I will be honest before starting this review...I'm regretting not going to Maize which is about twelve feet away! DANG IT!

It's shady, authentic (not in a good way), and hot! It was about a million degrees when I arrived for lunch on this terrible Tuesday. I was informed by the owner/cook/janitor/employee, Alejandro, that tomorrow was dollar taco night. I will not be back. 

The menu is confusing, jumbled, and all over the place. It is a blend of a grocery store and restaurant. The reason I say it was \"authentic\" was because of the dirty floor. I am giving this place two stars because of the dirtiness of it. Crums on the floor, a cockroach greeting me as I walk in, and a bumbling drunk (not Alejandro's fault) going around the restaurant. He apologized because he was cooking a lot in back...so that's why it was hot. Oh well, I wasn't too bad, but it wasn't comfortable. 

I decided to go with steak fajitas and my friend went with tacos de pollo. She said I should never take a girl out on a first date to a Mexican place because it is messy! My fajitas were not as spicy as I would like and to be honest, quite flavorless.

It came with the tortillas (okay), refried beans (from a can), and Spanish rice (from the box).

I wouldn't go back her to be honest. I had a 10% off coupon via Yelp. I ended up not having to pay. I am glad. I should have gone to Maize!!! If the owner wasn't so nice, I would have given one star. 

I can't wait to have Maize again."}
{"text":"For its size, El Charro packs a punch.  I've formerly only eaten in the restaurant here, which was always tasty.  I was a quesadilla fiend for a while, and they always delivered (figuratively, not literally).

Lately, I've been trying to cook my own Mexican food, and the grocery section, though small, had everything I needed the other day: corn husks, Valentina, chiles de árbol, and El Milagro tortillas.  And, walking up to the counter with two huge bags of husks, the guy behind the counter started a friendly conversation about different kinds of tamales.  Awesome!"}
{"text":"Best tacos in the town! I had been in Mexico two times, the way that make it is very authentic. Well done,El Churro. I will come back"}
{"text":"Slow service, overpriced tacos (yes they have $1 taco specials but those things are AS small as possible), and they don't clean their tables. Tacky decorations, tacky store at the front, awkward register blocking the door. I'm shocked that they have 4 stars."}
{"text":"Great authentic Mexican food and great service. They also offer great lunch specials and even offer authentic Mexican beverages like horchata (cinnamon rice milk). Only been here once but I'll be back again."}
{"text":"I can now say I have found local chambana tacos worthy of my Californian bougie princess street food standards. In all seriousness, skip the line and lack of seating at Maize and cross the street the El Charro.

Having spent most of my life in California, roaming the streets of East San Jose or living in the Mission District of San Francisco walking 15 blocks passing two dozen taco joints to get to the taco stand located inside of another Mexican restaurant, it is safe to say I am well versed in taco style, taste, and quality. Let me tell you that no two taco joints are created equally. In my 16 months living in the midwest, no place has come close until now; thank you El Charro. As far as I am concerned, this joint is probably the most underrated taco place in Champaign-Urbana. 

I had almost given up after trying numerous places throughout the area, deciding that Huaraches satisfied the craving, but did not quit hit the taco craving spot at the bottom of my belly which ached so much. My Chinese immigrant coworkers came to me with a need to try beef tongue and I couldn't supply him with an answer as to where to find such a delicacy. Halting all work immediately, we scoured the yelp, online menus, and shaky images of menus until we found El Charro, and immediately made plans to check it out the next day. 

The consistency and flavor of the corn tortillas are perfect and not too greasy, the meat was perfectly cooked and topped with fresh onion, cilantro, and served with lime wedges. It was perfection topped with deliciously grilled spring onions to boot. Did I mention that Wednesdays are $1 tacos?!?!?!?!

Our waitress forgot I ordered flan, but that's okay because I was full and she didn't charge me for it. I was too happy to care."}
{"text":"I really wanted to like El Charro, but after 4 visits, the food is consistently devoid of flavour.

I've tried a few different types of tacos and burritos. On my last visit, I got home to find my tacos weren't even properly put together; the ingredients were carelessly thrown together in the box.

Pet peeve: the card machine prompts for a gratuity, and you have to manually enter zero if you'd rather not. At a counter-service restaurant? Stop it."}
{"text":"This is an authentic Mexican street food experience the same way you'd expect in Tijuana or Guadalajara.  Tacos are scrumptious with fresh ingredients and no frills.  Double layers of soft corn tortillas done just right.  Pork pastor and chicken were good choices.  Beef was a bit chewy.  Great guac and chips for $5.  

$10 for three tacos or $11 for a huge burrito.  Recommend for takeout or quick standing room lunch as there are only 7-8 chairs in the small seating area."}
{"text":"Came here with my boyfriend for dinner today, we wanted to see how it compared to Maize across the street. Let me say, I strongly regret this decision. Their water machine was \"out\" so I ordered a sprite to drink, which was flat and tasted like straight up syrup. The food was alright, but I wouldn't come back, and the flies wouldn't leave us alone. On top of that, the waitress was rude and had a very negative attitude. Not a good experience. Spend the extra few dollars and go to Maize."}
{"text":"I'd walked past this place many, many times before actually going in.  My boyfriend and I referred to it (lovingly) as the \"shady Mexican\" place.  He grew up in an area with plenty of authentic Mexican food, and apparently they have the right kind of chairs here that mean they serve good, authentic food.  Or something like that.

The point is, the food here is really good.  And it's really cheap, which is a rare but appreciated combination.  I usually get the huaraches since it's something different than what you normally see at \"Mexican\" restaurants.  Everything seems really fresh, and the guy working there is always really friendly.  The absolute only reason I'm giving four stars instead of five is because the place isn't the cleanest I've seen.  But don't let the shadiness scare you away!  If you don't particularly care for the seating area, just get your food to go.

They have some competition now with Maize open just down the street, but if you ask me, El Charro is just as good.  So if you like Maize, definitely give El Charro a chance!"}
{"text":"El Charro is honestly my favorite Mexican place in the CU area. It is almost directly across from it's main competition, Maize, but I think I'm terms of price and offerings that El Charro surpasses Maize on most counts. Their weekly deal for dollar tacos on Wednesdays is also unbeatable."}
{"text":"-I went with my best friend who is Mexican, and she swears this is authentic mexican street food. 
-We ordered the tacos and another dish that was an oval tortilla with chicken on top and another with steak. 
-The staff were friendly
-The food was so delicious that we ordered more lol
-Different hot sauces on the side if you need to spice it up!!!"}
{"text":"I came in on a quiet Sunday evening to grab a $5.50 burrito and fries Hooked deal that El Charro has sometimes. It's located only down the street from my place so it was a quick walk there and back.

I ordered a steak burrito and it was ready in a little less than 10 minutes, the guy at the counter was nice.

The burrito was kind of sloppily rolled and seemed to be pretty loose and not quite filled up all the way. This made it a little difficult to eat because the insides kept falling out. The steak was like finely chopped up and at times resembled ground beef. The burrito had like a pico de gallo and lettuce and cheese but not much else, I found myself constantly putting the included green salsa on. It was also quite greasy.

The French fries actually didn't look like I expected, these were dark and actually looked pretty good. Unfortunately though, they were dripping with grease, tasted a little old, and were very soggy. 

Overall everything was pretty greasy and kind of your stereotypical low-cost Mexican fare, similar to Burrito King down the street. I don't think half as good as Chipotle or even Maize, which halfway through my food, I kind of wished I would have gotten instead, even though they're more expensive."}
{"text":"If this place had more seating I'd probably be eating here a lot.  But as it is, there's one table that seats two and maybe six counter seats along the window.  That's the downside.

The upside is that the food was great.  Soup was not on the menu that I could see (though I could see the pot sitting in the back) - pork, corn and veggies.  Very good, though it benefitted from a dollop of hot sauce.

Tacos were also quite good.  In increasing order of tastiness - chicken, pastor (pork), chorizo.

Good food at a good price, and friendly service."}
{"text":"I really liked the food at the Parliament Street version of El Charro and  was very happy to see an outlet open up on Broadview. Especially as this place has a bit more seating

Food is excellent.  

My one complaint is how the eat-in food is served.  In my case, huaraches on a open-edged platter on top of a sheet of paper.  Stuff falls out the side when you cut the food, and the paper disintegrates, meaning you are eating paper with your food.  This needs to be fixed. 

But the food is excellent and I will be back."}
{"text":"This is the real deal. The owner is very friendly and I like him even though I would like him even more if he actually liked futbol-soccer haha! Anyways, go there on Wednesday for his delicious $1 tacos, they are great. I have been frequenting this place since I my first visit to this area 2 years ago and will continue to go there as long as I am here in Illinois :D"}
{"text":"Amazing!! A little slice of Mexico on Parliament Street long overdue. This little hidden gem run by a husband-and-wife team for amazing Mexican takeout and catering. Amazing customer service very friendly warm and inviting. For me personally the best steak tacos in town can't wait to try there burritos. Welcome to the neighborhood El Charro!!"}
{"text":"Great food and authentic ambiance. Felt like we were in Mexico. Scrambled eggs with chorizo was the bomb!"}
{"text":"Perfectly TRADITIONAL Mexican. Tacos w cilantro, onion, and wedge of lime. Divine, yet so simple."}
{"text":"I had my suspicions when I was the only person at the restaurant when I got there. But it's between semesters so perhaps that was why it was slow, I thought. I had a margarita and a Mexican shrimp cocktail. The Margarita was so disgusting I had to add eight packets of sugar just to make it palatable. When the shrimp cocktail arrived I noticed the sauce had a sour/bitter taste that it's not supposed to have... It seemed almost fermented like it was expired. The shrimp had a funny skin on it that I've never seen on shrimp before. May have been the result of freezer burn but it also tasted funny. Against my better judgment I ate my shrimp cocktail ... but my worst fears were confirmed later in the evening when I developed food poisoning! Avoid!!"}
{"text":"We love Mexican food and we go to Mexico regularly for our vocation. This place easily to be missed on Parliament Street definitely surprised us with their authenticity. Everything here makes me feel like a trip back to Mexico like Playa Del Carmen. Food is very freshly made with good portion. The staff are very friendly and the décor is simple - no way close to many pretentious fusion Mexican restaurants in Toronto."}
{"text":"I like El Charro a lot actually. They were understaffed when I went so it was messy but the customer service was still great and so were the tacos. Maize is a little better but the SALSA at El Charro is bomb. The tortilla chips are better here too."}
{"text":"Real, delicious tacos. REAL tacos. When I went in the place was filled with people chatting in Spanish over their food, just like back home and n California. My heart! And when I got home I wolfed down the best and most authentic tacos I have had since my last trip home.

Now I only need to convince them to serve carnitas and I won't have to risk being harassed by border patrol to get my fix."}
{"text":"This place is a hidden east-end gem! 
Best vegetarian (cactus & mushroom) tacos I've had in Toronto. 
The shrimp taco was also top notch & my partner loved the burrito al pastor. 

Prices were very reasonable.
Highly recommend."}
{"text":"The good: tortilla chips, salsa and flavor of meats. The bad: portions and service. The service took so long and the portions felt a bit of a rip off. I was given a few spoonfuls (maybe 2 or 3)  of the rice for $1.50. Rice is not that expensive and I started to think of Maize and how I should have bought rice there! They give you a more generous portion. When I brought this to the attention of waitress she just mentioned that's how it is. She was nice but wasn't too helpful with questions. Service was a bit slow and waters did not get refilled. I don't think I'll be heading back here. Last time flavor was good but I'm toggling between the service and other options in area. I'll just go to the other options."}
{"text":"Cheap food, tastes amazing and it was made rather quickly! I strongly suggest the Tinga Quecas; that thing is BOSS!"}
{"text":"Mexican food done right! 

The meat was cooked so well, juicy and flavourful. The caramelized onions added another dimension of great flavour.  We also got guac and chips for $4.50 very good as well. 

To those who complain about waiting for food.. you are only waiting because they are making it fresh. It's not like chipotle where it sits there for what could be hours.

Good prices, good food!"}
{"text":"Restaurant review:
I can see why some people in Champaign don't \"buy in\" with the yelp reviews. This is by far a significant drop from Maize which is just around the corner. Based on the reviews I was excited to try this as an alternative because there was actually seats and I could eat the food fresh from the kitchen. When you walk in you will notice that this place is sort of a hole in the wall place. I had to even ask if they accepted credit cards, yes they do! Everything in the restaurant was sticky from the menu to table to the floor. Usually that may mean good traditional food. Unfortunately this was not the case. I ordered a carne asada and enjoyed my mexican coke eating complimentary chips with salsa. The chips are straight from a bag and the salsa was quite bland. I was hungry so I enjoyed my chips still and ate the whole basket. When my carne asada came it was not what I expected. The meat was hidden in a pile of chopped up onion, peppers, and large chunks of green onion stems. Why would you put giant pieces of green onion in with the carne asada. These were not pleasant and bitter tasting. The carne asada is usually very tender the way it was prepared. This was again not the case. Very thinly sliced meat that was very chewy. The problem is that it was thinly sliced so it was quite over cooked. The refried beans was a soupy mess, but the mexican rice was passable. All and all this does not come even close to maize in the term of quality and flavor. Did I mention that there was so much oil in the dish... Finally when I paid I did not get an itemized receipt but as I saw him adding the price of the entree I believe I was overcharged as the menu list 8.99 for the carne asada, but I was charged 9.50. Seriously...

Pro: None....

Cons: The restaurant is not clean, the quality of the meat is poor, bland salsa, very greasy carne asada

Hidden gem:
1 dollar tacos on Wednesday"}
{"text":"We live in the area and we were looking for a new place to eat. This place is rated 4/5 stars on Yelp so we decided to give a try. It's a small place with 7-8 high chairs along the window and 1 small round table that can sit 3 ppl max. I ordered the steak burrito and my husband got 3 for $10 tacos. The burrito size was decent but it's bland. They put WAY TOO MUCH lettuce and rice in there. The steak lacked seasonings. The beans were almost invisible and tasteless. I'm not sure if I'm just used to Burrito Bandidos' \"tex mex\" style but that steak burrito was just NOT good. My Husband, on the other hand, quite enjoyed his tacos. They were luke warm, which bothered me, but he said the actual taste was pretty good. We also shared guac and chips ($4.50), which didn't come with a lot of avocado but with a little too much chopped onion. 

Long story short, we won't go back. Como en Casa on Yonge-Wellesley is cheaper AND better!"}
