{"text":"A bit disappointed.  Marguaritas were small and most full of ice.  Disappointing for a $10 drink on a hot day.  I ordered the taco trio.  The appetizing flavours of lime and cilantro were lost in a sea of a bland mayo type sauce that smothered the taco.  Reco:  ask for no ice in your drink to force them to give you better value and tell them to go light on the mayo sauce.   Maybe they will hear this and improve upon this over time.  Server was very nice and attentive though."}
{"text":"Heard a lot about this place and went with a couple of friends. It's like a poor hybrid of El Catrin and La Carnita (both of which have better food and vibes, go there instead). Got a few tacos, guac, and the ceviche. All were horrible. Tacos were bland and small (steer clear of the chicken as it was extraordinarily dry), guac wasn't fresh, ceviche was terrible and served with a huge side of plain mixed greens salad (bigger than the serving of ceviche). The server had also forgotten that I had ordered the ceviche and we had to wait extra for it -- in hindsight, we probably shouldn't have even reminded her. Really confusing experience and really disappointed. Will not be returning."}
{"text":"First off, the service staff are immature and dressed inappropriately..  are butt cheeks on the menu?
You can expect better Mexican at the local 7eleven.
Guac had no acid, which probably would've made up for the lack of salt. Tacos were sub-par. Churros were just shyte! The drinks however were pretty yummy.
The 3 non-mexicans need to jump on the line..this place needs to be saved."}
{"text":"Lots of hype about this restaurant.  We were not impressed.
The service was good but everything else was lacking.  
We ordered tacos and the chicken chimichanga.  The tacos, especially the chicken were bland and little meat or shrimp or fish. The chimichanga was okay but nothing special.
Our beer was barely chilled.
Our impression is that this is a trendy place for gathering with friends but the food was average at best."}
{"text":"Menu is awesome, enjoyed the cocktails and the service was great!  Will be coming back!"}
{"text":"Tried their appetizers and their horrible in my opinion. Spent a good amount of money on beer and food and after I paid for the bill another couple comes in and she tells them there's a special on tacos. She said it's taco Tuesday. How are you a server and forget to mention the specials. That probably would have been better then the empanadas and all the other appetizers in my opinion. You can't go wrong wrong with tacos lol."}
{"text":"Great food, drinks, and atmosphere. The wait was a little lengthy, but you were able to grab drinks at the bar in the meantime. The El Valente drink was great, it included a mango habanero pure that was a kick to the mouth...in a good way. The tacos were delicious, I love the idea of being able to choose a variety to try as part of my entree. My only issue was that the dessert was a little lacking. We brought our concerns to the manager, and he was very gracious about it, advising that he would be looking into changes with their chef. I appreciated the fact that they seemed genuinely interested in our review."}
{"text":"Complete disappointment.

Patio was jammed and the hostess couldn't give us a solid idea of a the wait time, except 'it'll be quite a while' with annoying head tilt. Stupidly, we decided to take a table inside. 

While the bar area was pretty cool, we were tucked into a dead-end room with 4 tables. No atmosphere. 

The server wasn't very focused, or quick. We ordered two cocktails. Mine was a mojito. Simple for a Mexican joint, right? It arrived with zero mint. Waited a good 5 minutes for our server to return. She agreed it should have mint and had the bar make another. Average at best and the 3 slices of lime gave up no juice. Dry limes. Ugh. My partner's drink advertised 1 1/2 ounces of tequila, 1/2 oz aperol, grapefruit juice, lime juice and a splash of ginger ale. A splash meant no ginger ale. The glass itself was about 3 oz and there was no ice. It was a light pink shot of tequila. $12?? Total rip off.

We both had trio of tacos. Bland, uninspired, not authentic tacos. Carnitas was cubes of chewy flavourless pork. Pescada was dry, dry, dry fish with too much mayo sauce. I could go on but I'll save my typing for a place with good food. 

Go across the street to HERMANOS. No nonsense, authentic and well-priced tacos. El Jefe is no jefe at all."}
{"text":"El Jefe is a great place for drinks / appetizers. Went there for lunch. Ordered guacamole, tacitos, and tacos. Guacamole was small, made for one person or two. Tacos were good, maybe a little light on the toppings but overall delicious. Drinks were really good. Service is great! Was welcomed with a smile, didn't take to long to get the food, and she kept coming to see what we needed. Really nice atmosphere."}
{"text":"Went here with a group of friends on the weekend. Don't come here on weekends if you're looking to sit down and eat.  This place is more of a bar/cocktail hangout than it is a restaurant.

Expect a long waiting period for both your table, and then for your food.  By the time you actually get seated, your hunger would have passed. I would suggest grabbing tacos across the street from Hermano's, then line-up, so by the time you get your table, you can just have drinks and hang-out.

I don't see this place sticking around for a while. The service was sub-par at best. However, being in Port-Credit, this place is in a good location. They have a nice and long patio to hang out in for the summer time. But.. that's where the hype ends. The food is mediocre. The staff confused our orders... a lot, and we just ordered drinks.  

The staff is obviously aware of the wait-time their patrons are experiencing, and yet there does not seem to be some sort of appreciation coming from any of the staff or management team for the people who are waiting.  I would at least expect some 'complimentary' Sangria samples in small cups or mini-churros passed down the long wait-line to reassure waiting guests and to appreciate them for waiting.  If not those, then come out and greet your waiting patrons and thank them for waiting. 

 I've seen groups of 4 to 6 walk walk away after waiting for nearly an hour. These people were obviously willing to spend their money to wait that long. 

Once we were seated, we ordered our drinks, and two nachos and guac.  The nachos are greasy. The guac was fresh, but under seasoned.  We had some chicmichangas, and that was oddly satisfying. We also asked to order some ceviche, and only to be told 40 minutes later that they're out. 

After 10pm  their kitchen closes of course, but they will still serve drinks. and because their kitchen is closed, don't expect any food available. I thought that there is a by-law in place that food (snacks) must be available at all times when serving drinks?

This place is only good for drinks, and hanging out, in the summer. But you should still expect to wait long for your drinks though. 

Staff performance is poor. 
Staff communication is very poor.
Food is mediocre.

Anyway, the best feature is their patio, but... if that's the best they can offer, it's hard to imagine this place surviving its first year or two."}
{"text":"My friends took me to El Jefe this week to celebrate my birthday. We headed over at about 7:00pm on a week night and were told it would be a maximum of a 30 minute wait. As there is nowhere to wait at the restaurant, we left to get a coffee and came back after 35 minutes. They told us there were still two tables ahead of us, but it wouldn't be too long of a wait. After an hour and 15 minutes of total waiting time, we were seated. After 15 minutes of waiting at the table without being approached by a server, my friend went to the hostess and asked if she could send someone over. They were fairly apologetic and brought four tequila shots to the table- all of which went to my one friend as I am allergic to tequila and my other two friends were driving. The gesture was, however, appreciated.

We ordered a guacamole to share which was actually very good and well seasoned. The tortilla chips were also very good. The mains came shortly after and they ended up mixing our orders up 3 times. Once we finally got the food we ordered, my tacos were extremely cold. The chicken tacos are meant to be served with pineapple and neither my tacos or my friend's had pineapple. The shrimp taco was pretty good, but would have been better if it was warm/hot.

Overall I think this place has the ability to be great once they have more experience, but waiting over1.5 hours to eat a cold taco was not worth it."}
{"text":"Great atmosphere. The margarita was good, the service was excellent. Do not, however eat any food here. The food has a strange chemical taste to it. Quite possibly the worst Mexican food I have had - including Taco Bell.  So disappointed. It has a great vibe and I really wanted to like it."}
{"text":"I wouldn't come here for food. Just cause service was slow. Food itself was ok. Calamari tacos was good. I didn't like the carnitas since it was too dry for me. Would come here for drinks, they have nice patio."}
{"text":"I got so sick after going here! My Margarita tastes off, shortly after I got violently ill. We sat at a table for 20 minutes and no one came to take our order, we moved to the bar and got served right away."}
{"text":"\"Sorry guys, it's my first day\"
Yeah, no kidding. Our server was completely clueless.
First, we asked for two different people for an extra margarita glass to share our pitcher. It never came. He had 2 tables waiting to pay and our table waiting to put in our app order in but he just disappeared for 10 minutes in the back.
Then, for our table side guac our server clearly had no idea what he was doing, did not ask us if we wanted it chunky or smooth, the avocado nearly spilled multiple times and he forgot to mix in the hot sauce we asked for and paid extra for.
Next, he did not check on us after our appetizer was brought and he clearly did not know it was even delivered because he came by to ask us if it was okay that our tacos came out before the app.. umm.. dude.. keep track of your tables. The tacquitos are trash by the way. Would not recommend)
By this point, empty dishes were piling up on our table and he had not cleared any. We had to help him out by telling him that could take away the VISIBLY EMPTY PLATES that were just taking up room on the table.
Then he completely messed up all of our taco orders. He clearly could not tell the tacos apart so he handed people the wrong plates, giving people the wrong tacos on the wrong shells. Took 2 minutes to change the flour shells to corn shells on one plate, before he realized that the actual tacos were wrong too. Had to wait 15 minutes for our replacement, corrected tacos. Dude, just ask the kitchen which tacos are which before you bring them out and keep track of who ordered what!
Also.. he sat down at our table when he was taking our order? What, is standing too difficult for you? We're not pals, especially if you can't get an order right.
We had so little faith in the guy by the time we wanted to pay we asked him if he wanted us to write down which items were supposed to go on which bill for him, since he clearly could not keep track.
He gave some half hearted apologies each time he messed up but it didn't even seem like he was trying.
The bright side: the margarita pitcher and sangria pitchers were great. Had to ask for glasses for the sangria pitcher though since it didn't come with any. Our table probably would have spent a couple hundred more on booze if we had better service.
(Server: what kind of glasses do you want with it? Our table: Umm.. the kind that it's supposed to come with?)

Overall, totally overrated. If I had a craving for Mexican food, this definitely would not have filled it. Train your wait staff properly or have them shadow a more experienced server before throwing them out on their own. From what I could tell, the other servers were on point but too bad I'll never experience them because I'm definitely never coming back here after this display."}
{"text":"A solid meh for this place. As much as I like the look of the patio and the colourful atmosphere, I wouldn't come here for the food again - but maybe for a drink. There was a good bucket of Coronas special for $20 or $25 (can't remember) so that was good. 

We were a group of 6 who got a variety of items on the menu, and the only person who felt that they actually got a meal was the one who ordered the chimichanga. All the other stuff we ordered was way too small to be considered a meal (although priced similar to the meal-sized chimichanga). The taco trio was pretty bland. The waitress asked if we wanted some hot sauce, and we all said yes. She brought us each a little container of the sauce (which made the tacos a lot better).. and surprise, we got charged for each container. Lame. This is also the only Mexican place I've been to where they don't put out some chips and salsa on the table for free."}
{"text":"The vegetarian selection is very limited, so I can't really give a meaningful review.

I had the burrito - and it's hard to make a bad burrito - it was good but not spectacular. The  corn dip is pretty good."}
{"text":"Upon arriving at El Jefe first thing we noticed was the decor. It totally transported us - felt like we were visiting a restaurant in the Latino quarter of a Californian city.  Service however, was very slow when we got there - even though we were waiting for a few friends, no waiter or waitress came by to take our beverage order. After our friends arrived a waiter came by and apologized for the delay and eventually sent a waitress our way to take our orders. The menus were beautifully designed although they were heavily used and tattered at the edges (print some new menus El Cantina!)
The guacamole was great (not excellent but great) it wasn't bursting with colour like I've seen at some other authentic joints but still tasty. We washed it down with El Cantina's home brew lager beer which was also well made. Main course were corn tortillas filled with beef, chicken and shrimp. The fillings in all three were delicious. El Cantina is a great place to kick back and hang out with friends. All in all looking forward to going back again!"}
{"text":"This is a place that Mississauga has wanted. Travelling to El Catrin for many in Mississauga just doesn't happen. Instead, it happens jere and the atmosphere will be great. 

Happy servers that while new, do everything they can to keep you happy. 

For a Friday and Saturday, expect a long wait. 60-90 minutes will probably happen. With the patio, maybe only 45 minutes. 

Food has all been above average. 

Only single flour tortillas for each taco is the only spot that I take away points for them so far. The rest has been solid."}
{"text":"Came here on a Saturday night with my best friend for food and drinks, as I really enjoy Mexican food and wanted to try this new place in PC.

Got there and was informed of a 45 min wait. No problem, I anticipated this. Wait ended up only being about 25 mins. Sweet. Got seated on the patio as requested.

Our server, Ethan, aka Mr. Port Credit came by to take our drink orders. He approached the table in a rush. No introduction. No \"have you been here before?\" Just short and abrupt, \"have you figured out what you want to drink or?\" K. We tell him we want a Mayan mojito and a Casa marg. Drinks came out pretty quickly, and they were strong and delicious.

We ordered the table side guac, and we each ordered the 3 tacos for $12. I had the steak, carnitas and chicken tacos. My best friend had the calamari, carnitas and chicken tacos. We were given the option between corn or flour tortillas which was cool, not really a fan of corn tortillas. Food came out fairly quickly.

I personally enjoyed my tacos. The flavouring was good, but we agreed there could have been more meat in the tacos.

Our server Ethan was not appearing to cheer up. We tried joking around with him and being friendly trying to cheer him up and make his night easier. He was rude about it, would not tell us his name (which we wanted to know so we could easily call him over when we needed help)

We ordered two buckets of 5 coronas for $25 per bucket. Awesome deal. 2 $4 shots of El Jimador (my god. Do yourself a favour and avoid cheap tequila) and 2 shots of $8 milagro tequila.

We had other friends show up just before ten and they tried to order food and were informed the kitchen closed. What? Thanks for going around to your tables and telling your guests that the kitchen will be closing soon and not asking if they have any last kitchen requests. 

This place seems to be trying very, very hard to be another El Catrin. Fix your management and servers attitudes about customer service and try again. I won't be back for a long while."}
{"text":"Pretty good. Went with a friend on Saturday night. We were seated quickly and service was good. 

We ordered a bunch of tacos and guacamole to share. Overall a good experience and the restaurant had a pretty ambiance. I would return."}
{"text":"Terrible service. We didn't get served for almost 30 minutes. We had to walk up and ask. To make things worse, we all got sick. Never going back."}
{"text":"Came here with my girlfriends, had come here originally when it first opened and this time I had a much better experience! Food was delicious, only call out was that there were no plantain chips in my salad and the waitress did not tell me they were out of them. Drinks were good, very busy in there and had a nice time. Shrimp on my salad were to die for!!!"}
{"text":"Came here on a Saturday for lunch right when they opened. I originally ordered a burrito but they ran out of rice (I found that hilarious, the rest of my party...not so much). I ended up ordering the chimichanga instead and it was so good! I could only eat about half of it because it was so filling."}
{"text":"I have came here looking for a worthy meal and I have found it El Jefe has some spice and lots of flavour the orders come quick and the service is great definitely try it out."}
{"text":"The place is a bit small inside if you go before the summer season but keep in mind that their patio can hold many more guests when the weather warms up. Their food is phenomenal and the servers are so friendly and helpful - not to mention their tequila menu is insane!!! 
The chicken chimichanga is their most popular dish so try it, it's SO good you won't want to stop eaing it even if you're full! Definitely somewhere I'd go again."}
{"text":"The Good

Visited them yesterday for dinner as we were in the area. The place looked cool as they had the patio open, and we weren't feeling like seating inside. The location and ambience are the best things going for this place based on our experience.

The Bad

We ordered 3 tacos (Gringo Taco, Calamar Baja and Milagro Pescata) and Guacamole. The guacamole was made table side and was just okay as it lacked taste/flavour (didn't have salt/lime).
The tacos shells were cold and hard. The fillings were cold too, maybe coz our food might have been lying around in the kitchen for an hour. And they were tiny and not filled well.

The Ugly

After ordering we waited for 55 minutes (I'm not kidding), but we didn't get our food. People at other tables were at least getting their guacamole within minutes as they make guacamole table side.
We called another waitress, asked about our food and she said she'll get our waitress. After enquiring our food came within minutes. She brought the guacamole and chips. And then the tacos within next 2 minutes. 

The waitress asked how did we like the food. We told that we didn't like it at all. They did take off some money off our bill but our evening was spoiled. Never going there again."}
{"text":"Came here for lunch, really liked their patio in the alley way and drinks were great food not so much. Def would come back for drinks and food as secondary. I had the classic lime margarita extra salty yummmmm"}
{"text":"Not a bad place for after hours!! A group of us planned a surprise for a friend on their birthday and it was a success to say the least! It's a great place to have drinks and socialize! 

We arrived around 10:30, there were already a lot of people so we were almost cut off but we made it in! This was my first time here and was looking forward to trying their food but unfortunately their kitchen was already closed so I'll have to come back again! 

It's not a huge place but it had a great atmosphere! There's plenty of tables and chairs and open space in the middle if you wanted to dance! Their DJ for the night was DJ Maurice, he played mostly hip-hop, r&b and reggae. Just the way I like it 

So, if on your next Friday or Saturday night you're looking for a place to drink and chill. Try out El Jefe!! 

I'll have to go back to try their food!"}
{"text":"The whole experience was the very uncomfortable reason
1. The atmosphere: the lighting was very dark inside the restaurant and the menus were illegible. I wish there were more options on the menu and the prices were moderately expensive.

2.Food: When we ordered our appetizer we got chips and guacamole, and it was nice how they made the guacamole right in front of us however the actual chips weir very stale about 3 weeks old stale.The main course was good and the portion size reflects it's price, however, it's not worth how much it costs. 

3.Service: We were seated quickly but due to the loud music there was miscommunication. The music was too loud I couldn't even hear my friends when I spoke to them. Another thing the servers were all over the place, there were multiple people coming to our table and asking what we wanted and on top of that when we ordered our food the server didn't even have a notepad and I was a little skeptical worried that they would mess up my order.

4. Restrooms: The washrooms were clean and smelled good."}
{"text":"Great patio on a sunny day, and drinks were cold.  Nice Mexican vibe with an amazing Mexican mural on the outside wall.  Ordered the taco trio,beef,chicken, calamari...it doesn't matter what type of filling they put in the taco,  they all tasted pretty much the same, bland.  The corn tortillas were exactly the same ones from the local metro.  Taco Bell has more flavour, and one slice of lime? I know the economy is bad but, sheesh cheap bastids!  No crema on the tacos either,  good service tho.  I understand that it's a non-Mexican chef duo?  You need two people to make those tacos?! I think my neice could put those together pretty easily and she's an infant,  you two non Mexican chefs should stay
Away from Mexican food and make burgers or something.   Patio and drinks only at this place."}
{"text":"The food is great here I and everyone else I was with enjoyed their food. Love the guacamole you have to get it when you go. I was surprised at how there isn't many options on the menu compared to the one I seen online. Also there isn't many options for people who do not eat pork. The atmosphere is nice, just the pricing is on the higher side."}
{"text":"Great Mexican restaurant! We sat on the patio which was colourful and had a great ambiance. There were six of us eating tacos, a burrito, quesadilla and heuvos. All of the food tasted really good and very authentic. The service was first rate and the prices were reasonable. I would highly recommend it!"}
{"text":"You guys! If you haven't been to El Jefe (aka 'the boss') in Port Credit then I gotta ask \"what the hell have you been doing with your life this summer?\"

Ever the fan of quality Mexican eats I feel the need to defend this place against some of the early nay-sayers who noted that they were still new and learning but then gave them an equally harsh rating. Let's call a spade a spade, if you want near perfect service and food upon opening, go to the Keg or other big box chain, they have a corporate idiot proof playbook that's easy to wash, rinse and repeat whether you're opening in Toronto, Mississauga or Kuala Lumpur. 

But if you want new and innovative, locally owned, awesome businesses to open (and flourish), know that they DON'T have a play book they read from the night they open, they're learning on the fly and making small tweaks to get it right from hostess to dishwasher and everything in between, so cut these new spots some slack will ya? Innovation is like a flower and requires constructive guidance and feedback to flourish, not negativity. So again be kind to the newbs - unless you were that guy/gal who beat up on grade 9s in high school... In that case you're just a jerk (kidding kidding).

OK rant over.

I had a working lunch here last week, on their patio and definitely ended up doing more lunch and patio than work - it's so nice. Their patio is that perfect mix of hidden hipster hot spot, with Mexican back alley (complete with an incredible \"Instagram worthy\" Mexican street art graffiti wall). Honestly the most chill spot in Mississauga let alone Port Credit to take in the Canadian art of Patio Season.

Yes I'm gushing, and I don't do that often, but my lunch was rediculous top to bottom. Service was stellar as my server was ready to go with strong reccos for both beverages and food. I kicked things off with a classic margarita. Served on the rocks in a proper glass with the right amount of salt on the rim. Yumm. I'm usually a little hesitant with margaritas because more often than not they result in a healthy level of heart burn before I'm finished. In EJ's case... no heart burn...only tasty Margarita goodness with no downside. Knowing I was going back to work after lunch I limited myself to only one and asked my server for something refreshing, tasty but non-alcoholic. She said that the Virgin Mojitos were very popular so I went with that. AMAZING. I honestly didn't even miss the alcohol. It was so cold and refreshing that I had 2 more before I left - this is definitely my new designated driver drink of choice (way better than a diet coke with lime).

For my lunch I went with an assortment of single Tacos: Beef barabacoa, Carnitas (pork) and fried Calamari. For starters, these are bigger than your average hipster-taco joint. These are those Old El Paso sized taco kit soft tortilla (without the taco kit flavour), not the rinky dink ones that when filled are impossible to close and always leaving you wishing you had 2-3 more. I only ordered 3 tacos because that's how many I need when normally ordering the smaller ones. These larger tacos were way bigger than normal and I could barely finish all three by the end - stuffed. My fav of the trio was the Calamari (which surprised me because usually I'm a beef and pork taco guy). The other two weren't bad, in fact they were among the top tacos I've tasted (pause for alliteration moment). That said, the fried calamari was SO good it was surprising, between the filler, the sauce, the crunch of the crispy calamari, I could have done 2-3 of those alone.

Any new restaurant has their fair share of bumps along the way when they first open but having read the reviews to date and comparing them with my experience, I can safely say if I ask you \"Whose The Boss\" in Mississauga the answer is clearly El Jefe, Senor. El Jefe is the boss (literally).

Eatcrest Out!"}
{"text":"Really wanted to like this place! 

If you want a cool spot on a patio to have a margarita or a beer, this is your spot. The wooden patio area and mural look amazing and with late 90s and early 2000 rap playing its an awesome place for a drink on a summer night. 

If you want tasty food, it's best to keep moving. I had their three taco special for $12 and while I had the fish, chicken and pulled pork tacos there was no flavour whatsoever. The corn tortillas fell apart immediately and there was no discernible difference between any of them. Even the hot sauce that we asked for, was not even hot. Total disappointment. 

I will say, their margarita was on point. Their chef needs to rethink his ingredients that were obviously just from frozen but the bartender hitting it out of the park."}
{"text":"Wow. Love the environment and the tacos were great! Went in on a Thursday night around 6, the service was quick, and our server (Alexis) made sure our night went smoothly. I'll definitely be back for another visit!"}
{"text":"Didn't have the greatest experience at this restaurant. Given I went on the first day of being hot, the patio filled up. We were really hungry so we decided to eat inside. 

Although we sat near some of the light source of the restaurant it was pretty dark and very loud music, at one point I could even hear them turn it up even louder where I found it hard to talk to my girlfriend who was sitting right next to me.

From time of order it took a long time for us to get our food, I'd say around 45 mins. We just sipped on our waters and waited.

With all that said, the food. Tbh I was hungry so I thought it was okay. I got the Mexican Dirty Rice and others in my party got the Wet Burrito and the Chicken Chimichanga. If anything I would say all the food kinda tasted the same with minute taste distinctions and different textures. I kinda felt that the wet burrito was just my Mexican Dirty Rice in a wrap. 

Another note to add is that I feel adds if the food is overpriced for the portions you get, taste doesn't really make up for it. The wet burrito and Chicken Chimichanga were both $16 without tax/tip and the Mexican  Dirty Rice was $13 without tax/tip.

I personally wouldn't come back here on my own"}
{"text":"We were told our table would be ready in 30 mins. After 40 mins we followed up with the hostess who said the wait would be another 45 mins. Don't waste your time. The place isn't even that great to be waiting 1.5 hours for a table."}
{"text":"PROS:
The decor, our server, the bartenders, and the food were great. The guacamole is amazing!!! They make it right at the table for you. The chicken chimichanga is also really good - I highly recommend it. We got $4 shots of El Jimador, which wasn't so bad in my opinion. You get what you pay for. I also had white sangria which was just alright. The food was definitely the best part! Overall, the food prices are fair/reasonable, but the drink prices are high.

CONS:
The restaurant is pretty small like all the Port Credit restaurants. They don't take reservations on Sunday (not sure if it applies to every weekend as the website doesn't specify). I was in a group of 7 so we ended up waiting about 40 min for a table. Good thing there's a bar.

Overall, I'm giving this place a 4/5 and I will definitely be visiting again."}
{"text":"I've been here a handful of times for the last year, and I always get the Calamar Baja tacos, which never disappoints! It is so delicious! The meat tacos (particularly Matadero and Carnitas) are good too, but compared to the fish tacos (Baja and Milagro Pescata), it doesn't compare."}
{"text":"Great tequila bar in Port Credit! You could miss it if you're just out walking. Worth checking out"}
{"text":"We went to El Jefe on a friday night after work - the atmosphere was very nice and trendy and it wasn't as busy yet. We wanted to try a few different things to really taste the food so we ordered the guacamole, elote, shrimp/cod corn tortilla taco's and churros. Overall the food was pretty good however our guacamole could have had more salt to bring out the flavor. Our server was new so although she wasn't as helpful to recommend items off the menu, she was still very attentive and nice. 

Overall, I would def give El Jefe a shot - I really liked it!"}
{"text":"This place would probably get a 4-5 star if they trained their servers. I've been here a few times because their deep fried calamari tacos were good but after this experience I will not be returning no matter how good the tacos are. Mistake on my part for going on an empty stomach but tell me how it took over 45 minutes for us to get tacos??? 45 GODDAMN MINUTES. We came during a busy time and it was a packed house but the minute we got seated we knew what we wanted and ordered it right away. People who were seated after us got there food which was a clear indication that our server forgot to put in the order. After half an hour I had to ask the server if she could give me an update on our food. She later came back and said the kitchen is backed up and offered to give us salsa and chips due to the long wait. Clearly she forgot to punch in our order and tried to blame it on the kitchen. Thanks for ruining my experience server...and I have spoke highly about your tacos which I regret because your service wasn't even decent."}
{"text":"Went here on Mother's Day and I was impressed. It has a really good vibe and decor. They also have a patio and bar which officially opened in Cinco de Mayo.
It has a similar vibe to El Catrin downtown. 
Overall food and service was great . Staff was very attentive and food portions was decent in size . 
We ordered the table size Guacamole and chips, Tacos $12 for 3, and chicken chimichanga. 

Their list of tequilas is very impressive you may need some time and they make good margaritas too. 
They do not take reservations so it's a first come first serve basis."}
{"text":"Came for tacos. They were soft and delicious. Its a great snack after drinking. We got three tacos for 4$each. Our bartender/host dude with beard seemed friendly & professional. Will come out for patio season soon"}
{"text":"Couldn't tell you how the food was because some overly loud and terrible dingus playing acoustic guitar turned us away before we opened the door. Total turnoff when you just want to eat some tacos in peace."}
{"text":"Got take out.  Food was good but not great.  They were out of 2 items I wanted at 5:30pm.  Drinks were good and patio is nice.  They are new and I would definitely give them a chance.  I think food and service should improve."}
{"text":"Great food. Yummy and tasty tacos! Price is great too! Good for family, great service, and nice selection of food. I would recommend the chicken tinga. And always order the corn tortillas."}
{"text":"Warning for hungry people....This place is not for those who are hungry unless you want to order things three times over. This place reminded me of El Catrin in Toronto, but doesn't live up to decor, taste or portions. 

Friendly staff, however long wait time on food (4ppl at our table).  We ordered almost everything on the menu In my opinion everything tasted very bland and needed salt. I'm not one to put salt on everything but I do enjoy tasting my food. We ordered the guacamole 3 times as the portions were so small, and tried every taco which all tasted the same. I will however recommend the Chicken Chimichanga. 

As for dessert, don't waste your time on the Beavertail tacos, unless you want sugared tacos the size of macaroons, and as for the churros, what a disgrace to Mexican food...They are the size of my pinky! Not worth the $7 .. Go to Pancho's on Bloor for the real deal for 5x the amount and half the price."}
{"text":"Came by one Tuesday night since I heard that they have tacos on special- 3 for $9. 
First of all, drinks took forever to get to us. We managed to order the food and still had no drinks. Our waitress apologized that they forgot.
The guacamole made at the table was ok... The chips were actually way better than the guac. 
I got the fish, veggie and calamari tacos- they tasted alright but the shells were really dry.
El Jefe is the first Mexican restaurant that I've been to that doesn't offer any hot sauces on the side, not even Frank's red hot sauce.

At the end we got our bill, and the tacos were regular price (2 combos- 3 tacos for $12= $24). I asked our waitress about it and she said that I have a good eye and she is sorry but her manager didn't make changes in the system for the taco special on Tuesdays. Very strange, considering that this is not the first Tuesday that they are having this taco special..."}
{"text":"Very disappointed. I ordered 2 tacos and guacamole for take out. Firstly, one of the corn tortillas was ripped in half. Kitchen staff couldn't even bother to switch it out. Secondly, the guacamole was pretty bad. I found a WHOLE clove of garlic! Unfortunately because it was take out I couldn't return to complain... but pretty sure I won't be coming back here."}
{"text":"What makes a Toronto person endure the QEW crawl Friday after work? Meeting a friend from Mississauga in the middle. El Jefe was recommended by a younger and hipper person, and I love that area of Port Credit so off I went. El Jefe is pleasant and unadventurous, and those aren't bad things. The drinks are inexpensive and there's a big enough tequila list to make me regret having to drive back. The guac that they crush at the table is fresh, though with a dearth of spices. Gringo taco had deep fried avocado. Breading and deep frying an already fatty food seems odd to me but the little pieces of corn were good. By the end of the meal I felt I'd had enough corn, first chips and then the tacos were double wrapped? Btw, I asked about the \"Aztec\" stone bowl the guac came in. It seemed quite porous, but our server said they do put it in the dishwasher, which is reassuring. I like it when restaurants are cleaner than my home although that's admittedly a low bar. 
Patio (in October!!) is cute, service was good. Overall I would characterize El Jefe as safe, (except for the disgusting FIVE POUND burrito a table of three was eating, who does that, what could possibly be a win in that situation?)."}
{"text":"Service was basic... smiles cause you have to and not cause you want to. 

Stopped by for a quick bite before another event. Seated outside on the patio (best feature) and waited more than 7 minutes to be greeted. Then was told someone will be right with me. 

Got 2 waters even though I was seated for one... water tasted mucky. 

Got the steak taco... the \"corn\" tortilla was cracking from being folded. The steak was chewy and the flavors consisted of a small squeeze of avocado mixture and lettuce. 

$5 for 5oz of Santa Monica wine 

Not much else to say but I that I regretted not hopping across the street to trying another place. 

I can see hanging out here for drinks with friends on the patio on a nice summer day...maybe enjoying the table side mashed guac?!?? 

I might be back..."}
{"text":"No joke. Drop everything and go the El Jefe NOW!!!!
Great margarita. Wonderful table side made guacamole. Fresh cooked tortilla chips for dipping. The tacos are big enough that you can eat three and then be satisfied. The patio is amazing. This little gem is by far going to me a main joint for me. The chicken taco was lightly flavoured which was nice since the shrimp was a touch spicy and wonderfully seasoned. The beef taco was legit beefy with a wonderful pickled onion. And the pork was topped with a spiced aioli that would make you consider beating the person next to you so that you can eat their taco. 
See you at ElJefe cause I may go back later tonight for another taco"}
{"text":"Atmosphere: 4/5
Service: 2/5
Food: 2/5
Drinks: 4/5

I've been there twice now. The first time I went was Cinco de Mayo. My group of 4 arrived at 5:30, they told us it would be a 45 min wait but we didn't get sat until 7:30. I tried the three types of seafood tacos and the guac, all of which were below average. The tacos were very tiny, there was hardly anything inside them. I am not a big eater but I was still hungry after the tacos. The guac was very fresh but there was some sort of spice in it that I didn't like. I was quite sure that our waitress was drunk and she was asking male customers to slap her ass. However, the bar tender was quite generous with his pours and i did enjoy the drinks. The white sangria and mixed berry margarita were quite good. They also did an amazing job of decorating the place. 

Yesterday I decided to give El Jefe another try, figuring that some of the kinks might have been due to the busy holiday and the fact that they are new. While out new waitress was much better, the food had not improved. The churritos were undercooked and raw in the middle. The beavertail was covered in too much cinnamon and very unimpressive. However the Con-Queso Street Corn was excellent and the nachos chips are fresh.

A great place to sit and have a drink but I wouldn't eat there again."}
{"text":"I liked this place. My experience overall was pretty good. Their patio is absolutely beautiful and very comfortable. Its situated in the heart of port credit and I was able to enjoy the live music bands from other restaurants. The staff here are very friendly. Their complementary chips and salsa are refreshing, loved their taquitos, burritos and, my favourite, their chimicheese flour dessert."}
{"text":"Great atmosphere. The wait staff are friendly and helpful. The specialty here is the guacamole made fresh in front of you for only like 10 bucks. It was great to be outside on the patio if there's a nice vibe. The tacos or ho-hum just average but still a great place to hang out"}
{"text":"The guacamole was great. Our server was really nice, although a bit slow. However the food was below mediocre. I got three tacos, the chicken, the cod, and the vegetarian, i could not take more than one bite from the chicken one as it was really not good. The vegetarian and the cod were okay but i have had better tacos. My friend had the chimichanga and it was also average. The decor on the outside deck is cool but the inside is a bit dingy looking."}
{"text":"Four of us went and two of us had the chimichanga and it was actually really good, the other two had tacos and they were terrible, small, dry pieces of meat, no seasoning and no sauce at all!  Drinks were average and expensive"}
{"text":"Went to El Jefe for dinner and drinks on a Wednesday night in summer. The patio is packed so we decided to eat inside. I had the Jalisco donkey punch, which took almost 15 minutes to prepare as the bar was in training?? For a $13 cocktail, I was a bit disappointed. Not sure if it should have tasted as tart but I moved on to the food. 
If you want realMexican food, do not come here. It is a play on Mexi-Cali cuisine, with lots of fish tacos and fresh guacamole made at table side. What the food does lack is authentic seasoning and flavour. I had the calamari taco, shrimp taco and pork taco. The calamari was rubbery and tasted processed, the pork was over cooked and dry, and the shrimp was tasty but also overcooked. 
Overall a disappointment as I've heard good things, but I will not be back. Patio and vibe are cool, our waitress was very friendly but had to keep apologizing for the bar and kitchen ( wrong tacos came out).  The food is pricey, portions are good but the food was lack lustre."}
{"text":"Went there with a friend on Wednesday night. It was very quiet but I image it get's busier on weekends in the summer. Great patio and atmosphere. Margarita's were fantastic, but the con-queso street corn appetizer left a bit to be desired. It was a tad bland and definitely not cheesy enough. Main's were 3 tacos, the matadoro, milagro pescata and rio grande. They were generous portions, but were a tad too saucy which over-powered the meat. 

Overall it was good, and I'd give it another try."}
{"text":"I absolutely love this place. Great atmosphere and tacos. Great addition to the village:) tacos and the Gauc!!"}
{"text":"First off, the idea of having 3 chatty teens work the front entrance; BAD IDEA.
Not the saviest move for an introduction to a restaurant.
The CHICKEN CHIMICHANGA was decent, feeds one.  With tax (pick up/take out), no tip; $18!?  Way overpriced.  The interior is dark and loud, wouldn't eat inside.
Most likely a ONE TIME experience."}
{"text":"Very cool new place in port credit .
It can be hard to get in during the evening on a Friday or Saturday as it's very small inside ! 
I was very impressed with the prices and variety of tequilas they offer ! 
I would definitely come here again !"}
{"text":"I was looking for a good restaurant to go with a nice patio, and I found one of the two at El Jefe. They have a nice patio which in the evening is nicely lit as well. Their menu is appealing with many delicious sounding options. My friend and I decided to stayer with the guacamole dip, which they freshly crush when brought to the table. Very tasty, but rather small and will go fast. 

My biggest problem with the restaurant was the time it took for our entrees to come, and the poor manner in which their error was \"remedied\". I ordered three tacos, as did my friend. It took nearly FOURTY minutes four our tacos to come... After over twenty minutes of waiting, our server asked if we had gotten them yet, we replied not yet. She came back about five minutes later to let us know \"the kitchen lost our chit and is making it now, she'll talk to the manager to see if they can do anything\". I thanked her, and about ten minutes later our food came. While the tacos were really great, they weren't worth the almost fourty minute wait.

To make it worse, they comped one of the taco entrees but not the other. This confuses me, because my friend and I both equally waited as long as each other for our food? Why would one be comped, and not the other? To add insult to injury, a table that had been eating beside us left after paying. A family of four was then seated shortly afterwards, and they got their meals at the same time at us (they ordered the same appetizer, too).

It was a real shame that the restaurant handled their kitchen staff losing a food chit in such a casual way. No management came out to apologize, it's unfortunate they handled such a poor, sloppy error in an uncaring manner. Definitely wouldn't return."}
{"text":"Waited over an hour after ordering to get very mediocre and flavourless tacos - nice patio for drinks but food is terrible and service is poor"}
{"text":"Myself and two friends went for dinner one Tuesday night and had a great time. 

We got a seat on the patio right away. We all wanted margaritas and when my one friend mentioned that she couldn't drink alcohol because of the medication she was on, our friendly waitress suggested a bunch of virgin cocktail options, including the virgin margarita that she ended up ordering.

We ordered guacamole for the table and I thought it was delicious. Maybe not as seasoned as I would make it at home but still delicious, and pretty impressive for a restaurant that has to cater to everyone's taste. A manager even came by the check on us and make sure the guacamole was to our liking. 

I had the chicken chimichunga for my meal, while my friends ordered the three tacos each. They both really enjoyed their choices, and my chimichunga was delicious. The chicken flavourful and all the ingredients seemed really fresh. 

I can tell this place is really trying to improve on any bumps that might have resulted from them being a fairly new establishment. Try not to be scared off by negative reviews here. I know other people might not have had great experiences, and I almost didn't come because the reviews seemed so negative. But we all had a great time, enjoyed our food and the atmosphere, and were impressed by the level of service. I think El Jefe is hitting its stride, so don't write it off just yet."}
{"text":"It's like El Catrin of Port Credit. 

Their design, such as the entrance, the bar, other decoration, it's like its the franchise of El Catrin. I actually asked our waitress if it is, but she has never heard of the place. 

I got chicken chimichanga and guacamole to share. They mush the guacamole right in front of you, so that's pretty cool. I still preferred the El Catrin's though lol. 

The chimichanga was really good. It was filling and very yummy. 

We found out about this place when we lined up for Fired Up. This couple who has date nights every Thursday night for the past couple of decades highly spoke of this place. I think it was alright, my friend was in love with it though lol. 

It's a good place to try out."}
{"text":"Came in on a snowy evening, not to busy.  The bartender was the guy who mixed our guac (which he did a horrible job BUT not his job usually.  It was slow and he did apologize explaining he doesn't normally do this.  The guac was delicious though)

Ordered tacos, which were pretty good , reminded me of El Cantin .

Our tequila types drinks was solid .

Service was great, bartender/server for us was super friendly and helpful.  

Defn will come back"}
{"text":"Terrible service. Took two hours to get my food. At that point, the taste of the tacos didn't matter. Average, but not worth the Wait. Ordered an app, did not get it, server forgot to tell us they were out till the end. DISASTER"}
{"text":"Normally from NJ/NYC, my boyfriend and I came to Canada for an extended weekend. While staying at Niagara Falls, we decided to take a drive up to Toronto and was recommended this place on the way there. Although we were looking for more of a brunch spot, we decided to give this Mexican restaurant a try. El Jefe opens at 12 on Thursdays so we got there at 12:02. We were the only ones there. The front of the building was very colorful- a whole graffiti/street art mural to the right and a cute outdoor seating patio to the left- perfect for summer! The place was small but very clean. Walls were filled with sombreros and day of the dead skulls. Because we were there right when it opened, there was only one person working there. She was super sweet and very attentive. Immediately we ordered some mango margaritas and chips & guac. The guacamole was made right in front of you and was probably one of the best guacamole's I've had. Beware of the death sauce!!! Super super SUPER spicy but delicious. Even I had a hard time eating it despite being a spicy food lover. We were told the chimichangas and tacos were the best, so I went for the chimichanga and my boyfriend went for the tacos. Food was outstanding. I had absolutely no complains about the chimichanga- except I accidentally put too much death sauce on and couldn't finish it. Otherwise a decently priced great meal and nice atmosphere. Looking forward to going back on a Friday/Saturday night or on a nice summer day."}
{"text":"3.5 - Just had dinner at El-Jefe and I agree with many other Yelpers, it has a very similar vibe to El Catrin downtown. The food portions are smaller and yes the drinks are higher priced but this restaurant provides a great atmosphere and it's still cheaper than going downtown. Their table side guacamole is delicious and the staff are warm and friendly as you get an opportunity to chat.  For being opened for 2 weeks, I have a feeling this joint will have a strong following. The tacos tortillas are hand made and the ingredients are fresh. My personal favorites were the shrimp and fish tacos. They have a great deal where you can get 3 tacos for $12 which allows you to sample a bit of everything. They also have a great mix of people and have a good selection of beverages ranging from sangrias to various tequilas. This restaurant provided Port Credit with a modern, fun and delicious Mexican experience."}
{"text":"Fantastic service, modern, authentic decor/setting and excellent drinks. Unfortunatly, however, the actual food was mediocre at best. Guac lacked acid (lemon, lime or vinegar), not properly seasoned and lacked garlic, cilantro and heat. 

Individual taco was the best item but not great and main, steak, eggs, salsa, cheese on tacos was really lackluster. My hope is that the menu can be tweaked to provide more authentic taste as I would love to go back!"}
{"text":"I have to say this is the best taco joint I've been too! Although it isLocated in port credit you'd really feel like you're in Mexico! Possibly chile. You have come here on a Tuesday TACO TUESDAY! 3 for 9$! I had them all!! Top three tacos Calamari, fish and shrimp all in that order. You have to try this spot! And don't forget the Mexican bulldog for a bevey"}
{"text":"CAUTION: this place is busy as heck and the wait time is crazy! Not to mention they dont have any chairs by the waiting area! So ladies if you are wearing heels..make sure you got someone to massage your feet! Also, they do not take reservations at the moment. We waited 45 mins to an hour. You also can not leave the place as they can't text you or call your cell.
We looked at the menu in the meantime...

With that being said...the hostess encouraged us to order drinks by the bar while we wait, but everytime we went to the bar to order, we were ignored 3x and we felt like we were in the way. So we gave up on that!

When we finally got seated, ordered our drinks. The service was sloooowww.... but eventually the food came out! We ordered the Chicken Chimichanga-huge portion and full of flavour. We also ordered the 3 tacos (pork, beef, and calamari), mexican roulette, steak and huevos rancheros. All were great but not amazing! They had good flavours, some were lacking but overall great. By the time we were done it took almost 3 hours from waiting to ordering to finishing our food to paying. Sighh...

I would wait to go back once they have a better routine and service going."}
{"text":"I was extremely excited about this place but the food isn't as great as I expected to be. The guacamole really needed some citric flavour. They should squeeze some lime into it. The tacos were okay. The only taco I enjoyed from my Fish, Chicken, and Shrimp taco has to be the shrimp taco.  Other than the food the interior and customer service was good. I will give it a try again to check out their drinks and patio when the weather gets better."}
{"text":"I have seen some mixed reviews on this place, but when my fiancee and I passed by and saw it, we had to try it.

I ordered three tacos and he ordered the dirty rice and we were both really impressed with the great flavours and the price point. 

The tacos are fantastic! I had originally wanted to order enchiladas, but our server said they were being recreated due to poor reviews. It seems they really care about what the patrons have to say!

I definitely recommend checking this place out - the atmosphere is awesome, the food is great, and it's a perfect place to meet with friends on a hot day.

We will most definitely be coming back."}
{"text":"I have to say I am mostly disappointed at Insauga.com and their reviews. To say the El Jefe is the hottest new restaurant opening in Mississauga is a sad reflection on the quality of their reviews. They must have known that reviewer was coming and rolled out the red carpet.  The food and service are equally as miserable as the reviews that praise this place.

The only thing this place has going for it is a bit of ambiance on the patio, if you can score a 4 top table. The tables for two on the patio feature steel stools that are as comfortable as sitting on concrete. Even the 4 tops have a steel cross bar underneath, (for some unknown reason since the rest of the table has steel legs and a concrete top) that make it impossible to get comfortable.

And with the band playing at Shore across the road, the patio music which is a mix of house and something else, is drowned out by 80's cover songs. It may have been the 9:30pm, close to kitchen closing 10pm that was the reason for the bad food, the but the shrimp taco was cold and filled with crunchy cabbage, and the taquitos were also cold.

Their service is slow and if you forget to ask for something when your food arrives, good luck in trying to get it within a reasonable time.

Hermanos across the street has tacos which are 20% cheaper and 500% better. So if you value sitting outdoors on the Lakeshore as the prime reason for going to El Jeffe, then you might actually like it. But if you go to get good food and prompt service, you'll probably be disappointed."}
{"text":"I was excited that a Mexican restaurant had opened up in Mississauga on Lakeshore. My gf and I had come here during their soft opening period. It was just before 5pm on a Saturday and we were told it would be about a 40 min wait for a table of 2. They were not taking any reservations so you give your name and wait along the side ledge at the front of the restaurant or you can try to grab a seat at the bar. It would've been great if they had taken down our cell number so that way we could walk around Lakeshore to bide the time. We were asked several times by the wait staff if we wanted to grab some drinks at the bar but we were ignored 3 times when we tried to. When we were finally seated after about an hour, our orders were taken and water was provided. At times our server was confused since she was being helped by another server. For instance, our orders were taken and then we would be asked if we were ready to order a few minutes later. 

Anyways, ill get to the food. The chicken chimichanga I ordered was delicious. It was very crispy and had great flavours, chicken was moist and not dried out. It was also quite massive. The gf ordered the steak and huevos rancheros which weren't bad but not something I would order again. We also had the Mexican roulette which were cream cheese stuffed peppers and one of them was filled with hot sauce. Although it would be avoided by most, I loved the hot sauce filled pepper! Lastly, we finished the meal with the beavertail taco which a cinnamon dusted crispy tortilla with mascarpone cheese and berry compote which was good. The food was decent enough that I would like to try this place again but only after they've worked out the kinks. I'll give them a reprieve for just opening up."}
{"text":"Not a bad place, but far from perfect.

Staff: Service was friendly but was a bit slow. They did come by every so often to let us know that the food was coming a few times. Luckily, I was with great company so I didn't notice the lag time as much.

Ambience: When you enter from the street there is a long corridor leading up to the entrance, so that made it harder to spot. When you walk in there was a big open space and some tables in the back. The seats were comfy and the dcor was nice.

Food: I had the Chicken Chimichanga which was super delicious and perfectly filling; I highly recommend it. I also tried each flavour of empanadas (Cheese, Chicken, Beef and Chorizo). The Chorizo and Cheese were good but the Chicken and Beef were not very flavourful. For dessert I had the Churritos and they tasted as expected, though I wish there was more on the plate for $7.

Overall, the Chimichanga was the highlight for me!"}
{"text":"Long waits. Sub par food. Overly sugared drinks. Overwhelmed staff. Don't bother. 

Food was the biggest let down. Cold tacos, half filled, with the stale tortillas broken in half. 

Doesn't feel like they're working for any repeat business. I'll be amazing if still open in six months."}
{"text":"I came here with some friends because we saw the past a couple days ago and it looked new. After a little research we found out that they only opened on April 21 ,2016. It is mainly a tequila bar but they do have food too. We only came in for drinks so that is what I will review here. They make traditional cocktails but with a Mexican twist such as an old fashion and Arnold Palmer. They have regular tables but they also have seating in the bar area so space is not really an issue, plus once they open their patio there will be much more seating. I think the patio will be a huge hit once the weather gets better so if you want to sit out there you should try to get there early."}
{"text":"My cousin, another friend of ours and I all dined at this fun Mexican restaurant last week on Good Friday for the first time. It had great details in its patio design, Mexican street art in its alleyway entrance, details inside like the wall decor, bar display and lighting. 

Service was also good. It may have helped that the restaurant was only about half full when we came here for lunch - didn't mind that at all since we had a bit of a hard time hearing each other over the music as it was. I've heard it gets busy at night here though and it was the long weekend as well.

We liked several of their menu options but ended up getting the fresh guacamole and chips to share as a starter, along with our own trio of tacos each. The guacamole was served in a cute mortar and pestle set and made in front of us. It tasted fresh, filling and it was a great portion for 3 hungry women. 

Next, my trio of tacos came shortly after. I got the fish taco, calamari and veggies - they had fancier names for these on the menu but I don't remember it at the moment. They were each stuffed with fresh veggies and creamy sauces in a soft tortilla shell. The portions were larger than expected for the price and as much as I love fresh corn tortillas, the soft flour tortillas held all the parts of the taco better. For me, the combination of veggies and sauces were the best part of the tacos. I didn't taste much of any seasoning on the fish and calamari when I tried pieces of them without the sauce and veggies. This was the one downside here.

I would still recommend this place though for the experience and overall, the food was decent. Next time, I'd want to try some of their other food options, drinks and desserts (didn't have room)."}
{"text":"Ordered the El Jefe lager and the chimichanga. Based solely on this meal I wouldn't come back. The beer was very light to a point of almost no taste. If it were a coors lite or something similar, I'd never know.
The chimichanga outside crust was pretty nice. Was crispy and had a good glamour to it. The stuffing was basically bland ground chicken. Very one dimensional flavour. Others had the tacos and said they were alright but nothing special."}
{"text":"El Jefe has a long way to go...but I hope they make it as the concept is great!

All the staff seemed more interested in hanging out with each other than serving their customers.

Bar-tender was fairly apathetic and seemed annoyed we were there.  The hostesses were too busy getting hit-on by teenagers to notice that two tables had opened up...at this point we had waited almost an hour.  The servers took forever in getting our order and then left our food to get cold while they took pictures with a nearby table.

Food was average at best and was inconsistent (re-ordered the corn-con-queso back-to-back) and got totally different dishes, neither of which were that fabulous.  Tacos were bland and needed some heat.  The one highlight was the corn, fire-roasted and dredged through Cojita  and cayenne...although it could have been grilled a bit more.

On top of that, the Manager was standing in the doorway of the emergency exit, smoking into the restaurant.

El Jefe will do well until the \"new\" wears off but will need to improve greatly if they're going to stay for the long-term."}
{"text":"Waited in line for 45+ minutes for this place....totally worth it!  The space is tastefully done, the service is friendly, and the prices are in line for the quality of food and portion size.  LOVE the fact that they do table-side guacamole.....super delicious.  The mains are delicious too....and so are the adult beverages.  Cannot wait to go back."}
{"text":"We were there nearly an hour before they even took our food order, and for a single course and two round of drinks, it took us 3 hours all up.

The food came out not far off room temperature, the veggie dishes pretty bland, we had to send a few drinks back because they were completely wrong (like made wrong, not like they sent the wrong ones out), and the ones we did get were honestly awful. Maybe the bar staff was just new or inexperienced that night, but it was pretty bad.

And fair warning that meal service is probably best earlier. Later it fills up real quick with a very very young drinking crowd (fair enough of course - but more FYI).

I haven't had a dining experience like that in a while... There's a lot of great stuff around there I'd suggest otherwise."}
{"text":"Finally a solid Mexican offering in Port Credit. Just opened (official opening is Cinqo de Mayo) so understandably a few kinks to work out, but I am giving them a 5 star rating regardless. Why you might ask? Let me tell you:

5/5 Service: from the greeter at the door to the wait and bar staff. Everyone introduced themselves and asks your name. Been there twice and the all remembered! That's seriously rare in this day and age of lagging customer service.

5/5 Drinks: if you like Tequila this is the place for you. Their innovative cocktails are flavorful and unique (and the don't skimp on the tequila- they pack a punch!). 

5/5 Food: The food isn't overly spicy (although some of their drinks are) but if you want to turn up the heat the have plenty of hot sauce options from tasty to face- melting!  I have had the corn queso dip with plantain chips, the taquitos, the amazing chimichanga, and a variety of tacos (the seafood and white fish are divine!! Steak and pork great too). So many other items I want to try but can't do it all at one sitting... Oh but did I mention they make their quacamole table side when you order? So it's always fresh!! Seriously the food is amazing. 

5/5 Atmosphere: been to cold to try out the patio but the mural, twinkle lights and wooden deck are all calling my name. Inside is smallish but they have done an amazing job fitting in tables and the bar without feeling cramped. 

Definitely my go-to for Mex and Tequila."}
{"text":"We came here last Saturday to enjoy one of the last few nice days of the year. It was nice enough to sit outside. 

We got the Mexican dirty rice and a trio of gringo (vegetarian) tacos. And I also got a virgin margarita.

The rice was delicious. My only problem is that it wasn't enough. We were expecting a much larger portion. The tacos were also so good. The jalapeno sauce in them was amazing.

We didn't like the margarita at all because it was far too sour, but I guess they're not used to making virgin margaritas. Next time we'll stick with the jarritos."}
{"text":"Quite possibly the most OVER-popular Mexican restaurant in the GTA. The atmosphere is good, and I couldn't even complain about the service, but the overall food quality is very 'meh' and over-priced. The reviews of this place are not good, and yet people INSIST on constantly coming back simply for the instagram posts. It's sad...considering this is probably the ONLY not-great restaurant on Lakeshore near Port Credit."}
{"text":"Service:  1.5/2 out of 5 - long, unnecessary wait time, disorganised system
Food:  Would be a 2.5 or even 3 out of 5 IF the tacos were served at the proper temperature

Lotsa waiting here, folks.  Even on a cooler Tuesday evening around 7pm for dinner.  

The nice guy at the door told me that the wait would be ~30 minutes.  No call or text back system instilled here, although I think that it would be very useful.  More than 30mins later, I went back, was told we were the next table of 2, and that we could wait at the bar.  We waited there for quite some time and when we weren't going to get a table, we ordered food at the bar.

Then the guy at the door said that a table was ready for us, so he just told the bartender to bring our food over.  No problem.

***Wait in total to get seated, at a table, was more like an hour.***

We ordered Taquitos & 3 Tacos.  They came within 10mins.  I was quite surprised seeing how it took so long to get seated.  Taquitos (3) were pretty good, but we weren't told what ingredients were in which taquito.  The 3 taquitos, a.k.a. \"Mexican spring rolls\" were totally shareable between 2 people.  Enough sour cream, but could've used more pico de gallo...there was like a teaspoon full.

Next, onto the tacos.  We got Chicken, Calamar Baja (breaded calamari), & Camaron (shrimp), 3/$12 or $4.50.  There was an obvious problem with the temperature.  Tortillas were not heated up, sorta hard, and the tacos were slightly cooler than room-temp - straight up cold.  Very strange and definitely affected the taste of the tacos.  Chicken was the best and although calamari/shrimp were breaded, they were good, but on its own - excluded the sauces - a bit tasteless.  Shrimp was overcooked, but I'm just nitpicking here.

As per the other reviews, the tacos were also quite small.  They were 2 large bites - 3/4 smaller bites.  Hermanos, across the street, are much larger and cheaper.

Service seem rather disorganised.  The bartender came to our table a coupla times, I flagged down a girl for our bill, then never saw her again, & another female waitress cleared our table.  We could've been in/out of the restaurant within 20mins, making a space for someone in line, but it took forever to get the bill.  We just ended up going to the bar to pay. 

Stool seating is rather uncomfortable.  Tables in the front are awkwardly placed with a HUGE space as soon as you step foot inside the restaurant.  Tiny dance floor perhaps?  Better tables are at the back.

Overall, this place has good potential, but they need to instill some kinda system to provide consistent service.  Something like a waitress for the front tables and another towards the back.  Food is ok, but they have to work on portion (too small) and temperature (cold tacos)."}
{"text":"Well, looks fancy but food and service here is horrible. I ordered Gringo taco and guacamole. It came after the wait of 45 mins, both of them taste just so plain. Their serving style is very fancy just like El-catrin but food does not taste even average. I also asked for beer on tap , The server herself told its not good an asked me to order something bottled. 
Patio is good if you want to have a drink or two."}
{"text":"Blah, nor that great. No salsas served with the tacos. Drinks are strong and actually good of you like tequila but expensive.  I much prefer authentic mexican like LA Catrina in Brampton."}
{"text":"A+ for atmosphere, a super long patio with pretty lights, the inside is a little different but... THE PATIO. lol. One thing is the booze is expensive for what you get (as expected since it is a great hangout on the weekends and people are going to pay the pricetag), BUT I really liked the tacos.  I got the shrimp, pork, and fish tacos and I enjoyed all of them.  I don't know how it will work in the winter, as I said their inside is a little.... weird? (I don't know how to explain it, sparce?) but nothing some good heaters on the patio can't fix."}
{"text":"25 minutes to receive my drinks and close to 40 min before apps showed up. Ordered tacos and the guacamole with chips. The cod was great, pollo and pork not so much. Overall the tacos lacked in portion. More soft tacos than filling. Pork was overdone. Service was slow, although the staff did apologize...maybe they were having a  bad day."}
{"text":"The tacos are nothing special at all, below average if anything. I ordered 3 tacos for $12 (carnitas, calamari, and fish) and I was disappointed with all 3 of them. They don't warm up the tortillas which is a shame because cold flour tortillas aren't my thing. The fish was also cold, which makes no sense to me because how can something that's suppose to be fried become that cold unless it was sitting there and just warmed up when ordered. The calamari was bland and was just overly dressed with sauce; the ratio of meat to sauce is completely off. The carnitas taco was the best one out of all, but that's not saying much because it wasn't great. 

If you're looking to get some good tasting tacos do not go to El Jefe, go across the street to Hermanos Mexican Grill where they serve you fresh tacos with flavour. I won't be coming back here which is a disappointment because I visit Port Credit often and had high hopes for this place, but sadly all it did was disappoint my expectations and my tastebuds."}
{"text":"We had tacos. And it was out of this world! I was delicious. It was soft, crispy and refreshing. Washing it down with a nice cold beer made it just absolutely perfect.  It took some time to be seated. Buy it was definitely worth the wait. You must go!"}
{"text":"Came here on Saturday night with a group of four. This place does have a lot of potential. The drinks were really tasty and service was prompt. The only thing that soured our experience was a server was way to drunk and annoying the patrons. When my friend was paying this server finger-banged her cleavage and tried to play the bongos on her butt as she was trying to escape. This server was loud and intrusive. I enjoyed watching her annoy the other patrons. When it came to us we left lol."}
{"text":"The staff are very friendly however the food lacks flavour. We came here on a Saturday evening for dinner. They had a DJ setting up and played some pretty cool tunes. You can tell that the place has a nice and fun night vibe. The food was mediocre however I would definitely come back here for a drink and enjoy the ambiance!"}
{"text":"We went to El Jefe last week for the first time. We figured it would be really busy on the weekend, so we waited until Monday and went early (6:30) to miss the crowds. 

We were greeted as soon as we walked in and told that there was a big party coming in, so they only had one table by the door or the bar for us to sit at. We chose the table by the door and were given menus.

A very friendly waitress approached us right away for drink orders. I ordered a 9 oz glass of sauvignon blanc and she came back a moment later to say that they only had enough for a 5 oz glass. I said that was fine and she brought it over right away and said it was complimentary since they didn't have what I had asked for. I LOVED that! They also have 1/2 price margaritas on Mondays, so I had one of those too. It was delicious! It was just the right balance of sweet and tart.

We ordered the guacamole en la mesa to start, which means she brought over the avocados and other ingredients and pounded in a mortar with a pestle, right at our table. It was served with lots of freshly made tortilla chips and was absolutely delicious (and a huge serving). We also ordered the shrimp ceviche with came with another huge portion of tortilla chips. We honestly could have only had those two appetizers and it would've been enough for the three of us. 

2 of us each had the taco trio, so we ended up trying the Rio Grande (chicken), the calamar (squid), the carnitas (pork) and the matadero (beef). They were all tasty, but the calamar was definitely the best. Crunchy and perfectly cooked, with a delicious aioli and pico de gallo.

My husband had the steak and huevos rancheros, which was two crispy corn tortillas topped with beans, beef, cheese and fried eggs. He loved it and said he'd definitely order it again.

The service was fantastic! The waitress was very attentive and so friendly. She was over at our table at least 10 times while we were there. 

The food was fantastic and the atmosphere was also great. We will definitely be going back!"}
{"text":"Cute little restaurant with a lit walkway that leads into a cozy area. Coming from Florida, I was craving some tacos & my cousin brought me here. Pretty average pricing with a good selection of entrees & appetizers to choose from. I got the Mexican fried chicken which was perfectly seasoned & crispy with every bite. Beans had a tangy taste since there was apple in it. The chimichanga looked pretty huge & enticing with cheese oozing out as you cut it down the middle. As for the fiesta dip, seconds please! I didn't get a chance to try the tacos but it sounded pretty good, especially the one with the pork belly & calamari, something I'll try next time in Canada."}
{"text":"The bartender was so drunk he was only interested in getting drinks for his friends who were there.  In the middle of ordering he threw his hands up and walked away because the order was too long for him.  We watched him drop the mixer and spill the drink everywhere.  He was so drunk he was slurring and sloppy!  The staff is incredibly rude and under trained.  We asked one of the staff if we seat ourselves he shrugged and walked away.  They forgot about the tacos we ordered.  After the second reminder we finally received it. The ceviche was terribly dry and had almost zero shrimp in it. We ended up giving it away.  One of the bus boys had to ask for permission to have a drink yet no one was cutting off the totally wasted bartender.  It seemed you were only getting service if you were friends with the staff or white! I would never go back to this place and would like to report to the owner about this extremely unacceptable behaviour on the staff's part!"}
{"text":"Was invited to a yelp event here .    Food was great.  Atmosphere was very lively.   Great service"}
{"text":"Not bad I had tacos which had a lot of mayo on them. My bf got the wet burrito he said it was good. The guacamole was good too with house chips. The not so good part is our waiter, he took everything away and then didn't come back period. We actually had to ask a waitress from another table to get more food in as she informed us the restos kitchen was closing in 5 min. HAH...we got our order in and music got louder not complaining just stating. The bar seen had come a live. Also I had the $5 wine and it was good"}
{"text":"My favourite would have to be the calamari taco and that's about it.  The other meat tacos came out dry and cold.  Decor was nice. Ambience is nice and the patio is a nice secluded area.  Server was friendly and attentive. Food wasn't that great, I've definitely had better which is why I gave it a 2/5 star."}
{"text":"Love it! Came here last night with a couple of friends. They were very accommodating for us as we have a newborn and needed to move to accommodate our stroller. They have a good selection of tacos- chicken, beef, pork, cod etc, with a choice of flour or corn tortillas3/$12. We had one of each on the menu. I had beef and chicken- beef was great. Still thinking about those tacos! Don't think the chicken was made right though. Meat was a little dry and didn't taste like much. I could only taste the avacado and lime slightly. Churros were amazing. Cod tacos were great as well. They have $6 coronas as well. Will definitely be back. I can't wait to come back and sit on the patio."}
{"text":"The food is pretty good but a little pricier than most Mexican restaurants. The server was sweet but our service was extremely slow from getting our orders taken to getting our food to the table. We waited for 45-50 minutes for 2 entrees and 4 appetizers to come altogether. Also, their set up and strict seating on the patio cannot accommodate any party larger than 4 to sit together- this was a bit awkward and uncomfortable to try and socialize with your party. The area is narrow, but maybe they can get smaller tables that can be moved so it's not a safety/ fire hazard. So if you're going with a group 4 or less, this would be a better experience."}
{"text":"Excellent atmosphere, service and cocktails.  Rating it a 3 due to portion sizes of meal.  Simply not enough food per serving... Particularly when you consider the price point and similar restaurants like Playa Cabana where you feel full after 3 tacos (at a similar price).

Lots of potential though and will definitely try again."}
{"text":"This place is amazing guacamole dip is the best I have ever tasted. Ambiance is great staff are very friendly.

Tacos are so tasty:)"}
{"text":"From the street the long bright patio catches your eye and intrigues your brain to want to see what else is happening in there. Go! It is a great spot and a welcome addition to the Port Credit vibe. Which at the moment is more vibe than good restaurants sadly (Port Credit that is). I wasn't sure if it was a family-type place at first but soon saw other kids and felt like we were not intruders. The staff is fabulous. Super friendly and accommodating. I like the use of the \"day of the dead\" decor and colorful touches in a space that easily turns from daytime resto to evening bar. This would be a great place to chill with some friends and enjoy bites and drinks. We tried the taco trio and enjoyed them. Great if you are gluten free as their corn tortillas are great. The flavours could be punched up a notch but over all you are getting a taco stuffed with fresh ingredients 3 for 12$. 

I will return, atmosphere, staff and food all added up to a \"yay\" in Port Credit!!!"}
{"text":"Hm so I have mixed feelings about this place...

I am glad Port Credit is growing and opening up new and exciting places for drinks and food.  There is ample street parking all around.

Patio: they have a pretty neat patio with fun wall art.    PC can always use some more patios in the summer! However, it is between two buildings (almost looks like in an alley), as such in the summer doesn't get much sun.

Drinks: they have a large variety of different types of drinks, most (if not all) with tequila. I'm not a tequila drinker, so I did have them swap it out with vodka for one of the drinks I picked out (and they did so without any problem). I did think the prices were a bit steep for something that did not really seem like a \"crafted cocktail\".

Service: our server was a young female, probably in her early twenties.  I got the vibe she was trying hard to start some conversation and throw in a laugh (can't blame her for effort!) However at the end of the night she pulled out her phone and used her calculator to do some simple math when we paid. It was a bit tacky, and if she really needed  to use a calculator she could have walked away to do so.

I wasn't blown away by this place and am on the fence whether I will come back to try the food."}
{"text":"Wanted to check this place out when they opened, but they kept on closing down for lunch since they didn't have enough \"food\" to be open for 2 meal times. (I called them before going there.) So now, I made it and .... 

The place is smaller than I thought. They have a long front patio area which was definitely too cold for today. Once, you enter, there was a cool wall with bunch of sombreros. 

Service is slow for Sunday lunch and 3 items were not available from the menu, including the empanadas that I wanted to try out. They left the door open, so inside was freezing cold!! They also didn't have the drink that I requested. 

Happy: The 3 tacos that I ordered was good and it felt freshly prepared as the meat (fish, chicken and calamari) was not cold. 

Not happy: The 3 tacos were small and not filling at all. The presentation could be done better. They could have put them on a taco stand (like Moxie's do) and it didn't come with any sides at all. It would have been nice with a bean salad or corn salad or something!! And it was definitely not worth the money!! It should be 4 for $12 or 3 for $10 instead of 3 for $12. 

I'm small and I wasn't satisfied at all. I could eat another meal!!

Oh yeah, they messed up my order! The waiter apologized, but the kitchen staff need to look closely at what they are making. 

My partner had the steach and huevos ranchos which he liked the taste of it, but again small on quantity of size to be satisfied for a guy. 

Verdict:  It's great that they have another Mexican place in Port Credit, but I wouldn't go back to it at all. I'll rather try another restaurant along Lakeshore. Not worth your money!! Even for a tapas place, I can go somewhere else."}
{"text":"Awesome Mexican food. The atmosphere is great and the servers are super funny! It was a great first experience and the tequila drinks are delicious!"}
{"text":"There seems to be a lot of negative reviews about this, but I've been here three or four times and haven't had a bad experience! All their veggie tacos are phenomenal, the guac was good as well! I haven't had too much of their alcohol, but I'll definitely come back sometime this summer to try it out."}
{"text":"I've mistakenly been here twice. (My friend wanted to try it out.)
Tacos are mediocre and service is subpar.
I'm not a fan of their guacamole either. Okay, I'll accept the fact you guys add garlic to your guacamole.. but red peppers too? You guys are killing me here.
The food took FOREVER to come out. Question though, why was my food cold?! The meat wasn't strained properly because it was leaking everywhere. 
Service needs to be more professional. I honestly feel like I'm chilling at a pub from university at times. With the loud music and all the bros arounds.
Needless to say, I definitely went to hermanos across the street to pick up some edible tacos after I wasted close to $20."}
{"text":"Amazing food and loved the guac being made fresh at your table! Could have used slightly more salt though. Will definitely be returning"}
{"text":"I've been wanting to try this place for a while but was worried because of some bad reviews. I came here for lunch , was seated immediately by a server who was incredibly nice and attentive. The food was amazing, all looked and tasted great. One improvement I would say would be smaller tacos, they just look a little messier when they are large but that's just my opinion. Otherwise great, recommend the pitchers of margaritas, they really know how to make em!"}
{"text":"El Jefe is a bar that serves food. The menu is fairly limited. It is a nice patio spot in Port Credit. Like Door Fifty-Five, the owners have done a solid job in decorating and setting the ambience. 

Decided to try the trio tacos and the chimichanga. The chimichanga was good, it's the reason I'm giving 3 stars. I was pretty disappointed by the tacos, particularly the fish. The steak and calamari tacos were not bad, but left something to be desired in terms of taste, size and presentation. 

We tried the white wine sangria and the El Jefe lager, both were very good.

Overall I would definitely recommend giving El Jefe a try this summer. Great for the patio, or at the bar."}
{"text":"Agree with Owen R's review. Way too loud and dark inside. Food took too long to come out. Went there on a Friday night. It was busy and patio was full. After waiting about half an hour for inside seating we were seated on uncomfortable metal barstools. I ordered the 3 for $12 tacos and the best one was the calamari. The beef isn't too good. Not much flavor. Tacos are fair size. Also ordered the beef enchiladas. Spicy but sour!? So odd. No sour cream and very little cheese. I could taste the grittiness of the spice mixture. Not a good dish. If I do come back it will be during the day when it's less busy and make sure to sit on their beautiful patio. We were served by the bartender and he was friendly and competent. But he turned up the speakers too loud! Understand it was a Friday night but seriously it's not like a night club. No need to have to yell in order to be heard by the person sitting across from you."}
