{"text":"Legitimate real deal Mexican. The place is no frills. The service is not always the most friendly and sometimes the language barrier leaves me uncertain of what I actually will be eating.  The chilaquiles are phenomenal & better than any I've had including in Playa del Carmen! Add the chicken to them. I always get the chicken tacos, rice and beans and I'm NEVER let down. I love the fresh radish & cilantro. 
They usually take your appetizer order with your main course. Everything comes out at once or you get your meal then your chilaquiles. I would advise ordering the appetizer and when it comes out order your main course. I'm always stuffed when I leave. The food is really delicious. 

Oh! Did I mention its BYOB?!"}
{"text":"David has nailed it.  El Milagro is authentic Mexican cuisine.  And the staff is super friendly; you feel right at home. I highly recommend this restaurant."}
{"text":"I was completely impressed!  When we walked in, the decor wasn't all that which made me think this is all about the food, and it was.  Authentic and tasty.  Met and spoke with the owner and was taken by his hard working ethic!  Cannot wait to go back and try something different!  Again, dont judge by appearances - give it a try!"}
{"text":"There are not enough superlative words in the English language to accurately describe the most delicious, tasty, real, down home, authentic Mexican cuisine one will find almost anywhere in the United States let alone Pittsburgh itself. In fact, the entire experience is a genuine blast which will instantly, if only temporarily, transport you to Mexico City.

To begin, this review can be difficult to understand (and explain) unless you have (A.) been to El Milagro as a patron or (B.) spent time living the life most Mexicans live in Mexico (and don't count time spent in a secluded resort at Riviera Maya). 

First, walking into El Milagro is akin to walking into a local \"5 & 10\" neighborhood store from yesteryear.  I write this because the store is not set up to be what most think as a traditional restaurant.  The store is old with little decoration but has beautiful, newer El Milagro signage, a squeaky door which has a padlock on it, and no host or hostess or even a \"seat yourself\" sign.  Once you've entered you will most likely see a group of the working class Hispanic community having fun and devouring the most incredible food anywhere north of the border. Help yourself by proceeding to the beverage cooler and selecting anything to drink from inside.  Generally, the options are bottled water, glass bottled Coca Cola, and several flavors of glass bottled Jarritos (bottle opener near cash register). After choosing your drink(s), seat yourself.  Don't expect perfectly new tables, soft cushioned booths and lively music in the background.  There are old tables and chairs (a few non-padded booths by the giant bin of jalapeno peppers at the cash register) with either one or two large televisions that may or may not be turned on. If ambiance or fine interior decor are part of one's checklist to a fantastic meal you will need to rethink your requirements because El Milagro's food far surpasses restaurants with even the snootiest of decoration.   

Once seated, you'll be visited by a cook/chef/server (most likely functioning as all of the above at once) with some menus.  If you don't speak Spanish don't have a panic attack. After you begin to read you'll see most of their menus have dishes descriptions written in English underneath the Spanish.  The items on the menu are impressive and as authentic as Oaxaca itself.  This menu has been tailored to versatility with so much to choose from you could order new dishes for weeks upon weeks. Believe me, you aren't going to find burrito el jefe, guacamole with shallots or yellow cheese.  Many people won't believe their American eyes and may question things but they'll be wrong to do so because those who do have never had food from a true Mexican kitchen .... til now.

Once you've chosen from one of the many authentic meals available you'll place your order at your table with someone who may speak a little bit of English.  Please be precise, careful and order slowly to make sure they understand exactly what you want.  El Milagro caters any dish to how you prefer so be pleasant but exact.  The service is slow at times depending on how many diners are there, time of day and the kitchen staff.  Patience is a virtue and you will be well rewarded. 

Personally, I order tortilla chips with salsa with most of my meals here (no, this restaurant does not serve free refillable drinks & endless pre-made chips like many places).  El Milagro has several salsas all of which are fresh as can be and as true to their roots as the sun is to earth.  Their salsas are fantastic but beware as traditional salsas are often very spicy to the Pittsburgh palate and theirs are no exception. And, as a side note of interest, El Milagro will bring you green salsa unless you specify another type. In my opinion, their green salsa is the best salsa (in any style) Pittsburgh has to offer, hands down.  The tortilla chips will be freshly cut, fried and piping hot. As simple as it is, this is pure culinary heaven (if you believe in that sort of thing).  

Once you are served your meal, you'll instantly be able to tell your authentic, home style meal is made to 100% made to order with Mexican love, fresh ingredients, and no short cuts or American liberties. They cook their food as it should be and is made in Mexico.  And, it will taste and smell absolutely AMAZING.

In my experience at El Milagro, I've had at least three dozen meals many of which come with rice and beans. Check that, true rice and real beans ... not yellow rice and refried beans. 

EVERY SINGLE DISH I'VE HAD WAS A FRESH, PERFECT CULINARY MASTERPIECE FROM A REAL MEXICAN KITCHEN.

By the way and this is important, you'll have to pay CASH ONLY at the register at your convenience.  El Milagro is moderately priced and will never hurry you along by presenting a bill. 

Absolutely the VERY BEST.  No local comparisons since El Milagro far surpasses everyone else. The food deserves much more than 5 stars. RECOMMENDED."}
{"text":"January 3, 2018

El Milagro is OPEN, it has simply been renamed El Paisano (The Countryman or The Citizen: english translation).  The EXACT same food, same employees, same amazing cooks, with updated menus (same value prices), a coat or two of yellow paint on the walls, a new sign out front and some vinyl tableclothes all around.  

Read my review of El Milagro/El Paisano ... same exact thing but maybe better than I remember if that is even possible.  Even with some new local authentic competition El Paisano is still the ABSOLUTE BEST authentic mexican food in the entire Pittsburgh metropolitan area.  

Seriously, if one likes (or loves ... or is interested it trying) authentic Mexican food you should come here.  Of course, El Paisano is so good it could possibly ruin every other restaurant from here on out because none will be as good as this one.  Remember, you are coming for the food, not the decor.  On cold days such as these I highly recommend Caldo de Cameron but everything on the menu is fantastic."}
{"text":"I had 3 tacos de Carne Asada, rice and beans. I went ham on the tacos, best tacos in Pittsburgh. Reminds me of the tacos back home in Chicago, where I would move back just because of the food. The rice I have to say however, was not so good. Not good at all. I don't even know what to say about the beans, as they taste weird. I don't what to compare them to. From a can? Too watery? Who knows. The restaurant itself is nothing more than a Mexican joint. Which is cool because that is what it is. Though poor rice and beans, I gave this review 4 stars because the tacos were just way too good for you not to try. It's a must. Definitely will be back."}
{"text":"Real Mexican food in Pittsburgh? Hell yea! Probably the most authentic I've had in Pittsburgh. Tacos were great and sopes weren't bad. Will be back for sure."}
{"text":"I was extremely disappointed with El Milagro. I went here with high hopes of finding quality Mexican food in Pittsburgh, but was very let down. My boyfriend is from Oaxaca Mexico, the culinary Mecca of Mexico, so we've had many amazing Mexican dining experiences over the years. This was sadly not one of them. The chips and tortillas were very greasy, the quality of the meat products was low, the salsa was a strange pea-soup green (not salsa verde or guacamole) and they served my food on a burned styrofoam plate. Even the service was poor - many of the workers seemed to lack caring about the quality of the food and the environment. Please do not think you're getting \"authentic\" Mexican food just because you're eating at El Milagro. There's much better out there. It's food like this that gives a bad name to the vibrant Mexican culture and their gastronomy."}
{"text":"Get 1 campechano (or carnitas) taco; 
get 1 milanesa torta; 
get 1 mexican soda. 
Enjoy. Be happy."}
{"text":"Fantastic tacos!  Carnitas was my favorite but asada was great as well.  Got a cheese quesadillas for the kiddos.  They serve a delicious green salsa that's super spicy and great on everything.  We will definitely be back!"}
{"text":"Not a typical restaurant, but I didn't care. Just give me good food. 

Most authentic Meixcan food in Pittsburgh. My first time there, it was a little hard figuring out the menu and communicating with the staff, but once I got my food, I was more than satisfied with the quantity, quality, and the price."}
{"text":"Serious Mexican.  Don't be off put by the fact that it looks like a Mexican convenience store.  Walk to the back and have a seat(if one is free).  The two ladies in back are going to cook you some of the best Mexican of your life(don't roll your eyes.  I know Mexican food.  Just trust me)  I had the green enchiladas, though the mexican construction workers next to me had the lengua torta(tongue sandwich) and it looked a-maz-ing.  Go here, don't be intimidated.  Eat everything."}
{"text":"My boyfriend came home from work one day and said that one of his coworkers whose husband was born and raised in Mexico, had said that El Milagro is the most like authentic Mexican food that he has ever had in a restaurant.  Mexican food might be our favorite, so we had to go.  

It is amazing.  The restaurant itself is nothing great, and the one and only reason I didn't give a full 5 stars.  But the food is awesome.  The homemade chips and salsa were out of this world.  Next time we go I'll be buying a bag of chips to take home.  I forget what I got for an entree but I remember thinking it was so good.  

Definitely try this place, it's a hidden gem."}
{"text":"The only reason I won't give this 5 stars is because it is not fancy at all!!!  I'm s a bare bones operation, but don't be afraid. The food is authentic and very good.  Spice level is high.  Beware of the complimentary sauces placed on the table."}
{"text":"Excellent!!!  This is the place for authentic Mexican.   I had the vegetarian enchiladas verde. The veg. Version cost a bit extra but it was so worth it and most divine as it came with plentiful and fresh avocado. The tomatillo salsa had the perfect amount if spice and flavor. Hubby had veggie flautas; I inly had a bite but he seemed to enjoy them. This is a small but active place in Beechview with a tiny Mexican grocery on the side. BYOB."}
{"text":"Hmmm, I hate to give a small business a so-so review, but I have to say it was just ... so-so.  Portions were large, but that was about it -- it was basic Mexican fare, no different from any other ... won't return."}
{"text":"Authentic Mexican food with a Oaxacan influence. The Enchiladas are superb - particularly the mole and the verde.  I have not had anything that good outside of Mexico.

A huge platter is $12.00  The appetizer chips are freshly fried. There are Mexican soft drinks.
It is BYOB. There is on street parking. 

The setting is very basic.  The service can be slow - but always friendly.  For me, the setting and service are what i would expect at a restaurant in Mexico. 

If you go with the expectation of a hip well styled space with excellent, prompt and attentive service - you will be disappointed.

If you go expecting great, authentic food, your expectations will be exceeded."}
{"text":"El Milagro, which means \"The miracle\" in Spanish, is literally a miracle in Beechview. 

Every time I eat there I am made to feel as if I were a guest in the owners' home. The meals are homemade quality and super-delicious. The food is decidedly not oily and the full meals on the inside of the menu and the tacos, burritos, quesadillas, and sopes listed on the back are the real thing. No beer or wine but feel free to bring alcohol in from the bar next door, from the one around the corner (which is open on Sundays) or from home!

Prices are reasonable. Service is friendly and attentive. The mostly Mexican or other latin crowd and the TV showing Mexican shows lends to a feeling that I have hopped a plane for Monterrey! I love El Milagro! Highly recommended."}
{"text":"OMG,  I'm very happy to find something to replace long lost California Taco in my heart and in my stomach.  Very casual and fine with us BYOBing.  Most importantly,  we all were very happy with the food which did not have that typical mid-western Mexican food taste.  Ironically,  I've never seen a surcharge for the vegetarian version, but no complaints as it was well worth it."}
{"text":"This place is legit. I just moved here from Chicago and was feeling for some Mexican comfort food. When you first walk in you think the place is closed. The decore is minimal and has two tv's playing. It self serve drinks. Walk up to the cooler and grab Jarrito.

The waitress is an older lady who's super nice and sweet. I order the green enchiladas verdes. They tasted like home. It comes with a salad on top with rice and black beans. My fiancé ordered the Torta de asada (steak torta). The bread had a nice toast to it. It was pretty big. The meat was seasoned just right. 

If you are looking for a traditional Mexican plate go here! You will not be disappointed!"}
{"text":"Hole in the wall but great food. Fresh and prepared to order. Price is great! Cannot beat this please will visit when in Pittsburgh."}
{"text":"Not too shabby. Well the atmosphere is a bit shabby, but the food is entirely authentic and after years of time spent in Latin America I feel qualified to levy that judgement. Huge portions, so order on the conservative side."}
{"text":"Amazing food! Have to say one of the best restaurants in Pittsburgh! They've added more tables too! I had the enchiladas verde vegetarian and my boyfriend the steak chiquila (sp) creamy deliciousness. The peppers in my vegetarian were the best I've ever had. We also tries a vegetarian taco with fresh cilantro, peppers, and radishes. The food was perfectly spiced and the salsa was fantastic! Another great restaurant in Beechview on Broadway. You have to try it as it's the best Mexican in the area. We will be back to try the entire menu that is guaranteed. Very impressed"}
{"text":"This place is consistently fantastic. The tortilla chips are absolutely delicious: made in-house and often still warm when they come to your table. The salsa verde has the perfect amount of spice (I tried a red sauce once and could barely taste my meal afterwards, so beware!) I'm a vegetarian and am able to find several different options on the menu, and enchiladas verdes is my favorite. The portions are large, prices are reasonable,  everything is perfectly seasoned, and the staff is very polite. It's also BYOB, a big plus. El Milagro never disappoints!!"}
{"text":"I love this place. It is a little ugly hole in the wall that makes the best tacos ever."}
{"text":"My boyfriend and I were craving authentic Mexican food last Sunday and he found this little gem on Yelp so we decided to give it a try! El Milagro is in the heart of Beechview, an area where we don't travel to too often. 

The exterior/interior is nothing special but their food makes up for it! There was hardly anyone in there who spoke English besides Chris & I, which shows the authenticity of this place! We ordered chips and salsa to start... the chips were sooo good and you can tell they were freshly made. Their homemade salsa was also amazing and super spicy just the way I like it! For my lunch I ordered a chicken taco and carnitas taco.  Chris ordered chorizo and beef tongue tacos with a side
Of rice and beans. The tacos were pretty good but not the greatest that I have ever had in my life and they fell apart kind of easily. 

They also had a lot of unique Mexican dishes on their menu that I would love to go back some day and try!! Another tip- this place is BYOB! :-)"}
{"text":"Amazing, authentic food.  Tacos de carne asada I highly recommend.  Their salsa verde is the best I've had.  Tortillas pan fried too.  Byob!!  Stop next door on your way in."}
{"text":"El milagro is one of the few Mexican restaurants with authentic flavor..it's a hole in the wall for sure but the kitchen looks very clean and well kept."}
{"text":"The tacos here rival Las Palmas. Cant help yourself to toppings, but full of flavor nonetheless. I expected more out of the fajitas, but i guess im use to the tex mex variety"}
{"text":"This place is legit. Chorizo tacos were spicy and perfect. Even the rice was amazing. 

I will definitely come back. Next time I'll be hungrier as only having 2 tacos simply did not allow me to eat as much as I would have liked. 

They take credit cards but we tipped in cash. 

Like others have said, I wish I would have found this sooner, even though from outside it doesn't seem like it's for real. It is REAL."}
{"text":"This is a pretty neat place, definitely with an authentic feel. As we were waiting for our food, it was pretty clear that this is often visited by the ethnic community, seeing as many were regulars. The interior was quite spacious with lots of tables, there was a small little market/pantry area, and they have an open kitchen if you're interested in peeking in while they're cooking. Their portions are bigger than we expected; the menu, while colorful and pretty, definitely seems to understate how much food there is! As others have mentioned, knowing some Spanish will help here, as it seems that the nice ladies prefer to communicate that way. Everything seems to be cooked fresh and flavorful, as these kinds of Mexican dishes should be. Definitely worth the trip out here even if you're in the city!"}
{"text":"My favorite \"secret\" joint for Mexican food in Pittsburgh. They need some better signage because every time I tell someone about it they respond with, \"I didn't even know that was there!\" Easily the best Mexican food I've had in Pittsburgh, everything is made fresh daily, the meat (7 or 8 different options) is prepared fresh right there in the kitchen, you can watch them blend the different types for different dishes, like campechano. A huge array of options from your usual taco to sopes (so good and not many Pittsburgh places have them), soups, enchilladas, the biggest, most well priced quesadilla I've ever had (they must put at least a dollar or 2 worth of avocado on it alone) and a number of dishes and platters I've never heard of until I started eating there. They aren't pricey either. The most expensive thing on the menu is a huge platter of food, and it's maybe $14. Things start around $2. The hours are cool too. Since it's right on the RED line of the \"T\" many workers stop to get a bite on their way home because I believe they are open from 10AM to 10PM. It's catty-corner to the coffee shop BREW on Broadway (another fantastic spot in Beechview, this one for coffee and events).  A must check out."}
{"text":"I'm glad to have a Mexican restaurant so close. Loved their tacos. They do takeout, which is convenient for us. They also sell Mexican groceries and sodas."}
{"text":"Pittsburgh just didn't have any good authentic Mexican restaurants. Enter El Milagro. Since we discovered it a few months ago we've been going at least twice a month. In fact, we're going to take my parents there tonight! 

It's not the most glamorous place, but I think the best food comes from non-assuming places. We've ordered a variety of things. My favorite is the chorizo & egg torta. It's morphed into my go to menu item. We've tried pretty much all the tacos and a variety of other menu items. 

My husband speaks enough Spanish to order with the waitress, but make sure to bring your phone and google translate some of the Spanish only menu items. 

We highly recommend El Milagro. Take all your friends and keep this excellent Mexican place in business!"}
{"text":"A group of ~12 of us came in for dinner one Friday night last year. The staff were super accomodating to our large group and were great about taking our orders and had everything prepared as ordered. Whiie it took an extra bit to get our food, it was worth it! Everyone really enjoyed their meal. My enchiladas verdes were fantastic.  They let us BYOB which was nice. The place is really low key and low frills but highly recommended!"}
{"text":"What a wonderful foodie experience. The food was definitely authentic and you can tell that that the cooks put their heart into their food. I am very pleased.
  When you walk in, you pick your drinks out of the cooler, then sit. The server will then come over and hand you the menu and take your order. This is a BYOB, but we didn't know that. We ordered the Pollo A La Plancha and the Fajitas Mix.
   The Pollo A La Plancha is served with chicken, onions, salad, avocados, beans and rice with 7 warm and fresh tortillas. The Fajitas Mix, which is what I got, was served with sautéed shrimp, chicken, and steak with onions, peppers, and tomatoes. This also is served with beans, rice and 7 tortillas as well. The meats were seasoned very well and blended so nicely together. 
   When the food came out, we asked for salsas to add to the food. The salsas they brought to us were one green salsa and one red salsa. The green one was definitely more spicy. I wasn't expecting that one to give such a kick, but it was very good. The server was very friendly and he lit up when I said how much I enjoyed the food. We will definitely be returning... With a few cervezas in hand!"}
{"text":"This place has incredible authentic mexican food.  It is not your typical mexican restaurant that you go for atmosphere.  Staff is friendly and the food is incredible.  Food comes back quick.  Bistec Mexicano, enchiladas verdes and fajitas are my favorite, but i have not had a bad meal here yet in over 40 times eating here.  Tacos are good too."}
{"text":"Not what I expected. Don't come here expecting an amazing ambiance. Heavy fluorescent lighting and loud refrigerators will accompany your dining experience. When we went some of the meats we unavailable too. I thought it was a little expensive for what it was. An order of chicken mole, 4 tacos and drinks came to almost $30."}
{"text":"Super authentic and delicious. The portions and prices are great. There may be a bit of a language barrier if you aren't fluent but they were very nice. The interior offers no decoration but you come for the food"}
{"text":"Great food, super sketchy restaurant. The staff are nice, but the language barrier can be an issue. Come prepared with what you want, and they'll treat you to a delicious meal. Best before sundown."}
{"text":"Dateline - Hell Night 2013: As I lethargically, dejectedly disembarked the trolley en route home from a hostile, soul-crushing day of meager employment early this week, I noticed a change on Beechview Avenue. The modest, nameless Latino grocer that somehow managed to exist and stay relevant alongside Las Palmas (the proprietors of which have taken over the IGA market just doors away) had changed ownership and was advertising a hot food menu for takeout and dine-in.  

Today, during my \"required\" lunchtime check-in with the live-in girlfriend, I mentioned El Milagro, and without hesitation, Kay announced that she wouldn't be making me dinner this evening. 

The right side of the white, sparse store-space is still devoted to groceries while but the left half features tables, chairs, an ordering window, and an open kitchen full of smiling. eager-to-please faces happily working hard to create down-home Mexican food, a goal these folks have reached with a round of fireworks going off. 

El Milagro offers the usual Mexican fare (tacos, quesadillas, faijitas) as well as less-traveled edibles such as Mojarra Frita, Chilaquiles, and Tampiquena. Our dinner would be a mixture of the familiar and unfamiliar. 

Kay requested tacos and something involving chicken. Examining the glossy pamphlet takeaway menu and relying on my limited Spanish skills, I found an item called Milanesa De Pollo O De Res, one that Kay ended up being more than pleased with. 

I went with an order of Flautas and a Torta Lengua and was left craving a cigarette afterwards. And I don't smoke. 

The Flautas consists of a quintet of fried taquitos that are stuffed with chicken and sweet potatoes (?) and crowned with lettuce, sour cream, queso fresco, tomato, lettuce, avocados, and pickled jalapenos. I would attack the entire mound with knife and fork due to its messy, hodgepodge formation.  The crunch of the taquitos, the savory chicken, the tangy/creamy tandem created by the crema and cheese, and the fresh, chilled veggies had me briefly fooled into thinking I was enjoying a meal-worthy Caesar salad. As I have stated many times, I am skeptical of the concept of authenticity, but if this is authentic, it is to know Chicomecoatl. 

During my childhood, when Mexican food was still new to my family, I recall my father humorously referring to the tacos my mother made as \"Mexican hamburgers.\" Blame Bourdain for showing me that there is in fact a such a thing South of the border sans tortillas. Advertised as a 'Mexican Sandwich,\" El Milagro's Torta can be filled with your choice of protein, be it tinga, campechano, chorizo, or cabeza. Getting a taste of lengua at Edgar's in Overbrook, I chose it to complete my Latin Dagwood. The standard build, one I dared not alter, included all of the vegetables that were in my Flautas along with onions and a sleeper of an ingredient in quesillo, a sort of cheese curd. The bread was pressed onto a griddle, making it lusciously oily and crisp like an arepa or a Cuban grinder. Zip clashed with the lardy while the cubed, dark grey tongue spoke the language of lovers with its delicate, brisket-ish texture and flavors. Sloppier than a drunken fratboy on Cinco De Mayo, I ate the street stand masterpiece while carefully hovered over the styrofoam container for fear of finding the entire precious thing in my lap, greedily poking at what fell out with a plastic utensil while washing it all down with a highly refreshing bottle of Tamarind-flavored Jarritos soda. 

Attempting dessert, I walked out with two odd, spicy fruit leather-ish candies called Burritos De Mango from a brand known as El Super Leon. I'll merely state that the term \"acquired taste\" applies fully here. 

Immigration is cordially rejuvenating and reinventing Beechview through new businesses like El Milagro. Welcome them into your hearts, South Hills residents. Turn your backs on Taco Bell and Chipotle forever, and embrace the vibrant change El Milagro represents."}
{"text":"Disappointing!  After many times of trying to stop and always finding El Milagro closed when the hours say it should be open, see other review, stopped by on Friday night during dinner hour. Thought it may be crowded but was looking to take out.  Walked in and no one was in the restaurant.  Eh Oh!  Ordered two carnitas tacos that come with fresh onion, radish and cilantro.  Looking good.  Took my first bite and hit something hard, very hard. Thought I was biting into some wood.  Some very overcooked and to hard to chew meat.  Took it out.  Took a second bite, same process, could not chew the hard meat.  So I picked thru the taco, took about half the meat out and then was able to eat it.  The meat was not very good, the taco was not very good.  Also ordered the Tampiquena that is steak, shrimp, peppers, tomatoes and onions in a marinade that comes with rice and beans.  The shrimp was cooked correctly but the steak was overcooked and very tough and hard to chew.  
Maybe I just came on the wrong day but will not return when you can get better tacos and Mexican food nearby."}
{"text":"I'm half Mexican, so I grew up eating a lot of authentic homemade Mexican food. El Milagros is by far the most authentic Mexican food I've had in Pittsburgh. I didn't hear a word of English while I was there other than by my girlfriend and I. 

The atmosphere is a little old and not the cleanest, but that immediately told me I was going to be eating good Mexican food.

The chips and salsa were incredible. Chips were extra thick and crunchy, and the salsa verde was very spicy. I had lengua tacos (beef tongue) and chorizo. So good! The radishes add a nice crunch and I used the salsa from the chips to add some extra heat. I'll definitely be back to El Milagro."}
{"text":"A gem of a place in Pittsburgh for Mexican food. This was our first visit and the place did not disappoint us. We are sure to visit here again to try the other items on the menu.

Their portions are pretty big and for the price, I would say it's cheap! It's not like any other restaurant, simple interiors, good enough chairs to sit and enjoy the food."}
{"text":"Yum! I stopped in to check it out. Kind of like going to someone's house and them cooking for you. I had the chicken Flautas and loved it. Freshly made , just enough spice with the salsa verde. Home cooked feel. I'll definitely be coming back many many times!"}
