{"text":"The foods pretty good, atmosphere is vibrant, staff is great, if anything the service makes me come back!"}
{"text":"All-round, great service and great Mexican food. Salsa is well-made and it gets better with the hot salsa. The chips are generally freshly made, when arriving. I generally get a combo, and every time, it has been consistent. Consistency is what has brought me back. If you are looking for Mexican in Elyria, by all means, this an excellent pick!"}
{"text":"Absolutely love this place! Every time husband and I go here they are always super nice to us and the service is great. Food is fantastic and price is extremely reasonable!"}
{"text":"Best Mexican in Lorain County. Fast, friendly service, great food, cheap prices. Lunch menu is unbeatable, pricewise!"}
{"text":"This place is pretty ok.  Nothing spectacular.  The ground beef is really bland and the salsa is pretty normal.  They do always have good service and the Cancun Burrito with steak is fabulous!  I would say definitely worth giving a shot."}
{"text":"¡Ay Caramba!  This was definitely a welcome surprise.  The food is the best in Erie County.  Very pleasant staff and atmosphere.  DEFINITELY worth coming back for.
Their rice is flavorful and the beans really excellent.  Former Spanish teacher here, I KNOW my Mexican food!"}
{"text":"I went there on Friday and the staff was really rude and the food was cold. After waiting a long time for a table the food was cold and the staff didn't seem to be interested in hearing it.  It seems that they couldn't handle the crowd. I will never eat here again."}
{"text":"My family and I have started to become regulars on Friday nights. The service is wonderful and the food is great! And you can't beat the $1.99 margs. You should definitely eat here if you've never tried."}
{"text":"Nice place in a shopping center. Decor was very colorful and clean. That had on some nice mexican background music to make it festive.

Free chips and salsa with the meals. Chips were only fair and a little over cooked. Salsa was good but on the mild side. No problem with that since you can spice as desired with got sauce on table. 

I got the Texas Fajita. A mix of chicken, steak, and shrimp. It was very good. I like the places that give cheese as on of the toppings, but this place doesn't. Topping plate was beans, rice, Pico, and lettuce with a very small amount of sour cream and guacamole. 

Service was quick and attentive. I would recommend it."}
{"text":"I don't normally review a place, but the food was terrible. The waiter barely responded when we complained. The chile rilleño looked and tasted like a soggy fried brown slab and the chicken chimichanga looked and tasted like a freezer burrito. Poor Elyria."}
{"text":"Excellent margaritas, love the salsa, adore the help! By far our favorite Mexican anywhere."}
{"text":"Friendly staff and great food. Always a nice place to go and grab dinner. Hubby and mines fav place to eat. :)"}
{"text":"oh my word! (that's for you Allen's) this place was great.  I tell you, when you see chimichangas locos believe me the crazy part is the size.  Now even though i had just polished off 2 bowls of chips and salsa (also good) i knew in my heart of hearts i could beat this beast of a chimichanga.  i am sad to say i failed.  but enough of my outrageously filling meal.  My family and i really did enjoy this place, we were just in town for the night and found this little south of the border gem, thanks yelpers.  We were very happy with the food, service was good and we al left happy.  if you are in the area you owe it to yourself to check this place out"}
{"text":"The margaritas are ok here. The decor is vibrant and warm. The food is ok as well. I did NOT like the rice. It was HARD and flavorless. I was not impressed by it at all. The chicken chorizo I got was tasty. Too bad that the rice did not compare. El patron needs to work on this. The servers were friendly and the service was fast. Overall good place but gave a 3 star because rice is a major part of the Mexican cuisine and, here, it was subpar!"}
{"text":"Great Mexican food close to home!!!!  SUN, MON, TUES is $2.00 Margaritas!!!  I had the seafood fajitas and it was excellent. I think this will be my next go to hang out!!!"}
{"text":"Good food, poor customer service and high prices for portion size as compared to local competitors. Beware of complicated and poorly worded coupon/discount meal deals. This has been an issue for us more than once. A once frequent customer, I no longer dine at El Patron. There are better mexican dining options in the area."}
{"text":"Extremely rude!  We were there for cinco de mayo, and got on the list.  The front was so packed that we decided to go to the back bar and have a few drinks until seated.  They came back and said that we would have to be taken off the list if we sat there.  First they would have made more money while we waited, second there wasn't enough room.  They were very crappy stating that we won't be served!  The way they talked to us was very rude, and had a bad attitude....not the way a restaurant should treat customers.  Last time I go there.  I haven't written reviews on Yelp before, but this is definitely warranted."}
{"text":"I love the margaritas. Need I say more? The peach is to die for. If you decide to add a kicker an Uber is in your future. The food is amazing and always hot. Service is prompt and friendly. I'm not a big fan of the rice. But nothing else was disappointing. I can't wait to go back."}
{"text":"This experience was during peak dinner hours on a Friday so they were really busy. I needed to say that because the service was slow, but that was to be expected when they have a line out the door. 

The food was amazing. They have a flavorful salsa and cheese dip (with warm chips). I got the Tony Cheesesteak. Although the actual meat portion was small it comes with a side of rice or beans. I got refried beans and they are better than some of the refried beans at other local Mexican joints. 

My husband to the fajita burrito. It was huge and very good. I think either one of us would go get these dishes again. Monday, Tuesday, and Wednesday they have domestic drafts for $2.00. Not too shabby."}
{"text":"Food came out quickly and was really well made. Service was great and very attentive. Overall a very pleasant experience."}
{"text":"Usually Very good but on my last visit I can say I will not be going back. Me and my family were regulars and are not ones to let one bad experience ruin a place for us but this was the worst customer service. My step dad order the Tony Cheese Steak, his usual go to, and it came out cold and the steak was chewy, basically it tasted like it had been sitting out too long. When we explained this to someone (not our server) he had to go get his \"boss\" who did absolutely nothing to solve the problem, not even an apology. He simply said that it was made fresh and if he didn't want to order something else there was nothing he could do. When we go to pay our bill the cheese steak is still on there, when I asked him to take it off because we hadn't eaten the meal, he said that may be how they do it in other places but not here and refused to take it off. All of us left unhappy with the food and VERY unhappy with the horrible customer service. Will not be going back."}
{"text":"This is Elyria's new hot spot Mexican place. The decor inside was glorious along with the surprising spaciousness. The bar area is rather small. I wouldn't recommend going here to just drink at the bar. As for the food, I kept it basic and ordered soft tacos. They were delicious, as for the margaritas I was disappointed. I was told they only have lemon margaritas. No lime or any other flavor offered. This was very surprising for a Mexican place.To be honest, the margaritas were not very good. So I then proceeded to drink Coors. Servers were knowledgeable and social. The atmosphere is tranquil and welcoming. For a new restaurant, I think this will being in some much needed business to the right side of the Chestnut Commons area."}
{"text":"We are from arizona and therefore we know good Mexican food. This place was amazing. Great service and food. We will be back next summer for sure."}
{"text":"Dont waste your money here! Go anywhere else! I am a lover of mexican food and have never had a bad experience at any mexican restaurant ever! i have been here twice and both times the food is so unappetizing and the workers are so rude..worst mexican place i have ever been to! Will never return."}
{"text":"Was the first and last time I will spend $13 on 3 mediocre, at best, tacos. 

Two stars for the service."}
{"text":"Very nice Mexican food. Authentic and I love the seafood fajita here. Tasted great. Highly recommended for everybody. Ideal place for birthday or special day celebration also"}
{"text":"Great food and service. Fajitas are my favorite. They have this dip I can't remember what it's called ( tequila dip)? It is outstanding. It is a must try. Last time I was there that's what I had for my meal. Salsa is good as well. Go back we will."}
{"text":"This place is my favorite Mexican restaurant. Oh, where to start...their chips and salsa are great and ever flowing. The salsa is thick and flavorful and the chips are warm, fresh and crisp. The margaritas are awesome and in spite of what some past reviews say they have lots of flavors to choose from. Maybe this was different at one time. Their food is wonderful. Some of the dishes on the menu are named after people and are just called \"(Name... special)\" My favorite is one in particular called the \"David's special\" now I don't who David is but his namesake dish is amazing! The staff here is always extra attentive too. Super nice guys who work here. I definitely would recommend El Patron to anyone with a hankering for some Mexican!"}
{"text":"Typical Mexican restaurant interior. Typical Mexican music playing and typical salsa and chips on table. 

The food is better then other local Mexican restaurants. But what I really loved was that they had a children's menu (I feel like most Mexican restaurants don't have one). And my very picky eater got chicken fingers, and when they came out you could tell the chicken was home cooked and not from a bag. My husband tried a bite and he said they were delicious. 

We will definitely be going back here often!!"}
{"text":"Love this place. My wife and I eat here regularly. We've never had a bad meal or bad service. Now when we stop in we're greeted with a hand shake and a smiling face. More restaurants should follow suit."}
{"text":"Horrible service and extremely mediocre food.
No thank you."}
{"text":"Love love love!  This is by far one of the best Mexican restaurants in town.  Love their guacamole and cheese dip with their chips. Large portions at reasonable prices. Lots of seating including an outdoor patio. Servers are very friendly.  They play good music.  Several lunch and dinner specials.  Food has great flavor and is fresh.  You can tell it was made to order and not made days earlier!  My husband and I have already eaten here a few times and this will be our new date go to spot."}
{"text":"Delicious! I am very picky about Mexican restaurants,  as most leave a bad feeling in my stomach. This is one of the few that I really enjoy. Everything I've had, from tacos to enchiladas to fajitas, have been great! Love this place."}
{"text":"I don't like to give bad reviews. I used to go here all the time but I'm shocked. What a waste of time and money. Never again. I wish I could get a refund for this experience and meal! Food was cold. Cheese sauce was cold. Ordered 3 tamales. Only 2 came to the table and was told the other one was not ready? So don't order Tamales unless you want to wait an hour, and take your one tamale to go. Portions were small. Service was ridiculous. Not even sure who our real waiter was! I'm sad. Used to be our Go To."}
{"text":"El patron is the best Mexican restaurant in the area.  End of discussion. 
I have two words for you: tony cheesesteak. 
That's right, not Tony's cheesesteak. It's tony cheesesteak. English is their second language, give them a break. 
The tony cheesesteak is a Philly cheesesteak with a Mexican twist. You will not be disappointed. 
It is #2 on my list of death row last meals."}
{"text":"Had dinner there tonight was very good food is excellent atmosphere is very good also would highly recommend this restaurant!
The waiters were very conscientious and really hustled I got to give them credit also a good tip!"}
{"text":"Great Food Great price. Carnitias were execelent. very clean tables, polite staff, festive vibe! good family place or late dinner with friends."}
{"text":"We had dinner there today and were really disappointed. We have dined there before and been pleased. We tried to eat on the bar side for the first time and the service was terrible. It took some time (around 10 minutes) for the server to show up. He took our order for margaritas and when they arrived my wife's drink was terrible. I switched drinks with my wife and to the waiters credit he did take it off the bill. The food arrived via the kitchen staff. Both dishes were cold and had evidently been sitting for some time. We did not see the server from the time we got our food until he brought the check. I attribute the bad experience to the server. In the past we have had great food and service here so we will make sure to go to the restaurant side of the house."}
{"text":"Delicious beef / steak fajitas. Good overall. Delicious fountain drinks set just right. Great server."}
{"text":"very good Mexican food and loco wings! this maybe my new favorite Mexican restaurant, or at least in this area. i recommend, and i will be back!"}
{"text":"Great Mexican food, sister restaurant of Don Tequila.  Good margaritas, excellent happy hour.  That said, YOU HAVE TO CHECK THE BILL - they routinely overcharge.  Would give 5 stars if I didn't have to always point this out"}
{"text":"First time here tonight. Food was delicious and service was great. Definitely coming again."}
{"text":"This place always satisfies my Mexican food cravings. The service is consistently good and the food is the same. Would recommend it if you are looking for a good price and meal"}
{"text":"Nice \"Tex-Mex\" style restaurant.  Clean, affordable prices, good basic Mexican items, such as rice, beans, burritos and enchiladas. Fast and friendly service. Great prices on lunch specials.   I eat at El Patron about once a week."}
{"text":"This is my new favorite Mexican place. The food and service never disappoints.  The prices are excellent.  They have some of the best frozen margaritas too- not skimpy on the tequila."}
{"text":"I've been here for dinner and lunch, service was great, very attentive and accommodating to my picky food habits. The food was delicious and authentic and we loved the atmosphere. This is our new go to place for Mexican food."}
{"text":"Si, señor! El Patron is muy, muy delicioso.

Our office lunch group had a great time here today for lunch.  We have eagerly been awaiting this place to open for what seemed like years.  I am sure this place will be in our weekly rotation from now on."}
{"text":"The employees are friendly, and the food is the standard fare, and generally above average in selection and quality. The only drawback for me is that Salsa is too sweet, mild and as thin as water."}
{"text":"New to the neighborhood and stopped by for dinner. It was very good, delicious food and the service friendly and prompt. I'm sure well be regulars."}
