{"text":"Food was cooked fresh to order so it takes some time for it to get to you; unlike traditional MexiAmerican places where food is pre made. We liked and ate everything we ordered. Delicious home cooked traditional Guatemalan food. My only complaint is the prices are a tad high for not having any leftovers and a just ok atmosphere. We will be returning for more! Keep up the good work!"}
{"text":"Authentic Latin food. We had the Chapin sampler and horachata. Total bill was $15 for 2 of us. Clean."}
{"text":"Drove by and stopped. Sit down type style. Seriously though the food is fantastic! They have yuca fries. I ordered something with marinated brisket and it was seriously savory. This place actually cooks the food! I'm definitely coming back!"}
{"text":"Stumbled upon this place and was very impressed. Top notch guac, ceviche, carne asada. Will visit again."}
{"text":"So yummy!!! Haven't had anything bad yet!  I horchata is my favorite (cloves in it I think).  Today i ordered the enchiladas.  Nothing like your typical Tex mex place!  They were delicious and beautiful!"}
{"text":"All about this OB restaurant! I ordered the sampler platter with a friend and it's a great way to try some of their best in one sitting, including pupusas, yucca fries, and a few meat-filled items. I ordered some fish tacos on the side as well. Def load up on the sauces for more flavor. Friendly service and a homestyle setting make this a great place for quick eats and catching up with friends. I'll be back!"}
{"text":"Recently enjoyed lunch here.

Plaintains were cooked to perfection. I heard the table next to me eagerly asking for more salsa verde, so I asked my server for one...and boy was it delicious. Best salsa verde I've had so far.

Pupusa was okay, but all elements to this dish (slaw and tomato salsa) lacked flavor. I recommend adding some salt to the tomato sauce and some heat, salt, and perhaps herbs to the slaw. I've had some pupusas on the street of LA that were so flavorful, and haven't yet found a decent pupusa in Cleveland that even compares. Cle needs to step up their pupusa game!

I will definitely be back to this sweet little spot to try some of their other dishes, and I recommend you try them too!"}
{"text":"Great food. The real deal. Friendly owners. Will be back for sure. Price was very good. Be to El Salvador and Guatemala. The papusas  tasted just like in the country. Good stuff"}
{"text":"I read about this Guatemalan restaurant in a Cleveland Scene article and decided to check this place out. It's an unassuming little whole in the wall, but clean and the man and woman who helped me order were pleasant. Shortly after I walked in a group came in and stated they were here because of the article as well. 

Let's get down to business. 

*Garnachas $8 - More fried masa tortilla than topping, but good. 
*Sampler $12 - I enjoyed this a lot. A nice variety of mini bean pupusas, yucca fries, fried sweet plantains, this chicken filled empanada like thing, this fat tamale like thing with red sauce and chicken inside. Only thing that was missing was a dipping sauce, but luckily I had a spicy aioli at home.
*Jocon $11.50 - This was another tasty dish. Two flattened chicken breasts covered in a green sauce with a side of rice. I actually dipped the leftover masa tortilla's from the garnachas into the sauce to finish them up. 

While I was waiting they gave me a free glass of horcata which is like this milky water that tastes exactly like cinnamon gum. It was weird and tasty at the same time.  Freshened up my mouth for sure. 

All in all, they don't have a huge menu, but I would hit this place up again! The food is simple so don't expect a ton of flavor/spices, but it's tasty and filling, and the people are nice. I really want to try this roasted chicken they have on special so I will be checking out their specials updates on Facebook with anticipation."}
{"text":"Just a little hole in the wall place that serves good food.  Located in an old storefront on Pearl just North of I-480 look for the striped awning.  Inside is a clean little dining room with minimal decorations.  The menu is simple central American food.  Since its Tuesday I had the special which is Shrimp and Fish Tacos for $2.50 each.  

The Tacos come out as small soft corn tortillas topped with the shrimp or fish with onions and cilantro; the highlight is the small bowl of salsa verde, bright green and vibrant with a hint of heat.   The shrimp and fish is griddled and delicious, with enough seasoning to make them extra tasty.  The tacos are not big, but they are well prepared and authentic.

I will try and get back to try a couple of other items on the menu."}
{"text":"Tried this restaurant for lunch today. Was very impressed with the quality of the food. I had the Chapin Sampler and my husband had the Choripan sandwich. Both meals were excellent in taste and presentation. The service was good with one waiter. The waiter was busy but very attentive. He was very pleasant, knows the menu well and quick to serve. Food did not take long, we were in and out in under an hour. We are excited to have a Guatemalan restaurant in Old Brooklyn that has great food! We will be back!"}
{"text":"To my knowledge, this is the only Guatemalan restaurant in Cleveland, which means you get to try lots of dishes here that you maybe haven't had elsewhere, including yucca fries, ejotes empanizados, and pupusas. Also, everyone is really nice and the prices are very reasonable."}
{"text":"We were here for 2 hours during lunch time on a  Friday. There was no other customers the entire time we were there. Just the lady who served us, and her friend, who chatted with her at the counter. 

The 50\" TV on the wall blaring news in Spanish, though we couldn't tell if it's Guatemala news channel specifically. The walls decorated with traditional Guatemalan paintings. The whole atmosphere screamed 'Guatemala'. 

We sat down, ordered two drinks, a sampler plate, and skirt steak (see my pictures).

The horchata tasted homemade, not too sweet. 

The corn drink - it's weekly special on Friday - is very interesting. It takes like corn soup in a cup, sweet and salty. I highly recommend you try it, if you've never had it before. I've ordered this drink at other Hispanic joints before; somehow this one stood out to be memorable.

The food tasted home made as well. Nothing glamorous; as I was eating I pictured a Guatemalan mama serve those to her family at dinner table. 

I'd come back to try tacos and other dishes."}
{"text":"We're Old Brooklyn locals looking for a good, casual dining option outside of the diner and pizza fare and this was a great find! We ordered carne asada, pollo abodabo, pupusas and horchata and everything was wonderful!! The pork and cheese pupusas we're especially tasty. Excited to go back!"}
{"text":"UGGHHHHH. I really don't like giving this place a lower rating. I was going to give them two stars BUT I'm going with three because I feel as though they are a family owned, hard-working restaurant that just so happens to not be to my personal tastes. 

I suspect that Guatemalan food is very calm in flavor. So that is why it's not really my taste, because I like !!!!!BIG BOLD!!!! flavors. Items we ordered include... Sweet plantains, guacamole, pork tamale, horchata, and chile rellenos. I would honestly rather order these items else where. Nothing was poorly made, but it wasn't good enough to make me keep wanting to come back either. I definitely kept thinking \"I can get this somewhere else and have it be tastier\".  

The place is clean. Pretty sure it used to be some sort of Asian restaurant, judging by the counter set up. So yeah... I won't be back. It is worth a try though, if you're curious."}
{"text":"Absolutely delicious Guatemalan storefront serving food cooked with love. Many of the items are similar to El Salvadorian cuisine, but prepared differently. Expect things like tamales, yucca, pupusas, horchata, stews and Latin American churrasco prepared to order and served by a kind and helpful owner. Like all great authentic ethnic places, there isn't much to speak of regarding ambiance, but the prices are reasonable, the food delicious and the smiles contagious."}
{"text":"This is some solid home cooked Guatemalan food!  I saw it on yelp and I wondered how I had missed this place in the past.  Anyway, I'm glad I found it and I'm glad we went.  

I ordered some Garnachas, chips, and guacamole.  Then I ordered churrasco with rice & beans.  A bit later, the food was served and it was very well presented.  The tastes and textures were just above average.  The steak was a little chewy, but it tasted good.  The rice was yummy.  The refried beans were on point.  My wife really liked the sandwich that she ordered and it came with fried yuca, which I tasted and liked.  My daughter didn't really like her chicken tacos because there wasn't much chicken on them.  See photos.  We'll be back soon to try more food. No alcohol is served.

PS: the water was cold and filtered - bonus"}
{"text":"Wanted something close, delicious, and affordable and Yelp delivered! This is a small, family run restaurant.  The menu has a good amount of items and super low prices. I went for the tacos al pastor - it came with onion, cilantro, lime, and a salsa on the side.  This is my all-time favorite taco!! My husband has the burrito with carne asada, rice, beans, salsa, sour cream, and cheese. The burrito was huge and he loved it! I also had the guac and chips. The chips were awesome and the guac was fresh. I would add spice to it next time for a flavorful kick! Can't wait to go back!!"}
{"text":"Great place to eat the food is awesome the place is small and easy to drive-by but well worth it when you do find it. This place is only a couple miles from my house I will definitely be going back more often."}
{"text":"Came here to taste some good food with our kids and family - and to celebrate a beautiful heritage with our children. First time for authentic Guatemalan food - soooooo good!  Great selection on the menu, very good service and pricing. Loved the Horchata drink, the chorizo and the fried plantains. Actually loved everything!  Will def return and try more of the menu:). Thank you!!!"}
{"text":"The food is great and very authentic Guatemalan food, the service is awesome, the prices are really good. we have been there several times as a family and I think we got to order almost all of the dishes at least once and some of the favourites multiple times. I highly recommend the Ceviche, Carne Assada, fish tacos and the Burrito.

Here is a review from the plain dealer
Fantastic El Rinconcito Chapin brings Guatemalan flavor to Old Brooklyn

CLEVELAND, Ohio - El Rinconcito Chapin can be roughly translated to \"the corner Guatemalan.\" It's fitting name for this wonderful little spot that opened near the corner of Pearl and Broadview in Old Brooklyn earlier this year. This is the kind of small, locally-owned corner ethnic restaurant Cleveland has been sorely missing.

 The Broadview location, in the former Coney Company chili dog locale, is actually the second site for the restaurant owned by chef Engel Godinez, a native of Guatemala. Godinez has previously worked at Piccolo Mondo and as a sous-chef at the Jack Casino.

Review by Laura DeMarco, Plain Dealer Reporter"}
{"text":"This cozy, unassuming Guatemalan restaurant is well worth a visit and I am certain that I will be going back again! We stopped in for a late dinner yesterday evening. Ravenous as we were, we got a chance to sample a number of items from the menu: 

- Garnachas: like little, open-faced empanadas on a fluffy masa fry bread - Yum!
- Chuchito: very similar to a tamale, simple preparation, delicious, fresh red sauce.
- Tacos: I tried the chicken and the asada. Asada all day! The meat was so flavorful! These are      some of the best tacos I have had in Cleveland, to be sure. 
- Quesadillas: you get it.
- Meat Platter: with skirt steak and chorizo - a truly carnivorous feast! 

We enjoyed every bite of our meal and the service was warm and attentive! I recommend stopping in here for a delicious, authentic, and affordable meal. 

Note: the proprietor mentioned that the restaurant will be moving to a new location in the next couple of weeks, so watch out for a change of address!"}
