{"text":"Birria is the best !! with hand made tortillas, affordable prices. Highly recommended! !  La birria es la mejor!! Con tortillas hechas a mano, precios razonables.  Altamente recomendado! !"}
{"text":"Very good food!!! The sopes and gorditas are very tasty. The food is very authentic and they have good size portions.  Cons: Cash only.  They close at 8:00pm"}
{"text":"This place is the Bomb. The Tortillas are freshly handmade with every order. And the Birria is the best I've tasted. Mexico style for sure. I haven't ordered anything else so far cause I'm so in love with the birria. But I'm sure everything else is as good as the birria."}
{"text":"Went to this place for lunch with 4 Latina co-workers.  I was the only gringa in the place.  It's an order at the counter and they bring the food to your table joint.  I got the enchiladas, as I usually do.  At $6.50, they seemed reasonably-priced.  When the food arrived at the table (really quickly), I was amazed to see 3 fat enchiladas, rice and beans on a large oval plate.  Everything was delicious and tasted homemade.  Service was super-fast and congenial.  Co-workers also ate beef gorditas and steak ranchero, which also looked amazing.  Not a fancy place, but great food can be had here!"}
{"text":"CASH ONLY!   Good food and good service. You will leave happy as long as you don't pay attention to a few things...this place is kind of a dive. The food is good, so I keep coming back. My friends, family and I have tried several things on the menu. We like the birria, caldos, sopes and desayunos (breakfast) This may or may not be the place for you, but give is a chance."}
{"text":"Don't be suprised if you have never heard of or seen El Ranchero.  It is an inconspicous building located just west of the 51 on McDowell.  I had driven past it several times and never realized it was even occupied much less a restaurant.  Firs off there is nothing at El Ranchero that is bad, in fact it is all good from the tacos & quesadillas, to the sopes.  There is one item on the menu however that stands above all else......THE BIRRIA!! (goat soup).  You must understand that the birria here is not only good for Phoenix, as is the case most often with Phoenix Mexican food, It is good for everywhere.  I have eaten birria in many a cities in the U.S. and Mexico and this one is definitley tied for first.  I believe the secret is El Ranchero's cooking staff.  It is made up of mostly older women with the magical hands and love that make Mexican food great (a common sight in mexico, but very rare in the U.S.).  Not only to these ladies make a delicous slow cooked birria, but they also make fresh tortillas to go along with it.  Buen Provecho  Note: Nothing goes better with birria than hand made fresh tortillas, an ice cold mexican coke, and a hangover."}
{"text":"Best authentic Mexican food restaurant! Clean, friendly and reasonable prices! Tacos and birria is what I usually order always great!"}
{"text":"Best AUTHENTIC Mexican food in town! Food is full of flavor , I can't pick between the shrimp ceviche or shrimp tacos or caldo de birria very hard but those are deff my top 3 faves from this location. Tortillas are freshly made here. If you are looking for very tasty food deff recommend it ."}
{"text":"If you are looking for the most authentic Mexican experience in the eastern Phoenix area, this is definitely the place to go.  Be warned, a translator definitely might be necessary!  My amiga and I had this spot recommended because it's one of the few that serve Birria and I would definitely agree on the quality.  Birria is a kind of goat soup that is spiced heavily and served with tortillas.    The restaurant itself is more or less a large room with tables and a cashier stand.  The menu is 90% Spanish, and there were definitely a few things I had never heard of before.  Every time I've gone there I believe I have been the only non-Spanish speaker there, but for the most part everyone is very friendly.  Again, this is not a date-spot or a place to impress anyone (unless they are snobs about traditional Mexican food!), but rather a good place to go to kick it with some Telemundo and delicious food.  One last piece of advice if you're headed there - bring cash!  They definitely don't take credit."}
{"text":"Worst place ever. Rude service, no one wanted to help me maybe because I look white and she didn't want to deal with me (or she couldn't talk to me in the long run). It's cash only but also I saw them recycle chips and put them in the next basket. I didn't want anything at that point. Left and didn't get anything. I wouldn't recommend this place to eat and now wonder how clean the kitchen is."}
{"text":"First, I'd like to say is that the only reason I didn't give El Ranchero five stars is because of the setting. The spray painted building, walk up ordering and telenovelas SHOULD be overlooked due to the quality of the food...but I know that some people calculate ambient qualities such as these. Personally, I would risk crossing the 38th parallel to get food like this. Words of warning: No English speakers there, but gringos are welcomed with accommodating smiles and nods. Also, CASH ONLY! Once you get past the skin of the place and down to the food only one thing should  be known... El Ranchero is, without a doubt, serving some of the best food in Phoenix!  I got an order of carne asada gorditas with some rice and beans. I noticed that the gorditas came with a sort of Au Jus (later I found out that it was the caldo de res). The gorditas alone were a wonderful conglomeration of carne asada, potatoes, lettuce and onions. But when I added a dash of amazing salsa and a splash of Au Jus (caldo) the meal sang.  Wow! I'm glad I finally went after passing it up so many times."}
{"text":"I love this place. My family and i have been going there for almost 2 decades. Their food is truly amazing and their customer service beyond great. You have to try the sopes of carne desebrada and papá they're so good. Their birria is also good. The tacos dorados and bistec ranchero are a must try."}
{"text":"Amazing Food!!!! Place looks like a dive and it could use a better AC but the price and taste of the food made it all worth it!!! New AC and they get 5 stars!"}
{"text":"**They close at 8pm every day. Once we arrived a little before 8 and they said they were closed (although the main door was open). We could have gotten something to go but we were turned away instead.  This place is all about the food and very little about the service. Cash only, I think also they only have evaporative cooler, so I would not recommend during the summer. I have not been impressed by the menudo, but the tacos and tortas are good. Also, this is one of very few places where you can find tripitas, although on my last visit my tripitas burro seemed to be a lot a beans and not much tripitas. Salsas are very good. Aguas frescas (flavored iced beverages) are super sweet and not very good. Sis and daughter had the pineapple and both were very disappointed, it tasted more like kool aid and not a real fruit beverage. (Agua fresca/agua de frutas) About parking, they have like 3 spots on the side of the restaurant (West side), and then there is more parking away, East of the restaurant, past other businesses. At least they remodeled and have more windows and light now, because this place used to make me claustrophobic. They have a TV that seems to be always on with old Mexican movies or TV shows. That said, I hope you like it, every time I come visit I kind of regret it, lol. I get kind of a sad vibe... : ("}
{"text":"Got three al pastor and one carnitas taco. All were amazing, and HUGE! Literally the most food I have had for a cheap price. Highly recommend!!"}
{"text":"It's been a while but the but the burritos were awesome. There was a employee that was awesome named Christina that you as your service was ranked."}
{"text":"Best birria de chivo ! The tortillas are freshly made and they have a great menu filled with delicious options. Only reason I did not give five stars is because it's cash only."}
{"text":"Whether your hung over or like to indulge in a big bowl of mendu, this hits the spot!! I tried the red mendu, added cabbage, cilantro, onion and extra lime juice and it was sooooo good! How ever, the ceviche wasn't that great! The shrimp was dried and the vegetables tasted fishy like it had been sitting there for a while. Not recommended!"}
{"text":"Best tacos de Chicharron! They take a little long to make but its because its all home made even tortillas :)"}
