{"text":"They have pool tables !! They're food is good. Although the bartender there was a little rude when she asked if I had ID. (Mega baby face) very sassy. But ehh. Its a nice place to have a good time"}
{"text":"De mis lugares favoritos y de la atención más amable. Tienen que probar el queso fundido, y un remedio."}
{"text":"Very cool sports bar about 10-15 minutes northeast of Downtown. It caters to Hispanics, but all races and ages are welcome. It has a warm atmosphere, and the bartenders and servers are friendly. The food is upper-scale sports bar food with a yummy Mexican twist, but the burgers also rock. The ceviche (multiple kinds) are delicious and the portions pretty generous. 

They have lots of TV's, but call ahead to make sure they are showing whatever game you want to see. 

I'm coming back and bringing friends."}
{"text":"So i went on Saturday night and I gave my waitress $100 to pay my bill turns Out I gave him 2 $100 bills n I didn't notice till I got home messed up part he stood there and for like two minutes after he gave me my chain back n I was wondering why he was just standing there I guess he was probably wondering if I would notice or not n since I had no idea I gave him a $5 tip so messed up he wasn't honest  and yes I know it's my fouls for not noticing ."}
{"text":"Great place to chill and eat. Sports bar and they have music at night. I recommend the papas remedios.."}
{"text":"Great hangout spot for after hours and awesome music. Drinks from tower of beers to their cocktails are good Waiter are really friendly and outgoing."}
{"text":"I have been here a few times.
We usually go when they have karaoke night.
It's a comfortable place to hang out.
And everyone here is very friendly."}
{"text":"Love this place and the music! Banda , cumbia, merengue, bachata, salsa etc is all good with me! Just posting this review because you guys deserve more stars especially as often as ppl come back! Also you are very respectful to people who've had a few too many and get them to call a friend up instead of driving!"}
{"text":"Came here to watch the UFC fight and had a blast! Unfortunately I don't speak spanish but still felt welcomed! The food was amazing (I did have to google translate the menu LOL) The drinks were delicious. So many options! The atmosphere was great will definitely be back!"}
{"text":"Nice place to watch a sporting event .lovely eye candy as well . But alittle too pricey for me . $7 for a long neck beer dont remember how much i paid for my patron shot . Furthermore play a few games of 8 ball pool & if im not mistaken they have live music i hear loud ass trumpets every damn night . But very spacious and not bad for the most part"}
{"text":"A cool sports bar on the NE side of town. Check in and get a free beer. Watched an HBO boxing match for free. Awesome."}
{"text":"I love this place! There's music, food, drinks, pool table and Thursday  nights karaoke. Their mangoneadas are the best they are my fave! Its a really chill place to go just hang out with friends whenever you don't feel like getting all drunk & wild lol. Always have a great time here I really recommend it!"}
{"text":"This is one of my favorite bars on this side of town. If you are close by go in! The outside looks ugly.  I won't down play that but on the inside it is clean and well decorated. 

Look for the underwear and bras, lol. It makes all my friends laugh when they finally spot it. There are tables to sit at with life size posters of famous Latin American Icons to take pictures with. 

The staff has always been super friendly although they can take a long time between serving the tables so ask for more in advanced to avoid issues.  

The first chips and salsa are free. The green salsa is yummy! Get a remedio trust me"}
{"text":"El servicio es terrible para ordenar una cerveza vas a tener que esperar no menos de 15 minutos y para tu segunda cerveza otros 20 minutos... No pierdas tu tiempo si quieres disfrutar de algún deporte en un bar te recomiendo otros menos los remedios!"}
{"text":"This is the place to be! Great service! Good drinks! Good music! The karaoke and the DJ music is the high light of the bar. I recommend it. Two thumbs up!! Pura gente al millón!!!"}
{"text":"Went to watch a game and it wast playing I asked
The bartender if she can put it on, there was no one sitting at the bar so she did charge it but gave me attitude the whole time, a few minutes she comes back and asked \"what do you want!\" I asked for a menu since I bought someone with me that has never been there. She slammed the menu on the bar, we order a michelada that looked runny no flavor she didn't even bother to make it right. It didn't look the picture at all she just put whatever she felt in the drink. Then I asked for chips and salsa and they never came. I was EMBARRASSED to have spoken highly of this place to my company.
The service was horrible. If your employee has a attitude maybe send them home or hire someone more welcoming that will help your business instead of failure. This was my second attempt to coming here last time I went I had my 50+ year aunt with me and they wouldn't serve us bc she didn't have her id but she wasn't even going to drink. We took our group of 10+pleople to downtown since is so close for better service and cheap beers!"}
{"text":"So this bar caters mostly to the Hispanic community as they play lots of Spanish music. Banda, cumbias, merengue and rock en español. They have some really tasty Mexican drinks and they do karaoke on Thursday nights. Over all it's a fun place to come with friends and have a good time."}
{"text":"I love this place the music is fun and they'll make what you want.. They have a few signature drinks but not my kind I don't drink tequila. Its definitely a local spot to visit the staff is nice and fast CHECK IT OUT"}
{"text":"Es un buen lugar para ir a quitarse el stress... Hay karaoke muy divertido para los que les gusta cantar, tambien venden comida que por cierto muy rica. Exelente servicio al cliente y por cierto muy guapas las muchachas."}
{"text":"I came here on a fight night to watch UFC fights. My group got there very early so it was dead. Just a few people at the bar and maybe 2 or 3 other tables besides us. No hostess, nobody seated us, it took a girl about 10 minutes to bring us chips and salsa and the another 20 minutes to ask for our drink order. Luckily, the UFC event was long so we were in no rush. We ordered mangoneadas, micheladas, and remedios drinks. They were great and I highly recommend them. 
We also ordered the torta, burger, and I got an order of hot wings. The torta and burger were small portions and we're just...eh. 
I ordered the hot wings with tamarindo sauce. They were really good actually! However, I was upset because the menu clearly said \"acompañadas con papas fritas\" which means \"comes with French fries.\" When I received my order, there were no fries. I asked the server about my fries and she said it doesn't come with fries. So I picked up the menu again to make sure it wasn't my error and it clearly said it came with fries. So I asked again and showed her where it said that. She said, \"Yeah I know it says that but it doesn't come with fries.\" Wait, what? Why would you refuse what's on your menu? Or why wouldn't you correct your menu? That made me so mad about this place.
However, my friends shared their fries with me and they had no flavor so I guess I saved myself some empty calories. 

For a UFC event, it actually wasn't super crowded so it's a good place to watch events. However, I recommend eating somewhere else and coming here just for drinks. The food won't blow you away but the drinks are great!

Oh, and the music they play is extremely loud. It's nice to have Mexican music playing but you seriously have to yell in someone's ear so they can hear you. It got a little annoying. Turn it down a bit!"}
{"text":"I think that I like to play because I like this place and I like my phone because it tells me everything that I like about the place that I like that I like about the place I like to read over the fact that my bones actually typing this because I like this"}
{"text":"This is a good neighborhood spot to drink, eat and listen to good music! The atmosphere is loud and alive! You can come dressed up or dressed down really doesn't matter. The crowd is mixed with young and older people. Great place to have drinks before or after a night of party!"}
{"text":"Pura calidad y buen servicio!!! 
Si lo que buscas es un lugar para divertirte los fines de semana, botanear y unas buenas cheves entre semana con un excelente servicio, este lugar esta mas que recomendado..."}
{"text":"Drinks were bomb and the food was good too! Alex was our bartender, kept a convo and interacted with us the whole time. :) Thanks"}
{"text":"Horrible experience the second time I went!! If your a female & your at the bar make sure you sit by the male bartenders work area!!! the female bartenders are horrible they wont interact with you nor ask you if u need any drink or more drinks!!! you will have to wait for ever till they actually acknowledge you so u can order another drink!!!! Also if you order food!! ewwww don't get the calamari that was so gross!! it tasted like rubber!! 
Also the music is ok but its just way to loud, you cant have a conversation with someone next to you; you will have to yell at each other. (to be able to hear one another) 
My tip for the Female bartenders would be to acknowledge all of your clients, and actually smile and try to interact a little. Make us feel welcomed!!! 
also to the owner or whom ever is in charge of the audio set up; turn the volume just a little down!! (I would also play more verity of music as well) it gets a little boring!    To top it off it's a SPORTS Bar & all they have on the tv's playing are music videos!!! lmao!!!! 
so if your really looking for a SORTS Bar this is not the place!!!"}
{"text":"I came to this place on 11/23/16 for a Michelada. I got food poisoning from eating their chips and salsa. I DO NOT recommend this place whatsoever, I got fever, stomach aches and diarrhea... never coming back.... EVER !!!!"}
{"text":"Super buen ambiente 100% recomendado,  las alitas super ricas!  Servicio excelente! La manager es la mejor. Elizabeth es la mejor bartender y yeseli la mejor mesera!!! Las dos están bien hermosas!!!"}
{"text":"Awesome food and drinks. They updated their menus and now they have more good stuff. The best is their Tamarindo wings!! They are the best I have had."}
{"text":"I like this place a lot, I use to come here all the time. The bartender girls can be so rude at times tho. She would smile and greet everyone else except us, it's almost uncomfortable to be there, tho I will continue to come I hope someone talks to them about their attitude."}
{"text":"wtf no id no welcome ...
bar / mexican nite club
No to many people just a few tables and few peaple at the bar to bad the are really strict rules..
We may try againg"}
