{"text":"This place is one of my favorite places to go to in Chandler. El sol cafe reminds me of cheers where everyone knows your name (lol) literally...making you feel apart of the community. The staff are always friendly. The food is consistently fresh and delicious. Anything you order will definitely meet your needs."}
{"text":"Tasty and cheap has always been my personal motto. I came upon the place by accident. I haven't lived in Arizona long and had been craving pan dulce (mexican sweet bread) for a while. Then all of a sudden I am just driving around and see the sign. I am greeted very warmly and appreciate the basic menu, and they also had a substantial supply of pan dulce. The food was very good. I had the shrimp tacos and a burrito.The burrito wasn't overly huge and the tacos not greasy at all. The salsa was fantastic with just the right amount of kick. I didn't leave feeling overly stuffed and gross like I do sometimes when I have mexican food. An hour later I tried a piece of pan dulce I picked up and that was great too. I was very pleased with my under $10 meal and 4 pieces of pan dulce."}
{"text":"Their breakfast burritos are awesome, mostly because their tortillas are amazing. The chips and salsa are really good as well. We've enjoyed anything we've ever eaten here.   The only downsides, which aren't even worth deducting a star, are that the tea never tastes fresh and their hours/days could be better."}
{"text":"Best vegetarian burrito I've ever had! Beans are so delicious. The chips and salsa are worth the trip alone."}
{"text":"Great little Mexican place. Everything I have gotten here has been great! Much better quality than the chain places! My picky kid will even eat here! Love it!"}
{"text":"A small place with friendly service. They have really good, authentic tasting Mexican food. Had a shredded beef taco and cheese enchilada combo plate and a bean and cheese burrito. Wow, they have the best tortillas around! Get there early as they close at 2:00. The front parking lot is tiny at 8 or 10 spaces, so you may have to park on the side street."}
{"text":"OMG!  I was just driving S on Arizona, and I saw a sign that said \"Homemade Tortillas\", and I was sold!  The parking lot was PACKED, so I had to park on a side street and walk a block just to get some yummy goodness (always a good sign).  Can you say DELICIOUS!  I got the carne asada burro, and some macaroon cookies.  Both were awesome.  The rice and beans were perfect.  The tortillas were so tasty.  CONS:  The portion of the burrito was small for the price (~$8).  The sole reason I am not giving it a perfect score.  And, while the salsa was delicious, I need a lil spice.  It was definitely mild.  Tasty, but no kick.    SUMMARY:  If you are looking for an amazing Mom & Pop to support with excellent customer service, stop by...often."}
{"text":"Hands down the best green chili pork I've ever had. Had the hungry man special breakfast burrito last Friday and Cam back today to get some breakfast (all the way from Arcadia). The green chili pork is fucking amazing! Spicy and delicious in a \"make the back of your head sweat\" kind of way. Pork and cheese wrapped in a tortilla made while the rest of the food was cooking, the tortilla was the bonus point. Fresh-made while the pork was cooking it was delicious and perfectly done. I will be back there, and a lot!"}
{"text":"Awesome place! Feels like nana is in the back cooking your breakfast burrito ha ha....the cherry empanadas are the best!"}
{"text":"First time here and very impressed! Limited parking so we parked down the street in a neighborhood. When the line is out the door on a Saturday morning...that's how you know it's good! Quite the hidden gem just down the street from our house too! The staff was very pleasant, everything is labeled and the menu is simple. Looking forward to coming back soon!"}
{"text":"Love it!  Everything was great and fresh (tortillas and beans were bangin!).  The baked goods were amazing (akin to some of the best bakeries in Mexico with great flavors like pineapple).    I dream of their empanadas."}
{"text":"The empanadas are legit!  Just enough breading and filling inside.  My favorite were the pineapple and cherry filled.  Way better than the grocery chains thick breaded empanadas."}
{"text":"Went for the first time today, I have tasted their salsa before - they sell it at Costco. Same freshness as the salsa in the restaurant. Ordered the green chile burrito, perfect size and amount of pork. The taste was so good.  Recommend you get there early."}
{"text":"Probably the best breakfast burrito known to man! I had the egg and potato add pollo asado.  From the fresh handmade tortilla to the juicy chicken this is a world class burrito.  Their salsa has the right combination of flavors and spice to compliment the excellent food. The only drawback is the wait, but food this delicious is well worth the wait."}
{"text":"It's not just a bakery. You can get freshly made tortillas and the best breakfast burritos in town. They're open Tues-Sat early. Lot's of Gilbert police officers eat here, so you know it's good food for a good value.  My favorite is the potato egg and cheese burrito.   Whatever group owns El Zocalo in downtown Chandler also, owns El Sol."}
{"text":"El sol bakery. Is a family Owen business they have the best breakfast, lunch the best baked. Breads. I recommended. It to anyone."}
{"text":"Their pastries and tortillas are absolutely amazing. The hour drive is definitely worth it"}
{"text":"this place is simply amaaaaaaazing...I only wish they were open longer but the food has never disapointed!!"}
{"text":"Just had my first carne asada burrito from here! OMG!!!!! I have never had a better burrito! I can't wait to share the goodness with my family:)"}
{"text":"Out running errands and didn't really feel like cooking so I called in a order for a breakfast burrito of eggs, potatoes,  and chirzo. I thought that since I called in I wouldn't have to wait long, wrong. After about 15 minutes of waiting (15 after I called in). After the first bite I immediately knew not only did I wasted time the burrito was horrible.  The egg was dry and very over cooked and the chirzo was pretty much non existing,  but that was a good thing. It too was over cooked, dry, and didn't even taste like chirzo. It had a bitter and sour taste, didn't even finish. Potatoes so so. So again I've learned my yearly lesson about this place. I live a block away but really never stop in. They are over priced and very over hyped. When first opened it was okay but they have forgotten commercialized and full of themselves.  Should have just gone south two blocks to Elmer's."}
{"text":"Been to this place 3 times, this morning being the 3rd.  My turn-off to this place is 3 fold.  First is the unbelievably long wait it is to get a take-out order done - even when there are no other orders in their system.  20 minutes for a couple of burritos?  2cd, this place is WAY over priced!  Their breakfast burritos are just short of 5 bucks, but they do not come with cheese, they charge you and extra .50 cents for that.  I had their version of Huevos Rancheros and it was nothing to come out of my way for. Small portions and the price was almost 8 bucks.  The guy working the counter today told me $4.95 for 10 freshly made flour tortillas.  Seriously? This is NOT a good price.    3rd,the dude working the counter.  About as much personality as a box of rocks and he has been working that counter all 3 times I have been there.    Their competition out beats them in price, quality, speed-of-service and taste, hands down.  I am referring to Los Dos Favoritos.  Their burritos are much cheaper and taste MUCH better and the wait is FAR less.  Their version of Huevos Rancheros is also far superior and the same to be found with everything on their menu, IMO.  I'm not saying the food here is bad, per-se, it just doesn't match up to other Mexican Food restaurants in town.  They are calling this place a bakery, I am assuming, because of all the freshly-made desserts and \"pan\" they have out there. It all looks good, but again, the price is too high.  The New Mexico grill is also better.    Anyway, not the worst place on earth but their prices need to come down and the amont of time it takes to get a small order out needs to decrease substantially."}
{"text":"AH- FREAKING- MAZING! Went on Saturday for the Mundo. we got there right before the crowd hit! place got packed so quick. the food was perfect."}
{"text":"First time visit - menudo and caldo de res were phenomenal!! Service is fantastic. taste just like abuelitas house!!"}
{"text":"Excellent service and food. Love the history of the place. Breakfast chorizo and carne asada burritos, both delicious. Great salsa."}
{"text":"I know this is a family owned business of 4 locations. I've been a fan of El Sol since 2000, 9 years I've been going to this great little place in Chandler, AZ.  The Bakery was once featured on The Food Network.  Every Christmas I get many of my families favorite Mexican cookies and send them home for the holidays.  I tell everyone I know about what great Breakfast burritos, tacos, tortillas, chips and salsa they serve.  The bakery goods are fresh and yummy everyday.  Never had a bad experience in the 9 years of visiting."}
{"text":"I LOVE El Sol!!  My family and I have been going here for breakfast and lunch for 4 years.  All of their food is absolutely delicious!  Their baked goods are wonderful and their entrees are the BEST!  I am from Texas and it has been such a challenge to find a Mexican restaurant whose food is as good as something we can get in Texas.  We found that with El Sol!  Their flour tortillas are homemade, as is all of their food.  The owners and staff are great and friendly and remember us every time we come in.  You must try this great restaurant!  You will not be sorry!! My only complaint is that they aren't open all the time!! :)"}
{"text":"I cannot believe I have just discovered this hidden gem after living in Chandler for most of my life.  My daughter and I had breakfast at El Sol and took pastries home.  Everything was delicious especially the house made horchata, salsa, and Mexican Wedding Cookies."}
{"text":"Lots of choices, even if they have a seemingly small menu. Homemade tortillas, (which means their chips are too). Omnivore and Vegetarian friendly.  Could not finish my breakfast burrito! It was too big! Amazing salsa! The latte is a good choice! Only 4 bucks for a huge cup of iced coffee. Better than Starbucks!"}
{"text":"If you love Mexican baked goods, you NEED to check this place out! The only non-spectacular thing was waiting a couple of minutes to be helped. However, once I was helped, the man was friendly and extremely helpful. I bought some pan de huevo and apple empanadas. Fresh and made right in front of you! The price and baked goods cannot be beat!"}
{"text":"From the variants of burritos, we had the bueno breakfast (the kitchen sink) and green burro.  The bueno is everything -- ham, bacon, cheese, etc etc... well wrap it up in a burro, and its exactly what you would expect it to taste like.  Wasn't wow'd but it was huge, and we cooked the leftovers with eggs and grits the next day (yeah Denny's style).  The green burro was better, chunky pork but I prefer Hatch green sauce for its smokiness which this didn't have.  The comp salsa and chips is tasty, and for fellow cilantro haters, the radar didn't go off!  The wait is looooong, so pickup an empanada to snack on while you do... the to-go area was full by the time we left, just waiting and waiting.  Friendly staff!"}
{"text":"Great authentic home style cooking. Fresh warm tortillas. Service with a smile and a great clean, bright atmosphere."}
{"text":"I have been going here for years with not a single bad experience. Possibly the best Red Chili in the Easy Valley. Breakfast is always on point as well."}
{"text":"Very tasty burritos - particularly like the shrimp ones.  They have a yummy sauce.  I'm not the biggest fan of Mexican baked goods, so I can't tell you how those are.  They sell their own salsa, among other things, in a refrigerator to the right of the door.  It's the best salsa I've ever bought.  Apparently Walmart carries it, too.  You won't be disappointed.   Tip:  They might be running a buy one, get a small one free sale of their salsa.  Can't hurt to ask.   Tip 2:  Check out the scary m&m's machine currently in the window.  The Arizona sun is not kind to m&m's:  http://static.px.yelp.com/photo/I8CRv80elEISHc-D2STbfg/l Tip 3:  Bathroom is in the kitchen, and believe the warning about the hot water!"}
{"text":"This is really the best place to get burritos in the east valley.  It's the tortillas!  My son and I go there before I drop him off at school sometimes.  On weekends we get burritos for the whole family.  My favorite is the chorizo/potato/egg burritos and my son loves the sausage/potato/egg burritos.  We also get a dozen homemade tortillas frequently (they are amazing) because they make the BEST cheese crisps at home.   We never get tired of the food from El Sol.  If you haven't tried it, try it today so you know why everyone loves it.  The owner and the staff are the friendliest people and always make us feel welcome."}
{"text":"Nice little place. The shredded beef burrito was delicious. Love the decor of the place. The paintings are nice."}
{"text":"This place is phenomenal Best Echiladas and beans of all time. Never as good as when it was Tia Juana's in LA but still quite wonderful"}
{"text":"This place has killer deep fried tacos.  Couple that with the perfect salsa, and you've got yourself a winner.  It's a little pricey, but it's worth it.  My wife loves the pineapple empanadas from here."}
{"text":"Finally I found a good spot for Mexican breakfast ! Delicious food, Great and fast service and the location is clean . I highly recommend this place to everyone !!!"}
{"text":"El Sol is my soul food. Best place to go for breakfast burritos, homemade tortillas, chips and salsa, lunch specials & desserts. Great location- great service- Ramon and Danielle are so friendly, too. I recommend this place to everyone and anyone I know. Go check them out, you will not be disappointed. The best!!!!!!"}
{"text":"Carne asada burrito was no joke y'all. Oooweee!! :) Why get one here, instead of somewhere else, you may ask? Well, whatever they did to the tortilla my perfectly cooked carne asada was on made it distinctive and amazing, and to be more specific, there was just the perfect balance between softness and texture-something I would usually only expect when eating cake.   I've been meaning to write about this place and just got around to it today. There are so many other food items here that are delightful also, and since they open at 7 am, it would behoove you to visit in the morning and try their breakfast burritos one day. They are only open from 7 am-2pm, and that \"only\" I throw out there is by no means a passive aggressive complaint; rather, I only want to to give you a heads up,\" and mention that this place does more business than places twice the size. This shows these folks know what they are doing. Its been around for decades and is a local staple for sure. Start your weekend off with breakfast here if you are in Chandler. Its comfortable and nice inside too!"}
{"text":"I still hit this place any time I can.  It is probably my favorite mexican place and definitely my favorite burrito place in town.  I hadn't seen one of the owners in quite a while and she still remembered me by name.  Great food and great people.  Chilero's is owned by the same family and if you live in the area is also great."}
{"text":"Cozy inside, true Mexican vibes. Lots of vegan options! Kaylee is kick ass at her job very knowledgeable super friendly. Food is freaking amazing! The cooks are hard workers very fast."}
{"text":"Truly excellent, from the service to the food. Pleasantly surprised and delighted. Fresh Salsa &  chips, and excellent red and green enchilada sauce. Will be back. Try the cookies too."}
{"text":"Heard much buzz about this place and read a write up about this fresh Mex food joint. So glad I made the trek. Friendly service plus plus.   They had a Chile Relleno plate and that was it. Great  rellenos are about as hard to find as good mechanics. It took about 15 mins to get the delish Plato but it arrived hot and fresh with bomb beans and rice. The rice was not dried out. The chips and salsa were sooo good. Thick hearty chips! Not the crappy ones from crapple b's lol! So the Chile Relleno oozed so much melted cheese and the batter was light and fresh and didn't taste like it was frozen and reheated like other faux mex rests.   Did I say the flour tortillas are good ? Heck yes they are ! Leaving the flour dust on your fingers when you use them to scoop up beans or Chile Relleno sauce. Got a chorizo burrito and it was really good.   Danielle brought out the food and drinks. Refills too and more chips and salsa and was so nice!   Will defin come back to this place. Nando's might have ambience with their patio but I came for the food. Thanks Ramon !"}
{"text":"Stopped in here for lunch!! What a great little spot in downtown Chandler! Fresh tortillas just like my Nana makes!! Roman was super nice and have great customer service! The place was busy and a little hectic when I walked in but her greeted each guest with a smile and in fact knew just about everyone that walked in!!"}
{"text":"Best breakfast burrito!  I've been enjoying El Sol for 20 + years!!! Love there empanadas and fresh tortillas as well.  Family owned, friendly service, all around great food and service!"}
{"text":"For a small restaurant their artwork is awesome, I just don't like they are close to a bails bond lol, but the food is very good their wet burrito ( enchiladas style as they call it in Arizona ) is very good the people running the place is friendly and helpful if I wasn't going back to Cali this would be my Togo Mexican place to bad I found this too late"}
{"text":"Nice place, with lovely decoration. The food was delicious. Carnitas burrito is probably best I ever had. Portions are big and staff is friendly and accomodating"}
{"text":"This place is mine and my husbands breakfast spot.  Nice charming and delicious food.  I always order their combo meals and my husband loves the green chili.  Get on their text group and get daily specials sent to your phone.  Their Mexican sweet bread is like eating the fluffy clouds of heaven....an out of body experience.  Enjoy the ride folks!!"}
{"text":"Worst service. Problem after problem after problem. Someone at the table had a bean tostada it was mostly lettuce. Ordered a combo and got an a la carte had to order more food didn't come until the rest of my party had left. Good food but the staff is so disorganized it's not worth the trouble."}
{"text":"Food was OK prices were outrageous combination plates are an average 10 dollars, if you want cheese tack on more money. Been there done that won't return......"}
{"text":"Counter service.  Not overly friendly service.  Chips were good.  Veggie burrito was okay.  Would eat it again but not go out of my way for it.    Entertainment coupon is only good at dinner time.  :("}
{"text":"ADORABLE Mom and Pop bakery and casual breakfast place (Not Fast Casual). For a decade, Filibertos has been my go-to for simple, large burritos that are close by, but since the new management, I have been craving a solid breakfast burrito.The kind owner of El Sol also happens to own El Zocalo (large sit down restaurant with amazing margaritas and mole in the heart of Downtown Chandler). I got 4 burritos TO-GO: Egg/Potato/Chorizo, Egg/Potato/Ham, Carne Asada (added potato/cheese/egg), and a Pollo Asado (reg).  Quick Tips: -Hidden! Next to an auto body shop and across the street from Bosa donuts -INCREDIBLE Salsa. I wonder if they have a spicier option. Not only did we get a lot of salsa with our burritos to-go, El Sol SELLS their salsa at Safeway. -Cheese is NOT already included in the burritos (+$.50 each burrito) -1/2 the size of a Chipotle burrito, but very filling -Outstanding tortillas that you can buy -I have been here before for their tacos. Carne Asada was the best. -Cute bakery with inexpensive pasteries!  Flavor 4/5 Even though I mooched a little of everyone's burritos, my Pollo Asada burrito ($7.65) was my absolute favorite. Extremely tender breast meat, tossed with a delicious asada seasoning and pico de gallo, and snuggled inside one of the best flour tortillas (smaller than Carolina's).   Chorizo breakfast burrito $4.89 (with added cheese (+$.50)) was amazing!! Great ratio of potato and chorizo/egg. The potatoes inside were my mom's favorite.  Carne Asada $7.65 (with added cheese, potato, and egg (came out to about $10)) was a little too subtle with the flavor. No exclusive breakfast option available. Salsa was necessary. Nevertheless, it was happily consumed. I prefer the taco version.  Ham breakfast burrito $4.89 (with added cheese (+$.50)) was another wonderful option!! My second favorite!! My small grandma devoured the entire thing.  Price 4.5/5 Prices start reasonable! But four burritos with add-ons almost broke $40. Surprisingly filling. Worth it!!!!!  Service 4.5/5 One more cashier would have sufficed! Busy, but worth the wait :)  I couldn't make the burrito last two meals, but these were some of the best!! I definitely recommend that El Sol put the Carne Asada burrito as a BREAKFAST option as well. Will bring the family to sit down and eat next time!"}
{"text":"I'm truly incredulous at all the high recommendations for this restaurant.  Because not only is it overpriced, but the taste is something the owners overlooked in their zeal to be authentic.  Problem number one is the long wait... too long for food that is so simple to assemble.  I do give them credit for actually making a freshly-fried tortilla for their hard tacos, but it shouldn't take much longer than not frying.  Assuming they have steam tables with hot food ready to assemble, it shouldn't take but a few minutes per order.  Problem number two, and I do emphasize this as being a big problem, is taste.  Beyond the great taste and texture of a freshly fried tortilla, the hard taco I ordered was absolutely boring.  Lettuce, tomato... and meat.  I'm not one to drown everything in salsa, so there was no rescuing it from that angle.  On my opinion, if the food doesn't taste great without salsa, it's not good tasting food.  Salsa should be an enhancement, not an integral part of the dish.  So that may be the problem here -- they overload your to-go bag with salsa in the hopes that you'll drown the food in salsa so you won't taste the food.  I also managed to taste their burrito, which seemed to be totally assembled with fresh ingredients.   Again, I totally applaud their effort.  The tortilla was freshly grilled, as was the meat.  In fact, it was over-grilled, with a strange carbonized/bitter taste.  Maybe it was the beans.  Or the rice, for what little I could find in the burrito (did I mention I'm originally from Nor-Cal? We do 'em different than the gringos do down here -- our burritos contain rice, mean and beans only).  Maybe it was the fact that I ordered a dish in a non-conventional way, and by combining ingredients that weren't meant to be combined I ruined their carefully planned flavor stack.  What I mean by that is that their regular burrito contains only meat and salsa, as do many burrito shops here in Phoenix.  They offer a \"super burrito\" with rice, meat and beans AND guacamole and sour cream + cheese (the latter 3 which I don't want), but charge a hefty $8.00.  The problem here, obviously, is that I don't want to pay extra for something I don't want.  So this is why I ordered it in an \"unconventional\" way.  I wanted it in a way they weren't offering -- rice, meant and beans only.  I think I now understand why they don't offer it that way -- they expect their customers to drown their food in guacamole, sour cream and cheese in the expectation that they won't experience the real taste and texture of their food.  Taco Bell, with their wide range of poor excuses foor food, makes better tasting food than this place.  Several bites into the burrito I realized that something in the burrito was overwhelmingly bitter or burnt.  There was no home-cookin' aroma or taste like authentic burritos, just bitter and conflicting.  There was nothing pleasant and soul-warming, just confusion and disappointment.  Finally, the prices were quite high.  Given how average their portions were in terms of size, there was no good reason for them to charge so much.  Plus this kind of food can be made deliciously without a lot of expense, it's all a matter of being clever.  Anyone that has to skimp on taste and portions does not know how to run a food business.    The bakery items looked deliciuous and freshly made, so it's possible that is what's driving their business.  Given my experience with their Mexican food, however, I doubt many people return.  In a sea of Mexican food establishments in Chandler, this is just another over-priced, over-hyped Mexican restaurant.  Next!"}
{"text":"The beef, bean and cheese burrito was OK, it was not worth the $8.00 they charged me for it, I could have got two larger one from somewhere else. I will not be going back to this location the prices have increased and the bakery has almost dissappeared, they need to changed the name of this place. One thumb up and one thumb down!"}
{"text":"In my most beautiful of weekend dreams, I long about waking up to a spicy, relaxed, perfect breakfast while I read the news in utter peace. On my side of town, NOTHING is relaxed or uncrowded... or frankly all that unique or good as far as breakfasts go. I am thrilled that I have a reason to be in Chandler now on the regular, because this is my new \"go to\" spot to get my fix.   The homemade tortillas? WOW. They were the best tortillas I've had. in. my. life. I had the chorizo egg (over easy) breakfast that comes with potatoes, refried beans, and even chips and superspicy salsa. The chorizo was awesome, spicy, and the eggs perfectly cooked. I spent a lovely, relaxed hour here for my first visit and woke up this morning dreaming to return.   They have a beautiful display of pastries which I did not partake in. Yet. Friendly staff, good service/refills. What's not to love?   LOVE LOVE LOVE El Sol!"}
{"text":"El Sol, I love your food and have recommended you to a lot of people. However you decide to play politics and put a red for ed sign in your window and, I'm out. So sad for good ppl to choose sides."}
{"text":"Go here for an amazing breakfast burrito.  seriously, i've had my fair share of breakfast burritos, and this place has some of the best.  their bakery items are great too.  hmm...my memory is a little fuzzy about the rest, i think i need to go here again soon... :)"}
{"text":"Great place!  Friendly service and outstanding food.  Ate here 4 times in 6 days of visiting here.  Wish we had a place like this back home."}
{"text":"Amazing!!! Wish they were open later.. buy the chips and tortillas to go home with you too, you won't be disappointed."}
{"text":"Lots of mexican restaurants in chandler but this is my favorite. Quick service + hot homemade food everytime .They make the best tortillas ever, also the Chorizo plate is awesome but you cant go wrong ordering anything here. The staff is really nice . Tip: pay attention to their hours they close early and arent open sunday."}
{"text":"Decided to try this place out, very good Mexican food. Only problem is limited parking. I will definitely go back for more"}
{"text":"Hands down one of the best Mexican restaurants around. The food was so good but better yet the employees were amazingly kind and helpful and HAPPY! A joyful place to eat at. It's rare these days to eat at a place where everyone seems to enjoy their jobs! The man taking orders was explanatory and helpful and the ladies were sweet and kind! That was my favorite part. The food, yummy! The homemade salsa was perfect blend of spicy and tasty. The beans were authentic and had lots of lard! Lard makes beans delicious and I don't like when places skimp on that. Mexican rice on point! I had a carnitas burrito covered in child verde! Big, filling and delicious. I will absolutely make the trek across town to eat here again! It is a smaller place so I can see that tables can be full and make for a wait, but get it to go! It's worth it!"}
{"text":"Awesome burritos! Better than your typical (insert-your-name)berto's burrito.  Tortillas are freshly made and taste amazing. The burrito is pretty big and left us full. Good chips and salsa.   The guy who took our order said to call in ahead on Saturdays, as it's super busy. We waited a while for our food to come out, but it was worth it.    Parking is sparse as the lot is small. We had to park on the street behind."}
{"text":"My biggest complaint is that they are not open on Monday.  Seems I always crave the sol on mondays.  They have an excellent selection of combos to choose from.  Quick service, limited dining area.  El Sol is owned by the same family that owns El Zocalo down the street.  Same great food, slightly cheaper pricing and quicker service.  Truly a treat.  Their baked goods are too die for as well."}
{"text":"I just had a Super Bueno Burrito to go..It was awesome. I also got enough salsa for the burrito. That's a big plus for me as well.."}
{"text":"Great breakfast burritos!  Pollo Asada chicken so flavorful! Homemade tortillas always fresh and delicious! Salsa is the best!  Tortilla chips are addictive and needed every week.  Salsa never last in our house! Adding cheese to burritos is a must!"}
{"text":"This place is awesome! Ramon and Danielle are excellent hosts to their customers and the food is great. The bacon, egg, and potato burrito is fabulous!"}
{"text":"We moved to Chandler from Tempe 6 months ago and dig this little place. Their homemade tortillas, which they sell, are fantastic! Love their chorizo and egg breakfast. Their chorizo has good flavor without being too hot. The potatoes are crisp on the outside and soft inside...yum! Beans are done right too. We've eaten in each time and the staff is very pleasant. They're only open 7-2 so plan accordingly and buy some tortillas to take home. We're lovin this place!"}
{"text":"These folks are open for breakfast and lunch only.  The menu is modest.  A few varieties of breakfast burritos, plus some \"classic\" items like tacos and burros.  I've had the chorizo breakfast burrito and the shredded beef tacos.  The former was tasty, but a bit mild.  Chorizo should have a 'kick' to it, but theirs doesn't.  Perhaps it's the other things in it that diluted it.  The tacos were excellent.  Simple, but really good.  I will likely be back, and I will try the chimi.  The result of that may either raise or lower my rating.  This rating really is about 3.5 stars, but YELP doesn't allow that.  I rounded up because Ramon was very friendly and helpful."}
{"text":"Don't let the higher prices stop you from ordering at the counter. Everything is hot and fresh."}
{"text":"We tried this place for lunch based on the reviews here and were not disappointed! I don't think I've ever had better tortillas anywhere. The shredded beef burrito was very tasty. Since I'm watching my calories right now I did not add cheese, sour cream, or guacamole (which I would always get any other time) and this burrito was still one of the best I've ever had. There were five of us and we all thoroughly enjoyed our food: tacos, enchiladas, or burritos. I will definitely come back to this restaurant!"}
{"text":"I drive as far as needed to visit El Sol, their tortillas alone are worth it.  Their food is always fresh, they have the most flavorful salsa you can find anywhere.  I have yet to try anything on their menu I did not love, I highly recommend this place."}
{"text":"This is our kind... a real winner-the most godly breakfast burrito I've ever had!! and FRESSSSSHHHHH made with their own special salsa. Love the urban decor indoor, and you see a mexican grandma cookin' it up in the kitchen-you know you're in good hands. We had to wait for a while for our food, but that was good news to us=ignore the whiners who demand the food fast. It meant that they were cooking everything from scratch. It's important that chefs invest their time and love in their food, and it reflected through my first \"ahh, this is heavenly\" bite of the burrito. I'm so happy I found this place!! I plan on buying their El Sol salsa. Always follow the traditional mexican bakery-guaranteed you will get authentic mexican dish. Not only El Sol was an exciting discovery, but downtown Chandler is a very cute n historic area to scope out! It's filled with many other mexican joints, which I'm sure are delicious. I look forward to going back to that area!  This beats Los Favoritos. Period."}
{"text":"El Sol has amazing food. The Pollo Asado grilled chicken burrito is one of the highest quality burritos in town. Their Chorizo, Potato and Egg burrito is also excellent. The bakery pastries are great. They are closed Mondays. If you like El Zocalo in Downtown Chandler or Mango's in Downtown Mesa, this place is owned and operated by the same family.  Pro Tip: You can get a large container of their fresh salsa at the Sam's Club south of the restaurant on Arizona Ave and the 202."}
{"text":"I love their food. We've been looking for a great family owned place. The owners are very kind and create an open friendly environment . I always get the Chorizo, potato, a and egg burrito! My husband tries everything and they have not let us down. #yummy #authentic #fresh"}
{"text":"We eat here constantly for lunch - fast - consistent - awesome mexican food and bomb pastry's too. Those cone things... get one... you can thank me later.  They do take debit and good chips and salsa while you wait but I've never had a lunch order come out more than ~6 min wait. refills on cokes and chips and a small little dining area but it's classic chandler hole in the wall with awesome food.  You have to go here"}
{"text":"Salsa is outstanding. Same with the tortillas. Would've given full 5-stars, but was disappointed in the Huevos Rancheros I got. I hope to go back soon and try more of their delicious looking menu items! This is truely Mexican food, which I appreciate."}
{"text":"I buy homemade tortillas here because i'm too lazy to make any and they are soooo good! The pan dulce is ok but I like another place in Phoenix for that. As far as the food goes.. I will add that later once I actually decide to eat there. If it is to my liking then I will add another star."}
{"text":"Place is small but very welcoming and clean. They have a great selection of homemade Mexican pastries and a ample selection of traditional Mexican dishes. I had their Huevos rancheros which is a  corn tostada shell topped with 2 fried eggs in green mild chili sauce, with a side of refríes beans, potatoes and fresh made flour tortilla. It was very filling and tasty. Definitely going back again."}
{"text":"Always a great experience... we mostly come to pick up breakfast burritos, which are the best in town. But their fresh baked pan dulce, tortillas and chips are delicious! I've enjoyed the lunch I've had here as well. Very friendly staff. Be willing to wait during busy times because it's well worth it!"}
{"text":"The very best place to eat like if you were at your Nana's cocina (Kitchen).  The homemade tortillas so so good.  The food well everything is Awsome."}
{"text":"Yum! Food, atmosphere, and owners were all awesome. Super fresh salsa. So glad we found this place! Update- We eat here once or twice a week now. LOVE this place! The cheese enchiladas (add onion) are so good! Breakfast burritos are great! We don't eat meat, but there are plenty of options for us. Yum!!"}
{"text":"Great food! I got the chorizo plate and my hubby got the carne asada burrito and they were both amazing! We also took empanadas to go and they were really good."}
{"text":"For being a Valley native, I sure dropped the ball on finding this place.  It's been around for almost 3 decades and we just discovered it today.  I have to say that they have the best tortillas I have ever had.  Hubby and I ordered the Super Bueno breakfast burrito and subbed sausage for bacon.  The burrito was gooey with cheese and beans inside, but the tortilla never ripped or got soggy.  They have an almost pillowy quality to them.  If you eat in the restaurant, they bring you freshly fried hot chips and red salsa to eat before your meal.  We ordered their fresh squeezed strawberry lemonade to share.  It was bursting with fresh strawberry flavor.  The man at the counter, who I am pretty sure is the owner, Ramon, was very friendly and told us about the restaurant since we'd never been before.  El Sol is a gem of a find.  I can't wait to try their bean and cheese burritos, along with pretty much everything else on the menu!"}
{"text":"O goodness was this place amazing. There wasn't anything that was disliked here. We will be back without question."}
{"text":"My brother come here all the time! The owner already knows us! The owner has such a great presence! My brother always gets the super Bueno burrito. Their homemade tortillas make the burrito! I love their homemade salsa! Mmmm I always buy it! And their chips too! I wish they were open on Sunday's but it's nice that they aren't as well so they can be with their families"}
{"text":"I start drooling just thinking about this place. The food here is amazing and so is the staff. I moved to San Fran for 6 months and when I came back, they remembered me and I only went there like once a week before.   Let me start off with the burritos: the tortilla is absolutely scrumptious and grilled lightly to perfection, you can tell they actually make it themselves. The meat is so juicy and delicious I can't even begin to describe it. My personal favorite is the shredded beef burrito (i add cheese to it..mmmm). Their breakfast burritos are also insanely good and have good portions of ingredients (it's not all egg).  SALSA!!! Holy hell, their salsa is phenomenal and available for purchase in-store in the fridge on the side in a small or large container sizes. Sometimes, if you mail Santa enough, they sell it at Costco in large containers...those days are glorious. They also have fresh chips that they make every day that are soooo good.  Finally, the pastries...yum yum yum, I''m in love with the cream horns and cherry empanadas. They are always baked to perfection and are so fresh.  I'd recommend this place to anyone, great for breakfast, lunch or dinner since they now have extended hours from 7am to 8pm Tuesday-Saturday. Only downside here is that they aren't open every day :("}
{"text":"Fresh food...very delicious and fantastic service. The menu has plenty of vegetarian options too. The chips and salsa was amazing."}
{"text":"I love there traditional baked pastries, they always have a great selection and when I'm making burritos this is the only place I go for fresh tortillas."}
{"text":"I just ate the most incredible breakfast burrito at ElSol, I had the chorizo bacon potatoes egg and cheese. Everything tasted so fresh and was a great start to a beautiful morning"}
{"text":"I first came to this restaurant over 10years ago and they still are delivering the same quality, if not better. The pastries are okay, but the burritos and most other items are made with love. Staff is always friendly and helpful. Oh and the best item (to Me)is the horchata! You'll be sure not to leave disappointed after your visit!! What you waiting for??"}
{"text":"So we found this place when we were super hungry. I was a little hesitant mostly because I have a hard time making choices when I'm hungry. But MAN I am super glad to find this place. Amazing food and really friendly people. The carne Asade is really good."}
{"text":"Good, fast, great price. Not sure what else to say.  I mean they are tacos and burritos I will say i didnt like the way the line wraps around inside next to the people tgat are eating. But its worth it"}
{"text":"Excellent breakfast burritos , awesome 60's rock playing and beautifully decorated. Tortilla, potatoes and egg were all very fresh. Salsa was amazing too. We will be back very soon."}
{"text":"Service - very nice, efficient, informative, and no pushy sales (jk). Wait - mmmaybe ten minutes.  We dined in so we certainly weren't in a hurry.   Food - started with chips and salsa.  Best tortilla chips ever.  Thick, but crispy so they break clean and easily but no threat to breaking teeth.   Salsa was innocent, until you least expect it and then it sneaks up and says hello.  A nice bit of flame to lure you back for more.  I think my Mother In Law might like this stuff. My breakfast was Juevos Rancheros and it was prepared much differently here than anywhere else I've had it.  Those other places must be fakin' it.  Crisply fried flour tortilla topped with two eggs and their green sauce, refried beans and some fantastic fried potatoes on the side along with a hot flour tortilla wrapped in foil to keep it hot. I think I heard myself say, \"Get in my stomach\" outloud!  I'm so embarrassed.   Okay, not really.  It was smelling so good and several steps from the norm, I was happy to have a fork in my hand and doing its thing. I couldn't finish my breakfast but my son was happy to finish the task and lick the plates clean.  I enjoyed talking to the owner and the wife of the gentleman whose art graces the walls.   I enjoy seeing nice art by local talent on display, and how cool is it that he's part of the business too.  Great food and a feast for the eyes as well. Love having another fantastic dining option."}
{"text":"This my new go-to Mexican restaurant. The service is outstanding- very welcoming and accommodating. But the food!!!! Oh my goodness - I ate here twice in 3 days and my absolute favorite is the chorizo, egg and potato burrito. The best I've ever had. Perfectly seasoned and FAT!  The salsa is a perfect compliment and you can tell the tortilla is freshly made.   I'll be bringing my family back and trying more of the menu.   P.S. Had the apple, cherry and pumpkin turnovers----BOMB!"}
{"text":"Awesome chips and salsa, delicious cheese enchiladas and rice. Perfect customer service!"}
{"text":"Prologue: My fiancee decided she wanted to go for brunch instead of our usual Saturday night dinner date. Her online review of restaurants serving breakfast and lunch in our area yielded this result along with several good reviews.   The Plot: We shared the Huevos Rancheros Plate, a Breakfast Burrito (with ham, chorizo, and potatoes), and a Pumpkin Empanada.   The Scene: Good, simple home-style dishes cooked to order is the best way to describe the items we tried.  The portion sizes were decent, appropriate for breakfast, and sufficient to satisfy both of us (along with chips and salsa, as usual).  I do like my eggs over easy with the yolks cooked as gently as possible, which was exactly how the Huevos Rancheros was prepared. The eggs were served on top of a crispy, fried tortilla that was easy to cut with a fork and covered with a very tasty green chili gravy. The plate also included the traditional beans and potatoes.  My fiancee was completely satisfied with her burrito, which was prepared with plenty of the meats and a freshly made tortilla, and was a good vehicle for lots of chili sauce as well as a nice compliment for the Huevos Rancheros.   The Rest of the Story: The restaurant was cozy, service was very friendly, and the prices were reasonable.   Epilogue: We've discovered another nice, quiet place for brunch on the weekends that deserves a solid 3 stars.   Photo Design: by Billie Z."}
{"text":"El sol bakery is one of those places that everyone says \"You have to go there\" or \"OMG....it is so good.\"  So over the past 5 years I have gone there 3 times.  Each time swearing that I would not go back for any reason, then like every victim of abuse I find myself going back to the same place that has hurt me so many times before, thinking \"This time will be different.\"  and \"Maybe it was my fault, if only I was a better customer.\".   The food here is good.  I have always liked the food, once I have gotten it.  But there in lies the problem with El Sol Bakery. Every time I have gone in to place an order for take out, it has taken over 1/2 hour for them to get the food to me.  Have you ever had to sit there and look like a dope waiting for your take out order?  Well if you haven't, let me give you brief snipet/summary of the conversation that played out in my head, wit my self.  10 minutes after ordering: Man...this is taking a while.... Can't rush good food... heh... Hmmm... lets look at my phone.  15 minutes after: Boring... Hey! how in the fuck did that guy get his food, he just walked in. I am so hungry. Really?  That lady came in like a full ten minutes after me....This is horse shit. I did order didnt ?  20 minutes: Am I losing my mind?  Did they forget about me? Should I be a dick and say something?  25 minutes: Berrber grrrrmmmdrib! Really? What the Fuck? She knows I am here, she just looked at me. Thats it. I need to say something.  30 minutes: GOD MOTHER FUCKING DAMMIT!!! I AM LOSING MY MIND! All I wanted was a Burrito. That is it. A simple little burrito. I did order didnt I? Did I already say that? Hmm...what was the answer? Well did I? I have been here all morning.  It is going to start looking like I like to hang out here. That is it. I am going to burn this dump to the ground.  That'll teach em.  I am not even hungry any more.  And then sometime beyond 35 minutes, she brings over my order and I like the dope that I am just smile and say \"Thank you\" and walk out.  Why do I take such a beating over a stupid food item?  Why don't I ever say something?  Why do I go back knowing that these people are going to systemically push me over the edge?  Why does it take over a half hour to make a burrito?  Really it is not worth it."}
{"text":"Great little Mexican place. The interior is very nice and updated. They have the best tortillas around and the prices are very good. If you haven't been here you should definitely check it out."}
{"text":"So, here is what I propose you do. First, the breakfast burrito with ham, cheese and potato. Then Lunch - the giant burro with chicken, a fresh lemonade and tres leche cake. Go into a food coma for 3 days, repeat... No you will not live long, you will not be productive and eventually you will outgrow your pants, your bed, your house  but you will die happy and really that is what is all about...so, I repeat, the breakfast burrito...go for it!    El Sol is found in some dumpy strip mall on Arizona Ave next to a trophy shop and a defunct piano tuner betw/Chandler Blvd and Ray. Parking is maybe the 3 spots in front. It is the perfect lunch spot when you want to take the afternoon off and sleep, the perfect breakfast when you want to eat and nap directly afterwards.  It is not heavy food, it is not greasy food, but whatever turkey dinner has in it, it has got it in spades! It is that full, I really should take some time to enjoy this meal type of feeling. Enjoy."}
{"text":"Today we went to El Sol to pick up breakfast burritos.  They were so busy for a Saturday  (not sure if that is normal) but we ended up waiting an hour for our burritos and found out that the young lady only placed an order for 3 of the burritos and not 4. She offered to have the  cook make the fourth burrito but I didn't want to wait any longer.   They had run out of the fresh tortillas and since I had already paid for some they pulled a bag of hot off the stove burrito tortillas.   We have gone here for lunch and even spoke with the owners while there, they are very down to earth.  The food is really good.  I will have try another morning to try their breakfast burrito since I gave my family the 3 we came home with. If you are going to order food either call the order in or sit in (you will still need to order at the cashier)."}
{"text":"It's like Mexican food without being super greasy. Else everything is good here. Service is good as well.  Wish this place was bigger that's all."}
{"text":"I really enjoy El Sol. Their service has alway been great. It always a nice change of pace to go to a smaller restaurant where people actually care. The food is great. Try the killer burrito with carne asada."}
{"text":"We had to run an errand in Chandler and were looking for breakfast. I checked Yelp and found El Sol. I had the chorizo, egg and potato breakfast burrito and my husband had the bacon, egg and potato burrito. Both were huge and delicious, wrapped in a homemade flour tortilla, YUM! But the kicker was the salsa and the chips made from homemade corn tortillas.   They do a brisk takeout business but they have 9 small tables if you want to eat in. The service was as great as the food. I was a little bummed because we live in Surprise and it's an hour away. Then they told us about Burritoholics (little bit closer) and we can't wait to try it. Right now, I'm wishing I'd bought some tortilla chips and salsa to bring home."}
{"text":"New to the area. Amazing food can't get enough. Will be back for breakfast. Bought tortillas and they were awesome. Great good great service and great atmosphere. Must go and try everything on the menu and affordable."}
{"text":"Pricey for what you get. Pretty good flavor. Service was ok. I'd say go to Elmer's right down the street instead."}
{"text":"I had the quesadilla with beef. This was HUGE. I totally recommend splitting with someone. They have homemade tortilla chips, tortillas and salsa. The chips are salsa were AMAZING. I would love to come back and try the horchata.The staff was very friendly and made sure we were taken care of. Very good mexican food."}
{"text":"Service was stellar and very friendly, had the Huevos Rancheros which came with a green chili sauce, done right and not too soupy. They also have turnovers on the counter, get several they are perfect with coffee."}
{"text":"I do love this place! It's one of my favs. I just wished they didn't closed so early in the afternoon."}
{"text":"Awesome little family run place in the heart of Chandler. Fresh food, made with love. Best bean & cheese burritos, cheese quesadillas & so much more. Friendly staff too. The line can be long at times & their parking lot only holds about 5 cars but that seriously just adds to the charm of the place. Also, I love that I can get freshly made Mexican pastries! LOVE! LOVE! LOVE!"}
{"text":"Their salsa is full of flavor and chips home made. I have  only had their burritos never ordered any thing else because their so delicious, I Highly recommend it, would def come back again as I have been"}
{"text":"This review is solely on the tortillas alone. Fresh and awesome. I don't think anywhere else in the valley make them well as they do. Its saddening though they close early but you should get them early as they open. Texture and taste of these tortillas are not chewy or dry. It's really what you want from them soft durable. Oh it's great with the pork salsa verde my fiance makes. This is the tortilla joint"}
{"text":"Their pan dulce is to die for! Baked fresh every day by the grand father/ owner and he does amazing work.  It sells out super fast so you know that its amazing.  Ive tried a few lunch items off the menu as well and it was great.  The staff/ family that owns the place is so nice and they treat you like family."}
{"text":"I was looking for a good breakfast burrito and saw the reviews on Yelp and thought I would give this place a try.  Everything was DELICIOUS!  I got a chorizo, egg, cheese and bean burrito.  After cutting it in half I could not tell if there were refried beans in it and asked the owner as she was going around checking on all of the customers.  She told me they were mixed in but would bring me some on the side too.  Im so glad she did because it allowed me to taste how delicious the refried beans are by themselves.  I ate them with the home made chips and salsa that came with my meal.  I also had their fresh brewed tea that was very good.  I only ate half of my burrito and asked for a container to take the other half home.  The owner comes back with not only my half burrito but also put more chips, salsa and refried beans in the bag to go.  She also brought me a large tea to go.  This place was such a good find for me and I can't wait to go back!"}
{"text":"Tasty Mexican breakfast and pastries. Love the breakfast burritos. The salsa is very good, too. Staff is friendly and they do a great job of getting orders right and preparing the food very well."}
{"text":"Amazing food never disappoint !! Their salsa is full of flavor and chips home made. Iv only had their burritos never ordered any thing elts because their so yumi. Highly recommend"}
{"text":"OK, I'm impressed. Simple food but delicious. Small establishment with few tables but a nice choice on a Saturday lunch spot. They have bakery items for sale as well.   Recommend giving this place a try."}
{"text":"Wow, we rolled up for breakfast, and were pleasantly surprised.  My wife ordered a breakfast style burro with their green chile, and I asked if they had chilaquiles... WHICH THEY DID!  Yeah, its not on their menu, but the chef will whip an order up for you.  Their enchilada sauce perfectly complemented this dish.  Their chips and salsa were tasty, and my wife's burro was delectable.  Really, it was delectable.  I'm not just repetitiously writing the word delectable for the hell of it.  I'll be bringing the familia back to check them out for lunch, or maybe dinner fare.  And if Shakira happens to be in the neighborhood, she can come too."}
{"text":"Great family restaurant!  Great food and holy horchata! Love the tacos and enchiladas. Burritos ain't bad either.  The gems of this place are the pastries and the horchata. Seriously. Save some room for dessert. And they have the best horchata in town. It even beats out Joyride Tacos, hands down! No contest...  They're not open for dinner so aim to get there before they close! Prices are a tad more than some places. About $10-11 a person, but we still love to go."}
{"text":"We are constantly ordering there breakfast burritos \"eggs,bacon,potatoes,and cheese\" or there choriso is also a favorite which are awesome! there Salsa is so good, cant get enough.you can see the cooks making your food,everything is so authentic and fresh ,from the  tortillas to there pan dulce.. oh we always call in our order for pick up..there tends to be a wait in the mornings but its well worth it!!"}
{"text":"Great, tasty food. Burritos are in home Made tortillas. Beans taste authentic. Customer services is amazing.  Chips are home made with a perfect crisp."}
{"text":"Very small place so get their early for lunch especially on a Friday. Love the horchata, carne asada tortas and chorizo breakfast burritos. They also provide super tasty chips and salsa. It's a good spot for our team. Service has been friendly as well"}
{"text":"Is it tacky to turn \"Om nom nom\" into a review? Because that's my review of El Sol: Om nom nom.  There are lots of great comments here about their (admittedly delicious) breakfast burritos and other foodish Mexican food, but the best part of El Sol in my opinion is the part in its name: the bakery.   Tons of tasty baked and otherwise pastry-based goods. I would kill for their empanadas. Maybe not literally. But figuratively, without a doubt. They're always perfectly done and have a crust that's just right. And they're available in nearly any flavor you could want. I'm totally jonesing for an El Sol empanada now after writing this."}
{"text":"Phenomenal restaurant! The atmosphere matches the quality of food--- wonderful! Everything is fresh and delicious! My favorite breakfast place in chandler! I go everyday I am in town! And I take a few dozen tortillas back to DC with me every time. I can confidently guarantee that you will love this place. So don't shun it until you try it!"}
{"text":"I love El Sol! I used to work at a little bar across the street that got all of their fresh tortillas from here. That was back when they were only a bakery. They now have a full menu of Mexican food also, and they cook as well as they bake. We often stop for breakfast and you can taste the fresh baked tortilla that I remember from years ago wrapped into a gigantic breakfast burrito.  It's clean and the people at the counter are beyond friendly. Thank you El Sol"}
{"text":"Fresh tortillas are made in front of your eyes and delivered to your mouth. Wonderful bakery selection, great empenadas. I enjoyed the simple bean and cheese burrito but it's all good.  Clean dining area, good service, stop reading this and go there! Shout out to the \"dubonthereg\" blog for the photos. Great little blog, enjoyed reading this and other reviews."}
{"text":"Frankly the only place I get Mexican pastries in town. I have been eating here for almost 20 years. As a matter of fact, I need to go get some soon."}
{"text":"Great burritos. I had chorizo, potato and egg. Not greasy, good stuff. Homemade tortillas are so good! Homemade lemonade is also fantastic. Friendly staff. Why would anyone go to a chain restaurant when there's a great local one right here?!"}
{"text":"They're breakfast are legendary delicious and authentic mexican. Delicious  and their sweet bread is delicious"}
{"text":"Love this place. I've only been here for breakfast but that's enough to know this place is amazing! The super bueno burrito is legit! The owner is typically at the restaurant and is very personable. Obed makes you feel like family."}
{"text":"Went for breakfast with a friend, local guy raised in the neighborhood. Ordered our huevos rancheros at the counter. Chips and salsa brought to the table. Really good fresh chips! Breakfast was perfect and delicious. Nice crispy corn tortilla, with the eggs and green chili on top. Creamy frijoles, and a hot home made flour tortilla. Nothing fancy, but everything was fresh, home made and delicious!"}
{"text":"My partner and I have had breakfast and lunch at El Sol at least 20 times since moving to Arizona two years ago. We typically have Mexican once each weekend, and El Sol gets more of our business than any other place in the valley.  The chips and salsa are almost always excellent, the latter being refreshing with just the right amount of kick. Their shredded beef / machaca is great in any form: burritos, enchiladas, crispy tacos. All great. My partner likes to order shredded beef or carne asada chimichangas made enchilada style, and their red sauce is delicious. I've had the breakfast burrito a couple times, and the other reviews are spot on with their compliments.  The bakery is not to be overlooked. We've tried the empanadas, Bavarian Cream Cones, various cookies and rolls, and everything is fairly good, but the Mexican Wedding Cookies are to die for. When we order a bag to go after lunch, they are usually gone before we get home. By usually I mean always.  Service is friendly and very prompt. The food is the best of its kind in the East Valley and can hold its own against any of the more widely yelped places in Phoenix."}
{"text":"My fav breakfast burrito place! Super Bueno!"}
{"text":"Great food!  Homemade tortillas that are very good.  The horchata is the best I had, others most also think so because it sells out before I get there half the time.  I have had their breakfast burro, green chili tostada, and menudo and been very pleased with all."}
{"text":"I've never had a bad meal here.  The carne asada is juicy, the pastries unique and fresh.  The tortillas are always fresh and soft.  If you love home made Mexican food this is the place.  Try the chicharrones, thery're fantastic!"}
