{"text":"We love this little Mexican joint! Much more authentic than Emilianos & we love their chorizo, carnitas & crab options! The servers are always friendly & it's a fair price. Me gusta El Toro Loco!"}
{"text":"Long story, but funny. My wife and I had a night out. Being very seasoned service industry veterans, we have a decent tolerance for people that are busy on busy nights. Our bartender/waiter was busy . . . Because he sucked. He was weeded from minute one, screwed up my order,my wife's order, overcharged us for guacamole and had the cahones to ask us if everything was fine.  We paid $50 to eat 2 dinners that we didn't order, waited a long time for everything and had to listen to him complain about his incompetency. He claimed that he had bartended for 7 years, but looked like he started yesterday. 
Our food was ok, but no where near what we ordered. I will give them another chance, but pray that \"David\" will be nowhere to be found."}
{"text":"Tasty tasty tasty! Good margarita for only $3.50 on Saturdays! Chorizo and cheese dip to start was amazing with a ton of chorizo. Kid's quesadilla was nice and served with a heap of rice. Choripollo for husband was huge and delicious (much bigger and with more chorizo than Emiliano's). My Pollo con crema was good and a great big portion. It was a little bland but I think that was due to not knowing anything about the dish and assuming that it would be spicier. All in all, a great place."}
{"text":"Terrible. Both our orders were messed up and we were the only people there. My husbands food was cold and the melted cheese had gotten hard. One of the staff members was sleeping on a table in back. The waitress/hostess spent the whole time paying her bills on the phone. We will not be back."}
{"text":"We went here for dinner on a Saturday night and had a wonderful experience. The specials are great and everyone gets chips and salsa! Our server was Ally and she was very nice and attentive. I will definitely be coming back!"}
{"text":"OMG. Four of us are here tonight. Good margaritas. Awesome food. Giant portions. Enough to bring home for tomorrow and then some. Best waitstaff ever. On my play list next time in town. I don't write many reviews but this place deserves more business."}
{"text":"My wife and I decided to stop by El Toro Loco on sat night bc we heard the food was amazing. We are seasoned bartenders ourselves. Unfortunately, we were not able to get a seat bc the place was packed so we sat at the bar. I was absolutely disgusted to see so much work dropped on their poor bartender David. The poor guy couldnt keep up with the printer spitting tickets out left n right n he didnt have hardly any time to fill ours back up. They ran out of margarita glasses too! Looks like childs play when it comes to management there. I would never ever work there unless they had more than one bartender. I felt so bad for the guy that I left him $20 tip n told him he earned it. As far as the food, it was amazing! Def worth every penny spent."}
{"text":"Simply a great authentic Mexican restaurant. Had lunch there a couple days ago and it was fantastic something that is a rarity these days as Mexican restaurants go. I had the chicken chimichanga lunch special...wonderful food can not wait for my next visit."}
{"text":"This place was unbelievable, the chips were crisp, warm and the salsa cold and spicy. The burritos were cheesy, but a little too much rice and beans, wish they had a little more meat in there, but it was satisfying none the less, def should check it out"}
{"text":"The service is excellent and the food is great! The seafood nachos are amazing with delicious cheese sauce. The fajita quesadilla, fajitas, and marcos stuffed burrito are all excellent as well. Generous portions and quick to refill drinks. This place beats mad mex which lots of people like and I don't understand.  But then, people around here like eat and park too which is unimpressive. Hit up el toro loco for some tasty food and great service!  Two guys were checking up on us and they were super fast and pretty awesome!"}
{"text":"Food was decent, but it took over 40 minutes to get it. It was a busy Saturday night, so I expected as much, but then our food arrived cold. Mine still tasted alright, just not warm at all. Our waitress was incredibly stressed, and let us know it. 

It was just so incredibly disorganized. The flow of the place was so scattered, people were huddled in groups waiting to use the computer or waiting for things to come out of the kitchen, it severely lacks any kind of management."}
{"text":"HUGE portion sizes! You could definitely share a meal, even big eaters. The waitress was great too. She accommodated all of our preferences and never made us feel like we were high maintenance diners. I definitely recommend this place for your next Mexican fix."}
{"text":"When it comes to getting the bang for your buck, this place really knows how to satisfy a poor college student like myself. I came here on a Thursday and just in time for their 99c taco deal. The only meat option was ground beef, but you can choose between soft or hard shell. The tacos are pretty average, your typical Americanized taco, but the fact that it was only 99c per taco made it so amazing. Pour on some hot sauce for that extra kick! And the very best part is that the chips and salsa are FREE! 

My meal consisted of three tacos (2 soft and 1 hard shell), chips and salsa. I was super stuffed and the bill came out to be...(*drumroll please*)...only $3.15. Cha ching!"}
{"text":"I was here last night for my birthday. We started at the bar drinking their $3.50 Margaritas. They were delicious ! The bartender was nice and kept our chips and salsa filled . I'm a huge fan of Emiliano's but the drinks were way cheaper here so we decided to stay for dinner . The food was OK. Very far from \"delicious\". I'd go for drinks again but will not eat the food-- mostly because I've been sitting in the bathroom since about twenty minutes after I ate ..... I'll save yinz the details."}
{"text":"I really was excited about this place.... who doesn't love good, authentic Mexican food and margaritas!? However, the whole vibe is really bland and boring. They need outdoor seating and a better atmosphere."}
{"text":"Taco Bell gets 3.5 stars and this place is only at 4?  COME ON PEOPLE...!  This is THE BEST Mexican restaurant in Pittsburgh.  

My wife and I were in Cancun 2 weeks ago and after an entire week of Mexican food we both had sworn it off for months... that is, until we were out at Excuses and decided to grab a bite to eat.  Fat Heads would have been the first choice but the wait can be crazy long.  Sake for sushi was my second choice but the wife wasn't in the mood.  El Toro was her suggestion.  

We were not disappointed.  We were met by what must be the owners' wife or the mother of the guys working there, she had a big smile, remembered us from visits past, asked if we would like our same table and immediately seated us and delivered ice water, chips & salsa.  Then she introduced our waiter and was off to seat other guests.  Our waiter- Mauricio or something- was very friendly, recommended a few specialties then gave us time to decide.  He even told us that margaritas & Coronas were half price and we ordered one of each.  The mega-margarita with the mini-corona is always Kim's fav and she loved it.  That drink is big enough to share but with Mauricio being 'quick on the draw' I never had an empty bottle in front of me.  

For dinner, we chose the Molcajete Fajitas- steak & chicken (we're not fans of chorizo) and they were delicious as usual.  The quality, service & portions have not changed since our first visit.

We will continue to be customers of El Toro because they deliver what we want- authentic Mexican, fair prices and excellent service."}
{"text":"My friend and I religiously go to this restaurant every week because we are both obsessed with mexican food and this is definitely the closest thing to authentic you'll find in the whole city. The staff is always very pleasant and attentive and the food is always amazing. We used to go to Emiliano's before this place opened, but the food and prices at El Toro Loco are significantly better. Give it a try!"}
{"text":"I'll start by saying I've been a huge fan of Emiliano's (across the street) for years, so when this place opened across the street while I was living in South Side last year, I had to check out the competition.

And, sadly, its not competition at all. The food was supbar at best. I ordered a 'salad' for $6 and got a few random vegetables in a very, very small bowl. All the things I subsequently ordered were cold, bland and had very little flavor.

The two stars are for the staff, who was very friendly and accommodating. Maybe I just had a bad experience food-wise since the place was new, but I don't think I'll be returning on any future visits to find out."}
{"text":"I've only been here once. The food was average. The service was great.  The banana Margarita was unbelievable!"}
{"text":"Nice hot fresh chips when you sit down. Good happy hour drink prices. The chicken salad I ordered was pretty skimpy, and didn't come near the picture in the menu as far as quantity. It did taste good, though. My friends, who ordered fajitas and tacos, were happy.  You can get food that tastes as good across the street, for better prices, but it isn't as nice an establishment."}
{"text":"this place is 1 of 3 'Mexican' restaurants along Carson Street and overall, it's my favorite compared to the mediocre portion-controlled Emiliano's (tiny portions, mediocre dull uninspired food/expensive) and La Palapa (good but a tiny little space, not good for groups and kind've expensive, also .)
El Toro Loco is somewhat Americanized to suit the American Pittsburgh palate but it's still good n tasty .   The atmosphere is colorful cheery & bright which is nice .
There was previously, another Mexican restaurant in this same space - Taco Loco which didn't last more than a couple years here for whatever reason .  It was a steel mill worker bar, eons ago .
I recommend the Chorizo-Cheese fries as an appetizer .  Cheese & Chorizo were meant for each other !!!
I think the prices are on the high side for a burrito and etc but i'm sure their rent is very high considering it's on the more high-price end of Carson Street .
I don't ever see any kind of advertising or promotion for this place ... they'd be good to invest in some of that and put up a billboard around town here & there as the big Chinese buffets sometimes do ...
Speaking of which --- i'd love to see them offer an all you can eat buffet once or twice a week ... it would surely be a hit with all the scores of college kids who live in the area during the College school months ...  Anyone that's hungover loves a buffet ..."}
{"text":"I've been to this restaurant several times and have tried everything from the huge sample platter to the chicken and steak fajitas... Everything is delicious! I keep going back trying different things and  I've never been disappointed! Great food great service I give this place 10 stars!"}
{"text":"Great addition to the Southside!  Better quality and more affordable than Emiliano's with much fresher tasting margaritas!  Please check this place out so that it stays in business."}
{"text":"Wow, this place impressed me.

I LOVE good Mexican food, and unfortunately for us 'Burghers, we are at a terrible shortage of excellent Mexican options here in the Steel City. However, after a visit to El Toro Loco, my opinion has changed.

I've been meaning to try this place out for a while, frequently passing it and going to Patron instead. Sorry Patron, you've been kicked to the curb.

So the reason I went here was because I heard they had a Taco Tuesday special all day, as well as Thursday. 99 cent Beef soft or hard.

The tacos were filled with perfectly seasoned ground beef, and topped with fresh lettuce, diced tomato and shredded Americanized cheddar. I would have preferred a Mexican style cheese but I'll take an authentic taco shell over cheese any day.

The reason I like this place better than patron is simple - they actually season their meat. That, and the complimentary chips were hot and fresh, and the salsa was spicy, home made , and had lots of cilantro. 

Soft drinks were super sized and had free refills. (Coke products). TV scenario is excellent at the bar and the specials are ridiculous every day. See posted pictures.

Awesome tacos, great service, cheap, and worth a stop. Will definitely bring friends here to watch a penguins game."}
{"text":"Why did it take me so long to dine here?  Why did I wait?  Why? Why? Why?  Enough with the rhetoric questions from me.  I finally had a chance to dine here and I am pleasantly happy.  I am a big fan of Mexican food and this place did not disappoint my palate.

I showed up with a friend after the lunch time rush, which was a good idea because there was no wait for a table or service.  I like the decor inside as it makes it feel like an authentic Mexican restaurant even though it sits in a late 19th century European style building.  Even if the decor wasn't spot on, the food sure lets you know that you are in an authentic Mexican restaurant.

Like a majority of Mexican restaurants chips and salsa are a staple on the table (however, due to allergies I wasn't able to partake in the chips *sad face*).  However, I was able to maneuver around the menu and find something I would not have a problem with.  I ended up opting for the Burritos Azteca.  Now I'm not sure I should say this came out on a plate, it was more like a platter with a small side dish.  Not bad for one meal.

The Burritos Azteca consists of three burritos: one ground beef, one pulled chicken and one cheese.  All topped with an in-house sauce that has just the right amount of spice.  Accompanying the burritos on the plate is a nice helping each of their fried rice and refried beans.  On the small side dish there is lettuce, sour cream and guacamole.  Adding those to the burritos evens out the spice so it's not the most notable aspect of the plate.

I'm not going to lie, I kind of devoured my plate much like an animal.  Things were falling out of the burrito with every bite I took.  I wasn't mad, it just left me with the makings of a little Mexican salad on my plate.  I ate every single bite on my plates.  I wanted more, but I restrained the need to overeat.  

The service was top notch here too.  Our table was visited frequently to make sure we weren't in need of anything.  

People, when you are in Pittsburgh and have a hankering for some Mexican, I implore you to stop in here.  You will not be disappointed."}
{"text":"Probably one of the most authentic mexican restaurants. This place was great. I hear they plan to start selling liquor in two weeks and even have place for a nightclub/dancing"}
{"text":"Always a treat to eat here..never leave disappointed. Food is delicious and came out quick..atmosphere is good and service is great"}
{"text":"Get some Taco Bell and drink wine coolers. This place sucks, Unless you are 23 , drunk with no standards.

This joint is loud and caters to young people who have no palate . We left . Couldn't stand the noise ..it's embarrassing to say the least.

The reviewers are typical yinzers with no taste . Trust me, stay away"}
{"text":"This place is the best. I am here right now - beers (Yuengling included) and tacos are both $0.99. The tacos are legit - full size hard shell beef tacos with lettuce, tomatoes and cheese. Come check it out. Thursdays. I heard Tuesdays too."}
{"text":"lol, i say this in every review, but i will have to do an update! 

we came here to celebrate taco tuesday and $1 tacos. To be honest, we waited a little for our server to come.. like a good 15 minutes. Luckily, bobby tracked someone down and the server mentioned there was a new person that night. Three different employees came over to apologize so that was very sweet of them.

Bobby and i both ordered tacos.. the $1 tacos on tuesday and thursday only come in beef... but you do get to choose a hard or soft taco unlike other reviews/tips stated. We enjoyed the free chips and salsa and bobby ordered a margarita. Loved their salsa. Not too spicy but not mild what so ever.

We filled up on the chips and when the taco arrived i kind of felt full. To be honest, I havent really had an appetite since losing my dog. I'll eat lunch then not eat again till lunch the next day just from the stress and heartache i've been dealing with. I literally ate half of one taco then gave bobby the rest. I do have to note that i asked for no tomatoes twice (just to be sure) during ordering  and still received tomatoes on all of my tacos -_-

Even though we were only there for taco tuesday, i checked out their menu. It seems like they have great options and great prices. I'm excited to head back very soon and check out some other menu items. I've tried both Emilano's and Steel Cactus in South Side and was underwhelmed at both, so I really hope this mexican spot is the winner... especially because i live a 5 minute walk away from here! 

i will update after my next visit and trying other items from their menu! :)"}
{"text":"They have the best tacos! My boyfriend and I go 2 or 3 times a month for Taco Tuesday/Thursday and you can't beat 3 tacos for $3. They don't drench the meat in seasoning or sauce which makes for delicious tacos. Service is extremely quick for us so I'm surprised that other reviewers have had major problems. We're always seated within 30 seconds of walking in the door, get chips and salsa right away and get our tacos no more than five minutes after ordering. They have tasty Mexican rice too, and the rice and tacos always arrive hot and fresh. Love love love El Toro Loco!"}
{"text":"Wow what a great little Mexican joint! Went here for the world cup match. I wasn't planning on eating but the smell got to me! 

The chips and salsa were standard fair. The drinks were huge here! Definitely get your money worth. I ended up going with the Supreme quesadilla which had steak chicken and shrimp for only $13. Not a bad way to go out. It was delicious. Full of flavor. Came with a side of rice, refried beans, and guess what sour cream and guac came free no up charge! 

I will definitely be frequenting this place more often. I highly recommend this place and dare I say it's better than mad mex? Oh blasphemy!"}
{"text":"Came here on a Friday night, and while the place wasn't very full, the environment, the Latin music, and the TVs made the experience much more lively. I was also quite pleased by the extensiveness and friendliness of their menu. They have a ton of different options, including appetizers and salads, tacos and burritos, enchiladas and fajitas, and even large options meant for two. The menu came with a lot of pictures and even helpful descriptions of some of the mainstays for those with less exposure to Mexican food.

The complementary chips and salsa at the beginning were top-notch. We then started with the chimi rolls, which were delicious and already filling for an appetizer. The rolls contained generous servings of corn and beans and also came with a delicious dipping sauce. We also ordered a molcajete fajita, which I believe was meant for one in contrast to some of the other fajitas on the same menu page, but turned out to be absolutely enormous. At $18, this was an extremely affordable option that is definitely enough for two people. It came with all sorts of meat and was exploding with flavor. Also paired nicely with the accompanying beans and arroz.

There are so many different things to try here that I already look forward to coming here again. Give it a try!"}
{"text":"We had a party of 7 and in the beginning, advised we needed separate checks. Our drinks took a good 15 minutes to come out. When our food finally came out, two entrees were missing and the orders were wrong. It was about 10-15 minutes before the other 2 in our party received their entrees. The food was lukewarm and bland. 

We wanted to stick around for drinks, however, our waitress didn't come back and check on us. Some of our party had to go up to the bar for drinks. When we decided to leave our checks were not separated and when they were, it was wrong. It took about 25 minutes for us to actually pay out ( it was not busy).

The waitress was very nice and friendly, but that doesn't compensate for the time wasted and less that mediocre food."}
{"text":"I am so happy that Pittsburgh has been blessed with El Toro Loco.  I almost cried tears of joy as I ate my Pollo Ranchero because it was that good. I LOVE this place! I guess you could say I'm loco for El Toro Loco :D

The staff are super friendly and welcoming.  The chips and salsa appetizer is fresh with a kick of spice!  The good is prepared so quickly too. Honestly I think I blinked and it appeared in front of me.

Final Thought:  This is my new favorite Mexican restaurant"}
{"text":"CLOSED. Went yesterday to use my groupon and there was a for sale sign in the window. There was another sign saying an Italian restaurant is coming soon."}
{"text":"Best Mexican Restaurant in South Side, easily.  Less expensive then Emiliano's,  better quality food, and even larger portions.   Tried the Enchiladas Mexicana and their Chili Relleno.  Both were outstanding.  Free chips and salsa that were pretty good too.  I will be back many times to try the rest of the menu."}
{"text":"I was on the South Side with my wife one evening looking for a place to eat whenever we stumbled upon El Toro Loco.  It doesn't look like much from the outside but once you are inside you are well aware that you are in a Mexican restaurant.  There are sombrero's everywhere on the walls.

For my dinner entree I decided to order the Burritos Aztecas.  While we waited for our food to come out we were given some chips and salsa.  This ended up being my favorite part of the meal as the chips were fresh and the salsa had a little kick to it.  After finishing the chips my meal came out and consisted of some burritos smothered in some sauces.  They ended up being decent and there was enough food that I was stuffed by the time dinner was over. 

The bottom line for me is that I might stop by here again in the future.  The atmosphere and the food were decent and I imagine that if I hit it on a Tuesday or Thursday night like many of the other reviews had then I would be very happy."}
{"text":"I wasn't a fan of the dining area, the space is typical for South Side though, an old building/store front of sorts turned into a restaurants.. very makeshift and dirty looking. We were sat in front of a huge tv on the wall with a very loud spanish tv show, seriously annoying as hell. We could see all of their storage, boxes, junk under the stair case, you can see all the wires everywhere from the lights and tvs...just very unprofessional looking...not a good vibe.

The food wasn't good either. Rice taste like rice a roni, meat in tacos was obviously cheap, chips and salsa were just okay...

I imagine if you are a college student this place wouldn't be that bad, the bar area looks nice, but if you are looking for a good dinner and atmosphere, if you are over the age of 30 you will hate this place. 

service: SLLLOOOOWWWW"}
{"text":"After seeing a huge sign on their building stating $0.99 tacos and drafts on Tuesdays and Thursdays I knew I had to check it out. Three awesome things... cheap prices, Mexican food and beer!

We arrived right before the Pirates game and the place was pretty dead. We decided to sit at the bar and the bartender/server gave us the remote to put the game on. Cool! Obviously we wanted to get right to drinking. I noticed there was probably about ten different drafts available. I decided to get a Blue Moon but figured I'd check first to make sure that BM was included in the deal. It wasn't. Only Bud Light, Coors and YL. Still a decent selection, but if I didn't ask I would have been upset at my bill at the end of the night. The beer itself was okay. It wasn't super cold and they serve it in a glass that's clearly not meant for beer. It's probably big enough to fill just a little more than a regular 12 oz. can of beer. They're $0.99, though. Can't really complain.

The tacos were decent. They are hard shells (no soft shells with the special) with an average amount of meat, lettuce, tomato and cheeses. The meat was better than I expected as I thought it was going to taste like fake Taco Bell filler considering they were $0.99. They also filled up our chip basket twice and the salsa is very yummy!

Service is so so. The server was away from the bar probably half of the night. The drink specials only last till 9, so my boyfriend was waiting for her to come over to get him a new one. Time kept ticking and she was nowhere to be found. At 8:57 she comes over and says the \"special is over.\" No, it's not. We showed her our phones and she agreed to give him two more beers. 

I think the place is worth trying, especially considering how cheap their specials are. However, nothing screamed at me to want to return."}
{"text":"El toro loco is definitely a great place to get some Mexican food! My boyfriend and I ordered a chorizo and cheese dip app.. Which was great! And since it was happy hour.. I got a strawberry marg, which had just the right amount of tequila :) I got a quesadilla supreme and my boyfriend got the chorri steak, which both came out hot and very timely.  Ally was a great server and made sure we had everything we needed! Definitely check out this New Mexican restaurant if you are in the area!"}
{"text":"This is not the place that got busted for drugs.  That was another location.

However you might think they're putting something not entirely legal in the guacamole.  It's that good.

This is typical Americanized mexican fair but I think better food then the competition nearby.

Ultimately while good the food is forgetable so that's why I docked it one star.

I remember our server being new and really amusing.  Nice kid."}
{"text":"Birthday bliss, with fun alcoholic beverages and amazing Mexican fare!  We went on a Sunday afternoon.  The drink special was a ginormous bulldog margarita (margarita with a bottle of corona) for $7!!!  3 of those, and I was a much-too-happy girl.  

As for the food, it was awesome!  Also, Huge portions.  I don't think I ate all of my dinner. But, I had 3 bulldog margaritas, so who really knows...

There was singing.  There was a birthday tequila shot.  I think salsa dancing was happening (again, margaritas).  I'm sure I had a great time!"}
{"text":"We had dinner here tonight & had a really good time! Everyone was friendly and went out of their way to make sure we were comfortable. They even moved us to another table when they saw we were too warm at ours - we didn't even have to ask. Food and prices were good and there was no 25min wait time like across the street. We'll definitely be back!"}
{"text":"We were there last night for dinner.  I was a little concerned because of two recent negative reviews.  But our service was very attentive, and the food was served hot.  I had the Camarones and Rice, and my wife and daughter had combo platters with Enchiladas.  All of our food was good.  And the price was reasonable.  I would go back."}
{"text":"I was pretty excited to try this place, because I like Tex-Mex food a lot. Unfortunately, the only positive thing I can say about the food is that they give you a large portion for your money. The food was quite bland--this is not to say it needed to be spicier, but just more flavorful in general."}
{"text":"The food is Spectacular!  Definitely One of my favorite Mexican restaurants.  The menu is Huge so,  it's pretty easy to find something that trips your trigger."}
{"text":"I think that this place could have real potential. They serve you free all you can eat chips and dip. Our chips were still warm from being cook and the salsa had a great kick to it. I ordered the enchilada Mexican i believe that had 2 cheese, 2 chicken, and 2 beef enchiladas along with sour cream, guacamole, lettuce, rice, and beans. Everything tasted delicious! I had to share of course because it was a ton of food. The service was a little on the slow side. The whole feel of the place was a little bland, but  the food made up for it."}
{"text":"I have to struggle with this rating here.  I stopped in for Taco Tuesday  ($1.00 tacos) and a beer.  The place was empty and I was served up a beer and free chips and salsa immediately. 

The salsa was delicious, some of the best I've ever had. It was thick and had a little bit of a kick to it. 

The place is very clean, service was fast and courtious and the background Spanish/Mexican music was not too loud or too soft.  

So why the three stars? The server asked if I wanted hard or soft shell tacos and I said hard. But when they arrived they were soft shell.  I didn't make a fuss about it... hey, it's a dollar taco!  They still tasted better than Taco Bell.

A couple came in while I was nursing my beer and the girl ordered soft tacos with no tomatoes. I heard her say this twice and her tacos came with tomatoes. There's gotta be a disconnect between the servers and the kitchen and for that reason I rate them a three."}
{"text":"My entire experience at El Toro Loco was un desastre (that's Spanish for disaster). I love to eat out, so I have been to a lot of places in my life, and I can say with 100% certainty that as of the date that I am writing this review, this is hands down THE WORST restaurant I have ever had the displeasure of going to. My group was fairly large (8 people), so we expected to wait for a table on Taco Tuesday. Well, we got to the door and there was a sign that said \"No taco Tuesday special today.\" Okay, whatever, that's fine. We still wanted tacos. And margaritas. When it was our turn to sit, we were seated in an alcove behind a wall upstairs. It was kind of weird, but nice to have the privacy in a way. As soon as we sat down, we were brought chips and salsa, which seemed great (the salsa was clearly not freshly made by the way...), but then trouble began. 

With a large group, it is easy to get distracted talking to each other, so finally, it became clear that we had been there for 15 or 20 minutes and no one had come by to take our drink order. We snagged a passing server, and he looked startled and said he'd take our orders. Everyone ordered the house margarita in various sizes  except for one person who ordered a corona, and we got some queso for an appetizer. Ten minutes pass...twenty minutes pass...we ask the server about our drinks and he assures us they will be right out. Tick tock, tick tock...thirty minutes pass. Okay, this was getting ridiculous. After 43 minutes (yes, I timed it), drinks were brought to the table in tiny plastic dixie cups. None of them had salt or a lime, and none of them were more than 8 oz., certainly not 'jumbo'. I looked around at everyone sipping their margarita mix (no alcohol?!) and wondered why I had no drink. The server said it was coming right out. I was getting agitated, so I went downstairs to talk to a manager and was told that she was too busy to speak with me. The margarita I ordered came out 23 minutes after the rest of the drinks and the server brought me the queso at the same time. It was cold and congealed. So, after being at the restaurant for nearly an hour and a half, we had not even had our order taken. We tried to order food and another round of drinks, but they never came. I headed down to the bar to order beers and was told by a bartender to \"hold on like ten minutes\", but was never served. Two girls by the bar told me they were leaving because they hadn't been served at their table or the bar in almost an hour. It was busy, but not busy enough that I couldn't easily walk up to the bar. The bartenders were literally doing nothing. After 2 or so hours, someone else in my party attempted to get a manager to get us our check so we could leave, but we were never allowed to speak to a manager and they never brought us the check. 

El Toro Loco is the most unprofessional business that I have ever patronized and deserves to be shut down for their blatant disrespect for customers."}
{"text":"To begin, I know better... With that said, I was hoping Yelp would do me right, but it simply left me $15 dollars poorer.

I ordered around the menu but that still did very little to spare me the American Meal. The restaurant should be labeled American w/a slight influence from south of the border.
Their only saving grace was the server in which I got to chat in Spanish with. She un-Americanized the menu for me as best as possible but You can be sure that w/out her, the place would really have to turn my arm to earn 1 star.

Bloody disappointing & yes I know better, for I am in PA & not CA..."}
{"text":"I had a fish and shrimp dish for lunch. The fish was very fresh and tender, shrimp was very well flavored. The service is also good! Highly recommended!"}
{"text":"We were excited to see a new Mexican establishment open in Southside. Not a fan of the current chain restaurant I'm South Side.

Upon walking in, there is not a whole lot of decor, which is disappointing for me. I love Mexican establishments, not just for food but for ambience. (They just opened, so hopefully this will change.)

The waiter brought chips and salsa. The chips were crispy, which I like, and the salsa was tasty. Had just a little kick to it.

We ordered the choribacon cheese fries as an appetizer.  I could eat these all day long. Fries, bacon, chorizo, and cheese....how can you go wrong?

We ordered the enchiladas mexicanas and the molcajete fajita as our entrees.  The enchiladas mexicanas consisted of 6 enchiladas (2 beef, 2 cheese, and 2 chicken), beans, rice, guacamole, and pic de gallo. Every bite was as good as the next. Half of each enchilada had the red sauce and the other half had the green sauce.  It was heaven in my mouth.

The molcajete fajita consisted of steak, chicken, chorizo, and shrimp cooked with pineapple, peppers, and tomatoes. This entree also came with beans, rice, guacamole, and poco de gallo. Again, every bite was delicious. Everything is seasoned to perfection. 

It was lunch when we ate and I'm not sure if the bar is open, but we will be back to try the bar. With the food being so tasty, I can only imagine what a margarita will taste like. 

Aside from the lacking decor that I deducted a star for, this place is a must try!"}
{"text":"Staff is friendly and the service is good. The salsa is better than other places I have been. The food was good."}
{"text":"I thoroughly enjoyed this resultant.  The food was great ask fresh made and very authentic Mexican food.  I wild recommend this to any everyone that wants a great experience with great Mexican food.  The wait staff was very friendly and fun."}
