{"text":"Terraza y sitio muy agradable para tomar unas cervezas en guadarrama. La cerveza es artesana muy rica y también se puede picar o comer una hamburguesa."}
{"text":"Fabrican su propia cerveza artesanal. No siempre tienen disponibles todos los tipos."}
{"text":"Increíble bar que encontramos por casualidad. No se si era lo que íbamos buscando pero desde luego acertamos. Fui con unos amigos un viernes sobre las 22hr y ya estaba lleno, tuvimos suerte de poder conseguir una mesa para degustar las famosas hamburguesas aunque no hay mucho donde elegir, el pan casero a la cerveza y la carne de buey... espectaculares  las cervecitas artesanales en la barra nos supieron a gloria, y los postres muy apetecibles. Luego puedes amenizar la noche con unas copichuelas pero según va pasando la noche se va llenando más y más.  Tuvimos la suerte de coincidir con un grupo que por cierto lo hacía bastante bien, con un repertorio rockero muy acertado.... MUSE, Queen, The Who,  Led Zeppelin...  se hacen llamar Cinta de Lomo, ya me hice seguidor en el fb para no perder les la pista"}
{"text":"Es interesante este sitio por su enclave, sus hamburguesas caseras, incluido el pan que también es casero

Pero sobre todo por las cervezas de fabricación propia.

Abren los fines de semana y puedes comer a parte de nas hamburguesas mencionadas anteriormente, platos del día súper caseros

Tiene una decoración muy chula, los dueños son unos artistas"}
{"text":"Venía con muchas expectativas tras ver las reseñas y ha sido la gran decepción.
Entramos al local y solamente había una meda ocupada. Nos hemos sentado y han tardado casi 20 minutos en traernos la bebida, y digo la bebida por que no nos habían preparado mesa.
Al rato veo ¡que están preparando mesas vacías! ¿Y nosotros que?

Pido una hamburguesa El Taller, ummm pinta por las fotos vistas que es una maravilla, y me traen una hamburguesa de lo más normalito, con un pan de hamburguesa del super de cuatro a un euro. 
¿Donde está el pan casero de cerveza? ¿Y la cebolla caramelizada? A parte de que la carne estaba demasiado hecha y seca.

Se lo comento a la camarera y me dice que ayer tuvieron mucho trabajo y vaya, se les ha acabado, y me dice ¿tendría que habértelo dicho, verdad? Hombre sería un detalle.
Para colmo de males, pido tarta de zanahoria y no tienen, y me dice que hoy no es mi día.

Habrá sido el día malo, pero hay que fastidiarse que me ha tocado a mi."}
{"text":"El otro día celebrábamos el cumpleaños de mi padre y de mi hermana, y entre las opciones que nos propusieron para ir a cenar estaba estas. \"Hamburguesas con cerveza artesanal\", y como yo ya había oído hablar maravillas de El Taller de Cerveza, claramente voté por esta opción. Mi hermana, que tiene debilidad por mí, ignoró el resto de opiniones y al final nos plantamos allí, un jueves de julio no especialmente caluroso. 

El sitio es bastante grande, sobre todo en la terraza. Tiene un espacio inmenso, bastante informal, y luego, en la parte de dentro, dos espacios diferenciados con varias mesas y sillas. Nuestro primer error, presentarnos allí sin reservar (no se imaginaban que iba a estar tan lleno). Era prontito, y la verdad es que el hombre que nos atendió iba un poco a tope, muy agobiado. Yo pensaba que al final no cenábamos, porque lo tenía casi todo ocupado, y al final nos puso una mesa, en la que nos tuvimos que apretar un poco, pero mesa al fin y al cabo. Luego, ojeando, vi que había dos mesas más; una de cuatro y una de dos, sin reservar en la zona de arriba. Yo creo que hubiéramos estado más cómodos, pero bueno. 

Pedimos de entrante unas brabas, un espeto de diez sardinas y una tortilla de patata. Las bravas buenas, son de las picantitas, pero tampoco nada que no se pueda comer. La tortilla rica, pero un poco sosa y el espeto lo mejor de la noche. Las sardinas eran hermosas y estaban riquísimas. Fan. 

Luego pedimos varias hamburguesas. No tienen mucha variedad de burger, pero en general si son buenas, ¿para qué te hace falta mas? Las hamburguesas son de buey, y tienen buen tamaño. Sin embargo, cuando ya llevaba un par de dentadas, empecé a notar que la carne tenía bastante cartílago, y que en realidad... ¡estaba fría! A mí me gusta la carne poco hecha, pero para que realmente sea rica, hay que atemperarla primero, porque si no la experiencia es bastante mala. Así que no, no me gustó. No al menos al nivel que yo esperaba. 

Para finiquitar el tema, tardaron un millón de años en traernos la cuenta (y la pedimos varias veces) y luego no venían a cobrarnos, hasta el punto que tuvimos que acercarnos y dejarle el dinero al tipo, porque nos queríamos ir y no queríamos dejar ahí los euros al descubierto. Yo no sé si es que no se esperaban tanta afluencia un jueves, o es que les falló alguien, pero desde luego de personal iban cortitos ese día.

La cerveza muy rica, eso sí. Yo tomé Tizona todo el rato porque me gusta la cerveza negra, y la verdad es que me encantó. Eso sí, el resto de la experiencia no estuvo a la altura."}
{"text":"Precioso sitio situado en Los Molinos, en plena sierra del Guadarrama, una casa antigua restaurada, y con muchísimo encanto. También tienen terraza.

Fabrican sus propias cervezas, muy buenas, sobre todo la tostada. Nada que envidiar a la Murphy's.

Sirven tostas, hamburguesas, quiches... todo con una pinta excelente. Volveré a probar algo de comer, y a poco bueno que esté creo que ganará la quinta estrella, porque el sitio tiene muchísimo encanto. El personal muy agradable y atento."}
{"text":"Uno de los sitios de por la zona que más éxito le auguro para este verano! Sitio con mucho encanto, parece un antiguo taller, con vigas de madera, paredes de piedra... Un patio genial con mesas y sombrillas para las noches estivales... Y un gran surtido de cervezas! Hay donde elegir, y para acompañar, recomiendo cualquiera de las salchichas a lo alemán, con chucrut y puré de patatas, acompañado por salsas diferentes... Las hamburguesas ya me gustaron menos, demasiado nervio... Cuidado con esas cosas, que estamos en la sierra de Guadarrama! Los camareros muy amables y muy buen rollo. Por cierto, me encanta la música que ponen! Tienen listas suyas en spotify. Lo dicho, me verán más por allí este verano!"}
