{"text":"Interior decor was tacky and the tea was flavorless, but service from the owner lady was nice. She offered to distribute out the complimentary soup.  My party of 7 ordered the 6 dish dinner set for $55.50 along with a few bowls of rice priced at $1.50/bowl. The food was edible and we finished everything with full stomachs but it was only mediocre at best. My only complain would be that the dishes were either overly oily or salty. Especially the vegetable dishes.  Dessert was complimentary, that being red bean soup, and again it was quite standard.  Nothing exceptionally delicious, but it was an affordable and filling dinner. My parents like to come here every once in a while."}
{"text":"I'm a regular at this place as I come in here almost every weekend on Sunday nights.   The ?? (Chinese noodles) are the fresh ones and not the bad prepackaged ones that many restaurants use. Most of the time when I come here, I would get the combo dishes (2, 3 or 4 dishes) where you order rice for $1 each bowl on the side. This is because it comes with a large bowl of complimentary soup and absolutely delicious dessert at the end. Often, the dessert isn't the green or red bean dessert that many Chinese locations offer, but freshly grind cashew or almond paste dessert, or pumpkin/taro with tapioca balls.  The food is delicious and well cooked by a burning hot stove and an extremely swift chef for it to taste so rich and full of ??. One of my favourites is their sweet and sour pork. I love their lobster with e fu noodles as well.  The owner lady is extremely nice and often runs the business herself. Sometimes, she hires a  waiter to help her out while she does other things."}
{"text":"At first glance, I thought the pricing of Elite Congee & Noodle seemed higher than a HK cafe of this level.  I changed my mind when I tasted the food: the food tasted pretty good.  By that I mean stirred fried rice and noodles, meat on white rice, etc..  The Salted Fish and Chicken Stirred Fried Rice smelled really fragrant (or really bad depending on if you enjoy salt fish, ha ha).  The Stirred Fried Flat Rice Noodle With Beef was salty and had lot of beef slices.    I don't like that, as a \"congee and noodle\" place, there are *NO* regular congee or soup noodle menus in any of the Dine In menus (there are 3 or 4) placed on tables during lunch time.  At the end of the meal, I located a Take Out paper menu adjacent the front door.  Guess what, the congee and soup noodles menus are in the Take Out menu.  I have uploaded pictures of the noodle and congee menus here, so that other Yelpers can order soup noodles and congee. :-)"}
{"text":"Came here for some cheap eats.   Curry beef dish - curry sauce had way too much ginger and tasted terrible. The meat was tough and difficult to chew.   Malaysian style fried noodle - way too much salt but tasted okay.  Seafood congee - a fair amount of seafood but did not taste fresh at all. The salmon that was in the congee felt dry.....yeah it felt dry and it was sitting in liquidy congee so thats how bad the seafood was. The congee also tasted sweet which was weird. Its like they dropped a bag of sugar in it.  The only thing that tasted good was the deep fried French toast.   2.5 stars"}
{"text":"I was thinking 3-3.5 stars after my visit but I turned it to a 4 on my way out because the waitress made my day.  I'll explain further after the jump.  Pros: Lots of choice in terms of specials Good prices and portions Excellent service  Cons: No brisket at 1pm?  I came with my GF and baby over the weekend because we were going to do some shopping over and T and T next door after.  Walking in, the place looks pretty nice.  Kinda new-ish feel to it.  They have a lot of choice for their afternoon tea, and lunch specials.  Most HK style cafes usually have about 15-20 items for their specials.  I swear this place had at least 100 or so.  I came in with something in mind to order but after seeing the amount of choice I had, I rethought a couple of times on what to order.  So here's the thing, beef brisket is a common item at HK style cafes, I would say 20% of the menu has some sort of brisket in it.  So on a Saturday afternoon to run out of brisket makes me scratch my head.  I could understand a more obscure item running out.  Oh well, first world problems.  I did feel like brisket too..  lol.  I ended up getting the salt and pepper pork chop on rice and my GF got the a baked rice.  We both got HK style mike teas.  Both dishes were very good and portions were big.  I got a lot more pork than I thought I would get.  The pork chops were some of the best I've had in a while.  My GF liked her dish as well.  The waitress was working alone but she was great.  She had an arm cast of some sort so she was a trooper.  It didn't slow her down at all. She was very friendly throughout our time there.    Here's the thing, I'm all about customer experience.  If you make it a memorable visit, that scores a lot of points with me.  On my way out, the waitress said to me \"So, you're a father now!\"  I had my baby with me and I didn't get why she said that.  Then she said \"Do you remember me?\"  Right then and there, I remembered who she was.  She used to work in another HK style cafe I frequented a couple of years back..  I went there once a week then.  I hadn't gone there in more than 5 years since I moved away.  I was amazed she still remembered me.  We chatted a little bit more after.  It was a nice experience and it made my day.  All in all, a nice little place I will be going back to next time I'm shopping for groceries there.  Our bill came out to about $15 WITH taxes and tip incluided.  Lunch for 2 with drinks for $15?  I'm sold."}
{"text":"Overall the food is tasty and a good bang for your buck.   The decor of the restaurant is tacky. The walls are lined with acrylic tiles that look like they're going to fall on you and leave some serious stab injuries... Thankfully that hasn't happened to me yet.   There is a ton of things to choose from in their menu and they offer a good selection of dishes in their specials. We ordered a 6-item meal that comfortably fed the 7 of us. From our dishes I would recommend the deep fried fish slices with corn sauce and their sweet and sour pork.   If you're looking for a casual dinner and not looking to impress guests, this place is a solid option."}
{"text":"3.5 Star  I have been coming to Elite Congee & Noodle numerous time for late lunch/afternoon tea special so I am now ready to write my review...  I had various soup noodle and stir fried noodle which were all really good. Their afternoon tea special from $2.60 includes a choice of drink (tea/coffee or red bean ice) definitely great value!!  Service here is quick and friendly.   Dinner menu has quite selection of Cantonese stir fried dishes and other selection, so it is not just \"Congee & Noodle\".  Menu here are mainly in Chinese so might be a problem if you don't read Chinese, maybe just get one of your friends to go with you!"}
