{"text":"I went to The Encore today for the first time. The burger was great. The onion rings were very good. The service was a little slow but they had just opened and maybe had to wait for the grill to heat up. Overall, I definitely recommend The Encore."}
{"text":"I've tried to like this place but it comes up short for me every time. People at my job rave about the chicken Philly. It was good but not good enough for me to want another one.  They ran out of fries and chips during lunch and I had to get their tater tots which was just ok.  I've also tried the Cobb salad. I don't know what it was but I felt like I had eaten a stick of chalk. I drank a lot of water during that meal. They should have rinsed the lettuce or something. I don't quite know but I won't get that again. The turkey was stringy and they only offer 2 or 3 salad dressings.  I actually enjoyed a  McDonald's salad I had earlier this week much better and it didn't cost as much. This place is pricy but I've never had anything that was worth the price."}
{"text":"This place has really high ratings, so we gave it a try when we were in town. Food was good, but it was an odd place. Ordered a water and I was brought a water bottle...is that a Cleveland thing or something? That was bizarre. And it was $2 extra. Beer was pricey."}
{"text":"Terrible service 
Soup & salad took 35 minutes 
Steer clear
I would look elsewhere I had to run somewhere else to get food instead.
Friends said their food was also lackluster"}
{"text":"Staff cannot deal with a small concert rush. They should have been more prepared for this expected crowd. Horrible wait time for mediocre food."}
{"text":"When I got here they were missing a waitress and the cook was taking orders. Took about 20min before I could order but it happens. The sandwich was good but a little on the lean side for what it cost in my opinion. The tater tots were REALLY good! The service was great once the waitress got there though! It's worth checking out."}
{"text":"Not impressed with the $10 salad, but it's right next door to my agency. I like the atmosphere. The co-worker really liked her burger, but not a fan of the expensive salad. I've tried twice."}
{"text":"Stopped in here for lunch. Great food and they have some classic video games. Also looking forward to checking this place out during a show at Agora."}
{"text":"Fuck this place! Don't go! Horrible service. Ordered a side salad and never got it. But 4 of my friends all got there burgers."}
{"text":"This place is great. The drinks are priced fairly, people are so nice, and the food is amazing. I've tried almost everything on the menu and have not been disappointed. My favorites are the Turkey Rachel and Western BBQ Burger, both I would highly recommend trying. 

It's a great place to go after a show at the Agora next door, or even make a special trip from downtown for lunch. It has a sports bar feel to it as well, and can be a great place to check out games with friends."}
{"text":"I eat here often for lunch.  Love the burgers (especially the patty melt), buffalo chicken wrap, bbq chicken flatbread, and the pear goat cheese salad.  They've bent over backwards to accommodate catering needs for our office, even offering delivery.  Ownership and staff are very friendly and restaurant, attached to the Agora theater, has a fun vibe."}
{"text":"Overall: Good place to get a drink before or after a concert at the Agora.  

Service: 4 stars.  Went there for an alternative concert and many attendees were under 21, so the bar before the concert wasn't very busy.  The bartenders were nice and got our drinks quickly.

Price: 3 stars.  They didn't have any specials, and it was normal bar prices.

Location/Atmosphere: 4 stars.  It's nice to have a full bar next to the Agora.  I assume they are closed or not very busy when there isn't a concert.

Food: N/A, didn't get any"}
{"text":"The Encore is a very traditional little rock-themed bar attached to the legendary Agora. The décor is comprised of stereotypical rock memorabilia that looks as if it was all ordered from a catalogue. The food is the sort of classic bar fare that you can imagine the taste of just by reading the menu, and many ingredients are recycled from sandwich to sandwich. The black bean burger, while a touch on the gummy side, is probably the best dish, though the Greek salad is a noteworthy contender. The bartenders are friendly and efficient. Overall, the place lacks a certain soul that keeps it from attaining five stars in this reviewer's humble opinion. There just seems to be something gritty missing beneath the veneer. For a place touted as 'rock bar,' Encore is more of a place to bring your dad than it is a place to smash a guitar or shotgun beers in a frenzy."}
