{"text":"1. Inexpensive flavourful swarma, wraps and salad 2. friendly staff 3. Very clean and beautiful small restaurant with great lighting."}
{"text":"Everything about this restaurant is awesome! The food tastes amazing and comes in big servings! It's worth your money to come here. I suggest trying out the meal plates which comes with your choice of meat, salad, potatoes, and rice. Their potatoes are incredibly good! Especially the tzatziki sauce that makes everything come together. My hunger is always satisfied by their food and I would always come back for more. The staff is also very friendly and welcoming. The place is always kept neat and tidy. It's very modern and the fish tank is a great addition to the ambiance! Overall, my experiences here are always happy and I never leave with regrets. I would love to try and explore all of their wonderful food in the menu! After all, the name says it all; the food is truly epic!"}
{"text":"Great prices, delicious meals, generous portions, excellent customer service. Try it out, you won't regret it!"}
{"text":"I will come back to this location... it's clean, food is good and healthy!  all the staff are friendly they provide good service.  I will recommend this place to my friends and relatives.  Very happy with my experience!!!"}
{"text":"Excellent service , clean dining room. Great prices and big servings. I make this place a weekly stop."}
{"text":"Absolutely love their shawarmas. I get them delivered and they come nice and crisp. Usually the sauce makes a mess, but not epic pita. They know exactly what they're doing ! Impressed."}
{"text":"Ordered falafel...it was cold! The guy threw old falafel in a fryer which wasn't hot in the first place didn't hear a single sizzle and then he threw the old oil soaked falafel on the pita....nasty! Will not return ever!"}
{"text":"Dropped in for a late lunch while in Brampton. Ordered the gyro sandwich. Was delicious and filling. You are given an option to choose your sandwich fillings and a choice of hummus or tzatziki. All of it tasted fresh and flavorful.  Place is reasonably priced. And the owners are wonderfully friendly and served us with a smile. Recommend this place anytime your in for a quick bote"}
{"text":"Be mindful that the baklava that is said to be traditional (which is made with pistachios usually if not 100% of the time) is made with peanuts (which is not written in the description). I order from them last night through skip the dishes and bit into a piece of baklava after my meal and began to have an allergic reaction. Thankfully I didn't go into full anaphylactic shock but I became violently ill and had to take benadryl to stop the reaction from getting worse. Had I ate the whole thing I would have had to go to the hospital."}
{"text":"Amazing and friendly staff. Food is fresh and is served quickly. Epic chicken shawerma wrap is juicy and flavorful! Staff is super cordial amd welcoming"}
{"text":"I was pretty excited to try this place as there's not a lot of shawarma places in the area and this is one of the highest rated. However, I was left disappointed. I came for lunch and got the chicken shawarma pita combo, which comes with a side and a pop for $10.50 (after tax). The pita itself was pretty good. Sauce was tasty but made it messy to eat. The main thing that disappointed me was that the fries were cold! They were not kept warm or reheated.. definitely an old batch. Not sure if I just came at a bad time but it really ruined the meal for me. Don't think I'd be back anytime soon... I'm really not of fan of cold fries."}
{"text":"First time trying lunch here today, very disappointing. I ordered the beef shawarma plate at $15. The beef was not made fresh and there was not very much at all. The rice was microwaved in the styrofoam take out container and therefore tasted like styrofoam.. this is also terrible for you and should never be done at home or by a restaurant. It's not terrible tasting but really not on par for where they need to be at that price. Shawarma Stop at hwy 7 and Woodbine is the best place in Markham/Richmond hill to get great quality and generous sizes of authentic Shawarma."}
{"text":"I'm giving this place 3 stars. Most of tr food prepared (epic chicken shawarma and some other items) were okay, but I had the open tray without the wrap and bit into several pistachio shells and almost choked on a few of them.  The food didn't have very much flavor and the recommendations made by the person behind the counter were based on what was available that day. Probably not going to come back."}
{"text":"The Schwarma dinner is okay; decent, but nothing overly special.  I would have liked to see a larger take out (the one with three separate sections) container and a wider assortment of toppings to choose from as you'd see in many of the popular downtown Schwarma restaurants. If has the potential to be awesome."}
{"text":"I was there with my wife today and we are picky eaters. We found them to be so accommodating with substituting. It was so easy. The lady serving us was also very friendly and the food was great. We will definitely be back!"}
{"text":"There aren't many Shawarma places in Markham. Bless the owner for opening one up! The food here is tasty, healthy and authentic!"}
{"text":"Dropped by to have some lunch and we both orders the chicken souvlaki. The service was friendly and quick. I enjoyed being able to customize my order and choose the topics I wanted for my salad and meal. Not being able to have dairy, I appreciated them knowing the ingredient to their sauces and toppings. The chicken was juicy and their portions were large. The dining area was very clean and the restaurant was quiet when we had lunch."}
{"text":"This review is solely based on the catering Epic Pita provided for one of my office events earlier this month.  I saw their delivery van driving around Rexdale Blvd / Hwy 27 so I made a note to check them out on Yelp and, if the reviews were good, inquire about catering. I spoke to Amin, who I think is the owner/manager. I good a good vibe right away as he thoroughly answered all my questions and was also very accommodating. I ended up ordering a large platter of wraps such as  beef shawarmas, chicken shawarmas, shish tawook, falafel and kafta. I also ordered a big tabbouleh salad and soft drinks.  On the day of the event, the two (really sweet) delivery girls arrived right on time with all the food and a beautiful, super fresh, complimentary garden salad. Everyone LOVED the food as it was fresh, flavourful and prepared with pride. The wraps weren't typically dressed with hummus, tahini, hot sauce, etc. as we had to accommodate for everyone's palette; however, they were all provided on the side.  We definitely plan to use Epic Pita again and I would highly recommend them to cater your next meeting/party."}
{"text":"Been there twice...very nice and clean...great ambience and tasty food for a good price...will surely go back for more"}
{"text":"Amazing fresh food, decent portions, and friendly customer service.  What more can you ask more?  I got the 'Stunning Mixed Shawarma' plate, and you can tell the food is freshly made, and the flavour is delicious!  The rice was flavorful too, and the potatoes were prepared in a way I haven't seen before, but they were soft and delicious too! I'll definitely be back."}
{"text":"Delivery order arrived late and without any sauces which typically come with meal. Owner did not want to resend order and instead told me to remind her next time and I would get a free plate. This was not acceptable to me, as my meal was then dry, flavourless and no good. Next time I called and reminded them I was owed a free plate for the mistake on the last order and they say they are 'unable to deliver' that day...same thing next two times I tried ordering. I finally got the message that they are not planning to honour their promise. Food is very bland without the sauces and just generally plain in general, nothing special and would not recommend due to poor customer service and dishonest people running the place."}
{"text":"Amazing food clean atmosphere. Everything is delicious kafta and shish taouk r the best. The serving lady is sweeet and owner is also very nice."}
{"text":"This place is a random gem! Initially I yelped food places close my place and this one popped up with some good reviews. Thought to check it out and I'm glad I did! The food here is so good! Especially the shish tawook dinner plate or the wrap. The flavors are great, spices are perfect. I've had the chicken souvlaki, shish tawook, beef kafta wraps/dinners. All are great but my fav is the shish tawook! I'm here at least once a week :) and the customer service is great! Which is always a plus. Call in your order and it will be ready for when you get there."}
{"text":"Amazing food. Staff is super nice. Highly recommended food joint. Will come back in future for sure."}
{"text":"I ordered the chicken shawarma salad with extra garlic sauce and all the veggies. the meal came up to a little over $10 which is the average compared to other shawarma joints. The meat was very well seasoned and the veggies were fresh but the only disappointing factor was the hot sauce because they used franks red hot as opposed to home made chili pastes used at other joints.. the vinegar taste didn't go along with the salad. Overall the food was solid and the service was pleasant... will definitely come back during lunch to check out the other options!"}
{"text":"Just like their name everything is EPIC, very clean place, fresh food and superb customer service. Oh yeah and the best part is the awesome fish tank to look at while you eat. A must try!"}
{"text":"Olives on a shawarma sandwich. Thought I was in the subways next door. The gyro is premade frozen stuff as well as the falafel. Once is enough for me."}
{"text":"Just wanted to write a quick review about Epic Pita.    I had the beef shawarma and I must say that the beef was the best quality beef I've had at any shawarma joint.  That really made a big difference. The shawarma was old school - meaning it didn't have all that \"white sauce\" stuff found at other places. I found the toppings healthy and fresh.  I gave it 4 stars as I found the prices at little on the high side but maybe that's why I got such good quality meat.   Enjoy."}
{"text":"I don't know what they do to their shawarma but it's delicious. They have this sauce that is on their shawarma and it kicks this plate up a notch.  I've tried a number of different shawarmas but this one is a little bit different.. Garlic sauce wasn't as strong as others but I didn't care, everything else was tasty.    The mixed platter is good proportioned with a variety of toppings. The chicken is extremely moist and beef was quite flavorful. I'm happy that this is close to my office. Definitely recommend this place to try out."}
{"text":"I have eatten here a hand full of times, and each time the food is just alright. the service is good and the staff is friendly."}
{"text":"Came here a few times for lunch near my work, Epic Pita is in a small plaza with Turtle Jack's, Subway, and other small places. From the outside, I was pretty hesitant coming in but I wanted something different that day. Inside, there is lots of seating and TV's so you can watch while you wait for your food to be made.  The first time I came, I ordered the mixed shawarma plate. From first glances, it doesn't look exactly... beautiful nor does it look like it's a lot, but I was pleasantly surprised when everything was really tasty and I didn't even finish it! You get a salad, potatoes, rice, and the meat that you chose. I found this combo very satisfying and the mix of everything together was great. The salad allows me to pretend that I was healthy. The second time I came around, I wasn't going to order as my friend wanted it, but I saw someone order the Fab Fries and I started salivating so I ordered it. To be honest though, I think I would choose the shawarma plates instead in the future as for about $1-2 more you get a more balanced meal rather than an upgraded poutine.  Service has always been great. The owner has been there the times that I've been. One thing I'd like to note is that if you're looking for a really quick grab and go, I would visit somewhere else as since everything is made FRESH to order, you'll have to wait for some delicious bites!  4/5. Good shawarma place and I will keep revisiting."}
