{"text":"ERD's Eatery and Catering is the right choice for quality tasty food.  First the food is DELICIOUS!  This is a family owned and operated business.  We were warmly received upon entering and could sense a really good vibe immediately.  We decided to eat in and we were so glad that we did.  Food prep was timely and presentation was very nice.  Portions were generous and the prices are very reasonable. GO TO ERD's Eatery and Catering!"}
{"text":"AYKM! Wow! You want home cooked food, great variety, super service, cozy casual atmosphere, and to be treated like family? Then this place is for you.   Everything is home cooked, whole staff and owner engage with customers. I will be back again and again."}
{"text":"I was excited to try this restaurant based on the great reviews, however, the two times that I have tried to go over the course of two weeks, the restaurant has been closed. Each time there was a typed  note on the door saying that the place was closed for the day. I won't be be back."}
{"text":"Had excellent service here at ERD.  I ordered the fried chicken (there were out of dark meat and had to serve wingettes instead), macaroni and cheese, green beans and a blueberry lemonade.  The chicken was seasoned well enough, although it could've had a crispier skin. Mac and cheese was good but a bit over salted. Green beans were good, kinda hard to mess those up. I really enjoyed the blueberry lemonade, but for $3.00, I expected a bigger cup.   All in all, a solid 3.  I would return to try other dishes."}
{"text":"I have been to the restaurant twice   Both times, they have been out of mostly everything. This past Saturday, I got there around 5:30 and all they had left was baked chicken and a few sides. Some of the staff were sitting around in the front talking but were pleasant enough. I thought maybe they closed at 6 but the sign said they closed at 8. We weren't really in the mood for what seemed like would be left over food. The staff suggested that we come the next day but we had driven up from Columbia to try the food so that was not an option. I would suggest getting there early if you want a good selection. I never got to experience the food."}
{"text":"Good food a great people.... I truly love this place. My food is always fresh, hot, and seasoned well. Definitely a must try for Soul food!!!  I'm a huge fan of the fish, shrimp, mac n cheese, fried okra, and the Ox Tails (yessuh)!"}
{"text":"Food was great! I got the large combo plate which came with 2 meats and 2 sides. Portion sizes were pretty good. I could barely finish everything in one sitting. I'm very picky about my fried okra but it was done exceptionally well.   Above all else, I loved the atmosphere. I felt like I had walked into my aunt's house and sat down for Sunday dinner. Definitely will be coming back the next time I'm in the Charlotte area."}
{"text":"Great customer service. Love that it is family owned and operated. My food was delicious. Be sure to get your orders in early because they do sell out."}
{"text":"So yeah I'm a man of my word I went back for round 2 and got the whiting/shrimp combo with dressing as the side and I think I'm in love with this place I made this review to inform the readers that the people here are very down to earth and easy going. ERD's has a family type vibe when you walk in I have no complaints everybody I've met here has been so nice great food great people you can't go wrong I accidentally deleted my first review but it was pretty much the same as this one"}
{"text":"I have been excited for this place to open since the beginning of the year and today was my first opportunity to try their food.   They have done a wonderful job converting the small space into a clean warm and welcoming environment. I especially love the way that the story of the restaurant's namesake and the family is told on the menu and wall decorations.  I was also impressed that the owner (Cynthia Davenport) came out from the kitchen to greet me personally and help me select my take-out order from the menu. She mentioned that they were promoting their new restaurant by leaving Flyers around the neighborhood and graciously allowed me to use the same coupon that she was passing out even though I had not received the flyer yet (free tea with purchase.)  Even though the mac and cheese was mediocre, the Fried Chicken was much better than I expected and the banana pudding won my heart forever. I am looking forward to trying their other meats and sides and desserts . . ."}
{"text":"So delicious!!! In town to visit my son in college. Lookin for good home cooking and this place was a home run for us!!! All food was hot and freshly made and  delicious, owner and family warm and kind. Looking forward to coming back!! Hoping to have some banana pudding next time"}
{"text":"I was craving some homemade food and thanks to Yelp I found this restaurant. The service was amazing and fast. I got the small combo with chicken, shrimp, Mac &  cheese. It was so good! I can't wait to come back and taste their peach cobbler. Give this restaurant a try, you will not be disappointed."}
{"text":"The first visit they were out of fried chicken. Had to settle for the fish, which was fantastic. The second time I called in and they were out of fried chicken. A soul food place out of fried chicken two times in a row? C'mon..."}
{"text":"Well deserved 5 stars. This local family business is a must try if you love home cooking. Long history in the family of cooking soul food. We tried the shrimp platters and you can tell the food was fresh and hot. Dirty rice and shrimp really made this place a 5 star. Many of the items were sold out that day but that is a good sign for a small business. I would rather you sell out of something that carry over and try to reconstituted the next day. This is not fast food but the wait while they cook to order it is pleasant. Ambiance is like a comfortable kitchen table with pleasant Cookout music in the background. Prices are reasonable as you have family history and experience cooking the food. If you blink you miss the location but the food is larger in quality than any chain.    Stop by and try the fish or chicken and dirty rice you will be sure to leave with a smile.   Bonus - They cater and I would suggest if on your lunch break call ahead they will take good care of you."}
{"text":"This update to 5 stars is long over due!  ERD's is my go to spot for soul food.  I don't have to drive all over town searching as they are close to my neighborhood, and they're always on point.  I tend to visit mostly on Sunday's because I love the baked chicken and dressing special.  During the week, I usually get a veggie plate (lima beans, green beans, black eyed peas, and collards).  For dessert, it begins and ends with the banana pudding.....love it!  The owners are always super friendly and treat everyone like family."}
{"text":"Soul food, by definition, is making something great out of something down market.  And it's not easy to do, especially consistently.  Like the crack of the bat that signals a home run, ERD's hits it out of the park with their execution of \"low\" ingredients.  Pow.  My lunch order was pretty straightforward:  fried fish, collard greens, and corn bread with a can of soda.  Price came in around $12 which seems a little high, and I waited about 15 minutes for my order to arrive at my table.  While those accustomed to quick and cheap might decide otherwise, I'm willing to pay up while waiting for what's happening in the kitchen.  Goodness simmered with pride.  I struggle to communicate just how well the flavors played off each other.  Balanced, constrained, and tight is the best I come up with. The fish was piping hot, perfectly seasoned, and flaky.  I dabbed some Louisiana Hot Sauce on it just for variety, but it didn't need any help.  The collards were deep in flavor, not overly salted, and \"to the tooth\" tender.  It's like they had a story to tell if you had time to listen. Wow.  If you're in the mood for some of the area's best soul food, cooked to order, then ERD's is way, way up on my \"Give 'em a whirl\" meter.  For my 300th review I heartily say, \"Go here.\""}
{"text":"GreatFood! The owner and staff are friendly!  Food was hot and fresh.  I had the chitterlings and if you know like I know, you don't eat everybody chitterlings, however these were awesome! Well seasoned and cut up!  Flavorful!  I had the collard greens and candied yams which were good also.  I had the lemon cake, OMG!  It was moist, soft and melted in my mouth.  I was blown away by the taste, quality and service!  I could taste the love in this soul food!"}
{"text":"I've been in Charlotte for 3 years and I've tried all of the so called soul food restaurants here. Let me tell you, this is the Best!!! They make their food with love. It blesses my soul every time I eat there lol. Continue to make great food guys!!!"}
{"text":"Great food. I was driving by and saw sign for soul food. Glad I stopped. They make all dishes on the premise fresh. I had the meatloaf and it's was awesome. Talk with Robert, his mom is the cook and he handles the front counter. It's a family business and you can tell by the quality."}
{"text":"I'll echo Vic's review: All the YES! This is what Yelp is all about. I don't know why else I'd find myself in this particular strip mall except for the fact that one of my fellow Yelp-a-holics just happened to post a raving review. Three days later, here I am ready for lunch.  You walk in and are immediately immersed in the true family feel. The wall on the left has a large \"Family Tree\" collection of pictures. There are only about six tables and the few people in the restaurant were taking their food to go. I got a sick S.O. at home and thinking that Soul Food would make her feel a bit better, I was taking mine on the road as well. Robert (who I later learned was the chef's son) took my order and was very warm and welcoming.  While waiting on my order Robert asked how I heard about them and I told him that my pal Vic raved about the place. Smiles and hollers in the kitchen all around began as apparently Vic made a great impression on the whole staff. It's wonderful to see that they genuinely care about their customers and appreciate them even from the first visit. After about 10 minutes, I got my food in hand and goin' home.  I got the Chicken & Catfish, along with Mac & Cheese and Green Beans. Chicken was moist, breaded perfectly, and simply seasoned. Dark meat done right, the fry was outstanding. I don't have a ton of experience with catfish but the breading was light and the fish moist, flaky, and had a simple yet satisfyingly meaty flavor. I was expecting a lot of grease from my past encounters with Soul Food but everything was respectably balanced as far as the fat goes.  Mac & Cheese, man oh man. First of all, the portions are HUGE. The seasoning was on point, from the cheese 'sauce' to the pasta itself. The green beans had a depth of flavor that is easily overlooked. Cooked with bits of (I'm assuming) pork that translate to subtle smokiness, I'm in heaven.  One more thing to note: The CORNBREAD. Offered often, noted seldom. It's so easy to grab a piece of the crumbly stuff and forget all about it. This was some of the best cornbread I've ever had. Granny, I love you, but your cornbread got nothing on ERD! Great coarse texture, sweet, moist, insert bliss here.  At this point I'm not sure which I liked better, the meat or the sides! Like I said, who'da thought some of the best chicken around would be here? You could blink and miss it!  Krissy and I split a peach cobbler and it was great as well. A lot of places go wayyy too sweet with cobblers but ERD took a different route and upped the spices. Either cloves or allspice, very unique warm & spicy profile that complimented the breading of the cobbler nicely.  My food-loving dudes, show this place some love. Love, love, LOVE, is the only description that does this place justice. A lot of LOVE going into this food and a loving family running the place. Next time I'll dine in just to be around these folks. Hopefully they got a wheelbarrow to cart me back to the car!"}
{"text":"So delicious and a friendly atmosphere! Gotta go early to get a variety. Recommend highly"}
{"text":"I decided to visit after reading reviews here. The food is great! No pork in the veggies. The baked chicken was well done. It just melted in my mouth. I'll definitely go again."}
{"text":"The food delicious, it is always fresh, hot and seasoned just like I remember growing up.  This is what a family owned restaurant is all about. Eating at ERD is like having dinner at a good friend's house."}
{"text":"Maaaan them chicken breast be on fire cuz. Finga Lickin wish they could do it like this !"}
{"text":"The staff is simply lovely and the food is pretty good. They sell out of things fast which was a bit disappointing but I'd say that's a sign of good food."}
{"text":"I have to first say that it has been over a week since my experience here. I waited to write this review because I didn't want my emotions to control the direction of this. A yelper friend of mine gave this place a great review so I felt confident that I would not be let down. I REALLY was hoping to have a wonderful experience and although it was not what I was expecting I MIGHT give them another chance. I went on a Sunday which I will NEVER do again. But let me start with a positive- Staff: VERY friendly and attentive. That is a plus for me and the only reason I will consider giving them another chance. The negative is I waited OVER an HOUR to get my to go order. When it was finally ready, I was advised that they threw an extra chicken wing in for my wait...seriously?  Well the problem with that is that the wings were pre cooked so they were not very good anyway. I also ordered fried shrimp, macaroni and cheese and candied yams. The shrimp were mediocre, also did not seem freshly fried either. They were a bit salty and fishy flavored for my taste. So I'm wondering what took an hour? Fresh chicken wings take 20 minutes max. Fresh shrimp even less time than that.  The yams were ok. The macaroni and cheese was GREAT. Perhaps I should have just gotten macaroni and cheese. Nevertheless like I said I MIGHT try them again.  Tip for the owners: if you want to throw something in, make it something that is worthwhile like a dessert or a voucher to come back for a free side or something. It would have made waiting an hour less painful."}
{"text":"My husband heard about this place from a friend so we decided to check it out on a Friday night. My husband and daughter had fried fish, and I had baked chicken. Collectively, we had sides of collard greens, rice and gravy, and cornbread. It was a to-go order. We all enjoyed our food. I was a little disappointed that we couldn't order what we really wanted because they were out of a lot of items since it was about an hour before closing when we got there.  But it's understandable since things are pretty much made to order.  Nevertheless, our food was tasty and we will definitely be going back."}
{"text":"I travel quite a bit and don't often get to feel like I'm eating at home. I was treated with wonderful fried chicken and macaroni and cheese. The cobbler was wonderful and the friendly staff made lunch a real treat"}
{"text":"This food was pretty darn good! I ordered the fried whiting, and um um chile it was good.  I had the collard greens with potato salad.  I love that they don't make their sides with meat!  The collards had a good flavor on them, but were a little salty.  However, I still smashed them with some vinegar!  The potato salad was a little more soupy than I prefer, and was sweeter than normal, but still very good.  I guess I would suggest making it a little chunkier because the potato salad was more like mashed potato salad.   The whiting was delicious, not too greasy, super fresh,  not too much breading, and well seasoned.  It tasted fresh too and had a decent amount of meat on the pieces.    I had the sweet tea to drink, and that was super sweet. I'm guessing the chef loves sugar lol.  I was a little disappointed that there wasn't a free refill.  At least one, but each refill is 50 cents I believe.  It was a little pricey for the whole meal + drink + tip, but I would come back here, and maybe not order as much and just get water. The service was great though, the people were nice and relaxed, I got a good vibe from this place.  It is quite quaint so I see it being more of a takeout place than dining in."}
{"text":"I found this spot and new nothing about it and it was EVERYTHING!!! When I tell you they put their foot in this food I mean it... lol... this is a hidden jewel of Charlotte and people need to visit it and taste this good SOUL FOOD!!! I love the fact that my meat was freshly cooked and hot out the grease... just like my Momma use to do!"}
{"text":"ERD's is a family owned business. They offer catering, take out, and dining room that probably seats 10 people.  The food was delicious. We had the fried whiting, fried chicken, yams, macaroni, and cornbread. They were all excellent. The seasoning used in the batter is perfect...not too salty, not too much pepper. The fish and chicken wasn't greasy! Thank goodness! Macaroni and yams were perfect. The cornbread was a little dry but was fixed with the addition of butter. They also offer custom lemonades. You can add a flavor shot: watermelon, blueberry, pineapple, mango, and strawberry. Although tasty the price was steep at $3 each 16oz cup. There are no refills with the lemonades and way too much ice (they have a sign that says they do not offer a light ice option) They were out of sweet tea, they cost $2 and if you want a refill it's $0.50. The staff was amazingly nice and accommodating. We will eat here again but next time it will be pick up and we will not purchase drinks.  Thanks ERD and we wish you much success!!!!"}
{"text":"I expected you defend your brand and bad behavior with a lie. I guess you're supposed to Cynthia D. Can I be those things yes I can but, was I that day no Ma'am. That young man so extremely nice I had no cause to be. Sometimes there is no both sides. You we're nasty end of story. Everything was unwrapped except your cobbler in the half cup foam container. I told him didn't want him to remove the top. I just wanted to see consistency. Every booth had warmers with unwrapped product or samples even you. It's the Taste of Charlotte. That's the purpose so people will get to know your establishment and product. But, somehow you took offense to that. So, you're a liar also. I came to your stand to enjoy my break and was very humble. And like I said that's your little business so of course you would say you are right and I am wrong. And I will always enjoy my eating journey as it looks as if you do aswell. Thank you for your concern. I appreciate it."}
{"text":"Great customer service and food! I had baked chicken, macaroni and cheese, and yams. The food was well seasoned. I would return. I also like that they allow businesses to advertise in the restaurant."}
{"text":"Hands down one of the best soul food places I've ever eaten! The fried pork chops(Sunday Special) and the baked chicken and Mac and cheese are to die for. I recommend this place to everyone."}
{"text":"Walked in and immediately greeted with kindness and friendly service. Menu is straight to the point and easy to point out choices. Loved the express lunch menu. I ordered Meat Loaf, Yams, and Green beans. Cornbread was great. Definitely will return."}
{"text":"Ate here for the first time and things couldn't have been better. I got the large plate combo whiting fish, shrimp, mac n cheese, candied yams, and hushpuppies. The candied yams was the highlight. They were clearly made with God's Grandmothers recipe. Best I EVER had. $16 bucks for combo but two servings worth. Also it is locally owned and Ms Cynthia introduced herself which meant a lot. All the food was good and clearly homemade. In the words of The Terminator \" I'll Be Back\""}
{"text":"Delicious food and the staff is so welcoming and inviting. Definitely one of the top restaurants in the area!"}
{"text":"I was warmly greeted upon entry 1 star The fish was fried to perfection 2 stars The lemon cake was divine-very fluffly and moist 3 stars The young man at the register was very engaging through out the order process and helped with the menu 4 stars The only reason I'm not giving a 5th star is because the mac n' cheese definitely could have been better, it was kind of dry. I will definitely be back to try the shrimp! Thank you ERD"}
{"text":"I had the chicken, mac n cheese, and okra. Let's start with the positive, the fried chicken was great. Seasoned well. The sides were bad. Okra was bland and the mac n cheese was horrible to me. It had no taste and no cheese. I don't know if it was just an off day for them, but mac n cheese was so bad, I will never go back. As a soul food place, the mac n cheese must be good! The owners were nice."}
{"text":"This restaurant was recommended to me by a co-worker. The food was excellent and the staff was very friendly and genuinely happy to serve us. I love their saying of you enter as a customer but leave as family. We dined in a witnessed how they were familiar with customers as they entered. I highly recommend this place for great, fresh soul food. Charlotte has a jewel in this place."}
{"text":"This place is a hidden gem, I ordered the catfish and sides of mac and cheese and dirty rice. I gobbled everything up but the kicker was the banana pudding. It was the most delicious banana pudding that I ever had. I love supporting great , local businesses like this one. If you havent tried this place yet, I highly recommend that you do!"}
{"text":"This place is small but powerful. I ordered catfish with yams and macaroni and it was sooo good. It's not the most visible restaurant and I had been driving past it for a while but I'm glad I finally stopped in. The day I went they didn't have any desserts ....or vegetables for that matter which was kind of disappointing because I was looking forward to banana pudding but I definitely will be going back! So hopefully my luck will be better. I also tried one of their all-natural lemonades and it was pretty good. Definitely give this place a try and I'm sure you will be satisfied!"}
{"text":"Great place! Catfish and baked chicken were delish. Mac n cheese  was average, but I enjoyed the greens and hubby loved the yams.   They run out of food, so maybe call in advance  or go earlier in the day to ensure they have what you want.   Not a lot of staff so service is a little slow,  but the food makes up for that!"}
{"text":"Yes, and yes! We have a new spot for our soul food needs! This place is off the beaten tracks, small and family run. We stopped by on a Sunday night to quell our fried chicken needs and we left with some new friends who make some killer food.  The grub: SO good! I could eat those green beans by the gallon. But don't just shove these babies down your throat!!! Let the after-taste just simmer on your tongue for a while. Take your time, it took a while to make and should take a while to eat. The mac and cheese was on point and so was the chicken. I can honestly say (as well my wife) that the skin off the thighs was just a little bit (or slightly larger bit) of pure heaven. Cannot what to try the shrimp and fish next time.  The joint: Like walking into a friends house. The young man at the counter is the son of the chef. His brother also works in the kitchen. So it's all single family run. He was so gregariously friendly when we walked in that I thought he already knew me and that I had forgotten how! The soul of the soul food joint is not just the food, it's in it's people. This place has it all in buckets! Before it we walked out with our spoils, we had taken pics and sat to chat about how the place came to be. This was not normal! And for all the best reasons.   Going back? You bet your butts! I may have to run a monthly tab! Love this place, love these folks!   (PS: I read several reviews that mention that they run out of stuff. They do. They will. Chef Cynt runs fresh food rather than just churning out tons of food. It's a risky business model because you may cheese off a customer or two, but that's how it is at ERD and you should go ahead and expect that maybe you will have to change you order a bit. They sell out that amazing chicken like mad! Change your order to fish or shrimp or baked or whathaveyou. Roll with the tide and you may find a new favorite!"}
{"text":"Had the baked chicken with Mac and cheese and green beans.  Easily one best southern meals in Charlotte.  Chicken was perfect, and the service was great. Will be going again"}
{"text":"I don't have anything, but positive feedback. I understand ERD has only been open since May 2016, so there are still some growing pains of a family focused/owned restaurant. Nevertheless, I have visited twice in two weeks. The first time I had the bake chicken, black eye-peas, and mac-n-cheese (dinner roll). My plate was delicious and filling. The next time I had Thursday's special, the \"Meatloaf & Mashed Potatoes\" and for my side I had the lima beans with a piece of corn bread. I was once again impressed and satisfied by the quality and size of the portions on the plate and with the taste. I will be back and continue to support family businesses and African American entrepreneurship in the city! Grace & Peace!"}
{"text":"Traveling for work and just chose this place somewhat at random due to tasty looking photos. It is AMAZING! Simply put, thr best, hands down, fried okra I've eaten. The fried chicken and corm bread is great too! Proper sweet tea :) mmmmmmmhmmmmm DELICIOUS! So glad I came here and wish it was in my home town. The family who runs it is wonderful and some of the most personal and warm hosts ever. Definitely a hidden gem!"}
{"text":"I am enjoying my second visit to ERD's.  I would have had a few more visits but they've been closing before I could get over there.  In any case, the food is well prepared, served hot and fresh. With fish on Friday's (whiting and catfish) and you can't go wrong. The options are numerous.  I will have to schedule myself to visit on Sunday for ox tails!  Yes, that will be a done deal with some rice and gravy!  On Instagram, the desserts always look mouth-watering.  However, I haven't enjoyed any as today they didn't have any cake (banana pudding only).  I am specifically holding out for the lemon cake.  For great tasting soul food, stop by ERD's.  I enjoyed great conversation with the staff and learned a bit of history about the restaurant and family.  I don't know which days are busiest but it's best to call ahead.  Then you will have the option to order over the phone, or online."}
{"text":"I love ERD's Eatery, but they are never open! I had the opportunity to eat here before . I ordered catfish, macaroni, and collard greens and the food was delicious. The staff is warm and welcoming compared to many of the other soul food restaurants in Charlotte area which are lacking this key ingredient. I definitely plan to eat here again when I get the hours right."}
{"text":"I was so excited about finally getting to this place, but oh my.... My kids and I went after leaving the Renaissance Festival. We made it there a couple of hours before closing, and they were nearly out of everything on the menu. To sum it up, what I ordered was awful, but the pineapple lemonade was the best thing ever."}
{"text":"Had ERD's bookmarked and stopped by for some lunch to go following a meeting in the area.  The young man behind the counter was all smiles and great to interact with both in ordering and in just shooting the breeze as they were not busy while I waited on my order.    There was so much that I wanted to try but I settled on fried chicken, yams and mac n cheese.  I was a little early for the quarter or half fried chicken but he let me know they could hook me up with some fried wings and that was good enough for me.  The food came out in a reasonable amount of time and I have to say that it was hard not to tear into it on the drive home given how good it smelled.  However, I waited and can say that it tasted as good as it smelled.  It was clear that the food, especially the two sides, were made with love and that goes for the cornbread that came with it too.  It was a perfect blend of moist, sweet, savory.  Can't wait to get back for some flounder or catfish or really, most anything else I read on the menu.  Nice job ERD's!"}
