{"text":"The best Filipino street food n GTA , lots of variety of skewers such as a isaw, betamax, Atay and many more, service is great and clean store"}
{"text":"New resto since Sept 2017.
Food is made-to-order.
Filipino bar-b-que and street food ($3 plus).
All day breakfast available ($9.99).

Sisig bowl $8.

Accepts credit cards.
Taste is good."}
{"text":"This is one of those small ethnic food place I wish I would love but I left unsatisfied with the desserts I ordered.

Love the concept of Filipino street food. There are skewers of different protein available! Even Chicken Feet! But I was here for some dessert!

Turon Special ($6) 
- Deep Fried Plantain and Jackfruit Rolls with Ube/Macapuno Ice Cream
- Nicely presented! Love the contrast colour of the ice cream. Though the fried banana was made when ordered, it did not taste good. Might be the banana was not ripe enough? 

Halo Halo ($7)
- I always love halo halo! But this one was meh. The ice was in such a big chunk and it was hard to break that up with our plastic fork. The toppings can be better.

I might give their cook food a try but will be a pass for their dessert."}
{"text":"I visited Eskenita for lunch on a Friday. It's a small restaurant located in a fairly large outdoor mall, which made it a little difficult to find. However, it seems to be quite popular because half the tables were full when I arrived. The interior was interesting. It looked a lot like a corner bodega with a kitchen attached and they sell apparel as well (shoes, sunglasses, hats, etc.).

They serve all-day breakfast, so I decided to try the TapSiLog, which is marinated beef, and a fried egg over rice. The beef was delicious. You can tell that it has been marinated for a long time. It reminded me so much of home and the skewered meats you can find in Southeast Asia. I didn't particularly like the rice. I thought it was too crunchy and dry. The sauce that came with dish helped a bit with the dryness. The egg looked promising because the yolk looked runny on top. However, when I cut into it, I realized that it was overcooked. I might come back for the skewers, but probably not the breakfast.

I also tried the halo halo. It was definitely tasty and sweet. I enjoyed the ice cream, the condensed milk, and the toppings. However, there were several large pieces of ice that had formed, making it a little difficult to eat at times."}
