{"text":"I live in the area and have been here a few times, and am always meaning to go more.  Honestly you might not think it but this place deserves 5 stars and I'll tell you why.  (also look at the hidden reviews)

This place is old fashioned and kitschy inside, has not been renovated in who knows how long. Who cares.  It's run by a very old Italian couple who have been there forever and they make me feel sentimental....anyone who's Italian, your heart will warm because they are very reminiscent of your own nonna and nonno!

The old man/nonno (wish I knew his name) doesn't say much and doesn't seem to speak amazing english so maybe that's why he might come off a little cold to people who are unfamiliar with some old Italians but I just really find him and his wife cute...LOL!  I think they are used to regulars as well.....they've seriously been there forever and have built up a clientele.  Pretty sure they cater as well.

Besides that, the veal on a bun, lasagna, pizza ARE ALL AUTHENTIC AND AMAZING. Authentic Italian food made by a real old Italian couple.  Great spot to get a quick lunch or an espresso.  They have some baked goods as well and buns which I want to try next time.

People of Etobicoke, come out and support this hidden gem! And don't forget....get the veal on a bun!"}
{"text":"You know those places you remember as being amazing as a kid, except that when you go back you wonder what all the nostalgia is all about?!  This little shop is not one of those places.  I started going here when I lived down the street 30 years ago, often getting a slice of pizza after school.  It has expanded to the next storefront since then but is still pretty simple inside.  But really, it is the epitome of the Toronto mom and pop shops that littered the streets in those days, most having closed down no.  I have since moved hours away but when I come back to Toronto I try and make a stop here.  First, with my husband and now my children.  The owner is the same as I remember her as a teenager and it thrills me that they are still in business.

Their veal parmesean, smothered with mushrooms, onions and peppers on a crusty roll is as delicious as it was as a child.  The pizza, as basic as it looks,  with a simple tomato sauce, onions, salty pepperoni its  perfect marriage of flavours.   The veal is huge so I suggest you bring a friend and get a slice and veal parm to share or plan on leftovers.  

You also need to leave room for a sicilian ice cream to end the meal - I suggest pistachio!"}
{"text":"Stopped in for an Americano to go before my appointment at the spa next door.

Cozy and quaint, looked to be a family run place. Note they are cash only but do have a bank machine to take money out.

The double Americano was perfect, not bitter at all.

Olives are my favourite food ever so I couldnt resist grabbing a pack of Calabrese olives to go. Their hot table foods, various baked goods, and breads all looked delicious - I'll have to try some next time!"}
{"text":"Great place for coffee and pastry and lunch and to buy dinner for home. Friendly service. Great homemade food. Kathleen"}
{"text":"Went in for some lasagna.  A small square was $7.50.  3 of these small squares and a veal sandwich was $30.  The lasagna had very little meat interspersed between the layers.   Taste was a bit bland.   Costco has a better tasting product."}
{"text":"I made only a brief visit, but they made great espresso and the pastries were delicious."}
{"text":"I went here for lunch with two of my friends from work recently and, I have to say, I was very impressed.  As soon as we walked in the door, we were greeted by two very friendly guys that I'm guessing must have been the owners.

They offer lasagna, a pasta dish, veal and chicken cutlets, salads, sausages, sandwiches, etc.  My one friend and I ordered a salad with breaded chicken cutlets on top of it while my other friend ordered the lasagna.  The salads (with two pieces of chicken) were $12.50 and the lasagna (I think) was $8.50.

The salad was so fresh and you could really taste the quality of the ingredients.  The chicken cutlets were cooked to perfection; just lightly breaded and no trace of any grease.  The lasagna had lots of layers with meat and cheese; my friend said it was delicious but very, very filling.  We ate at the back of the restaurant with a bunch of other patrons.  Everyone just sat around talking to one another - it was pretty cool!  I will definitely go back!

Note that it's CASH ONLY though."}
