{"text":"Wir hatten Gutscheine von restaurant.com und das war der Hauptgrund für den Besuch. Die Gutscheine wurden ohne Probleme angenommen und entsprechend angerechnet.
Der Laden ist sehr klein. In Deutschland würde man so etwas wohl als Luxus-Imbiss mit Tagsüber-Geschäft bezeichnen. Innen gibt es nur sehr wenig Sitzplätze, außen gibt es etwas mehr Sitzgelegenheiten, aber auch reichlich bettelnde Tauben. ;-)
Wir hatten uns Sandwiches bestellt. Diese wurden frisch zubereitet und waren großzügig belegt. Geschmacklich waren die Sandwiches okay. Wir hatten außerdem noch eine Portion Fritten dazu bestellt. Diese sind aber eher nicht empfehlen (etwas matschig).
Der dazu bestellte Kaffee (einmal normal, einmal Latte) war sehr zu empfehlen. 
Die Tische waren nur semi-sauber - eine regelmäßige Reinigung der freien Tische haben wir nicht miterlebt.
Das Publikum besteht hauptsächlich aus Bürokräften, die in der Nachbarschaft arbeiten.

Das Espression Cafe ist sehr nah an der Fremont Street. Man geht praktisch auf Höhe des Binions zum Golden Nugget und dann noch etwas weiter geradeaus. 
Wichtig: Der Laden hat nur tagsüber geöffnet.

Tipp: Man bekommt immer sehr günstig Gutscheine über restaurant.com."}
{"text":"Awesome place for nice coffee and great delicious food!!! 
I would definitely recommend it ! 
Our new favorite restaurant for lunch in Downtown Las Vegas  
Thanks to the beautiful owner, Silvia!"}
{"text":"I eat here frequently and the food is delicious at an affordable price. The customer service is excellent and the overall vibe is always pleasant even during lunch rush. 

The iced chai is my favorite. I personally think it's better than Starbucks!"}
{"text":"This is a hidden jewel away from the Fremont Street Experience. Only wish we had found it sooner. You must try it.  Prices are more than reasonable, cheaper than McDonald's. A 2 egg breakfast, a hashbrown, 2 pieces of bacon, only a whopping $4.99. My kind of breakfast. Great food, you won't be disappointed."}
{"text":"My rating is based on two things and in my opinion the only two things that matter. The cappuccino and service were 5 stars."}
{"text":"Great lunch spot downtown. Food tastes good. They also have one of the best-tasting coffees around - they use Illy, of course. Prices reasonable."}
{"text":"We love ordering breakfast from here at the office! 
It's delicious. Wish they had more sandwich options for lunch though.
Burgers are delicious!

If you order through Eat24, most likely you won't deliver your drinks. :(
Thirst sadness..."}
{"text":"I ate here this week and it was good place for a quick uncomplicated breakfast.  I had bacon, eggs, toast and a hash brown.  Good coffee by the way.  Wonderful staff.  Typical business district downtown type eatery.  This is nothing fancy but it does hit the spot and is very well maintained.  If I were in the area, I would eat here again for a quick bite to eat for decent food and excellent service.   Food=3, Place=3, and Service=5."}
{"text":"Fun, tasteful atmosphere with a charming owner.  Pulled pork sandwich way too sweet,  but otherwise thoughtful, yummy food.  Good coffee."}
{"text":"Great place for a cup of Illy espresso or cappuccino. This is a fast service place, but restaurant quality Italian food for lunch + yummy desserts and snacks. You got to taste the black cherry Gelato. Is delicious."}
{"text":"The food was ok I had the Swiss mushroom burger and it was not to my liking and my daughter had the tuna which she loved. Said it was really tasty and she also had the lava cake which she said the inside was awesome but the cake was not that good. I may go back but it would not be anytime soon but the area was nice."}
{"text":"We found this place walking toward another breakfast cafe and decided to try their food instead. It was a great choice! Their food is really great and at a fair price too... We've since been back a couple times and have continued to enjoy this great spot! Antrese has been our server every time so far and we've been impressed by how nice and helpful she has been! Definitely recommend."}
{"text":"This is my only review I've wrote on yelp after using this app for years. I'm writing it because I was so satisfied with this cafe. I ordered off of eat24 and my food was at my door FAST! It's nice having delivery options especially when it's good food and fast. I don't know what that other guy was complaining about you guys kick ass"}
{"text":"Great food and friendly staff.  The owner came out to ask how the food was.  Excellent service.  They were open to substitutions that weren't on the menu which made my dining experience that much better. They were a little busy during lunch hours which is a good sign being that they're next to other restaurants.  This made me think they are holding their own.  Prices are reasonable and the food tastes great.  Definitely coming back."}
{"text":"This is my newest favorite spot! My friend and I shared a few different dishes. First off we tried the Greek salad. It was wonderful. Really crisp lettuce, huge tomatoes and fresh. We then ordered the Scottish flatbread. Which was smoked salmon, cream cheese and chives! Delicious! The lasagna was to die for! Full of flavor in every bite. Perfect size portion. They're menu has a variety of amazing dishes which includes omelets, salads, wraps, panini's, burgers, and homemade soups. You can also custom make your panini! Don't hold off on their dessert! The bread pudding was a delight! With this Vegas heat you can't go wrong with cooling yourself down with one of their many flavor gelato's or smoothies! If you haven't tried this place your missing out!"}
{"text":"I love this place. Have been here several times and again I love it. I have had the BBQ burger, chicken pesto panini, the chicken Caesar wrap and I keep trying different things every time I go in. The size of the burgers are ridiculous. So far not a bad experience. All the girls are super friendly and the owner is a sweetheart. They do get very busy for lunch, but you will still be very well taken care of."}
{"text":"I was looking for just a place to get breakfast and coffee that didn't involve flashing lights or clouds of smoke.  I was relived to find this cafe within walking distance of my downtown hotel!  I had a toasted marshmallow iced latte and a breakfast burrito.  I don't remember which one I ordered but it was a vegetarian burrito with avocado and egg as two main ingredients.  And isn't that what is really most important?  it was also fun to people watch all the law enforcement officers and legal professionals as they came in.  Plus, free wi-fi!  Will definitely come again."}
{"text":"The food is great and the people are super friendly. Best coffee near the courthouse."}
{"text":"This is a great addition to downtown!!  The food is super good and the people are even friendlier.  I also prefer their coffee to the other places. 

Try the jack Daniels pulled pork panini or the ahi poke salad. Both are to die for."}
{"text":"Located across the street from the Justice Center. I had a turkey sausage egg and cheese breakfast sandwich on a plain bagel. It was fantastic!!! Great flavor and nice and hot. Excellent service also."}
{"text":"Great food and very nice small cafe. Staff here are all friendly. Nice and quiet during breakfast hours."}
{"text":"So I may be a bit bias to this cafe because I work close by, but every single time I visit I try something new. So far it's been amazing every single time! I highly recommend any of the sandwiches; the hot paninis to be exact. The place is always clean, staff is always friendly and they work well when there's a crowd. I would also recommend their watermelon lime drink, it's amazing !! I could go on and on, if you're in the downtown area looking for a place to have breakfast, lunch or a pre dinner meal please do yourself a favor and stop by !"}
{"text":"I've only ever had their omelets, but then I've had their omelets again and again and again.  Perhaps a bit much cheese, but perfect eggs and excellent service more than makes up for it.  A great neighborhood joint."}
{"text":"I came here for breakfast this morning. I had the bacon, egg and cheese sandwich. It came with a hash brown. It tasted delicious. It's a family owned business and they make their food fresh. I also ordered a sausage, cheese and egg sandwich for my daughter. She had an apple juice to drink. I also got a blueberry muffin and a hot chai tea to drink. Everything was delicious! Hubby got a hamburger with fries and a soda. Hamburger meat needed salt and didn't have much flavor. 
The cafe had a restroom and enough room for about 25 people. There were 2 tables for 4 people and the other tables were for two people. There were condiments on the side which provided packets of ketchup, mayo, napkins, plastic forks, spoons and knives. It's a cute place. 
If you check in, you get a free gelato if you purchase the lunch special. We had breakfast so I saved my check in offer for later. 
The guy was nice enough to ask us how the food was. I told him it was good. 
It's located across from the court house. 
I highly recommend this place if you are in the area. We will be back!"}
{"text":"first time here today, great coffee, staff is nice, haven't tried the food yet, next time. Reasonable pricing"}
{"text":"Espression Café is one of the restaurants that has opened up over the last few years downtown right next to the courthouse.  It is small, and parking is down town parking so it's not cheep or easy, but it's worth the trip.  The bacon cheeseburger is one of the best!  I kick myself for not taking a picture to post here.  Two patties with bacon & bbq sauce.  If you get the combo it comes with a ton of fries and a drink.  The meat lovers omlette is great for breakfast, as is the el gordo wrap.  The smoothies are great as well.  Prices are great, and the customer service is outstanding!  Its a family owned business, and I am always greeted with a smile.  Service can be a little slow at rush times, but the food is well worth the wait.  If you are downtown stop by for breakfast or lunch!"}
{"text":"The chicken caesar salad, swiss-mushroom burger, and garlic parmesan fries are great! Plus they are super quick and have wonderful customer service."}
{"text":"Cute little breakfast/lunch café across the street from the courthouse- whether the business that brings you to this area stresses you out of having an appetite, or you cope by stress-eating, this place is worth hitting up.

Menu includes coffees, sandwiches, soups, salads, desserts, and a few other things. BF and I split a buffalo chicken Panini and a pasta e fagioli soup- the soup I did not care for at all, but BF said it wasn't that bad once he added salt and pepper. 
That Panini though was awesome: huge portion size, plentiful chicken and bleu cheese, not too spicy, but filling and really hit the spot.

Pricing is average for downtown, which is a bit higher than elsewhere. Service was polite. Location wasn't particularly busy at 11AM on a weekday. Might be a good place to get some work done with a laptop."}
{"text":"Went for the first time yesterday and loved this place...  the chicken Caesar wrap was delicious... friendly owners and staff as well... I will definitely be back!!!!"}
{"text":"Short walk from The Golden Nugget. Great prices and normal portion sizes. We recommend the large coffee. :)"}
{"text":"Yuck! !!! Sausage is some frozen puck one might have played hockey with before serving it to my gf. Toast like a shingle and 'hash browns' are fast food style but not as good. Really disappointed in my breakfast experience."}
{"text":"Great food with a good variety menu. 
There are just too slow! Not the place to go to if you have a quick break. By quick break I mean 30 minutes or so. Once I waited 19 minutes for an omelette."}
{"text":"Best roasted vegetable panini thus far. Service is friendly & fast $7.84 for the panini. Too bad it doesn't include fries. They offer free wifi and this place it across the court house."}
{"text":"Ummm what can I saw it's near the court house ...
I ordered eggs and sausage toast was an extra dollar omg... my eggs over medium only got one that way the other was over hard... sausage was cold... butter in a package.. mayo in a pack... and the hash brown that came with it was a frozen one put in the deep fryer.. the only reason they got 2 stars was the cashier was nice and and tall handsome very polite man Scott who was behind the counter. This is my last visit... money wasted"}
{"text":"This was such an amazing place. Great service especially the male Cashier very friendly. Tall women was great as well. The food is really good worth the wait. loved the place. Very clean just wish it was easier to find. Parking was just not good other then that perfect all around"}
{"text":"Alright for Las Vegas. Decent prices and decent quality. Nothing outstanding but still a much better deal compared to what can be found on the Strip."}
{"text":"I work at the RJC and I've been to Espressions numerous times and I've yet to have anything bad, all the food is delicious from the wraps to the burgers and the French dips etc."}
{"text":"darn good. paninis are huge and delicious. everything is pretty large especially for the price."}
{"text":"Used a restaurant.com cert. spend $20, get $10 off.  Went for breakfast.  The girl who took our order was very helpful. Hubby had ham and eggs and order of (4) pancakes, I had bacon and eggs, each came with (frozen) hashbrowns.  We also each had a mocha frappuccino.  It was a nice day so we sat outside under an umbrella, watching the daily business of downtown.  I learned you must get your own silverware and condiments, and I wasn't sure if you were supposed to wait inside for your order, though a gal brought our food out to us.  Food was hot, eggs were perfect, my bacon was yummy, hubby loved the pancakes, although wasn't keen on the ham.  Seems like a perfect place to have in the busy area.  If I lived here and worked around there, I'd probably eat there a lot!"}
{"text":"Place is clean, great food and great staff. We tried the omeletes and the portions are good size"}
{"text":"I have not been to the restaurant in person, but i did order it through postmates with a friend and it was pretty good! I had a strawberry banana smoothie (which was good but tasted more like strawberry yogurt) and blueberry muffin. The muffin tasted like any other muffin you could get at your local grocery store. My friend had the pancake combo with over medium eggs, and a side of bacon strips. He only wishes the pancakes were a little bigger but appreciated that they gave plenty! Definitely would order again."}
{"text":"Amazing food and such friendly service! We were so happy to stumble upon this place while visiting. Also a good spot to get some laptop work done."}
{"text":"We decided to order here for lunch. Worst decision. Not only did it take forever to get to us. They delivered it to the wrong suite. They had our correct suite, and also had my direct number. The people who received the food, was nice enough to figure out who ordered the food. So we received our food cold. Definitely will not be ordering here again."}
{"text":"This is a nice litte cafe conveniently located within walking distance of many of the county, city, and federal buildings in downtown Las Vegas.  They offer pretty much everything, including breakfast options, pastries and baked goods, coffee, sandwichs, and hot lunch options.  They also have ready-to-go salads and other stuff that are made fresh daily.  

So far I've sampled a couple of their salads, some bagels (uniquely toasted on a panini press), and several cups of coffee.  Everything has been very good to great, and service is always impeccable.  The folks behind the register always great you with a smile and a hello when you arrive, put together your quickly, and have you on your way before you know it.  Definitely worth checking out if you are in the area."}
{"text":"This is my last go to place when I don't want to walk far to my other go to restaurant.  This place for me is a HIT OR MISS.  I think it all depends on who's probably cooking or whatever the case may be.  Some days, the food I get is amazing and then some days, its like WTH!  Like today, there are days where I get their turkey burger which works for me but I decide to have sweet potato fries, cooked well to go with my order.  I know I asked for well done on my fries, but I didn't ask for the burnt look.  It was still edible but the girl in my office thought I was having BBQ for lunch.  

I've tried their Flatbreads and I was going to attempt to try all of them.  The first one I tried was the Smoked Salmon (smoked salmon, spinach, cream cheese, and chives), instantly I thought it was too salty.  The 2nd one I tried was the Charcutiere (pepperoni, ham,  turkey, mozzarella, fig spread and mix greens), I thought that was EH...didn't care to much for the fig spread.  Then last, I tried the Chicken Pico (grilled chicken, cheddar cheese, mix greens, and fresh pico de gallo salsa), and it was JUST RIGHT. It instantly became my favorite.  It had a little bit of protein, carbs, some veggies...the perfect little combination.  I liked it more so because it had the mix greens in it.  I ordered this a few more times and recently when I ordered it, it didn't have my mix greens which I was looking forward too.  That really put a damper on wanting to order it again.  Just makes me feel that if I order it again, I'd have to be sure they didn't forget the mix greens.

I always get their green tea smoothie.  I really think this place should make smoothies/drinks that uses fresh veggies and fruits as well.  Just saying.  

With all that being said... until next time, happy eatings!"}
{"text":"This review is for the salad bar, I feel like I need to warn you.  It's a total rip-off because they weigh your food.  $13 and some change for a salad!  Need I say more.  I definitely would've left out the rubber tasting chicken and nasty croutons.  I will stick with Jason's Deli, better selection and you can have all the salad you want for one price."}
{"text":"Wow! Such a great breakfast! Hubby and I trying places outside the box. I had the sunrise wrap. Get in my belly!! Great coffee too!"}
{"text":"First time I went here I got a pesto panini and was very disappointed about how dry the chicken was. Decided to give another shot and got a breakfast wrap and it was very delicious! Place has redeemed itself"}
{"text":"Since I had jury duty, I found this establishment very close to the courthouse during my lunch break.  Plus, the staff was very friendly and knowledgeable.  Thus, I tried his recommendation and the lobster bisque was fabulous!  Therefore, I highly recommend this cafe especially for lunch!"}
{"text":"Good place to go if you have business at the regional justice center. I did. Unfortunately, I was found competent enough to sit on a jury earlier in the summer and during a lunch break I walked across the street to check this place out. There's a hot bar where you can grab food to go. Or you can order at the register. I opted for a chicken pesto panini ($6.75), full of large chunks of white chicken in between crispy panini bread. It was messy, but good. Fries were extra."}
{"text":"I'm constantly on the hunt for really good places to eat around my work in DTLV that are paleo and Whole30 compliant. And by really good, I mean fresh, quality ingredients, carefully prepared and presented dishes that won't be charged at tourist prices. 

Espression Cafe is now one of my favorites. Although I can walk to it (I LOVE that I don't have to drive there), they also deliver, which is great for those insanely busy work days. They've got a pretty big breakfast and lunch menu, though admittedly I eat breakfast all day so I know more about that than anything else. I've eaten from there enough to know now that everything they make is fresh, delicious, and prepared well--even down to their pastries and coffees. 

I try not to eat out too much but Espression is definitely my guilty pleasure that I'd probably splurge on at least once a week if possible."}
{"text":"We recently moved out company into the same building. It is great having them here.  Wonderful food and people and makes it easy to grab a quick bite as they have almost everything you can imagine on the menu. Great for Breakfast or lunch! For sure a must!"}
{"text":"This overall review is really 3.5 stars.  The food is more like 4 stars, easily.  I have to deduct a star and a half simply because the service has really fallen back in the last couple years.  Used to love it here, but now you get a sourpuss in the mornings when you order a coffee or whatever.  And despite the fact that they got positive feedback from me on one of their soups, they never carry enough of it, so it was always out of stock! That seemed insensitive to what customers want. Worse, once I ordered a pie that was absolutely bone-chilling cold in the middle. When I called to complain, I was told it was my fault, as I should have known that it needed to be \"reheated.\" But I work at the courthouse across the street, and not in a section where I can get to a microwave or an oven.  I ordered a dessert that I could eat right then and there...not take home and fuss with.  I didn't mind that I may have made a poor choice. But I do mind being blamed for it, as a regular customer.  Have not been back."}
{"text":"Great little cafe. Wide selection of food cooked to order or ready to take and go! 

I ordered the bacon cheeseburger and my co-worker had the pulled-pork panini and fries. Both were very flavorful, cooked perfectly, and huge portions! The burger is a double patty with thick cut applewood smoked bacon, served without condiments but easily available. The panini was cooked just right, and the Jack Daniels pulled pork was divine, with large pieces, not too fatty, and just the right amount of sauce! The fries were large and perfectly cooked, crunchy on the outside with soft center. 

Prices are quite reasonable for downtown, especially considering the portion size. We parked in a meter spot on the next block over, but there is also a paid parking garage in the same building. Plus 15 minute pickup zones right in front of the cafe, easy to pop in for Italian coffee or a to-go order! And delivery available to my office!

The only complaint I have is that the door was open and A/C blowing strong in January. It was cold inside, but they explained the A/C was for air flow not necessarily temperature. I'm sure this would feel lovely in better weather, but it was too cool to be comfortable today.

All in all, we will definitely be back! Even my picky-eater co-worker said there were many items on the menu she wanted to try! I'm looking forward to better weather when we can sit outside on the cafe patio, since it is shaded by the building across the street."}
{"text":"Usually I love this place but after the fish & chips yesterday I won't be back. I'm currently suffering with food poisoning. I noticed some black coloring in the meat after a few bites. I threw it away but have been so sick I had to go to the hospital which sucks when you have a two month old baby"}
{"text":"I've eaten here twice and both times I'm so impressed!!! The food was hot and so good omg and everything I ordered was healthy and very tasteful. One of the representatives actually came to my job and gave me a menu, ten minutes later I was there and ordering food. Definitely one of my new favorite places to grab lunch! Excellent staff, excellent food, excellent prices!"}
{"text":"Nice little shop, but the coffee falls short. They serve Illy coffee, but only use one shot of espresso in a 20oz latte. Very milky."}
{"text":"I went here with a co worker this morning for the first time. Its in a cute business center area and it looked like a great place to have brunch. The food was pretty good but the wait was about 10 mins for both of us to receive our food which was a bit long. Typically, I would probably rate about a 3 stars because I really did enjoy the setting and the food BUT the reason why I rate 1 star is because while I was walking toward the restrooms one of the gentlemen who worked there must have been on break and was sitting at a table and pointed me in the right direction to the restrooms (which I really appreciated) but then as I walked away he said, \"Damn you fine as hell\". I didn't realize he was an employee there until I sat back down and seen him behind the counter. He was an older gentlemen wearing a blue hat. This is very unprofessional and made me feel very unconformable and for that reason I rate 1 star. I would hate for my daughter (or anyone for that matter) to come here knowing their staff make inappropriate comments to their customers. Amazing."}
{"text":"Stopped by to check it out after hearing a lot about it. 

This is a great spot! Forget Starbucks! The people here are a lot nicer, the prices are more reasonable and the quality of the food is a LOT better. They have omelets, salads, wraps and burgers, and a lot of coffee drinks. 

I ordered the brisket sandwich. It was this week's special. So delicious! 

I highly recommend it."}
{"text":"Best coffee place in Downtown Las Vegas. They also have food, sweets and other beverages. 5*"}
{"text":"This place is a bargain and has some amazing breakfast!! Also who doesn't love superfood coleslaw!! That's the jam"}
{"text":"Love this little place. Not that long ago, this was simply a coffee shop. Now they have comfort food dishes in a steam warmer that you can buy around lunch. It is amazing food, reasonably healthy, and you can have a solid lunch right across from the courthouse for less than $15. The prepared food is only at lunch, but they have sandwiches later in the day and they also have a decent breakfast."}
{"text":"Back in 2014 I went on a walk around Downtown and I saw this place. I'm a coffee fanatic and this place has amazing coffee. Since then I could never find it no matter how hard I try. Recently I transferred to the Golden Nugget and how lucky am I??? It's down the street from there! I'm so happy. I had a small hazelnut iced coffee and it was $2.75. The coffee is pretty cheap in my opinion and delicious. I haven't had the food yet but I definitely will soon!"}
{"text":"If you're looking for a cup of coffee or a quick and delicious lunch - this is the place to go. It's tucked on the corner of casino center, across from the courthouse. 

1) Prices are extremely reasonable ($8-$10) for lunch and the portions are great. 
2) Lots of healthy options and fresh ingredients. 
3) They have a pretty quick turnover for the dine in lunch goers (always a place to sit). 

This is an extremely convenient place to grab a healthy and economically friendly lunch if you work nearby or in the area. The workers are always friendly and the food is always good. I'm a big fan of their cheeseburgers, fries (especially the sweet potato,), and the pressed sandwiches - specifically the Cubano when it's available. 

Definitely a great lunch or breakfast spot (not brunch - unless you're brunching booze free)."}
{"text":"Love this place! From the coffee to the food... It's all good! Very friendly staff. And cute little place! Never been disappointed!"}
{"text":"\"Omelet\" - It's the word that I searched on Yelp that led me to the discovery of this wonderful restaurant (or is it a café?) Until recently, I have been frustrated of not be able to find a place within walking distance where I can find some good food for lunch or breakfast. Voila, a simple \"omelet\" search led me to a restaurant where the food is fresh, delicious, and very reasonably priced.

To be honest, I haven't tried all the food at the Espression Café, but whatever food I have tried, they all tasted so fresh and delicious. I love their Garden Omelet and have eaten their omelet more this past 3 months than I have ever eaten in the past 10 years. Their chicken pesto Panini and flatbread are yummy and pretty large. They always cooked the eggs perfectly just the way I requested (over medium.) All the ingredients they used seem and taste very fresh. 

Beside the food, their customer service is awesome. Every time I came to pick up my food, I was always greeted with a smiles and that made the whole experience so much better. Even though all the girls working there are so wonderful, I have to give extra cred to Marissa for the banana milkshake recommendation and Silviya who always answered the phone when I called to place order.

If the two reasons I listed above haven't persuaded you to give it a try, you should look at their menu pricing. For what they offer,  you would have to pay twice as much at other restaurants and might not even get the same quality. 

As for me, I will definitely continue to explore other items on the menu and recommend this place to my co-workers and friends."}
{"text":"I work in and around the RJC so this is a go to place for quick breakfast, lunch or cup of coffee.  Food is good quality and made to order as far as I can tell.  The banana nut oatmeal is a great way to start the day as are the breakfast sandwiches.  Paninis  are tasty for lunch and their homemade soups always satisfy.  They do something special with their tuna sandwich.  I can't figure it out, but that's probably why I keep coming back.  Only complaint is that they changed their brand of coffee.  Whatever they had when they first opened was far superior to what they have now.  Bring back the other coffee and my review goes to 5 stars."}
{"text":"I love this place! Not only good with time for the areas I would be in but quality food everytime! Great customer service and I can honestly say I am never dissappointed with the food except when it's gone!"}
{"text":"The food is really delicious however the service for being completely empty was very slow. We had egg white omelettes and Panini's. My vegetable egg white omelette was absolutely delicious and huge. My husband had the Buffalo chicken Panini with fries and he said it was awesome. It was a little bit awkward that his sandwich came out 20 minutes before my eggs. So he was done eating before I started. The only condiment available for the eggs was Tabasco sauce or a very bland salsa. I would've much preferred to have hot sauce of some kind of authentic salsa for my eggs. The drinks in the cooler aren't marked with prices so I wasn't sure what anything cost. I ordered a bottle of water and then was told that the brand of water I picked was three dollars more than the one I paid for. Their menu is very impressive however and they have an attractive hot food buffet so you can literally get almost anything that you would want to eat there from muffins to coffee drinks to smoothies to hot dishes to sandwiches and soups."}
{"text":"I order the ahi poke salad.......... Wow, it was terrible!!! Can someone please say bubble guts!!!! I will never be eating here again!!!! Gross!!!"}
{"text":"Went here this morning around 8 am to grab a quick coffee and bite with my parents - it's right across from the court house! They have ily coffee/lattes. I ordered the caramel latte and it was definitely flavorful. My parents had ref coffees and some food. They carry Krispie Creme and a variety of bfast foods/lunch. My dad has a plain bagel w cream cheese which was super soft. Can't complain about a bagel, really. I would come back again if I was in the area. Super clean and they have a little outdoor seating area, perfect for the nice weather today!

Just an FYI, they have a restroom that is shared w the rest of the building, anyone can come in and use. It's kind of scary - since it's all the way at the end of the building."}
{"text":"Been here a few times since my original review, still great food and service. They've updated their menu to include a food and salad bar (pay by ounce). They also carry Illy coffee, which is my personal favorite."}
{"text":"I was on a vocation in Las Vegas and had the opportunity to eat at Espression Cafe, I have to stay that I wish there was one closer to my home. There was a little bit of everything on the menu. Also great staff!"}
{"text":"This is my new favorite place! i just had the ahi poke salad and a fresh coconut (from thailand) both were REALLY great and the prices are phenomenal.. food taste fresh which is what i need as i work nearby. please dont change your prices or service - i have boycotted some competitiors for this.. we will be back most probably every day! thank you! 5 stars if it was faster.. i waited too long for my lunch break, now not enough time to eat.

would love it if you did green smoothies with fresh veggies -

oh also- the dressing was good but for a little japanese flair i added mayo, wasabi, and soy sauce and its amazing"}
{"text":"Was looking for a unique and healthy option for breakfast downtown and found this great gem. I'm a vegetarian for 20 years, but got a little hooked on poke when I lived in Kauai (who wouldn't) so when I saw they had a seaweed and poke salad on the menu, I was excited. It was excellent. Fresh greens, best seaweed I've ever had and the poke sauce that came with was so good. They even added a Hawaiian flower to it. My friend had a full breakfast of pancakes, eggs and sausage and a latte. He said they were really good. 
The green tea smoothie was also excellent. The cafe is cute, very clean the service was friendly. Highly recommend."}
{"text":"Food is great if you go there and eat. Do not ever order for delivery. Took him forever to get here and doesn't follow instructions. By the time he finally got here (5 phone calls later) our food was gross and our sodas were watered down. Mind you, this place is only a few blocks away. Should have walked and got it myself. One star for delivery. All five for the restaurant if you eat there."}
{"text":"This place is my new favorite!  Their coffee is soo good, you can make a ton of different combinations or just stick to the basics.  Their selection of teas are great too and they are amazing quality!  Super yummy. I had a pesto chicken pannini that was effing delicious.  The staff is super nice, the girls are really sweet.  Everything about this place it's awesome.   Totally go there!"}
{"text":"I am IN LOVE with this cafe. The owner and staff is so friendly and sweet. They're always there to make suggestions or get you to try something new. I know this is going to sound silly, but of all the things on their menu, their fries are to die for. Seriously. Get them with any combo you might purchase. Their sandwiches, salads, paninis, burgers, you name it, all spectacular. I recently had their gelato for the first time, and I thought I had gone to heaven. 

The pricing is phenomenal for the amount of delicious, always hot and fresh food you get. How is this place not busier? Maybe it's the best kept secret Downtown. 

Also, they are catering Thanksgiving dinners for those of you who may not have the time, energy, or money to make an entire meal yourself. If I didn't cook myself, I would definitely be giving them a try. I suggest you do the same!"}
{"text":"Located on the corner of Lewis and City Center in downtown Las Vegas, this is a small cafe with a large menu and variety of food to choose from. 

They have the self-service station that allows you to fill your plate with precooked items. This is the most convenient option if you're in a rush. 

I opted for a veggie burger and a refillable drink. The veggie burger took a pretty long time to make. I waited quite a bit while others were called before me. The burger was decent. A little mushier than I would I have liked but ok.

There aren't a lot of seats and they do get busy around lunch time so it's smart to call your order in in advance if you're in a rush."}
{"text":"Called in order using 'Eat24'. Asked for delivery @ 11:45am (making sure it was here for lunch). Delivery showed up at 10:40am. Was missing one of the drinks for co-worker. When I asked why so early, the delivery person said, \"Sorry, I just deliver.\" I called the store and explained to a worker, who transferred me to another worker to explain again. They were powerless with out the manager and was told they would call back. At 11:30am the manager called and ask how she could help me. I asked if I needed to explain for a 3rd time. She said, \"Well you called us.\" I said, \"No, you just called me.\" She said, \"Have a nice day and hung up.\"

Will never 'visit' them again. And will encourage everyone in the area to avoid them if at all possible.

Side note: The Chef Salad was a joke. If it had said \"Side Salad or Child Size\" I wouldn't have ordered them."}
{"text":"Let`s start with the good stuff first. Clean place and friendly workers. The paninis are great (a bit overpriced) but you definitely get what you pay for as it is a big portion. The buffet is great especially if you`re down on cash and want a variety of food on your plate. 

Cons: Breakfast is not great at all! I would definitely not recommend it at all. I`d rather go to Mcdonald`s for the same quality of food at a much, much lesser price."}
