{"text":"If you have a burning desire to drink beer while listening to polka and being served by lederhosen-clad bartenders, Essen Haus is is the place for YOU! As for myself, well...it wasn't quite my scene. A lot of yelling, \"WHAT?\" to my S.O., unpleasant stickiness on the bar, and what-not. The pretzels are the perfect foil for the beer--well worth it for 50 cents. But overall? Meh."}
{"text":"Okay, I didn't eat anything but hot pretzels and I was there with a huge group after a wedding and all we did was drink beer from enormous glass boots. But that was great fun, so it wins four stars. It's a perfect stop on a pub crawl. It has personality. I could totally imagine it sucking if you were stone cold sober or hungry or in a different place than I was."}
{"text":"Very good German beer selection on tap.  Franziskaner Hefeweizen on tap is elixir of the gods if you ask me.  It has banana and clove esters, is cloudy, uses a magnificent yeast, etc. The Franziskaner Dunkelweizen dark wheat is interesting but no where near as good as the regular cloudy wheat Hefe.   The flavor balance of the Hefe is far more favorable, though some nice, medium-dark malt flavors grace the dark wheat.  Food at Essen Haus is good, but not as good as I remember it being 5 or 10 years ago.  The best dish may be the Wurst platter, but the Sauerbraten and Jaegerschnitzel were good.   The red cabbage salad was very nice, as others have mentioned.  Had vinegar and sugar seasoning, and I think I tasted coriander as the spice which seemed to elude other reviewers.  The warm pretzels served with different mustards are excellent if salty.  Why is it that breweries and beer houses serve really salty food?  I'll leave that as an exercise to the reader..."}
{"text":"Well, Not much to be thankful for at Thanksgiving at the Essen Haus. Way overbooked. Packed in like sardines. Checked in my party of 13 four times only to be waiting even after being called. The guy at the desk was checking in people, running around the restaurant checking on tables and yelling at staff & customers. No gemutlikich here today. Sat down and the waitress brought our side dishes with no spoons ten minutes before the turkey that we still had to carve. Had to ask for rolls. The food was ok, but not for $21.95 a person.  Could have gone to Denny's for the same meal. Never again."}
{"text":"Great selection of flavorful German beers. OK German food, but I've had better sauerbraten--tasted like it had been in a crock pot a bit too long, sort of dried out. My dining companions said the same thing about their wurst plates--OK, but not great. Big, busy place, but they found a place for eight of us. Waitress was friendly and willing to accommodate separate checks."}
{"text":"This was the total package; rare beer, rustic charm, rabble rousers in the corner enjoying der stiefel and friendly regulars at the bartop. A Polka band was tearing it down with all ages enjoying it. Most importantly, excellent schnitzel served by an expert tour guide behind the bar. Thanks for the great experience Phil! Anytime I am in WI I will be back due mostly to your service."}
{"text":"Thursday nights are the best at the Essen Haus. With cheap 2 liter boots and abundant space, this restaurant creates the perfect atmosphere for large groups to hang out and drink good beer.   My friends and I have been here on many occasions, and I have enjoyed each one. I wouldn't say the cuisine is the best (the cheese curds are pretty good though). It's pretty standard fare as far as the reuben, schnitzel, and other German foods go.  The beer is where this place shines. Feel free to bring a deck of cards for Euchre or just hang out. After drinking 3 boots, you get a t-shirt. Like I said earlier, this place is great for large groups. They have multiple booths that have space for groups of 10+ people. Everyone is always in a festive mood and willing to spread their spirit to other people in the Essen Haus.  Be prepared for the chicken dance song though. I heard it at least 3 times the other night."}
{"text":"I dined here in a group before the Billy Joel/Elton John concert. What can I say? It is what it is. A fun atmosphere with a stellar selection of German beer and hearty Alpine food. I especially liked the attention to detail--salty, fresh Dutch pretzels in a basket accompanied by a trio of mustards (sweet and hot) and horseradish. In summation, their 'wurst is the best'!"}
{"text":"This restaurant has come to typify the Madison ethnic dining experience:  rave reviews for over-priced poorly prepared food that only tastes better because of the impaired judgement of too many beers.    Our table had a variety of the pork and chicken schnitzel dishes, along with the spaetzle.  The only thing that had any merit was the clam chowder.  The schnitzels were bland, with a heavy, dirty oil taste.  The spaetzle seemed like they went across the street to Wah-Kee and grabbed some noodles.  I've made box spaetzle that tasted better than what we experienced.  Not sure what the fascination is with the factory-made pretzels that you can get at Sam's club.  The bar environment with the polka band and seemed to be festive, which is the only reason this got more than one star.  If you're hungry, plenty of Madison restaurants that do have a passing grade.  If you want German food, if this is the best it gets, may want to try Chicago."}
{"text":"Came here for Sunday brunch and sat outside. Great outdoor seating. Waitress was friendly and attentive. The food was pretty good, but they didn't make the eggs the way I ordered them. (Asked for over medium, were made as runny as barely cooked eggs could come.) Bloody Mary's were excellent. Overall would come back again."}
{"text":"This place was a disappointment. The food wasn't bad, but it wasn't good either. Nothing to write home about, especially for 15+ per entree. Some highlights do include the relaxed atmosphere, live music, and free pretzels. I also do not like lagers, so that may have not been the best choice, in terms of beer, for me."}
{"text":"We had one more dinner in Madison and decided Essen Haus would be ours.  It was a Saturday night and we were worried about getting a table at 730pm but not only did we get a table right away, we found parking right outside!  The inside had the look and feel of a European restaurant and the staff was dressed in a variety of olde timey German looking garb.  The beer selection was awesome.  Lots of German brands.  My buddies got Spaten and were pleased with that.  I tried the Hofbräu Oktoberfest and stuck with that.  It was wonderfully cold and fresh.  A free basket of warm pretzels made the beer even better. Since we were now addicted to cheese curds, we started with that.  They were the best we've had so far. I still don't know what these things are made of and I still don't care!  For dinner I had Wiener Schnitzel which came with sauerkraut and fried potatoes.  The Schnitzel was giant and very tasty.  Not a big fan of kraut but my buddies also had it and advised that it was good.   By 9 we noticed the place was full and then the umpa band started playing and the Essen Haus earned it's fourth star!  The music was the standard polka stuff but you can't help but tap your feet and be happy."}
{"text":"Took my daughter and a friend for an early dinner. Service was good, but the food was not what we had hoped - while the sausage was fairly good, the schnitzel was soggy, tough and tasteless."}
{"text":"The building is old and historical.  Our server was friendly and pleasant.  Atmosphere was great when there was performance on stage. Unfortunately, I cannot say I'm happy about the food.   I cannot believe how gross the liver dumpling soup was.  The spicy chicken veggie soup was very tasty though.  The free pretzels came with mustard and sauerkraut -- all pretty bad.  The battered fried fish was pretty dry.  I understand that cod is naturally firmer and dryer than haddock.  But how does their fried cod fall THIS short of Avenue Bar's fried cod?    The veal wiener schnitzel was done well.   Overall I still liked Essen Haus.  I will go there again for beer and the atmosphere, but probably not just for food."}
{"text":"The food here is massively overpriced and bad quality. You pay for the atmosphere - not even good food presentation! Average dish costs $18 and could feed 3 people.   Appetizers are ALL horrible. Definitely split a meal if you get one and try to not eat here if you can and stick to the boots and beers here."}
{"text":"The best place to drink German beer...hell, its a good place to drink any kind of beer!  The glass boots are a hoot and lots of fun and a great way to get your friends...friendly.  The foods pretty good too...albeit pretty heavy German-kind of stuff.  And make sure you catch the regular Polka bands!!"}
{"text":"My only experience with this place is when we stopped in for a couple of drinks, so I can't say much about the service or food. And to be clear, the bartender was great. She was so sweet and friendly.   My beef with this place is the older man who yelled at us and LITERALLY chased us out of the bar, well before 2am. We came in with a group of about 6 people and we were a perfectly respectful and friendly group. Maybe a little noisy but, we didn't spill or break anything, none of us got sick, and none of us got into a fight or anything. We were tipsy but not belligerent.   We each bought one beer and went up to the pool table to play a couple games. At around 1:30 am the bartender came by and told us politely it was last call. I think two people from our group went back and got one more beer. We were not belligerent or overly drunk. At around 1:45 she stopped back over to where we were hanging out and finishing up our night and told us the bar would be closing soon. Gave us a \"ten minute warning.\" No more than TWO MINUTES LATER this older man came over and started YELLING at us FULL VOLUME to get out of the bar. We calmly said we were finishing up and heading out, no problem. Some of us had barely even started the beers we had just picked up from the bar!!!!! But we didn't want to cause any trouble. So we started picking up our empty beer glasses and bringing them up to the bar so that she wouldn't have to walk over to grab them all. The old man returned and started yelling at us again \"THE BAR IS CLOSED! YOU HAVE TO LEAVE NOW! LAST CALL WAS A HALF AN HOUR AGO!\" (it wasn't...) \"TIME TO LEAVE! YOU CAN'T HAVE ANYMORE DRINKS!\" etc. etc. etc.  Then he snatched the glasses that we were holding and trying to bring over to the bartender straight out of our hands, very aggressively, causing a couple of them to fall and break.  We were like, \"woah, dude, we're leaving, sorry, just trying to hand these to her\" stuff like that.  Then he PHYSICALLY PUSHED US OUT OF THE BAR. While yelling the whole time.  Please fire that @$$hole. Seriously. Before he chases all of your business away. Or literally physically pushes it out of your bar. Lol."}
{"text":"Came here for their winterfest where they had a special schnitzel, strudel, and stein deal and was severely disappointed. The place is decorated super well and has a really fun atmosphere but regardless of how much I wanted to like it, I couldn't. For starters the service throughout the whole night left something to be desired. Even though there was no wait, it took about 10 minutes before someone realized we needed to be seated It took over 30 minutes before someone approached our table to even give us water/ take our drink orders.  The food was also very subpar- the only redeeming quality was the huge portion size but even that didn't make up for the lack of taste. Even the complimentary bread-y pretzels they had tasted like they had been microwaved. All in all a very disappointing meal.  The only reason I could conceivably see myself coming back here would be to get the boot of beer with friends- other than that there's so many better restaurants in Madison I would rather eat at."}
{"text":"The Essen Haus is one of my favorite Madison memories.  The ceiling and walls are covered in bier steins and the wait staff runs around in lederhosen.  The manager is a little nuts during dinner rushes, but the Rahm Schnitzel makes up for it.  It's absolutely delicious.  Of course you can't forget about the infamous boots and the wonderful bier selection they have.  Come, get tipsy and enjoy the live polka band.  Just don't get too angry if they don't play Roll Out The Barrel often enough or you'll find yourself outside looking in!"}
{"text":"Gimmie the boot! Gimmie the boot! Biggie woulda been singing his praises of the Essen Haus' big 'ol boot fulla beer if he were still here. Reasonably priced, das boot can be filled with one of the Haus' wide variety of German Weiss, I sprang for the Manolo Alligator boot (aka the best): Hacker Pschorr. I felt nice and warm by the time my warm kraut and knockwurst arrived. Good texture and flavor are key in any German dish, and there was no disappointment here. The not-too-vinegar-y kraut was crispy and conformed to the knock nicely. With such an upbeat, lively atmosphere and staff, how could I not give it a 5 star? Dieses Boot ist für sie, Biggie!"}
{"text":"I agree with Adam V. completely.  We dined there today, at 3 p.m. The food is not authentic at all. I lived in Germany for a few years.  We had a coupon from the Bucky book. ($15 off of $30) I ordered jagerschnitzel. He ordered the munich special.  The pretzel & mustard we got before our food was the best part of the meal! The German potato salad was runny/no flavor with absent bacon.  Spaetzle was ok. Sauce on schnitzel was not homemade.  Pickled beets treated like cinnamon.  The entire meal was terrible. We had 2 beers also.  Our server was nice but she seemed like she smoked a little pot before her shift...a little slow. Our bill was $36 after the coupon. Place may be good for beers in a group if everyone likes polka music! Which I do. I'll never go back.  HUGE disappointment."}
{"text":"I haven't been to very many German restaurants but the few I've been to Walzwerk and Suppenkuche in San Francisco are SO much better than Essen Haus.    We ordered the Rahm Schnitzel (breaded pork tenderloin) which was ok but the mushroom sauce tasted like they had melted a whole stick of butter and poured it all over the pork!    The Jaeger Schnitzel (non-breaded pork tenderloin w/white wine sour cream gravy) had no flavor and wasn't good at all.    Both dishes came with Spaetzle (noodle sidedish) which I've never had before and didn't care for at all!  The Red Cabbage side was actually kind of good and interesting.  Kind of tasted like it had beets and a little bit of cinnamon or nutmeg.  I think it's too overpriced for the poor quality of food they serve.  I can't see myself eating at this place again.  Drinking beer maybe, but the food...absolutely not."}
{"text":"This place is AWESOME.  Love the beer and foods!  The only reason why I gave it a four star instead of five is because they are understaffed on Friday and Saturday nights but the ones who are working do a terrific job considering their workload. Basically, this place can be summarized as DASSSS BOOOTTT"}
{"text":"went there for dinner with an acquaintance during an business trip.  Had the Munich plate with consist of sausage, pork veal and some sort of chicken sauté with veggies. I would say the sausage is the best. I also has the liver soup with just some salty broth with liver meatball.  The environment is well fit for the German themes and great selection of beer. I would not come back just for the food."}
{"text":"Our first time there was not pleasant. We both had clam chowder, the fried cod, and parmesan fries. The clam chowder was chewy... The fish was soggy and cold... The fries were decent.  The service was poor... Tried a beer and did not like it, told the waitress and she did not care nor take it off our bill. The atmosphere is not for us. Will not be going back."}
{"text":"Giant boots filled with beer, giant pretzels with cheese, live Polka music, college servers in dirndls?  I can't think of a better place to act like a Deutschbag."}
{"text":"Please god, show up at least semi buzzed so you are distracted by the filth that is the Essen Haus.  Then order up a boot of beer for you and your friends.  Skip the food in general, but the soft pretzels will do in a pinch if the copious amounts of beer have endangered your stomach.  the good:  their excellent selection of German beer, boots of beer and kitschy polka bands the bad: everything else, including the kitschy polka bands"}
{"text":"I'm so torn about how to rate the Essen Haus. I've been there twice this spring, both times with my family. Both times were for live music and drinks, but we only had food the second time.  The atmosphere, in my Wisconsin-raised, German-American opinion, is SUPER FUN! I love polka, my mom and dad love polka, and I love to drink beer and dance around with them. It's also super fun to take your family somewhere where you know they're having a blast.   Service is pretty good too, at least in my experience.  However, in my Wisconsin-raised,German-American opinion, the food is just not very good. In fact, it's kind of awful.  So, as most people have said, skip the food and go for drinks and dancing only. How does this translate into a star-based rating? Well, the atmosphere is a 5, and the food is a 1, so how bout we call it a 3? But really, bad food aside, the Essen Haus is so. much. fun.   And, like it or not, the musicians that play in the Essen Haus's featured polka bands are devoted to their art and extremely talented musicians! Maybe you have to be a native Wisconsin-ite to truly appreciate it though."}
{"text":"Wisconsin doesn't have good German food in general, but this place has some of the worst. My impression of that one severely overpriced jaegerschnitzel dish was a dried tiny piece of cutlet with surprisingly decent red cabbage and spaetzle that tasted like fried crickets from Mainland China. The liver dumpling soup's just one giant bland liver ball sitting in there and most of their other food items aren't that great, but you really shouldn't be there for the food anyway.  What's seriously redeeming about this place is the beer selection. I've had a couple European buddies of mine complain about the beer being watered down, but they have a decent selection. The atmosphere is seedy and the place can be a real dump (yes, it is dirty), but it's a fun place to take your friends on a birthday party just to laugh, drink (I've yet to try the boot), joke, and polka.  So basically no stars for the food and two stars overall because of a decent beer selection (watered down by a lot) and the fun kitschy atmosphere."}
{"text":"Fantastic brew pub! Excellent beer, friendly staff and incredible polka band. Everyone really seems to have a great time at this spot.  I only had beer there, not their food so I can't review that. As far as their beer goes, it's great! You must drink from the boot however. ;) Great place to go with a group of friends and get drunk.  You must like German style beer to appreciate."}
{"text":"HOW CAN ANYONE NOT LOVE ESSEN HAUS?! I have no experience with the food, but between boots of beer and polka dancing, what else on earth matters?  And if you're not in a beer-boot-mood, the other drinks are pretty cheap too.  Also the bar is HUGE!"}
{"text":"Had dinner at the Essen Haus a few weeks ago with a bunch of friends.  I've been going to the Essen Haus since they opened. (Usually in the fall or winter. Cold weather makes me want German food)  Great selection of German Bier. Good food. Nice atmosphere.  Our waiter was named Yazem (I think I have that right) and he was very efficient in his service and had an OUTSTANDING knowledge of the bier selection, and brought samples for a few members of my group who had a hard time making a decision.  (I like the DAB dark and the Spaten Optimator and  Fransizkaner  Dunkle or Weiss myself)(And in season, any variety of Oktoberfest)  Dinner was excellent. I particularly like the Jagerschnitzel. Other meals I've had that I really liked were the Schweinelendchen in a Pfefferam Sauce, and any of the other varieties of schnitzel.   One of the soup options is liver dumpling soup. I don't like liver, but I like the liver dumping soup and I always order it. I also always get a side order of red cabbage.  As an after dinner drink, I recommend the Apfelkorn liqueur."}
{"text":"The food is not very good, but that's not what this place is about. It's about drinking a lot of German beer out of a giant boot in a rowdy, crowded place while listening to a live polka band. If that sounds fun to you, then you'll like the Essen Haus."}
{"text":"Pretty unique experience. Copious drinking, comfort food, and polka brings together a really odd combination of college kids, retirees, and yuppies. Yummy selection of German beers.  Come with a group that knows how to play the boot passing game! It's really fun! They also have a giant stein that holds something like 3L of beer."}
{"text":"Fun place dine for all.  Excellent german food and of course much beer to choose from.  Don't forget to get your boot or mug.  Also have a great dinner you can work it off to some great polka music in the evening.  If you never been here you must stop.  I know you will have a wonderful experience."}
{"text":"Great German restaurant in Madison. Excellent beer selection and the food is top notch."}
{"text":"I actually insisted on going here because my husband spent some time in Germany and I wanted to have a little German experience of my own. He recommended the Jaeger Schnitzel, which I went nuts over. I'm not a huge beer fan so I didn't get a boot but I had fun watching every other table enjoy theirs. The environment was really neat. Watching people polka dance was quite an experience as well."}
{"text":"Went here on a trip for my friend's bachelor party and it was what a beer hall should be.  Frauleins, polka and great beer.  Didn't try much food as it was later in the evening, but being able to get a burger for $3.00 while your group is polishing off 8 boots of beer is always a winner."}
{"text":"This has got to be one the most fun places I have ever been to in Madison. It is all about the German Heritage in Wisconsin! They have live polka quite a lot. A ton of fantastic German beers and a ton of other options for you! The big Steins hung on the ceiling keep you interested and looking around. Their outside seating area is great in the summer with the nightlife of Madison. One of the most cultured and coolest places to have a new and exciting experience."}
{"text":"Beer, beer, beer! Beer is top notch. Everything else...food, service, liquor is second. Come here expecting to drink a beer out of a giant boot, not for any other experience. Inconveniences can be overlooked due to the general ambiance of the place. They REALLY could use some improvement with their servers, however."}
{"text":"Overall, this place was very good.  I ordered the Wienerschitzel and it was the best I had had in a long time.  Waitress was top notch, entertainment was fun, and I loved the atmosphere of the place.  We were visiting Madison WI from Illinois.  Wish we had good places like this one!"}
{"text":"Oh man.. I really wanted to give it a higher rating but the food was so disappointing!   I came here with a group of friends on Friday night for dinner and drinks. Almost all of us got Friday fish fry. The fish was soggy and way too salty! It also tasted like they've been in the freezer for way too long coz the meat did not taste right They also had various types of potatoes.. and I got the potato pancake. It was pretty average. The one thing we all like is the pretzels they gave you before the meal! The sauce that go with it was perferrrrct. Almost like a wasabi mustard taste. Idk. I want to try some real german dishes next time and see if there are any surprises.   On the other note, I did like the beer. I mean you get a 1/2 L for $5 or sth.  I got spaten lager..little hoppy, little sweet and really refreshing. I would get that again."}
{"text":"Good beers and great German foods. We had to learn all about the traditions and power of the das boot! We were smashed when we left but had a great time.  The steins hanging everywhere make for great eye candy."}
{"text":"Descriptive phrase: das a big boot.  Came for the Boot, stayed for the Boot.  Get some friends, sit outside in their biergarten or inside in the kitschy old German bierhall. Order a real German beer in a glass boot. Proceed to play the game.  You'll get drunk, you'll eat lots of free popcorn, you'll laugh, you'll glub, you'll love it."}
{"text":"This place was so dirty it made me sick.  If I would have stayed more than ten minutes I would have needed a shower.  Has a health inspector actually signed off on this retched place?"}
{"text":"We went here just for the German beer and not the food. It looks like what I think a German beer hall would look like. Every spot on the walls to ceilings if filled with collections of salt in pepper shakers to beer tap handles. It's dark and woody with cafeteria style chairs and tables which is not authentic. It's two rooms sit side by side with a bar in both. It's old looking and not the cleanest with over flow stuff stacked on chairs and tables. It has flat screen tvs that can be seen from any seat you are at.the beer was good and served in large heavy glasses. It's a bar version of house on the rock with all the various collections. I would go here for a German beer experience."}
{"text":"WOW!!! I was excited when I saw this listing! Madison is one the greatest places on earth, and this quintessentially german restaurant and tavern lies at the heart of Madison's rich german-american culture.  Great german food and pints of ale are served in a rustic bavarian setting by lanky lederhosen-laden lads.  You can dance and frolic to folksy german accordian music or knock back a few swigs off the old boot with your friends- enough to make any buxom beer wench look like a tasty schnitzel!!!"}
{"text":"Pretty cool German restaurant/beer hall.  It's a really big place and they have a lot of outdoor seating. They've got 16 imported German beers on tap which was awesome and the prices were really cheap ($3.50 import pints) but they might have had a special going on  -- I went on a Thursday night. I didn't try any food so I can't comment on that, but it's a cool atmosphere to drink in. The only reason why they don't get 4 stars is the bathrooms -- they were horrible. It reminded me of the bathroom from the episode of \"Are You Afraid of the Dark?\" where the water zombie attacked the kids in the basement locker room of the old school pool...and if this scene isn't burned into your mind from countless nightmares....the link is below (around minute 19). But yeah, the bathrooms are nasty.   Pros: ton of imports, great beer garden, cheap prices Cons: bathroom that could potentially house a drain monster  http://www.youtube.com/watch?v=hoi3GuxiA7A"}
{"text":"As a fun place to meet a large group of friends and drink good beer the Essen House is hard to beat. If polka is not your thing, the music can get a bit old but after a boot of drink and a few pretzels with mustard even the musically hardened can have a great time. Also where else can you go and enjoy liederhosen any day of the week? It can tend to be a bit overcrowded but that is every bar on or near campus."}
{"text":"Recently visited again and tried their patty melt.  For some reason they put lettuce and tomato by default.  Come on ... a patty melt with lettuce and tomato?  It was quite a mess and not very good.  Their soup was excellent though."}
{"text":"Came here with a rather large group after my college graduation. We had made a reservation for 6:30, but because the place was so packed we weren't seated until about 6:45. That was okay though, we had been served lots of beer so we didn't mind too much!  Service was good. Very fast and you could tell the servers were working very hard to keep their tables happy. We also ordered a boot (of course) which was super fun. I'd definitely come here again just to get some more. The food was meh. It was way more expensive than I expected, and way more expensive than it was worth. I ordered the wiener schnitzel and it was cooked well. I could have used a bit of sauce with it though. The potatoes were also pretty bland, definitely needed more seasoning. Others at my table enjoyed their food too, but no one was wowed.   So definitely 2 stars for the food, but 4+ stars for the ambiance. This place definitely takes you to Germany. It's very fun. Unfortunately the polka band started right when we were leaving but I can see how that draws people in. I will definitely be back some time to drink some boots and listen to some music! I will probably skip the food next time, though."}
{"text":"I really like the place and the live music is lively. The only downside and it' s a major one for me is that I didn't get anything to eat ! I am a Vegan and even after requesting to not put cheese and cream in anything, my food had both. The entree I ordered had no salt in it which was extremely surprising. I had only finger fries. I really liked the ambience and the music but in terms of food, this place was a huge let down."}
{"text":"This place is heaven! The food is really authentic and it walks that fine line between genuine and kitchy really well. Yes there's polka music and yes the servers wear traditional German clothing but it's not too much flare. The food here was amazing. Since the portions are so large, we split 2 entrees between two people. We started with beers which the server was very knowledgeable about and really enjoyed the pretzels + sauerkraut and spicy mustard that we were brought early on.  The salads that came with the meal were also really great! Get the Deutch salad if you can. The carrots/beans/slaw were really different and fresh. The brats were yummy as were the accompanying German potatoes. We also really liked the Schnitzels. I didn't think I liked German food before eating here but now I love it! To finish our meal we shared the most delicious cheery strudel.  Essen Haus is a must if you're visiting Madison. It's really close to the lake too so in the summer time, it's a nice meal to incorporate into exploring the area."}
{"text":"\"Alles hat ein Ende nur die Wurst hat zwei\" Translation: \"Everything has an end but the sausage has two\" This is one of my favorite German beer drinking songs and is a perfect song for the Essen Haus.  I have many great memories here, and some I cannot remember! This is a quintessential place to take friends from out of town no matter the age or amount of guests you may have.   There's plenty of room here for all of your friends and family.  Having lived in Germany this place is authentic.  The beer and atmosphere is the definitely the draw, but the food is decent, and live music fits the bill.  Who would not be impressed with a boot of beer?  Impressive beer menu, so plan on staying awhile.  Check the website or facebook page for the polka bands.  It's still fun either way, but dancing the night away is a must if you live in Madison. Just remember to get a ride home... you'll need it! *** How could I forget to mention the wait staff are all dressed in traditional garb?***"}
{"text":"Had a blast here!  Ended up meeting a few friends here to start off our night.. let me just say I've never been to a German bar but I'm happy to say I have now! Met our group at a table by the dance  floor and stage, and they already had a boot going around the table. First time drinking out of a boot, and I made the mistake of setting the boot on the table.. oops. Our group ended up getting 3 boots, I ended up watching people poka dance, as well as me getting dragged out to the dance floor to poka dance. I'm sure it was entertaining.   Over all, a fun time at Essen Haus!"}
{"text":"Came here for a friends birthday. I can only speak to the drinking aspects of this place, haven't had their food yet.  This place is definitely fun, and everyone is so friendly. It's a German style pub and the whole thing here is getting a big group and drinking as many boots as your party can. Every 3 boots you finish, you get some sort of prize (tshirt and hats are what we've gotten so far).  They also have rules to the boot drinking. First, the boot can never touch the table. You take a sip (how big is up to you), then pass it to the right. If you finish the entire boot, the person to the right(?) of you has to buy the next one! Once someone is chugging to finish the boot, everyone at the table starts drumrolling on the table with their hands to encourage the completion of it! This is where it got super fun, as the entire bar gets in on it and cheers!    There was also live music, very German and folksy, it was enjoyable. They also have free peanuts and popcorn, just make sure not to make a mess.  This is my third time in about 2 months, and every time I come here it's been a good time. Would recommend!"}
{"text":"Had Jägerschnitzel and Schweine medallions in Rahmsoße. The sauces tastes like cream without any developed flavor. Spaetzle has cheese and some sort of breading in it which is not Original. Diced Onions in everything which is also not original. Not authentic tasting. Being From Germany, unfortunately I am not coming back. Too much money for the wrong taste and texture. Our waitress was quite friendly. Atmosphere is nice. Many people seem to come here and like it but not knowing this is not original German food.   Erwartet als Deutsche hier evtl besser nicht zu viel. Es ist ein ganz gutes Restaurant aber geschmacksmässig eben nicht deutsch. Anscheinend kein deutscher Koch in der Küche. Die Bar ist aber schön."}
{"text":"The food is rarely perfect, but it's fast, warm, and if youre looking for a place you can drink at 9am and get some tasty stuffed french toast you can't go wrong with the Essen Haus.    A particular dirty pleasure of mine is their cajun benedict... the eggs arent always poached soft and can be over cooked, but when it is they always fix it."}
{"text":"This might be the best place to drink in Madison. The fact that it doesn't have a five-star rating on here is a travesty.  It's a restaurant-style place more than a typical Wisconsin drinks-only bar. You're at long tables or booths. It's not a dive bar. It's gonna be a little pricey. It's gonna be pretty damn loud. Come with that in mind and it's the best."}
{"text":"Where else in Madison can you chug down a full boot of beer as people in kilts egg you on while pounding furiously on the tables?"}
{"text":"Let me begin by saying \"German food has never been my favorite.\" This did nothing to change that. It's not bad, I just think it tends to be bland.  We went to Essen Haus fairly early on Saturday night. There was a good-sized crowd. It's a party atmosphere with music and beverages. The decor is dark wood and feels a bit dated. Our waitress was fun, friendly, and a sheer delight. She was definitely the high-light of our visit.  There is a decent selection of German beers on tap. I started with the Franziskaner Dunkel Weiss. Prior to taking our orders, our waitress brought out two soft-pretzels served with beer cheese. It was OK, but not great. For dinner, we ordered the Schweinelendchen in a Pfefferam Sauce and the Steak Sandwich. The steak sandwich isn't German, but it was a tasty ribeye steak with diced onions, peppers, and pepperjack cheese on a toasted hoagie roll. Our waitress recommended the batter-dipped french fries which were crunchy, greasy, and yummy. The schweinelendchen was served with picked vegetables, bland spätzle and a tiny portion of red cabbage. Very German.  I enjoyed the steak sandwich, I enjoyed our server, I imagine if I liked German food more, I would have enjoyed the rest."}
{"text":"Talk about disappointment.  We went here last summer expecting a great german meal.  My family is German and we enjoy trying German restaruants for a taste of home.    The food was not good, the place run down, and overall gross atmosphere.  So sad.  I wish someone would come in an fix it up.  This place gives German restaurants a bad name.  Make your way to Chicago for some great German food."}
{"text":"A bonus star for the German beer, which is really quite good.  Apparently a Madison institution, we came here on a Thursday  night.  Really loud crowd on the patio where we ate.    I loved the idea of the beer in a boot, but no one in our party was brave enough to get it (is it one of those things that you're supposed to share or just do yourself)?    My friend apparently always gets the burger when he comes and enjoys it, but the rest of us were feeling adventurous, and paid for it as well.  Not only are the entrees expensive for Madison, but they're somewhat strange and not that good.  I did enjoy the free pretzels that came, but I did not enjoy the liver dumpling soup.  It's probably important to specify the liver part of it when you say dumpling soup.  I'll take some of the blame on not asking what kind of dumpling soup, but I was really expecting some sort of dough, not a ball of liver.    I had the veal, which was extremely thin and somewhat tasteless.  Gotta say, my friend's burger looked really good.    I would come back to drink, but definitely not to eat - which I suppose is what everyone else says as well."}
{"text":"Worst hostess I have ever experienced.   The table was extremely uncomfortable for two team members with me because they have knee issues and the table was squished in a very tight corner.  We tried desperately to find the hostess, but could not find her.  We moved one table over and saw her coming towards us and we flagged her down to see if we could sir at the new table.  She was infuriated; slamming menus down on the table she was seating guests at and we could hear her complaining about us to them while we were trying to get her attention.  She proceeded to speak nasty with one of my team members saying we could NOT do that because it was a different server.  We tried to explain the situation and we're happy to sit anywhere but she stormed off in attitude and disgust.   Keep in mind, we all work in hospitals and have high stress jobs- I'm not under cutting her job by any means but I am trying to point out that moving to a new table is not the end of someone's life.  This initial reaction ruined our experience and we were slightly embarrassed for her.  Needless to say our waitress was very kind and understanding.  I would rate her a 5, awesome job!"}
{"text":"I really enjoyed the crowd here -- it was a nice mix of undergrads, graduate students, professionals and older couples. Service was prompt and friendly. Also, polka is -- dare I admit -- a bit of a \"guilty pleasure\" of mine so the music hit the sweet spot as much the giant boots full of beer."}
{"text":"We came to this place to drink out of the boot.  And that we did.  Upon receiving our boot, I was dismayed to find that they no longer use glass boots.  They claim that too many people were making off with the boots despite the $50 deposit.  Huh...are the boots really that expensive?  My guess is that one too many drunkards had to be rushed to the hospital with a broken foot and the owners decided that it would be a public service to the residents of Madison to suspend use of the glass boot and replace it with a lame plastic one.  Anyways, other than the boot, we ordered some cheese curds (they weren't quite what we expected) and the reuben dip, which is just what it sounds like.  Minus the Russian dressing of course, which I still think may have been in the recipe even though the menu makes no mention of it.  I think I felt my cholesterol rise while sitting there in the bar.  The polka band was playing and that was cool I guess.  If you are into polka that is.  If you are not, you would probably want to shoot yourself.  But I was into polka that night, which made it much more fun for me than if was not.  Woo Hoo!"}
{"text":"Great place to go on Thursday nights.  Its packed so you have to go early but they have half price boots with popcorn and peanuts- what could be better. I've never eaten here but have heard the food isn't very good"}
{"text":"1 Liter Steins and 2 Liter Boots of several good German beers.  Seasonals were all Octoberfests.  Had the Hofbrau and it was fantastic.  Food is a mix of traditional German and American (think steaks and Prime Rib).  The Prime Rib was very good, cooked perfectly, and in typical German Restaurant fashion, lacked in overall seasoning.  The warm pretzels with mustard served to your table when you sit down are a nice touch.  They try real hard, but for me the food just falls a bit short on flavor, largely due to under seasoning.  The beer, on the other hand, is awesome!"}
{"text":"We sampled a lot of sausages - which I thought were excellent and seemed pretty authentically German. The sauerkraut was my favorite part - so delicious. My fiancé ordered the Munich combo and it was meh. We didn't really like any part of it. The sausages are definitely the way to go- but not the one that comes in the Munich combo. Overall a good experience."}
{"text":"Boots, polka dance, and free popcorn... Why not?  Essen Haus is a good place to hang out and feel young again. If you're hungry and need a little something in your stomach before you crank up the volume, the brats they serve come in handy."}
{"text":"stumbled upon this place and ended up having a story to tell all of my friends. very unique decor, steins hanging from the ceiling, bartenders wearing lederhosen, and a bunch of college students drinking  beer from a boot. the night i wandered into this place i was greeted with the best polka music i've ever heard.   a great time just waiting for you at the essen haus."}
{"text":"I went here & only had drinks.  They did have a good selection of beers on tap."}
{"text":"Went to Essen Haus for Easter Brunch. I want to mention the staff before the food because I was very impressed with the amount of people working that holiday (away from their family & friends).  All the staff were courteous, prompt and attentive.  It was very busy with large and small groups and the waitstaff was able to manage each very efficiently.  The service was excellent.  The food was ample.  Prime rib, roasted lamb, baked ham, deep fried shrimp, swedish meatballs and all the sides one could imagine plus omelets made to order (delivered to your table).  It was all very good.  A pleasant surprise was mimosa's served in pint glasses.  Yum.  The only reason I'm giving 4 stars vs. 5 was because of the flow of the food line.  To get to the buffet one had to walk through the large dining area and stand in line next to tables where people were being seated or dining.  Waitstaff and patrons had to constantly cut through while asking people to move aside so they could get through. They were very courteous during all this time.  My recommendation would be a two sided buffet and it be located in one of the side rooms.  The Essen Haus is a large place and you are going to walk regardless of where you are sitting for a service like this, so it would make sense to have the food in one of the side rooms.  All in all, my group was very pleased and satisfied.  Thank you Essen Haus!"}
{"text":"First, I rarely write reviews and felt after my visit I needed to vent my experience.   Well, its been a couple years since I've eaten at the Essen Haus and I was excited and really looking forward to the visit and the food since we had a great time last visit. My wife and I went last Wednesday night and we ended up unfortunately disappointed.   First, the atmosphere- overall, it felt run down. We were seated by the front windows, slight a level step up area, and the carpet was filthy with crumbs and food bits. No one from the restaurant didn't care. The serving station, next to us (in visable sight) had a door tore off and it just looked very disorganized for being out in sight of customers. Sloppy.   The food was mediocre. The pretzels in the basket brought to the table tasted old and dry. Not like you would expect them to taste. The sampler appetizer of sausages was ok. We both had Wiener Schnitzel which was very good (pan fried), but the potatoes that came were extremely dry with some seasoning added. It did not compliment the schnitzel at all.  Passed on dessert.   The service was good and friendly. Our server was also training a new server during our visit.   Felt like a restaurant that Chef Gordon Ramsay needs to visit!  I doubt I will be back which is sad. Im a huge fan of German food, love to eat German food, and go out of my way to find German restaurants when we travel. Not what I would expect!"}
{"text":"To be honest this isn't my favorite place, but my friends like it and it is definitely an experience. The thing to do is get a boot and dance to the polka music on the weekends. Go nextdoor for free popcorn and peanuts to bring back."}
{"text":"The food is really good the beer is great with a huge selection. Had the sauerbraten wth spinach spaetzel and a side of sauerkraut. All was delicious. My friend had a steak with onions. It was huge and cooked to perfection. The German fried potatoes were delicious and it came with mixed veggies that were not over cooked.  They give you pretzels with a homemade hoarse radish sauerkraut and hot honey mustard for dipping to start."}
{"text":"I'm reviewing based on experience of St.Patrick's Day festivities. It was probably about 10 pm and my husband wanted his final beer. Being that I don't drink, my choice beverage was a massive iced tea. As good as standard iced tea gets, but the lively polka music brought me back to my friend's very traditional Polish wedding. Their menu consists of meat, meat and more meat with a sighting of a Portabella burger. Meh. I was glad we ate before we came here 'cause the cuisine is not my scene."}
{"text":"Great time took a group of friends there and we all enjoyed it. Many glasses of Paulander Weiss and some good German food. Loved the kraut the schnitzles and the pretzels with the horseradish dip mmmmmm"}
{"text":"Get a boot and prepare yourself for a good night. Very cool environment for drinking, talking, and dancing once the band got going!"}
{"text":"When the Octoberfest's bands are here it's like a scene from a Cohen brothers movie -bar 3/4 full, dining room 7/8 empty.  But you can't go wrong with their Octoberfest beers and the quirky regulars (patrons that is).  Just come in and have a beer."}
{"text":"My fella and I stumbled upon this place while walking around the capitol area. Loved the beer, the mugs are perfectly huge. Clam chowder was delicious Their meat and cheese plate was delicious. The only thing I had a problem with is my fish fry was soggy. But it was also busy. Got it replace quickly."}
{"text":"Two words. Boot Game. My bladder and kidneys are permanantly damaged from the amount of beer we consumed during these games. And lord only knows how many carbs I took in eating those fabulous soft pretzels they have there. I didn't appreciate this place enough when I was living in Madison."}
{"text":"Visit the Essen Haus for the boot of beer and for the experience. Do not visit the Essen Haus for the food.  The boots of beer make this place tons of fun and unique. Unfortunately, I was expecting much better food than what I had. The Essen Haus food was just okay. After visiting Germany on multiple occasions, I like to think  I have a good sense of what makes constitutes good German food -- and Essen Haus doesn't serve that in my opinion.  Our waitress appeared confused when we asked for Radeberger beer, a popular German import. I found it odd that the Essen Haus didn't carry this since every other German restaurant in the states that I've visited did have Radeberger."}
{"text":"Greatest bar of all time.  Drinking delicious beer out of giant glass boots AND listening to polka music? You really can't go wrong.   You should request  \"She's too fat for me\" because it's the best song ever."}
{"text":"Surprisingly good! This place really has an authentic vibe to it. Definitely wasn't excited about going here but it was a friend['s birthday and he loves the Boot of beer or whatever it's called. The servers were all dressed in their polka outfits(I think that's what its called) something along the lines of Hansel and Gretal would wear...I think. They also were playing traditional German or polka music... I didn't really ask cause i didn't wanna be there.  Service was great! I guess pretzels are their version of bread? But it wasn't bad. The Deep fried mushrooms were amazing!! The cheese kurds were pretty good. Everyone else seemed to love their dish.  My friends did enjoy their meals as well. One of them had some \"African Soup\" he swore it was amazing. They have outdoor seating.   I can't really say anything negative about it.  Would I come back ? Yes  if my friends weren't insistent? Then NO! Place just wasn't my cup of tea.  That being said. Pay it a visit yourself. You might be surprised. Enjoy the videos and pics :)"}
{"text":"The good news is that the Essen Haus is an authentic German restaurant and beer hall. The bad news? German food isn't cuisine that attracts most foodies.  It's hearty and tastes good with bier (German-inspired spelling).  More bier, more better. This review focuses on their FRIDAY FISH FRY.  It's one of my favorite locations in madison for Friday fish.  Options include 3-piece, bier battered, deep-fried cod for $10.95 or All You Can Eat  for $13.95.  It also includes several unique options: liver dumpling  soup, salad or Deutsch salad (a selection of 4 marinated vegetables). Potato choices include Batter-dipped french fries, Potato pancakes, Baked potato, German potato salad or Mashed potatoes.  Choose the liver dumpling soup (REALLY) and the potato pancakes.    To get in quickly, eat early.  To have the most fun, go a bit later. They have live polka music on Friday nights beginning around 8pm.  WARNING: FOOD IS VERY INCONSISTENT.  You'll either get a 4-star experience or a 2-star experience.  We've been going here for fish more than 10 years and this has always been the case."}
{"text":"I've rarely been there without Mike & Jeremy (the first reviewers), and it seems we have somewhat varied opinions.  This is easily one of my top 5 bars.  If a drinking establishment can convince you that you should split 9 liters of beer among four people in just over an hour and that polka is actually the appropriate music for a bar, it must have something going for it."}
{"text":"I've been here a bunch of times and have always had a good time! It's a much different atmosphere than most places I go in Madison, but that's what makes it fun. There's usually live music and some older couples dancing. I've never seen Essen Haus crowded, but there are always people there. The busiest I've seen it is during Stein Club on the 2nd Wednesday night of every month. Even then, though, the main dining room is pretty empty.  The best thing you can do here is get a boot (or 2 or 3) and share with your friends! Two of the times I've been here we were able to get some free t-shirts (1 shirt for every 3 boots finished) and we're up for the challenge of trying to get another.  This place is great for big groups or small groups (last night I came with 3 friends and played cards while sharing a boot). It's fun for just drinking or a heavy meal. On Thursday nights, boots are discounted. Not sure about other specials."}
{"text":"I have to echo what the previous person said. This place can be summed up in three words, binge drinking and polka.  This is where I go, because I am a tourist and am impressed by the giant beer vessels. I recognize that this place has no character, shitty decor, annoying patrons, bad food, and cheesy music... but they have a 3L boot and, as I discovered yesterday, a 5L stein!! That's 10 pints for $50 (which by WI prices is a huge ripoff). But still, 5 liters of beer.  Let's recap the evening, came, drank too much beer, danced polka, and then paid homage to the porcelain goddess."}
{"text":"Good Things:  1. Thursday night half-priced boots of beer ($10 per boot) with a live polka band.  2. Free pretzels and mustard when you eat dinner.  3. Outdoor seating that isn't generally packed for dinner- even though it looks over the parking lots, at least you can be outside! 4. Spill-over seating in the Come Back Inn so there is ALWAYS somewhere to sit.  5. Free popcorn or peanuts for drinking!  Bad Things:  1. Dinner entrees range from about $14-20 and the quality and amount of  food does not make it feel like a very good deal. 2. Very tiny salad comes with the entrees. 3.  Beware of puke after midnight on Thursdays (not the fault of the restaurant but still, watch out).   Moral of this review: Drink boots of beer here on Thursday nights (get there by 10pm during the school year if you want a place to sit) and never eat dinner here."}
{"text":"I have drunk many litres of beer here. I have drunk from the boot.  The items to try: Big soft pretzels with mustard and horseradish. Their liver dumpling soup, with rye bread, an option for the entrees. Unhappily, the spiced prime rib has lost something over the years."}
{"text":"Went to Essen Haus for a birthday party meal last night, and as this was a last minute option, I had no expectations.  Which ending up being a good thing, because it didn't deliver much.  I will say, I was very glad to see they had vegetarian options. I ordered the portabella cap, and while I like mine cooked a lil more, they sandwich had great flavor. However, the bottom of the pretzel bun was so soggy that I'm surprised the sandwich didn't completely crumble. My boyfriend ordered the Deutsch sampler which had pork 2 ways and a sausage with kraut and German potato salad, The total for his? 17 bucks. I found that to be completely outrageous as the plate did not have that much food on it.  My drinks were reasonably priced. I had a .5 Liter glass of Strongbow for 6 dollars which I found to be quite fair.  You wanna know what was just absolutely unforgivable though? The women's bathrooms. They were terrifying! They were disgusting and one of the doors to the stalls didn't lock!  And as it was a Saturday night they had live music...which made it impossible to hear anyone not sitting next to you. Not exactly appetizing when you are trying to have a family meal..  I would maybe stop by Essen for a drink on a weeknight, but I wouldn't stop here for a meal on a weekend again."}
{"text":"They have Hoegaarden on tap! Aside from the amazing beer selection, everyone is super friendly and the atmosphere is amazing. Don't forget about the boots! If your party drinks 3, you get a free Come Back In t-shirt!  The late night menu is superb as well (Burgers+Fries or other snacks for only $3!)"}
{"text":"German food. Giant frikken beers (very good!!), giant food with saurkraut and fried shit, and german everything. German german german and very good!! I don't even remember what I ate but it was delicious!"}
{"text":"I wish I could pronounce the beers here ... This place was aite... your average beers with some german names .. Its def a to do when you come to Madison .. but it was really weird .. When I walked in I felt like I was lost in some Disneyland ride ... I must have came here on a off night there was a weird man who I think was homeless not sure was sitting there and just talking to himself... I came with some coworkers ... We finished our beers as fast as we could and left"}
{"text":"If you're looking for a place to slam down a few beers, that's one thing.  But, if you're looking for a good German restaurant.  The Essen Haus isn't it.   Their restaurant isn't well kept up and, the inside of the restaurant is shabby.  The tables and chairs are the same tables and chairs that they were using 20 years ago. Their service is slow, their beer is luke warm, and their food is no better than average.  They could do a better job of cleaning and maintaining the place.  Madison only has one  German restaurant(the Essen Haus).  And, with no competition, the Essen Haus doesn't have much incentive to change.   If anyone out there wants to start a German restaurant, it would be pretty easy to beat the competition from the Essen Haus."}
{"text":"Went there on a Friday night in March and had a blast. The band playing retro German music was the highlight. Good beer selection and kitchy waitstaff in \"lederhosen\" (used loosely here) were fun. Go for the atmosphere, not so much for the food..."}
{"text":"Came to Essen Haus with my fiance and my sister and her friends.  We went through 6 boots and had a fantastic night.  The prices were moderate, and the waiter kept refilling our water, popcorn and peanuts.  A must visit for anyone in Madison."}
{"text":"Good food.  Manager is kinda of out of control and has no idea what customer service is. He really makes for a bad environment.  I really do like this place and the music is great.  Other than manager great place."}
{"text":"It's not often that a place will try their best not to have you eat their food, but none the less that's what happened. They were adamant about not accepting any take out orders but I assured them I was two doors down at a hotel, reluctantly he agreed after asking me what my room number was several times. I tried to order a burger but before I could name the burger I wanted the server dissuaded me by saying they only have a REALLY LIMITED MENU at the moment and that they weren't the full sized burgers and basically did what he could to dissuade me. Defeated I reluctantly withdrew my partial order since they clearly weren't interested in my business and if I did order didn't want to have spit in my food.   Essen Haus, don't offer a late night food menu if you don't actually want to offer a late night food menu. wtf."}
{"text":"Good college spot and not a bad place for live music, but not much more than that.  I love German beers, food, and pubs, but this one seems to be riding on past success rather than trying to make a real effort (note the half-assed attempt at lederhosen and dirndels for staff).  Beer list is pretty good, though a bit heavy on the big 2 (spaten and paulaner). 1 liter, half liter, and 2 liter boot sizes are all options.  Food is alright, not the greatest German food but not bad.  Bottom line: if you're badly needing a German fix near downtown Madison, then yes by all means go here. But if not, then there are plenty of other options to pick from..."}
{"text":"Well, the beer list is hard to beat, and the great Germian food is fantastic."}
{"text":"This is a non-food review. I've had their cheese curds (ok), but that is all. My friend refuses to eat here since his friend had a less than stellar experience working in the kitchen.  Anyway, the live polka music is amazing. One of the bands who plays on Thursdays is fantastic. They were playing everything we requested so we tipped them well! They have a great selection of German beers. If you've never had beer from a boot, you must do it here. Pass the boot around with your friends for a good time. They give you/you can ask for popcorn with your beer (free).  Oh, and boots are half off on Thursdays!"}
{"text":"The beer was the best part.  Can't help but get the feeling, either this place gets SO much traffic, it's hard to maintain, or owners are taking money out and not reinvesting.  Men's bathroom was NOT clean."}
{"text":"Good food, great beer. My family has been going here since 83. It's a Madison lamdmark"}
{"text":"The Essen Haus offers a boisterous beer hall environment, at least on the Friday night we were in. We took some seats at the bar and also ate dinner at the bar seats. The comfort level left something to be desired for me as the bar and stools were at that uncomfortable height where I couldn't cross my legs and have them fit under the thick bar. I appreciate that they had Dortmunder on draft. It's one of my dad's favorite beers and it's been far too long since I've tossed one back with him, plus a D.A.B. is a one of the few German beers I've found that I really like. For dinner I went with the Schweinelendchen in a Pfefferam Sauce and the Deutch salad, which was listed as a four marinated vegetable salad. I especially enjoyed the bean salad, which was marinated, as were the carrots, but I don't believe the cabbage and lettuce were marinated at all. We were served soft pretzels paired with hot mustard and a home style horseradish (a nice touch) prior to our meal. The pork tips in the Schweinelendchen were somewhat tough and quite dry, maybe they were precooked, and they also tasted of oil. The pork really wasn't enjoyable at all. The cream sauce had whole green peppercorns in it which were softened by the sauce and these were a nice touch. The spätzle was very similar to the frozen egg noodles my mom uses for her chicken and noodles, not the spätzle that most German restaurants I've been to serve. One of the bartenders serving us was very friendly and fun to talk with and we never waited for drinks, plus our food came out quickly. The smaller sitting area to one side of the bar, which I think connected to the Come Back In had a really cool look to me with its dark wood and rustic tables. Hanging out in that corner with a few friends while downing a D.A.B. would make for a nice time."}
{"text":"I didn't go to the Essen Haus much in college because it was far to walk on those cold, Wisconsin nights.  Which basically meant EVERY night of both semesters, which is why I only have one memory of visiting in 4 years.    Now that I'm old(er) and have a car, some friends and I drove to the Essen Haus for dinner because one guy kept talking about knackwurst.  Note: there's a huge parking lot lot on the side of the restaurant.  Unfortunately, there was no knackwurst on the menu.  A friend and I split the schnitzel with the kickass mushroom gravy.  We doubled our order of spaetzel and had side salads.  German food can be hit or miss and although a bit pricey, the portions and the quality sort of make up for it.  Also, I kind of feel sorry for the guys who have to wear lederhosen uniforms so I don't mind throwing them a few extra dollar bills.  Average cost for a plate is $18.  When we first arrived we were seated in what can only be called \"Conference Room B,\" not in the main room but in a very separate, quieter room.  We asked to be reseated and there we were, right smack in the middle of German decor of a big moose head on the wall and a stein the height of a 6 year old.  Several tables were passing around the boot.  I always thought that was a gross, unhygienic tradition.  Essen Haus is a good place to bring out of towners to see the German cultural side of Wisconsin.  So, for special nights only or birthdays because on a student budget, yikes!"}
{"text":"Germans were 41% of the Wisconsin population during the 1930s. They left us this great restaurant with 15 german beers on tap (try the Hacker Pshorr Maibock). The big standards look excellent ... I had the Jaegerschnitzel, sauerkraut and spaetzel - no room for the potato pancakes but I'll be back for those. Everyone ordering dinner gets a bonus pretzel with raw horseradish and hot mustard. This place is a keeper -"}
{"text":"Here's the thing: you do NOT come here for the food. If you're German, you probably won't recognize what's on the plate. It's German-ish American pub food, basically.  And it's not that great. lol   The past two times I've been here, I decided to go the less-German route and eat a fish fry (not memorable), and the kase spaetzle (bordering on gross: and yes, the ham WAS in it).  I was trying to keep from being disappointed. No dice.  What IS great is the atmosphere. There's often live polka music at night, the waitstaff wear lederhosen and underbust wench thingies... and where else can you get a giant \"boot\" full of beer?!  Will I stop coming here?  No.  Will I probably only drink here from now on? Yeah, unless I've got friends who want to check it out who are not from around here.  The parking lot is behind the building, and I'm grateful for its existence. Just don't try to park in it past 7pm on a weekend--it'll probably be full.  Bathroom?  Well, the ladies room is FREEZING. Please explain to me why the coldest place in the building is also the place you have to pull your pants down...  :/  All in all, if you want really GOOD German food, I prefer that place on Monroe..."}
{"text":"A place called \"House of Eating\" in German gives a pretty accurate first impression of what the place is like. It's a Bavarian beer hall, with plenty of beer flowing through its taps where you can have a five-pint boot of beer if you've stopped caring about calories.I came here as part of a social outing, and that was totally appropriate. But you can find plenty of commentary on the beer, but not on the rest.  See, I myself am not a beer drinker, not because of the taste (I find a fresh Guinness complex, creamy, and refreshing as any Irishman) but because of calories. If you want complexity of flavor, go for wine. If you want to get hammered, get a cocktail at twice the alcohol with a tenth the calories. Unfortunately, this made me a very sad customer here. I first tried to order a Negroni, whereupon the bartender asked me what it was. I explained how to make it (equal parts gin, Campari, and sweet vermouth, garnished with orange peel), and he asked me what Campari is. So I got a Manhattan instead. What disappointed in the alcohol they used was made up for with price. Thank god I was able to drown the quality of the liquor with the quantity of the liquor.  But obviously come here for the beer. If you're not a beer drinker don't come here. Go to Merchant or something."}
{"text":"This is the BEST place for German food & drinks. Biergarten und trinkenhallen! There are 36 German beers on tap & many more available in bottles. A full service restaurant; the prices are very fair & the food very good. Boots of beer are being passed around & people are dancing the polka & the Chicken dance. It's like Oktoberfest year round. What a fun & festive atmosphere; the bartenders & servers wear lederhosen & dirndls. Always a polka band on the weekends. I'd suggest this place for any out of town guest! Just a German Mardi Gras all the time!"}
{"text":"Remember a few things and you'll be fine:  1.  Drink good German Bier 2.  Dont eat (besides the pretzels) 3.  Whatever you do, go when its dark so you cant see the filth 4.  Drink good German Bier 5.  Polka 6.  Boots (although I am disappointed they went to plastic) 7.  Drink good German Bier  Lets all be honest, the place is gross.  But their beer is fantastic and the German kitsch grows on you after a boot or two."}
{"text":"Essen Haus was a great venue for our rehearsal dinner! The banquet menu had a huge selection to choose from and the pricing was very reasonable. Essen Haus staff were easy to work with and the wait staff were courteous, fun and paid close attention to our group. Highly recommend!!"}
{"text":"My boyfriend's family dragged me here for a Thanksgiving dinner a year or two ago. It wasn't very good. The food was dry. I don't really like the feel of it either. I much prefer the Comeback."}
{"text":"This place is a novelty. As such, come here any of these apply:  1) You want to drink beer out of a glass boot. 2) Don't mind annoying music playing in the background 3) You want to be served by people in costume 4) You are the type of person who tries anything once!  I've been probably 3 times and never had a problem with service, friendly and the beer/food came out fast. Personally, I do not care for this place at all. The food is just bad, and I love German food. Sausages, spaetzle, schnitzel, potatoes, sauerkraut, I love all that stuff. What is served here is of poor quality.  But sometimes you say to yourself \"tonight I must drink copious amounts of beer out of a glass boot, and clap my hands to the rhythmic tones of a tuba\" and really, where else will you go for that?"}
{"text":"Our party of two visited the Essen Haus on Saturday, October 9.  We arrived quite early, shortly after 5pm and were greeted by a friendly young man.  Upon entering, we first saw the bar with hundreds of beer steins hanging from the ceiling and a tray of crackers and cheeses for the bar patrons.  A friendly young woman seated us in the restaurant and was attentive throughout our meal - not in an overbearing manner, but simply making eye contact in case we needed something.    We ordered the jaeger schnitzel and the schweinehaxen and both were just fine. One of us felt that the red cabbage had a bit too much cloves, but that could probably vary. Our entrees were generous, hot, and priced appropriately."}
{"text":"We had a great time here. Loved the ambiance and the cheerful wait staff in their German outfits (and traditional clothing can turn tacky REAL quick but not here) Loved the pretzels to start and the food was all around really great, everyone at our table was happy. I enjoyed the drink menu and the fun polka band playing in the background.  My only qualm was that I ordered the meat and cheese plate served with \"gourmet crackers\". My gourmet crackers turned out to be a basket of individually packaged saltines. Now, I love me some cheese and saltines but that wasn't what was described. We'll be back!"}
{"text":"Great, authentic German food. Excellent service. My one and only complaint is that there is no reason at all why the polka band needed to be amplified so loud."}
{"text":"I've heard a lot about Essen Haus during my time in Madison and I was excited to give it a try. Admittedly, we ate on the patio toward the end of the night. The service was incredibly sporadic because the waitress was overwhelmed with tables, she was doing the best she could. It took quite some time for us to get drinks much less have our questions answered about the MANY specials they were offering. We ended up taking advantage of a free bottle of wine with the purchase of two dinner entrées. Each entrée was about $18. When the starter soup arrived it was delicious but there was a giant wishbone-type chicken bone in our soup...not ideal. They were very apologetic and offered us a free dessert because of it. Our entrées arrived eventually, after quite a wait, and it was less than delicious. Everything seemed like it was poor quality. Nothing on the plate was appetizing. It didn't even come close to mimicking the amazing authentic schnitzel I experienced on my trip to Europe last summer. The sides were somewhat better but so greasy and mushy that I couldn't eat any of it. I ended up abstaining from dinner because it was so bad. The free dessert we received at the end was a dry chocolate cake. Less than satisfying.  I have heard the appetizers are tasty and it's clearly a popular place to drink. If you're looking for the boot full of beer, this is your place. If you're considering dinner, try somewhere else. Madison has to many good restaurants to eat a bad meal."}
{"text":"Well for German restaurant, it was ok. Sat on the patio and had a table of frat boys drinking and acting up..  The horseradish sauce with the pretzels needed more horse, pretzels tasted like they were from SAMs club..  Salad with dinner, the runniest blue cheese dressing I ever had..  Ordered the Wiener schnitzel, it's is as advertised, \" breaded pork pan fried\" bland bland bland, with fried potatoes?  Come on..  Potato pancakes, burned on the bottom  bottom, nor butter or sour cream, tastes made out of a can..  This is about as far from good German food as you can get and still call it German...  Like a college bar that serves German food..  Not ever coming back... If you want good German food, go to the Dord Haus in Roxbury, wi. Do the drive for an authentic German experience..."}
{"text":"As a bar, Essen can be a lot of fun. Servers in dirndls and lederhosen, an extensive stein collection hanging from the ceiling, a live polka band on weekends, and the infamous boots that encourages group bonding through drinking. For Thanksgiving dinner, however, my experience was lackluster.   With no Thanksgiving plans on actual Thanksgiving this year my BF suggested trying Essen's family-style AYCE dinner. For about $25 per person they'll provide you with turkey, sides, and pie. For two people you get cereal-sized bowls of everything plus some sliced turkey breast and shredded dark meat. For larger parties you get a whole turkey and larger serving bowls of the sides. Pie orders are taken on slice-by-slice basis. We made our reservation about a week ahead for 2:15.  First, I want to say the servers were hustling all day. No complaints about the servers themselves. The hosts and the owners were also going like crazy. Essen was packed to the gills - when we arrived at two the line was out the door.   First issue: the waiting area was very disorganized and it was difficult to push down to the front to check in. Two must be a peak time because, as mentioned, the line was out the door. People were being seated near constantly, but we still didn't get a table until 45 minutes after our reservation. All in all I spent an hour waiting in the cold outside, then under the coat rack near the door, then in a hallway by the banquet room, then awkwardly on a ramp by the bar. Not exactly the best start to the day, but what could be done? Next year I hope they'll space out the reservations a bit more for anyone who makes their way there.   After being seated it took almost ten minutes for someone to come the table for drink orders and to drop off a bread basket - with one cold roll for each of us. They didn't taste like they were fresh-baked. Food arrived not too long thereafter.   The food:  - Turkey: extremely dry even after being covered in gravy. I actually don't mind my meat on the drier side (I'm a well-done lady through and through) but this was chug-a-glass-of-water-after-each-bite dry. I didn't try the dark meat but it arrived shredded, which seemed weird.  - Mashed potatoes: they had some herb in them and did not taste like potatoes or butter. They were real, but whatever seasonings were added were very off putting.  + Stuffing: the savory highlight of the meal. Not mind-blowing, but by far my favorite thing of the spread.  - Gravy: fine. - Yams: quite sweet but kind of disappointing in that they were just whole mushy yams instead of the traditional marshmallow casserole presentation. Unclear if they were fresh or from a can.  - Mixed veggies: nasty, frozen, dry, and tasteless. Looked like they'd been sitting under a heat lamp for hours. I tried a carrot medallion and it tasted nothing like a carrot but slightly like the green beans that were in the mix.  - Cranberry sauce: canned/jellied. Chopped up from its natural cylindrical shape.  + Pie: I went with pecan and it was delicious. I'm pretty sure it came from a box (the crust looked factory-crimped) but I enjoyed it. I don't know if I've ever had pecan pie so I don't have much to compare it to, but in any case it was the best thing about the meal. Served with a small dollop of Cool Whip-style whipped topping.   For $25 I found the whole experience disappointing, especially because it included so many items that were straight from a can or box. My BF thought it was great, and several people leaving were commenting how good it was, so maybe I'm in the minority?   The other thing that I found bothersome was that you couldn't take any leftovers home besides the turkey. I understand this is to dissuade people from piling up their plates then ordering new bowls of sides and boxing it all up to go, but if you didn't get a second serving of something or ate most of what you had from a second round it seemed so silly to throw it away. We had a half a bowl each of mashed potatoes and stuffing from our second round that I crammed into our tiny turkey box when they server went to get our pie, but we had to leave our full first bowl of yams behind. I wouldn't have taken the veggies if you paid me, but if I had wanted them we had the entire first bowl of those as well.   I'm truly curious how many pounds of food went into the trash over the course of their eight-hour Thanksgiving service. So sad.   I will happily return to Essen for their normal bar hours, but I don't think I'll be spending any future holidays there. My disappointment in the meal led me to make my own stuffing, mashed potatoes, rolls, and cranberry sauce the next day to scratch my Thanksgiving itch."}
{"text":"Fun place to be, live entertainment most of the time, food pretty good for the most part. I've had better German but it's usually still real good. Great place to take a big group. Order up a boot and learn the rules of the game."}
{"text":"'I barfed in das boot at Essen Haus'  They sell shirts here that say (something along the lines of) 'I had a boot at Essen Haus'. I would have bought TOTALLY bought one of those shirts... but only if it had my more accurately titled shirt from above.  Seriously fun. Seriously sh*tty beer. Serious polka madness. Seriously sub-par service.  I might be spoiled by living so close to best damn German bar ever (http://www.yelp.com/biz/the-bavarian-lodge-lisle#hrid:mTbzuMp3HU-tduzdQ-_UMA) but judging from the just above 3 star average I still had an 'on par' average experience... but a boot was involved, sooo yay! + puke, because I REALLY wanted to be the one to finish it off... but that would have defo meant me barfing in the boot... which is apparently my faux pas.   I love beer. I'm all for twinks, short jortsand lederhosen. And as if I even had to mention the polka... bc ya know I'm down for some squeezebox and then some, but Essen Haus, beyond being a Mad City tourist attraction, is just okay Still a 'must see' if in the area. I can't say much for the food beyond the peanuts and popcorn (imma have mayjah sodium face manana) but the beer selection is pretty much just sh*tty German \"imports\" and the service goes like this:  Server: What do you want?  You: Some kind of beer.  Server: Okay. Sign for $75 deposit if you break the glass on top of the $25 boot Server drops off boot You: finish boot (hopefully do NOT barf in das boot) Server: Another boot? You: I hate you.  Server: Brings check You: Pay, contemplate polka-ing, but worry about puking on the dance floor and leave... amidst a batch of skeezy bachelorette parties and low budget post-cubicle hell functions.   I don't hate it. I'm happy I went this one time. I'm more happy I didn't barf in the boot."}
{"text":"Fun to take out-of-towners for a boot game and polka.  Big beer list of course. Lots of seating and is connected to the Come Back Inn, which has live music frequently."}
{"text":"The Germans do some things really well, others not so much.  War is a national sport (the division they play in, including France, Belgium, Poland, and Luxembourg,  is ridiculously easy, not like the tougher US, Russia, China league) and high-end sports cars with typical Teutonic over-engineering (\"you know, the Germans make good stuff\") define this European powerhouse.  Beer is something the Germans do well, specifically lagers.  We sampled (quaffed or guzzled would be better words) several of their drafts, and all of them were medicine for my inner goose-stepper.  Cheese curds, found everywhere in Madison, were as good as any.  Food, and romance, are not something the Germans do particularly well.  I had the brat selection, served with three different brats over a bed of sauerkraut  with some fried potatos.  Nothing really special, but as you're throwing back half-liters it almost doesn't matter.  You came here to drink.  Under no circumstances should you conquer a neighboring table."}
{"text":"This is a great place to kick back and have a few boots of amazing German Beer with your friends and co-workers!  I did say boot...you order a giant glass boot of beer...think of it as Cinderella for men!  I also believe it is 5L of beer too. There are some rules like: Remember to keep passing it around and to never let it touch the table.  I think they made this rule, so you drink more.  This is a dangerous rule!   I have never eaten the food here but I would love to try it.  This place is like going to Oktoberfest without paying for an expensive plane ticket to Germany!!!  I just found out that the owner owns the hotel upstairs...which includes two free drinks for every nigh you stay plus you get breakfast at his other restuarant next door...so I will have to investigate this on my next trip here...at least the walk home would only be upstairs!"}
{"text":"This restaurant has great authentic German food. The waiter was very friendly and attentive. He was also very knowledgeable about the history of the building and had great stories to tell. The restaurant its self had great character and filled with antiques. I highly recommend this restaurant to anyone who would like to have a great time and filling food that is filled with German culture."}
{"text":"Great beer and a great place to go with lots of friends.  Loud polka music to dance to (if drunk enough) and gigantic boots filled with strong German beers.  The beer menu is incredible, just be prepared to spend a little on it.  Also, DON'T BREAK THE BOOTS!!  They will charge your card for it and it's a hefty price."}
{"text":"I'm a little ashamed to admit that I've lived in Madison for five years and had NEVER been to the Essen Haus until this week. I feel like I've been living a lie.  First thing's' first: lederhosen. All of the male bartenders and servers wear them and it makes everything good in the world. So much man leg.  BEER. Huge steins full (half a liter) for $4.50. You can go and get pretty sloshed for under $10. If that's not economizing, I'm not sure what is.  Live polka music. Nothing puts me in the mood to party like a little accordion action.   Survery says: Essen Haus is probably not the place I'd go every week, but the next time I need some old time-y German fun, I'll totally be back."}
{"text":"DAS BOOT!!! The beer is the staple that keeps me coming back to the Essen Haus, especially with their selection of authentic German beers. Outstanding drinks and plenty of it, huge steins for little money. The huge boot is only $15 on Thursday night, so happy hour here usually turns into happy late night!! The food isn't bad, sits heavy if you're not ready of used to it though. The fish fry on Friday is pretty good too, all you can eat cod for $10 isn't bad!!"}
{"text":"2 Good beers, not much more to say! Terrible wet chicken wings full of grease and a basket of fries (enough to feed a small country). Outdoor zero atmosphere terrace overlooking a parking lot. Waiter was ok."}
{"text":"Great location in Downtown Madison. Staff was very friendly and attentive. Chef Nicholas is amazing cook! Delicious appetizers! Nice, fairly wide selection of tapas. We had Hoegaarden and  Franziskaner Hefe-Weissbier  Beers. Both were excellent. Finished with burgers and fries. This is our new favorite place to eat in the town."}
{"text":"Well, my credit card statement tells me I was at the Essen Haus on Saturday.  I have a blurred version of the night that goes something like this... 1. Good and buzzed, Annie and friends move the party to the Essen Haus for boots. According to the credit card statement, they cost about $25 each. 2. Annie wakes up the following morning, with a 1/2 eaten slice of Ian's Pizza on the nightstand. 3. Annie and friends return to the Essen Haus to claim left credit cards and a Men's Warehouse sport coat (complete with boutonniere still attached to the lapel from a wedding). Oh, and to eat breakfast next door at the Come Back In.  That's pretty much how most trips to the Essen Haus have gone for me, but here are some tips for a successful time here: -Don't get any food. I had dinner here once with my parents and it was awful. -Dance. Polka. Go on, get out there. -Be good to the staff. They have to handle some of the drunkest people in Madison on a regular basis. -Toe up. In more ways than one."}
{"text":"I love the Essen Haus  I can probably say this statement though because I do not eat here.  If you're going here for the dining experience, well, I feel sorry for you, cause it does suck, and well, it isn't the reason most people are here.    The Essen Haus is good for one thing - drinking heavily, getting really drunk and dancing your ass off to polka music from the live 3 piece polka band that's there on weekends.    If that sounds like a good time to you, I think you'll love the Essen Haus too."}
{"text":"Our waiter was amazing. Helped us pick an amazing prime rib, great salad, choose a better beer and which pretzel dip to eat. After dinner we joined a few friends inside the bar area and danced to polka music for hours. Would definitely come back."}
{"text":"This is an awesome authentic bar and restaurant. Offering fun nightlife and tall flavorful beers! I would recommend this place to anyone new or old to the Madison area. Live polka music really adds a lot to the nighttime activities."}
{"text":"Essen Haus- Just as I remembered it over 20 years ago when I was a student. Okay, I memories of the Essen Haus are all fuzzy with boots and pretzels.  Back in town for a reunion, this was one of the 'must have' stops for us. We decided to go with the 1 liter boot because we are old and lame and the sight of the 2 liter boot gave me chills. Well, my two old friends and I managed to get through three 1 liter boots before heading out to a formal dinner.  The pretzels right out of the oven were fantastic paired with the housemade mustard and horseradish. It was so nice on the patio that we decided to come back the next day for breakfast with a larger group. This time we sat on the Essen Haus porch but ordered off the Come On In menu. Bloody Mary and BLT bagel hit the spot before heading to the airport.  I often think if my days in Madison over 20 years ago. Things change in life but it's nice to see that some things stay the same."}
{"text":"If you want german kitsch, come here.  Waitresses and waiters in lederhosen, with the occasional live german band, also clad in lederhosen.  You can drink from a boot, or a stein.  Beer selection is good.  In general, a passable drinking experience if you're in the mood.  But the food.  18.95 for some schnitzel.  You gotta be kidding me?!  Is there gold in there?  No, I imagine that would have more flavor.  The food is just laughably overpriced, and I'd love to meet a german person that actually enjoys the food here."}
{"text":"Fun restaurant with average, but authentic, German food. Good beer on tap, outside deck, live music, sand volleyball court outside, ample parking. Nice touch is the complentary basket of warm pretzels served with two dips: hot mustard and a sauerkraut/sour cream/horseradish combo. Lots of college kids. (Duh, this is Madison!) passing the boot of beer around. Nice, inexpensive evening!"}
{"text":"Maybe it was because we didn't stay too late, but I found Essen Haus to be a lot classier than I expected. I should mention my expectations were low - generally selling beer in 2L containers does not bode well for a bar in my book. However I was pleasantly surprised to find that the beer was of good quality and the people generally friendly. There was some live music that seemed to run to the polka style and a couple who knew what they were doing on the dance floor. Add the complimentary delicious popcorn to the equation and I'm in!"}
{"text":"I went with some friends to the joint Essenhaus-Come Back In New Year's Eve party and was seriously impressed. The buffet food ranged from good to excellent (the Jägerschnitzel was real veal medallions in a mushroom sauce, and people were raving about the bread pudding), while their wings -- both fried and in a sweet-tangy barbecue sauce, were among the best I've ever had. Their selection of local and other beers is, of course, impressive. It was also great watching the Millennials polka-ing their hearts out to the German band. All in all, a great way to welcome the New Year. I also have to compliment the staff. Since it was an entirely prepaid evening, the staff were getting few tips. Nonetheless they were incredibly polite, friendly, efficient, and considerate. I hope that the management rewarded them appropriately for their yeoman's service all evening. Looking forward to visiting on my next trip to Madison."}
{"text":"Essen Haus is one of those places you try once for the experience, but then never have the urge to return to again. I like the atmosphere and the general decor of the bar. However, I think the beer boots are way overhyped and way overpriced. A 2 liter boot costs between $20-25, but is really only equivalent to 6 cans of beer (yes, we calculated this)...and that just doesn't make much sense to me. Plus, I was paranoid that someone would shatter the glass boot and that we would have to pay $55 to replace it...  This bar is great for large, rowdy crowds - but not so great for my four-person party that was basically edged off of our table by a much larger (and rapidly expanding) group next to us. Our server gave us the option to move to another table, but really? Who is going to give up a table in the middle of the floor for one near the windows.   Otherwise, I thought the live music was great. My friends had a swell time dancing up a polka storm, which served as my entertainment for the duration of the night."}
{"text":"Ok, they had my fav German beer on tap- Franziskaner Dunkel Weiss. Served in a large pilsener glass with requisite lemon wedge. Delicious. Complimentary soft pretzels with dipping mustard, and kraut with sour cream/horseradish. My Kase Spatzle was dissapointing, b/c our server brought the one without smoked ham. I'm sure with the ham, it would have been better. My wife got the saurbraten sandwich, which was very, very good. Large and in charge, tons of hot tasty fries. The beef was very tender, melt in your mouth doneness.  I liked the Bavarian beer hall atmosphere. Beer mugs everywhere. Mural on one wall of a ram with a beer mug. Large mural on another wall with a dude that resembled John Wayne. WTF? Almost forgot, Liver Dumpling soup. Good and salty with a satisfying liver dumpling.  Servers decked out in what else, German traditional outfits. Large menu with schnitzels galore, roast pork shank, all the good stuff. Service was good besides the no- ham slip up."}
{"text":"Being raised by a super Berliner family, I went into this with my expectations slightly lowered, only because nothing tops my Oma's cooking. Needless to say, they did a great job mimicking some nuances of German culture, and I was overall happy with the visit.   My boyfriend and I shared a few pretzels, I had a Weiss beer, we also had the potato pancake appetizer and the Deutsche combo platter. I would say that the best things there are the beer (of course), the service and music, and I genuinely did like the majority of the food. The pancakes were awesome, nice and dense, and served with applesauce (like they should be!). The platter had a Thuringer sausage, a Schwienebraten, and a smoked porkchop, with sauerkraut and potato salad. First off, it was a massive platter, and great to split! I loved the sausage and kraut, and the other two meats were okay (not dry or anything just not my favorite flavor), though the potato salad was too sweet for me. Perhaps the foods I was less excited about are just not what I'm used to in my family's German cooking.   I would definitely recommend this place for anyone looking to have a great beer in a fun environment, with decent food that definitely delivers on size and heartiness.   It's funny how German of a culture Wisconsin is, yet we barely represent the authentic side of it besides with beer and brats. I loved getting to at feel like I was in a cozy pub in Germany for a bit."}
{"text":"You MUST visit here if you are in Madison!! The beer selection is wonderful. The German food is delicious. The staff couldn't be nicer.  And the polka bands are so much fun.  And don't forget to order a boot!!"}
{"text":"So I had planned on going somewhere else for my birthday, but ended up at the Essen Haus.  I'm only writing about this to warn ye, Yelpers, that they clearly are pretty flaky about reservations so reserve with caution.  One big \"woo\" to the Essen Haus for taking reservations... even last minute ones.  I arrive with my party of 15, and find 4 angry separate groups of people at the hostess stand.  In total there are three younger women-hostessess who look like they are near tears, and two men-manager-looking types who appear in charge are being gruff and yelling at customers and their co-workers alike.  I finally let them know that I had arrived and we were sat about 40 minutes after our reservation time. (One angry customer had been there for an hour and a half.)   Ugh. Thankfully I appetizer-ed up my guests beforehand.    Our service was lovely and attentive.  I am a fan of the Optimator Beer -- in fact I have had lovely drinking and polka dancing experiences during times previous.  The food was hellishly horrible.  The cod fish fry was stringy, tough, and inedible.   The potato side dish, be it fries, pancakes, or baked, were cold.    The beer and the polka are the only saving graces of this establishment.  Consume both heavily."}
{"text":"I remember very little about my trip to the Essen Haus except that I paid for quite a few boots and partook in the experience with gusto.  I have vague recollections of dancing to polka music with beautiful ladies, eating deep fried cheese curds (or something like that) and all in all having a great time.  The bar staff were friendly (and encouraged us to enjoy our boots), I don't remember leaving - I know that part of me never will."}
{"text":"Disappointed :( It was dark and dirty. The bathrooms were disgusting. There were small nats flying around and the food was blah.  Our waitress was very nice and the over all service was good, it was everything else that was blah."}
{"text":"I absolutely love the Essen Haus. I can say, with certainty, it is one of my favorite bars in madison. They have live polka music, a huge spread for seating, and a variety of great beer. Since they rely so heavily on the beer aspect of things, their other drinks aren't outstanding, but they do have a quieter, more \"bar-like\" side and a louder, more boisterous side. By getting into the German spirit, Essen Haus succeeds in making me smile."}
{"text":"i love that there are official rules when it comes to drinking a boot.  i.e. these people are my kind of people."}
{"text":"Wunderbar!  We ordered too much food, but that's okay.  It's what you do.  We did not regret it.  Fried cheese curds were tasty and crispy without being greasy.  Friendly, helpful waiter recommended a beer that fit what we were looking for.  His little trainee was quiet but adorable.  Munich sampler was a good amount of food and all quite savory, \"down home\", and authentic.  My wife was thrilled with her spatzel and red cabbage.  Just a good night out, reasonable cost, fun atmosphere."}
{"text":"First of all, wunderbar service.  good beer selection. Great authentic German food.  Wiener schnitzel was crispy and tender inside, potatoes sooo yummy.  Bratwurst, knockwurst, and other sausages were super flavorful.  Fish fry was a big fail.  Wasn't cooked through so it had that transparent raw fish look and texture and was watery so it made the plate watery.  Good salad, great pretzels, and again great service.  A wee bit high priced for some things but would visit again once in awhile."}
{"text":"In the anti-pantheon celebrating the worst dining experiences of all time resides this, our meal this evening at Essen Haus. I use the term \"meal\" very very loosely:  after all, it took a half hour and taking the manager by the hand and leading him to our table before we got our water and, indeed, any acknowledgment of our existence whatsoever.  Perhaps an hour into our reservation, we order our respective meals, with choice of soup or salad.  A good 30 minutes later, we are advised that the clam chowder ordered by several of us is no more. We are left with . . . wait for it . . . liver dumpling soup. We are told that quite a few people ordered it.  After all, it is cold out. No mention of whether they liked its taste or simply used it to warm their hands.  We six all opt for salads (shock). Our waitress comes back 15 minutes later to say that pork and rice soup has been added to the menu. One of the six salads at our table switches to soup at this juncture. Another half hour later, we inquire into the whereabouts of our soup or salads, and are advised that the soup is still cooking and should be ready soon.  We are back to six salads ordered and none served for another half hour. Five standard-fare-with-watered-down-dressing eventually are served.  The sixth in our group got his salad well after we five had finished ours.  Our fish fry arrives approximately two hours after we arrived. Well, *five* arrive; the all-you-can-eat fish fry ordered for the 16-year-old among us never arrives. Apparently, \"all you can eat\" means \"how many can you swipe off the plates of your dinner companions while they are busy trying to flag down our waitress.\"  Requesting water from our waiter required us first to explain that yes, one of those cylindrical-shaped objects (read: drinking glass) would be required as a necessary precondition to being able to drink the water. He continued to look baffled. Coup de grace?  The waitress informs us that the restaurant will comp the all-you-can-eat dinner THAT NEVER ARRIVED and that there would be no further accommodation because the rest of the food was \"fine\". The fish was passable. The service was an abomination.  Oh, and the extra tartar sauce arrived well after all the fish was gone."}
{"text":"We didn't do any essening, just a lot of drinking. Literally entered, ordered boot, drank like I hadn't had beer in years.  The band playing at the time was spectacular. Even before the beer kicked in. Older gentlemen, with an Americana sound, doing ample covers of classic tunes. The drummer looked like John Malkovich, so we called them The Dirty Malkoviches. No idea what their real name is.  The tables around us were friendly and chatty. Our Korean-in-lederhosen waiter was endearing. And the chanting and pounding when the glass boots were finished made for a jovial experience.  Good college-town fun."}
{"text":"If you're going for the food, turn around and walk out.  We used to frequent this German restaurant when the food was still true German.  We have been stung by mediocre meals twice and won't be back.  My pork cutlet in the jagerschnitzel was not breaded, as the menu description stated, and it was very thin and tasteless.  It seemed instead of the mushroom cream sauce there was a prepackaged gravy on top, and I counted 3 mushrooms in it on my plate.  The spatzle was really good though.  The food could have been served hot.  Management, thanks for your response.  Indeed the menu description was no doubt correct.  The meal still fell short, however."}
{"text":"Boots. Drinking games. Polka band. It's where college co-eds come alive and adults pretend like they still have \"the moves.\""}
{"text":"One of my favorite places to eat when I visit Madison, great beer, great food and great service"}
{"text":"I like to drink as much as the next person but Essen Haus promotes binge drinking and throwing up.  The food here is beyond reproach.  With so many choices in Madison why go to some place and force feed yourself beer to the point of throwing up when you can get drinks, better music and better crowd in tons of other bars."}
{"text":"One would expect extraordinary German food in Wisconsin, and Essen Haus disappoints.  The food was good but not excellent.  There was a live performer who demonstrated a breadth of capabilities across clarinet, saxaphone, and trumpet, but impressed on none.  Eh."}
{"text":"First time here. I am German, but I am usually disappointed with most others being too greasy.   I tried a variety plate and was so surprised to be served and tasting what really seemed like my Grandmothers' pickled beets, and bean salad. She passed away about 15 years ago - and my mother and 4 aunts haven't been able to recreate their mother's beets.  Just so delicious --- and the whole meal was just so excellent. My wife couldn't believe I finished it all...including Dessert.  Thank you for the pleasant memory of my Grandmother!  Of course - no one has ever been able to recreate my mother's Bavarian Chocolate, Rum Chocolate Cake. But I think the Essen Haus should try...."}
{"text":"I'm probably one of a handful of Asian gals from Southern California who truly appreciates German culture - took the language in high school and college & have no shame saying that polka music can be pretty entertaining.  So I had high hopes for Essen Haus when I went during a recent visit since it's in the reputed capital of German culture in America.  Alas, the food was disappointing.  So why the generous four stars?  Because their festive Oktoberfest & yummy brats (for just $2.50!!) goose-stepped its way into my heart.    It's also pretty awesome that this place whole-heartedly embraces the drinking (without being drunk and stupid) culture around these parts.  Where else can you go (or at least for me since I'm in SoCal) to see a gigantic boot larger than my own calf full of great German beer?  And you can't give a place less than four stars if they have 26 beers on tap, especially my personal girly fave, Leinie's Berry Weiss.    It's also pretty damn cool that Essen Haus is bookmarked by two other bars/restaurants, Up North and Come Back In.  This was probably one of my favorite joints in Madison."}
{"text":"Went for Fri fish fry but I suggest sticking with the German menu. One of Madison's older restaurants and buildings."}
{"text":"Go for the beer and polka but skip the food!   Also, Maifest & Oktoberfest are always a good time!  Anyone who has been in the restaurant business or worked there knows the owner is notoriously cheap!  Every penny is squeezed out and not much is ever re-invested back into any infrastructure updates. Although in the recent year a new floor was installed, the place just seems really dirty. Things on the wall have a thick coating of dust and cobwebs and it's very dark.  The bathrooms are ancient and there is a smell of sewer when you walk into the restaurant.     The food is expensive and as for being authentic German flavor, there is lots of room for improvement.  We are in Wisconsin so there are a lot of German restaurants here however, Essen Haus in the only one in Madison with this large of a German menu. Go outside of Madison and you can definitely find better.   The best reason to go to the Essen Haus is to enjoy the beer and polka. Great selection of seasonal beers and who doesn't like polka? It's the best thing there!  Also, their Maifest and Oktoberfest  events only get better each year! They put up tents in the parking log and have great out of town bands who play great German music. It's definitely a day of fun. We also appreciate the events being family friendly!"}
{"text":"Went to Essen Haus for a friend's birthday on a Saturday night and had a great time!   Dancing to the chicken dance played by the polka band (per our request =) was a blast! Good beer selection, large food portions, the fried mushrooms were good and cheese curds were so-so. I loved the pretzels and honey mustard (delish!)."}
{"text":"A little slice of Germany. The wait staff was friendly, the Schitzel delicious, and the large boot of beer is a must. Sharing the boot is recommended, but you should try at least once to finish it on your own. The pretzels and horeseradish are excellent as well."}
{"text":"I cannot comment on the food, but the ambiance on a Friday night was great. There was a fun polka band, fun polka dancing, many boots of beer. A good time was had by all."}
{"text":"Great atmosphere; terrible food. Overall, this is a neat place to meet up with friends. The live music is an added bonus. The food needs MAJOR improvement. Had a Ruben sandwich and the homemade sauerkraut was possibly the worst sauerkraut I've ever had. It had absolutely zero flavor, almost as if someone forgot the salt, spices, or whatever else was supposed to be in it. Brought it to the attention of an employee (other patrons had also) - employee didn't seem the least bit concerned and possibly even slightly arrogant and dismissive. The corned beef was standard. The bread was burnt and soggy. German potato salad was okay - not great, not bad. Plain battered fries were not worth eating. The food was VERY expensive, especially for poor quality. I would never recommend the Essen Haus as a place to eat and I wouldn't ever order anything except drinks and possibly an appetizer (if I was really desperate)."}
{"text":"I've been to the Essen Haus four times before, and as a German, I think your food is mediocre and overpriced. But let's be honest, I'm not there for the food. I'm there to drink beer from a boot, and bop to polka music. You know this, I'm sure of it....  So I'm not sure why you were OUT OF BOOTS on Saturday. Where did they go???? More importantly, WHY weren't we offered something else instead of a boot??? Our waitress kept saying she was trying to locate an extra, but 40 minutes into our dinner, I told her to get us beer NOW or we're walking out. She brought us, a table of nine people, a half pitcher of beer and small miller light glasses...  What??? Not even beer steins??? 'They're not even busy!' I thought because there were two open tables near us the whole night, but when we finally abandoned our sad dinner, we walked outside and found a line around the block! I'm so confused. Get your act together Essen Haus. You're no Brauhaus Chicago. :P"}
{"text":"Five stars for beer!!!! They have very great beer. And goes well with their pretzels. But for food, not so much into it... But they do have good sausages. Essen hays is a very nice option to hang out with friends throughout the night."}
{"text":"Who would've thought that the best freaking wings in the world would come from a run down German restaurant in Madison??  They're kind of a fried chicken/hot wings hybrid, and they were FANTASTIC.    Other than that, the Essen Haus was exactly like every other German beer house I've ever been to.  There are lots of sausage choices, German beers on tap, and a polka band is playing.  There's a boot to pass around, and people drunkenly polka.  If this sounds like fun to you, check it out."}
{"text":"Very friendly service here - and for a large group of people, many of the members of which were slightly approaching out of control, this was pretty excellent so hats off to the ladies who took care of us.    The boots of beer are large and appear quickly for sharing.  Tasty pretzels.  The menu itself is pretty standard - I had the sauerbraten sandwich and I guess I was expecting more.  It was a lot drier than I am used to and it seems like it could have absorbed a bit more flavor.  The bread it came on was good and the breaded fries were average.  The husband had the veal schnitnzel and it seemed to be pretty much what we have at our usual place at home.   Average portion sizes.  It was a good drinking place,  though with the live band, it made having any sort of conversation extremely difficult.  The volume was probably at 14 or 15.  Worth trying, though not sure we would put it on our list of must-go places if we make a return trip."}
{"text":"Would have been 5 stars but the potato pancakes were overdone and liver dumpling soup was too salty."}
{"text":"Came here with my sister and a few friends who insisted I have a boot before I leave Wisconsin. The atmosphere was interesting to say the least. Filled with German knick knacks and beer steins. It's a food & pub, so plan on waiting for the dining room to clear out before drinkers only can fill it up.   The night we went there was live polka, a must for any German establishment.   Be thankful the lights are dim, as a previous reviewer mentioned the place is pretty filthy. It's carpeted floors and anybody knows that carpet and drunk people just don't mix. You'd think they would have learned from Waffle Houses.   Countless German beers on tap. It was kind of overwhelming. My favorite is the Optimizer. I felt sorry for my group that I got it in a gigantic boot since nobody else has a fondness for thick malty (and highly potent) ales. All in all, great fun."}
{"text":"Authentic German food, pleasant and relaxing atmosphere, live music, varied selection of light/med/dark beers. Excellent choice!  This restaurant was recommended to me by a nice lady at the Tanger Outlets in Wisconsin Dells. My husband and I enjoy good German food and Essen Haus fits the bill!  I highly recommend: meat and cheese plate, kartoffelpuffers (potato pancakes), Deutsch platter, Munich platter, and the German chocolate cake. All were so delicious. My husbands family is German, so we had a good point of reference.   Staff was friendly, knowledgable, and attentive. Can't wait to come back!"}
{"text":"Run by a Fascist Eeyore, but that totalitarian grump grows on ya!  Food a total sideshow to the beer for the most part, but seriously, what else do you need while watching Madison's classiest babes dance to polka music and inebriated customers sing raunchy Boy Scout lyrics (along the lines of \"There was a man from Eau Claire...\") beyond pretzels and dollar burgers that probably set the management back 5 cents?  I won't deny it.  The Essen Haus is a very strange place.  One of the strangest.  You have to have a certain sense of humor to even walk in the door.  But for all its faults, at least it doesn't try to be some pompous yuppie brewpub.  It is peculiarly and idiosyncratically Wisconsin in all its tacky, bizarre glory.  You will not find it elsewhere.   Alas, it is also part of a dying breed.  This is not what the dot-com start-up generation gets involved in when they create a restaurant.  The world will be poorer when a tasteless generation bulldozes it into Lake Mendota.  And that is cause for an adorable 64-ounce glass boot of teardrops.  My advice is:  feel sorry for the servers, leave an extraordinarily liberal tip, and only go on the weekends.  The mid-week polka bands are for that handful of old farts who saunter in.  Also haunted....  The bouncer gave me an upstairs tour once.  This vast, sprawling building -- part misbegotten compound of greed, part bed-and-breakfast, part beer hall -- is one of the oldest buildings in Madison and was apparently a whorehouse in antebellum days.  Ask to see the amazing storage area upstairs:  basically a museum of the vanishing Midwest.  Boxes full of dead men's steins, paraphernalia of the old immigrant drinking clubs, the decor of \"Are You Being Served?\", and local ghosts.... The bouncer and I both felt a strange chill and heard weird stuff going on in the walls up there.  We bolted down the stairs.  The veteran bartender agreed that he had heard and seen weird things upstairs for years.  The 2-liter glass boots are a ginormous bacterial infection waiting to happen.  But good, solid American fun."}
{"text":"Although we had a reservation, we still had to wait over an hour to get a table. But, I wasn't too surprised considering the fact that it was a Friday night and I was rolling with a party of 24. Lucky for me, I had taken Carolyn B's advice and had made sure to arrive \"pre-appetizered.\"  The food is way over-priced considering it's depressingly low quality. I seriously wonder if my wiener schnitzel is available at Woodman's in the frozen meal aisle. It was bad -- but I was hungry, very hungry. The salad was a joke, plain and simple.  I would have given the Essen Haus four stars purely based on the fun \"binge drinking from a boot set to live polka music\" experience, but the abysmal food quality ratcheted them down a couple notches."}
{"text":"Super fun atmosphere at Essen Haus!    Came here 5 years ago and got tricked into playing the 'Das Boot' game... trust me, proceed with caution!  Then this weekend, I was back in town visiting so my friend took me back here.... this time for actual food and a couple of normal sized beers.  Really enjoyed the cheese curds and Weinerschnitzel...huge portions and very tender and tasty.  Our server was very friendly and the atmosphere was very fun.  My only complaint is that I really wanted to buy an Essen Haus T-shirt to bring back to Atlanta, but they were out of my size in the version I wanted.... oh well, maybe next time."}
{"text":"You take the good with the bad at Essen Haus.  If you want a relatively authentic German gasthaus experience, this is probably the only option in Madison. The food is pretty authentic German fare, if truly mediocre at best. The drinking is the real draw. If you stop here with some friends, order some boots and have a blast.  The lack of 4 or 5 stars is based solely on the fact that the other prevalent factor here is the general stench of urine, vomit, popcorn, and stale beer. No self-respecting German would ever run a place that was not fully \"in ordnung.\"  But once you are drinking and have a few boots of Spaten under your belt, you won't really give much of a damn."}
{"text":"The chicken snitchel was the best! We got a combo to try weiner chicken and the pork chop, next time I will get just the chicken snitchel as the flavors were amazing we wanted to lick the plate!! We also started with the beef vegetable soup which took me back to my youth in England, very authentic. The service and atmosphere was great too the servers wear German outfits. Good luck if you order Das Boot, I thought I was going to die drinking that much beer and 3 of us were sharing it!!"}
{"text":"Went to Essen Haus this evening for Father's Day dinner. They had a cookout going on outside with some very loud (not live, nor good) music, so we opted to eat inside so we'd be able to hear each other talk.   The food was...meh. Someone particular about their food would have been appalled. Someone who is eating to eat would think it was fine. Any run of the mill foodie would probably think what I thought: the food was bland and greasy, lacking in seasoning, but true to traditional german flavors (sour-sweet-creamy-spiced).   The prices were exorbitant. $19 for greasy pork weiner schnitzel with no salt, the breading falling off, greasy spaetzle strings with no salt, and a cream sauce without all the booze cooked out.   The service was fine. Waiter nice, food didn't take too long (why would it for that quality of food). Teaching a two year old the word dirndl and lederhosen was entertaining. The place is definitely kid friendly in that it is forgiving of child behavior, has stuff for kids to walk around and look at before food comes, and a stage for them to mess around on if there's no polka band in residence. No kids menu, but they had booster seats and high chairs. This is not one of those places your kid has to be on good behavior to go to.   I would not come here again voluntarily. Unless it was just to get drunk. Perhaps for a nice date night of drinking so much that I wouldn't mind the food? Or that I would be able to forget lack of sanitation in the bathroom.  Which brings me to the cockroach. Not cool Essen Haus. Not cool at all, to be taking my toddler to the bathroom and see a cockroach just chilling there on the floor.   They mean well, and its kitschy, but it's just not a place one goes to for the food."}
{"text":"Truth be told, I usually don't hang out at the Essen Haus.  I try to go there, but it's so packed, I always end up next door at the Come Back Inn.  No worries, though.  They're basically the same.  I mean there's a door connecting the two.  Great selection of tap beers, questionable music, free peanuts, two pretzels for a buck and various glass footwear from which you can drink."}
{"text":"Wide variety of German beers to choose from. Bring all your friends and pass around das boot.  Take a break from drinking games to polka dance as the live band plays \"She's too fat for me.\"  Come for the drinking experience, but stay away from the food. I'd rate the food 1 or 2 stars."}
{"text":"The Essen Haus is THE place to be on a Thursday night with a group of friends. Why, you ask? Because it is BOOT NIGHT!!!! 2L boots, 1L mugs, and the epic undertaking of the 5L mug! All of these comes at incredibly reduced prices and high quality German beers (this ain't no Heineken!) The drinking of the boots comes with certain traditions and techniques such as never setting it down on the table and always turn the boot sideways when it starts to bubble (important!). Also on Thursdays is a live Polka band, accordion and all! After 10 the bar also has a late night menu of different burgers and fries for only $3.00! So the next time you are in Madison, give the Essen Haus a go!"}
{"text":"Ok, I didn't like this place, but my husband did.  So, split vote!"}
{"text":"Do you have any local beers?  No, we're not a Wisconsin restaurant, we're a German restaurant.  A good one, too. Certainly A-OK. S.U. had the wiener schnitzel, I had a pair of smoked pork chops. Both came with fried potatoes and sauerkraut. I washed the large portions down with a liter of their imported Octoberfest Amber Not bad at all. Wait staff is dressed in kitsch costume, beer steins and German Beer House decorations are everywhere.  We listened to a concertina player playing polkas with a recorded rhythm section. A bit jazzy now and then if you like a polka version of \"Lullaby in Birdland\". Still, you've got to support live music.  We're told that after 9PM and on weekends it can get quite full of students. They have an interesting and inexpensive late night food menu and dance floor.   We lived 10 years in Portland, OR  near a German Restaurant named Gustav's. Never went in once. Now that we're in Wisconsin it looks like we'll need to embrace a few more aspects of German culture. It's everywhere."}
