{"text":"This is my favourite cafe in all of Calgary. My husband and I come here for coffee, wraps and desserts at least once a week on the weekends. I'm a huge fan of the chicken philly wrap on gf wrap, a coconut caramel latte, and a power ball to finish it all off. Their waffles are delightful! Really great menu with lots of vegetarian, gluten-free and sugar-free options. The owner is really sweet and gentle and he clearly works hard!"}
{"text":"Not a coffee person, had london fog instead, I think it's decent. I came to work on my laptop, great atmosphere and wifi. Ordered a classic waffle with strawberry sauce & whip cream (i thought it comes with fresh strawberries, but that's ok), very soft, finished it in a minute lol. This will probably be a regular spot for me now."}
{"text":"This place is gaining more of a following each day. Quaint size and recently renovated a great place for locals to gather.  Customers of all ages frequent. Nice selection of coffee, teas, and smoothies.    There are  seasonal flavours available  for the frappe and lattes.  Enjoy the tasty and heathy wrap or panini. Gluten free and paleo selection  on the menu as well . Fine  young friendly group of staff to serve."}
{"text":"I ordered a Mocha, it was TERRIBLE! It tasted like I was drinking crappy milk with awful syrup in it or just mostly syrup and no espresso. Would NEVER go back here again.. I feel that my hopes were high from the reviews but I really really did not like it. The atmosphere was nice but other than that I did not like it and will not be returning."}
{"text":"The coffee and goods are amazing.  I don't give it 5  stars because the customer service is not great and the place sometimes appears to be a bit dirty."}
{"text":"A good little cafe with good desserts and a small but good selection of breakfast items. Please note: if you are a Bulletproof coffee fan ask them if they are serving real Bulletproof coffee or another brand - because they advertise Bulletproof coffee by the cup, but when I trekked an hour to get there - I found out they only sell the Bulletproof beans and use their own brand of coffee when making a cup. The only place in Calgary that actually makes real Bulletproof coffee as of this review is the Wild and Raw juice bar in Kensington. 

http://www.euphoriacafe.ca/calgary-cafe-espresso-coffee/"}
{"text":"Fantastic!  I frequent this coffee shop. Great service, great people, great food and beverage. Whenever your in Varsity pay them a visit. It will be your local coffee shop."}
{"text":"I have been multiple times since January and have been mentally recording all my experiences so I could write a thorough review and do this fantastic cafe justice!

As you can imagine, Euphoria is a popular spot, both during the week and on the weekends. So luckily it's large enough that there's plenty of tables since the cafe actually spans the length of two stores. The front of the main section features a lot of what I would call \"short stay\" tables. Given that there's a booth seat that spans one wall with small tables and one chair on the other side. While the back has two tables with outlet access and a comfortable chair seats table. The other section features a beautiful fireplace and a large table to accommodate a big study group and outlet access. The Wi-Fi is free, just click \"Connect\" to agree to the terms and conditions. Make sure you stay active on the network, however, or else your access will time out and you will have to connect again.

Known for their Belgian waffles and smoothies, Euphoria really knows how to set itself apart from other cafes. I am taking great delight in making my way through their panini selections. So far I have tried the Philly Steak Melt and Bold Angus Beef paninis. They are so flavourful and pack a lot goodness into one sandwich. The unique blend of steak, vegetables and sauce is enough to dazzle my taste buds and keep me coming back for more! I also love how each sandwich is served with a small dish of vegetable chips. It's a nice addition that makes the sandwich a complete meal and offers just enough to satisfy.

Whether you visit Euphoria in the middle of the day during the workweek or on the weekend, you are guaranteed excellent, friendly service. It's clear that the employees of Euphoria care a lot about their service and take pride in what they do. Even though I'm no longer a resident of the Northwest and so do not have 'regular' status at the cafe, those fortunate enough to have this title can count themselves lucky. What a great public place to work in Calgary! It's no wonder this cafe is called Euphoria."}
{"text":"Great coffee, delicious food and snacks available (gluten free to), good atmosphere! I would definitely recommend, from a quick lunch stop to a 3 hour long study session."}
{"text":"We wanted a Sunday morning breakfast before heading out for a walk.  I ordered a chai latte, and my husband had a coffee. We both ordered the classic waffle.

My husband loved his coffee. They use Rosso beans, and it hit the spot. My chai was not hot enough, and didn't have enough spice for me. I also like a spoon to scoop the foam of my latte, but they only had stir sticks. The waffle was ok but reminded us of the waffles you get at motels that provide breakfast - not much substance. They were not crisp on the outside - I hate a mushy waffle, and the whipped cream and syrup put on for us didn't help. It would be great if I could control how much syrup I put on my waffle. My husband's waffle was not \"complete\" so he was a bit disappointed. 

The atmosphere seems dark to me, although they had some great art on the wall. It was just a bit too crisp for us to eat outside. 

Our barista was not happy to be there and obviously not impressed with having to serve us.

Overall, I didn't find anything here that would make me come back, but maybe I just didn't click with this place as the other reviews seem more positive. 

Food **
Atmosphere *
Service *"}
{"text":"The coffee is fantastic - easily worth a 4 or 5 star review. But the service is so miserable that I just can't do it. It's not even a matter of not smiling. They actually seem angry that I'm ordering a coffee. And I'm a pretty friendly person. It's nothing new. This is repeated behaviour over the course of a few years. I'm amazed no one else has commented on it in their reviews."}
{"text":"Phenomenal service. Friendly, coffee house atmosphere. The Mexican mocha...delectable!"}
{"text":"I had no idea Euphoria existed until I stumbled upon it while going to a nearby business.

The Cafe is a bit small but has a great modern but warm feel to it.  They seem to take pride in their smoothies, there are great options, non-dairy, fruit and veggie, power smoothies.  A large smoothie costs $5.90 or $6.50, which I find to be reasonable.  They were featuring a toffee smore latte, which I decided to try.  Most of the hot drinks are a bit more than $4 for a medium, which I find a bit pricey.  I also decided on a egg salad wrap for $5.50.  Their \"bistro\" is nice because you can have your choice in a panini, wrap or salad form.  They have bowls of soup for $4.  They have a variety of stuffed pretzels, which doesn't appeal to me personally, but it seemed a lot of people in the cafe were eating them.  They also have waffle paninis which look really decadent, with chocolate, strawberries, whip cream.  They also have gelato, at $3.50 for a cup, $4 for a waffle cone, $2 for an additional scoop.  My wrap was made fresh and brought out to me, as well as my latte, which turned out to be huge!  The wrap was pretty straight forward, a bit small but very good.  The latte was delicious, it was sweet but not too sweet.  So I was pretty happy with my order!  The guy and girl working were very nice and efficient.

I cannot believe how much this little cafe has to offer!  I am definitely looking forward to returning here soon to try other things out, like their turtle mocha!  I highly recommend it, I found it to be one of the best and unique cafes in the area!"}
{"text":"Used to be a fantastic and unique place to sit and work for a morning. But there seems to be a change in management. Seating is now uncomfortable and odd (like a fast food restaurant). Also, the quality of coffee has really decreased. It used to be a place to get great lattes but now espresso tastes watered down and they're using cheap soy for soy lattes. So my impression of what's happened since my last review: it's devolved from a great unique coffee shop to that community place where you can get OK coffee (same level as the Second Cup at Crowfoot)."}
{"text":"A lovely cafe with quality drinks, right in my hood?! Whaaaat. Yes, it's true. I never really thought much of Euphoria when I drove past it, but I decided to come by with my friend after hearing rave reviews from her. 

It's AMAZING. Friendly staff, ample space, and tasty drinks and food. I loved their waffles - so dense and loaded with toppings, and not ridiculously overpriced (ahem, Buttermilk...). On top of that, they have a great selection of other baked goods as well as healthy options (even a little supplement section).

I really came here for the Blue-Beary hot chocolate they had for YYC Hot Chocolate Fest, and it blew me away. It tasted fantastic, a little sweet, but such an impressive drink. For those who want something else, they have the standard array of drinks, from tea/tea lattes, espresso drinks, and the like. But, the coolest thing is that they serve the super-trendy bulletproof coffee! I haven't yet gotten the nerve to try it, but it's nice to know where I can get a cup."}
{"text":"gelatto. loose tea. fair trade coffee. local art on the wall for sale. inspiring quotes in chalk on the wall. good first impression."}
{"text":"Such a gem!!! This place was a delightful find! The staff are amazing, atmosphere is really great for studying or hanging with a friend. Tonnes and tonnes of yummy gluten-free options. I went true white girl and had the gf pumpkin spice muffin and it was delish. Rosso coffee. Amazing."}
{"text":"Not to be sassy but this cafe does not induce anything euphoric in any sense. Their drinks are quite expensive as are their baked goods. Staff were friendly (and cute). Aesthetically, this cafe is forgettable and could use more soul searching."}
{"text":"This was my first visit to Euphoria Cafe and I will definitely be back. I arrived around 9am and stayed until just after noon. The atmosphere is warm and cozy with an earthy color palette, so I felt right at home getting some work done. 

The selection in the display case was fantastic! Freshly baked goodies (with some gluten-free options), wraps and sandwiches, pastries, and some very fresh looking baklava...impressive. I enjoyed a couple of drinks and some delicious Umpaqua Oats oatmeal (the \"R U Nutz?\" variety). What was really stunning was the delicious aroma of their freshly made waffles. That's what really made it feel like working from home (there's always something good baking in my kitchen!).

Mornings have a lot of coffee-to-go traffic, and they certainly have a good crowd for lunch as well. I highly recommend this place, regardless of whether you're passing through the Dalhousie area or need a place to park yourself for a few hours."}
{"text":"Okay guys here's how it is!
As a frequent visitor of euphoria, I have a pretty firm opinion of the place. Its cool because the art work is always being switched up, so it's always fresh in there. 
Now, the macarons are perfect everytime. (I love the red velvet, the stuff in the middle is perfect).
The turkey painni is my favorite thing to order, the mushrooms and peppers are always so fresh, topped with just the right amount of sauce. 
Last but not least, the iced coconut chai is TO DIE FOR. It puts Starbucks, Tim hortons, Waves and Second Cup to shame.
Simply put, if you haven't been to euphoria, you haven't had the best yet!"}
{"text":"The service is horrible, and the prices are inflated. They do have a creative menu of hot beverages, and are ahead of the trends with keto beverages. 
I wish the baristas offered better service, and a better attitude."}
{"text":"Have been coming for years.  Coffee is great, menu is extensive for such a small place, and the atmosphere is nice.   The only impimprovement I could suggest is to the owner-  it would be great to have a bit of recognition or chit chat with some of your regulars. Still a very nice guy and I highly recommend this place."}
{"text":"I was able to finally come back to this spot! The owner was wonderful enough to give me a GC for my bad experience with the muffin. Which was not necessary, but made a huge difference. 

My husband and I decided to grab chai teas before our adventure of the day. The service was quick, and the chai lattes are to die for. My husband was super impressed as well. I did notice they have a special holiday drink menu, and there is a almond mocha that i will be trying next time I come here. 

I'm glad I came back, as the tea was yummy. I didn't try the baked good this time, but I'm sure I will. If not, it's still a great coffee place."}
{"text":"Bulletproof coffee is awesome here! Hard to find usually. Really fortunate they have it. Waffles are great here too"}
{"text":"Euphoria Cafe is a great little cafe where you wouldn't expect a great little cafe and that's just where I want a great little cafe to be!

Kensington is excellent, Mission is great, 17th has slues of them.. but what do you do when you need a great little indie owned coffee shop outside of the inner city hoods? Euphoria Cafe, that's what.

It's a cool, trendy looking space and a great place to meet with friends, business meetings, on a date, or any time in life where a quality cup of joe is in order.

They do all the basics and they're not afraid to get creative with the flavour!

I met with a fellow yelper and she told me all about their award winning Peanut Butter Chocolate Latte. You heard.   I was blown away by her knowledge of the little local establishment and she waved me in the way of the sign on the board. Smart signage, Euphoria, you sold me. I'll get it!

Peanut Butter, Chocolate, and Espresso. Those are three of my favourite things ever. If you mix them together the outcome has to be exactly 3x as good as each of the individual ingredients, right? Wrong! It's BETTER. Euphoria manages to harness the synergistic qualities that peanut butter has with chocolate and that chocolate has with espresso and use it to create something special and magical.  I loved how all of the flavours worked in harmony instead of dominating my mug. That is, until I got to the bottom... Holy chocolate peanut butter explosion! Simple solution... If you get this drink. Mix it. :)"}
{"text":"Coffee is good, Bagel breakfast sandwich and Waffles are overpriced and underwhelming at best. 

Bagels themselves were under toasted and cold ( not overly fresh tasting either) and the eggs were premade and cold.

The waffles tasted like soap or a floral perfume. Too bad because they had a nice texture.

Overall we were very disappointed given the high review scores from other guests!"}
{"text":"Euphoria Cafe is the perfect go-to spot in the Varsity neighborhood for meeting with friends for  coffee and dessert.  It's also a wonderful spot to do work!  The wifi is quick, it's usually pretty quiet, and there are lots of different seats to sit at -inside, outside, at a table, on a couch.. you get the point =) 

They have a wide selection of drinks (ie. coffee, smoothies, lattes) and food items (paninis, waffles, pastries, gelato and more).   I'd recommend trying one of their waffles if you want a tasty, filling, snack.  They are pretty reasonably priced and are warm, fluffy, and delicious!"}
{"text":"Super awesome cafe, all coffee organic and very well priced. Goes every other day since it's right across from my house. Have not tried the food, but looks delicious. I really want to know where their cheese-bagel-croissant is from, it's one of the best bagels I've ever had. Great atmosphere, staff, and has a positive energy."}
{"text":"I work in the building so it is nice to have a coffee shop cafe so close. I have mixed feelings about this place. Sometimes it is great and others not so much. I love the London Fog ( it is better than Starbucks) but it takes forever to make and most of the time I do not have time to hang around so I opt for the ready brewed coffee. Today they had a new one called Rwanda which was very disappointing. I was told that it is light to medium but when I went to taste it, I nearly spit it out right there. It tastes like Rwanda- like dirt and sweat. I can see why they called it that. Added sugar but that did not help either. Sadness. So the prices are high but who isn't? They compare with Starbucks. The cafe is cool with local art on the walls and plenty of space, but they have the cream and condiments stand right in the way of anyone trying to get by to go to the washroom. I told a guy that he had to wait because I moved 2x already. Poor guy just looked stunned. Staff is ok. Some are friendly and some don't say a thing. Food is ok. I have had a few different things there and have never spit anything out so that is good, but nothing to rave about except for the raspberry muffin explosion thing. My husband loves those. So all in I give it 3 stars."}
{"text":"A little bit of a mixed first experience here.

First off I have to say this is quite the hidden gem. This strip that the cafe is located in is a mix of medical offices, crystal healing, martial arts, and other generally nondescript type businesses. You'd expect a cafe like this to be in more trendy neighbourhoods.

I was working at the construction site next door and popped in here for lunch. There was a small line, but despite the cashier seeming to be relatively new the line moved fairly quick. The general vibe though from the staff was that nothing was a rush. It didn't seem to matter if there was a line of 5 or 6 people or less. There was no sense of urgency.

For lunch I went with the Brazilian lemonade and a protein box. While waiting I was informed that they were out of lime so I could choose any other smoothie from the menu. I don't remember what the smoothie was called that I selected, but it had peach in it. It was good.

The protein box...or should I say steak salad. The menu gives you a choice of 3 proteins and says \"served with greens\". This protein box is literally steak, a spinach/spring mix combo, and some cherry tomatoes. Don't get me wrong, it was delicious, but lets call a spade a spade here. When I think protein box, I think of something that has a range of items that will actually keep you full for a long period of time. There might be rice or quinoa and some veggies and other things to make it a \"box\".

I think on a return trip I'd come for a delicious looking pastry and a London Fog and skip the lunch menu."}
{"text":"Since I wrote my first review in 2012, I've returned many times to meet with friends and potential business partners. This place has got such a laid-back vibe that's just grown on me. What do I usually order? A fruit smoothie, largest size (20 oz.). Friendly service, clean washroom, speedy WiFi--and I yet have to try the Fiasco gelato!"}
{"text":"My first impression of the place was not too great. Mismatched chairs and tables that seemed as though they were pulled from a garage sale were scattered about the place, and the decor was painfully odd and outdated. 

However, their selection of baked goods and sandwiches looked promising, so among my Dad and I, we ordered 2 breakfast paninis and a cup of coffee.

The coffee, as quoted by my Dad, was watery and lukewarm. I found this as a surprise as so many reviews commented about their great coffee. Service was definitely on the slower side, seeing that it took about 20 minutes for our food to arrive, but I knew that they were preparing it to order, so I didn't mind the wait. 

When they did arrive, the paninis were decent: toasted well, melted cheese and nicely seasoned. There was nothing extraordinary about them, but nothing horrible either. 

If I'm ever back in the neighbourhood, I might come back to try their baked goods, but there are a lot of better coffee shops around Calgary than this one."}
{"text":"A great place to study or get some work done! The cafe has several tables, is relatively quiet, has wifi, and free parking. The coffee is also great. I love that there's local art for sale as well. The atmosphere is pretty hipster."}
{"text":"Yes! This is a total hidden gem. It's location is rather obscure, but once inside I was happy to find a perfect 3rd Wave Coffee shop sitting right there in the middle of Dalhousie! Calgary is known for amazing cafes that serve high quality, good for the soul kind of coffee. I was always sad to see that most of these shops were located in the SW, far from where I live!

This cafe fits the bill, wonderful coffee, great selection of drinks, fresh fruit smoothies and YES GELATO. The branding confuses me, but the drinks are a great break from the run of the mill Starbucks. I am a big Phil&Sebastien fan, but it's in locations that aren't accessible to me. I think Euphoria will be able to make a nice splash now that I've discovered it."}
{"text":"This coffee place is a bit hidden but it is really nice, I wouldn't have found it if it wasn't for my friend who suggested us to come here. I only had a chai latte and I liked it. They also have pastries, smoothies, waffles, bagels, wraps and even a protein box!. A good variety of choices.
I just learn this is a family owned business established in 2009. I hope they succeed for many years; with so many franchises, it's hard to find these type of coffee places."}
{"text":"A quick stop on our way out of town and a desire to taste some of the hot chocolate in the YYC Hot Chocolate Fest.....brought us to this outstanding little cafe. From the moment I walked in, I was smitten.

Quaint, full of charm, and a place I would come back to again and again just to hang out for coffee and chat with friends.

Of the 4 hot cocoa options on the menu for hot chocolate fest and we ordered 2. Service was outstanding, both drinks tasty but my favourite was the Mad Mayan Hot Chocolate. Also grabbed a few cookies for the littles. Good times."}
{"text":"Once again, thanks to my fellow Yelpers, I was introduced to a new place to check out.  Europhia Cafe is close to my neighbourhood, and as someone else said in a review, it is in a place where you would not expect to find a cafe like this.  

Walk in the door and the decor and vibe is great!  Very cozy, trendy, welcoming environment.  I have been there a few times now, and a few I mean 8 according to my coffee punch card!  Only 2 more till a free one!  It doesn't matter what time I am there, weekdays or weekends it is busy.  The coffee is incredible, the best I have has in Calgary by far.  The drip coffee is very nice, and they have a very nice list of specialty drinks.  The Mexican Mocha and the Hedgehog Macchiato are both delicious.  

I want to try their breakfast menu soon. Fun looking menu for sure.  I might head there and get my 9th card stamp now.  Check out Euphoria Cafe if you are in the NW.  It is worth the visit."}
{"text":"My favourite Calgary coffee shop! Located outside of the downtown area, there is always plenty of parking which makes it convenient always. 
I love their waffles - simple but affordable and they always hit the spot. 
The atmosphere of Euphoria is what makes it stand out though. The service is always friendly and it's never too loud inside, regardless of how busy it is. 
If you're in the Northwest area, Euphoria is a great stop if you want a coffee to go or if you want to sit and enjoy it!"}
{"text":"If you are in the area, instead of wasting your money on a coffee in a franchise, try this place out. You won't be disappointed.
We tried the sandwiches as well, quite delicious!"}
{"text":"It took me awhile to check this place out, only because it seems to be known more as a gelato/smoothie place than as a coffee shop.  Truth is, it's equally both (a sensible but rare combination).  Also, it's certainly a place you'd have to go out of your way to find, unless you happened to have something to do elsewhere in the strip mall it's located in.

In any case, I'm glad I found it!  For one thing, unlike a lot of other cafes, they keep the temperature nice and warm on a cold winter's day.  It's not a large place, but there's an assortment of seating options (2-tops, 4-tops, and couches by the fireplace), and I've always been able to get a table to work at.  The coffee and food options are pretty standard and typically priced, and they also serve a number of different smoothies and bubble teas.  I've tried a couple of different panini and a couple of smoothies, and wasn't disappointed by any of them.

One thing worth pointing out: This place is cozy, and appears to attract the chatty type rather than the studious type.  Because of this, if you do intend to come and read or work here, you'll need to be able to tune out multiple conversations in order to do so.  I'm pretty good at this, but I know that many aren't, so I thought I'd mention it.  On the flipside, if you like eavesdropping on others' conversations, I suppose this would be a good place for that as well ;-)."}
{"text":"Best hot chocolate I've had in the city. Made with semi sweet chocolate, and I had a little coffee added - perfect."}
{"text":"What happens when you start tracking Yelp reviews? You find places like Euphoria! Admittedly, it first crossed my line of sight back in 2011. But how often do I find myself up in Dalhousie for coffee? Not very.

So today, when a friend said a coffee shop in the NW somewhere would be the most convenient for him and I to meet up, I pulled a little coffee shop out of the back of my head. It was time to visit Euphoria!

Unless you're looking for it, or you live in the area you'd likely never know this little cafe exists. It's tucked into a strip mall off of Crowchild and 53rd St. And not even on the busy side where all the big box stores are. No, the other side of Crowchild. But trust me, it's there! It's also just itty bitty. There are maybe 4 sets of high backed chairs along the back wall with little tables to sit at, a pair of sofas near the end and the rest is filled with just simple square tables and chairs. There's not a lot of maneuvering room.

The board is filled with all kinds of different drinks. This isn't just a coffee shop. Juices, smoothies, specialty coffees, gelato... yep, we can most definitely call it a cafe over a coffee shop. I did see some folks on their laptops too. So there may be wifi? I didn't check that one out myself on this visit.

Specialty coffees change monthly. Today, I tried out the Mayan Mocha. With some cayenne pepper sprinkled on top, the first few sips had some kick to it!

If you're in the neighbourhood, or even if you want to head to a new part of the city to explore, go ahead and make the trek!"}
{"text":"I've had coffee and breakfast here many times and love their cool drink flavours. The Mexican hot chocolate and espresso drinks are tasty! I've had the muffins, gluten free and regular, the cookies, the specialty items and all have been great! Service can be hit and miss. 

It's in such an unassuming location but there's plenty of parking and lots of room inside. I'd like to return to try their waffles or summer menu items as this tends to be my stop when I'm stuck in traffic and need to pull off crowchild trail to regain my sanity before going into work, LOL!!!"}
{"text":"So this is a real honest review, from a very picky person. Service was okay gave me a good suggestion for a sweeter Maple London Fog! Panini's were  good my hubby absolutely loved his San Andreas Steak Melt. Sat outside, it is okay being in a Plaza limited seating outside, plenty inside. Bring friends or by yourself with a lap top or book great environment going to try waffle now."}
{"text":"This Cafè is a real gem in the Calgary NW.  It has a very authentic Cafe feel, which is hard to find with franchise cafe's popping up everywhere.  Coffee is good and the WIFI is fast.  Food is also good here.  Would definitely recommended a visit!"}
{"text":"It's unfortunate that Euphoria is so far from me because this is the kind of cafe I'd like to have in my neighborhood.  The menu and beverage selection is vast and everything looks like it's made with love.  I'd be most excited to frequently devour their breakfast sandwiches, Belgium waffles and gelato.  

My first visit was recent and only involved grabbing a mocha, which I wasn't a fan of.  A lot of chocolate syrup is used and it overpowers the coffee.  Despite this, I'm still giving Euphoria four stars because I liked the atmosphere and the amount of food options for the size of the cafe is commendable.  They have a Frequent Sipper Club card for those who are able to stop by often."}
{"text":"I received an email from Yelp advertising the best Hot Chocolate in YYC.  After clicking through to the website I discovered that they served the original Bulletproof Coffee, which I had read about a few months earlier.  I have never been able to drink regular coffee and always drink lattes because regular coffee makes me jittery and I usually have a headache after a couple of sips.  I LOOOVED the Bulletproof Coffee and would go as far to say that I enjoyed it more than my usual latte.  I also had the Belgium waffle and it was the best waffle I have ever had.  I gave up sugar a few years ago, so only had the waffle with the fresh berries and it was still delicious.  Even my boyfriend who loves sugar, more than life itself, thought it was delicious."}
{"text":"Great little coffee shop in the Varsity! Not the usual place for a coffee shop being so far from the usual spots such as 17th ave. The interior of Euphoria is very simple and cozy which suits its purpose. The hedge hog was sweet and very different from anything I've tasted in Calgary. Overall, great place for drinks and any occasion. Happy munching!

Ordered
1. Hedge hog
2. Red velvet cake"}
{"text":"Love this place! It is totally off the beaten path, but solid coffee, good food (I love the waffles) and reasonable prices. They have wifi, and don't seem to mind people chillin for a few hours as long as they aren't slammed busy. 
Super friendly too."}
{"text":"Not the best visit. The sandwiches took forever to make, even though there was no one in front of us. The wrap was rolled wrong, which left all the chicken on one half and all the veggies on the other. The latte didn't taste quite right. The tables were dirty despite there being plenty of idle staff.

We've been here several times and have had better service/food/drinks in the past, so I'm sure we'll try it again, but this visit was a disappointment."}
{"text":"super cute place! lots of room to
sit & sip without feeling rushed.
was visiting my mom in the suburbs and decided to stop in for my first Bulletproof coffee - delicious! Each sip is like a built-in-buttery lip gloss. 
3 out of 4 of the staff were grumps, but the one that was friendly was REALLY friendly, so it kinda evens out..."}
