{"text":"Great soul food--smothered pork chops and meatloaf were deliciously seasoned; baked mac & cheese with lots of texture from bread crumbs and different cheeses; green beans and mixed greens were well seasoned with big hunks of turkey meat; mashed potatoes were lumpy and delicious. Service and atmosphere were friendly and down-home, thankfully devoid of pretense or hipster-ness. A dj was setting up and the place evolves into a lounge-like setting as the evening progress. The large patio out back, with a large bar and fire pit, has tons of potential as the weather cools down. Parking is conveniently accessed from the alley."}
{"text":"I decided to give El Chino a rest and tumbled across the street to Evan's  This was...interesting.  I ordered through eat24 at a quarter to 12. I enter around 12. Ghost town. Finally Evan himself appears and assures me food is coming. Cool.  I chill at the bar watching a few people mill around in the kitchen. Mind you, I ordered a Po Boy. So that's not a lot of prep time, right? Another 15 minutes tick by. Someone utilizes the bar.  Eventually I'm handed my meal and I skedaddle. So the meal. It was fine. Just a hair under below average. Everything was fresh, thankfully. But the fries weren't the best and the shrimp were just fine. Overall not a super experience.  I'm really hoping to change my opinion so I will be returning."}
{"text":"Great soul food place here in central Phoenix!!  Highly recommend stopping by. I had the shrimp po boy (EXCELLENT) & my boyfriend tried the jerk chicken (w/ mac n cheese & greens) [also very tasty] & an order of 6 wings specially made in the jerk sauce to go.   The venue was nice, def a spot that has the potential to transition into a night gathering location for some drinks & music.   I'm excited to see what this business has to offer in the next few months. I'll def be stopping back by."}
{"text":"The food is exceptional, the atmosphere is chill and the owner providing an extremely comfortable and friendly environment. Go get you some down home cooking now!"}
{"text":"Evan's on Van Buren is a great environment with awesome people and I support all black owned businesses because \"duh\", but the food itself was just okay. I really expected more since  I had heard good things, but the sides (probably one of the most important things about soul food) were really under-seasoned and didn't have that slap yo' mama taste that I had been expecting. Also, there were a lot of things on the menu that were not ready or made yet which was a bit disappointing as my family had been looking forward to certain items. As far as the location, the parking is a bit tight and not in the best area of Phoenix.I think I would try this place again, but wouldn't give it a raving review for my first time."}
