{"text":"What happened to the coffee this was one of the first time I came here and the coffee was terrible. I mean terrible it tasted like mud and so strong. Put some effort guys in making a simple drink. If I was the owner I would throw the guy who mad my coffee out the door with it closed. Put effort please!"}
{"text":"Faema, Faema, Faema, how I wish I  could recommend you.
Your food is okay, sometimes really good; your coffee [for which you are renowned] is okay, also sometimes really good.
But your service ... well, when it's good it's very very good and when it's bad it's awful!
More than once I've been astonished by your attitude.
I have had the pleasure of having wonderful, attentive, spot-on service, like when we were out on the patio in the summertime, during a very busy lunch, and our server made sure we always had everything we could possibly want.  He made it seem effortless.
And sadly, that only makes the bad more glaring.
Like when we came for Brunch on a bustling Sunday and ordered some simple eggs and toast. They were ready in just a few minutes, and we watched while they sat on the counter slowly cooling and congealing while our server waltzed around the room with absolutely no acknowledgement that our order was up.
Not that she was so busy serving other tables.  Nope, just waltzing around.  Seriously.
Or when we came mid-week for lunch and ordered the special: Panini with Soup or Salad, $8.95.  We chose Greek salad, and were charged an extra $3.95 because the panini came with pasta salad.  Really ?? It did not say that anywhere on the menu, and forgive me for not reading your mind.  Of course if the server was any good, she would have alerted us to the fact the \"salad\" was pasta salad, and if we wanted Greek there would be an extra cost.
When I went up to the cashier to ask about the bill, she said, 'oh yeah, the server should have told you', and charged us anyway.
Sloppy, poorly handled.
The Faema experience is not worth hoping you might get one of those wonderful attentive spot-on servers because chances are, you'll get one of the duds."}
{"text":"As I'm vegetarian, I asked the owner/cook if the soup had a chicken or vegetable base. She didn't answer the question but looked away and smirked. It was obvious that her husband knew that she was being rude so he answered the question for her. I told her that I don't think it's funny. She replied, I don't think it's funny either. Strange and rude.  I used to go there every Tuesday on my day off but will not go again. In this day and age with many vegetarians, she shouldn't find the question peculiar."}
{"text":"More than a cafe...

I've passed by this place numerous times, never knowing what it was. They have a large menu, more than I expected anyway, with salads, pasta, calzones. And a wine list :) and a gelato bar, tons of pastries and of course, coffee.

The atmosphere is a bit stark, it's a huge space, would be nice if it was a bit cosier. It certainly fills up (and I was there on an early Monday evening). 

I ordered what I think is called a Pandolci - Parma ham, cheese, arugula (or some green leafy veg) all wrapped up in a thin pizza dough. It was yummy. My friend was very pleased with her pasta. The gelato was great.

A great find!"}
{"text":"Faema makes incredible coffee. A fun very Italian caffe. Go for good pizza and panini. I like but don't love the salads but sometimes I grab one anyhow. Free wifi and great staff."}
{"text":"One of the worse cafes I ever been to in Toronto. Terrible and rude customer service."}
{"text":"I like the Faema. A good place to meet people, espresso like in Italy, good eclectic menu, quality items. I like the environment at all times of day. Down side it s pricey."}
{"text":"Nice Food, Nice Location, Nice Waitress...

Went on the holiday Monday of Thanksgiving, had a pizza on the patio. Pleasant experience. The food was just Okay, but it was served with a smile by a friendly and efficient waitress. I would go back but it would not be at the top of my list as it is nothing special. 

We decided to sit outside because it was very very loud inside the restaurant."}
{"text":"It's good for an afternoon of coffee and deserts but DEFINITELY not a place to have lunch or dinner. I've had better pizza!!!!!"}
{"text":"If you don't want to deal with the normal Toronto line ups at the \"cool\" spots for brunch, Faema can help you out. It's not amazing in food quality or value, but it's very pleasant in atmosphere.  Almost has a suburban feel to it. Maybe because it's so spacious. I'm not sure. I like it, though."}
{"text":"Faema is a pretty good hang out.  Great coffee, spacious, and good food. Unfortunately, the lasgna is an extremely small portion. I'm a tiny girl and I was still really hungry afterwards.  Service is a bit slow but that's ok since its the type a place where you just want to chill."}
{"text":"Food was fine but possibly the worst service I've ever had. Not servers fault, she was alone in an almost full restaurant."}
{"text":"Faema is an Italian cafe that one wouldn't expect in this area. The setup is huge and airy and the all the hustle and bustle makes one think that we are in Italy.
Plenty of options for food (paninis, pizza etc.) in addition to the coffee related items.
I wanted my my caffeine fix so I went for a Cappuccino and a Biscotti. 
The server was very friendly and chatted with me a bit before taking my order. 
I was expecting a good version of espresso drinks here as they sell a lot of espresso machines (both commercial and residential) via the store next door.
The Cappuccino arrived quickly and looked nice. Nice froth on top (a more traditional take than the modern version that is getting popular nowadays). However it just went downhill here the espresso part was took weak for my liking and didn't offer much in term of taste. 
The biscotti as well didn't offer much and was your run of a mill stuff. 
I would say 2 stars for cappuccino. The paninis looked good so I will try them out next time I am in the area.
They have drink special for 4.99$ so might be worth checking it out."}
{"text":"Breakfast, eggs Benedict was the worst I've had. The three small potatoes on the side were clearly cooked before and warmed, old. The skin was crispy but potato cold. My boyfriend has had a sore stomach since then, Friday morning. Be warned."}
{"text":"I like it here.

I have been here numerous times for dinner, brunch, and lunch and have left happy every time.

The food is good and they have a pretty decent menu. I like the coffee, especially the specialty coffees. I agree that they could improve a little bit on the customer service side of things, but it's nothing that would stop me from going back.

I've also come here with both adults and children and would say that it is good for any sort of group.

It's a welcome spot in an area that doesn't have too many restaurant options."}
{"text":"My favorite thing to get at Faema is their waffle with yummy gelato. This time I got waffle with fresh strawberries and peach ice cream, so delicious and refreshing I thought it was summer, forgetting that it was actually freezing -17 outside."}
{"text":"a nice open space restaurant, not too busy for lunch today, but plenty of people in there.  there is a patio outside that offers some sun and some cover.  decent decorum, open and inviting, lots of nice desserts to oogle.  service is a bit slow, you enter and wonder if someone is there to seat you, then you catch a waiters eye and they point to a table.  if anything, i would say, don't be in a rush when eating here, take your time.  i ordered a pizza off the specials menu, delicious, thin crust, portioned well and cooked properly.  other folks ordered the chick pee soup and ceasar salad, soup was great but the salad was decent, not as fresh as one might expect. the omelette special with salad and potatoes, potatoes were days old, wrinkled and a little tough, the salad was not fresh, came with a funny looking dark dressing, bland tasting, omlette had more veggies than egg in it, but was cooked well and tasted fine.  i like the pizza here, and we all ordered from the specials menu, but not everything is as fresh as they say..."}
{"text":"The only reason I'm giving them 2 stars is because their take out coffee service is great, along with their coffee.

However the management and food are horrible. Like disgusting horrible. Guess I shouldnt leave the slow and bitchy servers out too, they also suck!!!

Coffee= BEST IN MY HOOD
Service/Food=NOT IF MY LIFE DEPENDED ON THEM!"}
{"text":"I get lunch here for work because it's the closest place to get a latte for my boss but the service sucks. The coworkers argue and give each other attitude in front of customers, the wait for our pickup order is long even if I come later than the expected time, they've messed up our order a few times, and they're always understaffed.

The food is mediocre at best and inconsistent. My last order was a ceaser salad which was drenched and the gnocchi was horrible. Honestly, an omelette is the safest thing to get here."}
{"text":"I stop here on mornings on my way to work. 5 stars for the espresso, which is excellent and my favourite straight up espresso in the city. Best to order and drink at the bar as it comes off the machine. They pull properly here, not the overwrought bitter concoctions at most of the independents in the city. 

Food is just fine but it's a Faema Caffe - espresso machines and grounds are their specialty not food."}
{"text":"Today was the day.

I have been driving by Faema Caffe for ages. Have always been intrigued by this joint.

I already had lunch so the DC and I just came in for an after lunch espresso + sweet treat. Can't speak for the sweets as I only had an espresso... it was good ... strong and good. I suppose this is reflective of the machines used for making espresso more than anything.

Server was super friendly. A trend with many restos, she was overworked. She looked overwhelmed, but tried her best to come by and see how we were doing. 

The food looks delish so I'll have to try it next time. Pricing is pretty reasonable.

I'll be back.
For now, we have a solid 3 star.
Will update when I have a meal here."}
{"text":"It took a little while for anyone to notice us, but other than that the place was busy and the server was sweet. I was a little disappointed the patio wasn't open but perhaps the weather felt better for a Manitoban than for the people of Ontario."}
{"text":"The cafe is great. The espresso machine store, on the other hand, could use some work. Great showroom, very well laid out and nicely designed. However, the two staff members when you arrive are too busy flirting with one another to do their job properly. The heavy set young lad was very unhelpful when I tried to get cleaning supplies for my espresso machine. He wouldn't even get out of his chair and get off his phone to assist me. His GF ( so it seemed) was trying to help but she had no clue what she was talking about and we ended up leaving. I'll buy my gear and machines from idrinkcoffee.com or anywhere else but Faema

I must point out that the gentleman in the back was very friendly and professional. Perhaps he can run the entire store?"}
{"text":"My absolutely favorite mushroom pizza in the city, Great brunch spot - really reasonable and you can always get a table, because it's really big and has indoor and outdoor space.  I think the ice cream is homeade.  A neighbourhood favorite!"}
{"text":"I live and work in the area so I've ordered take out from this place numerous times from my workplace and the service there was always great until today. So I'll just write everything I have to say about this place to sum up all my experience:

Food is great, portions can be inconsistent depending on which container they decide to use that day.

Drinks: Consistent flavour (except for the ice mochacinno, I've gotten 3 versions of this so far). Portion wise it's better to order it as dine-in FOR COLD DRINKS because they use really tiny cups if you ask them for take-out and they charge you the same price.

Now, SERVICE: Not the worst but not the greatest. Ignoring what I experienced today, employees there are usually willing to help. 

However, today I ordered some hot drinks for my co-workers and one of them was a cappuccino. The person who made it today put way too much foam on it so I couldn't put a cap on it. There was another mid-age looking employee (short gray hair with black framed glasses) who was at the counter so I KINDLY asked if he could help me remove some of the foam.

Instead of helping me, our conversation went like this:
Employee: *stares at it for a few seconds* says \"can't you just walk out without a cap? 
Me: I want to put a cap on it because it's for a co-worker not for myself. 
Employee: That's even better then who cares??

I felt very frustrated but I didn't want to make a scene so I tried to gently put the cap on but it got kinda stuck so some foam oozed out. That same employee then said in the sassiest tone \"See told ya\".

I was furious at this point. I'm the type that heavily values how a restaurant's service is and this was one of the worst customer service I've experienced. If you don't care about service feel free to go here. The only reason I put a 2 star is because their food is actually not that bad."}
{"text":"Their Americano is decent and the patio is nice.

But seriously, fuck the forced waiter service.  I just wanted to have a coffee on the patio and barista told me to wait for waiter service - you made me wait at my table outside for my waitress, wait for her to bring coffee to me, wait for the bill and wait for change.  I was tempted to stiff her on a tip - but goddamned social norms forced to leave at least a dollar tip.

So I tipped 33% for the 'privilege' of having what normally takes 2 minutes turned into a 15 minute ordeal.  And I'm spending an extra 5 minutes to write a Yelp review on this shitty time wasting policy.  So take 1/3 of what you make per hour and add that to the total cost.

If I was a Playboy Playmate, for my bio sheet under 'Turn-Offs', it would read 'Inefficiency'.

But redundancy (for the sake of emphasis, at least) isn't a major turn-off for me, so - once again: fuck the forced waiter service."}
{"text":"Been having lunch here recently and the food is great - mostly I order a sandwich with soup. This is a photo of my lunch from today (roast beef sandwich with butternut squash soup - $12). I think they had a problem with their kitchen ventilation because the restaurant was filled with smoke. I was in there for 5 minutes and left smelling like i worked in the kitchen all day."}
{"text":"Yeah so I justed noticed a sign saying to seat yourself and that it is full service which makes things even worse that we were totally ignored for THIRTY WHOLE MINUTES while we sat at a table like chumps. This place will never get a single dime from me."}
{"text":"Great place to go with kids -- you don't feel like a pariah at all -- and it is largely for this reason that i've been a repeat customer in spite of the fairly average food. Pizzas are okay. Breakfast eggs and omelette dishes are full but undistinguished. Coffee and gelato are excellent."}
{"text":"The place is large! So it's got that going for it, but when it fills up, the wait staff quickly gets overwhelmed and rush you out. 

The food: I've had several dishes here, my last experienc was a chicken parmigiana panini. It was okay. *every dish I have had in general has been...okay. nothing horrible. ..nothing stellar.

The chicken itself was flavorful...but dried out in some places. It was not overly sauced which is a bonus, the cheese could be heavier. I feel like the heart of Italian cooking is cheese and sauce...the panini was light on both. 

The baklava is probably the best thing here. HONEY drips off it. So sweet. 

So worth going if you are in immediate area...but not 'take a trip to it' worthy. 

Bonus: high ceiling has good sound distribution so great if you have a baby who cries out occasionally."}
{"text":"Went last week after out of options to our regular places - friends insisted we visit since it was one of their regulars.  Off we went.

Inside the ambience is a bunch of old Italian social club types - men in their 60s and 70s all talking and yelling at each other with several TV stations showing overseas Serie A soccer games.  

The food was bland at best.  My son ordered a Lasagna, which I tried a little portion.  It was average, nothing special.  The soups were downright salted, so badly i think you could end up with a a heart attack due to so much salt in their soups.  Between my wife and I we had 2 different soups, and we returned both they were just so salty we could not have the soup.

My wife ordered a fish of the day plate, which half-way through she gave up it was so blandly prepared.  I had a spicy personal pizza, and it wasn't to bad, but again, the chef here must have issues with judging saltiness, it was way over salted.

For 3 people with a beer, and an appetizer + main course it cost $65 + tip.  For that money I can eat much better, and won't be going back.  Not only is the food average, but the environment with old italian guys as their primary neighbourhood hangout to watch soccer games, this is not a good place to go for dinner.  This is more of a quick lunch place at best if you are in the area.

Not worth the drive to."}
{"text":"Attached to the Faema shop where you can buy coffee machines, there's a great restaurant called \"Faema Caffe and Bar\".  It was really excellent.  We were there for lunch and it's spacious with good service.  Very very tasty food including paninis, pizza, pasta, soups and the food was brought SO quickly.  Of course the coffee was excellent as well!"}
{"text":"Had been looking for a breakfast place in the West End that wasn't either super crappy and cheap or an obnoxious yuppie brunch  with a 30 minute wait. This place was under my nose for a while but never really noticed it. It's east to miss, but offers a good breakfast and decent coffee. Serves Breakfast till 3 on weekends and has a patio. Great place to have beer with breakfast. Steak with the steak and eggs was pretty good at $14 and the waitstaff were very good. Also been here to do work late at night and the desserts are good as well. I think the decor could use an update but would still definitely recommend for any time of day."}
{"text":"Last week, two of my closest friends moved across the street from this place;  a proper introduction followed mere days later. I can hardly say I was surprised.

This is the kind of place I know I will be happy to have in the immediate vicinity of my second home. The seating area feels nice and open, casual, but (with its fancy, subtle dimness) just pretty enough to make you feel classy when you sit and drink coffee for hours using their wireless internet (in theory, as I have not done this yet). 
Yeah, I said classy AND internet. This just might be an appropriate evolution for our maturing group's choice of local hangout (haha).

All I have sampled thus far is their pizza, and it was damn good; good enough to assume that for the initial stages of our relationship, I won't be able to tell you much about the rest of the menu."}
{"text":"By the look of this place it took me a long time to wander in as I expected it to be pricey. I came in one night about 15 minutes before closing, and though the staff were cleaning up, the barista was more than happy to help. I ordered a london fog to go.

I was pleasently surprised when the bill came in under $2.00. Remind me again why it took me so long to come in here? Also, remind me again why I've been going to the Starbucks across the street for the same thing at 2.5x the price?

Faema you win. Starbucks, you lose. Now I just have to come back to try the food."}
{"text":"We moved out of the neighborhood 5 years ago, but had been a regular until then. Besides the great coffee, we treasured the great service from Chris the waitress. Came back today, and no Chris. \"Oh, she left\" but would not tell us why nor ask anyone else working at the restaurant. As usual, the eggs were just so-so. Coffee was pretty good, better than Starbucks but not as good as L'Espresso. However, for a bit extra, they used to make their lattes with Segafredo coffee--not any more.
Doubt if we'll return."}
