{"text":"A hole-in-the-wall place with hands down the best jerk chicken in town! Started buying from here 20 years ago (when a combo of patty+coco bread+pop was only $2.50)! Take out only. Or if you want, you can sit on the one and only very rustic bench there. Don't mind their lack of decor/overdue reno, you are there for their food, good delicious food."}
{"text":"A definite hidden gem with this place.  Located tucked away in a residential strip plaza, most of the time I purposely drive here to get my fix of fresh cocobread and spicy pattie.  Nothing gets more authentic than this place. 

I love how they have have regular and mini size frozen patties for you to get as well, to get your dosage of patties right at home.  I just toast mine in the oven at 350 degrees for 10-15 minutes and good as fresh. 

I've tried their oxtail rice and beans dinner once and it's alright.  The rice was a tad dry for my liking."}
{"text":"This is the spot if you want a quick patty or ox tail dinner. 

I don't live in Scarborough anymore but every time I'm in the area, I usually pop in for a quick bite because of FOMO. 

Spicy beef patties are the way to go - always hits the spot.

Staff are friendly even though they're always in the back fulfilling wholesale orders - I've never had to wait too long here.

This is a quick grab and go and there is no formal seating - it's in a small plaza. Sit and eat in your car or curbside for the full experience!!"}
{"text":"Don't know about the food but the patties definitely ain't no good. Went with a friend and we were both shocked at how the patty tasted. How could u go wrong making a patty. Nothing about it was good definitely not going back."}
{"text":"For me it was worth the drive to Montezuma Trail! 

There are lineups at the door and cars lined up waiting to park then you know you have found the spot. This authentic Caribbean takeout delivers the goods in a down home no frills fashion. It has the same feel that southern US BBQ places have, worn comfortable, and unpretentious. 

You simply cant beat the Jerk Pork on Coco Bread for  ($3)!!! Tasty, easy to eat, available wet or dry, it has the right amount of spice and flavour to satisfy. Its hard not to eat a second. And I did. For super jerk lovers you may find the spices a bit tame but for lunch it is perfect. The beef patty 100% hit the right amount of heat and tatse with a covering that did not gum up your teeth like the cheap supermarket patties. The take out Coco Bread  was really good and a freezer full of meat patties was enough to temp me to take some home.

An added bonus is the rest of the mall which seems like a beehive of activity with people coming and going. I have not seen a strip mall this busy in a long time. Sadly, I live on the other side of the city so visits will be rare.

Places like this make enduring all the crappy chain places worth it."}
{"text":"It's a simple store with the regular choices. Dont get me wrong, it two stars cause the food is not innovative or creative, but it still tastes good. I had their jerk pork sandwich. It is really done well, but it is missing something to provide that extra level of food experience. There beef and goat patties are really good, I would say if not for the pork, come for the patties. This place is still worth a try... Even if it is two stars in my opinion."}
{"text":"Fahmee is definitely a hole, but the food is amazing.  Jerk chicken is tasty.  Oxtail is one of the best I've ever had.  Customer service is very good for a place that is a dive."}
{"text":"Have to give it to their food. Nothing short of outstanding. Inexpensive amazing food in good portions. Jerk chicken, jerk pork, and patties are great. Amazing independent business. 

Cash only though"}
{"text":"Had a wicked craving for a patty and I remembered that I had bookmarked this place after discovering it from tapping on \"#WardenStationPatties\" on IG.  Since those patties are the truth (in my opinion), I had to try this place.  Was a little disappointed, to be honest.  Mind you, the spicy beef filling was very flavourful however the crust was on the heavier side.  I will however, go back and try their other patties and also their oxtail that I was eyeing.

For now, I have to just give a 3/5 for the beef patty."}
{"text":"Fahmee is more of a take out place but there is a bench and table inside for you to eat if you want. It's a local family run bakery and I always enjoy my food here. The roast beef coco bread is delicious but you have to add in their onions and cole slaw that they put out on their counter. (The onions are extremely spicy) They also have the best jerk chicken, and I don't usually like jerk chicken. It is so tender and juicy - not dry at all. The curry goat is also really good. The oxtail is delicious. I definitely recommend it when you want grab a quick bite or lunch!"}
{"text":"Classic place if you are from Scarborough. Used to come here when I was a kid. The food tastes much better than how the store looks - they need a face lift! Customer service isn't always the best. Still have very cheap prices - I think its $3 for a jerk chicken on coco bread. They also offer classic Jamaican dishes such as ox tail, jerk pork etc."}
{"text":"Originally Allah's pastry shop, I've been going to this place for almost 30 years when my family moved in to the neighbourhood. Best beef patties in the city, they kept the original recipe when Allan's branched out on their own. Jerk pork and coco bread is another favorite. Usually come here after visiting Sam for a haircut in the plaza. Make the trip, you won't regret it!"}
{"text":"The best grab and go patty place in the GTA. Hands down. I've been going here since I was 10 and the quality never disappoints. Make sure you get their spicy beef patty WITH their freshly baked coco bread. They have some homemade sauces and pickles in the front for you to dress your meal with. Go and try for yourself!"}
{"text":"I used to come here often after school and get my patty fix. I still come here for all my patty and jerk chicken needs. Their food is amazing and haven't changed for as long as I remember. Always add the habanero/onion to your order - it's legit the sh/it."}
{"text":"Bought jerk chicken on coco bread and for the price, it was really good deal! Will definitely gonna comeback, their beff patties are really hot and spicy!"}
{"text":"A Scarborough gem. I have such fond childhood memories from this place. Their patties are still as amazing as they used to be! And they are also really cheap :)! 

If you're craving for Jamaican food I would definitely recommend this place. I haven't tried many other Jamaican food places so I have little to compare to.. But I have tried many Jamaican patties and this is definitely one of the best! The coco bread is also really good. Really soft. The jerk pork sandwich was really good! The meat was marinaded very nicely. At first I thought pork the pork may be too dry but on first bite you soon realize it does not taste like what it looks! It was juicy and tender :)

I will be back to try more things! I only ever got their patties. Oh and they also have a selection of hot sauces on the side that you can add."}
{"text":"Beats Patty King anyday, with a great price. The sandwiches here are also amazing, beware of the spiciness of the chili & onion that can be added."}
{"text":"I've heard of this place as a hidden gem in Scarborough, even though I was raised not too far from this place it was in a plaza that I never frequented. When you walk in, it's a small counter with a homemade sign on the back and a freezer to the left with frozen patties in them. This is a good sign, if you know Jamaican places or patty places then the best ones are the ones that aren't fancy; they focus on their craft not their décor. They had 6 frozen beef pattys for $5.50 in varying spice levels, I grabbed one of these bags since I had just finished lunch prior and was looking to bring them home anyways. This was a great decision because they're amazing out of the oven, put them in there for 20 minutes at 350*F and it comes out with the perfect amount of flakiness. These are amazing beef patties and I'll grab them every opportunity I get. The mild spice is more mild than I expected but still enough to provide the flavor you want."}
{"text":"Best place for jerk sandwiches...Worth it for under $5.

Haven't been there in a few months...but will make it a point to go there when I'm in scarb"}
{"text":"Love the oxtail and rice; very flavourful and the gravy is delicious! The jerk chicken is good too but if you prefer a dish with more sauce, I wouldn't recommend it. $6 for a small and $11-12 for a large. 

As a recently converted pescatarian, I am so happy they carry veggie patties!"}
{"text":"Not very good at all.

Patties too thick shell wise and filling not befitting a solo bakery when chains pump out superior products.

Jerk pork sandwich laced with fat (not a fan) and taste not up to par either.

Both ended up in the garbage after two bites."}
{"text":"Summary: the tastiest jerk pork I've ever had, outstanding patties, and competitive prices keeps me coming back to this humble, simple Chinese-Jamaican hotspot

Top Must-Get: Jerk Pork sandwich (or one lb of jerk pork if that's your kind of thing)
Top Regret: ...Well, the roast beef isn't bad, but it's not the highlight here

No washrooms, no place to sit down and eat, no air conditioning, no professional menu (it's literally just a whiteboard), and no doubt you'll be wondering why this place is so popular. Teachers, police officers, construction workers, renovators all flock to this place at lunch, and it's all because tender, juicy pork is everything jerk pork should be, and you'll get it here better than everywhere else.

They won't cheap out on your portions, nor the sauce. Family run for years upon years, this has developed a loyal following.

The service is hit or miss, depending on who takes your order, but whoever it is, you're going to just be salivating at the thought of blessing your tastebuds with an introduction (or reintroduction) to jerk heaven.

Jerk Pork: best. Get it.

Jerk Chicken: not nearly as special, but still decent

Roast Beef: a little plain, but good for the less adventurous

Patties: both chicken and beef come with a yummy pastry coating and a flavourful filling. One of my favourite patties!

Coco Bread: sometimes I order a loaf to go with a pound or two of jerk pork to make my own sandwiches... But to be honest, the bread here is only decent (Negril, for one, has definitively better bread, but not nearly as tasty pork).

This is my go to spot for lazy potlucks and it's always a hit. Try it!"}
{"text":"I've been a longtime customer of this local staple in the neighborhood ever since I was kid. Personally, I think they make one of the best beef patties. I always love coming here and ordering the beef patty special which comes with coco bread and a drink. They also make a great jerk chicken sandwich and jerk chicken with rice and peas. The staff are super friendly and very nice. The pricing is fairly competitive as they sell half a dozen patties for around $7 and $14 for a dozen patties. Whether you are looking for a quick snack or some good patties, this is the place to be. I would highly recommend coming here and trying their delicious patties!"}
{"text":"Chicken Sandwich was good. Nice and  piquante!

Beef Patty was inedible, though I've heard great things about it :( The breading was fine but the beef tasted exactly like mouldy bread, and it definitely isn't supposed to taste like this. I really wanted to like it.

Please be more consistent with serving fresh product Fahmee!"}
{"text":"Great beef petty and oxtail! When I live in that neighbourhood, I used to buy half dozen for my breakfast. The only thing that I didn't like their petty is a bit dry and hard."}
{"text":"A dirty run down store in a very bad neighborhood.  I would love to tell you what I thought about the food but the customer service was so bad I ended up walking out.  Avoid this place plain and simple, if you want jerk chicken on coco bread go to Alwyns."}
{"text":"I have been coming to Fahmee for years and the food is always great.  The plaza is a little ghetto and if you don't know that area that well it could take you a while to find it. I always order the the Jerk chicken and coco bread sandwich. The portion is generous and it's cheap! I add some hot sauce because I like it on the spicy side and I'm telling you it's hot! Sometimes the service is a hit or miss. Sometimes they are so nice and ready to help other times they look at you like hurry the hell up and order so you can get out of my store... It is what it is and no matter their service I will continue to go back!"}
{"text":"Had fond memories visiting here but quality of customer service has gone horribly downhill.

Waited patiently in line for 5 minutes while staff tended other customers then was immediately ignored once another customer entered through the door. 

They don't want to serve patient customers so they lost one plus many others via word of mouth. I'll be a happy customer of Allwyn's bakery instead."}
{"text":"I'm always on the hunt for the perfect oxtail rice and peas. Medium for $11 and large for $12 so naturally I went with the large. The meat was tender but not really fall off the bone quality. There was a lot of fat on the oxtail and some parts of the meat was tough and chewy. The sauce was not spicy at all which is not a must but the sauce was still lacking in flavor to me. I would much rather have the oxtail at P Jays Take Out (3/5 stars).

The jerk chicken sandwich for $3.25 was more to my liking. The pieces of chicken seemed dry at first glance but it was actually tender and juicy with a nice kick of spiciness. Just wish there was coleslaw in the jerk chicken like at Allwyn's Bakery. Still very good though (4/5 stars).

Overall 3.5 stars"}
{"text":"I come all the way across Scarborough for the jerk chicken sandwhiches which are delicious.  One of the sandwhiches almost never makes it home and its always worth the drive.  The place is small so its not really designed to eat in so make sure you buy an extra patty or sandwhich for the drive!  

They also serve breads, other baked snacks as well as West Indian cooked food (Chicken, Oxtail, Jerk Pork, etc) which are all delicious but my go-to snack here is always the jerk sandwiches!  DELISH!!!!  If I were being picky, Id ask why they don't include some sort of lettuce or cole slaw inside the jerk sandwich as its just the chicken wrapped up in coco Bread but its good.  Some lettuce and perhaps a slice of tomato would take it over the top!!!!  

Note that they also cater so if you need large portions, you can order food by the tray."}
{"text":"Been coming here for about 20 years. Used to be competitive. Now it's far too expensive for my liking. Half dinner cost about $6.50 now. The same price as a full meal at any Chinese take out around the area. With 2 meats and veggies. Sorry fahmee. You are officially off my list of places to eat forever"}
{"text":"Been eating from here for 30 years. Patties and coco bead, jerk pork sandwich's are the regular but the other food is good too."}
{"text":"I loved the filing of the [spicy] Jamaican Patties but they didn't flake ]: 

I'll be back to try other things on the menu though!

I was so impressed by the customers that this place attracted even though was a Tuesday afternoon."}
{"text":"I've been coming here for 25 yrs. the patties are great, coco bread is fantastic and the jerk pork rocks! The service isn't the best but that's not what I come for. It's all about the food! 

It's a busy place so you know that's a sign the food  is good. Check out if you've never been and are in the Brimley and Finch area"}
{"text":"I showed up right as they were closing and was very happy that they still took my order.

I tried the jerk pork sandwich which was $3. It is really good, but also really fatty. The customer before me ordered jerk pork on rice and peas which costs $9. The servings were HUGE. it's a regular sized takeout box filled the the brim. I'm a big guy and even I would not be able to finish that on my own.

I'll try the jerk chicken here next. so far so good."}
{"text":"I'll be frank - I wasn't expecting much from Fahmee Bakery & Jamaican Foods. The classic blue text sign on white background, the condensation that covered the windows and the dated looking interior. I had only heard of it from my wife who frequents this area with her co-workers for lunch. A few bites was all it took for me to flip my view of this place 180 degrees.

We sampled their jerk chicken and jerk pork sandwiches. I'm a fan of the chicken, it's moist and the jerk flavour is very apparent. The jerk pork is good too. It almost reminds me of traditional Chinese Roast Pork without the crispy skin. Top these sandwiches off with their pickled onion and pepper concoction and you've got the perfect balance of flavour with the pickled veg cutting the oiliness.

We ordered their oxtail and rice & peas too. The oxtail is juicy and the rice and peas are a nice side for it. The rice and peas were a bit plain for my taste (but I'm told this is the way it's supposed to be done). No biggie - I just tore the oxtail down and mixed it with the rice... kinda like a makeshift fried rice.

I regret not being able to try their spicy beef patties, but I couldn't possibly take another bite having eaten what I think was enough food for me.

Looks like a hidden gem, but I think most people know of this place already, haha!"}
{"text":"Way better than frozen-fare"}
{"text":"Fahmee Bakery & Jamaican Foods looks and feels like another sketchy place in a sketchy Scarborough Strip Mall.

The blinds in front of the store kind of always closed and have no business hour posted.

Jerk Pork on Coco Bread ($3)
- Jerk Pork is tender with a good mixture of fat and lean
- Jerk rub is spicy and have a good pick to it
- Coco Bread is thin and soft and with a hint of sweetness went well with the pork

The nice lady at the counter was trying to stuff my bread with as much pork as possible and make sure I have pieces of both lean and fat in my order.

Jerk Dinner is around $9 and with half dinner for $5.

There are also an area where you can pick up some Island bread, pastries and sundries."}
{"text":"I've been going to this place for years and have been meaning to try other things on the menu but as soon as i see the jerk chicken, i gotta order it. 

my favorite jerk chicken in the world.. literally. i visited jamaica last summer and craved fahmee jerk chicken hahah..

spice it up with their onions if you can handle heat!"}
{"text":"The service here is funny like a sad clown, the cashier ignored me for 2-3 minutes just gossiping to another lady. While I stood there like a neglected tree, I tried flailing my arms like a pelican with no reaction from her. Decided to leave but someone from the back came out and took my order just in time. Still angry I drowned my frustrations in their delicious jerk pork w/ coco bread. Tasty Food over Poor service wins this time ! I will be back."}
