{"text":"After visiting the beautiful Clifty Falls state park on a Saturday, we stopped for dinner at the inn. The buffet is huge, and has a great selection of foods, including fresh fish and sliced prime rib. Everything was very good, and weil prepared. They also offer a large selection of desserts including fresh baked pies, bread pudding with caramel sauce and cobbler. You will not leave here hungry, and it is a bargain, although if you're not staying at the inn you will have to pay the $7 admission to the park. The view of the Ohio River was very nice on the fall day we were there. I'm not sure about the regular menu food quality."}
{"text":"We have stayed at Clifty Inn many times in the past and dined in The Falls dining room. Past experiences were satisfactory--not exceptional, but satisfactory.  We arrived on a Sunday evening in late Feb.  Breakfast Monday morning around 9AM was terrible!  We were seated after a short wait.  Three of the wait staff past by us without a comment that someone would be with us shortly.   The young woman who served us was friendly, but inexperienced.  We were not offered coffee, only water.  Three of us ordered omelets which were served cold and appeared to have been run over by a truck, they were so flat.  We had to ask for butter and jelly for our toast.  We asked for separate checks but our server had not kept our orders separate.  She apologized and explained that her manager would have to separate the charges--a process that took longer than it should.  
This visit was extremely disappointing.   I hope the kitchen gets its act together as the Inn is a delightful place."}
{"text":"Inn was Lovely, we had a great time.  The restaurant on the other hand was lacking a lot.  When we tried to order dinner the first night, I asked about adding a side salad to my sandwich, and the waitress said it's just a piece or two of lettuce with  tomato, like I was wasting my money so I didn't order.  We ordered the Pretzels as an appetizer and wouldn't do that again.  My husband ordered the BLT club and got a regular BLT.  My tenderloin, although large was tough and I didn't eat 1/3 of it.  We tried the Breakfast Buffett the next morning, it again was passable but nothing to write home about had better lots of other places.  Their breakfast prices off the menu were so high for breakfast that it was as cheap to get the buffet.  Food could have been much better for the venue, we expected more, have had better at roadside diners."}
{"text":"We had the balcony rooms on 4th floor that that had the wonderful view of the river and downtown area. Very clean room, spacious, even with a wet bar. The dining room staff were very friendly and attentive and the food was very very good. Special request taken with a smile.  Very much accommodating making sure your stay is pleasing. Excellent views from the dining area fireplaces throughout. What definitely  be back. Romantic getaway."}
{"text":"Visiting Madison for the weekend. Ate breakfast buffet here. Great service. Good food. Not fancy but good. Worth the cost of admission for the view alone! A lovely breakfast."}
{"text":"What a nice surprise... After a nice walk through the park, we figured a restaurant nearby would be better than nothing and we were starved. 
The truth is the place is great. The food delicious. The staff friendly. The view of Madison and the river is beautiful. Try this place even if you don't want to do the hiking part."}
{"text":"We ate here twice on our recent visit.  Had the buffet once.  It was good and there were plenty of choices.  We also ordered off the menu once and took food to our room.  Again, good sandwiches, hot and tasty.  Friendly, accommodating staff.  Good prices for the food we received."}
{"text":"We recently dined for the dinner buffet and the food was great. I was impressed with the selection and quality of the buffet. We had a great view of the river while we ate. The restaurant was very clean and the staff was friendly."}
{"text":"Service was poor. Food was poor. The view was spectacular. The view alone should get this place to raise their quality. It could be a real destination place but instead it's an MCL on the hill."}
{"text":"It's possible that my positive experience at the Falls Restaurant is a product of the very low expectations I went in with -- multiple people had undersold the restaurant to me just before walking in. But all of us had an excellent experience, so five stars it is.

First, the view and decor: this is quintissential log cabin dining, with an excellent vista of the Ohio River and the woodlands surrounding it. If you have to wait for a table, you do so in the lodge filled with puzzles and games and a warm hearth. There were plenty of options on the menu, so we skipped the dinner and salad buffets and went with the script instead. Dinner comes with cinnamon sweet rolls and apple butter that are incredibly dangerous -- limit your intake, because they are so delicious you will definitely spoil your dinner.

Our table took in the veggie lasagna, the chicken quesadilla, the BLT, and the fish sandwich. All of the dishes were excellent, with good presentation, and I was especially impressed at the variety of options for a restaurant at an Inn. Lodging food can often be an afterthought, so it was exciting to see that there was clear thought put into the meal. I'd definitely be back again -- if only for the excellent view."}
{"text":"Great place. Awesome Sunday buffet.  Good people was able to help me find some vegan items.  The view is worth going alone."}
{"text":"Ate dinner there our second night in town. Our server, Adelie was excellent! Answered all our questions, fast service and kept our drinks filled. Brought us their excellent bread pudding from the buffet, as it was not on the menu. Left her a good tip, as she well deserved it. She is an excellent server who clearly loves her job."}
{"text":"Went here for the fathers day lunch buffet. Prime rib was good. Fried chicken Was pretty darned good. Friendly waitstaff. Reasonable prices. Great view of the river and downtown madison. Will come again."}
{"text":"This is one of the few places to get a good, hot breakfast on the weekend in this small town.  Its a pretty standard buffet style breakfast with plenty of options.  Quality and service are a solid three star and there are a lot of seats in the dining room, so no waiting for a table usually.  The views out over the park are spectacular so get a seat at the window if you can."}
{"text":"Best place in town ! Must go can't beat the prices for what you receive won't walk away disappointed"}
{"text":"Went to Sunday lunch with my mom and brother. The $12.95 was a great deal for not only the huge selection, but it was incredibly good. Usually you have to sacrifice quality at a buffet, but the baked fish and prime rib were very tasty. The salad bar had a nice variety, there was a nice selection meat, and diverse assortment of desserts such as pies, cobblers and puddings. No chocolate cake was a disappointment though. A minor complaint would be the $2 for ice tea at a $13 buffet? We sat by the window for an incredible view of the Ohio River Valley and the City of Madison all covered in snow. Clifty Inn, and the state park too, is a beautiful location and well worth a trip as a destination."}
{"text":"Sunday brunch is best in town. 

Otherwise an average to above average meal, make sure you get a table with a view. Nice overlook of the river valley."}
{"text":"Stayed at the inn for a few days and ate breakfast at the restaurant one morning. Hostess was a delight and we were happy with the price, amount, and taste!"}
{"text":"The inn was a great empty place   To our surprise. The park is full for over night stay.  But lunch was ok"}
{"text":"I visited this place with a group. Three buffet style meals were rolled into our stay at Clifty Inn. While there were many things on this buffet, I have to say the dinner dessert buffet and the lunch time meat loaf were the best things they had. Everything else was just meh. 

The staff was attentive. The dining room is large. With the large group we had and the amount of employees that were staffed, they could've cleared the table sooner. As people finished up their plates and made a second trip, things started to get crowded! It's my understanding that this restaurant is open to the public as well(not just the Clifty Inn goers). With that, I wouldn't recommend this place at all. 

The food isn't necessarily bad. There has to be a better option somewhere close by. They have a salad bar, a meat/fish/pasta variety bar, and the dessert section. If you are coming here on a retreat with a group and want to pay for your meals with your stay... this place takes the hassle out of finding a place to eat every day."}
{"text":"Other than the view there is nothing positive I can say about our breakfast experience. It cost $7.00 to enter the park just to eat.  It was poorly managed, having only one bus person for a very large room, for example, and the waitresses had to walk quite a distance to get coffee, food, everything. Our coffee arrived cold and when we were finally able to find someone to request a refill, it was luke warm at best.  It took over 45 minutes to get our food, which was mediocre.  I would advise people not to eat here. Period. The management seems to be coasting on its laurels  and should feel ashamed for not updating its space and service plan."}
{"text":"Good and varied selection of food, for all meals. I enjoyed dinner, breakfast, and lunch at my recent stay at the Clifty Inn. The waitstaff was for the most part pleasant, courteous and on the ball.
I can't speak to the price, as our meals were rolled in to the price of our stay for the weekend."}
{"text":"Good buffet style food. They usually have a couple entree options, multiple desserts, and a good quality salad bar. All of the veggies on the salad bar were fresh. My husband got sick from all of the delicious food he ate! Mostly because he ate seven sweet rolls... 

I have always been treated very well by the staff. Occasionally there will be one waitress that is not so great, but that isn't the rule."}
{"text":"I give this one  3.5-4.  The food was pretty good.  I enjoyed the fried fish, mashed potatoes, fried chicken, and macaroni and cheese.  The baked fish had an odd taste to it.  Not that it was bad, it was just different.  The corn was just plain nasty.  I don't know where they get it from, but they seriously need to consider going with a different supplier.  There was no juicy sweetness to it at all.  The chocolate cake was good.  It was as one might expect from buffet cake.  Not fabulous but not bad either.

The service for our group was outstanding.  We were all taken care of by the young servers quite well.  I never had to wait long for my drink to be refilled or for my plates to be taken away."}
{"text":"Without the view, there would be no reason to eat here. The waitress was sweet, but there were three tables with guests in the whole place, and we were needing drink refills. I had a steak that looked like it had been run over by a truck a few times. It was not a good cut of meat for the price and bland. My wife had the \"famous\" fried chicken, which was also bland. My so had the catfish, which may have been a chicken patty. It was hard to tell. The only saving grace for the meal was the biscuits with apple butter. Not unique in this area and you only get one. With good restaurants in Madison, they need to up their game."}
