{"text":"If I could come here every other day..I would..it's that good! The wings aren't you typical \"small - one bite\" wings..they are huge..I mean huge. All the times I've come here not one person in our table is able to finish a single order! Not only are the wings huge, the flavours are just insanely good. Greek Homicide will definitely blow your mind. The fries are amazing..even all the crazy fries like cheese fries...garlic parm fries are just delicious. Onion rings you can tell aren't frozen and unlike other places, there's more onion than batter here! Amazing! Service is awesome. Never had an issue. All the waitresses are super attentive and makes you feel really welcomed. If your a huge sports fan like I am..this is the place to be! Blue jays game..Raptors games is all on the tv's. You even have your own tv in your booth. I heard this place is hosting Toronto Raptors Playoff parties so definitely go here if your fan!"}
{"text":"Hands down BEST WINGS in Scarborough and maybe even in the gta! Thanks to Yelp for introducing me to this place..it's been me and my fiancées go-to joint for wings.

The wings are huge, juicy and they coat it with just the right amount of seasoning and sauce! Our favs are the chipotle Cesar and the honey parm."}
{"text":"Went in to order take out.  Served immediately. One of the ladies was more helpful than the other but otherwise a good experience.  Wings were large and tasty...ordered the jerk and suicide.  There is so much variety.  I will be back."}
{"text":"Best wings I have had in my life ! Friendly staff and amazing service. A true gem in Scarborough."}
{"text":"If I could put 0 stars I would since I was very disappointed with the way I was treated when coming In for an early dinner to catch the game. Called 30 mins in advance to confirm if there are seats available, hostess advised that there is no wait for seats in the restaurant. Upon arrival I was told that me and my girlfriend couldn't get a booth seat because they wanted to reserve those seats for groups of 4 and that they had no other choice but to seat us at the bar, which is ridiculous seeing as the restaurant was practically empty when we got there. We came here many times before and had an overall good experience with food and their staff, but because of this, I will never come back, comes to show that the owner wants to prioritize making as much $$$."}
{"text":"This place is fantastic. Came here with a party of 2 on a week night and was immediately seated.  We ordered 2 sets of wings and kept the menu in case it want not enough for the both of us. The wings were bigger than your tradition wings at St Louis or Wild Wings, not only did we not had to order anything extra but we had left overs to take home.  There are plenty of choices on the menu and wings were juicy and delicious. They even give you a choice of a few dipping sauce.  My only regret was not ordering the fries.  Bill came to ~$25, no longer have to wait til Tuesdays to eat wings! Will be back next time."}
{"text":"Huge portions! We were shocked by the serving sizes - onion rings, gar par wings, and beef ribs - and the great prices. Everything was twice the expected size. Wings were huge and fresh. Rings were just ok. Place was up to date, clean, and not that busy. Will definitely be coming back to try more items."}
{"text":"Many different flavours of wings to choose from and a good amount of dry and wet types.  Good atmosphere and friendly service.  Cheese cake is also great."}
{"text":"My new favourite wing spot! Decent service, the portions are huge, and you can't go wrong with the Monday deal (15 wings for the price of 10). 

Will be back to try out other flavours."}
{"text":"Amazing wings and a lot of flavours and optiins. Nice ambiance, friendly and good servers. Recommended for a hanging out."}
{"text":"I came here for my birthday and I wasn't expecting much but it was such an amazing place to have it at.  The service was great. The servers were so nice and polite and they didn't rush us either.  If you ordered something other than wings than it came quicker but it was definitely worth the wait.  The wings were really juicy, large, and you could actually taste the flavour you ordered with the wings.  The portions were huge especially he fries.  It was a quiet place with many tvs so you'd never be bored.  But I would 100% recommend this place and will definitely be going back"}
{"text":"We ordered Parmesan sweet potato fries, honey teriyaki wings and creme brûlée cheesecake .   Awesome food and great service!  We also received free t-shirts!  Thanks!  We'll be back!"}
{"text":"I came to fanzone with my family. The best referral from a friend who found this place and I'm so happy he did. The food was amazing portions were insane. Staff and manager willing to allow me to make changes to the combo. Beer was freezing cold and food was fresh could taste how fresh my salad was. I definitely recommend this place to anyone and everyone. The place is amazing TV'S everywhere good atmosphere. Will be back again for sure. Thank you to fanzone staff for amazing food and service."}
{"text":"Very new wing place that is NOT a big chain. It is a tastefully decorated sports themed restaurant / bar. Tv's at every booth and very clean. 

Beer selection is pretty good for such a new establishment. 

Now for the wings. Yes...there are many different types, they are VERY large, and flavorful!  HOWEVER, if you like your wings hot like I do, you will be let down by the heat...as an example, I bought homicide Greek the last time I was in and couldn't finish the pound I had ordered! So, I brought some home.  My wife tried them, and she thinks catchup is hot! She agreed with me that these wings were not very spicy.  Considering I ordered from the hottest section of the menu, I would expect my wife to die trying to consume them.

The pricing is reasonable given the generous portions and the staff are friendly.  Good job all around.  But please. ...kick up the spice a little!"}
{"text":"There's finally a bar in Scarborough I enjoyed.  From service to food, everything was exceptional."}
{"text":"Tried this place out last Friday with some friends after seeing the nice reviews on Yelp. Went there to catch the hockey game. I liked the way the TVs were set up and each Booth had their own separate TV which was convenient. We ordered some Thai and honey BBQ wings. The food and service was great. However later that night I battled a severe case of food poisoning. That experience makes me very hesitant to try that place again."}
{"text":"So glad we decided to check this place out. The wings are massive and oh so delicious. We got the honey hot Creole wings, calamari and a cheeseburger. I haven't had calamari in a bar of this quality in a very long time. Also, I'm usually not a seafood sauce person but their sauce is really good. The portion sizes are far better than most places and its not just a bunch of breading around the calamari for example. 

The place itself is really nice, spacious and has TVs at every booth. The server we had, Alli was also super nice and even let us stay for a few minutes after close until we finished our beers. (It was a Sunday)

If you live in Scarborough I definitely recommend checking this place out for some seriously delicious  food."}
{"text":"Holy cow if you love wings, do me a favour and please dine here. Wings are MASSive and succulent, definitely set the bar high against other contenders. Fries are bomb. Beers are always crisp and cold. TV is always playing a game. Happy belly = I'm a happy felly :)"}
{"text":"This place probably has the biggest wings I have ever had at a restaurant.  Lots of different flavours.

We had:

-Double Wings [20 wings with choice of 2 flavours] ($20.45): Each basket comes with carrots and celery and a choice of blue cheese, ranch or one other dipping sauce(I can't quite remember). We chose the pineapple curry and honey cajun.  The pineapple curry was okay.  I liked the honey cajun a bit better.  Although the wings were huge the meat quality was just okay.  Rating: 3.5/5 (3/5 for taste +0.5 for the size)

-Half rack of baby back ribs with loaded potato ($15.45):  The ribs were very average.  It's a bit on the dry side and nothing special.  The loaded potato is basically baked potato with small amount of bacon and cheese and sour cream on the side.  I don't recommend ordering this.  Rating: 2.5/5


One thing we notice after ordering is that they also have a baby back ribs combo for $24.45 and beef ribs combo for $24.95.  For this, you get half rack of ribs, your choice of fries or salad or loaded potato or onion rings, and 10 wings.  The \"details\" of the combo were not mentioned anywhere on the menu unless you ask the server.

Overall, huge very slightly above average tasting wings."}
{"text":"I was brought here by a friend who said the wings were amazing.  We went on a Thursday and the place was very quiet.  I had Garlic Parmesan wings.  They were excellent, very tasty and very crispy.  The wings are HUGE lol.  And I made a mess eating them.  One point my significant other pointed out I had sauce all over my face to which I replied: \"I'm saving that for later\".    The fries here are coated (ie batter) and that isn't MY personal preference but they were good all the same - and that was the plain ones...next time I step it up to \"Ultimate Fries\"

This is a hidden gem for wing lovers, and from what I've heard Calamari is awesome as well although I haven't tried them yet.  I forgot to take pictures of the dishes, but I expect to go again in the next couple days so I will update this review.

The establishment is very clean, lots of TV's playing different channels.   The one thing we noticed is the place is very bright inside due to the front windows, definitely goes against the general sports bar 'atmosphere' which is typically dark.  

The 'staff' were very friendly, attentive and helpful.  When we were there the owner was chatting with us very nice, polite and welcoming.  So was our waitress who seemed very knowledgeable of the wings/menu and very attentive to the table's needs.

I think this is a pretty good choice if you want to have some wings or ribs and can't say enough good things about our visit.  This place is NOT a chain, and I wish them all the best - I know they've got a fan here...  watch out wings HERE I (er WE) COME."}
{"text":"Was craving some wings while watching the Jays win the AL East Division and found this place through Yelp. The pictures we saw on Yelp did not do this place justice.  The wings are HUGE (just a lil chewy)!!! Dishes are good size portions and the prices were decent.  One of the best things about this place is that every booth has their own t.v. so you can watch whatever you want (just ask the server). The staff is friendly which is an added bonus."}
{"text":"First time for me and my dinning partner!! Both of us had wings and fries. FYI fries are a separate order. 2 orders of wings and fries=$ 28.70. Wings are huge, crispy and tender. 
Wait staff were very pleasant and professional.
The spicy wings are a bit on the vinegary side (think a spicy Tabasco) I hope that one day they will have a flavourful spicy sauce. until then, everything else will do... Spice UP"}
{"text":"My friends and I eat here all the time!
Always great service here and friendly staff.

So far my friends and I have tried:
- Chicken wings (various flavours). Their wings are always juicy and full of flavour 
- Garpar fries 
- Tex Mex fries 
- Onion rings 
- Calamari
- Fish n chips
- Ribs 
- Sweet Potato fries
- Caesar Salad
- Burger 

The food is amazing and good portions with all reasonable prices! I definitely recommend."}
{"text":"I have only ever ordered to go from here. When there is a raptors game on we call ahead and order for pick up and eat at home.
Serving sizes are great! I am working my way through the flavours and so far they have all been delicious. 
Fries are great and they also are served with great sizes.
Sometimes the people who pick up the phones can be curt and a bit rude. When I go in to pick up I have frequently had to wait for the staff to acknowledge me as they talk amongst themselves.
Does not give me much desire to eat in but the food is great."}
{"text":"If you like wings and sports, then you have to go here. The wings here are Gi-normous, and are drenched in the sauce of your choosing. If you grab a booth then you'll be watching what ever sport you enjoy.

Service was great, friendly and accommodating. 

Would I go back: Oh Yeah!!!"}
{"text":"My new favourite Wings place! Fanzone has the best and easily the BIGGEST wings I've ever had, anywhere. I have no idea how they do it (our friends and I think they do some mutations), but their wings are gigantic. 

Located off of Kennedy, you might miss it because there's a small sign and doesn't really catch your eye. Parking has never been a problem because we've never been at a time where they're fully packed. 

Me and my s.o. usually split 2 pounds and we get honey garlic always and something else. We did try 1.5lb each once and it was a big mistake. We were struggling to finish our last 3 or 4 wings. We also ordered the cheesy fries and they were fine. The wings are always delicious here. 

As a sports spot, this place has 3 or 4 (can't remember) HD TV's that play whichever game is popular. On top of that, each booth gets their own mini tv which isn't HD, but you can still go and play whichever channel you'd like. Definitely a nice touch when you want to watch something else. 

Overall great huge wings, great service, great sports atmosphere and will definitely be coming back weather it's to watch a Leafs game or not! 5/5"}
{"text":"I'll echo what many have already said...these are the largest wings I've had in my life. Not only were they huge, they were also very tasty. A must try!"}
{"text":"This is a great place to come and relax have a few pints and the wings are to die for. Over 50 flavors of wings, staff is very friendly \"great service\" & friendly atmosphere!!!!!"}
{"text":"Great sports bar. Excellent Hot Garlic Naked Wings, great flavour. 

Great place to catch any televised sporting event. Each booth has it's own tv."}
{"text":"Lets keep it simple, they have wings, burgers, ribs, fish n chips. I went with a buddy last night. They have a ton of flavors,and a description in case your not sure what it is.
These wings are huge, about as big as I have seen. They are fresh (never frozen) and meaty. Out waitress was very attentive, and seemed to know the menu. I may have found my new wing place in Scarborough."}
{"text":"The wings are really good. We went on Monday wings night, 15 wings for the price of 10. Great food and service."}
{"text":"If I could write a zero stars I would. I had such a bad experience that I went through the trouble of recovering my google account from 5 years ago. The food here is great, the servers however are another story. Never in my life have I thought that a restaurant could have such incompetent wait staff. We were a party of 6 who waited over an hour and a half for a table. 

Coming from a restaurant background I totally emphasize for staff on a day that has specials for wings. Even taking that into account I have never been so severely disappointed in my life; and my father walked out on my family when I was 5. 

We came in when the restaurant was just starting to cool down from the dinner rush, however being a party of 6, I can understand that finding seating could be quite difficult. We offered to split into two smaller parties as we saw that there were many 4 seater booths open. The waitress nodded and acknowledged my request and still made us wait another 30 minutes to get a 6 seat table. You can imagine how frustrated we were after waiting a total of an hour and a half while seeing parties who came after us actually finish their food and leave, leaving even more empty tables. 

By the time we were seated, half the restaurant was empty. I have never once thought in my life that anyone could be incompetent at such a simple task such as seating customers. Not even once were we apologized to or even explaination. We stood in the front for so long I actually thought that we somehow turned invisible. 

Such a shame to see another decent restaurant not care about it's customers. Absolutely ridiculous."}
{"text":"Great place for beer,  wings and tv!!!! For your game nights and UFC nights!!! If you want your games with friends and beer here's where you want to be. My friend owns this place and he's a great man who's super friendly. 

Service is good they take your orders on iPads (to me that's cool!) but don't expect your server to be like a chick from Hooters, they're proper :)

Wings are good; big and are definitely better than those franchises like Wild Wings and St. Louis. They're very tender but beware, if you order wet saucy wings they are very heavy and can fill you up fast.

Their Mexican fries are quite unique and they also have ribs, burgers and fish and chips. Oh ans Greek fries (pic uploaded)! You'll find soemthing you want here for sure and won't walk out thinking like it's just another pub. 

They have all your favourite beers on tap and also Coors Banquet too which is rare at most places. 

Come give it a try, few streets down from Kennedy Commons off the highway at a corner of a plaza (you may miss it on your first time)."}
{"text":"I would definitely recommend this place. It is easy to miss as its tucked away but worth the search. They have a great atmosphere with TVs everywhere - Steve will even change the channel at your request. Very clean and organized restaurant. Food is amazing (check out the size of their wings!) and I absolutely adore their onion rings. Oh and not to mention their TO DIE FOR crème brûlée cheese cake! Everything is ALWAYS fresh never frozen and beer is always on point. I've been here at least once a month for the past 6 month. They can even accommodate large groups (we had around 20 people)."}
{"text":"My second time here last night, I wanted to come back sooner but I always got sidetracked. 

As I mentioned last time- I totally love this place and my option of it hasn't changed. Some places compromise their service when they have an established clientele, this place is definitely not one like that. 

I felt that Steve being there really adds to the brand of his business and it makes me want to drive to Scarborough again just to go there. I haven't been here in 5 months and I was completely surprised that he had remembered both of us, it truly made me feel special. 

We were here for the Jays game, and the bar was packed with fans, but never once did I, or did I hear anyone around me complain. their service was literally on point. We got the $13.99 wings and pint deal and OMG I have found my new favourite wings.. the Mexican Ranch were absolutely DELICIOUS!!!! I get craving and I know those wings alone will make me drive back to Scarborough. Never had anything like them. We also had the Creole (can't remember now if it was the mustard or the honey) either way they where yummy too! 

If you're in the east, check them out! don't let the plaza form a judgement of the place because inside it's honestly awesome!"}
{"text":"Hidden Gem indeed. This place has awesome selection of wings, fries and more. The best thing about it is that each booth has its own TV screen on top of the large TV screens hovering around the bar. Sports fans will love this place, as it lives up to it's name Fanzone."}
{"text":"If you love chicken wings, you must try Fanzone wings!

Came here on a Wednesday night so it wasn't too busy. They had the Leafs and the Raptors game on the TVs. Our server was friendly and efficient. 

I ordered the Rib combo as recommended in another yelper's review. It did not disappoint, but it was ambitious. I got the Baby Back Ribs with Chipotle Caesar Wings and upgraded my fries to the Garlic Parmesean Fries. I enjoyed everything on my plate, but definitely couldn't finish so I took some wings home with me. The ribs were nice and tender as advertised and had good flavour. The wings were listed under Hot, however I did not find them to be hot at all which was disappointing so I guess I will try the Homicide version next time.   

As everyone has mentioned the wings are nice and big which is hard to find these days especially if you go to St. Louis where their wings are very small. I also really like the fries they use as they have a nice crispy coating. All in all this place is very similar to AllStar Wings and Ribs with a few less options when it comes to their fries and wings. I would come back here before going back to AllStars because I thought the food was better overall."}
{"text":"Not going to lie, this place has officially made the top of the list for my chicken wings and beer section! One of my friends mentioned this place so I came here yesterday with a small group of friends to celebrate a birthday and watch the Leafs game.

We got here around 5pm-ish to make sure we could get tables since we didn't know how crazy it would get with the Leaf's game playing around 7pm. Luckily it was fairly quiet and we got a table instantly. Service was on point and our waitress was super friendly! Too bad I didn't catch her name, otherwise I would have made a shout out to her for her great service and accomodations despite it getting busy later on in the night!

There was a Monday deal where you buy 15 wings for the price of 10 so we each got our own basket of wings. I decided to get the Lemon Pepper dry rub wings and we shared the Garlic Parmesan fries and Roasted Ranch fries as apps. Needless to say, my good choice of Roasted Ranch was popular among my friends but the Garlic Parmesan wasn't too far behind. Now the splendid WINGS! And I say WINGS with CAPITALS because they were HUUUGE! So huge that ALL my friends had to pack some for later. And mind you 3 of them were guys and one of which was at least 6 ft tall! So we talking guys who can eat here. Hell me and the other girl can eat too but these wings were undefeatable! I swear it took me 2 minutes to eat each wing LOL no joke...or maybe it just seemed that long or I took too many tiny bites haha! They tasted great! I definitely enjoyed the lemony peppery taste with a big ol' hunk a chicken! We also ordered a couple pints of beers and they were cheap! You don't find many places that have cheap pint of beers nowadays so that was even more awesome!

To top this all off (like a cherry on top kind of top off), their dessert!!! Now if you don't already know me, I'm a dessert kind of gal. I wasn't expecting much given the fact that 1) it was a bar/chicken wings and beer kind of place ANNND 2) I didn't expect much from the get go when I first arrived (was just thinking it was another chicken wings place, nothing craaaazy special). Sooo let's back track here, their chicken wings were great and quite filling so dessert could be 50/50 right? They didn't advertise any either so that makes it even more questionable...but let me tell you, if you order the Raspberry Greek Yogurt Cheescake, I'm sure you won't be disappointed BECAUSE we ALL were not! It was yummyyyyy! What better way to end the night with a nice tasty light cheesecake AND with a W from the Leafs!

Soooo to summarize all this long mumbo jumbo, I'll be back for sure the next time I want to chill on some wings, beer AND that cheesecake of course!!! Just need to make sure I earn this meal with a ton of exercise prior to! Hahahaha"}
{"text":"This place is a hidden wings and ribs gem!

Came here on an early Saturday night with family and friends. This restaurant is the first restaurant on the left, located in a small plaza at an intersection. There was no sign outside the plaza that cars can easily see either, so it's very easy to miss.

When I got there, we were the only ones and soon came another family. They turned their lights dim until the family came and their kids wanted to draw. The restaurant itself was clean and spacious. Booths on the sides and tables in between. If you got sat at a booth, it also comes with a personal TV screen. They have large screens hung all around the restaurant too. This actually reminded me of the newer Wild Wings locations.

We took a longer time to pick our food as everyone had different tastes. In the end, we ordered few burgers with fries and salad, a full rack of baby back ribs with onion rings, and two flavours of wings: Honey Parmesan and Honey Teriyaki.

I can speak to everything but the burgers. The ribs came first and 'WOW'! It came out better than expected - it was quite saucy and juicy, and the meat was tender. However, there wasn't as much meat surrounding the ribs. The onion rings on the side were amazingly good too!

As for the wings, I loved the honey Parmesan!! It wasn't the standard cheesy taste, it's more 'inclusive', sweet, and thick in flavour. The teriyaki was A-okay, too Asian-style for me and I generally don't go for teriyaki-ish flavours but it still tasted good (despite how I wasn't the one who chose this flavour).

Just FYI, the wings at Fanzone are super big! Compared to the ones I've had at All Stars and Wild Wings, they were more meaty and juicy. Bang for the buck? :P

Service was really nice as they were fast and accommodating.

For drink choices, below is what I know from my visit:
- Rickard's White & Red (Have)
- Creemore (Don't Have)
- Coke / Iced Tea (Have)

P.S. Apparently their current chef is one of All Star Wings' previous chefs.

I truly believe this place needs more attention and advertising. They deserve more reviews, customers, and exposure."}
{"text":"First off I want to applaud the restaurant's excellent customer service. I called in with a group of 14 with no reservation to see if they had room. Though they had reservations later on they were super accommodating about our group coming over so last minute and never made us feel like we were being stared down to leave. They also made sure to see if we were splitting our bills and gave us 0 trouble about it despite the size of our group.

Next great thing was food portions! My friends each ordered appetizers ranging from $6-8 and they were so shocked at the size. For that price they thought they could finish on their own, but 1 appetizer can easily be split between 2 ppl. I tried the onion rings which were fried deliciously! Batter was yummy and was supper crisp. Poutine wasn't anything fancy but the gravy was flavourful and cheese was deliciously melty. Only slight disappointment was with the wings. They were really crisp even with sauce but the sauces themselves were mediocre. Not bad though, so I would still order again if given the opportunity. Oh and for the designated drivers out there, they have refillable pop ;)

Will recommend if you're in the neighbourhood!"}
{"text":"Hands down the best wings I've had in Toronto. They have tons of flavours to try, none of which have been awful, though some are definitely better than others. Personally, I suggest something from their hot and wet choice.

Unlike other wings bars, Fanzone serves their single orders as a fixed 10 jumbo wings rather than single one pound orders. Because the wings are jumbo you're definitely getting your money's worth on a regular order. 

In terms of staff and atmosphere, I rate these guys the full 5 stars also. The owner/manager appears to be a very welcoming guy and the wait staff are always nice and prompt. The restaurant has a dozen televisions playing the big sporting event, with individual screens at the booths. Because the restaurant is unfortunately on the smaller side, seating can become difficult on big event nights and it gets loud at times with all the team spirit, not that the latter is a problem. 

I highly recommend Fanzone for watching sporting events in groups or even just to hang out with friends over some wings."}
{"text":"Yo this is the best wings I've had in a long time. its a good bar if you want to watch sports with your friends and the price is very cheap for what you get"}
{"text":"Meh, 
Large wings of the too much crunchy breading and swimming in boring pre-fab bottled sauces variety.  Take 10 supermarket sauces and mix and match 'em to make 101 flavours. (yawn).

They have lot's of TVs for sports watching, but it's loud due to the steel roof, and it's kinda pricy for a stripmall location in mid-Scarberia's furniture row.

Its a pretty good place to watch the game, and have some pedestrian wings, if you don't mind paying a bit extra for barely average food."}
{"text":"Figures that as soon I move out of scarberia this fantastic wing joint would move in. I was impressed! It's a large space that's great for big groups, with big tvs and smaller tvs in each booth. 

A basket of wings is $10.49 but these are no ordinary wings. They are colossal! You will easily have leftovers. My friend underestimated the size of these wings and ordered the double. As soon as our server placed those wings down on the table you could see the regret. Ha! He'll be enjoying wings for days. Our table mostly ordered wings. I picked up a basket of fries with gravy for $5.49 and are a decent sharing size for 4 people. 

I did get anything to drink but it looks pretty cheap. Pint of domestic for $5.75 and 2oz Martini for less than $8, not too shabby at all. 

The service is fantastic. Our server was lovely, engaged us in conversation and was very patient when we trying to decide on the menu. The food is served pretty quickly as well. 

I would absolutely recommend this place for your next wing/game night."}
{"text":"Wings too big yo, order less than you normally order at other places and play it safe."}
{"text":"Great place to go if you want to catch the game with some friends or just want to eat some wings! The place is updated and clean. Some booths even have their own tv! 

We split 50 wings between 3 people and that was more than enough food. We got buffalo, dry Cajun and garlic Parmesan. The buffalo and Cajun were both very good. I didn't really like the garlic parm bc it was a little too creamy for me. It reminded me of garlic bread spread. Other than that the wings are decent sized. 

Service was fast and friendly. Great place to go for a wing fix."}
{"text":"I absolutely love this place! I've been here about 4 times with a different crowd each time and it has never disappointed me or my friends. We always get the combo of wings and ribs with fries added with garpar sauce. I've tried a few of the flavours and they all were really good. I don't normally like beef but these ribs are decedent and so flavourful. The portions are huge and share-able between 2-3 people. Waitresses have always been kind and welcoming. Overall my favourite wings place I've been to thus far. 

PS. Come with an empty stomach!"}
{"text":"Ordered a buffalo chicken wrap, it came with Caesar dressing...  weird.  Should be ranch or blue cheese.  Maybe it's a Canada thing....

Anyway it was fine.  Nothing to write home about.  They were actually out of ranch dressing I think which is super weird for a wing bar, right?"}
{"text":"Where do you go to eat when you gather a bunch of athletes, have them workout for over an hour, then want to bring everybody to that lovely, full, happy place? Easy answer; wings. And as I found out yesterday, when you're in Scarborough, that means The Fanzone Wings & Ribs.

Fanzone is a single establishment on Kennedy, just south of Ellesmere. Based off of appearance alone, it doesn't appear all that different from your run of the mill sports bar. There are ample TVs placed throughout the restaurant, and plenty of seating for groups. For my tastes, it a little too dimly lit, but hey, maybe I'm just picky. 

A friend had heard that these wings were apparently larger than your run of the mill wings, so we decided to split fifty amoung the four of us and order nachos to get the ball rolling. I was expecting your typical nachos, but Fanzone proved me wrong. Because of my love affair with nachos, I'm well acquainted with stellar plates of nachos being excellent because of fresh and/or unique toppings, but Fanzone nachos take care of your taste buds by chip alone. I have no idea if they make the chips fresh, like they do their wings, but what they do do is ever so lightly dress the chips in butter or something similar. One of my friends described them as oily, but shame on her for that derisive characterization. They're strategically coated, and it's a genius touch. (Maybe not so genius for your waistline.)

As for the wings, as I mentioned, they're big. Not just in a \"sorta\" or \"ya, maybe\" way. They're hefty, which is why we were glad that we under-ordered compared to the number that you may typically order. But these wings don't stop at being large. Maybe because Fanzone starts by using fresh and not frozen wings, these guys are amoung the best wings I've had! 
Supported by the freshness, some of their toppings really hit the mark. We ordered garlic Parmesan, honey garlic, and the mandatory risky choice, honey hot Creole. The garlic Parmesan were fine, but honestly meh compared to the other two. The honey hot Creole stole the show for me, with an interesting, yet simple mix of sweetness and Creole heat. 

Aside from some better lighting and maybe a different colour scheme, (again, maybe I'm being a nagging Nancy), Fanzone could use some help with their bathroom cleanliness. It's not horrible by any means, but it would help with the overall experience.

All in all, I'm really glad that we discovered this place! Though I don't really care for the tacky sounding name, the wings are fire, and the nachos have strength. I'm looking forward to the next excuse to get wings in Scarborough."}
{"text":"Probably the best prices I've seen at a sports bar in a really long time. Beef ribs are a must, and their wings are massive + delicious. Fanzone will be one of my favourite spots to catch a game in Scarborough now. Will definitely be coming back soon!"}
{"text":"To start, this place has the biggest Wings that I have ever seen in my life. Usually, a pound will leave me satisfied but still a little hungry. However, after eating half my pound of wings at Fanzone I was already ready to tap out. The wings are huge but it makes you wonder how much water or additives are added to these wings. First few wings taste good but after your 4th it just tastes like your eating batter. Although, I am not a huge fan of their wings a few friends of mine are - so I would suggest trying it out to see if you might like it. The service was also very slow and the seating is limited. If your looking for quantity for your buck this is the place to go - however, not the best quality."}
{"text":"The wings themselves are fantastic: gigantic, perfectly crispy and breaded (not too much, not too little) and juicy as hell on the inside. My only complaint would be that their homicide sauce was not as spicy as I'd like, and also saltier and tangier than I'd prefer. 

Their fries are my favourite type of fry: crazy crispy on the outside, soft and creamy on the inside. A side order was almost comically large. 

Service was very friendly and the food came quickly. The ambiance is great, a zillion screens, lots of booths and it was pretty quiet for wing night. Parking CAN be an issue, as it's in a plaza, but it's worth it."}
{"text":"No one likes to be left in the friend-zone with the object of their affection; but anyone who loves wings will feel like they scored a home run once they've been to Fanzone. 

I was here on a Monday, which is their '15 wings for the price of 10' special. Let me tell you what I'm sure virtually every other reviewer has already: the wings are huge. These wings are from chickens that were definitely lifting before they met their eventual fate.  I'd say these are comfortably 1/3 bigger than even typically large wings served elsewhere. Ordering 15 wings here is a wholly different experience. Anyone who ordered their own had left overs, and anyone who shared still had more than enough.

The sheer size of the wings and daily special already gave a virtual guarantee of being a win, but I'm happy to say that Fanzone does a terrific job on the preparation of the wings as well - not to mention the huge variety they have as well. I'm craving the wings as I write this, simply based on how well they did them.

I also had their Jalapeño poppers and potato skins. Not too much to say about them, but they met expectations.

Add one more fan...of Fanzone."}
{"text":"It's safe to say, I just found my new all-time favourite wing place! 
After hearing good things about this place from friends, I came specifically on a Monday night for their post-5pm special (15 wings for the price of 10) and boy, was I not disappointed. There was a large variety of flavours to choose from and the wings were absolutely HUMONGOUS. I'd definitely give this place a 10/10 for value for price since I can normally eat 1.5 pounds of wings but here, I could hardly even finish half the basket?!

With a sports bar feel, the interior is very cozy and clean with lots of TV screens (even a mini one at your very own table if you sit in the booths)! We went around 9:30pm and it wasn't busy at all so the food came out quick and pipping hot! 

I would definitely recommend you try this place out on a Monday night!"}
{"text":"Came here last night to watch the game and have some wings.   Place is pretty good on both accounts.   Food comes pretty quick and portions are massive for the price you are paying.    The wings themselves are pretty big as well.

For our appetizer, we ordered the mozzarella sticks (comes with 2 choices of dip, I took the Cajun).  Also got a plate of onion rings.   Really good size helping for $5.99.

The wings were on special (Mondays - you get an extra 5).   I ordered a dry lemon pepper.   Flavour of the rub was good.   My friend wanted something more saucy and ordered a honey chili covered in Parm sauce.    That wing was pretty good as well.

Would definately come back again if in the area, as there are tons of flavours to choose from."}
{"text":"Came here to celebrate my birthday. I highly recommend this place. Interior and atmosphere is nice and modern. Their bar looks sophisticated and the best part are the wings.

Wings are HUGE!! We ordered 100 pieces of chicken and was not disappointed. Although our group (10) had their own preference we loves the honey Parmasean and the garlic parm (classic flavours). We also odered hot creole and Cajun.  We weren't a big fan of the hot creole. 

Anyhow, service was prompt. Our server kept coming back to refill our glasses without asking as well as change the bowl (for bones) as soon as it filled up halfway. 

Try this place. I will definitely come back. I prefer this place compared to all star wings or wild wings."}
{"text":"Wanted to give it 5 stars based on a previous 2 visits but our 3rd try was not as good. Like a lot of places, they get something great going on and then change it and ruin it.
We ordered the lemon pepper wings and a side of onion rings. The wings were way overseasoned. The onion rings were not the same product they served us before. Reminded me of grocery store frozen bagged ones.
The wings didn't seem as big as previous visits. I could barely eat 5 wings, they were that huge! Not so now.
Wondering if they have changed ownership, which usually results in a winning formula being scuttled.
We might give them one more try to see what's going on. Hope I am wrong and caught them on a bad night."}
{"text":"Best place in town for wings!

Found this place on Yelp over a year ago and I have never been disappointed with any of my visits. It's really a great place to watch a game with the guys or to catch up with friends. 

The owner Steve, is a really cool guy who treats all his customers like family.

Food: The wings come in a variety of flavours (I've already found my favorite one and I'm sticking to it).  One wing at Fanzone would equal to 2 at other places! 
The portions are generous and the flavours are bold. 
Other appetizers worth mentioning would be the the nachos (asking for layering of the cheese) and the jalapeno poppers. See   pictures below.

Try FANZONE and you won't want to eat wings anywhere else."}
{"text":"Came here with a friend who raved about this place. Great place for wings or to hang out! Booths have their own individual TVs so you can watch whatever sports you want. Definitely an excellent place if you're a sports fan and loves some food.

Their wings are HUGE. So meaty and tender!! Sauce is coated nicely on the wings (not too heavy) but the sauce flavours are pretty standard. I gotta pair my wings with fries and their regular fries are just as good - soooo crispy and quite a large basket. 

Service was good but could be understaffed on a busy night. Great atmosphere, especially on a game night. Price is similar to other wings places but the wings are 2x the size as others! Not sure about other stuff on their menu but their wings and fries are definite winners!"}
{"text":"Arnold Schwarzenegger sized chickens make for pumped up wings!  Monster wings that were done very well.

A relaxed non pretentious spot, that's kinda a no super frills sports bar but in a good way.  There's no mega tv wall or super goal light sirens or fireworks or \"restaurant stadium\".  It's a room, lots of tvs, and smaller tvs on each banquette.   Normal human beings for servers.   Done.

Not sure why you'd go anywhere else for wings if you're nearby."}
{"text":"The wings are huge. That is all 

Pretty much in the heart of Scarborough the location isn't the more heart warming but the food makes up for that. Staff are helpful and friendly for the most part, check up on you here and there and aren't too annoying. The place is a bit dated but overall has a great sports bar vibe to it.l mean it's not really a place to go on your first date.

 The prices are competitive when comparing to other wing joints but the quality is much better than said competitors. Owner is also super friendly walking around conversing with customers as well as helping his servers by clearing tables and other small stuff for them. 

I usually get a pound of wings and Mexican fries to share with the table and that's more than enough food for me and I'm not a small eater... ok maybe I'm the complete opposite...

Last time I went I got the combo with baby back ribs and it was worth the shot, ribs were cooked perfectly, the char on it was good and did not give off a burnt taste. The meat was very easy to separate from the rib and the bbq sauce went well with it. I usually opt for garpar and they really sauce up the wings making sure you get flavour in every single bite, competitors in the proximity need to take notes ;). 

They do have a Monday special that you get 15 for the price of 10 (11.99 I believe), but considering I can't even finish 10 I don't mind skipping the crowd and coming on a off day (they're still somewhat busy FYI) 

The only complaint I have is, the washroom aren't always in the best condition and seem almost forgotten at times."}
{"text":"This is undeniably THE best place to get wings and ribs! I went here today, and I didnt even use my knife to cur the ribs...IT WAS THAT TENDER. If you wanna see my full review, please read it on http://www.wanderlustous.com"}
{"text":"I'm giving this place 4 stars based off of 3 things: interior setup, food, and price.

Interior:

Great spot to catch a game. It's hard to find a place that plays the Raptors game on every TV WITH SOUND since we in hockey town, bwoy! The booths also have individual screens which the owner/manager (who seems really passionate about delivering a great customer experience) can change for you to any channel upon request. I saw a group of people in the corner watching CP24. The larger TVs are also well situated so you can get a view from wherever you're sitting.

Food:

I am not totally convinced that the wings are not actually baby legs. They're huge. Absolutely massive. I loved it.

There are several different flavours to try. I will say, as recommended by a friend, the hot sauces run milder than advertised, so if you like to feel the sweet, sweet vinegary burn, go hotter. I got the Hot Honey Jerk and asked that they toss it in \"Homicide\" instead of hot. They were great. I got a double so the second flavour was Chipotle Ceasar. A little heavy on the Ceasar because it's drizzled on top rather thickly, but if you mix the wings up a little yourself, it's really good. I would suggest a lighter drizzle or tossing the wings after the Ceasar dressing is put on. 

Regardless, I tried and I can't remember having better wings anywhere.

Price:

I felt like I came out ahead. 1) free parking. Fanzone is in a stripmall/plaza. The double of wings I got was $22.99 I believe. For the quantity you get, that`s incredible. Most wing places you`re paying more money and getting smaller portions and wings.  

Beer was, I believe, $15.50 for a domestic pitcher. That's great compared to other places you would go in Scarborough to watch a game and definitely much more affordable than any place downtown. You can find cheaper pitchers, but the beer is always flat and tastes like it is made in a bathtub out back. Fanzone beer, however, was cold, crisp, and great mouthfeel.

The one \"knock\" is that the service was slow. This was largely due to being understaffed, it appeared. There was never an empty table (there was actually a huddle of people around the door waiting for tables to free up) and there was only one waitress who was taking orders and waiting on the tables. The owner/manager and another girl ran out food, which came rather quick when we were able to put our order in, but the entire restaurant side was covered by that one waitress. 

The manager/owner, however, is very accessible as he is always walking around, and he'll take orders and act as a waiter quickly and efficiently. Just flag him down when he's walking by.

Regardless, me and the boys were hanging out and watching the game, so we were in no rush and didn't mind at all. I would say if you're in a rush, this probably isn't the place for you.

Would definitely come here to catch a game in the future and try other things on the menu. This is also now my go to wing spot, and it should be yours too!"}
{"text":"I've been here three times now and it's never that busy so you'll be seated right away. Hands down, the best wings I ever tried. There are many flavours to choose from, the breading on the wings is perfect and the fries are soft and crunchy."}
{"text":"Great atmosphere. Clean & spacious with many Tv's. Our server, Alie, was prompt and very personable. Had the wings, Mexican fries and ceasar salad. All very good with very generous portions. The wings are super huge...will try the more popular flavors next time as the ones our party ordered were just alright.
Excellent!!"}
{"text":"I had been heretwice,.  both times I had their wings only.  The thing I liked the most was the size. These were big wings are for the typical prize you play at other joints. The waitress told me they sell by amount not weigh which is good.

The waitress (Mary) was pretty knowledgeable and had great suggestions for what I should try. I like sweet wings so I had to go with honey mustard and maple. She added bbq at my request with no issue. They were favourful, just mustard overpowered the sweet side.

Which lead to her suggesting the Creole Mustard (I hadn't hear of it before) next time I was in that what I got.

They have a few special that aren't advertised but she was kind of enough to tell me.

Fanzone was definitely different from most wings places with service, size of the wings and so much more. I still plan on going back a few More times."}
{"text":"this was a nice place to go to uptown to watch games and hang out with friends while grabbing a bite to eat. at first, i was expecting any old bar but no. it was quite spacious and clean and the added bonus, TONS of tvs including one at every booth. 
their food was pretty good as well. their gar par fries were delicious. their tenders looked really good as well, and assume they are as a couple of my friends polished theirs off. their wings though - - HUGE! Like seriously. i would say they're about 1.5 to 2 times bigger than the ones you get at your typical all star wings place. and they had plenty of flavours to choose from but not too many that it became overwhelming. an order of wings consists of 10 wings. between a friend and i, we ordered 2 orders and only managed to eat 12. i would recommend this place to all the chicken wing lovers out there!
they also have a couple other items on their menu aside from wings, tenders, and fries. i noticed they had salad, ribs, fish and chips, and burgers as well but didn't try any of them.
the service was quite fast and our server was nice. the atmosphere was moderate. not too loud dispite all the tvs but it wasn't quite. for a wednesday night at about 8:30. half the place was filled up."}
{"text":"Decent place, did its job to keep us fed-straight and plain; food was nothing memorable but didn't didn't suck either. Typical bar food although the fries and onion rings were on point. Ribs and wings are priced pretty much like everywhere else (still pretty $$). Try the Mexican fries...not on menu but worth trying. Perhaps if you were a sport fan then this place would be more appealing but as a foodie it's plain and average-a bit on the boring side."}
{"text":"What can I say? 

One of the best wings you can get in Toronto based on size and breading along with the generous portions of various sauces. 

There Garlic Parmesan fries are amazing along with the calamari. The tartar sauce had a nice tangy bit to it that made dipping them an adventure. 

The reason behind the 4 stars is the they do not have any wings that are remotely hot, the suicide wings are mild at best. Also, they messed up our order twice by forgetting to pack our burger and 1 LB of garlic parm wings. 

I would like to add in however that the owner actually came running out to hand us our burger and apologized to us. He did say that the next time we come, a beer is on us. We then proceeded to head back to our base to indulge in the grub and noticed that they didn't pack the wings !! I called the establishment and spoke to the owner who then offered us two options, we can refund you the money or you can come back to get 2 LBs rather than 1 LB. 

5/5 for quality 
5/5 for portion size 
4/5 for wait time - they were busy this tonight because of the ALCS 
5/5 for customer service - the owner truly cares 

This place would be an easy 4.5-5 star place if they didn't mess up our order."}
{"text":"Found this restaurant via Yelp when driving nearby on a snowy cold day. Looks very shabby on the outside, and was quite difficult to find. Once inside, its a whole different story, very comfy and modern.

I like this place even more than All Stars (one of my favorite wings restaurants). Their TVs are everywhere. Several on the walls around you along with individual ones you can control.

Best part of Fanzone is the food. Delicious. Can't stop thinkin about the Parmesan Garlicy Wings and the triple cheesy fries. Their portions are also double other wing restaurants. Could not finish and that's a first for me. Thumbs up."}
{"text":"Wtf?. Where's the marinara dip!? Ah well who cares, everything I tried was really good. Portion sizes are huge..I went with a group of 5 stoners and let's just say each of us had food to take home. 
 
I had the HONEY PARMESAN wings;
Tossed In Honey Garlic, Topped with Caesar Dressing. I added hot sauce, since this was one of their milder sauces. Warning: Their wings are massive (wings on steroids) and saucy. There are lots of flavours to choose from. Overall I give them @ 5/5 score. 

CREAM CHEESE POPPERS
5 Jalapeno Poppers Breaded And Filled With Cream Cheese. Served With Your Choice of Ranch or Cajun. (if only they had a marinara dip :'(  ) . These are fairly big and crispy, and have soo much cream cheese inside. Overall I give this appetizer a 5/5 score. 

MOZZARELLA STICKS
Six Battered And Fried Crisp Mozzarella Sticks.. Served With Your Choice of Cajun or Ranch Dip (where the @##$ is the marinara!) These are the best mozzarella sticks I've tried. They are big and oozing with stretchy cheese. Overall I give this app a 5/5 score. 

GARLIC PARMESAN FRIES
Caesar Dressing And Parmesan Cheese. (Insane amount of grated Parmesan cheese on this!) 5/5

SWEET Potato fries. Soo moist. 5/5

Lastly,  the calamari is also a great pick. Perfect  squid to breading ratio. Goes perfect with the seafood sauce. 

Decor: The booths can only fit 4 adults. Six seater booths would have been nice,  but unfortunately this isn't a big enough place. They have a lot of TV screens, and most importantly, had the raptors game on that night. 

There were 5 of us who each got an order of wings. Let's just say with all those appetizers we could barely make a dent on those enormous wings. 

One yelper gave this place a 3 star rating because quote 'too saucey'. Well then missy,  that's why they have the naked or dry seasoned wings."}
{"text":"These are the BIGGEST beef ribs.  Wings are huge and the selection of seasonings immense.  Greek salad is elevated beyond anything I ever thought I'd say about, well.... greek salad.  Sweet potato fries portioning leaves something to be desired (a few more fries please?).  Friendly staff make it one of my new favourites."}
{"text":"First time I came here I was a little disappointed but maybe it was because it was late night and they were closing soon (also because I had buffet at East Side Marios a few before as well lol). But I decided to give it another try as I did hear great things about this place.

Their wings are larger than your regular sized wings, and the batter itself was nice and crispy and evenly coated the meat. We got the creole mustard, honey parm, dry wings Cajun, hot honey. I really enjoyed the honey parm and creole mustard as I think the flavours delivered as the description. In terms of their dry rubs, I personally don't like dry wings and sadly they didn't convert me either lol they were ok. The hot honey was also quite flavourful and not as vinegary when it comes to hot.

We also ordered onion rings which were good but nothing special. Then we ordered fries - roasted ranch and Mexican. The roasted ranch dressing was delicious and I liked it more than the Mexican, but the Mexican was made well with loads of toppings.

Overall great place to eat with a group of friends."}
{"text":"Very disappointed to be turned away from this place during the raptors playoffs. I understand they would like to maximize their space however for a table of 2 they wanted us to sit at the bar although half their restaurant was still empty. I rave about their food however at this time this was very disappointing to be treated like this. I hope the owner/manager does read this review and take it under their advisement to either provide tables that seat two as not every one will come in as a group of 4"}
{"text":"Large and crispy wings!!! Sooo delish !!! We tried the hot money creole and smokie jerk!!! Lots leftto take home. Love the food !"}
{"text":"By far, the best wings place in the GTA. I never liked the large wings as I don't think they taste natural and I never thought I would like the huge wings,  But these wings are fresh, meaty, scrumptious and natural.  Their sauces are just top notch and some of the wing flavours have added herbs and spices, even real garlic.  The mexican fries is gigantic and ohhhh so tasty.  I would drive from the west end to Scarborough just to do take out here, that's how good it is!!!"}
{"text":"We ordered too much. This is usually my problem when I go out to restaurants but we clearly missed the mark on this one. We came here evening time to grab beer and wings. The best standout flavour was the Creole mustard. I'm a big mustard guy. I usually opt for mustard as my go to condiment. My friends ordered gar par and BBQ. The BBQ was okay but the gar par just tasted like I was eating garlic bread which I didn't like as much. I decided to claim the Cajun mustard as my own. Great atmosphere, small-ish space and lots of TV's which is all you can ask for. The fries were nice and crispy. Good quantity and would definitely return if I was in the area."}
{"text":"The wings are amazing here. I got the garlic parmesan and the honey garlic (in the medium section). They were so flavourful and hot when served. The price for the amount of wings you get is very decent, I could not finish it all! Nice place, less busy on the weekdays :) The service is really friendly and attentive! Will be back again."}
{"text":"Good large battered wings, good atmosphere for the NBA game too. Wings can be too saucy and soggy. Overall great value"}
{"text":"Came across this place on our way to White Shields Plaza, so I thought I'd check it out.

Came here on a Thursday early evening, and the place was not busy at all. Service is great and friendly. It takes a bit of a while for the food to come, but that's ok. If you are seated at a booth, you get a small TV which is a nice touch and quite entertaining.

I ordered the chicken tenders with onion rings for $10.75. The chicken was soo tender and very tasty! The onion rings are great as well. Great overall.

My BF ordered a half rack of baby back ribs with a loaded potato on the side for $15.45. Food is great as well, the ribs are delicious!

Over-all, really good food, but is a bit on the expensive side, but I think it is worth it, as you get a really huge serving. The server was friendly and always made sure to check on us.

Oh, and also their bottomless coffee is very strong! :)

I will go back if I am in the area to try their other dishes."}
{"text":"Came for lunch on Monday. I understand dim lighting, or I try to, but Fanzone's lights weren't on at all. They did turn some minimal lighting on about halfway through our meal though. They also have an unusual amount of TV's. Our booth had its own TV. It's nice if we were going to watch a game or something, but a distraction having CP24 always running right next to my eyes when I'm trying to have a conversation with someone. I suppose I could have asked to have it turned off, but there was only one waitress doing EVERYTHING other than the cooking. I feel sorry for her.

Shared the beef rib combo with a friend. I believe the combo was $24-25 before tax and tip. The menu doesn't actually say what this combo includes, so we asked. Their combos are half a rack of ribs, ten wings, and a side. We opted for honey bbq teriyaki wings, and a Greek salad. The wings were very large in size, and quite tasty. The beef ribs were quite smokey in a bbq sauce kind of way, and  were also tasty, but I preferred the wings. I shouldn't have tried to compare to my last experience with beef ribs (Amazing. At Black Ox Bistro, FYI). Their Greek salad had a lot of feta, and also had olives. For a wing and rib place, I was pleasantly surprised.

I would come back for the wings and the salad, but not the ribs."}
{"text":"Stumbled across Fanzone on yelp searching for new wing joints in the GTA area... Yelpers had some great reviews so decided to give it a shot. 

I ordered the Honey Parmesan wings... Let me be honest ... I will never go to wild wings or all star wings again. The wings here are massive and they were made to perfection.  I thought MaRkham Station wings were big .... These are bigger and taste so much better. Along with the wings I ordered a side of sweet potato fries which is always good.  I think during my next visit here I will try there spicy wings. 

Me and my guest were lucky enough to meet the owner of the restaurant, Steve ... Who is so friendly and he made sure to check up on us every so often to see if we were okay or needed anything ... Very accommodating.  Our waitress was excellent and she made sure that our stay was a good one. 

We were lucky enough to try there fried cheesecake ... Didn't know what to expect at first but it was very very good. 

I would definitely come here again for there great wings, great service and great atmosphere. My new fav wing joint!!"}
{"text":"HOLY WINGS! THESE BLEW MY MIND!

I definitely stalked fellow yelp friend Johnny L here, because this scarborough area is definitely not my turf. In fact, I don't know many gems around here. Service is really nice and prompt, and food came out super fast. This place is so spacious and there is an individual TV in every single booth... what!!? The menu is like all stars, but the food is like an all stars upgraded.

The wings are the biggest ever- literally the size of my palm. Breaded to perfection (not too heavy like KFC breading), they were so fresh, juicy and meaty. Amazing, really. We got roasted ranch and a dry wing- roasted pepper? The dry ones were amazing and spiced to perfection. The roasted ranch was very heavy and delicious. We made the mistake of ordering 2 singles on wing night, which gave us a total of 30 wings. We ended up having to pack up 10 wings or so, because we didn't want to be uncomfortably stuffed. We also had garlic parm fries as an app which were really tasty, crispy and hot, but we really shouldn't have let our gluttony demon tell us that we could finish them, because they were super filling.

Scarborough gem that I definitely need to return to! To the people that said this place is too pricey.. are you kidding me? St. Louis's little midget wings are $12.99 for a pound and here it is only $10.95 for a pound that's too much to finish. I found this place cheap as fuck for what you get. I'll be returning on monday nights, guys!"}
{"text":"This sportsbar resto serves much better wings and ribs than St. Louis, All-Star and Montana's. It is less expensive too. Their Mexican fries are delicious! Huge portions as well.

Our waitress May is friendly and efficient. We will surely come back to this resto with family and friends. Highly recommended!"}
{"text":"Wings are huge .. I wonder how big the chickens that had these wings are .. I had the hot carribean jerk which tastes exactly the same as the Jamaican jerk at Allstars .. my brother had the homicide which was more salty than spicy .. my jerk wings were spicier .. service was good and fast .. music was bearable not to loud .. if only they had a real hot sauce"}
{"text":"I actually got overwhelmed by too many choices for wings. They are good but so far I have not been blown away by the wings so 3 Star for that , but I am giving 5 star for their Ribs and Fries. The ribs are just that good! Falls of the bone and melts in your mouth. 

I have tried both half and full racks but the full is not exactly double in size. Half has 4 bones but the full has only 6!

I will keep trying new flavors for their wings on their Wing days which is Mondays. Just a thought, I think the owner needs to change their sign, it is way too dark and small, it needs to shine and be visible to all."}
{"text":"Felt like eating wings today so I came here with my bestie. We ordered onion rings, jalapeno poppers and double wings (2 flavours). Service was fast. And our waitress was very nice. Wings are huge. We had parmesan wings and honey bbq and it hit the spot. If you feel like eating wings but don't wanna do the usual wild wings or all star then this place is a good spot to hit up."}
{"text":"My boyfriend is not a big fan of where this place is located nor is he a fan of dressed wings but I made him take me here anyways. 

We came here late on a Friday night and the place was packed. 

The waiters and owner were super friendly and they were able to take our order right away. 

I ordered the Parmesan garlic wings and to my surprise they were very tasty and good. Their drinks here are also super cheap. 

I made the mistake of ordering the wings and onion rings and I could barely eat and get through half of my wings. Basically if you are not a big fried food eater do not order a bunch of stuff for yourself make sure you have someone to share it with. Overall this is a pretty friendly hole in the wall spot, The wings are worth the hype and what everyone says"}
{"text":"Bang for the buck!
Went there on my birthday, we ordered a Full Rack of Ribs and  Wings. What really stands out is their serving size, wings that are actually not tiny and magnanimous beef rack ribs!
Not to say that the size took anything from the taste. All of that for a really reasonable price.
10/10 would go again."}
{"text":"Typical sports bar at night with the noisy fans cheering wildly; but more quiet and subdued during the day. Lots of big screen TVs hanging from the ceiling and over the bar. Cozy elevated booths with hooks at the ends to hang your coats. Each booth has it's own TV; you can ask the waitress to change the channel NICE! Friendly, quick waitresses that don't hover but will shoot the breeze with you in between serving the other patrons.

THINGS WE'VE TRIED:
- Lemon Pepper wings - good taste but eat them while they're hot or the coating will get hard.
- Honey Hot Creole sauced wings - very saucy! Loved the mild-medium (not hot) spicy Creole mustard that they drizzled over the sticky, sweet wings.
- Potato skins topped with crumbled bacon and cheddar cheese accompanied with sour cream. Good taste but the inside of the potatoes were overcooked and mushy; edges were crisp though.
- Caesar salad - was good but the croutons were hard and salty so I ate it without them.

Wings are large and come out hot, juicy and crunchy; even if they're sauced, they still have some crunchy edges to them. They are generous with their sauces so if your don't like that much sauce, you might want to ask for sauce on the side instead. I appreciate the bowl for the bones and wet wipes to wipe off your sticky fingers when you're done devouring your meal."}
{"text":"Coming here I did not have any expectations, however after leaving this place I consider this place for wings.
Though the outside doesn't resemble much of a bar, not is it in the nicest looking plaza, Fanzone brings a crowd. 
Came here one Saturday night to catch up with an acquaintance over a football and basketball game, we decided to order wings. Twice we were forewarned by our server that the wings are huge, and they were. Fanzone has multiple flavours much like All stars or would wings, but I find the quality, size and price is a lot more reasonable at Fanzone. Aside from wings, they serve up your comfort bar fares. Service is exceptional and overall experience was great. 
Do check this place out as they have featured specials. So stay tuned."}
{"text":"This place is amazing.

The owner- Steve is an all around class act.

If you want quality- go here."}
{"text":"Great atmosphere, the wings taste even better when you sit down & enjoy them with comoany. Will be going here regularly!"}
{"text":"Honestly this place has replaced all star wings for me. I used to go to all star for their big juicy wings. Now their quality has gone down to tiny shriveled up wings. Fan zone has been quite consistent with their portion sizes let's hope it continues over all good flavours. Staff could be a bit more educated in terms of flavours and to help the customer make a good choice."}
{"text":"These aren't your wimpy chicken wings...these are bigger than my head size chicken wings.  Ok kind of an exaggeration but you get the point.  A cool spot to get your finger licking on and watch some sports on the tvs. They have a lot of booth seating and a few large tables in the middle of the room.  It's clean and the service is friendly.

Their wing menu is quite impressive - in fact a little too much choice for me as I get easily overwhelmed. but I decided to be a little saucy and go for the BBQ Teriyaki wings.  Normally I like my wings dry and no sauce.  The taste was definitely there - a hint of teriyaki and the smokiness of the BBQ - which was good because I was having second thoughts thinking it was going to be overwhelmingly like eating a bottle of teriyaki sauce.  

On Mondays they have a special - 15 wings for the price of 10.  You can definitely share an order - the wings are supersize!  I managed to eat about 5-6 and had to take the rest home, which they will gladly pack up for you.

The parking lot is a bit small, but overall a great place to kick back and enjoy

cluck cluck for a few bucks  :)"}
{"text":"Great service. We went on a Monday just after 4pm so it wasn't busy. Our server was super friendly and very informative, also letting us know items that were not on the menu. 

They have 15 wings for the price of 10 after 5pm on Mondays. 

Wings were a plenty being large, juicy and very falvourful.  Mexican fries were massive so it's a definite dish to share. 

They just passed the 1 year mark of opening."}
{"text":"Terrible experience!!! Didn't honour their reservation. The manager said he seated people \"an hour earlier at our table and couldn't kick them out\". I made a reservation 8 hours earlier. They didn't apologize, didn't even offer a seat at the bar while we waited. We were very excited to watch the Raptors game. After waiting for 20 minutes we asked him again why we were standing by the doors when we made a reservation and again he said he couldn't kick people out he gave our table to an hour earlier. At that point we left. Don't expect your reservation to be honoured here if you're planning to watch a game you're looking forward to. I've never seen this happen before. He didn't apologize once. We figured out while watching the servers talking amongst themselves that they booked way more people than they had tables for. The manager actually had the audacity to say \"your reservation was at 7:30, if you came at 7:15 you would have had the table.\" So rude, so unprofessional."}
{"text":"BEST WINGS EVER!!!  
I have had my share of wings and have gone to many places. Usually a place starts off with good massive wings but they eventually get cheap and make their wings smaller. This place by far has the biggest wings in Scarborough to date! 

Had the (standard)  honey garlic and tried the dry rub Parmesan on breaded wings and had the BBQ teriaki wings grilled.... You have got to try the grilled wings!! 

The place has a nice modern decor it's lined with booths and every booth has a TV.

They play sports and UFC. I'll definitely be a repeat customer."}
{"text":"Second chances are rare to come by but I think this one deserves it. My last visit was quite harsh but admittedly it was takeout. I came to the realization that takeout + wings = a big sloppy messy pile of poo.

So this time we stayed. Our servers were real nice and provided great and efficient service. We ordered like 9 flavours or so and for the most part I don't quite remember what they were. LOL My consensus is that the dry rub flavours tend to be more distinct and memorable. Cajun, lemon pepper...etc they were quite tasty. Of course the garlic parm is a fan favourite albeit it's a little heavy and will wear you down quickly! The wings overall taste fresh and tender (wouldn't say they are juicy) with just a right amount of batter. They were neither crispy nor soggy but had overall good texture to them. The flavours aren't quite infused into the meat as they are mostly on the skin but that's very typical. It's very rare to have wings that taste good inside out unless if it's smoked. These wings are on roids! Each one almost as big as a body builder's biceps! I am a little confused though why they leave half the tip on the wing but I like the tip so it's all good. I can see some being annoyed.

The prices are actually quite good for around a $1/wing. Tons and tons of flavours to choose from so you will definitely find something to appease everyone in the crowd. Lots of TVs to watch the game as well so it's a great place to hang for a few hours while following your favourite team.

Great wings, great service, incredible selection and TVs everywhere = an awesome joint!"}
{"text":"This place has the BEST wings! They have the biggest most scrumptious wings i've ever had. Customer service was also top notch - they were friendly and patient; they also gave us more napkins without us even asking. 
I will definitely come back soon... my boyfriend is a real fan!"}
{"text":"The wings are big, and yes they taste good. Unfortunately there's a BUT. What I was not okay with, is the service by this Asian waitress. When i first came in with friends, we asked if we can sit in the booth so we can watch TV closely. She gave me the expression like we were talking crazy. FYI, most booths were empty. Also during the night, she just looked piss off. We don't know what did it, but for people who come in and try to enjoy their night by having some delicious wings, maybe that's bit of attitude that we don't deserve?

I will go back again for the wings, but I will refuse her service."}
{"text":"looked online to see what restaurants to try on a friday night tired of the regular fare around the area. Came across fanzone and was impressed by the reviews.

first off its a little hard to find when driving on kennedy and the GPS doesnt help. Eventually found the place pulled up first impression of the outside was not good blacked out windows and green trim lighting makes it look a bit like a dive bar or possible strip club. 

Went inside impressed with the interior the exterior does not do it justice. Ordered rib and wing combo and the wife ordered wings only. Cool booths with tvs. food was excellent the ribs were delish and the wings were tasty and big basically the meat you pull out your teeth after eating here is the same portion you get at wild wing.  

it was so good going back again with visiting relatives. keep up the good work.

advice loose the dark windows"}
{"text":"Been to this place a few times over the years. They have all been amazing. 

Not only do they serve wings but they also have sandwiches, burgers and ribs. The wings at this place are huge the largest in any place i've been. There also a lot of favors to choose from. Have tried: Lemon pepper, honey garlic, Greek, honey Cajun and regular. There all very good. 

Tried there onion ring and ribs those are very good as well. If I'm craving wings this would be my go to place."}
{"text":"Came recently again for the wings and had to give an updated review (which I rarely do). Their wings are delicious!  Large, meaty and plenty of crunch no matter wet or dry. I got to try the dry roasted garlic and pepper and the wet hot pineapple curry honey. The curry honey wasn't that spicy, it was more on the sour tangy spectrum so you could definitely level up if you want more heat. The roasted garlic wasn't as flavorful as the curry honey but stood up to an oven reheat the next day. We also got the Ultimate Greek fries and it came loaded with toppings. The fries are perfectly crunchy and every bite had some sort of feta on it. 

Protip: Come on Monday and the special deal is that instead of 10 wings for the single portion, you get 15!!!!  Such a great deal."}
{"text":"I always go there on Monday for their wings special, wings are super big and portions are generous. Good thing its near school so I can always dine in after class :)"}
{"text":"Decent place, nice and clean with a nice atmosphere,  got the Wings and the Works fries. Gravy on the fries was actually excellent and the crispy fries worked well also. The wings were huge....but, easily forgettible. Don't get me wrong, the 100 plus selection of various wings were great....5 years ago, but now I'd just rather have someone focus on something new or the ultimate chicken wing. The statement less is more could never be farther from the truth. Nice experience hut not amazing."}
{"text":"Best wings I've tried yet! Big huge portions they don't scimp one bit, also their Greek salad is to die for"}
{"text":"Went on Monday night for the 15 wings for price of 10 special and to try the wings out. The wings are gigantic compared to your usual wings that you'd get from other sports bar (1.5 - 2 times the size of st. Louis wings). 

We ordered the Mexican fries, Cajun dry rub wings, and Chipotle Caesar wings and were overly stuffed from the fries that we could only finish 5 wings each due to large portion sizes. 

Only a few slight complaints. 
Could not taste the seasoning on the dry rub well until the leftover wings were reheated the next day. 
The Caesar overpowered the Chipotle flavoring to the point where I could not taste the Chipotle sauce. 

One thing to note. Only 1 special/coupon/discount can be applied to the table, no combining."}
{"text":"Wings are absolutely the best.  But have them with Greek fries. Fries are crispy and the topping delish.  Busy on Monday nights."}
{"text":"Ordered the beef ribs combo:  $28.
- 3 bones,
- 10 wings
- onion rings.

20 wings with 2 flavours:  $23.

2- 20 oz beer, draught, $13 for both.

I have had wings at Hollywood cafe and they are comparable;  they look fresher for they use a lighter batter.

At Fanzone, their batter for wings is dark and thicker which arguably can make the wings bigger as other Yelpers have mentioned.

Forgot the 3 sauces I chose.
They tasted similar (Hot category).
Next time, I will choose a sweeter combination.  The \"hot\" component is a bit sour for my liking.

All in all, not a bad place to enjoys wings here.

There was a big crater (3-4 ft in length/ 3 ft in diameter) on their parking lot;
drive slowly in the evening."}
{"text":"Party of 6. Ordered nachos, and ultimate fries to start. Then had 50 wings. We thought that they were going to be tiny and we could finish the 50 in no problem... we ended up taking half of it home because the wings were way bigger than expected. Great experience!"}
{"text":"By far the BIGGEST wings I've eaten ever! I always try to find an excuse to get my butt up here just to eat wings. The wings here are like double the size of MOST wing places. Its beautiful. There are a decent amount of flavors and they are quite good! I usually get Garlic parm of course but I think I like their Honey parm more... Anyways the wings here are amazing! The atmosphere here is bomb! There is a TV literally everywhere haha. Staff is great and funny! 

They do have daily deals haha so please ask them! The fries here are also really good! I've had the greek fries and garlic parm.... so good! If you do get both... I dont know if you can finish ahah. I can barely finish fries shared and my own wings. 

Definitely come here!!!"}
{"text":"I was craving wings and thought I'd search up a new spot than go to my regular go to for wings, which is usually a Wild Wings or St.Louis. 

I saw the reviews of Fanzone and saw it wasn't too far, so gave it a go. Going here, I can say that I can add this place as a go to for wings. I have never seen such massive wings (shared a double (which contains 2 flavors, chose Garlic Pepper and Honey Garlic, along with a good huge serving of loaded fries (I got the Mexican). Service matched with the good food and the atmosphere is an awesome place to catch a game as each booth has it's own tv. The place was pretty crowded as there was a Leafs game going on. 

Only disappointing thing was that I was a bit bummed that they were out on the deep fried cheesecake; as that was the recommended dessert I read about. However, our server suggested the raspberry greek yogurt cheesecake... and mmmm, it satisfied my sweetooth and was a good way to end the meal."}
{"text":"This place is my favourite wings place in the city and we make the trek to the east end of the city whenever we feel like getting some wings. On this visit we got hot pineapple curry, jerk chipotle and fries with gravy. Unlike most places this place sells them by the number of wings (10 in a single). Also unlike many places these wings are large and meaty. I've never been able to finish a full order and fries here (Yaay for lunch the next day). Both flavours were delicious and the chicken was cooked perfectly. It was still juicy not stringy and lightly breaded only. In addition to the food the wait staff was very responsive and quick with all our orders. I think I will keep going back here for the foreseeable future"}
{"text":"Two words about the wings: BIG & TASTY.

Always look forward to the Ultimate Greek Fries. It's like a beautiful day in Athens...on a plate!

Wash it back with any of their cold beers on tap while catching a game on one of their many TVs.

Check out Fanzone to get your wings-fix :)"}
{"text":"I am m town on business from Ohio and went by the reviews...walking into the restaurant I could tell something was not right... water main break outside the restaurant....I met Boss Steve and his crew and was so impressed in how they were handling the situation... smiles and great service by all...I had one of their burgers which was great but the best part of the encounter was how Steve and his crew made me feel welcome. Give this crew a 10!
Thanks!"}
{"text":"Huge wings, but wayyy too much sauce! Also, service is not that great and kind of pushy -especially with a large group. However, the restaurant is surrounded with large screen televisions and smaller ones at each booth - great for watching the game! Would come back for game nights but try the dry-wings next time for sure."}
{"text":"Wings are massive...don't order too many unless you are prepared to take home leftovers.  Ordered 50 wings (roasted garlic, honey teriyaki, and dry parmesan) and parmesan fries , 2 Heineken, and a coffee (lol to battle itis).  Sadly the deep fried cheesecake is no longer on the menu.....clean spot, lots of tv's (nfl,mlb, ufc, etc), comfy booths, friendly service...busy but not too busy....Will definitely be back here"}
{"text":"Management is terrible. I had to call 3 times on 3 different days to make a reservation for an event, and supposedly the manager had always stepped out. 
Needless to say, our party of 8 was not booked and we had to go to a different venue."}
{"text":"Fanzone is probably my favourite wing place around. Wings are always huge and there's a nice variety of flavours to choose from. Gar par fries are bomb and so are the Mexican fries. 
Lots of tv's everywhere so you can watch the game from wherever you're sitting. The friendly owner and servers are always around and attentive to you."}
{"text":"Wow!!  Pleasantly surprised.  Wings were outstanding.  I ordered the Lemon Pepper Dry wings and they were very crispy on the outside, tender on the inside.  And the fries?  Amazing.  Five stars for sure.  So glad to find this place.  Note:  The wings are HUGE.  An order (with a side of fries) can easily feed two people.  Can't wait to come back and try the onion rings -- I saw an order pass by my table and they looked delicious."}
{"text":"Always great food with great service!  Come here on the regular, as it has a very clean and relaxed atmosphere, TVs at every booth (channels can be changed at your request), and something to eat for everyone.  Wings are spectacular - with maby flavours to choose from, burgers are tasty too.  Personal faves are the calamari, nachos, and mexican fries.  If you have a sweet tooth, ask for the deep fried cheesecake, you won't regret it!"}
{"text":"Long story short, everything was on point/perfect, the service, the food, decor, location EXCEPT the wobbly bar stools, the black second entrance door with no window, and the fact that they took away the deep fried cheesecake that I saw on the yelp photos.  I literally tried all the stools in search of an even level'd one but they appear all wobbly.  When you enter, it's kinda odd that you have to go through a second door that has no window.  It reminded me of the broom closet door from my work.  And I was actually looking forward to trying that deep fried cheesecake, never had that before lol. Anyways, my waitress was pretty cool, the asian girl with the glasses and lip piercing.  She seems cool to chat with while having drinks.  I'll definitly come back.  And if she's reading this, make sure you check out the series on Netflix I was watching and I told you about, \"Narcos\".  It's a really good series !"}
{"text":"This wasn't my first time at Fanzone wings & ribs, so I knew we were going to have some nice wings. I was starving after a long day of working, so a few of us decided wings were the choice of food for that night. Plus, the place has really great reviews.

We started off with some Ultimate Greek Fries, which were actually delicious and were eaten instantaneously. Then we decided to order 50 wings with 3 flavours. Essentially, you would be getting a 20/15/15 split. 

The great thing about this place is that you can choose whether to have your wings breaded or unbreaded, as well as fried or grilled. We decided to get Honey Hot Creole, Garlic Parmesan and Lemon Pepper. All 3 flavours were pretty good. However, I definitely didn't find the honey hot creole hot enough considering it's in the HOT section. I would have liked a bit more spice in that one. Nevertheless, as I said, the flavours were all pretty good.

As a side note, my gingerale tasted real and not watered down like many other places. 

The service was great and the food came fast. When I'm in the neighbourhood and craving wings, it'll definitely remain as my go-to place."}
{"text":"Worth the money!!

We ordered Roasted Garlic Pepper Wings & Honey Garlic wings and all I can say is YUMMMM!!!!!! Very tasty and delicious plus the size of the wing's really Huge compare to other stores. Also, we ordered a CALAMARI and some fries. Servings are very generous!! Definitely going back!!"}
{"text":"Im a fan! Im a fan!
I've been here several times this year since February since it is close to my home and I never get sick of the food they offer.
This Scarborough gem is located at Kennedy and Lawrence (North of Lawrence), it is easy to spot the bar as they have their green label bright and on the spot. They serve bar food, similar to All Star wings but of course they offer their very own. I prefer this chicken wing place now versus All Star Wings as theirs is more affordable and worth the price. It is run by Steve, the manager who you'll see running around, helping out the bar and welcoming customers. I've met a couple of the hostesses (Ally and Maria) who were really attentive, knowledgeable and prompt to their customers' needs. 

My boyfriend and I usually order 20 chicken wings and a pint of beer for each of us but now we've only decided to share ten chicken wings plus an order of calamari (we cant devour all of the 20 wings). I swear, everything from their menu is really filling and you'll be good til the morning! Their chicken wings are ginormous! They beat St. Louis' skinny wings and All Stars too. They have a variety of chicken wing flavors to choose (I think more than 20) from so everyone have the freedom to pick and get their flavor. If you do have leftovers to bring home, they dont become soggy when you microwave them unlike from the other bar places. This place is getting more famous and popular and they do deserve to be recognized! Service is at its best, so do their bar food choices!

The bar/ restaurant is family friendly and also an excellent place to socialize with friends! They serve different beers and alcohol too so everyone can have a great time :)

I want to give a shoutout to Steve, Ally, and Maria for letting us try their deep fried cheesecake. It tastes similar to the CNE deep fried foods but this is waaaay better!

To all readers, this place is definitely worth to try and every your tummies will scream out for joy! Just make sure you drink a cup of Metamucil after hehe

Have fun Yelpers!"}
{"text":"Came here last night to watch the Leafs game. It was busy enough for a Monday evening but not super packed.  I ordered the honey teriyaki wings, while my husband ordered the Cajun Creole wings. My cousin got the roasted garlic wings and fries. My other cousin got smoked jerk wings. 

Let me comment on the size of the wings first of all - they were huge! They were so large that I couldn't finish all 15 wings (we ordered the 15 wings for the price of 10 special). I ate about 11 wings before I started to feel uncomfortably full. 

The fries were yummy and crispy. You also received a good amount! In terms of the wings, I liked the honey teriyaki the least - it was a bit too sweet for my liking. The dry roasted garlic wings were delicious as well as the Cajun Creole. I likes the smoked jerk wings which weren't as spicy as I thought. 

Service was average - food did arrive promptly and we were checked on once or twice for water and drinks. But we did have to flag down the waitress for a few items. 

Overall, it was a good experience and I would definitely return. However, you do not need to order so many wings. You could get away with two wing baskets less e.g. four baskets for a party of 6 or three wing baskets for a party of 5."}
{"text":"I'll start by saying that this review rises above one star only because of the staff. 

Visit #1

I came in based on yelper reviews. The bar was uncomfortable. Very sterile and positioned at the front door. Made it feel as though I was seated at the hostess stand.  I ordered a beer and got the menu.  This is where I put the brakes on this first visit.  The menu is very limited. Fully half of it is devoted to wing sauce combinations. 

Hint:  if I want to mix your sauces together I'll just ask. You don't need to list every possible combination.  

The actual menu was so old and tattered and filthy that I didn't risk ordering from it. I was actually hungry and didn't want to waste my appetite on an experiment. 

Visit #2

Actually didn't realize that I walked out of this place once already and went back again based on yelper reviews. 

This time was much the same as the first. But there's a game on and the Jays are mounting a comeback. So I'm going to stick it out. 

Hint:  if you are going to make claims about having great, best or even proper wings... You need to start with perfecting a plain buffalo wing. 

The pictures I saw on Yelp were of heavily breaded wings. They do this to cheat in a couple of ways. It's a shortcut to make a crispy outside and as a bonus they look bigger.  The waitress said that they could make them without breading so I gave them a shot despite my gut. Should have trusted my gut. 

These wings were slimy and stringy and totally undercooked. Had them put in a takeout container so I could at least take them home and cook them some more.

The waitress was delightful.  However the owner/manager? ....  Busy tipping back beers at the bar. How is this still happening?  It's the surest sign that the restaurant is going to be bad. And this place is not breaking that trend. 

Pass.  And this is the first time in a while I've been steered wrong by fellow yelpers."}
{"text":"This gem opened up a year ago and if I had known it was in my hood I would have been going here from the beginning. 

Everything was 5 stars right from the get go. My sister and I went on a Saturday night where there was a UFC fight (we don't watch) and we were lucky to get a table at around 830pm. Our waitress Ali was so sweet and talkative, we felt right at home. 

We went there because the reviews on the ribs and wings were amazing. They weren't kidding. The baby back ribs should have been baby GOT back ribs because damn they were amazing, fell off the bone and was just perfect. $17 We also got the honey BBQ teriyaki wings and I was so impressed by how big and meaty the wings were -- yes I'm still talking about wings people. $11 Way better than any other wings you can get at all stars, wild wings or what have you. 

The owner Steve is a stand up guy and he made sure we were happy and well taken care of. He made sure we tried their amazing deep fried cheesecake (I've never had before) and seriously people, once you go deep fried you can never go back to regular cheesecake. 

I will definitely be coming back for ribs and wings here because there is nothing you can fault at this restaurant. Great service, people, food and atmosphere. THUMBS UP!"}
{"text":"I went here for a goodbye dinner party for a co-worker. The place is really nice and clean. They had those nice booth with a tv install in it as well, which is very different and great touch! I got the one pound wings and fries. The wings are huge! The fries were really crispy and yummy! But service wasn't the greatest, I had to call the waitress about 3x for refill and the bill/debit machine. Overall, I would def come back to try different flavour of the wings  if I was in the area. But Duffs wings will always be better in my opinion."}
{"text":"Positives:
Amazing Atmosphere
Great Staff
Plenty of TVs
WINGS ARE AMAZING!!!!!
Portions are incredible - $6 for a huge plate of fries
Tons of TVS

Negatives:
I wish they were a bit bigger so they could accommodate more people."}
{"text":"Colin S' drool inducing review and photos had me trekking to the East end to check out this wing joint.  Our group of 6 arrived on a Friday night around 7pm to this very spacious and clean sports bar. I had emailed ahead for reservations and we were seated right away.

We ordered a pitcher of Rickard's White (someone else's choice - not mine!) ($16) to start while we discussed what flavour of wings to try.  We decided to order 50 wings at 3 flavours ($49) and then a double order with 2 flavours ($20) for the super hot wing fans in our group.  And of course basket of fries ($4.95).

Our flavours of choice:  honey garlic, mesquite, dry taco seasoned, buffalo, homicide pineapple curry. 

Once the basket of wings started arriving, we knew we had over ordered...the wings were just massive.

The mild wings were quite tasty, although we all agreed that they could have left the wings in the deep fryer for about another 1-2 minutes just to get the skin super crispy.  The dry wings are usually my favourite but I found that Fanzone's version could have used a more flavourful seasoning (just couldn't compete with West end's Wingporium).

The hot wing lovers in the group were disappointed with the hotter flavor offerings.  I'm a wimp when it comes to spice and I was able to eat 2 wings from the \"homicide\" flavor basket.  We also requested a side of the hottest sauce they offer and it barely tipped the scale in heat.

Service was decent and our server was very good about giving us take out containers for all the leftovers.

I enjoyed Fanzone overall for quality, quantity and value.  Great place for food and sports viewing if that's your thang.  Hot wing lovers might want to BYO hot sauce."}
{"text":"So found this location on Yelp since me and my friend wanted wings but wanted to try someplace new.

We drove up and the place looks a bit odd for scarborough and where it is. When we walked in, the place was a clean modern sports bar. It was packed as well when we got there. We waited about 5-10 minutes, but that wasn't an issue (it was the service, but ill get to that).

We ordered wings and beer, and they were pretty decent. The wings tasted like quality, and better than other places in the area. We got a pitcher of beer (only one, since the second didnt come).

Okay, for the service. The girl was friendly, but barely smiled or communicated with us. Took our order, then we had to wait a bit for the food. When we finished the beer, we asked for another, but it never came. Even when we asked for the bill, we had to ask another waitress to get it since ours disappeared. When ours came back, then she smiled.... maybe to get a good tip... but NO. Only gave 1 star less cause we did notice that the other waitresses were decent and fast, we just had a bad one.

BUT if you are going for wings, YES go, I did enjoy those wings.... *drool*.... i think I am getting hungry again.... WAIT... NO... TRYING TO LOSE WEIGHT.... AHHHHH"}
{"text":"We love coming to Fanzone. Great service and our whole family feels welcome. They have the best wings in the city and so many choices to choose from. Our favorite is Honey garlic with parmesan and spicy jerk. The portions are huge and we always end up bringing home leftovers.  I love all the screens to watch sports and if you sit in a booth you can get your own tv screen.  Go check it out!"}
{"text":"The largest chicken wings I have ever ate in Toronto. I tried the Honey Parmesam and BBQ Creole flavors. Amazing :) Must try."}
{"text":"Went here on a Friday night . Wings were large but was just ok . There was too much breading that made me full after a few wings . Beer felt watered down .  On the plus side we had the ultimate fries which was very good . I haven't tried the other items on the menu."}
{"text":"Ok I'm kinda stuffed at the moment so this'll be brief. 
The short story is - this place rocks!

The food is amazing - huge portions and always on point
The service is fast and always friendly 
The  owner is a sweetheart and greets his guests with a huge smile and makes sure u leave happy and full 


This is my go to place for wings - ribs - fries and ambiance.  Oh, did I mention the gazillion tv screens?

What r u waiting for?  Helllloooo go try for yourself"}
{"text":"I've now been here four times and still haven't be disappointed. In my opinion the beef ribs are better than baby back. Nevertheless great staff and great food."}
{"text":"By far the best wing place I have been to. There are a few things that stand out at this place. 

1- THE WINGS. The wings here are tasty, delicious, their sauces are no where near the \"usual\" wing places... ww, asw, etc. One other thing that stands out about the wings, aside from the massive-sized almost turkey wing sized, quality wings, is that you will not need more than an order of a pound of wings as there will be more than the usual 8-10 wings per order.. if that aint a bonus.. side note, greek parm sauce and hot cesar are the best ones ive tried. 

2- The meals, everything was delicious. Rib and wing combo definitely do not disappoint

3- Calamari/Fries/Apps.. cant go wrong with greek fries. Order it and you will not be disappointed. Greek fries have been approved by my greeek friends so you know its good. 

4- Entertainment - you cant go wrong with a numerous TV's throughout the place. TV's in your booths, tvs in every corner of the place, TV's everywhere. You definitely cant miss a pitch or a derozan dunk. 

5- Service. When was the last time youve gone to a restaurant where the owner helps the serves pour drinks, serve the food, and double check with the customers to make sure their satisfied? Yea... i experienced that here. 

Overall, Thanks to my friend that introduced me to this place and now I have not gone to any other wing place but here... definitely a must try!"}
{"text":"This place is just awesome.  The chicken wings are huge, they are really generous with the portions, and they are also DELICIOUS.  I also got an order of half rack ribs.  They were just delicious.  The sauce was nic, and, the half rack is actually quite big.  Bigger then most places that's for sure.  Definitely coming back to this place.  5 out of 5"}
{"text":"Came here last night for dinner. I always drive by this restaurant, but never tried it so I decided to. So happy that I did!

Some of the dishes that I have tried would be the full rack of baby back ribs, onion rings, honey garlic wings and homicide buffalo wings. They all tasted amazing! The portions here are huge and definitely worth the money (not expensive compared to other wing places).

One thing about this restaurant would probably be the service. Despite the servers being kind, the service was slow! Also, the restaurant kind of looks like a dungeon instead of a sports bar, but I believe they are renovating the other side.

All in all, I would definitely come back!"}
{"text":"Disgusting. Wings were massive and smelt and tasted like fish. Would never come here again. Very dingy."}
{"text":"Going to cut to the chase. Wings are huge. Ordered the buffalo and hot honey teriyaki flavours. Buffalos was alright but didn't like the teriyaki. 

The staff was nice and fast. The place looks clean and lots of TVs for your enjoyment.

I will definitely come back to try other flavours.

I should add soda beverages have free refills."}
{"text":"Not being a wings person, I was hesitant about coming here. From looking at the Yelp reviews and hearing friends recommendations, I can agree with their suggestion of Fanzone now that I've tried it! 

This is any wings/sports persons dream. There's lots of booths and tables and there's a TV integrated in literally every booth and in every corner and all around us. No hockey, baseball, or basketball game will go unwatched. 

Now onto the food, I was very happy about the portions and the pricing. It's way cheaper than restaurants such as Wild Wing ($10~ vs $14) for 1 serving. The wings are BIG. like BIG! My boyfriend ordered a triple for both of us and I could only finish 7 and he finished 13 of them. We were both stuffed to high heavens and had to take a doggy bag home. The quality and the portions were way more superior than any other wings I've tried. The flavours were on point as well and had many different options.

5/5. Delicious. Huge Portions. Good service. Great quality. Come here if you're a wings lover."}
{"text":"This place is not noticeable as you drive by but I'm so glad I discovered it! Prices are good,  portions are huge staff is friendly and lots of tv's. Cheese and gravy fries are a must get.  They bread there wings which I personally do not like so I asked for mine not breaded, took a little longer but sooo worth the wait .  Great hang out spot"}
{"text":"Came to the Fanzone with the wifey and kids.  

We ordered calamari, some garlic parm wings, and orange mustard wings.  When the food came, I was like Holy Emu Batman!  These wings are huge!  These ain't your cute little pee wee chickadee wings you get at wildwings.  They were like freakin roid turkey/ ostrich hybrid wings yo mama warned you about.  Yea, these birds lift, brah.  Heard they source these pterodactyl wings from Jurassic Park... need to confirm tho.  Anyways, the flavours were on point.  Both flavours were tasty and saucy.  Yet the breading had a very satisfying crunch that lasted the whole meal.  No sogging up these bad boys.  Well season with okay juiciness.  Portions were good.  One wing per kid.  Done. 

The Calamari was also good.  A touch on the salty side, but tender with a softer breading.

The interior was clean and the environment was quiet.  Basketball game on all the TVs.  Raptors killed it."}
