{"text":"Je suis devenue complètement folle de ce petit café! Farine est un petit coffee shop Italien qui se situe dans le Mile End et n'a ouvert qu'il y'a quelques mois. L'endroit est chaleureux, design, lumineux et le Capuccino y est délicieux! J'ai craqué pour une petite tartelette aux noix de pecan quand j'y suis allée et elle était délicieuse! Farine propose aussi des Pizzas et autres petits en-cas, que je goûterai probablement très prochainement !!"}
{"text":"Montreal's best kept secret. We go out of our way to come here every time we go to Montreal now, as there is no place quite like it. EVERYTHING is amazing - probably best know for their pizza, by don't overlook the charcuterie and hand-made pasta! Great breakfast as well. Despite being an Italian bakery, dishes manage to be light and refined (without an ounce of pretension.)"}
{"text":"AMAZING!  Had the smoked salmon pizza and beet salad, Calamari and chocolate tarte...cannot even decide what was my favorite.  So good I was moved to write my first Yelp review."}
{"text":"I have eaten there three times already and the food has been incredible on each occasion.
It's very cheap considering the quality and it's a nice place to eat when you're in a hurry.
My favourite so far is the pizza with a big salmon strip on it. Amazing caviar covering the fish as well.
I'm so glad I live near this place. 
They also have home made pop, and pastries which looked delicious. 
Oh and the green salad was great. Really unique pistachio dressing."}
{"text":"It's such a quaint little cafe! (OK, it's quite big in fact) Beautiful decor, lovely stuff, delicious pastry, and they've got pizza, salads, sandwich etc. too, I hope I live in the neighbourhood so I'd be able to come here often!"}
{"text":"I stopped by Farine with my family for breakfast. It was wonderful. They staff were kind and welcoming. Our food was delicious. We even took some extra baked goods to go."}
{"text":"Je viens de découvrir le meilleur carbonara de Montréal. Je connaissait l'endroit de renom, j'ignorais toutefois qu'on nous y servait le brunch. Service sympa, comme si on était reçu à la maison, douce musique cubaine en musique de fond qui ajoute au charme de l'endroit."}
{"text":"Damn. Where have you been my whole life!? This question on repeat in my head as I enjoyed a slice of delicious (everything homemade) pizza + salad. 

They seem to have thought through every detail. Starting with the stunning setting, which creates a very warm and relaxing space. I loved the design accents from the raw walls to the custom built stools. But more importantly, everything comes together to highlight the food display at the front counter. Brilliantly designed. 

Speaking of the food, everything I tried was delicious. We shared the spicy pizza and the gravlax pizza, along with a salad. So simple, yet so delicious. And the price was very affordable. 

Then, for \"la piece de résistance\", the desserts.......so many choices, they literally have a table filled with fresh baked goods. The worse part of my experience was probably trying to decide what to have! I tried the brownie (total win) and the lemon square (super yummy) with a coffee, of course. 

The service was impeccable. The lady at the counter was extremely helpful and very pleasant. Brought the experience up a notch. 

As if it couldn't get any better, they then also had to play all my favourite music.  

Wow, so impressed with this place, can't wait to go back for some fresh pasta."}
{"text":"I had the pizza. They said it was \"all made there\". Average tasting- edible but nothing really special. They put basil and olive oil on it before they serve it to you, which does not help much to rescue what is really a big slab of bread with ten grams of vegetables and a microgram of cheese on it. Seriously if they put less on the pizza it would be a Samuel Becket play called \"Waiting for Garnish\".  

I'd normally give three stars for edible food, but they charge crazy prices ($11.50 for pizza and a San Pellegrino, which they mark up too $2.50) so two stars it is. Also the guy at the cash is a little bit off-putting, verging on rude. If this place dropped off the map it would not make much difference to me. The baked goods looked good, but their prices for those were pretty crazy as well."}
{"text":"Hip, trendy location with pasta, salad, sandwiches and pizza. Everything fresh and locally sourced by the very experienced owner/chef. 

Homemade Kombucha available in the cooler is delicious!

The showcase by the cash register has three kinds of to-go slices of pizza and fresh pasta drying below. We ordered the Tomato Salad, (like a warm Caprese) Three types of Pasta; Carbonara, Garganelli and Fettucini. My favourite was the Carbonera which came with a fried egg on top. 
Everything that we had was tasty and the pasta was presented in vintage bowls. 

Music added ambience and the space was casual with a rustic vibe. Fresh croissants and coffee are available for take away on a table as you enter.

Love Farine! Go for breakfast, lunch or brunch. The staff were all fantastic and spoke both French & English. Great spot for tourists!"}
{"text":"Location: Up in Mile End, not too far from Olimpico. Street parking is available but hard to find (and you need to pay). 
 
The place: Cute little spot, simple and clean.

The goods: I stopped in for a snack because I was famished. I grabbed a chocolate croissant that was pretty darn delicious - basically it was a fresh croissant that was cut in half and there were chocolate chips inside (or that's what they looked like). I believe they also serve breakfast/brunch. 

Service: Good

Price point: This is where I have an issue - $4.50 for a chocolate croissant is pretty steep and higher than most places I go to. Is it delicious? Absolutely! But I'd knock a buck off the price."}
{"text":"This place is a 3.5. I really wanted to give this place 5 stars, but unfortunately it fell short. I love the place, it's beautifully arranged and decorated, all the food is homemade, and the staff was nice.  But the pizza I ordered just wasn't that great, and the cookie I had for dessert was hard and tasteless. 
I don't like that all the food is just laying around, it makes it look bad. The dessert table had dust on it. Also the seating here is uncomfortable. Which isn't a bad thing, but it would be nice to feel comfortable while you're eating. You can get it to go but it was raining when I went so I was looking for a nice cozy place to have a late lunch. The prices are also a bit high, but that's to be expected since everything is homemade. 
Overall, I was just expecting more. I will try this place again to see if I change my mind. 

However, the brownie is a five star, one of the best brownies ever."}
{"text":"This place is absolutely darling. It's small and cozy. The staff is super nice and the food and coffee were great! I started with a cappuccino while I waited for my friend. I had a lovely little window seat along the bar with those cute stools. The coffee came with a small chocolate chip cookie that had a bit of fleur de sel on top. The texture was great and the balance of flavor was perfect-- exactly what a good chocolate chip cookie should be. Then my friend and I both got the carbonara. I love the pancko crusted egg yolk. The crunch it added to the dish was to-die-for! I'll definitely be visiting again."}
{"text":"Mon nouveau coin préféré ! Deux fois en deux jours :) La nourriture est sublime et tellement fraîche, mais mon coup de coeur sont pour les gens qui y travaillent. Attentionnés envers les clients, sympathiques et tellement gentils. Merci pour tout"}
{"text":"Extraordinary aesthetic, skill and care here.  
Best croissants in MTL thus far.  

Everything looks wonderful.  

OMG. The omelette du jour was to DIE AND RESURRECT for!! Bravo to the chef!"}
{"text":"We were walking along St Viateur bemoaning the changes to the street in recent years when we all noticed this pretty but chill spot looking like it might be full of goodies. And in fact it was. Oh it was. Super friendly owner working the counter and excitedly talking about the delicious food being made in the back. My friends ordered a giant lemon square and a gorgeous brownie and I had a perfect little pot of vanilla bean panna cotta with lovely cool liquidy homemade caramel on top. There were homemade gnocci available in a 12 piece portion for $4 for you to cook up at home that looked fat and glorious, yummy pizzas with fresh homemade dough, and a weekend brunch menu that sounded super tantalizing. Cute comfortable seating, nice warm wood, really a nice addition to this changing street."}
{"text":"What a cute little cafe !

We stopped there for breakfast.   I got a croissant and it was very flaky, light, delicious !

My BF got two eggs with house potatoes and home made bread.   All delicious.   The potatoes had nice olive oil and basil on them.

The lady behind the counter was nice, friendly and helpful.

Excellent eclectic neighborhood bakery / cafe."}
{"text":"What a great place. Why did we take so long to try out a place so close to home. Everything is made on site and it tastes perfect. We only started with the pizza, salad and dessert but will be back to try their home made pasta and sandwiches. The food was great my spicy pizza was delicious (but not very spicy). The Salmon pizza was very nice and both came with fresh off the branch basil...what a perfect touch. The desserts were amazing, but too big and rich to finish. We had the brownie and lemon square - both so very tasty. The dessert setup was also a simple detail that made the experience amazing. It seems like they really thought through all the details, from the bar, counter display dessert table and stools. All making for a perfect stop on Saint Viateur."}
{"text":"Located next to St-Michael Church of Mile End, Farine is a little café offering a variety of choices that change depending on the season and supply. I really liked their Dolce Vita pizza, with fresh cream, gravlax (yummmmmmm!!!!) and caviar. Their allongée coffee was quite strong, good overall. I like the interior decor of the café and the view on the church outside. Would come back!"}
{"text":"Une tuerie ces agnolotti. Comme des raviolis à la noisette, fourrés à la ricotta, dans une sauce tellement onctueuse. Même le pain huile d'olivé qui les accompagne est à tomber. 
Un petit cake aux pommes tout simple tout bon en dessert, et un espresso, tout est parfait. 
La vitrine qui donne sur la byzantine Saint Michael aussi."}
{"text":"Un endroit cosy, joli, chaleureux et qui propose des pâtisseries, salades et même pizza maison qui font du bien, surtout lors d'une après-midi pluvieuse :)"}
{"text":"A new neighbourhood gem! There's something so charming, sincere and open about this place-- and then the food is mouth-wateringly delicious. Inspired pizza, salads, sandwiches and sodas-- the chef has a real sense for new combinations with attention to detail and quality ingredients. And all at super-affordable prices! Plus, OPEN MONDAYS!!!"}
