{"text":"Well, this is officially my first fail with Yelp. The reviews told me Fast Lane was supposed to be delicious. 
I called and a friendly gentleman took my order . The pizza arrived in a timely manner and was hot.
Upon opening the Greek pizza box, I was confronted by tiny shreds of what appeared to be canned olives and previously frozen spinach, and almost no cheese. The dough was bland as was the tomato sauce. 
The Tandoori Chicken pizza faired only slightly better. Actually has some chicken on it and a nice mild curry flavour. 
Alas, not worth the $40( including tip). Luckily we have many other options to choose from in the area."}
{"text":"Yum. This pizza place is delicious. When their flyer showed up in my mailbox and I gazed upon its awesomeness, I was amazed to see that not only does fast-lane provide the usual pizza offerings, but they also provide amazing Indian style pizzas with ginger, cilantro, tandoori chicken.. I could go on. 

And I will!  Because their pizza is so, so amazingly delicious. With three different crusts to choose from: thin, regular, and thick (we got the thin, which was amazing), you are truly in pizza heaven when combined with the multitude of toppings available. 

Delicious pizza. With tandoori chicken, if you like. Fresh ginger elevates this to a higher food experience. 

Try fast-lane, you won't regret it!"}
{"text":"We ordered delivery from Fast Lane last night and it was delicious!  We got the Canadian and the Butter Chicken pizzas. 
The Canadian was insane! Tons of meat, really good flavour and delicious crust. Not greasy at all. The butter chicken was really tasty too, really good flavour.  Next time I would get it with green peppers. The delivery was quick and the price was really reasonable. This is our new favourite pizza place! I can't wait to try what else they have!"}
{"text":"I got the donair pizza. It didn't seem to have any sauce on it. Dry. Hardly any meat. The extra donair sauce I asked for on the side was as runny as water. What the heck fast lane??"}
{"text":"Lunch special $5 donair totally worth the value! Pizzas are a great deal and the chicken bites are really good. I find myself going back and not being disappointed. Good work Fast-Lane!"}
{"text":"I habe to say i sell product to almost every pizza joint in this city and mandeep and paul do the best pie iv had in years keep up the good work guys great job love ur pizza kind regards kenneth ryan president simply citrus ind"}
{"text":"Great customer service, delivery drivers are super friendly and polite-they answer all my very talkative children's questions with a smile. Pizza is hot upon delivery, every time, and we have not paid over $35 for two pizzas and garlic fingers. I love that you can choose the sauce and crust, and am absolutely a fan of the spicy sauce! They're our go-to for delivery pizza and I would recommend them to everyone I know."}
{"text":"Usually with the further out pizza places, away from the centre core, I find it's better value and more toppings too.

Located in a residential area, in a tiny strip mall with only a 7 Eleven, from my recollection, a late-nite stop by.

A total takeout/pickup place is its original design but fairly big with about 4 sit-down tables and quite clean and bright too.

I played it safe and ordered the Hawaiian, and didn't disappoint.  Small pizza @ $12 is more than other places, but better quality.

also serve pasta, wings and wraps, of all things."}
{"text":"This is a pizza 73 place with a different name same crap pizza and same horrible wings just like 73 only you pay more money for the pizza here then at 73 and it's the exact same product plus it Took them one and half hours to deliver it to my  place 10mins away on a Wednesday night I'm  being generous with the 1 star rating"}
{"text":"Wow.. this place is a hidden gem.  It's a quick counter place but they do have a number of sit-down tables and bar tables to eat from.  They have great lunch special prices.  $3 for an 8\" personal sized pizza (1-topping).  I got the mushrooms (impossible to screw that up).  Despite being only 1 topping it was tasty and enough to fill me up!

Their crust is super light and buttery.  You can hear that nice crunching sound with every bite.  I'll have to come back and try more of their pizzas.

It would be a 5-star experience but their store sit-down area needs a bit of TLC and cleaning."}
{"text":"Thought I'd take these guys up on their $3 lunch special to see how they compared to the pizza place that used to be here. Much improved!

They've done a small renovation to the restaurant and opened everything up. You no longer feel like you're walking into a shady place down a back hallway to get a pizza. The renovation itself was obviously done by the owners as you can see that it wasn't a professional job. Not that it's completely terrible either though.

The Pizza:

Crust - nice and flaky and buttery with good crunch. Slightly on the thin side though as it's hard to pick up a slice without a second hand to give it some support.

Sauce - plain old tomato sauce. No additional spices or anything. It's good if that's your thing, but I like to have a little more flavour.

Cheese - great amount my of cheese and it's cooked to a nice golden colour.

Toppings - I went with plain old pepperoni. My complaint here is that you get one piece of pepperoni on each slice. I'm not sure if I can really complain for a $3 pizza, but just a heads up that you should adjust your expectations to get a cheese pizza with a hint of pepperoni.

Despite my takeaways from the pizza here, it's still a great pie and well deserving of 4-stars. Hopefully things improve a little to make it a 5-star place."}
