{"text":"Food was great, easy to order and at my door in under 10 min!"}
{"text":"Second lunch from Feast - used my $5 coupon and got this delish Steak & Asparagus salad for $9.70. Super fast arrival. Great, fresh food. Welcome addition to the downtown lunchtime options."}
{"text":"Working in the distillery district leaves us few options for lunch. Uber eats used to be our go-to lunch app until we discovered FEAST! The meals are super fresh and delicious and arrived in record timing. I must say, I was apprehensive to try them out but I am so glad I did. I'll be using FEAST on a regular basis from now on. PS - try the Flank Steak Cobb salad when you can, it's unreal!"}
{"text":"The pork bone soup is superb and they have really good korean food!!  This place is real hidden gem.  It might look little poor outside but the taste of korean food is amazing.  The owner chef used to work as a cook at a popular korean restaurant in toronto and usa maybe over 20years..I am not sure.  But he is one of the best korean chef I am sure!!  Anyways it is tiny food court restaurant but they do have so many korean menu!!  And price is very good.  The wife of the owner is always friendly and  treat u like son or daughter.  This place is actually already popular among chinese and korean customers.  Even it is hiding in unpopular plaza, They have been doing great job in there.  Especially I love their kimchi and cucumber kimch so much. They make it every morning so freshly:)  Also they make dumplings by themself. It is so juicy and tasty:)"}
{"text":"Overall, a good place to get cheap and tasty Korean food.  I've tried about 1/3 of the menu (bibimbap, PBS, seafood pancake, bulgogi, squid, doekbeokki, jajangmyun, etc). Most dishes are around $7 - $10 (tax included) and this is a fast food kind of shop so there's no tips. You order, pick up, then return your tray.  The owner is nice and welcoming. The corn tea drink they give you is really tasty and their kimchi and cucumber kimchi is my favourite in comparison to all the other Korean restaurants I've been to. It's so good I honestly wish they sold just the kimchi.  My favourite dish there is the Pork Bone Soup. The flavor is rich and it's always hot. It's wonderful in the winter. Portions though, vary per dish. The Pork Bone Soup has a large portion and if necessary, I can share it with someone else. But, as for the doekbeokki, there was honestly as much as a handful and not even enough to be an appetizer. In the bulgogi, there was a lot of vegetables (around 60%) but not much meat (40%). It tasted great, but it just wasn't enough for one person.  The bibimbap is good and so is the jajangmyun, squid, and seafood pancake. But some items, like the seafood pancake not as cheap as other dishes solely because they aren't as filling.  Well, I'll continue to come back, especially during the cold winters just for their $8 PBS."}
{"text":"The best Pork Bone Soup in Mississauga. It is located in a foodcourt of a simple mall by 5/10. Don't expect great service but it is definitely a go to place if you want cheap and tasty korean food"}
{"text":"Very good Korean food, regardless of price point.  My favorite is their kimchi, one of the best imho.  One less star just because of location and the occasional \"weirdos\" that bugs you while you eat."}
{"text":"I've ordered from here a couple of times and the food has been great! They definitely take the time and effort to use quality ingredients and source innovative recipes. Operating from several satellite locations at the core of Toronto, their service is also lightning speed - I've received orders within 10 minutes before!  I would highly recommend the Albacore Tuna Tataki dinner. Fresh thick cuts of lightly seared tuna sashimi complimented with THE best soft boiled egg I have ever had in my entire life = what more could I ask for?!  The only thing I would warn you of is that the prices run pretty steep. Lunches are around $10-$15 and dinners are $17 including tax. I would say that Feast primarily targets business men and women with office jobs in Toronto more than your average university student."}
{"text":"Deliver is really fast, food is freshly amazing and customer service is one of the best ever. Totally recommend Feast."}
{"text":"Love the food from this app. Its fresh, healthy and packed with nutritious ingredients. My favourites are definitely the falafel fattoush salad, and the flank steak salad.   The menu is a bit limited and it can be a bit more pricey because they need to deliver it, but its worth trying. The salads are way better than the ones made in person across the street."}
{"text":"I had a $10 coupon for my first order at Feast.  I ordered a Thai tempeh salad and honestly the presentation was great.  So I ended up paying $1.87 total.    I thought the portion size was small when I first looked at it, but as I was eating it, I was slowly getting full.  All the ingredients were fresh and it did look like a gourmet meal. In addition, the service was fast and timely as well.  Unfortunately, where it was lacking was the taste.  There was nothing wrong with it, but I honestly felt whatever they used to marinate it took the natural taste out of the fresh vegetables.  Maybe too much lemon or lime?    Verdict: I might order again, but more or less for days where you are in a rush."}
{"text":"My coworker told me about this place and in my head I thought this would just be another one of those food delivery type of apps. I was completely wrong! I immediately got a $10 credit upon signing up (my coworker got a $10 credit since he gave me the referral code) and I ordered the chicken chipotle bowl for a Friday lunch. I ordered it the previous day for 12-12:30pm and got a text once my meal had arrived. The little bikes with the carts were SO cute and such a clever/catchy idea. The chicken chipotle bowl was absolutely fresh and delicious and they gave such a generous amount (including gauc!! Gotta love me some gauc) I also received two free double chocolate chip cookies which were to die for.   I will definitely be ordering from here again (especially since I got some of my friends to sign up with my referral code ;)). The people here seem to genuinely care about their customers and it has shown. Ex my coworker's order was 10 minutes late so they gave him a $5 credit! I'm so happy I found this app! It's super convenient for people like me that work in downtown Toronto and sometimes don't have time to make lunch :)"}
{"text":"Feast is definitely a great option for those who work in downtown Toronto. The food is quite high quality and nutritious and reasonable priced! After you place your order you will get it within 20min via a bike carrier. Ordered the bulgogi beef bowl for lunch today with two free chocolate cookies. It was delicious and a generous portion (I was stuffed afterwards which is saying something). Note that the meals aren't served hot so you'll have to microwave it.  Tip: order ahead of time as some meals sell out fast. It doesn't look like you can order ahead of time on the android app (from what I saw which is a bit inconvenient) but you can on the desktop website."}
{"text":"Very convenient for anyone working in the financial district of Toronto. I've been a loyal customer since Feast first opened in 2015, and I am very happy with the quality of food and speed of delivery.   A side note is that their lunch portions are not that big (not sure about dinner since I've never ordered dinner from Feast)."}
{"text":"I ordered Feast while I was in the Downtown area, so I could bring it to work the next morning.  My boyfriend have given me a $10 credit, and after I ordered, he received $10 as well. My total for my meal after the credit was under $5  Comparing this to Uber Eats, I have no idea when my food will be delivered.  I was surprised when it was delivered via bike in under 10 minutes.  I ordered the Tuna Tataki rice bowl.  the meal was sufficient enough for my lunch and afternoon snack.  My tuna tataki was nicely seared, and the ingredients were fresh.  I would recommend it for those who live or work around the delivery areas."}
{"text":"I like eating here at feast. The service is great and the food is tasty.  I do recommend anyone grabbing a meal in this decrepit Newman mall. I just don't appreciate the awkwardness when I eat here or there from feast's korean competition."}
{"text":"Perhaps it's the lack of English or misunderstanding, but my friend & I were turned away shortly after 7pm - even though the stall looked fully operational.  Man:  #1? Me:  Yes!  How did you know? Man:  No, no more.  Then we blatantly see other people getting food from that exact same place.  Yes, even a #1!  Not sure if they pre-ordered - probably not since it's a food court - but I couldn't help but notice that everyone that was being served were of the same ethnicity.  It would've been nice if they elaborated, like \"We don't have #1, but we can make you #3 & #5\", but we didn't get any explanation.  May go back, no where near closing tine, and write an update at that point!"}
{"text":"No customer service and rude Korean counter lady. Place is so dirty, wondering y the Health department did'nt see the molding ceiling tiles, dirty floors, poor exhaust system and ventilation.Dining tables and chairs are so \" yakkie\"..."}
{"text":"Let me tell you, farm to table deliciousness that is what Feast is all about.  I generally don't love salads, but their kale and beet salad is absolutely to DIE for.  Sweet beets and bite sized Kale, with pomegranate seeds, chick peas and I believe it's goat cheese with an incredible dressing all seasoned to perfection.  Even on days where I bring a lunch and I see that this is available on the menu I will order it.  Their other foods are also delicious as well!  The quality is never compromised and they really show how much they care in the way the food is prepared as well as the flavors that go along with it.   Nicoise Salad - Incredible twist with the Ramen Egg Chili Verde -  what incredible blow your mind flavors in every bite! and the scone to go with it, divine.   Chicken Sandwich - not just mayo bleh flavor but every bite is flavorful and delicious  Overall, this is healthy delicious restaurant quality food, delivered to you to enjoy!  It's just a hands down easy decision to make!"}
{"text":"Good place for Korean staple dishes. Good food. No tip. No taxes. It's in an ethnic food court."}
{"text":"Hidden gem!! This place is very tasty, offers authentic Korean food, also cheap and affordable! Highly recommended!"}
{"text":"I have a lot of respect of Feast. Not only do they take on the laborious task of creating unique gourmet menus, they also deliver it right to your location within minutes. Feast had saved me many times when I (a) forgot to bring lunch and (b) didn't have time to pick up lunch, (c) want to eat something delicious on a bad day!  I have had many lunches from Feast include the Chicken Doro Wat stew, Tuna Tataki Rice Bowl, Steak Cobb Salad, Moroccan Spiced Chicken Salad and Seared Halloumi roasted veggies sandwich. I am happy to report that they are all satisfying.   My favorite meal was the Tuna Tataki Rice Bowl. The bowl with Ocean Wise Albacore Tuna, Sushi Rice, Furikake Crunch, Tofu, Cucumber, Sesame Seeds, Pickled Japanese Cucumber, Fried Shallots, and Togarashi Spice aioli was an umami heaven. I devoured it within seconds.   With that being said, the only item that disappointed me was the seared Halloumi pesto sandwich. The bun was soaked in the roasted vegetables liquid. Aside from that, I applaud Feast for using buns from Blackbird Bakery, a local bakery. Fortunately, the customer service team credited me for the disappointment.   Kudos for your awesome customer service team and hardworking chefs! Thank you being my life saver!"}
{"text":"We ordered fried chicken with special sauce with rice on side,  so total $14 ($12 for chicken and $2 for rice) Taste was fine, nothing special to it. The portion it was small. Unfortunate they didn't give us kimchi,  I thought every Korean food place will give the kimchi with food we ordered. I guess not for this place!"}
{"text":"A wonderful Korean restaurant located inside the Newin Centre, Feast has been a popular place for locals to get cheap and tasty Korean fare at great portions!  They have a great menu with a range of traditional dishes. My favourite is their bibimbap dolsot - at just $7, it comes with tea, and their delicious kim chi. Actually, they make the best kim chi! Always fresh and flavour is not so spicy that it's torturous to eat - it has a wonderful sweetness not found in kim chi elsewhere.  I also like their seafood pancake. Huge portions that is great for sharing.  The friendly owner is always there to serve you with a smile on her face."}
{"text":"I came here w my mom one evening because I was craving Korean food. I ordered the spicy squid which came with a Korean style soup, kimchi and a mountain of rice. Although some of the squid was a bit tough, overall the flavour was amazing! The portion was huge, the Kimchi delicious and crunchy and the soup while a plain broth was pretty legit too.  The owner is also super super cute, her husband does all the cooking in the back. Well priced and tasty, I will definitely be back!"}
