{"text":"Today's breakfast burrito was too burnt and crisp for me. The bits of ham were charred on one side, flour tortilla was heated for too long. I should've just stuck with a carne asada burrito, but it's only 10am, so I figured get something breakfast. What a waste of 6 bucks and a 3/4 burrito worth of food. I am still hungry too :("}
{"text":"Got food poisoning from eating their pollo asado burrito this afternoon. Do not go here, was s fan before, permanently lost trust."}
{"text":"I like fast Mexican food and out of all the corner taco shops this has been by far my favorite..  Always fresh and hot off the grill/fryer it's one that I frequent regularly :)"}
{"text":"If you are looking for a good burrito you wont find it here. I kept giving this place a chance just by trying other things they had to offer , just because someone says its good don't believe the hype.....!!!!!"}
{"text":"I got the chicken taco salad this time instead of the shredded beef. They have huge chunks of chicken breast in there. It was a little too much for me so I gave it to my man.  I went through the drive-through, they couldn't hear me very well so told us to go to the first window. They took our order and were reasonably fast and very friendly.  The taco salad came out to 5 dollars. Reasonable/ affordable price and the food is VERY filling, and I couldn't finish it. (box it up for later!)  They gave me tons of hot sauce yay. Fried tortilla shell was very fresh. Pico de gallo, guacamole, sour cream, lettuce, shredded cheddar, chicken. My tummy wasn't too happy later but it was worth it!"}
{"text":"Don't go here if you're in the mood for Chinese food (like I did) bc you won't leave satisfied! That being said, they have some of the best Mexican food ever. Bring an appetite! Next time I need to come on a day I'm not craving egg rolls and sweet n sour chicken :)"}
{"text":"The food here is amazing.  Always fresh and better than any other 24 hour places.  The beef tacos, carne asada, adovado, and fish tacos are to die for.  This is my go-to place for mexican food.  The cashiers are the problem.  If you teach your cashiers how to be NICE this place would be 10/10.  right now it is a 6/10."}
{"text":"For a fix of a ridiculously large portion (pretty sure the Carne Asada burrito enchilada style might weigh 3lbs) of Mexican food that is pretty darn tasty, consider these guys. They happen to want to dish it out 24 hours a day, so that provides great opportunity to get the goods whenever you might need them.  Not the biggest fan of the ambiance inside so I have started just going through the drive through,  which is usually pretty fast and accurate...something not seen at a lot of drive through windows these days!"}
{"text":"Federico's has been the 24hr place to eat in this neighborhood for as long as i can remember.  The portions are large and they have a help your self salsa bar.  My wife likes to get the cheese quesadia and i like to get the Carnitas burito.  The place is clean and the food is decent. What more can you ask for in a fast food Mexican joint."}
{"text":"Longest wait times ever. There can be no one in like and I'll still wait 20 mins for a burrito."}
{"text":"One star for their customer service. I asked what comes on the Machaca burrito and the lady said eggs, cheese, machaca. They skipped the cheese when they made it so I spent my time and gas to go back. I asked for them to make it with the cheese. The lady then said she was wrong about it coming with cheese but said she'd ask the owner if they could remake it for me because of what happened.  The owner just straight up said no because they didn't charge me for cheese. Never mind that I come here once a week. When I reiterated that I used extra gas coming back to get it made as I was told it would be the lady who caused the problem in the first place rudely cut me off to say she gets it but since they didn't charge me I wasn't going to get it. Told them I wouldn't be bringing my business back. I get that it's just a hole in the wall joint but I expect a business to take ownership of it's mistakes and provide decent customer service in such an event. The way they acted about it was like I was a loser for trying to ask that they do just that. Forget this place."}
{"text":"If you're looking for a quick and solid breakfast burrito, this is your place! The burrito is of good proportion and they have multiple meat options to fulfill your craving. Definitely recommend this place and look forward to trying lunch and dinner options on their menu as well."}
{"text":"It was 3am & my hubby wanted food. He said let's go to McDonald's & I said ugh whatever. As we are about to pull up to the drive thru I spot Federico's & say let's go there instead! I ordered a quesadilla with sour cream & my hubby ordered the same with a carne asada burrito also, oh & 2 Dr. Peppers too. The quesadillas were huge & pretty good but so damn greasy, we both felt like shit the next afternoon. I split the burrito with him for lunch the next day & it was pretty good as well. We'd definitely return if we're drunk & hungry!"}
{"text":"I love Federico's on 32nd.  Easy jump from Scottsdale open 24 hours a day.  I usually stick to the steak, egg, and cheese Burrito.  It's is large and under $5.  The drive thru is quick except for lunch time and 2 A.M.  The Enchiladas and Tacos are great and the combo plate is a lot of food.  The rice is good but the beans leave something to be desired, I like a creamy refried bean myself.  These are not that good."}
{"text":"Look... You know what you're getting into when you pull up to a Mexican food restaurant with a yellow ,green, and red sign. For the most part it is what it is, but I think this Frederico's sets the bar pretty high for one of these.  I've eaten there many times, as I work down the street. Everything I've ever had has been good, if not very good-case in point, the Pollo Asado burrito- its killer. They even have a ground beef special burrito or tacos with a drink for cheap. It's really good for a \"Monday after\" lunch. Most importantly, it's never wrecked me, it is clean inside if you want to dine in, and it doesn't smell like pine sol.      Four Stars is Fair for Frederico's!"}
{"text":"Is it a super cheap 24 hour Mexican food drive thru? Yes. Is it fantastic? No. But for being a 24 hour Mexican Drive thru its darn good. Food was fast and cheap and good.  I got the crane as ada plate and couldn't finish it.   Want cheap and fast and good? Boom. A great pick."}
{"text":"I used to order here all the time until the girl started working the drive-thru. She isn't very pleasant and never smiled. She would charge me a different price sometimes and she'd always short me one hot sauce. Like EVERY SINGLE TIME, if I asked for 4 sauces she'd give me 3 and if I asked for 8 she'd give me 7.  I won't be back. The drive-thru speaker is crappy and you have to yell and repeat yourself a lot. The inside of the store feels unclean.  I started going to Filiberto's on Greenway/32nd--the country and sausage burritos are the same quality plus they are really nice and generous with the sauce! Plus their store is cleaner and I never have to yell into the drive-thru speaker."}
{"text":"Had dinner and disappointment.  Usually out if this world prices and food. Cheese Casadeas small and lacked cheese and my Chicken Burrito had hardly any chicken meat - what a disappointment.  Portions getting smaller - maybe not doing so well in this economy.  SAD had great experiences in the past!"}
{"text":"Worst huevos-rancheros. Pico de guyo instead of rancheros sauce. Eggs were hockey puck hard."}
{"text":"I stopped by Federico's for a quick bite to eat.  I ordered two beef tacos with a drink.  The woman at the counter was doing double duty at the drive-through so service was a bit slow, but the food was excellent.  The tacos were tasty, ,the lettuce was very crisp and fresh, and I was totally impressed by the food.  Very very good value for the money."}
{"text":"We ordered cheese enchiladas, and a steak burrito. The enchiladas had to be heated at home, the cheese on the inside was not melted at all. It appeared that they just threw cheese in, and rolled them. The red sauce was good though. My daughter did not enjoy her burrito, the meat was not tender, and she complained of too many green and red peppers. We did enjoy the complimentary chips while we waited though!"}
{"text":"Good service and great FRENCH FRIES, Get the bean cheese burrito double wrapped with extra cheese...now that will fill  you up!"}
{"text":"Open 24hrs..good fast food mexican. Never disappoints with late night food runs! Usually get the rolled tacos with guac, or bean burro. Both good! Drive-Thru available"}
{"text":"I tried giving this place a 2nd chance but it failed me...again. I got a \"carnitas\" burrito.  I prefer my carnitas shredded. Period. This was plain diced pork with the unmentionable chewies. I don't even think there was salt or pepper. Don't know what kind of oil they use but it leaves an after taste. There's not much inside but pico and a little guac so the burrito was dry. Not impressed with the tortillas either, dry and flaky. Just a sub-par burrito, but anything is good when you're hungry, just not $7 good."}
{"text":"First of all waiting in line no one answers are call. Then we proceed to go to the window and the guy does not speak English and does not understand what were saying. So ridiculous."}
{"text":"Good food, large portions, friendly staff. My only complaint is with the red sauce - it has a little bit of a bite but no flavor."}
{"text":"The young lady up front needs to learn customer service.  I ordered a special burrito and it was ok."}
{"text":"Good, inexpensive food. I particularly like the pollo asado tacos, but I imagine everything here is good; At least, everything I've ever had from here is good."}
{"text":"This is one of my favorite places to eat & I love that they're 24 hours. I live nearby about 5 min and my family loves their carne asada burritos. Me nor my family have ever had problems with service or staff, whether you go through drive thru or walk in, service is quick and the people are friendly."}
{"text":"For a cheap ass mexican place, its damned good! Lets face it there are a TON of \"-bertos\" and \"-icos\" ending mexican joints with interchangeable prefixes  but the Federicos on 32nd and Shea is truly one of the good ones. The AZ burritos are awesome as well as the quesadillas - try it with their green sauce and you wont be disappointed! Tostadas arent bad either :)(: one thing, steer clear of adding chicken or steak the quesadillas it ruins them, they get extra fatty/greasy! And hey, open 24 hours? Cant beat that with a stick lol"}
{"text":"5 rolled tacos with guac and cheese and they tasted fresh?! Say what?!  The tacos were crunchy and the guac was pretty darn good! The red salsa surprisingly was really good and didn't have the watered down taste like other Mexican fast food places.  The drive thru was poppin since it was lunch time. The horchata was the best and again didn't taste watered down.  My mom had a carne asada torta and omg was the meat GOOD. It was so tasty and well seasoned!  So happy I tried this place out and stopped by because the food was worth it!"}
{"text":"Great random burrito today in the heart of Phoenix, Mexico. When your driving around this part of town, it is either tortas, tacos or burrito's. Now this joint has locations all over the Valley, so I was just expecting another standard grease bomb. No fast food Mexican places use white meat chicken, but the pollo asado here is all white and it was simply placed in a burro with guacamole and pico de gallo. It was a large item and a great value at 6 bucks. Not sure why this burro was so good, but it hit the spot and did not even need any of the salsa that was available. The interior at lunch is full of working class dudes (mostly Mexican), but at least on this day at this location this burrito was excellent."}
{"text":"This place.. I love it! It's by far the cleanest and most decorated place that has \"ericos\" in the name! The staff is friendly and they always get my order right.   They have nice colorful paint and beautiful murals as well as nice art work. The tables and chairs are in good repair and matching.  I will switch up ingredients and they never get it wrong! Even on busy days!   The Mexican drinks are not made in house I don't think but pretty good none the less."}
{"text":"Breakfast Burrito always picks up my day. Not a fan of their red sauce, but the green is where it's at."}
{"text":"Home of the incredible exploding burrito. This place is awesome if you want to wear your food. Actually, that might be better than eating it. :("}
{"text":"I love the rolled tacos here! My kids love the country burrito. Always go through the drive thru. They seem pleasant. Priced good."}
{"text":"Place was clean and the service was decent but there food is so bland. Hardly any flavor at all. I had to douse everything with salt. Even the salsa was bland. I'll be back next time with a jar of Ray's spicy seasoning."}
{"text":"I'm in love with Mexican food, period. I travel quite a bit and always order the Carnitas Burrito and here I've returned often to. Drive thru is a little tough to find, but the staff is always friendly, and visited them many a late night(s). Thank guys!"}
{"text":"Monster breakfast burritos that tasted great. Open 24 hours with a drive thru. Service was very pleasant."}
{"text":"So I eat here after band practice often. I would recommend fish tacos but all the food is good.  they are open late!"}
{"text":"I'd been noshing on chips with guac at most places around town during a time warp in which I was, coincidentally, avoiding the gym. I finally hauled my petite yet burdened frame to Lifetime for some cardio and then decided to reward myself with more chips with guac :) However, to cut a long story short, the menu board was angled in such a way that rolled tacos with guac sounded even better. I thought they would be like 'berto's cause everything about the menu & signage reminded me of it....but it wasn't :( The tacos were skinnier, the guac a bit thinner, and the sauce not so caliente.  I think a hard-core gym rat like me deserves better - I'm gonna give it another shot for breakfast one day soon after I've pumped some iron or at least driven by Lifetime again :P"}
{"text":"Every time I go to a restaurant and see three fish tacos for $20 or so, I just have to laugh.  The fish tacos at Federico's are a perfect symbol of why I moved back to the Valley--cheap, tasty, and available 24 hours a day!  For about five bucks, I can get two fish tacos overflowing with cabbage, flavorful sauce (you can taste the fresh cilantro), and soft tortillas.  Sure, the fish is fried, but who is looking for healthy at 3 in the morning?   No, Federico's is my little insomniac gem with great, inexpensive, satisfying food.  So delicious and so convenient!"}
{"text":"Delicious! I went to the Shea and 32nd street location! Get the rolled tacos with delicious guacamole! I will return soon! Thanks!"}
{"text":"Good fast-food Mexican - fresh, tasty, hot, prepared to order. Grilled chicken and anything (burrito, taco, etc) is a good buy. One caveat: if you order chips&salsa, you get a nacho-looking presentation of chips spread out on a plate, then smothered in pico de gallo salsa instead of the customary basket + salsa as a dip - didn't see that coming. We both enjoyed our meal - a good meal."}
{"text":"This place is great for takeout, always open (it seems!) when everything else nearby is not, plus it has a handy little drive thru so you don't have to get your lazy butt out of the car.  It's basically a cousin of the 'berto's chain and has gynormous burrito's. I like to grab some when I don't feel like making breakfast. The sasuage egg n cheese is my fav and JD either gets ham or chorizo.   One late boozy night we had the Super Nacho's and they must have weighed 8 or 10 pounds! Heaped with beans guac, sour cream, cheese and steak- they were awesome but definitely a diet assassin. I'd get em again though!"}
{"text":"I ordered the Chicken burrito and I cut it in half.  I'm looking around and see nothing but plain chicken. No beans or lettuce, pico. Nada, Just Chicken!! Okay what the heck is this? I take it back up and thought they made a mistake. They say that everything is extra! Seriously that's nuts, they have no idea how to make a good burrito, they only want your money. No wonder this place is so slow. I asked for my money back so the girl swiped my card and said it's back on your card. Well that was A week ago and still haven't got my money back. I called and they said they have to send it to the accountant. I strongly suggest you do not amuse these clowns with your money!!! Total waste of money for some money hungry crook that runs this joint. They will not be in business for long."}
{"text":"Made it home and EVERY SINGLE ITEM i ordered WAS WRONG!!  how hard is it to get rolled taco,s and  a burrito right??? I won't be back!  I'll go to one of the other ten Mexican food places in the area that can get a three item order right!"}
{"text":"Everyone knows you don't want to eat food at a place where nobody from that culture eats, so it is a good sign when you see a lot of Mexican folks eating at a place during lunch. On an odd side not I was just debating between saying \"Mexican\" or \"Hispanic\" I went with Mexican since I am reviewing a Mexican restaurant not a Hispanic one, (in case someone P.C douche wanted to crawl up my arse)   I have only eaten one thing here and I have eaten it repeatedly. The Breakfast burrito hits all the right marks, huge, cheap and delicious. For $4.25 after tax you get what I am thinking is about a pound of breakfast food, freshly made (sometimes you have to wait a bit) wrapped in a tortilla. I get this in the morning a few times a week and don't feel like eating again until about 4 pm. If you are looking for a good cheap breakfast I would try this place out for sure. I haven't tried anything else yet but I did get an up close look at my coworkers lunch and it too was huge and looked amazing. I sent a customer to them the other day who was looking for a place to eat and when he came back he raved about his burrito. ."}
{"text":"Im updating my review because I finally have a place to go for tacos. They have accommodated the fact that I'm allergic to corn and they recently made me some delicious carne asada tacos on a flour tortilla!  From 1 star to 5 stars again - Thank you Federico's!   My brother wanted to go to Federico's tonight and I agreed hesitantly due to my past experience. I ordered a burrito since I have a corn allergy and they won't substitute the corn tortilla with a flour tortilla. When we got home I realized they gave me a fish taco on corn tortilla so, I drove back to let them know I had ordered a fish burrito not a taco. The lady then said she would have to charge me for the difference of the burrito and I said no that's ok just refund me. She was confused and didn't understand so I explained in Spanish - still confused she took the card and charged the difference for the burrito so at that point I just let it be. The burrito was extremely cold so I could only assume they used the same fish from the fish taco they originally gave me. I ended up not even eating it Because it was that bad. Thanks for wasting my time and money Federico!"}
{"text":"Good food and a 24-hr drive-thru, great on the way home from a late shift."}
{"text":"This is my favorite late night Mexican food place. If you like steak, get the Carne Asada burrito. It's like $6-8 and it's large enough to share. All it is is steak and a bit of a guac mix... what it is - is the best late night dinner ever! I have used this burrito for many successful bribes with my husband as it makes a great reward.  My friend loves the fish taco - it's very big too. One of them is plenty to fill you up. The only down side is it's very difficult to eat while driving so plan to be stationary when you order one of these. The regular taco sauce I would say is pretty mild so if you like it hot be sure to ask for a hot sauce instead of what normally comes with the food."}
{"text":"When I say no tomatoes, that means NO tomatoes on ANYTHING!  I come here with el boyfriendo when neither of us wants to cook, but he wants to indulge his taco heritage.   I love the super nachos, especially when they don't put tomatoes in it. Insert EXTREME food allergy.   I don't think I've ever left the drive thru in under 15 min, or drove away with my food order correct. Sadness.  So because the special guy in my life has never had an ordering problem, and because once I pick all traces out of my meal, I award two stars."}
{"text":"Edible food at 2 AM. This location is better than most standalone Mexican fast food drive-thru open 24 hours. I had a simple bean burrito with cheese and sour cream and can't complain. A good stop if you're in need of comfort food."}
{"text":"Place is always consistent. I really only go there for the burritos, which are the best here in Phoenix over all of the other 24hr Drive through mexican joints... I always get a Carne Assad burro, no guac, no pico; add cheese and beans. 2 beef taco rice & bean meal is always good as well. Never had a bad experience here and have been coming here since it opened."}
{"text":"I really wish they would open one in north San Antonio Texas. This state has the worst Mexican food. I grew up eating Federico's for the last 24 years. I feel so incomplete without their Carne Asada and bean and cheese burritos :(   Please open one in San Antonio Texas!!!!"}
{"text":"Stingiest Federico's I've ever been to. Won't give more than two sauces a burrito. Cringe heavy employees."}
{"text":"I stop in after work once a week for the Carne Asada burritos, They are loaded with meat that is good quality ans stuffed, no skimping on this burrito, re fried beans and cheese delicious, don't really so much for the rice, very bland and unflavored. All in all though best Mexican food for the dollar anywhere"}
{"text":"I've lived in San Diego and had \" most likely,\" the best burritos in the word. Not to mention making many trips south of the border, the burrito I had was above average.   The only down side was towards the end it was a little cold.   I suppose being in an area with so much Mexican food could effect the rating, if this place were in South Florida or Hawaii, I'd have to give it five stars. Believe me there aren't any great Mexican restaurants there."}
{"text":"I am giving them 4 stars for making the heaviest batch of nachos I have had in a very long time. It was piled high with tons of meet, cheese, guac, sour cream. I was in nacho heaven. Yes I have been to just about every -icos, bertos, etc, but they were very generous on this particular day and I know it. Thank you for helping with my nacho fix. If I am ever in this part of town again, I just may stop in and say hi.. and grab some more nachos!"}
{"text":"This Federico's is the best. Beats all other Juliobertos or Filibertos. Portions are huge and the quality is MUCH better!"}
{"text":"I hate leaving battery views. I really do. But the fact that I waited 25 minutes in the drive-through to get my food to have them forget my Flawn and have to go back around in the line and wait another 25 minutes was ridiculous. I waited so long I'm not even hungry anymore so so the $20 that I just spent on two tacos and two enchiladas is now wasted"}
{"text":"I eat there all the time but this time they messed up my order and I called them. a nice lady named Jasmine said she was sorry and would re place my order and what was my name. I told her and she said come back in and it will be replaced. I went 4 days later and the lady at the window said I say your name but the note is gone. So your not going to replace my order no I don't know where the note went. What do you expect I guess. Never going back as there is a Filibertos around the corner, same food."}
{"text":"Although Frederico's didn't light be on fire- it's good enough.   They were quick and tasty so what more can you ask in Mexican?  I really enjoyed my fish tacos (as I always do) but TBone wasn't in love with the enchilada that came with his lunch- the sauce was pretty bland- not normal for Mexican fare.    The \"dining room\" is seat yourself so it has a fast food feel but for a quick meal in a strip mall town it'll do just fine."}
{"text":"Still one of my favorite places in tokwn for Carne Asada!  The fish tacos are really very good too!"}
{"text":"We decided to check this place out and were very dissatisfied, walking out after a few bites.  I ordered fish tacos which were over-fried and the large chunk of fish was dry and flavorless.  The hunk of fish was so large it left little room for anything else in the tortilla.  Instead of the usual white sauce I'm used to anywhere else I've had fish tacos, tarter sauce was used.  Horrible.  My wife had a beef taco that tasted of very used oil and fish, and an enchilada that still had unmelted cheese in it with sauce that tasted like it was out of a can.  Maybe just a bad night there, but we will never know because well never give this place another chance."}
{"text":"By Default, the \"-icos\" and \"-bertos\" are two star operations, but this particular Federico's stands out a bit from the bunch in service, quality, and location and facilities.  Its a bit spacier and more relaxed than most.  Surprisingly affable and fast staff at this location.  In my opinion, there are one-star items and four star items on every icos/bertos menu, the key is determine which items are four star for you, and then try to not stray off the trusted path.  For me at Federico's, I can count on good rolled tacos and serviceable bean burritos, but I've been duped many times (while hungry) to delve into the numbered combos, and I regret it everytime.  The side beans and rice are just blah, blah, blah x 10.  The Carne Asada is pretty close to foul, and the shredded meats seem very canned and oversoaked.    But its in the smaller treats where Federicos can win you over (nachos, maybe a flauta, simple burritos and of course rolled tacos), so the three stars is well earned in that regard."}
{"text":"Not impressed, service was slow and the food was mostly not appetizing. Felt a little let down with this meal. A shame since there is not alot around this area to pick from other than chains."}
{"text":"My Husband and I had lunch today at Federicos, he loves their Fish burritos, they are huge  !  we live in scottsdale, but visit this mexican restaurant often, so worth the drive!   they also have good green chile !  they make their beans with soy, so they do  taste a little different !! this place is very clean also !!   good food ! good prices !"}
{"text":"I really have to refrain from not going here more than once a week since it's right down the street from house! Huge portions that are sure to provide a full meal of leftovers for the next day. Their chips and guac are served with a giant amount of guacamole.  Cheese enchilads are the best! Fast drive through service too! Yummy yummy yummy!"}
{"text":"I don't know how they have 3 Stars. We order the Vegetarian Super Nachos and Bean and Cheese Burritos a few times a week because they are so delicious!! We've tried other locations and they are NEVER as good as this location. Our food has always been fresh, hot and delicious!"}
{"text":"so ive been here a lot. it used to be my go to place but lately the service has been HORRIBLE! No one even said thank you the past 2 times. the food has been garbage the past 2 times too. I ordered a bean burrito and the beans looked like they have ground beef in them. It was not good at all. 1 star doesnt do it justice."}
{"text":"We have a love/hate relationship with this place. Here are some pros and cons:   Pros:  1. Close by our house 2. Food is amazing (our favorites are the shredded beef taco meal and the shredded beef chimichanga meal. Their guacamole is great too!)   Cons:  1. It's very pricey for what you're getting. Carolinas isn't too far away and is a whole different level of amazingness for cheaper. You can't leave here without spending under 10-15 dollars a meal realistically.  2. The salsa is horrible. It tastes like watered down salsa if you were to replace the water with vinegar. It's just not good, and I feel like salsa can make or break a place. 3. The service is so-so. It doesn't bother me that they don't speak English well, but it takes FOREVER. I imagine that it is because they are making your food fresh, but it takes 15-20 minutes to go through the drive thru. Just know that you can't go here in a rush or you'll find yourself trying to escape the drive thru lane!   It pains me to do this, because we obviously keep coming back, but the 3 stars are simply because the cons outweigh the pros. The truth is that if Carolinas was down the street from us, we'd choose it over this place in a heartbeat."}
{"text":"Great fast Mexican food! Really friendly and always large portions and good quality. We've tried the steak burrito, green chili chimi, taquitos and breakfast burrito and have loved them all...over the course of months and not all at once (or our tummies would have exploded). It's our go to place for fast, fresh mex. As a bonus, they are open 24 hours so great for late party nights!"}
{"text":"Fredrico's restaurant offers good customer service. The food is homemade and they really put their heart into making a great customer service experience. It's been a while since I have been here. I do remember the staff and food They work quite hard. Keep up the fastastic work!"}
{"text":"First time here and I'm VERY IMPRESSED! Was greeted like never before :) with a handshake and a warm welcome from Jesse. Made me feel like I was at home. My son wasn't sure what to order and he is very quiet so he helped him by offering all the toppings he could choose from to make it easy for him to get something he would like :) the food was amazing! I do not live close, was only in the neighborhood for an appt. but I will drive back for the food and hospitality often. Happy I found this place.  Happy customer- Jennifer f"}
{"text":"I've given this place a couple try's due to its close and convenient , but that stops today . The beans are flavorless , the tortillas always have burnt spots on them and taste horrible .. The carne asada fries are soggy.  This time I ordered 2 bean n cheese burritos and get the receipt and charged 3 times for extra cheese , that's because the bean and cheese burritos don't come with cheese so you pay extra for it and if you order it with extra cheese then you pay twice . So in the end I payed 3$ for cheese .. I coulda bought a whole bag of cheese for that much ! And I get home and definitely no Xtra cheese on my burritos .   Here's a tip to the business : Include cheese in the price of your burritos .    Needless to say , we'll never be back due to the flavorless food and ridiculous prices ."}
{"text":"Not the healthiest but man Carne asada burrito and an ice cold horchata is one of summers  best meals."}
{"text":"Great food, great prices and serves fast!  We are always satisfied when we leave Federicos.  The deep fried chillies are my favorite with any meal and they are FREE!"}
{"text":"Went back a second time and still yummo! We'd forgotten that they make you fresh chips when you get there. That was such a great surprise. I hope I forget every time we go! :) This time I had the Chilli Rellenos. They were good, a little bland, but there are lots of salsa options to help spice it up.  We're going back. For sure."}
{"text":"This girl  that work the counter is so rude, her attitude is as ugly as her face,lacks people's skills or maybe she is just the one that cleans the bathroom where she belongs, props to the cook though, great food."}
{"text":"I left work yesterday morning and stopped to get me a breakfast burrito...To start off with, their drive-thru is open 24 hours so me stopping in at 230am was no big deal.  I got the sausage and egg breakfast burrito and a large drink all for under $10.  The burrito was stuffed with egg and sausage....BEST in the Valley!!"}
{"text":"I was double charged and went back the next day and they would not give me back my $18.09.   I'm pretty pissed off!   I love the food here but I prob won't be back!"}
{"text":"Imagine a Fili or Roliberto's but restaurant quality with quality ingredients. For this style restaurant,  they are the best in the valley."}
{"text":"We live in Phoenix. Finding a good, quick Mexican food place should be easy. I wish I could say this was my new go-to Mexican food joint since it is right up the road from me. We went here Saturday evening around 6:30 and we were the only ones in the place. I ordered the chicken enchiladas, which were mediocre.  I am not a huge fan of dark meat with half the fat still hanging on, and unfortunately that's what was packed into my enchiladas.  I tried my husband's carne asade burrito, and it was tasty, although took a long time to chew. The prices were great, and we ordered chips which were hot from the greaser and absolutely delicious. The chips were probably the best I've ever had, and certainly the best part of my meal."}
{"text":"Been going here for 3 years but I cannot take the service any more.  Food is fine when you get the right order.  The drive through is a nightmare.  The speaker is broken and you cannot understand them and they cannot understand you.  For the most part, the service is very good.  But, like most restaurants of this type, they really do not care if you get good service or not.  This morning was the last straw.  3 times now I have not gotten what I ordered, or the way I ordered it.  Today, the DT was very busy, and I ordered a Bacon Egg Cheese burrito, with 2 fried jalapenos.  My favorite. the person taking my order, a male, does not speak good English.  I had to repeat the order 3 times to him, and then made sure that the girl at the window, knew what I wanted, green sauce with 2 fried jalapenos.  What I got was a potato burrito, red sauce, and pickled jalapenos with carrots.  Really sick and tired of people not listening to what we order, and not paying attention.   I estimate I go there 10 times a month, for around 80 bucks a month spent times 12, that is 960 bucks a year I spend there.  Time for other people too, to find another place to buy mexican food, some where they appreciate your business instead of taking it for granted.  Sorry Federicos, last straw.  I wont be back."}
{"text":"Good for late night food, but I've never had guacamole on a burrito. A bit different but satisfying."}
{"text":"This is the local \"Berto's\" to our apartment complex. They are always open in the drive-thru and never disappoint. Technically this is Frederico's not Berto's but they don't settle for anything less than the best. I've been to many of the Frederico's and Berto's chains and the only one that compares to the fantastic quality of this one is Eriberto's on 3rd street and Bell.   My roommate and I are regulars here now and are always welcome."}
{"text":"They have a B rating for health! Tastes like it too. The breakfast burrito was filled with all sorts of meats we had no clue what they were and we both got sick off them. When we went the first time it was just OK, second time we got sick and it was disgusting anyway. Of you're from California and looking for a similar hole in the wall place, forget about it."}
{"text":"I knew we were in for a bad Mexican experience when they offered French fries.  The cashier was really friendly but food was just HORRIBLE!! Taco Bell would have been better."}
{"text":"Visited this place last week because I live in the neighborhood and needed some quick carry out. The enchiladas I ordered were barely palatable. The shredded cheese inside was completely cold and unmelted, the tortilla was soggy and the mexican rice was almost devoid of flavor. I won't be going back for more."}
{"text":"This is the worst Mexican food I have ever eaten. We live just down the street so have gone here on occasion. Most of the time it is hit and miss. I ordered the carnitas plate this last time and let me tell you it was the most disgusting plate of carnitas I have ever had. It tasted as if they opened a can of dog food, heated it up in a microwave and then served it. It was so unedible that l had to through it out and ended up eating leftovers instead, it was so gross. As I said before most of the times I have been here have been hit or miss but this time was the last for me. Do not eat here if you are looking for good Mexican food."}
{"text":"Dang it really really pains me to write this. I come here Atleast once a week. Rarely with any problems. There has been instances when the cheese taste a little moldy and let's be honest terrible but that's only maybe 5% of the time so twice a year I can handle that. It's a 24 hour Mexican food drive thru. It's expected to an extent. But today I got to the bottom of my water I got from the drive thru there only to find a dead mosquito. I know it's mosquito season trust me they are everywhere. But in the bottom of a cup that I just drank all the water out of is insanely gross and a complete turn off. I'm out. After Atleast 75 visits to this location is kills me to say I've had my last. I guess I'll have to drive to 32 and greenway to filibertos now to get my weekly Mexican cravings. Update it no longer pains me. Ladies inside working drive thru and indoor cashier just sit there and talk bad about the customers and laugh. Both of them are b****es. Will never return to this place"}
{"text":"Came through for the first time this morning for a chorizo burrito. Good price and got a HUGE burrito. On par with filibertos, los betos, etc. I will be returning!!"}
{"text":"We eat here about once a month or so and enjoy it everytime. It's nothing fancy or special but it is great food and cheap prices. I always get a burrito, and chips n dip. I had a friend get a sandwich with fries and he said it was delicious too. (Their fries are amazing). We will definitely be back soon."}
{"text":"When I get food I expect it to get it the way I ordered it. I even said extra guacamole on my carne asada chips but no beans at the menu and the window. When I got home I got extra beans with just chips. I love the food. But since something is ALWAYS wrong with my order I think I'll go elsewhere for food from now on."}
{"text":"I was raised in Tucson and my go to for breakfast burritos has been Nico's Taco Shop. I moved to Flagstaff for school and was unable to find an equal to Nico's. I then moved down to Phoenix after school and began my search again. It was ecstatic when I bit into that breakfast burrito jette and found that it was the replacement burrito I have been looking for.  Great food,  good salsa. 5 stars"}
{"text":"I've eatin here 15 times or so. Its the neighborhood berto's and always hits the spot. Of course tastes better after a night of drinking. Great lunch as well."}
{"text":"When you need tacos and 3am, this is the place to go if you live nearby."}
{"text":"This place was the only thing that was open in the area at 11pm. I was starving and I figured I'd give this place a try. This was a HUGE mistake! I ordered a shrimp and steak quesadilla to go. By the time I got home the quesadilla was not only swimming in fatty oil but it was drowning in it! I was disgusted at the pool of grease that laid atop my food! I tried to save it by blotting it with napkins but it was no use. I was NOT going to put that in my body. It was just not worth it."}
{"text":"Amazing food for a great great price! Their food is really good and their guacamole is good to a little bit pricey but still good. The portion sizes are really big I got a combo with two burritos and had enough for lunch and dinner. Overall I would recommend this place."}
{"text":"Okay. Last update. I'm done. I'm addicted to their Pollo Asado, but enough is enough. Everything is greasy, greasy, greasy. AND, if that weren't bad enough, this time I got carne asada instead of Pollo Asado, and the rolled tacos were flabby, greasy, and disgusting. I'm cured."}
{"text":"This place is the best absolutely awesome if you drank and partied all night. great for a hangover open 24 hours Connie Asada burrito is the cure for all and will soak up all the alcohol don't forget to get extra salsa"}
{"text":"Eh... it's 24-hours which is a plus.  It's reasonably priced and accepts credit/debit cards, another plus.  Food is offensive but a bit on the bland side.   I don't go here unless I have to."}
{"text":"Federicos is right across the street from my apartment and I honestly don't know how I got so lucky. They are open 24/7 which is a HUGE bonus. Their horchata is amazing. I'm vegetarian and they created a veggie burrito for me which was outstanding. Forever my first option"}
{"text":"Returned to this restaurant for another chance at their menu. I ordered a Breakfast Burrito with a side of beans &  rice. The Burrito was filled with ham, potatoes and cheese. All was very good. I can't wait to try something else."}
{"text":"Just not as tasty as other burrito places. The first time I went to a burrito place and it didn't hit the spot. Hot sauce wasn't hot at all and very watery."}
{"text":"Size does matter!   That is what they serve here, the burritos must weigh about a pound and a half no matter which one you order.   I prefer the Carna Asada, Chorizo with Potatoes or Breakfast Burrito with Eggs, Potatoes and Sausage.   The Carna Asada Tacos are huge served I'm a soft taco and you can barely bend the tortilla because there is so much meat and salsa.  I also like the cheese quesidilla which also is served on an awesome tortilla.   Everything is very inexpensive and pretty fresh tasting.   So to sum it up huge portions, cheap prices count me in on coming back for more!"}
{"text":"i used to love this place when it was a Filibertos years ago. i was actually sitting at the drive thru window when this place was busted my immigration officers about 9 years ago..i was so upset afterwards...it went from a 24 hour food spot to a place that closed at 10pm :(  ohh memories. i haven't tried it since it changed to Federico's but lets face it. all these places are pretty much the same. cheap delicious food that is a gamble every single time."}
