{"text":"Some bomb bean and cheese burritos!  We normally stay at a time share next door a couple of times a year and always see this spot... finally stopped to pick up something and so glad we did! Ate there twice already in a two day span!"}
{"text":"Originally I really liked this place. I was so excited to find a Mexican place that wasn't taco bell or robertos for lack of a better comparison. I loved the fresh tortillas and just the overall flavor of their plates. The first time I went, I was with my boyfriend. I got the chorizo plate and he got the carnitas plate. We went home to eat and about 1/4 of the way through his food, he found a hair. He immediately threw his food away and we called to inform them. We aren't the kind of people that call to get free shit. We just want to let whoever is in charge know that they need to keep an eye on their chef. She started trying to almost defend it? Saying things like \"oh he's human. we wear hair nets. Hair in food isn't our thing\" like yeah we get it, but fix the problem. She ended up comping him a meal which he picked up at a later date. We went back because everyone deserves second chances. We had gone there 2 more times. Then 2 days ago he went and good food, and behold, another hair. Now we double checked this time that it wasn't mine or his. My hair is long and his is very very short. This was a shorter but not super short, black hair. Unfortunately, with this being the second time, as much as we enjoyed the food, we will not be returning."}
{"text":"Steak nachos are to die for. Love that it's 24 hours. No extra for salsas. I asked for a grip and they gave me lots. I did have to check my food because sometimes they forget to leave out certain sauces I asked not to put on my stuff. But scrumptious place for 24 hr drive thru"}
{"text":"We came for breakfast based on yelp reviews. Place looks a bit run down but breakfast burritos were wonderful and staff were really friendly!"}
{"text":"A little bit weary about this place.. the food is good however right after we ordered our food.. the cashier ( Mexican lady) turned around and started handling the food-- without washing her hands. I immediately stopped her and asked what she was doing.. she had the tortillas to my tacos in her bare hands after charging me. She was mortified and just looked at me. I asked her in Spanish\" what are you doing, do you plan on washing your hands?\"... she stuttered a response of \" I didn't touch money though\"... and I said \" you charged my card, and touched the register\"... her comeback was \" this is for me\"... she put the tortillas down on the counter and disappeared. She never came back out. I seriously stared at them the entire time they cooked my food.. scared to death they will spit in food! Haha! Don't think we will be back. Sucks because the food is good.. would NEVER order drive thru.. especially after homegirl tried to cook my food without washing hands... yuk!"}
{"text":"I asked the lady at 7-11 if this place was any good. She whispered in my ear the Health Dept. wrote them up 2 days ago, for what she did not know. Upon entering I noticed they hung their health department certificate of C way up high near the ceiling...probably so people wouldn't see it.   I took a chance & ordered the carnitas nachos. You get A LOT of meat. The shredded cheese wasn't melted thoroughly. The sour cream was more of a white sauce. The refried beans were acceptable. There was a bunch of fatty oil at the bottom of the plate. THERE WAS MORE FAT THAN MEAT!!  Gross. Nothing worse than biting into a chunk of fat. Clearly the meat hadn't been trimmed...it was everywhere. The meat I did see was dry. The flavor...after 6 hours I still taste it. There was nothing fresh about these nachos.   The menu is WAY to big, comprised of lots of pictures. Burrito, enchilada, taco, quesadilla offerings are literally in small print. I was standing right beneath the menu & still had difficulty reading it with my glasses!!  After hearing a friend rave about this place for months I decided to try it. I seriously doubt I'll be back. I'm not keen on Mexican food to begin with, so I know great Mexican food when I have it. This was not even decent Mexican food. It was just nasty on a plate covered with cheese.  There is nothing legit, or great, or bomb about this place. I question the palate of those that say it is."}
{"text":"Omg I miss California Mexican food and had to settle for chipotle in Vegas to feel \"authentic Mexican food\" but a coworker mention this place and damn. The streak quesadilla, burritos, chimichangas... Pretty much most of the food is good. For a little hole in the wall it's great food! Great flavor the only down side was that I love spicy food and their sauce was not as hot in any way. That's why minus a star lol I know theirs folks out there who think the same but great service and great place!!!"}
{"text":"I came to Nevada from So Cal and didn't eat any Mexican food here for two years. This place is the perfect place to stop in and get authentic fast Mexican food. It's the corner burrito shop I'm missing. The menu is staggering and the food is excellent. The chorizo gives anybody but Abuela a run for their money. Only reason I'm not giving 5 stars is the salsa needs improvement. I recommend the bright red salsa."}
{"text":"Best Mexican food I have had in Henderson. My fiancé and I ordered an assortment of items for pick up (I think we used eat24) everything was ready when I arrived to pick it up and still hot and ready to eat. One of the employees was cleaning down the salsa bar yet he still was helpful in packing up some salsa for me to take with us. I will definitely be back! This place is great!!"}
{"text":"Stay away  - unless you like to get ill! I bought a Torta de Adobada and woke up mid through the night with diarrhea. I should report and send sanity to inspect their premises."}
{"text":"Felipitos is the best Mexican food of its type. You know that drive through corner type 24 hour cafe. There are a few similar places in Vegas but this one is always crowded and has people driving from as far away as Henderson to visit.  I like the Carne Asada fries. But the taquitos and burritos are pretty good too. It reminds me of that taco cart type food you get in TJ."}
{"text":"Visiting Vegas from LA - we needed gas and stopped at the local 7-11.  The place was nice and cool inside- loved that! Variety of items to choose from, combo meals and cute salsa bar near the beverage area.  I ordered the combo - 3 soft chicken tacos w/beans rice and a drink for $7.50 not bad. No chips came with my meal so I placed an ordered for $2.50 My guy ordered the chicken enchiladas combo. He thought it was ok - he liked the thin warm chips and the strawberry churro. Total bill was about $15.00 He did say we wound return someday. Which is a huge compliment because he's a very picky eater.   One down fall was the music they played the same song over and over for at least 30mins. Instrumental funeral music. Dj wake up. Haha  Lady behind the counter was attentive- needs to smile a little more :) I know she's busy."}
{"text":"Horrible . I ordered food through grub hub at 11:19 pm . I called the restaurant and was told that the driver didn't show and I would receive a full refund . At 130 am the driver showed up . I contacted grub hub and they asked the restaurant for a refund and THEY REFUSED . They LIED and said that the order was remade . How did they make it when I called them at 1:00 am and they said they had to leave because they closed at midnight .   I work in the service industry in the area . I encourage all fellow service workers to stay away from the restaurant. They don't care .   At least I have a story to tell all my friends and customers and encourage them to stay Far Away from this company .   Look for more posts on Las Vegas bartenders and servers and Henderson bartenders and servers ."}
{"text":"The Santana burrito is great I'm from the bay area so I'm probably a lot more picky than most when it comes to mexican food especially burritos and by far this is the closest I've had to a bay area super burrito it's missing a couple things but other than that I have no complaints and the size and price are right on point with what I'm used to back home."}
{"text":"this place is the bomb for a late night sesh. i've had tacos, plates and wet burritos. all great. i recommend getting adobada, since it's delicious and also, the only meat i've chosen so far. my friend got a carnitas quesadilla last time and she said it was really good, it looked like a greasy-good-time so i'll be trying that one soon. i usually eat here with two vegetarian friends and despite the bummer that there's only one thing on the menu they can order (vegi burrito) they really like the place. i will say that the beans here (refried only) aren't bad but i don't think they help the overall taste of whatever dish you get them in. i always enjoy eating outdoors and being sketched out by the other late night taco seekers who roll through. the price is right, the location is good and most importantly the food is grubbin'! solid spot."}
{"text":"Super tasty and authentic food! The portions are HUGE and the carne asada fries are to die for. We usually get delivery so I can't speak for the dine in portion of the restaurant but the delivery is super quick and the drivers are always friendly."}
{"text":"I come here all the time on the way home from work. Convenient since they are open late. They have gotten alot better since they opened. Love the Santana Burrito. It has everything (guacamole, cheese, sour cream, rice, beans, pico de gallo) for a reasonable price (unlike Robert's that charges you for every single ingredient). My husband is picky with burritos but he loves this one. Their other dishes are good to and cheap for their size. EDIT: JUST DON'T DINE HERE ON MONDAY'S & TUESDAYS. THE COOK SUCKS. He's very unprofessional when you return to let him know he was missing things from your order. Otherwise we will keep coming back on days he is NOT there."}
{"text":"The food is OKAY. Edible but bland. Not sure I'll be returning.   The food has potential. They need to definitely bump up the flavors. The hot sauces are watered down so it didn't help with their food."}
{"text":"I've been looking high and low for good, inexpensive street tacos....they call them mini tacos. They were amazing! Full of flavor, and stuffed full! My husband got the wet burrito, and ...well...I can't get an answer as he can't put his fork and knife down....safe to say he's loving it! We also decided to share the carne asada fries....lol....we have WAY to much food! They are very generous on the portions. We figured that it being so inexpensive, our meals alone wouldn't be enough....but that we couldn't have been more off!  Highly recommend!! Salsa bar is small....but the flavors are huge!! Definately try if you get s chance!"}
{"text":"It was very hot inside.  Very few people and I placed my order online and still had to wait. Portions were good for the price."}
{"text":"It's probably not fair to review a place when I am SOOOO steaming mad! Maybe I should wait until I cool off before saying something about them. However, if they deserve the bad review then it's on them.  Allow me to explain:  1. I am allergic to avocado. Plain and simple, I cannot eat them. Obviously this includes Guacamole which is a Mexifood staple. Now that being said, Mexieats are my absolute favorite so I am extremely vigilant when it comes to ordering.  2. I always have a local 24hr Mexigrub place I adopt as a favorite and then I FREQUENT said establishment. I have recently switched jobs (thus location) and have been looking for that place in my new area. My new job is graveyard shift and I only have a very rigid 30 mins for \"lunch\".  I read the reviews and was willing, even eager, to try out this place in the hopes that it could be my new Mexistation.  So:  03:45 hits and I clock-out and run out the door, hit the ATM and then proceed to Felipito's. I order the special which is 5 Rolled Tacos (Flautas) with all the fixins but I state NO GUAC. I also order the Carne Asada burrito and also voice NO GUAC. I add a large Horchata and proceed to the window. Now the window person is a kid, male, maybe 19yo and speaks excellent English with no discernible accent so I assume that there should be no language barrier which can sometimes be an issue for the allergy concerned. We greet, he takes my money and I then repeat my order to him in an itemized fashion making sure to articulate NO GUACAMOLE after each item. He states, and I quote: \"Yes sir, no guacamole\". I think \"cool, we got this\". I wait the 15 minutes (exceedingly long but not abnormal for such places at 04:00 in the morning) and enjoy my Horchata (2 mediums instead of a large but whatever, no biggie). He then brings me my big'ole bag of yummy and hands it through the window at which point I ask again \"NO GUACAMOLE?\" again he states, \"yes sir, no guacamole\". I then hurry myself back to work and proceed to the break room to gobble down some Mexilusciousness before returning to my duties. I open the bag, then the box of Flautas and BOOM, a mountain of guac. I'm pissed. I go ahead and open the burrito, unroll it and again a quagmire of guacamole.  Did I have time to return? No. Did I? Your GD right I did!  I was not going to give them the opportunity of redeeming themselves by feeding me nor did I have the time to wait for another round of food. So I got my money back and left. I wanted very badly to give the kid an ear-full. I wanted even more to stuff the guacamole laced bag of death into his smug little pie-hole but I did not. I took my money and with practiced calm, left (my wife would be proud).  There are a couple of morals here but I will just close with one: If an establishment is so uncaring as to hire someone without a bone of concern in their body then they do not deserve anything but my disdain. I strongly encourage any of you reading this to move along to a different option. This place does not deserve your money.  Thank you for hearing me out."}
{"text":"The location is prime and so close to my house I want to love it, but the last time I got tacos, there was so much grease at the bottom of the to go box, it was at least a 1/4 cup, easily. I ate 2 and tossed the 3rd. Just TOO much grease. My husband said the bean and cheese burrito was good though."}
{"text":"No starts for this mexican food so far selling dirty meat so bad i never had this kind of food in my life so far so please be care about it and also so bad Service"}
{"text":"Best breakfast burritos in all of Vegas.  Chorizo is the winner here.  Totally authentic like I used to enjoy in San Diego."}
{"text":"A definite neighborhood best kept secret hidden in a 7/11. Don't be fooled by the exterior, the food is an excellent A+! My #1 choice is definitely the carne asada fries. Large selection in menu and great pricing. A must to check out."}
{"text":"Looking  for a burrito in Las Vegas? I found this Mexican drive through that is open 24hours when vacationing there. Try the Super burrito with everything or the steak and egg. These people make burritos for people who are hungry. I ordered two and the bag weighed about three pounds. The price is low less than four dollars a burrito and others less then three. Also if you are a seasoned burrito eater you will appreciate that this place can roll a proper burrito that will not fall apart on you. These were tight and stuffed. I had a poor chicken burrito on a subsequent visit but the steak and egg was still awesome. The salsas provided are to be avoided as they are dismal. No chips come with burritos here so if you want them ask."}
{"text":"I love their breakfast burritos and their excellent customer service. I definitely recommend this place to my family and friends."}
{"text":"Great food especially when coming home drunk from the club lol."}
{"text":"Yes it is on the backside of a gas station but dont let that fool you. This is top notch food! I have been here more times than id like to admit, but here we go. Everything here is Great except for one thing...the rolled tacos. Dont get them they are very bland. As long as you dont get the rolled tacos you will love this place! SERIOUSLY dont get them! The place is very clean and service is good. The Horchata is probably the best ive ever had and I've had it in San Diego and Mexico."}
{"text":"Incredibly bland food. I ordered 2 plates (1) the tilapia plate and (2) the jefe torta. They have no fish sauce from my knowledge the torta was wet and mushy on the bottom. The fries were tasteless with no seasoning. I can make fries better than these guys at home with a sprinkle of salt. The only plus here is that they give you a lot of avocado slices with these plates but none of anything tastes fresh."}
{"text":"Did Uber eats. I got the 3 mini tacos plate with beans and rice. No fork or spoon and no salsa made it hard to enjoy. Good thing at least I had hot sauce at work.  Will try again."}
{"text":"I always get the carne asada fries. They are awesome. It comes in a big portion. Its always thumbs up. The 5 rolled tacos supreme is also good. The server is also nice, i never have a problem whenever i go there. The breakfast burritos are also very good, they are also very big and worth the money. Any burrito is good. Trust me"}
{"text":"Don't let the location or building fool you.  This is the best Mexican food in Vegas. Their tortillas are magic and their ingredients are always fresh. The drive thru line is usually relatively quick unless someone ahead of you orders for 10 people. 24hours makes this the perfect place for breakfast any time. Short on cash? Their rolled taco deal has fed me many times!"}
{"text":"Tired of fast food, so I asked my cousin (a local) for recommendations on grub. He took me to Feipito's and i wasn't disappointing.I was skeptical on ordering Horchata (some places don't get it right) but it was great. I ordered a two taco combo (carne asada) and the portion was huge! The carne asada was fresh and the tacos were bigger than expected. I loved the side of beans and rice. Got the most out of my money here. :)"}
{"text":"No longer open 24/7. Open until 6am-12am at this location. Great Mexican food. Define luu worth trying!"}
{"text":"What a terrible place. We have ordered a few times but they have forgotten our salsa twice. They then put the phone off the hook when Grubhub tries to call to talk with them.  Really terrible place with liars who work for them. I know this sounds like an angry review but its the truth. We asked for our salsa in 3 places on the order and even asked nicely for it to be delivered when we discovered it wasn't there. Unfortunately they just put us on hold for 15 minutes and wouldn't answer the call when Grubhub called them.  TERRIBLE PLACE with bad and uncaring employees. The food is okay, but any other taco shop is as good or better. Steer clear and order from somewhere else unless you want blande food and headaches trying to get a resolution."}
{"text":"The Bacon and Potato Breakfast Burrito is spectacular.  That thick bacon is deli-quality.  You rock Felipito's.  Also, thanks for not charging a surcharge for using a debit card (cough, Roberto's)!"}
{"text":"Dont recommend food doesnt have any flavor. Meats is not made like carne asada is more like boiled grilled. Water so nasty n she wanted to charge me to change my water. I didnt like water down pineapple. So please dont go"}
{"text":"I am not sure what all the fuss is about.  Mediocre Mexican served out of a run down drive through with some concrete outdoor tables.  Eating out of Styrofoam containers with plastic forks just bugs me in general. How is it that the whole rest of the world finds a way to wash dishes and serve salsa in  squeeze bottles, but American restaurants are intent on filling up the landfill with disposable plates and little salsa cups and crap?    I ordered the green enchiladas, and  they were way too hot for me. Others complain of bland, but the salsa verde is way hot.  The food was okay, and if you want  a quick cheap dinner, this might be the place.  And if they took a garden hose to the dining area, bought a dishwasher and some plastic plates, and scraped the peeling paint, I might even be charmed into coming back."}
{"text":"Not sure what's up with the one stars on here. But my review will be different, first off, it's connected to a gas station it's not an olive garden. Employees are employees i just go there for the food not to be buddies with them. Never had a problem with them. Food never takes long, no longer then 10 minutes if i go in and sit down. Been coming here since they opened every now and then and i enjoy the food. Something to get to eat after a long night or rough morning. Definitely worth taking the time to go in and check out. They always keep the place clean and ready to go. They also have daily specials. Good luck."}
{"text":"I love this place I was disappointed when I went today and according to the sign it was suppose to be open at 5am and I was there at 6am which the place was closed. Besides the amazing food this place has for breakfast I had to take my business elsewhere.."}
{"text":"We used to frequent here often and had great food and the employee was really nice that works the register. That all changed the other night, new person at register she kept asking for help, but no one would come help her! So our order was completely wrong! Luckily I checked it before we left not one item was right. So finally the employee we usually deal with stops cleaning the salsa bar and comes to help. Well I guess we pissed them off the mini tacos the asada was completely burnt, we went to get salsa and the girl yelled across the whole place that it was closed. This is all 2 hours before closing! We won't be back!!"}
{"text":"This is easily the worst Mexican Food I have ever had.. I mean.. bad.. was so crappy that for 24 hours i kept remembering it.. yeah.. that's right.. Montezuma took his revenge on me.. totally 100% bad food.. avoid it..."}
{"text":"24 hr Mexican love it! Fresh horchata and other fresh juices. Food is freshly made too."}
{"text":"The Carne Asada nachos and burrito is great! Nice employees. We've liked everything we've tried so far! We take all our friends here. Definitely worth the stop!"}
{"text":"I'm always looking for spots to find good food. Wow tons of food great price . Menu has everything"}
{"text":"I read people's complaints about bland food, and I get it.  You ordered a bean burrito.  It's not a big surprise that you think plain refried beans and handmade tortilla are bland, because, well, those are bland foods.  Try ordering their super nachos next time - a take out box filled to the brim with corn chips, Carne Asada Steak (or shredded beef, or chicken, or whatever you want), smothered in cheese, sour cream, guacamole, pico de gallo - and add sauces as you choose. You'll find there's more than enough flavor there. This place is basically a walk up to order, 24-hour mexican food stand, but it also has a drive through, which is nice for hot/lazy/take home days.  It's labeled as cheap, and it is; so you can't go there expecting to get Michelin star service then rail on it on yelp because it sucked.  That's like going to McDonalds and getting pissed off your food and service wasn't at the same level as Gordon Ramsey's Burgr. If you go there knowing it's kind of a hole in the wall, you'll be pleasantly surprised to find the service and food are above par.   I live about a block away from this place, and I love it.  It's open 24 hours, so it's great for that 3 am drunk food binge. They always always always load you up with sauces, pickled carrots/peppers, and pico de gallo, and they're always friendly.  The food is freshly made, and there's no extra charge for guacamole on your tacos.   That's a pretty stellar deal if you ask me.  Hands down, my favorite mexican \"fast\" food place in vegas."}
{"text":"This place is so bad.. the food is so greasy and the meat.. well if you can even call it meat.. the price range is not bad but definitely not worth it.  My friend ordered a asada quesadilla and, oh my god that thing was dropping grease all over it. I order a adobo one and man.. more tendons than actually meat and super saggy and nasty   I'm giving this place a 2 star because the employees were so friendly, but honestly the food is disgusting so if you want real good Mexican food go to tacos el gordo or somewhere else, this place is not worth your hard earned money."}
{"text":"I wasn't sure whether to give this place a 3 or a 4, but went with the 4 because there weren't any negatives strong enough to offset the positives.  I had the chile relleno plate, and the chiles rellenos themselves are worthy of a full 5--the batter was light, the chiles were pasillas (not ortegas), the pico de gallo on top was beautifully fresh.    What brings the food rating down a bit are the salsa roja, which was quite bland, and the beans (I didn't bother--seldom do--to try the rice) which were also bland and garnished with shreds of mild cheddar cheese instead of tangier grated cotija cheese.  The order came with 4 thick, griddle-browned corn tortillas, which could only have been improved had they been hand-formed and made fresh less than an hour ago.  For machine-made tortillas, they were excellent.  For those of you who are extremely hungry and close to broke, you will appreciate the huge portions and low prices.  The atmosphere and decor are nonesistent; there are a few tables outside, pigeons roaming in search of crumbs and the traffic on Tropicana rushing by.  Felipitos is open 24 hours.  Reduce the rating to a 3 based on my most recent meal--a fish taco was truly uninspiring (but adequate--fresh radishes were a nice touch, but couldn't make up for the tough, coarsely breaded fish and bland sauce), and a quesadilla suffered from too much and the wrong (cheddar--should have been a mix of a mild Mexican cheese like Asadero and something dry and sharp like Cotija) cheese.  The only completely right item was the Jamaica aqua fresca--plenty of flavor, but still refreshing."}
{"text":"Tried them on Uber eats and it was absolutely wonderful not only was it a speedy delivery everything was warm and fresh. Amazing flavor and seriously underrated!! My friend also had special instructions for her dish because she likes things seper"}
{"text":"Food was really good , very authentic.  Best Mexican restaurant I've been to since I been in Vegas . Will recommend and will be back soon"}
{"text":"I didn't order a side of attitude  I ordered food off of grub hub and paid 37 dollars for a wet burrito , taco salad and taquitos with a side of Pico. Order came fairly quickly no issues there. We waited a good 5 minutes to finish up with customers before we started to try to eat. Opened up all the bags and low and behold no utensils and no Pico that I paid 1.50 extra for. We made a unanimous decision to buy cutlery at Albertsons because it was quicker than asking them to bring us forks . I called the restaurant to tell them what happened a young lady answered mumbling every word that came out of her mouth.  I told her I ordered off of grub hub and didn't receive forks or Pico. She then tried to argue with me regarding the instructions on my receipt. I guess they were clearly understood . Might I add that you have to list your phone number on this app in case there are any issues or questions regarding your order. After I explained to her she was yelling at the guys in the background in Spanish then told me \" it's not my fault I just got here\". I requested to speak to a manager she said he's not here. I then waited until Monday to call because he was gone until then  ( this incident happened on a Saturday) . I called Monday same lady answered same mumbling occurred she stated again \" he isn't here , who's this \" as if it was her cell phone I called . I then called again Wednesday and young lady mumbling again said \" he left early , what's this about \" . I made multiple attempts to call the manager . I contacted grub hub to let them know about the incident.  I'm not made about the price even though it was high . I'm not mad about the food even though it was mediocre.  I am mad about the lack of customer service I received . Although I'm sure besides the issues I had with this young lady I'm sure she is a hard worker. She is obviously trusted to handle money from the till. She is also trusted to take orders and phone calls. She needs to be trained If someone is going to represent a buisiness properly . She needs to be trained on how to handle customer complaints. And if it is out of her job description she needs to be trained on how to take a message and how to relay one to the manager so that then can handle the issue properly . The first thing she needs to be trained on is answering a phone ."}
{"text":"I ordered a shrimp burrito, Santana burrito and queso from Uber eats. When the food got here there was a shrimp burrito, carne asada burrito and a quesadilla. I called to tell them my order was wrong and maybe they switched up some orders and the guy on the phone argued with me that my order was correct. He said the Santana burrito had carne asada and everything else( mind you I got this burrito because their was no meat in the description) and then also told me that queso is the same thing as a quesadilla... really bad customer service but the shrimp burrito was good."}
{"text":"Despite being taped to the 7-11 next door, border between the two easily blurred and at first sight can make one cringe, it's pretty solid.  Staff was friendly enough at 7 in the morning.  TV on full blast in competition with Spanish radio station was interesting-- suppose it gets people in and out.  Salsa bar was shot to hell and in need of makeover--scared to touch it.  Mixed breakfast burrito was tasty."}
{"text":"My favorite Tacos place. Sure, I visit here so often, sometime everyday lol.  I agree taste is not always the same, varie time by time, day by day, but still My Toco place.  Reasonable price and good portion of food, drive-through available, and 24/7 YAY!   I love the Carnitas Tacos although sometime not as great as tasty one.  I appreciate the  Tuesday special Tacos though sometime too much (sesami?) oil on it. I also like their breakfast burrito, bacon & potato burrito too. Considering Taste, Price, Location and Time, to me, this is my favorite Tacos place.  Just FYI, I am a sober when eating the Tacos."}
{"text":"Went here for the first time today and loved it! The food was delicious and they had great prices. It was much better than any other fast food Mexican place that I've been to. It's not very nice looking or in the best area, but I will definitely be coming here again!"}
{"text":"No receipt, wrong change, and the food was awful. I found tendons, tons of fat and all dark meat with brown fatty tissues in my chicken burrito. Seriously, I hope I throw it up but I can't bare to taste it again."}
{"text":"Above average taco spot for Las Vegas. Still would not make it where I come from in Central Washington State. Wish they stayed open later. Need to have hotter salsa or sauce. There avacado salsa is good but must sit for awhile as the puke yellow color is not pleasant to look at while you are eating. Staff is friendly."}
{"text":"Felipito's on Decatur?! I wonder if it's the same as the one on Tropicana?  Naaaaaaahhh! Not even close, they should really change the name.  I ordered a grilled chicken burrito from here expecting chicken, lettuce, sour cream, and cheese.  Instead, I got rice, cheese, and like 2 table spoons of chicken that tasted old and had plenty of ligaments I had to spit out.  Good thing a ordered one of their mini Carne asada tacos which came with beans and chips on the side.  The inside is dirty and the tables were filthy.  The workers seemed like they didn't wanna be there and had a face on them like someone just stole their sombrero.  I might give this place another try, but only if I'm in the area.  Definitely wouldn't go out my way to eat here.  The Tropicana location is better in every way."}
{"text":"I just ordered a chimichanga from felipitos.  AMAZING!  I would gladly pay $10.00 for it, but the price was $5.63.  It was humongous!  Chicken in every bite.  If you want authentic Mexican that's inexpensive, Felipitos is the answer.  Update: I've been coming to this glorious 24 hour establishment since the summer of 2005, and Felipito's never fails me, unless it's the sorry location on decatur.  I seem to be addicted to their Carne asada burritos. 95% of the burrito is Carne Asada meat!! The other 5% is the guac, pico de gallo, and of course the tortilla.  It's all outdoors, so you better bring a jacket if you wanna eat there during the winter.   Another highlight to me, is their Chicken Burrito, not the grilled one, just straight 'chicken burrito'. 96% chicken, 4% cheese and tortilla.  The chicken is always piping hot with the cheese melting. Mmm it's actually a chicken quesadilla in a burrito but with less cheese, and way more chicken.    Anytime I'm on the eastside of LV, I gotta make a trip to Felipitos.  I'll go out of my way for it too."}
{"text":"Again, a place that doesnt look like much from the outside but I assure you, this place is the bees knees!!  Their breakfast burritos are the best I have ever had!  I am a huge fan and go here a couple times a month.  Great rolled tacos and enchiladas as well.  Their green salsa is to die for.  Go here and get a breakfast burrito, you wont be disappointed!!"}
{"text":"UPDATE:  Unfortunately I must remove a couple of stars after last night's dinner from Felipito's on Trop. I ordered the Chicken quesadilla again, and although it was still big and chock full of cheese and chicken ... it was surprisingly bland.  Same for the chili relleno chimichanga, which was undercooked and lacking flavor.  Overall, a disappointing dining experience. I will give them another chance some day, but I am in no hurry to return at this point.  UPDATE:  Returned to Felipito's for their carnitas plate and was quite impressed with the quality, although I did find some chunks of fat here and there. Regardless, it lived up to the hype. Felipito's remains my favorite for fast & awesome Mexican food in Las Vegas. ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  Best chicken quesadilla I have ever had.  Big. Cheesey. Chickeny.  Mighty fine Mexican grub. Can't wait to go back and try their famous carnitas!"}
{"text":"This tiny scary building is hiding something, kick a** food! Greasy, fast, cheap and flavor to spare. You got to love it. My personal fav. is the Super Nachos!"}
{"text":"i love this place..... half the time...   I need to find out the hours the good passionate cook works...  this place is literally the best and absolute WORST mexican food in Vegas.  It just depends on when you go. There is a cook there you can tell actually cares about making good food.. and when hes working the food comes out absolutely amazing!!!! 5 stars!!!  But then, half the time I order, i can barely eat it.... its sad... you can tell the cook just slopped shit together and gave ZERO shits if the food was good...  No passion nor care for service... im trying to figure out this cooks schedule. because the other ones are ruining the restaurant. They have all the ingredients they need back there to make good food... its a shame more than half your cooks dont have the passion, nor the care! to make good food.... seriously its night and day.... its either amazing, or non edible...  Owner needs to crack down or hire a manager who isn't hiring garbage friends.  I bet every bad review is coming from those shitty cooks too... the good one is a gem and i bet every good review is from when he was working. smh..."}
{"text":"24hrs with drive through and plenty items on the menu! my boyfriend and I were craving a midnight snack and wanted tacos so we decided to try Felipito's since it was nearby and their tacos are pretty large. We've had better tacos, but for the amount given and the availability late night, it was yum!"}
{"text":"Another Mexican Joint serving the usual affair.. Came here for lunch a few times and realized that there was something unusual about this place in regards to their direct competition such as: Roberto's, Fausto's, Alberto's, Amigos....   What makes this place different? Their Carne Asada! It may look like everybody elses but I think their seasoning/marinade has much more flavor and really gets the time for it to penetrate properly. I've tried the Burrito, Tacos and Plate (included rice and beans). All were equally Great!  * I usually add 'green sauce' (from the condiment bar), their version here is even better (not watered down and again much tastier) Also, a little squeeze of lime over the meat, wasn't a bad idea at all!   On the Go and gotta Mexifood Crave? This place should handle it!"}
{"text":"My husband and I got really sick (vomiting/diarrhea)  eating here for the first time, we got a bad bug and I've been sick for 3 days. My husband got a lio better yesterday, besides the fact they got his order wrong and if the order was right maybe he would've gotten sick too. We just moved to this area and we live 2 min from this place. Too bad. Be careful with what u eat cause we can just think that the meat was spoiled ir they are not hygienic enough cause this bug is no game."}
{"text":"Carne asada nachos and fries! That's the main reason to come here. They have a fairly extensive menu with lots of options. And they have cheap tacos too. The portions are huge - definitely enough to share. It's quick, it's tasty, and the prices are reasonable. This particular location is a total dive. It's adjoined to a 7-11. And it's pretty sketch. But don't let that stop you."}
{"text":"My husband and i loooove this place!!! My husband gets off work at 11:15pm and there's few times amonth that i get too tired to prepare dinner for him. we are so happy to have this place open late and its near us!. The staff are super friendly,  i feel like when they see us they know what we already want lol but theres times i wanna try other food on their menu. Carne asada fries or nacho is amazin and rolled tacos. This places beats robertos or fastos."}
{"text":"Felipito's is as good as it gets when it comes to 24/7 Mexican food. Try the Super Nachos!"}
{"text":"There is one reason I come here - the carne asada nachos. OMG. They are gigantic and smothered with so much yumminess. The amount you get for the price is practically a steal. When I get a craving for greasy Mexican, this is the place that hits the spot. And they totally let you load up on their different salsas, lime slices, etc. And when you dump all of that on top of the nachos... It's practically heavenly."}
{"text":"Damn good place.  Nothing too bad to say here but lets get the bad out of the way.  The place is usually messy not dirty as in good luck finding a clean table to eat.  Its like the stripper pole at Hustler.  Gawd dawm their refried beans are tasty as eff.  Aint no spackle here.  Rice aiight.  When I wife up Mariah Carey though and she starts acting a diva Im gonna toss that one salsa, a creamy blend of sour cream, avocado, and lime juice, in her mouf to diffuse the situation.    Order the fajitas. Amazin"}
{"text":"I was skeptical at first since this place is attached to a gas station but as life as taught me....... The hole in the wall places are the best. One of the best breakfast burritos I've ever had."}
{"text":"This place sucks. Their rolled taco is mostly tortilla with some trace amounts of beef. How freaking cheap do you have to be to not fry up fresh and meaty taquitos? Seriously, if your only two options are Felipito or Del, then just starve because it will be more satisfying.   I'm going to use the rest of this space to pitch a lucrative Mexican restaurant proposal to some local entrepreneur. The fact that Cafe Rio is the best choice for Mexican around UNLV is pathetic and you CAN compete with Taco Bell on campus. There are many CA, TX, and other ex-pats here that don't recognize Taco Bell as food. Get a lease at one of the many strip mall vacancies around campus that can support a kitchen. Keep it simple, just offer big tacos, filled with fresh shredded beef, chicken, pork, and maybe adobada. Price it under two dollars, don't worry about the small margins, you'll make it up in volume. The only other things you should offer are burritos, again, simple, tortilla, meat, cheese, lettuce, rice, and beans. They should be under five dollars. One other thing, make fresh guacomole and chips. Price those nearly to cost of inputs, you will be pricing them similar to the canned guac that felipito offers so you will end up drawing anybody who would have gone here and making money off the inevitable tacos or burritos they order. Only offer specialty Mexican drinks like orange bang, agua frescas, or sugar cane cola. Don't fall into the delusion of selling syrup and water for high margins, you want keep up image that you only offer the best and tastiest.   You put this together, you will make money. Thousands of college students will be at your door."}
{"text":"They currently have a C rating from the Health Department. Had I known this, I wouldn't have eaten lunch here today. The cashier was super rude to my boyfriend. We placed our order, and then she ran my credit card and immediately answered the phone while still in the middle of our transaction. My boyfriend asked her for the receipt and she practically screamed at him that she can't do two things at once! Excuse me lady, we were here first. No one told you to answer the phone and take that persons order, which is extremely rude considering there are paying customers in front of you and in line behind me. When she finally got off the phone she explained that the connection failed so my card had not been charged. Well if she wouldn't have gotten on the phone we would have known this. Anyway the food was horrible. The meat is ALL FAT, and has no flavor. Check out my pics. I will never come back here because of the rude service and terrible food. Stay away."}
{"text":"Hands down my favorite gas station Mexican food restaurant . 1000x better than Robertos and 1000x fresher too. Great prices and amazing quality of food .    2 burrito combo with rice and beans - $7.95 ( drink not included )"}
{"text":"The food is bomb.  Worth every penny! Fresh and authentic. I got the Santana burrito. I figured you can't go wrong with that. Boy was I pleasantly surprised."}
{"text":"This place is great and so convenient having a drive thru and being attached to a 7/11, however the area seems sketchy with marginal type personalities walking around, so good news to you Cautious Cats...it also has a delivery option...talk about convenience!  Time was around 1 Am and I was the only customer early Thursday morning.  So for the food: Combo No#5. Hard Shell shredded Beef Taco, the Taco was tasty filled with tender flavorful beef. Completely acceptable.  Cheese Enchilada stuffed with Cheese and sprinkled with cheese, a decent sauce and shredded lettuce. Completely acceptable.  The Spanish Rice was good, it had a nice flavor and was properly cooked.  The Refried Beans also impressive with great flavor.  They have a variety of fresh hot sauces and Hot Carrots, sadly the Red sauce had a strong tap water taste and the Red is usually my Favorite type. The other Sauces we're just fine with a spicy zip.  The Breakfast Burrito is huge! I placed it side by side with a Mixed Burrito to show the comparison.  So far a big thumbs up Cheers..."}
{"text":"Breakfast burrito was OK. Had onions in it, which is not typical. Wasn't a fan. Generous on the ham and eggs, so much so i would have preferred a little more potatoes.  Red salsa they provided had an extra kick and was delicious."}
{"text":"I never went here in the wee hours, but always expect 2 AM food to not represent the restaurant as well. 12 noon food here is a great deal though and worth four stars. Nice big shredded chicken and beef burritos for 4 bucks. Also a rotating daily special of more cheese-based stuff for around 2 bucks."}
{"text":"I have always pass this place on way home from the gym. I figure why not give it try plus another review on my way too one hundred. The menu is pretty extensive for such small place between the plates, mini tacos, and just lot lot more. They even have two separate menus one that has pictures of most of the plate items (all numbered make it easier), the pics nice size so you can easily see them, and get good idea what you would be getting if order it. The regular menu kind of all over the place so if undecided kind of makes decision harder.   I love my lengua comes too my tacos. So I had too get couple orders of the mini tacos lengua style. I order something off the regular menu burrito and enchilada plate. The lengua thought was ok. They were generous with the amount of protein always good thing in life! It comes with refried beans and chips. The refried beans for me just plain and not very good. It was little more chunkier then normal spots go too when get my taco fix. Just felt like no real flavor too them. The lengua tacos were good but nothing special. The combination plate the enchilada was just that nothing special and the sauce could have had more flavor. Burrito it was OK. Nothing skimpy about it. It packed with shredded meat with some onions and green bell peppers. The meat was moist and overall ok nothing that wowed me. Really the general theme through out my whole meal felt was OKKKK. The price you pay is very reasonable and portion size get your money worth. If in the mood for more authentic mexican food not the place would stop by. If want something quick, easy, and bang for your buck Felipito Mexican is great choice.  Comes too personality nothing better then going too gas station for some mexican food! It located next too the mini mart in the gas station. Ok might not be that original considering they're McDonalds or different mexican restaurants at other gas stations. If nothing for pure entertainment interesting see the people that walk in and out of mini markets?"}
{"text":"Had the burrito with Guac. It's great for the price they got a little stingy with the toppings though. Great place to get your stomach filled with massive burritos"}
{"text":"My husband and I stopped here when we were across town and got hungry.  The food was really tasty and the workers were pretty nice.  I tried pupasas for the first time and I'm a fan. We'd hit it up again if we're in the area"}
{"text":"I tried the carne asada plate, per Russ V.'s suggestion, and it was really good!  Keep in mind, it's a ton of food.  But so yummy!  And a reasonable price for $7.  Why didn't someone tell me about this place when I went to UNLV?  They only offer outdoor seating and it was a little cold outside so I had to take it to go.  Also, not necessarily the safest location in the world.  I wouldn't go there in the middle of the night by myself.  But I highly recommend it for a quick yet tasty lunch or late night cravings with a group."}
{"text":"Lets begin with this fact;  I'm utterly obsessed with flautas. It happened once I was pregnant with my daughter leilah. She's 10 months & I'm still craving them. Good for the taste buds, not so much for my fat ass.   Didn't know about this place until my father in law brought it home yesterday. He also brought their homemade salsa (Its a yellow green color with a little red tint) It literally is the best salsa I've ever had. I ate about 4 containers. It is spicy yet refreshing. Yu know its good salsa when you can eat a shit ton and not get heart burn. Felipito's FTW! He brought me their flautas, which come with guac, sour cream and a ton of cheese. Which i love. I don't go to robertos anymore because they put literally a pinch of cheese. Here, your food is worth every time.   My father in law told me that they are very reasonable, especially for the amount of food they had. My inlaws were able to share a chile relleno combo. They got the horchata and loved it.   Can't wait to come back and try some of their other items.   3.5 stars, so I rounded up."}
{"text":"Found this place my last day in Vegas. Why didn't I find it earlier?!? It's a drive-thru open 24 hours! They serve huge portions at cheap prices.  Had a bean, cheese, rice, etc. burrito, and it was awesome!!!  Half was enough for 1 meal so I saved the other half for later.   I give it 5-stars for being tasty, big and cheap.  It's 20 times better than Taco Bell.  If you're looking for fancy Mexican food, this isn't the place to go. But if you're looking for delicious, fast, cheap food -- go here!"}
{"text":"I have never been to this restaurant, but product vendors will seldom come into our office, bring goodies and treats to the Interior Designers!   This particular fabric vendor pays a visit in the mornings with a bag of Felipito's breakfast burritos and it is very good! It is not oily, has amazing taste and portion is huge! I can only eat half which fills me up pass lunch time!  I am a fan of their breakfast burritos!! Keep em coming Mr. Fabric Vendor!"}
{"text":"I don't know why people work in hospitality when they have zero interest in actually having any idea what that means. Picked up a friend today who already ordered. Walked in & he said he wasn't eating the quesadilla he ordered. I open the container & it looked like it was dipped in vegetable oil and thrown in the box. I took it to the counter to ask if they would toss it on the grill and cook it so it wasn't oiled down & limp. Like a bad male stripper. After saying \"Excuse Me\" about 4 times, a young girl comes to the counter while talking on her cell phone. I started to ask her and she walked away towards the register continuing her phone conversation while I'm in mid sentence. So I spoke louder, she stepped back to the opposite side of the register (cell phone on her ear still ) and starts telling me \"He can't have his money back b/c he started eating it already \". I respond with \" That's not what I was trying to ask her for, and would she eat it ?\" As I held each piece up. (One bite taken from entire item). She reluctantly agreed as a tall middle aged gentlemen came forward to take it to the grill. Using his bare hands- he put it on to crisp the quesadilla, wiping away the surrounding oil. It was exactly what I wanted minus the bare hands. But he was very polite so whatever... I overhear her say in Spanish that it's greasy due to the cheese. So I corrected her stating I understand what she said & no, it was dripping oil all over the tortillas outside. Whatever again, not going to argue with a 16 year old little girl who has zero sense. I brought the oil saturated napkins back, set them on a dirty tray to show her.  She literally looks at me & says- \"Um, you can throw this away \" (the tray with a bunch of trash that was on the counter, clearly not mine). I said \" Excuse Me???? I'm not throwing that away regardless where it came from. Are you kidding??\" She says - \"Don't worry, I'll just do it this time \" I honestly was stunned to hear her say Don't worry, I told her I wasn't worried about it all. And had to laugh. The polite gentleman brought me my friends quesadilla, I thanked him for his help & it took everything I had not to pull that little girl over the counter & stomp on her smart ass mouth.  We left. I WILL NEVER EVER return to this place. It was the first time & definitely the LAST. There was another table there but they weren't busy. A pick up order came in and he had to lean over the counter after saying Excuse me about 10 Times! He looked at me & said \" are they really here???\". (His food was also not correct I observed as we walked out).  From now on, I'll strictly stay with my reliable Roberto's. They have always been amazing and polite to us.  It's just really terrible how bad the service here was. Except for the tall Spanish gentlemen (possibly the delivery guy?)  Best of luck to them...And retrain that disrespectful girl who needs to seek another field of employment. Dealing with the public is not her gig."}
{"text":"THE BEST Mexican food ever. I can't tell you how happy I am that this place is so close to me. Everything is always so fresh  - I've never been disappointed in the quality of the food here. I even enjoy the menudo here more than the one at Pepe's but the only downside to that is they only serve it on weekends and they're usually sold out :( I guess they only make a batch a day? I don't know. I just take it with a grain of salt and pray to the menudo gods that I'm lucky enough to have another bowl.  The worst experience I had was in the drive-thru. A woman with bright red hair forgot a COUPLE of times that we were outside waiting for our food. One time we waited 20 minutes. It was stupid, especially because we were the only ones in the drive-thru. Anyway, that's not enough to stop us LOL. My suggestion is go inside and get your food. And stock up at the salsa bar! They always have the freshest onions, cilantro, etc."}
{"text":"Service needs training not a thankful bunch  food was ok kinda rude place I wouldn't do it again."}
{"text":"Oh, Felipito's how you've come to my rescue time and again!  Do NOT eat here if you don't appreciate a good measure of grease with your Mexican food or if you're squeamish about ordering out of a food hut.  But, let me tell you, that will be your fault because no one has Felipito's beat for Mexican fast food.  Not even that other place.  You all know the one.  First of all, the 24 hour drive thru is an absolute godsend.  3 AM burrito cravings are strong, unignorable, annoying things and Felipito's will satisfy that quickly.  Everything here is freakin' yumtastic, and they even give you enough salsas to keep even the biggest sauce fiend happy.  Once, my friend Pouncy and I shared such a delightfully greasy quesadilla that we had to actually wring it out and thereby invented the Felipito's Wringing Out the Quesadilla dance, a gyration that's remained popular for over three years now.  Any place that incites such a lasting movement surely is worthy of a visit."}
{"text":"Mediocre mexican fast food. Carne asada fries were too salty to even eat. Go somewhere else."}
{"text":"This is one of the worst place to eat not clean and I seen workers handling cash and then go handle food with no gloves.. didn't bother to even hide it. I Oder a carner Asada burrito on the drive thru I got my order as I start to drive away I start to eat the burrito. The meat was so cold that it was hard and no Flavor I called to let them know about the issue the lady in the cashier that always looks like everything bothers her or like if we are disturbing her time, got really defensive about it saying that it my fault that burritos was cold because when u Oder food to go it's gets cold.. I just want to say that if u want food go to del taco or Taco Bell worst place in town.."}
{"text":"I am hooked on their chicken salad - I get without the chips.  It has lots of avocado and they way they do their chicken, the marination process, along with their hot sauce, makes this a good lunch salad for a reasonable price - less than $5.  The lady always remembers my order - no chips.  I enjoy seeing her friendly smile as I make my way through the drive-thru."}
{"text":"They don't know what carne asada fries are, California does it better. There's hardly any guac or cheese its mostly just a bunch of beans... so cheap."}
{"text":"Food at the gas station...need I say more.  Decor is nothing special, but the food is what matters. Great portions for a good price. Will definitely come back when I need a quick fix."}
{"text":"Hell yeah. So when I walked in I saw a huge menu. It's not as organized so you have to really look for what you want. Carne fries are only 7.95, 2 extra dollars for extra pico and extra sour cream (how I like it)! And for 3 rolled tacos it's only $3.25! Every other Mexican place I've tried totaled to about $21 for all that but here it was 16.05 including the drink!   So on top of loving the prices, the fries were pretty big and everything was really good and really filling. Better than most places. There rolled tacos were a little too saltless but nothing I can't fix myself. I defiantly recommend this place."}
{"text":"Great authentic Mexican food outside the strip. It's about 15 min from Excalibur so the distance wasn't bad at all. Priced very well, servings are very large. The beans and carne asada was my favorite thing about this place, also the Jamaica was fantastic! Very clean environment, much like the classic taco restaurant at the corner of the street. Dont look for ambiance here, it's about the food..really. Well done!"}
{"text":"awesome find and awesome authentic food.  the breakfast burrito was unreal...tasty not oily. authentic!"}
{"text":"Was so excited to finally have a taco shop near my house and now it's getting to be a great spot!!! Food is consistently good and the customer service has improved leaps and bounds over the last four months. The Santana burrito has become my favorite thing on their menu."}
{"text":"I've been getting to go food from here for years it's on my way home from work! I have never had a bad order and I like the salsa's too! It's a must have for my family who visit from CA, they love this place and never leave with out stopping at least once while here. The chorizo burritos are excellent too large enough to feed two! I will continue to stop in for some scrumptious take out food. YUMMY"}
{"text":"Happened to find this place on Yelp on my way back from the Outlets. Got the arroz con pollo.. satisfied my taste & was very well seasoned. I wish I had tried the rolled taco also.. looked good. They have a salsa/fresh lime bar also.. don't forget to grab some."}
{"text":"Best place to grab a quick bite on the go. Food tastes amazing the portions are huge! A+++"}
{"text":"This place is not authentic Mexican food to start off with. I ordered a Santana Burrito. There was no beans, rice, or guacamole in my burrito even though it was suppose to be included. The cheese was colder than a block of ice and the meat was as hard as biting it off a cow. The burrito was tasteless and had no flavor. After a few bites I just threw it away. If you want a better tasting burrito and faster service just go to Taco Bell."}
{"text":"So far this place kicks Roberto's a$$. Less grease, more flavor, good breakfast options. Keep it up."}
{"text":"Omg Felipito's is my favorite mexican food spot in Vegas. I've been coming here ever since I moved here about six years ago. Who would've thought a little shack like spot would be so good. First thing that caught my eye was the sign, I thought it said Filipino's hahah. Anyways the food here is sooo good, I usually get the carne asada fries and a fish burrito.  They also carry a wide variety of choices. Definitely a great spot to hit up, located near the corner of Tropicana and Maryland. Great place to get more bang for your buck."}
{"text":"Total drunk food, haha! They have cheap, huge portions available 24 hours, which is awesome, and I urge the drunkies to go. Unfortunately, if you haven't been knocking a few back, this is not a place I would recommend. (Make that quite a few!) From the meat, cheese, beans, rice, and sauces,  everything was just so bland! It was actually shocking how flavorless tgd food was."}
{"text":"I trusted the reviews, and I was very disappointed. If Felipito's is the best Mexican food joint in Vegas, then you're better off making your food at home.  The only thing this place has going for is giving you large amounts of food. However, that doesn't matter if there is no flavor to back it up. Felipitos specializes in BLAND.  I have tried (too grossed out to continue eating) the carne asada burrito and beef taco.  The carne asada burrito was horrible. The beef had that exact consistency and chewiness of boiled beef. The flavors were undeveloped and it was grey, not brown! The only thing I tasted were the huge chunks of onions, that was it. The meat didn't even have any hint of salt either or any other seasoning. It was completely flavorless apart from the onions.  The beef taco looked SO GOOD! It looked crunchy, it was very plump, overflowing with melted mild cheddar. Very appetizing. Then I took a bite. WTF! Like biting into a rock! The shredded beef was perfectly cooked. It was tender and brown, but had NO flavor. NOTHING. Major disappointment. Also, their taco shell might be a big health hazard for children. It can cut your mouth. I was expecting a gentle crunch like a chip, but it was like biting into those Kettle brand thick potato chips, but about 3x thicker and 5x \"crunchier.\"  That's not all too, they also managed to take bland to another level. The sauces the food comes with: It's just spicy water. I don't know how it's possible to ruin sauces. You got spicy green water and red water that looks like hot sauce but it's not. It's just red water. Totally not the best place for Mexican food in Vegas."}
{"text":"Got the Breakfast Buritto w/Chorizo...the thing was huge...lots of cheese and potatoes....well worth the money...in and out quickly....big menue w/specials...."}
{"text":"Great food! Cool staff. AWESOME specials. I go here all the time! I went he first time cause it is close to my job, but I keep coming back for the food and the people!"}
{"text":"Great food! Cool staff. AWESOME specials. I go here all the time! I went he first time cause it is close to my job, but I keep coming back for the food and the people!"}
{"text":"This place has all the requirements necessary to be your typical drunken food stop. Open 24 hours, 2 drive thrus in which one isn't even used, located in a sketchy area of town, a less than stellar facade, lighted outdoor seating, and a walk-up window. Come to think of it, this reminds of quite a few taquerias in SoCal.   It's a bit of a drive off the strip. If you're picking up or dropping off someone at the airport, this place is not that far down Tropicana. If you're coming from the eastern part of town and you're on the way to the Strip while craving Mexican food, you may see this and consider stopping.   I ordered myself a carne asada burrito at midnight, and it was only 4 bucks. Sounds about right. Then, as I was eating it at home, I realized why it was only 4 doll hairs. For one, it did not include rice, beans, and sour cream, which I enjoy in all my burritos. I should have added that on. Damn. The burrito was basically a load of carne asada, onions, cilantro, and guacamole. At least every bite of had chunks of carne asada, but then again the meat was a little chewy and not as tender. The guacamole didn't taste as fresh, and they added a little too much onion. Best be sure your breath will stank after eating this. The tortilla seemed like it was microwaved instead of steamed. The edges were still dry and hard (potential that's what she said?).   Honestly, its a less than stellar burrito. If I try this while buzzed or drunk, I might say otherwise. I'll give Felipito's props for being open 24 hours and serving carne asada fries. Why I didn't try it instead is beyond me."}
{"text":"Wow felipitos, I can't believe I'm giving you  2 stars after all we've been through . Seriously , you were one of my favorite places until you tried ripping us off .   First you make the all day special (5 taquitos with quac, sour cream, cheese, lettuce) 25 cents more expensive AND you give 50 percent LESS meat in it ? I feel like the taquito was vegetarian. Sorry but I like meat in my taquitos.   And you think we didn't notice ? I see you .  I no longer crave your food anymore and I'm ready to try out the taquitos at Roberto's now.   I will always remember how I loved the uniqueness of your little shack and the friendliness of your staff , however I get hungry and Id rather go to a place that gives me a decent amount of meat .   Ta-ta until your taquitos come back .....  :)"}
{"text":"Garbage, total crap, with absolutely no taste, If you like bland hospital tasting food go here. no seasonings used, taco was so greasey it turned to rubber, couldnt bite nor chew, the taco shell had been rendered like beef jerkey literally. Very stingy with the meat, heavy on the cheap lettuce though. Stay away.  I think some people from California must have started complaining because its all tasteless.   Polite help though"}
{"text":"If you're drunk and looking for a cheap late night booze soaker, this is the place! In my last Felipito's quest I order a cheese quesadilla and a carne asada burrito. The quesadilla was everything it should have been, crazy huge, greasy and satisfying. Now the carne asada burrito, well, the first bite was good until you realize the meat is laden with gristle, connective tissue and well to make a short story even shorter, after 2 bites I threw it out.   Props for speedy service and the hot gooey cheese quesadilla!"}
{"text":"Kool spot by the crib open 24 hours got the. Carna asada fries and grilled chicken tacos tacos was ight but the fries was bomb big enough for 2 just sayen"}
{"text":"Go. Here. Delicious breakfast burritos. And they are HUGE! Two people should split one. We also got chips and guacamole. I was skeptical at first sight, the chips had grated melted cheese and then guacamole spread over them and the guac was more of the creamy variety with no veggies. But they were also really tasty. The chips themselves were great. And pretty cheap - two huge burritos, chips and guac, two medium sodas all for $17 (before tip)!"}
{"text":"My go to mexican spot! Cheap and delicious. It's a no frills, quicky meal! Price, locations, and offerings are about the same as roberto's but this is definitely a step up above the regular fast mexican resturant. Chicken burrito is bomb"}
{"text":"Food is ok, very poor customer service. One time we came and we were waiting, cashier took breaks and left front unattended with no one taking orders at around 6:30 pm. Staff definitely has to go. Won't go there again."}
{"text":"Had there taco tuesdays t beef tacos . Had to be the worst I have ever eaten.  I'm from L.A. I know a good taco,  these were horrible."}
{"text":"Never going again. I had been a frequent and loyal customer for six years . They recently hired a new cashier who is rude, argumentative, and will over charge. I don't spend money at a place which treats me rudely.  P.S   There is a Robertos Taco only a block away , so from now on I will go to Robertos"}
{"text":"This food is delicious and filling. The prices are amazing for Vegas. And the girl behind the counter is super cool!   I ate here pretty much every day I was in Vegas. The bean burrito is cheap and huge! The chile relleno is delicious. And you can wash it all down with a big cup of horchata - the most delicious thing from Mexico since Salma Hayek!"}
{"text":"Tired of the grub in the casino's , this breakfast burrito hit the spot!"}
{"text":"Everyday they have a special with a special price. The enchiladas are great! So many different items to choose from and I'll be coming back! If I don't return to a place it's because I wasn't impressed but if I keep returning it's a big YUMMY!"}
{"text":"Authentic, fresh, flavorful, tasty & economical. This is why I love YELP, this place is awesome and it is on my list next time we come back to Las Vegas. Do not be fooled by the location, this restaurant rocks! I had the 3 mini tacos with refried beans & rice, it was delicious. They have a small salsa counter with fresh sliced jalapeños & onions. We walked from The Orleans Hotel and we WILL back, thank you for the wonderful meal."}
{"text":"Super impressed with the flavor and yumminess of the plate I ordered. Shredded beef tacos with rice and beans. Loved the green salsa at the salsa bar. I am a super duper fan of Mexican places that have salsa bars. In the age where so many restaurants are cutting costa, it is nice to see the abity to get your own salsa without having to ask someone at the counter for more.  I ordered through eat24 and the order was done lickety split. The lady at the counter was very cordial. As the other reviews state the restaurant is very clean. Enjoyed the Hindu artwork on the walls. it definitely added a unique touch. I will definitely be back!"}
{"text":"Cold uncooked cheese enchiladas. Literally cold tortillas filled with cold shredded cheese and lukewarm extremely salty sauce on top. SO Gross. Not exactly cheap either. Brought them back to the window and asked to have it microwaved, was told they \"don't have a microwave\".. what?! The solution apparently was to drown my \"enchiladas\" in more awful lukewarm sauce. Which obviously did not help. Judging by the other reviews, this isn't an isolated incident. Screw this place. I wish we had gone to roberto's."}
{"text":"Great fast tasty Mexican food...the shrimp fajitas flour tortillas and green sauce hits the spot. Have been in town 4 days had this 3 times already. Service is fast and consistent. Will be back next time in Vegas."}
{"text":"If its 4am and you're hungry from the nights activities this is the place to go!  I usually have the chille relleno burrito but my friends go after this thing on their menu \"adobada\".  Right after they order it, you hear them say that word over and over again."}
{"text":"A little greasy but otherwise very good. Nice people and huge portions!"}
{"text":"I've been wanting to try this place for a while now. I know authentic Mexican food and this was a disappointment. 4 different plates. None of us finished our meal n didn't bother to take it to go"}
{"text":"By far the best Mexican food I've had since I last been in California. The only downfall about this place is not staying open for 24 hours. Especially after having a night out of drinking. But overall food quality is great. Strongly recommend."}
{"text":"The drive thru lady that helped me was pleasant at first while I ordered and my kids liked their beans that came with their cheese enchilada meals. Other than that, well let me start from the beginning... I pull up to the drive-thru menu, not turned off at all by it being attached to a gas station because past experiences with Mexican food in other gas stations, backs of grocery stores, and dive taco trucks have left me super happy and a return customer. Location was a-okay with me. I was the only one in the drive-thru line and she either couldn't hear me well or couldn't understand me but asked me to pull to the window.  This took away the menu for me to choose from, but no worries, they can help just fine.  Further into the drive I had to navigate my truck around 2 medium size boxes that made their home in the lane. Was it wind that carried them both in? Just poorly cared for grounds? Hmm.  I pull around and for dinner time it really surprised me that the inside was totally dark, except a low light coming from what I assume was the kitchen area. Not another person in sight, and I began to wonder if I should order.  We were pretty hungry though so I put in my order request. She was kind while I ordered.  My order was relatively basic, just got carne asada chimichanga enchilada style, bean and cheese burrito enchilada style,  2 orders of cheese enchiladas, all with rice and beans and chips and salsa. Asked if they had dessert and they only had churros so we got 4 of them too.  I paid, tipped a few bucks even though it is drive thru and I wasn't being \"served\" so to speak.  Everything came to right under $50. When she handed my card back, that was the last time she spoke. I waited 20 solid minutes from then to get our food.  No other customers pulled in, walked in, or were already inside. 20 minutes, but I was patient none the less, hoping the food would be fresh for a wait like that in a drive thru.  Finally I was given my food.  2 bags, I thanked her with each one handed to me and found myself saying \"have a good night!\" as if she were the customer and I the friendly worker for some reason. Not a word from her, just the windows smacked shut and no lingering at the window. Weird. Whatever, I have my food now.  Finally.  I arrive home with the grub and first thing my husband says is \"No chips and salsa?\" *sigh* Damn it, we just paid for food we didn't get but we are at the hangry stage now, kids are anxious to get their meals, so it is shrugged off as a loss.  More disappointment ensued when we see that their enchiladas were cold enough the cheese was a congealed mess instead of melted and warm. Grr. We live less than 1.5 miles away. Why was it already cold enough to do that? My carne asada chimi was my least favorite I have ever had.  The steak was tiny cubes, loads of onion and no heat to balance it out at all, and the tortilla was soggy in spite of it being deep fried. (P.S I absolutely HATE that word, soggy, so for me to include it in my vocabulary is a shuddering, gag me now trigger, but there is no other substitute in this case to drive this home)  My husband's food was the last straw. The burrito was inedible.  Something was totally off about it. Ever bit into day old lettuce or tomato on a burger? That funky taste that just screams \"don't eat me!\" and you know rihgt away that this is not the meal you were looking for? It was totally evident. This is a bean and cheese burrito folks.  Pretty hard to mess that up if your beans are good.  My kids liked their beans just fine, no off taste there.  What happened to his food is hard to imagine, but it was inedible. Disgusted, he tossed it in the trash and tried a churro. They were jelly filled, which was unexpected but okay enough.  He actually didn't like it either and had a bowl of cereal. My 3 year old ate the rest of that churro with his beans, I gave up on my chimi less than 1/4 of the way through.  $50 for him to eat cereal for dinner pretty well solidified the fact that we will not be returning to Felipito's."}
{"text":"Something must have gone horribly wrong since this place was last reviewed, because when I came here the quality didn't match up to past reviews. I ordered the two beef burrito combo plate and my boyfriend ordered the two carne asada taco combo plate. My burritos were completely tasteless - the meat had been cooked way too long with far too little spices to the point where I couldn't even taste the meat, only the texture persevered! The vegetables in the burritos were blanched and equally over-cooked, but had more flavor than the meat (which isn't saying much). The beans were okay and the rice was meh. I seriously thought there was something wrong with my tastebuds at first, but I could taste the horchata (which was good) fine and my boyfriend couldn't taste anything in my burrito either. On the bright side, his tacos was alright.   If you're out late and drunk to the point where it doesn't matter what you're putting in your mouth, by all means come here. The portions are generous and the prices are decent, if only it had the flavor to match. What a pity."}
{"text":"We stopped here on our way out of town for breakfast. We were surprised to see it was attached to a gas station.  Between the four of us we got a steak torta, chicken sopas, a ham cheese and egg burrito and a chicken taco and enchilada plate. Everything was really good, Expect the chicken in the taco. The chunks of chicken were very fatty and chewy. The sopas were great!! Best I've had. The beans were good and the rice seemed a little old and hard in some spots. And if you want rolled tacos just know they only come in beef. No chicken. That was a major bummer.  Service was good. The guy at the register was very nice and helpful. It was very clean in there too. If you come try the sopas for sure!!"}
{"text":"if u want average food with cheap price then you will like this place.   this place is more like truck pit stop fast food joint. DON'T TAKE YOUR DATE HERE. it will be  your last date."}
{"text":"This place is right down the street from my place. The food here is better than Roberto's which is only a block away as well. They've only gotten my order wrong once, but it was too big of a deal to me. They recently remodeled too and it looks a lot nicer than it used to.   I would definitely recommend them if you're looking for a quick convenient bite to eat"}
{"text":"I never mentioned this but i had gastric bypass surgery 12 years ago and since then i cant order just one thing on any menu i have to order multiple dishes. Its my thing.. I never eat it all but im compulsive and MUST have what i think i want. That being said.... I ordered three things from this restaurant, clearly w the idea that i would give the leftovers to my dieting partner lol... Ahemmn..  Its breakfast time, 7am right now.. So i have here a bacon cheese and potato burrito, a chorizo burrito and huevos rancheros.. Bacon bacon bacon! That first bite was tell all! It told me yassssss bacon lovers! Its all you can taste, thick chewy bacon egg cheese and potato but mostly bacon... Excuse my run on...my partner wont be getting that! Now the chorizo on the other hand.. Im kinda funny where i dont like meat to taste like meat. Soooo to be fair chorizo just may not be my thing. Its too meaty tasting.. I ordered it bc of another yelp review but its not for me.. But it IS big n plenty for u meat mungers! My partner will be getting this one. And for the huevos rancheros...its my first time ever! So i was just looking for it to be breakfasty! It is! It has loads of tomatoes and onions and w a lil salt i added its perfect! The green salsa is SPICY! I love hot stuff but hot w flavor.. This is just HOT... Could use some jujuing.. But all in all the food is delish, service was fast and courteous even though i got the impression my host didnt speak much english. I didnt push BUT what if i had more questions! Anywho thanks for a wonderful breakfast! Now on to my dunkin donuts review! Just sayin!"}
{"text":"WHAT IS THIS PLACE and WHY DID I NOT TRY IT UNTIL NOW. I think this is where Jesus gets his Mexican food when he visits Las Vegas (but it is Sin City, so I'm not sure that's all that often). I don't care that it might one day end up on the Dirty Dining section of the newspaper or the local news. I don't care that it has no nutritional value and that its ingredients are not top notch. This place doesn't look like it makes sense until it makes all the sense in the world inside your mouth.   The menu is not high on description, but it is low on prices. It is not health food, nor could it really be considered nourishment in any sense of the word. I had the cheese roll ups, which, vegetarians be forewarned, have beef inside. (Though if you had an aversion to beef, this place might not be for you anyway.) My friend ordered what I had and a beef taco, and total it was $6 and change. Fine by me! Taco Bell sells chemicals for more expensive prices.   I am salivating for Jesus' favorite Mexican food now. Too bad it is in an awkward part of town for me to get to!"}
{"text":"They have good combo specials and servings are large!! The establishment is small and is clean... Staff is friendly... they generally seem a little understaffed... but not a big issue because anytime I've gone in there it has never been a long wait"}
{"text":"Great taste and great price. Not too shabby for a mexican spot found next to 7/11.  My only complaint is the meat was a little too fatty. Other than that, great prices and great quantity of food and their salsas are pretty bomb."}
{"text":"This place opened up in the old Jack in a Box location attached to 7-11 on the corner of Arroyo Grande and Sunset.  I wasn't sure what to expect, so I walked in to see what they had to offer.  The place was dead.  However, I don't know whether that was a function of the time I came in.  It was SUPER clean.  You could see how much effort had gone into cleaning the equipment and counters.  I ordered the carne asada nachos to take home.  The price was $8 for a container that almost couldn't be closed.  When I got home, my kids turned their noses up to it (too much good stuff).  So, husband and I rolled our eyes and dug in.  I enjoyed it all.  Sometimes, it's hard to make sure that there is enough good stuff throughout the nachos, but these were pretty consistent.    I would like to go back with the kids in tow and let them pick out their own items.  Yum!"}
{"text":"Waited 15 minites in the drive thru for two things. Need more employees. So def management needs to fix it foreal"}
{"text":"The vegetarian breakfast plate was so yummy. This place beats Roberto's with it's wide selection and options. They also have a drive through, which is nice when you have your pet with you. I really enjoyed it."}
{"text":"Always clean, fast, and delicious! I have no complaints and come here all the time.  Better than Robertos, especially the taquitos/rolled tacos.  They also have a salsa Robertos doesn't have.  It's my favorite, a molcajete type salsa."}
{"text":"I ordered the Santana burrito without poco. There was a lot of tortilla, not much inside. The cheese was really cold making my food cold. Very little guacamole. I'd expect more from this place. Also when entering I noticed dirty tables. The customer service was good but they are really slow."}
{"text":"It's an okay place to get some Mexican food.   They usually have a deal on taquitos, where you get 5 taquitos for cheap. My taquitos were hit and miss. One of my taquitos was really hard. I like some crunch but I was afraid I chipped a tooth for a second. Definitely needed the sour cream and guacamole to seep into the taquitos to soften them up.   Carne Asada burrito was meh. The carne asada wasn't flavorful. Needed more limes. Burrito was also super dry. Definitely needed some moisture.   The drive thru is very convenient though. Definitely beats standing awkwardly in a Roberto's at midnight."}
{"text":"Terrible.  She got the order wrong, then blames ME? She is just flat out Rude. Doesnt care to even say anything eles. After she got the next persons order wrong. No education. I am not going to argue in a gas station for bad food. Oh yea...the food: The tacos are careless. Cheap ingredients. Salsa so bland...no diffrence in red or green. The other location is so much more  everything this place is not: friendly, tasty and enjoyable. I will NEVER recommend anyone to eat Mexican food that is attached to a gas station let alone order here again. So upsetting it's an easy fix. I guess they are happy selling BAD food."}
{"text":"I already know it's hard to find good Mexican food. This place was OK, not the best. I had the chili (egg-bean- and fried tortillas) it was tasty but I have had better. The lady was super nice at the registers and their horchata was delicious."}
{"text":"Keep on driving this place has gone way down hill  It's been awhile since I was here and I'll never be back"}
{"text":"Now, let me start by saying that Felipito's only seems to cross my mind after having had a few cold ones, but whenever it does, it seems like the greatest idea anyone has ever had. Felipito's is about as simple as it gets, from the concrete picnic tables to the menu comprised mostly of blown-up pictures and numbers. But make no mistake: Felipito's is a hidden gem. From the carne asada plate to the chile rellenos, your drunk ass will actually take a moment from scarfing down the ridiculously large servings to slur, \"This is realllllllyy gooood!\" Which, despite your lowered inhibitions and altered judgment, is true. They've got fantastic homemade pico de gallo (which I recommend ordering an extra side of), as well as handmade (and freshly fried) flour tortillas. I'm kind of disappointed by the guacamole, which is clearly not made in-house, errr... in-shack, and it's safe to say the carnitas plate will blow your calorie intake goals for an entire week. But after a few cold beers, who cares, right?   Ladies, I would recommend ordering from the drive-thru late at night. Dealing with sketchy characters or drunk dude-bros when you're trying to get your grub on can definitely detract from these greasy delicacies.  P.S. I can personally vouch that the Super Fries will prevent any trace of a hangover. For about six bucks you get a foam container with fries smothered in cheese, guacamole, pico de gallo, sour cream, and steak. There is some kind of genius working in this broken down taco stand, I am quite certain."}
{"text":"Great prices for the amount of food that you get area is a little sketchy but besides that its a great after hours spot to grab a burrito."}
{"text":"I had this the other night, and it was pretty damn good. Its a bonus its 24/7, much like Robertos tacos, but this is a nice change up from it. I had 2 beef enchiladas w/ rice and beans and two beef tacos. ( I can put some food down) def will be going back since its near the airport where I work at."}
{"text":"This place never disappoints. The staff is incredibly friendly, and generous with the portions of authentic Mexican food they serve. Also, the prices are incredibly cheap for how much work they put into their food. Definitely the first place I go to whenever I'm craving ethnic food. Love everything they do to spread the wonders of Mexican food throughout Vegas. Honestly, I do worry about food poisoning from small businesses such as this one, but I have never gotten sick from the dozens of visits I have paid to this place. Just a very happy stomach! To the people who complain about the location and how it isn't fancy or classy enough, just go to a casino and pay $50 for mediocre microwaved tacos. :) Or Taco Bell/Del Taco, and enjoy their poor excuse for \"Mexican\" cuisine."}
{"text":"You can't go wrong with the California burrito. Besides chipotle my favorite Mexican fast food joints"}
{"text":"Every time we come to Vegas, before we depart home, We stop here! Everything we've tried is great! If you can get passed the fact that it's at a gas station and a local spot, then go on in! Food is on point!"}
{"text":"I prefer Felipitos over all other fast food mexican places.. I always order the pollo asada plate after a workout with beans. Always freshly made and now as greasy as Robertos. The staff is always friendly. A regular here."}
{"text":"Don't expect a fine dining experience, but for a good taco with a lot of crunch, I really enjoyed my chicken tacos. Hubby had beef tacos. Salsa and chili Verde have a little heat, but they were good. 4 tacos and a bottle of water was $7.60. Nice late lunch, will hold us over til dinner."}
{"text":"Another eatery that I have been going to since way before the Yelp era, for about 15 years now. Their burrito de deshebrada (shredded beef) is different from your typical burrito; no rice or beans fillers, just tender juicy beef, with slow cooked onions, green pepper and tomatoes. One of the best!"}
{"text":"Their breakfast burrito is OFF THE HOOK, it is enormous, I had to share one with my 16 year old son.  That in itself is a feat because we all know 16 year old boys can eat, but even this burrito filled us both up.  YUM!"}
{"text":"It's pretty much like Roberto's Taco Shop only I believe there's more options. The taste for the cheese enchiladas are alright, not extraordinary."}
{"text":"Fantastic Mexican food. This was for sure the best breakfast burrito in Vegas! Get the guac and green sauce with it!"}
{"text":"\"Daniel, you should try the New Mexico burrito at Felipitos. They are huge,\" my coworker said. \"Where is this Felipitos place?, I asked my friend. If you drive east on Sunset Road past the curve (intersection of Mountain Vista Street) it will be down the hill to the left inside a 7-Eleven.\" \"At Arroyo Grande,? \"I asked.\" I know where it is. It used to be the Jack In the Box attached to the 7-Eleven. I'll check it out soon.\"    Not only did I check it out once. I'd check it out two times with the first time on Sunday, February 5 to try the New Mexico burrito and two days later on Tuesday, February 7 for Taco Tuesday. Based on my New Mexico burrito experience, my coworker's recommendation will snowball from her telling one person to me telling the Yelp universe about this place where you can get mutant burritos that squash many of the competitor's burritos.      The Felipitos restaurant itself could be best described as a hole in the wall. As I started off the review using my conversation with my friend as an introduction, Felipitos is carved inside an out of business Jack In the Box that is connected to 7-Eleven. A carryover from the Jack In the Box days is that there is an active Drive Thru window. Inside the restaurant you order at a counter where a few years ago people ordered Jumbo Jacks. Today people could order a superfluous of Mexican food from menus above the counter, posters of combinations that hang on the walls, and off specials that are posted on the door. There are 25 combination plates available. They range from $6.95 to $9.95. The vast menu also includes seven breakfast plates that cost $7.75. This menu puts Jack In the Box's to shame. There is more including burritos, chimichangas, quesadillas, tacos, enchiladas, and more. However, my bypassed the overwhelming choices with my mind set on following my friend's recommendation of the New Mexico burrito. Surprisingly it is not one of the 20 tacos listed on the menu.      At the counter, I ordered the New Mexico burrito. The lady who worked there took a break from mopping the floor to take my order. After handing over $9 and change for the burrito and regular Pepsi, the man in the kitchen created the mutant burrito. On Taco Tuesday, I would see the same two employees (or owners).      Even my friend's description of the mutant burrito couldn't prepare me for it. It was huge. Like a foot long sub huge. I should of brought a supermarket burrito and photographed the two side by side because there would be no comparison. It was full of the ingredients that make up a New Mexico burrito include salsa verde and rice. From the salsa bar near the 7-Eleven door I added red salsa. The mutant burrito was so humongous that I left some over. My only complaint is that the temperature could of been a little warmer.     On Taco Tuesday I had 3 crunchy tacos at $1 each. 2 included beef and 1chicken. With a fountain Pepsi it came to a little over $5. The tacos were good. I felt they could of used more meet. My impression is that Felipitos excells at burritos and is ordinary at tacos. That makes sense because it was the burrito that brought me to the northwest corner of Sunset and Arroyo Grande.     Felipitos has created a new life for an out of business Jack In The Box with burritos that are fit for a king. After my friend encouraged me to try their burrito and trying it for myself, I encourage you the reader to try the Felipitos burritos. If you live in the west valley, they have a location at 5095 S. Decatur Boulevard."}
{"text":"It was some of the worst food I have had. I had 2 beef enchiladas and the beef was burnt. The best part was the refried beans and the drink. I would not recommend this place to anyone."}
{"text":"Ordered at quick lunch through GRUBHUB.  It was literally on my desk in 15 minutes, quicker than it would have taken me to pick it up.  Food was hot and filling!  Great experience!"}
{"text":"Great place to pick up some late night Mexican food. They never mess up your order and their portions are huge!   I love their beef enchiladas. They're always chalk full of meat and smothered in delicious cheesy goodness. Their Mexican rice and beans are also very good.   Their drive thru is super convenient but sometimes it's easier to call in your order and pick it up. Staff is really nice there too. They don't speak much English but their smiles make up for it."}
{"text":"Being from San Diego ever time I get wasted in Vegas or  meet up with friends that have never had Carne Asada Fries or a California Burrito, I take them here to try it. For some reason I don't eat much in Vegas. I just drink or drink and gamble and I guess I just forget. But for some reason when I leave the club wasted late at night, I some how remember and have to go to Felipito's. No matter at what cost.    Most of the time I take a cab there. One time I made the limo driver go there and pick up some burritos and fries for my friends and I. Another Time I was to drunk and no cabs would pick me up. So I deiced to walk all the way from MGM. Some how I didn't get jumped or arrested and enjoyed my cali burrito."}
{"text":"24 hr magic land.  order the CHINA BURRITO with cheese... heaven. Fast service and it's so damn cheap!!!!!"}
{"text":"Food is ok and plenty of it.  Service on the other hand, not so good.  I changed my mind on what I wanted and the cashier was protesting.  I said thank you like for times and she didn't reply a \"you are welcome\" a \"no problem\"' nothing!  Very rude.  When in Vegas, will never come back here.  I also asked for my kids tacos to be plain and I heard the guy preparing the tacos asking why I wanted my tacos plain, seriously?!?!?!?  This place seriously put me in a bad mood."}
{"text":"For a little \"hole in the wall\" restaurant, quite literally next to a 7-11, who cares?! They have some amazing food.  I could get a different thing on the menu every day and not get thru their menu in a months time.  The tacos are great (ask for cheese) the carne asada is really tasty. The burritos are huge. Big enough to share. The sauces on the enchiladas are absolutely terrific. We get a side of it to eat with our food. Their green salsa is great, and really, I haven't had a single thing that isn't great.  It's not a big restaurant, so what. Food is fabulous.  If you take it home, you can go next door and get an icee to go with it. What's better than that?!?!"}
{"text":"Felipito's is a good mexican restaurant, but you must know what to order in order to like it.  It's not the cheapest mexican restaurant in town, but there are certain dishes that make Felipito's one of my favorite mexican restaurants in Las Vegas.   One of those dishes is their Carnitas Tacos.  The carnitas is the best meat at Felipito's, but is not just typical Carnitas.  The carnitas at Felipito's is big chunks of fried pork with a little bit of fat attached to the pieces to keep them tender.   I also really like the carne asada quesadilla.  The quesadilla is stuffed with a large amount of cheese and carne asada.  Big portion, and great flavor.   Another item I really like is their crunchy beef tacos.  The crispiness of the tortilla, and the juiciness of the shredded beef go very well together.    One of the main reasons I started going to Felipito's is because it is open 24 hours.  While there are many choices for 24 hour food in Vegas, it is the best option on Tropicana late at night for authentic mexican!"}
{"text":"so yummy! i wasn't that hungry so i got a carne asada taco. i love it when i get two soft tortillas for one taco cuz i split the meat between them and voila! TWO carne asada tacos for the price of one!! now.. the great thing is that they had alot of meat so i didnt have two dinky tacos. lol. the meat was juicy and the guacamole had so much flavor. not just bland mashed up avocados. and the tortillas didnt break when i folded them to eat my TWO tacos!  their horchata is not as thick as most places so its not as sweet and soo refreshing! and!!! the best part of my meal was the STRAWBERRY churro! yup.. thats right. churros are fantastic..but when they have strawberry filling they are supercoolyummyfantastic!! i cant wait to go back. and its not like i would have to cuz they are open 24 hours! with a drive thru! AND a walk up window. remind anyone of the jack in the box on geary? lol  oh.. why only 4 stars? cuz i need to try other things on the menu. trust.. its gonna happen soon =)"}
{"text":"Their .99 cent beef tacos are such a steal!!! They come with shredded beef (i was expecting taco bell style ground beef so this was a lovely surprise) and the salsasssssas are so good!!!"}
{"text":"We order food from the drive thru all the time. I think we did taco Tuesday for like 2 months straight at one point. Sometimes the size of the tacos varies but they are always good. Never had a bad experience here. Will keep coming back."}
{"text":"I'm here eating a bacon breakfast burrito and it's the best one I've had to date!! Maybe it's because the bacon is crunchy? I love crunchy bacon. Great beans and tostadas too!!"}
{"text":"Not nearly as good as the feliptios on Tropicana.   It is inside a Gas Station, so if you're eating here you must be desperate, but hey, there is a post office in the same gas station, so you might be able to do 5 things at once."}
{"text":"One of the first places I had ever eaten at in Vegas. It was goooood.   Get a combo plate with beans and rice. Watch your back when you walk up to the window at night...And don't feed the pigeons."}
{"text":"Breakfast burritos - awesome! I did a basic bacon, egg, potatoes and cheese and my friend did a steak breakfast burrito. Huge and goooood!"}
{"text":"Affordable food. Good selection of traditional style Mexican but in a fast food style.  Open 24 hours (a must in a city where you lose yourself in a casino until 4am).  Drive thru! Yey!  The rice was well cooked and on the bland side. Nothing a little pico de gallo couldn't fix right up.  Chips and salsa are spot on.  Beware! Their green salsa has more kick than most greens."}
{"text":"Love love love this place! Always get carne asada fries, or carne asada street tacos! Hubby gets the chicken street tacos.  This place DOES NOT skimp on the meat!! I would say there is twice the amount of meat as anywhere else I've ever got this type of meal, and the same price if not a bit less. For the most part, the quality is constantly good, although I've had it a few(very few) times where it's not up to par.  Anyhow...I know what I like as far as street tacos, and I think these are amazing. I don't have a whole lot to compare it to, but I highly recommend this place. I have tried the breakfast burrito once, didn't much care for it and haven't tried anything else."}
{"text":"We used to always grab a burrito from here when we would have our tires fixed across the road and I remember the burritos being a lot better.   Let's start with the fact that it has a drive they but it looks like it's never open. It has outdoor tables that look far from clean and give it a boyz in the hood type of feel. ( if you have seen that movie you know what I'm talking about ).    My boyfriend always orders the carnitas burrito and adds beans and rice. He likes juicy fatty meat. The meat they gave him tonight was not only dry but tasted like it has been cooked a while ago and reheated. My breakfast burrito was ok. They give bigger pieces of bacon than Roberto's so that's a plus. Also the green sauce is spicy that was the only part that's worth mentioning. I don't think I'll be returning here in the future."}
{"text":"It's cheap, quick and convenient if you're having the late night munchies after hours of binge drinking. Went here a few times and thought this place was the bomb, but went back once when I was sober and noticed that the food was actually pretty plain and greasy, not to mention the meat is mostly fat and everything has an onion flavor to it.  But four stars to this place for curing my midnight food rages and for having some sick ass churros."}
{"text":"Good Mexican food is usually hard to find. We came in not thinking it was going to be all that. Overwhelmed by the choices, we stood in front of the menu for maybe a good five minutes. We were starving and everything looked delicious. I got camarones a la diabla and my boyfriend got a carne asada burrito. When we got our food, the portions were good but the taste was even better. I had at least 15 shrimp on my plate and dam it was spicy but it was good. The Asada burrito was amazing! They didn't shy away from the meat...and not only that it was seasoned soooo well. I would def come back. Only warning I have is...food coma."}
{"text":"There taquitos are the most expensive then any other plain beef taquitos any where in vegas . I hope there worth it :-/"}
{"text":"Great Fajita steak burrito's (not stuffed with rice and beans just steak) & the Taquito's are great too. The place is clean and the people are nice and so is the price. It's located in a Shell gas station."}
{"text":"This place is one of a kind! Yea sure the drive thru takes forever but the price is great and quality is amazing everytime! Very consistent! I alwayyys get a breakfast burrito which is so delish n ginormous!! They have great $1 Tacos on tues..normal price I think is $2 maybe but they are stuffed with lettuce and what seems like extra cheese everytime! The carne asada fries are huge also! You will not go hungary eating here thats for sure! My office is always ordering from there so I know Im not the only one who loves this spot! And 24 hours is great! The lady with the bad experience should give it another shot....I really love the portions here and prices are so low.....U rock Felipito!!!!"}
{"text":"definitely a step up from Roberto's but still just a fast food Mexican eatery. And its convenient for my work location"}
{"text":"I really wanted to like this place, close and with a drive thru. Food was not bad but customer service was unacceptable, (only 1 justifiable reason for such bad service) same staff runs the 7 eleven next door, then and only then would I blame management for the slow service and the unfriendly staff. Politeness and a smile go a long way in the food service industry."}
{"text":"Okay, so this was a total hole in the wall, but GREAT carne asada burrito. I would  perhaps have given them 5 stars if the 3 rolled tacos had actually first included the gacmole they were suppose to and the cheese was melted. But the carne asada was very good, almost San Diego-like.  The place put the food together in a heart beat but it was 10:30pm.    I have to say, this place is in the memory banks...so close to the airport and the strip (if you have a car).  Just do this, order a carne asada burrito and ask for extra gac and if you order the rolled tacos do the 5 with the works.    Glad I found this on Yelp and for sure 4 stars..oh and this is take-out only, no seating really and not a place you want to hang."}
{"text":"Pretty much like Robertos. But definitely not as busy. Workers have been really nice too. Carne Asada fries and rolled tacos are amazing! I haven't tried the nachos yet but they have to be even better than the fries. I've only ordered the chimichanga meal so far and always requested Carne Asada inside. Soooo good. Might be a bigger chimi than Robertos too. Oh and it's super close to my home, clearly a plus."}
{"text":"Nice late night spot when all else is closed on that side of town. Carne asada fries were on point."}
{"text":"Very good!!!  I had the carnitas plate and it was delicious. If it weren't for yelp, I never would have stopped here. Because it had 4 stars we gave it a try and was not disappointed."}
{"text":"It's a great spot to come after hours and eat. It's open 24 hours. It was sketchy at first bc of the area, but the food was good and no one bother us. I ordered a ham torta and they used real ham not lunch meat. My BF got a breakfast burrito and has good chucks of bacon, real bacon. The only thing is the dining outside area was messy/dirty, but it is outside, so how much can they do??"}
{"text":"So the carna asad fries were 9.95 plus tax.  Totally wasn't pleased at all So these stupid employees want to water down guacamole and sour cream and pica sauce and hide it so u can't see it it was to go but I did complain at counter before I left stupid lady said that's how we make it all the fries weren't even freshly hot or cooked to order what a dumb outrageous prices too Will never be back either enclosed you will also see the picture I took"}
{"text":"The best green salsa EVER! Need to find out if I can buy a jar. Hot n spicy in the best way I usually hate spicy food! Food is on par with prices, tasty great and somehow super cheap"}
{"text":"Great mexican grub, My favorite is the chile verde and the adobada. You have to try these to taste the mexican cure!"}
{"text":"Best carne asada fries, nachos and burritos!! Staff is super friendly and food is always delicious!"}
{"text":"Quick Cheap and easy!  We go there a couple times a week with work.  Though the rolled tacos seemed to get cheaper in the last few months.  Was my favorite thing, now I need to come up w/something else.  But the price is right for all the options there."}
{"text":"I've been comeing to this place for years...and i always get the california carne asada burrito. For me thats the best burrito in las vegas. I have never been dissapointed with it."}
{"text":"Nothing fancy. I had a double burrito. It was good. Drive through ordering or at window. No inside seating, tables outside. Good price. I'd go back. Hispanics eat here; that tells you something."}
{"text":"I really dig this spot. So grateful for a drive thru with good Mexican food. at last!!"}
{"text":"I'm so sad to say this because I used to love this place... tonight it was inexcusably terrible!  It was bland, greasy, and not even remotely fresh.  My husband and our roomies food was atrocious too. Its not often they run into something so bad they won't even keep eating it but tonight it all went in the trash. They even scraped the crusty bean corner into my plate, didn't even try to stir it, yuck. Worst carnitas I've ever had, hands down."}
{"text":"Probably will never come here again the carne asada burrito was super messy and didn't taste fresh. Just disgusting SMH"}
{"text":"I have been here twice within the last 8 years. The most recent time my friend wanted to go here so bad, and I couldnt remember whether it was good or not which obviously it didnt make a big impression on me. While driving, I noticed that we passed a lot of little hole in the wall joints I wanted to try. Nevertheless, my friend was stern on going here.   So we walk up and both place out orders. He orders a bean and cheese, and carne asada nachos, and I ordered the 5 taquitos (or rolled tacos as the menus says). My friend is a die hard Albertos fan, so once we came back here I realized that this place is pretty much that except a tad bit better.  I had one taquito and they hit the trash, wasnt feeling it at all. I actually started to feel bad for the hungry kids of america. So then I started on the nachos which we shared, and  they turned out to be really good. The aroma of the surrounding area smelled disgusting.  This is one of those places you go to after a night of drinking, I wouldnt recommend going in the daytime if you are hungry and want some really good food. When your drunk, this place is probably equivalent to Red Lobster or Claim Jumper."}
{"text":"I went and got the breakfast burrito (machaca). It was $5 and a heavy duty meal. I didn't even finish it. Best bang for your buck!"}
{"text":"I don't understand the high stars from other reviewers. The food was disgusting. The meat had fat and the fried taco grease tasted like old, reused grease with a flat, oil taste that was stuck in my throat for several hours. They don't even have any non-sugar drinks here. I threw away my food and will never come back to this place again."}
{"text":"Was visting Vegas and wanted real Mexican food which is really hard to find in Hawaii. The reviews that this place was featured on dirty dines did not deter me - I was going to eat real Mexican food. I had the burrito enchilada combo and it was 100% amazing. There was so much food that I had it as a second lunch on the plane a few hours later. I wish I had access to cheap, good Mexican food!"}
{"text":"Felipito's I write this with a heavy heart. For we had many good meals together. Lately though, you have not had your heart in it. My food has not been what I ordered, or if it was almost right, you still managed to mess it up.  It would appear there were some serious changes with how this place was run in the last year or so. My last few visits left me with many-a-wrong orders and disappointing food.  Last night was the last time I will order anything but rolled tacos from you. The 'cheese enchiladas' were nothing more than shredded cheese wrapped in a tortilla with some red sauce poured on top, hidden beneath a salad worth of shredded lettuce. When I order an enchilada, i do expect the cheese to be melted. Call me crazy, I just do.  The crunchy chicken taco that used to be the subject of many cravings has been ripped away from me as well. The shells used now seem like they come from a box and by the time I could make it home, just a short drive up Tropicana, the taco that was already broke was so soggy it just disintegrated as soon as I attempted to pick it up. My heart was so broken, I could not bear to put Humpty back together, just to consume that broken mess.  If you can get the good food back that I grew to love from your drive through, I would love to eat there again. Until then, looks like I am back on the market. Any taco shops that have a delicious crunchy taco and enchiladas with melted cheese, hit me up, I'm available."}
{"text":"Any place with a drive-thru is alright in my book.  I've been here many times, since it is on my way to/from work and also across the street from Crown and Anchor.  Nothing hits the spot after a night of drinking like carne asad fries!  Everything I've had is fresh and tasty.  The prices are reasonable and they are open 24 hours.  No complaints here!"}
{"text":"Very tough to find as the address is actually located behind a gas station. The restaurant itself was a refurbished hamburger place and still had some if the signs left. Decent menu and reasonable prices. Food was above average, large portion size for the money so a great deal. Strange thing was no chips and salsa when we waited for order to be prepared."}
{"text":"Terrible service and food.  Had to wait 10 minutes just for someone to come to the register and potatoes in my breakfast burrito were pretty much raw.  Won't be coming back."}
{"text":"I love this place they have great authentic mexican food! and they are open till 12am mon -thurs and 24/7 on weekends! Plus they have a convenient drive through and are right by my place. I've been here 3 times in the past few weeks and plan on being a regular. I Love the carneasada nachos burritos anything carneasada pretty much the taco salad is great is you want something crunchy and filling and love the enchiladas as well! They are location inside of a gas station and have a drive thru"}
{"text":"I wasn't impressed by my carne asada buritto-it was ok. I am VERY burrito picky! Some friends rave about this place-so I ordered what they get: the carnitas plate. I love it! It may break my burrito habit. Now if I could only find the perfect burrito in vegas."}
{"text":"Hands down the best Mexican food I have ever had and in a drive through at very low cost.   Everyone should y their food! Definitely not a place to bring your date to impress he of the ambiance for.   But for food,  go here,  no problems at all.   Hand down the best anywhere. Go,  get in your car,  and go here! Thank me late for the advice!"}
{"text":"Well. I had given you guys 4 stars and I  had to edit my comment and take some stars back. I remember when it was good here. Now You are embarrassing me in front of new people I bring to you!!!!!!  I went there today 3 am. Ordered some cheese enchiladas. and got COLD ass everything. NONE of the cheese was melted in the enchilada. NONE.   If i wanted a cold ass corn tortilla and some shredded cheese I would have stayed home and made that shit myself No flavor at all.   VERY disappointing. Its not that hard to make an enchilada.  I wrote you a good review in the past and now you give me this shit.  Check yourself."}
{"text":"I'm not sure what everyone else has eaten at this place, but this is probably the blandest, coldest, tasteless excuse for a burrito I've ever had ANYWHERE.  Went on April 11th, 2015 at 11am, and there were a couple of people ahead.  I liked the fact I sat outside, but the overflowing garbage cans were kind of a turn off.  ONE salsa cup for an entire beef burrito, and I wished I had one for EVERY BITE of the flavorless cardboard-like food I tasted.  I gave up halfway through and tosswed it - sort of - into the overflowing trashcan and left.  Do yourself a favor and AVOID THIS PLACE!!! It sucked, through and through."}
{"text":"Every time I come here I repeat my order 3-4 times even when I'm paying for it I continually repeat myself. If you don't understand why do yu say yes. This is the third and final time. I gave them a chance. I can't rate the food because I can't even get the right order. This morning before work I went to order a steak breakfast burrito. STEAK. I asked does it have steak eggs potatoes and cheese \"yes\" the worker replied. Then when the food was given to me I said steak? \"Yes\" he replied. Carne asada I said. \"Yes\" he replied. They gave me f*cking ham and egg. That's it. Damn it"}
{"text":"Food is average for Mexican food, about what you would expect from this price point.  Service is very slow, girl at counter was rude. Only upside is Taco Tuesday special. Sign on wall just says Tacos, however girl at the counter was rude when she said the didn't matter it was chicken only."}
{"text":"Great service, great price, and great food. I've been eating here for almost a year now and thought I should probably leave a review. I've always had a good experience here with fast service. My favorites would probably be their $3.95 breakfast burritos and their carne asada fries. Delicious! All their meals are made fresh and they also offer catering for big parties.   Always good for a late night meal too!"}
{"text":"Favorite Mexican food place in Vegas. This is real Mexican food, the plate combo plates are affordable and you get good food. I always come here when I'm in Las Vegas and its 24 hours !! Thank you to all the staff there for working hard."}
{"text":"The outside look like old LA...dirty  falling a part  But the food is gooooood my breakfast burrito real eggs a lot of bacon & cheese  Ps  Am breakfast no after a night of drinking ..lol But good to keep in mind this place"}
{"text":"I used to live right around the corner from this location so we used to come here often. But after this location appeared on Dirty Dining I completely stopped coming here.  I was out with a few friends Saturday night and we decided to get some food after we had been drinking. I would have never picked this place, especially when it was so late (around 3am) but on of my friends loves it here. So I didn't wanna burst her bubble by telling her that this location was not that great. So I kept my mouth shut and ordered food as well. I figured it wouldn't be that bad.  The young gentleman at the register was nice and he had a lot of patience. I only say that because he was the only one working there that night. He was the cashier and the cook! after taking everyone's order he washed his hands and then he made the food. It got a little busy and our food took a while but it's understandable, he was by himself! I've been there.   The food was delicious even though I was still skeptical. I tried enjoying it but it was difficult to when you have like 3-4 (drunk) guys starring at you through the window! And then they start to harass you when you're leaving.   It is not the best location, do not go by yourself!"}
{"text":"I never would have picked this. However, I had a dinner to attend with my coworkers and asked my hunny where he wanted me to stop to get him some food on my way home.   Pet Peeve #1: The girl never told me my total. After she asked me for my payment, I still had to ask her my total. She told me $16.00 and ran my card. I asked for an itemized receipt and never got one. Oops, too late. Something fishy is what I think.  Pet Peeve #2: I ordered a cheese quesadilla for my son. I asked if they put anything extra on it. Was told no. Needless to say, I wound up with onions on my quesadilla. My year and half son was not happy and did not eat it to say the least. The quesadilla was very cheesy, too cheesy almost and was very, very greasy. It oozed with more grease than cheese. Thank goodness my son wouldn't eat it, I am sure it would have gave him an upset tummy.  Pet Peeve #3: Too long of a wait in the drive thru. Sure, me being in a rush to get home to get ready for my dinner was making me impatient but when you go through any drive thru you always expect speedy or speedier service. I did not get that.  In addition to the quesadilla, I ordered a chicken burrito was just okay per the man. And I also ordered a carne asada super nacho. Nothing was super about it and I mean nothing. The meat was tough, chewy and bland. And well I didn't make it past that. No thanks.  All these 4 and 5 stars have to be some drunk posts or drunk eats because a sober mind would not enjoy these foods."}
{"text":"Roberto's is my greasy fast food Mexican spot of choice in the area, but every once in a while I have a hankering for something different and that's when Felipito's comes in handy. Their food is ok, nothing spectacular but they have some different options like churros and other desserts to tempt the tastebuds. They have all the typical Mexican fare and it's all greasy and pretty tasty. I usually end up with a breakfast burrito or rolled tacos, which were a little crunchier than I would like but I enjoy their salsas quite a bit.   They have a drive thru which is the main attraction for me. It's attached to a gas station and 7-11, which also makes for a convenient spot to pick up grub while running other errands or picking other snacks we might need."}
{"text":"Amazing food amazing customer service... we love this place and will continue to keep going back!!"}
