{"text":"Nobody in the country knows better about Italian beef than Chicagoans.  And I'm one myself!  The guy who runs FIBS is also from Chicago, & he knows what Italian beef SHOULD taste like.  This Chicago themed cart, FIBS brings the true taste of Chicago to Madison.  You won't find a better Italian beef sandwich anywhere in Madison!"}
{"text":"Man oh man was it good. I ordered an Italian beef w cheese for $8. It was a worthy experience. Chewy bread. Juicy flavorful meat. Spicy peppers. Get one asap."}
{"text":"Had the Capone combo sausage and Italian beef add cheese and peppers and had a great lunch in the capital lawn at the farmers market"}
{"text":"When I'm feelin' homesick, & can't get back t' Chicago, I call inna-my jaab n' say I'm not feeelin' so well. I sleep in, watch a lil' Dennehy, n' den quarter t' twelve, I make my way to daaaaa Square, & den I go get my lunch from dis guy. He knows what he's doin', & he do it well. All youse guys need to eat here!"}
{"text":"This is one of my favorite places to stop at the farmers market. Try a hot beef sandwich with hot peppers!"}
{"text":"3* bc of the RIDICULOUSLY long wait. I tried this food truck at the Crossfit games and waited 20 min in line which is no big deal. However, I  then waited another 35 min after ordering for my food."}
{"text":"This place is fantastic. The Italian beef with hot giardinera is super good. Even when I'm not hungry, I feel compelled to get one when I come across this place."}
{"text":"I tried Fib's for lunch today.  I was there early, so no wait at all.  The folks working the truck were super friendly and helpful.  They have a variety of sandwiches (roast beef, Italian sausage, meatball, polish sausage, chicken breast, hot-dogs, veggie dogs) with a variety of condiments (gravy, peppers, marinara, cheese, onions, etc).  I asked for a recommendation and they suggested the Beef Sandwich.  I had it with provolone and both sweet and hot peppers.  The beef was super tasty.  It comes on a large loaf of Italian Bread.  I was skeptical about the bread at first, it's a little hard and crusty, but the beef was soaked in gravy (it's really the consistency of a french dip au jus, rather than gravy) and that soaked into the bread softening it up and making it quite delicious.  They suggested I grab napkins and I'm glad I did  as the au just did make it a little messy.  If you are i the mood for one of these types of sandwiches this is a  good place to go."}
{"text":"My first Madison food cart experience and it was delicious.  I had the Philly \"Balboa\" and it was really good.  Served on one of the better buns/rolls I have ever had.  Fair priced combo with chips and soda for less than$10.  Strongly recommend."}
{"text":"I wanted to continue my tour of the Madison Food Cart scene and though Fib's would be a great addition to my \"routine\". Stopped for lunch. Only one person in front of me and super quick service. Great little vibe from the Chicago themed food cart. I was hungry and knew I was getting Italian Beef but decided to \"beef it up\" a bit and ordered the Italian Combo. Here's my list of Pro's and Con's:  PRO'S - Awesome, awesome bread. There is a lot of it (see a note in the Con's) but it is delicious! - Great Italian Sausage. Surprised at how great it was. Definitely \"above average\" taste and cooked very well. Great consistency and plenty of fennel seeds!  - Good Italian Beef. Tender yet it holds up and doesn't fall into tiny little bits that you have to scavenge for. I understand why this is this their go to item. Tough to find Italian Beef this good in town (Fraboni's would be the only place that I think that can compete). I have a small Con added below that touches on the Italian Beef. - The provolone cheese is top notch. Great flavor and there would be no reason not to add it on a sandwich. It definitely adds to the eating experience. Yet another small Con note below. - Both the mild and hot giardiniera was very good. Tons of kick with the and tons of flavor with the mild. I ordered half and half with my sandwich and was very happy that I went that route. Hot only might have been a tough time. - Super friendly service and I had my food within 90 seconds of ordering. - The whole sandwich delivered tons of flavor and really satisfied what I was looking for. Good amount of food that filled me up but didn't weigh me down (I'll be ready for dinner!)  CON'S - I've got to start with the prices. $9.00 for this sandwich seems high for what you get. There were less expensive sandwich items but only by $1.00. The hot dog menu even seemed high (you get almost the same Chicago dog at Home Depot for about $2.00 less than these prices). It's silly to complain about $1.00 but I feel like the sandwiches should all be priced $1.00 less. I fear the food cart scene in Madison is getting a little too pretentious and bombastic with their pricing approach. Pretty soon food cart prices are going to meet or exceed brick and mortar restaurants - when that happens it'll be a sad day (I digress)... - The bread, although amazing delicious, is too big for what is in it (note above). Something has to give - either make the rolls a little smaller or increase your meat portions (preferably increase the meat portions). This is a tough, if not impossible, sandwich to realistically eat with your hands because of the size of the bread. - There needs to be more Italian Beef on this sandwich. As you'll see in the picture, it really is a small portion for what is being presented and definitely for what the cost it.  - This is Wisconsin. Add more cheese. It's delicious and the cost justifies 3 slices instead of 2.   Although I have Con's with the sandwich (mainly because of price/portion size) I don't want that to be the highlight of this review. The highlight and take-away should be that the sandwich is very, very good! I would say that it is a highly recommended lunch stop that should be on the regular rotation list of places to eat. Great sausage, great Italian Beef, AMAZING bread and great cheese. It all comes together very well and delivers pure Italian sandwich flavors that satisfies. If the food portion/meat size was bigger and/or the price was lower this would be a 5 star review.  If you're looking for a chance of pace with a Madison Food Cart I would recommend Fib's! It was kind of like a \"reset\" button for me and gave me food and flavor that is tough to find around town. The Chicago invasion known as Fib's know what they're doing with their beef and sausages and do it very well!"}
{"text":"After a recent jaunt to Chicago and a first introduction to Portillo's Italian Beef sandwich, I've been determined to find an italian beef sandwich in Madison to fulfill my new and frequent cravings.   Apparently this place has da beef, so I marched my way to this stand and ordered the italian beef sandwich with hot peppers and dipped, Chicago style. After he made it for me, he showed it to me to make sure there were enough peppers. Eeeek! Instant drool. I practically ran back home to eat it in the comfort of my home because there would be beef a-flying.    I tore it out of it's box and threw it on a plate that was admittedly too small for it and I began to gorge myself. It was absolutely fantastic. The beef was top quality. I never got a weird chewy bit. The bun (from Gonnella's) was so delicious. The Au jus soaked the inside but the the outside stayed together. You had to really bite in to get a bite because the roll had such amazing chew. And the Au jus! Lord help me! It soaked into the bun and dripped all over.   Now, everyone is going to ask: is it better than Portillo's?! Different experience, my friends. The meat was certainly better. I got a few ultra chewy pieces (and not in a pleasant way) at Portillo's, but this FIB's beef melted in my mouth. I actually preferred FIB's bun, too. But shhh!!! I will certainly eat both without complaining."}
{"text":"This cleverly named little food cart just started setting up a few days a week on John Q Hammonds Drive in our office park in Middleton (well, maybe the cart's in Madison city limits, but Hammonds is a short road, so if it's there you'll find it).   While \"FIBS\" is a pejorative used by Wisconsinites to describe Illinois tourists, it's used by the owners to describe their fine Italian beef and sausage. They clearly have a sense of humor and a keen sense of what makes an incredible beef sandwich. All the sandwiches and sausages are named after famous Chicago natives and the cart is plastered with photos of the entertainment and sports legends the city has produced.   I had the \"Tony Bennett\" beef sandwich. It was dipped in a \"gravy\" (basically an au jus), topped with the sweet and hot peppers I ordered, and served on a perfect, fresh Italian role with a crispy crust and a chewy inside that absorbed the gravy with perfection. The sandwich was priced fairly and perfectly sized for lunch, but when it was gone I wanted more. More. More. I wanted to eat 10 more.   Next time I'll try a different sandwich just for fun, but I will go back to the Tony Bennett many more times. More. More."}
{"text":"I think that FIB's Italian combo (a spicy Italian sausage topped with roast beef, provolone, and peppers) is my favorite thing to eat in Madison. It probably has about 20,000 calories, but it's beyond amazing. The guy who runs the stand is extremely friendly. Service is fast and they always make a point of opening the container before giving it to you to make sure the order is right. I highly recommend this cart."}
{"text":"Good food they just started offering soda and chips as part of the purchase of a hotdog which is nice but they need to mention that to people and ask what they want. I wasn't aware of that and bought a chili dog on my birthday and walked away empty handed. Little disappointed but hot dog was good. Other items kind of get pricey 8 or 9.00 for a sandwich is a bit much"}
{"text":"By far one of the best hot dogs in Madison. Too bad they're not open late. Terrific spot for a noon time lunch during the week"}
{"text":"They have changed their signs to advertise their current time of operation in McFarland from 11-2! Thank you! I had the Italian Beef, it was good!"}
{"text":"Move along, move along. Nothing to see here.   I was really excited to try Fib's after learning all about the backstory behind the food cart's name, but I was not at all impressed by the 'Milwaukee Dog' that I ordered. Maybe I just ordered the wrong thing? But for a food cart that specializes in only sandwiches and hot dogs, you would think that they would serve only the finest of the items they have on their menu. Then again, maybe I should have stuck with the Italian beef sandwich that everyone is raving about on Yelp.  The 'pure beef vienna hot dog' could have easily been an Oscar Mayer's beef frank. I honestly couldn't tell the difference. As for the 'poppy seed bun', I don't remember seeing any poppy seeds on my bun... it was just a regular white bun that could have been picked up from any old grocery store. They were generous with the mustard and sauerkraut though..that is for sure.   Oh well, for a mere $3.75/hotdog, I'll just file this away into the abyss of my Yelp 'tried and reviewed' list."}
{"text":"Oh hey Fib's!   Not certain why it took me nearly two years to try a cart I was destined to adore simply by it's name (it's true, it's true... yours truly is a FIB) but I'm sure glad it's out Saturday's on the square because I was haaaaangry (angry hungry) and didn't want to sit down somewhere.   The wait was a touch on the long side for what seemed like little to no line, but that didn't matter once I sunk my teeth into the tender, authentic, Chicago style Italian beef. It's not quite on par with Portillo's (the undisputed king of Italian beef sammies in the city), but it's pretty damn tasty! They were nice enough to send me with some gravy so I could dip, but the sandwich itself is pretty wet.   I look forward to exploring more of the menu, pretty extensive when you consider the amount of space they're working with!"}
{"text":"I am from Chicago and I think this is the best Italian beef I have had. Try to get there early (noon) as he said that is when the beef is at its finest. Extra spices! I recommend to any Chicagoan that is feeling homesick."}
