{"text":"Well.... there was a hair in the meatball cone, so it wasn't  great. The wines on tap were good, not a big selection. The service was super slow and we were one of few people in the place and they have the sauces prepared. They were out of alfredo?"}
{"text":"Fidelli Kitchen is a welcome addition to South End! I've been three times now, twice to eat in and once for takeout. The \"build your own penne\" with vegetables and marinara with a small Caesar salad was my favorite meal. I've also had Chicken Alfredo which was good after adding salt and pepper. A large pasta could easily be split between two meals - I've brought leftovers home each time.   Fidelli has a nice selection of wine as well. You buy a wine card at the register which can be reloaded and insert it into the wine dispenser in the back. You can purchase most wines by the glass, half glass, and tasting size. We visited on a night when wine was half priced and it was a great deal.   Gluten free pasta would be a nice addition to their somewhat limited menu. This restaurant feels somewhere in between fast casual and casual dining.   We will definitely be returning to try the meatball cone everyone raves about!"}
{"text":"A great dining experience. I really like the concept. Delicious and fast service!  This place will do well - the location is great, surprisingly wonderful Italian sauce, and very friendly wait staff. I'll definitely be back!"}
{"text":"Went here for the first time today and the food was amazing! I was craving italian, and I've always been underwhelmed with some of the other local italian spots. This place was: 1. fast  2. delicious  3. had great service 4. all the wine  I will be back, often. The food was so good.  I got my order to go, so I assumed I wouldn't be able to take my wine with me, but I will definitely be back to taste. There's also gelato! and cake! I mean... seriously.  Excellent all the way around"}
{"text":"I'm really glad I broke my own rule today.  I normally do not go to new restaurants on opening day, but made an exception.  Fidelli Kitchen opened their first location in South End and I see a great future for them.  You can always count on some opening day jitters and a few hiccups with a new restaurant, but they were very minimal.  The staff was very welcoming and friendly, the interior fresh and modern.  The menu is not huge but there's a good variety and it is very well executed.  I had the \"create your own\" dish of meatballs, penne, and bolognese sauce; fantastic!  Two of my companions had the same except trading the penne for a cone of bread which housed the meatballs.  My other companion had the tomato tortellini soup and a panini; all excellent.  There were a variety of drinks, both alcoholic and non.  I had the \"sexy water\" which was infused with cucumber and basil.  It was delicious.  The self serve wine wall was intriguing.  There was also an additional room with a wine shop.  I didn't have time to shop today but will definitely check it out very soon.  All in all, it was a great experience, even on opening day."}
{"text":"Fidelli is seriously gross. . All of the food is frozen.  Nothing is fresh. The owner is rude,(he wears earbuds in his restaurant).  Rude I seriously miss the wine expert.  If you want frozen food Go to your supermarket  Not Fidelli"}
{"text":"These guys are killin it! Live music on the patio Saturday afternoons. Great sangria (not sweet), friendly staff. Food looks tasty-will update after we eat. New favorite."}
{"text":"So good! Get the meatball cone it's delicious and try the chocolate croissant. They also have a wine dispenser here!"}
{"text":"I have been here three times now and I am super excited for this new spot in Southend.   My two visits were on Thursday evenings, which is half off glass of wine night! Woohoo! The one Thursday it was nice out, they had live music and I couldn't wait to sit outside on the patio. I even brought my dog and there are hooks along the railing to tie him. I have had the meatball cone and the chicken pesto sandwich on my visits. The cone is a must must try! Bread was fresh, love the mozzarella cheese and meatballs/sauce has a great flavor. It's just a cool idea! The chicken pesto sandwich is again good and a nice sized sandwich. And that bread...yes, yes, I enjoy my carbs...was warm, fluffy and fresh!  I also stopped by on a Saturday evening, which is $5 sangria night! Woohoo! We didn't eat   anything this visit, but it was nice just to sit outside and glide on the chairs.  On all my visits, the staff (Megan in the bar/wine area and two gentle men) I'm assuming owner or GM. Went out of their way to move tables on the patio for my dog and I, let me sample wine that they could potential service in the future and was just overall very welcoming.   I'll be back! :)"}
{"text":"Pretty great. Went today. Had the meatball cone and Mac n cheese. Both were awesome. Very flavorful. I thought it was pricey but will definitely be back for that cone. Good stuff."}
{"text":"Came here for our anniversary. The manager was so accommodating and gave us complimentary wine to enjoy our special day. Atmosphere is A+ and food is the same! Prices are reasonable and food is made fresh! Would recommend!!"}
{"text":"Love this place especially for a Friday night! Megan was so great all night and giving the best advice on the best wines they have! Will be a regular here for sure!!"}
{"text":"I am a fan of Fidelli Kitchen! It has become one of my favorite hang out spots for two key reasons: atmosphere and wine. It is quite difficult to find a place around Charlotte that is conducive to writing with food and spacious seating. Most places are far too noisy.   Fidelli is the perfect place to grab a small bite, try a new wine and enjoy light music inside or outside on the patio. Fidelli offers a self-serve wine bar with a variety of red and white offerings with options for a tasting, half or full glass. Just load your card and you're good to go.    It's also a great place for business meetings!"}
{"text":"I honestly don't know what to think, but if you can get my full for dinner for under $10 in a major city these days, I'll take it.  I should probably go ahead and give them that 4th star, but I'll think I need to give it another try first.  The vibe is interesting.  The Italian market theme seems pushed, not quite natural to the setting.  The place feels more like a fast food with some fancy decor.  There is a whole wine area.  There are lots of other products either for sale or just laying around, I'm not sure, they didn't have price tags.  Like I said, earlier, I really don't know what to think.  Anyhow, we ordered 2 sandwiches.  Our cashier was friendly, but didn't really seem to be in too much of a hurry.  Staff in general didn't seem to hold their heads real high and look professional.  JMHO.  Yet again, I don't know if I am supposed to be looking for subway or Carraba's vibe here though..  The chicken salad was pretty good and I loved the croissant.  Something on the pesto chicken sandwich was extremely dry though.  Not quite sure if it was the meat or the bread, but it took some water to get it down, which was kind of strange sine it had a good amount of pesto on it.  About this time is when my mother discovered that the chairs are on wheels that move super fast on this floor.  Cool if you're trying to move around, but not so much if you are just using it as a brace when you stand up to use the rest room."}
{"text":"This whole review can be summed up in 4 words...  Get. The. Meatball. Cone.   You're welcome.   Seriously, if you're like me and love carbs on carbs on carbs. This is the place for you. The menu is simple, salads and soups, BYO pastas, bread cones and paninis.   I ordered the Roman Holiday salad and it was delicious! I loved the marinated mozzarella balls. And the balsamic mustard dressing was divine. Totally the way to go if you want a heart salad to start your meal. I ordered the small and it's a great portion so it could definitely be a meal on its own.   Now, on to that meatball cone. It's a yummy bread cone stuffed with penne pasta, sauce, veggies, meatballs and cheese. You have the option to skip the veggies and I did just that...gimme the carbs.   The meatballs were delicious! Great flavors and I loved the sauce. And they were not skimpy with the serving size! So good. If your debating what to order...this is the way to go.   I also ordered a chocolate croissant. But I was too stuffed to try it last night. But I'm sure it will be delicious.   If all that isn't good enough, they have a self serve wine bar.   This place is winning!"}
{"text":"I've seen fidelli kitchen a lot since it opened up and decided to give it a try. Right off the bat the cashier was rude and snarky after I asked how I could order food, out of general curiosity. After doing so I ordered my food and the cashier managed to write down the wrong order, and even gave us the wrong drinks.  I'm not usually a picky person and I understand that mistakes can be made every now and then, but I've rarely encountered rude and sly workers at similar restaurants.  The food was decent and came out quick after the issue was resolved, and the worker who brought the food was incredibly nice.  As for the quality of food, it was okay. I wouldn't set it apart from any other generic Italian food I've had, and the atmosphere is nice.  I wouldn't be inclined to visit again if I was craving Italian food."}
{"text":"I'm worried about this place because whenever I'm here it's never busy. But I don't let that sway me...  Walking distance to my (almost!) new-ish spot in South End. J and I visit Fidelli when we need something fast (and when I need to eat something clean...).  J loves the meatball sub and I opt for the goddess dish...mmm warm zucchini, chicken, ALL OF THE TOPPINGS, because obvi I DIY.  There was live music on Thursday which was really nice, but honestly there were only 6 of us there.  While it's fast casual for sure, with beer and wine self-service, the atmosphere is a little lacking, it feels like a cafeteria with some of the furnitures and fixtures. There are a couple of single-soft-seating couches, but other than that, it's just a little bland."}
{"text":"What is it? A wine bar with food? Fast Food? Reinvention of an Italian eatery uptown? A lot going on here. I stopped in yesterday for lunch. The menu is pretty simple, sandwich, salad, pizza cone or veg or non veg bowl are basically your choices. I placed my order with a nice girl for a Veggie bowl, priced around 7 bucks. While waiting at the counter I noticed a few things... Lots of foil pans of food sitting around on carts and counters. Not sure if that's what the use to prepare all the orders or if it was a big catering order or what. I watch them make a pizza cone (they wear gloves, yay!), they dump mac n cheese into a previously used bowl that had been sitting on the counter and mix the barbecue meat into it and then add it to the cone with more meat (chicken, I think) on top. The use of the dirty bowl grossed me out. I also notice a gallon container of Sweet Baby Ray's sauce in the back but OK. It's been about 15 minutes and a lady catches me watching and she tells me I can have a seat and they will bring my food out to me. So I have a seat for about 6 minutes. I then ask a guy who is handing out the orders, \"how much longer will it be?\" he then asks the one who took my order if she working on the Veggie Bowl, she replies \"she is\" talking about the other worker that is stir frying the veggies. Then, everyone continues on without answering my question, including the lady that appeared to be the manager (she was doing the least amount of work even though the place was busy). At that point, after paying almost $8, I JUST WALKED OUT! I didn't even ask for a refund! I bailed. Why? Cause this joint was an EPIC fail in my book. Looks pretty enough but I'm not quite sure they even deserve the 97 rating on the wall. I won't ever go back. Left way too many questions in my head. BTW, the two stars are for the service and decor."}
{"text":"I attended an event at this restaurant. I was a little early, so I grabbed a salad while waiting. They have a reloadable wine card you can purchase. Tip: If you're an avid wine drinker, $20 and if you are not, $10. I also ate the Chicken Alfredo Cone (half), it was a little bland but nothing salt couldn't fix. We were told that they have specials during the week. I would frequent this establishment again in the near feature."}
{"text":"Very pleased with the food, We had a small problem and Megan done an excellent job with service recovery.  She is awesome and so is the food and atmosphere."}
{"text":"Been trying to come here for months and I finally got the chance to go! I love the vibes with the music and the decor, it's just super modern and very spacious! I got the infamous Meatball Cone, of course, and it was soooo good. The cone was very chewy and went well with the meatballs and pasta. I also got a Chicken Pesto Panini and the Caprese Pesto Panini, both of which were pretty good. I would like to say that everything was on the pricier side though. The menu is pretty small with only a select few options. I would still totally come back though!"}
{"text":"I love this place and the amazing staff! They have wine dispensers where you can pick how much wine you want. There are usually three choices, a taste, half glass full glass. You don't have to buy a whole bottle and you can try different wines!   The venue itself is beautiful. It is very clean and their is cute furniture to sit at.   Don't forget to order a bread cone. My favorite is the meatball one!   Oh and they always have great specials! Tuesday are my favorite day. $5 for 5 wine tastings plus a free glass. What a great deal! Check out their Facebook for more details about the other days!"}
{"text":"The wine bar is a scam. You have to preload a card (pay in advance) and it's not possible to get your moneys worth when they have preset pours/prices. The staff was rude and wouldn't help when we were clearly having issues with the system. Food came out slow when we were the only people in the restaurant. We were excited to try but needless to say won't be going back."}
{"text":"Delicious fast casual Italian - order at the counter, and they deliver the food to your table.  Recommend the meatball cone -  was really delicious - meatball had great flavor and seasonings.  Also Caprese pesto panini - fresh and yummy:  Added bonus is the selection of wines by the taste; by the glass, or the bottle -  reasonable prices on the glass and the bottle:  Proprietor Chris guided us to several nice wines that are not avail at grocery stores or larger wine stores. Def will come back"}
{"text":"We heard about Fidelli Kitchen on a local radio ad and were very excited to try it out. We were less than impressed, to say the least.  The cashier did not know what anything on the menu was or how to input anything in the register.  It took extremely too long just to place the order.  After purchasing the reloadable wine card, we struggled with the machine just to get a glass of wine.  We requested that an empty bottle be replaced, and waited an obscene amount of time for that to happen, before reminding them to do so.  The food was lukewarm and mediocre.  The service was friendly but lacking in knowledge or urgency.  We will not be returning."}
{"text":"I went to get a meatball cone and they no longer carry it. My friends and I left because that was the only reason we went to Fidelli. I won't be going back unless they bring back the meatball cone."}
{"text":"Just checked this place out and it's incredible. The food was perfect, got a BBQ chicken cone, the ravioli, and the power goddess salad. They did not disappoint. The serve yourself wine bar is perfect as well. Great selection of wine and the service was awesome as well. Will be back!"}
{"text":"Such a terribly disappointing meal and overall experience. Fidelli has been on my bucketlist since it opened and I'm so sad to have wasted money and and a meal out on bad food when there are so many good options near by. I will give a star to the Caesar salad which was quite good and a good portion for only $6 but everything else was a let down. Had I looked at the meal prep bar before ordering I likely Would have left. The food was all prepared, for example the Mac and cheese and meatballs, and looked old and sort of crusted over, my first concern. Our salad was brought to us and about 20 minutes later we still hadn't received the 3 cones we ordered, I finally went in to ask and was told \"sorry I though he brought them.\" We eventually did get the 3 half aka small (the sign out front said small and inside said half) bread cones with Mac and cheese; meatballs, and Tuscan BBQ chicken. The texture of the bread cones was awful, I saw them being reheated in a microwave oven and they sure tasted and felt like they had been. The BBQ chicken was over the top sweet and lacked depth of flavor, the Mac and cheese and meat balls weren't terrible but were to about the quality of Olive Garden stuffed in a bad bread cone. I hate to rant yet I also hate to waste my time and money on and food when I want to try so many places in the QC!"}
{"text":"Enjoyed food from the booth at Taste of Charlotte. We sampled the meatball cones and wish to sample your menu. It all sounds wonderful!  Hint: That menu featuring your mouth-watering treats? It should include your address, enticing your guests to your location. Just like us, others might have waltzed over to your location.  Thanks for the sample!"}
{"text":"Great place to stop and grab a bite to eat! I really enjoyed their meatball cone. It is great on the eyes and the belly. The stay was very friendly and even let us use their Bluetooth speaker to play music as we sat outside. Great place, highly recommend!"}
{"text":"We ordered take out and our food, it took about 30 mins to get it and it was given to us with no sauce. My boyfriend ordered the Chicken Alfredo and the chicken smelled and tasted like an chicken, and had no alfredo sauce. The only redeeming aspect of this trip was that the italian wedding soup was delicious."}
{"text":"Very tasty, and a good atmosphere with live music. The small Mac and Cheese cone was more than enough, though the chicken in the chicken pesto sandwich seemed a tad dry, with a pretty small portion of chicken.  The bread was quite crunchy and appetizing, though. We will surely come. Ack on our next Saturday walk along the rail trail."}
{"text":"AYYYY I love the feels of this place! It definitely has modern, chic vibe. I love the decor(white) it makes it look really so clean! Also BLESS them for adding the blankets out in the patio, I thought that was a really sweet addition(: I also love their wine wall, pretty creative, if I could drink I would've deff checked it out haha! Anyways I ordered the caprese pesto panini and my cousin ordered the meatball cone. The best part of the panini was the Bread, oh god it was BOMB. It was so crunchy and soft, and all the flavors were all there! It wasn't dry and bland, it was moist inside. I didn't try the meatball cone since I'm a vegetarian but it looked so good & my cousin said it was pretty good so I'll just take her word for it since she's a picky eater! We also tried their chocolate/fudge cake, I'm more of a dark dark chocolate typa gal so it was a tad sweet for me but still tasty of course! Check this place out of your ever in the area, you won't regret it. Bring a couple of friends, it's a perfect environment to just chill & relax with some gals! (:"}
{"text":"After visiting Fidelli Kitchen recently for dinner, my opinion is that Fidelli has true potential.  The concept is interesting, the place is clean and attractive, and there's a great outdoor seating area. The night we went, there was also a live performer on the patio, which was fun.    We were fortunate enough to hit the place on half price wine night - score!  I was impressed with the Chardonnay and Pinot Noir they had on tap, two really nice wines.  I have missed the wine card/on tap offering that was a big thing for a while and then started to disappear.  This offering really fits in with the casual environment of Fidelli.  There was a wine attendant nearby to assist, so you're not completely on your own.  I think you can either belly right up to the wine bar and fill a card or load one at the food register, which is convenient.  The retail wine offering is light but well-thought, including unusual labels prices for every budget.  We weren't super-hungry, so we ordered salads, based on the great descriptions, and just found them to be kind of bland and light on the featured ingredients. Staff was very friendly, but for such a new place, not really helpful on menu assistance or suggestions.  I felt a little rushed to make a decision and get on with it.  I probably would have agreed to a side of bread or what they call a \"shareable\" if it were offered.  Also (and this is the standard for many restaurants), restaurants have started to ask if you want to \"add a protein\" to entrees.  We all know what this question means, but there are more appetizing ways to ask this, suggesting the actual deliciously marinated and prepared item: chicken, shrimp, etc.  As the web site description states, Fidelli blurs the line between fast and fancy; I just wanted a little more fancy in the evening hours.  Dim the lights, guys!  I'll be back - sounds like there might be a meatball cone in my future. :)"}
{"text":"I live in the area near Fidelli's. What a creative idea! I love the casual scene and intimate vibe that you feel when you walk in! The outdoor patio is obviously prime real estate as far as seating goes but inside there are cozy candle lit tables.   Now - about the main feature! The wine wall was disarming. So many bottles to choose from (never a problem)! You get a reloadable card from the front and then go to the wall and try different bottles. This is a great way to re-energize the wine bar scene.   They also have food. I got the power bowl and added shrimp and a couple toppings. It was decent."}
{"text":"Had the pasta bowl which was nice because you could throw in all the ingredients of the power bowl (zucchini, squash, etc.) at no upcharge. The Bolognese sauce was really flavorful and the chicken was pretty good. I had a friend get everything served in a bread cone. That was weird. He ended up pulling everything out onto a plate anyway. But, he said the bread tasted good. It was just an apparent oddity for meatball transportation."}
{"text":"Very slow service.  I think this is supposed to be \"quick\" dining... relative to a typical sit down.  I ordered to-go, and I was there for 25 minutes.  Food was somehow cold by the time I got it?  Anyways, food was ok.  Probably won't ever go back, because of service.  You want something quick, pop over to Blaze pizza right next door."}
{"text":"Salad was very fresh but it was way over priced. We barely got any food and spend 30 between two people. We don't even eat meat so these prices were ridiculous. They had a cute setup with a wide range of wines but not a good place to come and eat."}
{"text":"Good food and great portions but overpriced. Mama Ricottas is a much better deal. I got ripped off with the self serve wine and the \"wine manager\" was less than helpful."}
{"text":"Clean, new, shiny new spot in south end. Food was just okay, not the most flavorful (ordered lasagna and a salad).  Maybe this concept is lost on me because I'm not a big wine drinker, but I'd rather cook Italian at home or go somewhere more authentic if I'm craving pasta."}
{"text":"Food below average. My husband got the chicken penne alfredo that tasted like a jar of Ragu Alfredo sauce was warmed up and poured on top. The bread tasted like it had sat in the fridge overnight and wasn't even warmed up to be served. Sorry."}
{"text":"I enjoyed my stop at Fidelli. The place was very clean and would be a great relax spot. They have self serve wine and they offer their signature Bread Cones. I was interested to see how it worked so I went with a bbq and a Mac and cheese cone. My favorite of the two was the BBQ. The bread cones themselves help up well yet where soft and tasty. They definitely have a good process for those. I'd go back to Fidelli."}
{"text":"Every time I go here, I have this immediate feeling that I'm annoying the staff. It's not very clear on what you are supposed to do and if you ask, you get looked at like an idiot.  The space is great, wine great, food great. Customer servuce is horrible.  It's happened about 4 different times now."}
{"text":"The staff here were amazing! Great customer service and delicious food for a VERY reasonable price. Loved the laid back atmosphere as well, will absolutely be coming back here."}
{"text":"My wife and I drove by and said \"Hey... a new Italian place for us to try!\"  I wish we had skipped it.    The Decor:  imagine if a nice Italian restaurant closed down.  The walls are painted and 1/2 of the furniture and decor is left.  You lease the space and only have $100 to decorate your new restaurant, so you go to the Dollar Store and blindly buy whatever cheap crap you can find.  Empty flower pots?  Sure... I'll take 10 and leave em empty.  Maybe I'll stick a set of those solar lights in there, to draw attention to the empty pots.  Pretty!  Let's also get some random plastic furniture and some tables from the discount pile... you know, the ones that are wobbly?  The food:  My wife got the \"build your own pasta bowl.\"  To save time they cooled the pasta ahead of time.  Ok... restaurants do that, but they cook it 75% of the way, then finish it to order.  This was cooked 100% of the way, then boiled again to create puffy, shapeless pasta with the consistency of mashed potatoes.  Any place calling itself an Italian restaurant should just lock the doors and walk away serving a mess like that.  I tried the meatball cone.  The cone was an interesting try, but mine was stale and pretty tasteless.  The meatballs were delicious, the one saving grace.  In the end we paid $24 for a Diet Coke and 5-6 meatballs.  The rest was basically inedible."}
{"text":"Oh my goodness, this is the 3rd time this week I'm back for this tomato tortellini soup!! Love the ambiance and wine selection at this awesome location in Southend. The service is super helpful, I was worried I wouldn't be able to get something healthy here - so happy to report my new obsession with Roman Holiday salad that's to die for! And just when I thought it couldn't get better, live music walks in!! So happy to live nearby here :)"}
{"text":"The often (by me at least) looked over southend dinner spot has yet to be a let down in the casual fast dinner category. The meatball cone has only improved since the one I had around the time they first opened and the service continues to be .  2¢- go on a nice evening get dinner and a beer and sit at the outdoor patio"}
{"text":"Delicious fast casual restaurant. The meatball panini is killer! And the Caesar salad is probably my favorite in town. They have a self serve wine bar which is awesome and you can't beat the location- on Camden Rd between park & west right next to Price's. They have a cute patio overlooking the street and free parking in the garage in the back of the building. Also try dessert- it's all good!"}
{"text":"I must say I was pleasantly surprised by this place. I love the location and the concept. Walking in I didn't have any expectations I was just ready to enjoy some wine! I heard about this place on instagram and how they offer free wine tastings on Tuesday! After a long day at work who wouldn't love some free wine!  Walking in the doors the white chairs and red blankets greeted me along with the red wall lol. I immediately started looking around and taking everything in. So it's not like a normal restaurant, seating is first available {but I'm sure this changes on Friday and Saturday}. I walked to the register where two ladies in front of me where ordering food. Once they were finished I requested the wine tasting for one. The cost was actually $5.00 but keep reading and see how everything was free lol...  I found a cute little table for me and Ashley the wine manager came over to introduce herself. She was very pleasant and provided me with a sheet of the 5 wines that I would be sampling. I didn't know it would be five! But I was ready!!! LoL! You scale the wine 1-10...ten being the best, as she mentioned this helps her prepare for  wine selections to offer in the store. They like to base their selections on their customers picks... I love that!   Wine number one was a Chardonnay though I scored it a 7 it was in my top 3. Very good! Out of the five wines she only provided 1 White during this tasting which was fine with me because I'm more of a red girl! My favorite red was the Pinot Nior then the Merlot, after that I wasn't too much of a fan of the last two.  Ashely shared with me that one way of knowing the age of your wine is by looking at the color. She did this by tilting the glass and leaning the wine into the light one the white sheet of paper. This showed the burgundy tones in the wine. Very wise I must say!  Once I was finish tasting she provided me with a $5 gift card. The same $5.00 I paid to taste the wine I received back in a gift card to come back and enjoy more win... who's winning? I'M WINNING!"}
{"text":"Meatballs in a cone. That is the reason we came. Nothing more, nothing less. A man, on a mission.  I walked in and the staff was lovely. They said take your time and look around. I told them, I know what I want. Our eyes lock and they knew what I was there for too. Just kidding... I had to tell them what I wanted.   I'm a big meatball fan and gen I heard they were putting them in bread cones, I need one.   The place was completely empty, so service was quick. The whole staff worked on our order. Seemed as if they wanted to get it perfect, which I appreciate. My son and I, got our orders and ran to the car. We tore open the package, clicked the obligatory pics and floated off to meatball heaven. The food was delicious. Bottom line. I would visit this place again, for sure. Lovely area and hip spot to be. Try it for yourself!"}
{"text":"Loved the food, tons of vegetables, and happy friendly people who love their product and enjoy helping us. We will be back for brunch or dinner.    Meatball cone- good taste, but felt like for $9 he should of gotten a side.  Mild sausage and sauce- small plater -my 6 year old enjoyed the meal and it was nice tasty spicy sausage and \"I like it with the spicy sauce\" bolognese sauce(the restaurant employee was super nice to allow her try some sauces)  Mac and cheese- small side- always a hit and big enough that she could not finish it. 4year old  Power bowl- build your own with everything, chicken, and arribiata ? Sauce. It was loaded with vegetables!!!! Yummy   Side of vegetables- lots of fresh garlic, delicious"}
{"text":"Great first visit.  Look forward to dining again. Meatballs wonderful tasting. Service friendly staff"}
{"text":"Everything we have tried here has been great (Caesar salad, pesto panini, cones, etc.). You can tell they are still working out a few kinks but their customer service has always been outstanding. Especially as it pertains to management. Their outdoor patio can't be beat."}
{"text":"Awesome experience!  Many thanks to the manager who went above and beyond to make sure my sever food allergies were addressed properly and that I had a safe and delicious dining experience.  Very nice wine selection and terrific atmosphere!  The owner is very nice as well."}
{"text":"We were looking for somewhere fun that had good Alfredo. This hit the spot!! My brother got Alfredo, my fiancée got the chicken Alfredo bread cone and I got the pasta with pesto. It was all very tasty! The service and management was excellent, very kind, personable, and made sure we had whatever we needed!!   You walk up to the front to order, get a number, and then sit and wait for your food. The wait was a few minutes longer than I wanted but it was worth the wait. They also had a fun, very interactive way, to get wine!   I recommend trying this place out for your next meet up with girlfriends or a nice yummy bite of pasta!!"}
{"text":"Great little Italian quick bite type of place with great wine options. They're in the middle of Southend beside Price's Chicken Coop. They have a small 4/5 table exterior dining area which is nice for people watching and taking in a bite and a glass of wine. I had the meatball panini which was excellent. The meatballs were moist and tender yet sturdy enough for a sandwich. They had very nice wine offerings. You could sign up for their wine offering program or just buy by the glass. I had a nice glass of Chianti with my meal. They also have some desserts as well. The tiramisu was very good. Cheesecake was quite tasty as well. The service was great for us. The cashier was very friendly and  patient with us as we had many questions since this was our first time at the establishment. The young lady who we presumed to be the manager was very nice and attentive to our needs despite the fact that we were outside while all the other guests at the time sat inside. We'll definitely come back for more!"}
{"text":"Went to try the infamous meatball cone. The flavor of food was very good. I will say it did not arrive very hot and was cold before I was done. The staff working the register was less than friendly - while the staff cleaning tables was very nice. Saw customers showing other customers how to use the wine machine while there was other staff not doing anything. Concept is cool - execution seems flawed."}
{"text":"My friend ordered takeout from here. I still haven't visited Fidelli's, I look forward to coming for dinner one day.  I ordered the bread Meatball cone! Which also comes with pasta inside. Personally, I'm not a fan of the pasta. However, the meatballs are EVERYTHING!! Sooooo delish!!! The cone isn't too thick or thin! Which I loved!!   I look forward to writing more when I visit!!! Until next time!!"}
{"text":"Fidelli serves fast food pasta & to die for cones. I built my own pasta the first time I visited this restaurant. It was okay, nothing to write home about. I was enthralled by the self serve wine. I tried to use my debit card at the machine during my first visit (face palm). Fidelli has wine cards that put money on to use at the machine.   They have 1/2 off wine on Thursdays! So obviously, I ended up at Fidelli on a Thursday. I ordered a meatball cone (so delicious!) and reloaded my wine card. The cones used to come to two sizes, but they only offer the standard size now. It's so good!! They also have live music on Thursdays which is a nice touch.  This place is pretty good. Live music, great service,50% off wine. What more could you want?!"}
{"text":"So I think these guys are still fine tuning (since they really just opened not that long ago).  I came in with a friend and was definitely a deer in headlights.  The young lady at the register was really nice and walked us through their concept and I asked a lot of questions about what is popular.  I built my own penne pasta.  Chicken with Alfredo sauce.  It came out super fast (they weren't that busy that night) and it was a large portion.  I think the meat cone is the way to go, and I will definitely be trying it during my next visit... along with some wine since I am within \"stumbling\" distance.  The space overall is clean and modern.  The concrete floors are lacquer-ed into the next century, and I noticed the chairs definitely slide very easily on the surface so be careful.  Some chairs even have castors on them (the ones with the arms) so it probably makes for a great transitional space for whatever the restaurant needs or for groups to move tables together, etc.  The store attached to the side of the restaurant (mostly wine) but there are some other products to purchase.  They didn't have any prices on the wall so I'll have to come in again to see what their price-point is.  I think the big draw to this place is the definitely going to be the self-serve wine bar.  With all the stuff going in on Camden, FK should fit very well as far as giving folks just another option... fast-causal dining in the area."}
{"text":"I liked the meatballs.   The bolognese sauce is blah bland.  No parm cheese offered on tables or nearby supply station.  Caesar salad is huge.   Food is nothing special.   They don't clean their outside tables.  Thankfully I bring my own Wipes.  No recycling bin offered for the plastic cups they use.  I won't be back."}
{"text":"Let's go ahead and start with the best part... the meatball cone. Seriously delicious, especially with the cheesey treat at the end! The lasagna was very good too. We will definitely be back.. especially for the wine store!"}
{"text":"I decided to stop by and relax with a glass of wine while my baby was napping in his stroller, and it was anything but relaxing. I purchased a wine card for $10 (you can the amount you wish) and chose a $4 cab pour. The pour ended with air so I bought another $4 pour to fill my glass and it was all air, the bottle was out.  There were 2 girls working in the kitchen so I asked them if they can help me. Neither knew how to change out the wine machine so they called their wine rep while I waited. The women on the other end asked them if they knew how to open a bottle of wine. (Really? Why do your employees not know how to open bottles of wine? This is a wine bar!) one of the girls said she knew how, so the wine rep on the phone FaceTimes to show her how to change the machine. At this point my patience is growing thin. The employee figures out how to open the wine machine door and now is trying to open a bottle of wine. She gets the cork out half way then tries to pull the cork out with her hands! I ask her if she would like me to try...she said no she got it and she did finally figure it out. Before she learns how to put the bottle in the machine, I ask her if she can just pour me a glass that I already paid for instead of refilling my card up and doing this again. She agrees and gives me a tiny pour, but at this point I'm over it. I've been waiting 10-15 minutes and wanted to leave. I walk outside and pick a seat by the window. There was a window washer there washing windows behind me so I move to another table by the other window so he didn't splash water on me. The window washer comes over to me and tells me he's washing these windows. I ask him if this is some kind of joke. I said please let me enjoy my glass of wine for a few minutes and he pauses for a few seconds and then agrees. To top it off there's pieces of cork in my wine."}
{"text":"The meatballs are spectacular. I usually don't get them anywhere because like a typical Italian only my grandmothers will do, but they know what they're doing. The sauce also tastes like it was made with love.  The first time I got the arrabiata pasta and meatballs. It was an appropriate amount of spice for pleasing the masses and a nice portion size. The second time I got the meatball panini with mozzarella. The next time I come in I'm getting the meatballs.   Have I mentioned the meatballs?"}
{"text":"I had lunch here today with a friend. Our lunch came out promptly and the food really hit the spot! The staff was very courteous and attentive and the management was sincerely interested in our satisfaction. I really enjoyed the outdoor seating and will return soon!"}
{"text":"Fidelli's overall feel and wine selection is fabulous! The manager came up to us we chatted about their wine tastings, upcoming live music and other events! Very friendly staff. I would like to see more veggie options on the menu though!"}
{"text":"So good. I had the meatball cone, their signature dish. The cone was made of baked bread. The meatballs were fantastic. I pride myself on my homemade meatballs and I have now been challenged! The cone is filled with meatballs, a great marinara and topped with melted parmigiana cheese.  Served piping hot, you can eat it out of the cone or use the china and silverware provided.  Thursday night is half off wine night and while the selection is limited, there appears to be a number of good choices."}
{"text":"Food was great.  Had a meatball cone and some penne.  Both were on point.  Great new addition to the area.  Will definitely be back."}
{"text":"I LUV THIS PLACE !!! I came here because there is a free Kizomba class on some Fridays. I ended up joining their class. I loved the chicken pesto and the meatball cone. It is well priced and a very clean place. Owner and staff are friendly and guide you and I always ask them to suggest the wine. Good on the budget, stomache and tongue :) I go there every Friday for the kizomba dance and also eat/drink there. Make sure you ask them about parking. They have it but ask them. Try it."}
{"text":"Such a great add to the neighborhood and I like the \"fast casual\" concept for Itallian food!  I'll start with what I did like:  Dining area is really nice.  Not too loud making intimate conversation attainable.  I also liked the wine dispenser.  The manager walked me over to the station and proceeded to show me how to do it.  I didn't have the heart to tell him that I'm a pro when it comes to those things and didn't need to show me, but I let him anyway. I have like 5 different wine cards from 5 different places..LOL    He was extremely nice and friendly so I kept quiet.  Let's talk about that wine selection, shall we??????????  Awesome.  Fantastic.  I dunno just use whatever word for \"amazing\" you want and that's the wine selection.  I'm not THAT knowledgeable when it comes to wine but when I saw that he had a couple of 2012 bottles I almost passed out.  Most \"fast casual\" places (that I've been too) that carry wine, don't have the wine list that they have\".  You can tell they're wine drinkers and know a lot about wine.  *slow clap* for the Wine list.     What I think could be better:  Now this isn't saying that what I ordered was bad, but I just could have done without it.  I ordered the Power Goddess salad with Chicken and at first bite I thought \"is that tuna\" because it tasted like canned tuna.  So I THINK (I'm soooo not claiming and I could totally be wrong) it tasted as if they put canned chicken on my salad and not fresh chicken breast.  I could be wrong though ...again.  Other than that, it was a good sized salad and price was only $9 so that's a plus.  I should have tried the meatball cone thing that everyone likes!  Next time I go, I'll try that because it did look delicious!  The only other thing I didn't like was the rolling chairs.  The flooring is a hard, smooth surface and the chairs had wheels on them.  I found it hard to keep still and I had to use my core to not roll around so much.  I guess that wouldn't be a bad thing.  You'd get a workout in...lol.  It's a great spot with good food and a great price point!  Again...slow clap for that wine list...it's amazing!!"}
{"text":"I tried the Italian wedding soup today and it was delicious!!!  Looking forward to trying other dishes.  Super curious about the wine on tap!!"}
{"text":"I have been here twice now and must say, I really enjoy the meatballs and the marinara sauce.  I am picky about my Italian food and this is a big hit for me, considering it's almost like fast food.  The meatball cone is my go to, it has penne pasta and veggies in it.  I like it minus the veggies.  Today they told me that it is no longer coming with pasta, which totally does not make since.  I guess you have to ask for it special?? Who knows...but I think that's a bad move. The pasta is what makes it.   The service is fast and friendly. You order your food, take a number, and try bring it out.  Complimentary cucumber water, regular water, sweet and unsweetened tea.  Wine and beer also available. Plus a small wine shop in the back to purchase a bottle."}
{"text":"The service is amazing so is the food! Megan is so sweet and so was the manager and all of the staff. They were extremely helpful and made Natalie and another server, was sweet checking on me and gave me some good recommendations to try with my Chicken pesto panni. Megan was the best, she sat down and talked to me and made me feel really comfortable. Brian from the beginning was awesome. I thought I lost my card and when I came back he made sure I was okay and found it. Everyone is awesome. I'm definitely coming back!"}
{"text":"I have been excited to try this place and my thoughts are- it's okay. If I were just rating on service, I would give it five stars. Everyone was so nice and friendly. The vibe was cool and food was brought out quickly. I didn't try any wine but would love to try some next time. I know someone said in their review that they didn't like the roller chairs, but I wasn't bothered by it. They were comfortable.   So why the average three stars? To me, the food was just okay. My fiancé and I shared the caesar salad and we both thought it was good. My fiancé had the meatballs in the bread cone. He felt like the bread didn't have enough flavor and I thought it was kinda weird that there was penne inside of the cone with the meatballs. I had the build your own pasta and I definitely thought the meatballs were tasty but found the sauces to be average.   Overall, I thought this place was okay. I'm sure we will venture back at some point but I'm not in any major hurry."}
{"text":"Came here for the $5 wine tastings o. Tuesdays 6:30pm-7:30pm.  Really fun trying new wines and learning about my wine taste buds .  The meatball breadcone is amazing!  Thursdays 1/2 glasses and live music. Ashley was very informative on explaining wines and their tastes and the wine making process"}
{"text":"The bread cones are awesome! The Tuscan BBQ cone wasn't quite as good as the meatball cone which was absolutely delicious. Service was fast and the food was delicious! I can't wait to go back and try the other cones on the menu."}
{"text":"Stopped in for a wine tasting. Love that and that you get a glass of wine with what you pay for the tasting. Not sure I am in love with the food. It could be great but felt a little like fast food for me."}
{"text":"Quite literally the worst dining experience I've ever had. I was really excited to try this place. It had been on my list for a long time and I finally took a group of friends and headed over. For a casual dining atmosphere, we were really surprised that it took us about 25 minutes just to order at the counter. We probably should have just left at that point since clearly something was wrong. But then the night just got worse. We waited 90 minutes and NEVER got our food!!!! We went up there twice to check on it and the second time they said they hadn't started cooking it and it had already been 90 minutes. Plus we kept seeing other customers come back up saying their food was wrong. No way in hell were we going to wait another half hour just to get the wrong entree. This was literally absurd by any restaurant standards but even worse for a casual dining restaurant where we should have gotten our food in a reasonable timeframe. We got our refunds and it was close to 11 at this point and we were all just pissed and starving."}
{"text":"I have been here twice and both times I have been rushed through the order line and never asked about drinks or how the wine system works. Before I could even ask for a drink the waiter was already telling me how much to pay. Overall confusing atmosphere with sub par food."}
{"text":"If I could give this zero stars I would. Came here on a Friday night with 3 other people, we waited 45 minutes for our food and went and asked for an eta, we're told 5 minutes. After we'd been there for an hour and a half we finally went and checked and our food hadn't even been started and they were closing down the kitchen. We never ended up never getting our food and had to get refunds. Many other customers in the building that we spoke to had a similar experience. Will not be eating here again."}
