{"text":"This place is the go-to fast food joint that is economical, and fantastic food every time.  I would have given it a 5 but the restaurant has a very casual bland dining area."}
{"text":"Thank goodness for yelp!!! Had the carna asada it was superb! Great staff and fantastic burrito!"}
{"text":"Lives up to the local fuss. Quick, cheap, tasty and one of the few fast Mexican food restaurants that utilize yellow cheese, which is my cardinal rule of good Mexican food."}
{"text":"Mmmm nothing better than a late night Filly-B run! Had three shredded beef tacos. High Quality with all of the ingredients that you love is what you get here!   I know they are bad for me but they taste so good..nom..nom..nom.."}
{"text":"Pollo asado (that's grilled chicken, whitey) burritos and quesadillas were bigger and better than i expected from AZ. You guys might want to check the kitchen staff for their papers, cuz the flavors were too good to be legal...someone here needs to be deported."}
{"text":"I have went to this location and the customer service is terrible.  The food is not bad but the people are very rude.  They got my order completly wrong,   forgot part of my order.  So with part of my order I drove back.  Asked the manager to give me the burritos that I asked for and to remake my order cause the food I had was going to be cold by the time I got home She refused.  So I paid for a part order and cold food that I had to heat up once I got home.  Wow!!!!!!!!!!!!!!  I won't be back....  My advice check your order before you leave.  Don't expect managment to try to make you happy.  The manager was a woman.  I would say lady but she didn't act like one."}
{"text":"This particular fili b's is terrible. Right across the street is vaqueros it has a nearly identical menu except they don't put garbage in the food."}
{"text":"I was a regular customer for years. .I ordered the beef burrito the last two times. Both time there was a HUMAN HAIR in the burrito. Needles to say I got sick the last time and will never be back again!"}
{"text":"Woke up at 5 am craving a burrito and came here since it is open 24 hrs.  The place was clean and the staff was very quick, friendly and knew what they where doing and doing it well. Had the steak and egg breakfast burrito and it was awesome!  This is my new favorite spot to eat!"}
{"text":"First let me say I'm a huge fan of Filiberto's, however yesterday was my first time going to this location. The cashier never gave or asked if I'd like a reciept or told me the total,, but I thought nothing of it. When I arrived at home I looked up my order, on the online menu (Carne Asada fries & a cheese quesadilla) $8.50+$4.50=$13.00+tax. I was charged $19.56, which my bank app can verify. I called the store and asked to speak to a manager, after a long wait he picked up saying \"What?\". When I explained the situation, his response was \"Forget you, followed by more obscenities. Needless to say, Filiberto's has forever lost my business and respect. I will be seeking legal counsel."}
{"text":"What can I say about Filibertos that others haven't said? Not much...except it's amazing food...I used to think that any Mexican food establishment that ended with a Berto of some kind was good, but clearly those places are just grasping at straws when they start to mimic Filibertos. Filibertos not only helps you with hunger pains, but it is still possible to feed a family of 3 for under $20."}
{"text":"This location is average, not as good as the one in Gilbert. I ordered the Carne Asada taco, it's was good and lots of meat! They offer special everyday and so I added the Mondays \"meal deal\" of 3 rolled tacos with cheese. They offer only two salsas at their small little bar- a red ( it's ok) and a green ( not much flavor to it). At the other location I've been to they have a few more options for salas and the thick green one is the best!! I missed that here! They do offer radish & cucumber slices at no additional charge. Restaurant could use a good cleaning and someone on patrol with a fly swatter, but again it was just average."}
{"text":"I used to eat at Filibertos when I would go out drinking with friends or when I come back to visit. They were shut down years ago for serving dog and cat meat, but now serve beef and it is plastered all over the restaurant that they serve certified angus beef :).   I always get the same thing and love it every time. I order 3 shredded beef tacos with hot sauce on the side. The beef is juicy and they used to pack it in, but are now stingy with it and it depresses me :(. Their is something about the shredded cheese they use that always has me coming back for more. The bottom of the tacos are extremely greasy, but the tortillas they fry are always crunchy and delicious.   There used to be only 2 in Arizona, but now they have popped up all over the state and it made me realize the quality has decreased. I took my wife here when I visited back home and she LOVED their bean burrito. The burrito was MASSIVE!! They have specials each day and also have taco days where they are only a dollar. These days have caused the meat portion to decrease. You now get more lettuce than beef :(. Still great to try and enjoy :). They hit their prime 10 years ago, but that may have been the cat or dog meat :("}
{"text":"Love this place , they have the best breakfast burritos ( about 5 bucks)  I have ate here at all hours and the food is always good.  Plus it is open 24 hours a day!"}
{"text":"Very good breakfast burritos, Nachos grande are huge and filled with excellent ingredients. More than enough for 2 people. Restaurant atmosphere is a little rough but the good food is worth the lack of atmosphere."}
{"text":"Love Filiberto's. I always make sure to get an Arizona burrito each time I'm in Arizona visiting some cousins."}
{"text":"This is one of the best locations of this chain, consistent quality and service.    On a side note, I should be able to leave a short review on yelp but they keep insisting this is just a note. Issues like this are why I am issuing yelp less often by the day."}
{"text":"I came back to the valley and rediscovered my favorite Mexican take out place. The breakfast burritos are still excellent."}
{"text":"Yesterday morning I ordered a Sausage Burrito through the drive-thru.  The response on the speaker was \"breakfast\"?  I said, \"yes\".  I got home and took a very flimsy (poorly rolled) burrito out of the bag.  It was so \"not full\" I could hardly pick the dang thing up.  I then bit into it only to find it was ham and NOT sausage.  It tasted like an omelet...which I did not want!  I guess they need to hire some gringo's that know how to roll a frickin burrito properly.  And I  paid $6.04 for the bastard child.  Can u say \"No mas\"?"}
{"text":"The food at this location is delicious. I ordered the half order of nachos- it was packed with tons of meat & cheese. They guys working there were very friendly & courteous. The dining area was very clean. :)"}
