{"text":"I went here for lunch one afternoon and will never return. The service was terrible and the food is even worse. Upon entering the place was dead, I guess that should have been a clue to leave. Which we almost did cause no one came out for 10 minutes. We actually opened and closed the door a couple times to set off a buzzer to alert the staff. When we were seated the table was sticky and dirty. There was a horrible dirty smell eminating through the whole area. I actually had to cover my nose at certain points cause it was so bad. It smelt like dirty old musty carpet. Our waitress was rude and never checked in with us once after she brought the food. The steak was so dry and tough it was barely edible. The rice and beans were of poor quality. The cheese was rubbery and gross. The guacamole, if you want to call it that, was like a runny mess with no flavor. We waited 10 plus minutes when we were done for our server and then another 10 minutes for the check and there was only one other couple there! I felt like just leaving between the gross food and bad service. I told the server how bad our meal was and she was just expressionless. Oh was all she had to say. I was just hopeing the rest of the day I wasn't going to get sick. NEVER again will I go here!"}
{"text":"Horrible!!!! The food sucks and now I'm stuck in bed with diarrhea and am vomiting! Felt fine before I ate here then it all went south after eating the nasty tacos and beans and rice. Avoid this place at all costs!"}
{"text":"Burrito Chingon and a Victoria on draft is where its at!! Love this place and love the bar! great food...great beers!!!"}
{"text":"This is the first place I hit up when I come out to the Valley. I still haven't tried anything different on the menu besides the 3 rolled tacos and cheese quesedilla... One day i will, but those quesedilla's are just so delicious!"}
{"text":"Best refried beans i have ever had.  Big fancy restaurants dont even compare to these beans bro...."}
{"text":"We loved it here! Don't let the outside takeout atmosphere scare you, this place is great! We laughed when we read the menu, because so many items were just listed without explanation of what they were.  (And it's one of those funny menus with pictures!)  We ended up ordering the Carne Asada burrito combo, # 14.  Our food came out of the kitchen literally within seconds. The burritos were huge, loaded with fresh ingredients, and absolutely delicious. The waitress was super friendly, and the prices couldn't be beat. Several days later, we went back to a different Filiberto's location for takeout, because we liked it so much the first time. And bonus, the take-out places are open late! 5 stars!!"}
{"text":"Awesome fried tacos shells!! However, the meat and other entrees disappoint. Plus, the service is unacceptable as currently managed.  On 5/5/2016, the waitresses (server ID 0507) neglected to check our table after ordering, tend the bar, or even bring us our food! They made us wait so long for our food that we had to ask if it was even coming. Based on the time it took after asking, we presume they entirely forgot about us, and that was supported in how they delivered tacos with the wrong kind of meat. After all this, the burrito, enchilada, and tacos were particularly tasteless.   Other highlights include forgetting to give us the sour cream we paid 1.50 for, locking the door on customers trying to get in and out, and guacamole that arguably has no taste what so ever.   Love the fried taco shells!!!    Lastly, I was most bother by how they did not honor the certificate I had purchased from restaurant.com even though I had called that very afternoon to confirm it would be valid at their location.   Shame..."}
{"text":"worst mexican food i've ever had. the super nachos were aweful! skip this place."}
{"text":"I have been coming to this particular Filiberto's for a while now and the food and friendly service are consistently top notch. The bar is stocked with good tequila and they usually have something going on like karaoke in the evening to keep things interesting. It fills an interesting niche of taco shop fast food along with a nice bar that I didn't think would gel together but surprisingly does.  Food and drink specials for the most part are also pretty great as well."}
{"text":"Lacks customer service. The lady working the drive thru window barely acknowledged I was there just took my money quickly and she was too busy sucking on her sucker (candy) kind of gross to be handling food. I won't be returning to this location, better off sticking to Los Betos down the road."}
{"text":"Always great quick daily specials.  Perfect for the hot summer when you don't want to cook.  Ask for the carrots and jalapeño's too!"}
{"text":"Horrible. Great place to get diarrhea. Wouldn't eat there again even if the food was free."}
{"text":"I have loved Fili'B's since high school and this one is the best one I have found since the old fav in Mesa by our HS. They make a slightly different red sauce here but it is way better so that makes a difference and there rolled tacos are always good and crunchy just how I like them and I have a pretty low bar with food but rolled tacos are not their best when they get kinda soggy and I like to pick this up after work and its all still good & crunchy by the time I get home. After coming here so often the last few years (literally a few nights a week the last few months as we have put most of our stuff in storage as we move) I can honestly say this is my favorite location. They have made some mistakes like any fast food places but they have always been very friendly even when I point it out & they were always happy to be helpful & wanting to get it right. I've also done some really large orders for family stuff and they were awesome each time even the time I gave them no notice because it was very last min, all the employees have been great & do not even let a silly thing like our language barrier get in the way of good food and service- thanks to everyone who works there :)"}
{"text":"This was the biggest surprise of Mexican food I have had in a long time. Having been in Missouri for the last three years, good quick Mexican is nonexistent. I always crave good Mexican that isn't overpriced and dripping with grease.   Let's start with the best part. This was the nicest Filiberto's I have ever seen. It is actually the nicest quick Mexican place you will ever see. They have you order for take out up front but it looked like you can sit and have a waiter. There is a full bar, tv's and a huge screen with a video game you could play. None of those is the norm for a Filiberto's.   What was normal was the awesome food and decent prices. I can't ask for anything else. I had a California and my wife had a shrimp burrito. When I asked for more salsa they obliged quickly. I asked for a bunch. Maybe 4 of each is what I said. Then the server brought out at least 5-6 of each type in a bag. Over the top.   I wish I had known about this Filiberto's before. I will come back to this Fili-B's."}
{"text":"The food is great! There is a large selection of Mexican food which will be at your table in very little time. The service is great as well. If you are looking for a delicious meal at a very little price, this is the place. You can order two well-portioned meals for less than fifteen dollars, very nice for those with big appetites. Came here from Florida and this is by far the best restaurant I have eaten at this far!"}
{"text":"Worst filibertos ever. Sure it looks cool cuz it's like a sit down restaurant but they have not ONCE gotten my order right. Several times I've been here and ordered a steak burrito and always end up with bacon- I can't eat pork. This place sucks dick"}
{"text":"They got new tortas ! Milanesa  Pierna Hawaiian Jamon  Mmmmmm awesome ...  And the best cold beer in town"}
{"text":"Horrible. Specified no cheese in my burrito As we are lactose intolerant and it had cheese so I brought it back and waited for them to fix it. Get home to have a completely different order than what I ordered and EVERYTHING was covered in cheese. They wanted me to bring the food back (it's not like they can serve it again!)  and didn't know when the manager would be in. Who doesn't know their managers hours?!? So I had them leave a note with my contact info. Still waiting. Horrible horrible service. Wasted $23 on food my family couldn't eat. What are we supposed to do with a quesadilla?!"}
{"text":"This restaurant obviously isn't owned by the same people as the rest. Their carne asada has absolutely no flavor and is tough. We have tried it about 4 times and yuck. Nothing like the other stores. They need to take the name away from that store."}
{"text":"Filibertos is awesome as always...but I must admit this location came as such random surprise to me...there is no drive-thru to begin. When you walk in you have an arcade to your left, a dinning room to your right and you are greeted by a woman who either seats you or walks you to the counter to give your order...not complaining...just say-in..."}
{"text":"Super gross! I went late, so I assume they thought I was too drunk to taste how disgusting the food was. I got a taco and it was soggy and cold, had more pico than anything else. The nachos were super salty, cold, nasty and full of onions. I was so disappointed in this place.  I will not be giving it a second shot. That's how bad it was. 3 items = $18 way too expensive for the quality."}
{"text":"I've visited this place multiple times with great results. Food was always great... Until last night. I ordered the chicken chimichanga plate. I've ordered it a few times before and was always delicious. This time, however, it was horrible. The chimi only had three chunks of chicken in the entire thing. The rest was overloaded with cheddar cheese and some beans. The sides of rice and beans were so dull in flavor, the only difference between the two was texture. Almost no variation in flavor. I couldn't finish out of disgust. My daughter offered a beef taco she didn't want. Same thing. Almost no beef and an overwhelming amount of cheese.  I don't know if the place changed owner/management, whatever, but no, no, no! I won't eat there again."}
{"text":"The service is soooo sloooow. The Adobada taco was way too salty.  However, after a long night of dancing and drinking, I can't really complain.  The Carne Asada Fries, though, was so YUMMY. I ate nearly the whole thing. The fries was perfectly crispy and crunchy; the carne asada was plentiful and just enough seasoning."}
{"text":"Great find! Great prices and fantastic food and staff!!! Hot, fresh chips and salsa. Super fast service! Definitely coming back!"}
{"text":"It's a sit down taco shop, really. The food is rather average in my opinion. \"Salsas\" (sauces) are sub-par. I've tried the carne asada burrito and it is a bit bland. Great value in their nachos but the taste is nothing to write home about. Overall I like gong to this place Sunday morning with friends to enjoy taco shop food and maybe a beer...just wish the food was tastier"}
{"text":"It a clean new location, with a cool drive-thru. That's about it, I ordered a egg, ham and cheese burrito and it was drenched with like egg juice, yukkkk. So I called to let em know about it, and they wanted me to bring in the burrito?!? Lol, too bad for them, cause they we're busy, & a lot of customers saw that, they inspected it,like Inspector Gadjet.... Who does that??? Anyways I ordered a different burrito, free cause I couldn't get a refund...  I'll stick to my usual, it's a lil further but there food @ Ramiro's is always perfect."}
{"text":"I know what many of you must be thinking -how can a Filly B's have 4.5 stars? Well I'll tell you how, It's not your average Filibertos. There is a hostess when you first walk in.  The bar is on the left.  Yes folks I said a bar! There's a big screen, music, pool table and full service bar! Boom. You sit down at a table, there is a waitress and you are given actual menus.  The staff is so cool, friendly, and humble. Everyone I bring here is surprised its a Filibertos, yet the same good food and low prices as all the other chains.  Foods I would suggest would be the carne asada tacos, nachos, steak ranchero, chorizo con huevos, ceviche, bean & cheese burritos & most importantly the deep fried ice cream.  Can I get an amen? Come down and bring some friends.  Tip- the drive thru is now open but I highly suggest foregoing the drive thru & stepping on in!"}
{"text":"Didn't even know it was here. First location I've seen hidden away like this. So far it's the best/freshest fili b's I've been to."}
{"text":"This is the fourth time that I have visited this location, (only because it is the closest) and every time my order is wrong but I'm charged for what I actually ordered. Unfortunately I am already home and starving when I see that my order is wrong otherwise I would go back. I have tried calling to complain but left on hold until I give up.   Poor staff, poor customer service. I will not be back"}
{"text":"When this Filibertos opened, the burritos were amazingly good and huge! Used to only cost me $8.60 for a burrito and medium coke.  Now for the same meal, it's costing me a little over $10 now and the burritos have considerably shrunk in size compared to what they once were. The quality has also gone down. The prices here are just way too expensive not to justify eating here."}
{"text":"Great food at a great price! Fresh hot chips, delicious salsa. I'll be back for more."}
{"text":"First of all this is not your typical Fili B's!  It is like the Cadillac of late night fast food restaurants!  It has a sit down restaurant, a full laminated menu, a full bar, BIG screen TVs and wait staff!!  Wow!  Now I know this is not 5 star dining, but in the realm of late night/fast food this is a whole other level of greatness which is why I had to give five stars.    The owner happened to be our server and he was extremely friendly and excited about his restaurant and rightfully so!  All the screens had soccer on while I was there, which in my opinion added to the 'ambiance'.  The bar and restaurant were hopping with excited soccer fans!    We ordered the half-order of loaded nachos as an appetizer.  I had the ceviche tostada and carne asada taco for dinner.  My friend had an amazing burrito!  See all the pictures; it all looked and tasted delicious.  The nachos weren't that exciting, but aside from that everything else was done very well and came out fast!  The ceviche came with a huge portions of fish and cabbage and tasted great, which I never in my wildest dreams would have envisioned at a Fili B's!   I had a frozen margarita that they made in house, blended just for me...no margarita machine here.  So yes there was plenty of tequila.  Thank goodness for my good DD friend Nydi!    I don't think I can ever go to a normal Filiberto's again!  Well, ask me at 2am and I may change my tone Hahhah!"}
{"text":"Food was just fine... Not really great. Server was super nice. Kitchen was slow. One plate at a time for a party of 5 and over 5 minutes. It wasn't crowded at all either. In fact, we were the only table there. Won't be coming back."}
{"text":"By far the worst filiburtos I've ever been to (and I've been to MANY) Unfortunately it's the closest one I live to and its only walking distance away. I've tried thier food, at this location, more than once and giving them more than enough chance . The potatoes are never cooked in the breakfast burritos and are always hard. Every time I order a meal the ingredients are never right. I've been there a handful of times and everytime my experience has been horrible.... idk why they ask what sauce u want at the drive thru. EVERYTIME they give u 1 green 1 red no matter what u request.The breakfast burrito I just threw away 5 minutes ago will be my last purchased from there."}
{"text":"Probably the worst filli b's I have ever gone to. I live near by so I gave it a couple chances. This food taste like dog food and their service is even worse than their food. I like the chain and I will go to a different location but I won't EVER go back to this location!"}
{"text":"Love the Burrito , Cheese is good too . Mexican food is awesome .... salsa is super spicy and verde mixed with with Rojo is yummy mc yum yam yUuuuuuuuuum!!!"}
{"text":"$1 burritos on wednesdays. It's the spot to go that day. The burritos are huge and for only one buck? You really cant go wrong. They have other cool deals throughout the week but that's my favorite. Good food at really great prices! If you're in the mood for mexican this spot is way better and more authenic than taco bell! Worth a try. Get the green hot sauce. Their red sauce is no good. They have a drive thru and are open late!"}
{"text":"I ordered a chorizo and eggs burrito through their drive-through. When I got home to eat my breakfast burrito there was almost NO CHORIZO in the burrito! I paid $5.00 for 99% egg and a little chorizo color and a few small bits. The last time I went there and ordered a breakfast burrito they left egg shell in the burrito. I will not go back to this place!!! Dirty dining and a rip off with the chorizo! DO NOT GO THERE... there are many better places in Scottsdale for a good quick breakfast. I will post a picture too of my burrito......"}
{"text":"Horrible horrible service. Takes forever to take order if you sit inside. Employees disappear when it's time to pay check. Have had his happen on multiple occasion. Drive through is ridiculous as well. Can't ask for more than 2 sauces per order. If you do they will make a big deal about how the plastic cups the sauce comes in is too expensive. The red sauce tastes rancid anyways. Just save your time and go to super burrito."}
{"text":"Walked in (you should too) and its a full very cool bar AND restaurant. Instead of using the drive thru, came inside and order ToGo... AND A BEER! Awesome"}
{"text":"Nicely decorated.  Have hesitated to go in for several winters.  We are snowbirds.  So glad we finally did.  Extremely good burrito and the Green Chilli Pork with beans was perfect.  Will go again.  Good beer and Margarita as well."}
{"text":"Food is good service in drive thru is fast. You ask for extra hot sauce and they give you two packs total??? Making the drive to a better next time."}
{"text":"I'm a sucker for Filiberto's and I love having one open so close to home. The food is delicious, portions are big, and the price is beyond affordable."}
{"text":"Taco Tuesday was always a treat and the service at the bar was always great.  Thanks for being around the corner from where I used to live and making it way to easy to walk there."}
{"text":"My husband and I came here around 1130 pm on a Wednesday night via drive through. We decided to stray from our normal Mexican joint and try somewhere new which I found was a big mistake later on. We ordered an enchilada plate, 2 taco plate, one chile relleno, and one bean cheese burrito (yes, I was hungry and wanted to try everything). We figured we had to wait a while for all that food but surprisingly it came out really fast and smelled yummy. THE FOOD WAS SO DISAPPOINTING. Everything I tasted was cold except the refried beans and I think that was because it was already cooking in a pot, I see why it came out so fast. I've tasted better enchiladas, the cheese was not melted inside and tasted like those packets of shredded cheese that they sell at the markets, which was so disappointing. The only thing yummy was the tacos that my husband ordered. I was so looking forward to my alcohol with Mexican food at home and that just went down the drain. It upsets me when my food doesn't taste good especially when looking forward to it. Never again."}
{"text":"We were In town and stopped here for breakfast. My wife tries the Menudo and I had the machaca. The food was great, authentic and good salsa too. We were extremely happy with the food and would come back again next time we are in town."}
{"text":"Never again!  Went through the drive through. There was a language barrier between the lady who was taking my order and I. I asked nicely, if there was anyone available that spoke English. Another lady who spoke perfect English took my order. I even asked her to repeat it back to me. However, when I got home, the only thing that I had, that I ordered, was beans and rice. It was so upsetting.   I don't live close to the restaurant. So, my daughter and I attempted to eat the dinners they gave us. It was terrible. Both meals went into the trash. I really believe they gave us the wrong meals on purpose. I asked for a chicken chimichanga, no sour cream and guacamole. The lady repeated that back. However, what I got was a beef chimichanga drowned in both sour cream and guacamole. My daughter and I had no idea what her meal was even though what she ordered was a chicken quesidilla."}
{"text":"Oh man...I wish my phone wasn't dead.  I could go to the drive thru anytime as I peered in and the kitchen was clean.  Extremely efficient after we ordered, food was up real quick.  But I just can't talk about that.  Walked into the men's room, for a moment I thought I was pissing on the floor but I'd heard a sound.  However, that was not the case, rounds were on targets.  I looked down and I was standing in some type of liquid, probably a mixture of urine and water.  When I flushed the urinal it didn't spit everywhere so they obviously hadn't been in the bathroom to clean all day and was left over from the football games earlier in the day.  Gonna be hard to come back inside this location."}
{"text":"The Scottsdale version of Filiberto's. A real restaurant, with the same Berot's menu and prices, plus a bar. What's not to like. It's not 5 star, but it's a solid 4 star."}
{"text":"2nd best filabertos I been to (or same spot different Berto prefix) in United States. Very clean, quality cooking on combos and menudo here is on point! They seem to take their time here. You shod take care this serious since I spent precious life minutes on a review of a (prefix)Berto. Not five stars since it is just Mexican fast food"}
{"text":"Quick cheap Mexican food. Good portions for the money."}
{"text":"This place is good.  They have specials every day on beer and food.  Tacos are awesome.  Fajita's are stellar, and loaded to the max with meat.  Staff is friendly and cordial.  Definitely my new favorite place!  Prices rock."}
{"text":"I love burritos! Lengua burritos!  This is the drive-thru review.  We bought a whole lot of food.  Adobada and lengua burritos, cheese quesadillas, fish tacos,  chicken tacos, carne asada tacos and carnitas tacos.    I ordered the two carne asada burritos combo which I then changed to adobada and lengua.  I gave the beans and rice from the combo to my kids since I wanted to finish both burritos.   I've never had adobada before. It must be a southern US Mexican thing like carne asada fries. It had a nice mild kick and a red chili heavy flavor that coated the meat. I was hooked and I tore into that burrito.  The lengua was mildly salted and had a slight crisp.  It wasn't as good as the adobada but I still enjoyed it.   Next time I'm down in AZ, I'll have to stop by to get more burritos."}
{"text":"I like to come here every Sunday with my two bros after blacking out the night before. They know us a regulars but we always look like absolute garbage when we are here. They are okay with it though. We talk about our night and make fun of who was the biggest idiot the night before. Usually me but Taylor gives me a run for my money. Get the steak rancheros burrito. It's a hangover cure even in God's eyes."}
{"text":"I guess I was in the minority of people who believed Caldero, the former occupant of the building, was the next best thing to sliced bread.  Actually I hate sliced bread.  Bad analogy.  Not realizing they had closed, I contemplated my order as I approached the front door.  But wait?  What's that?  A new sign caught my eye.  Filiberto's Mexican Food AND Bar?  When did FiliB  move in and when did he start serving alcohol?  Crushed and confused, we went in.  It's not that I don't like FiliB.  He's great for a quick drive-thru.  But what's he doing in this spot?  Well, he's suffering from an identity crisis apparently.  A hostess seated us.  Yep, a HOSTESS!  And brought menus.  But they're just folded carry-out paper menus.  Not the real deal.  Then she took our order.  Yep, TOOK OUR ORDER!  My husband was served his Micheleda in a glass mug, yet my Coke was reduced to a paper cup.  We ordered chips & salsa.  Remember, this is the same FiliB dirt cheap prices, so expect to pay for them.  The server never brought them.  Our meals were served on actual breakable plates.  Yet the utensils (NOT PLASTIC) were placed with care on these itty bitty pathetic excuses for napkins-the kind that usually sit in a dispenser.  The food was the same as any FiliB.  I ordered a green chile burro enchilada style, and foolishly expected enchilada sauce.  It had a pork green chile sauce over it instead.  No real complaints, but in my opinion, it should be either table-service or a fast-food place, not this weird hybrid of the two.  I'm more inclined to visit FiliB at a drive-thru location and go elsewhere for a nicer sit-down meal.  However, if you think I was confused, you should have seen the folks who came in after us expecting to walk up to a counter to order.  If you come in, which you must because there is no drive-thru, you will order at the hostess station and wait...wherever you want I guess.  But you can have a margarita while you do."}
{"text":"Was there tonight, they simply were not making any food  They took everyone's money, but were complete jerks if you asked when your food would be ready.  So, you cannot handle Cinco De Mayo?  Too bad, I will never go to this place again, all I ordered was 2 burritos, I waited over 1 1/2 hours and finally cancelled the order.  How long does it take to make 2 burritos?"}
{"text":"I've been back to this location and am very pleased. The people behind the counter are very nice the food was fantastic and about those onions...if you specify you want them chopped, you get them chopped! The salsa bar was nice and clean with plenty of choices, I did not order the Enchilada this time but the Burrito's and Quesadilla I ordered were delicious & my to go order packed just right."}
{"text":"Every time I come to this Filiberto's wether it's late at night or mid day the service always sucks or they mess up a simple order every time. I get the same thing all the time. 5 rolled tacos with the guacamole on the side and a large horchata. But it seems to get messed up every single time. How, you ask? Well it seems like if I say guacamole on the side they some how hear cheese on the side or hey maybe they don't put cheese on top at all.  This would be all fine and dandy but they never seem to care to try to fix the problem or even acknowledge that they messed up. Customer service is all I want. I continue to give this Fili B's a shot but I think I'll take my business down the street to Señor Taco from now on."}
{"text":"Was craving street tacos so finally went to try theirs and OMG. THE BEST TACOS I'VE HAD IN A LONG TIME! Gave me a huge plate with fresh Carne asada and onions. Even my boyfriends burrito was great. Plus they are always so sweet and polite even late at night. This place is soooo underrated! Love it"}
{"text":"Their chicken is amazing! That's my favorite thing. Not spicy at all, but it comes in a red sauce. Yum!"}
{"text":"I'm confused by all the high ratings.  I've had plenty of good Mexican while in and around Phoenix but this was definitely on the low end.   I did find out after from some locals this is more the end of night drunk food stop.  Eh well."}
{"text":"first off, when i pulled to the drive through the man was very rude and was trying to rush me and couldn't understand my order which was carne asada fries, but with chorizo instead of carne which is cheaper but they said it was gonna cost more to exchange. then after i get my order i request a few extra green sauces and the man says it's extra which no other mexican restaurants do that, and instead he said he can exchange the two red he gave me for two green, smh. then when i got home i looked at my order and the fries were fried way too long and were drenched in grease, i mean i've had this order before and never had it with so much oil. the oder ended up costing me almost 13 bucks just for some chorizo fries with extra guacamole. this place is bs, and i'm not a very picky person either and never write reviews but this place is crap, and they're not open 24 hrs like the rest of them. i suggest places lke juliobertos, or any other place other than filibertos. i went to another location recently and added extras to my borrito and it was still tiny portions. the chain used to be great, but greed set's in eventually and they cut back, but raise their prices, i mean every other place is atleast a dollar to two dollars cheaper on each item and give you big portions. i'll never eat at any filiberto's establishments again. too much money and effort for some over priced half assed mexican food."}
{"text":"If I told you there was a Filiberto's in the valley that was a restaurant that had a bar,,,would you believe me?  I'm hoping you won't and won't wonder over to this Filiberto's haha.  But that's exactly what this is! It's a Filiberto's restaurant! Say WHAT??? I found this lovely gem thanks to Lisa E when she was in the valley, a few us had met up for dinner.  It's the same menu as one of the many Filiberto's we have in the valley, this night I was in the mood for rolled tacos, so that's what I ordered,  rolled tacos (or as I call them taquitos) with guac & cheese! Perfectly cooked and not too crunchy and def hit the spot!  We were a nice sized party and service was good, and they didn't even mind if we all had separate checks. Look forward to trying them again!"}
{"text":"Let's start off by saying this joint is not your typical Filiberto's. It's an actual come in and sit down restaurant with a bar! How crazy is that..... I'm assuming some crazy mariachi music is playing on the weekends and this place gets Vida Loco! I don't have much to say really. It was empty because it was a Monday morning but the place was clean. The waitress was pleasant and checked on us a decent amount of times. I ordered my 2 Filiberto favorites - horchata and a carne Asada burro. Everything in it plus bacon, cheese and sour cream. I know.....that sounds freaking awesome! Horchata was decent, I've had better but this was way better than most. Now the burro-imagine a small child delivered to your plate. This burrito was huge and well worth the $$. Filled with everything I requested. There's only 1 Fili B's in chandler that does it right like this location does. So next time I need my Mexican fix in Scottsdale ill be making a pit stop here."}
{"text":"I've been looking for a basic Mexican go to since moving to Phoenix and I think I finally found it.   It was a Sunday night so it was pretty dead. The decor was interesting for a Mexican restaurant - leather booths. There's a large bar inside and a decent number of TVs and a big Movie screen (playing Scarface while we were there). The staff was very friendly.  Everything was pretty cheap. We ordered the chips and salsa (costs extra, but the prices of the dishes make up for it). The house salsa is pretty good and has some heat. The chips are freshly fried.  They have Modelo on draft, which I've never seen before (but I'm from the Midwest). There's also a $3.00 draft special every night. Margaritas are also pretty reasonable, I think around $5.00 but I didn't try one. We got the chimichanga, pollo asada, and a jalapeno cheese tamale. Everything came out (disturbingly) fast as it does for most Mexican places. Again, everything was decent.  Can't really beat the price, atmosphere, and friendly staff."}
{"text":"Best tacos in Scottsdale , everything on the menu is great. Service is excellent , and prices are very low. Always treated very well there . And they have a fill bar."}
{"text":"Can't go wrong with a carne asada torta  and 5 rolled tacos!   Quick, cheap and tasty!"}
{"text":"There are about 3 different Filiberto's locations that I go to in the Phoenix area and I always get the Carne Asada fries. I have never been disappointed with my food.   At this location, the fries are crinkle-cut fries, which was unusual but still very delicious, I actually liked it a lot more because the fries were softer. If you really like guac, I would recommend getting extra because they're usually pretty stingy with it."}
{"text":"Looooooove the burritos with potatoes! Get a Mexican coke! My girlfriend always gets the Chicharrones. Definitely her favorite thing!!"}
{"text":"Drove through here one night while staying at a nearby hotel.  I love that this location has a drive thru, but the food fell short for me.  It was also a bit expensive for what was ordered.  I honestly could've gone to Taco Bell and received a better meal for half the price.  I just wanted a simple bean burrito and it was horrible.  The beans were incredibly bland and also burnt in places.  Yuck.  I did give an extra star because of the convenience of the drive thru and because my daughter enjoyed her quesadilla. Not much of a chance that I'll return but maybe others will have better luck..."}
{"text":"This is the nicest Filibertos I've ever been to. It's newly remodeled and is always very clean. It's also the only Filibertos with a full bar, and a damn nice one at that!"}
{"text":"I went to buy 3 menudo bowls, the menudo top lids melted all over my pass seat. I went back to let the register girl know she said it's your fault, not even I'm sorry or what can we do to help. She said it's your fault and what do you want me to do. I asked to speak to the owner she said he isn't here she said here is his #  she wrote it on my receipt. I called it when I left and it was the wrong number. Well I had a bad experience,"}
{"text":"This location is horrible!! Everyone I know agrees, this is the worst location out of all of them we have been too. I have given it multiple chances and they never improve. I don't know if it's the cooks or what but they need to make some serious changes. Last week they gave me BURNT taco shells & today their cheese taste old and had freezer burn.. won't be returning here ever!"}
{"text":"For the price, Filiberto's gets 4 stars from me! The only thing I can eat here is the veggie burrito, but you'll never catch me complaining. It's a humongous tortilla stuffed with refried beans, rice, onion, and guacamole (maybe this varies by location, because sometimes I get it and sometimes I don't).   It's super satisfying for my wallet and my belly.   Side note: the refried beans are lard-free so that makes this burrito vegan. Weeeeeeeee!"}
{"text":"Nice clean new location... food not the best. lots of cheap products. This is the second location I have been to... They keep serving enchiladas rolled in cold cheese drowning in a salty sauce... and too much lettuce...."}
{"text":"I've always appreciated Filiberto's for a late night taco or burrito, but this location delivers exceptional quality. Also just tried their fajitas and I'm surprised to say they are the best I've ever had... And half the price most Mexican sit down restaurants!"}
{"text":"They sure went downhill fast!  Don't waste your time or money on this hell hole!  This update is based on several more visits...the last of which was about 6 mos. ago.  They were rude and had few items on the menu available, and the rolled tacos were hard as a rock due to overheating in microwave!   #disgusting #noservice"}
{"text":"Never been in any Filibertos before so this was my first time experience. I ordered the rolled tacos and the Horchata. It was delicious. From the beans, rice, tacos, salsa and Horchata. Everything tasted great. I'll be back. Thanks."}
{"text":"Monday rolled tacos are the best!! And the price is right. The restaurant is always clean, they offer complimentary wifi and drink refills, and the wait is never very long to get our order. My food has always been excellent!"}
{"text":"Stopped by in the drive-thru Friday night after the casino. We ordered super nachos, 2 carne asada burritos, and a horchata. They were VERY friendly and quick without food. However, there seemed to be something wrong with the horchata drink. It tasted watered down and not good at all. We ended up trying to drink it and then threw it away. I heard this is a restaurant themed Filabertos where if you go inside they seat you and one also has the option to order alcohol. I might stop by again if I am in the area but will steer clear of the horchata."}
{"text":"Well. This is a filiberto's....with a bar. A bar does not make the restaurant any better.... Its still fili b's (which is not a good thing). Also, their drinks aremt that cheap and they aren't that good. No real reason to come here."}
{"text":"I often frequent here for lunch, and always get a tasty meal.  It is the same owners of Caldero, but I guess they decided to make it a Filibertos to help bring in more business.  It has all the makings of a nice 'sit down' Mexican restaurant; (great service, delicious ingredients, full bar) but with more than affordable Filibertos pricing.  The owners are a very nice couple who work very hard to make sure eating at their restaurant is an enjoyable experience.   On my last visit I was speaking with the staff and they told me they will be getting a drive-thru in a month or so.  If you are in the area, stop by you won't be disappointed."}
{"text":"Here's a tip, don't eat here. The food was bland and cold. The cheese in the cheese enchilada wasn't even melted. It was a tortilla full of cold shredded cheese. Also, the refried beans were awful -- I've had instant refried beans that held their consistency better.  We waited 20 minutes for this \"food\", and there were only three other occupied tables.  Also, this is the only place I've ever been to that when you order \"chips and salsa\" puts the salsa ON the chips. If you can call it salsa -- chopped tomato and onion with cilantro barely even qualifies as Pico de gallo, it sure as hell isn't salsa. But thanks for making my chips soggy.  This is the first Filiberto's I've been to. I'll try another just to rule out one pathetic location. But I'm never going back to this one."}
{"text":"Not your average Filiberto's that's for sure. It's almost like dining at a real restaurant. Though the Latina waitress is beautiful."}
{"text":"Near my lady's house so I've been twice recently. First time we ate in and it was pretty good but took forever to get our burritos. Two days later I craved it again and went back. First of all the phone number is WRONG so I couldn't order ahead, so I went in. They have me a punch card for a free burrito but this time the carne asada was too stringy and also a little cold. Meh. I will be back."}
