{"text":"Although Filisophy is a local business for me and I love support local buisnesses, I still recommend it everyone. It's quite small, with about 6 small tables - 3 at the window and 3 along the side. Although seating is limited, you can still come to study during the day. But you may want to come by yourself as one table will barely hold your drink and laptop. There is also free wifi that is strong should you need it. Or you can come and catch up with a friend over coffee and Greek pastries.   Now, the best part - food and drink! I ordered a coconut latte to drink. Wow - the balance between the milk and espresso was perfectly unexpected. To accompany it, I had a ratatouille quiche for lunch - a great vegan option. Even thought it's vegan, the crust had a buttery texture and the spices and flavour of the spices used in the veggie filling was absolutely delicious. Definitely a strong garlic flavour so beware if you're not a garlic fan!   I hung out for a couple of hours studying so I ended up getting a Wanda's Pie in the Sky \"hermit\" cookie. Another good (more affordable) vegan option. Soft, subtly sweet and full of texture from the raisins and nuts.   They are known for their filo pastries and you can't come here without getting it something filo. You won't regret it."}
{"text":"We had an amazing experience at this wonderful Greek inspired coffee bar along Bloor St West.    There's no need to head to the Danforth if you live in the area. They bake an excellent selection in store of fresh Greek pies including stalwarts like tyropita, spanakopita and bougatsa. We tried a small box of the baklava bites and highly recommend them if you want something sweeter!   The owner was there and took his time to answer any questions we had about the products they serve. He's very passionate and came around to ask if we'd enjoyed everything, which was an amazing touch!   They go beyond the Greek with an excellent selection of desserts, more varied then what you'd find at other coffee bars, to ensure that you'll find something to enjoy.    Lastly, they have an array of coffees including lattes, espressos, cappuccinos and americanos, but they serve Propeller coffee which we love so we had a couple to go.   Next time you're in the area, try Filosophy, you won't be disappointed!!"}
{"text":"Amazing find in west end neighbourhood.  Great layout, cozy atmosphere.  Seating is limited but if you are lucky to get a seat, the visit will be worthwhile.  Staff is very friendly. Coffee is great...local roasters and all.  A refreshing selection of pastries.  Greek-inspired treats along with traditional goodies.  Will be back!"}
{"text":"Excellent addition to the Bloorcourt area.  Friendly and welcoming staff. Power outlets at each table (seating is very limited, though). They make amazing almond milk lattes and cappuccino's (only 2 hot drinks I've had). I'm not sure who does their baking, but the spinach pie, cheese pie & breakfast croissants are awesome - the sweet pastries are great as well (can't remember the names of the 2 I've tried). It's a quiet atmosphere, although, it can get a little crowded at times (it's a small place - mostly people taking out, as their limited seating is always taken). I come here to study Japanese without feeling any distractions.   My wife and I will be a regulars here for sure. Check it out!"}
{"text":"Disappointing. Nice looking baked goods but the place had a weird vibe/ambience. The speakers were poor quality and the staff working that day had the most atrocious taste in music. I'm not knocking the food or drinks here, I'm indifferent to those but the feel of this place is all wrong."}
{"text":"This cozy cafe by Ossington station was a lovely treat! The drink menu is concise and easy to read and there were so many desserts to choose from. The way they display the desserts are also on different types of cake stands and dishes with domes and jars which I thought was a thoughtful appetizing touch. The baristas were very helpful in suggesting drink catered to my personal liking and I had the greek honey pastry (like loukoumades but in churro form) and it was pretty good. The only downside I guess is the size of the cafe which only has about 10 seating max and if you come during busy hours then you might not be able to get a seat. But when you're in the area, go check it out!"}
