{"text":"This was the absolute best Caribbean food I've had...and trust me, I've had a lot!  The restaurant is very clean, near, and well organized .  The owner is very friendly and engaging.  He was happy to provide samples and even offered to prepare plantains if I had a few minutes to spare.    I know that I will be a regular here.  I had the curry chicken (full of flavor and meat fell off the bone), cabbage (flavorful and fresh!), and rice and peas (so moist).  I also sampled the macaroni and cheese.  I know you will enjoy this restaurant as much as I did."}
{"text":"I went here with my husband and daughter for my birthday because I wanted some jerk chicken. Reviews were pretty good, so we gave it a chance. The food here was awesome! My husband isn't a big fan of Caribbean food, but the jerk won him over! I was impressed with the sides and my daughter's curry chicken, also."}
{"text":"The chicken was tender however the jerk sauce was terrible. If the sauce wasnt watered down aka runny, i would have given it five stars. The rice and peas and macaroni and cheese was good"}
{"text":"I love supporting black businesses .. Location was ok . Place was very clean . Their cupcakes where Amazing!! Only reason it's getting 3 stars is because their food had absolutely no flavor .. Like it didn't taste like Jamaican food"}
{"text":"1st time coming and the food was GREAT! Mac n cheese, curry goat, jerk chicken, rice and peas, plantin and cabbage.the jerk wasnt that spicy(i think its bc of the sauce they put on it) but it had great flavor, the curry goat had the perfect spice kick to it and the only thing im disapointed in is that i couldnt get more mac and cheese bc they ran out. Ill def. Be going back soon."}
{"text":"Dont drive by without stopping.  Support Kevin and the lovely crew running this great, much-needed place.  Daily specials, one of very few places you can walk in and walk out of.  I second the jerk chicken and chicken curry. The warm fried things in the window mmmmmmm.  Cash only."}
{"text":"Food was really good. Love how its really clean. We got the jerk chicken and a beef patty.  Definitely would recommend it."}
{"text":"Wow.  Best Caribbean I've had since I left DC.  Coco bread on point.  Beef Patty on point.  Stick that Patty in the Coco bread like you know you should.  Oxtails are *flame emoji*  Gotta come back to try the plantains and the Spanish Moss."}
{"text":"The best Jamaican food that I have tasted so far in Charlotte. I ordered the jerk chicken, rice and peas, cabbage, and Mac n cheese. All of it was finga lickin good. The chicken is actually grilled and not baked like most places I've been to in town. Lastly I received great service and recommend you this spot if you want some great Caribbean food."}
{"text":"This place is the truth! In Charlotte area on business, I had strong cravings for some Caribbean cuisine. Discovered this spot using Yelp and noted Salt Fish and Ackee on the menu. Delicious fails to describe how good the food was. The dishes are mostly prepared fresh but well worth the wait. Patronize and support this business."}
{"text":"Their food is delicious!  I had a beef patty, jerk chicken with rice and peas and Mac n cheese.  The DH had the same except he got the curry chicken.  He enjoyed his meal too.  The jerk chicken was cooked over the grill and was spicy as advertised.  I figured a Caribbean spot wouldn't have good Mac n cheese, but theirs is on point.  I hear their red velvet cupcakes are scrumptious, they were out of them the day I came in.  My only regret is that we didn't order more beef patties; they were so good.  We'll be back!"}
{"text":"We just ordered for pickup today and this food was amazing! We both ordered the spicey jerk chicken meal, large with macaroni and cabbage sides. The portions were spot on for the price and the spice was perfect. My only recommendation would be a new Mac n cheese recipe that has a creamier consistency. The macaroni while good was a bit grainy and I think could use improvement.   The service was friendly and they cook this outside on a pit that smells like heaven - very authentic.   The cabbage was delicious and you can tell they know what their doing - spices were spot on!   We will return when we get that hankering for Caribbean jerk chicken!"}
{"text":"Great selection of flavors from the islands.  Ox tail soup is hard to find around here, but they have it.  The ox tail was very small and wrinkled.  Porridge was too hot.  Parking lot is small."}
{"text":"A hidden gem in the city.  Great customer and the jerk chicken was very good.  If you like spice you will like this. A snack size container, I was full, cost $5 + tax."}
{"text":"Good and authentic food, ordered the oxtails, cabbage and beef patty and big portions."}
{"text":"It's a simple place more suitable for take out than eating in. 5 stars for food!  Watch out - portions are huge, even small once. I had jerk chicken it came with a side of rice and beans and two more side choices (steamed cabbage, plantains, Mac-n-cheese as options). I got cabbage and plantains, both were perfection. The owner was very friendly.   Why 4 stars not 5?  There is no public bathroom, the inside is too hot, everything is served in to-go boxes."}
{"text":"Today was my first visit!! OMG .. My Trini husband gives them a \"5 Stars ++\" Being from the Caribbean he is critical .. I get it. He absolutely LOVED, LOVED the food. We had an oxtail dinner (melt in your mouth), curry goat, stew chicken and plantain with the regular sides of peas and rice and cabbage. He's happy and satisfied. Ready to try the soups and other dishes."}
{"text":"I love this food. I've ate here a couple times. The only reason it hasn't been more is because it's far from my house and it's a little expensive. Ok..... i find it to b a lot more expensive lol. I'm used to West Indian food being like $10 for a large combo. And this isn't what I've seen at this particular spot. But i won't stop eating here because it's soooooooo good  I'd spend my last to eat here  I'd dip into my rent money to eat here"}
{"text":"Best Jamaican food! I always get their Oxtails. They provide generous portions and the food is just soooooo delicious. One time I requested a large order - by the time it was delivered we noticed that plantains were missing. Once I called them back the lady I spoke with was apologetic and super helpful by providing us with a portion of our money back since they were out of plantains. This place makes sure they put the customers first!"}
{"text":"Used a delivery serviced to place and order here. I was pleasantly surprised about how good the food was and the portions were pretty big. This may be my new fav Caribbean spot!  My only issue was that plantains we not included in my orders. Oh yeah, we had curry chicken and jerk chicken both were tender and perfectly spiced. The mac & cheese was a 8/10 which is pretty good!"}
{"text":"Best rice and peas that I have had in a while. You can taste the touch of cane sugar they put in. I had some curried goat with it and some fried plantain that was (*gasp*) NOT overripe. I didn't realize how much I enjoyed that until I got some plantains from here. The only thing that I didn't like here was the price. The tray cost $13 or $14 dollars as opposed to the $10 that I'm accustomed to at other spots. Great place to grab some dinner takeout on the way home."}
{"text":"Terrible customer service. My postmates went to pick up my food and told the delivery guy that they gave my food to someone else. They were also being rude to him and wouldn't remake my order. Don't eat here!"}
{"text":"This place was really good. I ordered takeout. I was impressed. They had a great food safety rating when I went there. Got some good Jerk chicken and really good curry goat. I would go back again. The woman working there seemed very friendly as well."}
{"text":"The food was great! I got the jerk chicken and the cabbage. Also the customer services was excellent. We didn't see the sign on the door said cash only and we only had debit cards when it was time to pay. The owner allowed us to take our food with us and go get cash and come back to pay.  Which was very nice."}
{"text":"The food was not as good as some of the reviews said. I ordered the curry chicken and it was very watery and bland! The Mac and cheese was disgusting as well. I will definitely never eat from here again."}
{"text":"Finally came here after driving by on the way home every day, and we're a little mad at ourselves for waiting for so long. We ordered the jerk chicken, rice and beans, fried plantains, Mac and cheese and ox tail. All perfect, no complaints. Plantains cooked to perfection, not a soggy, soppy mess. I'll admit that I'm not very experienced in Caribbean eatery - but this place just has good food."}
{"text":"I kept driving by this place after moving to the area and decided to check it out. I moved to Charlotte a year ago and I haven't found a great Caribbean place and I wanted to really like this place. Especially being from the Caribbean, I know GOOD Caribbean food and I wanted to like this place even more when I met the guy running it. He was super nice and the restaurant is definitely a typical Caribbean restaurant on the inside if that makes sense. It's super clean. When I went I got the Curry chicken, rice and peas, plantains and Mac and cheese. The Mac and cheese was good, not the best I ever had but really good. The plantains were really good but it's hard to mess that up and the rice peas were good. The curry chicken, however, lacked a lot of flavor. There was little \"umph\". It just seemed like the chicken could have used more seasoning and the curry they used was very mild. I will say I may go back and check out other menu items and see if there other items that are a bit better."}
{"text":"The Jerk Chicken was flavourful, but to be honest the price seems a bit high for what you are getting. Rice and Peas were a bit dry but they added extra jerk juices which made it way better. Definitely worth going in for a quick lunch, but not sure I would drive across town for it. Very friendly service and they do to-go!"}
{"text":"Had the jerk chicken and curry chicken. Both were awesome, but the jerk was the winner of the two with its authentically spicy seasoning. Good portions at a good price. You are missing out if you don't give it a shot."}
{"text":"The worst Jamaican food I've ever eaten! And I hardly ever say EVER! I honestly was shocked based on the reviews I saw on here. We ordered through Postmates and the delivery time was normal, about an hour, no complaints there. But the food.. Oxtails- were chewy (over cooked) and had a weird tangy taste? Curry chicken- dry and almost like it was never simmered like curry chicken should be. The gravy was watery and almost non existent  Rice & peas - fluffy but bland Plantains- I was very confused. They weren't fried or baked..kinda in between? Cabbage- unseasoned & bland Mac & cheese- not my fave but the most edible thing we had Red velvet \"cupcake\"- wasn't even a cupcake, it was a muffin! The meal tasted like someone without any experience cooking carribean cuisine gave it a shot. We were truly disappointed! Will not be ordering again."}
