{"text":"If you are not part of the \"in\" crowd, you do not feel welcome here.  Friend of an owner, chef, server...  different story.  The acoustics are terrible, the service very disorganized, table set up strange at best - and the food is not spectacular enough to make you overlook the shortcomings.  The menu is very small - apps are tuna heavy- no salumi, and the rest, limited.  Why?    Gave it a second chance, will not give it a third.  Both times dining there were not pleasant experiences."}
{"text":"Great place overall. The food is delicious; their pizza is oven roasted to near perfection - crispy & thin crust! The \"Carpaccio di Zucca\" Antipasto is especially fantastic. However, I have two main complaints - which will explain my 3 instead of 4 starts.  1) The hostess is not at the door. This means you have to walk past the snack bar and directly to her. I suppose this does make sense (given the snack bar concept) but it's so unclear. You will be confused for 2 minutes too long.   2) SO compact! You barley have room to pass through tables. Actually, the tables are set so closely together that you midis well join the people next to you for a stranger themed dinner party! If you're one who likes personal space (or any space) I would ask for the few \"distance\" tables that there are."}
{"text":"This is a great Italian restaurant. I enjoy it's simplicity and dedidication to variety. There is a great atmosphere. You can dine at the pizza bar by yourself or invite friends, social environment."}
{"text":"Just celebrated my birthday here this evening! Amazing, quick and friendly service. They offer a fun selection of Italian antipasti courses to choose from that are jazzed up and fun! Absolutely loved my hand made gnocchi dish simple and freshly satisfying. Going back on my antipasti dish, the butternut squash carpaccio, a beautiful and wonderfully colourful dish! just as flavourful and light on the pallet. Can't wait to come back and experience this place again!"}
{"text":"Reserved on a Friday night asking for a table. Got there no space and put at bar squashed with another party. While ordering we were told there was no more buratta, no more frito misto and not more fish of day (who runs out of these at 9pm???)... apart from the pizza, which is excellent, I would not rate this highly. Had pannacotta and it was ok. After being to many Italian restos including Italy, this place is average at best. Service and spacing needs to be improved."}
{"text":"Best italian resto in mtl hands down!!!!!! Dnt waste ur time with any other places...!!!!! Fiorellino brings italy to you on a plate ...A ++"}
{"text":"I really like the ambiance and decor. The location is not far from the hustle and bustle of the downtown core. I went with 3 friends and we were all happy with our meals. The food was delicious! We will be going back."}
{"text":"The first thing you notice about the place is the decor....beautiful wallpaper and great airy look for a compact space.  We went as a group of 6 and were seated promptly in a corner table with plenty of space. Our waiter was excellent, remembered all of our orders and was attentive throughout the meal.  They have a good selection of Italian cocktails and sodas (great aperol spritz and great chinotto!)  Food was good overall - genuine Italian selections  - great fried appetizers, good gnocchi and pretty good pizzas."}
{"text":"Extremely solid flatbread style pizzas with some unique topping combinations. The Roma tomatoes on the eggplant bianco pizza were fantastic and really made the dish. The sausage and goat cheese was decent as well, not quite as special but still tasty. The crust is pleasantly chewy and pizzas served with a spicy oil for dipping.  If I had to give a negative is that it's a bit pricy for what you're getting. The citron marscapone cake we tried was a bit on the bland side and really needed some more lemon kick to stand out. Staff was friendly and it's a trendy spot for a late dinner."}
{"text":"The first thing to note about Fiorellino is the space, which is really beautifully done. I would say it's been a designed as a very upscale and stylish diner, with beautiful mid-century model furnishings and decor. The space is very open and bright and the staff were pretty much all very attentive, helpful, and friendly. Our waitress was particularly lovely. The food was great (we each had pizza) and the portions were really generous. The beer wasn't on tap, which was disappointing (and they were out of the first two beers on the menu) but overall, we really enjoyed the space, the atmosphere, and the food. I'd categorize this place as somewhere that, ff we were locals, we'd probably spend a lot of time here sampling all of the pizzas and enjoying the very lovely space."}
{"text":"Une bonne petite place en plein coeur du centre ville, non loin du chinatown. Tant pour un café à toute heure de la journée, une bonne pizza  ou des plats typiquement italien au lunch ou souper. Le service est attentionné et les prix accessibles. Le décor est moderne avec des baies vitrées séparant le café du restaurant, et un comptoir ouvert ou on y voit les pizzas se faire sous nos yeux. À recommander certainement."}
{"text":"Came here for dinner.  Service is excellent, waiters are very friendly and helpful.  Decor, ambience and finishing was great.   For starters we had the Burrata which was served with mushrooms and Grissini. Tasted ok but not that great, plate doesn't really come together, lacks salt or acidity for that extra kick.   The gnocchi was okay as well. Plate full of taste however texture of gnocchi was odd and pasty. The amount of Pomodoro sauce was in excess to the pasta: 3/5.   Coffee Panacotta 4/5.   Slightly over priced."}
{"text":"Average at best. Service was slow and sloppy (asked for bread that never came, dishes were given to the wrong people, wait staff was not knowledgeable about the cocktail menu). The rigatoni was undercooked and non edible. When sent back we were told that \"that's how they do it in Italy\". Which is an insult to Italian cooking. There's a difference between al dente and so hard and cold you have to be careful not to break a tooth. The other pasta dish we ordered was great and perfectly al dente. Would not go out of my way to come back here. Lots of top notch Italian joints in the city, this place needs to do better."}
{"text":"Way overpriced for what you get and you don't get much except a nice looking restaurant and good service. Portions small,  food is just ok. Had to ask for bread,  once arrived I had to ask for oil and balsamic vinegar. Ordered the risotto, nothing special, my wife ordered the zucchini flowers and they were bland. My recommendation is to go elsewhere."}
{"text":"Very nice ambiance, good pizza, but disappointed by the choice of appetizers and can't believe they won't serve butter with the bread (at least on demand, come on!)"}
{"text":"Pretty impressed by Fiorellino. The restaurant has a beautiful layout with mid-century style decor. Gives a really inviting feel to the place. The food was pretty solid as well. I had the fried eggplant pizza which was overall good. The dough was lacking salt but otherwise the pizza was very enjoyable. The semifreddo that I had for dessert however was forgettable. I saw people enjoying other sweets and to be honest, it gave me a bit of dessert envy. I would definitely go back, solid restaurant choice in the area."}
{"text":"If I could, I would have given 3 1/2 star. This was my first time at Fiorellino but second time for my friends. First off, the restaurant is beautiful, it is very well decorated and the ambiance was perfect. We reserved a table of 8 for 9pm, and upon arrival we had to wait 30-40 mins before getting our table. I will admit that impatience started being an issue as time passed!  When we were finally seated, the whole ordering experience was really slow. As nice as the waitress was, she had a hard time remembering and serving us the basic. We had to ask twice (as she will always forget, and in some occasion we never received as we gave up on it) for water, wine menu, bread etc... The 3 1/2 star is mainly for the service, the waitress was nice and still try to do her job as well as she could, but all the repeated and forgetful request became a bit too much.  As for the food, the pizza and the entrées were amazing. I'm giving a 4 1/2 stars for food, because the one person that didn't order pizza but got gnocchi, was really disappointed as it was overcooked.  But overall, my first time at Fiorellino was good and pleasant!"}
{"text":"We went as a group of 8 for dinner and had a wonderful time.  The open air concept kitchen had a pizza oven, a bar seating area, and plenty of room between tables.  They had nice Italian beers to choose from as well as excellent Italian sodas and Italian coffee. The appetizers were excellent. We enjoyed all of our main meals (gnocchi, cavatelli, pizzas and more). Our waitress was very friendly and the owner stopped by to greet us when we arrived and when we left.  A nice meal that we all thoroughly enjoyed."}
{"text":"I'm surprised that so many people like the service here. I really enjoyed the pizza I ordered but I had to wait a long time to get the attention of a waiter...in fact, I had to flag down a waiter and ask to order. She called over a different waiter who took my order. The pizza was delicious and brought to me fairly quickly but when it came time to pay, I again had to wait a long time and had to flag down another waiter to ask for the check...she called the original waiter who took my order to fetch the receipt. My waiter never came to check on me or ask if I wanted anything else.   The place was lively and busy as you might expect on a Friday night but not so overwhelmingly busy that the waiters would forget to at least check on their table."}
{"text":"This place made no sense. It was a beautiful afternoon and we asked the hostess if we could sit outside to which she gave us a confused \"yes\".   We sat outside and waited and waited and waited fo about our 20 min wondering if we should just leave. Eventually a waitress came out and asked for our drink orders, to which I told her we weren't getting food, only drinks. She nicely obliged and brought out our drinks somewhat promptly.   After we finished, we once again waited and waited and waited. Our waitress had not returned. I went inside to use the restroom to see the inside was EMPTY. There was one couple seated at a table. After we had finished our drinks we waited approximately 45 minutes. We didn't know if we should just leave or what. We went inside to the bartender and asked if we could pay our bill because we had been sitting outside and no one came to us. Still no one seated inside besides that one couple. Happy to say we will not be returning."}
{"text":"I recommend to all to try this restaurant. Great service great food and great ambiance.  Pizza , entrees, all is great.  Nice choices of Italian drinks."}
{"text":"Its a new place between old port and downtown.  Looks very nice.  Staff very nice as well.  Pizza pretty good.  We try also few pastas... I think portions a little small... And not very teasty.  Go for the lunch rather the dinner."}
{"text":"I came here for lunch and the place is buzzing with energy. This lovely Italian place is cheery with the decor.  I ordered the butternut squash risotto. It was simply awesome comfort food. It had all levels of cheese and tasted like Mac and Cheese. Instead of the Mac, it was risotto.  All the flavours were there and the colour of the risotto was pretty. A light orangey yellow. The risotto was cooked well, not raw and the risotto was done just right with the correct amount of bite. This is a great vegetarian and gluten free meal."}
{"text":"I went to this place for a girls night out, and we loved it!  3 out of 4 of us ordered pizza and one ordered pasta. It was amazing. We shared our pizzas so we could taste something different. We had Caprese, Formaggio di capra and Mortadella. The last one had pistachios in it. Not bad at all!! So tasty, well cooked, and fast! I definitely want to go back so I can try the pastas.  We arrived at 6:30pm, with a reservation. There was alot of people, so if you are planning for a drop by, you're probably going to wait a bit. Reservation is always the best. And they call you back to make sure that the reservation is still on."}
{"text":"Bonne qualité de la nourriture (produits, préparation,...) , mais très mauvais rapport qualité prix (antipasti à minimum 15$ et pizza standard à minimum 21$, soit presque 30 $ pour la pizza avec taxes et pourboires). En ce qui concerne les vins, choix de vin rouge italien assez large à tous les prix. Endroit semble branché mais surtout très bruyant. Service correct."}
{"text":"Really liked this place. We reserved a seated table for 3 on DINR, but upon arrival they gave us a high table only because the manager (or owner? no idea) gave our seated table to his friends, I guess. So we contested that & ended up with a seated table.   For the appetizers, we got the eggplant caviar, beets salad & the burrata with squash. All were delicious. For the mains, we got the Napoli & Margherita with mushrooms. Both were pretty good. I would say the pizzas have a little too much crust but it didn't bother me too much since their dough is delicious.   As for the ambiance, its pretty good. Not too loud. Restaurant is nicely decorated & spacious enough for comfort."}
{"text":"I really enjoyed fiorellino's recently with my friends, each of us ordered different dishes and drinks (best way to taste them all) and to my delight- all were exceptional.   My husband and I ordered pizzas- the one with Italian sausages and one with ham. We absolutely loved every morsel, we were genuinely upset when it got over. My friends ordered the boar and the gnocchi (yummiest I have ever had)- both were dishes I would go back for. I wasn't too pleased with their desserts.   Drinks were good, especially the cocktails. Staff was courteous and didn't rush us even though it was past 11.   Thanks to Fiorellino's and Pizza il Focallio, I can never go back to thick crust late night pizzas from dominoes/ Pizza Hut.   Top notch interiors, little bit to the pricier side. I'd highly recommend this place to others- dates, business meetings etc."}
{"text":"This is not an inexpensive spot for dinner, but they have food that is well worth the price. We were impressed by the quality of all the dishes we tried, especially the pizza and the pasta with a wild boar ragu. This is first rate Italian, with excellent wood fired pizza made with  pizza flour from Italy and excellent sauces made on site.  The ambiance was pleasant and we enjoyed sitting at the chef's table. The service was wonderful with very attentive staff. However, it was very crowded so there was a bit of a wait. All and all, a great experience."}
{"text":"3.5 stars. I wanted to like this more than I did. The service was good. Pizza was not very good. The ingredients that they use are great. It's just that the crust is not very crusty yet it tastes burnt. The past was good in some ways (sublime gnocchi and tortellini) but some items are cooked super al dente."}
{"text":"I won't be back. Average pizza at best. Limited menu. Made a reservation and got a seat at that bar, where I was splashed by bar tender with vodka while he was making a drink, even though I saw open tables. The hostess didn't care at all that we had a reservation - and gladly pushed us off onto the bar stools, that we could have walked into and sat on as passersby...the gentlemen behind the bar insisted he was not the bartender and we needed to wait for bad service ...as he frantically sprayed us with booze as he made drinks."}
{"text":"Listen, I like this joint. I really do. But I don't like it because it's got great food.   The menu is creative, the service is great (often excellent), it's beautiful inside...but it doesn't add up in the end.   I go back. I go back because I like it. The pizza isn't great. It's not even \"Montreal great\" - which by any other standard is mediocre (or médiocre). The seasonal changes to the menu are awkward but work if you're not picky.    This town is full of wonderfully likeable places with great service - but this is an icon of perfectly okay but otherwise unremarkable Montreal Italian food.    Stop in. Do. You'll probably even come back. ...but even I don't know why."}
{"text":"Worst place I've eaten in Montreal.   - Old, brown lettuce in the salad - Lazily made pizzas (poor prep, two giant balled-up pieces of panceta as a topping) with far too much burned dough - Poor service, even during a slow time (the whole wait staff seemed to have better things to do than deal with customers)  On the up side, there appears to only be one of this restaurant."}
{"text":"Service is bad, they did not let me exchange an ingredient, they changed it on my girlfriend's pizza and charged, expensive place, the sauce tastes like regular supermarket tomato sauce, the crust is chewy. We paid 70$, never going back there anymore"}
{"text":"Restaurant italien localisé sur la rue de la Gauchetière, a quelques pas du Centre Bell et du Quartier des affaires.Cela ne fait que très peu de temps que l'établissement a ouvert ses portes. Les photos vues sur Google me plaisaient beaucoup et je pensais l'endroit être le bon choix pour un souper en tête à tête. Nous sommes arrivés vers 20h un mardi soir, la salle était presque vide. Je pensais que lorsque j'y mettrais les pieds, l'ambiance serait chaleureuse et intime, mais pas totalement. Le look industrialisé fait tâche, c'est à la mode en ce moment, mais ça ne marche pas à tous les coups :D Le service était tout de fois impeccable, notre serveuse super charmante, nous traitait aux petits oignons, elle avait le temps vous me direz! Le menu est simple, entrées, plats (pâtes et pizza) et quelques choix de desserts. Pas une énorme diversitée. Ce qui m'a tout de fois frappée c'est les prix, je ne sais plus exactement ce que cela coûtait (sur le site on ne voit évidemment pas les prix....) mais pour l'assiette Fritto Misto avec Crevettes frites - Calmars - Palourdes - Éperlans - Zucchini - Citron, une pizza napoli et des gnocchis cela m'est revenu a près de 60$ sans boissons. Pour moi une pizza qui coûte presque 20$ elle doit me faire tomber de ma chaise littéralement. Et bien non! C'était une pâte fraîche, une sauce tomate classique et des anchois minuscules. Pas de quoi me faire rêver. En ce qui concerne les gnocchis on les a farci avec de la ricotta, avoir su je n'aurais jamais pris ce plat. Cela rendait les pâtes molles et gâchait la nature du gnocchi. Une chance que la sauce pomodoro mise en grande quantité venait relever le goût de mes pâtes. Pour ce qui est de l'entrée, de la friture comme on retrouve partout. Une excellente sauce tartare tout de fois.  On y vient pour un bon service, on essaie la place pour découvrir autre chose, mais on ne s'attend pas à un haut niveau de cuisine italienne. On mange mieux ailleurs malheureusement et dans un décor qui fait moins plastique."}
{"text":"Wanna go to their other place but can't find parking?? Don't worry- they are cultivating the same elitist, snobby, \"look what she's wearing, no no, look at me instead\" culture.  The food is average, the menu small and really, cannot think of one reason to go back.  And yeah, if the owner/manager promises you something for free for the inconveniences that occur during your meal... don't hold your breath.  He'll bring you your bill and see you on your way- free thing long forgotten.  Not worthy the hype it has received if all you're looking for is a great pizza.  Other places have better."}
{"text":"Nouveau restaurant italien / pizzeria / comptoir café dans le Quartier International du groupe Buonanotte. Local spacieux, design moderne (luminaires originaux), cuisine ouverte (comptoir à pizzas), mobilier vintage années '70. Ambiance sympa décontractée. Notre entrée, la salade de champignons (12$) était originale mais sans plus. Un classique, ma pizza magherita (15$) était délicieuse et les pâtes à la poulpe (23$) de ma copine étaient succulentes ! Notre vin était bon. Le service de la serveuse était correct. Prix réguliers du menu. Seul bémol, avons dû patientez longtemps avant de recevoir notre nourriture car la machine à pastas avait un problème. Sinon, nous avons bien aimés notre expérience culinaire et l'accueil chaleureux du manager. On reviendra essayer le petit déjeuner à l'italienne servit dès 7am. Un ajout de qualité dans le Quartier International, bravo !   4/5 visité en décembre 2015."}
{"text":"Delicious cozy spot - innovative salad Niçoise salad, wonderful homemade linguine & a great oven fired pizza with goat cheese.  Fantastic service & vibe."}
{"text":"Chic place , wonderful decoration, nice service, many tables , big windows, lounge music, good taste of pizza and pasta :)"}
