{"text":"As I was remember Wednesdays was Double Protein day. So, we went there tonight. Unfortunately they changed the promotion and Double Protein is no longer available. The had the other promotion for Shrimp.  We ordered one shrimp and one Beef Steak.  The Beef Steak is the best. We ordered Steamed Rice at side, but it was not same as before.  I suggest this restaurant if you like Stir-fry."}
{"text":"I've frequented this place ever since I discovered it years ago. It's true - with the changing owners there are slight changes each time, but mostly to the specials. The menu is irrelevant here - pick your protein and go make your own stir fry. Pile it up as much as possible and you have lunch the next day. Service is always good, and the price is right for two meals (seriously, leftovers...)."}
{"text":"LOVE LOVE LOVE this place.  Hidden away, this gem has the tastiest noodles ever.   The deco is terrific, all kitschy, with giant ice and fire motifs everywhere.   The food is an entertaining experience!   You first choose what protein you would like with your meal. I ALWAYS order the chicken, which is consistently fresh and delicious. I have also had the Mahi Mahi and Blackened Snapper, which is fresh of the boat, melt in your mouth, goodness. Then you choose your rice, brown, jasmine or white. I always go for brown. Then you head off to the buffet where you fill your plate with an array of noodles (spinach, whole wheat, egg) and then a beautiful assortment of veggies to make your stir fry base. The addition of raisins, coconut and flax seed is amazing as well and surprisingly goes sooooo well with the food. The veggies are always fresh and include carrots, onions, broccoli, cauliflower, peppers, water chestnuts, garlic, ginger, cabbage, bok choy, spinach, baby corn and so on!  ALWAYS heap on the \"fire sauce\" because it is out of this world. I normally get two sauces added to my stir fry.  Then after handing your heaped plate into the kitchen, where they make it fresh, you head to the small salad bar. It's pretty boring. They have a green salad, noodle salad, coleslaw and some chick peas. But let's be honest, I never come to Fire and Ice for the salad.  The main is always too big for me to finish. Its great value for money (under 20 bucks per person) and the meat is super tasty and fresh. I would recommend this restaurant to everyone."}
{"text":"We went on a sunday afternoon just as they were opening so it was nice and quiet It was a diffrent experiance the kid's loved this because they helped to chose what would go in to the stir fry. I really enjoyed the concept the only thing was that there was not enough sauce and they could have left it on the fire a bit more but it still tasted great and the portions are really big so we took the rest home with us and had it for lunch the next day."}
{"text":"This is a great restaurant. The server is friendly and nice. Loving the ideal and decor. The food is delicious, i love the sweet chill sauces with chicken and beef! Definitely will go again."}
{"text":"I've been here a few times. It's okay - nothing in particular about the food or experience stands out in my mind. I had the salmon in the past. I feel this place has gone from good to worse over the years."}
{"text":"This is a great restaurant! This was my first time and I loved the food. I went there during lunch time and my colleagues who have been there before were kind of guiding me through the process, and it was a unique experience.  As Mike explains (below review) there is a steep learning curve on the uniqueness of the 'Fire and Ice' experience, but once the food is served, all that is forgotten. I even took some photos for everyone to admire.  Tons of food, I went through the salad and I was full, so I took the huge plate home I and enjoyed it the next day also. Most of my colleagues were sent for the next couple of days and did not need to go out for lunch.   I try to dish out more praise then criticism but it is due when it is due.  A word of warning, and this also explains the 3 star rating. The wait staff can be very tricky to deal with, and might expect a tip for nothing. Our waiter messed up  one or our orders, but did offer us another dish, which we gracefully refused because after all , we were on lunch. The waiter also made us pack up our own food, which I found odd, maybe it is just me. There was no concession or hint of friendliness but great expectation from that waiter, who went furious after receiving tips from everyone in our party, except from me.   So, enjoy the food but don't over tip the waiter."}
{"text":"Arrived at Fire and Ice with my family of 5 on a Tuesday at 6:30 pm. There were  3 other tables seated.  We were brought to our table by Lee in a pretty quick fashion (1 minute wait) and he went off to get water for our party.  First thing I noticed was the table was sticky. I sit back from the table, and grab the cocktail menu and  it was sticky. I opened it and there was a large sticky smear of something inside it.   I looked across the table to my wife and before I could talk she said \"this place is grimy and sticky -- and did you see the veggie bar? it looks like a tornado has hit it\"  I looked over my shoulder and had to agree -- there were veggies spilled all over the counter ---  Now if it was really busy, and hopping and the buffet was busy I could understand this -- but there was only 3 other tables -- and two of them had not even gotten their drinks yet -- so the sloppiness of the bar was surprising.  Between the tables, the menus being all grimy and the condition of the veggie bar, we decided to leave --- this is the first time I have ever left a restaurant due to cleanliness issues.  I did stop and comment to our waiter as to why we were heading out, and he just shrugged and said \"Oh sure --I understand\" -- is this a common issue there?  Will also note, our waiter was also the host, and apparently the bartender."}
{"text":"Love this restaurant! Never will you receive more fresh and sooo much food (its is 2x times more food than anywhere else, seriously you could eat dinner 3x with the food  you get!) for less than $15 person!! They aren't claiming it to be authentic Asian, its owned by the Body Break people and its super healthy and Wednesdays is double protein say - double your meat so you save like $4 too. Yes the decorations (like a cave with ice and flames) it kind of kitschy but the food is so yummy and good for you it's a great casual place. My husband and I go here as often as possible! I recommend the garlic peppercorn sauce and my husband get s teriyaki."}
{"text":"If you would like \"The best stir fry in Canada\", stay the hell out of the Fire and Ice Stir Grill.    We arrived and were seated without incident.  I was struck by the garish decor...dark colours with eerily illuminated volcano dominating the room.  That aside, we ordered.  We like to share.  We generally order a few dishes to share between the two if us.  We ordered the spring rolls, the pot stickers, and the filet Mignon stir fry.  Enter issue number one... we are informed that there is a $6.99 \"sharing charge\".  We asked to speak to a manager, and enquired as to why there is a sharing charge for an item that is not all you can eat, but rather is a set price.  She had not real answer.  My wife mentioned that in most Asian restaurants, sharing is no issue.  The manager aptly pointed out that this was no Asian restaurant (no shit Sherlocke!),  but rather \"a Canadian restaurant, the best stir fry restaurant in Canada\".  Needless to say we did not want to stay, but the manager offered to \"make an exception for us, and waive the sharing charge\".  It was bloody cold outside, so we stayed...  Enter the spring rolls.  Still frozen in the centre!!!  Sent back, and out came attempt # 2.  This time the other extreme, overcooked until they were blackened and had burst and burned in several areas.  Yum.  Enter the pot stickers.  If I have to tell you what a pot sticker is, then Fire&Ice may be the perfect restaurant for you.  They were not pot stickers, but rather deep fried wonton-ish things.  They were alright, but not pot stickers!!  The stir fry, the main event...  Throwing a bunch of Robot Coupe'd veggies onto a  dirty, oily flat top does not a stir fry make.  And chuck steak is not filet Mignon just because you say it is on the menu.  Enough said.  Please note:  The server we had was great, but the rude and arrogant manager and awful food will ensure that we go to one of the thousands of delicious and authentic Asian restaurants in the area."}
{"text":"I have been coming here for over 6 years through a few ownership changes. I consider myself a bit of an expert on the menu. They do one thing well - stir fry! The rest of the menu is not that great as this is all about the stir fry. Stay away from the apps as they are very blah but they are not needed as the stir fry portions are huge. I have had every form of stir fry on the menu but enjoy the chicken and or beef the most (the body break). You pick all the veggies you want and they stir fry with your choice of sauce and protein. The fish is good but not as good as the beef or chicken. Service is always good and price is reasonable given what you get.  Again - avoid anything that is not a stir fry and you will likely be happy. The non-stir fry menu items are just menu add-ons - there is little effort or creativity in these dishes.  Want stir fry - 4 stars Anything else - go somewhere else."}
{"text":"I like this restaurant for its concept. You have the flexibility to make your own dish using your choice of ingredients and sauce. You order your protein, pick your additions (veggies + noodles) then give it to the chef to make. I love mushrooms so every time I come here I pack the bowl with mushrooms. I love their spinach noodles so I usually pack my bowl with that. The salad bar is unlimited. You have choices so you can be as gluttonous as you want.   The 3 times I've been here I didn't find anything wrong with the way they stir fry. On my last trip, the rice had a strange smell but other than that, the food was very edible.    My only real complaint are their prices. A single protein is about $15-17. They really want you to get duo protein because it's only $2-3 more to double up. They have some premium items like lobster tails which will cost more. You don't quite get value. They need to either increase the protein sizes or lower their prices a bit. As an example, with the Italian Sausage, you're basically paying for ONE sausage. Yes...ONE. There are some items that are simply not worth the money.   Unlike Mongolian grill, they don't design it so that you get to watch the chef cook. I think Mongolian Grill has a slightly better set up than Fire & Ice."}
{"text":"I wasn't sure what to expect from this restaurant when I went there for a work team lunch, but it was pretty good!   - not fancy at all, but kind of unique interior decor  - good for groups: everyone got to choose exactly what they wanted and there were options for vegetarians and those with gluten intolerance etc in our group  - HUGE PORTIONS...it's crazy! I don't know who could eat all that food in one sitting. I'll be eating leftovers for like 2 more meals  - Good price for the amount of food, at least for lunch. My meal was about $20 including taxes and tip  - Go on Wed and get double meat for the price of the normal, single meat"}
{"text":"Great food, Great idea.  Can be very healthy depending how crazy you go with filling your plate.  Always fresh produce at the self serve bar.  Love this place"}
{"text":"Fire & Ice is a decent restaurant, and very unique in my opinion. The buffet stir fry concept is not really seen anywhere, and its one of those places that people either love it or hate it.  Personally I love it, makes eating healthy really easy - however thats assuming you know about portion control as it is very very easy to forget while at Fire & Ice. I load up on the seafood and veggies, and can never finish a full meal. Granted I've only been here two (maybe three) times before.  I have to agree with Alex about his comments on the wait staff. I don't know why exactly but their attitudes need some adjustment and personally I don't have the time or energy to deal with cranky waiters/waitresses.  Would I return? Yah, eventually, the food was good so why not."}
{"text":"This restaurant advertises itself for it's stir-fry platters. However, I did not have that, instead me & dc got steak & chicken fingers.  The interior was clean & basic with the use of dark colors.   Our waitress was touch cranky & that really killed the experience, otherwise me & my dc ordered prompty.   My steak was medium rare just as I ordered & came with wedges, which were cooked just right & seasoned for flavor.  Chicken fingers covered most of the plate & whatever room left was french fries, again these were tasty & the fries were cooked just right.   Although portion sizes were most generous & my meal was very satisfying, the service was less than admirable so it settles with 2 stars."}
{"text":"If you desire quantity over quality Fire & Ice is probably already your go-to place. If you enjoy piling badly-chopped vegetables in a bowl as high as you can go, simply to be stir-fried by ready-made MSG-laden sauces, by all means head to Fire & Ice.   It's pretty much like Mongolian Grill; pick your vegetables, pick your protein, give to 'chef/stir-fryer' and get your food via waiter.   It's neither inspiring, satisfying nor is it delicious."}
{"text":"Interesting concept,  If I'm in the mood for stir fry I may go back, but really it was just average.."}
{"text":"+.5 for service  On a random Friday afternoon, one of my coworkers forgot to bring her lunch. Instead of her buying lunch herself, we decided to all go out for lunch. Seeing how we have a vegetarian going out with us, we decided on Fire and Ice. Plus, I pass by here all the time and have never visited...it's got to be good, right?  We were seated rather quickly and our orders were taken, and we went to get our noodles and veggies. One thing to note for future visits, OVERFLOW your ingredients bowl. Another strategy would be to pick the veggies before the noodles. I filled my bowl to the brim but not beyond, but realized it wasn't enough at the end. Also, don't forget the salad after you pass your bowl of ingredients and noodles to the chef.  I ordered the Asian squid stir fry. It was okay...the squid actually tasted like squid, and they were generous in the amount given. Unfortunately my plate just wasn't as big as my coworkers since they filled their bowls beyond the brim. I had the Asian teriyaki sauce, which I couldn't really tell once everything was cooked. Meh, something else next time I guess.  Both my coworkers loved their foods and were able to take a portion of it home. I ended up finishing it all and was only about 3/4 full. I should definitely know next time...  Free wifi!"}
{"text":"This is my first time going to Fire and Ice and I was quite disappointed by the place. The food was pricey and the place was dirty. There was a terrible smell by the salad bar and the entrance was dripping with water. I was expecting a lot for a place that charges so much for stir fry. As a result, I will not recommend this place to other people and will not come back any time soon. Hope this helps!"}
{"text":"I don't know whats up with this place.  I've been here and It's been phenomenal one night and other nights it has been utter inedible. I guess it depends on the person who is cooking the stir fry.  The bruschetta is a great appetizer but it's greasy as hell. So if you like oily and crunch and sour DO IT!  A big pro for the place is that the dishes have BIG portions. You will not leave hungry! However, the fish last time I was there had turned and made me sick. The benefit here is that you get to pick what you want to eat AND there are gluten free options as well which is always comforting. It's just sometimes there is salt lacking from the dish or there isn't enough sauce.   It's worth a try, but ti's a gamble. I wouldn't say no to the place, but I wouldn't go nuts over it either."}
{"text":"I went for the 2 protein option: Beef Tenderloin & Atlantic Salmon with brown rice. You pick your own veggies, noodles & sauce type. The food was good, for the price which on a sunday was 18.99 for 2 proteins. 17.99 for 1 protein, if I remember correctly.   The only thing I didn't like was the decor, which is looking a little dated. Everything is done up to look like a volcano / cave with stalagmite & stalactites hanging off the ceilings. That and, man, were the washrooms ever cold! I joked with my mom, that it looks like a cave & feels like a cave!  All in all it was ok. Good for a casual eat out."}
{"text":"Amazing healthy option when i'm in no mood for deep fried grease..  I have been going here for years, always suggesting it to my friends who feel like going out to grab a bite to eat and catch up. I find it so innovated to be able to create your very own stir-fry just the way you like it, with what you want in it and what not. I love the variety of choice from noodles to veggies, to sauce toppings to rice that they offer.. Incredible!!   I always seem to stick with the same sauce sweet chili because i figure why break what isn't broken.. it's was i enjoy. I always get the duo option and there is always a tone of protein no matter what my choices are..   I love the salad bar option prior to receiving our meal, Its very refreshing but i have to warn you NOT TO GET FULL on the salad bar.. i assure you if your plate was full before giving it to the chef you will have more than enough food and most likely bring it home for lunch/dinner the next day. The stir-fry tastes just as great even a day old and nuked in the microwave...  The only disappointment i have is before the menu was changed the meal use to come with a dessert of our choice between the two sorbet flavours, i found it was an all rounded great complement and perfect way to end the meal. Needles to say they do not offer that now but the food is always cooked to perfection so i return on a regular basis ."}
