{"text":"This place is so different from the previous Pelicans Patio.  It's a breath of fresh air. To start we had fried artichokes, very flavorful, served with marinera, very good. Next we each had house salads, I had balsamic great taste, my wife had champagne, it had little too much mustard for taste. For the main dish,  I had the pasta special, very good flavor and it was served hot (temp). My wife had the fillet, it was cooked to perfection.  The presentation was wonderful. The menu stated steak fries with skin, so we had to give them a try. Oops turns out they were were frozen. If they switched and cut their own it may put this place over the top.  The burgers looked great and with fresh cut fries could make this place the real deal.  Desserts are brought in from a bakery in Mooresville- good selection.  We finished with the coconut cake. Service was very good.  Manager noticed that my beer was near empty made sure that It was refilled. The chef came out and talked about our experience that was another PLUS.  A new restaurant needs to know how to tweak the menu after it opens, I think this place will and it will be successful. Very hopeful We will be back"}
{"text":"Waited 40 mins to get frozen fries. The restaurant was freezing cold, the tables were very close together. We waited forever for our food to come out cold. Some of the fries were still frozen. We will not be returning after this unpleasant experience."}
{"text":"This used to be one of my favorite restaurants. Would drive the distance for certain fav menu items.  Then 2x they had new chef, had an awful meals...which were comped...but doesn't change that I left unsatisfied. Tonight I came in to a totally new menu due to new chef (not changed online!), very specific meal options -  all my favorite items - gone. Ended up with a burger and Mac n cheese. Totally blan and no flavor. Extremely disappointed."}
{"text":"Just got back from vacation and as we all do, I ate out every night and found myself comparing each meal with Fireside! Just had a great welcome dinner and a where ya been from a staff member!"}
{"text":"The food was delicious. I had the pork tenderloin and it was cooked perfectly and marinated to perfection. If you're a sucker for good beer cheese dip for pretzels, this is your place."}
{"text":"This place is extremely overpriced. Had 4 appetizers and they all tasted like a salt lick."}
{"text":"Love to come here for a cocktail or for Fireside Dining with the Kids.  Great Place to meet your friends, gather around the bar (under a heater now that the cold weather is here), watch the game, socialize, and of course sample some good food."}
{"text":"Any restaurant that chooses to take down a review based on their concern for public opinion thereafter, has clearly missed the opportunity to fix the issue at hand.  Now I'm posting a bad review based on principal.  I'll spare you the details of the 4 dining experiences I had which all fell short of expectations based on service and food quality.  Rather, I simply wish fireside luck as their now well appointed patio seems to be irrelevant with temperatures dipping into the 30's and 40's.  I hope you saved enough of your pennies to weather the \"off-season\"!"}
{"text":"The best Mac n Cheese I have ever had. Even better than Longhorns. Great burgers. The outdoor bar area is a nice for meeting friends for a drink."}
{"text":"Great food. Service is usually pretty good. However I brought my folks once and it took nearly an hour for 3 sandwiches. Must have been an off-day. It's usually pretty empty at lunchtime during the week. Hope they have enough business to keep it going. Great patio. (Would be nice if they planted some trees to block out some of the traffic noise, though."}
{"text":"I can't explain the inconsistency. I went about a month ago and the food was great. I went again this week and it wasn't so good. I think my experience is exactly the opposite of Amy G. I really loved it a month ago."}
{"text":"Very good sweet tea and excellent pasta primavera. Their lunch menu is reasonably priced, and the place was empty on a weekday so it was easy to get in and out without worrying about taking a super long lunch. Large portions, good food. I will definitely be back for lunch again, and I plan on trying out their happy hour and outdoor patio when the weather warms up!"}
{"text":"My fiance and myself ate here this evening. We were very pleased with with our meals. I had the grilled chicken which came with braised red cabbage and brussel sprouts. I'm not sure if the brussel sprouts were part of my meal or if the chef added them since it was not in the description.  But they were supper yummy and made my meal complete. My fiance had the turkey panini which he also enjoyed. I'm one to try the same dish twice to test the consistency so lets hope the next time the chicken dish is just as good."}
{"text":"Another fail at the lake! 5 star pricing with 2 star food and 2 star staff! I left starving and disappointed! Out of almost every wine I asked for ON their menu, app's were sub power and the chicken lettuce wrap tasted like rubber soaked soy sauce. Huge disappointment! Staff looked disheveled and unkept. I felt like I was at Vinnie's all over again but with 131 main pricing. :("}
{"text":"Stuffed burger is very filing and tasty. My wife enjoyed the crispy chicken sandwich. Started with the hot & fire shrimp, which was recommended by our server.  He was very friendly, and highly recommended the stuffed burger as well."}
{"text":"Service is sloooooooow and mistakes frequent.  Cool porch and food is pretty good when they get it right."}
{"text":"What do I say?  Awesome!  We were there an hour after they opened their doors for the first time and the place was jammin!  Super attentive service, delicious bread brought to the table right away with plenty of refills.  Drinks came out swiftly, and were perfect.  The main meal was off the charts fantastic.  I had the filet sandwich and wish I could go there for lunch today for the same thing!  My wife had the same thing and we were thoroughly impressed.  Kids had chicken and grilled cheese and I had to try theirs because they looked so good.  And their meal was awesome too!  Can't say enough good about the experience.  Looking forward to the patio area opening."}
{"text":"I came a few weeks after this restaurant opened for a weekday lunch, excited to see what I was in for.  I was seated by the awesome aquarium, and happily took in the view.  The patio was still under construction at that time.  I ordered the burger, and it took a very long time to arrive.  My entire hour of lunch break, in fact.  It was too expensive for a lunch menu as well, the prices should reflect the time of day, and food must come out faster at lunch time.  This is basic stuff here.  When I did get my food, I noticed I didn't get a napkin with it.  What I am assuming was the manager - blonde older woman - was walking nearby, and I said \"excuse me, could I have a napkin please?\"  She then said \"oh, sure,\" and proceeded to grab some of those tiny coaster-sized napkins from the bar.  When she set them on my table and I thanked her, she said (with all the sarcasm you'd want from someone whose salary you're paying) \"that's why we give you that!\" and pointed to rolled up silverware at the other end of my table.  Now the table was dark stained, the napkin was black, and I didn't see it, maybe I'm blind.  But that's no excuse to make a smart remark, not after waiting 45 minutes for a burger and fries.  As I sat there steaming, I couldn't help but notice the cook come out of the kitchen 2 or 3 times and stand at the front door with his hands behind his back staring out at the parking lot.  How classy.  There were very few people in the restaurant, but if no one is coming in, it is your duty to clean the kitchen.  It can never be too clean.  I actually liked the burger, but this is one of those places that thinks they can charge an outrageous price just because they are in Cornelius, and the service does not warrant that at all.  I doubt I'll ever come back.  These people don't get that if you get bad service one time, there are plenty of other places to go within a mile radius in which you'll be treated better."}
{"text":"New chef and under new management!  I've been coming to this place since it opened last year. The food has always been pretty good but the service was terrible. I continued to come for drinks because I really enjoy the outside patio - beautiful with wood burning fireplaces, live music, and a great tiki bar.  After learning that a new chef was on board and a new manager had replaced ALL of the waitstaff, I decided to give it another try for dinner. Amazing!! I have eaten here 3 times in the past 2 weeks and everything I tried was just delicious!  The open face filet sandwhich is the best sandwhich I have ever esten. I am obsessed with it and the cast iron mac and cheese. The stuffed mushrooms and the mussels are my favorite apps. But, the house made key lime cake (with a center layer of key lime cheesecake) is what keeps me coming back."}
{"text":"Great menu - both food and drinks.  Fantastic food.  This new owner knows what he's doing!!!"}
{"text":"My husband and I ate there on a week night and the food was good and the atmosphere was really nice.  We suggested it to our friends and they had a good experience.  We then suggested a group of us go there tonight.  What a mistake!  The service was terrible.  Every time we ordered a drink it was no less than 15 minutes.  We had to ask for silverware.  We had to hand the server our plates so we could clear our table after the appetizers to be able to make room for our dinner plates.  The food was still good.  However, the management allowed people to smoke right next to us.  .hen we approached the owner about the issues of the smoking and poor service.   He was very confrontational and not at all open to our comments.  The suggestions were not made in anger  and were meant to be constructive criticism.   The owner was very argumentative and not willing to listen to anything that we had to say.  We could have spent a lot more money than we did but we could not get served.  It was a 3 1/2 hour ordeal and we will not be back. DRae"}
{"text":"My wife and I tried the restaurant last night. We were both very pleased with our meals. They were prepared perfectly and had a nice presentation. We will certainly go back and encourage others to try it. They are building a beautiful out door bar area which is expected to open next week."}
{"text":"I'm interested in buying this restaurant and opening a new place - please message me."}
{"text":"I love Fireside! Food is great. The patio is fantastic, the inside is a HUGE improvement on the old Pelican's Patio and it's pretty reasonably priced. It's not intimate enough to make it a date night favorite, but it is definitely a hang-out with your friends and have a few drinks favorite. One area they can work on is expediency....it can be very inconsistent."}
