{"text":"Best fish and chips in the city hands down. The fish is light and crispy and hand dipped. (My mom and I have watched them do this many times) and their french fries are homemade as well as their onion rings. The service is amazing and the prices are very good."}
{"text":"Great old-fashioned fish and chips place. The fish is breaded and fried while you wait and the chips are always hot and fresh. And they make great fresh salads."}
{"text":"Best. Fish and chips. Ever. !! 

I loooooovvveee coming here!!! Soooooo good I'm drooling just thinking about it! This place is owned and run by a family. They are super friendly, very accommodating, quick, efficient and nice to talk to! You can tell they have a lot of passion in what they do! 

I've had their cod, haddock and halibut...all amazing. Their fish is fried to perfection.. they have the right amount of batter, not too oily and very crispy! Same goes for the fries! Also their servings are generous! You'll definitely be leaving feeling full! 

I went once with family but felt like eating healthy that day so I ordered baked salmon served over rice pilaf and salad on the side. That was really good too!!! Salmon was flaky and full of flavour, rice was soft and salad was fresh! I usually get their homemade balsamic dressing which is delicious! 

Whenever I come I have to get their freshly squeezed lemonade! I love lemonade and this is probably my favourite one to get! 

Love. Love. Love."}
{"text":"With only 6 reviews,  I was a bit hesitant to try the place but my craving for F&C won out and I stopped by for a lunch the other day to see what the hype was about. 

The place is surprisingly spacious with about 12 tables for dine in. Location is a bit strange since there really isn't a lot in the area,  but they seem to be doing okay regardless. The staff is super friendly and quick with the orders.

I ordered the haddock special to go for $13 and was impressed with their portions. They were big.  Like my husband ate my fries and didn't snack before dinner.  The batter on the fish is perfect and the fries and fish have the right amount of crunch.  Ask for more ketchup of you're getting take out,  two packets is not enough!

Great prices,  amazing portions,  friendly staff,  big clean restaurant: clearly the makings of a 5 star :)"}
{"text":"Sorry wish I could give a good review but very disappointed. The cod I ordered was as crispy as a potato chip and the chips were below average. Going in on a Friday evening might have been too much for the staff."}
{"text":"I visited this place based on the near perfect reviews. I guess I'm the lone dissenter because I was disappointed with the quality of my food. The fries were not cooked fresh with my order and were hard and dry. The fish was just ok--I have eaten better. Onion rings were excellent and worth an extra star."}
{"text":"This is weekly stop for me on friday after work the staff has always been top notch to me but I find the food well my usual anyway the haddock special not as good as before the portion is up there but not the quality I m not the one who like to place negative comments but I had to in order to let the public know regards rénald Oakville"}
{"text":"We ate here the other day and everything was good and food was fresh.   It was our first time here and we could not really see the menu too easily at the front counter, but our server was great and helpful."}
{"text":"Everyone loves to claim their local Fish n Chips place is the best.  In this case the claims for Fishermans Plaice are pretty accurate. 

As someone of Scottish birth and having eaten at what I think is the best chippy in the world in Oban I have high expectations.  I have been coming here for 20 years and they still make a damn good fish supper. 

This was originally a McNies second franchise and at some point they changed the name but still make them the same way. They've dispensed with a lot of the other Scottish stuff like Irn Bru and Scottish bread. Which is a shame because they are pretty authentic in every other way. 

I still think High Street in Don Mills makes the best Scottish style fish supper but Fishermans Plaice is a close second."}
{"text":"Decided to try this place out by my son's dance school.  It is worth the visit.  The prices are reasonable and in line with most fish and chips places.  It is family owned and ran.  The fish is very fresh and very juicy.  We ordered 3 haddocks 1 with chips and a side order of onion rings.  The portions are large.  The batter on the fish is great.  It is not doughy but light and crispy.  The onions rings are good for 3 people at least also came with a light batter.  I just wished that they served coleslaw with the orders.  I guess that's kinda the thing with fish and chips it's a bit monochromatic.  I also wished they served rice.  Just to cut on the fried on fried.  

Service is good and the place is clean.  While we were there a lady came by and mentioned it was her first time there.  She decided to visit as a referral from hockey dad's in her son's team saying it's the best fish and chips place around.

Worth the visit if you feel like fish and chips."}
{"text":"This is the best fish and chips I've had in a long time! The batter is light and crisp, the fish is moist and neither the fish or fries are oily or greasy. 

It's in an industrial plaza and tucked out of the way, but well worth the trip and price. 

I've tried the halibut and haddock, the halibut is very meaty and the haddock is a bit flakier. The haddock special which is fish, chips, coleslaw, pop for $13 is a good value."}
{"text":"The battered halibut fish is on point. Still crispy after letting it sit for a bit while my bf and i had conversation. Will def come back."}
{"text":"This will be short and sweet. 

The food is great, fish is always crispy on the outside and yummy on the inside. Fries are never soggy but never crispy but somehow it just works. 

The bad : they are slow, unorganized. You can call in an order and still wait a while once you get there. Friday nights are busy so just be prepared to wait"}
{"text":"Went there today to order Haddock with chips for take out.  The place was filled with people waiting for their order.  I stood there waiting for 25 mins before I heard my name.  There was a woman being served by another employee looking to pick up her phoned order.  She ordered the same fish as mine. They gave her my order instead and cashed her out.  Very wrong in my book but I didn't make a big deal because karma is real.  Waited another 5 mins, (making my whole waiting time from the time I ordered 30 mins) until they called my name again.  I took my order and got out.  As I was pulling out my parking spot, the woman who took my order got into a fender bender with another car.  This restaurant's lousy service and mediocre fish probably saved me.  Not going back there.  For better fish and chips try Streetsville or Port Credit.  Stay way from this place."}
{"text":"Just discovered this place and we love their fish and chips. It's not greasy and packaged really well when you order it for to go. 
I'm not a pop drinker and I've been loving their lemonade."}
{"text":"Food was great, and customer service was friendly. We really enjoyed the halibut nuggets. Would go back again for sure."}
{"text":"The boyfriend had a craving for fish n' chips, so I turned to the lovely yelp list for local places and we decided on Fisherman's Plaice. The location is in an industrial area, which explains its early closing times. The inside is a total flashback in terms of decor, very basic but standard for most quality fish n' chippers. We arrived at 5pm, which is early for dinner, so it was just us plus an elderly crowd. Over the next hour, the restaurant filled up and take out orders were always 4-6 people deep. 

We both ordered the haddock special, which comes with fries, coleslaw and a drink. Plus, we ordered onion rings and pickled beets. Given it was our first time, we had no idea about portion sizes. In hindsight, the onion rings were a mistake as portions are very generous! Our food arrived 10 minutes after ordering, so no complaints there. We were so excited about the delicious looking fish, we commenced shoveling and immediately burned ourselves on the freshly fried goodness. Everything seemed to be housemade.  As a previously yelper stated, you can watch them hand dip the fish. I wasn't a fan of the coleslaw, but my boyfriend liked it. Fish was light and crispy and not overly oily like some places  The fries were good and plentiful. 

Service was incredibly pleasant and efficient. Obviously run by an adorable family who care very much about their business and their regulars. We will be returning to the Fisherman's Plaice."}
{"text":"Great service. The food was amazing.  I ordered the Halibut and we shared the chips and salad. Generous portions. Very nice people and the location is very well kept."}
{"text":"This is the only place to have Fish and Chips, The halibut is exceptional, sweet and tasty and the portions of freshly made chips are the best! I love the coleslaw, fresh and homemade.
Staff are very helpful and friendly. Worth the drive to Mississauga!"}
{"text":"Not sure where to begin but, the prices are absolutely absurd for the crappy food. For a halibut and chip combo - to go - it cost me $20.00. I normally go to Country Fish and Chips in Port credit but I was in the area and decided to try it out. It was horrible. The fries weren't crispy, the fish was under cooked and extremely greasy. I had also asked twice for extra ketchup packets. The women at the counter asked how many I needed, I told her 5, and she said \"FIVE?\" and proceeded to only give me three extra. It is such an insult when an establishment cannot provide you with such a simple service as extra ketchup, when I just spent $20.00 of a shitty lunch. I will never stray from my old faithful Country Fish and Chips again. ALSO the halibut cut was so small and thin that it didn't look/taste like halibut at all. 

Not Pleased, Will NOT return."}
