{"text":"Not the greatest... The portions leave much to be desired and so does the rice to filling ratio.  Head to SUSHITTO On the Road for a premo sushi burrito."}
{"text":"I tried Fish'D by EDO spicy salmon poke at the Toronto Food Fest and received great service. The guy making my poke talked to me about the history (it's a Hawaiian style raw fish salad) of poke, and how they're currently only a pop-up stand but hoping to evolve into a restaurant one day which I hope they do because they're food is great. The sushi was fresh and every bite was delicious. Unfortunately, I found the price was a bit steep for what I was getting (portions about a bit small compared to what I was paying for), so if that adjusted then I'd love it more. However, given that the food stand is in the Financial District in downtown, I'm assuming it's that price because downtown core + business people can afford these priced foods. Maybe I'm just being a particular budget-conscious student here. Anyway. I really recommend trying it!"}
{"text":"Ordered the spicy salmon poke, and cannot say I was a fan of the chunks of tomato and onion and the salsa flavour mixed with the sushi. I have had great spicy salmon pokes before with either a traditional poke sauce or spicy mayo, but the salsa just did not work with the flavour of the fish and with the kale and rice. Furthermore, the fish did not taste fresh."}
{"text":"I discovered this place at the Front Street Foods market located by Adelaide Place, on the northwest corner of Adelaide Street and York Street. Apparently, this market is around for most of the summer (2016), so it's a great option for lunch if you work in the area - there are a variety of vendors to choose from.  Fish'D by EDO is just one stall in a sea of vendors, but you'll notice right away that this place consistently has one of the longest lineups. We ordered the salmon sushi burrito a couple of times when the line wasn't too long, and overall, not bad! The burrito is pretty traditional in taste and flavour, with a nice kick of spicy mayo. Portion size was decent. It felt like one massive, gigantic sushi roll, but it was tasty and fresh enough, so no complaints there. If you're not expecting anything too unique, and if you know that what you're getting is a straight up pseudo-sushi roll (without getting too creative), you'll appreciate the freshness and above-average tastiness. Overall, not a bad lunch option, and quite delicious.  Note that although Front Street Foods is a market, Fish'D by EDO still takes credit/debit for payment, so that's a plus. For my sushi burrito, I paid around $10.00."}
{"text":"Took a trip on my lunch hours to visit this pop-up near the Hilton above Starbucks.  Nice concept to have a sushi roll made in a burrito format.  Price point was on par with the competition but honestly I felt a bit disappointed that they ran out of Tuna while I was waiting.  As a result I felt forced to purchase the salmon instead."}
{"text":"Had the classic tuna poke. Quite bland. Kale was far too bitter and didn't belong. Way too much ginger. Some wasabi on the side would have been nice. Won't try again."}
