{"text":"Had a very unpleasant experience eating their food, I'm pretty sure there was a hair in my sandwich and I nearly choked trying to get it down. Will not be going here ever again. Their food isn't good or fresh - don't settle because of the cheap lunch prices"}
{"text":"Daily specials are terrible.   Food: 2/5 more pita bread than pita.  Service: 3/5 Nice but slow.  Environment: 3/5 Meh. Washrooms: 3/5 N/A. Worth it?: 2/5 Disappointing.   I work in this building and noticed this place never gets any business. Figured it would be nice to try something new and support a business all at once.   After giving them a try, I can see why they are not popular. I tried there daily specials which was a Philly cheese streak pita. I feel like all I got was pita. There is barely anything in side. It looked like a folded pita. I guess that's what happens when there isn't enough inside to keep things round.  Won't be trying this place again."}
{"text":"Since this place changed management, the quality of the food and service both took a deep dive.   Lunches like the teriyaki chicken dinner or spicy chicken dinner used to be $5.99. Big portions and enough for a decent lunch used to be the case.  Now they increased these boxed Lunches to $6.99 and you get less food.   Same goes for their breakfast sandwiches which used to be the go to place for me. $2.50 western sandwiches with 2 eggs, ham and onions now turned into a $3.50 one egg western sandwich.   See what I mean? It costs more and you get less.   All their menus changed to reflect what I believe is their corporate menu and they have less control over pricing and food quality.   The only convenient thing isthey upgraded their equipment including the cash register so don't charge extra for using credit card as payment. Not even sure if deems a star...but overall, quite disappointed with this place. Unfortunately , the other 2 places in the same food court are just as bad :(  I guess you can call this the better of the worst."}
{"text":"Fit for Life is a decent place to get something cheap, quick, and fairly fresh.  I usually come here for the cheap breakfast sandwiches which will cost you no more than $4 and unless you decide to get something fancy with extra cheese and bacon.  Willy runs a super tight ship and moves customers in and out quicker than a Nike assembly line.  Do not get scared off by the line up's as it moves super quick!  Lunch is decent whereby they have $5 daily specials along with a good amount of variety.  You can get salad, wraps, chicken, etc.    Fit for Life is a-okay for food court lunch or breakfast.  If you are looking for something quick and cheap, try it out!"}
{"text":"Like other reviews have said, after change of management, quality and prices are a disaster. It USED to be decent, quick, somewhat filling food for 6 bucks, then it has became a place I go to to punish myself for forgetting to make lunch and still work in this horrid part of town. This place was one of the motivators for me to leave the area, the food choices are sad and expensive."}
{"text":"After years of commenting on how good my coworkers lunches looked and smelled, I finally checked this place out.  Don't let the line-up scare you off, they really move people through quickly!  I ordered the Spicy Chicken Dinner which comes with salad and white rice. Add a pop and you're looking at $7.55 after tax.  Not bad.  The portion sizes are great here.  She took, what looked to be, a breast of chicken and cut it up over my rice... then, she grabbed another one and added to it!  The chicken was cooked to perfection and wasn't overly spicy but had a nice heat to it.  They drizzle the whole thing with a fantastic garlic sauce... extra please!  As you work your way through the chicken and salad, the rice ends up being coated in a mixer spicy BBQ sauce, garlic sauce and which ever salad dressing you chose (ranch for me!) leaving a sloppy mess of yumminess at the end. Mmmm so good.  I'm not sure why it took me so long to try this place but I will definitely be back! Delish!  I think it might actually make my Friday Favs list soon... we'll have to see."}
{"text":"Hectic work schedules, who likes them right?  Food court food most of the time is neither fresh, good nor healthy right?  Andddd, food court food isn't all that cheap.  This is a messed up phenomenon that corporate folks like me get suckered into almost every day, le sigh.  Anyway, there's a chain that's called, Fit for Life.  Now whether if you can really stay 'Fit for Life' by coming every day to this shop is an experiment I'm not going to undertake.  Maybe the McD's fella can. =)  Fit for Life is a popular choice at the food court I go to and the lines at peak lunch hours are crazyyy - 15 min wait time at a food court.  So I definitely recommend coming earlier or later to avoid the lunch rush, 11:30 is a good time.  I normally order whatever the daily special is to simply try it out.  For today's special they had the Chicken Shawarma Dinner special for $4.99.  Not a bad price at all.  I've try the Chicken Shawarma a couple of times so I know what to expect.  I recommend adding extra tzataki sauce onto the Chicken Shawarma.  They use to have a ton of salad dress varieties, but lately it's been pretty sparse.  I went with Italian.  The chicken shawarma was good, but nothing special.  And the rice can be quite oily at times.  But I'm not 100% if it's from the shawarma or the rice itself is oily to begin with.  So for the really healthy people, keep that in mind when ordering the shawarma or anything that comes with the rice.  Overall, Fit for Life is a popular choice where I'm at.  The line ups are long and the prices aren't exactly all that attractive for most of their items.  There are specials so if you're willing to try new things, you may be able to save a little bit of money that way.  If you want healthy options, I would say to go with their salad entrees as those do appear to be much healthier than their other options.  Fit for Life, not the greatest choice you can make, but it's definitely not a bad one for a workday lunch."}
