{"text":"Three stars for this location. Lost a star for the poor parking and another for the price. We got two bacon cheeseburgers, shared a large fry and had two cups, not bottles, cups of water....$22. Yikes but the burgers were good and fresh. Clean restrooms, loud staff and I just don't understand the peanuts. Interesting outing but we knocked it off our bucket list."}
{"text":"I don't see any problem in going here. Burgers are very good, and so are the fries. Friendly staff, singing along to the music as they make the burgers. The guy calling out order numbers was friendly, greeting you with a, \"have a nice day, man\" as he handed you your food. Other than the location, which is a little hard to get to, I would come back."}
{"text":"I do not eat meat, so only had the french fries. They tasted so good!"}
{"text":"I would give more stars if they weren't so expensive, I was stunned when a regular cheeseburger (which is a double), fries and Coke cost me twelve and change!!!  I can go elsewhere and get a steak sandwich for the same money for crying out loud!  I would suggest splitting the fries with someone, they give you enough that you can share and save a little money.  Also, consider take out, they charge you two bucks for a regular Coke.

I LIKE the floppy fries!  Everyone's trying to change theirs to be artificially crispy and I hate those.  I love how big and real they taste here.  The burgers are high quality and tasty, they could maybe use maybe a little more flavor in the meat itself, but then I know if you ask for that, someone's not going to like it, so go ahead and leave it the way it is.  The Coke from their fountain tastes like real Coke, other than other places whose Coke is watered down.  And yes, the parking lot is pretty awful, but I can deal.

The service is friendly, a little more casual that I'm accustomed to, the guy who gave me my order called me \"Man\" and I thought at first that he said \"Ma'am\"! LOL  I was about to go over the counter at him! lol  But casual is cool, once I know how they are there."}
{"text":"Five Guys is incredibly good on all fronts. Taste of everything is astounding and customer service is fantastic."}
{"text":"I really loved the burger! I got a mini and it was still a decent size portion.

I went here because I was told they had the best Cajan fries. Sadly I did not enjoy them at all.  I also went in knowing they were expensive, but I was still surprised by how expensive it actually was.  

I would definitely try the burger and share the fries as the portion is large enough, even the regular."}
{"text":"The burger was fresh, which was nice for a change, but it wasn't as starstruck spectacular as they claim....
...the parking is horrible and the service could be better too.  Due to boxes of peanuts everywhere, the floor was covered in peanut shells.  Kinda gross.  Somebody could be making a run across the floor with a broom more often.
Our food was very, very expensive and the fries were mushy.
Not that great.  If you want a tasty burger, try Meatheads instead."}
{"text":"I like Five Guys a lot, though part of that's nostalgia (I grew up on the East Coast, and so I've eaten them for a few years). This particular location does a good job with the burgers; they're nice and greasy, and you have to eat them in the foil, but they're supposed to be sloppy. I find the fries here are also pretty good, though Meatheads has better Cajun fries. 

The location isn't great; it's really hard to find parking, and the place is always crowded. The food is also pretty expensive- you get a lot, but it's only a dollar or two cheaper than Farrens, so it's not a place I go to as much."}
{"text":"Tried 5 Guys for the first time.  I spent $30 on two hamburgers and a hotdog along with three drinks and a thing of fries.

The burgers tasted good but were small.  The fries were nothing to write home about.  I had a few, but they didn't really taste all that good.

Expensive food that does not fill you up.  I prefer Meatheads over this place."}
{"text":"I've been to Five Guys twice, and both times the food was terrible, especially considering the price.

Both times that I've gone, my burger was cold.  The one time that I went with my wife, hers was cold too.  From the fact that the restaurant itself is cold, I'm guessing that the landing area when burgers come off the grill must be getting blasted by an AC'd make-up air vent in the kitchen area.  This is bad kitchen design, and bad quality control.  Aside from that, the toppings were fresh but the meat was bland and dry and reminded me of a McDonald's burger.

The fries are absolutely terrible.  They are seriously the worst fries I have ever had at a restaurant.  They are soggy, greasy, and taste like raw potatoes.  I get that they want to do fresh-cut fries as a marketing gimmick, but in that case they need to do their homework.  The science involved in making crispy, delicious fries is well established, and anyone can look it up online.  You can't just take a potato, slice it up, and throw it in hot grease, and expect to make good fries.  It takes a two-stage frying process at different temperatures, and (ideally) some time in a freezer in between.  The fact that a nationwide chain can't seem to get information that is easily available to anyone for free is inexcusable.

Five Guys has its fanatics.  One of the times I went was with a friend who is a Five Guys fanatic.  Despite all of the problems that I described above, he insisted that the burger and fries that we were eating were delicious and that they are the reason he loves to eat there.  What this tells me is that I didn't go on an \"off\" day or to a particularly bad location.  This is just what Five Guys does.  They make cold, boring burgers and limp, greasy fries.  If that sounds good to you, enjoy.  To each his own.  I'll take my business to Meatheads."}
{"text":"Decent burger.....premium side, it sure tops the Burger King/McDonalds cabal. Parking is terrible, and impossible..sits right next to Chipotle and other businesses...wth NO Parking. For the money I think Meatheads makes a better burger and  handcut fry and the atmosphere is a lot nicer. Dont like all those peanuts all over the place, and does not look overly clean. Good burger, but I'll stick to Meatheads."}
{"text":"I agree with the guy that said this seems like the kind of place you should like because of the hype. There's nothing special about these hamburgers except they're way overpriced for what you get. Meatheads beats them on every level. Don't waste your time it's mediocre. I went there twice just to make sure I didn't catch them on a bad day because I really wanted to like it"}
{"text":"My wife and I tried this place for the first time on 7/30/2013. We started to order 2 regular fries, but the lady told us that one order is usually shared by 2 people. (very glad she told us this because 1 order was more than enough) I ordered a little bacon cheeseburger and added grilled mushrooms. The mushrooms I got were straight out of a can, definitely not grilled. The burger itself was very good and hit the spot. 

The fries were bland and mushy, definitely not cooked long enough. Also, the parking lot is incredibly small which is one reason we have never been here previously. Luckily I was able to back into an empty spot. 

2 drinks, little bacon cheeseburgers and 1 regular fry was just over $20. We could have gotten better food and more of it from Steak and Shake. Overall, we were not impressed."}
{"text":"I think it's me...but I'm going to be one of the first to say that I really don't like 5 Guys.  I've eaten 5G's in Chicago, Boston and now here and I am going to say that I really don't like their burgers.  The buns taste like the cheap white bread you get at the grocery store...the cheese tastes like Kraft Singles and the meat isn't anything to rave about.  The fries (both regular and Cajun) are limp and super salty.  It tastes ok going down but once you walk out the door, you have this belly full of \"ugggh, did i just eat that?  I wish ate somewhere elae\" kind of feeling.  And for $9+ (burger, fries and drink), i would at least expect to walk out saying, \"that was a damn good burger\"....  Save $6 and go over to Steak and Shake.... Or better yet, if you want a good burger for the same price, drive down to Meatheads.  And the parking lot is a real drag too!  Small and crowded."}
{"text":"Amazing albeit pricey burgers. You can customize it with many different choices of toppings (ie. grilled mushrooms, jalapenos, grilled onions) & with sauces (ie. bbq sauce). Their little burgers are what I'd say is a regular sized burger. Oh & their fries are seasoned deliciously & they are perfectly crisp (omg!!!) when fresh. Unlimited refills on your drinks (love blue Powerade). 

I agree with the other poster though, doesn't hold a candle to in-n-out.

Also, the location SUCKS. Parking SUCKS. & I'm not sure if it's because this is a new restaurant in town or what but this place got uncomfortably packed to the max around 8pm(day after thanksgiving). I'm talking about no available seats & having to say excuse me to move around near the drinks/pick up area.

& I don't know if it was just a bad day or not but I have never seen workers look so depressed and miserable in my life. All of them were frowning and looking to the floor & just looked like they hated life so much. Lol. I know that's not relevant to the food but I just had to note this."}
{"text":"This feels like one of those places everyone thinks is good because they've been told they are supposed to be good. Or maybe I went on an off night. Between the horrifically planned tiny parking lot, the 20 minute wait and the limp, greasy fries that tasted more like mashed potatoes than fries (that would probably be good if the oil was hot enough and they were cooked properly) I don't think I'll be going back any time too soon. But it wasn't terrible enough to keep me away forever.

The burger itself was not bad. But it kind of just tasted like one I could make at home, there was nothing about the seasoning or the bun or the toppings that made it really special or stand out, to be honest. The selection of toppings was nice, and that they didn't charge extra for them. I suppose it might be worth trying again to try different flavor combinations to see if there's something more spectacular to be had. And I'll be insisting on fresh fries if I ever go back, too. I liked the idea of Cajun fries, but they had way too much garlic, and I really like garlic. So I'll stick with the regular fries if I go back again as well."}
{"text":"One of the best fast food burgers out there. It's not as good as Meatheads, with its fried-egg burger, and it's more expensive than In-n-Out, but Five Guys is definitely upper echelon.
While the food is really good, it is still just fast food, and paying over $10 for a burger, fries and a coke is patently absurd. If you're jonesing for a burger at that cost, you would be better served going to Farren's. And this particular location is a very unique kind of disaster. The lot is cramped and inadequate, and the corner of North Prospect in question has been a clownshow since its inception.

Still, if you're in the area and don't mind justifying the cost, a little cheeseburger with your choice of toppings and a bag stuffed with more cajun fries than you can eat will certainly hit the spot."}
{"text":"This place has excellent burgers and fries. But it loses a star for forgetting the milkshakes and making you feel like you need to die after eating there.

Clean, loud and sterile. Whether you like it or not."}
{"text":"Finally, civilization arrives in Champaign-Urbana."}
{"text":"This place lives up to the Hype. Excellent Burgers and the french fry portions are huge. The Cajun Style fries are amazing. My only issue with this location is the incredibly small and congested parking lot that it shares with 3 other businesses. Good luck finding a spot during peak hours, but give them a try...you will be glad you did"}
{"text":"Parking horribly inadequate.  Men's room tiny for restaurant with 70 seats.  Where are normally over restrictive city planners and health dept. Nazi's?

 Longish wait for one burger and fries.  $9.80 for regular burger and fries, no drink.  Way, way more fries than I could begin to eat.  Burger good, but cheap bun fell apart on first bite.  Fries were fresh out of fryer and limp, nor remotely crisp."}
{"text":"Excellent burgers, second best in Champaign (next to Big Grove Tavern's in downtown Champaign).  For the west coasters out there: it ain't In and Out level, tho -- I think the main issue is that In&Out does a better job seasoning their beef (Five Guys are a bit undersalted).  However, excellent fast food burger.  Welcome to Champaign!"}
{"text":"Pretty much agree with Jon h's review.. This place is mostly hype. They do surve a fresh burger but its nothing special. The fries I had were fresh but they were still limp and mooshy. I prefer a crisp fry.

As everyone else has mentioned the place is normally like an obstacle course to Manoover around inside at peak times. 

In the end.. Give five guys a try to say you did, but don't expect anything amazing."}
