{"text":"This is a make your own stir fry restaurant. A friend and I went for lunch, while the place was crowded, the service was highly attentive and generally excellent. There is something to appeal to almost everyone among the stir fry ingredients - and for a couple of dollars more you can make an unlimited number of trips back to the stir fry bar. Unlike a few places I've been, Flattop doesn't make you wait - the bowl is marked with your name and table so it comes to you when ready. Also, if you're not into stir fry, you have the option to have your meal presented to you as a salad, soup, mu shu pancake filling, or with a roti prata. Also, they have a full drink menu and a selection of appetizers and deserts.

The best thing I can say in this review is that I'll definitely be returning soon."}
{"text":"Good place, nothing much different than any other Flat Top.  If you go when school is in session, don't try to go during \"normal\" lunchtimes unless you want to fight with some real crowds...they offer a $1 discount to students, so the place gets flooded.  I prefer to go around 11am or 2pm, and the place will be pretty much empty.  Go before ~3-4pm, though, as lunch is cheaper than dinner."}
{"text":"Came here for breakfast and thoroughly enjoyed it. Waitstaff was informative and very nice. As students, we were able to enjoy the unlimited breakfast for $8.99. 

My friends had done a combination of an omelet with french toast or pancakes. You can create the omelet with meat (sausage, ham) and veggies (green peppers, mushrooms, etc). French toast and pancake options included fresh fruit and nuts. Plus, you can add in at no extra cost hash browns, bacon, or sausage. Everything came out HUGE and on huge plates. 

There was also a side buffet of fresh fruit, muffins, light mixed salads. 

Not bad, and a good deal if you can eat a lot. Me, I could only finish 3/4 of my omelet and that was def not worth $9+."}
{"text":"I'm a big fan of this place! I love to cook so making my own creation and letting them do the clean up makes my day! I wasn't a fan of the breakfast otherwise I would give it 5 stars. 
Those people that complain about the taste need to learn to cook what they like. I know what flavors I like and make my food to fit that. Pile on the sauce (there recommendations are to conservative for my tastes) if you find it bland. Kick it up with some spice if that is your thing. If you don't like the flavor you failed not them. Their ingredients are good quality, their sauces and spices are diverse, so you have everything you need to make something tasty."}
{"text":"Definitely have had better tasting food for cheaper prices elsewhere. I went with a friend and never returned of fear that my taste buds would forget what good food tastes like. I think I did the lunch create-your-own bowl or something. I added many sauces and veggies but it really just tasted bland and the price is very steep. The service was pretty average too."}
{"text":"Its a nice concept, you get to pick and choose your stir fry instead of having to get something on menu and pick out toppings you don't like.  That's about all that's good about this place.

When it first opened, I applied for a job there at a walk-in job fair.  The guy thought I was great and told me to call him the next day at a certain time.  I did.  No answer.  Tried several times, left multiple messages and nothing.  A week later the number was out of service.

EVERYTIME I have been here, the service sucks and I swear I got back less food than I picked out, and less sauce too.  I think they hire only kids on work visas and tell them not to return to a table, ever.  Even when it was slow, I have s at at a table with an empty glass for more than 5 minutes.  The servers are disinterested and if you ask for management, you just end up waiting longer.

I won't ever go back to FTG, it has no redeeming qualities."}
{"text":"Id leave less stars if i could.  Poor service, only received 1/3 of my meat that was ordered.  Took 40 min to receive drinks...WATER.  received bread in last 10% of meal.  Manager, and server did nothing to attempt to rectify the situation.  WILL NOT BE BACK TO ANY OF THEIR RESTAURANTS."}
{"text":"This gets1 star due to pricing and because this is the ONLY restaurant I have been to where they charge you DOUBLE for sharing your food with your spouse!  They literally tried charging me double the price for the same amount of food my friends received because I shared my bowl with my spouse.  I argued my point and only paid the normal amount but they said \"now you know for next time\".  There will be no next time for me."}
{"text":"This place seems really interesting your first visit, but the novelty wears off after the second or third visit. The food does come out really hot, which is great, and the place has been pretty clean the couple times I have visited.  I've found there isn't anything that really makes this place stand out; the flavors come across as pretty bland. If the food wasn't so expensive I probably would give it a higher rating, but it's too expensive for what you get. If I'm looking for something really tasty that is asian style, I'll head across one block east to cravings."}
{"text":"Its a typical college town restaurant. There is nothing fancy about this place but the fact that 'not many restaurants in champaign offer a similar concept, makes this place unique'. Its  a 'create your own stir fry' kinna place where you get to pick a combo of rice, noodles, veggies, meat, and numerous flavors of sauces/seasoning, which are all in turn cooked together. You also get to add naan/paratha/eggs etc. The paratha here is awesome, but also a bit too greasy (which is probably why it tastes so good). Although the downside of this concept is that, you can never get the same taste again. It lacks consistency. You might find the food delicious one day and unappetizing/insipid the other day. Whats more frustrating is that you cant even blame it on the cook :), because you picked the ingredients yourself. The chances that you might be disappointed by the food here are quite high when compared to restaurants where you know a particular item tastes good and tastes the same all the time. Cant really recommend an item here, cuz i really dunno how it might turn out for you.

All said and done, this place is definitely worth a try (atleast once).

Note: The staff is very friendly and provide excellent service."}
{"text":"Went there for Lunch. The waitress was so rude. We had children with us but the place was practically empty. And our children were very well behaved. But she acted annoyed by us. The children's Mac n cheese couldn't fill up a toddler let alone a 4 year old. Very under whelming. Also the bowls that you can only fill up once were smaller than a cereal bowl. Unless you pay $4 extra. Not worth ever going back."}
{"text":"Hey the naan bread is pretty good.  But it kind of stops that that.  I found the ingredients bar to be pretty messy with some items spilling into others.  Kind of gross actually.  The food is good as long as it makes it to your table.  I had mine in a reasonable amount of time but they apparently lost my sisters dish.  How do you loose it and why are you not immediatly asking her what was in it and re-making it ASAP.  This was a server, cook, and hostess shared FAIL.  The dish was eventually found but I was mostly done with my dish.
I suggested to the hostess that some comp'ed naan would be a good idea.  This also took a long time to arrive since I had to ask about it twice and it was a mere two pieces.  We were then told that our drinks (we had 1 beer and 1 soda) would be removed from the bill only to find out that it was only the 1 soda.  That was actually worse than not offering at all.
Frustrated we left and will probably not return again.  Just plain sad, sad, sad......."}
{"text":"My roommate and I went to Flat Top for a late dinner on 08/12.  It was one of the worst dining experiences we have ever had.  

From the moment we walked into the restaurant, something felt off.  While there weren't that many people eating when we arrived (meaning that there were plenty of places where we could have been seated), we were inexplicably placed at a small two-seater in between two large parties.  The table was so incredibly wobbly that my roommate immediately got up and asked a nearby waitress if we could sit somewhere else.  The waitress apparently responded with major attitude (\"Yeah, I guess....\") and we moved to a more secluded spot.  

The first thing that caught my attention at our new table was one napkin that was covered with the crusty remnants of the previous diner's meal.

Our waitress took forever to attend to us - while we were waiting for her, my roommate kept catching the eye of the hostess, whom my roommate claims was giving her the \"nastiest looks imaginable.\"  

When our waitress finally got to our table, she handed us two bowls which were covered in crusty food, similar to the napkin.  My roommate pointed this out, and the waitress said that she'd go and get us more bowls.  She never did take our drink orders.

We arrived at the restaurant at about 8:45; at about 9:00 p.m., I heard the hostess instruct another employee to turn away any newcomers and lock the front doors.  Google had told me that the restaurant stayed open until 10 p.m.  At around 9:20-something, the staff started doing closing procedures, blocking off parts of the restaurant and leaving the path to the restrooms soaking wet with mop-water.  

We waited a long time for the food to come, and when it finally did, our waitress handed it over and then bolted away from the table too quickly to hear us inquiring about our roti breads.  We kept looking around the restaurant, hoping to catch the eye of a staff member to come and assist us, but after a while, I got up and walked over towards the entrance of the kitchen and stood there for some time.  I could see the staff chatting back in the kitchen, but no one acknowledged my presence, so I walked over to the grill, asked for some roti breads, and then took the breads back to our table.  

We quickly ate and left as quickly as we could.

So...what the duck, Flat Top?  What happened that night?  I understand that school is about to start up again, everyone is really on edge, excited, antsy, or whatever, which means that the Flat Top staff, consisting of college students and more college students, is on edge, excited, and antsy - but does that mean that I should settle with a subpar dining experience that I paid a pretty penny for?  While it's obvious by now, I will not be returning to the Flat Top on campus for a very, very long time.  I will be telling all of my acquaintances to take their business elsewhere.   

I regret that I won't be able to see the hostess' condescending smirk again, but, hell, I think I'll survive.  (Cue '70s disco song.)"}
{"text":"One who knows me would think this would be my favorite place ever. Student discount, huge portions, the ability to make that huge portion even larger, a bonanza of ingredients you can pick from, tons of sauces. All of the above to me is like Mecca. 

So you fill yee bowl and then they grill grill grill. Yeah, the bread is nice but I've never found the food particularly good. It just kind of tastes empty. First off when they give you your bowl its so hot you seriously cannot eat it and taste it for 15 minutes. This might seem like a good thing to be getting the food immediately but it's more frustrating than beneficial. The other ingredients again just taste kind of bland--possibly from sitting on ice all day. 

The sauces, which is usually my favorite part of any meal, have never done anything for me. I have had them mixed, separate, added before, added after. They simply aren't very good. I imagine they come in huge packages which contributes to their mundane flavor. 

If anyone has ever been to the restaurant Fire & Ice Grill in Boston or California it's very similar but better food there albeit more expensive because it's unlimited. I find it funny that the servers here tend to get very confused when they really don't have to do much. Never approach a table with your hands in your pockets, that's just weird in any situation. 

Somehow the concept of you putting together your own dish together seems to be a much better idea in concept than in reality. I guess if I was starving and it was lunch time, I could take this. 

I did just remember one good thing though--making up ridic names on the name place-mat sticks they give you. That actually probably is the best part."}
{"text":"Went last night, won't be going again soon.  Used to be one of our favorite places.  They have changed they way you do your own stir fry that now results in smaller portions of less tasty food.  On the plus side, we had a very nice waitress."}
{"text":"If I could give this zero stars, I would. They have changed this restaurant so much to the point where I am never going to eat here again. This Flat Top makes you order your protein before you get your bowl and are not allowed to add it yourself. They make your write it on the stick that you put into your bowl, then the server takes it and touches it. This grossed me out as something that is touching my food is being touched by many more hands now. 

When we received our food, half of them did not have meat when they were supposed to. Furthermore they mixed meats and gave beef to non-beef eaters. When they offered to fix this, it took an additional 20 minutes for a replacement. The service was INSANELY slow. It took 2 hours for us to order, get our food, eat, and pay- WAY too long. 

Our server, who never even told us his name, never checked on us. He was not helpful at all and acted like he did not care about our service. This whole experience was very disappointing. I even asked for a comment card twice, and never received one. I paid $15 for a horrible meal. I am never going to this Flat Top, or any other Flat Top ever again. Learn from my experience, and do not eat here."}
{"text":"Not sure why all the negative reviews! I recently visited for the first time and was pleasantly surprised. 

You can purchase \"one bowl\" or \"unlimited\". Unlimited is a far better value for the money (as you could probably guess). While there are helpful signs to give you suggestions on what to create, it was more fun to mix and match unique combinations! 

As a vegetarian, I thought there was a fabulous selection of veggies, and even tofu. What a fun experience!"}
{"text":"Not sure when they changed the format, but it is certainly a waste of money. No more self service, plain disappointing."}
{"text":"I love this place. This is a place where you make your own stir fry.  They offer recommendations for recipes.  It's fun because you get to experiment with different flavors. They keep their foods fresh and use veggies that are in season so there may be some variety.  It's a fun place to go with friends and you can try something different every time. The restaurant is in a nice location and parking is convenient in the attached garage."}
{"text":"My family used to go here quite a bit, because you pay one price and then eat as much as you can. The price was a little high, but I guess it depends on how much you end up eating. 
It's nice that you can choose what to eat, but in the end, the food is just okay. Not bad, not good, and we haven't been back in years. The highlight of every meal is the biscuit/pancake that you can order on the side - it's delicious."}
{"text":"A very good stir fry place. Many choices for everyone, including meat eaters or any other specific dietary needs. The basis of the restaurant is that you get a starting bowl, then go through a buffet of uncooked toppings. You add which toppings you want to your bowl, then turn it over to them. They then cook it and hand it back to you in a delicious, cooked stir fry for you to enjoy."}
{"text":"I have been here before and truly enjoyed the experience. The new format is somewhat jarring, and I don't care for it. The whole appeal of this sort of dining is choosing your own ingredients. Now, it's kind of like ordering at Subway. You point and they add it to a tray. They also did away with several options, like mu shu and hot and sour soup. Small things, really, but not for the better."}
{"text":"The restaurant has a fun atmosphere and the staff is great but it is very easy to mess up a 12 dollar meal if you combine your own ingredients poorly or don't add enough sauce. Last time I went the food made my stomach upset, going is just always a gamble and it is easy to make most of it at home for much cheaper."}
{"text":"One of my husband's coworkers had frequently mentioned this as one of her favorite places, so when we landed here after striking out a few other places on a Friday night, I was expecting a lot. Fortunately, Flat Top definitely delivered. They are willing to call you when your table is ready, so that you aren't stuck waiting in the tiny vestibule, the only real waiting area (on a cold, snowy night, it was nice to be able to wait somewhere warmer). Our server did a great job explaining the process to us newbies- write your name on a table-numbered stick, fill up your bowl with your choice of carbs, veggies, meats, sauces, select any extras, and leave your bowl for the stir fry. One of the sticks you can add is for allergy concerns. I wish I had paid better attention to the color coding system for what flavors go together, and will do that next time."}
{"text":"It must not have been good days for them or something, but the times I went to this restaurant the waiters and the person who I believe to be the manager were quite rude. I never encountered a problem like this at other Flat Top Grills. I do like eating there because of the atmosphere and food, but it's just annoying to have to deal with them each time.

Ah, well. Besides the service, the food is decent. Not really clean around the buffet area, though. And the bowl that you get back may not be the delicious creation that you think you made (I mean, I personally don't really know what I'm doing when I pick out each food item). I'd say, go there only if you're really feeling the need to apply your originality. And good luck..."}
{"text":"Flat Top Grill is a Mongolian barbeque, so you pick your proteins and vegetables for a personalized stir fry.  Eat here is definitely a mixed bag.  Here is the break down:

Pros:

- Delicious variety of vegetarian proteins.  Two thumbs way up for going the extra mile to have the variety.
-  Lots of options so everyone, from carnivore to vegetarian to gluten free, can find something.
- Lots of fresh vegetables.
- Try the noodles, they soak up the delicious favors.
- You get what you want because you made it.
- The Roti bread is weirdly addictive.  Eat it when warm.

Cons:

- The restaurant space is open and loud.  Fun for dinner before a show at Sundance, but not good for a date.
- The restaurant has aged poorly.  The tables are damaged and the floors look permanently dirty.  Don't look behind the wok counter.  Just don't. 
- The staff is courteous, but their timing is off.  It can take them a while to bring you your food, so it is cold.  Or, they may leave the check as soon as you get your meal.  Or, sometime, condiments will disappear from your table.
- At $13 for a single trip, it is a little overpriced for what you are getting.
- Never EVER be at the restaurant when they are closing.  You don't want to watch the buffet items and sauces get dumped into bins for the next day.  Just trust me.

Generally, I would say that it is a great concept that has gotten tired of keeping itself together.  

Parking is in a lot across the street or next door in a free ramp.  Plan to park some distance away as Great Dane customers often fill the space.  

Accepts credit cards.

Challenging with children because the buffet is quite high."}
{"text":"I love Flat Top! Sometimes I feel as if I'm the only one, but I had a great concoction on my first visit and I've been getting something very similar each time I go back.
I always start with noodles, add most of the vegetables available (and pineapple), add chicken and top it off with two scoops of peanut sauce, and one scoop of the asian sesame ginger. I also put a few sesame seeds and peanuts on top
And do NOT forget to include the pick for the flat bread...soooo good! Its like a delicious pancake for lunch or dinner.
If you're picky about your food touching other people's food, include the food allergy pick to ensure that your meal is fried on a \"clean\" portion of the grill.
Oooh, and they serve Coke products!"}
{"text":"Great food, but not for the neat and tidy, it might drive them crazy. I would have given them a five star rating, but it's just so dirty in there, that as I walked out, my shoes were sticking to the floor. The food set up, is also kinda dirty. 
The good part is, if your sole purpose is to eat some tasty food, this is good place. 
They also might need more staff, to keep up with demand."}
{"text":"The change to not being able to choose your own meat seriously devalued the restaurant to me. I had been going to Flattop for 5 years and my most recent trip was awful. I was told I couldn't pick my own meat, which was the best part of the restaurant, and then when i gave them a shot to let them pick the meat for me to add to my bowl, it was awful. The meat was very sparse in my bowl, barely any meat overall, and the sausage was not cooked through at all. The manager indicated that this is their new policy and they could not give me any more meat even when I could easily get a much greater amount before their change for the same price. I seriously advise avoiding FlatTop now; extremely disappointing."}
{"text":"I've eaten at two other Flat Top Grills before (wow I never knew it was 3 words before...) and I'm sure most of the reviews below mine have explained how the food and the make-your-own bar work, so I'll simply share a few thoughts about how this Flat Top differed from my others:

- Lots of dining space, far more than I expected, looking in from the street
- Great location, easily found a place to park my car
- Good service, the waiter even kept a stream of punny jokes (based of my initial one) throughout the entire dinner.  That deserves major props in my book!

The only flaw in my dining experience? I felt a bit rushed to leave the restaurant during a late dinner hour.  While I personally would have ignored it and continued on with my conversation, my partner insisted that we leave to be considerate.  Not exactly how I wanted to end a dinner date..."}
{"text":"We've been here twice and love it! First time we had a great time, loved the atmosphere, but had an issue with our food. They were so kind and apologetic and gave us a coupon. We went back and loved it too! Only part I don't like as I am a little bit of a germaphobe is the meat section. Scooping raw meat into a dish sketches me out as the handles seem to easily get touched by other customers with raw meat residue. We love the way the restaurant is accommodating for food allergies."}
{"text":"A good place to fill yourself full of veges and meats... If you don't find it delicious, you may want to try different sauces or possible combinations. Tip: some garlic will make a great difference."}
{"text":"I really LOVE this place in terms of food and the variety of options you have with creating your own stir-fry.   The food is prepared for you very quickly too, even when they are busy.   

What I can't stand about this place is that they ALWAYS sit us directly next to other people.   And when I mean next to other people, I mean right up on top of them.  There is a lot of seating but we always end up next to people, regardless.   It's close enough that you can't have a comfortable conversation with the person you are with.  They need to change that.  Otherwise, it's a great place to have a meal."}
{"text":"This is a great place if you want vegan food. Plenty of vegetables and meat analogs available. Our waitress was friendly and efficient. I wish the veggies could be cooked through. Also the roti and the cooked bowl were really quite greasy. Otherwise very tasty. The different lemonades are delicious."}
{"text":"The Flat Top recently made a change where you cannot put veggies, noodles, sauces, etc. in your own bowl for them to cook.  Within the last month, they put up plexiglass, and you tell someone standing behind the plexiglass which vegetables you want and they do it for you.  That's half the fun - filling your own bowl!  Boo!!  Likely won't return any time soon."}
{"text":"Flat top grill changed the service style now when we go to serve your food you are standing behind a glass separator you tell the person what you want it's like ''subway'' but with a Asian style twist. When u are in line they are rushing you they also don't pay much at tension to what there doing...The food was good also The waitress were all friendly with the customers!!l!"}
{"text":"So yummy cuz I made it myself.

I just finished a box of takeout Flat Top goodness.  The last time I had Mongolian style fare was in Whistler on my honeymoon five years ago, and I loved it today as much as I did then.

I would think it is hard to go wrong when I am essentially making my own lunch.  At least for me.  My husband went yesterday with a group of people and had quite a wait to get seated and started.  He also somehow managed to spoon in ladles of hot mustard in his dish, thinking \"I like hot mustard.\"  It was painful to eat.  He ended up having to start over again with help from staff to guide him to make a more palpatable plate.

Today, it was all about a ladle of lemongrass water, ginger water, Korean BBQ sauce, and peanut sauce, and a touch of the really hot chili sauce.  A ton of veggies I love, enough meat to feel like I'm getting my meal's worth, and a shake of sesame seeds and I was done.  The waiter put some extra brown rice in the bowl, so I didn't have to waste valuable single bowl space with rice.  It was sooooooo good.  And hot.  Temperature is important to me.

I did takeout and therefore chose the 1 bowl option, which was under $7 without tax, $7.57 with tax.  They packaged it up in a very stylish shopping bag.  Like, it's nice and sturdy enough to replace my bare hand to awkwardly carry extra shoes, lunch, and a sweater to work.

Anyway, I work in Campustown, and Flat Top is convenient value for the money.  There seemed to be a lot of folks coming in to sit down for lunch.  Hubby had to wait 30 minutes yesterday.  I probably spent about 25 minutes roundtrip from my office door on Green Street to Flat Top and back. 

I would recommend it for takeout lunch.  It seems a bit daunting for newbies, but they get through the line the same as the rest of us, and the host gave me a short orientation before I built my bowl.  Looking at how the place is designed as an operations model, I could definitely see opportunities to improve throughput.  But eh, I'm not in that business.  I'm in the business of locating the good eatz and then savoring them with gusto.

Which is what I did.  4 stars."}
{"text":"This place is amazing, the food the service and the atmosphere are outstanding. If you like to create your own Stir Fry then this is the place for you. Great selection of quality fresh meats, veggies and sauces. I will definitely be back"}
{"text":"I don't get why this place has gotten such harsh reviews.  While it's nothing special, it's really not that bad of a place to go on a date or grab dinner with friends as it's a new/different experience for many, its got a great location right off of Green, and you'll definitely be able to leave satisfied with a stomach full of some pretty good stuff (that is, if you know what you're doing).

A design your own stir-fry chain, Flat Top offers a wide variety of fruits, vegetables, and protein for your creation - all of which are fresh - and they even provide some pre-designed recipes such as Kung Pao Chicken or Peanutty Lime Noodles.  Personally, I find these recipes are only okay, so I mix and match for myself.

Make sure you load up your bowl (till one extra grain of rice will send the entire thing crashing down), because, while it may look like you have a lot on there already, when everything is cooked, it shrinks in size and you'll be left with half of what you thought you were going to get and don't forget to put a blue stick in your bowl at the end!  It's Roti Prata which is athin Indian flat bread that's really really good!  And they even have breakfast now at certain locations!  I have yet to try it, but I love love love breakfast foods and this seems like it'd be an interesting experience!

The downsides to this place though, is how incredibly crowded it always is.  In order to get a table if you're with a big group (which is usually the case), you have to wait around an hour to get seated and there is hardly any room to maneuver around as the tables are places so close together.  The wait staff is nice, but not always attentive as they're so busy with other customers as well.  Also, forget about coming here if you want to be able to converse with your friends as opposed to shouting across the table in order to be heard.  For the student price and what you receive, I would say it's a good deal and would come more often, but the long wait and packed seating makes it so that I only make it out there maybe once or twice a semester."}
{"text":"The best Mangolian grill I have ever tried in my life, still searching for a better place. And I miss this place a lot now as I moved to AZ. I love their bread which is similar to Indian Paratha. Staff's are very friendly but this place is very crowded over weekends ( off course that shows the food quality)"}
{"text":"Flat Top Grill is one of the best places to go on a weeknight. I have gone with friends and my girlfriend many times and every time it is delicious. Every time I have made my own stir fry which I seem to perfect the more I eat there. Make sure to load up on vegetables and meat because you only get one shot to make it count. For the price you can get four separate meals if you make your bowls the right way. The sauces are good and the bread is heavenly. Get the bread. If you haven't been there yet it is worth the trip."}
{"text":"The fish here was not fresh, and tasted rubbery and 'fishy.' While I do appreciate the fact you can pick your own ingredients, I do expect those ingredients to be fresh. As an avid pescatarian, the white fish was underwhelming and the squid was so rubbery I was unable to chew it. It was very disappointing to have to pay $12.99 for a meal that I did not enjoy. I will not be returning anytime soon to dine here. On the plus, they are usually accommodating for a big group--but who wants to trade quality for quantity when you're paying to enjoy dinner."}
{"text":"Good... If you know what you're doing. Honestly, if you don't choose the right flavors it is going to come out bad. Choose a theme and stick with it. Other than that, the place was a little dirty, but the service was good."}
{"text":"We used to go their and they one price for one trip and one price for all you can eat. WE went their recently and the waitress asked if we had been their and we said yes but not for a long time. She did not tell us that it is one time only now so we did not plan accordingly.  There were also no sign mentioning this change so we paid $13 for a small bowl of food. We dont eat meat so this is outrageous. The waitress said she would bring us rice and never did. This place have raised their prices way too much over the years, is very slow, and just not worth it anymore especially if you are vegetarian! Paid a lot and left starving"}
{"text":"The new process is awful. Instead of picking out your own ingredients, you are served Subway-style, which makes it less customized and MUCH less efficient. 

When I walked in, there was a line out the door. Once I sat down, there were no sticks to identify my bowl, and the server took quite a while to arrive, so I ended up behind a group of 12. Then the new process of communicating your ingredients to staff took much longer. Additionally, they appeared understaffed (for a Friday lunch hour? That seems like a predictable rush time), so everything took longer. (This visit was well over an hour, which seems like a long time for fastish food.) Don't plan on this place for a quick lunch stop.

Most staff were friendly, with the exception of the brusque rice-serving woman who seemed annoyed at her job. (Did you want me to have food allergies? Why so upset??)

I used to really enjoy FTG, much more than others like it (Hu Hot, etc.). However, I don't think I'll be recommending or returning anytime soon, especially with better, local options so nearby."}
{"text":"Sure, Flat Top isn't outstanding, but I find the reviews on here a little harsh. To summarize the place, it's a \"make your own stir fry\" restaurant: you fill a bowl with ingredients (noodles, rice, veggies, meats, sauces etc), they cook everything for you and bring it to your table. Nothing too fancy, nothing extraordinary, but it's pretty good, and pretty cheap too (around $8) especially considering you can go three times for that price (which is probably more food than anyone would want to eat in one meal). So... not a bad lunch option on campus. 3-1/2 stars."}
{"text":"."}
{"text":"I was really excited about eating here, because my boyfriend and I have such different taste.  It seemed like a fun place to go with groups of people, because everyone can get exactly what they want.  The first two times I ate here were okay, but since then things have gone down the tubes.  I'm not sure if things actually changed or if the newness wore off for me, but I won't be going back.

To begin, you can't hear a thing your dining partners are saying.  It must be the acoustics in the building, but it is impossible to have a conversation over any of the tables.

I don't eat meat, so I was excited to get my hands on some veggies and meat-free options.  Alas, most of the veggies tend to be the stemmy parts you don't really want to eat.  I realize this is cheaper for them, but no one wants to eat a bowl of broccoli stems.  None of the veggies ever look all that fresh, either.  

I learned to skip over the faux-meat, which doesn't have any taste here.  It also takes up valuable real estate in the bowl.  If you are going the meat-free route, I suggest adding tofu at the end.

As previous reviewers have mentioned, I've never been able to concoct tasty sauces.  No matter what I do (follow their recipes, invent my own), my dishes end up tasting bland.  Once, I did make some flavorful sauce, but it was so spicy I could barely eat it.  My boyfriend loves the sauce, but I think he just dumps on soy and  teriyaki sauces.  For the record, I can't stand teriyaki.  The smell makes me ill.

The last time I was at Flat Top, another customer obviously didn't pay attention to the server's tutorial and was observed touching one of the sauce ladles to uncooked meat.  This grossed me out so much, I barely ate.  This particular infraction involved teriyaki sauce (we are destined to stay apart!), but it makes me queasy to think about what else goes on at that food bar.

I haven't eaten meat in eight years, and don't have plans to start anytime soon.  Alas, the last time I ate here I spent a considerable amount of time picking chicken out of my dish.  I don't have food allergies so I'm not going put the stick in my dish that says I do, but it's be nice if they cooked all dishes separately.

Again, as previous reviewers have mentioned, the food arrives VERY hot.  I guess it means all the germs from people who can't follow directions are killed off, but it also means you have to sit for 15 minutes (not engaging in conversation with your friends or family, because you can't hear them) before you can eat."}
{"text":"DAN IS THE MAN! Dan has been my waiter for all of my visits at Flat Top and I wouldn't have it any other way! So very helpful, kind, and all around pleasant. At my most recent visit I absentmindedly forgot my wallet, we had taken the bus there and live on the near east side, so it was going to be a snowy trek home and back to pay my bill. A trek I was willing to take, but Dan wouldn't have it that way, being so kind and trusting told me I could pay the next time. I was super surprised and touched that he was willing to take mersey on us. We came to the conclusion that I could call with my credit card and pay over the phone. I got home and called, the woman on the phone was aware of the situation, and also very nice. I made sure to tip Dan handsomely for helping us out in our in our moment of panic. He has defiantly made a long time patron of me. Thanks again Dan!"}
{"text":"We have been here a few times and we enjoy it. They do a pretty good job. The first time we went the place was packed and we waited a good 30 minutes or so before we got our food. I really want to give their breakfast a try. Price is a little high for what it is, but when you want fresh, healthy options this is a great place to try."}
{"text":"Flat Top is one of my favorite restaurants but this location is awful! If this had been the first FlatTop I had ever been to, I would never return. 
I come here quite often since I love Flat Top but this location has awful service and the food is not fresh! I went there today and ordered the green beans, they were dry and they weren't even spicy. I also asked for tofu in my bowl and they did not put any in it even though I put the stick in and requested no meat! 
This isn't the first time I've been disappointed by this location.... :("}
{"text":"Feeling like a mongol? 

Than this Mongolian BBQ place is a good place for lunch. Came here with a group of 4 coworkers. Scenery was definitely better than most places in Madison. This place gives you these sticks you write your name or anybody elses name on it. I was \"Dirk Diggler\" that day. You should have seen the face the waitress gave when she tried to read the name off. I recommend using their suggested ingredients unless you know what you are doing or else you have a big bowl of brown mess. Ingredients in the raw buffet table is sanitary as they do not allow you to cross contaminate the veggies with the bacteria of the raw meat. Lots of choices each experience can be a new one."}
{"text":"You get a lot for a little price and you get to choice what raw ingredient. Appetizer chicken dumplings is not with the price. It's uneven with the menu price so don't order it. The food is alright. A very good price for a whole lot of food. Variety of vegetables and sauce are a plus.  Protein collection is also decent including beef, chicken, white fish, sausage and squid."}
{"text":"Very disappointed. It used to be one my favorite restaurants in the town: fresh food, reasonable price and the freedom to make my own bowl! Now they changed their system so their ppl make your bowl. AND the female server who made my bowl, on oct 26, was very rude! She was rushing and making sure I didn't get too much of the food! I'm never coming back again. I will also spread the words to my friends not to come.

Ps: they charged for extra $2 for getting proteins, which I didn't know until I paid!! And this was very invisible on the menu!"}
{"text":"Good but not great. They changed their menu. Preorder meat and only one combo for 9.99. A lot of food, but dont have the variety."}
{"text":"I've always liked make-your-own stirfry places like this, for the ultimate power to choose how your food came out. This allowed me to keep coming to this place, as I made crappy dish after crappy dish.

Then, I learned to make healthier mixes. Then I learned to make TASTIER mixes. And then, Flat Top Grill became a much more enjoyable place! For the price, few places can match the quality or quantity.

Learn the right sauce mixes, and your experiences here will be gold."}
{"text":"Interesting stir-fry alternative to our hometown favorite bd's. The grill is square instead of round! Pros: All kids meals were free! You don't have to stand and wait for your food to be cooked, just drop it off and it will be brought to your table when done. Many gourmet veggies like asparagus, multi colored carrots and yellow beans. Five different fake meats plus tofu. Pan fried roti. Add the right stick and they will top your bowl with melted cheese! They will make your bowl into soup or a bunch of little mu shu burritos. Cons: our server specifically told us not to make soup! There are tons of sauces but many are mystery flavors like Happy Valley and FTG. No idea how much sauce to add, it all goes directly in your bowl. Very limited spice selection. You can only fill a small second bowl with meat and fish. Shrimp is $3 extra for some reason. Watching your stir fry happen is part of the Mongolian experience. The final major downside is no soup or salad bar :("}
{"text":"To start being carded was funny. But that is what some places do. Flat Top is a decent make your own stir fry. Grab your bowl and fill it up with whatever you like and as much  as you like, Witnessed a young lady prepare enough in her bowl to last a week. But if it fits do it. Place meat in a separate bowl leave on counter and wait for the cook to prepare. Decent food the rice was scary as it looked as if it had been there over night. We did get a freshly cooked bowl and it tasty smokey. Ok place nothing special."}
{"text":"This place is overpriced and bland! I give that flat bread a star best thing on the plate. Takes waay too long to get your food and the options that I picked DIDNT end up on my plate. I will NEVER go there again! booooooo! :("}
{"text":"I've eaten at several \"make your own stir fry\" type of places before coming to Champaign-Urbana, and Flat Top was certainly one of them. Back at home, I was pretty willing to pay the $12-13 for this pleasure since there was a lack of asian restaurants that I really liked.

However, I am now surrounded by many relatively high quality thai, chinese, and korean restaurants that are also pretty cheap, and with that in mind, it's hard for me to justify paying more to eat at a restaurant like this.

Yes, you do have the freedom to build your own stir fry here, but if you don't know what you are doing (which will probably be the case your first time), then you'll probably end up putting too little noodles or too much sauce in your bowl and end up with a mess. Of course, even if your stir fry comes out perfectly, I can't say you are going to get your money's worth unless you are hungry enough to finish a second helping for a mere $2 extra. However, even that has its caveats as if you choose to take home anything you don't finish, you'll have to pay $5 extra which will only promote wasting food in my opinion.

Still, you may be allured by the freedom of handpicking your ingredients every once and a while, and it's a pretty fun place to go to with your friends."}
{"text":"I live in Ohio where we have Mongolian BBQ.  I was told this was better but I definitely disagree after my experience.  The prices are very similar but their drinks are pricey, in my opinion.  Their buffet area is also rather tight.  Their selection isn't great in my opinion either.  Mongolian BBQ blows theirs out of the water. I also didn't like that cooking the food wasn't the \"experience\" that it is at Mongolian BBQ.  One of the women I was with did find a hair in her food so she had to make another bowl which took a long time to do so.  Thankfully, there isn't one in the Cleveland area and if there were, I wouldn't go."}
{"text":"My family loved going to Flat Top Grill for the first time last week!  We stopped by for lunch and got a single serving bowl of greatness. The salad bar style setting lets you choose what vegetables, sauces and meats you want in your stir fry plus white or brown rice or noodles to mix it all together with.  The food came out hot and quick. 

Our waitress was also great! Since it was our first visit she went with us up to the line and explained the whole \"process\" to us, even checking back in with us as we went through the line, without being in the way.

In addition to lunch and dinner, they also have a breakfast service too...may need to check that out!

We will certainly be back to visit Flat Top again! 

Tip: A Fat Free sauce option is also available for those interested."}
{"text":"Flat Top is kitschy and pretends to be a bit more cosmopolitan than a chain restaurant in a midsize Midwestern college town should be.

However, I'm amused at the harsh criticism.  If the food isn't good--guess whose fault it is?  YOURS.

Basically, Flat Top is a gussfied take on the old Mongolian Stir Fry concept.  However, there are pretty extravagant options.  You can get everything from peanut sauce, indian curry, teriyaki, or even the sublimely odd choices of pomegranate basil and \"vindahoo\" (a miswritten version of \"Vindaloo\"--yes, I kept saying \"Vindawhat? Vindahoo?\" until Archana asked me to stop).  There's a huge amount of protein options, a variety of carbs (noodles of various kinds and types of rice).

The drinks are pretentious and overstuffy, but the fruit flavored lemonades are fantastic.  Also, for an obesity overload you should get a pseudo-roti bread concoction on the side.  It's free and DELICIOUS.

Anyway, give Flat Top a chance.  It's well worth it.  Although a bit pricey, it's a bit tasty--if you know what you're doing."}
{"text":"We only come here when the students are gone but we love this place!!!  I just wish it was not on campus."}
{"text":"It's good.  Servers and bartenders are very good.  But I have to say you should go when it is not crowded.  When it is not crowded and they have had time to clean the food selection area it is wonderful.  When it is crowded the food selection area gets very messy and frankly looks unsanitary, especially the meats, with raw meat juices seemingly getting in places they should not.  There is another Mongolian-style restaurant I have been to a couple times where the meats and fish are frozen and the food selection area stays way cleaner.  
Flat Top is kind to vegetarians - preparing their dishes in pans away from the meat and using different spatulas, so the vegetarians can enjoy it here as well as the meat eaters, noting the above.  hopefully they will assign someone during busy hours to constantly clean up the food selection area, and this establishment would move to 5 stars for me..."}
{"text":"I moved away from Madison about three years ago, and I was just chatting with an old friend about Flat Top and how much I miss it! There are a few similar places in and around the twin cities, and I've tried almost all of them, but none of them compare!

I LOVE how Flat Top has the meat fresh and in a separate bowl than your veggies/carbs. They have a great selection of sauces and veggies to add. I also really like how they give you a stick with your name on it so you don't lose track of your bowl. Another positive is the free extras you can add to your bowl. Eggs, flat bread, and tofu! (At least this was the case the last time I ate there). You can also add a shrimp skewer for an added price. 

The service was always great there even when it was really busy. They also have flavored lemonades with free refills which were great! I think i've tried all the flavors. 

Yum, I can't wait to go back when I'm visiting Madison!"}
{"text":"walk us thru the buffet?   quick reduction from 5 stars tho 1/2 in my mind.   never again"}
{"text":"My father used to tell me that if you want to know how hygienic a restaurant's kitchen is, take a look at their bathroom. Because if a place can't be bothered to keep a customer-facing facility like the restroom clean, what makes you think they'll hold half as much regard for the back end?

Flat Top's was not the worst case I've ever seen, but I did want to run far out of that bathroom the second I walked into it. The same could be said of the whole restaurant...it had this ugly open-air setup which felt like a cafeteria lined with tacky decorations.

However my main issue is with the food. The meat was tough and had a paper-like consistency. All the sauces tasted the same. The whole meal was dry, flavorless, and just plain tough to eat. But the most truly unforgivable offense was the blatant disregard for food safety. The buffet from which you pick your food for frying is a disgusting mess.

When you hand your selection of meat and vegetables to the cooks, you stick a wood marker in the food to identify it as yours. My marker was handed to them inside a bowl full of raw meat. When the food was brought out to me, that same marker was sticking out of my meal!

I ended up picking at my food at the sides of the bowl away from the marker, and throwing the whole thing away.

It should come as no surprise then, whether it was a case of cross-contamination or not, that I spent the rest of the day fighting a pretty serious stomachache."}
{"text":"Nice environment and decent prices. There's a nice variety of sauces and meat choices. If you're in the mood for a Mongolian BBQ style meal, this is one of the better places in Madison."}
{"text":"It was Ok. I've definitely been to better \"create your own\" stir fry places. The meats were limited. We only could choose between chicken, calimari and beef. I chose the tofu. It was good, but I really would have preferred some shrimp. The seating wasn't that comfortable. It was just Ok. I would go back for lunch, but not for dinner."}
{"text":"I like the concept of Flat Top.  Healthy, choose your own stir fry.  That said, I was disappointed with it.  

I thought the veggie choices were pretty limited for a place that only does stir fry.  I've seen salad bars that are twice the size of Flat Top's selection.  I went and lunch and several of the veggies were emptied and had to wait for someone to refill them (as well as wait for the little bowls for your meat).   The whole buffet set-up is awkward.  While waiting for rice, I thought I was going to get hit from the kitchen door swinging open.  If there is a line of people at once, there is hardly room to move.  I think one large (long) buffet would be better.

I wasn't aware that you could ask for rice on the side, so I was trying to stuff rice into my bowl with all the veggies on top.  Ack.

The sauces were good--loved the sesame ginger.  I liked what I made, but it doesn't come anywhere near the stir fry I make at home with fresh farmer's market ingredients."}
{"text":"I like this place.  IT is a good bargain as long as you avoid the drinks... but then, the same can be said for most restaurants.  Their selection of ingredients is quite good and the staff has always tried very hard.  We once had a problem with food and the manager quickly sorted it out.  It's good!"}
{"text":"The stir fry is decent. If you aren't very confident in your own stir fry ability, then I suppose this place is a good once-in-a-while excursion (especially the sauces). Provided you don't have any food allergies. Although they claim to cook orders for people with food allergies in separate woks, there have been a couple of times when I or someone in my party got the wrong order. Along with that, there is a lot of mess and cross contamination when people are loading up their bowls.

But if you do decide to take the plunge, the roti bread and the mu-shu options are pretty good. $15 good? Maybe not for me."}
{"text":"I came here for my 19th birthday after having great experiences in my hometown and this was simply awful. They wouldn't take my birthday coupon for a free bowl due to a $3 automatic discount they were giving out for their anniversary that I wasn't allowed to opt out of. We arrived at 7 pm and did not leave until 9 pm because of the slow service. I ordered a cinnamon roti for dessert referring to the cinnamon fresh fruit roti (the only roti item on the dessert menu) and I ended up receiving burnt roti bread with cinnamon and ice cream and no fruit. I then told the waitress that was not what I ordered but she did not take it back or give it to me for free. Overall, a restaurant that I've always had great experiences with really ruined a birthday dinner."}
{"text":"I love this place! It has options for everyone so you can come here with vegans and meat eaters and no one goes away hungry or lacking veggies or meat etc. The bread is pretty awesome! The wait staff is always friendly and attentive. What I love the most about this place is the wide selection of sauces and veggie proteins. I also like that if you have a food allergy or want your dish cooked separate, it's so easy to put a white stick in the bowl and not have to worry about getting surprise meat in your dish (especially if you're vegetarian/vegan)"}
{"text":"I really wanted to like this place but unfortunately it doesn't really do it for me.  I'm not sure what it is, as they seem to have everything necessary for a successful mongolian grill experience.

Lots of ingredient choices, lots of sauces, friendly staff and quick service.  They even have stuff I've never seen at a place like this, such as seitan and tempeh and Quorn.  Yet somehow, both times I've been, my meals have been just kinda... bleh.

The thing is there's a lot of variance because everyone can customize their food and should be able to achieve completely different results.  So if you're interested I recommend giving it a shot.  For me though, I think I've been enough."}
{"text":"As far as Flat Tops go, this one was pretty decent.  We swung in on a Saturday morning for breakfast.  The pancakes here aren't nearly as good as I've had at other Flat Tops (in Chicago) and they screwed up my scramble by deciding I should have an omelette instead.  They also make the roti a bit thicker than I've had elsewhere.  Still good, but I definitely prefer a thinner one. It was pretty quiet in there and it took quite a while to receive our pancakes.  Overall, service was sweet and fine.  This definitely isn't the best location I've been to and I'm not sure I'd rush to go back to this particular one.  I am a huge fan of Flat Top, but I'll stick to the Chicago locations."}
{"text":"I love Mongolian grills, and have had some great experiences at other Flat Top Grills (FTG), so was excited to take The Fiancee to this one. Unfortunately, it was a sub-par experience.

We came in, and things were just fine. We were seated quickly, and the waitress was great. We went up, filled our bowls, and then waited for the cooks to take the bowls, which is when it started to go downhill. At other Mongolian grills I've been to (Flat Top Grills and several other companies), the cooks are always really personable, fun, and interactive. Here, the lone cook didn't even make eye contact except to say \"Just leave it.\" He wasn't even busy at that moment -- it was just The Fiancee and me standing there, and nothing was on the grill.

The food came quickly, once he put it on the grill, but it was disappointing. Now, obviously, I created my own meal; however, something happened between what I put in my bowls and what was delivered to my table. That is to say, I'm something of a sauce-fiend, so, whereas FTG's instructions say 3-4 scoops of sauce, I mix at least 10 scoops from a variety of the sauce choices. Understandably, then, I was incredulous to discover that my meal was DRY and nearly flavorless, as though they hadn't put any of the sauce concoction I'd created onto my meats, veggies, and noodles. I don't know where all that saucy goodness went, but it wasn't onto my food ... It turns out that The Fiancee had the same issue with hers (she had done 4 scoops of sauce) -- it was dry and not very flavorful. 

For my 2nd serving (yes, I went back up for more -- I was still hungry!), I tried to avoid the dryness by using fewer noodles and veggies but keeping the sauce portion the same. I also switched from the rice noodles to the \"Chinese Yellow Noodles.\" Well, the meal was slightly saucier and tastier, though not much, but the yellow noodles were just simply awful. Soggy, creamy, mushy, ICK. I just got grossed out thinking about them again!

Needless to say, The Fiancee and I were not happy with our FTG experience this time around. I'm sure we'll try once more (we all, even restaurants, have bad nights), but right now, I have lost my appetite for the Flat Top Grill."}
{"text":"Excellent food but my friend and I asked for bread multiple times without receiving any. Needless to say we received very neglectful service"}
{"text":"Came here for breakfast-tranisition-to-lunch, but what was nice was that we just had to pay one price to try out both selections.  However they charged us all for the multiple-plate deal even though I didn't partake in it, which wasn't really too much damage (just a dollar more), and we all got student discounts despite half of us being young looking alumni.

I think it all evened out.

Breakfast was interesting.  Couple of guys had omelets, the girls all got pancakes (which prove useful since they could try the lunch after), and I got an egg scramble with loads of veggies, which counteracted all the beer and fat sandwich tasting the night before.  Right?  Unlike lunch, they set out a bunch of sweet stuff to go in the pancakes, like chocolate chips and nuts.  You also get fresh fruit with the meal for free.

Protip I did not know: all the little sticks for extras come with what you pay.  I wish I had got some sausage.  Also, I barely got any hash browns.

Lunch came around but I was stuffed.  We did discover some things: if you use the soup stick, you don't get a side of soup; they turn your ingredients into a soup.  Also, they have longganisa!  They call it Filipino sausage, which it is, but I was extremely excited to see some love for some of the best Asian food no one's tried.  It's leaner than the kind I usually have, which makes it a bit less authentic, but probably healthier.

Overall, service was ok, but we didn't receive much instruction despite it being the first time for most of us.  My breakfast turned out all right, though I can't see if they did anything special besides scrambling my  ingredients with eggs and serving it to me.  The lunch seemed a lot more interesting with all the sauces and longganisa, though I think we did the right thing by trying both in one seating.

We were also pretty hungover, so that helped."}
{"text":"Worst stir fry I have ever eaten.
The selections are bizzare (pomegranate basil??) and the \"sticks\" are useless if no one tells you what they are and misleading. The final result was disappointing and tasted awful.
If you want to experience \"make your own stir fry\" I recommend Northbrook Court's \"Stir Crazy\" or Ann Arbor's \"Mongolian Barbeque.\" Much better. Cheaper. Tastier."}
{"text":"This is an interesting place. At Flat Top Grill, you choose your own starch, vegetables, meat, and sauce and the staff cooks it in front of you. So if you mix things that shouldn't really go together, it doesn't taste right. On the other hand, if you know what you're doing, it might taste better. They do provide popular ingredient mixes to give you a baseline if you're completely lost.

So, the best thing about this place is the all-you-can-eat. You pay 1 or 2 bucks more to do buffet style, rather than just get one bowl (which can taste bad if you mess up). A great deal. My favorite, however, is not the unlimited stir fry you can create, but the nan bread that you can have with each bowl you make. 

Overall, neat idea. I approve."}
{"text":"I'll be honest and say I never thought I'd be writing a negative review for this place.  I have always enjoyed the atmosphere and the food has always been pretty good.  It has been so good that we went so far as holding a graduation party for my girlfriend's son at Flat Top.  There were about 40 people in the group.

Today, I went there for lunch as I do from time to time.  After being seated, I was told that someone would be walking with me through the food buffet line and choosing how much of each item I would be taking.  The server told me it was for \"cleanliness and controlling inventory\" because some people were wasting food.

I am 58 years old and believe it or not, I am capable of knowing how much I can eat and I am a good boy and always eat everything on my plate.  I have also never gotten malaria or ebola from eating there or at Hu Hot, which has the same Mongolian Style barbecue at its restaurant a few miles away.  If you don't know about it, check them out on Yelp and give them a chance.

From now on, I guess I'll take my chances with the health risk issue and eat at Hu Hot.  Its a little longer drive, but I like choosing my own food."}
{"text":"Flat top has changed their \"self service\" system to a \"we stand behind a glass and you tell us you want system.\"  So basically they're now the \"Subway\" of \"Asian Fusion\"  restaurants.    They claim it's for sanitary reasons.  However, it doesn't really feel like that.  The waitress told us we could ask for more toppings when we were up there.   However, when we went up to get our food, we were hastily rushed through the line, and basically given a feeling that they didn't want us asking for more.   I also noticed they gave one girl (who happened to be quite attractive) in line more service and time to choose, while rushing every one behind her to pick and move on.  If this means I am quite ugly, so be it.  I'm not into men either.  

When we came back to our table, we found two people sitting right next to our two chair table.  This may sound like a petty complaint, but the place place was very empty.  They could have seated them a table or so away.  It felt like we couldn't enjoy a real conversation with out listening out there's too.   

I also noted a lot of unhappy faces from the waitstaff.  The servers morale seemed pretty low from all of this changes, and it shows in the service.  I also noticed the costumers across the room seemed pretty disappointed in the changes, and overall atmosphere.  

DATE of visit:  9/5/2014."}
{"text":"Flat Top Grill is a new addition to campustown. allowing you to create your own stir fry from a variety of interesting ingredients and sauces. You put all your ingredients in a bowl, add some sauce, and perhaps pick a custom option such as having your stir-fry as soup or in a peking pancake. The variety of sauces and options allow you to experiment with fusions- Indian, Thai, and Chinese options are available.  I had snowpeas, spinach, cilantro, carrots, pork, and a heap of spicy vindaloo sauce with an Indian roti pancake, which was delicious and filling. However, quality varies...sometimes the grill will overcook the food or mix it with someone else's (yuck!). Overpriced stirfry? Maybe...most of us could do better at home. 

When your dish is done they bring it to you. Service is good and you can also get drinks and appetizers if your stir-fry isn't enough. While it is a chain, it seems much fresher than nearby Noodles & Co. The major problems? Vegetarians get a bowl of what is essentially vegetables and sauce, which is not a good deal for the price. Crowds can also get horrendous, so make reservations for evenings and on weekends.

I also recently tried breakfast here, which really wasn't worth the price. You can get french toast, omelets, pancakes, and scrambled eggs with add-in. There are also snacks like fruit and muffins for while you wait. My scrambled eggs were more like flattened eggs because of the amount of cheese they added and the french toast was a little boring. Not worth 8.99 unless you are willing to eat a lot."}
{"text":"There's nothing particularly unique about this Flat Top location compared to all the others, but that's no surprise from a chain restaurant. The size of the space is good, the waitress was really nice (automatically gave us the student price - which itself wasn't terrible for a sit-down restaurant), and it all seemed to go as it should at Flat Top.

The concept itself isn't bad; when I was younger I thought Flat Top was the ultimate in food fabulousness. Now that I've been in college and made more than enough \"let me throw every thing I can find into a pan with some rice and soy sauce and call it stir fry\" meals, the excitement has worn a little thin. Of course, the vegetables are much more varied and fresh, the sauce selection is massive (just don't think about Sauceman's from Tom Goes to the Mayor), and they give you lots of special options that most college students probably wouldn't be able to do. Plus, you know, not having to cook or clean dishes yourself.

I like the place, I'd recommend it to people for what it is, and I'd certainly go again myself. Also, I've heard good things about their breakfast...maybe next time?"}
{"text":"I have been here three times and only enjoyed my meal once.

The staff is great and the concept is fun but I just can't get into mixing sauces and finding the right combination. I almost wish they had recipe cards or something. 

One thing I do love eating there is the flat bread ;)"}
{"text":"Meh. The recent change to precooked meats ruined the texture and the fresh concept. I have been to many locations over the years. Not sure I'll be back"}
{"text":"My boyfriend and I went to Flattop for a late lunch around 3 on a weekday. There were 2 other tables in the whole restaurant and one server and one manager. The experience started off well and we got our drinks and food quickly. (We did have to ask the manager to refill one of the veggies while we were making our bowls). After we got our lunch, the waitress disappeared! 

We needed drink refills and she was no where to be found. The manager seemed to be more preoccupied with chatting with other employees and looking at his phone. We sat with empty drinks for almost 10 minutes and I had to flag our waitress down finally to ask for a refill when she reappeared. Then we had to wait another 5 minutes with empty cups and had finished our food when she brought the refills. 

It's upsetting to pay so much for a fountain beverage and then only get one cup. The food is usually pretty consistent here and it's too bad that they never deliver on customer service."}
{"text":"\"Not all chain restaurants are created equal\" should be my new mantra after this weekend's visit to the Flat Top in Champaign.

1. I don't understand how the street with all of the restaurants and bars can be considered \"on campus\" but that's really neither here nor there.  I went to a school where if you wanted something (decent) to eat, you had to take a bus or drive to get there.  I guess that's a win for U of I students.
2. The location is easy to get to (see point 1) and there is a lot of other stuff around it too.
3. It's a larger location, which is nice.
4. Service was friendly and as quick as it could be (you are pretty much at the mercy of the cooks, no?)
5. I found that the spread of veggies at this location seemed smaller than others.  Even some of the veggies that are listed on their \"signature\" recipe card were missing.  I would much rather see the \"staple\" veggies than the seasonal berries and figs.  Who wants to put berries and figs in their stir fry anyway?
6. The staff was working hard to make sure that the sauce counter remained clean, which I can appreciate, and understand its hard, especially during move-in time at a large university when you have a lot of unruly hungry families around.
7. Gave us the student discount even though my sister hadn't gotten her ID yet.  +1."}
{"text":"Been a long time customer. Overall love the food. The first time I didn't because I didn't know what type of sauce combo I wanted. After some experimentation I got it down!

They recently went through a change in how you go through the line which makes it much more sanitary. After that all of my complaints were gone. 

I typically go during off hours, waits can be an hour plus Friday nights but once I'm seated the food comes surprisingly quick."}
{"text":"This place used to be much better, but it seems they recently raised their prices significantly while also making the size of the bowl you get for stir fries much smaller. I really like someone making my stir-fry for me, so I'll still drop in for a to-go order occasionally, but when I lived in Chicago (and prices were better) I used to come here at least once per week. Service for to-go orders is terrible, but the staff is generally friendly. Still, it used to be far more worth the trip."}
{"text":"Flat Top holds a very very special place in my heart. Back when we were in high school, groups of us would wheedle and deal in order to secure a car, pack it full (ah, the days before there were limits on teenage drivers and their passengers), and drive it 20 minutes over to the newly opened Flat Top by Northwestern. We totally felt cool because a) we were on a college campus, b) this do-your-own-stir-fry was a total novelty, and c) it was fun coming up with new combos...that we had made up.

Fast forward the years. Flat Top has apparently now opened a location steps away from UIUC. And it sucks. It sucks pretty bad. I hope it's an anomaly rather than a decline of the chain as a whole. Or maybe it's always been this way and I've never noticed??

I decided on Flat Top for lunch because some of the other places I wanted to try were closed in preparation for the upcoming school year. And I seemed to remember that Flat Top was pretty quick. I was wrong.

*Waited awhile to be greeted. It seemed to be short-staffed, which I kind of understand because it's summer, plus they opened 40 minutes earlier. But noon was in 20 minutes...is this how you usually roll?
*The hostess couldn't decide where to seat me...a lone diner all by myself. She veered from the front where there were several groups. She was going to seat me at the high-tops, but given that there were several pairs there, veered from the empty ones. She then seated me...in a corner...all the way around the back. Uh, ok.
*Seriously, if you don't know what you're going to put in your stir fry, back up a little instead of blocking the area with your nose pressed up against the glass guard and your head whipping back and forth reading the sauces. Or loiter in that extra empty space to make a decision. I understand you're here for orientation for your kid or something...but some of us have power lunches.
*No employees at the stir-fry station with four or five already on the grill and four or five lined up to be placed on the grill. However, they do let you go thru the line again to make another dish while you're enjoying the first one to save time if you're doing the unlimited option. 
*Needless to say, it took forever to get my first dish...15 minutes. And then my second dish came two minutes after...which was brought by the original hostess who said confusedly, \"I thought you were dining alone?\"
*The ingredients were AWFUL. They just opened for the day...but it was so obvious that the ingredients weren't fresh! The baby corn and bamboo shoots had a distinctly sour taste to them. Green peppers in my stir fry when I never put in green peppers. Vegan meat dry, rubbery, and tasteless. Even the beef had the sour taste of it standing around being marinated in its own sweat for hours. The squid was rubbery. And I think they use egg substitutes because that definitely did not taste like normal egg. I have to say that the tofu was okay though.
*If you're sitting back to back in the booth chairs, they're pretty flimsy. The kid behind me kept shifting and I could feel every thump he made. It drove me nuts.

So. The only reason why this place didn't get one star? Julia, my waitress. She was calm, efficient, and kept up a running conversation as she moved from table to table. She's quite the lady...knows a lot about obscure UIUC stuff and is super friendly to boot. Once she realized that I was on a schedule, she even offered me the check early so I didn't have to wait for her in case she got held up. Really awesome...thanks! $8.99 for a one bowl lunch, $9.99 for the unlimited option. If you're a student, you get a $1 discount.

Thanks, Flat Top, for shattering a high school memory."}
{"text":"Overall, my first experience at Flat Top was fine. 

Positives: 
-The ambiance and restaurant cleanliness overall TRUMPS HuHot over on Junction Road. I found myself several times at Flat Top saying, \"This place is so much better than HuHot.\"
-Raw meat does not sit out at the buffet area. I liked that I had to choose the protein ahead of time through the server.
-Various types of grains are available. I actually went with the quinoa in my dish.

Neutrals:
-The popsicle stick organization method is sort of dorky, but it seemed to work.

Negatives:
-Our server did not tell us that plant-based proteins were available at the buffet. We already discussed with her that we were first-time visitors, yet she only ever explained the animal-based proteins as protein options. I'd already told her my animal protein selection, and then saw later that the buffet had plant proteins.
-Don't order the white fish as your protein. If you know fish, then you know a very fishy-tasting white fish is not good. :-(
-Are seconds available? I wasn't sure if I could go back to the buffet for round two.

All in all, my experience wasn't great and it wasn't bad. But it was definitely better than HuHot!"}
{"text":"Breakfast here is usually hit or miss. Today it was all the later...

Undercooked pancakes and omelets were the norm; I never received a  plate that was cooked well. The potatoes were soggy with oil and I never received any bread despite requesting it every time.  The wait staff was serviceable."}
{"text":"what t.j. said. :)"}
{"text":"Very good Mongolia grill! Taste is really great , lots of sauce and ingredients that you can customize yourself ~~
Love the small colorful sticks that indicated u want to add eggs, cheese, roti, etc. That's something the other Mongolia grill doesn't have :)"}
{"text":"I'm quite surprised at the low reviews. This place is a gem and very reasonable for lunch (all you can eat under $10 with student discounts). The food was fresh and I appreciated being able to make my own noodle dish, rice dish or soup out of the buffet. I wish we had these in California. Don't know why but they serve fresh Roti too."}
{"text":"a real disappointment. I went there because it is one of the few restaurants in town that will cook gluten-free. However, the food was extremely bland and really overpriced for what you get. My mom asked for tofu and there were about 4-5 tiny little pieces thrown in. The service was friendly, but it seemed to be rather disorganized. Figuring out how to make your own stir fry was complicated enough. And I heard that they mix people's orders up a lot and don't pay close attention to the \"allergy\" sticks. The place was also very noisy and crowded. I had food left over but didn't even want to save it because I don't even want to waste the calories eating this very tasteless food. Overall, a really lackluster place."}
{"text":"I've been to a few restaurants with this theme in cities much larger than Madison (the \"put all sorts of raw veggies and meat in a dish and then they cook it for you\" theme) and while the others impressed me more, this one certainly did the job as the only place for this in Madison.  Creating exactly what I want in a stir fry from a wide range of vegetables and sauces is fun- as much as I cook at home, I certainly won't have all of these ingredients at once, it won't be ready to eat in minutes, and I won't get the amazingly buttery roti bread on the side. 

The lunch prices are good ($7ish, I think) and the dinner student discount is great ($10)- if you're ever tempted to eat terrible A8 or Jade Garden, spend the same amount to NOT get gross meat, greasy rice, Styrofoam, and anything you want."}
{"text":"Please note that If you aren't a college student then this place is NOT really expensive!

Flat Top is a chain, but it hasn't made it to Michigan yet (darn).  When I'm in town for work, I strong arm my local friends into coming here for lunch.  We usually do the one trip because of time constraints.

FT has a very nice selection of veggies and unique sauces.  The protein choices are regular, but fresh.  Yes, you pay a little extra if you want shrimp, and then they only give you a skewer... so stick with the chicken if you're cheap.

What sets FT apart from the Mongolian-type places in Michigan is that you choose how you want your final dish to turn out - in a hot and sour soup, in a vegetable soup, on top of a salad, moo shu style, or just regular stir-fry in a bowl.  I've gotten the veggie soup my last couple of trips because I think the broth goes very well with the sauces I choose (spicy hot and savory, not sweet).  And their flat bread is amazing.  We always ask for extra, extra, extra!"}
{"text":"This place is amazing!! I love the fact that you can create your own stir fry and try all the different veggies, toppings, etc and find the best combo! I LOVE the bread that comes with it too!!!"}
{"text":"The food was decent and well-made, but I don't really think I'm getting a great value.

Their servers load the bowl for you, which isn't really how I want to experience what should be a buffet-style restaurant. 

Also not a big fan of the nickel and diming. Want meat? $2. Another bowl? Cough up the change. Extra meat? Shell out the cash.

I don't control portions, yet I get charged for another bowl? Think I'll opt for a different restaurant next time."}
{"text":"I've been here twice for dinner, and they have a rather... conspicuous approach to business.

First, the food is arranged so that the granularity increases. That is, the line moves so that you have to fill your bowl with foods of smaller granularity before you can get foods of larger granularity. Basically that means that you won't be able to fill your bowl with as much food. Think of packing a jar with sand first and then with golf balls versus golf balls first and then sand. 

Bottom line: the deal you think you're getting by going to a place that lets you pile on food, is not a deal at all. Dinner is ~$13.20 with a student discount. If you want a commensurate amount of food for what you pay, just go through the line backwards. Or go out the door. You can get plenty more food with that amount than you can at Flat Top. Example: 2 giant Chipotle burritos. Flat Top would make more sense if it were $10 or less per bowl. But it's not. 

Second, they got rid of their unlimited bowls option. I guess they realized it wasn't a good business model. So if you want more food, you can pay $4 on top of the price of a bowl for one more bowl.

When businesses make their profit visions as visible as this, I feel a little cast away. I like it better when I can ignorantly throw money at things.

Anyway, Flat Top is probably one of the best places to eat vegan on Green St. I have never before in my life seen so many vegan \"meats\" of so many different kinds. They have seitan, tempeh, quorn, vicken, and a lot more. Some of these meats are curry or bbq flavor. They also got that quinoa for some protein. They also make it super clear which food items are vegan; there's a giant blackboard behind the counter that let's you know. It's so cool that a Midwest chain put so much care into providing vegan options. I never thought I'd have to opportunity to try so many kinds of vegan meats in such a short amount of time."}
{"text":"I've been there multiple times and I've been equivocal with my reviews.   Tonight made me go as low as the rating system goes.  The food was the same as always and there is (in my opinion) no one  to blame if you don't like your food, since you make it yourself.  Tonight, however the service was absolutely terrible.  It took over 45 minutes from the time we set our food in the \"queue\" for the grill masters, to the time the food came.  No explanation could be given for the slow grilling time, and it was not that busy.  On top of that, a manager stopped by after I mentioned it took 45 minutes to get our food, and he said he would go investigate...he never came back and never followed up in any way.  All in all, it took us over 2 hours from the time we entered until the time we left.  The last holdup was the payment--it took the server over 10 minutes to bring my debit card back after I gave it to him.  Just really poor service all around by multiple people. We won't be back."}
{"text":"I'm opposed Mongolian grills in general, but Flat Top is the better of the available options. If you go for lunch, it's actually a good deal (dinner is exactly the same except for more money). The breakfast option is a nice twist (add lots of crap to your pancakes or scrambled eggs). Two stars since I'll never actually WANT to go there, though I'll be willing to go if friends really want to."}
{"text":"Screw Mongolian.... who needs that when you have the mothership of all stir fry right here in Hilldale Mall? Get that bowl and turn it into the eiffel tower of munchie madness. Oh. And do you like bread? How about pancakes? eat their flat bread and you will never want to leave until you have gained about 600lbs. Mmmmmmm thank you jesus"}
{"text":"Very vegetarian-friendly.  They cook vegetarian meals on a separate part of the grill.  Basically, you fill a small bowl with rice, noodles, veggies, meat substitutes (they also have meat options), and add the sauce of your choice.  You can make your meal into a soup, lettuce wraps, or mushu wraps.  Great concept!  They also have an unlimited option, but I find that one bowl is usually more than enough.  You can also add tofu or eggs to your dish as well.  Priced a little high for non-students."}
{"text":"This is a great place to come if you aren't in a rush, but need something relatively healthy. The vegetables are usually fresh and well-separated. Meat is abundant, as are a wide array of sauces. The service is decent, but at lunch expect a bit of a wait for seating and then actual eating.

My one recommendation care of friends and loved ones is to not get potatoes. They will not be fully cooked and consequently, the food will taste kind of nasty."}
{"text":"Overall this place could be good but is just a disappointment.  They have a great selection of vegetables, meats, sauces, and other ingredients, but even when following their \"recipes\" the food isn't that great.  It was extremely salty and just not very impressive.  I think that the grill maybe got my food mixed up with someone else's food maybe, it just wasn't good.  Overall it was edible but I would never go back for the price I paid for salty, mediocre stir fry."}
{"text":"I went to Flat Top Grill last night on a date, and I really enjoyed it! 

This was only the second time I've ever really been to a stir fry place like this, but I thought their selection of veggies and such was pretty good. Everything I chose to put in my bowl tasted pretty fresh. I was kinda confused about which sauces to use, so I chose from their suggestions. I had the sweet and spicy sauce, and I really liked it.

They don't really have a wide array of appetizers to choose from, but I don't think that's supposed to be their specialty. I'm generally an appetizer person though, so I had the shrimp summer roll, it was light and tasty. A good opener for the meal.

As for the atmosphere, I found that great too. It was pretty crowded while I was there, but the tables are far enough away from each other that you don't feel like you can hear everyone else's conversations, i really like that.


Also, a student discount is always a plus.

I would definitely go back again!"}
{"text":"The food is pretty good. The prices are kinda shitty. The organization and constant screwups is what turns a potential 4 star into a 2 star. The last 4 times I have gone at least one order has been messed up, usually more.

Issues range from the meat bowls being entirely mixed up between unrelated orders or forgetting to add the bread to them mixing up how you wanted yours served, like turning it into a soup. Depending on what the screw up is, you'll have to remake your entire bowl and wait a good 30 minutes, made even worse if you are dining with people whose orders turned out fine and will either have to wait for you or just go on ahead without you. They'll usually comp your meal to some degree, but it's still not really worth it. 

The inside of the restaurant is terribly laid out. Some space is completely unused, whereas the food bar area where you create your bowl is so cramped it's uncomfortable. Foods are jammed so close together they inevitably get mixed, including the sauces and meats which could be a big issue for people with dietary restrictions (especially considering that they seem to try to make it a very accommodating experience to such people otherwise)"}
{"text":"It's all about customization here.  You can create one bowl of stir fry goodness or for $2 more, an unlimited number of bowls.  After assembling various grains, veggies, and meat, you have the option of putting other add-ons into your meal, represented by different colored sticks.  I've always been a fan of the blue stick - roti flatbread (beware: it is kinda greasy).

This Flat Top has a roomy interior, but the L-shaped buffet bar is cramped.  They always have exotic beverages here, like desert pear, pomegranate, or chipotle pineapple lemonade, margaritas, and mojitos. Refreshing and trendy!"}
{"text":"I have to hand it to ya, Flat Top. The people spoke, and you listened. Not only that, but you reached out to me individually (and to others) to address my concerns directly. Kudos. 

This location has gone back to the old-school setup, which allows customers to select their own items and fill up their bowls--allowing you to select exact items and amounts that you want of everything. The buffet is well-labeled and kept clean, and I felt good overall about that whole setup. 

In what I would also consider to be a wise move, they've also removed meat from the buffet (why was raw meat ever accessible to customers?). Instead, you note on your table stick which meat(s) you want, and you can mix and match without extra cost (other than shrimp, or if you want double meat). 

The colored-stick system is also back, which makes it much clearer what options are available. 

I would still like additional guidance on sauces (how much to use, favorite combos, etc), but the overall system and setup is vastly improved. Thank you!"}
{"text":"I used to enjoy going to Flattop however they have recently completely  changed how they operate. What was before a self serve operation where you pick all your own ingredients  from a buffet style line and they cook them has now turned into Subway. The service is incredibly slow and awkward.The staff makes you feel rushed so you never actually get what you want. Additionally , the music is so loud it's hard to and communicate with the people behind the food line. The servers claim the new policy is for sanitary reasons and imply it's some sort of legal compliance issue. It's pretty clear though this is just an attempt to maximize profits by preventing people from over filling their bowls. If it wasn't,
 why are there still salad bars and buffets at the grocery store? It's obvious this new policy is failing, I visited on a Friday evening and the place was dead.  You could tell the staff was demoralized and just dreaded having to explain the new policy. If the change is due to cost of ingredients  I'd be happy to pay a bit more, but what they've done here is completely destroy  everything that made Flattop unique. Unless they change back to how it was I'd recommend going to Hu - hut instead. That's what I'll be doing."}
{"text":"This restaurant is not good. All of my chicken was burnt in my stir fry and the service was terrible. The waitress made me pay $13 even though I just wanted to share food with a friend because we were not that hungry. I would not go there again because you're paying $13 for a small cereal bowl of vegetables."}
{"text":"The food is alright, but it's probably only worth the price if you get the discount with student id, have a coupon for half off, or have a coupon for a free stir fry.  

Have been there a few times in the last few months (because I had a coupon for a free stir fry), and the service was terrible each time.  The waiter forgot to bring water/drinks to the table several times, after walking by and reassuring us that he'll be right back with water.  

The waiter never came to check up on us throughout the meal to see if we needed anything, and we needed more water at several points.  As for my food the last time, it was not that great.  The sauce combo that i made was not good, and i should have had one of the servers mix my sauces (make your own sauces can really be hit or miss).  Finally, when we asked for our check, it took our waiter another 20 minutes to bring it, then another 10 to bring a carry-out box.  

Overall, the stir fry is decent, but i would recommend having a server prepare your sauce mixture (whenever I prepare it, it never comes out quite right), and prepare yourself for not-so-great service because the servers are mostly college students who are working for mediocre tips."}
{"text":"My husband and I go here frequently. Are there better specialized food options? Sure, but for a chain, it's quite decent. It's easy to get in and out, and it's perfect if you're picky, because you can build your own. There are also a lot of interesting options as to what you can add, and there are a lot of vegetarian and vegan options without feeling like you have to settle. I agree with another reviewer that going backward is helpful. I always put veggies and other things on first, then I put the noodles and rice on top. The noodles and rice stick well, whereas the rest of the things fall off easily. The flavoured teas and lemonades are pretty good too, without being overly sweet. 

What I am really going to talk up is the service. We've never had bad service anyway, but today I am incredibly thankful for the caring attitude of the staff. My husband ended up being rushed to the ER right before we started to eat. The waitress immediately asked how she could help when she saw he wasn't doing well. The manager came out to help, everyone came flooding out from everywhere to help, to get him cool rags, to wait outside for the paramedics while I stayed with him."}
{"text":"I was excited to go here because I heard rave reviews...it was okay.  I went for lunch because I heard that dinner portions are the same as lunch, but a few bucks more.

The service was okay, but I think it was just my server.  She wasn't friendly at all, and made it seem as though she was burdened by being our waitress.  Didn't see a smile.

You choose what you want to get cooked (rice or noodle based, they have a good selection of veggies and vegetarian \"meats,\" other meats: pork, beef, chicken, mussels; shrimp is an extra $1) and the sauce combo, which was slightly daunting, but a friendly worker was there to help suggest combos.  The food took longer than I hoped because of the lunch rush.

Lunch w/ student discount is about $8 for one bowl.  (they have an unlimited bowl price for $3-4 more)"}
{"text":"Not my thing.  I feel all bloated and greasy after eating here and I never seem to make a combo bowl that is really satisfying.  I'm not going to go into any more details about this."}
{"text":"I agree with everyone.  Quality has gone down on the food and the selection.  But our service was excellent.  Not sure if we will return."}
{"text":"AYCE breakfast for $9.99? yes please! this is the first time i've had breakfast at flat top and i was pleasantly surprised. lots of items to choose from. you can get eggs scrambled or in an omelette. there's pancakes, french toast, etc. the options are endless. 

service was alright. our waitress was a little too chipper for a sunday morning which got on my nerves a bit but thats not her fault. i was just trying to recover from a crazy saturday night. =P"}
{"text":"Why do I like Flat Top?

1.  Veggies are fresh
2.  Service is good
3.  The space is comfortable, bright and very clean
4.  Sauces are interesting
5.  Prices are VERY reasonable
6.  Meat is fresh and tasty
7.  Its different
8.  Lots of choices
9.  Bread is good

The caveat is that I have not been to any other Mongolian BBQs before (if thats the correct comparable as others have stated).  

Is it the best place I've ever been?  No.  But it does well what it sets out to do."}
{"text":"Try the red curry sauce. Roti was ok. Good service."}
{"text":"Update: I guess they're closed now. More than one person must have thought the changes weren't the best.

Food: 1
Service: 4
Uniqueness: 3

----------------------------------------------------------------
My wife and I used to regularly go to Flat Top before they completely changed their layout. You now can't truly customize your bowls as they flipped out the bowls for sticks. 

Also they got rid of their best meat option - the vietnamese sausage. Sad life..."}
{"text":"The first time we went to Flat Top was great. We had a large group of our family and some we're vegetarian and some we're not do this place for all of our dietary needs. However, we Haven't been back in a while because during the next couple visits it got to where it would take 30-45min to get food and the last time it was dirty, tables, floors and seats all had food particles all over. On out last visit, and it will be our last, our food came quickly but it wasn't even cooked. Most items on the bar were still frozen and were all but thawed when arrived at the table. When we said something to our server, she said that is how it should be. Great concept but this location is doomed if they don't get it right. Can't believe it's still open. We didn't finish out lunch and walked next door to Penn Station for lunch. Flat Top went from great to Very disappointing"}
{"text":"Used to love flat top, especially being able to select my own ingredients.  The new format of having to tell an employee what and how much I want of an item is annoying at best. It would be the same if a restaurant had a salad bar and you had to ask a server what to put on your plate and how much.  

Also have noticed a downgrade in quality of ingredients.  For example no red peppers only free and the meat looks as if it were frozen and in the past that was not the case. 

It's too bad because this was one of my favorite spots to hit up before/after shopping or a movie at Hilldale Mall."}
{"text":"***Full Disclosure: I used to work for Flat Top Grill for nearly six years until April 2011, spanning its old and current ownership, but not at this location***

My buddy Sven and I came to town the other night and decided to stop in for dinner.  He had been eating unhealthily all day and we both knew that FTG was a place to both eat healthy and make yourself a large quantity of food for your money, if that's your sort of thing.

We stopped in around 8:30 on a Saturday night.  There appeared to be only one server, one bartender and a manager on the floor. The manager appeared to be wearing many hats, seating, serving and bussing tables.

Ok, most people are familiar with the process by now.  The food was good.  Our server Toni was good.  Honestly, the only reason I'm giving such a low rating is because the place looked like a disaster area.  It looked like a tour bus full of people had just left the place.  Dirty tables everywhere, trails of water and food debris all over the floor.  The bar area had 10 or so seats, with four of them covered by clipboards, paperwork, and other bar stuff.  While our server, the bartender and the manager are all trying to make some sense of the place, I head to the bathroom and the busboy is in the back of the room on his phone.

The spot in the worst shape was the food line.  There were veggies all over the counter, sauces splattered all over, a few items were missing tongs, and there was only one guy on a full grill on a Saturday night.

If you think about it, there's only one thing FTG offers, and that's the fresh food line.  If that looks unappealing, then the whole concept looks bad.  Someone with bad OCD that night would've probably had a Rain Man-style attack.

For all the times I visit Champaign (once a year), I'll write off this visit.  I've been to FTG's that are immaculate, and ones that need some work.  This one could definitely use a hand."}
{"text":"Went here on a Friday night and the service was great.  Food was okay - it really depends on how you mix the sauces and ingredients.

If you're used to the Mongolian BBQ (BD's), this is a smaller version in comparison.  Shrimp cost extra, eggs were not cooked into the dish but rather served separately.  I did find plenty of ingredients all over the floor with no staff members cleaning them up.  Skip the brown/white rice if you don't like overcooked harden type.

The Filipino sausage was a surprising delight, and the veggies look/taste fresh.  Fruits look to be from the can, as well as some of the sauces."}
{"text":"A combination of Mongolian grill and stir-crazy. That being said, it is a great combination. After being seated and picking your options (which proteins you would like) you are given your bowl to proceed to pick from the large assortment of veggies and sauces to add to your meal. The only knock to the system they use is they have you apply the sauce immediately to your bowl, unlike MG where they will add the sauce toward the end of cooking everything. I feel this over cooks the sauce and doesn't bring as much flavor as adding it on later in the cooking process but it is just my personal preference. Overall the food was fresh and great! I will definitely return."}
{"text":"I waited a while to write my review to make sure this was actually what I wanted to say. These kids running this donkey show pissed me the hell off. It was just after 4 on a Saturday and we came in to have what I thought would be the only intelligent offering in a town full of children. Right! We were seated and I was one of 4 guests in the building. Our drink order was taken, and because I was in my booth so tight that I didn't want to get up to show my I.D. I changed my order to Sierra Mist! I guess the 4 inches of grey hair hanging from my chin wasn't proof enough that I am not only old enough to drink. But I am also old enough to operate an electric wheel chair! But that had nothing to do with the annoyance factor that was brewing. The kid explained what we had to do and we went on our way. Now I love rice. So much so that I could eat that alone as my meal. Both the white and brown rice tubs were completely empty! So I asked for some and was told they would bring it right out. Then I was told to make my bowl and they would bring it out when it was ready. So I asked a simple question. If you bring it out after the meal is cooked. Than the rice will still be white! With no flavor from what I put in the bowls. Three people told me that it would take 25 minutes to cook the damn rice and they all thought it was hysterical. The manager. A young girl with her hair pulled back to give her that look of authority kept pacing back and forth through the restaurant like she actually had something important to offer. The rice. Is an, if not thee essential part of what this chains menu is built upon! And then you do a group huddle to laugh about it. Now I could see my bowl from across the restaurant sitting on the edge of the griddle. When about thirty people walk in. The cook is still scraping the grill from the time I walked in the door and I knew what was going to happen next. Bowl after bowl about 8 inches higher than the rim were pushing mine further and further away from getting cooked. That's was it. I'm the dude in the Snickers commercial that needs to be fed. But. I kept my cool. Just not my Snidely Whiplash remarks. Every time a server walked by, I asked if the rice was ready yet? I cut the time of that rice down to 15 minutes and that shit was scorched like their underwear after a weekend binge! Of course when it came out I was finished with my meal. I thought that it would be fun to visit a college town and take in some sights. Fuck You! I told my buddy to get the car and lets get the hell out of here!"}
{"text":"It's obvious this place is on a big campus judging by the appearance of the bathroom. But the food is good enough to get past that."}
{"text":"This place gives you amazing food with a unique experience! The food is like an Americanized Mongolian BBQ type of ordeal. You start off with an empty bowl and chose whatever you want to go in your dish with your choice of meats, vegetables, noodles, and sauces. Then, they have a big grill where someone cooks it for you.

They always have great service here as well. I am always pleased with the service I receive when I come here. 

They don't have a big alcohol menu, however, the alcoholic beverages they do have are quite tasty. 

And this is a great place for students to go and enjoy time out with their friends given that they do have a student discount."}
{"text":"Good quality
Good variety of choices
I have had brunch, lunch and dinner at this place and absolutely love it :)"}
{"text":"The food there is unclean. My stomach feels bad after eating at there and I will never go this place again!"}
{"text":"The stir fry is edible. That's about all I can say. It is as authentically Asian as pei Wei.  Maybe less so."}
{"text":"I really liked this place and I keep coming back. The staff at the bar is very friendly, so we always sit there. There are a good number of options to add to your dish, and there are a ton of sauces and sauce combinations. Just don't go too crazy, because if you start mixing Soy Sauce, Coconut Curry, Sesame Ginger, and Red Chili Sauce, you'll get a very pungent and strange tasting sauce.
But again, the cool thing is that it's totally your call.

The meat is not the best grade, but it's not the worst either.

Definitely get one (or two) of their bread thingies."}
{"text":"This is a restaurant for big eaters. There are a ton of options to really make your own variety of asian stir-fry-- you can almost be paralyzed by the number of sauces available. And the sheer volume of food is impressive-- a great place to go if you want to absolutely stuff your face."}
{"text":"We liked it for lunch today. And we are fans of HuHot (the other Mongolian style experience in Madison). 

Quick Like-ables: 
a) I'm allergic to egg. I was weirded out when my server asked if I had any allergies and explained \"Use the White stick.\" Thinking HuHot: Y'all don't use eggs~ Well they do. This is a BONUS as the kid loves eggs. I appreciate my food being cooked separately and the fact that they offer eggs.  It's a 'best of both worlds thing.'
b) I like that the meat was clearly & obviously meat cut up in the back & not like the shaved & frozen meat of Huhot. 
c) A few more sauce options. They have more options that lack oil (which I need at the moment). I do care about my health most days.
d) They have soup options & can make your chosen items into a soup. 
e) Mixed veggies that include bean sprouts. 
f) The vegetarian friendly options (soy this/chew me that) NOPE~ not vegetarian at all but I appreciate thoughtfulness in the kitchen. 

LOVEABLE: 
1 THAT BREAD. TASTE LIKE MY OLD HOUSEMATE MOTHER IS COOKING. Initially, I was like no, I don't want any bread. But it's fresh, bubbly hot and tasty. It's Roti Prata & soooo worth it. 
2. The grill cook was a sweetheart - explaining things, catering to the kid & helping out with options
3. The servers were more than helpful for our 1st time. They stepped up to offer help & ask questions. VARIOUS SERVERS..not let me get YOUR server attitude. 
4. They charge for a to-go box on the unlimited trip version but the kid asked for a to-go box because she didn't finish and I said no. 2 servers stepped up to say - \"We won't charge.\" I overtipped due to the appreciation. 
5. They offer breakfast/brunch and we'll return so the kid can have such. Did I mention, I HATE breakfast? 

Oh they had squid on the bar.  Maybe they read the other YELPERs complain because the labels are clearly printed now and not handwritten and confusing. 
Decor - stylish and easy. We loved the tall booths. 
Staff - Made me smile to see Managers, Cooks, Bussers & servers alike working to meet customer need. (I am a former server)"}
{"text":"wow, another great gimmick turned into a franchise.  the food was quite mediocre.  if you've ever purchased a frozen meal in the stir fry genre and microwaved it for lunch, you have an idea what this food tastes like.   there is this annoying practice they have going on where your waiter follows you to the buffet, forces you to try bizarre dipping sauces and then pours them over your food.  i was also forced to order a strange \"flat bread\".  when my food arrived with the said \"flat bread\", i thought maybe it hadn't been baked or something because it resembled a glob of paste.  i asked my waiter what i was supposed to do with this \"matter\" and he said \"oh, people love this, just spoon some of your food into the bread and roll it up like a tortilla\".  well i did that but it still tasted like paste and didn't magically make the stir fry taste any less like a frozen meal either.  i'm amazed at how easy it is to impress a large crowd of people.  there were tons of professionals eating here alongside college students.  i would offer two suggestions for everyone eating there: 1. go to jimmy johns if you want basic lunch food.  2. go to cafe luna if you want exceptional tasting food with waiters who won't force you to eat horrible tasting crap.
strange, just strange."}
{"text":"If I could give this place no stars, I would. I used to enjoy Flattop, a couple of years ago Flattop really wasn't bad at all! You filled a bowl with vegetables, beans, rice, and sauce. You'd fill a smaller bowl with your choice of meats, then leave them on the side for them to be stir fried into really delicious meal. 
That is not the case anymore, now you get back a  bowl of really BLAND, overcooked stuff. It doesn't even taste like stir fry, just like a bunch of dried up random bits of food. I had convinced my friend to go here instead of Chipotle and then felt really embarrassed when he had to get up to get extra sauce from the station because his food was that dry. The meal was so bad and took so long, the least I could do was pay for both our meals. Never again will I be coming back here."}
{"text":"For a Mongolian grill, Flat Top is near the top of the price range. Seating is also pretty limited, I've had to wait up near 30 minutes before getting a table. I thought they had a pretty good spread as far as veggies and meat; it's supposed to mimic the main staples in asain cuisine, not be the typical fat American all-you-can-eat buffet. (i.e.: deep fried everything)
I'd recommend this as a very healthy alternative to most restaurants, just hope you don't wait as long as I did...."}
{"text":"Much larger than it looks from the outside! 

This was one of the first places I went to when I first arrived in Madison. I really enjoyed being able to pick and choose what to eat and how to season it. Reminds me of a Mongolian Barbecue place in Guam. Highly recommend!!"}
{"text":"With a very reasonable price list, and a very varied menu it really is hard to get tired of this place.  Whenever lunch brings me to campus-town I usually eat here.  There are discounts available for students that bring it down to the poor grad student budgetary range, and the option to take home a bowl makes it an even better deal.  If you're new to this restaurant though, be sure to either go with an experienced friend, or tell the wait staff you're new; there are a few insider tricks in preparing your food that you won't learn other wise.  One of the best is to always, ALWAYS, put the blue stick for bread in with your stir-fry."}
{"text":"We've been here many times.  Each time has presented us with the same small hiccups in service.  Typically it is turned around before the end of our meal.  Case in point: Tonight, it took us reminding our server that we had indeed ordered drinks.  He remembered 2/3's of them and had to ask about the third again.  This was redeemed by providing excellent service from that point out.

Selection of tap brew is OK.  Tonight I opted for a Coca-Cola Classic.  Food is great.  I always go in thinking that I'm not going to have enough to fill me up.  Each time I end up bringing home a lunch plate for the next day... or later that night. 

I know we'll go back because of the incredible offering that they provide.  However, it's always a guessing game on which team shows up to wait tables.

Overall: Decent. I am sure that we will return."}
{"text":"Looked on their web site and went there for their Sunday breakfast, got there at 10:40 and they were setting up for Lunch.   They said they opened at 11:00, we said we were there for the Sunday breakfast, they responded that they have not done that since sometime in the summer.  We mentioned that their web site said htey still did it and the response was that corporate had not fixed it yet.

Caused us to miss the breakfast buffet at other places.

Very poor attitude and no offer of \"I'm sorry, we need to get that taken care of.\""}
{"text":"I have been eating at Flat Top for years and it seems it has fallen a notch.  The food tastes great and I have always enjoyed getting the 1-trip option and trying to get as much food as possible.  Last week I ate there and one of the guys by the grill grabbed my bowls and some of the food fell on the counter.  Unfortunately, I was just out of luck.  I am a big fan of the bread but now it seems they will only bring one piece per person at a time.  Our service was actually pretty poor so we didn't get nearly as much of that tasty bread as we normally do.  All in all, the food tastes great, though it really was not as nice an experience as we normally have had there."}
{"text":"I used to be a big fan of Flat Top. I used to go there at least once a month. Then the price went up, you had to pay extra for shrimps, so I started going there less frequently. 

I went back there again today for a quick late lunch. Flat top lunch used to be a bargain for lunch take out at $7.50. I went there today and upon paying I got a bill for $8.99 even though on the board it says lunch price is $7.99 for students. I talked to one of the waitresses there and she's like that's just how it is, we just raised the price up EVEN THOUGH on the board it clearly says $7.99. I said that's a shady business practice, you can't charge someone extra for something that's not stated on the menu, and she said she can't do anything about it, and that i'll have to go talk to the manager. I talked to the manager, and he said the price just went up. Again, the board (which displays the menu and the price), says $7.99. Once he found out that I was getting a take out, he said oh the student discount is only for dine in. Again, this is not stated anywhere on the board or in the menu. I used to come here a lot, and I always got student discount with take out. 

I was not pleased with the tone of the manager and his sketchy business practice, so I just decided to dine in. A new, very nice waiter came by and apologized for everything. she was really nice and was sorry for how I was being treated. She got me the dine in plate and asked if I want to box it to take it home, and that's what I did. 

The extra $1 doesn't mean much. I gave that away as a tip to my amazing waitress. I'm just against shady business practices.

And the food? the food is great. Service is usually good. I've dealt with the manager two times, and I felt like he's a rude and shady person."}
{"text":"This is one of those \"create your own stir-fry\" or \"Mongolian barbecue\" places where you pick your own veges, meats and sauces. 

They have a pretty good selection of sauces. Try their roti prata (indian bread) that comes free with your stir-fry. Really good! 

7 bucks for lunch, I think, is a damn good price for the amount of food that you can stack in your bowl. Dinner at $12 is probably a bit on the pricey side. I'd just go for lunch. 

I was there for Sunday lunch and they were packed. I'd call ahead and make a reservation for weekend lunch."}
{"text":"The good thing about Flat Top is that you make your own food.  However, the bad thing about Flat Top is that you make your own food.  You can pick whatever you want for your stir-fry (soup, etc) so you get exactly what you want (though I always end up with corn in my stir fry even though I never add it myself).  The problem is, sometimes it's nice to have somebody tell you what works well together.

I pretty much only come here when I have a coupon.  It's not that it's too expensive or the food is bad, I just get a little sick of it because I always have so much leftover that I'm eating it for days.  Also, apparently I'm not very creative when it comes to stir fry because I always end up making pretty much the same thing.  I'll be honest, it gets kind of boring.  But, the veggies always seem fresh and the sausage they have at dinner is pretty tasty.  Sometimes, though, it seems like my meat doesn't get cooked all the way through.

That said, here's some pro tips:
- Always, always, always ask for more bread
- The rice seems to be a better choice than the white noodles if you're going to have leftovers, since the noodles tend to clump together and get really mushy
- Place the veggies in your bowl first, and add the rice or noodles on top.  You can fit so much more in your bowl this way."}
{"text":"Pretty good food. You can get what you want how you want it. I'd rate it higher but the service can be spotty at times. Get the roti prata bread; it's pretty amazing."}
{"text":"I love Flat top grille. The buffet is always stocked with good looking vegetables. It has a great vegetarian selection as well with tofu, seitan, and other meatless options. They are always really nice and friendly as well and are great with food allergies. I love going there. Its one of my favorite places in Madison to eat."}
{"text":"Flat Top Grill is a new build your own stir-fry establishment located in the renovated Hilldale area. (It's across from the Great Dane)  I have quite a few picky-eater friends who fear anything spicy or \"not a hamburger,\" so I'm glad that a place like this exists so we can both find something that registers on our own levels of \"risk taking.\" The set up is as follows, you sit down, possibly order drinks/appetizers, and then are sent to an area that resembles a salad bar.  You choose whether you want rice or noodles, and then you can pile on as much vegetables as your little bowl can handle.  There is a variety of sauces at the end and tasting cups so you can have a vague idea what your meal is going to taste like.  The sauces give a shout out to most Asian cuisine, but I cannot attest to their authenticity. (Chinese, Thai, Korean, Japanese, etc.) After you chose your starch, your veggies, and your meat, you can choose whether to have your meal with flat bread, seafood added, tofu added, stir fried, made into a salad, or made into a soup. (There are probably more choices, I just can't remember them.)  Additionally, you have an option to indicate that you have a food allergy so your food is placed on a separate clean grill.  Additionally you can make this an all you can eat event for $1-$1.50 more, but then you pay extra to take any food home.
For vegetarians, there is EVERY KIND, of fake meat available on the bar.  However, during busy times, vegetarians, no one seems to  gives a damn if the beef in the protein area accidentally slips into sauces that border that side, so if you're a rigid vegetarian, be weary.  My dining companion wished that he had indicated he had a food allergy because he insisted he could taste the sauces I put on my food on his food. I also want to add, on the night that we went, our service was not good, and we saw at least one other patron expressing her dissatisfaction with the service with the manager. We managed to have a pleasant dining experience despite this, and I'm crediting the poor service to the fact that it's a new restaurant and they may still working out the kinks.
We both enjoyed our meals and are considering coming back at a later date to do the all you can eat option just so we could experiment a little more with different concoctions. I wouldn't say this is fine dining/cuisine at all, but it is a place you can take people with a variety of likes and dislikes. (3.5 stars!)"}
{"text":"Great food but not a great value. This is an expensive restaurant relative to the portion size. This is not a good value compared to most Asian restaurants but it is a different experience. Food tasted great, just relatively too expensive."}
{"text":"This is a chain that allows you to create your own stir fry. I love the options for ingredients which always seem pretty fresh and sauces and the veggie \"meat\" options are outstanding but the bowl is VERY small for $12.99. I think a better price would be the lunch price of $8.99 and unlimited for $12.99. I would go more often if it weren't so expensive."}
{"text":"Just like all the other ones I've been to. Great food."}
{"text":"I like this place. Yes, it is a chain that tries very hard to appear to be kitchy with hand-written signs etc., and yes, it is very easy to combine several ingredients that have no business being together making an unsurprisingly nasty-ass concoction. That being said the ambiance is pretty good: lively enough to have a good time, but still not too loud to hear your friends, with decor nice enough to justify the prices. I have always had good service.

What I like most about this place is that it is such a crowd-pleaser. vegetarians, vegans, those with food allergies, gluten avoiders, Atkins dieters (idiots) and those who are just plain picky for no other reason will all find plenty that suits them.

This place is not without its quirks, and if you are there for the first time, DO NOT lie when the server asks you if you have ever dined with them. Their systems are not perfectly intuitive at first glance, so let the staff lay some knowledge on you. But beware: like any buffet, they will try to upsell you on pricey cocktails, apps, and whatever. Get a drink if you must, but stick to the buffet.

So, the prices, atmosphere, and  3-star territory. The excellent slightly-greasy flatbreads are +1 star, and +1 star for the tons of different protein options, the plethora of sauces, and the many ways that everything can be customized via the lil plastic sticks. Minus 1 star for expensive drinks."}
{"text":"So this is one of those places where you can create your own sort of masterpiece of food; you can make your own stir fry, wrap, soup, or mu-shu. You add rice and various meat and veggies. Then you can top it off with sauces such coconut curry. They have a wide array of things. I think one of the issues is that you can possibly make something that doesn't taste very good; but that's the fun with experimenting. I'll have to say that the meat was fairly subpar. However, the rest of the food and service was fairly good. It costs $11 for lunch."}
{"text":"Its so easy to screw up the food here that it doesn't seem like a great value. The ingredients on the bar all seemed very fresh and there were tons of options, but it's really hard to put together something that I really want to eat (particularly sauces). I totally screwed up my bowl because i didn't get the sauces right. If you want to give it a second shot you have to pay $4 for the second bowl (the first bowl is $13). My party also asked about the cost of the third bowl and we were told the 3rd bowl is $13, the 4th is $4, and so on. That seems like a weird pricing system and again, not a great value. Atmosphere and wait staff were very nice but I just can't get behind it. If you want to take the risk of being unhappy with your food and having only yourself to blame, this is the place for you. 

Oh and don't get the whitefish. Several people in my party had it and said it wasn't fresh."}
{"text":"I have always liked the build your own stir fry concept, and this location looks good enough on the inside. For whatever reason don't go here often but always tastes good."}
{"text":"I came here about a week ago with a friend. It was about 1:30 pm and it was obviously slow considering it was after the lunch rush. 
Our server took about 10 minutes to get our drink order and once we placed it took about 25 minutes to get our food. 
Finally, our server hardly checked in with us. When she did, we already finished our food. I used to love coming to flattop but the costumer service will probably not want me to come back again."}
{"text":"It's Flat Top.  Nothing particularly special about it especially considering all the other unique and amazing restaurants in the area.  The price is fine for what it is, especially since it's a huge chain, but perhaps a bit pricey on a student budget."}
{"text":"As someone with celiac disease, I have to say Flat Top really let me down.  I was excited to try their gluten free options, and was initially impressed with the whole white-stick system of cooking their food.  Well, a chain of unfortunate events led me to decide I'm done with it.  Context:  We knew it would probably be busy on a Saturday night, so we figured in the interest of our kids and those around us that we would beat the dinner crowd and arrive early - a little before 5pm.  Here are the events:     1) They seated us RIGHT (I mean RIGHT) next to another family with small children.  So there were 5 children under the age of six in one tiny corner of the restaurant.  I get wanting to keep the kids away from the child-phobic diners, but come on!  At least put ONE tiny table between parties.  We were all up in each other's business.       2)  My son ordered a cheeseburger from the kids' menu.  They RAN OUT of cheeseburgers!  How many cheeseburgers do they serve at a stir fry restaurant??      3) It took FOREVER to get our food from the grill.   When you have little kids, waiting is the worst.     4)  My husband created a dish for me using the gluten free ingredients that they offer.  There were TWO sauces, neither of which are soy sauce, which was what I wanted.  The teriyaki sauce is completely bland.  We asked if they had gluten free soy sauce, and our server said yes, I'll go get some... and then returned saying that not only do they not serve that GF soy sauce anymore, but in fact NONE of their sauces are gluten free!  I about dropped my fork, as I was in the middle of eating something with one of those sauces on it.  My husband told him two of them are marked gluten free, and then the server said, 'Oh, yeah.  Those ones are gluten free.'  UGH.  Heart attack.  So I was good.  Gluten free soy sauce is VERY easy to come by these days, and I feel like they should offer it again, being that they specialize in stir fry and all.       5)  And this is a BIG ONE for those of us with food allergies!!!  My dish (white stick and all) came back from the \"special\" wok TOPPED WITH SOME KIND OF FLAT BREAD - meaning, GLUTEN!  So that whole dish was out.   So, after ALL that, I have just resigned to the fact that Flat Top is not worth the trouble for me.  It just wasn't that good.  I will not be returning."}
{"text":"Awesome concept. Perfect for picky eaters, like my wife, pick your ingredients and they cook them. Tasted great. Only complaint I have is the size of the buffet area, it gets crowded easily and makes you feel rushed to pick ingredients. Will definitely come back."}
{"text":"Most Flat Tops, I'd give a five star rating since I love the place. I won't go into a huge explanation into why since everyone else has, but a word of warning (and the reason this is a four start place for me):

Every time I (or whoever I'm with) add chicken to my stir fry, there are bits of bone. I've never had this problem at any other Flat Top, so when I'm at this location I just leave out the chicken, but if you still want it, just be careful for bits of bone. (Though my friend that got chicken with bone in it complained and his meal was free, so it's nice that they're at least sorry it happens, if they're not fixing the issue.)"}
{"text":"I miss the old set up. Now you put sticks in your bowl for what meat you want rather than self serve. They charge $4 for extra meat which you used to control yourself and they got rid of the most delicious protein, the sausage! Between paying extra for shrimp, extra for more meat, and extra for 2 bowls this place just makes me feel like they are nickel-and-diming you. HuHot on Junction rd it is from now on, better value with all you can eat and more protein choices for a better price."}
{"text":"Love their food. You could have so many selections on sauces, veggies and proteins. The flat bread is awesome. Great value."}
{"text":"Yet another Asian-inspired food chain! Oh c'mon do we need this in Champaign? We have so many Chinese/Korean restaurants in campustown and honestly, they are way better than Flat Top. 

So, the whole stir-fry concept that they have is actually Mongolian BBQ. The difference is that they have tonnes of raw vegetables and ingredients to choose from. Oh, not to mention, weird sauces and food combinations. My combo was okay (it was brown rice, clams, beef, vege, salmon and roti prata) but if you don't have a sense of what goes with what, then your dinner is going to be a disaster. 

It's clever of them to have this pick-your-own-ingredients kinda concept because if the food was bad and you complained, they can point their fingers back at you and say that you chose the ingredients. Then again, you are not the only culprit. The grill sensei is responsible as well. If he over-grilled your food, it will taste just as bad no matter how wonderful your selections are. My friend's moo shu was not wrapped very well and some of the rolls fell apart. Well, there goes your dinner. 

I think it is good to try it once but more that once? You decide. Still, the combo of rice, salmon and roti prata bothers me. Maybe I am just a stuck-up purist who thinks that chickpea dhal is the only way to go. Could this be a one-hit wonder like Bar Louie? We'll have to see."}
{"text":"I can put together a mean stir fry at home, so when I go out, I expect a little something extra. Flat Top Grill came up short.

The buffet was short/limited and the whole atmosphere left me a bit underwhelmed. I've been to other Mongolian BBQ's and they seem to have the whole thing figured out much better. It would have been advantageous if they had made loads of suggested recipe cards readily available right at the buffet line... but they didn't. It also would have been a major plus if they used easily read product labels on buffet line (hand-written labels on crystal-clear plexi-glass isn't easy to read -- at least use slightly opaque plexi-glass, jeez).

Also, isn't the whole point in choosing to go to one of these kinds of buffets, to enjoy the cooks' witty banter and theatrics as they grill up your dish for you? Apparently the Flat Top doesn't believe that to be the case.

Lastly, I was there for a Tuesday night dinner. Not entirely dead-slow, but far from hopping. What I want to know is, why was the server so over-bearing? It seemed like she wanted to get us the hell outta there ASAP so she could get another party sat -- but there wasn't anyone waiting! I know, you're probably thinking we were her last table and she wanted to clock out. But we weren't her last table, there were plenty of others in her section. GAH!

Maybe I'll give this place another shot for lunch, but dinner is highly unlikely."}
{"text":"Consistently good food, reasonable price, and friendly staff.

I generally prefer Flat Top to the Huhot in town. They are the same basic concept, just that Flat Top has a few points in its favor.

First, it's a bit less chaotic. Huhot is more kid friendly, but that comes at a price. Flat Top is non nonsense and you'll get in and out faster.

Next, the ingredients. At Flat Top, the meats are fresh and marinated, whereas they are mostly frozen at Huhot. I can definitely taste the difference.

The sauces at Flat Top seem to be designed to complement each other better than at Huhot. I have never made a bad bowl there, but I have made some bad decisions at Huhot.

Lastly, the roti prata bread (essentially thick tortilla) is amazing. A couple pieces of that and your bowl will become a second meal of leftovers."}
{"text":"My husband and I would visit here 2 to 3 times a month. with the new format, I do not think we will be returning. I asked for broccoli and got two pieces. When I asked for more the guy looked at me with this really rude look and told me that I'd be charged extra. seriously??  You can't experiment with sauces because they rush you through so quickly and won't give you more than two ladles per sauce, and then they give you no protein. I'm vegetarian, and they have the best BBQ tempeh I've ever had. I get it every time. I asked for it and the guy scooped up ONE PIECE in the ladle. For non veggies, that's the equivalent of one little bite of chicken or something. I asked for more and once again was told it'd be extra. So the next ladle had a whopping two pieces in it. So I got three small bites of protein in my lunch for extra money. It was bland because I couldn't do sauces that I wanted, and it just has lost its touch since they changed everything. Very disappointing."}
{"text":"Have come here many times before.  Today I learned of the new change.  Don't care for it.  It makes no sense to have someone \"walk\" you through a salad bar style setup.  Aside from having to manipulate the person like a voice activated puppet for each and ever thing you want added they skimp on stuff.  4 shrimp graced my bowl.  4.  The quality of the food also seems to have dropped.  They either need to switch to a menu with dish choices or go back to the old method.  

I won't be coming back.  All through  my meal I stared out the window at Great Dane with longing.  They may be saving money on their stock but they will not be making any more off of me after today."}
{"text":"I went back and they have returned to the normal pick out your own food style. You just ask for which meat or meat combination you want but the rest you can put in your own bowl. This way makes much more sense since you get to decide exactly what you want and how much of it you want."}
{"text":"Good place to have a quality lunch or dinner when you are in a hurry. We come here a lot when visiting Madison. Some changes were made lately but nothing drastic. I usually mix rice or noodles with vegetables. But the best part is a sauces selection. I am having fun mixing a few different ones for my bowl. Don't be shy - poor as much as you need. 
Basically it's all pick and chose here and if you are still hungry after your first bowl you can always go back to the bar and get another one. But be careful - that will cost you extra. I usually am satisfied with one. Oh! One more thing - meats have separate little bowls."}
{"text":"We went here for breakfast today and it was good! They serve all-you-can eat breakfast on Saturday and Sunday morning. You chose all your mix-ins and can make either an egg scramble, pancakes, or french toast. They also have oatmeal, fruit and little muffins you can have on the side or while you're food is cooking. I really wanted bananas, though, but they didn't have any. I guess I understand that they may get brown quickly while sitting out. At unlimited for $9.99 ($8.99 for students) it was a better deal than dinner. 

we went for dinner the other night, too. It was tasty and they had a great selection of  fresh meat and veggies, but I wish they would have explained which sauces go well together. I think the lunch and breakfast prices are very reasonable, but dinner got a little pricey."}
{"text":"This restaurant is definitely a step up from what use to be on campus.  It is a Mongolian bbq.  The price is ok, not too bad with the student discount.  The pomengrante lemondade was pretty good.  The food is good but it really depends on what you choose to put in the bowl.  I would come back."}
{"text":"I used to love this place but my latest visit introduced a completely different flat top experience than I have had before--for the worse. Flat top has always been about self service: you pick whatever veggies, sauces, and protein you like and then they fry it up for you--no judgement. Now, however, you stand in a line--Subway style--while they put however much veggies, sauce, and protein they see fit into your bowl. Want to taste a sauce? You still can if you don't mind holding up the line behind you. Want more peppers? Sure, just get an annoyed look from the man behind the glass. Flat top created an experience, a brand really, focused around user preference, yet now, with the line and the servers, you no longer create your own bowl as much as you rush to share your preferences with the Flat Top Gods and hope something good comes out the end.

I asked one of the employees why the new experience and she told me it was because customers would spill the ingredients, which was a concern for those with allergies. Which would be completely valid if the new system prevented spilling. But it doesn't, of course, because the design of the buffet hasn't changed, only its users. And it was never a user problem, only a design problem. Namely, having three rows of ingredients, especially sauces, ensures that if you're grabbing from the middle or the furthest row you are likely to spill in a closer row. Now, in fact, because the employees stand on one side of the table they are *more* likely to spill because they never walk around the table to reach the furthest ingredients--at least some customers did that. This isn't theoretical--I watched employees spill ingredients.

Completely changing their user experience wouldn't be so bad if they were a well oiled machine but they are far from it. Flat Top has a system where you put sticks in your bowl to add roti, to ensure it's cooked separately if you have an allergy, etc. In the old Flat Top, you put these sticks in yourself; in the new Flat Top you ask them to do it for you. I asked for both of the above, but for some reason the dish came to the table without roti. It would be reasonable to assume it was not cooked separately, too, if they forgot the roti wouldn't it? Wasn't this new system supposed to be all about accommodating those with allergies?

Anyway, when a server came with my food and I asked for the roti that was supposed to (but failed to) come with my meal I also asked for a side of rice--something that has never been a problem at flat top and something the server said she would bring. But it never came.

If flat top wants my service again they need to get their act together. If they are concerned about spilling ingredients, design a buffet table that makes that harder, don't just hire folks to take the enjoyable experience from your customers. And make sure requests from customers don't get lost in translation.

I miss you, Flat Top. Please come back."}
{"text":"Your average stir fry place. Love that  they have parathas though. Service is decent."}
{"text":"This is the first restaurant I have possibly ever been to where I felt actively annoyed by the waitstaff.  You'd think that was impossible, since it's a flippin' buffet, but lo.  The woman whose job it was to fill up our drinks managed to only ever reach for my glass when it was going to involve sticking her arm between my chopsticks and my mouth.  Some man came over and engaged us in a lengthy dialectic about whether or not we would like him to make us some dipping sauce.  What flavors do you like?  How spicy do you want it?  For 5 minutes after our food came, during which we couldn't eat!  Then he brought us over dishes of sauce that WE COULD HAVE SELECTED OURSELVES from the buffet!

Additionally, I was unsatisfied with my food.  I followed one of the sauce suggestions at the buffet, and was treated to a steaming pile of oily stir fry that literally smelled like the nasty gunk that gets stuck in a horse's shoe when it walks through a cow pasture.  The pineapple in the buffet was from a can, the meat was a low grade cut, and there was about 100 times too much oil applied to the grill.  

The only reason it gets two stars instead of one is that it's got an ambience that is well above the campus mean."}
{"text":"Today was my first time going. I'm not from the area, and had never even heard of this place. The food itself was really good (obviously would love the bowls to be bigger), and they could cut the veggies up more so we can fit more in our bowl. The thing that got me was when my friends and I ordered drinks (alcoholic). One of my friends is from out of town, and although she is 23, her license is still vertical. The waitress took her drink order, but then came back and said she'd have  to check with her manager to see if her license was ok. Waitress ended up coming back and saying sorry but its not real license (kind of rudely tbh). We later googled this strange policy, and found that Illinois is just different (cause my friend has used it at every other bar in U/C and never been denied). The waitress could have just handled it better. The rest of our time there she just seemed a little salty and short with us."}
