{"text":"We visit this shisha cafe more frequently than any other in Scarborough or Pickering. While the service can be a little slow on busy nights (what shisha place has amazingly fast service anyway?), the employees are great and courteous. The owner is usually there and he's a very nice guy who goes out of his way to please the customers. There's a good selection of shisha flavours and the food is actually amazing quality for a small time shisha joint, and the owner is more than happy to recommend something new to try.  From the first time we visited the location I've loved the decor and ambience of the cafe. From the comfortable couches to the interesting art on the walls, the two televisions on either side, a few spots near the windows, and clean well done washrooms, it's a much better shisha place than a lot of others outside of downtown Toronto.   Good to go relax on a weeknight, if you're not keen on a younger crowd with a possibility of noise, then avoid Friday or Saturday nights around clubbing time because there's the Cocktail House in the same plaza and you're likely to get pre-drinkers and some already drunk people.   Give it a try for yourself if you just want a good night of shisha and conversation."}
{"text":"Flavors is amazing. We went for the food on a Saturday night rather than the hookah like gentlemen above and were not disappointed.  We ordered the brisket nachos as a start, southwest club and bahnmi brisket as mains, as well as the bread pudding for dessert. Everything was astounding. My girlfriend is a guacamole aficionado and felt their guacamole, made fresh in house, is the best she's had ever.  I can't believe how high quality the food is considering the more than reasonable prices.   Ambience and server were also excellent. Can't recommend highly enough."}
{"text":"We were visiting Oshawa and read up on a halal website that had great reviews on this place. We didn't dine in so we can't review the ambience. We called in our order and picked it up to go.   We ordered Philly cheesesteak & the lamb BLT. Both orders came with fries and I substituted one of the fries with poutine for a $1.50 extra.   The Philly cheesesteak was odd. It tasted as though it was marinated in soy or something. If you're hoping to dig into a normal cheesesteak, well then this is not the place.   The BLT however wasn't too bad. But then again, it's hard to mess up a BLT. The lamb 'bacon' was thick but a little chewy. However I enjoyed it a lot, the lamb taste was prominent.   The fries was so-so. But the poutine is again, odd.   All in all, if you're looking for a halal restaurant that don't serve your typical shawarma or Indian food, do give this place a try."}
{"text":"I think Flavors has improved since the last time I went. This past winter, I stopped in to have a nice quiet dinner alone. I ordered the chicken Philly cheese steak and it was delicious. Along with my meal, I had a Nutella latte which was a really nice treat and nice way to end my dinner. The time that I went there was only one other person there which was perfect because it gave me time to sit, relax and read my book. I would definitely go there again and have their philly cheese steak sandwich again. But this time I would order it mild because it was a bit too spicy for my liking!"}
{"text":"I am visiting from DC and I just went to this place for a local flavor. Wow what bad service and all the smoke in there for no reason. I ordered a philly cheese sandwich to see how they do it and I got a chicken sandwich. I ordered fries and I didn't get it. I was already so tired I didn't even complain about the sandwich because I figured their Philly cheese would be terrible anyway. Well my tiny, burnt tasteless chicken sandwich was disappointing. Flavors proved me no local flavor more like disappointing."}
