{"text":"Samar the owner is rude. My mom visited me from Chicago for Thanksgiving and she messed up my order. I called back and she hung up in my face due to \"the place being busy\". Mind you I just left the restaurant 5 minutes before and there was no one in there. Her brother used to be a manager there and now I see why he left. When he was there the place was great. Guess he knew what was good for him. I'll never be back PERIOD. Customer service trumps all!"}
{"text":"Best wings and strips in town (and out of town)!! I go out of my way to visit this place when I'm in Charlotte.  It gets better and better each time.  The employees and owners are incredibly helpful and accommodating and often suggest new flavor combos, making the whole experience extra yummy."}
{"text":"Oh my gosh!  Found this place on yelp and the reviews were not hype!  Best wings ever!  And I know, breadsticks?  But they are awesome too!  Can't wait to visit again!"}
{"text":"Great wings!! I go there about twice a month with my kids.
Kids love their wings and bread sticks. Limited variety of beers, but it's family friendly place, so I'm OK with that.
I recommend honey BBQ source for kids and adults as well."}
{"text":"Great food! This place reminds me of a place we go to in San Diego. The owner here says the food is fresh and handmade. I think that's great! Everything was delicious.  We will be back often."}
{"text":"I came here on a Tuesday, just after lunch. There were a few people in the restaurant and one person in line at the counter before me. I was greeted with a smile as I stepped to the counter. I placed my to-go order, Parmesan garlic and buffalo strips. 

The strips came with carrots and celery, garlic bread, and I ordered blue cheese and ranch. Both flavors of strips were great, I couldn't tell you which I liked better. They were perfectly seasoned/sauced and the chicken was very juicy. The blue cheese could have been a little 'blue cheesier', but it was still good. That bread though...whew. That was good bread. 

I won't hesitate to return to Flip'n Chicken next time I'm craving some wings or strips. Great food and friendly service."}
{"text":"I normally don't write reviews however I absolutely love this place! I had lunch with a friend there and ordered the honey BBQ strips, you can taste the freshness of the chicken! I went back two days later and they recognized me from the other day. Good place to enjoy great food at a decent price."}
{"text":"This place is easy to miss as it's nestled in a corner in a strip mall between Fresh Market and a gym. This spot used to be occupied by a Wing Stop which I liked so when I saw there was a new wing place I was excited to try it. 

The interior is rather small but the new ownership has definitely upgraded the amenities. The TV's are much nicer than the previous versions that looked like they were from the mid-1990's. It's also better lit inside and feels a bit more spacious. 

I ordered a wing combo which came with wings, breadsticks and a drink. I went with the hot wings and was quite happy to find that the sauce tasted exactly like Wing Stop's. The breadsticks were filling... I would compare them to Papa John's only fresher. 

My friend got teriyaki chicken strips and a side of fries. The strips were smallish but good. The teriyaki was on the sweet side and it didn't really have the tangy taste I look for. I would compare the fries to Five Guys only not as greasy and flavorful. 

All said, I will definitely go back as I'd like to see this place succeed. I'd give 3.5 stars if I could but I just can't go as far as 4 stars."}
{"text":"Friendly owner touched each table and even brought out free desert samples. The portions were large, delicious, and inexpensive. Loved the dipping sauces."}
{"text":"Based on reviews I was very eager to try this place.  It is about 45 minutes away from where I live but since I was on that side of town I figured I would give it a try.  I got the family pack, which included wings and bread sticks and I also ordered fries and chicken strips.  Those were the most bland chicken strips I have ever had and the wings were mediocre at best.  I would have given this place only 2 stars but the girl at the register was so nice and patient with me, since I had a hard time decided I gave them 3 stars.  The food was pitiful and a waste of money, but the service was great.  Not sure why the reviews state that these are the best wings, they really don't know what great, well even good wings taste like.  Not worth me making another trip."}
{"text":"The mild chicken strips were delicious. The breadstick was amazing. The staff was very helpful. We sat on the patio outside and the owner personally asked us how our experience was --- he even stopped in the middle of a conversation to say goodbye as we left."}
{"text":"Great chicken fingers and a large selection of sauces. The garlic bread sticks are awesome!"}
{"text":"Wings are the thing here!!  Yes, they also sell strips which are always tender and fresh. We get them occasionally.  Or a mix of the wings and strips.  But the wings are our favorites.  We order them extra crispy and prefer the hot, garlic parmesan sauces.  Flip'n hot is also good but a bit too much heat for the others in my family.  We like pretty much all the flavors but tend to stay with hot and garlic parm, and occasionally honey barbecue as well.  

Fries are top notch and there are always plenty!!  Their bread is made fresh daily and you can tell.  Soft, buttery and a hint of garlic.  It's the perfect complement to the wings!!  

They always greet us with a smile and make sure we have everything we need whether we are dining in or taking home."}
{"text":"My daughter LOVES this place, and I like it a lot!
We usually get their strip meal - nice strips of chicken, garlic bread sticks and some carrot/celery sticks with dressing/dip.  
I get the HOT sauce and I sometimes mix it up - you can mix and match sauces to layer on more flavor!
This is NOT classic buffalo wings - but if you like fresh chicken, veggies and fresh made garlic breadsticks - this IS the place for you!
Annie recommends it highly and so do I!"}
{"text":"I love this place! Their menu IS limited to breaded/sauced chicken strips and wings, yes, but if you like either and really good buffalo sauce, this is your place. The buffalo sauce (available in mild, medium, hot and frick'n hot) is really tasty, and I'm kinda critical about buffalo sauce. If you like spicy but not quite eye-wateringly spicy, I would suggest the medium.
They offer BBQ and garlic Parmesan sauces too if you're not feeling buffalo-y this time around. I believe there may be one or two more non-buffalo sauces as well but I can't remember what they were.

Some places do the crispy, fried up kind of wings and some places let the wings remain in their normal, juicy state. Their wings are of the the latter variety, which I prefer intensely. They're also generously sauced, which I also prefer intensely. 
The strips are breaded, very, very juicy and also generously sauced.
I have a hard time choosing between the two whenever I go and normally, I'm not a chicken strips type of person. I'll always definitely go for the wings most anywhere else.
Aside from breaded/sauced strips and wings, they also offer chicken strips tacos and a buffalo chicken salad.

Yes, I thought the garlic breadsticks being a side item in their meals really odd at first too but their breadsticks are also very good, so.. who cares, right? They also offer fries, potato salad, garden salad, macaroni salad, coleslaw and sticky rice as separate side items. Their side items are large and basically family size (I went with one other person the last time around who ordered a side of fries and we barely ate 1/3 of the plate together). They may allow you to substitute a smaller portion of one of those for the breadsticks in their meal deals but I'm not sure. I've never asked, so don't hold me to it. Worth asking though if you really don't want breadsticks. They seem to be very nice, accommodating and eager to please.

The restaurant is sort of small but it seems most people take their orders to go anyway so there's usually not a problem getting seating. It's wedged and recessed into the corner of Fresh Market, and I do mean wedged. You're probably not going to notice their sign from the road or even after you pull into the shopping center. Just head toward Fresh Market when parking.

Definitely give them a try if you're a wings fan!"}
{"text":"Good solid wings every time! Love the bread sticks. Perfect place to grab quick food at a good price."}
{"text":"Wow!!  Just got a regular order for lunch here today and that is all I can say....... Wow!!  The regular order included 6 wings and 2 breadsticks, with some carrots and celery on the side.  The wings were very good.  I got the Sweet BBQ sauce on them and it was very tasty and balanced, not overly-anything.  However, I thought the breadsticks stole the show!!  I was planning to eat just one to try to be good :), but the breadsticks were gone before I even tried the wings!!  they were freashly baked and super soft.  Very Good!!  I'm a fan!!  I will certainly visit again."}
{"text":"We were debating on trying this place or the thai place next door & then a co-worker of my husband's came out of flip'n chicken, so we decided to try it.  I'm a wimp, so we ordered the mild chicken wings & breadsticks. We shared 25 wings & wanted to try the breadsticks, but thought 12 breadsticks were overkill.  The nice man at the counter said we can substitute 6 of the breadsticks for french fries so we took him up on that offer.  First, the breadsticks arrived & I had to say they put Olive Garden's breadsticks to shame.  These were by far the best breadsticks I've ever had!  Then the wings arrived & I was a little nervous because I could smell the tabasco & the wings looked like they were covered in it, but suprisingly it was quite mild. The wings & french fries were very tasty, the breadsticks were awesome as was the customer service!"}
{"text":"Meh.... The food was ok. But damn we waited for ever for our food to come out. Mine was luke warm at best fries were soggy. I don't think I'll be back"}
{"text":"Having read about Frick'n Chicken in the local newspaper, I had to try the place out.  Service was great and the food was excellent.  I had the Chicken tenders were very tender and the frick'n hot sauce had a good amount of kick and flavor.  The included breadsticks were a big surprise.  Made from scratch, these babies were quiet delectable and filling.  I will definitely go back to try the wings and various sauces."}
{"text":"Absolutely amazing. I highly recommend anyone trying this place they are delicious! Their staff is friendly and their atmosphere is very inviting"}
{"text":"Delicious! Great service & great food. One of the best places in Charlotte for wings. The garlic Parmesan wings are my favorite!"}
{"text":"So good I went for lunch 2 days in a row while in town on business! Chicken strips and sauce were awesome!"}
{"text":"I visited yesterday 11/15/2011 and ordered the 10 wing combo with ranch dressing. I mixed the flavors so I had 5 hot and 5 lemon peppers with a side of extra hot. 

The wings were among the best I have had in the Charlotte area and I consider myself a wing connoisseur. I think I've eaten wings at just about every wing place in Charlotte lol.  I especially enjoyed the lemon pepper wings and the extra hot sauce.

They also carry draft beer at a very reasonable price. 

I would have given it 5 stars but I did not like the idea of eating breadsticks with wings and being charged a dollar more for french fries."}
{"text":"Greeted with a smile from a nice cashier. A variety of wing flavors to choose from. Not much options for a combo either a 6 piece of the option of 24 wing combo w/ a 8 piece breadsticks. The breadsticks were ok a little salty I had the garlic Parmesan and lemon pepper both ok. I feel you can get more wings for the price at other places. In the future I may try one of the wet flavors."}
{"text":"Went here today and had a horrible experience. I ordered a 5 piece honey barbecue chicken strip meal to go. When the lady came out, she brought me something completely opposite of what I ordered, and also put it on a plate instead of in a to go box. Then when I corrected her, she came back out with another wrong order and it still wasn't to go. She was rude and showed poor customer service. She was also slow and didn't care that she kept us waiting for 10-15 minutes for a simple 5 piece chicken strip meal when there were no other customers. The service was horrible and I am never coming here again."}
{"text":"Best chicken wings and strips in Charlotte. Friendly management, good food, highly recommended."}
{"text":"I Ordered 50 of the hottest chicken wings and breadsticks. The wings were excellent, some of the best wings I've ever had, and that's saying something with the amount I eat. It was fairly cheap and very hot. The chicken was excellent. But the the bread sticks were pretty bad. Overall one of the best wing places anywhere!"}
{"text":"Prices have changed, significantly.. Unless there was an error in my order, I paid $1 per wing.. the only extra included was a cup of ranch, that I didnt even specify ((I would have preferred blue cheese)). Did something happen in the chicken industry to make prices go up so drastically!? I can't afford my favorite chicken place now."}
{"text":"Best Flip'N Chicken wings. 

Try the Flip'N Hot mix with Honey BBQ sauce. And if you're like me and need rice in every meal....no worries. They have sushi steamed rice. Oh, and beer too :)"}
{"text":"Bomb! Bomb! Bomb! Man this place is great! I was traveling through town and was looking for good wings, and I'm glad I found these. If I'm ever there I'll come again. Great food, service, and prices!"}
{"text":"Best wings in Charlotte.  I like a blend of barbecue & buffalo (sort of like Goldrush sauce at Tavern on the Tracks) and they totally delivered.  Everything was tasty.  For 7.99 you get 5 wings, bread, carrots & celery & either ranch or blue cheese.  You can not beat this place!  Love it."}
{"text":"We love Flip'n Chicken!!  When we first started going here, we both got the wrap.  Now, I still get the wrap medium, with extra sauce and Kevin gets buffalo wings and lemon pepper wings (lemon pepper are the best!).  Mine comes with fries, and his with some great garlic bread!  The more garlic the better, today was the best they've made it!

We are known here and our orders are put in before we walk in.  Sad, I know, but we are regulars here and love it!

We also love coming here because they have outdoor seating and our dog Rocky gets to come.  He loves it too as he gets our carrots!

Do yourself a favor and go try them if you haven't!  We will be back soon!"}
{"text":"We came in for an early Saturday lunch.  We were the first visitors which allowed plenty of time to look over the menu and talk with the woman at the counter.  Service was friendly and she provided good suggestions.  Family friendly.  

The food was ok.  Texture for the strips was good and the chicken was tasty.  The sauces were just ok.  The hot buffalo tasted like the Franks buffalo sauce, little heat.  Not bad, but not worth going out of my way.  The portions were good and the breadsticks negated the need for the side of fries we ordered.  My wife and kids had the garlic Parmesan which they enjoyed.

So it fit the bill, but I would have preferred additional flavor options.  I will stick with Wingstop's Cajun or Louisiana rub."}
{"text":"Hmmm. Wing stop was better I say. Had wings, as in real chicken wings - not bonesless or strips - those did look good"}
{"text":"this place didn't impress me. I got the chicken w/ garlic sauce and it was just ok. Nothing special. the breadsticks were the best part."}
{"text":"I had high hopes for this place but it was just ok...

I enjoyed the garlic bread and veggies with ranch dressing but the chicken wings were not my favorite. I opted for the mild wings...I didn't really care for the sauce...it was a little plain and bland but that's just my personal opinion. Maybe next time I will try another flavor or a different option perhaps the chicken strips? 

But still not my favorite wing place."}
{"text":"I have visited this place often for lunch when I worked over in the Ballantyne area.  Typically order a 10-piece wing, with garlic bread sticks and drink.  Sometime I will additionally order chicken strips, chicken tacos, or fries.  They make them to order, so there is a wait generally 10-20 minutes (depending how busy they are).  The hot sauce has a Texas Pete taste to it, which gives it a nice zing flavor.  The Flipin' hot burns in and out, so watch out!  The fries are typically crispy, though once they were soggy and stuck together.  The owners are friendly and the atmosphere is... well... a hole in the wall, but they do have good wings."}
{"text":"Flip'n Chicken is just one of those places that aims (and succeeds) at doing one thing and doing it well.  In their case, it is buffalo chicken strips/wings.  If you are having a craving for buffalo chicken, this is a great place to go.  The menu is fairly limited, but it is because of this focus.

One unusual thing about Flip'n Chicken, as I believe other reviewers have commented, is that the standard side that comes with your strips/wings is a serving of garlic breadsticks.  It does seem odd at first, but their breadsticks are soft, freshly prepared, and work well with the chicken.

The owners are extremely friendly and genuinely care that you are having a good meal.

Even though they are in a relatively small strip retail space, there are a decent amount of tables inside, as well as several tables in a front patio area (a great place to go when the weather is nice)."}
{"text":"I have given this place a second chance and they did not disappoint me. As a matter of fact they have not disappointed me every time after that. I love the food. The staff is very courteous and friendly."}
{"text":"Frick'n Chicken is \"Frick'n Awesome\".

The chicken strips are juicy and flavorful.

The breadsticks were incredible.

Wow - you gotta check out Frick-n Chicken"}
{"text":"Best chicken I've ever had. If your ever in the NC/Sc area it's worth the 1-3 hour drive for sure!!"}
{"text":"Some of the best chicken I've ever had, made fast and not a bad price! Everyone is super nice and just all their food is great. Fries are gone made and so is the ranch, which is delicious!!"}
{"text":"These wings and strips are great! It indulges your senses in so many ways.. Buttery garlicky bread sticks, tender and spicy wings, cool home made blue cheese dressing. A great place to enjoy buffalo wings the way they should taste."}
{"text":"Hidden in between two stores.. Flipn Chicken has average chicken tenders and wings and is over priced. Rude customer service"}
{"text":"Heard rave reviews on Creative Loafing, so I went there two days ago.  Ordered 10 BBQ wings and four breadsticks.   Loved the breadsticks, the wings were decent, but I have had better in Charlotte."}
{"text":"First time in, great chicken, great sauces, fries were fresh and delicious. The bread sticks however are to die for!!! If want wings or strips, this the place in south Charlotte!!!"}
{"text":"Was in Charlotte for a 5 day stay and always try to eat local when I'm out of town.
Flip'n Chicken was the perfect lunch spot, low key, conveniently located, courteous staff, self serve fountain drinks, this was a plus for me as I hate having to wait for waitstaff to refill my beverage, and reasonable pricing.
Ate with 2 other adults and two young teens.  Ordered the 20 strips family meal and 2 orders of fries. Unexpectedly this came with ranch, blue cheese and fresh vegetables, a nice touch. It also came with 8 or 9 HUGE amazing bread sticks. Best bread I had in 5 days in Charlotte. I would go back just for them. Since we had 5 people, We asked if we might have sauce on the side and we were provided 5 of the 10 available sauces with no upcharge, another plus for me as I love condiments. The fries were clearly fresh, hot and perfectly salted. The chicken was above average, tender, nice amount of breading to hold the sauce and hot. Overall, an amazing lunch meal for 3 adults and two teen girls, out the door for $40 including a tip (this is a counter order, deliver the food to the table and leave type place so I don't see the need to tip but the counter guy was super friendly and didn't charge for extra sauce so I felt it was warranted). That's hard to accomplish at a fast food joint and this place is far above any of those.
It was 96 degrees, so we sat inside, but they did have a nice looking outside seating area as well."}
{"text":"I've tried Flip'n Chicken 3 times at this point and if you like incorrect orders & lack luster service this is the place for you."}
{"text":"Ordered 24 wings for my family's super bowl dinner.  Unfortunately, I had to pop some Tyson Dino nuggets in the oven just so there would be enough to make a meal.  The Flip'n Chicken wings were incredibly small, and were very different in size!  Not what people expect when you are ordering restaurant quality wings for the superbowl! We will not order from this restaurant again."}
{"text":"The food here is amazing! Everything was prepared so well and in a timely manner. The portions are generous and filling as well! The staff is super friendly and even opened the door upon us walking in! 

Make sure to try the buffalo chicken pizza sticks! So yummy!!! The dining space was also clean and had plenty of seating."}
{"text":"Amazing! I am new to the area so I wanted to try something new. I was greeted and asked what I would like to eat. I told the cashier that it was my first time there. I wanted to try the tenders. He explained that their chicken is fresh and never frozen, and all tenders were hand breaded to order. I ordered 3 tenders and chose Garlic Parmesan sauce. I also chose fries as he said they were hand cut. He threw in one of their fresh breadsticks for me to try. I chose their homemade ranch dressing. When my food came it was piping hot, fresh,  and the chicken was spot on - tender, juicy, and well seasoned. This is definitely my new favorite place for fresh chicken tenders!!!!"}
{"text":"Dropped in to buy 6 wings at 6pm on a Saturday. It took 30 minutes to get my wings Togo and when I got home there was no ranch(dipping sauce).  Gotta have my ranch!!"}
{"text":"YUM! I have high expectations for any restaurant that has a small menu, because I believe what is served should be delicious and of high quality. Flip'n Chicken did not disappoint! I got the regular strips meal and my husband got the regular wings meal, both with the mild buffalo sauce. Besides the wings being on the small side, the flavors were fantastic. The mild buffalo sauce was flavorful and balanced, the chicken was tender, and the house made breadsticks were out of this world. Oh, and the blue cheese dressing was some of the best I've had, especially combined with the buffalo sauce. On top of that, despite the small space being busy on a Saturday evening, the service was phenomenal. We will be back!"}
{"text":"From almost getting hit while trying to leave carmel commons.. i come home to the 6 piece set i asked but one piece is a bite sized nothing  and the rest are tiny... whats happening with food service these days i just dont understand

But out of everything i know truly that this place offers amazing white meat chicken with incredible flavors that make your mouth water! Try the lemon chicken!!!"}
{"text":"Keeping it short and sweet because it is a Place to get wings. They are delicious. If you're in the mood for wings, highly recommend!! They have a variety of flavored wings & Beer on Tap. Definitely family friendly. A little on the pricy side for wings but definitely worth it!"}
{"text":"Have you ever wondered why the great moments of your life have been so great? What is the common denominator between cute puppies and life fulfillment? The answer is Flipn Chicken. An amazing restaurant with great food and great employees. You want to eat here. One of my favorite places in all of Charlotte to eat a great meal for a great price with great staff and great atmosphere and great restrooms in a great shopping center with a great parking lot on a great road with great amenities in a great suburb of an even greater city."}
{"text":"First off, Flip'n Chicken falls into my top 2 of all time best lemon pepper wings spots.  Tbh I can't get off those so can only give a review on those and  the garlic parmesan flavor.  Yes I get personal when it comes to wings .  The GP don't disappoint either. They were packed with garlic flavor and heavy grated parmasean. Warning- ladies wipe your lip glass off first! Joseph, the Manager, recommends \"the mix\" of lemon pepper/ which is oily- with the medium wings. In fact, you can mix it up like TI- \"whatever you like\"! I've been eating here for 3 years and they are absolutely consistent. 
Bread sticks ( day 2 into my low carb plan), are buttery deliciousness in what tastes to be like yeast dough. I just had a bite of one . Just learned a little factoid- during the 2016 Super Bowl they sold over 10,000 wings!  I rest my mic"}
{"text":"Stumbled into Flippin Chicken last night by accident! The best chicken I've had in Charlotte! Fresh, simple and total 
explosion of flavor ! GET THE STICKY RICE! This little gem of a place should be everywhere!
Fox Watson"}
{"text":"My husband and I recently moved to the area and have been hearing great things about this place.  We were super excited to check it out.  Well, I don't think we will be going back.  It wasn't very good.  We got a bunch of the different flavored strips to try.  Maybe their wings are better. I sure wasn't impressed with the chicken strips.  And they say that it is served with veggies.....we received 3 tiny strips of celery with 16 strips of chicken."}
{"text":"I went in for lunch  no one greeted me when I came in waited at the counter while the two girls were looking at their cell phones I waited almost 7 mins before I was assisted. The girl was not very pleasant and my wings came out very hard not cooked well at all. Very disappointed in the food and the service, will not come again"}
{"text":"Great food! But to be just a basic wing spot their prices are getting a little bit ridiculous! This use to be one of my favorite wing restaurants in Charlotte, but the constant increase in pricing has turned me and my husband off. Especially since we can get the same quality wings for a cheaper price elsewhere! We are hoping that they will put a Wingstop in south charlotte soon!"}
{"text":"Food was ok, not my favorite wing place, but doable. Great service!"}
{"text":"hmmm...  the best wings in charlotte, for sure!!  

New flavors are in...  the lemon pepper and garlic parm are my new faves! my mom loves this place, too...  she thinks the owners (my friends samar and chris) are the best!

This place rocks!!  We'll be back for more!"}
{"text":"Came here for lunch around 12:30, and it was decently busy. The restaurant inside was small, a couple tables (which all seemed to be filled up when we arrived), and a small patio but it was way too cold to eat outside. Their menu is pretty small - but I knew I wanted wings. I got the 6 wing combo - medium buffalo - with a drink. It seemed to come out pretty fast, which was good because I did have a time crunch. The wings were good, flavorful and saucey! It comes with bread, which is a bit weird... I thought it would come with fries (which is why I did not order any). When I started eating the bread it was a little underdone, so I ate about half. 
Overall, it is a quick and easy (if you can find decent parking) place to go for lunch - I probably would not go for dinner though."}
{"text":"Fast , friendly service! First visit so I just wanted a sample. Very accommodating. Got the kid's meal with 3 wings, bread sticks, soft drink , veggies and Ranch.
Ordered the hottest wings they offer, but to me they were not very hot, but they can make them hotter and mix up the sauces to your taste. Very nice! Wings were cooked perfectly and very tasty. The bread sticks? Just WOW. More like pretzels with buttery, garlicky, salty chunks.  Strange pairing with wings, but oh so good. And all for only 3.99! Definitely take your kids there. Good price. I wish the home made Ranch was a bit thicker, but tasted okay. Give this place a try. I was happy with the food."}
{"text":"The Best Chicken Strips Hand down!!  Outstanding service and friendly staff. I was new to the area, this have quickly became my go spot, since I have been here."}
{"text":"Omg the food is freaky amazing...........I dunno where to start!!! The employees are all nice.... greet you as you come in they are all clean and professional. Food is prepared great and the service is awesome!!!! This is my favorite chicken restaurant!!!!!! My wife loves it and she is a picky eater lol but she high fives this place and highly approves!!!! I would even cater a party from here it's just that great! To top service off they check on you to make sure you don't need anything which most fast food places don't do and they gave us a new menu complimentary dessert! We love you guys and hope you stay in business forever!!!!! We would of took a picture of our plates but nothing left to show!!! Just that good!!!!!!"}
{"text":"AMAZING! I don't know what else to say. The food was absolutely delicious. Service was fast and amazing. The bread sticks are to die for! And the food overall was by far some of the best I've ever had. Keep it up!! I will definitely be back!"}
{"text":"Ate lunch here today. I'd say it was mediocre. Ordered 5 strips meal. Strips were soggy but ok tasting. If the strip had been crispy, I'd have probably given 4 stars. Breadsticks were fluffy and warm but could've used more garlic and a dash of parmesan."}
{"text":"Hands down the best wings in Charlotte. Wing King is good, but Flip'n Chicken consistently delivers for me. The two working the register are always polite and helpful. My order is always right when I get home (minus the three breadsticks i eat on the way). The Lemon Pepper is our favorite flavor, but if you like spicy they certainly have it. If you haven't tried this place yet you should because it just doesn't get any better."}
{"text":"The food is not bad, but be advised that fries don't come with the meals - Only chicken and breadsticks, we learned the hard way. Also only got one little cup of honey mustard for the large 8 strip meal. Its all right but the nickel/dime stuff won't bring me back again."}
{"text":"The food is very good.  I've had them at work.  But the service if you walk in is painfully slow.  The owner seems to spend far too much time fraternizing then getting orders out."}
{"text":"Had such a wonderful experience here! Samar was so hospitable. She was very friendly and let me try some of the food items. Also, the food was amazing! I love the fact that they don't freeze anything.  Even the sauces are made in-house.  I highly recommend Flip N Chicken!"}
{"text":"Average wings. Definitely not the best in Charlotte! I like mine well done and these were barely done although not undercooked. The sauce (I had Tangy) was okay, but, again, nothing special.  I would have given only 2 stars but the service was good and the wings were acceptable. Don't expect great wings and you'll be satisfied. The breadsticks were better than average."}
{"text":"The wings were a decent price but not very good, there was hardly any sauce on the wings and they were dry. The only reason I would go back to this location is for the convenience and location."}
{"text":"My dining mate and I decided to try this place for lunch since we were in the mood for chicken.  Strips , sticks and wings featured from all natural fresh and never frozen chicken. 
 There is about 11 types of sauces  featured for the chicken; from lemon pepper, honey barbecue ,Teriyaki, Buffalo sauce,  garlic parmesan and so on.
 Bread sticks and Veges such as carrot sticks and celery sticks are also included with your meals along with home made dressings.

 Other menu options are such features as chicken wraps, Buffalo chicken salad  chicken strip rice bowl and Buffalo pizza sticks.
 Fresh cut French fries and sticky white rice are also available as a side as well as potato salad , garden salad and a mac salad.
The menu also features a kids meal .
Fountain drinks , bottled  beer are available and a dessert,  little flips , powdered sugared  fried  dough.

 We ordered the 5 strip chicken strip dinner which was $8.50. 
For me a bit pricey since I am not fond of bread with this type of meal and would have preferred a salad instead of bread and the carrot and celery sticks.
I must say that the chicken tenders were very moist flavorful and delicious as well as our sauces we chose ( honey bbq and garlic parmesan ).
 Bread sticks and carrot and celery sticks very common; nothing extraordinary.
 We were there at lunch time  and no other people in the restaurant except us , but they seemed busy with take out orders and people coming in to pick up their orders.

 The place itself was very blah and not the most comfortable atmosphere to dine in.

 Our food came out hot, served on disposable plates, plated reasonably nicely.
 Staff was friendly and accommodating.
We really enjoyed the chicken and would return to try their wings."}
{"text":"Grabbed some chicken strips and fries from here for dinner. The staff was fine and had my order ready when I walked in. The strips were tasty but nothing spectacular. The fries were really good. They were a bit expensive but tasted good none the less."}
{"text":"Favorite place in the whole wide world. Best wings in charlotte hands down. Wonderful people and wonderful food"}
{"text":"So excited I found this place! I love wings but usually not boneless but the flavors they layer in on their tenders is amazing. I love the lemon pepper!"}
{"text":"Love this place. It has the best chicken strips in town. All their sauces are great but teriyaki is my favorite. 
We often get wings for take out for football games.
The one drawback is they have awful tea. I am a big tea drinker and have to get water, then go to McDonalds for a tea to take back to work.
But the food is worth it."}
{"text":"So tonight I went to FlipN'Chicken for my first time, although I was really excited I became very disappointed QUICK! I posted a picture of where I was sitting while waiting on my Togo order. 

I spent $17.00 which included my tip, waited for about 15+ minutes on my food to question my money back just as they were about to pack it up.

So as I was sitting watching my food being cooked and prepared a young lady with blonde hair walks in. She goes behind the counter, types something into the register and immediately starts putting chicken in the fry. YES... She did not wash her hands...

I watched very closely because I was hungry and also praying that whatever she was doing it would not involve her touching my food. She walked around touching other food and things and still... NOT WASHING HER HANDS! My skin began to crawl because I have no clue where she had just come from, but where ever it was her hands needed to be cleaned before touching mine or anyone else's food.

Then it happened, she went to assist the gentleman with my food. Opened my box of fresh chicken wings, sticking her hands in the bread bag that would hold my breadsticks and still NO CLEAN HANDS!!!

I got up, and it just so happens that she was the one to walk over and assist me. I asked her if I could have my money back. She didn't ask why, she just said \"oh you're food is coming up right now!\" My response: yes I see but I would like a refund thank you. The guy who took my order and prepared my food came over and asked if everything was ok. I said politely and quietly because I didn't want to ruin the other guest dinner that she did not wash her hands. She walks over and says \"but I came in to fix my own food\". My response was: You did not wash your hands, plus your food was not the only food you handled. You opened my box of chicken and opened my breadsticks bag, putting your hand inside before putting in the breadsticks.

The gentleman gave my a refund as the lady walked away. And I kindly said to him, she did not wash her hands and that's nasty. It doesn't matter if she is handling her food or my food, that's unsanitary and for this to be my first experience here.

I was really excited about trying these WINGS and so was my belly. Especially after all the post and comments... But that did not happen tonight."}
{"text":"Given them another chance and have ordered take-out twice in the past few months.  I made sure to double-check my orders before leaving, but both times the orders were perfect and the food was delicious!  Can't beat their buffalo chicken tenders when they are cooked correctly!  YUM.  Perfect game-day food."}
{"text":"These are the best wings and tenders I've ever had! I've been a handful of times and every time the chicken is extremely fresh and very tasty. The customer service is great too. All other wing places need to take notes because Flip'n Chicken has raised the bar for high quality chicken. 
Note to owners - Don't change a thing! People recognize the freshness and quality, which differentiates you from the other chicken places around."}
{"text":"This place is always delicious and the wings I get (lemon pepper) are always crispy and flavorful. And don't even get me started on the bread sticks omg- so so so good!!"}
{"text":"Have you had the chicken strips here? Well I'm obsessed. And they're Blue Cheese is killer! (The fries suck....you've been warned)  went here for lunch, only a few highschool kids were there. 

The kitchen is open, which is nice....I would like to know if someone drops my tomatoe on the floor...kidding!! The staff is friendly. Next trip ill order wings for sure! The restaurant is pretty small. 

I would definitely swing by here again."}
{"text":"I'll have 10 wings and ....Bread Sticks... (What the ....)

OK so my nearest Buffalo's Southwest Cafe closed down last week which offered a good selection of 49 Cent wings on Tuesdays..... so I decided to give these guys a try tonight, after-all it is new business, so why not just see what this place is about. 

Upon entering this very small business, we were greeted by a nice gentleman who asked if we were in for the first time, we stated yes, and he explained the menu choices......OK they serve chicken, chicken, and chicken. To be more specific they serve chicken. We chose the chicken.

I noticed the seating area contained two TV's not an extensive selection of sports to choose from as they advertised, but at least two and a half men was on so I felt I was \"WINNING\".

The tea dispenser was unusual, as it contained sweet and un-sweet tea.  You push a button to select your choice, however the teas tasted of an instant type of concentrated tea, which was not  good at all.  Off to the nice Coca-Cola fountain drink machine located beside it.  The ice was cold, fresh and when added to the Coca-Cola it was very refreshing.

The meals we chose were: Chicken Tenders, and the Chicken Wings ( I have added a picture of both meals) I was unfamiliar with Garlic bread sticks with the chicken wings, but they were hot, fresh, and drenched in butter.  They were good, but again, with chicken wings? 

It would be nice if they had a wider menu selection, beside chicken, however it is nothin' but FRICK\"N Chicken.

I wish these folks well in the chicken business, but because of the limited menu items, and the oddity of the bread-sticks, the prices are too high to maintain a viable business........prove me wrong, but I assure you, this place will be gone by December 2011. 

NCFoodGuy"}
{"text":"Pretty middle of the road experience. 
Little high for 6 wings but does include good garlic bread sticks. 

Wings were pretty average size, smaller than other places that specialize in wings.  Seemed like your grocery store wings. 

Flavor on the Flipn Hot Buffalo was good, but it tasted like Frank's Red Hot, with extra cayenne. 

The celery carrots and dressing came in a little bag, which felt like a cheap carry out package but was fresh and tasty. 

All in all, like doing your own at home, but $$

Friendly staff."}
{"text":"I went in for the first time, I was not greeted, I was asked what I wanted and he took the order.  The place was empty, I made an order to go, I sat down to watch the tv.  People came and went before and after me, I suppose the called in orders were ready..  However I was completely ignored, I finally walked up to the counter to say something about the wait, the guy turned around walked to a cart picked up mine and handed to me.  WTF, no sorry for the wait, no sorry I didn't know you were here, Never, never will I set foot in this place again, until someone teaches these folks that they are a customer service driven business and their costumer service sucks. Just had the cold wings, save your money go somewhere that wants your business."}
{"text":"The food is great, the wait not so much. When you go there for lunch make sure you have at least 30 minutes to wait on food.   The breadsticks are to die for definitely a must try. Overall a good place."}
{"text":"I know it's the kids meal but could it at least be 4 wings instead these sad 3? Flavor was okay, had the medium Buffalo tasted more mild."}
{"text":"I loved this place as Wingstop and used to go there quite often.  Once it closed I was just waiting for someone to open it back up as their own little Wing \"shop.\"  I think the wings and strips are tasty and very similar to what Wingstop offers, particularly the garlic parm wings which were very good.  I'd have rated the joint higher if 1) they would improve their ranch and bleu cheese recipes.  If you're only going to serve Flip 'n Chicken, have some Flip 'n decent (ok, good) dressings.  2) The breadsticks are not something (IMHO opinion) are looking for at a wing place and they weren't all that great.  Keep the breadsticks and just charge me less.  To the owners: If your business is struggling and you thought it was the name, that's not the problem.  (The place was called Frick 'n Chicken which they changed to Flip 'n Chicken presumably because they thought the name was holding them back somehow?)  You're off to an ok start but improving the dressings would help me get back there more often.  Just some constructive criticism."}
{"text":"Today was my first time hearing of this place as well as visiting. My overall experience was superb. I placed my order over the phone and the owner, I believe, answered and promptly took my order while guiding me to figure out what was best for my lunch needs. I am a huge fan of anything hot so I ordered the hottest flavor they have and the kind lady suggested that I get their hottest flavor on the side and get the 2nd hottest flavor for my wings  just in case the atomic flavor was a tad bit too spicy. I ordered with a side of fries for an extra $1 however 3 breadsticks comes with the meal with no surcharge. The ranch & bleu cheese were both made in store and they were delicious. I am so glad that I found this spot. The customer service is amazing, the food is amazing, and the overall feel of the place is amazing. Also it's close to my job so that's a plus :). Great job guys."}
{"text":"It's in a small place so there could be nowhere to sit during weekday lunch time. Walk in and order at the front counter, then you can grab your beverage and they will bring your food once it is ready.

I don't get the breadsticks with wings scenario... and neither do a lot of people I've talked to about it. Oh well, it's just different. In a couple different visits, I have ordered the wrap and the tacos .. since I'm not a huge wing person. They both tasted good. I like the fresh cut french fries! Not a hard thing to do, but so many places struggle to do fresh fries.

They claim to be all fresh and not frozen, to the point where they don't even have freezers in the kitchen. Can never go wrong with fresh!

One thing to note... They advertise beer and wine. You can see the beer taps but apparently I heard from a source they don't have the ability to serve alcohol products.

A flip'n good option."}
{"text":"My new favorite place!!! I came here for the first time. I got their chicken fingers in the flip n buffalo style. It's more of a cayenne flavor. It was good and spicy!! 
Their breadsticks are insane. Fat and fluffy with butter and garlic. I could easily eat four but opted with only eating two. Ranch is good. My fiancé loves their bleu cheese dressing. I seriously cleaned my plate off. So delicious!!"}
{"text":"Great wings, I heard about this place from a friend and she is a picky eater so I knew when she said it was good I had to try it. There wings were so good I was licking my fingers tryin to eat all the sauce.  They are not small wings medium size and they serve them with breadsticks I thought it was weird  but the breadsticks were amazing dip them in your wing sauce its enough to make ya smack ya mama lol  The staff is so friendly , spread the word and I  say grab some breadsticks if your having pizza or spagetti at home."}
{"text":"I'm finding myself eating wings a lot more since I came down south, and I can say that Flip'n Chicken does it well! Forget Bojangles when it comes to wings. 

First off, the people who work there are very welcoming. Call me corny, but I like it when someone asks, \"Have you eaten here before?\"

Now onto the wings...there's plenty of flavors and the chicken is cooked just right. With your wings you'll get plenty of breadsticks...and I mean plenty. Personally I found that part to be a bit much. If you're going to eat here, you'll enjoy the food. Just make sure to leave your diet at the door."}
{"text":"This place is Amazing! My husband and I first Time eating here and we will definitely be back! Fresh chicken, fresh bread sticks and superb Customer service!"}
{"text":"Flip N Chicken where have you been all my flipn life!!!! I've driven by this place a million times and only went in on a wim and I was so surprised by what they offer. 

If you come here you must try their breadsticks!!! They are AMAZING!!! Also ask for extra butter dipping sauce for the breadsticks. 

The wings were really. We ordered the large meal of 10 wings. We chose Garlic Parmesan and mild Buffalo for our flavors. Let's talk about this ranch dipping sauce. It's that good kind of ranch. It pairs so well with the wings. 

The inside isn't very big but it's set up nice. They have a few TVs for sports fans and a very homey feel. The staff was very helpful and so friendly. We were in a time crunch and they got our order placed and out very fast. 

We didn't order fries this visit but they have been recommended by a friend of mine. I can't wait to order them and dip them in that amazing ranch!!!! 


Flip N Chicken 
7629 Pineville-matthews Rd
Ste A
Charlotte, NC 28226
Sunday December 3, 2017 4pm"}
{"text":"I try to come here every time I'm in there area. My favorite place for wings or strips. Always good service and great food."}
{"text":"Looking for the best wings in Charlotte? You have found them at Flip N Chicken. Cooked to perfection, the wings are not too big and not too small. The sauces from mild to flip n atomic are delicious. Served with fresh breadsticks, carrots, celery, and homemade blue cheese. All if this topped off with awesome customer service."}
{"text":"Delicious....I got the 5 piece chicken strip combo with medium BBQ...it was awesome...the chicken was really good and I liked that the ratio of breading to meat was lower....they dont skimp on the meat by any means...word of advice, you will need a lot of napkins!"}
{"text":"This is a fast casual establishment. Quick walk-up service and fast delivery to table, both courteous. I ordered the chicken tenders rice bowl with medium Buffalo sauce and a OMG Copper beer. After sitting down I noticed is been charged $3.50 instead of $3.00 (import price instead of domestic price). Since Copper is brewed here in Charlotte, I asked the manager (Andrew) for a refund of the difference, and he gave me the 50¢ without debate. But, he explained that the cash register has only two settings (import and domestic) and that Copper is considered an \"import\" because it's a craft beer. He even called an owner to explain this to me, but I declined to get in the middle. I simply suggested that the owners consider rewording their menu to make the prices clear instead of basing their reasoning on a dichotomous cash register setting. 

Overall, for this type of place, I have to give at least 3 stars -- food and service were quite good. I added a solid fourth star because Andrew remained not just courteous during our interaction, but was curious enough to research the issue and displayed integrity in reporting back the owner's answer. I hope to be back, and won't dispute the Copper price next time now that I understand the backstory."}
{"text":"Visited based on the reviews for lunch.  Honestly it was Forgettable.  Wasn't very busy, took a while for food.  The strips were super soggy and not very big.  Nothing screamed amazing.  Seems like you pay for the two giant breadsticks.  I probably would not return."}
{"text":"Lunch review:
Food was awesome. 1 sauce for the small wings dish but the drink and bread make up for only 1 sauce. The girls are super friendly. One was a bit too friendly to patrons IMHO (chatted up seated customers and the girl busting her ass at the grill had to break away to take food orders). Aside from that the wait was about 10 min to get the food and it was worth it. Will be back!"}
{"text":"We used to love flip'n chicken so it pains me to write this review. We went in and ordered our food at 6:39. Usually the food comes quickly even when busy but tonight we were the only table and it wasn't coming quickly. After twenty minutes of waiting we checked on our food and the guy at the register said he forgot to print our order and proceeded to laugh. So we waited another ten minutes and still didn't have our food. So my husband went to check on it and had to wait for a few more minutes for them to acknowledge him and then they said there was another person with the same name and they got our food. So we told them to just give us our money back. So after over thirty minutes and with a very hungry 4 year old we left without eating! And never even got a sincere apology. So I would not recommend if you want to eat in a reasonable time frame or have good customer service! Flip'n Chicken really needs to re-evaluate who they have running their restaurant! And there isn't even an email address to contact someone who might actually care..."}
{"text":"Mmm wings.

Just a simple fast food joint where you order at the counter and they bring you your order. There are about 10 or so sauces like garlic parmesan, buffalo (mild, medium, hot) honey bbq, bbq and others.  You could either order boneless or bone in.  My friend and I ordered the platter which came with 16 bone in wings and breadsticks. We got half honey bbq and garlic parmesan for the other half. The breadsticks were big and we even got an extra order.  There were also carrots and celery that came with the order. 

The chicken was very tasty and just the right amount of flavor especially the garlic parmesan. The chicken wasn't too dry either.  

Service was great and as mentioned earlier, we even got extra breadsticks!

Prices aren't too bad either.

Great place with great wings!"}
{"text":"Ordered 24 wings, 3 flavors, Lemon Pepper, Honey BBQ and Medium Buffalo. The sauce flavors were great but the wings themselves were small and not much meat on the bone, dissapointing. If I was gonna try them again I would try the strips with the sauces not the wings."}
{"text":"In no way are these the best wings in Charlotte. DD  Peckers is a thousand times better. The service was slow and unpleasant. The food tasted ok but the wings are way too wet. I would recommend going somewhere else for wings."}
{"text":"Absolutely disgusting. Chicken was soggy and Parmesan garlic seasoning is the nasty version of parmesan garlic I have ever had!!!"}
{"text":"Great service you can miss it if you don't look carefully  but worth it. Right next to fresh  market"}
{"text":"Frick'n Chicken is tucked in a strip mall right next to The Fresh Market.  If you aren't paying attention you might miss it.  The staff was very friendly even though they are working off the rough edges after just opening.  They serve both wings and chicken strips.  I had the 10 wing combo which comes with 2 breadsticks and a drink. As in most wing places you can get either blue cheese or ranch with your wings they have a variety of sauces to choose from.  I ordered hot, but I also asked for a side of the frick'n hot sauce along with an order of fries.  My food came out quickly and was piping hot.  The amount of fries was enormous.  They are more than enough for two people to share.   The wings were cooked crispy and coated well with sauce.  But I thought they were a little on the small side in my opinion.   The hot sauce had a nice kick.  The frick'n hot sauce also had a nice bite, but as with many sauces that are amped up the flavor suffers when they pile more spices in to increase the heat.   Breadsticks?  With wings?  Never heard of it before but the breadsticks were awesome.  Hot and slathered with butter.  If the wings were a little meatier I would make Frick'n Chicken a regular stop.  But, I am going to head back there to try the chicken strips.  If I could give half stars Frick'n Chicken would get 3  1/2 from me."}
{"text":"If you like your chicken with a side of bread this is your spot. Just know that the bread comes with your meal, the fries do not. Thought $8 was a bit much for six wings and bread. Both were indeed tasty, I got the lemon pepper wings, but I'd have much rather had the fries to go with. Would have even been ok with the choice between the two. I'm not much of a bread person so after eating just a half a stick, I felt it was unsatisfying. Didn't get my monies worth or my appetite satiated. I can again, mark this one under \" I went.\" But probably won't be back. Ended up going to another restaurant in the area to finish off the hunger.  Not a good sign for the price I paid. Too much for too little."}
{"text":"I came back after my not so good review and not shocked that they are BACK in the game.  Wings were great, sauce was perfect, and no more little tiny wings i had gotten before.  It shows too because the lunch line was 10 people out the door.......amazing!  Thanks for stepping up and making things better.  This would have gotten 5 stars but i never rec'd my veggies with the \"meal\" i ordered.  I didn't ask either since the workers were obviously busy and it wasn't a big deal.  But yes it was an error that cost a star.  But good job......the food was perfect once again!  Happy customer!"}
{"text":"Chicken strips cooked perfectly. Tangy BBQ sauce has a little kick, excellent. Breadsticks are good."}
{"text":"Wanted to try a new wing place, saw this online and decided to check out. We ordered wings, salad and fries. Salad was a decent size and had a lot of veggies. The fries were fresh cut and super tasty.. the wings were nice and crispy, not greasy and they had a lot of sauce options. We ordered the extra hot and it had a good kick (we like it spicy and most hot isnt hot to us) and the BBQ... was good, decent prices and quick service, nice outdoor patio to chill on. Would go back or order out for sure."}
{"text":"I am always suspicious of new restaurants with perfect reviews from new yelpers, but I I still had to check out this new wing place. Even though I was jaded before I set foot in the place I was pleasantly surprised. They have a good selection of sauces and the wings were a good size. I did ask how hot the hot was and was encouraged to step down to medium which I found to be more mild, but I don't blame them I should have stepped up. Overall I thought the wings were good and would go back."}
{"text":"Got the buffalo chicken wrap.  Everything about it was really good, but the pieces of chicken were a little bit too big, and hard to chew.  May have been over cooked, it would have been easier to eat if the pieces were cut smaller, rather than basically being a chicken tender cut in half.  Fries were good!"}
