{"text":"Thankful there's a non-chain coffee shop near the house.  It's in the shopping center on the NE corner of Warm Springs and Arroyo Grande, right next to the Chinese restaurant.  In order to park, you have to enter off of northbound Arroyo Grande or from westbound Warm Springs and drive around the back of the stores to get to it.  Maybe that's why all the previous tenants in the space never lasted so - its too convoluted to get to it.

Stopped in for \"breakfast\" recently for the first time.  I was happy to see other customers at 8am on a Saturday morning.  On the surface, this looks like a fine place.  But little things make me think, hmmm... 

All the coffee is organic and fair trade.  Good on the surface.  However, the coffee itself isn't as good as Sunrise's or from Frankly Coffee.  Only reason I can think of is having the beans roasted and shipped from back East (as the employee told me) instead of using  a local source.  They have a choice of soy, coconut or almond milk for creamers; I wonder why they're not using the equivalent creamers instead (cost?).  Honey but no agave syrup.   Offering  artificial sweetener in the pink package.  Why ruin good practices (organic, fair trade, non-GMO) with bad (pink packaged chemicals)?  Why not stevia instead?  Cost perhaps?

Another review said the pastries are heavy on vegan options.  Not when I went.  There was only one cupcake, muffin and coffee cake and 2 scone flavors as vegan options, while there were twice as many non-vegan flavor options.  There were more gluten-free (non-vegan) options than vegan.  The vegan blueberry scone was good while the coffee cake needs work.  The layers came apart as soon as I unwrapped it, very grainy texture and there was a strange aftertaste.  I'm used to coffee cakes with struesel topping, not glazed.  

One last observation.  If you're going to go to the trouble of using organic, non-GMO ingredients and tout this, why in the world do you also sell Nestle chocolate milk, full of everything totally opposite of what you advertise?  Again, to me it all comes down to cost.  Or perhaps lack of knowledge.

Clean and somewhat minimal feeling to the store.  There's 4-5 small tables in the front, none outside.  They have a frequent buyers card, but its a \"12-1\" (buy 12 get one free) vs the standard \"buy 10 get one free\" like at other places.  

All in all, I'm willing to try them again, considering they've only been open since February and are probably still working out the kinks.  Would like to see more actual food (eg sandwiches, oatmeal) in addition to just pastries."}
{"text":"Happened to spot their sign from across street while at Walgreens. So glad we checked it out! We've been looking for a small coffee/slash bakery near us & we've been twice this week. Enjoyed the carrot/pineapple & black velvet cupcakes even though vegan & gluten free. Just wanted something small & tasty to try & this fit the bill. We also had the organic coffee which was a perfect compliment to the cupcakes. Jennifer was very welcoming & knowledgeable about their products. I'm sure we'll fill our VIP card in no time!"}
{"text":"Stopped by today in anticipation of gluten free goodies but the doors were closed at 2pm. There was stuff inside so I'm not sure if they're closed for good or not ?"}
{"text":"First time here and I'm already looking forward to my next visit. I met Art behind the counter and had a wonderful customer service experience. He was friendly and knowledgeable about their bakery selections and organic coffee. I decided on a chocolate chip muffin and iced vanilla latte. The muffin was fresh and delicious. The latte was pretty near perfect. It wasn't too sweet or too bitter. 

I got my order to go but I did take a look around. The decor is clean & welcoming. They also have free WIFI. I can see myself coming here with my laptop to get things done. 

The menu is vegan friendly and they also offer gluten free options.

Please give this mom & pop place a try! Step outside the Starbucks cloud and enter the light! This place is a lovely addition to the Green Valley neighborhood."}
{"text":"Love this place! This is the first time my hubby and I stopped in here. The owner is very sweet and personable. We received free samples of a couple cupcakes and they were both delicious. We got a gluten free and vegan pumpkin scone that was also amazing. We both ordered iced lattes, and found out the syrups and chai tea are all organic and/or natural and made by nearby small businesses. These type of individually owned coffee houses are places I love to support. Will definitely come back again and again!"}
{"text":"This is a great locally owned and operated bakery & espresso bar.  The owner is incredibly friendly, as well as passionate about what she's doing.  Stocked with an amazing bakery (try a sample!) and tasty organic coffees from fair trade, organic, US sources.  They even have a promise posted on the wall that they will strive to provide products with no artificial flavors, GMOs, preservatives, or hydrogenated oils.  So great to see businesses catering to this in the Henderson/Vegas area.

I had an incredibly smooth latte served up in a compostable Eco cup.  I also sampled a vegan coconut cupcake which was moist and had the perfect amount of sweetness.  I didn't realize it was vegan until I went over to the case to see what deliciousness I had sampled.  Bummed to only be here for a few days, but will be back to this delicious bakery anytime I'm in the area."}
{"text":"This place is just around the corner from my house so it would be awesome if I liked it. Two visits there have told me that I definitely do not. 
The customer service is friendly and attentive. Both times I was helped by one of the Co owners and she was welcoming as well as engaging.  I bought a coffee cake that was grainy and just tasted so so. Grainy is likely a result from vegan ingredients; I am not a fan of vegan pastries personally.  I should mention however that I sampled an apple nut muffin that I would definitely pay for, it was much better than the coffee cake.

So here is where my review becomes rude; I want this to be constructive for the owners.  I'm not trying to crush anyone's dream or livelihood.  This establishment is not a coffee shop, it's a vegan bakery.  I observed 3 drinks being made and sampled/drank each of them. All 3 tasted terrible.  All 3 were not made properly, due to a lack of understanding of coffee and the training that goes into it. I say this to alert the owners; they need to bring in a coffee/barista consultant or bring in a partner with coffee expertise. I love coffee,  I have a passion for coffee and the product being sold here is not going to cut it. Solid bakery items will prolong your survival but the backbone of every coffee shop is churning out solid espresso based drinks from your $5k to $10k espresso machine. A huge investment that turns small amounts of low cost items into $5 drinks in 40 seconds.

All in all, good customer service, terrible coffee, decent pastry choices.  Inside is clean and we'll decorated but needs more seating."}
{"text":"Great mom-n-pop bakery in the Henderson/Green Valley area. Excellent gluten-free cookies and coffee cake at a reasonable bakery price. The non-gluten free brownies and cookies are yummy as well. Knowledgeable, friendly, and courteous service makes me root hard for these guys to be a success!"}
{"text":"I stopped in to just check out the space, and I believe the owner intercepted me. We talked for awhile, and she gave me two delicious samplers that were on par with what I consider vegan/GF baking :)"}
{"text":"I am a mega fan of locally owner businesses, and was so excited that another one had popped up in another location in Henderson. 

I purchased 2 chocolate chip cookies, a chocolate velvet cupcake, and a minty mocha iced coffee. The gal behind the counter was patient and eager to point out the vegan/gluten free choices, and let me know that their syrups and coffee are are all organic and fair trade. Also, she asked if I had a milk preference, as they offer regular, almond, AND soy. I immediately devoured one chocolate chip cookie, took a bite of my cupcake, and slurped down my coffee. 

Cute little shop, nice product."}
{"text":"I am so happy to have a coffee shop that isn't Starbucks! This new cafe offers good alternatives for people who are vegan or need gluten free products. 
Their bakery selection has just enough to make it difficult to decide. I make it a point to try something new each time. But my favorite is the Cherry Walnut muffins. Their menu items do rotate so get your favorites when they are in the case!
Location is decent. I can walk or drive which is nice. They have parking in the back and parking in the front by DQ. 
The cafe is well lit with lots of natural light and the employees are very helpful and knowledgeable about their products. 
I know my family and I will be coming back!"}
{"text":"Local and better than the typical coffee shop. Great location and easy parking. Definitely needs some music inside and a better sign outside. Add some more seating and get the word out and I have no doubt this place will get popular fast."}
{"text":"Really delicious coffee and a great atmosphere to relax with a book or get some work done. Although they advertise their baked goods as gluten free & vegan, they're all so delicious that I never would have guessed. Friendly staff & great location. Loyalty card gets you a free item after every 12th purchase. So why not support a local business? Stop by, have a seat & enjoy the beautiful view of Frenchman/Sunrise Mountain."}
{"text":"Very good pastries my daughter and I loved them. The coconut scone was great and the person serving was very friendly. We will be back."}
{"text":"I randomly saw this place while driving around the area and made a point to go and check it out the next moment I had more time.  

First the good:
The lady who was working was very friendly and helpful in answering all our questions.  She was knowledgeable about the coffee and the products they served.  The place is very welcoming and they have free samples of the bakery items.  The space is well lite and very well decorated along with lots of natural light. The seating is limited but what they do have is nice.  

The not so good:
Sadly the regular latte I had was disappointing.  For the latte: The milk was over steamed and scorched.  The women making the drink had to scrap most of the foam out of the steaming pitcher.  The texture of the milk lacked the velvety texture and micro-foam. The espresso itself was very bitter tasting and overly smokey in smell and taste.  It tasted as if she had pulled the shots of espresso for too long.  I sadly did not finish the drink.  The baked items were ok but nothing to write home about.   I am not a fan of vegan cupcakes so I don't feel I would be a good judge on them as they are not my preference. I also felt as if there was not enough seating to make it the type of place I would come and bring a friend or meet up with someone. To be fair I do not know if they are going for a more grab and go type of place. But as far as a sit and chat with a friend I think more seating would be needed. 

The reason for the two stars is I took off two for the coffee and 1 for the seating and pastries.  I did give one star for the customer service and 1 for the over all feel."}
{"text":"Cute little coffee shop in my neighborhood! I liked my white chocolate iced latte a lot!"}
{"text":"Cute shop, interesting location. 
The shop uses all natural syrups to flavor their drinks, thus they are pretty sweet. I asked for a non-sweet syrup and they suggested ordering one of the nuts. I ordered the Hazelnut, which was still a little too sweet for me. Coffee was nothing special. 

The shop seems to be marketed toward vegan baked goods. I tried one of the sample blueberry muffins on the counter, which was pretty good, but was then informed that it was not vegan...... haha. 

They have a pretty good selection of vegan cupcakes, muffins and cookies. I don't feel that I'm enough of a vegan expert to post my opinion of them. 

It's a small shop without tables and limited chairs. Not a place to study!"}
{"text":"First of all I live in North Las Vegas but I drive all the way across town just for Flour & Grounds awesome gluten free goodies! The staff is super sweet and always accommodating. The shop is cute, clean, and well kept. The gluten free options outweigh most places (meaning more than just 1 or two things) and are amazingly delicious. The vanilla gluten free cupcake was probably the best cupcake I've ever had, don't underestimate the awesomeness of such a simple flavor! The pumpkin scone is great, the cookies are perfect, all in all I love this place!"}
{"text":"If there is one thing Henderson/Las Vegas is missing, it's little boutique type restaurants and bakeries instead of what we actually have... Lots of chains. Starbucks is fine, but it's so nice to know we've got our own gem of a coffee place in the neighborhood now! The pastries are DIVINE. Because they're vegan, organic, and even gluten free... One can even argue, they're healthy! It all tastes SO GOOD. Coffee is great and I love the numerous flavor and milk options. Iced latte with almond milk? Yes please! 

My only small complaint is price. It is a little pricey. $8.50 will get you a scone and a latte. Not something I can afford to do everyday. But what isn't pricey these days? Right? And I can taste the high quality ingredients, so I'm willing to splurge once or twice a week to come here versus spending $6.50-$7 on the same thing down the street at burnt coffee Starbucks. :)"}
{"text":"This is my first time to visit this shop. I noticed it while walking to work and thought I should visit. Immediately as I walked in the door I was greeted with many smiles and good mornings. They offered me free samples of their scones. I ordered a Chai Tea Latte and it was delicious. The store is very cozy and clean. They have a wide variety of baked goods in vegan and gluten-free options. They even have a VIP card to encourage you to visit again."}
{"text":"I came in a few weeks ago, and the food looked great and homemade. The owner was sweet and knowledgable, answering my questions and being a very enjoyable person to talk to. I picked out two pumpkin scones and an iced coffee. It came up as a bit expensive, but I attributed this to the food being specialty. Unfortunately, when I bit into my scone once home, it immediately had to be spit out and my mouth rinsed. It tasted of sap and chemicals, and I choked and coughed while trying to scrub the taste out. My sister tried the other scone, and immediately began to have the same result. I hope that this was simply a bad batch. Unfortunately, I will not be returning."}
{"text":"Very friendly staff, and great coffee and pastries! Just searched on here for a coffee shop near by to come do some work, and this came up, I'm glad I found it! It is kind of hidden but it's a great place :) I will definitely come back. 

I'm from Washington and Oregon where there is a lot of coffee shops, but no, not here in Vegas area. So glad to see this place!"}
