{"text":"We celebrated my friend's 31st birthday with some of her family and close friends there this past Saturday morning. It was so much fun! Our waitress was very attentive and knowledgeable. She was quick to make sure our table of 8 had hot water for our tea and was descriptive when bringing out the food. We did the Groupon where we tasted three types of sandwiches and desserts. Everything was fresh and awesome! The raspberry cake cookie was my favorite!  It was also nice to shop a little afterwards. This was the perfect way to start a birthday weekend with friends and family. We will definitely be back!"}
{"text":"Wow! gorgeous arrangement of sunflowers and roses, accented by cockscomb, berries, purple hens and chicks, and mint in a moss covered natural bark container. So creative -blown away! Making my hospital stay much nicer."}
{"text":"I recently found this place while looking for graduation flowers. While the flower was in the middle of packing up the vans for a wedding, a woman was quick to help me find what I needed. I told her the flowers were for a preschool graduation and I wanted something little and easy to hold. She put together a beautiful bouquet fit for a bride. I was floored! It was not expensive either! I will definitely be visiting again, perhaps for my parents surprise anniversary party in October. If it wasn't on the other side of town I would go more often."}
{"text":"Wow, what an experience! In sum, this is a MUST GO TO PLACE. I call it an experience because it is simply that. One walks into a beautiful home complete with dining tables for lunch and shopping. The gift store is located throughout the entire establishment. It reminds me of places my mother and grandmother would take me as a child. A rich, interesting home- recreated into a storefront. Unlike those memories, this establishment has dining options. Every wall and shelf is chuck full of lovely keepsakes and decor one can purchase. The promise that everything one sees is for sale.   The wait staff is the epitome of superb service. One never has to chase down a drink refill or needs to inquire about plate removal. Also, the desserts are located in a cooler in the hallway. One can shop for keepsakes and check out the dessert offerings while waiting for their meals. No more staring at the watch waiting for food to come.  One of the pluses of a fine dining experience is simply put the experience. Said experience creates a made-to-order personalization of the clients' needs-. Hence, the creation of Michelin Star establishments throughout the world.  Although, I must confess I've only dined here once, and cannot speak if this is consistent or not like those trusted Michelin Stars'. I can say that this cafe/tea room experience provides simple food made extraordinarily- which is most certainly a Michelin trait. It is not pretentious, but it is playful and invigorating. Flowers in the Attics offers the same fine dining experience, with that sought after client personalization without the fine dining prices or haughtiness. EVERY restaurant wants to say their establishment has these traits but only few actually offer it. The clientele of this establishment are NOT left longing.  For example, I ordered the one of Chef Donna's Quiche special of the day. I wanted a side salad. I was craving olives, tomatoes, and dry crumbled blue cheese. Even though their traditional side salad does not include all of these (except the choice of dry blue, I believe) the Chef was more than happy to accommodate my request, and get this, WITHOUT THE UPCHARGE. Rare is a jewel such as this.  The quiche was mouth-wateringly extraordinary. It was a Mediterranean style including olives, greens, onions and more. It was moist and flavorful as any delightful quiche should be. I also ordered a tea pot and was very happy I did. It was wonderful to see this establishment choose to offer Fortune Tea. This is a local company right here in Pittsburgh. Supporting our trends for local sustainability- I love it!  For dessert we ordered a popular house favorite: the Raspberry Infusion. In fact, I could not recall the name of this dish while writing this review and called the location. The woman answering the phone even offered to have a manager call me back and discuss my experience further when I inquired what the name of this scrumptious dessert. They are keenly focused on a special and enjoyable customer experience. Yet, another reason I say you MUST MUST try dinning here.  I learned they host all sorts of events not limited to bridal and wedding showers, weddings ,and cater to all sorts of events. I look forward to booking a life event in the future as I know it will be a memorable and enjoyable experience for me and all guests attending.   If you've read my other reviews on Yelp, I tell it like it is. If your restaurant is bad, I will put it out there. Hoping others could avoid a terrible experience and provide the owners a chance to change their ways. However, when one comes across as an excellent establishment, I equally will rave and commend them on accomplishing what few others in our area can. BRAVO Flowers in the Attic, for an experience well done."}
{"text":"I love this place, I've used Groupons and they tell you in advance when you buy it that tax isn't included! When you call for reservations they tell you about the cash policy! I'm disappointed that people are complaining about this wonderful establishment! I've been to high tea elsewhere and I believe they are by far one of the best! And high tea isn't about stuffing your face! It's about the tea, treats and ambience which they provide excellently! If you are one that enjoys high tea, and don't care that it's not loose leaf, the tea is Stash and delicious with many choices! And the food is exceptional!!! Love this place!! Using Groupon makes it more affordable! But this place is awesome!!"}
{"text":"Bought a Groupon for \"Tea Service for Four.\" Showed up for our first appointment and was told they somehow didn't know we're coming for tea vs regular lunch, despite the appt. Our choices were to pay an extra $40 out of pocket for THEIR inconvenience, or reschedule. We rescheduled for the next Saturday. Tea and food was good, but when we checked out, were told the Groupon doesn't cover $30 for gratuity and tax. Seriously? That's almost as much as the groupon cost. Wouldn't come back."}
{"text":"I love coming here for brunch. Great service and food. A very enjoyable experience for all."}
{"text":"Terrible customer service and not worth the aggravation.  Full review: I bought a groupon last August for my mom's birthday. The groupon said that it was for \"tea service for two.\" It said nothing else about any restrictions. As my mom has many dietary restrictions, I always mention these when making any reservations or buying her any edible gifts. I called in November and the woman on the phone said that I could only make reservations on certain days because they only have tea service on certain days. They would not honor the groupon on a Sunday because they only serve brunch. I ended up making reservations for February 7, 2013 and had to take off a half day to take my mom because of all the restrictions.  When we showed up for our reservations, they seemed pleasant enough. They sat us a little late because they were not ready with our table and we were very patient as we waited. The house is underwhelming as it is a victorian, similar to my parents' house, but we walked around and looked at the souvenirs.  Once seated, the waitress told asked for our drink order and told us that we would be served soon. I reminded her about my mom's dietary restrictions and she said that they'd have to upcharge me because all tea services were chef's choice. I told her that I spend a long time on the phone when I initially made the reservations because my mom had many dietary restrictions and that no one mentioned that it was \"chef's choice\" because had I read that, I never would have purchased the groupon. I even showed her the groupon on my phone that said only \"tea service for two.\" She began arguing with me at the table and I finally just told her that she should give us food that met the requirements. She left to speak to the chef.  I then went to the cashier, who was very nice, and explained that we were there for my mom's birthday and that I did not appreciate the waitress arguing with me in front of my mom. The cashier said that it would be fine and that there would not be an up charge.  After a long while, we were finally served. The chef came to the table and asked me to join her in the gift shop so that we could discuss the situation away from my mom. She said that she'd just charge me half of the up charge and that I could contact the owner later. I pretty much had no choice because my mom was already sitting there with food in front of her so I just agreed.  After we ate, I was given the check. Another thing that they failed to mention was that gratuity is included in the cost. I ended up paying almost double the groupon between the up charge and gratuity. When I paid for the check, the cashier apologized for the up charge and then said that they should have told me about the upcharge when they told me the gratuity was included. I told her that they never mentioned either to me on the phone. She again apologized and said that I must have spoken to someone who had forgot to tell me. She said that she would take my name and make sure that the owner called me.  Days later, I received a call from chef Donna. When I returned the phone call, I was told that I needed to call back the next day. I called back today and chef Donna barely let me explain the situation. She told me that I needed to read the groupon more closely. I told her that it was in front of me as I was on the phone with her and she told me that I needed to contact groupon to get the full contract. I told her that the contract should be what it said and she started yelling at me and acting condescending. At one point she actually said that she knew that I would never call groupon and that I was making things up. I had finally had enough and asked to speak to the owner. When the owner, Ken got on the phone, he just started yelling. I told him to stop yelling at me and he told me that I haven't even heard him yell yet. I told him that this was not a proper way to speak to customers and he told me that not only did he not want me as a customer but that he'd call groupon and have me banned from groupon. I told him that I had the groupon in front of me and it said nothing about \"chef's choice\" and only said \"tea service for two.\" He called me a liar and when I told him that I was looking directly at the groupon and could even print him out a copy, he hung up on me. This was a terrible experience! What was supposed to be a half a day off work and a relaxing tea to celebrate my mom's birthday turned into a shouting match on numerous occasions. The most troubling part of this to me is that I did not even want a refund, I just wanted to tell them that their groupon should be reworded so that people know ahead of time what to expect. I would never have bought a \"chef's choice\" selection for a tea with my mom. I might have never bought it or I might have saved it for another time. Both parties to a contract must know what the terms are before they accept them."}
{"text":"My first experience at Flowers in the Attic was absolutely perfect. The atmosphere was quaint and filled with visual interest. The meal and desserts were beautifully crafted and presented. The food was fresh and delicious and the service was exemplary! I cannot wait to go back! Oh, and there was shopping on site. A positively fabulous experience. Thank you for a lovely day."}
{"text":"I had lunch here recently  with a group of ladies from my family.  It was a very pleasant experience for all of us.  The food was a little pricey, but the atmosphere is enjoyable and relaxing you hardly notice cost. It seems as though they try and use fresh and organic as much as possible, so that I'm sure accounts for the price of the food and beverage.  Everyone really enjoyed what they ordered too, so money well spent.  The best part for me was the ambience and all the beautiful furniture, jewelry, and other items they had throughout the old Victorian house for sale.   Our waitress was wonderful as well. I can't remember her name (she had short reddish hair) but she did above and beyond great service. And made sure we were well taken care of and explained the menu and current offerings from memory.   I would recommend this establishment. Its more of a \"once in a while treat\" than anything. But definitely worth checking out, if you've never been."}
{"text":"Flowers In The Attic is an unexpected surprised tucked away in the eastern suburbs of Pittsburgh! Excellent food, great service, and unique atmosphere. I had a delicious Monte Cristo sandwich (which was a brunch feature that day). My guest had the featured Strata which was also fantastic!"}
{"text":"Poor service, rude management, and turned away an 80 year-old woman and a group of her friends out for afternoon tea. This is an incredibly unprofessional establishment. Save your time, money and energy and go elsewhere."}
{"text":"love this place!  amazing floral shop; wonderful food; friendly service; 1-of-a-kind clothing & accessories; great selection of teas, body lotions, jams, etc.; gorgeous flowers."}
{"text":"A very nice place to relax over lunch or go fod Sunday brunch. I like to sit outside on the veranda on a nice day."}
{"text":"Had brunch and was very impressed. Learned about this gem from Groupon and the deal was great. I had raspberry stuffed French Toast.....delicious!  The setting was perfect for Mother and daughter time or brunch with your friends. They have beautiful flowers and sell candles,  jewelry and other goods. I had to park across the street because they were busy but it was no problem the area is residential and no one seemed to mind if you park in front of their house. I will certainly go back. The service was great, the food was delicious and affordable."}
{"text":"I spoke with Ken and ordered a spray of flowers for my Grandmother's funeral. I explained to him that I saw an arrangement online that I liked. He informed me that some of the flowers in that arrangement were not in season and asked if I would like him to do fall colors instead. I told him I preferred purples and light pinks. He said ok and assured me that he would do a nice job. I'm sure he could tell how much she meant to me... The flowers were beautiful! I appreciated his attention to detail and I would not hesitate to Flowers In the Attic again the next time I need flowers."}
{"text":"The place was fantastic! A few friends and I came for tea. The sandwiches were divine...the only thing I would complain about is the waiter just left our check on the table and didn't say anything not even have a nice day or thank you for coming."}
{"text":"I bought a GroupOn for tea and lunch and was pleasantly surprised. The little sandwiches, scones and desserts were great. I also found the service to be fine.   My only criticism is that the tea comes in bags and you get a pot of hot water. So it isn't a proper tea. But nonetheless they have a nice selection to choose from.   You do need to make a reservation a few weeks ahead."}
{"text":"This was my second time at Flowers in the Attic (originally visited in summer 16 when i moved to Penn hills from the other end of the city) and it was just as great. Don't listen to the naysaying reviews. Brunch here is wonderful. The atmosphere is very inviting, and the various wares for sale are all very cute. The staff is very friendly and genuine and the food is incredible.  If you're not wonderfully full after the Eggs \"down under\" (my clear recommendation)--or any of the specials-- then you already eat way too much or have too high of a standard.   Flowers in the attic is a lovely experience.  Go for Brunch for sure."}
{"text":"Flowers in the Attic are the best in food, flowers and customer satisfaction. Ken and staff go above and beyond to make sure you are happy. Ken has done 3 weddings for my children over the years and I obviously would recommend him. When you make a appointment for a wedding consultation, your taken to the bridal room on the second floor of the Victorian Mansion. This beautiful room is so relaxing and calms you, when you need it the most. The last wedding Ken did for my son had a rustic theme. He was so creative with the centerpieces, 3 different kind and all amazing. The escort table when you enter was over the top. He used antlers, moss, glass and wood freshly cut. It was a beautiful day, Ken and staff were a very big part in making that happen."}
{"text":"Flowers in the Attic never fails to impress! No matter the season, this gorgeous 'mansion' is decked out with amazing displays of tempting merchandise (I always shop after lunch!) - Christmas was especially spectacular, a highlight of my trip to Pittsburgh. Need a special floral arrangement or gift- you'll find it here! Oh- and how did I not mention that the food is amazing? Farm to table, fresh and delicious offerings- hard to decide between salads, sandwiches, quiches and daily specials. Excellent service, unique gifts and quality food- can't go wrong!"}
{"text":"one of my favorite lunch spots to dine at with my grandma.  we both enjoy the beautiful atmosphere and the food is always incredible and never disappoints!  I usually go with a salad and add chicken.  the ingredients are always so fresh and the chicken is large pieces of juicy white breast meat.  the desserts are fantastic as well.  also, make sure to shop around the store, such unique and beautiful pieces to admire!!"}
{"text":"I have passed by here countless times but never actually stopped in. My mom bought a Groupon for tea time for four and made a reservation. I have heard bad things about using Groupons at various establishments, but as we were seated, our tea was served, and the three tiered serving platter of sandwiches and desserts was placed in front of us, my worries went away. We had a selection of cucumber sandwiches, caprese sandwiches, scones, bread pudding, and mini s'mores. Not to mention the unlimited flavored teas (bagged). We were seated in a room on the second floor which was decorated nicely for Christmas and had a small electric fireplace turned on. Everything was good and we enjoyed ourselves until our waitress asked to see the Groupon. She studied it for a while in front of us which made me nervous. Then the bill came. When my mom made the reservation, she mentioned the Groupon and was told that tax and 20% gratuity wasn't included. Fine, sounds typical. Our bill, however, was charged the tax and gratuity for the regular price of tea, not the Groupon price. When my mom asked the woman at the register about this, she laughed and said we should have been told that it was off the regular price and they wouldn't even do a Groupon otherwise. Boy, how silly of us, right? But guess what-we weren't told and to be honest we think it was that woman who made the reservation for us. I don't have patience for establishments that try to \"pull a fast one\" to get business. And judging from some of the other reviews, can you afford the bad press? I truly doubt we were the first to make a reservation with a Groupon so why not be up front from the beginning and give all the details? We still would have come and I would have given a better review. Sorry, I won't be back."}
{"text":"Jordana's review is hard to top.  She's right.  Dining here is an experience.    It is a jewel of a place, especially in Penn Hills, but even in all of Pittsburgh.  I'm new to the area and live in Penn Hills and have been sorely dissapointed in the severe lack of dining establishments, much less ones to brag about.  Finally!  I'm more than overjoyed that it is A+ quality in food presentation, taste, portion, ambiance, and customer service.    The hours take a bit getting used to as i don't usually keep to a typical lunch schedule and just eat whenever I want.  So do be warned that the restaurant portion is open 11 to 2 Tuesday thru Saturday and 10 to 2 on Sunday as of this posting.  Note they're not open for dinner (bummer).  (The store portion has different hours as posted on their website www.flowersintheattic.com.)  I was greeted warmly by the hostess (at the time not realizing that she was Chef Donna herself) and decided to dine outside.  Outside is a covered wrap-around porch on this wonderful old house turned restaurant/store/flower shop (in back).  I sat at a table for 2 on the side of the house overlooking the side yard.  Beside me were hibiscus bushes in the yard and hanging flowering planters hanging from the covered porch.  Buffferflies came and went.  This is truly a setting to feed and quiet the soul which is what I seek when I'm looking for new adventures.  I asked my server, Mary, what I should order as a first-timer as the menu all looked so good.  She was gracious and eager to inform me of my choices.  After hearing about a special panini and the quiche, I decided on the fresh vegetable quiche (a Chef Donna quiche, as the menu declares) and a side Tuscan salad Mary recommended to go with it.  It is a salad with pears, blue cheese, and pine nuts.  When my meal arrived, the presentation was so lovely and invitiing.  There was even a pink garden rose on my plate to add to the eye-catching appeal.    I ate every last morsel of the quiche and salad -- both equally delicious and just the right amount of food.  I felt as though I had eaten a healthy lunch in my own little corner of heaven out on that porch.    To top off a great meal, I knew they must have great home-made desserts, as well, and sure enough, Mary named them all to me.  All sounded great but I'm a chocoholic so landed on the Chocolate cake stuffed with mousse and cheesecake.  I got it to go to enjoy later (ok, later turned out to be as soon as I got inside my apartment door).  I warmed up the cake and had a glass of cold milk with it.  Oh my!  Forget the healthy lunch part....but oh so decadent!  This is truly a gem and I recommend any who don't usually venture into Penn Hills to dine to come out and try them!  I know it's high on my list for friends coming into town!  I think the price at about $25 (before tip) for quiche, salad, iced tea, and dessert, for the quality of the food plus presentation plus ambiance plus good customer service equates to just the right price."}
{"text":"Flowers in the Attic is a unique little gem of an experience.  First the grounds are lovely and inviting.  You will be charmed into strolling, guaranteed.  This is after you've wandered from room to room inside because there is an eclectic offering of wall decor, mantle knick-knacks, and owner highlighted photography on canvas that will cause a pause!  The woodwork is splendid and beautifully restored.  There is a little boutique with chunky jewelry, greeting cards and some trendy resort wear...  nice scarf collection, too.  Now for brunch:  Oh my yum!  Frittata, omelette, brunch pizza, breakfast sandwich...  the list goes on and on.  Difficult to choose, but you cannot make a poor choice.  The Chef is clearly a perfectionist from the white linens to the fresh ingredients to the perfect presentation.  The staff is happy and accomodating, chatty or not - you set the tone.  Make a reservation - You'll leave here very happy on many different levels!"}
{"text":"Went for the second time this weekend, this time for brunch. Last year a few friends and I came for tea and the owner remembered us! Food was amazing, large selection without being overwhelming. There were so many flavors of tea that we were just as excited to receive our drinks as our food! I had the lemon blueberry friend toast, which I believe was a daily special that came with potatoes and (perfectly) cooked bacon. We also had the opportunity to explore the house a little while we waited for our food to be done, which was a nice extra touch! Very reasonable prices for both brunch and tea.  My group of 20 something year old friends loved the location, as it was a nice relaxing change from the brunch places we frequent. I plan to bring my mom in the future as well since I'm sure she'll adore it (and is already a big fan of the book this is named after!) Can't wait to go back!"}
{"text":"Yea, yea, it's super cute and tucked away and there's an overpriced flower shop in the back. But this place just didn't leave me with a good taste. I bought a Groupon for high tea and ended up spending an additional $15 for just tip and taxes and fees. WTF? So with my Groupon cost, it turned out to be $40-ish for 2 people without either of us getting full. The tip is a preset mandatory amount regardless of service. I bought another high tea Groupon for the Omni William Penn last year and it included all taxes and fees. All I left was a tip.  The teas were bagged, not eve loose leaf. Yes, there were plenty of flavors but I really expected better from a place that was noted for their tea times. The temperature was different in every room depending on the room you were in so you could be freezing or sweating during the summer time. Service was good but the cashier lady seemingly did not know how to answer questions...Also, it's cash only so that gets minus a star from me.   Compared to the Omni's high tea, this place scrimped! We got one less sandwich and no fancy chocolates or mini desserts. It was just 1 tea sandwich, some ice tea and a scone. I roamed around the other rooms hoping to buy a fun candle or lotion but everything was outrageously priced so I skipped. No recommendations."}
{"text":"The food here is good but the customer service is atrocious.  We had a restaurant.com certificate.  We asked the hostess and the waitress if they accepted these and both said it would be fine.  We ordered accordingly.  When we went to pay, we were told we could not use the certificate.  The woman we spoke with said she doesn't want to have her servers inform customers that they are no longer accepting restaurant.com certificates because it will affect their tips.  Guess what else will affect their tips - not having anyone eat there because they don't like a bait and switch!  Never going back here."}
