{"text":"This place should be called 'The Foggy Don't'   I worked in the restaurant industry for nearly 10 years so I understand things happen. It's the way those situations are handled that will entail whether the guest returns or not. I for one have lost my local watering hole. Thank god there are more than enough around!  Here is a top line summary of my experience.   It took nearly 20 minutes for the waitress to take our drink order. The appetizer was cold. Our main dish had hair in it. And after politely requesting to speak to a manager three times, we were denied and were told that they would comp the food.   After such a bad experience you would think they would also cover the one glass of wine and pint of beer but nope! They left us with a $12 bill for the drinks, empty stomachs, and bad story to share."}
{"text":"\"The Dew\" is definitely the place for all the buildings in the 3 block radius of King-Niagara.  It's laid back atmosphere is great if you want a no-brainer place to go with a few people and get a pitcher.  Menu highlights are potato skins served with apple-sauce, mini-slider burgers, and a sheppard's pie that's pretty good.  However, the menu has become more generic over the last year and the specials are usually the best choice.  Saturday nights they usually have live music inside and you'd better be ready to be in the middle of a lot of wasted middle-aged cliental singing along. Babies at the bar are not rare.  Best option is to stick to the massive patio (but please be quiet, I live across the street)."}
{"text":"One of the only true irish pubs in Toronto. Great food and quick service with a great patio to hang out on."}
{"text":"Stopped here during the week for lunch. Pretty quiet just before noon. Service was quick and burgers were good.  Will plan to come back again and give Foggy Dew another try."}
{"text":"I actually really like this place.  I have been there twice, (once during weekday lunch, and once during weeknight dinner) and the service is always great - friendly, knowledgeable servers who bring stuff out promptly and keep the water filled up.    My friend and I love to sit in this quaint booth with stained glass windows.  I had the promotional Mill Street \"donut burger\" the last time I was there, and it was amazing!  Probably raised my cholesterol by like, 4 points, but definitely worth it.  Sparse but good selection of beer.    The only reason it doesn't get 5 stars is because the regular menu is a *little bit* lacking  in the selection department."}
{"text":"One of my favourite pubs in Toronto. Agree with the review that said menu wasn't as good as it used to be. But the beer on tap is great and the servers are awesome. St Pattys here is one of my face holidays of the year.  The staff are great.  And the patio is awesome too.  Go for a pint, not the food."}
{"text":"The food is pretty good, the service is pretty good. I never leave going \"I have to come back\", but it's convenient and a good place to hang out with a bigger group, although very very loud when sports are shown on the tvs.   Really good brunch, meh rest of the menu."}
{"text":"The Toronto Lover system: 5 stars = Must visit! 4 stars = Really good. I take my friends here. 3 stars = Somewhat worth it... if you have nowhere better to go. 2 stars = Below average. Attend only when necessary. 1 star = Do not visit!   Decent seating on the inside, a nice view of King Street or boring Niagara on the outside. Unfortunately, I've eaten a lot of food here, and none of it was good. The sweet potato fries ($8) come with a yummy mayonnaise-like sauce, but that's as far as I'll go. Don't go for the pot pies, or \"traditional Irish fare.\"  Have a nice dark pint, sit and talk. If you're looking for anything flashier, skip this place. I want to say 3 stars instead of 2 because the service is usually pretty friendly, but I'm taking it back down to 2 because there's little value here, and it can be slow on busy nights.  2 stars"}
{"text":"Visited once in a sunny winter afternoon and since then I am craving for a brunch there."}
{"text":"I live across the street from the Dew and despite it's proximity, I tend to stay away.  Cons: There are really few options for diners who are gluten-free and vegetarian/pescetarian. It's really freaking frustrating. They did have a Indian themed menu for a short while (a promotion), and the food was really good and had veggie/non-gluten options, but that's over. The Bangkok Curry I tried today and it was bland and disappointing. The servers are wonderful. The chicken wings are superb, battered, and really tasty (I cheat sometimes...). No great drink specials (Temple of Fynn's gets my business most evenings due to their menu and drink specials)  Pros: The patio is great for a drink, I park my puppy outside and everyone is happy (though the seats are uncomfortable by your second pitcher). The bathrooms are clean.  If the Foggy Dew adopted a menu that reflected the diverse needs of their patrons, I would find myself there far more than I do now... I hope they are listening."}
{"text":"My reviews consist almost entirely of sitting indoors as I opt for the Old York's far less crowded and much better located patio when the weather is nice.  Food is very typical and faux Irish. Beer is okay.  The atmosphere is definitely bland with a whiff of bro.  Lots of sports and from a few experiences, lots of loud dudes having a good time slapping eachother on the back and hitting on the waitresses.  If you're in your 20s and wanna bro down on St. Patrick's Day I'm sure this place top notch but otherwise there are better options nearby."}
{"text":"One of the best pubs in Toronto.  A great place to meet up with some friends and have a couple of pints.  A very good place to meet up before heading to BMO field for the soccer game.  They have a awesome patio that fills up quickly in the summer days.  A great selection of beers are available on tap that will quench any thirst.  They also offer brunch (I've never actually had food there) and $2.99 caesars to help or start a hangover.  A very laid back atmosphere with quick and friendly service with lots of room for everyone inside.  Great pub."}
{"text":"chill environment and good beer selection :)"}
{"text":"Went here for a drink/ food on the patio after a evening walk (on King West). Was a Monday evening (June 12th/2017). Summer/ warm. Slow night 5 people on the patio. Two waitresses. Horrendous. Waited 20 minutes. No service. One waitress walked by us twice picking up table settings. Did not even acknowledge us. Would you like a drink? Would you like menus? NOPE. Nothing. Just a Bizarre way to run a business. Likely the manager/ owner was not there that night. Went to the bar to put a drink order in. Got the drinks. Was just going to enjoy the evening sunset with my girl. No longer even interested in food from this place at that point. Got offered a menu 45 minutes in. Unthinkable! On the positive....the bathroom was clean/ tidy. Stayed for the one drink. Had to to go back to the bar inside to settle up and ask for the bill. Two waitresses on the patio with 5 other customers??? I'm a guy who routinely goes to a pub and drops $200. I can only laugh. Anyway its a good place if you want to take a piss."}
{"text":"Met two friends here last Friday (they'd arrived after a TFC game).  It wasn't patio weather, but they were busy (as one might expect that time of the week).  We got seats, but we were in an awkward nook with several other parties. And it was a bit hard to hear my conversation surrounded by so many others.  Our server: She was fairly attentive and prompt, given how busy it was.  The food: I had a burger with fries. I think at the time, my friend asked me how my meal was, and I think I said \"Good.\" I meant, \"Meh.\" I've had better burgers, but at that point, I was hungry and devoid of caring what I ate.  Listen, I know this place has got more than its fair share of regulars and devotees. And I totally get it. It's great for casual gatherings with friends, watching sports, and listening to - or talking over - whichever cover band plays on Fridays. (Dude who empatically requested Supertramp's \"Take a Look at My Girlfriend\" and danced it out: we SEE you).  But I think I'll be limiting my visits for when I'm actually in the area and no other place will do."}
{"text":"Ok.   The beer is cold. Bartender is cute. Skye is the the best.   But really - skimping out on toilet paper? At 8 bucks a pint - this is bullshit.   It's not parkdale. Buy some two ply.   Band sucked.  Beer is expensive, which I don't mind but buy some god damn toilet paper that is worth 8 bucks a pint."}
{"text":"Steve: Have been here twice now, and we're flummoxed by the mediocre reviews. First visit we split the nachos and I had the fish&chips, while Sue had the ribs. The nachos were respectable - not outstanding, but solid. My F&C were, however, outstanding. Batter cooked perfectly, fish was flavourful. Fries were excellent. Portion sizes across the board were plentiful. I tried a bit of Sue's ribs and they were melt in your mouth yum. Second visit we happened on Wing night. Started with nachos again, plus the calamari. Nachos were still solid, but the calamari was brilliant. Decent breading, soft without being rubbery, great flavour. The dipping sauce with them did lack flavour, though. We split 2 pounds of wings, chill lime and medium. Wings were big, superbly crispy on the outside and juicy and tender inside. Sauces were excellent, though the medium was a bit spicy for Sue.   On both visits we really enjoyed the service. Servers were friendly, fun and added to the night. We just felt really comfortable here. Room has lots of nooks and crannies, so you feel intimate. Decor is typical pub style. Music both times was great, apparently the bartender does the mix - one 3-in-a-row was Booker T, Radiohead and Bill Withers, yessssss - and it's low enough that you can actually speak to your partner. It's close to my work, so this will definitely be a regular stop for us going forward.  Sue: We've been to various 'pubs' around the city and this is by far the best one we've had the fortune to visit on two occasions. Their prices are reasonable and in line with any other establishment of the same type. I felt really comfortable here both times and the servers were wonderful. Happy, cheerful and obviously love their job which is a lovely change from some places!! The ribs were probably some of the best I have ever had. Flavor was spot on, smoky and spicy without either burring your lips off or being bland. Meat fell off the bone and was moist. Fries were great and cooked perfectly. Like Steve said I cannot understand why this place got such average reviews but each to their own. We shall certainly be making this place a regular stop. Thanks to all at the Foggy Dew for being such great hosts!!"}
{"text":"Came here for a work dinner/party and was seated in a private room. There were appetizers in the corner that didnt look too appetizing. Upon recieving a plate from my coworker I noticed that my plate was dirty and dusty as if it was left out in the patio collecting dust and just collected quickly without being washed and piled up with the clean ones. Some of the other plates had smudged black things on it we just looked until we found a clean one. Even then my coworker and I put a napkin on our appetizer plate for precaution. There was a platter of deli meats like prosciutto, salami and mortedella, mozzerella cheese, olives, veggies, pita, bread sticks and hummus. I was too scared to try the hummus as I waited for my coworker to tell me how it was and all she could taste was strong garlic and I thought no way am I going home with garlic breath so I declined to try it. Every thing tasted like something you could buy at the grocery store and make at home.   For drinks I got the cosmo fizz and the sangria. Both were decent but nothing mind blowing. My coworker got some sort of raspberry mule drink which she seemed to enjoy and it came in a cute cup! I got the salmon with braised beets in arugala and farro salad. This dish was a huge disappointment. The farro was undercooked and tasted a little chalky and the salmon had no taste. It was as if it was poached in water and nothing was added. I squeezed lemon juice on it and added salt and pepper to make it more edible. I couldve cooked better salmon than this! At least add some spices or some sort of flavour to it! I ate all of the salmon and struggled with the salad. My coworker who got the same dish pretty much ate only the salmon and she complained that everything was tasteless as well. My coworkers seemed to like their pastas, steak and ribs. I shouldve ordered one of those dishes, maybe it wouldve been worth it and more enjoyable. I might give this place another chance but I do not have high hopes. The waitress Julie was nice and helpful though."}
{"text":"Very average. Be realistic if you go here. Nothing will wow you and everything is just adequate, if not overpriced. It's not horrible, but it's not great either."}
{"text":"I attended an event here in the summer. The server was great and despite the big crowd we showed up with she still managed to get everyone's names and orders and was really prompt with everything -- impressive !  This is a great place to stop in for beers and pub food.  It has an old-style Irish pub feel to it and there is tons of seating. The patio is one of the larger ones I've been to in the area. Some of the seating is a little awkward inside which made it a little weird to try to carry on a conversation but overall it was a good time.  I think the server made the night, she even made suggestions on drinks I've never tried before.  This one is certainly on the short list of places to go back to."}
{"text":"Solid pub on King W. close to Bellwoods park.  Decent draught selections and prices all around.  Fish and chips were good too.  Quiet inside during the day and good for a quick work group beer lunch."}
{"text":"This review has been in the pipeline for the whole of June, being it is the closest pub to me and my office I find myself here way too often.  Having spent most of this evening eating and drinking there I felt now was an appropriate time to yelp about it plus I had a fair bit to drink so we all know how it goes 'truth flows easily after a tipple'.  Okay so the general gist of the place is of a pub! Wow did not see that coming.   The crowd is a mature 25-40 crowd and due to their road side patio they do get busy on a nice hot day.  I have been here last week, when the NBA final thing, was happening and it annoyed me that rather than play the channel's sound, so I could repeat what the commentator was saying and act knowledgeable, or have it on the projection TV where they instead opted for some boring sport called 'hit a ball with a stick' and also play music in the background such as 'The proclaimers' which is not even Irish!  However one thing I do like here is the service, most the waitresses are friendly and have a knack of making me drink more than I should and the bar dudes are fun to chat to and make fun of.  I like going here Tuesday for the 50 cent wings but they're not the greatest but for convenience I wont complain and today I had plenty of beer and scotch with one of their burgers which was good but again nothing to sing about.   If it was not for the proximity of the place I would not go here as often as I find myself doing and anyway its better than walking 500 miles to find a real Irish pub!"}
{"text":"A reasonable stop on King St. for a pint or two. It was too cold for the patio, but inside the atmosphere is warm and dark, even on a bright clear cool day you can rest assured the Guinness will be ready to warm your soul. The menu looked decent and they serve brunch as well which is good to know if the trendier places have lineups."}
{"text":"Went to the Foggy Dew last night to catch up with a friend. Unfortunately we were greeted by what seemed like a million TV screens (probably closer to four!) all showing football. Not sure if they normally have the TV on even if there isn't a big game, but this is a pretty big turnoff for me in a pub.  Their beer selection was pretty standard. Nothing really stood out. They did, however, have a great wine selection (for a pub) and a massive whiskey selection.   Our server was really friendly and efficient, and I liked that there were lots of little nooks and crannies to sit in if you don't feel like you want to be a part of the action.   I had the Sunday pub roast which was tasty, but not warm when it got to the table. Prices were reasonable for pub food.  I would go back if I were in the area, but I wouldn't trek out there just to go to this place."}
{"text":"Popped in for a drink. Lots of seating, low lighting and many TVs; typical pub atmosphere and decor. Able to find parking easily which I didn't think was possible in Toronto.   Service was good. Beer selection was also good. Didn't get anything to eat on this visit, but the food that walked by looked pretty appetizing. It's a relaxing place to grab a drink and quiet enough to talk."}
{"text":"Very nice interior here. Very cozy feel and I love how it is sectioned odd with little rooms. They have great deals for the daily drink specials and food was good. The pot pie was yum but shout out goes to the pulled pork tacos he favour was awesome and pair well w my goose island ipa! Which the special was pint for 4.50 was a great deal."}
{"text":"A few months ago, I would have given the Foggy Dew a higher review but as of late I've become quite disillusioned with the Dew.   As someone who lives ridiculously close-by, I want this pub to be fantastic but sadly, while it used to be great, now it's just okay.   In short:   The selection of beer is lacklustre - c'mon, folks! You're a pub!   The service has been hit and miss just lately (it used to always be excellent). While it's mostly friendly, it's gotten SO SLOW. The last few times I went in there (we're talking relatively quiet weeknights) it has taken at least five minutes to get a menu, let alone have any one take my drink order. (The faster my beer comes, the more beer I can drink!).  The food is passable but does nothing to differentiate itself from any other pub fare (the Old York just down the street has much better food).   I dealt with all of this and frequently brought friends and colleagues here but I don't plan to go to the Foggy Dew anymore. While they used to have several vegetarian entree selections, they recently eliminated ALL OF THEM. Yes, every single one. The only things they have now are salads and TWO appetizers. How can a pub in this city not have a SINGLE vegetarian entree?. NOT ONE? The waitress told us they could change up the mac & cheese to remove the seafood, but my dining companion still paid the full price (the prices are nothing to get excited about anyways). The worst part is that the lack of vegetarian options is NEW. It's a huge step backward for them.   This pub needs to step it up if they're going to keep attracting a wide range of clientèle. As it stands right now, I'll make the slightly longer walk to Old York where the food is better and the beer is tastier and I have at least one vegetarian entree choice."}
{"text":"My boyfriend and I had our first date here--many years ago... We had nachos and told each other offensive jokes while everyone else in the pub watched the Leafs get their asses handed to them in the playoffs.  We've been several times since, but had a really nice brunch this weekend.  No waits or lineups for the patio on a gorgeous day and we were thrilled to learn that they have $2.99 Caesars! They bring you the Caesar from the bar and you take your drink to the Caesar station and put any myriad of things in it that you want: olives, celery, cucumber, pickled olives, gherkins... Even pepperoni sticks!!  A basket of tiny muffins arrived at our table shortly after ordering. Two of them were sweet and two were not so sweet, but I was busy with my Caesar.  We both had eggs with Farmer's sausage, Cajun spiced home fries and marble rye toast. This breakfast was surprisingly good for chain pub food. Everything on the plate was carefully presented, properly cooked and the marble rye was great.  Service was wonderful. And I know from experience that Brunch shifts are almost like punishment. Our server was helpful and on time with everything.  This place does a solid brunch and with the addition if $2.99 Caesars?? You have to be loving  this place!"}
{"text":"I've never gotten too excited for their food, not that it's bad, but nothing amazing. What is amazing is their ceasar bar, on Saturday and Sunday.  If I could go there alone, I'd be there every weekend but I compare that idea with going to a sundae bar by yourself, sadly sprinkling your toppings on your favorite soft serve, and sitting down to eat a happy treat while feeling sad. So, I only make it there a few times a year. I THINK THE CEASAR'S ARE 4.99 UNTIL 3PM!"}
{"text":"Super-friendly staff that are usually really attentive to your needs but this place gets really busy so be warned.   I've never had a bad meal there and even did the brunch which was good.  Try the Belfast Burger..... If you're reading this and it's a sunny/warm day go and sit on the patio.  It's really big and wraps around the corner of the building. Definitely a great meeting place for many in King West."}
{"text":"Foggy Dew is a cozy little pub.  Good beers on tap, they have a Sunday Ceaser bar (HUGE points for that) and the food here is really really good.  The servers are awesome and attentive.  I love stopping in here for a quick beer or to grab something to eat last minute and chit chat. Definitely my go-to pub in the 'hood."}
{"text":"Nothing really spectacular about this place, I get the feeling it was a traditional pub but now they are trying to make it into a sports bar/Firkin pub (big screen tv's, Coors light on tap, wing deals, etc...)  I had pint of strongbow and the club house sandwich. The cider was good, you could tell the lines were clean and it tasted how a pint of cider should.  The sandwich on the other hand...nothing but burnt bacon, what looked like prepackaged turkey, no mayo? and I think there was mustard on it...no! no! no!. Also the coleslaw that came with it was rancid. To top it all off, it was over priced I think 12 or 13 bucks for a sandwich, fries and rancid coleslaw. I was going to get a burger instead but when I looked at the 16 dollar price tag for the standard burger I decided to get something a little cheaper.  The last time I was here was probably 3-4 years ago and going back the other day reminded me why I stayed away for so long."}
{"text":"The Foggy Dew has a great ambience. Pub atmosphere but subdued music. Family friendly with a good kids menu. Fish and chips were some of the best I ever had - fluffy on the middle, crunxhy on top - my kids couldn't resist my meal."}
{"text":"There is nothing I loved more when working in this area than getting off at five o'clock and meeting some friends at the Foggy Dew patio for drinks and wings  - both of which were ALWAYS delicious.   This is a great traditional Irish pub with traditional Irish pub fare. The Irish stew with mushrooms is delicious, as are more non-traditional Irish meals (like the wings and burgers). The nachos are always a safe bet as is the calamari. In fact, now that I think of it, I never eaten anything here that wasn't delicious (and usually, in some way, deep fried).   But the atmosphere in this place is great. The servers are quick and attentive (and they wear short kilts, for any guys who might be interested in that sort of thing). It's also a great watering hole; a great place to grab a beer and relax with friends.  But my far, my favourite part about this bar is that patio. There is nothing like people watching on King West and there are always many, many people to be seen!"}
{"text":"I would've given this place 4-STARS if they accepted debit!   So 3 stars it is. I came here for the $0.50 cent wings (minimum 10 to buy). They only had like 5 sauce selection: parmesean garlic, asian zest, and the other three were your spicy option (medium, mild, hot - something along the lines).   The wings were pretty good. The thing that stood out to me the most was their service! The waiter I had was very attentive and very helpful! I wish I got his name, but he was really friendly!   This was my first time there with my boyfriend."}
{"text":"This is a great place to hangout! It's got a neighbourhood feeling where locals hangout."}
{"text":"Our small group came here after the Sporting Life 10K for grub.  Locally popular Foggy Dew has been a common spot to catch some good patio sun and to watch a local game on TV.  Being your typical pub, they've got a great selection of beers and cocktails.  As for breakfast we decided to see what was available to compliment our 11 am beer cravings. With a bottle of Modelo Especial I decided to try their Egg's Benny based on what the neighboring table had ordered.  Though the service was good, the food took a long time as well to get our drinks as well.  Keep in mind this is AM hours of a Sunday so it was not crowded at all.  I didn't know breakfast took 45 mins to arrive.  Usually 20-25 mins tops unless i was ordering something complicated.  However presentation of the dish was good and the tater tots (potato) had a lovely crunch which complimented the Hollandaise sauce and ketchup.  Overall the set up of the place was great 4/5 service was good 3.5/5 Food and presentation 4/5"}
{"text":"Went on Wednesday evening, place had $5.00 Mill street specials, proper pub.  Clean, food looked awesome"}
{"text":"Dog friendly patio. Great finish to an afternoon walk in the sun with Grover Just dropped by to meet a few friends and pints... didn't get to try the food... All around it seemed like an OK place... nothing stood out... neighbourhood pub is what i thought... :)"}
{"text":"In short - only go here if you like overpriced beer that are not full pints, mediocre food and service that to put it mildly stinks.   To extrapolate - pubs that don't give a crap about their patrons are doomed to fail. Unfortunately the foggy dew is a pub that seemingly fits this description.   Yesterday the pub was full of people wearing red. Tfc fans and people wanting to watch the raptor playoff game before the tfc game. The bar should be leveraging this. Instead right when the 3rd quarter started in game 3 of the second round the bar thought it a good idea to put on the stupid Kentucky derby. Hey no issues there the race is only 5 minutes at the most. But no. The jockeys hadn't even mounted the horses yet - this was still the pre pre game for the race. Lo and behold the servers are wearing stupid old fashioned hats for the derby. No one in the bar gives a crap. They are here for the flipping playoff game. Playoffs! People complain. Complain. Complain. Finally after 20 minutes of inane pre race talk and commercials on all 3 terrible TV sets they change the station due to outrage of its patrons.   So why was the stupid race on when clearly the 75 people in the bar did not give a crap about it?  Oh it's a 6 year tradition at the bar - the raptor game just got in the way this year. Stupid people. How can a bar be so wrong?  Be so incredibly wrong?  Be so substantially wrong? And I'm sorry but 6 years ain't no tradition losers. Do it for 60 years and then we will talk.   The only reason we went to the goofy dew in the first place - auto correct made it say goofy .... I'm not correcting it - like I said the only reason we went there was that we knew that all the popular bars would be full and busy because no one in their right mind would go to the dew to watch the game and spend their money there.... How right we were. Bye foggy dew. I hope tfc fans unite and don't go there. Brutal.   Food sucks too. Beer choice terrible. So just stay away altogether.   A month after posting this .... I take nothing back. Brutal."}
{"text":"Solid pub food. Beef dip was pretty good. Decent patio area to hang out as well........"}
{"text":"Hum. I have made 3 visits to this place and I'm still undecided - it's just not mind blasting enough. So I think I will do what I usually do - and point out all the wrong things and what I did like about it - not in that particular order - and leave it to you to decide.  First I love the ambience. From the outside I felt that it would probably be like most of the  Firkin pubs- loud, uncomfortable and slow services. - except with a sidewalk patio.  I went in - and it's dimly lit and ever seat is somehow situated in a nook - so that you can have a rather intimate experience with your guest. Caution: the biggest table seats about 6, or 5 comfortably, and most seat 2 and squeeze in 4.  The menu is somewhat limited which may be a bad thing for you if you're looking for lots of options- but good if you're just looking for something to eat whle enjoying the company of others. Quite possibly because  I'm not really knowledgeable about alcohol in general - I appreciated the little blurbs about the various malts they had written on the Drinks menu - it wasn't really a seller though , because I comfortably settled on my organic beer in the end.  Food was good - but it was just ordinary pub food nothing supreme or anything. While the service was pretty good - I think it happened because I came with a party of 6. When I first arrived, she got me a glass of water promptly and until my other friends arrived I didn't even get a side glance. I was actually ready for some bevy after the water but oh well. When all of us were there though, she was on us like white on rice- I don't think she had a radar stuck in her hair that told her our glass was empty but it sure did NOT remain empty for long!  2 really big downers for me. The place was incredibly quiet. I am, a loud being - the word \"whisper\" doesn't really translate well in my world because everyone can still hear me. So when I am drinking or get involved in a conversation - I am, what the average consider \"loud\" even though in my mind I am \"whispering.\" Naturally my drinking guests are similar this way. I could NEVER even conceive the thought of suggesting this place for my friends or a group bigger than 5. Peeve #2: NO DEBIT. wtf. WTF.  I have short everything, temper , anger span  and  memory span of 2 minutes and impulsive. I go out for food and some bevy after work on impulse and very VERY rarely do I remember to have cash. I am going to opt paying by credit if I have to get up and walk over to pay $2 to get $20 out, when I'm already paying fees for my debit to use my own dang money. AND I don't often have my credit card with me; so, if I'm paying extra to eat here every time, I'm going to be a bit cheesed and not come back.  Overall? not great. Thankfully my guests are always awesome - but not bad still. I dunno - you decide."}
{"text":"You'd think by living above this place I'd drink there more.  Probably a good thing that I don't.  Though I have great memories of this place; the first meal I had after moving there (Cheese and Onion Pie as part of their January Robbie Burns celebration), the pint of Guinness I had after being hit by a car.  It's a place that's soothing and comfortable.  Probably one of the reasons for this is that it's a pretty generic layout as part of the local neighbourhood pub franchises that you can find sprinkled around the city.  The menu is pretty standard cookie-cutter pub fare (Belfast burger?  How's a burger from Belfast taste different than if it were made in Ballymena or Burlington?), but the pub specials that they run will tend to make you wonder exactly why it is that you eat at home.  The service I find gets better the more you drink there and get to know the staff.  I've known Steve the bartender since I moved into the 'hood and he's always ready to catch up and deal with my thirst.  June and Sarah also stand out as servers that feed on familiarity.  Normally not a place that I'd go to, but my parents love the place.  So, four stars then."}
{"text":"From the outside the place looks enormous and much like many of the formulaic pubs you get here in Toronto, but once you're inside the main area you realize that this is more like your corner neighborhood place, which isn't a bad thing.  Came by for breakfast and sat on the patio. Wasn't overly busy, especially for a Saturday. Server was pretty quick to get to the table and bring us menus. Polite and quick with the drinks. The food did take a long time to arrive, and an update would have been appreciated, but overall not bad. When food did arrive however, it was very good. I got the Eggs Benedict with hash browns and my friend got the big breakfast which she said was good. Also worth noting, they have $3 Caesars on Sunday's, and a bar set up inside to personalize your drink.  I'd say it's worth going and worth the trip, but it's probably nothing that you won't find at your neighborhood pub as well."}
{"text":"A major draw to this restaurant is the patio which sits in a full bath of sunlight at 5pm, undisturbed by the surrounding condos and highrises. We walked by on a weekday after work and grabbed one of the many tables to enjoy some sun.   Unfortunately, that was the only highlight of the visit. Our server was obviously overwhelmed and running around like crazy. I had to find the menus myself and by the time she dropped by, we were ready to order both drinks and food. I had the club sandwich with fries, the sandwich was a little dry but passable standard pub fare. However, the fries were very strange. They were hard but not crispy or crunchy in anyway. The worst fries I've had in a long time.  When we went to pay, our waiter disappeared after giving us our bill. We had to hunt her down inside to pay and get out of there. Maybe it was just a bad day of service and food, but definitely had better pub experiences."}
{"text":"Went in on a cold Saturday night with a few friends. Live music performance immediately gave us a proper warm up for some drinks. We ordered some beers and cocktails-strongly recommend their watermelon mojito, it is so fresh and fruity, the tastes of watermelon and mint leaves are well balanced. But the food disappointed me hugely. I ordered 1lb of mild spice wings and the wings are soooo dry that I end up leaving 3 of them untouched. They are really really dry and tastes like flavorless rubber. I would recommend this place for a few drinks with friends, but you might want to reconsider ordering those wings."}
{"text":"If you are in town for the One of a Kind show, and you are doing long days, and you want to go somewhere with easy parking, not crowded, cosy booths, good local beers on tap, and a solid veggie burger on the menu, then the Foggy Dew is your saviour. The staff are warm and friendly and relaxed in perfect pub style. I will return. Likely tomorrow."}
{"text":"Food is fine, but a bit pricey. Not a ton of veggie options but the ones they have (i.e. the veggie burger & salads) are pretty decent. Servers are good and the patio is nice in the summer."}
{"text":"Stopped in for lunch today (Fish & Chips are amazing) friendly, fast service. Great atmosphere with lots of parking around. Highly recommend Foggy Dew!"}
{"text":"Most excellent Irish Pub in the 'hood.   Great selection of beers, good food, wonderful patio in the heart of King West!"}
{"text":"Can't believe our luck stumbling into this incredible establishment.  Looking for a place to stop for dinner and a pint in the middle of a 180 mile Ragnar Relay we came across Foggy Dew and decided to check it out.  Let me tell you, they did not disappoint.  Not only do they have the best pints of Guinness and some fabulous poutine, but our waitress (whose name I asked but unfortunately can't remember) was awesome and super friendly and even helped us out by printing concert tickets for us in the office when we decided (after a couple pints) to go catch the Def Leppard and Journey concert down the street at Rogers Center.  5 stars doesn't do this place justice! Go check it out!"}
{"text":"When you think of brunch you think Irish, right?  This popular pub on King West not only offers great draft beers and food items but they also  a great brunch menu. Nothing's better than a hearty breakfast of eggs, toast and bacon, or make that French Toast if you're not a meatarian. Most meals cost under less than ten dollars, which is a good deal. Any extra change left should be contributed towards the brunch's special, a Caesar (only $2.99!!), which will cure any hangover you may have.   During the hazy dreamy summer months, the Dew is packed with neighbourhood folks, especially on weekends which boasts the perfect people-watching patio in the area. Expect the same capacity in the winter months, where you'll notice your casual breakie date turn into an afternoon at a pub that's both welcoming and cozy."}
{"text":"This place has decent food and a cool atmosphere. It always feels like there are separate little nooks to the pub. Service is average, but food is quick.   Had the fried chicken sandwich (good, not great) with fries (okay, should have been warmer) and tater tots (good, but 6$ for what probably came frozen from a bag)   Drinks are good, and relatively well priced. Good place to come for drinks and ambiance."}
{"text":"Great food and priced reasonable.  Great patio seats for the summer.  Across from my 800 King real estate office.  Will come back for more."}
{"text":"Nice place but BAD food!  We had calamari and fish and chips, tasted so bad, I had stomach ache.  The server we had wasn't very attentive and took long.  Not going back there to eat, that's for sure, maybe a drink when no other choice."}
{"text":"Gord and I walked to the Foggy Dew for the supper this evening.  It was sunny and warm so we sat on the patio.  Gord ordered wings with dry spice.  He said they were okay.  They were a bit overcooked, just the way he likes them.  He also ordered a side spinach salad which he said was delicious.  I ordered Guinness Ribs ... they were okay.  The fries are freshly cut and were good.  I'm not a fan of slaw so didn't get any.  They were understaffed so things moved kind of slow (our finished plates stayed on our table for at least a half hour after we were done).  Sarah was our server ... she was friendly and fun."}
{"text":"I've been to the Foggy Dew a handful of times, and usually when I go I have the nachos. The nachos are FANTASTIC.  This time I went though, I had the Crunch Burger (burger with kettle chips on it). HOLY COW! It was FAR better than I expected. It was juicy and tasty and all around amazing. After reading some other reviews I was skeptical about trying their burgers, but I'm really glad that I did. It was too tempting not to try....burger+chips=ME HAPPY. The fries were pretty darn good too, they were good 'vinegar' fries.  The service there is a little slow, but I've found that that's the case with most busy places in downtown Toronto. I can get over it if I'm being served amazing burgers like this one!!"}
{"text":"Very cousy and homey pub.  The food is above average.  It's a casual place, which is a breath of fresh air in an otherwise upscale bar scene.   You know, for those bad hair days."}
{"text":"I can't comment on the service.  This place has a nice patio, and is great for sports teams and other big groups.  I would recommend this place to anyone.  Nothing much more to say."}
{"text":"Loved this place. Arrived just in time for lunch and ordered the Irish Fry. Sausages were VERY good. Decently priced. Great service. Easily accessible on King Street. Definitely worth the visit."}
{"text":"What happened, Foggy Dew?!!! It seems like there is new management at the Foggy Dew and things have changed for the worst. Seems like most of the wait staff has changed. The menu has been changed with many of my favorite items gone and replaced with a short list of mediocre pub fare. Service has been spotty and slow, it's best to sit at the bar for best service. When it's busy the service and kitchen crawls to a snail's pace and the pub is understaffed. I was there for brunch on the patio, which was barely a quarter full when we arrived and placed our order. Half an hour later the patio was starting to fill up and were still waiting for our food. There were only two waitresses working the entire patio, and when we noticed that other tables who arrived much later were getting their food we then asked the waitress when will the food be ready. She never asked if we needed more drinks and our water glasses were never filled and this was almost an hour after placing our order. I also noticed people from other tables buying their drinks at the bar because the service was almost non-existent. another 15 minutes has passed and we asked the waitress again which she became more frustrated and didn't make the effort to help the issue. It was soon after she said that it was the kitchen's fault and the order went missing. It was extremely disappointing that we wasted our time for nothing and the waitress did not take ownership in the situation. If she had checked on us like any wait staff this problem could have been caught earlier. Pointing the blame at other staff and not providing proper service, but only to get frustrated at customers is totally unacceptable."}
{"text":"Having read the other reviews, I feel like rating this a 3 after only one visit might be kind of a dick move... The place was certainly crowded on a Tuesday night at 9pm, indicating it must be doing something right.  However, everything at this place kind of screamed \"non-descript\".  Overall this is an \"if you're in the neigbourhood and looking for a place\" type of place.  Details:  Food - Wings (50-cent Tuesday special)... Meh-ok  Draught beer selection... I was hoping for more interesting... they an assortment of Cinquante, Bud Light, Keiths etc.  Then all the typical Irish beers, Leffe Blonde - may have had Heineken, Stella - I don't recall, then they had one featured microbrew... Meh-ok  Service... slow.  Not enough staff on hand, but also consider the conversation that took place early in the evening My Buddy: \"Do you have any drink specials\" Server: \"Well if you buy a Guinness, you get a ballot to enter a draw for that fridge over there: MB: \"That's not a special!  A special is a discount that I get on an item right now!\" S: \"*grumble*\"  Interior / decor:  Cozy without being scrunched up against each other."}
{"text":"After work I decided to stop by for a drink and something to eat before going home. It wasn't packed, but there was a good crowd of people. The atmosphere was of your typical Irish Pub.   SERVICE: Our waitress, Sarah, was attentive, funny, and quick. She was personable and easy to talk to. Just fantastic!   FOOD: The garbage they serve and consider edible is pathetic. Who ever their supplier is for frozen fried wings is clearly producing a sub-par product considering there was hair in the majority of the batter. In addition, if you aren't serving fresh wings, why serve them at all? What happened to being proud of the food you bring out of the kitchen?   OVERALL: I will never eat at this pub ever again. The only reason there are two stars instead of one is because our waitress was amazing."}
{"text":"This pub is located in a convenient location, just far off the side corner of the busier king/Bathurst but still a walkable distance. The service they offered us here when we came here for a drink after the fight was mediocre but what else do you expect for an Irish pub? But it fit everything we needed and the wings were amazing!"}
{"text":"Great place to meet friends & food was great, great value.  One of us has the Ceasar for $2.99 & able to dress it up with all fixings at Ceasar bar.  Grilled cheese, pub pie & chicken & Brie sandwich was awesome!  One of my girlfriends had the Mac & cheese & she wasn't a fan of sundries tomatoes...a little salty and could have been more creamier.  Was my first te there along with friends & we loved it & definitely will be back.  We sat near Woodstove & bookshelf...cool hang out.  Only downer was someone was smoking right outside, against the windows & the cigarette smoke actually came in, must have been close to a vent.  Besides that still a fabulous pub!!!"}
