{"text":"Great place to eat fondue, on a cold fall night. There are 4 assortment of broth: original, sate, Tom yum and spicy. Plenty of parking available"}
{"text":"Une bonne fondue chinoise et mongole. J'ai vraiment apprécié . Le service est bon. Le vin pas cher."}
{"text":"This is pretty good but not the best hot pot in the city. Hot pots are all about the broth and flavors. Most times the broths here are very basic and not full of flavor like others Ive had. They also dont have much variety with food. I like the idea of going to pick out your own food, but there isnt much to choose from and what's there isnt labelled so you have no idea what you may or may not want. Ive been here twice and left satisfied, but Id recommend little sheep in chinatown over this any day."}
{"text":"This is a Vietnamese hotpot place. You can tell by the type of broth they offer (none of the crazy Sichuan style spicy flavor).  I got the tom-yum broth and it was close to sweet and sour soup, so yummy. Veggies, seafood, water, dessert, and dipping sauce (unlimited) are DYI.  Table service is for ordering meat (also unlimited) but they only offer beef and lamb. The lamb was a lot more tender and fatter than the beef. I was very pleased with the range and freshness of the veggies that were offered: water spinach, enoki mushroom, tofu sheet, etc.  $21 for all of these is a fantastic value!"}
{"text":"Self serve hot pot all you can eat, the place is Clean, Fresh, Friendly service, Kids friendly, ideal fro a cold day all for a good price. No complaints, i suggest it!"}
{"text":"One of those reviews you wish you could keep to yourself. Mongolian hotpot has landed north of Montreal!

Don't be fooled by the location the decore is much nicer inside. A dozen tables makes the main dining area with some larger to accomodate 8-12 patrons and private room in the back. 

This is the classic hotpot with individual cooktops and 2 refrigerated counters to indulge from. The all-you-can-eat is $20 with good condiments, meat, fish and veggies to choose from. On any given day the soup base may vary but expect regular, spicy, satay and tom yum on hand.

Bring an appetite or two."}
{"text":"Pros
- inexpensive
- 2 for 1 on Tuesday's
- decent selection

Cons
- the restaurant does not have enough lighting especially in the back
- not enough staff
- they use disposable chopsticks that are too small for hot pot

This place has become worse over the years. And if you do decide to come for their Tuesday special, be warned. It's very busy and the service will be bad. I literally saw groups of 2 or 3 being rejected for wanting to sit in a booth for 4. I understand that they have to save the bigger tables for larger groups but to see the waiter deny them of this was absurd! They literally let business out the door. We noticed this happen during our entire meal. And to top it all off they do not have enough lighting throughout the restaurant! I couldn't see what I was eating!!! Please disregard any negative comments about other hot pot places on YELP. This place definitely needs a lot of work. So if you like cheap food, just expect the service and type of clientele that comes with it."}
{"text":"This Chinese hot pot restaurant is very good and reasonable price. It's all you can eat style. They have different pots for you to choose. 

I went to this place with my parents and my friends several times. All good. Except beer is sold separately. But they have cold drink for unlimited refill. 

Compare to the little mongols sheep at chinatown. I prefer this one. You can take whatever you want by yourself. Unlike chinatown you can to fill up a paper every time.

The place is very cool and fresh cold. It helps you to eat hot pot. 

Overall, really nice."}
{"text":"I absolutely love this place! My sister and I are practically here ever week. 

Food: great varieties, lotsa of vegetables and protein option. I love there lamb! Perfectly sliced and not gamey tasting. I wish they had more fish options. Shrimps, muscles etc., they also have drinks, refills included, minimal dessert options, but they have ice-cream:) 

Broth: Mongolian spicy  broth, Tum yum, satay or regular. I've had them all but the tum yum really hit the spot for me! Lots of flavours and just perfect amount of hit.

Dipping sauce: your typical, hot chilli oil, sesame oil, chopped herbs, chopped garlics, sliced chillies, peanut sauce etc., I'm sure you can come up with a sauce you'll like! Sooo tasty

Service: Meh, nothing spectacular. They tend to forget you. You'll be waiting if you don't speak up to get more meats or refill your pot. The lady is very nice though. 

Price: ~$29.99 pp for dinners. However, they have great deals. Tuesday(dinner), sat&sun(lunch) its always 2 for 1 days. I'm always happy  leaving eating well on those days.."}
{"text":"Hot pot \" à volonté\", viandes, légumes, champignons, nouilles... etc. On se sert soit même au buffet libre. 

Les desserts sont vraiment moyens.

20.50$ / personne"}
