{"text":"Foo Sing moved from their old location at Great Northern, to a new spot a quarter mile to the East, 25102 Brookpark Road, in the plaza front of the Target. I've only been here for lunch, but I like the spot.  They have a buffet, which they refresh pretty regularly.  The usual Chinese buffet fare, Kung Pao Chicken, General Tso, Egg Foo Yung, Sweet and Sour and Wonton soups, and so forth.  Plus do it yourself self-serve ice cream for desert.   Nice place for lunch."}
{"text":"I just saw a sign for Foo Sing on Brookpark Road in the Target shopping center.  Not sure if they are reopened yet, but I plan on heading over there tonight to see for myself!  When they were forced out of the original location for the new Burlington Coat Factory they had an email sign up list to be notified for when they find aa new location.  I'm not sure if they sent it and it went to my junk mail or not, But I'm so glad to see them reopening again.  I have missed their great food!"}
{"text":"Foo sing's is the best chinese in North Olmsted. They have a small sit in full service eating area that is served by the family that owns it. The food is great and the service is nice. The decor is a bit boring but they are more of a take out place than anything. If you want good chinese go there."}
{"text":"Good greasy spoon Chinese with some decent Thai thrown in for good measure.  One of the few places outside of Asia Town that serves Chow Fun noodles.   It's also inexpensive and tends to be very quick for take out orders.  The Pad Thai is good, and the cold sesame noodles appetizer is as well (though I've never found it to be spicy, as the menu suggests)."}
{"text":"I stopped by Foo Sing's because it was so close to my place, but also because I specifically looked on Yelp for a Chinese restaurant that DELIVERS - and I picked up a menu there.   What a surprise to look at the menu and see how expensive it is now to order pints or quarts of Chinese food, but more importantly... THEY DO NOT DELIVER!! They only advertise \"Eat In or Take-Out\". To be absolutely sure, I asked if they deliver and my answer: \"No\".  I took a menu, but did not order from there.   How very sad."}
