{"text":"Ginny is the hostess with the mostest and Nigel and Vincent take turns working their magic making drinks and cooking up fusion delights! Almost every Monday is guest bartender night and the drinks are definitely worth trying!!  The music adds to the low cast lighting and the ambience.  I'm be back again and again! This Sunday November 17th is Bluegrass Night which features ribs and cornbread and another guest bartender. Come on down y'allll!!!"}
{"text":"This place really sucked. I went into this place with a friend after a long trip on a plane to relax and talk.  The drinks are okay, but this bartender named Veronica is really bitter.  She got upset at my friend and I after we paid, for smoking an e-cigarette inside. If you were that upset, you should of asked us to stop and we would have.  She criticized us for giving her a 15% tip and all I can say is this woman turns an otherwise cool bar into a bad experience. She took my beer away and started spewing negative nonsense.  I'm a nice guy but this bartender is not, she made my experience really suck.  To do this after we paid was a really shallow move.  I won't be coming back, there are much better bars with people who are much more pleasant.

Try Motel if you're looking for a great bar in parkdale, it's awesome and just a couple blocks east of here.  They have piano players, it's great."}
{"text":"If I lived in Toronto, I would hang out at this politely eclectic place all the time.  I happened to go there during their food special, when all dishes are $5 each. I was surprised to see that their food menu, which was very small, was Asian fusion.  Being vegetarian, I decided to order the Chinese greens in mushroom gravy and some veggie dumplings. Their house lager was also on special, so I had a tasty pint. I noticed the patio in back after I'd sat down. I was happy to see their drink menu list things like the Sazerac, though I wasn't there to drink that night.  

My waiter was friendly and mostly attentive--business was picking up and I think he was tending bar too, so he did pretty well considering."}
{"text":"Friendly service, great food, good prices. A great spot for an afternoon drink, date night, or a night out with friends. The atmosphere is laid back and \"cool\" without being pretentious. After a year of living in the neighbourhood, this spot has become my local, and Nigel & co always make us feel more like friends than customers."}
{"text":"I'll be honest, I came here when it first opened and ordered a dark and stormy. It was neither dark or stormy and after I powered through my drink and left.

I decided to give it a second shot since it's at the end of my block, and hate writing a place off for one bad drink. Much better service this time and OMNG the beers they have are always amazing. I'll be honest I haven't tried the food here, but friendly service, great beer and 2 minutes from home is worth 4 stars to me"}
{"text":"I live in Parkdale and this is my go-to local spot. They have the best beer selection - always changing, always local, and they bring in some pretty bold choices, which I admire and love trying (I tried a beer with sarsaparilla - one of the roots in real root beer!). Their cocktails are also delicious, but I always go for the beer here and have never been disappointed. 

This really is more of a snack bar than a place to get full dinner, but the snacks are delicious. I'm vegetarian and, admittedly, there's not much, but I love the tofu and chrysanthemum dumplings and the cashews with green onions and chili. I do wish they'd change up their menu or have specials more often; it's been pretty much the same menu since they opened. 

The back patio is awesome in the summer and they have special events every week with a guest chef on the BBQ. 

I would agree with some of the other reviews that it's more of a great local spot than a destination, but mostly to keep it from getting too busy :)"}
{"text":"Was out walking around in Parkdale with my boyfriend after work and saw drink specials at this bar.  It was $5 beer and half off glasses of wine.  We decide to stop in and have a drink.  The place was very empty.  One customer at the bar and the bartender(?) or \"staff\" sitting at the bar eating her dinner and on her laptop.  We knew that if we sat at one of the tables we would never be acknowledged or served.  So my bf went up to the bar to ask the bartender about the drink specials and order.  The bartender could not even be bothered to take her eyes off her laptop and even muster some sort of pleasantness.  She curtly told us what was on tap and gave us the impression we were annoying her.  She grudgingly got off her stool and poured our drinks.  I have never felt so unwelcome in an establishment.  There are many, many bars and restaurants on Queen West!  As one of them, you need to make your business memorable and pleasant.  That's how you get customers to come back!  Needless to say, we will not be."}
{"text":"Had liquor, didn't have food.

This place is just like any other new hipster drinking hole-in-the-wall - it has a pop-up feel, not the ambiance of a place that will last the test of time.  While I think if you live in the area it's probably a really cool place, I travelled here from downtown and it wasn't worth it for the value or the service I received.

I came here with a group of people who knew the person working there, which is why we came all the way west.  Again, it's that neighbourhood (or 'know the bartender') feel that might bring people back, but it's not my neighbourhood and I don't know the bartender - and what I did see didn't enamour me.  I got a vodka/soda, pretty straight forward, but for $7 in Parkdale.  Then he went outside to smoke and that was the end of my service, I guess."}
{"text":"This place is really going to vary depending on when you go.  During the day or weekend I don't doubt that this place is a pretty OK place to grab a drink and snack with decent service.  I came in on a Monday night hoping to grab a late snack and a beer or two.  Beer selection is good, but food was average at best and service was piss slow.  It's basically westernized, over-seasoned, potentially cooked from frozen asian food - probably pretty good if you're drunk.  Crowd is hit or miss and considering you're deep in parkdale expect the odd crackhead or two wandering in.  I'd avoid going on a monday night.  They do have decent drink specials though..."}
{"text":"Food & Liquor always delivers! Great staff, great vibes and some of tastiest food! The menu is a simple snack menu. Asian-Fusion. It is always changing but never disappoints. The Sunday BBQ's are the best! Do yourself a favor and check it out! I have had some of the best meals of my life on their back patio. It's always a surprise! Great spot to hang solo/with friends/or on a date! Wild Turkey shot specials every day and a great selection of craft beers. Their prices are always very reasonable. If going with friends, I highly recommend ordering the entire menu! I have brought friends here (from all over the world) and they are always impressed. It's difficult to get them to try other restaurants after they've had Chef's creations! The owners are great people and take care of their staff!"}
{"text":"Food & Liquor is a cute little bar on the western stretch Queen West in Parkdale.
Decent craft beer selection with about 5 or 6 options on tap for $7 per glass, and a decent bottle/can selection as well. 

I could see this being a good date spot, as its cozy and dimly lit at night. The real charm to this place though (and the sole reason I end up here) is their patio. It's nicely tucked away in the back, with probably about 6 picnic tables. Since I've never seen this place too rammed, getting a spot for even up to 6 people on the patio isn't the hardest challenge. Even better, a small section is covered so at least 2 tables are good outside even if it starts to rain.

Worth a stop if you're looking for some drinks in this stretch of Queen Street West."}
{"text":"Best bar in Toronto. Consider these ppl family. The staff remember your name, they remember your drink, they remember your birthday. In a sea of dive bars this is the only place I'd recommend plunging into. 

Xoxoox"}
{"text":"I was only in for a beer but the atmosphere was wonderful. Very casual and welcoming, and with the lights down low to give it a bit of mystery. The server was absolutely lovely. I'll be back for more drinks and to try out the food!"}
{"text":"Best bar in Parkdale, best bar in Toronto, best bar in the world. The food is great. The drinks are the best around. Now taking reservations."}
