{"text":"I have tried their cheesesteaks many different ways and I I've all of them.  Yesterday I tried the streak with Onions, Mushrooms and Greenpeppers (OMG), and cheezewiz and had them add some buffalo sauce in it and it was GREAT.  Today I tried the chicken with OMG, buffalo, wiz and the Jalapeño and Cilantro ranch (JC RANCH), again REALLY good.  You can get it your way at this place and it always is great.  Clean place, nice friendly service... Give them a try."}
{"text":"Being from the east-coast I'm hard to please when it comes to food REALLY HARD! And as far as cheese steaks go I've had the Best Philadelphia! New Jersey shore! So I thought until today! Forefathers is the Best! I've ever Had! Great ingredients make the difference! Very clean location ,great service ,and a friendly staff! Close to the OdySea aquarium at a Fair price for such delicious food! I will be back thank you !"}
{"text":"Delicious! The sauces you can put on your cheesesteak are so yummy! Their fries are also really good! The place is clean and the service was good. I've tried both the chicken and steak sandwiches and was not disappointed."}
{"text":"My nonexistent OCD was killing me when this place had a dozen reviews and yet no one took a single picture of the food besides the business owner. I had to check it out for myself.  I think I've been to the truck a blue moon ago, but I don't think I've ever been to their brick and mortar locations. It had a really nice set up and clean decor, which surprised me on a Monday dinner when it was completely empty. I still had to check out the food for myself.  My bro got a regular chicken steak, while I got a large cheesesteak. Honestly a regular is probably enough for a meal, but I wanted to see the difference. They throw in a free drink if you get fries, which is nice - they got a Coke machine with fixed flavors instead of the fancy new ones. It ended up being about $31 for both of us, but I think a regular with fries you should expect between $13 and $14 for the meal. Yeah, it's pretty expensive.   The cheesesteak itself was solid. The bread was nice and soft but held everything together. Steak was nice and tender, and was melded well with the grilled veggies. The whiz I think it's personal preference - it was terrible in a \"so bad it's good\" kind of way, with the gooey plasticky feel bringing the sandwich together. But you kind of want to feel like garbage eating a cheesesteak, so I really enjoyed it. Plus it wasn't that bad on the cheese fries I got, but they included dipping sauce if you wanted to go the extra mile on those too. You gotta love those extra crispy fries.  Next time I might go for the chicken or try a different cheese. All the food was great, but everything being a dollar or 2 too expensive prevents me from taking it to the very top. It's a decent alternative if you're tired of Corleone's in North Scottsdale."}
{"text":"Everything I have tried here is delicious. The inside is clean and modern. And service is friendly and FAST. I'm following a keto diet, and there are a ton of options for me!  The jalapeño cilantro ranch is a must try. There is a large refrigerated case full of different pickles and peppers to choose from to totally customize your meal. A little pricey, but portions are huge."}
{"text":"Great cheesesteak, friendly service, very clean! Free refills and extra peppers and other condiments."}
{"text":"Looking for someplace new for lunch so went here today based on Yelp reviews. I walked in about Noon, only 2 people in line ahead of me and plenty of open seats. Very friendly, prompt service at the counter.  I ordered a foot long cheesesteak, fries and a drink.  Was a bit shocked at the $17.00 total!  In looking at the receipt, the drink was even 'free', wow Food was ready quickly.  Fresh soft bun and piping hot, tasty filling.  Mine didn't have near as much meat as most of the pictures posted here.  I asked for extra crispy fries and got just that, delicious. Loved the 'help yourself' cooler for fry sauce, pickles, etc.  Coke products is another plus in my book. For $5-6 bucks less and a bit more filling in the sandwich, this would have been a 5-star lunch. When I left, there was hardly an open seat."}
{"text":"Came into Forefathers with a small group of 7.  It is a fast casual setting.  Order at the counter sit down and they call you type spot.  We ordered a little bit of everything.  We had a couple chicken strip baskets, a chicken philly, a steak philly, a steak salad, regular fries, and sweet potato fries.    The young man at the counter was awesome.  He had a great attitude and wasn't put off by our large order at all.  In fact, he was enthusiastic.  Lot's of words like oh nice, I love it, great choice!  Didn't catch his name but he was tall, had blonde hair, and looked to be about 18 years old.    There was a mini fridge with lots of sauces and extra jalapenos and peppers and what not.  The food came out really within a few minutes.   The cheese steaks were HUGE.  Big enough to easily split.  The steak with whiz was awesome.  Fresh soft bread, fresh meat, no fat, no chew, just savory, juicy, and delicious.  The fries were also excellent.  Both the sweet and regular.  Crispy, hot, fresh, and cut a little on the thick side.  I didnt try the salad but it looked good.  I did try some chicken strips and they were also fresh and juicy.  They were a pretty good size and excellent value.  I would come here in a heartbeat.  Great service, product, and price.  Highly recommend!"}
{"text":"Well I had a steak sandwich from Steve steaks and from Pat's Steaks in Philadelphia compare to a Philly steak sandwich but is the best in Arizona just a sandwich what cheese was is pretty good it's no Steve steaks are Pat's Steaks but it's good"}
{"text":"We came here last night for dinner with our neighbors and showed up 15 minutes before closing. I usually hate being those people that show up right before closing but we didn't check the business hours before we left our homes and we were all hungry. The employees were welcoming and did not show any signs of being upset they wouldn't be able to leave early/on time.  Luckily, my conscience felt better when someone else wanted into the establishment behind us. Woohoo! We weren't the last customers.   I wanted to give them 5 stars based off of our experience but I didn't care for my cheese(chicken) too much. I felt like it could have used more chicken. It was a nice open-faced presentation but it wasn't enough once folded together. I basically filled up on bread. I ordered it as the regular sized one with onions and mushrooms. Everyone else in our group got steak so it was probably my mistake for going with chicken.   For 2 large cheesesteaks, 3 regular cheesesteaks, 1 cheesechicken, 1 order of sweet potato fries and 2 orders of cheese fries... the total was around $89. I think they came with 4 drink cups.   The fries were crispy just the way I like them and same with the sweet potato fries. When you order the cheese fries, it is essentially an order of fries with a four ounce container of cheese whiz for dipping. Over at the counter where you find utensils and beverages, there is a mini fridge with containers of fry sauce, jalapenos, sweet peppers and hot peppers. Such a nice addition! Oh - and pickles!   We'll be back. Everyone in my group enjoyed it and I'll know better next time to get a cheesesteak at a cheesesteak establishment."}
{"text":"I've never seen two people smile at customers the way these two did as we walked into the restaurant 15 mins before they closed. Upbeat, inquisitive (asked where from Philly we were from), and super helpful with our order. Still on way home with food but smells so good. The end."}
{"text":"Wow! What a wonderful atmosphere! The best customer service from the time you walk in until you leave. Not to mention how FRESH and HOT everything was. It is so clean and well maintained. Very impressed. Well done guys."}
{"text":"We had the steak with mixed peppers and cheese wiz with some chicken tenders. The food was great and the staff is very friendly and polite. We recommend!"}
{"text":"I found Forefathers via YELP! This is honestly the best cheesesteak I've had since the last time I was in Philly. The sandwich was really filling and tasted awesome! I got the cheesesteak with all the veggies and a side of the buffalo sauce. The gentlemen working there were nice and progressional. I can't wait to return and tell others about it."}
{"text":"Our oldest and I came here last evening before the Alabama/Georgia game for a quick bite.  Wasn't that an exciting game!  As you can see from the photos, they serve up a nice Philly Cheese Steak. Ours was tasty and had a lot of meat on them.  We also liked their fries, which must have been drenched in flour, because they had crust on the outside them. Nice!  The other plus was the condiments station, where they have, what I believe to be the first Tabasco sauce dispenser.  Actually, three of them.  We were in heaven."}
{"text":"Went here on Thursday evening and ordered a buffalo chicken cheesesteak... got home and realized they gave me regular beef steak with buffalo sauce. Honestly, not even mad about it. It was PHENOMENAL. The bread is soft and the meat tender. Only complaint is there wasn't enough cheese. Will definitely go back (to get that chicken steak) and will be sure to order extra cheese!"}
{"text":"Wowza!  This place is where you need to come for a real cheesesteak!  Best I've had in AZ - hands down.  Great staff, super clean place, awesome fries & a delicious selection of not-so-ordinary condiments.  This place is fantastic!"}
{"text":"This is a great spot for a Philly native to get a steak. The wiz with was perfect. The cherry and sweet peppers helped it taste like home."}
{"text":"Great food. Super friendly service. Very clean. Seems very new still. Wasn't at all busy when we went in on a Saturday. I was really hungry so I didn't think to take a picture of my food before I ate most of it."}
{"text":"This was my first time here based on a friends review. I've never really had cheesesteaks before, but this one was great! The service was friendly and the service was fast. I got the mini cheesesteak meal with small side of fries/ drink. The sandwich was delicious, although next time I'll order extra cheese and for the bread to be grilled as well. The fries were my FAVORITE! I love how hot and crispy they were. Probably my new favorite place for fries. I work close by and will definitely be back!"}
{"text":"i was a little nervous to try the second location, but it lived up to what i have come to appreciate in the 1st location as well ... being a philly native i will say this is a good cheesesteak for it not being philadelphia THANK YOU THANK YOU for bringing me a hometown favorite in a REAL cheesesteak"}
{"text":"WOW! Great experience! I had a gift card to Forefathers and waited to use it at the new Scottsdale location! You will love this place!  Perfectly cooked cheesesteak on fresh chewy bread and the fries are a double baked french fry?? So yummy!!! I will be back!"}
{"text":"Very good! Loved the chicken cheesesteak. Quite flavorful. The only downside is the price. It's a little steep comparatively."}
{"text":"Just really good.   You should go.   Great service great food and clean setup.      I've been to several valley cheesesteak locales and this may be my favorite"}
{"text":"Lunch today at this fairly new place off the101 and Via Ventura. The cheesesteak was pretty good. Not great but tasty. It's not somewhere I'd go to again. But I'm glad I tried it. The family owned Casellas on Granite Reef is a whole lot better. Casellas uses rib eyes and has a bigger and better menu."}
{"text":"OK, so someone wrote that the prices are steep. Maybe a little, but you can go to one of the \"box\" sub shops and pay $8-10. It is WELL worth it. I walked in and was immediately greeted by a very nice man. He explained the menu to me. I tried the steak cheesesteak with cheese Wiz and grilled onions. I added fries, the drink came with it. OMG, OMG, OMG. I am from NY State where they make a slamming good cheesesteak, well this was better. Fabulous bread, lots of meat, cheese and onions grilled the right way. You can also have mushrooms or green peppers on your sandwich. The fries were tasty, not greasy. They have delicious sauces that go with it. Great service and nice atmosphere. Try it, you will LOVE it. See you tomorrow."}
{"text":"Great cheesesteaks and really friendly service! I used to go to the one in Tempe whenever I was near it so I was excited to see a new location open"}
{"text":"I feel like I have reviewed this many times over, but it's THAT good!  I actually go and get the buffalo chicken salad ? I know, weird, but it's delish... along with their fries! I realllllyyy miss the chocolate chip cookies they used to have, but such is life.  I drive up to 30 mins to get this... seriously. Go. It's so yummy! It wont disappoint!"}
{"text":"This place just opened right by my work in Scottsdale. I dont usually get cheesesteaks ever really. Mainly because the meat is normally chewy and low quality.   This place was awesome though! The meat was delicious and sliced so thin! the bread was sooo soft too. Packed with tons of onions and jalapenos and cheese whiz, this thing was so freaking good!   I got the regular size I believe and it was plenty big enough for me. The fries were delicious too!   Overall, I was very happy with everything. Price was about average I think for a sandwich, about $10. They offer a smaller lunch portion too for less.   Im definitely coming back for more!"}
{"text":"Finally got to try the best cheesesteak in AZ everyone was telling us about.... And boy did it stand up to its name! Holy dam was it good! When you first walk in the place is clean and has a pretty modern decor. You walk up and order and wait for your number to be called. The staff were super friendly and helpful. The menu is simple but yet has tons of different options to choose from.  I got a large cheesesteak with cheese wiz. It was incredible! The bread was soft, they pack it with a ton of juicy meat, the peppers/onions were flavorful, and the cheese wiz was tasty. We also got cheese fries and oh man...... mouth watering. The fries were perfectly golden and crisp.. every single one! And dipped in the cheese sauce... yum!   Easily the best cheesesteak I have had in AZ! My hubby is from Philly and he loved it too! We will definitely be back for more delicious food. Highly recommend!"}
{"text":"Best cheesesteaks in the valley reminds me of Frankie's in Tucson and if you've ever been to Frankie's you know that's high praise."}
{"text":"I have never craved cheesesteak sandwiches until now. We dropped by on our way to Odysea and tried their famous sandwich. I want another one already! I can't wait to be at Forefathers again enjoying that scrumptious cheesesteak!"}
{"text":"One of the best cheesesteaks I've had in Arizona.. with a side of sweet potato fries or cheese fries. Would recommend this place to anyone. Kids food, salads and  fry sauce.. awesome is the only word that comes to mind.."}
{"text":"Accidentally stopped here and thank goodness!  What a great lunch!!  I love that they do a half size portion and a carb free option. Best cheesesteak I have ever had!!!! Super highly recommend."}
{"text":"Amazingly yummy!  Love their sauces and additional options.  Very clean, fun and easy atmosphere!"}
{"text":"I tried Forefathers today and have to agree with a previous reviewer, Steve S. They use sirloin and it's already cooked. It's reheated on the flat top and then served with whatever fixings you request. The cheesesteak wasn't bad, but I don't understand why they can't just cook the meat fresh to order regardless of it being sirloin or rib-eye, however rib-eye is always the way to go. The customer service was top notch though and you can tell the entire staff takes pride in that. Being from the Philadelphia area I have had my fair share of the best cheesesteaks so I'm going to be a lot more critical than the people who have never experienced a cheesesteak from Philly. That said, I would recommend Forefathers over other places in the valley. Prices are fair for the generous amount of meat they serve up and the restaurant was very clean. Give it a try."}
{"text":"Came here for the first time for lunch and it was pretty quiet before noon but then the rush came while we were eating. I got the regular steak with whiz and it was definitely a big portion and tasted amazing! My mom got the mini steak and fries which seemed to be a better lunch size for next time. Fries and sauces were good too! Definitely will be back! The restaurant itself was clean and concept was cool."}
{"text":"OMG!!! Best cheesesteak I've ever had. Sweet potato fries are the best I've had in a long time. Their BBQ chicken salad is amazing too.  Give this place a try- you'll be glad you did."}
{"text":"We came here for a quick lunch, and were pleasantly surprised.  The buns/rolls are nice, soft, and fresh.  The meat is juicy and tender.  A nice price point, for the quality of the meals."}
{"text":"The sting of sass always comes with a clawback.  Just left forefathers. I work in the same complex and I usually go to America's Taco Shop- but they were closed today so I went to see if Forefathers had anything for me (I don't eat meat often).  Greeted nicely by a young gentleman at the counter and was informed it was national grilled cheese day- sold! Got the grilled cheese that comes with marinara sauce, fries, and a drink. It was done quickly and I grabbed some of their spicy bleu cheese sauce and fry sauce to dip my fries in.  Went back to my workplace just a few doors down and took a bite of the grilled cheese, it was alright but pretty greasy. Fries are perfect- could eat a whole bucket of them!  Marinara sauce was not in the bag (which I was craving now to cut the cheese), so I walk back and ask for it, since you know, it is advertised to come with the sandwich.  Older guy behind the counter got a little snarky with me responding \"is there any sauce you don't want?\" (italicize don't). Granted, it says on the menu you can have whatever sauce you want and I only asked for one extra. Fry sauce is help yourself and marinara is supposed to come with it. I worked in the restaurant industry for a long time- customer service slip ups like this are the reason places get a bad rep, regardless of their food. With so many food options, little mistakes like this make clients not want to come back. I mean I could understand if I was being extra needy, but we barely exchanged any words other than this, and the sandwich comes with the sauce!   I get we all have bad days but leave it at the door. I'll just stick to Americas Taco Shop (they are awesome). Kudos to the young guy though, he did great."}
{"text":"Delicious, fresh food and crushed ice!!  Super clean restaurant and the staff is upbeat and friendly.  Love that they offer mini size meals in case you aren't super hungry.  Salads are delicious too."}
{"text":"Awesome steak sandwich with mushrooms and a side of fries. Great service and top notch dining area.  Got to love the American Flag  in the dining room.  I'll be back here for sure!  Got to save room today for ASU tailgate so I had only one sandwich."}
{"text":"Very good cheesesteaks!  The meat is of high quality, the buns were oh so soft but never got soggy.  Substituted jalapeños over the green peppers.  Shared a large steak with my wife and were enough for both of us to be full.  The staff was super nice and welcoming.  Seemed to really care about appearance and making an impression.  We will be back.  Well done!  Ps: only thing I would suggest is a thing of A1 or something like A1.  The Tabasco machine is good but not the same."}
{"text":"Mouthwatering!!!!!!! I used to hate philly steaks and always thought the meet had no flavor. Here they marinate their food and season it so well the meat falls apart in your mouth. They have different styles of preparation from low carb to xtra carbs lol. Different varieties in fries and ingredients you can add to your steak. They open at 11 and by 11:30 they already have a line."}
{"text":"Literally the BEST cheese steaks I've ever had in my life... so many places have tried to do them here an don't do them justice... This place is awesome... Trust me, get the cheese whiz on your sandwich, I wasn't sure about it, but it's much better with it.  Our new favorite restaurant in the rotation!"}
{"text":"Epic Philly cheesesteaks!  Have had a few places that I liked come and go around here. I really hope they stay because they are the best around. And try the fry sauce. Looks like Canes but it actually tastes good!"}
{"text":"Great tasting cheese steaks. Better than Pat and Geno's in Philly. I will definitely be back"}
{"text":"What to say about this place. When I went to Philadelphia a year-and-a-half ago, I took the task of finding a good cheesesteak pretty seriously. I avoided the local tourist haunts and went to a rough part of town just to get a very authentic Cheesesteak. It was completely worth it and I feel like this gives me a good standard to judge Forefathers.   Very friendly workers and you can tell the place was pretty new. I ordered a typical cheese steak with peppers and decided to see what they could make me. They made me a pretty darn good one! It had all the good ingredients and everything tasted pretty good. However it just didn't taste that authentic. It just had a bit of a corporate taste to it that wasn't quite what I would have liked. I knew they were really trying but they just didn't quite replicate that old Philadelphia charm that I got to enjoy once. Maybe someday they will, though!"}
{"text":"Probably should be 3.5 Stars, and I will be back next week to try a different Spin on the Sammich... I will also hit up my goto spot and compare while the experience is still fresh in my head.   The bread, was very good, soft, and held up really well. A+ The Meat, well to me it was over minced, but they did load a large portion into the sammich.. the flavoring was pretty spot on, Onions and Mushrooms on this one, but didn't stand out since the meat over flavored. The Cheese wasn't fully melted into the goodness, but that's more of a preparation thing and they add the cheese to the bread, then add the hot meats... My other joint, drops cheese on meat while its still on the cooktop,, so its all mixed in together melted.. Might have been a stand in employee that does it differently, then others,,     Usually Not a FAN of cheez whiz, so didn't try on this round, but will throw that into play next week.."}
{"text":"Two gripes:  they use top sirloin and I prefer rib eye.  they precook the meat and then heat it on the grill; I'd prefer cooked to order.  In fairness, the meat was juicy and flavorful.    The bread is excellent.  Frozen fries are crispy and hot.  Custom requests thru friendly employees handled well. Efficient service. Would like to see Coke Zero as a choice.    Food to price ratio is fair as the sandwich was overflowing.  Drink included if customer orders sandwich and side."}
{"text":"PA native here, so I'm very picky on my cheesesteaks.  Stopped into this new location near my office during lunch.  The restaurant was very nice looking and clean.  The employees were very friendly & smiling...not so much like Philly in that way!  I got the chicken Philly to go, with hot peppers, onions & cheese.  The bread was delicious, the onions and peppers were cooked perfectly, and the sandwich was juicy.  My only complaint is that they did not chop up the chicken the same way steak is chopped up in small/thin pieces.  The chicken pieces were more like strips you cook for fajitas, which doesn't allow the cheese you're melting on top to soak in to every delicious bite like a proper cheesesteak should. I would also say that at $10 for a small cheesesteak, I expected it to be bigger.  I will definitely go back to try the steak Philly.  Glad they've opened this location."}
{"text":"Been twice within the past week and will go back again soon!  We were craving cheesesteak and contemplated going to Casella's or Cappriotti's. Decided to try Forefathers and so glad we did! Excellent service and delicious food. Highly recommend the cheesesteak with cheese wiz.  Happy to say carry out is good too-doesn't get too soggy!   Check it out!"}
{"text":"Really good Philly style cheesesteaks.  Very flavorful.  Service was great, people are friendly.  I'll be back!"}
