{"text":"Tonight was dinner and a movie night with my mother.  We arrived at Forty-six around 5:30 and were promptly seated.  Our waitress was great and brought us ice water before taking our drink order.  She then brought some bread and returned for our order.  She was very knowledgeable about the entrées and her suggestions were quite accurate.  The food was excellent, served quickly and hot.  This dining experience was perfect and we will return.  They recently started serving breakfast on weekdays and I am looking forward to trying that."}
{"text":"Great lunch spot! Reasonably priced (less than $10) and fair amount of food. I got the meatloaf, which was phenomenal. It was atop, sliced potatoes, sweat potatoes, squash, and zucchini. An added bonus is the atmosphere - very romantic, rustic, with a modern twist. It feels very homey and comfortable. Highly recommended!"}
{"text":"I've had lunch and dinner here in addition to a special catered event.  The food is always spectacular and it's nice to know you're eating healthy.  The bartender is jovial and attentive, servers and kitchen are on par with fancy restaurant expectations (no one is running but no one is lolly-gagging).  I've done lunch here on work breaks and had plenty of time."}
{"text":"Super big fan of 46.   We have been going there since it opened and honestly as of the last year or so we have never had a bad meal.   The reason why I only gave 4 stars is because a short while after they opened the quality of food went down as did the service but that seems to have done a 180 and the place is honestly phenomenal now.  

It is tucked away right next to the new research campus and honestly needed in the Kannapolis area since good restaurants are far and few between.  Their chicken dish is amazing with the polenta and is always a favorite.  

Their menu has all items marked as vegan, vegetarian, pescetarian, and gluten free which is a huge boost for my wife and daughter who are both gluten free."}
{"text":"I don't really want to give this restaurant any stars to be honest. I've only been here once, but it will be my last time.  Ordered the calamari to start, it was dry and chewy. For the entree I ordered the ribeye ($21), which was the fattiest steak I've ever had, anywhere.  It waz cut extemely thin, so my 'rare' steak was definitely overcooked.  My companion ordered the salmon ($18),  it was also overcooked and dry.  I don't know if the kitchen staff waz just lazy that night, but the entire meal was a disaster.  And I don't think they are worth another shot."}
{"text":"Came here for my birthday and I was NOT disappointed!  The restaurant decor is beautiful and clean but we went in thru the wrong door and stood forever before anyone helped us find a seat.  Had the falafel cakes for appetizer, amazing. The bread with the white bean chili spread - awesome (complementary). My husband ordered the brick chicken and enjoyed it, I got the braised pork - oh my.  So delicious. And since it was my birthday the waitress gave me red velvet cheesecake (which I actually normally hate but this version was so good that ill be FORCED to order it from now on!)   Really want to return but they have odd hours, close pretty early, no doubt because cannon village is practically empty. But if you want a great experience -  this is the place to try!  You're welcome!"}
{"text":"Tried this place out for brunch. The food and atmosphere were excellent.... They would've gotten five stars if the server would have been at least pleasant and well trained. We mentioned that it was our first time there to our server and she just said, \"oh\". I ordered regular coffee and it came without creamer which I then had to wait five minutes for. The coffee refill came from a pot labeled decaf and it had grounds in it! If I wanted decaf I would have ordered it! The lack if  pre bussing, meant we were looking at our dirty app plates the whole meal. This was not the service I was expecting from this caliber of place. I think we will give them a chance for redeeming at dinner next time."}
{"text":"Ordered New York medium rare requesting more rare than medium. It came out well done but was promptly fixed. Second steak came fast and to the correct internal temp. However... You could tell the grill was too cold. The char was nonexistent and the fat was not rendered. 

 Service was outstanding and I loved everything else about my experience. I will return as I got there before busy hours (right at open) and probably did not get a meal from their full time chef. Given the perfection of the rest of the meal I'll would recommend this restaurant.

 Probably should note I made no complaint... I was asked if steak was right and I cut it and showed my server and she promptly took it for correction. I was not charged for my drinks so that almost completely covered the price of the meal. OUTSTANDING CUSTOMER SERVICE. 

 Looking forward to my next visit. And the Kronos Salad is amazing."}
{"text":"Sunday brunch was good. Very relaxed atmosphere and a nice selection to choose from ( buffet). I especially enjoyed the frittata. Service was friendly."}
{"text":"We were very excited to try this after reading the other reviews. Our experience was not as good. 
Went for brunch and the menu shown by many was not offered to us, buffet was the only option. Not a fan of being forced to a buffet. 
Our server offered us more coffee and then casually mentioned she probably didn't have any more and never offered to make it. She seemed like we were keeping her from something and it wasn't busy at all. 
The food was ok, but not an experience that makes me want to try again. 
Seemed nowhere near the caliber of the other reviews. Not sure if things have changed. Maybe we just went on the wrong day?"}
{"text":"Loved this place! I'm from San Fran and was worried I would have a hard time finding some gluten free (celiacs) and vegan food. I had the \"no tacos\" cilantro lime humus with micro greens in gf pita. Amazing!!! Can't say enough good things about this place!"}
{"text":"wonderful, do not miss this place. Great food, great prices. I had the lobstah and shrimp. WOW!!!!!"}
{"text":"I absolutely love this place!! The ambiance is perfect, not what you would expect. I have been here three times and they have not disappointed, I have never eaten off the menu. I like the creativity of the chefs. I had the fillet tonight cooked med rare and it was perfection! The service is spot on! I'd give them 10 stars if I could"}
{"text":"We arrived a hour early, so we had a drink at the bar. The bartender informed us of the drink special - champagne sangria/$5.00. Great drink.

The bartender informed us eating at the bar could be slower than a table, but we were not disappointed!  Falafel, goat cheese salad were great, presentation was perfect. The bread basket was warm sourdough with a red pepper dip, like humus. The main dishes, Butternut Ravioli and Beef Medallions were great. Tho, next time my husband said he would get the filet, the man next to us had it and he said it was awesome (looked awesome).

For dessert I had Tres Leche cake and loved it! I usually crave chocolate for dessert but this cake was incredible, very happy with the my choice. My husband ordered the caramel apple pie, and that was very good. 

Forty Six deserves more than 5 stars because in addition to a great meal, the prices were not overly inflated. Entrees are priced between 12 and 20 dollars, and salads are additional at $6- tho next time I would split the salad. It was big, and too good not to finish the entire portion."}
{"text":"We only get here about once a year.  My first few experiences were very good. Tonight big let down.  My guess is different chef in kitchen. Pricey halibut dish was absolutely flavorless. Couldn't even finish it. My daughter had kids pasta, not a huge portion, but didn't finish hers...she sad it was sopping in butter and hurt her tummy.  

Even worse, we waited a good 20 minutes after we were completely done, watching waitstaff not busy and our server checking in on others but never came to check in us.  

So, this place was a disappointment  this time around.  It's not inexpensive, so don't think I would go back."}
{"text":"I so wanted to love this place but unfortunately I don't.

I'd never heard of this restaurant until a friend suggested it for dinner. After reading some Yelp reviews I was excited to try the food.

Let's start with the positives

The atmosphere is really cute and cozy. The exposed brick and concrete floors has a upscale lofty feeling. A great space for a birthday or holiday dinner.
The wait staff is very nice and attentive. Our waitress made wine and food recommendations.
The highlight of my meal was a mix drink called warm apple pie...SO GOOD! The vegetable tempura was also delicious.

Now on to the negatives

One person at the table ordered the shrimp and scallop risotto. I'm no risotto expert but I do know under cooked rice when I taste it. The risotto was way under cooked!
I ordered the NY strip cooked medium. The steak was over cooked almost to the point of well done and completely lacking in flavor.
The third person ordered eggplant parmesan which was also lacking in flavor.
Not to mention our food came out luke warm, not sure why our food wasn't hot but the warm temperature didn't help the taste any.

The food at Fory-Six is just okay and I'm in no rush to go back."}
{"text":"Stopped in for lunch only to be told that our only option is a very, very limited greasy meat based buffet. Everything looked dried out and sad - from the skin on the top of the soup to the lame wilted salad and the meats swimming in grease. After all the hype this is a huge letdown. Pretty place and all but I just don't get all the hype."}
{"text":"This is a truly unique establishment that would stand out even in New York City or California. Very committed to use of fresh healthy ingredients and healthy preparation methods. Everything I tried here was delicious: spinach eggplant parmesan ( prepared in a quite different fashion than the usual ), beef and mushroom soup, a pumpkin ice cream like dessert. The restaurant has a scientific theme, the sign at the front has a DNA spiral on it and the name 46 represents the number of human chromosomes. There are pictures of DNA spirals and other chemistry references in the restrooms and within the restaurant. The bar area is nice, the whole place has a very modern, sleek vaguely ultraloubge kind of feel. Our server was incredibly friendly and good at explaining the menu items. I live in NJ, people here in Kannapolis are friendly in general U guess compared to people in the northeast."}
{"text":"Love this place 
Food is alway prepared well - a lot of good health fresh choices.

Had the ribeye with a pear walnut salads and greens they couldn't have prepared it better.

Best restaurant in Kannapolis - Concord area for a steak especially."}
{"text":"I was not very impressed with this place! They were out of everything we tried to order! Out of the beers on their menu - basically had bud light and one other! I tried to order a dish and they were out of that too! Food took a whole to come out and when it did - the chicken breast I ordered turned into a chicken quarter. The atmosphere is nice and the open kitchen is nice but I am not sure I would go back!"}
{"text":"I love this place....and I love that it's in K-town.  You see, Kannapolis is one of my least favorite cities and has never been know as a culinary destination but Forty Six,....you are a welcomed change.
   I had the opportunity to eat here alongside 7 others for an impromptu dinner.  Our group consisted of mostly \"clean\" eaters and one with a penchant for Red meat, 2 vegans and another who loves all things deep fried.
   The special for the night was a grilled Mahi Mahi atop a Pineapple couscous and some sort of rice ( I forget).  I ordered the Garlic Pork with Collards and brown rice.  I highly recommend the Pork.  It only had a hint of garlic not to overwhelm the Pork's succulent taste.  It was a very large piece of meat and I struggled to finish my meal because of it....(no empty plate left behind for me).  The Collards were not bathed in a vinegar dressing like most Southern restaurants but rather lightly dressed.  It was refreshing to eat them like this. There's not much to say about the rice, it was cooked well.  Next time, I will ask to substitute the rice with a potato of some sort because I feel that Pork and Potatoes go together.
   The Mahi Mahi was grilled to perfection and the Pineapple couscous was a great compliment.
   I overheard the Filet Mignon was very juicy and cooked just right as well as the Eggplant Moussaka.  One of the diners asked the waitress if the Vegetarian dish she ordered could be prepared Vegan and the waitress assured her that it was no issue.  She then reported back after speaking with Chef to give her an update on the time frame to do this but again assured her that it would be no issue.  
   This level of service is very much appreciated in this town.
For dessert, I ordered the NY Cheesecake and tasted the Tres Leches.  The Cheesecake was......cheesecake.  Not amazing but not bad, just good.  The Tres Leches on the other hand was amazing!  I'm used to the cakes from the Pasteleria down the street but this was way more refined that those cakes.  It was decadently simple and I highly recommend it.  
  The decor is very swanky, especially for the area.  Great place for a date or special occasion."}
{"text":"Went to Forty-six for lunch - at which time they serve a limited menu. 

We started off with these sweet potato crisps that they serve you immediately after you are seated. Good but probably could use some salt.  I thought it was a unique  surprise rather than your typical bread service. 

We started our lunch off with the arugula, fig pistachio  and goat cheese salad which was simple and fresh.  We added salmon which was simply seasoned and cooked perfectly.

For our entree we ordered the meatloaf and the salmon blt sandwich. 

The meatloaf was delicious.  It is not the meatloaf you grew up eating!  Pork and ground turkey with a wonderfully sweet bbq type sauce on top. It was served with a hash that included root vegetables that was coated in a Demi glaze.  Yum!

The salmon sandwich was unique and very tasty. The bacon is salmon bacon which I think is smoked salmon that has been cooked/crisped. 

We would definitely go back to try their dinner menu or maybe for the meatloaf!"}
{"text":"Every time I've been I've insisted on having only one server, and they no longer have her there so no más food for me. Awesome chef, but very limited menu. Sunday brunch is the best part."}
{"text":"I, too, wanted to love this restaurant and though the food was ok, it was the service that was seriously lacking.  There is no concern of getting inebriated at this restaurant because it took forever for my server to come to the table. The confusing part was that the restaurant was relatively empty with the exception of an extremely loud party in the front part of the restaurant, otherwise there were about six other tables occupied. The entire meal took about two hours. It was about fifteen minutes before anyone even took our drink order. 

If I ever return, I will definitely peruse the menu online so I can order immediately and I'll probably order two drinks at once."}
{"text":"Great place in downtown Kannapolis for lunch or dinner. Great for groups or picky eaters as the menu appeals to all types. Terrific salads, sandwiches, and entree's, including a KILLER meatloaf over roasted veggies.  They bring out sweet potato chips before your meal, I dare you to just eat one!"}
{"text":"We stopped by for our first time last week. Right at 5:00 pm. We were asked if we had reservations, didn't know we needed them. But we were seated anyway. Just a quick synopsis.

Bread was great.
Flatbread was excellent
Buttermilk Chicken was just OK, My 90 year old Dad commented almost immediately.
Stuffed Pork Chop was excellent, my wife had this
Meatloaf was terrible. Consistency of liver mush and it tasted horrible. Couldn't eat it. Scraped off the sweet sauce and it was still bad. Small potatoes were good.
Thai Snapper was awful. Very gamey/Fishy tasting. Not Normal for Snapper. Noodles were odd tasting also. My 87 year old Mother commented immediately that it was not good, I verified it. She did not want to complain.

My Mother became very Ill later that evening and had my father call me. She was certain that it was the fish. She was burping up the nasty fishy taste. I called the restaurant and talked to the manager about the fish and he said there was no way. Also offered nothing other than I hope she feels better. At that point I told him how the rest of the meal went.

We eat out quite regularly at all price ranges. 46 is apparently hit or miss. Won't go back. Also the response to our issues was not up to the standards of most restaurants."}
{"text":"Great food and atmosphere.  Very friendly helpful staff.   I wish there were more places like this in town.  Highly recommend"}
{"text":"Forty-Six, as in forty six chromosomes. Not what you would expect for a restaurant right?

The interior of the restaurant, however, has nothing to do with science. The walls are constructed with bricks, the ceiling is strung with simple lights, and the booths and tables are made with dark, warm wood. The only thing science-y is the logo of Forty-Six, a fork and spoon that are twisted together in a double helix (like DNA), and a few quotes upon the walls from famous inventors and researchers.  

While the restaurant certainly exudes a classy atmosphere, their prices are ridiculously reasonable. Rarely do I read a menu and want to order every single item, but here at Forty-Six, I had to sit there for quite some time before I finally made my choice. Everything sounded so good and at the price charged, it was an absolute steal!

For lunch, I got the salmon BLT with a side of pasta salad. Unfortunately, the restaurant had run out of the brioche bun, so I opted for wheat bread instead. Complimentary house baked chips were served in a black basket that tasted crispy and not the least bit oily. Some pieces were a tad bit stale, but the chips were salted extremely well.

My sandwich, however, was PERFECT. The fish filet was beautifully seasoned with a good, toasted char on top, mimicking the \"bacon\" in the classic BLT. The vegetables, such as the arugula, lettuce, and tomatoes, were vibrant and fresh while the tarragon mayo sauce was deliciously creamy and added a nice contrast to the crispy bread. The pasta salad was a tad bit under seasoned, but I loved the smell of the bell peppers and cucumbers. 

I was undeniably impressed with Forty-Six, from the presentation of the food to the unbelievable prices. While I may not understand the connection between the restaurant and genetics, I must stay that Forty-Six certainly knows food. 

A beautiful gem of Kannapolis!"}
{"text":"Have wanted to try this restaurant for a number of years so this weekend, we decided to drive over from Cornelius which is about 20 miles away.  In the end, we ended up somewhat disappointed in both service and the quality of the buffet.

Dropped my wife off a the front door shortly after 11:00 am which is when they open Sunday's while I found a place to park. I walked in, I found my wife in the main dining room. She indicated the manager has asked her if we had reservation and they were normally required. I had checked online before we left Cornelius or actually Davidson and no place on their website did they say, reservations required or reservations suggested.  In fine print in the contact area next to the phone number is a notation that you can also call this number for reservations.

I sat down and both of us waited for almost 10 minutes till someone came up to take our beverage orders. After we finished with the orders, the server told us we could proceed to the buffet. Had hoped to see a menu but on the buffet.

In general, a standard buffet with what should have been a good selection.  Started out with Potato Cheese Soup  but if you pick that at first, you have to navigate the rest of the line with a cup of soup in hand.

Good selection of Fresh Fruit but then you move on the entree selections. Remember these area in serving trays being kept hot with alcohol burners.  One of the hallmarks of this restaurant is healthy eating. The Sausages and Bacon did not appear any healthier that it counterparts along the interstates.  The Fritata looked great but was dried out even though the buffet line had been open for only 20 minutes.  The Hash Brown Casserole was a bit under cooked while the Chicken was tough and dry.  The skirt steak was the high point for flavor and texture.

A bit of history about this place. This is part of David Murdock's legacy. After Cannon Mills, and Dole Foods, he established the David Murdock Research Center as a way to do basic research on food and nutrition and this restaurant is a showcase of that effort. The 46 refers to the 23 chromosome pairs found in the human body.

Very stylish restaurant and what like are the quotes on the wall from famous inventory, philosophers and writers giving some to contemplate while dining.

With the exception of the young lady who kept filling up my coffee, service was fair at best. Food quality was not up to what I expected and the room gets the high marks for the visit.

Not high on my places to recommend or revisit."}
{"text":"I have tried 46 for brunch, dinner, and special occasions. I have never been disappointed. I will say that you are hit or miss with waitstaff. No one has ever been BAD, but I have had less than stellar waiters. 

Pros: menu changes often enough to keep it interesting, quality food, chef is willing to alter dishes to accommodate tastes and dietary needs, several vegetarian options, the brunch is A+, daily drink specials. 

Cons: brunch menu posted weekly on website is not accurate (I've been several times specifically for the hashbrown casserole which was missing from the buffet), price recently went up on the brunch, serious lack of vegetarian options on brunch buffet (make the frittata veggie - this would be a huge step), inconsistently trained waitstaff. 

Will I return? Absolutely. 
Is there room for improvement? Absolutely."}
{"text":"Nice place next to the historic Gem Theatre. Went for brunch with family, standard breakfast buffet with reasonably nice atmosphere for the money. Might come back to try dinner sometime."}
{"text":"Went there for Sunday Brunch. The items on the buffet are tasty and few. But, No EGGS!!! What? Can't even order them. Then, they charge an extra $2 bucks for an order of three SMALL pancakes, and another $2 bucks for an omelet. At $15 BUCKS A HEAD, IT CAN BE A VERY EXPENSIVE BRUNCH. I'm sooooo glad we went. We aren't going back!! 

On a scale of 1 to 100... they scored a Forty-Six!"}
{"text":"Went for a lovely romantic evening with my beau.  Beautiful inside, wonderful staff.  The filet mignon melts in your mouth.   Wonderful heathy options in a town where most of the people are a little rolly polly from too much Hardees and Taco Bell.  I'm from the city and you can't beat the prices here with a stick. Esp compared to the generous portions that they give you. Vegetarian and vegan options for those hip and trapped in the land of double fried meat and cheese here in Kannapolis.  The staff are all attractive as well, which never hurts the overall experience.  A diamond in the rough.  Bravo 46. We shall return again and again."}
{"text":"Closed Saturday for breakfast/brunch.  Packed on Mother's Day.  Tried a third time...called at 10:15 AM on a Sunday...asked if they were open...they said yes....we arrived...they didn't actually open until 11 AM...wait around...finally get seated.

Coffee was not good and came in miniature size.  Many of the buffet items needed salt or were bland. I get why locals may think this is great...it's different than the usual in Kannapolis, but it isn't great food. The jerk chicken was awesome and the only exception.  

Ambiance was like a lower class place trying to step into a league it didn't belong, but again...meh. Fine. It's Kannapolis. People like a buffet. Whatever."}
{"text":"The food was great and everything was as I asked! They needed more people working to keep people from having long waits on their tickets."}
{"text":"Lunch was very good.  Fresh  and very healthy.   Not a big menu but enough to have a good variety.   Vegan and gluten friendly.   Take away container and bag are recyclable."}
{"text":"We love eating here! The food is fresh, tasty, and healthy. The prices are reasonable, especially for lunch. Great atmosphere and nice staff. I eat here at least once per month."}
{"text":"HIGHLY RECOMMENDED FOR PRIVATE PARTIES!! My family hosted a beautiful event here and everything went very smoothly. They even made modifications to serve vegan food. The staff was very welcoming, attentive, and friendly. The ambience was great. The food was very fresh and flavorful. I highly recommend this place!!"}
{"text":"My family often comes here for the Sunday brunch. We are never disappointed... Always enjoyable food and atmosphere."}
{"text":"We visited 46 while visiting from out of town.  We had a burger (Thai, special at the time) and the meatloaf.  The salad bar was too tempting to resist as well so we added that to each of our meals.  The food was all delicious, from the sweet potato crisps to each ingredient on the salad bar.   We were surprised by the value for such a nice setting!"}
{"text":"Forty-Six is a wonderful restaurant that has helped reshape the face of downtown Kannapolis. The food is quite good and I enjoy their seafood selections. Their weekend brunch buffet is definitely worth going to..again and again! I'd recommend making a reservation for brunch or dinner.

I also recently attended a nutrition talk on breast cancer at Forty-Six, and I was so impressed by their support of the research institute next door. They were not open for dinner that evening but served complimentary hor d'oeuvres during the free talk. This community support has bumped my rating from 4 to 5 stars! Already enjoyed their food/atmosphere to begin with but they are truly a wonderful local business that I hope everyone supports."}
{"text":"Had a great  and romantic date night at 46. The food was 5-star and the filet mignon was the healthiest portion I've ever received from a restaurant. We will be returning to 46 so we can try all the dinner plates they offer. Only semi-complaint is the service is a bit slow but the food is well worth the wait.

If you want to have a romantic dinner with your significant other, Forty-Six is the place to impress."}
{"text":"This quaint little place has a unique menu with lots of variety. Lots of selections for vegetarians. My traveling companion was very pleased. The food was cooked to perfection. The staff was attentive and friendly. The only thing I would change about my experience is the wine list. It was limited but likely fit the clientele given the size of the city. I had the salmon and lobster mashed potatoes. The potatoes were so great I could have made them my meal."}
{"text":"I've only had great food and great experiences here. Get the salmon BLT! They have good catering too but you really can't beat a lunch out there."}
{"text":"I don't know how many times my wife and I sat at Terrace Cafe, Fenwicks or Cafe Monte and said \"Why can't we have this quality of breakfast/ brunch near us? Why is everything around us either a chain or some nasty old greasy spoon?\" If we'd only gone here sooner it would have saved us a bunch of trips to Charlotte. 

It's great to find somewhere in the Concord/Kannapolis area that has good quality ingredients, an original menu, a good selection of coffee drinks, nice decor and really good service. Don't let the ghost town of Cannon Village scare you off, this place is worth the trip.

I had the eggs benedict and my wife had a bacon and swiss omelette both with a side of hash browns. Both were excellent. I had a mocha cappuccino and my wife had a vanilla latte both these were very good as well. Probably not quite as good as Terrace but, when I factor in a 5 mile back road drive versus 25+ through charlotte traffic, I give R46 the nod.

We definitely plan to go back for dinner soon. My only concern is the waitress was telling us they are considering eliminating brunch over the summer. I think that would be a big mistake as it's the only place in the area with a good sunday brunch. If they don't get the traffic they need maybe they should advertise a little more as it would seem the only reason for a lack of traffic is that people just don't know about it. Apparently they've been open for a few years and we are just hearing about it now."}
{"text":"Hate to drop a 3-star in the mix.... but this is a forum and serves a purpose as long as reviews are honest. 
We considered 46 a rare treat for special occasions.   We went on Valentine's Day, got in before the rush.  Maybe 6-8 tables occupied.   Server friendly but a bit inattentive.  50 minute wait for our food, tasted good, not great, and disappointingly barely warm.  Something tells me someone forgot it and it sat for ???? minutes.  Unacceptable at their prices and status.   Might return, might not."}
{"text":"After a super long day of thrifting ( it was half off day!) I braved the unknown (to me I mean) back roads of Kannapolis to come here. Maybe I expected too much out of this place but really it was just aight.

I drove up on a super cute downtowny looking part of Kannapolis, as I said before, an area I had never ventured. I was excited! A restaurant with this outstanding sounding menu out here?! Lemme at it! 

I had already fixated on the Salmon BLT ( seared salmon, avocado, arugula, tomato, smoked salmon \"bacon\" with a tarragon caper mayo on a brioche bun). Sounds delish doesn't it?! I got the salad bar as my side, which is available weekdays for lunch. I went ahead and dug in for the salad while I waited for my sandwich. The salad bar options were all very fresh, though not something I imagine you could make much of a meal out of (which is an option) Probably best as a meal accompaniment. Also there were only 4 dressing choices, and 2 were very similar. 

My sandwich arrived and I still hadn't received a basket of the complimentary sweet potato chips, so I kindly asked her if I could get a basket, she apologized for having forgot and quickly brought some over. First thing I noticed when the sandwich arrived was a bit of a strange smell, but I chalked it up to being the smoked salmon bacon since I couldn't identify it right off (later realizing it reminded me of a kitchen sink drain but had no \"issues\" so I guess it was fine). I tasted a piece of the salmon that had fallen off the sandwich since they were on there in chunks and it was pretty flavorless. I ended up having to salt the thing...I don't know the last time I had to salt a sandwich. The combination of ingredients was all just a little too soft since the salmon \"bacon\" wasn't actually crispy. So texturally it missed the mark. Flavorwise it was unexciting.They should have just used a lot more of the \"bacon\" on the sandwich since it was extremely flavorful on its own. 

I would go back to try something else if I find myself in the area since the service was great but I definitely won't go out of my way to return."}
{"text":"Nice Sunday brunch.  Poached salmon was tasty and tender.  They vary the offering weekly."}
{"text":"I have visited this restaurant four times because the first time we went for brunch it was great.  The second time the food was cold and not good.  The third time was for dinner.  The food was so so and the drinks were expensive and lacking alcohol.  The dinner alone was $138 and not worth $25. I would not recommend for dinner.  Today we went for brunch hoping that it would be as good as our first experience.  The food was ok, nothing spectacular, but because they have the air blasting the whole time and the vents are everywhere, the food on our plates turned cold within 2 minutes and I'm not exaggerating.  We will not be going back and cannot recommend."}
{"text":"Love the salmon BLT sandwich?Not a fan for the pear salad, not fresh at all. The environment is nice."}
{"text":"Don't let the photographs of menus for brunch fool you.  Brunch is predetermined buffet!  No made to order items.  Service is bad to say the least!  Empty water glasses, no hot food on the buffet.  Most of the burners under the chaffing dishes not burning!  Frittata had good flavor but cold!!!!  Took 20 minutes to get a mimosa and the husbands coffee ordered at the same time still hasn't arrived!  Food quality and flavor MIGHT be acceptable if hot!  Not impressed at all!!  Great atmosphere is the only reason this little down town Kannapolis restaurant gets 1 star!!!  Step it up Forty Six!!!!"}
{"text":"Yum-!


First off I am a user of the App \"Shopkick\"  (Check in to stores, get points, get rewards.) I got my first reward, and used it for a 25$ Restaurant.com gift card. which is how I found \"Forty-Six\".


I was so happy I did too! The place is classy- a great date night or group dinner outing. Our waitress was knowledgeable, attentive, and nice all around. Forty-Six offers a delicious menu with items like: Lobster-Shrimp Risotto, Brick Seared Chicken - Marinated and Seared Crisp. 
Served with Sautéed Swiss Chard and Roasted Red Potatoes!! They even offer Vegetarian Plates like -

Penne Roma
Sautéed fresh Tomatoes, Garlic and Basil flashed with White Wine.  
Tossed with Penne Pasta, Spinach and Aged Parmesan Cheese.

&

Vegetable Lasagna 
Spinach Pasta Layered with Roasted Eggplant, Mushrooms, Spinach,
Zucchini and our 3 Cheese Blend$12

*~* But with so many wonderful choices we had to get the special our waitress offered us. The filet Mignon, perfectly cooked and placed atop a mound of red skin mash potatoes, topped with goat cheese (which was really great) and sided with Delicious asparagus. The meal was fantastic, and I was contently full, not brimming full-so that I felt sick, but actually satisfied full. It was a wonderful meal and experience and I will be coming back again!"}
{"text":"It pains me to write this review since I really wanted to like this place. For the price, however.. wait, no. Even if I were paying for diner food, I'd expect better. But this is supposed to be a classy joint.

Service was friendly but we ordered tempura vegetables as appetizer and saw them sitting on the counter for almost ten minutes. I could see our server in the kitchen, chatting away, and another server drifted out, looked at the dish and ignored it. The cooks in the open kitchen could see it sitting there, too, but no one was concerned. I wanted to just go up and grab it myself. So, cold appetizer.

I had the pork chop with pimiento mac and cheese, my friend had the vegetable penne. The food was... okay. No one was really commenting on it, negatively or positively, but I know I could make better at home. The pork chop had the taste of greasy char. This brings me to the biggest negative. An open kitchen needs to be spotless, but I could see a grill backsplash that was covered with layers of old grease. Gordon Ramsay would be popping a blood vessel.

Maybe I'll try the breakfast brunch someday, but this dinner experience didn't rate better than two stars."}
{"text":"Excellent food, apps, drinks and service!  Started with the crap dip which was small but delish. Had the fig/arugula and caprese salads.  Then shared the scallop and shrimp risotto.   Everything was amazing.  Love the mill brick and the old rustic floors.  Super cute place!"}
