{"text":"Surprisingly good restaurant hidden in the courtyard of an office building. They serve classic cafe fare for breakfast and lunch - eggs, sandwiches, soups, salads, and such. The food is very affordable, with most meals below $7, and a good value for the money. The owners are very friendly and talkative, and the restaurant is usually uncrowded.  For guests staying at the Hilton, it's a two minute walk across the parking lot. Well worth the walk."}
{"text":"Got into town a little early and stopped off here to have lunch. Was extremely surprised with the excellent service and then wonderful wrap. Very good! We'll be back! Price was great as well!"}
{"text":"The only thing more awesome than the food, is the stellar customer service. The ladies at the forum cafe were so sweet and helpful even though they were completely inundated with orders. Highly recommend this place for a great and truly inexpensive breakfast."}
{"text":"Wow!    Kudos to Oli and team for catering our Mardi Gras party last night.  The food was delicious and the menu was perfect.  We had over 130 people at our party and so many compliments on the  fantastic food!  A first class operation, and we will be calling you again real soon!"}
{"text":"This is the very best place to order catered breakfast burritos!  The owner Oli is very accommodating!  I ordered 275 and she had them all ready and waiting for lots of hungry teenage boys!    Great place and I will recommend them to all of my friends!!"}
{"text":"This is a great spot for a cute meal at a great price. We are always looking for good, quick food at a good price and this definitely exceeded our expectations. I would definitely recommend this as a great spot to stop for a quick bite! Lots of options, great pricing, and super friendly staff."}
{"text":"This place always has good food, great prices and excellent customer service. I am here often because I work in the building and both their lunch and breakfast are tasty and quick. Highly recommend."}
{"text":"Lots of excellent food for cheap.  Got the tuna sandwich and it was awesome.  The staff are hilarious, too."}
{"text":"I must say I have not eaten IN the restaurant but I have worked with them to cater 2 events. Oli is great to work with and very accomodating.  Even more important is the food.......  You must try the chicken alfredo with penne pasta and the red meat sauce with penne.They are outstanding for any event when you need to feed a room full of hungry guys.  Great friendly service too. I will have to try a meal in the restaurant sometime......"}
{"text":"Excellent cafe with affordable and well prepared breakfast and lunch items. Chef Carmello was a gracious host to come out and check up on everything. goes without saying that customer service was 5 star, and so was the food. well done!"}
{"text":"Wonderfully friendly little spot for breakfast and lunch. Food is simple, but tasty. This isn't a restaurant per se, it is a little cafe in an office block. There are a few tables and sofa. Coffee is only $1.25, which is great considering most places now charge $3 for a cup of coffee. Location can be a bit challenging to find as it is in the inner courtyard of the Forum office building. Go through any of the entrances into the courtyard and you will find it."}
{"text":"A little difficult  to find , but a good experience. The owner Carmello was friendly and efficient. Our party had salads and sandwiches and everyone was happy. Go through the North door after parking in the back."}
{"text":"I work for Dignity Health and used FC for catering. Oh my!  Just fantastic. FC catered our 3 day event and did a magnificent job.  We surveyed our participants after the event and the ratings were 4.5 out of 5. The cookies are yummy yummy and they are homemade!  Our menu included wraps, salads, and desserts. Something for everyone, vegan, vegetarian and gluten free. The fresh water with lemon and basil was also a huge hit. I work in our San Francisco office but would not hesitate to hire FC again. Phoenix participants will definitely use FC in the future. Thank you Oli for doing an amazing job!"}
{"text":"Found this fabulous hidden gem on Yelp. Casual little cafe in the courtyard of the Forum Office building. What a sweet pleasant place for a meal. Friendly owners and good food. I had the build your own salad and a cup of onion soup sitting on the sunny patio and couldn't have been happier. A great place for a quick yummy lunch!"}
{"text":"Diamond in the rough! I love the atmosphere of this little cafe and simple delicious menu. Its run by very inviting and friendly husband and wife who have been there for several years. Excellent is an understatement!"}
{"text":"Carmello's Forum Cafe has been my go-to for quick lunches, coffee with a client, small catered breakfast, and catering for larger, formal events.  The quality of the food and the owners is second to none and they can create a menu for all types of gatherings and budgets.  The staff is friendly, the service is prompt, and it has indoor and outdoor seating which is nice.  Free wi-fi as well!"}
{"text":"Amazing quality for very reasonable price. Food is fresh, simple, delicious.  Wonderful service to boot!"}
{"text":"The place is a bit hard to find in the back of the business park, BUT it is well worth the effort! I had the chicken cordon blu sandwich, and my friend had the lasagna. The place can get packed during the lunch and breakfast rush so try to hit them up in between if you can. You will walk away one happy camper I guarantee!"}
{"text":"I've been using Carmello & Oli with the Forum Cafe for over ten years and couldn't be happier.  They're always ready and attentive to serve whatever event we're doing and enjoy doing little things to make an impressionable experience.  I confidentially pass their name along to people I deal with regularly and thankful I have them as a partner for our company events."}
{"text":"OMG I can't get enough of their southwest chicken soup!  And their chili relleno's are out of this world!  I have never had anything bad at their café.  And they cater!  They do an omelet bar at our company that's to die for.  Omelets made to order!  Great great place, I eat there every time I am in the area.  Owners Carmello  and Oli go above and beyond.  And their staff is always friendly, even remembering your favorites if you go there often.  And Oli makes the best green salsas ever.  I could go on and on..."}
