{"text":"This is a solid 3 star place.   I went for lunch 8 days ago with a work friend.  We sat outside.    the Good:  I had the veggie burger (fried, not grilled) as a 'meal' with fries and a regular size drink.  The veggie burger was probably one of the best of these I've ever had.  I've had them several places, even at Cosmic Ray's in Tomorrowland, and they usually are *terrible*.  This one was good.  Fries were tasty.  The service was nice: they seemed interested in whether we came back, so I'll give them points for that.  Always good :)!  the Bad:  The charge was $9.36 for the veggie burger meal.  My friend got a charburger meal, same sizes of everything: $10.36.  Given this the drink seemed small (and a foam cup!) and the amount of fries seemed small, even though I ended up full enough.  For the same or less money at FiveGuys you feel like you get more fries and a better drink cup, plus free peanuts.  You may say I am kibbitzing (not the same as kibbutzing) but when you have 2 places close in price you try to separate them and look at value.  They also seem to expect a tip here, whereas at FiveGuys it is not so.  Now if you are paying $11.00 for burger and fires, then adding a tip, I'll skip the soda pop and go to Red Robin.  Unlimited awesome fries, huge burger (or whatever), you see my point. The interior also seemed in need of help, for 2 reasons.  I just felt like I didn't want to sit inside.  The FiveGuys dining room comes off as inviting, unlike this place, but I couldn't tell you why.  Also: when they made the charburgers, stuff was charring.  Literally smoke is coming through the kitchen pass-through and kind of hanging in the dining room.  They may have had a vent issue that day or I don't know what, but when it got going there was some smoke going on."}
{"text":"Way over priced. Went in with my daughter and got her a kids meal. The girl that took my order rang me up for each individual item on the kids meal when I asked for the basket... why... because my child wanted milk and I don't allow them soda and she wanted a fruit cup wich was no extra charge... but I was charged for a dipping sauce for her chicken... to top it all off my burger wasn't fully cooked and the fried where horrible. It cost me over $20 for a burger meal and kids meal. Save your money and go elsewhere."}
{"text":"Great food, great staff. Very clean. Indoor and outdoor seating...outdoor has a covered area. Not crowded at all during lunch time even though it is a race weekend. Right across from Concord Mall/Bass Pro area.  Wife and I both got Charburger and fries combo with all the topping we like for around 24 bucks. DELICIOUS! Similar to Five Guys but a whole lot more on the menu!"}
{"text":"Been there several times, tired different items on the menu, food is always great. Charburger, & fries, so much better than Five Guys. Turkeyburger and onion rings, excellent. Haven't found a better burger for a \"quick\" lunch or dinner."}
{"text":"Went for lunch on Veterans Day to treat my son to an afternoon out at and near the mall.  Had to say I was pleasantly surprised.  I had a delicious turkey burger with pepper jack, jalapeños, mayo, lettuce and tomatoes.  Also chose the side salad over the fries.  Best turkey burger I've ever had - cooked to perfection (moist) and the salad was good as well.  Son had the chicken sandwich and fries and I can say the chicken was too dry for me.  Not sure if my burger was a fluke because of the chicken or if the chicken was a fluke.  Either way, next time I'll stick with the turkey burger and salad.  Oh and we opted for the fresh squeezed lemonade which came out warm but a few swirls in the cup of ice and it became a refreshing drink."}
{"text":"Racing themed hamburger joint. If hamburgers and greasy sides are your thing this place is for you. I ordered a turkey burger and side salad. The salad was dismal (brown lettuce, hard, pale tomatoes). The turkey burger was average. My sweetie had a side salad and onion rings. The rings were very greasy. Interior is aging and looks sort of dirty and dark. Hard to tell cleanliness due to decor and lighting. Will not return."}
{"text":"I like Foster's.  Their burgers are actually cooked over flames which gives it a great taste and the fries appear to be hand-cut freshly in the kitchen.  In the summer their tomatoes seem almost home-grown which is a big plus.  The food is good and the portions are large.  This is not a Mickey D's substitute, it probably more closely competes with Five Guys and I think it is better, and a better value."}
{"text":"Great burgers , kids eat free night is a good time, the patio setting makes for a good place to sit and watch you kids have fun"}
{"text":"Love this place. Had to get used to the new management team. My wife and myself make an effort to come once week.  In my eye its a little pricey.  Over all worth the money. Its about $9 a person."}
{"text":"Feels like a local grill but in reality it is a small chain.  Burger was great with a lot of taste.   Staff was pleasant and quick.   I would eat here again.  No need for fast food if you can get good food.  Bonus they have cold beer on tap."}
{"text":"Burgers were ok, not the best in town, but definitely not the worst.. can't beat the price on Tuesday, 2 bucks. The fountain drinks however were horrible..."}
{"text":"Foster has great hamburgers especially on Tuesday you can get the junior hamburger for a 1.99 and it is very nice size."}
{"text":"Excellent costumer service. Food is killer! Anything on the menu is perfect and always cooked to order. Never disappointed! You write your own slip so, if there is a mess up.. Haha you did it! Love this place!"}
{"text":"I have had a good experience so far, and the food is good. I have only been here twice. Both of the times I have had the southwest boneless wings and fries."}
{"text":"In the mood for a flame broiled burger?  This is the place.  Great burger and exceptional fries..."}
{"text":"This place was really good. The fries were my favorite part about the meal.  If your a race fan there is lots of race stuff hanging around. I will definitely be back to this spot for lunch. There was quit a few people eating when I arrived and my food came out in a timely manner. I also enjoyed the out DOOR seating."}
{"text":"It wasn't bad food, just okay. The burgers are better than MDs, but no BT Burger Joint. The fries were hot, but greasy and chewy."}
{"text":"Charburger was about a pound, it was huge and delicious! Ice Cream Shakes were great too."}
{"text":"I thought I would try Foster's Grille on a Wednesday being that kids eat for $1. We walked in and were immediately greeted by the cashier. It was practically empty in there so I was excited knowing we would get our food fast. We ordered a Lil Charburger, wings, and fries. The burger was very good and it reminded me of a better version of Burger King. The fries were ok but needed salt. We waited 15 minutes before our food came so it seemed more like a restaurant versus a fast causal restaurant. Overall it was just okay and it was overly impressive where I would come back."}
{"text":"Visited for the 1st time. Establishment was not crowded, defiantly a burger joint. Good for Lunch, families, or casual dinners.  Pricing is comparable to 5 Guys or other burger joints. For 2 people spent 25+ they do have specials throughout the week.  The burgers defiantly had a chargrilled taste but was simply just okay. The hand cut fries were just okay as well. Would maybe go back on a special day but not to pay full price."}
{"text":"Way overpriced! Glad I asked for crispy fries because they came out normal, guess they would of been semi cooked if I hadn't! We got a kids cheeseburger, a regular cheeseburger, basket of fries, a lemonade and a water, and it was almost $19!!!!! It was slow, the place was cold, and not very friendly. Save your money!"}
{"text":"I was invited to lunch here by a friend and I was pleasantly surprised by this restaurant in the Concord Mills area of Charlotte NC. I've never noticed this place, but now I have I will be back. Great hamburgers and lunch food. Quick service, good fries, and great burgers makes it perfect for lunch. I highly recommend trying this burger joint."}
{"text":"We had cheeseburgers, wings and a Turkey sandwich.  All were terrific. Decor is fun. Burgers are generously sized, flavorful, and not greasy. Toppings are fresh and tasty. Prefer these burgers over 5 guys any time."}
{"text":"My husband and I have been here numerous times and always enjoy it. The Charburger is amazing. I love how easy the ordering process is and everything is customizable."}
{"text":"On Monday, my boyfriend and I stumbled upon this little grille after a trip to Walmart. We have passed this grille several times while on the way to Concord Mills, so we finally decided to try it. Immediately when we entered the restaurant, we were greeted, and we were asked if we have eaten there before. One of the associates helped us by showing us how to order with the little cards. I liked how we could use the cards to circle and write exactly what we wanted. The food didn't take long to come out, and it was fresh! The fries were amazing and hand-cut, which are my favorite kind. I ordered the buffalo chicken sandwich with fries, and my boyfriend ordered the original char burger with provolone, bacon, and bbq sauce and fries. We split both meals, and we weren't disappointed! Even one of the staff members checked on us after we received our food, which is not seen often at places where you order and take a number.  Very impressed with this establishment, and we will be back!"}
{"text":"Best burgers in the Charlotte area! The staff is so polite and friendly and the food is always fresh and delicious! The ordering system is much like Which Which where you circle your items in the sheet to ensure your orders are always made to order the way YOU like it! We come every week!!!"}
{"text":"Hated the ordering system, you have to fill out a sheet of paper just for a beer. Also got the boneless wings and they were bland."}
{"text":"Really great place to bring the kids. Food is awesome and they have something for everyone. The manager went above and beyond to help us out. We will certainly be back."}
{"text":"It is had to eat as a family because one of our kids has serious food allergies.  Foster;s grill goes above and beyond to make sure the food is safe.  The staff is always friendly and the food is extremely consistent and good!"}
{"text":"One of the best fast food burgers. Homemade fries are hard to beat! Fridays are the best! Bottomless fries! Everything is made to order. They never disappoint. Staff is generally friendly."}
{"text":"I'll start with the good:  The fries are hand cut in-house and pretty darn good; think Five-Guys or In-n-Out.  They're soft, but have a great potato taste & go well with the Malt Vinegar. The bad:  Wife ordered a chicken philly and got served a beef philly.  When you consider that you turn in a filled out slip of paper to order your food, that's a pretty crappy error.  Because I ordered a \"Full Basket of Onion Rings\", the wife didn't order a side...big mistake. The Full Basket of Rings featured a whopping SEVEN onion rings.  That's it.  7.   I guess the half-basket comes with 3 1/2. The Philly sandwiches feature fast-food style, frozen shaved steak, have a meh flavor, and come on a run-of-the-mill roll...nothing amazing here.   Overall, it's a cheap dive to grab a bite if you're desperate and need to avoid McD or BK, but that's about it.  Hit Carolina Ale House if you want a decent meal at nearly the same price."}
{"text":"Depending on when you go, this eatery will be a nice laid back affair or a total madhouse, so while it's family friendly there ARE exceptions. Food-wise, it's your standard american fair with crispy wings and juicy burgers and greasy fries...delicious as they may be. I would still recommend them but I would have to take some points away due to the staff that are on the young side and come across as not wanting to be there."}
{"text":"Food is delicious and satisfying. They have different things and specials going on during the week. Staff is great and always helpful. I am so happy that I discovered this place!"}
{"text":"Charburger was great but the rest was a disappointment  Doing some shopping at Toy R Us across from Concord Mills today and decided to give Fosters a try.  Had heard several good comments on the specialty which is a Charburger and wanted to try it.  I will give them credit. The Charburger is an excellent burger with great taste and flavor much like Burger King had in the early 80's when they were CharBroiled. A little heavy on the condiments meaning everything wants to slid off but other than than, an excellent tasteful choice.  Going back to the beginning, you walk in and go to the counter and they have menu pads where you circle what you want and pay. They give you your beverage cups and a number you place at your table. I ordered had squeeze lemonade so I had to wait a minute but joined my wife shortly at a table over to the side.  My wife ordered a Philly Cheese steak and a side of fruit.along with tea. The rest of my order in addition to the burger described above was a half order of fries.  Service is very slow and it took almost 15 minutes for our order to arrive. As I pointed out, the Charburger lives up to it's reputation but the fries were limp and oily.  Very little lemon in the lemonade so it ended up tasting like slight tart sugar water   My wife did not like her Philly Cheese Steak because it had been made with a poor quality meat and no peppers and little onions on the sandwich. The side of fruit was a prepackaged container of Dole Mixed Fruit still in the original container.  Staff was friendly and the restaurant clean and they have a lot of other activities during the week to appeal to families with small children but that did not do much for us.  The Charburger is worth giving it shot but little else does"}
{"text":"Burger and fries are great.  Not the best you will ever have, but definitely a quality burger.   The ease of ordering (by order slip) and ability to customize is nice.   Wings are good if you like mild.  Very big and crisp just a bit too tame for me heat wise.  Ask for them hotter if you can.    Will definitely go back.  Awesome staff."}
{"text":"It's amazing how many times we've been to Concord Mills and never really looked at the eating options across the street.  Unfortunately, this place probably won't bring me back.  First off, i would probably give the burgers 2 stars. i personally don't enjoy the charburger. When i screw up at home or forget i have burgers on the grill, that's when i end up with a charburger. It's not something i would request. Their fries were alright. They did seem like a fresh cut fry variety although i would like some seasoning on them. Not a large menu beyond the burgers, but if i end up here again, i might try the wings or even their hot dog sounded good. Since the burger came with a drink, i opted out of getting a beer which disappointed me as well.  We did get a chocolate milkshake and overall it didn't impress me. It tasted a lot like a Wendy's frosty (Not that it's bad, but it's cheaper at Wendy's).  The reasons they ended up with 3 stars:  -great, friendly service -outdoor seating -surprising variety of drafts (1554, fat tire and a few others) -$2 domestic on Saturday and Sunday (i think...check local listings) -They have a coupon in the Entertainment book for BOGO entree, so it was reasonably priced for my visit"}
{"text":"Food was unreal.  Was in town on a business trip and this was a home run for a quick lunch.  I usually dip my fry's in ranch, and this was the best ranch I have ever had. Beef was pure and cooked perfectly."}
{"text":"First time going here and had the special $1.99 1/4 pounder for lunch. I added fries and total was under 5 bucks. Pretty good deal. The burger was really small and pretty tasty, but it reminded me exactly of eating a Burger King Whopper, but smaller. The fries could have been very good, but we're soggy. The service was friendly and fast, but I don't think the food was good enough for me to come back."}
{"text":"The restaurant is family perfect! They have a guy come in for entertaining the little ones with a magic card trick or shaping balloons into different shapes. The environment  is perfect clam and relaxing. The staff talks to everyone, makes sure your meal is perfect and sees if you need anything. They keep the restaurant clean and tidy. It would be great for any teen to work at. Jonny  will  personally come and talk to you when she is working!  I hope you really enjoy the restaurant."}
{"text":"If you're looking for a greasy burger and fries joint, this is the place to go. The burgers are good, greasy and very messy. The fries are also greasy but really good. It's the kind of thing that after you eat it you are totally disgusted with yourself but it was SO good going down!"}
{"text":"While craving a burger one evening , I remembered someone told me this place was great so I decided to give it a try. This is a place where your burger can be made to order, you will get a long slip of paper and check off everything you want and give to the cashier. You can dine in inside and also outside on a covered patio. They also have a bar area. The bar area is where you will order and pick up your food, but you can also sit and dine there too. They have beer on tap and a full menu. I ordered a basic cheeseburger and fries. The burger was okay, the wait was disappointing and in my mind unreasonable. Despite the wait, the fries were really good and I anticipate I will give them another try, possibly during the lunch hour."}
{"text":"Took advantage of their $2 burger special. The burgers were not the best I've ever had but not bad either. They seem to have different specials throughout the week and I would def. swing by again for the burger special."}
{"text":"Came to visit Concord, NC for the 1st time this weekend. Made a stop in here Sunday after leaving the Concord Mills mall. I had Philly Chicken basket and fiancé had cheese burger basket. We also added 6 boneless wings since the special on Sunday is .55 wings. The food was great and the boneless wings was everything that I been wanting. Food was so good we came back the next day before we went back home to TN!"}
{"text":"Great food. Wings are crispy like I like and well sauced. Like the idea of ordering by slip so you can pick and choose. Very friendly staff. Will definitely return."}
{"text":"While on our way to Great Wolf Lodge, my ten-year-old son and I dropped by for a burger. We don't have one of these restaurants in our sleepy little town of Greensboro, so thought I'd try something new. When we got there it was about noon on Monday and was quite crowded. Unfamiliar with the place, we foolishly just sat down at the bar. When the cashier finally noticed we hadn't fought through the proper line to give our order, she politely came over and handed us our order forms. Even my son, who was watching the Olympics on TV said, \"Dad, what's taking so long?\" After THIRTY minutes our food came out. While I was waiting, I noticed that there were only two cooks in the tiny kitchen and the one cashier/waitress. I counted: FIFTY (really, 50) people in the restaurant. Popular? I don't know why. The specialty burgers are just like the overlooked hockey pucks your idiot neighbor down the street cooks while he's drinking one too many six-packs. The onion rings WERE real (and really hot) but that just simply doesn't make up for the rest of the food. The waitress/cashier took my son's meal off the bill without me asking. She WAS very nice... and apologetic. Midway through our wait, I noticed what appeared to be the manager slink out the front door, giving a feeble wave to the horribly over-worked waitress. If this had been MY franchise, I would've been out there helping out. Guys like this are losers -- this place won't be there forever. And another odd observation: Do NOT sit at the bar... It is designed so that you cannot reach your food! There's a sloped edge to it that's about 6 ~ 8 inches wide... You can't put your food basket on it so you have to lean waaaay over the edge to get to your food. Bizarre design flaw (and yes, I *am* a designer). I'm only giving it two stars for the nice woman and the onion rings. Perhaps I should've given it one."}
{"text":"One of the few places I've eaten where the burger actually looks like the one on the menu. There are a lot of restaurants in Charlotte that serves great burgers. But for me, the best burger i've had from any bar or restaurant was from Foster's Grille. What sets Foster's apart is that their burgers are cooked on a real grill over open flames which sears the outside of the burger, seals in the juices and adds a bit of smokiness.  Anybody who has tried to grill burgers on their grill at home would know that trying to get acheive a perfect sear is a tricky process, there's a thin line between a greasy undercooked burger and a burnt chunk of meat that looks more like a lump of coal than a burger. All burgers are made in hefty 1/2 pound patties and I was told by the manager that the patties are made from not only chuck, but also a mix of prime cuts of beef. I also like how the pickles and tomatoes are sliced thick, compared to other restaurants which I think slice their veggies with a lazer to cut them so thin.   I love hand-cut fries, and Foster's Grille serves them as good as they can be. Idaho potatoes are cut fresh every morning, made to order and are served lightly seasoned with sea salt. Malt Vinegar is available at every table, right next to the ketchup, a defection from the all-american theme which could almost be regarded as treasonable, but I just hate ketchup so much that i prefer the malt vinegar...back to my review. Fries are great.  Overall, this restaurant is a place I would visit on a regualar basis. The staff is friendly, restaurant is clean, family friendly atmosphere classic american decor, indoor and outdoor seating, lighting is bright,  and daily specials like free milkshakes, 50¢ wings, $2 pints, and bottomless fry-days. Prices are comparable to five guys The only thing that stopped me from giving Foster's Grille five stars is that they use gas instead of charcoal to grill the burgers, when it comes to grilling you can't beat the flavor that wood and charcoal provides. But other than that, Foster's Grille is a great place to eat"}
{"text":"Great burgers. Just make sure you tell them how you want your burger cook."}
{"text":"Not a bad place.  The burger was good I'd have another but still not in the top 5 in Charlotte.  Fries where not so good but the onion rings where great.  Mini me loved the ballon guy."}
{"text":"Stupid concept. Horrible food. Poor service. First time here so we sit down and only after waiting forever are we told how the ordering process works. We had to get up and order at the counter by each filling out a piece of paper. No this is not a sushi bar. No item descriptions and limited choices. Should have left at this point.   After a somewhat long wait our food was finally ready. I had a burger, my brother had wings. Both were bland and gross. The bread was stale and fell apart. The meat tasted like propane and the lettuce and tomato was slimy. The wings looked like they had been been fried in old oil and tasted like leather.   With so many better options just down the road; why on earth would you eat here? It's not like it was cheap either. Not expensive, but for a limited service restaurant with poor food you'd be better off spending your $$ elsewhere."}
{"text":"The burger was tasty but I was uneasy about toppings.  If you wanted extra mayo and ketchup the girl at the counter said that was extra.  I understand lettuce and tomatoes being extra, but condiments?  I don't think she had any idea what was going on since they had ketchup at the tables.  The milkshakes are more like malts - they are very thick.  Fries - they can be excellent or awful.  One tray of fries were crispy, the side of fries were soggy.  Co-eater tolerates soggy fries, I wanted to send them back.  I think you have to be pushy to make certain you get the quality of fries you want - they know how to make them, but they are inconsistent about it.  Salad - plenty of salad for a side salad, almost like a main course.  I am not the person you want reviewing salads anyhow.  When I eat vegetables I am full but hungry and always very salty afterwards.  I would come back again.  You can really taste the char on the burger."}
{"text":"We were in the area visiting family and decided to stop here. Very clean and friendly. I had the cheese steak and the wife and kids had burgers. We were all very pleased to say the least."}
{"text":"This little strip mall is across the street from Concord Mills, which means you have probably driven past a number of times - I know I have.  We decided to stop one night to see if the burgers were worthwhile.  Though we're still full from the experience, I think we're still deciding.  When you go in, you get a sheet where you place your order - check off the burger you want, as well as the toppings, and hand it to the cashier.  With your burger, you'll get fries and a drink, which helps with the price (it's a bit pricey).  The burgers are also huge (1/2 pound prior to cooking), which also assists with the price.  If you don't think you can handle the whole thing, you might want to consider the kids meal, which is half the size.  Or try a hot dog or a garden burger or something.  Staff at Foster's is friendly, but the location is a bit unfriendly.  The problem is that it's completely open - the noise from other patrons carries way too much, so that you often can't hear yourself, your friends or even the other people.  Just way too much noise in the place.  That's not always a bad thing, but it was so bad that it felt like leaving a really loud concert.  The food wasn't bad, but it wasn't great either.  While I'm still stuffed, and that can be a good thing, it just wasn't outstanding.  Because of the amount of food, I didn't feel ripped off, but it certainly wasn't the best burger that I had.  Friday nights you can get endless fries, but I wasn't even able to finish what I had - no way would I have been able to get more."}
{"text":"For the longest time, I assumed this was a bar & grill like Ale House. Just yesterday I was craving hot dogs and this place came up in my search. This is actually a decent fast food restaurant.  My husband and I went in here and the lady taking the order showed us how to order on the little personal order forms. I got a hot dog and my husband got a philly chicken sandwich. Both our sandwiches were delicious. The hot dogs are giant! While we waited, I noticed that they also make old school thick milkshakes, something I will try in the future. They're also known for their chargrilled burgers, which I'm looking forward to trying as well. Service was friendly and I really liked the lady at the counter. She was very polite and helpful."}
{"text":"Good burgers, good fries, good wings, and cold beer.  The owner always seems to have something interesting on tap.  Family atmosphere, although it can be a little pricy at times for what you get.  Still, I enjoy going there for a good burger and a beer."}
{"text":"I'm going to give this three stars because of the price and atmosphere. The food is damn good but it is expensive compared to what I'm use to (college). They have a good amount of drafts, but I would check out the tavern right next door if you are looking for a bar. The fries are only good when they are hot. This place to me is a little more better than a fast food joint, yet not classy enough that I would take a date to."}
{"text":"Beer, burgers and cheese fries?! This is a good start! First off, it looks like every other burger place and I didnt expect anything more than a regular burger and fries. Kinda had a five guys feel but with race car stuff. I ordered a buffalo chicken sandwich with fries and a soda. The chicken was very thick and juicy. The fries were fresh cut, which is my fave! My husband got a burger and was nice enough to let me try it, it was also very thick and juicy. I was very impressed! 2 meals came out to $20, not bad at all considering we would probably spend that at a fast food joint and this was waaay better. The meals filled us up (and we are big eatters) so we didnt have room for dessert but we were dying to try a milkshake, maybe next time! They also have beer, wings, cheese or chili fries and kids meals. I saw a sign for something about a lids night and a $1.99 burger on one day of the week. The staff was courteous. Overall no complaints and pretty impressive for a fast food type burger place."}
{"text":"Awesome family-owned restaurant. Very polite, friendly faces, great service! Think HWY 55 (Formerly called Andy's) but better!"}
{"text":"Foster's Grille is just an OK spot to grab a burger. Burgers are good but not great and not worth the price you pay. It is basically a build your own burger concept. Our last visit was lackluster. Fries were overcooked and simply terrible. The cheesesteak isn't flavorful at all. The bacon cheeseburger was descent (according to the fiance).   There are other great places to get burgers. Not really impressed by Foster's."}
{"text":"This place was recommended by a woman at the car dealership. It was OK. The staff was very friendly and helpful. I would go back if I'm in the area again."}
{"text":"Great place, very nice customer service and I think it ranks right up there with the top burgers in Charlotte!  Buns are always fresh and the homemade fries are amazing, especially with a little vinegar!    One time after a 4th of July parade a bunch of pirates from the parade were in there eating as well and being a little loud and toasting each other, they gave my daughter a gold piece that she just thought was awesome, but my point with this story is that this place just offers this kind of atmosphere where you can feel comfortable getting to know other people."}
{"text":"Great burger place. Meaty fries. They actually cooked my burger medium as asked. Friendly service. Fries are very fresh. Better than 5 guys. Would recommend."}
{"text":"Great concept and THE BEST homemade fresh fries EVER!!! Great sandwiches and burgers at a respectable price. Need to improve drink selections and desserts"}
{"text":"These people that give this place 3 stars need to try it again. My husband, my son and I have been here about 5 times in the last few months and it is consistently delicious. Burgers have great flavor. The grilled chicken sandwiches are very moist and tender. The fries and onion rings are excellent! Everyone we've taken there has loved it. We will continue to come back. Great service and very friendly staff too!"}
{"text":"OMG!   My new favorite burger restaurant.  We met our son there for dinner and I was thrilled how well the burger was.  The burger can be custom designed."}
{"text":"This place was good. Food came out fast and the fries were delicious. The burger was good. I did add bacon and cheddar cheese to mine. They charbroil all burgers so you will get it cooked. But overall a great experience and the staff was extremely helpful and friendly."}
{"text":"I gave it 2 stars because the burger was pretty good and the service wasn't bad at all. Kid at the counter was polite and helped out. We also had what looked to be an owner or manager in regular street clothes do a table visit.   The bad: the place was filthy. Counter top was sticky with old food in corners. Napkin dispensers, bottles and the 3 tables we moved around too were all dirty. Men's bathroom was out of soap. Place could use a deep cleaning and some management to keep it clean."}
{"text":"I am always up for a new place, especially one that offers burgers and wings.  Came here after a movie and my partner in crime wanted wings... I don't like the 2 wings joints down the road so I was scrambling for an alternative. Foster's Grille to the rescue! So the decor is a bit confusing, it is a potpourri of sports stuffs.  It's very mom & pop feel yet I was a little surprised by the price. Burger itself was over $5. After adding cheese and bacon that's $7 and still haven't had side or drink.  All orders are self customized. I ended up with the burger special which was the egg burger with bacon and cheese. I also tried his wings and fries. Overall good food.  Very friendly service.  They also offer turkey and veggie burger, hot dog, boneless wings and cheesesteak etc.  And beer battered onion rings (not the corn meal ones).  I think it's a great joint.  It has a little something something for everyone."}
{"text":"Wow, what a find! It is rare I find myself in this neck of the woods, but after my new teenager's birthday party he and his friends were hungry for some burgers and this place hit the spot. The burger is outstanding and I know I've paid twice as much elsewhere for less quality. I look forward to my next visit and was pleasantly surprised by how affordable it was given the food quality and quantity. Oh, and make sure you get an order of fries!"}
{"text":"Burger was tasty , but too much bun Fries looked good, but had no flavor even after salt, malt vinegar and ketchup Overpriced. I'd choose Cook Out over here."}
{"text":"Foster's Grille was a bit of a disappointment for me.  The food was decent but it seemed to take forever and was incredibly overpriced.  Upon entering this low key establishment, you walk to the counter and order via a checklist style ticket.  You pay and then head to your table where the meal is eventually delivered to you.  You eat surrounded by distasteful decor hanging from the ceiling and the one employee yells from the counter to ask you, \"How's your burger?\"  Burgers and shakes.  It's not difficult, therefore easily outdone.  Meh."}
{"text":"Been coming here since it opened and still a favorite burger joint, and I dont even eat burgers. lol   The grilled chicken sandwich is good and has a good char-grilled flavor.  The fries are exceptional!!!!  I can just have a bucket of those fries, they are so good. My husband absolutely loves the burgers and all our out-of-towner friends and family whom we have brought here have thoroughly enjoyed their burger. Love the options list and that you get to be specific about what you want on your sandwich on your individual order form.  Saves the trouble and disappointment of having to return your food when done wrong. Great casual family place."}
{"text":"OK returned a second time and cheeseburger was really good this time , not over cooked and Onion rings were excellant.  But for goodness sakes, at a place you have to order your food at a counter, a single cheeseburger, onion rings and a diet coke was $11.00 ?????????"}
{"text":"Stopped here for lunch today.  Had a turkey burger and it was great.  Ordering at the counter was a new experience, but at least it doesn't make me feel obligated to tip.  Order tickets have all the sandwiches and orders on it..  you end up circling your order and all the toppings you want on it.  I splurged and went with the onion rings instead of fries.  They were pretty good.  I'd say this this a good lunch option place (especially for those that work around the Concord Mills area).  There is a nice outdoor patio and plenty of places to park.  There wasn't much of a lunch rush so it was pretty calm in the dining room.  Really relaxed and laid back feel.  I'll come back to try a real char burger... but the turkey burger was very good!"}
