{"text":"I'm usually not a fan of airport food but 4 peaks was great the chicken breakfast enchiladas were great the portion size was great and they were quick but the best part was that they didn't overprice the food !! I will stop here everytime !!! The service was also friendly !! The lifted kilt ale was also delicious !"}
{"text":"There's a lot of worst places to eat in Sky Harbor. Four Peaks is a premium brewery in town that's usually packed with the college crowd. In the airport it's packed with the in-the-know crowd.   Expect to wait for 20 minutes around 5:00pm but it's worth it. Chef's salad, fish and chips and a healthy burger are great compliments to the Kilt Lifter, Peach Ale or Wheat that excel on tap.   If you've got 30 minutes then take the time to chill here. Life's too short to let travel mess up your day."}
{"text":"Busiest of eateries in secA in PHX, hostess has a nonchalant attitude about customers. Floor manger looks confused and lost,  not cordial to customers. Wait staff upbeat and customer oriented beers are cold and great. Good is fresh and good service would come back"}
{"text":"Stopped here between flights for an afternoon snack. Pretty lively spot, loud music playing throughout the restaurant.  Try the Arizona Chicken Rolls with Chipotle Ranch instead of the sweet jalapeño sauce."}
{"text":"This place isn't bad considering the crappy airport it is in. I had fish and chips which were good. Not the best fish ever but still tasty. It also came it super quick and was nice and hot. The fries though were really good. I was a bit disappointed that they didn't have a menu for their wine. Not a big deal but I hate having to decide so quickly because the server is reciting it for me. Same with the dessert menu which only had two kinds of cheesecake..it is a pub I know but I can still be sad. The price wasn't too bad either. Ten dollars and change for my meal. The waitress was great. I had a long layover and brought a book with me, which I assume she noticed because she did not rush nor harass me. Made sure I was okay from time to time. All in all I am very happy. Will return if I must go through the Phoenix airport again."}
{"text":"If you have to spend 7 hours at the Phoenix Airport, this is the place to park your behind! Nice people, good food and better than average beer. The Arizona Chicken wraps were awesome! Try the peach beer--you won't be disappointed!"}
{"text":"As my currently upset stomach can attest, I really regret stopping by the Four Peaks Brewery restaurant for breakfast before my flight. The food was identical to what you get for a continental breakfast in a hotel, except at a hotel it's warm. My food was all cold and mushy. Even the toast was mushy. How do you mess up toast??? How hard is it to freshly toast bread before bringing it to me?  This restaurant should either take their breakfast offering up a notch or stop serving breakfast. Their current offering is only going to turn away new customers."}
{"text":"Fast service, cold beer, friendly help, large portions not what you expect at airport, refreshing and good"}
{"text":"WORST EXPERIENCE EVER.  I waited for. 45 minutes for the food that never came .  The waiter then has the audacity to tell me that he won't charge me for the food (that never came).  Shameful.  Please stay away.  There are other eateries next to it.  Deserves NO stars."}
{"text":"I travel every week and it's hard to get a good meal while traveling. The waitress discouraged me from my current choice and recommended their amazing big and fresh salad. After charging me $2.25 for adding egg to my 12.99 salad, they gave me a pitiful side salad. Took three attempts to get what I ordered and it still wasn't correct. I gave up walked away and threw it in trash. Hated to waste, but I was so frustrated and it was time to board so I didn't get to eat it."}
{"text":"Best airport restaurant I've ever been in!  Great prices, great food.  Our server Michael was great, gave good suggestions and provided awesome service!  Would definitely recommend to anyone traveling through Phoenix airport.  Kudos to Michael, thanks!"}
{"text":"Thank you for being on point with craft beer! IPAs are delicious and their oatmeal stout is delicious plus it's on nitro. The bartender Floyd is extremely helpful. I've never seen anything in Phoenix but the airport... I'm sure glad I know this is here now! I saw that people wanted the kilt lifter and it's here now. Lastly their pins are only $5, which by the way... Per oz they are cheaper than the 20 oz."}
{"text":"This place is garbage, ordered two drinks (double shot gin and sodas) and this joker gave us soda water with a lime. Spend your $25 someplace else in this airport! Waste of time."}
{"text":"I rarely ever review places even if the service or food was bad, but I had to make an exception here.  I came here for breakfast and got the Brewhaus Breakfast....  $12 for literally the same powdered eggs, hash browns, and fatty bacon you get from a holiday inn continental breakfast."}
{"text":"I have been here a few times. Good food and good beer!  There are power outlets at the bar and some of the tables.  The service is always a challenge though."}
{"text":"I went here a few weeks ago to celebrate my Fiance's friends promotion. It's obviously hot in AZ in July so it was slightly uncomfortable in Four Peaks Brewery since they use swamp coolers. That actually did not bother me very much because they had an ample amount of fans and the atmosphere of drinking a beer inside the brewery totally makes you get over it. The prices are very good in my opinion. The options they have were overwhelming, in a good way! I had such a hard time picking out an appetizer. I ended up ordering a pitcher of one of their fruity beers. I can't remember what it was called, but it was very good. I got the soft pretzel and it came with 2 dips. I guess one was supposed to be a jack cheddar cheese an the other was a dijon mustard. The pretzel was good, but the dipping sauces were terrible! The cheese sauce was so runny and didn't even taste good. I was surprised to hear that this was their \"new sauce\" for the pretzels. Bleh. The dijon mustard was alright. I am not a mustard fan at all, but I REALLY like the dijon mustard that Uncle Bear's has for their soft pretzels and I was hoping for something similar. That's the only reason I gave them 4 stars instead of 5. I would go back to Four Peaks Brewing Company in a heart beat. Our server handled our large table very well. We had a great time!"}
{"text":"Probably the worst fish and chips I've ever had.  The fish was more like fish sticks.  After ordering it was on the table in less than 2 minutes, which made me think it was microwaved.  Not to mention it was soggy and rubbery.  Service was fine, nothing great.  The manager asked how things were but was already on to the next table before I could answer.  Beer was good but would never go back for the food."}
{"text":"Old avocado, water spilt on table, bland beans. Sorry, meant to press 2 stars, not 3."}
{"text":"This was going to be a 5 star review. Clearly the tastiest airport meal I have had, and I travel a lot. I ordered the salmon BLT (without bacon). It was amazing. Toward the end of my sandwich I found a piece of bacon on my plate. Very upsetting since I don't eat meat. I'm going to assume and hope they put the bacon on them took it off - and just left a crumb. When I asked the bartender he said that's probably what happened. Let's hope."}
{"text":"Good fare overall, especially at the airport.  Friendly staff as well.  We ordered a turkey club and a fish & chips plate.  The former sat on the kitchen counter while the cook staff struggled mightily to produce the latter.  All the while, we had to listen to someone in the kitchen yell \"runner!\" every couple of minutes.  So we may eat here again, but only because it's the airport."}
{"text":"20 oz. Hop Knot and blackened salmon BLT = amazing!!! Great service, friendly bartenders and beer selection on point. Definitely stopping by whenever I travel through PHX."}
{"text":"I just ate at Four Peaks Brewing Company at the Phoenix Airport. The Blue Cheese Burger with Bacon was surprisingly delicious, not lacking in Blue Cheese or Bacon. The Oatmeal Stout delivered. Ask for it medium. However, the real treat was the server April Guardiola. Her service was amazing. Her smile could put any traveler at ease. I spoke to April about her wonderful demeanor and enjoyed hearing her perspective on life. I will definitely look for April the next time I'm in PHX."}
{"text":"Great restaurant, especially for the airport. The food here is good and reasonably priced. All the servers are nice, but service can be slow, so don't come here if you want to be out very quickly. However, they will give you your check right after you order so you can pay and leave right after you eat. This is a great place to come when you are at the airport because you can forget that you are at the airport and feel refreshed when you finish. If you're at Sky Harbor, definitely check this place out."}
{"text":"The main thing going for this place is the beer. Duh, its a brewery. It's still an airport with airport food and airport people. The servers and hostess seemed unhappy and hurried. I overheard at multiple tables that they were out of things. I ordered a soup and wilted salad. Glad I didn't spend more on overpriced airport fare. Tip: stick with the beer!"}
{"text":"Pretty sure they closed before they were supposed to. I just got in from my flight and they are supposed to be open because our arriving flight was the last... SO MAD!"}
{"text":"I love Four Peaks but this location has let me down. Sat at my extremely dirty table and was told it would be wiped down. My waitress came by and didn't say hello, all she said was \"what do you want\". I asked for a peach ale which she came back with promptly. However, my beer was warm and my glass was sticky. I was ready to order food but she took the menu and silverware right out of my hands and walked away. Guess all I get is a peach ale at this location. Also, no one ever wiped down the table. Disappointing, Four Peaks."}
{"text":"Normally, a pretty reliable place in PHX T4 to get a beer & a bite to eat.  However, today was horrible.  After watching for a bit, it was clear that they were understaffed.  As a result, late service to the table to get my drink order, 50 minutes to get an appetizer, and my server running his ass off handing too many tables by himself.  I was unfair to him.    The problem wasn't him, it was the management today.  The woman was wearing a pink sweater & grey pants today and I hope she reads this.  Not sure what you were doing on your phone all that time (it looked like work), or spending time at the pass bs'ing with the kitchen staff, or taking pictures of other servers, but while your head was down doing all that, your restaurant was falling apart.  Your staff or your customers shouldn't have to tell when things are bad, it's your job to know.  You were physically in the restaurant and I saw you look up maybe a handful of times to the floor.  Unacceptable!  Especially when you know you're short handed!  You value proposition as an airport brewery/restaurant is to serve beer or food and do it quickly!  Your restaurant failed today, your staff floundered, & your customers got treated poorly today because of you!"}
{"text":"Gross breakfast. They only serve breakfast and apps until 10am. When traveling and on central time that's noon. Lunch items would be nice. Anyways. Tried to improvise but made the worst choice possible, chicken rolls. Gross. Husband got a quesadilla. How do you mess that up. Also barely swallowable. The waitress was super nice. I liked the beers. I suggest you make this a beer only place don't eat here"}
{"text":"Best airport breakfast!  French toast includes fresh fruit- melon was soft and sweet, not the usual colored rocks. Hash browns have plenty of red and green sweet peppers.   Coffee good. Eggs not over cooked. Highly recommended if you are out in A concourse. Seating is limited for table service but you can get to go and sit in the adjoining area. Counter service (Kimberly) very friendly and professional."}
{"text":"Daniel O was great! I was seated quickly and Bloody Mary's were delivered in no time! Yummy stuff! Kinda pricey though.."}
{"text":"Amazing beer selection if you're into craft style beers.  Had the chicken quesadilla which I now higly recommend.  Great place if you have 20 minutes or a few hours!"}
{"text":"Great food. Great beer great service and go VIKINGS.  I had to wear a packers jersey so it was an embarrassment but I had a great time."}
{"text":"Food was mediocre at best and the gentleman behind the bar was rude when i ask for the check he pointed to the glass in front of me and rudely said its right there. Then as i already had my card out he took forever about 10 minutes to let me pay instead he checked his phone and talked to every one else at the bar including the staff. All i wanted to do was pay i wont be going back one of the worst experiences i have ever had"}
{"text":"Booooooo no good!!! We got 2 soda waters for 25$ we asked if there was any gin in them he said 2 shots of Bombay in each. YEAHHHH RIGHT!!! 2 Tall glasses of soda with a crusty lime."}
{"text":"This was a great pit stop during our lay over. The french dip was great and so are the chicken sandwiches. I recommend this place if your waiting for a flight and your hungry"}
{"text":"We just arrived off our flight from Hawaii, and stopped here immediately since the food looked and smelled so good for breakfast.  Too bad, we will never get a chance to see if the smell of the food matches its taste.  We waited about 3-5 minutes for the hostess to appear and seat us. When she did seat us we were sat in a section that had a less than pleasant waitress that preferred to stare at us rather than wait on us.  Now please keep in mind it is 630am on a Sunday, and the restaurant is about 1/4 full.  After making eye contact with the waitress twice, and watching her stare at us for about 3-5 minutes, my wife and I left, and get this, no one stopped or said anything to us. Wouldn't recommend this especially if you're catching a connecting flight. But if you've got time on your hands you'll definitely be waiting for everything in this restaurant."}
{"text":"Awesome service!!!   Great manager, good food, quick food turn around and great local microbrews. Will definitely come here next time we are in Phoenix airport."}
{"text":"Food was fine. Beer was good. Service was not particularly friendly or attentive. Person who came in after us got his food before us. Luckily we were not in a hurry so I didn't make a fuss. Overall what you'd expect from an airport restaurant."}
{"text":"Any restaurant in an airport should have figured out that all of their customers are scheduled to be somewhere else in the next hour or less. 30 minutes to get a simple to go order is bullshit. Bland food wrapped in a tortilla that was advertised as beer bread shouldn't take as long as a soufflé. Next time I'll try Humble Pie next door. Or Pei Wei. Or deluxe burger. But not Four Peaks."}
{"text":"Just got turned away after walking from the B gates because they \"closed at 9\" and it's 8:58 and the bar is full. Multiple places show they close at 10 or 11. Completely unacceptable."}
{"text":"I realized it's a beer bar but for those that do not drink beer, it's sub par.  2 wines only to choose from.   The tonic was flat.  The waitress walked passed 3 times and never stopped to take my order."}
{"text":"Friendly & fast service Good thick burgers served with crispy  steak fries. Real lettuce, tomato & onion.  Order came out faster than expected. ... really good for airport food."}
{"text":"Their service sucks, possibly because its in an airport.  Waited too long for the food and the food was bland."}
{"text":"Not one to complain I usually eat here while waiting for flight out.  Usually love their Blacken Salmon BLT. this trip not so much.  The ice tea was murky sent first one back second one went back too. The bacon on the sandwicwas raw, seriously undercooked.  The blacken salmon must have been used to soak up the grease from a spill.  To top it off it took over 20 minutes to be served this.  Sad the fries were good but I was too grossed out to enjoy.  The server was nice tho"}
{"text":"Worst breakfast I have had in some time. Brewers breakfast, consisted of cold eggs that seemed like they were sitting in water, cold bacon, toast equally as cold, and country potatoes that are from a pre-mix!!! The quality needs to be better!! Not impressed at all... Needs a culinary presence for sure."}
{"text":"Great beer and food that's just as good! I can definitely smell what they're cooking!...because I live next door."}
{"text":"I haven't even received my food yet and I'm writing a bad review. This place has the worst, rudest bar tender I have encountered. Ignores new customers, waits on customers out of order, unhelpful and surly answering questions, treats everyone like they are inconveniencing her, doesn't look at customers when talking to them and gives short, dismissive response.   The hostess was also less than pleasant.  Final straw - half a slice of cheese on a cheese burger. Are kidding me? Burger was mediocre - lots of gristle. Fries tasted like cardboard.   Small bonus the other bartender seems to know what he's doing. Pouring two beers at once. Hustling. Smiling. Maybe I just sat on the wrong side of the bar.   I fly through Phoenix every week. The food in the airport has declined over the past 4 years. I won't eat here again."}
{"text":"Dear Airport Four Peaks,  Please include the drink prices on your menu.   Ordered a listed mixed drink, and was completely shocked when the bill came. $16.25?! Your beers aren't wildly marked up, so I just *assumed* a mixed drink would be treated similarly.   Unfortunately there's a social stigma on enquiring the price of a drink, so as to not look like a stingy penny counter, I just ordered in good confidence that it would be a reasonable cost. Now I just feel like you've taken me for a ride."}
{"text":"Negative 5 stars would be a great rating for this place for one reason only.  The waitress had the disposition of a well digger in the middle of rainy season. She was short, rude, and when confronted, maintained that disposition.  I've never had worse customer service in my life. My advice to Four Peaks HR team would be to better screen your staff in uniform services, i.e. wait staff before putting them on the floor solo. I know there are rotten eggs from time to time in life, but this was such a bad experience, that  I won't waste more time or money (airport food is usually priced higher than the same food at a food court) at this place.  Try Matt's Big Breakfast. At least they smile when taking your order.  I will say this, my service improved after I whipped out yelp and started my review. :("}
{"text":"The beer was great and reasonably priced for an airport. I highly recommend the pretzels and cheese soup with a raj."}
{"text":"Airport terminal location pretty fast paced. Beer is great as expected, burger and fries could have been hotter than was served, service is yet to be desired. Had to ask for napkin and silverware. Not very friendly either."}
{"text":"They were quick to seat while waiting for a flight.  The oven was on the fritz so it limited our choices a bit.  Hubby left his wallet and someone came out into the termimal to find us!"}
{"text":"Was here on a layover and service from bartender and waiter was horrible. If they work for tips they do not care."}
{"text":"No better service or prices at any airport than here. Staff is very friendly and attentive. Great work to everyone working here."}
{"text":"The breakfast was great!  Beer battered egg bacon cheese etc.   service was slow and not great so only giving 4 stars"}
{"text":"Sweet spot of food, libations, and your next flight out of town.  I don't always fly out of the A gates at Sky Harbor, but when I do I make sure to visit 4Peaks."}
{"text":"Powdered eggs. First time ever I've been served powdered eggs in a restaurant that wasn't a buffet. This may be a good brewery and/or bar. Just a terrible restaurant. Service is inconsistent. Came here a year ago and service was terrible. Service this time was better. Won't be coming back for a third try."}
{"text":"Bought a sandwich from the walk up togo part of the restaurant. The restaurant was almost empty and the time so I sat down at one of the stools at the outside rail of the restaurant. One of the servers came over and told me I would have to eat the sandwich that I had just bought from his establishment on the other side of the rail. He said they were closing. I stood outside and watched him continue to serve people. I had planned on ordering a beer or two while I waited for my connecting flight but now I won't go back!"}
{"text":"Excellent service with friendly staff. Flew out early in the morning and they still served me breakfast 20 minutes before they fully opened! Excellent job on customer service."}
{"text":"There aren't many options in this part of the airport, but I recommend any other choice. The \"express\" lane took 15 minutes--ten minutes longer than the Deluxe Burger restaurant a few feet away. When my burger came, it was missing the $1.50 bacon I'd ordered on it. The waitress was also rude about forgetting the bacon. When I got my burger back, there was a LONG HAIR on the pepper jack cheese. Disgusting. To top it all off, the burger and fries didn't look appetizing at all anyway. Horrible experience. I would never go there again."}
{"text":"Heh, It's airport fare quick and easy nothing special nothing terrible."}
{"text":"If you get Laura R as a server, ask for another. Should there be a delay, wrong plate delivered, or misunderstanding - all of which occurred on our visit - she totally shirks any personal responsibility. Laura made us feel guilty for her error and threw other servers under the bus for the kitchen's errors. Strangely, she's got this spilt personality / workin-for-tips thing going for her as well, so she flip flops between \"not my fault\" and \"no problem sweetie\" kind of manic behavior."}
{"text":"Between flights, we stopped for dinner.  Service was quick...just what you want in an airport restaurant.  - regular cheeseburger and fries with pepper jack cheese - popper burger - chef salad  The burgers tasted charbroiled (yum) and we were all pleased with our selections!"}
{"text":"Don't waste your time. If you can get past the bad service the food is still terrible. I ordered the French dip and it came out as pure fat and was under cooked. The cocktails are a VERY light pour and the wait staff acts as though the patrons are an inconvenience. The person next to me, after waiting several minutes for a beer he ordered then had to ask for utensils for his meal and the server acted as though he was asked to move a mountain. Very disappointing all the way around. Never again! I'll settle for airplane peanuts."}
{"text":"Had a long layover in Phoenix, and I am not picky, nor do I expect a lot from airport amenities. We sat in the very busy restaurant and ordered food and a beer, both the service from Christina and the food/beers were good. We then still had two hours to kill, so we went to the bar and asked the bartender if she could switch one of the TVs to the Australian open tennis tournament. She was unwilling to do so, although there were only a few people at the bar, and one of the many TVs literally had nothing showing on it at the time."}
{"text":"The food was great.  They also have a great variety of beers to sample.  Ashley the bartender was very nice.  I would recommend this to anyone passing through Phoenix."}
{"text":"To the little brunette bar tender working Sunday at 5pm...you need to try harder at listening to the order customers give you, mine was wrong.  Also, try greeting your customers properly.  Me and the person next to me commented on your lack at service, not all the time but sometimes. Slow down, listen, be nice consistently and you will do great!"}
{"text":"The southwest burger is my favorite burger in the valley. Very juicy well worth the Money.  I would recommend having a Hop Not IPA to wash it down.    I would have given this place 5 stars but the happy has gone down hill over the past few years. With very little food options on the happy hour menu now!!"}
{"text":"Great selections of beer from the local micro brewery.  I only wish I had more time to eat. The menu offers a good selection of better than average airport food. Decent prices without gouging the travellers. Much appreciate the fast service, knowledgable staff, and beer descriptions."}
{"text":"Worst ever experience! Do not sit facing windows in late afternoon you will be blinded by hot AZ sun!"}
{"text":"When we showed up and we thought it was our waiter (guess it was the bus  and asked him to place our drinker and his response, \"you might want to tell that to your waiter\" and kept walking. That was one way to greet a customer. The flavor of the wings were good, but the chicken was over cooked and dry. The quesadilla was good."}
{"text":"This place rocks, went there because they had flights (I have trouble committing to 1 beer). Their beer was sooo good. the peach and pumpkin were my favorite and all their food was delicious!. I got the blackened salmon not. service was good, we did have a wait... probably a while longer because we wanted to sit outside."}
{"text":"After winter storm Cleon we ended up in Phoenix instead of Albuquerque. Ate lunch here and they had no problem switching out a meal when one of us changed out mind. The kilt-raiser beer was refreshing."}
{"text":"Ordered the cheeseburger TO GO in medium well. It was burnt and dry and tasteless. Waited for 30minutes for this. DO NOT ORDER IF YOU DONT HAVE ENOUGH TIME FOR YOUR FLIGHT. Waste of money."}
{"text":"French Toast was a great choice.  I would recommend everyone that likes breakfast try it at least once."}
{"text":"Don't be deceived by the hours. They close when they want. Tonight they decided to close at 9:30pm on a Saturday night."}
{"text":"Very disappointed  if you are going to offer a French dip for $11.99 then you really need to use quality meat. Half of my sandwich was so tough with gristle and fat it was inedible, the Au jus was barely warm and for an additional $1.69 I got 4 slivers of raw red onion--not grilled onions as advertised  Natasha offered me something else but I was over being hungry but a discount would have been nice.  I eat at Phx at least once a week -- not here again but the White Ale is great   I decided to give them another chance--service is the worst ever!  1star from 2  I truly believe they just don't care First off I witnessed 2 parties of 2 & 1 party of 3 seated before me  Finally I said to the hostess that I found it strange that I was still waiting as a party of 1 when the 2 parties of 2 were seated at small 2 tops. She seated me reluctantly but I waited forever to be served. The Southwest rolls were tasty but I had to ask for napkins and cutlery  There are other choices but this is the only choice in this concourse"}
{"text":"For what it is I would give it a 5! Stopped here early this morning before our flight took off and it was nice. I got there French toast breakfast which was good but the French toast was a little under cooked for me, it was soggy when it came out & than with the syrup on it, it made it a little worse. My boyfriend got the Brewers Breakfast was really good and we both LOVED it & the bacon! We hope to go to the actual restaurant when we get back from vacation, ambit will also keep this one in mind when we fly again!"}
{"text":"Very reasonably priced for airport food. $5.50 for a pint, which is unbeatable at any airport. $7.75 for a 20 ounce is a complete rip off. Do the math, it's not a good deal.  Stick to the pint and you will be happy. I was there on a super busy night and the service was still good. Beers were tasty, fish and chips came out super fast. Overall much better than what I expected at an airport bar."}
{"text":"Just stopped by on a quick whim to try the Kilt Lifter per a recommendation of a friend. The service was fast and that particular beer was good. Finding a seat was hard as it was crowded! But that is good, as the atmosphere was quite lively.  Will definitely return if I'm passing through this location again."}
{"text":"I've been using Yelp for three years now, and never posted a review until now because this place just served me the best burger and fries I have ever eaten. I can now die happy after this meal."}
{"text":"Airport bar and grill. The English pale is very good, bartender recommended. Ordered a turkey club and fries. Average airport price $10.99.  They do charge for extra condiments which is strange. Nice view our the Windows to watch the airplanes go by.portion size is healthy."}
{"text":"May be the nastiest customer service I have EVER encountered! NOT family friendly, mean and rude! How do you stop serving food at 8pm in an airport as busy as this one."}
{"text":"Out of all the over priced restaurants in the airport, how do you know which one to eat at? I choose this one because the menu items on the \"to go\" board sounded the most appetizing. I tried the Arizona Chicken Rolls. They were a pastry stuffed with grilled chicken, Anaheim chilies, pepper jack & cream cheese, lightly fried with sweet jalapeño dressing, that is what the menu advertised anyway.  What did it actually taste like? Surprisingly pretty good! It tasted more like chicken salad inside what looked like an egg roll, but did not taste like an egg roll. The pastry was good, fried crisp and had good flavor.  The jalapeño dressing was watery but had a slight bit of heat. The guy (Keith) who took my order was friendly and the server that waited on the table next to me was also nice.  The bar was full and there were plenty of wait staff so it was a well organized establishment, getting the folks in and out."}
{"text":"Four Peaks Brewing Company creates a fine IPA and offers a copious amount of bar cuisine to pair it with.   I stopped into Four Peaks Brewing Company before heading home to Orange County to have a beer and watch the last 4 innings of the Halos game. Four Peaks is an Arizona craft brewer that offers Seasonals along with 8 mainstay recipes and I have always been fond of their bitter yet hoppy Hop Knot IPA. With that in mind I ordered a pint along with an order of their Brickhouse Wings with Classic Buffalo Sauce.   The wings were surprisingly delicious but also astonishingly spicy. In fact, as I ate the heat became a bit overwhelming at times causing me to step up my drinking game (perhaps that was the whole idea in the first place). The skins were a tad too moist for my liking but serviceable at the very least and the sauce had a zesty perfume I admired. The hoppiness of the aforementioned IPA cut through the heat like a sword.   At $25.00 for the wings and 2 beers the large snack (or light meal, you decide) is not exactly cheap but given the circumstances, I was perfectly satisfied with my experience at Four Peaks Brewing Company."}
{"text":"It was another long day at the airport, so I decided to get some food from here during my layover. I ordered the chicken strips (to go), which was served with beer battered fries. It was supposed to take about 15 minutes, but ended up taking a little longer.   I saw other people ordering after me, getting their food first. I guess because they ordered salad, or mentioned that they were trying to catch a flight, that they got their stuff first?? I did ask for my food once I saw that happening. The guy that took my order did apologize for the delay though.  I finally got my food and thought that the chicken strips would be bigger, since the guy told that they were bigger and better than the wings I originally wanted to get. They used chicken breast and I was surprised that they were pretty juicy inside 8th street ale batter! I liked dipping them in the chipotle ranch sauce. The fries were cut in thick strips and really crunchy! They were extremely tasty and so enjoyable. I guess that's why they're famous here!"}
{"text":"For an airport establishment, this place is superb. One of the best bartenders I've met. Food above average, an the beer is very tasty. When your traveling at the Phoenix airport stop in have a cold one you won't be disappointed."}
{"text":"In the barren wasteland of rushed airport restaurant dining, Four Peaks' spinach salad and salmon BLT are an  amazingly wonderful respite.  Capped off with a kilt lifter ale - it makes the travel for work a little more bearable.  Great smiling staff, amazing flavor from both the salad & salmon.  No complaints and I'll definitely be back."}
{"text":"Okay, this is airport food and pricing.  That said, having a choice of better than average beers and decent food at an airport is enough to make me come back.  That and they were open late when I had a later plane change makes them a winner."}
{"text":"In the time I have been here, 3 complaints were made about there check, order, and time it took to be served. Every situation was handled with the waitresses talking crap about each costumer behind me where I was sitting. My meal was nothing special. The water was horrible. Sad"}
{"text":"Let me preface this review by saying I absolutely LOVE Four Peaks proper in Tempe. I love their food, beer, ambiance... I love the yoga events they hold and I've always had great service there. Obviously I'm not expecting a free yoga event here at the airport, but I have felt on multiple occasions that the service at the airport location is lacking. It may be due to the fact that I'm usually taking a red eye out of PHX and visit towards the end of the shift - after all, who's peppy when they've been at work all day? My Hop Knot was predictably cold and tasty, though a large beer ran me $10 which seemed excessive even for an airport bar. I didn't get a chance to eat at the most recent visit, but the chicken strips and salmon BLT are my absolute favorites!"}
{"text":"The bartender on my side of the bar, has a level of apathy that can only be comparable with Garfield the Cat in regards to Mondays. The enchiladas (breakfast) were actually delicious.. like beyond normal airport food delicious. The pint glasses are visibly dirty as the $18 Airport Martinis you can order here. Not sure if it's a hard water problem or the more likely fact that they never actually get scrubbed...like.. ever."}
{"text":"Stephen was our server, did not ask if we wanted refills. Had to get the manager Shurleen to get the soup and sandwich out of the kitchen.  To her credit, she did buy the food due to the lack of service and length of wait.  I will pass by the Four Peaks next time in terminal A of PHX.  Probably a great place for a beer!"}
{"text":"Sadly, Four Peaks' hours have become unreliable. One trip they are open until pretty much every flight has departed, another they night they are packing it up early and turning away customers. Hopefully this isn't a result of their recent sellout, but unfortunately the unreliability of this location's hours is a real turn off."}
{"text":"I have enjoyed Four Peeks at every location I have ever been to. This location is limited on the menu. What they do have is excellent. The bartender is exceptional. The location is convenient, if you are flying out of this terminal. You almost forget where you are because of the ambiance and quality service. I would say I will definitely look forward to a lay over in this terminal."}
{"text":"Service is a little slow, which is forgivable, but when I receive my breakfast cold, uggh. Can't have them take it back and cook you another at an airport if flight coming up soon and you don't want to risk them taking a long time."}
{"text":"Decently good food for an airport.  The Chicken Enchiladas were actually pretty good.  Or to rephrase that, better than I expected them to be.  Of course coming off of a red eye that served no meals just about anything tastes good.  Still, better than I expected."}
{"text":"The waitress was atrocious. She was condescending, curt and cold. The service was mediocre at best. All of this is absolutely unforgivable, especially with airport prices. Never again! Find some place better."}
{"text":"Best thing: It's open late? Selection is limited, service is meh and just don't get the pizza bread situation."}
{"text":"Had a layover in Phoenix and decided to grab a drink in the terminal, bar was full but finally found an open spot at the bar top here.  The lovely bartender politely greeted me and took my drink order and returned promptly. $20 for 2 doubles, SWEET! . Soon after multiple dirty glasses were continually dropped with in inches of me, several glasses at a time.  I thought... 'Well this is rude\". I let it go several times, scouted out the manager and guess what... Low and behold who could it be that now so rudely joins his rude and inappropriate staff by slamming a dirty pint glass in front of me? Yes the manager... Oh Game on... I politely approach him, confirmed he was in fact the manager and \"I would have thought you'd know better and have more respect to drop dirty empty glasses directly in front of a paying guest\".  His response \"well this is my service well, this is where I put them, where else could I put them\" my response... After pointing out other feasible options.. Oh it is? Well maybe you shouldn't have let me be served in your 'service well' without letting me know this minor detail.  I pointed out that it is in no way separated from the bar, no bar mats, no pitchers, just a plain old open bar top.  He said \"yes you shouldn't have been served here\". He walked away with his head down cowardly, taking no accountability, giving no apology.  I understand that this is a airport terminal and you don't get 'regulars' but this means MANAGEMENT/STAFF should strive to make the pitstop kinda experience more memorable and not be complete douchebags"}
{"text":"Short and sweet - decent sit down place at T4.   Long and winded - this place gets pretty busy during the busy hours but it's surprisingly efficient at handling the large crowds. They may get swamped at times but all in all they do a good job of crowd management. The food is decent but is not spectacular in any way. Some of the things are just too pretentious.   Go for kolsch beer. Nice and crisp."}
{"text":"Good drinks but could use some assistance in a better menu.  Bar food is stepping up their game all over the nations.  Four Peaks didn't get the message.  My breakfast was cold and the avocado was moist free.  The tortilla was still dripping flour on the outside and the potatoes were a hot, hard mess.  I did have a great coffee and Bailey's to their credit.  Not much else.  Service was courteous and he comped my breakfast."}
{"text":"Just a beer review- though everyone seemed to be ordering and enjoying the chicken quesadillas. I had the kilt lifter. Amazing ale. Wish I had more than an hour layover, would've sampled more!"}
{"text":"For an airport this was pretty good.  Horrible wine but it is a \"brewery\"- the salmon BLT was surprisingly good given that it's located in an airport."}
{"text":"I don't think I've ever done 1 star before. Maybe this place is a 2, but probably not. I had breakfast yesterday on a short layover (eggs, bacon, toast & potatoes). I never got the water I asked for a couple times, the food came out in 2 minutes (no way it was fresh), eggs were half hot and half cold, potatoes were barely warm (even though I asked for no potatoes) and service was non-existent. This was terrible, even by airport food standards... With a lot of hard work and dedication, this place could strive to achieve mediocrity!"}
{"text":"Great airport food, and fast, attentive service. The Brewers Breakfast is well rounded and delicious with fruit, bacon, eggs, potatoes, and toast. While 8th street location can never be matched, this is a great addition to the airport."}
{"text":"I ordered the Brewers Breakfast for $11.99. It comes with 2 scrambled eggs, sour dough toast, country potatoes and a side of fresh fruit. My flight boards in 30 minutes and the guy said it should be ready in 12 minutes and it was pretty much on time. I was able to make my flight :)"}
{"text":"On the way thru PHX. Stopped here for food. Continuing the airport trend of featuring local eateries, this location emulates the Four Peaks brew pub locations in the Phoenix area. It's an airport eatery, so the food to a degree is a pale comparison of the real locations. But they have the beer, as they carry the Sunbru. It's a kolsch and it's delicious any time of the year. I was disappointed to see tha InBev bought Four Peaks. The owners claim they retain full autonomy, but I doubt it will remain that way for long."}
{"text":"I don't know what it is with places lately. This is the second place in a month we have gone to, been seated, and then never been waited on. We had tons of servers walk past us and purposely not make eye contact it ignore us when we tried to talk to them. WTF?"}
{"text":"I read a lot of the reviews and the mixture of really like and hate struck me as odd given the positive experience I had. I was able to overlook some of the shortcomings as I got pretty good service and loved the beers. I had a bacon cheeseburger and it was quite good. If you calculate that this is in an airport and I got a chance to sample beers I loved that no doubt colored my opinion. I had no problems with my burger and in fact liked it a lot even compared to grill places I've been to lately. I even thought about making sure I get the redeye out of this terminal again so I could come back."}
{"text":"Salad was ok, salmon was fully burned, on both sides. Burned crust couldn't even be scratched away. And the server looks at it and says: \"doesn't it look awesome?\" I asked him if he was sure it was salmon since it could have been anything and he just found it funny...."}
{"text":"Unbelievable. Decide to close at 9:30pm despite a line at least 10 people deep and seats available. Reason given \"we lose more money than we make after 9:30\".  Idiots. Packed bar, only place open and they close. If they lose more meant than they make sue g a time when their place is packed, hate to think why quiet times do to the financials."}
{"text":"Don't typically expect much from airport food other than an expensive bill. This was a nice surprise, the fries are awesome, beer battered and a perfect size. The chicken tenders were pretty good, also beer battered but I think mine were a little burnt. The meal was only 10 bucks which is pretty decent especially for an airport."}
{"text":"Terrible service times. Small menus that don't compare to the actual restaurant locations. The bar is always too busy to process your check in a reasonable timeframe. 2 screwdrivers and a French dip was a $50 mistake of a place to have lunch before a long flight. If you enjoy premium priced items delivered very slowly with lip service from the staff, then this is the place for you. The French dip was tough and chewy, way over cooked & very fatty. No other bar located in that A gate area. Plan ahead. P.S. the pay your bill process is the dumbest system I've seen in any airport anywhere in the world!"}
{"text":"Great happy hour for beer.  Usually have some beers you don't find other places.  Food is typical for the genre."}
{"text":"Home of the worst food ever!  If you ever had that first sip or bite and just wanted to get up and walk away before it can get worse?  Yea. Yea. Gag worthy!  At least the service was...just okay. Sorry."}
{"text":"I only ordered a beer here, I had the Four Peaks Peach Ale. It was refreshing, just what I needed after a long day of traveling with more traveling chaos to come.   The service was great, fast and friendly. Most awesomely, it wasn't a rip off as is usual with anything at an airport. I believe it was $4 for a beer, I was very pleased.   I noticed a few of the food offerings, they all sounded good, and they were priced reasonably.   My only complaint was that I was in the C gates and this place is in A...that may mean nothing to you but trust me it's a flippin' far walk. Sure, it was worth it for the beer, mostly. However, it's possible I almost missed my flight, ok yes, I almost missed my flight cause I underestimated the far walk back to my gate. Again, I needed beer, it was worth walking past all the glaring faces to the back on the plane."}
{"text":"I stopped in here for breakfast around 6:45AM. I ordered the, \"Brewers Breakfast.\" It took about 10 mins and it was pretty good. The service was friendly and the place was clean. The price was around $10.00 with coffee. I would eat here again."}
{"text":"Beer was cold but the food was greasy.  The service was excellent though which makes up for a lot."}
{"text":"Now you wouldn't expect that any restaurant at the airport to score big on your list in terms of customer service and food quality.  But surprisingly, the Four Peaks at Sky Harbor was fantastic!  The service was exceptional, attentive and really felt like an 4-star restaurant tugged away in a large over-crowded airport.  I had ordered the chicken-beer-bread sandwich (Minus the chicken) - it was great that they allowed the customization.  This tasted just as well as ordering from the Tempe location.    I applaud the service and food quality at this airport location.  Next time you are near gate A - do try out Four Peaks at Sky Harbor.  Definitely an experience worth being part of; thanks guys for an amazing lunch experience."}
{"text":"The beer was good. The food was good. The service was really good. Imagine the number of people that cycle through the coolest airport joint in a  given day. The server I had was nice, personable and frankly gave a shit. That's all I ask. Good job."}
{"text":"I actually liked this place.  Had the stout and it was super nice.  Service was good also, especially as the couple next to me were complaining from the moment they sat down.  The chap was saying how he hated Arizona,  right at the end I asked him where he was from and he said F'ing Texas !!  I had the cheese burger and it came in a timely manner and as I said before beer was good.  For an airport joint I was pleasantly surprised.    Will deffo visit next time I'm in Phoenix airport."}
{"text":"I have been in the hospitality business for over 25 years, and the level of rudeness that I just experienced at Four Peaks Phoenix airport takes the cake....a server named Tiffany was an embarrassment to your organization.  15 minutes before opening, we got food and coffee from the adjoining grab and go to the tune of $50. We went to stand at the row of counters to drink our coffee, and Tiffany made it very clear that we were not welcome, and reached over my 10 year old daughter, and slammed down something on the table.  She then proceeded to talk about us to other staff, and point and roll her eyes...we live in Gilbert and go to Four Peaks on a regular basis with a group of people, we will not be spending any more money there and you can thank the unprofessional brat who doesn't like the morning shift at the airport...Tiffany you are a joke, and you are in the wrong business..please go serve popcorn at the movies."}
{"text":"The horrible odor in the back of the bar seemed to be overlooked by every employee. I remember the original where the staff was friendly, the restaurant was clean and food was great. Oh how times have changed.  The beer was of course good. Current management needs to be put on notice."}
{"text":"Who knew. I've had many dinners at Four Peaks Tempe but this is my first stop at the airport location and first breakfast. Highly recommend the beer bread plate. Wouldn't stop here though if you're within 1 hour of boarding. A little slow for an airport breakfast."}
{"text":"Airport bars are notorious for overpriced drinks, and mediocre food. Like an oasis in the desert, Four Peaks offers travelers a respite, with good locally produced beer, and decent food. Had the Raj IPA, and a chicken quesadilla. The IPA was good, not overly hopped but nice balance. The chicken quesadilla was a bit bland, but some hot sauce kicked it up a notch. Would definitely park there again."}
{"text":"You can't spent 4 hours trapped in an airport at a better spot. Good beer, good food, and good tunes. Try the Beer Bread Chicken. It's delicious!"}
{"text":"Four Peaks has it all, good brews, quality food and a great spacious area to watch whatever game is on at the time.   It is the ultimate sports bar.   Be sure to check out the oatmeal stout which is heavy but flavorful, the peach brew which has a sweet kick to it and the kilt lifter which is somewhere in-between. The place was busy as far as getting table went but we only had to wait 20 min for a group of 8 which gave me a chance to try as many beers as I could. Can't wait till I'm back out in the area to go back to 4 peaks."}
{"text":"If I had to describe my service and food here today in one word... TERRIBLE! Let's start with the first fun fact, as soon as you sit down and order, they ask for your CC... OK, that's not too horrible, but it is annoying, and unexpected. So, after ordering my food at the bar, and getting my drink, the bartender virtually ignored me and the other patrons at the bar while she chit chatted with her manager. Until my food arrived, I really didn't care. After my food arrive (which was not very good... I'll get to that in a moment) I still couldn't get her attention. Too busy yapping away with what looked like the manager, and the other bar tender... Needless to say I ended up getting what I needed myself (Ketchup from the other side of the bar). Now, the food... I ordered the french toast with bacon. I asked for the bacon to be crispy... it wasn't. The french toast was cold, and a couple of the pieces were stale and impossible to cut/chew... seriously, they were like rubber! The only good things were the orange juice (from a container), and the potatoes o'brian. Maybe instead of being a chatty Kathy the servers at Four Peaks could actually spend some time paying attention to their customers. I doubt I will ever go back to this particular dinning establishment... which is a shame, because I really like Four Peaks in Tempe."}
{"text":"We were greeted by a very friendly staff, and our waiter did a great job as well. Very attentive. Moved with a sense of urgency. We started out with the Garlic cheese beer bread which was phenomenal. My husband got the Reuben and I got the garden burger. Not the best veggie burger I have had but still was tasteful. Great selection of unique brews. Would definitely recommend to others."}
{"text":"Pricey for not that great of beers of course since we are a captured audience at an airport we are stuck paying too much for the same stuff outside the airport never the less my comment is it is too pricing for what it is"}
{"text":"For airport food it's great. The burger was freshly made as were the fries. The drinks are very good. It's expensive as all get out, but hey they have no competition. Our server was friendly and efficient ... again two things that are basically lacking in airport operations these days. They seem to specialize in beer, and as a result have a limited drink menu. But what they do have, they serve well ... and they do not skimp on them either. I had a sandwich that had lots of meat on it, and was well presented. Next time I am in the airport in Phoenix, and if I have the time to spend, I will be back. It was a pleasant diversion from the normal run run run and getting yelled at by TSA people."}
{"text":"Decent place to grab a drink and some food before a flight, and compared to airports it's great, but compared to the other awesome offerings at PHX, this is not as great. However if you are in this gate it's your best option unless you won't to hoof it over to B or C.   The menu is small, the prices are airport-high, and the portions are small. No healthy options that looked appetizing and next to no vegetarian options other than quesadillas and fries."}
{"text":"THE WORST! The bartender(s) are huge mega dicks. I ordered a double Hendricks and soda because all four peaks beers suck- I couldn't taste my gin and asked about it and was completely shut the fuck down. Boners. I tipped less than 20% and they scoffed. I literally NEVER do that- but the treatment was so subpar that I HAD to. So; in short- fuck you four peaks- you sellout pi Cessna of shit. Thanks for trying to ruin the AZ craft beer scene. P.s- your ipa's taste like toilet paper rubbed on a pine cone"}
{"text":"Excellent beer on draft along with decent pub food make this an enjoyable place to wait for a flight.    Sports on tvs and friendly service helps."}
{"text":"Beer is alright, the service isn't. Waited 8-10 minutes to have my order taken from a girl who had acknowledged my presence once I got to the bar but was too busy talking with her coworker to service me."}
{"text":"Hey, this is a restaurant in an airport, so are you really expecting fine dining?  Four Peaks is the kind of place you may pick in order to avoid the fast food options in the terminal (although it's certainly debatable if Four Peaks' options, aside from the salads, are any healthier). The food is good but not outstanding--the chicken enchiladas were tasty and cheesy, but you won't compare these in a positive way to the more authentic Mexican meals you've had.    Service was good, but my biggest disappointment is that the place is in need of some upkeep. The upholstery in every booth was torn, giving the place a trashy look, and the seats were not very comfortable.  If you're going to try to offer a more comfortable and welcoming place for tired travelers, then it's important to make the spot more comfortable and welcoming. I'm not sure Four Peaks hits the mark for that reason.   Decent food and good beer, but overall, I found Four Peaks only okay. There's room for improvement here."}
{"text":"Walk to these gates and have some fun at this bar/brewery. The beer is good (no flights though), the food is good, and then some vegetarian dishes. I got a blackened salmon BLT and I was in heaven. The people at the bar are friendly and fun, this is a very unusual atmosphere in the best way possible."}
{"text":"Yes they were bought..and if you don't like the fact that a business was urber successful enough to get make a millions times over after working years...you are just jealous.   Great lunch. Great beer. Patio is great, a little smelly next to the fermentation tanks..but that is too be expected.   Large portions..the burger and nachos could easily feed two people..no reason to over order.   Parking is horrible, and for some reason people seem to think it's okay to bring kids."}
{"text":"I should have known by the less than friendly hostess, but I let hunger get the best of me.   I ordered a tequila on the rocks and hot wings.   People who came in after me got wings but then, about 5 min later after they got theirs, I'm told they are out of wings, so I reluctantly ordered a quesadilla, because I figured it would be quick..wrong... all the while the drink is getting watered down and warm. The bill comes and they've charged me for don Julio instead of patron at $17 for a single pathetic pour.   when I point out that I got patron.. she returns with a bill for the same amount and says nothing as if I wouldn't notice...when I question she very surly tells me \"it's not a well drink!\"    Seriously?  So i can't at least have an  apology for the long wait, or serving my wings to other people... or the fact that I'm paying $30+ for the honor of being treated poorly by you? And drinking a like warm drink?  Bartender then tells me it's $14 but can do nothing and I need to talk to the manager... stood there waiting for manager until lost patience and decided my time was better spent letting others know."}
{"text":"Airport bars are crazy, Not bad but the service was not great. I ordered IPA and enjoyed people watching but I was no offered another and I was handed my check before I was  ready to leave.   I love to drink but not in a rush."}
{"text":"I usually come here when I am passing through Phoenix and I was shocked today. Worst service ever. Like I seriously can't even believe how bad it was. They automatically assumed that I was with the guy who sat next to me and put our bill together even though me and him didn't talk the entire time we were there. Had to ask them multiple times if they could take my order and they weren't even busy, and any time I got there attention they made it clear I was just inconveniencing them. When she saw the tip I gave her (which was 20%) she huffed at me like I was being cheap."}
{"text":"Food is highly overpriced, especially for the quality of food that you get. Also, one of the servers was incredibly snobby and acted like we were lower than dirt, and it seemed like she hated her job. The only reason I'm giving this place two stars is because our actual server was very nice, and he responded to our needs.  Long story short, don't treat travelers like shit just because you work in an airport. It's not our fault."}
{"text":"Only had an order of french fries before my flight and they were really great. Not overly greasy and cooked to my liking. Crisp on the outside fluffy on the inside.   Staff was super busy so you need to get their attention but they are helpful once they are taking your order.   Enough seating to accommodate everyone when I was there but it seems to fill up."}
{"text":"Matt was very personable, alert, and downright outstanding. The food was great, his recommendations unmatched, and all around it was the perfect atmosphere to end my vacation. Kudos for keeping such great staff!"}
{"text":"I decided to try this restaurant for a quick dinner before my flight. The waiter came and greeted me right away. I ordered burger with a side of their kale slaw. It came rather fast and tasted alright! It's a great place to grab a bite before your flight."}
{"text":"As a server/bartender myself I'm usually pretty harsh on reviews but I was so impressed not only with the stellar menu items, killer brews and reasonable prices but the staff was also incredible. Great atmosphere and all around great service. We came back twice in two days. Definitely five stars in my book."}
{"text":"I'm so used to crappy everything in airport eateries, Four Peaks at the airport surprised me this morning.  Fast, friendly service, and my Brewer's breakfast came with fresh fruit on a real plate with real silverware. No styrofoam or plastic in sight.   The food is decently prepared, arrived at the table quickly, and the price was \"airport\", but not unreasonable.  I'll be back!"}
{"text":"One of the best airport dining experiences. Great service, tasty food and fabulous tap beer selection. Prices are not your usual rip off airport rates."}
{"text":"Normally for an airport restaurant I would say Four peaks is pretty good, but with all the new dining choices at PHX, it's okay at best. When we sat down the server went through a list of all the things they were out of... not a good start.  I ordered a veggie burger prepared in the jalapeño popper style with fries and beer, and the hubby ordered wings.  My burger came out cold... not luke warm... cold! It wasn't cold because it had sat too long, it was cold because they didn't heat it up enough. It was clearly a frozen veggie patty (FAIL) that they probably threw on the grill and attempted to heat up for about 2-3 minutes... neither the cheese or the cream cheese were melted at all.  That should have been their first clue.  My beer was okay, the glass wasn't chilled so it went luke warm quick.  Despite the initial fail on the burger, the server was prompt to check on us and get it corrected.  When my new order came out it was the proper temperature and pretty tasty.  Overall the experience was just okay... they need to work on the details."}
{"text":"We were stuck at the airport for a few hours after missing our connecting flight due to delays. Decided to find a bar that had TVs so that we could catch the Golden Knights game. This place has the tiniest TVs for a sports bar! We sat in a booth and could barely see the TV from our seats.   Also, since this is the only sports bar we found, it was super packed inside which means don't expect service to be fast. I wouldn't recommend coming here if you're in a hurry, but if you have some time to kill it's not bad. The food was decent and very reasonably priced for an airport. Wings were about $12 an order and most burgers/sandwiches are in the $12-14 range"}
{"text":"Good food and service/ hummus was delicious .  Spicy salmon BLT was very tasty. Service was quick"}
{"text":"Horrible service. Bad food.  I decided to try this restaurant since it was near my gate. I waited 15 minutes for anyone to come offer me a drink, let alone take my order. I motioned to the waitress that walked past me on 5 separate occasions. She went over to perhaps her manager, some bald guy in a grey colored shirt, and I could hear her say \"I get annoyed by people that try to motion me over.\" Well, I motioned over since I had a flight to catch and had limited time. It was so bad that a couple seated next to me also tried to motion to get me some help since they saw I was waiting awhile.  I should have just gotten up and left, but I didn't want to attempt to go to another place given I didn't have much time. So I finally ordered from a different waitress who came over. I ordered the spinach salad with salmon. The salmon was burnt on the outside, yet undercooked on the inside. Good times....  Needless to say, if I'm ever back at Sky Harbor, I'll go to a different terminal to eat."}
{"text":"they let this dude smoke an e-vapor cig in the restaurant/bar at SMOKE FREE Sky harbor airport.....im not talking a little e cig im talking full on clouds of smoke cheech and chong style.. yes im old ha... whole section smells like smoke   i guess thats allowed at smoke free airport  HA"}
{"text":"So we stopped here on a layover and Only had 30 min, Travis got our drinks right away and food came within great time. You can tell he was busy but was still rockin the bar. AND he truly has the hospitality gene. Thanks Travis!   From  Jairus and Dani from San Diego"}
{"text":"Great food and quick service. Ate here with a group of co-workers while passing through, and we were all quite impressed with the freshness and quality of the food. Service was quick, food was delivered up quickly and we were able to quickly pay and get on our way. Thanks for a great experience in the chaos of the airport!"}
{"text":"Probably the best option out of all four restaurants in Terminal 4. The server was young and enthusiastic despite how packed the restaurant was. The chicken enchiladas and BBQ wings were yummy. Both were just a bit overcooked but for airport food, I was impressed."}
{"text":"All about that peach beer! I typically drink Blue Moon and thought this was similar but so good"}
{"text":"Horrible food! Horrible service! I would die starving before I would eat there again..."}
{"text":"The brunette hostess working tonight was horrible and doesn't know what customer service is. The hostess and servers working tonight acted as if they didn't even want to be at their jobs. They seem like they all stand around and talk and are only there to get paid hang out and leave. I couldn't even stay cause the service was horrible and I've never made a review in my life so sad to say this was my first place but the people there were horrible."}
{"text":"The atmosphere was great and it was located close to my gate which made it convenient to wait there for my flight but Heather the bartender was not friendly.   She made it known that she didn't want to be at work and didn't smile once.  I think what upset me the most was the gentlemen next to me was trying to get her attention because he had been waiting 10 minutes roughly and still hadn't been served and she looked at him and very rudely said \"hold on!\" Umm...she served two other couples that sat after him. He wasn't rude or pushy but it was obvious she wasn't in the mood to serve him.   If you aren't going to treat your customers with a least a smile then don't work in customer service."}
{"text":"Horrible restaurant choice.  Servers could care less and food was cold, greasy and had zero appeal.  How bad can you screw up bacon and scrambled eggs?  Bacon cold and rubbery, eggs cold and no taste and toast was cold and barely passed under it through the heat.  Never again."}
{"text":"Some of the best airport food I've ever had. I was craving a good burger and had a 2 hour layover in PHX so I decided to pop into this place in Terminal 4 (by the A gates). Good call, me.  The space is pretty inviting for an airport - lots of seating, big TVs, big wraparound bar. There are plenty of outlets. Score.   But the food's the thing, and nice ambiance can't make up for bad food. Fortunately, my burger and fries were great. I had the southwestern burger, which was cooked as specified to medium doneness (airport kitchens hardly ever get this right). The buns were nicely toasted. The lettuce+tom were fresh. The beef patty was nicely seasoned. As for the fries, they were perfectly salted and crispy. Well-executed, straightforward, and satisfying. What more can you ask for in between flights?"}
{"text":"Love it. Good solid brewery with surprisingly good food.  My go to is the Salmon BLT, but the chilaquiles are also good at brunch, and they do a bunch of specials.   The brews are solid and there is a good variety."}
{"text":"Mehh... Overpriced airport food. Service is decent. Food isn't good.   I ordered the French dip and the sandwich itself fell apart as soon as it got to my table. The lower half of the bread is so thin I couldn't even hold up the sandwich unless I flipped it upside down. Au jus is too salty and I can see chunky bits on the side of the cup it's in. Slices of meat are WAAAY too thick and makes it incredibly hard to bite into without pulling out the entire piece of meat which is a bit dry.   Had a white wine and had a proper and some other bit floating in my drink.   Honestly the only thing I enjoyed was the charger to reboost my electronics and my bottle of Apple juice."}
{"text":"I ordered at the register because they were setting up the tables for breakfast. By the time I ordered they had opened up table seating so I sat down. They brought me my food and said, \"Per the managers orders since you ordered at the to go register you are not able to sit in the dining room\" and I was literally asked to leave. He said, \"It's an airport, there is general seating over there.\" and pointed to seats outside the dining area. I tried to have a rational conversation with him but he wouldn't budge and I didn't want an argument. The most ridiculous part is I know one of the founders of the company. The food was just basic breakfast and nothing special. Pretty insane."}
{"text":"Waiter was a rude little jerk.  Waited 23 minutes for a side of fruit and an appetizer of chicken rolls."}
{"text":"Place is real stupid! Couldn't even get our order taken after like 20min of waiting. Plus I was with a hungry girl & we know how a starving women gets when she's hungry. Jus all around bad service. Bounced on that ass."}
{"text":"Wow. Enchilada eggs top notch. Who wudda thought best ever in an airport. Recommend with Bloody Mary n a Budweiser."}
{"text":"Airports, all about the service.  Pros:  Our waitress Lyndsey, she didn't know we had only 30 minutes until our flight boarding but she knows everyone is in a hurry.   First contact within 2 minutes, drink within 5 minutes, food within 10 minutes, follow up drink in 2 minutes.  Dropped the check and out in less than a minute. Never had to wait for water to be filled up.  Food:   8th street chicken strips( $10.99) good portion.  Flavor is what you'd expect at an airport, have to appeal to literally the entire world.  White meat, muscle meat and tender so that was unexpected.  Martini, weights and measure laws in that town, 4 oz for $12 a fair deal.  Cons:  it's an airport, what do you expect."}
{"text":"Four peaks is my favorite Phoenix bar/restaurant. I'm always excited to visit (I used to live here). Sooo when they put in a four peaks in the airport, I was beyond thrilled. Layovers were now filled with good food and beer....well...kind of. I wish they had a full menu - the real restaurants have KILLER daily food specials. I've now been to the airport location 3 times and each time I have been rather disappointed. The soft beer read overflowing with gooey cheese at the freestanding restaurant/brewery can be found crusty and seemingly overcooked. Why? :( I thought it was a fluke until I ordered it three times.  No pasta salad (four peaks literally has the best pasta salad on the planet. Think creamy, ranchy pasta with big chunks of artichokes and cheese...so good). No pizza either (go to the non-airport locations and order the pesto pizza-it's amazing). So alas, we are left with beer bread and burgers. Yeah, they're good but please stop over cooking my beer bread. And for the love of all things good please please start serving pasta salad!!!  Side note - this place still gets two stars because the beer remains consistent (but how could it not). Try the peach ale or hefeweizen. When in doubt, go with oatmeal stout :)"}
{"text":"Very poor service, there is no host what so ever at the host podium. People waited in line while servers just walked by. People had to grab a menu and seat themselves cutting the ones who kept waiting for a hostess, pure savages. Finally hostess came but her body posture was like she didn't give a rats @ss. Had to speak to a manager who acknowledged me but didn't rectify the problem. Still no hostess around and it became comical, people waited in line, people cut the line and sat themselves, people rolled their eyes, and people stormed off. The food was good after the manager said two chefs called off. Waiter was okay. Seems like the location what keeps them open....."}
{"text":"I was pleasantly surprised at how much I enjoyed my experience here.  I'm never typically a fan of airport restaurants. The food is usually overpriced and average. And although I felt the food was still overpriced it was still good.   Another plus, usually bars that are known for beers typically suck at cocktails. And I hate beer... So I was thrown off that when I ordered a margarita it tasted good. Like really good. So good I ordered another one. And stopped after the second one because I kept gigglingb when the Canadian next to me said \"aboot\".  Good enough for me."}
{"text":"Been here many of times. Visited tonight at 830 and the hostess went to seat us but then told us we could not be seated because the table had 4 seats and we were only 2 people. Terrible customer service."}
{"text":"Beer is very good! Quesadilla was good, service is good. Nice place, good location. Overall very nice call."}
{"text":"Very poor service from our waiter. I had fish & chips which was good, but the cheese-beer soup was not good. The soup is better described as thick gravy and was not even warm. When I informed the waiter  he told me, \"well that's how they make it.\" The waiter had a big attitude problem that was quite apparent. We did not see him again until we had to stand up to get his attention for our bill. No refills offered to us on $3.50 glass of iced tea. Would not recommend and I will not return."}
{"text":"This is good find, and certainly beats eating McDonald's at the airport. I had their peach ale (delicious), and their blue cheese burger was juicy, tasty and cooked perfectly. The staff is friendly, and the service is good. However, go here only if you have plenty of time to wait because although the service is relatively fast, there is way too much going and you may have to do some waiting.   Angel- healthyroadadventures.blogspot.com"}
{"text":"Disappointing, I paid $14.00 for burnt chicken, no cheese on my sandwhich and bad service. I couldn't even finish half the meal. I ordered using the airport app, I stopped by when they told me to and it wasn't ready. Okay, I can wait a few minutes. Then I hear a girl yell my name in a snarky voice \"Holly, it's not ready\". Congratulations you can see that the order is infact not complete, your intelligence level is the reason you probably work here. I get my food, the guy just shoves the bag in my face. I'm glad my husband is protecting this country for you to treat people in that manner. They didn't even put napkins in the bag and there was no where for me to grab them. Thank god I'm from Oregon, I would hate to see the customer service outside the city."}
{"text":"Good beer at reasonable prices, but the burger I had was pretty overcooked and the buttered or margarined bun was greasy and yucky. Still, for an airport it's far above average."}
{"text":"I know.  It's at an airport.  Expectations should be low.  I was looking for breakfast before my flight at around 6:30am.  I am giving it three stars because the service was very friendly and quick during my visit.  I ordered the Brewer's Breakfast which consisted of toast, scrambled eggs, bacon and fruit.  For the life of me I cannot understand why any place other than a school cafeteria serves powdered eggs.  So.Gross.  The whole breakfast reminded me of breakfast at Ikea.  The bacon was pretty good, though.  You'd be better off grabbing something at one of the grab and go places, unless you're just in the mood to sit and be waited on."}
{"text":"Stopped here twice on my way to and from NY. First time was quick service, the second time, I sat at the bar and it was hard to catch the bartender's eye to get served.   Had the beer cheese soup and 1/2 turkey sandwich and it was a hefty portion. Good deal for $7. Second time, had a lackluster side salad for $4.50 because they had a lentil soup and I don't think I like lentils.  Overall, pretty good for airport fare."}
{"text":"Stopped here before my flight and was served by Heather at the bar. She was probably one of the most pleasant servers I have met. She was very friendly, kind, personable, and ensured I was enjoying my visit. She was just as pleasant to the others who were sitting next to me. She made the visit much more enjoyable. Thank you for the excellent service."}
{"text":"Since they opened, we have not eaten or grabbed drinks at any other place in Terminal 4. We generally fly out of the opposite side of the terminal from this place, it it is definitely worth the walk and getting there earlier! The food is excellent, great breakfast options too. You also can not beat the beer, which is the best that the Phoenix metro area has to offer!"}
{"text":"Good beer (try the Hefeweizen), fresh food, and great prices.   I was seriously surprised by the prices- best I've seen for airports- and service. It actually felt like a microbrewery and didn't have much of an airport feel to it.  The chicken Caesar salad was good but not phenomenal. Overall a great experience"}
{"text":"Currently having breakfast here before our flight and let me tell you, this is nothing like the actual brewery in Tempe.  Granted, I don't expect gourmet at the airport.  Got the Brewer's Breakfast with eggs, bacon, potatoes, toast and fruit and it was pretty foul.  Eggs looked regurgitated, potatoes looked rehydrated, toast was somehow soggy....  even our coffee tasted unusually burnt that I thought the cream had gone bad.    Save your time and venture elsewhere."}
{"text":"Very surprised for an airport meal.....  I was at sky harbor waiting for my flight and figured I'd grab a quick bite. I travel a lot and I'm used to the typical crappy airport meal. Well I sat at the bar was waited on in a matter of minutes. Which was pretty quick because this place was jamming. Ordered the bacon/bleu burger med rare. It actually came out medium rare!! It also came out very quick, the service was awesome. And food was good.. What more do you need especially at an airport!!  Hoping I head back to AZ soon just to eat there"}
{"text":"I like to get the brewer's breakfast and coffee.  Service is usually quick and easy -- I'm typically in and out in under 20 minutes.  Servers typically bring the bill with the second cup of coffee.  The breakfast menu is good by 'airport food standards'."}
{"text":"Had an early flight so stopped here for breakfast. Content of breakfast was good but it was served luke warm. Server offered to bring another but we were catching a flight, so had no time. Bill was reduced by 10%. Server Reillyan, was very pleasant."}
{"text":"I had a layover in Phoenix and decided to stop in and have a cold beer and some lunch. The service was not the friendliest. I ordered a /2 roast beef sandwich and cup of beef barley soup. Arrived quickly. Soup was cold and the sandwich had no mayo or horshradish. I asked waitress for a side of horseradish and she replied while walking away \"we don't have horseradish.\"  She put my bill out and I gave her card to pay. She maybe said 10 words to me the while time I was here."}
{"text":"Their express to go isn't very express...I waited 23 minutes for a salad add chicken. When I finally got it, chicken wasn't even warm :("}
{"text":"If you're in their terminal, eat here!!! We caught some breakfast here the morning after the Super Bowl and they were PACKED. We only had to wait maybe 10 minutes to be seated. Our server was great, got us drinks and took our Oder in no time. Our food took about 10-15 min and was really good! I'd like to try lunch or dinner if I'm ever in the area again."}
{"text":"Service and atmosphere were not atypical of your average airport bar and grill, but the enchiladas left me a bit nauseous. Taste-wise, the food wasn't bad, but please don't give me a food poisoning scare before I board a plane. No. Just...no."}
{"text":"Kilt lifter is delicious and great before a flight! The food ain't bad either. Bartender is kinda shitty but it's whatever"}
{"text":"I stood at the hostess stand for over 20 minutes waiting for someone. I asked several employees who kept telling me someone would be with me. It's important to note that they were not busy. Finally got seated and no longer had time to order food. Figured I'd just order a drink. After waiting another 15 minutes, we just left. What a terrible airport restaurant with no sense of urgency."}
{"text":"Being from Chicago, there are many breweries in the area, but none compare to this place. Not that I liked every beer per-say, but were really well balanced to the point I even enjoyed the ones I didn't really care for. I don't know why so many rave over the nachos, they don't use the liquid cheese we all know and love, they use shredded cheddar and melt it. I did have the Abe Froman pizza. I'm glad I ordered that, it was delicious."}
{"text":"So hubby and I found ourselves in Pheonix airport. Long story... We are portlanders though and through and love a good beer.  We were thrilled to find this little beer oasis and throughly enjoyed our cheesy garlic beer bread made by a chef who did not skimp on the cheese or garlic. Our server Niki was a delightful little spitfire who truly understands customer service. Highly recommend"}
{"text":"The bartender Heather is very cold.  Makes you feel like a transaction and not a person.  I get it, this is an airport, but at least say thank you when I pay my tab leaving a 20% tip on your cold service."}
{"text":"20 bucks for cheeseburger with mushrooms and bacon and a ice tea. Fries were cold, burger with minimal flavor,  barely warm, staff rude and highly inconvenienced that I asked hot fries. When I finally got my food again about a third of the way into this hamburger with no flavor I realize that they have left my Bacon off. Manager was apologetic but seriously, save your money go eat someplace else.    In the Phoenix airport gate A19 down through 27 there's not a whole lot of choice here for food so either pick a different place besides four peaks brewery or eat at a different gate."}
{"text":"For vegans, as of this date the veggie burger is garden burger brand, and is not vegan."}
{"text":"3.5 stars bumped up to four because it's in an airport. They have a decent beer selection, and the Southwest Burger with a chicken breast instead of burger was quite satisfying. And they helped me find a seat with an outlet so that I could charge my dying iPhone.  Definitely glad I took the time to eat here since there weren't a lot of grab and go options in the area."}
{"text":"I travel regularly and often stop at the Four Peaks Express counter.  I have yet to walk up and have an employee greet me, no hello let alone how can I help you.  It's sad that customer service seems to no longer exist!  Please let your employees know it's okay to be friendly and kind to your customers!"}
{"text":"They have these things called the Arizona Chicken Rolls that are so good I've opted for connections through Phoenix just to get them. So, yeah, I'd recommend those. Rest of the menu is good, reasonably robust for airport bar food. Service was attentive and quick. They have take out options if you can't sit down to eat, so even if you've got a shorter connection, you might try stopping through.  They're not open as late as it says, I don't think. At 8:45 tonight all the bar stools were up and the take out section was shut and locked."}
{"text":"I usually have something to complain about in an airport restaurant, but this one is reliably solid. Better than decent food (I had half a roast beef sand and the meat was of the thick and yummy variety, not the paper thin stuff). The service was lovely and I came out feeling very sated for not too much $"}
{"text":"As a local and a frequent traveler, I am really excited about the transformation happening in Sky Harbor terminal four. Local restaurants like Matt's Big Breakfast, Chelsea's Kitchen, Delux and others are replacing Burger King and your typical airport fare.  I don' think Four Peaks has gotten the memo that airport food can be good.  On my way to my gate this morning I decided to give Four Peaks a try. I ordered a coffee (a bit lukewarm- but ok) and the Brewers Breakfast. I am not sure if I read the menu incorrectly but it said \"eggs\". I ordered eggs over easy and was given what tasted like powdered scrambled eggs.    If the only option was scrambled - the waitress should have said that when I ordered them fried.  So I have had powered eggs before and I can handle it. But the breakfast potatoes were really bad. The best way to describe them was waterlogged. I rarely don't finish my plate, even at the most mediocre restaurant - but one bite was enough.  Even the toast was pretty lame.  How can you make toast lame?  Not a great way to start the morning. Should have just had a coffee at Pete's or Starbucks.  I am sure the beer is good - but they need to give the food some serious attention."}
{"text":"I eat here every time I fly out of Phoenix.  The Chef Salad has been consistantly great.  Lots of honey glazed ham, roasted turkey breast, applewood-smoked bacon and hard boiled egg.  The candied walnuts add a nice touch.     I had bleu cheese dressing.  They serve it with very small cups, I had to use four.  The salad is huge, needs a lot of dressing.  Just sayin'......  I also tried the Chipotle Ranch, it has a kick.    The beer selection is great, served ice cold.  Staff is freindly and hustles to get you in and out."}
{"text":"I regularly go to Four Peaks, not just for their good beer but also their food. The airport location has the beer and the food is decent, but the service at the bar just reeks. Travis didn't seem to pay much attention, and after my food came, I waited for the condiments, which didn't come so ultimately I asked the patron next to me if they were finished with theirs, then Travis comes over and says \"I could have gotten you that\", but doesn't bring me utensils. The water glass sits empty. He doesn't even check to see if i want another Hop Knot. Pretty weak. I will continue to return for the beer, but the device could use some significant improvement!"}
{"text":"Hungry on a recent layover, I wanted some pub-a-grub. Four Peaks looked homey and inviting and was pretty busy, a good sign. Saddled up to an open seat and charged up my phone with a busted looking but working USB conneXion.   Ordered me a Hop Knot American IPA, big 20oz for $8.75. Filled to the brim and cold, this was a solid beer. Served by Kaitlin, a very solid (skills and physique, phew!) server who seemed a bit off that night but was still efficient like the T-X Terminator cyborg lady.  Got the \"Bleu Light\" burger medium. It was cooked perfectly, had a tasty grilled taste and the bacon was crisp and delicious. $12.69 for this burger is a good price, especially at an airport location. Their regular burger is $11.99 and it's $2.75 to add bacon, which doesn't make sense really given my choice's price. Fries were lukewarm but Kaitlin scared me up a fresh hot batch Terminator quick. Fries were okay, with some kind of science-y coating. Why can't places just let plain potatoes, some good oil and salt do the talking? Enough with the caked on science.  But man, that burger! I followed my tall 6.7% beer up with a tall Raj English IPA at 6.9% and it was even tastier and potent! $30 well spent! $40 with tax and tip."}
{"text":"Wow, this place is incredibly bad. Usually I give 2 stars if the service is decent but I simply can't. I ordered the \"blue burger\" and the \"Hop Knot\" IPA. So let's start off with the burger....patties are frozen, the blue cheese is something that would please a 3 year olds palette because it wasn't real blue cheese and was flavorless...but wait, not satisfied with your frozen burger, let's top it off with cold buns! Yes cold buns (probably straight from the fridge or freezer to keep their 'fresh' bread fresh).   The \"Hop Knot\" IPA is a literal Hop not. I was unimpressed to the fullest. So, after I paid my 13$ for a frozen burger and 9$ for my Non- IPA-IPA (I should of just ordered a hot milkshake or whatever bizarro world concoctions they have in the back) I left my tip and went on my way.   I know this review won't matter because as I left I saw a line of no less then ten waiting to try the best frozen patties in Arizona. .....conclusion: oh horrible airport restaurant (whose name I've luckily already forgotten) Thank you for representing your state, because who cares about pride or quality in Arizona right? Apparently anyone who returns to this disgrace of a restaurant surely doesn't know any better. Horrible. Bad. Sad."}
{"text":"I have actually eaten here the past few times I've had to wait at the airport. Most recently I was alone and ordered breakfast and sat in a small booth to get some work done. It got a little busy with customers and I was expecting the waitstaff to start hinting for me to finish up, but they didn't and they were still attentive while I finished my work.  The food is good here, they have all the basics-breakfast staples, sandwiches for lunch, etc.... It can get a little loud in the evenings but I always enjoy the atmosphere-travelers who have time to hang out"}
{"text":"During a recent vacation, we found ourselves in a different gate area (A) than normal and hoped for some breakfast options to enjoy before heading out of town. I was pretty excited when I saw Four Peaks and that they were open for breakfast!   I love Four Peaks and will always continue to support them by enjoying their amazing beer and tasty food for lunch/dinner, but one thing I can't say I loved was their breakfast at the airport. The environment was great and this would be a perfect spot during the lunch/dinner hours, but the breakfast menu was very limited and included a beer bread breakfast option, breakfast burrito and a basic egg meal (among a couple other items). I went with the basic egg meal which came with eggs, bacon and toast. It filled me up but I would have loved a little more flavor and flare! Luckily they had mimosas when we got there so I enjoyed one but learned they ran out of them during while we were dining. Unfortunately our waitress, Kemberly, was a little stressed when we dined in and was pretty unhappy (and expressed it to me) when I asked to borrow a pen when we first sat down. The pen never arrived and it wasn't until the check came that she finally asked if I still needed the pen. This was about 40 minutes later. By then I had figured out another solution to find a pen.  While our breakfast experience at the airport Four Peaks was not what I would have hoped for one of my favorite breweries in town, I will give it another chance in the future but not during breakfast-time. Hopefully we get a nicer server next time around!"}
{"text":"Ive had 4 of their beers. Kilt lifter, Hop Knot IPA, Raj IPA, and the Oatmeal Stout and Every beer on tap is just bad. I don't know how these brewers stay in business cause their beer sucks."}
{"text":"I absolutely love Four Peaks! They have my favorite beer (Peach Ale) and an amazing Chicken Salad Pita and Outstanding pasta salad. I love the busy but upbeat feel here and go all the time with friends. I am dreaming of the Peach Ale right now..   If visiting AZ this place is AMAZING and has something to offer for even the pickist of eaters. Enjoy!"}
{"text":"Great bar food in the airport.  Bar service is quick and friendly.  Do yourself a favor and don't order a bud light.  Order a beer on tap because you are at the brewing company that makes the beer.  I personally enjoyed the Peach beer since it was actually loaded with peach flavor, but no overly sweet.  We had to kill over an hour, so we ordered fish and chips to share.  The food did take about 45 minutes to come out.  We ordered about 10:15 (so not the busiest time of day by any means).  The fried were better than expected since they also seemed to be beer battered and crispy.  The fish serving is about 5 pieces."}
{"text":"It's a fine place for an airport bar. Food is okay but they have really good beer not a bad place to kill during a layover"}
{"text":"Why didn't I know that four peaks is in the airport?! I am a nervous nelly prior to any flight and their kilt lifter is the cure. Terminal 4 gates A . Even with the entire bar being surrounded by eager drinkers, the bartenders are getting everyone their order on time."}
{"text":"Awesome place !  Absolute real deal brewery and not an imposter. Great food, great atmosphere and great beer with good selection of styles. On top of out side seating, really hard to beat."}
{"text":"Horrible for breakfast. Bland food along with filthy condiment jars and staff that are still asleep and have zero personality made this a very poor start to our travel day. The girl next to us and her companion also commented to each other how bad the food was."}
{"text":"Got the Four Peaks Cheeseburger, which is a charbroiled patty with swiss cheese and fries for $9.50 (with tax is $10.19).  Overall, not bad but not amazing. Juicy but over cooked (medium rare seemed medium well). Fries were a little overly salty.. but not bad."}
{"text":"A little gem while waiting for my flight at Sky Harbor Airport.  The salad I got was decent size.  For airport food, it's actually pretty good.  The best part of the meal was their selection of beer.  They had a selection of six of their beer.  I was interested in the Peach Ale but did not want to order a sweet beer.  I ended up with a half and half: half Four Peaks Brewing Peach Ale and half of their Hefe.  It was only $5 (I think) and it was delicious.  They have an adapter and two USB outlets for you to charge your various devices while you wait for your flight.  I like this place and would definitely look for this place again when I find myself in transit at Sky Harbor Airport!"}
{"text":"The worst customer service I have had. Working as a sever myself I am usually patient and understanding. I would not recommend this place."}
{"text":"Located near the gate A22 at terminal 4, they serve familiar beer from Four Peaks Brewing Company.  There was a wait list for tables but if you travel alone like me, just walk up to the bar area and look for an open seat. I didn't need to use it and actually didn't notice until my neighbor started, they have electric outlet under the bar counter. I thought he was using portable charger at first but actually plugged in. I looked down and plenty of outlets available. I looked around and noticed so many of them available at each tables or counter tables.  Change your phone while enjoying good beer? Not a bad way to wait for your flight.  Hamburger I had was just okay. Bun was a tad dry. I wasn't expecting anything great, I was hungry and needed to eat something.  Bartender had nice smile and she was efficient. Sitting at a bar with fellow travelers, I enjoyed chatting with strangers exchanging travel tips while enjoying a glass of ice cold beer. Cheers and safe travels!"}
{"text":"I will say, most airport food is over priced and not very good. Four Peaks breakfast though, was pretty dang good! We had a layover early in the morning for a few hours before our trip to Hawaii and we decided to come by for breakfast.  I had the enchiladas and eggs, and the wife had eggs and toast. The enchiladas was just insanely good. Such a good flavor! Everything went down quick. I also ended up getting a coffee. Even though it is a brewing company, I will say that their coffee is delicious. The eggs and toast were also really good, but how can you mess that up, right? ;)  Overall, this place was great. Food was priced good. Service wasn't too bad. I'd definitely come back again"}
{"text":"Love love LOVE! This is probably my favorite thing about the Phoenix airport! Not only do I love the beer, now that I was able to enjoy the food I love Four Peaks even more! I had the soup of the day and a sandwich and I loved it. It was actually quite filling and it was very affordable! Especially for being in an airport. I can't wait to have a layover in Phoenix soon!"}
{"text":"\"Bartender\" Travis C. brought me my food order 50 minutes after I placed it (do we all know this is an airport? I don't have 90 minutes to hang), only after I asked him to check on it.  I caught a sassy vibe from him right off the bat and knew something weird would go down in my interaction with him.  So I shouldn't have been surprised when he handed me my food, and told me that it had just finished in the kitchen, yet everything was cold.  Obvious lie.  Can't really judge the quality of the food, as it was old and cold.  Oatmeal stout was so-so."}
{"text":"Worth the trip to gates B to escape typical airport food and have a nice pub meal.  Their beer selections are great...the pale ale and IPA are delicious and the food comes quick. The menu has burgers, sandwiches and typical pub food. The Santa Fe chicken sandwich served on a burger bun and with just the right amount of spice was delicious. Accompanied by a large portion of beer battered fries that were very yummy"}
{"text":"Service is straight trash. 30 minutes before I got a water that I requested. 45 mins for my food. The only reason why I walked in here was because I wanted to watch the Warriors drub the Rockets.   Service team is disorganized and lack etiquette. Slamming condiments on the table when they replace them.   Food was alright. But not worth the wait at all."}
{"text":"Your hostesses suck ass. Especially the girl in the black rimmed glasses that looks like she needs to fart. Restaurant is half empty and I asked if I could switch seats near the counter with the charging ports. She said, \"we're actually seating people here.\" Nobody sat there for more than 10 min. Then she comes over to my table and asks if anyone is sitting next to me. Does it look like it? Uh no. Do you know if they left? Uh what do you think. Fire her. Unfortunately they don't have the cheese sauce here like they do at the restaurant in town. Food was great...as usual."}
{"text":"went there for a beer and a appetizer.  The appetizer took forever considering it was just hummus. Checked my account two days later and I was charged twice for my food/drinks"}
{"text":"I have a very restrictive diet right now. They completely accommodated me by making a meal not even on the menu (grilled chicken breast with sautéed veggies and no butter). Not only that but it was delicious. Service was very fast. Thank you!"}
{"text":"Great service and delicious menu options! My favorites are the hummus, wings and the Mac and Cheese. Yum!"}
{"text":"The cons: the Brewer's Breakfast was F Terrible. I spent the last 7 months on a Navy ship that had better food. The eggs were powdered and cold, the potatoes were soggy and cold, and the fruit was old. Sent back once and got the same plate of garbage back.    The Pros: the coffee was decent, and my waitress, Alexa, was a total sweetheart about the travesty. I'm a fan of Four Peaks beer, so I'm thinking they should just stick to that."}
{"text":"Four peaks is my favorite place in Phoenix, hands down, so I couldn't be happier that they opened an airport location. Perfect way to make sure every trip starts off right!  This definitely factors into all my travel decisions now, I try to book with airlines that fly out of terminal 4 as often as possible. And I no longer feel like getting to the airport hours in advance is a waste of time, thanks to peach ale!!"}
{"text":"15 minute wait turned into 30 minutes and the order was wrong and my flight was coming up so order here at your own risk and if you want your order right order the wrong thing"}
{"text":"While waiting for my flight, I ordered their Cobb salad and it was good. I added sriracha ranch to give it extra flavor. Pricey, but that's to be expected inside an airport terminal. But not bad for a fast food salad."}
{"text":"I know this is an airport restaurant, but the workers are so so rude. They hate their jobs and it's obvious. I ordered red wine and fish and chips. I got the food cold,  way before the wine came. And the woman next to me ordered the same thing and she ordered red wine. But she got white wine.  I haven't seen a smile on anyone working yet."}
{"text":"Located in Gate A.  Kind of a mixed bag at 8 am.  First of all, our welcome was less than stellar as the sullen hostess mumbled a greeting without even looking at us. I wasn't even sure we were being spoken to or not.  Food seems to get dropped at your table as the server sprints away. Coffee refills weren't offered.  And while we're on the subject,  how does $3.30 for a cup of coffee sound? Airport piggery at its swinynest.  The Good things? Yes there were plenty. The menu includes  Breakfast choices and a Bloody Mary if you want an eye opener. Or Lunch and dinner with a full bar. I saw plenty of charging plugs to power up at the bar   My breakfast beer bread was great. An absolutely loaded burrito with meats and veggies and cheese and scrambled eggs in a burrito with a side of fruit.  Over $30 bucks for a breakfast for two is what we paid. The food was good but that airport ripoff factor galls me."}
{"text":"Shockingly legit for an airport restaurant. If you're in terminal A you should treat yourself and hit this place up. The beer and food are just what a person needs before a long haul flight. They have the sports on the tv and shit kicking classic rock on the radio, a pretty solid execution of the American pub style restaurant. I got the popper burger and loved it, mad decent fries as well. If you got at least 30 minutes this is the spot you want to park yourself."}
{"text":"I had a three-hour layover in Phoenix this afternoon and I happened upon Four Peaks while walking toward my gate. Thank goodness. I found a bar seat and ordered a pint of their signature beer (the Kilt Lifter scotch ale) and a cheeseburger with fries.  I really liked that they had such an expansive bar area as opposed to a bunch of tables. It made traveling solo much more comfortable. Plus there were USB ports underneath the bar so I was able to recharge my phone all the way to 100 percent before heading to my gate, which was awesome. No need to sit on the floor next to a plug!  My burger was tasty and cooked appropriately. The fries were so-so, but they did offer several sauces (like mustard and ketchup) to spruce them up. I enjoyed the beer, but it wasn't among my favorite scotch ales. In all, though, I paid roughly $20 with tip, which isn't all too bad for an airport meal -- or in general!  A nice way to break up the travel day."}
{"text":"A quick stop for a meal and a beer landed me at Four Peaks. The Hop Knot was  definitely that, hoppy and refreshing. I tried the beer bread as what would appear to be their signature dish and I was not disappointed. The doughy concoction that is beer bread almost reminds me of a tortilla, but it's so soft and melts in your mouth that the other ingredients are just a bonus. Having chosen the grilled chicken, the flavors meshed well. Anything with artichokes is a winner in my book. The service was bland at best. They were friendly but standard, I would have appreciated a little more follow-up while I was there. In their defense though, this is, after all, at an airport, which makes for a super busy day and in that regard, the servers did a decent job."}
{"text":"I normally don't write review but the cashier who took care of me at the express to go place was so friendly I was blown away. It seems anymore service in an airport just doesn't exist,  but Evan C seems to really enjoy his job. Give that boy a raise. Good help is hard to find"}
{"text":"Parked myself at the bar for an hour early Sunday morning in September. Beer Bread breakfast with the jalapeño hollandaise hit the spot. Full bar plus brews. My Bloody Maria was just what I needed. USB and power outlets at the bar for all your other fillup needs."}
{"text":"This place was just the place for a nice breakfast while waiting for our connection.  All of the staff we interacted with was very nice and cheerful even though it was like 7 am. We definitely enjoyed this little joint  and it is an actual brewery"}
{"text":"Mat provides incredible customer service! It was an breakfast and he just made a difficult morning of travel much more pleasant!"}
{"text":"Definitely never stopping here for anything ever again... Sticking to the actual location for sure.  The service is probably one of the slowest waits for our food and drinks ever.  What kills me is when the man was saying \"its made fresh\" in regards to the wait time is why it was taking forever.  I believe that to be the biggest crock of S**t coming out of someones mouth coming from an airport establishment.  The Italian beer bread was NOT fresh.  The bread didn't even look right or taste right at that.  So not only was I irritated by the wait time with the word \"FRESH\" thrown one time after another (in which became a family joke from here on out is that its \"FRESH\") but i was severely disappointed on top of it with our food."}
{"text":"Good food and buzzing vibe at this place. Inside are tv's to watch sports. Outside patio is great seating on a nice day and eve. The food is so good we went there twice on a one week trip.   The steak quesadilla is excellent.  It is more like ground steak in a nicely cooked non greasy quesadilla.  The brewery burger was outstanding and it comes with good fries.  Service is good and fast. Really enjoyed the place and even bought the t-shirt."}
{"text":"Had to deal with grumpy hostess waiting for a table  Then pointed out the empty table finally got seated and am now still waiting on a server. Thank good the server smiles she might just save this review. Ok trying the Raj India pale ale"}
{"text":"Across from Gate A 21 this is a nice place to be if you are needing to kill some time in between flights. Travis the bartender knows his craft he is very personable. Six different draft beers and plenty of bottle beer. Food is good too."}
{"text":"9/26/2016 - It took 43 mins to get our food and we ended up missing our flight. One gentleman was very condescending in telling us we'd still have time to board around min 31. What he, and we, didn't know is that American can close their doors 20 mins early on a delayed flight. The counter shouldn't be labeled as \"Express\" and your cashier shouldn't set an unrealistic expectation of 10-12 mins...you're at an airport, people have schedules to keep.   In addition to the terrible service, the chicken beer bread was essentially a chicken pita wrap with soggy fries on the side. I can't comprehend what took so long to make such a garbage meal.   Bottom line, don't waste your time or money at Four Peaks.  Update: After being promised a refund for the $30 spent and time wasted, I have not received my refund after 4 days. There is no phone number listed online, the airport was never given one, and Four Peaks tells me they use their brand name but are not owned or managed by Four Peaks Brewery. The nightmare continues."}
{"text":"Came here at 7 AM and wanted a cheeseburger for breakfast before my flight to visit a friend. Talked to a hostess who asked if we would like to see a menu and wasn't told that about any ordering restrictions because it was morning.  We sat down and the waitress asked what we wanted. I stated that I would like a cheeseburger. Even before I got the whole word out, she mumbles in an annoyed voice, \"only the left side of the menu\". I looked at the menu again and saw wings on the left side of the menu. I said, \"oh cool I can get wings\". She was looking at the ceiling and said, \"if it's on the left side of the menu\". I wanted to talk trash to her real bad after that but decided to trash her and the company on Yelp and Twitter instead.   I ended up ordering the wings. The food did come out in a reasonable amount of time. The flats were ok but the drums were real fatty and all of them were undercooked. Nothing impressive going on at this restaurant chain.   The wait staff was the real problem though. I'm really sorry you are a waiter in an airport. It's totally my fault. Also I understand that you guys don't need to give a shit about most customers because half of them are probably never coming back because they live out of state. Bummer that I live here and will refuse to go to any of the Four Peak restaurants if a friend suggests it."}
{"text":"In an airport you need reliable service and this place lacks it. No one was at the front reception for 5 minuets after we got there for starters. Ordered burgers and beer, thinking was a safe bet. NOT. The beer wasn't cold, just cool. The buns of both our burgers were charred so all we tasted was burnt bread. We returned them and it took much longer for the remake than the original order!!  My wife returned her water!!!! The glass was dirty, you could see something stuck on the bottom. We had just over an hour but in the end had to take the food on the plane. I will say that the food tasted good and they took the burgers off the bill."}
{"text":"Four Peaks at Sky Harbor is just as good as their Tempe and Scottsdale locations, and in my opinion, THE BEST way to pre-game a flight. Especially an international flight.  Although this airport location's menu is a subset of the ones in Scottsdale and Tempe, it's pretty damn close.  And it's got all the staple items you need to hop on the plane satisfied.  MORE than satisfied.  Every beer on their menu tastes great.  Grab the Kilt Lifter if you're clueless and unsure, the Hefeweizen if you're feelin' wheat-y, the Peach Ale if you're feelin' sweet, and the Oatmeal Stout if you're feelin' dark and filling.  But then again, you really can't go wrong with any of the beers!  Feel free to ask for a sample if you're not sure.  I can't comment on any of the breakfast items at Four Peaks, but food-wise, the Garlic Cheese Beer Bread is a dish made in heaven.  Perfect for a filling snack or to split with a friend as an appetizer. Warning: you may end up ordering two.  And really, \"beer-battered\" or \"beer- \" anything on their menu is worthy of high praise--it's a brewery first, after all.  If you're looking for a full meal, their burgers and the 8th Street Ale Chicken Strips come with my highest recommendation. At the end of the day, it's bar food made to perfection. Note: food must be eaten with a brew (or multiple brews) in hand for extra flavor and pleasure. :)  I'll save a more detailed review for their physical locations, but whether you're visiting Arizona, a Valley native, or a Sky Harbor wanderer on a long layover, stop here NOW.  Four Peaks is one of the best breweries in the USA for a reason, and don't let the Anheuser-Busch takeover deter you. Stop here, grab a brew, and enjoy where your travels may take you."}
{"text":"Four Peaks Brewery is located in American Airlines terminal at Sky Harbor International Airport.  The options for something other than fast food are very limited so it was exciting to find a brewery.  Four Peaks has a selection of 6 home brews and one seasonal brew. I was very surprised to find some really good local brews.   The server was very knowledgeable about the various beers as well as recommending the various popular items from the dinner menu.  I highly recommend you ask for Matt as your server.   The beer battered chicken strips and the Blackened Salmon BLT is the bomb. I can't say enough about the blackened salmon BLT.  With the options for a place to sit and relax while enjoying a cold brew are very limited at Sky Harbor I would love to see Four Peaks expand the entree options."}
{"text":"If you have a layover here you should eat or grab a drink here! The food menu is smaller than the actual restaurant in Tempe, but it's great food and obviously great beer. I love the style of the seating, it has a restaurant feel but there is also a big table where a bunch of random layover people will sit and have a drink. Great for meeting new people."}
{"text":"Beers are warm. There breweries out side of airport are very good. I thought it  maybe changing of kegs but have been here 4 times and they are aways warm."}
{"text":"Two stars because the food was good, but the customer service was horrible. I ordered to go and the employee did not smile once and was very unfriendly. I said thank you when she handed me my food and she didn't say anything or look at me once, she looked as if she was disgusted by having to hand me my food."}
{"text":"For an airport dining experience, this is pretty good.   It is a local Phoenix brewery /pub, so I expected it to be at least decent. It was really busy, which they handled about as well as they could. My server was attentive enough. I ordered the blackened salmon BLT. WOW. The salmon is seasoned and cooked just right.   For a steep up-charge, you can add avocado. Well, I think everything is better with avocado, so I did it.  The multi-grain bread, plus pepper jack cheese, plus pesto mayo made for some awesome flavors. I sacrificed my gut and had the beer battered fries --they were worth it. Of course, everything is over-priced in the airport, so this fit my expectations fine. Overall, a positive experience for lunch on a busy day of travel."}
{"text":"I stopped by Four Peaks Brewing Co for two beers before my flight in the PHX airport.  My bill totaled $12.88 to which I tipped $5 for a combined total for $17.88.   Later that night, I was checking my bank account and noticed the waitress/cashier instead charged my card $20.00.  While I realize $2.12 is not very much money in the grand scheme, it's ridiculous that the staff took an already good tip of close to 30% and increased it to that of 55%.   Needless to say, check your bank accounts after you eat at this restaurant."}
{"text":"As the saying goes about beer and kids.  Just cause you can make them doesn't mean you should.  The IPA tastes like mildly sweet water, fish and chips were mediocre.  The best item I had was the tap water with ice.  Yummy.    Please do not ruin the three little beautiful letters, IPA by labeling your beer with them.    I'll bypass this place next time and go to Cinnabon."}
{"text":"Super incredible service. This place is busy! My bartender Heather was a complete doll and I only drank water. It's super hot in PHX! The burger (cheddar and bacon) was wonderful on a toasted bun!!!! Yummy!"}
{"text":"Food and service were great. I had the green chile mac and cheese. The Sunbru beer had a good taste and complemented my food. The only down fall that did not get them a five star rating was that the beer was warm. We had to ask for a couple of glasses of ice to cool down our beers."}
{"text":"Service is ridiculously fast.  Power outlets under many of the booth chairs.  Free ad supported Boingo Internet.  Good selections for Vegetarians - including veggie burger option!   I found this place during a long wait for a flight back home and basically camped out here waiting for my flight.  The veggie burger was delicious as were the brews and the wait staff was very attentive and didn't rush me out or make me feel bad while I was sitting there nursing my beer while wiating for my flight.  I'd highly recommend to anyone flying through Phoenix who is hungry, wants to relax and has a little time so spare."}
{"text":"Worst breakfast ever.  I don't expect much from an airport restaurant, however, this was beyond awful.  The toast was soggy, the eggs and bacon were cold and barely edible and the service was horrendous."}
{"text":"Terrible service?Nobody came out to lead a seat, no body placed our order. After waiting 10min, the waiter \"threw\" the water on our table. Felt disappointing already before the food was serviced."}
{"text":"the fries and chicken strips were excellent. the iced tea too. the salad sucked...but that's what i deserve for ordering a salad at an airport sports bar.   i would come back"}
{"text":"The Kilt Lifter is really good. Had it on my out thru PHX and had it again on my way back thru PHX.  The prices are what you'd expect in an airport.  The food was average. It seems they have one deep fryer for every deep fried food you can order.  It was hard to tell the difference between the chicken strips and the fish and chips.  I've read other posts that said the servers were terrible. Not my experience either time I went and those were separated by a week. Each time I had a different server that was friendly and attentive to our table.  Additionally, the manager stopped by to make sure all was well on the second visit there.  They're pretty quick. I wouldn't sit down there with less than an hour to go toward boarding if they were busy.  I'd go back again."}
{"text":"The beer was good as was the service, but both the chicken strips and the AZ chicken rolls were very greasy."}
{"text":"We really like the breakfast or lunch at the four peaks in sky harbor airport.  Our last visit was for breakfast and the standard eggs and potatoes is good or have the beer bread which is their take on the breakfast  burrito.  If you have a beer with breakfast I recommend the Hop Knot but any beer is good at that hour."}
{"text":"We had a longer layover to eat and so going for a sit-down was an option. Seemed to be rather busy, although we were able to be seated quickly. Service to our table was regular in time- checking on our food, filling water. Food itself- I had a burger- was very good. Apparently the wine was not fantastic, but they should have kept in mind that this is a brewery, not a wine and cheese place. Definitely one of the better options throughout the airport."}
{"text":"Like everything in the airport, it's a bit pricey and not that comfortable. I'm a huge fan of their original Tempe location so was excited to stop in here before my flight to my new home in Minnesota. I was a little disappointed with the quality and service and more limited menu. If you have time, go to the actual location and only utilize this one for a quick beer before your flight."}
{"text":"I went thru the to go side the cashier was very friendly the fries were delicious and the beer bread is amazing"}
{"text":"Just walking around the terminal and. Priced they have four peaks. I guess I need to travel more often. Here is what I thought:  - seating host was friendly and kind and got me seated immediately - server,  Christine, very friendly and welcoming, a huge smile on her face and got my drink and water very quickly. While I waited for my food, I observed that she was on top of all her tables, checked in on all of them and made sure they all were doing okay. Great job! - My beer: I ordered the Raj IPA and it tasted great, it was cold and tasty and hit the spot.   - I ordered the turkey club with extra turkey and got the salad instead of Fries. the salad was disappointing, I wish I had the Fry's, it felt like it was ready made salad from a bag, and they added a couple of pieces of onions and 3-4 croutons. But the Sandwich was tasty, plenty of turkey and got the multi grain bread which was also tasty. Definitely will come back here next time I fly from terminal 4."}
{"text":"Waited to be greeted for close to 15 minutes. Once getting the seat, table hasn't been wiped. Mentioned it to the server while ordering food and beverage. Another server brought the food and spilled fries all over but never apologize. On a hot day like this 104°F even no brainer knows that we need to stay hydrated... I've finished my water the first 20 min of sitting down. Waited over 30 min to get water refilled. BTW table was never wiped once since requested. Highly NOT RECOMMEND and will NEVER return to this restaurant."}
{"text":"Just got billed over 20 dollars for a glass of Malbec. I looked everywhere but no prices written on the liquor menu. So I asked to see if there was a mistake and I am told \"Airport prices\". So beware ask for pricing ahead of time!"}
{"text":"10:40 PM. Stopped by to have a drink before red eye flight out. Restaurant / Bar about 75% full. Greeter takes us back to table since no seats available at bar. Server comes up and tells us tables are closed and to go stand by bar to get a drink. WTF?!?! Why take us to a table if the rude server tells us to leave? Never again!"}
{"text":"The Four Peaks Brewing Restaurant is locate for your convenience in the Phoenix Sky Harbor International airport. I enjoy a quick craft beer and burger here while waiting for my flight. The location is great to watch people interact with one another too. What a great Ideal to place this type of restaurant inside of the airport. It fun and opening, but the service is not always  fast. I believe it is this way because your meal are prepared when you order your food. I'm fine with this.  The selection was good and staff are accommodating. I like it. Thank you for good tasting food and good services.   Gloria~"}
{"text":"They have great fish and chips and such nice service. Really hit the spot between planes. Will swing thru again next time I'm in this airport!"}
{"text":"It's at the airport so it ain't the \"real place\" anyway, it ain't bargain priced and they would really like your seat soon..."}
{"text":"Good for airport food. Not an extensive menu- mostly burgers but you can get your burger with beef, chicken or veggie patty (I think that was the other option....). And I didn't get one but saw a few entrée salads that looked really nice too.   Got the blue cheese burger with chicken and side salad instead of fries. Chicken was juicy and good flavor/toppings. Side salad was just iceberg lettuce but had cucumber, cherry tomatoes, green peppers and mushrooms- so nice little salad.   Waiter (Matt) was very friendly and quick.   Reasonable prices considering it is at the airport."}
{"text":"Some healthy-ish options on the menu. Breakfast till 10.30am would be even better if it was all-day (as I arrived here at 11am.)  I got the chicken beer bread... What is that? Grilled chicken in a wrap and served with fries or salad. Of course I got the fries as I really wanted fish and chips but tried to be good. That was a mistake. The chicken was processed, covered in melted cheese which I picked out as cooled and congealed...(better left on the plate than in my veins.) I tried to enjoy this meal as I picked out the good stuff. Because the wrap was cut up you couldn't pick it up and it was too \"wet\" to cut. Then I looked around at this decor and noticed the odd combo of a dance music soundtrack. Very odd...something not quite right here. If I had to come again I'd probably go with the fish & chips or a burger."}
{"text":"I sat around for nearly 10 minutes while 2 bartenders actively ignored me.  I wanted food.  I wanted a drink.  But apparently it wasn't going to happen."}
{"text":"What an awesome addition to the PHX airport/ conveniently located in the high A gate section of terminal 4, this place covers three previous gates in space and has many of your favorite Four Peaks items.  I found the food to be as delicious as the outside locations and the service, though a little slow, was actually very friendly and hospitable.  You could see that there was indeed an effort to get it right and be speedy.  If you are going to eat here, be sure that you have at least an hour to spend."}
{"text":"Food and beers are absolutely amazing, four peaks always has good good and beer! The service is so so, it's an airport though with constant traffic and a lot of people flowing through the restaurant. I'd strongly recommend sitting at the bar for quick service! Give yourself about 30-45 minutes before your flight too."}
{"text":"Bummer, Four Peaks has been bought by Anheuser-Busch.   I remember going to the 8th street pub 15 years ago and ordering the fried potato balls (off the menu now) to go along with my pint of Kilt Lifter. Ahh, the good old days. But even still, the menu today has expanded from yesteryears and offers some really tasty items. You can expect traditional bar foods- burgers, sandwiches, pizza.   Come here for the beer though, it's excellent."}
{"text":"We needed a moment to slow down and relax before our flight. Four Peaks seemed like a great spot. And it did not disappoint! We started with a Four Peaks Grolsch Lager and a Don Julio Margarita. That hit the spot. Then we each had the 8th Street beer battered chicken strips. She had the fries, I had the fries subbed out for a side salad. The serving size was right on and filling.  However, the chipotle ranch actually tasted like blue cheese dressing?!?!   Overall, it was satisfying. The atmosphere was relaxed but loud. Lots of folks were watching the Winter Olympics and cheering.  Maybe time for another Don Julio..."}
{"text":"We came here since we had a 3HR wait for our flight and it was definitely good decision. The wait time was approximately 10mins when we arrived. Since we didn't have a long flight back home we only ordered appetizers/drinks. We ordered the chicken roll with a side of the beer batter fries. The chicken rolls were served with a creamy Jalapeño sauce. The portions for the appetizers were both filling and reasonably priced. The chicken rolls were $14.00 and the Fries were $6.00. The inside of the chicken rolls were almost like a chicken salad but with Anaheim Chili pepper instead of Celery. Our server was very tentative and kept checking on us to see if we needed anything. I been told they only have this Restaurant located in Arizona, I wish they had more places like this back home but it's definitely going to be part of my routine when we're back!"}
{"text":"Love Four Peaks. Stopped here before a flight. Been in this place many times. Beer good. Food good. Service good. A bit slow bringing the bill, but they were busy too."}
{"text":"Best airport beer / food / service I've had. Micky the bartender was great and the hop knot ipa was excellent even for a beer snob like me."}
{"text":"Like many others I'm sure, my flight was delayed by HOURS. I sidled up to the bar and was greeted immediately by Travis. I ordered a bloody and he asked which vodka I wanted - nice touch. I went with a double shot of goose, and asked about their mix. He said that they make the mix in-house which is always a plus, but almost unheard of for an airport restaurant! It was super spicy and flavorful, definitely would order again.   I ordered the wings and they were fine. I like a crispier skin on my wings and these didn't have that which means either they sat for a while with the sauce on in the back (which I don't think was the case as food was coming out quick!) or they just weren't fried/baked very long. Either way I liked the vinegar-y buffalo sauce a lot. The fries that I was able to sample from a neighbor were fan-freakin-tastic, an awesome crunch to the batter on the outside.   I was camped out for a while waiting and drinking, and Travis overheard me whining to my brother on the phone that it was going to die before I landed, and naturally my charger was in my checked suitcase. Travis brought me over his personal cord to use for charging while I was at the bar - the service alone would bring me back the next time I find myself in AZ."}
{"text":"Stopped in for a late breakfast.  The lunch menu does not start till 10:30.  Place was packed and had to wait a bit but not bad.  I ordered the breakfast burrito.  They call it something else but in essence, it is a breakfast burrito with a softer tortilla.  It was ok.  It filled me up but nothing spectacular.   Service is ok.  Depends on who you get and how well they can multi-task.  There beer is pretty decent.  Wish they offered a sampler set for those passing transiting through."}
{"text":"Lindsay was the most phenomenal waitress who has ever served me. She was prompt, personable and incredibly knowledgeable about the menu. The food was good, but Lindsay was great! I will be back, simply because of her."}
{"text":"Exceptional service and welcoming staff.  Stopped in for a glass o bubbly but got an extra 2 from the amiable bartender, tall, good looking, deep voice ack no name... He was very knowledgeable about local brews and gave me a taste of the \"PINE\" flavored drought, absolutely delish!  Easy to meet and greet fellow travelers at the Bar.  High recommend for the Chillax before the overcrowded bus flight experience."}
{"text":"American spiritual food experience!   Beer fantastic.  Burgers unbelievable.  Chicken rolls need to be a daily staple."}
{"text":"This review is for the \"To-Go\" section.   Service is very rude and the cashier had no clue what the order menu has on it. Otherwise, the food was quick and the fries are pretty good. The staff could use a little class on how to be friendly."}
{"text":"The worst chef salad I've ever had! Thought I was eating healthy by ordering a salad but it was low grade ingredients. Poor excuse for airport food. Service was also poor."}
{"text":"I am completely blown away by the food options at Sky Harbor. With this place and Humble Pie, these are restaurants I would patronizee outside the airport. Four Peaks has a nice open layout and plenty of TVs. The bartender new his beer so when he recommended the Kilt Lifter I went with it. Ordered the Italian Beef Beer Bread which had roast beef with sautéed red onion, green peppers, mushrooms, mozzarella and a garlic honey mayo rolled in their fresh baked beer bread. This is one of the best wraps I have had. The beer bread has much more character and depth than regular wraps. I loved it."}
{"text":"Sam is an excellent waitress. Friendly with good recommendations.  We had the salmon blt and chicken enchiladas."}
{"text":"Stopped to have a beer during a long layover at the Phoenix airport. The beer was good, I like lighter beers and the Sunbru was perfect for the taste I was looking for.   The service was great and the bartenders were friendly and quick.   I didn't have the food however it looked really good, will definitely stop by for food if the opportunity presents itself."}
{"text":"Service was fast and efficient . Only had some beer a day stout BBQ wings but they were delicious. All the food served around looked great. Prices were great too. I stopped at Chelsea's first but 9 Stella and 20 burgers didn't sit well. So after one drink, moved here. Glad I did. Prices are like normal places, no gouging. Will be back when I am in PHX. Gotta try the Scottsdale location when I return in a few weeks."}
{"text":"Thank you Shirlene and Rosemary for your exceptional service. They both went above and beyond to make me feel at home en route to my next destination! Food and beer were great! Don't forget to try the Arizona Gunslinger hot sauce. It was like nothing I had ever had before.   Michael Scott"}
{"text":"I had a lot of time to kill before my flight and needed a meal.  I couldn't bear the the thought of having lukewarm pizza or whatever else was laying around, so I ended up at Four Peaks.    The menu was ok and had a wide variety of the usual pub food staples and a lot of beers.  I ordered a chicken sandwich and a salad.  I got a bourbon as well.  The food was ok.  It came out a little dry, but wasn't terrible.  The salad was \"meh\", but wasn't the worst thing ever.  The service was ok, too.    I guess everything was ok, nothing was great, but nothing was crap, either."}
{"text":"Good beer, but the food was a little lackluster. It's located in an airport, so the service can fluctuate depending on how busy the terminal is at any given moment. That being said, they've got a big space with a lot of seats, so you probably won't have to wait too long even in a busy hour."}
{"text":"Just don't do it. I am an all to frequent flyer in and out of Phoenix. The food here is just ok. The bar tenders attitudes are larger than the airport itself. What a pain. Every time I stop here  I ask myself why I did it again. Tonight is the last. Slow service bad attitudes and you only get away  with it because it's in an airport. Go anywhere elsel"}
{"text":"Had a long layover. Decided to sit in here for that time and it was a great decision! Heather waited on me and did an excellent job. Can't remember the beer I had but it was fantastic. If you're not sure what to order then go with the eggs and enchiladas. Will not disappoint!"}
{"text":"We grabbed a quick bite to eat and had a drink in between flights.  The food was ok, but sure hit the spot since we were hungry.  The staff was friendly and let us stay and enjoy our drinks and friends before our next flight.  There are plenty of TV's around if you want to catch up on the latest news or sports while there."}
{"text":"The wings smell great! Great IPA's! Several tv's to watch, the food is decent, and the service was great. 4 stars for four peaks. It's an airport bar...none of them deserve 5 stars. So I recommend it.....I just hope I don't need to come here again. Anyone that travels knows what that means ;)"}
{"text":"The turkey club sandwhich was ok. The fries were awesome as usual.   The ambiance of the airport is much different from their Tempe, AZ location, but still a nice place to eat, drink, and relax before catching a flight."}
{"text":"This is a great place to stop for a bite before boarding a long flight.  That's just what I did.  This place is always packed and busy.  I was seated fast.  The server was friendly and efficient and the french dip sandwich delicious.  The only wait I had was waiting to get the server's attention for the bill.  However, my drink was constantly refreshed and he kept checking back."}
{"text":"Friendly greeting upon arriving, which is nice for an airport location. My server was also friendly, which was nice. Had breakfast m, which wasn't overly impressive. The order came out pretty quickly (again good considering we are in an airport) but the potatoes were not st all appealing and looked like they'd been cooked a few days ago and reheated several times. Why four stars then? Well they get bonus points for the service, the constant coffee refills, the cleanliness, and the power outlets available at many seating spaces."}
{"text":"Slow service and not attentive. Food quality and flavor was okay. Waited more than 5 minutes for a drink. When my food arrived I had to wait and ask for silverware even though my server was passing by the table not paying attention. At the end, server walked right by the table with my credit card down."}
{"text":"Just had the unfortunate experience of this location. To start with the bar smelled like dirty rags. There were a whopping 12 people at the bar and probably as many employees. Beer decent if you can get over the stench of a dirty bar. Food mediocre as I had to get my 2nd choice because they were out of the 1st. For as slow as it was and as many employees as they had working I would think someone could have asked me if my food was ok or if I wanted my empty glass refilled with another $8 beer. I thought when I brought my own water bottle out someone would have asked if I wanted water.  They were more concerned with changing tv stations to watch what they wanted and playing grab ass with each-other."}
{"text":"Not a fan. Not a fan of eating before flights to begin with. A small ten dollar bagged salad with crap dressing, extra if you want meat.  Four dollar bottle of water.   Bartender who took five minutes to bring a menu, ten to take the order, and another five to take the drink order.  Walked away after asking for the order then didn't return for ten.  It wasn't even busy.  Stalked away after bringing tap water instead of bottled.  No smiles offered no extra words at all. My connection was missed so I thought I was just coloring this experience with that palette. I left a small tip giving the benefit of the doubt. Not it. A big insincere gee whiz style \"thanks\" with a subtext of no thanks confirms intentionally poor service.  I wouldn't have chosen it if I did not get a food voucher and it wasn't close to the gate.  I wouldn't again unless I was trapped in Skyharbor and needed to get drunk."}
{"text":"The servers were so attentive but the hostess was so terrible. Condescending and so rude to us it was actually surprising. Wouldn't recommend this place unless you're ready for a feisty hostess."}
{"text":"This place is really cool , unlike other Airport restaurants they are super friendly and have local brewery products which include one Indian Ale called \"Raj\". So it is five star place .:) food is good . I had the chicken wrap which was pretty tasty and fulfilling.  I hade two different kind of beers and both were good . Service is fast and friendly ."}
{"text":"Clean, friendly, good beer!  Would go back any time I stop in the PHX airport. Top pick."}
{"text":"Beyond disappointed in this location. After discovering that my flight was delayed by over an hour, I walked all the way from gate C to get a burger, only to receive a wrap instead. Didn't think I needed to check an order at the Togo counter. Wrap was good, but very greasy, and dripped all over my napkins in the bag. Fries were under seasoned, and most were lukewarm at best. Next time, I'll settle for Panda Express. Such a pity after looking forward to their beer bread."}
{"text":"Love the blackened salmon BLT. It is amazingly flavored. Their sweet jalapeno dipping sauce is great with the fries. If you go expect to wait a bit but it is definitely worth the wait."}
{"text":"I was starving and kept putting off eating because we all know that airports can be busy and security checks can be long After getting through everything I was hungry and had about a good hour until my flight was boarding I was sooooo happy that this 4peaks was in my terminal I love the 4peaks near ASU campus and I frequent it many times  I love love love the Peach Ale It is a must  Bf and I shared a plate of chicken tenders and fries They were delicious  I really wanted to have a glass of Peach Ale but I didn't want to slam it and then be on the plane for 5 hours I was telling the server that and we both giggled She brought me a \"sample\" cup of Peach Ale which was enough to fulfill my mouths desire  Great service, it was a pretty busy time of the day but our server made sure to fill our glasses and check to see if we needed anything  Ugh now writing this has me hungry and wanting 4peaks"}
{"text":"A busy brewery restaurant at the Phoenix airport. I got here right before the surge of people just before 6pm on a Wednesday. I had the enchiladas with rice and black beans and they were very good. The service was surprisingly good as well for an airport restaurant. I'm not sure if it was a timing thing but just as I left the restaurant it was overflowing with hungry impatient travelers. Overall experience was good to very good."}
{"text":"Had a couple of hours to kill before my flight.  This place was busy and the wait was about 20 minutes.  Everyone there was probably on the same flight.  Ended up getting a table and the restaurant pretty much cleared out.  Ordered a whiskey and ginger ale to start things off.  Server offered me a double for $2 extra.  Of course I'll do a double!  Then we ordered our food and a beer.  I ordered the Popper Burger (has cream cheese and jalapenos and crispy onion strings).  I ordered the burger to be cooked medium.  The burger was super dry.  Also had a couple of beers to chill on and go with the food before the flight.  Good food to fill you up and grab a drink or two.  Burger wasn't impressive.  Beer was good though."}
{"text":"Stopped by this gem for a quick in-transit snack. Ordered a pretzel and a pint of Sunbru, the locally-brewed Kolsch-style ale. I've had some good german-style pretzels in my life, including those rolled by Amish girls in the downtown markets of Philadelphia. The pretzels at Four Peaks were phenomenal! Perfect crisp, buttery, browned outside, with a fluffy, bready inside. Salted just right. Went great with the light, refreshing Sunbru, with which I was equally pleased. The beer tasted so fresh and citrusy. And finally, the service was quick and kind. Will stop by Four Peaks every time I fly through the area."}
{"text":"very bad service! our waitresses were SO extremely rude ! they acted like they can't hear us and they kept rolling their eyes on the customers here! i was tired and the waitress BARELY opened her mouth to speak so i asked again what kind of soups do they have... she literally YELLED at me!"}
{"text":"Went here for breakfast and beer before flight. Convenient as it was right next to gate however that's where the goodness stopped. Waited at ta me for over 10 minutes without anyone coming by to even offer water. It was 8am. Not really busy. Finally a waitress came over after many others just milling around. That's when we were told 3 of the breakfast items were not available. That leaves 3 choices. Oatmeal fruit and regular eggs and toast breakfast. We were told the the hostess should have told us. The didn't. Food okay for airport food. Probably should have just gone to Matt's Big Breakfast instead."}
{"text":"I had a suitcase and large backpack, so I asked for a table.  Plenty of tables open and many open seats at the bar, but the hostess asked if I would sit at the bar.  Not enough room obviously for my belongings and myself.  I was rudely asked to move my things so that others could sit.  Again, I asked for a table b/c of my belongings.  She walked away from me.  The bartender rudely and loudly raises his voice and says he needs he chair NOW!!!!  You do realize this is an airport?  People have crap with them.  When they have a lot of crap, common sense should tell you the bar isn't the best place for them.  My bad for assuming they had common sense.  Bartender also never checked on the food, never asked if I needed anything else.   It comes time for his shift to end, and he asks for us to pay our tab so he can collect his tips.  He also tells us if we'd like anything else the next bartender can open another tab for us.  I've been a server for much of my life, and never were any of these things acceptable.  To comment on the food,,,,I had the turkey club.  There was no bacon on it like there was supposed to be.  The fries had a weird taste.  Old oil maybe, maybe they use one fryer to fry multiple things.   Horrible service and subpar food.  I won't be back."}
{"text":"No complaints here. I like eating in airports. I take into great consideration when eating in airports that I am eating in an airport. This was a fine spot that delivered exactly what I expected with the food and outdid themselves on the beer. Really nice oatmeal stout, decent enough breakfast burrito, friendly service, and a clean bar. I would drop in again if stranded in the terminal for a bit.   It's nothing extraordinary but the beer is great, the service is solid, and the food is good enough. Definite airport pit-stop recommendation."}
{"text":"Eh, airport food. You would think that being an airport restaurant the staff would be quick, but no. Our server went on break once we got a food so another server was left to gather our plates, refill our drinks and we ended up waiting for our server to come back with our check 20 mins later. I ordered the french dip and added on onions. The huge stack of onions was thrown on directly in the middle of the sandwich and not spread throughout so I had a bite of just onions and then none for the rest of my meal. As soon as my plate came the bottom slice of bread was completely soaked through so I had to turn my sandwich upside down just to keep it together. The au jus tasted and looked like warm brown water. I didn't add any flavor at all to the sandwich. My husband said his burger tasted like a frozen patty. Do yourselves a favor and unless you're looking to hang out for a while and drink beer, try one of the other options in this terminal."}
{"text":"Great place to grab an excellent burger on the run. Try the Southwest Burger. Excellent blend of spicy cheese and an Anaheim Chili on top of a burger cooked to your liking!"}
{"text":"As I travel a lot for work, Phoenix is always my favorite spot to go.  They have great restaurants here!  Luckily I ran into my favorite Server from Zinc, Natalie!  She is 100% honest when you ask her what she thinks of specific items.  She told me not to get a soup and I did.  She was more than willing to take it off the bill and get me something else to eat. All you gotta do is be polite and nice and everyone will go out of their way to make you feel welcome. The food was good for airport and bar food. Not exactly top notch but I was satisfied. The fries were the best! Natalie recommended trying all the different styles of ranch and they are fantastic.  Next time I'm going to have to come in for all the beers!"}
{"text":"I had a  short layover at PDX on my way home from Mexico. Four Peaks was right across from my gate and since I was in desperate need of an IPA after drinking crappy Mexican beers for the past two weeks, decided to give it a try.  The place was packed and the staff was really busy but I was able to score a seat at the bar and the cute bartender quickly brought me a tasty Raj IPA.I also had the Bavarian pretzels which were just OK - a little too gooey with a lot of butter melted on them. Based on the beer, I'd definitely go back the next time I'm at PDX"}
{"text":"Perfect spot for a layover. I had a southwest burger and an IPA. It was delish! Jeffrey our server was attentive and friendly. I usually expect the worst when dining at airport establishments but this was a pleasant surprise. I'll definitely be back!"}
{"text":"Delicious breakfast. Attentive and quick friendly service. Great value for an airport. They went way above and beyond to take care of me and I fully recommend this place."}
{"text":"As my bartender Travis said, who knew that airport food could be so good. My Salmon BLT was so freakin' good.  And the fries, wow.  I initially asked him for ketchup for the fries.  But when I tried them, I realized they were just as good or better than with the liquid tomato. But the star was the sandwich.  The bread was just right and the salmon was excellent. Tomato and lettuce were fresh. And Travis was a very customer-friendly bartender. Guess where I'm going next time I am in Sky Harbor?  That's right!  Hopefully I'll be able to squeeze into a seat at the bar again, though.  This place gets PACKED!"}
{"text":"Had a 3 hour layover and decided to get some food to go. I ordered a burger and it took 45 mins to get out when the cashier claimed it would take 10-15 mins. The patty was half burnt and the other half was not cooked all the way. The presentation was terrible. The buns, fries, lettuce, tomatoes and onions were just thrown into the box making it a terrible mess and hassle to eat. I do not recommend eating here because the staff does not know how to handle a fast paced environment or dealing with customers. Their fries are the only thing going for them."}
{"text":"Just had lunch here on a Saturday during bowl week. It was busy. Wound up eating the elk burger and the beer sampler. We also ate the calamari as an appetizer. It was all pretty good. I don't know if it was because the Sun Bowl was on, but it was quite busy with a long wait on a Saturday afternoon."}
{"text":"Wow - was thinking this burger and soda were mediocre but I actually got sick on plane. Burger and Pepsi; even the Pepsi tasted questionable. Nice servers, surly hostess, and terrible food."}
{"text":"Great food and beer, what you would expect from a bar,  But the hostess sneezed while seating me into her hand and then placed my napkin and utensils on the table with the same hand. Not my favorite thing to experience."}
{"text":"We have visited the full Four Peaks location in Tempe and enjoyed it, so it was great to have our gate right beside the Four Peaks outlet in terminal 4. We visited at 8am on a weekday and were provided a table with enough space for our luggage. Service was very fast--always appreciated in an airport.  I ordered the fruit plate. Wow, was I impressed. It included black and red grapes, whole strawberries, pineapple, honeydew, cantaloupe and massive blackberries. It was $7! I would have almost paid for that a piddly container of fruit from a myriad of airport vendors. Everything was fresh. I ate my fill and shared some as well.  My husband had the French toast and enjoyed it greatly. It had a full stack of chewy bread accompanied by fruit and a paid addition of bacon. It even looked beautiful.   The restaurant filled as we sat there, but we were still checked on several times by our server and a manager, and had the check in good time. I wish more airport restaurants were this pleasant and efficient."}
{"text":"Four Peaks is great, but service at the Airport is horrible and slow. I suffer through it normally, but today I left before being seated. After 10 minutes of standing and a line accumulating I asked a bartender if we could seat ourselves, she told us only at the bar and walked away. Nobody helped us and they were not very busy.  So we we walked away."}
{"text":"This place will make your layover blues go away.  Theres a lot of reviews already so I will keep it short and sweet and tell you the essentials.  Great beer!  Kilt Lifter is strong and flavorful for the guys.   Peach beer is light and tangy sweet for the girls.     Menu is limited to standard bar grub- burgers and wings.   I had the Southwest Burger and it was very good.  OUTLETS UNDER THE BAR so you can charge your phone.  Also a SPRINT PREMIUM WI-FI hot spot."}
{"text":"Cool. Vibe. Get crumb here. Loud music. Cool device to pay or order. Bar menu.  Not for healthy eaters.  Breakfast till 1000"}
{"text":"I was surprised for an airport bar how slow the service was. However I enjoyed the peach beer and the burger I ordered. It was cooked perfectly to my liking; medium rare. With amazing blue cheese crumble.  It was very crowded so I'd think it's the spot to be in the terminal; but also think they'd be able to handle customers in a rush to catch a plane"}
{"text":"Pretty solid place. During my recent layover from San Diego to Austin, due to delayed flights and whatnot, I decided to have a filling breakfast since I wasn't sure when I'd be able to eat again...and not wanting to buy any of those 'snack' boxes on the plane.  I ordered the Enchilada and Eggs breakfast and it was massive...and filling.  No regrets :-)"}
{"text":"Yay! The pretzel is vegan possible. Just make sure to ask for no butter! Also, the fries have egg so be careful.   The beers are great and watching people scurry around the airport."}
{"text":"Zero Stars... if you have an early flight, DO NOT count on this place opening early, open on time, or even have warm food to serve.  This place sucks something fierce for AM flyers.  Don't waste your time..."}
{"text":"I needed to eat lunch today before I checked in for my flight so I stopped at the Four Peaks. It's hard to get a good meal in the airport when your choices are so limited. All the food is always so overpriced. I ordered a Chicken Caesar salad which was just ok. It did have fresh tomatoes on it. I would go back because the service is so good."}
{"text":"Solid hop knot and sweeter kilt lifter. Can get crowded but worth the wait if your schedule permits.  Variable service makes this 4 stars but most staff and menu items can push 5 considering its in an airport."}
{"text":"It really sucks that I have to write this, all other four Peaks locations are fantastic.  I don't think the people working here are smart enough to realize that this is an airport and people are here to fly somewhere not spend a leisurely morning sitting around.  I wish I could talk about how the food was but I can't, we waited 50 minutes for our food before we had to just walk out, because we had a plane to catch.  It's really sad and a poor reflection on a great chain.   There are lots of amazing places to eat at sky Harbor, this is not one of them."}
{"text":"Don't bother for breakfast unless you want a beer. The menu is limited to a few pre-packaged, likely warmed-over options like scrambled eggs (extra $1 if you want a little cheese on them) and premade enchiladas. No gluten-free options at all (mandatory for me) and they could not even substitute corn tortillas for bread because those were pre-packaged too.  Servers are nice but they can't fix the food. You can do a lot better elsewhere in Terminal 4. Should have figured."}
{"text":"Great place!!!  Returned here on our flight home! Laura is an awesome server with a great personality! Enjoyed talking with her and her wonderful customer service. Five star restaurant and five star + server. Thanks Laura for all the laughs, see you next time and thanks for the bacon!!!"}
{"text":"It took nearly 10 minutes for the cashier at the take out counter to tell me that they didn't have the food item I ordered and then when I switched to a basic sandwich it took another 15 min to get my order. That all would've been fine if the staff had let me know and been polite but the cashier said it would only take 5 minutes and then proceeded to complain about me to the cook within earshot after I asked nicely how long it would take after I'd been waiting 20 minutes and I had to catch my flight. Awful."}
{"text":"Food was good sure but one server whose name is Laura made it the worse possible experience. I arrived at the restaurant at 4pm and my flight boarding time as 4 so as she came up to take our drink order I politely asked if I could order some food now. Her response was a straight up \"no\" with no explanation and walked away. Horrible experience."}
{"text":"Waiter with long hair (George P)was a complete jerk. Rude, condescending, and not attentive at all. Will never be back."}
{"text":"Disgusting- layover in Phoenix airport. Runny powdered scrambled eggs, deep fried \"breakfast potatoes\", grilled bread... Never again"}
{"text":"Works in a pinch however my silverware was dirty and the coffee was very weak.  Will not go there again. Silverware should be cleaned and then polished before giving to customers."}
{"text":"Came in 5 mins before Kitchen closed and we went to the to-go area. Me and my mom ordered the Francia dip and a brownie. The lady that helped us was good, but then we wanted to sit down. We attempt to go to the only sitting area I'm aware of and this rude (looked like) bald manager told us that we couldn't sit there. I understood. Makes sense. Oh there is another sitting area for the to go orders alright but this man didn't calmly explain that. Instead he had a tone and spoke down to us. To say the least we were peeved  Other than that the Francia dip was good. My mom enjoyed it. I thought the bread was too salty. Comes with fries."}
{"text":"Bloody Marys were terrible. Food was good. Staff was good. Bartender needs some training"}
{"text":"Powdered eggs for making scrambled eggs?  Disgusting and a waste of money - just hope you fly out of the \"B\" Concourse so you can go to Matt's Big Breakfast.  Sat the bar for breakfast, only 2 bartenders to serve the entire bar - not once did they offer to refill my coffee.  Not enough food runners, waited and waited and had to ask to get my bill....really bad experience, I was truly tempted to dine and dash!  A guy sat down next to me and asked how the \"Brewer's Breakfast\" was, I told him disgusting...he said thanks and got up and left - a real-time Yelp! review right there.  Maybe they should just stick to schlepping beer."}
{"text":"Ugh. Airport food. Good beer."}
{"text":"Two stars because the server and hostess were good, otherwise zero stars for everything else. Please don't charge 12 dollars for a meal if it comes out cold and the bacon chewy. Also my French toast tasted like they cooked it in salt. It wasn't edible. The coffee was also cold. The server offered to remake both meals but we didn't have time and my 18 month old was hungry :/"}
{"text":"I wasn't planning on yelping this location, and I didn't take pictures of anything besides a beer... but after enjoying some amazing hummus with fresh pita and veggies... my son thoroughly enjoying a perfectly cooked burger, and the most amazing French fries we've ever had... I decided we really needed to report on this. The atmosphere is casual, the servers are great. Travis Sayer was our server, and he was unbelievable! So prompt, attentive, informative, friendly, etc. he needs a raise! The brews are stellar. Tilted kilt is my favorite. Next time you're looking for a pit stop at Sky Harbor, choose Four Peaks!"}
{"text":"This Four Peaks SUCKS!  Shows their hours are open till 11. Showed up at 9:30 and they said they close at 9. Flights still going till 1AM. They should stay open until 11 at least. Will never buy their beer again!  And you shouldn't either!"}
{"text":"Wait, wait...what? This is a restaurant in...an airport?  After an early four hour flight from Pittsburgh to Phoenix, to have a four hour layover waiting for a flight to Los Angeles, we were hungry - the cookie and coffee on the plane didn't exactly do the trick - we walked around to see what we were going to be stuck with in the airport. There were all of the usual dregs to choose from, but then we stumbled across Four Peaks. We checked out the menu, and were a little pleasantly reverse sticker shocked, and the offerings looked pretty good, so we gave it a try.  The staff was pretty hipsterish, excessive beards and man-buns...two of them looked so much alike, they could have been brothers. But our server was a more 'regular Joe', and was very nice.  Having left Pittsburgh at 7 am, and arriving four hours later, we were ready for lunch, but after four hours flying across time zones, we arrived at 8 am. They were only serving breakfast or appetizers, BUT they asked if we wanted to start off with a Bloody Mary or Marguerita. We got a laugh out of that. Breakfast and booze.   The appetizers were a little more lunch-ish, so I ordered some wings, a Spicy Thai Peanut, and my better half just ordered a ginger ale, and I had an iced tea. The wings were quite yummy, juicy enough, and with a very nice zingy sauce.   The staff was very nice, and even a little entertaining, One guy started singing and was kind of adorable in the 'fun guy at the bar' kind of way. The service was perfectly efficient and helpful.  After we'd been there a while, their menu opened up to lunch, so what the hell...we have four hours to kill...and my better half could order something for lunch. So he ordered the Chicken Beer Bread, basically a decent sized quesadilla, and both of our portions were plentiful, and good quality.   They kept the beverages filled, and all in all...when the bill arrived, I was kind of shocked. Only $30...for this level of portion and quality...in an AIRPORT??   I don't know if I'll ever be back to the Phoenix airport...but if I am, this is definitely where I'll be going for food. I wish more airports would make this effort. It was the best airport food I've ever experienced. Thanks to Daniel our waiter."}
{"text":"Surprisingly great place for dinner and beer in the Phoenix airport. Our hamburgers were delicious and the fries were soooooo tasty. Not all of their beers were available (bummer) but we really enjoyed what we tried. If we'd had more time, we would have had a 2nd pint (who wishes they had longer in an airport?!?). The only drawback is the price tag: 2 beers and 2 burgers totalled $50. Whew. Airport overhead costs must really suck for the vendors."}
{"text":"The waitress here had the worst attitude ever and wasn't afraid to show it. To add insult to injury the subpar turkey club I ordered to go, took over 25 minutes to make, almost making us late for our flight. First time in my whole life I didn't leave a tip of some kind. This place is a Complete fail!"}
{"text":"The drinks were good but the price tag left me feeling incredibly upset. My waitress was super nice, but the place was crowded. For every pro, I find a con. I am glad I went here because after my experience I was able to sleep through my entire flight (pro tip: take a Dramamine after drinks and thank me later). Unfortunately, I now do not have enough money to take an airplane again because my drinks were so expensive. With every rainbow comes rain."}
{"text":"The only things I liked at this place were the environment, there were outlets to charge your electronics and over all it was comfortable. However, I was assisted by rude hostage, who didn't even bother to walk me to the table and was more interested in having a conversation with the other hostages. It doesn't stop there, the waitress was unfriendly, argued with another server in front of me and she let me take my time to decide what I wanted only to later tell me that, they were only severing food from the first place. Then, the food came and it looked very appetizing but looks were deceiving, for it had no flavor at ALL. The service was not only slow but it was also very poor, on top of that, the food didn't even come close to making up for it.  So in conclusion, will I ever go there again, nope, NEVER. (Unless I was dieing of starvation).... I hope they take this review seriously and make the necessary changes!"}
{"text":"Food was delicious.  Way better than expected from airport food. Had a kilt lifter draft and turkey club. The fries were a+.  Super crispy."}
{"text":"Fantastic. Very busy and loud but when it has the best fries in the air port it's expected! Blue burger and the jalapeño burger were great! We didn't care for the Chicken rolls (an appetizer) just because it wasn't our thing, the waitress picked up on that and refused to let us pay for them! :) very happy couple and will come back!"}
{"text":"Was seated quickly and thankfully the kitchen delivered the food quickly too.  The soups were incredibly too salty but the quesadilla wasn't bad.  Wine pours were decent with a nice selection of wine and craft beers.  3 stars for speed and being able to eat and make our connecting flight."}
{"text":"Brewers Breakfast was terrible! Cold powdered eggs, soggy hash, so so fruit. All for the bargain price of $11 plus $3.29 for coffee (sorry no decaf)  Kudos for the prompt service...:-/"}
{"text":"Sub par food, even for an airport   Way subpar service. I received my meal before my water or flatware.   I guess there was just 1 person serving my \"self seating\" section. She was nice enough but it took ages to just get a menu or be a acknowledged, even though the hostess said I could sit there. It was just an aggravating experience.   After sitting for over 10 minutes waiting, & waiting I had to turn around & look for someone to bring me a menu. Seems petty but traveling, in a skirt for a business meeting & sitting at a high top- yah- not convenient when half the airport walking by can see you squirming to turn around graciously while not flashing the airport walk way!   Yes I tried to get a normal seat or a seat at a bar which were all full. It was lunch- I get it was busy so tossing a star on for that.   The salad was mediocre at best. The cubed ham, I always find off putting. There's gotta be a better presentation. It was a substantial serving but the cucumbers seemed old, the dressing & lettuce were fine but the ham was not good. Needed to disguise the taste with the dressing.   I would have loved to have received my silverware before my meal so I could avoid the awkward turn around again, to flag the buser to get me flatware. Also it's the airport. People are in/out for flights. Is it too much to ask to request you bring the credit card machine when I ASK for my check? Why then go get the check & not bring the machine?   I worked in service & this was worse than average, this was major lack of thought- especially considering she was chatting away with the beer drinkers next to me. I don't plan to return unless all other options are packed again. Would rather get a \"to go\" salad."}
{"text":"Most of my review is about my customer service experience but I'd like to first touch on the food. The \"beer bread\" is actually a tortilla. The chicken had funky chewy chunks in it. Not worth it   Next, we went to the express line for two sandwiches (aka wraps). They told us 12-15 minutes. It actually took 40. We got to our gate 20 minutes prior to take off and they had shut the doors so we missed our flight. The worst part was the bald man that works there tried to tell me we'd be fine because they'd be boarding until my flight. He tried to educate me on how boarding works. The short girl actually tried arguing with me about the fact that they took over double the time. The manager was the only one to apologize but only refunded us once we came back to tell her we missed the flight and demanded a refund. Stay away at all costs."}
{"text":"Consistently crappy.   I fly through here often. I can't remember every having a pleasant experience here.   Took 10 min to get a cider.   The only reason this place gets a 2 is that it's the only bar in this terminal."}
{"text":"Had a 2 hour layover in Phoenix and I always enjoy trying food that is \"native\" or local to the area I'm visiting, especially if I don't really plan to visit the city or area itself. As soon as I hopped off my plane, there was Four Peaks and as I looked over the menu- my choices were narrowed down to the Arizona Chicken Rolls or the Garlic Cheese Beer Bread..both sounded delicious and I wish I had stomach space for both. But thanks to the AMAZING attitude, service, and energy of my cashier (wish I could remember her name, she was super lively and helpful at giving me the best option on the menu for a first timer) I went with the chicken roll.  I would describe it similar to egg rolls you get at Chinese restaurants but a million times better! Inside the lightly fried pastry, there is grilled chicken, Anaheim chile's, pepper jack cheese, cream cheese and accompanied with a really tasty sweet jalapeño dressing. I enjoyed it all, only two come in an order but they are a good enough size that I felt satisfied after eating one and saved the other one to give to my siblings on my trip to miami. Only $8 for the rolls and we'll worth it."}
{"text":"Food was decent. I ordered the French toast but had to wait a little while for it sitting at the window so if you are in a rush this isn't the place for you. All 3 of our silverware we're dirty so make sure you check when eating here."}
{"text":"If you are at PHX this is the place to stop for food. Good burgers and better beer. It is s true local restaurant in the airport."}
{"text":"finally got to phoenix after a 4 hour delay in Newark. Glad to have gotten off of the plane an not sit so we went to look for some food. The place was busy and the reviews looked good so we decided to try it out. Ordered the pretzel and quesadilla. The pretzel was extremely salted down with butter/oil. It was so slippery to even hold. Had to get napkins to soak up all of the fatty oils. The quesadilla was greasy as well. It was oily for some reason. Wasn't too happy. Lacked chicken. And a glass of wine was $9.00. Not worth the $30.00. Thought the day could get somewhat better."}
{"text":"Cool place but any that requires a wait list for the bar is definitely going against standard restaurant protocol.  That being said they have a stand up bar where we were served two hop knot IPA's with the quickness!!  I am so hoppy now!"}
{"text":"So on a recent layover in Phoenix I was looking for somewhere to grab a drink and lunch. After pulling up Yelp I saw a fellow Yelper, who I follow, had been and given them a good review. The place was packed but luckily I got one of the last seats at one of the high top tables.  After being seated I was greeted and ordered a drink, vodka and cranberry, and for $3.00 more I could make it a double. Why not? While I was waiting on my drink I checked out the menu. I was torn between the Club and Quesadillas. After asking my waitress she recommended the Quesadillas. Perfect choice. They were packed full of cheese and chicken accompanied with sour cream and salsa...and I will just say I wish I knew where they got their salsa, one of the best I have ever had! Service was on point and a great spot to hit during a layover in he Phoenix airport."}
{"text":"Excellent service and delicious food. The southwest chicken chowder was outstanding. We had great service with really good recommendations. The beer was tasty too. The best was the charging stations under the bench seats."}
{"text":"Really poor service. Food was fine. I doubt I'll return. 3 bartenders working and none of them checked back in with me after getting my food. No utensils were provided."}
{"text":"$5 craft beer pints.  In an airport.  Whaaaaa??  Best. Airport. Deal. Ever.    Even though it's cheap beer, don't expect the quality to disappoint.  They put out a good product!  If you're looking for a beer in the airport, do yourself a favor and stop in here so you can get a real beer, vs. some $8 macro crap served in most other airport bars.  Their wheat and IPA were good, but don't take my word for it...Untappd and BeerAdvocate like their product as well.    Don't fall into the trap of the 20oz beer though; at $7, it's more expensive per ounce.  $16 oz is where it's at."}
{"text":"Good burger and friendly staff at the closing shift.  Also fast service.   Good place to stop to get a bite to eat between plane transitions"}
{"text":"Had a popper burger. Best darned burger I ever had. 1/2 pound of flavor perfectly grilled. This monster with all the toppings was nearly impossible to take a bite out of. I had to take a to go box for the fries because I was too full to eat them. No wait for a table or food, but it was mid day on a Thursday, I can imagine on a busy travel day this place is packed with long waits. If you have time it is worth it."}
{"text":"Stopped here in between flights. Had fish and chips and a peach ale. The food was good, nothing special. The drink was good. The service was GREAT! Very friendly, would definitely come back just for the server and a drink."}
{"text":"It pains me to say this - because I am a huge fan of the other locations, but breakfast at this airport location was just terrible. Very slow service, and a Brewers Breakfast that was (other than the toast)  totally inedible. To be fair, the waiter did not charge me for it and asked if I wanted to try something else, but because of time constraints, I was not able to stay. Because of the effort, I gave three stars - but I would be very hesitant to eat breakfast there again. I have had better experiences with their lunch."}
{"text":"It's reasonable airport food, I mean how high can your expectations be right? The service was a bit on the slow side so just make sure you ask for your check at the same time you place your order and you're good to go. The burger was decent but well over medium but beggars can't be choosers right?"}
{"text":"Best airport breakfast ever!!! The Brewers breakfast plate was delish. The bacon, potatoes, and buttered sourdough toast were crisped perfectly. Turnaround was quick and the waitstaff were on the spot with the click of a button."}
{"text":"Should have had a beer and not the 'battered' fries.  Unfortunately they were tasteless , which is odd for fried potatoes. No amount of salt, pepper or ketchup would have woken these denizens of the fryer.   The staff were busy, but competent.  Impressive.  At least on this day one business had enough staff to take care of the customer."}
{"text":"Speaking of Airport Food prices . . .   Plane coming from Colorado was delayed by 2 hours 10 minutes.    So I went to Four Peaks Brewery & ordered a Ketel One Smoked Bloody Mary ~ Kettle One Vodka / Smoke / Loaded Bloody Mary Mix / Worcestershire Sauce / Server said it had a BBQ flavor.    It was perfectly blended & refreshing.    I don't know who started the trend of leaving the prices off the Cocktail menu many years ago.    I also ordered a Chef Salad ~ Ham / Turkey / Bacon / Egg / Gorgonzola / Candied Walnut / Cucumber / Tomato $13.  It too was delicious.    When the bill came, the Bloody Mary was (gulp) $15.  Plus tip.  That's a new high for me.    A $35 Lunch ~ no Soup / no Dessert."}
{"text":"I have been to the Four Peaks in Scottsdale and this is my first time at their Sky Harbor location. I have had their sandwhich before but I have to say nothing beats their southwestern rolls. yum!! chicken, pepperjack cheese and green chiles, yum! must try them. They were very busy and our server, George P, was fantastic. Attentive, turns tables over quickly, and boxed our food for us individually cause he knew we were getting on the plane, but didn't rush us out after we paid our bill, we felt comfortable wasting space while finishing our cocktails."}
{"text":"Is this spot seriously in an airport? Seriously? I still can't believe it...  In my humble and largely uniformed opinion, the Four Peaks location within the Phoenix airport is the epitome of airport dining. For one, how amazing is it to have a local business offering a much more appealing option over your typical overpriced chain dining options at the terminal? Secondly, this is not only a local business, it's a local brewery! Lastly, the prices are ridiculously reasonable!  The setup is no frills and right down to business. Bar in the center with numerous flat screen TVs (perfect for watching some NFL the day I was coming through) with tables and booths spread out around the perimeter of the restaurant. It seems that this place can get pretty packed (are you surprised?), so it may be difficult to get a larger party seated if you're hitting this spot at peak times (we had to split up our party of four).   Since Four Peaks is a brewery, let's talk about the suds, shall we? The bottom line is that these guys seem to know what they're doing as they are putting out some tasty, quality brews. While here, I had a pint each of the Hop Knot IPA and the Raj IPA (an English IPA). The Hop Knot was good, but a bit lighter and less full bodied than I typically like my IPAs. The Raj IPA, however, offered up that good hoppiness and bitterness. Yum. My buddy had the Hefeweizen and found it excellent as well.   Did I mention that the pints are only $4.50 here? Yes, you heard right...a very reasonable price for freshly brewed local craft beer with character as opposed to other airport dining establishments where you're paying up to $10 for a pint of Miller Lite. Thank you, Four Peaks!  Food wise, this spot again went above and beyond expectations. I opted for the grilled chicken beer bread, and I've been craving it ever since. Grilled chicken with artichokes, mushrooms, green peppers, red onions, and cheese all wrapped up in freshly baked beer bread. This dish was way above and beyond any airport food I've had in the past. Plus the sandwich was huge and came with a pile of delicious french fries...all for $10! Seriously, the prices here are so very much worth it!  Next time you've got a layover in Phoenix, do yourself a favor and check this spot out!"}
{"text":"Same as their other locations just in the airport. Beers are not too crazily only priced. $5.50 for a pint and $7.75 20 ounce"}
{"text":"I stopped in for dinner and a few drinks while my flight was delayed. Got to love American Airlines! NOT. Beer was cold and food was amazing. They were super swamped and the service was quick and steady. Great place to come and enjoy extra time while waiting for your flight. Go for it! Grab the four peaks craft pale ale. Wow."}
{"text":"Let me set the scene: I've got a 4 hour layover in Phoenix, And I'm hankering for a beer. --Enter Four Peaks Brewery\"--\"brewery\" in the name means that not only do they have beer, but they have local craft beer. I'm sold instantly.  Now, I didn't have high expectations for an airport restaurant, but now I feel bad for underestimating them! I ordered a few peach beers (very light and tasty), and a \"southwest\" burger. The burger had a great charbroiled flavor, and came topped with a big slab of soft, poblano pepper. I ordered the burger \"medium\", and I would say it came our just slightly more cooked than a medium, but still juicy.   Overall, I was really please with the flavor in everything I ate and drank, and the bill wasn't too steep (considering it is an airport location). If you're swinging though PHX any time soon, I would recommend Four Peaks to fellow craft beer and burger lovers."}
{"text":"4 stars because this is a welcome sight for a 1 hour layover.  Never been to Arizona but I appreciate a local brewery experience.  I didn't try any of the food.  Had Kilt Lifter and Oatmeal Stout, both pretty decent and then back on the plane."}
{"text":"I always look forward to coming here for their breakfast enchiladas when I have a morning flight. They really are the best enchiladas. Ever. You get two shredded chicken enchiladas with tasty green sauce & cheese, plus delicious black beans, diced potatoes & a side of sour cream."}
{"text":"Juicy burger was flavored nicely. Steak fries were great! Did not try the alcohol. That's ok though, as I was pleased with the meal. This place gets full. Give yourself ample time to eat and pay the tab before heading to your gate."}
{"text":"While waiting between flights - this place was a gem! We needed a real breakfast, not another Danish & it was very good.  French toast with perfectly cooked bacon & these terrific crispy potatoes.  Wait staff was good also."}
{"text":"Deandre was quick to serve, attentive, and offered a tasting of the beer before purchase. Great service, a nice beer, and an enjoyable meal while waiting for my flight."}
{"text":"I used to live by Four Peaks on 8th so I come here everytime I fly through PHX for nostalgia reasons. Generally, the service is really good. The food and beer is on par with the regular locations (which is good). I have to rate 4 stars though because the service COULD be a bit more efficient for an airport location. The burden of managing your time before your flight is really on you here, which basically means sometimes you have to flag your server down when you need to get to your gate. They understand, of course, but it can be a little rough for someone with anxiety."}
{"text":"Flying through I stopped at 4 peaks for a late dinner.   Pros: great service, good beer selection, convenient, and decently priced.   Cons: not a large menu, especially if you want something that isn't a burger, not a lot of space, and the food was only ok.   I ordered the fish and chips with a side salad. The fish was ok, but small and had a ton of breaking. The salad was decently sized, but didn't taste real fresh. However, the dressing was excellent (jalapeño).   It's one of the only sit down places in the airport and it worked just fine. The service was good and I had an overall good experience."}
{"text":"A full service restaurant in the Phoenix airport that serves breakfast? Yes, please! Our food was great and service was speedy and courteous. Unfortunately, it was too early for drinking but of course they had a full set of taps for all our Four Peaks favorite brews. I will stop here again before my next flight.  They are located in the northwest section of Terminal 4, in the US Airways section for gates A15-A30."}
{"text":"Wouldn't chance it. No concrete hours posted, no number to call. The Four Peaks website indicates that this location will remain open til last departure in this terminal. The gate directly across from here had over 50 paying customers that were booted at 10:30 and it was a while from departing.  A little transparency and honesty would go a long way here.  Beer is OK. The choices are limited compared to the other locations and the food is decent for airport food.  This reminds me of the Great Lakes Brewing location in the Cleveland airport but much more poorly executed"}
{"text":"Normally I don't have many good things to say about airport food. It is mostly bland and greatly overpriced. This place, although it fits in the same category I just described of being overpriced, actually has overall good food, at least when it comes to breakfast. I got the chicken enchilada and egg breakfast, and my husband got the brewer's breakfast. The chicken enchiladas, green sauce, and beans all had a nice zesty flavor. The potatoes were disappointing, however, because they were clearly frozen out of a bag rather than fresh cut. My husband was mostly happy with his breakfast. He also didn't care for the frozen potatoes, and he didn't like that his breakfast only came with one piece of toast. Bread is cheap; there's no reason for it. He ordered one additional piece of toast, which came with a hefty price tag of two dollars and change! We got coffee to drink, and it was $7 for two small cups of very weak coffee. The waItress barely checked on us, so we were lucky to even get a refill. I don't know what their lunch foods taste like or their alcohol, but based on how delicious and memorable my own personal breakfast tasted, I will still give this place four stars."}
{"text":"Been sitting here for 15 minutes, no one has even glanced my way. I have a plane to catch and just wanted some food, honestly I can't waist any more time waiting for these people to get off their a$$'s and bring me a freaking glass of water to start. Watching the girls working here text on their phones and socialize ... totally ignoring the customers inc me. I'm right in front, next to the host stand and it's like I'm invisible, oh jeez maybe I am invisible and just didn't realize It!   Either way, a pretty pathetic display. Guess I'm gonna get up and go eat somewhere else. So Lame."}
{"text":"Airport restaurants are rarely that great, and this is no exception. Our server was chatting up with all her friends/customers and it got pretty loud for a good while, which irritated my anxiety-prone husband. Food also took a while, and all was rather mediocre. Let me go into detail:  Buffalo Wings: These were decent, though the (what I assume was blue cheese) dip was very light and didn't do so much for the wings. For a girl who was mad craving some wings, this will suffice.  Salad: Honestly, it was so mediocre I don't even remember it. I just remember eating it all and being okay. Yup, just okay.   Everything here was really A-OK. I don't know what else to tell you. Even the beer selection is mediocre and for a \"brewing company,\" there really isn't much. Maybe I should've stuck to the burger; hubby had the burger and said it was pretty good. Honestly, I wouldn't come here again unless I had to."}
{"text":"Who stops serving breakfast before 10am? Especially on the busiest flying day of the year? Ridiculous. I asked for a potato vodka for my bloody mary and the bartender got annoyed that I asked for a different vodka than well. Sorry I didn't want well. I just upsold my own drink for you! After she said no they didn't have a potato vodka there was an awkward pause because I was waiting for her to suggest something else.. nope. So I had to. But to be blunt this is the worst bloody mary I've had in my entire life. Wish I would have sat on the other side of the bar and to have the other bartender."}
{"text":"First had Four Peaks a few years ago when I lived in Tucson. I remember it was good but not impressive.  Flash forward to a few weeks ago, we had a 4 hour lay over in PHX coming back from Mexico. After a week of dox equis i was craving a good hoppy pale.   The beer was very pleasing, the appetizer was good, my wifes burger was good and i ordered the italian beef. I did not realize it had blue cheese in it so I did not eat much of it. I wasn't starving so I didn't say anything. The waitress noticed, asked and when I told her that I wasn't a big fan of the blue cheese (being honest) not really expecting anything to come of it (i should have read the menu better). I was pleasantly surprised when she offered to take it off the check. I was appreciative and made sure to tip her well for the unexpectedly good service (at the airport!)."}
{"text":"Not sure about other items, but the waiter recommended the French Dip and it was hardly edible.  Lots of meat, but so tough and rubbery, I could barely bite it off and chew it!"}
{"text":"What a great surprise for food AND service inside an airport. Food was good and very reasonable and the service provided by Katie was outstanding!!!!"}
{"text":"For being a brewing company & having their main focus be their beer. Four Peaks surely has some good food to go along with their beers, which is much appreciated! I like that you have a choice of tasting about 5-7 small ounces of beer if its your first time here! Thats really nice & they have a great outdoor patio area where you can sit. I love going here in the fall/winter time."}
