{"text":"One of the worst places to eat at. I tried them 2 times in the past month and the food was bad."}
{"text":"Event coordinator was a very nice and accommodating person.   Restaurant is terribly understaffed.   While the service wasn't terrible, the drink and food ticket times were outrageous & the servers refused to get a manager involved.   There was zero manager presence on the floor which is a really bad look for what could be a great restaurant. While Yelp can be overrated; when you have 2-1/2 star rating you have some real issues."}
{"text":"Couldn't believe the wait!  First of all, this place has the right Sports bar atmosphere if you want to catch a game. Screens everywhere. Also, decent beer specials.  However, my wife and I came here to eat. The menu is similar to an Applebee's with a decent selection.   Let me emphasize, the place was not that crowded. From the time we sat down, it took an hour and a half to get our burgers. BURGERS! The wait stuff wasn't rude, they just didn't care. Not a single apology or explanation, as if this was the norm.   Food was below average for the price.  Will not be back on an empty stomach.  Revision: After a second visit (we had purchased 2 Groupons), I'm feeling a little better about this place. The Newcastle Fish and Chips was pretty good (for bar food). Also, this place has over 10 billiard tables, and could be a cool place to hang out."}
{"text":"Look, I love the Fox and Hound. But there are some issues. If you come here, properly adjust your expectations.  Cons: - The food is awful. Eat before you come or make arrangements for after you leave. - The service is spotty. There are a handful of good waitresses. But most are pretty awful. - Fairly expensive drinks. For the quality if food and the overall quality if service, drinks should cost less. - Total sausagefest.  Lots of 20-30 year old dudes. Tons of douchebags and redneck posers will be here in the evenings.  Pros: - $2 Tuesdays. Can't be beat. Their busiest day of the week. - $3 Wednesdays. All wheat beers on draft. Not bad. - Service. They have a handful of really good bartenders and waitresses. Char, Cassy, Allison, all great waitresses. Ask to be seated in their sections. Jen, Kelly, and the rest of the bartenders are really great too. Tip these ladies well."}
{"text":"This place is without a doubt the most awful and sorry excuse for a bar/grill I've ever been to. The biggest problem with this place is management. They are some of the most unfriendly people I have had the unfortunate experience of meeting. They never smile and they always look irritated. I stopped going because of their piss poor attitudes and how unwelcoming they are to patrons. I feel sorry for the rest of the staff that has to endure their insufferable presence. For most part the food is okay, if the chefs can cook it correctly. Some of which must be illiterate, because they fail on multiple occasions to make an order correctly. If you like cheap food made cheaply, managers with a poor attitude, incorrect orders, trashy girls and tables that are always sticky, this is the place for you. If I could rate this place lower than 1 star I would."}
{"text":"My boyfriend and I went here on a Thursday night and it was extremely empty!  There was a Texas Hold-Em tournament going on and some people playing pool.  The drinks are measured out with a jigger which isn't good if you like your drinks heavy on the booze (like my boyfriend).  They had a huge screen playing music videos along with smaller TV's playing sports which I really liked.  Don't think we'll be back for a while because of the measured pour thing."}
{"text":"Fun sports bar with fairly good bar food. Loved the beer battered chicken fingers, the nachos, and I really enjoyed my Coronarita, pretty cool. Appetizers are large, so bring friends with appetites. Fight night is not a great night for groups, seating is hard to come by."}
{"text":"Great menu selection. Food is unique, in a good way. The beer battered chicken strips were amazing and the sauce was very good. It is darker lit, but very clean. Pleasant atmosphere and staff, good portions and reasonable prices."}
{"text":"The food is always good. Though the service is almost always sooo slow. It's close to me and a good place to watch any of the games going on so a few of us hit up fox and hound every once in awhile. Last weekend we went for the pens game, it was packed but not insanely busy. My god was the service the worst I've ever had. I work in the service industry and believe me, I NEVER complain. But this was so bad. We ordered food 3 times.... We literally never got our food. We stayed through the game and even a little after. Come on now. How ridiculous. It was embarrassing because I brought friends in that aren't from around here. No a good time."}
{"text":"Never coming here again. Rude wait staff and manager. Totally unwelcoming atmosphere."}
{"text":"We went here 4-5 times because people we work with kept winning free happy hours (some snacks are free, drinks are of course not).  We also tried it out once for dinner on our own.    We literally never had a good experience with the food or service.  The evening we went there for dinner, our waiter disappeared for literally a half hour.  We had no drinks and our food didn't show up.  And we were one of maybe 2-3 tables, so I know the waiter wasn't busy with other guests.  The food was super cold by the time it showed up.    The bartenders and wait staff are never friendly.  I hate it here and we will never go back, not even for a happy hour."}
{"text":"The business savy of this place is to serve you less beer at a higher price. The food here is bad from improperly prepared burgers, to salty panini that was inedible to burned oil taste on chicken tenders. Not sure why the managers can't figure out the complaints and negative feed backs. Staff is snobby except for a few that are nice and this place is lucky to have."}
{"text":"They have good food and best of all, they have the root network so you can catch all of the Pittsburgh Penguins games."}
{"text":"Worst food I've ever been served in a restaurant!  Went for Father's Day with the in-laws.  I've been to other Fox and Hound's before for drinks.  I knew that this was not my type of place, so my expecations weren't high.  However, they did manage to disappoint me even further.  The place is quite large, and was empty when we got there, but when I asked for a table for 8 the hostesses were fumbling and stumped about where we could sit.  I think it took 4 of them to figure it out.  I ordered a hot pretzel appetizer to share.  The \"queso\" that it comes with was brown, crusted over, and gritty.  Completely inedible.  I requested some buffalo sauce as a substitute, but that was awful as well.  How can you mess that up!?  I didn't hear complaints from anyone else at the table about their food, but none of it looked very good.  The best things about the place are probably the size and the beer selection."}
{"text":"The Sunday special is a half rack of ribs for $5! Can't even buy them at the grocery store for that price. Tasty food, attentive service. I'll be back!"}
{"text":"Pretty good menu and draft choice. Service seems a little slow, but it is a Sunday afternoon with nothing mush going on, so they are probably short staffed. Seems like a great place to watch a game, lots of big TVs."}
{"text":"I recommend the beer battered chicken strips. They are battered in New Castle Brown Ale=Amazing!!!"}
{"text":"If I could give a zero I would. Yesenia was the WORST server I have ever had! She messed up our order so many times I lost count. I ordered food that I never received.. We had a worm.. Yes a WORM in our vegetables that came with our hummus.. Instead of bringing new vegetables she left us the hummus? When she heard we were upset she didn't seem to care, no manager ever came around.. I have been here before but I will never ever return it was so AWFUL!!!!"}
{"text":"Ive enjoyed many good times here. Decent beer selection. Enough selection for picky me. Good nachos. Pool. The place is clean. It's spacious. A great place to meet folks after work."}
{"text":"Awesome service. Awesome happy hour. $2 drafts?! Every draft is $2 ! Sunday after 10 anyway. I think Tuesday's too? Don't quote me on that, lol. And they have service industry specials( a huge plus in my book). Anyway, a must visit."}
{"text":"Miller lite on tap was probably hands down the worst beer I've ever tasted. I'm hardly a complainer but it was so horrible I felt I needed to tell the bartending staff. The first bartender I told served us another and when I reported it was just as bad we asked for a bottle, she still left the draft open for other patrons. At this time another customer approached to ask for a beer and stated there is something wrong with the  miller lite; at this time another bartender heard which finally closed off miller lite to other patrons. The other bartender then stated that the only appropriately cold draft is coors light... They have 37 drafts and only one is appropriately chilled!!!!!!! So disappointed. Guess that's  an explanation for their lack in business."}
{"text":"Good place, if not the best in the Cleveland for a fish fry. the only reason I am giving them only a 3 star review is that the food is good, but in my opinion they're on the expensive side for things as simple as a burger, other than that, they have good food, good atmosphere and have always had a friendly and helpful service staff help us."}
{"text":"When my friends and I arrived we were met by two girls who said they would be taking care of our party last night.  That was the last time we saw them.  The service was no existent.  We ordered food that never came and we had mistakes on  our bills.  We had to go get our own drinks.  At on point we had to go find someone so we could get our checks.  It was not a good night at all."}
{"text":"if you want to play pool or want a great selection on beers this is the place for you. i ordered chicken wings, sauce was great, but i wondered what part of the chicken was this? the wing was so small i had to put on my glasses to see them. oh and because the big selection of beers on tap, be aware you will be swatting gnats all night, even in the winter. great place to play pool, watch t.v. and get a bite to eat, bad place if you want to enjoy a quality meal"}
{"text":"To be honest it was the worst experience I've ever had. This establishment wanted me to pay a cover charge for some naked men wrestling. I'm not about to pay for something when I spend hundreds of dollars multiple times during the week. Not only that but they have low quality food and overpriced beers why on Earth would I ever pay a cover charge. I'm very disgusted with this restaurant and I will never be coming back here again however I'm disappointed that I wasted thousands of dollars. I would never recommend this place to anyone and I wish that I could give it a negative stars because that's how awful my experience has been."}
{"text":"I recommend the bbq pulled pork sandwich and pretzel appetizer. Service was friendly and prompt. I like that they play music videos along with the music so that im not obligated to stare at my boyfriend in boredom or \"watch\" sports. Tues. night is pint night, go then."}
{"text":"Not bad for a Fox & Hound. We came on New Years Day as we were driving through from Ohio to Washington DC to watch the Michigan-Florida game. The waitresses were very attentive to us (though, there was really only a handful of people around!)   Good bar food at a decent price. I had the tomato soup and grilled cheese with bacon. I really liked the combination of food (although I went into a coma induced slumber when I was supposed to be helping to watch the road. Oops.)  I've been to other Fox & Hounds and their food was overall very disappointing, sub par bar food. Here, it wasn't too bad."}
{"text":"Typical chain like restaurant, the service was what you would expect from Chilis or Friday's. The buffalo wings that we got were soggy, not crispy at all. They gave no celery either. We had nachos, pretty standard plate, I had a burger medium well and it came out moo'ing, my husband had a chicken sandwich he said it was average. Overall if we need a quick date night I'll bite because it's right by our home, otherwise I'll take the drive to the Cheesecake Factory or other."}
{"text":"I've given it numerous chances, but it's my least favorite place to eat in the North Hills. I'd rather go to the Olive Garden than come here again.  Im sure this is an okay place to drink, but if you've come here to eat -- especially at night -- then you'll find the experience miserable. It is beyond loud, as you're surrounded by every drunk twenty-something d-bag/d-baguette. The food, whenever it arrives, will be underwhelming or poorly prepared. I don't know why they bother asking how you want your beef, as it always shows up Well Done. The blackened chicken shows up cremated. While I don't do substitutions/omissions, my dinner partners' are usually ignored. And be sure to nurse your drink because it's unlikely to be refilled.  If you want sandwiches, burgers, or American hot plates, save yourself the unpleasantries and go to Hal's or Dive Bar."}
{"text":"Always had neutral experiences here, food is whatever, service was friendly - but will not be going back to this place ever.   When there is a sports game on, food takes long, I could have cared less about the hour wait, but when the waitress openly argues over what you ordered and then tries to charge you for it, well, that sums it up. Manager just said he knows she has an attitude...  way to be proactive   Sad thing was, the girl she was training was great and was trying hard - won't ever be back"}
{"text":"We stopped in here for their $2 pint Tuesday's.  I didn't know if they were going to have this special due to a Penguin's playoff game but I was pleasantly surprised they did.  We had a party of three and were seated quickly.  Despite the entire restaurant and bar being completely full, our server Nick did a great job despite being somewhat or seemingly under staffed.  The wings, pizza, fish tacos, and Cuban sandwich were extremely tasty along with the $2 local IPAs."}
{"text":"Came on a $2 draft night. I ordered a Stella. I don't know what I got but it definitely wasn't a Stella. Every beer I had here tasted like butt, the bartenders are rude and good luck getting food. It never happened in the hour and a half we were here. Maybe if the waitresses worked instead of trying to flirt with the manager or stood in groups outside smoking, we could have gotten fed."}
{"text":"Service is awful. Great drink specials but we have a table of 12, been thirty minutes at 945 on a Wednesday and we just barely got first round of drinks. Meanwhile, two door girls and 2 managers look on. Terrible.  You make money by selling food and drink- get selling !!!"}
{"text":"It has been a few years since I last stopped out at this North Hills tucked away bar and I am disappointed to see it have gone downhill.   Located at the unfortunate and dilapidated North Way Mall this location already has a rough start for itself. tucked away above the moved Dick's Sporting Goods you find this bar fairly inviting from outside. With a name as Fox and Hound, your guess is correct to assume it is a sports bar. Once you walk in up a small inconvenient and useless 2 steps and past the unmanned hostess station, you immediately notice the rings of TVs throughout the space.  Now the space itself is strange, you come into a single large open space that has table sparsely spread throughout it. Along the walls there are a few booth but nothing to speak of and immediately ahead is the large bar. [That is where my Bro and I sat]. There are two side rooms, one to the far left that holds billiard tables and presumably some dart board, very pub style while in the far right version the hall is filled to the rim with arcade machines. I would have looked at this more closely if I had had more time but the vibe was so unapologetic that I did not bother to peek around.  Bro and I sat at the bar in search of a good burger. The bartender greeted us rather sluggishly, having obviously been on shift until the wee hour the night before and thrown out his back. [He was in his mid 25s but walked like twice that age - don't want to know what happened] I ordered waters for both of us and a large sized Sam Summer for the impending meal.   Bro found quickly what his heart and stomach craved, the Barnyard Burger with Applewood smoked bacon, American cheese and a huge fried egg topping it. He came back with positive bites but what can i say he orders his burger medium. I on the other hand was quite torn. The menu was standard pub food, a few items across the board but I tore myself away from the loaded mac n cheese [I know, heartbreak] and went for the Cuban sandwich [something i never order]. First, I must start with some humor. I thought it was a huge salad, then I realized it was the two panini styled sandwich halves stacked atop one another. [oops]  Things that were good: The pickles? or all things, the cheese, the condiments. Things that were bad: the ham was not working for me [it hasn't for the past couple dishes so it might be me]  What saved the meal: The side of fries! I was beyond happy to discover that I had not had perfectly deep fried frenchies in a while. I understand that they were processed and not fresh cut but it saved me, the over dowse in salt and crispiness.  altogether mediocre and dingy. For a sunday, there were no people in sight watching any sports and the atmosphere showed this damper. I will not be returning for a whil.e"}
{"text":"Service is absolutely terrible. I've been here on a weekly basis and it is unbelievable awful. I would never recommend coming here if you are looking for good service. The wait staff only cares about making money and not about the customer. This is the worst managed place I have ever been to in the north hills"}
{"text":"And the award for most terrible bartending and waitress staff in the North Hills goes to this place. IF you get a drink make sure you sip it because you'll be waiting 45 minutes at least until you get another.   Ordered a yuengling draft, and the waitress brought me a IC Light or Miller Lite. There is obviously a color difference in those beers. Not paying attention at first I took a sip of my beer and realized it wasn't yuengling. When the waitress finally made her way back around to my table I told her that I was pretty sure this wasn't the beer I ordered. Her reply was well I saw the bartender pour it so can I get you something else.   Just avoid this place"}
{"text":"Being from the city, my trip here last month was my first, but this is a staple for my North Hills friends.  The place was much bigger than expected, with tons of TVs, pool tables, darts, and some arcade games.  Servers were very friendly. Unfortunately the two behind the bar were a bit unpleasant but I cut them slack because its a long bar and they could have used another bartender (or two) to help."}
{"text":"First impressions are everything to me. Fox & Hound blew it. First drink didn't have to wait for it, second drink had to wait way to long. It wasn't that busy at the bar. Maybe 10 people. (The bar is real long) Waiting for the third drink...pretty sure I aged about 10 years.   Drink prices weren't bad. $2 drafts.  My date and I did ordered nachos and they were pretty banging. Pretty much why they got 2 stars instead of one.   It is a sports bar in Ohio and I was super surprised and super stoked to see framed hockey pictures on the wall.   Reasons to come here. 1. Nachos 2. Life size jenga...yeah you heard right. LIFE SIZE JENGA!!!"}
{"text":"First of all, there's nothing English pub about this place. It's an American sports bar through and through. I don't say this as a negative, let's just call it what it is. If you're a manchild/ex fraternity member that loves wearing sports jerseys and screaming at television screens while you swig $2 Bud Lights you'll be right at home. Me? I don't like sports, I don't like loud, obnoxious crowds and I don't like cheap macrobeer. So what the hell was I doing here? One word, Groupon.  Allow me to set the scene. It was a Saturday afternoon, about 1pm. The place is pretty big. Huge flatscreens hanging from the ceiling and behind the bar, booths on the outskirts, hightops in the center. The college football game was blaring in the background. A small crowd, maybe 10 or so, scattered about. There are also plenty of pool tables and dart boards if that's your thing.  The menu is actually pretty diverse for a sports bar. It's a bit like a Dave & Buster's or Champps, with a good mix of bar staples, burgers and salads. There are quite a few items that sound pretty tempting including the mini corn dog bites and the Newcastle battered chicken tenders and they've even got pizza and some larger entrees. Like I said, not a bad menu. They've also got a decent beer list with the usual suspects and a few local craft brews tossed in for good measure. Not mind-blowing, but it at least provides options.  So how about the service? Again, not bad. We were greeted immediately upon entering and, given the sparse crowd, ushered to a booth. I love sitting in a booth. It just seems that more often than not, being a party of two, we wind up being seated in the shittiest seats in the restaurant (i.e. right by the kitchen doors, next to the restrooms, directly under the A/C vent, all the way in the back completely out of the actual dining area). I digress. Our server was fairly friendly but didn't seem to know that much about the menu or how a Groupon actually worked. She kept our drinks filled, though, and checked back several times during our meal. All in all, not a bad showing.  In general, our experience with the food was pretty good. I think because we went in with such low expectations we were prepared for the worst. Our order was pretty standard, app, two salads. So let's dive a bit deeper, shall we?  Baked Pretzel Stix with Beer Cheese Dip - The four soft pretzels were soft and warm, no complaints there. The cheese sauce, however, was a miss. It tasted exactly like the processed cheese you get on your nachos at the movie theater and if there was any beer in it at all I certainly couldn't taste it.  Cobb Salad w/Grilled Chicken - Romaine lettuce, tomatoes, bacon, cucumbers, bleu cheese crumbles, egg, black olives and onions. Topped with avocado and served with a side of Cider Cobb dressing. The veggies were fresh and crispy, there was plenty of bacon and the chicken was done well. My wife didn't care for the dressing, though, saying it had a weird flavor.   Napa Valley Spinach Salad - Be forewarned, this comes with chicken but when it arrives at the table you won't be able to tell. They bury it under the spinach. Just check before you inform them you didn't get any chicken. Anyway, this salad was pretty tasty. Plenty of fresh spinach, bacon, granny smith apples, red onions, candied pecans, feta cheese, dried cranberries and mushrooms. The dressing didn't have much flavor and the chicken was extremely salty.  Side of Fries - I'm not one to wax ecstatic when it comes to fries, but these were damn good fries. Very crispy, seasoned perfectly and highly addicting. I can see these pairing well with a nice, juicy burger.  Here's something else I found strange. We were asked if we wanted blue cheese or ranch dressing with our salads. I didn't get it. The salads came with specific dressings, why would I want a second dressing? Whatever, I just didn't understand. Our server told us that it's just what they do.  For a chain (there are actually 70+ locations in 23 states) Fox & Hound isn't bad. The food is definitely a step above typical bar food and the atmosphere is what it is. Like I said earlier, I'm not really their target market so I don't think they'll lose any sleep over my review. But if you're looking for a place to hang out with your brahs, watch a game and exchange high-fives, you'll probably be pretty happy. Will we go back? Probably not but hell, I didn't think we'd have ever gone there in the first place."}
{"text":"Stopped in on a Saturday night with a group of friends to play some billiards. They allowed us to hold a table from afar, which was cool. The place was huge inside and looked nice enough. We had a bunch of beers and drinks. One drink was an Angry Ball, which is Angry Orchard Cider with a shot of fireball whisky. It was full of ice to the point of basically being 1/3 a glass of cider. Which sucked. I got the Great cookie blitz dessert - it was great. A huge hot, half cooked chocolate chip cookie with a scoop of vanilla on the side. As incredible as I wanted."}
{"text":"Decided to order grilled cheese and tomato soup for an after work entree. The grilled cheese was minimal and consisted of what appears to be oily, shredded monterrey jack cheese that they couldnt even cover half the sandwich with, 2 pieces of old, greasy,  and the cheapest bacon I couldn't even buy from walmart, and almost stale sourdough bread. The \"tomato soup\" was horrible pizza sauce! I never thought it was possible to mess up grilled cheese and tomato soup, but I've been wrong before! I think you have to try extra hard to mess up food that bad! At what point in your life does an owner decide that they hate themselves that much that they want to make sure the rest of the world suffers?! I'm sure I'll suffer later for the few bites of canned food I ate, so I hope everyone else takes this as a warning! This could possibly be the worst food I've ever eaten!!!!"}
{"text":"OK so I'm gonna start this on a good note--- service was 5 stars. She was adorable & really friendly. Even the manager Ryan who asked how everything was going was friendly. The long island was strong & on special for $6 (fridays) . the space is huge (like 3 rooms plus a patio) and the mix of music was on point.   Unfortunately the food didn't add up to everything in front of the house. I went with the 4 hour pulled pork sandwich. It had a huge portion of pulled pork, Cole slaw on the bottom & crispy onion straws on top. It came with a side of Parmesan fries. My bf ordered the loaded Mac & cheese which had chicken & bacon.   First, the pulled pork was wayyyyyy too tough. I'm a fan of pulled pork but 4 hours on high will make it tough. 8 hours on low & that ish would've been perffff. Also, it had a weird heat to it.... Still can't figure it out. Unfortunately I couldn't finish it. Too tough & I was craving a sweet (or at least not hot) BBQ sauce. My Parmesan fries didn't resemble Parmesan, they were cold and the portion was small. My bf also didn't have too many good things to say about his mac n cheese & also didn't finish it. $40 later and we left hungry and kind of upset. The server was great so when Ryan asked how everything was we agreed it was OK. I didn't want to make a scene and I'm sure if we would've stuck with drinks and apps, it would've been fine. (Someone's boneless wings looked good!)  Fix the BOH and the ratings on this spot could really change. Also its called an English pub but it was just regular pub food... Wings, pizza, specialty sandwiches, salads ect  Sooo.... Service: 5 stars Drinks: 4 stars Food: 2 stars  Round it to 3 stars. Sorry :("}
{"text":"This place wasn't great to begin with, but coming back here after some apparent changes, things have gone south.  First off, they changed up their menu. Big time. I remember they had a pretty big food menu with all kinds of bar foods, and it was honestly not bad. Yeah, no more. They whittled that down to a couple pages with not much selection if you don't like plain, unimaginative burgers or sandwiches.  Everything we ordered was way too salty. My fish and chips in particular tasted like I was just stuffing gobs of salt into my mouth. Nasty.  Their cocktails suck balls, which is not that surprising but still shitty. Expect a 90/10 ratio for mixer to liquor if you're lucky. I played it safe and stuck with whatever was on tap. I'll admit that their draft selection was decent. I'm no beer connoisseur though.  Service was a mixed bag. Our main server was fine, but when different servers were bringing food out, they would just take a random dish to every table and ask them if they ordered it. What the flock? Aren't you supposed to know what food goes where?  Meh. If you go here simply to hang out, watch sports, drink some beer, maybe play pool, you'll be safe. Anything more and you're setting yourself up for a bad experience."}
{"text":"Always a great place to come with friends for watching sports, playing pool, or even for their Wednesday weekly paintnite's.   If you buy the groupon for paintnite.com, u can come to paintnite for $25. Drink and eat while you paint. Each week there is a designated painting picked out already. Go on paintnite.com to see if you like the painting for that night. The paintings seem to be seasonal.   You may think the paintings are super hard but they honestly aren't too bad. There's always a teacher that goes step by step during the whole process. If you mess up, it's okay. It's meant to be fun and not too serious. Main part of the event is to drink and have fun.   If you are ready to eat, I would definitely recommend the Ranch Hand Burger. The onion straws really up the flavor on this one. Pair it with a cold glass of Blue Moon and you're set!"}
{"text":"Don't go here looking for good food it's not here! I ordered the steak salad and I took one bite and sent it back . Even the manager said it was a bad grade of steak it was cold and not edible. We managed to spend 49 dollars even when they took the steak salad off for three people two people had two beers. Very expensive. The smell was like a dirty skuzzy beer joint. They need a cleaning co in there to sanitize the entire place!"}
{"text":"Well we've now played through 5 full games of pool and have yet to even speak to a server. Just saying."}
{"text":"I don't know what else to say about this place that hasn't been said already, but I'll give it a shot.  So, I have a friend that lives out of town, and whenever he comes back, I dread the fact that this place will inevitably be put on the table as a central meeting location.     I guess the best way to describe this place is to imagine everyone you kind of didn't like in High School, add 20 years, and imagine the place that they would be hanging out, shouting at televisions, the chips on their shoulders growing more burdensome with each passing year.     This bar is cavernously huge, and has TV's placed strategically, no scratch that, placed every fucking where that your eyes can go.     Also, let's take a second out of this review to consider the name, and the fact that this place considers itself an English Pub and Grill(e) with a little e on the end of it to add...authenticity?  Like after some fox hunt with a group of my favorite lads, the boys and I would go here to sip port and regale each other with rousing tales of the day's hunt, and legendary hunts of yore.  And Leonard Fitzbottoms, that old scallywag, would eat so many bangers that his monocle would pop out!  Shouts of \"Here! Here!\" and \"God Save the Queen!\" ring out lustily in our merriment.   No.  This will never happen.  They do have a mouthwash dispenser in the bathroom, though.   Ok, back on track.  So this giant place, with a menu of things that you can find in any bar with a deep fryer, with a million TVs and a mess o' pool tables, and specials on Coors Light if you're feeling up to it, will never be hurting for business, because it is the embodiment of appealing to the lowest common denominator.  It's an excellent business strategy.  It can fit a ton of people, the food and beer are relatively inexpensive, and you can watch TV, and rinse your mouth out after you pee.   But much like watching an episode of Two and a Half Men, when you're done, you're a bit confused as to what the deal was.  And if you like that show, then you seriously need to check this place out."}
{"text":"Just not impressed. Service was just okay and good was rough. Cheese fries consisted of surprisingly well seasoned French fries with shredded cheese on top. Well, if you've ever melted shredded cheese, you know it coagulates quickly... So, by the time the fries arrived to our table the cheese was stiff and barely edible."}
{"text":"Really good nachos. They are HUGE! The quesadillas aren't on the menu any longer but they can accommodate. My girlfriend and I go here quite often because we love that they have all the football games running at the same time. She like the Broncos and I am from Seattle originally and believe it or not it is hard to find a place that shows both games. Also they have really good beer specials and most days of the week, later at night, there are billiard or game specials as well."}
{"text":"Dont know why I keep coming back to this place.  Food is OK for a chain restaurant.  They have good beer specials and a rewards club.  Service is some of the worst Ive ever seen at times.  If you dont sit at one particular spot at the bar you literally get ignored.  If they do decide to talk to you it can be a n Ok experience actually.  Usually they are all huddled around at the end of the bar, talking.  The manager usually comes around and says hello...but it almost feels like a make-up for the crap service they provide.  Dont even ask the hostess chicks anything...they are useless.  Also, PAY CASH..this is one of those ghetto places that pre-authorizes your card, esentially holding your money.   Dont even give them a card to start cash..just pay as ya go.."}
{"text":"Tried to come here one time. And by \"tried\" I mean, walked in the door in hopes of getting a drink, but was told it would be a 45 minute wait. Apparently they are too \"classy\" of an establishment to allow people to stand by the bar and have a drink until a chair opens up. Won't even attempt to come here next time."}
{"text":"I came here on a weekday evening and it was fairly busy. I liked how spacious it was and how many tv's they had around the whole place...enough to keep anyone busy. There was plenty of seating and a good sized bar. I loved seeing pool tables even though I didn't play. I was meeting a friend and we sat down for drinks. A waitress walked by and asked if I needed anything and I asked for a beer and water. She said okay and walked away for about thirty minutes. My friend went up to the bar to get our drinks during this time. While I sat drinking my beer, she came back again and asked if I needed anything (as if it was the first time she's seen me). I asked for water again and she disappeared...again. Hmm. I sense a pattern here. I gave up on the water. I never actually received any kind of customer service, which will keep me from coming back. Why ask when you're not even going to follow through?"}
{"text":"great spot. our server was justin.  amazing fish tacos.  generous with chips and salsa.   perfect service.  this place knows customer service. good job!  could have played pool or thrown some darts.  maybe next time."}
{"text":"Awful food, service and beer prices. The place is dingy and dirty. I'm surprised the health department doesn't shut it down, to be frank. It's one of those corporate joints where they have ZERO plans on remodeling."}
{"text":"Had a great experience, the waiter was awesome, everything was good until I got food poisoning..."}
{"text":"I've tried this place a few times I just never learn. They are set up to be a sports bar, but they don't get it.  They don't put the games on, the help doesn't know how to control the TVs, and the staff prefers the music video sound instead of the game sound.   Avoid."}
{"text":"Pleasantly surprised by the food. The Buffalo Chicken sandwich was nice and crispy and the parmesan fries were tasty. The Pants on Fire Chili Queso was not very spicy, and the chips were nice and crunchy (not stale by any means). The salsa on the side was fresh tasting. A good variety of beers including ales and lagers, which seem to be getting harder to find in favor of IPAs and overly hoppy beers.  Good enough to grab a drink and watch a sports game, plenty of TVs!"}
{"text":"They have Hockey!! We searched all over for Penguins Hockey and this place not only has Root, but the NHL package!!  Decent beer selection and interesting drink menu. The food looked good, but we didn't have any..but we will be back."}
{"text":"Cover charge for Saint Patrick's day?! \"oh it's for the specials\" which weren't that good anyways. Okay bye we'll go elsewhere. #displeased"}
{"text":"I've been to Fox & Hound many times over the years and I've always had fun there.  The place is huge!  There are lots of pool tables for rent and some dart boards.  There are big screen TVs everywhere and you can watch UFC fights here, which I love.    Recently, I held my wife's 40th birthday party here with about 50 people and we had a blast.  The food was great, the service was excellent, my friends and family had fun, and there was plenty of room.  We even had our own TV that we were able to display a slide show on.  The event coordinator was very friendly and cooperative.  Overall, it was a great experience and I can't wait for the next UFC event.    My favorite food item is their drunken chicken tenders along with their craft beers.  Add in some UFC and local craft beer, and you've got yourself a guys' night out!"}
{"text":"A group of friends and i went to the Fox & hound this past weekend to celebrate a birthday.  This wasnt our first choice of a place to go, but thats really beside the point. Ive been here a few times before just to grab a few drinks, and it is ALWAYS crowded on the weekends, which is great for them.. bad for us.  it took about 10 minutes for a server to even acknowledge that we had joined the group of friends that was already there. we knew exactly what we wanted to drink, because my boyfriend and i usually drink the same thing when we go to something like this, especially when its crowded. we ordered our PBRs, and waited another 10 minutes or so for them to be delivered.  We grabbed our own menu because we wanted something to snack on. We ordered chips and salsa with queso dip. that actually came out very fast. we noticed after a few minutes that our chip vs. dip ratio was off. we had way more condiments than chips. we jokingly told the server about it, not expecting anything of it, or really even caring that much, and she brought us another giant basket of chips.. a $5 order then became enough to share with everyone! Our server loosened up a bit after she bacame aquainted with our group, which is a very easy-going crowd. Once she started remembering what we were drinking the orders became arriving more quickly. overall not a bad experience, but again... Fox and hound isnt usually a first choice of a bar to hang out.. and it probably never will be in my book."}
{"text":"Really enjoyed their menu selections and yummy cocktails, but service was a slow and forgetful."}
{"text":"Very over priced for drinks... For what they charge for a drink you would think they would pour  a full shot ... They don't we will never go back again !!!!"}
{"text":"The area is nothing exciting and it hardly looks open from the outside. That being said the pool tables are well kept and on Tuesdays it's only $4/hour to play! The beer selection is decent and the food is regular bar food, think Applebees. If it was closer to me I would totally go here instead of a movie, cheaper and more fun! I only had a quesadilla but I would do it all over again! Free wifi, tons of room and an arcade in the corner with darts and other games for those who hate pool. Best of all the place doesn't have that normal Pittsburgh cigarette smell. I would say if you haven't been and are looking for something decent to do get off your couch and go check it out!"}
