{"text":"This is the third time my partner and I came here in two weeks - the first time (St. Paddy's Day) was fantastic, the second time was okay, but the 3rd visit (April 1st) was disastrous.  The points below describes our third experience:   Our drink order was taken about twenty minutes later, and it took an additional 25 minutes to receive the drinks.  Usually, drinks take about 5-10 minutes to arrive.           I made a comment that the drinks took too long.             The waitress said she can credit my partner's, because he has to drive.             I left mine on the side, but didn't drink it.             Since the server seemed reluctant to make any adjustments on the bill, my cousin   drank my drink just before we left, and apparently it was not a good Long Island anyway.  (I should have known when the server said she was a bartender, and mentioned iced tea in a long island! - for non-long island drinkers, there should not be an ounce of tea in there.  The color is from cola.)          We received only 2 sets of cutlery for 3 people.    For some reason, the staff who bring the food never seemed to know where the meals would go.  They would go to the table closer to the door, and when they said no, then our food would find its way to us.  This happens occasionally at restaurants, but I've never seen it happen so many times.  And again, the place was NOT busy.       We had to wait quite a while for a server (any server, not even ours) to come close enough to ask for ketchup.  When it was brought, it was nearly empty and definitely not enough for one person, let alone 3.      There were BONES in my fish and chips.  I accidentally swallowed one, and there was at least one more (I did show the waitress when she came to give us our bill, and she apologized).  I stopped eating it for fear of swallowing more bones, and did not finish my meal.  My cousin said the veggie burger was mediocre - not bad, but not great.      We were charged $1.99 for extra jalepenos.  When I told the waitress we never received the extra, she said she made the note in the computer.  I told her this was the normal amount, and she said that they included the extras between the nachos.  Like I said, the previous 2 nachos we ordered were loaded.  She made absolutely no effort to rectify the situation, but preferred to argue that the jalepenos were there (even though she did not bring the nachos, and therefore did not see them herself).          In addition, we were not informed that \"lots of jalepenos\" would be an extra charge.  Yes, it is only $2, but usually they would let us know it's an extra charge.  (I was informed by another waitress at another time at this same establishment that the tzaki was an extra charge, so I know it is not against restaurant policy to inform the customers of extra charges, but this waitress just did not seem to care.  We did get the tzaki, but it's just good practice to let your customers know when something will be an extra charge.)      When we requested to speak with a manager, the waitress returned and said he must have stepped out because they ran out of something.  She did offer to give us his phone number so we can discuss the issues over the phone, but she never made an attempt to actually give us the number.      Upon our departure, waitress made a comment something to the effect that she hopes this does not reflect her service.  Again, very unprofessional.  If you have an unhappy customer, you try to let them leave on a happier note, not deflect blame away from yourself.  And furthermore, f she was giving proper service, she would have came to check up on us more than once.  And please do not get me wrong, I extend the utmost respect and patience with servers.  Perhaps this one is new, or inexperienced, I am not sure.  But whatever the case is, the Fox and the Fiddle needs to spend more time training staff.    Definitely will not go back and cannot recommend.  And also upset that we spent nearly $80 for this awful experience.  It's a shame, because based on my previous 2 experiences, we thought we found a gem close to home."}
{"text":"Want a British pub experience, this is the right place. Not too expensive, great place for nice quiet date night, beers are cold and the food is hot! And don't forget to tip the very pleasant wait staff! And everything day of the week there is a discount on either the pub grub or the alcohol. Highly recommended"}
{"text":"Came here tonight for some bar food and cold beer.  It's my go to location for some good burgers and beer and wings.  Wasn't disappointed!  Prices are reasonable and it was nice and welcoming."}
{"text":"We had a reservation for a birthday party for 20 people at St Louis, and they went and gave away our table. So we called Fox and the Fiddle and Courtney was happy to set up a table for our party on such short notice. They service was great the whole night and food was amazing. I'd definitely recommend giving this place your business!"}
{"text":"Only good experiences here in the evening, during the day it's bad service and burnt food. Although, every time I come at night, the servers are friendly and the food is great!"}
{"text":"Nice neighborhood pub in the hood.  All by itself in a sea of Chinese restaurants and fast food.  It even has a basement bar with pool tables and foosball.   Waitresses were friendly.  Food is reasonably priced.  They show hockey games and Raptors.  Drink specials.  Busy.  Only pub for miles.  Near York University.  Two thumbs up!"}
{"text":"Probably deserves a 2 1/2 but i'm giving it a three because my friends seem to really like this place so maybe there's something I'm not seeing that they do.  Considering there's nothing else in terms of pubs for this area, this is where it's at for Keele and Finch. I've been here twice, both times to celebrate birthdays. I wouldn't come here otherwise.   The location faces construction on one side and a dirt field on another. Most of the regulars are on tap - Coors, Canadian, Heineken etc. Pool tables downstairs that are mostly empty, so thats a definite plus if you're looking to play pool.   Mostly York students. When I ordered food, it was o.k., but nothing special. Both times I've been here, I've suspected the waitress was trying to skim me on how much change I wanted back, even after I tipped her.   *shrug*  This place is just flat out boring."}
{"text":"I have been to this restaurant numerous times and have always been very happy with the food, drink, and service.   I highly recommend this spot for those at York University or in the area looking for a decent meal or a new go to spot."}
{"text":"I work in the Keele and Finch area so all the time I eat here is work related, mostly lunch time. The staff are great and the food has always been good. Lots of parking in the back and the place is very clean"}
{"text":"Don't know if it's one of the best among the different locations. But that doesn't change the fact that its still one of my favorite bars to visit in my hood."}
{"text":"Its a pretty decent place...  Think of the moxie's menu with a waaay lower price.   With the vicinity being very close to York University. Expect a lot of younger age people hanging around. It is 2-levelled; with a few pool tables and a separate bar downstairs. They are very fickle when it comes to ID. Which at my age is the greatest compliment that can be paid.  The place has an older decor but it works. Reasonably priced entree's and cheap drinks. It is a good place to go for a bar environment without dishing out too much money."}
{"text":"One of my all time favourite spots for the past probably 20 years. Used to be a grimy bar it turned into a real gem when rebranded. Cool owners, keep good, competent staff. Food is nice and fresh, never had issues. Cold beer, plenty TVs to watch the Leafs, perfect spot for the playoffs"}
{"text":"Two of the nicest pool tables at keele and finch.  They offer great food too."}
{"text":"Everything from this location I've eaten and enjoyed. Only complaint is the kettle chips are too salty."}
{"text":"I come here mostly for the wings, this is one of the good bars to go in the area. I prefer to stop by here when i'm not feeling the mood to go downtown. Dont forget to bring your id, besides that the food is good and the staff is a welcoming group."}
{"text":"Food was good. Service was quick in the beginning. Took 30 minutes to get the bill. Establishment does not take debit. Likely will not return."}
{"text":"Voilà. A mash-up of all my tips compressed neatly into one one review for the convenience of the desktop users (FYI tips can be viewed on the app).   New tips: -I believe open mic nights have taken over both Tues & Thurs nights. -Double Amaretto is tasty & refreshing. Request fresh squeezed lemon if you don't like bar lime.  -Cash only. ATM on site by front door entrance.  -Buffalo butter is their most popular wing sauce. I've tried it as well as Korean BBQ & red ale but I still prefer the classics like honey mustard. Their four alarm is a decent challenge to anyone who likes it HOT!   Older  -Fox & Fiddle Finch, \"where everybody knows your name,  duh duh duhhh \" a la 'Cheers'  -Always a fun and interesting crowd here,  even on a rare slow night.  Check out comedy nights and the karaoke night on Tuesday is epic.  Shaka is the best waitress they ever had and ever will have. Xoxo (07/82/2015 Update: Shaka still works here from time to time. Tip her well!)  -There are 2 pool tables in the basement.  Plus a 2nd full bar, bartender, waiter service (when busy downstairs) , dart board & jukebox. -Thursday $12.99 Nachos. Regular $16.99 -another drunken night of Tuesday karaoke... wow -half-price wings on Karaoke Tuesday -Have a live DJ sometimes (really approachable &  friendly). Yesterday,  Friday,  the DJ was on point playing a video mix of reggae R&b top 40 and hip hop.  Downstairs there was some unusual mix of pop and classic rock (I don't know who fooled around with the music)  but there's always the jukebox by the pool tables if you wanna play your favourite jam. -Order any poutine from here and you will not be disappointed. I prefer the new southern BBQ chicken poutine. Fries, onion rings and wings are stellar. Nachos and Burgers are also  delicious. Even the butter chicken & naan bread w/basmati rice ain't bad - far from authentic,  albeit. Haven't tasted much else.  Give this place a shot and come ready to have a good time. If you have  a good attitude & are the type to mingle & socialize I'm sure you and your friends will have a great time!"}
{"text":"Dark place but good service. Many specials whatever the Day. Got karaoké on tuesday and thursday."}
{"text":"I have been here approximately 4 times in the last four years and it has always been a pleasure. It's never too busy, it has a diverse crowd (from university students to middle aged folk), and the food is great. As someone who rarely drinks, the pub food is really important since that's all I usually have. (Though my friends seemed impressed with their drinks regardless. If you like martinis, try the \"white freezie\".)   It was Tuesday so it was 2-for-1 wings special. (2lbs for the price of 1lb, etc.) I ordered honey garlic wings and they were GREAT. They were large and meaty with the perfect amount of sauce. (I hate it when places like All Stars drown their already pathetic wings in a swimming pool of sauce.) They were great. Since it was 2-for-1, I had extra, and my friends tried the wings and they were impressed as well.  I also tried my friends onion rings, nachos, and potato wedges. They were all delicious. Everything was hot and fresh. The nachos had grilled chicken chunks on them - added a nice grilled flavour to the nachos. They were also a massive portion (easily sharable), and my friend was sad he couldn't finish them because they were so delicious.   All in all, great place. I really enjoyed going here with my friends from York University. It's bus accessible, close to the village at York, and I've never been disappointed with the service, food, or drinks. Good stuff!"}
{"text":"Have gone here a number of times food is not cook beer is old and when you tell them I was told to bad"}
{"text":"Decent place to head to after a softball league game.  Beers and 2 for 1 wings.  Can't ask for much more than that.  Their poutine comes with cheese curds too, despite the waitress not being sure whether it did or not.    I have a bone to pick with the waitress here.  She explained 2 for 1 wings very poorly  and confused the hell out of everyone.  She kept saying \"1 pounds = 2 pounds\", and so when we ordered 2 pounds, she asked if we meant that we want 4 pounds; and then when we say we want 1 pound she asked if we meant to get 2 pounds - WTF?  My friends were confused at how to order the special.  Please just say \"1 order = 2 pounds and 2 orders = 4 pounds\" and then ask the customer how many orders they want."}
{"text":"Food wan't bad but the service was subpar at best, they ignored us after we received our food, bad service out weighs the ok food. McDonalds has better service so don't waste your time here."}
{"text":"Average bar in very bad location .But its cheap many times We go for tap drinks n we pack home.Service is great by girls,they are very sweet"}
{"text":"Kind of run down and I'm not knocking dive bars, some of my best friends are dive bars. Salad was mostly ice berg lettuce. Could have been more attentive and friendly. We're not going back. It's kind of depressing. We were wondering why we weren't offered the bar snacks those sitting by us were. Maybe you have to be a regular. But seeing it was mostly crumbs and powder with some flies buzzing about, we weren't upset enough to ask. Also, lackluster beer selection and wine way overpriced. Oh, and my wife liked it even less than I did."}
{"text":"I hung out here on a Wednesday night in the basement room. The ground floor is the dining area. Downstairs is a more relaxed, open environment, though quite small.  The place looks decent and the crowd was mostly younger (early 20s). They have a couple of pool tables, TVs, a bar where you can order food, and some seats and tables.  I went on a Wednesday mainly to see their free comedy night. It is not the best place to watch comedy (in terms of comedians and venue) but if you're drunk you probably won't care. It started at 11pm, each comic went on for 5-10 mins, and the whole thing ran until 12:30am.   The food was good. I got some thick-cut fries for around $5 or so. I usually assume chain places will have crappy portions but I was pleasantly surprised.  There is a doorman who checks ID so don't forget that.  The atmosphere was decent. I could see myself coming back."}
{"text":"Food: 3.5 stars I ordered the seafood special of the day for $19.99. The seafood special consists of deep fried shrimp, calamari, and battered cod or halibut (l forgot). It comes with coleslaw and I chose mashed potatoes with gravy as my side. Pretty big portions. Everything was good.   Ambiance: 3 stars Standard pub style decor. Comfortable seating.    Service: 3 stars Pros: our waitress came to check on us periodically and brought everything we needed. Cons: she seemed a little disorganized? Frazzled? We wanted to ask her something about the menu and she stopped us mid question and insisted on bringing the drinks first."}
{"text":"I had their buffalo chicken poutine and it was really good, I never had poutine like this before and as a big fanatic of one, I did enjoy this dish!"}
{"text":"2 for 1 wings special on Tuesdays. Upgrade to 2 lbs of wings and pay only $12. The wings are enormous and juicy. The Four Alarm is the hottest sauce but easily manageable. There's a second bar and pool table downstairs. The patio is nice but it looks out to barren dirt fields of Keele and Finch."}
{"text":"Okay let's start with the positive. The food was good. I had the chicken parm and it was good value for my money. The location is good. Parking is quite acceptable.  Now for the stuff that didn't please me: 1) the \"colossal\" carrot cake is barefaced false advertising. It's not large, or big. It isn't even average in size for the $6.99 they charge.  2) the washrooms are in the basement and there is no handicapped washroom on the main level.  3) Dark! I had to use my cell phone flashlight to read the menu. The menu is black.  4) NO DEBIT! This was the deal breaker for me. They accept cash or credit. I had no cash with me and do not have a credit card. The server said that I would have to use the ATM. I got clipped $2 at the machine. I left no tip and do not feel bad.   The service was adequate but if I did tip, it would have been 10%, 15% max.   I would not recommend this place."}
{"text":"Our server, Rachel, was really friendly. The caesars are delicious and cheap ($6.19) and the wings were really big and juicy. A pound was only about 5-6 but they were big. Most importantly, it was half price Tuesday and it wasn't crowed. There were a lot of people but we had a lot of space."}
{"text":"Struggling with a 2 or 3.  Call it a split.  2.5! It's a pub with mediocre food and a bunch of booze.  It's the local hangout for my clients in this area.  Been here a lot over the last year and I have to say, it's NOT growing on me. Last time I was there, the special was a chicken burrito.  It came plain.  No salsa or sour cream.  I asked and they said...\"nope, doesn't come with it.\"  QQF!!??!! For those who do not know what this is, I've mentioned it a few times...QQF is the french equiv to WTF - yes...you may use it. Anyway, I then asked her...do you have any of the condiments I asked about?  Yes?  Great...can you get me some?  Not sure if my IQ just dropped through the floor but between that verbal exchange, ugh food, and ALcool!  I think it did. Not my favourite spot but it is one of the only places close by.   The area is really being built up, maybe soon we will have a new pub to call home.  Yah!  [Hands up in the air with chariots of fire theme playing in my head]"}
