{"text":"3:30, just walked in. got a weird look from the waitress. I asked if I just sit anywhere and she said \"uhhh, yeah\" while looking at a clock. I asked if they were closed and she said at 4. thats still a half an hour. yelp says they close at 7."}
{"text":"Great little dinner. Food is amazing. Price is very inexpensive.  Recommended to everyone I know."}
{"text":"Great service, excellent place to get breakfast at any time of the day"}
{"text":"Fiancé and I had breakfast here today...it's average diner breakfast food. Home fries weren't terrible and the hot sausage was pretty good as well as the pancakes.  One thing I was slightly dumbfounded over was the fact that I had to pay $2.75 to use the strawberry syrup."}
{"text":"Just walking in here you know it's going to be all home cooked food. The chicken fried steak was the best I've had in years. Friendly staff, great local place. Highly suggested."}
{"text":"This place is great! Food was amazing, service was on point, And Marleen will be sure to take care of you!! Give it a try!"}
{"text":"The best thing about eating here was when the waitress said she would not charge us for getting a new breakfast dish after finding a hair in the first one.  Hahahahahahaha.  The second would have been all fruit flies and filthy Windows.   I don't get the good reviews about this place except maybe some people are used to eating trash."}
{"text":"Love a good diner. Went here for lunch today with my parents and 7 month old. There was just the right amount of noise for her. I ordered the ham and cheese omelet which did not disappoint. It came with potatoes and toast. The potatoes were not greasy like your typical diner potatoes. It is a very small place so I could see there being a line to wait for a table during prime times."}
{"text":"Frank & Shirley's is a staple in my family for a breakfast. I have been going there since I was a child with my parents and now take my children there."}
{"text":"Open 24hrs on Friday and Saturday how can you not love it. Total old school mom and pop diner. Wouldn't recommend anything other than breakfast. On top of everything else it cost nickels and dimes to eat here. After you've blown all your money at a bar in southside you'll still have enough to eat away some of your drunkness on the way home."}
{"text":"Typical American diner fare. Stopped in because I was in the area. Decent food, friendly service. While nothing stuck out to make my dining experience remarkable, I would return if it was convenient. The coolest thing is that they have a drive thru lottery booth right behind the building. If you're feeling lucky you can grab a ticket or two."}
{"text":"I love a good diner and Frank & Shirley's does NOT disappoint!  Their pancakes are so yummy, their bacon is perfectly crisp, and the mushroom omelette... *fans self* is SO good.  I grew up in Somerset and thought I'd never find something to hold a candle to my beloved Summit Diner, but Frank & Shirley's fills the void.  The staff is always nice, service is quick, and you can get out the door for under $15.  I've never dabbled in their lunch or dinner items, but maybe one of these days I'll give it a go.    If you're looking for a classic diner without the frills, put aside your fear of driving on Route 51 (it's not that bad!!) and get here.  Fun fact:  it's the original Eat 'n Park location... but if you ask me, Frank & Shirley's is the place for smiles.  And delicious omelettes!"}
{"text":"Good breakfast, horrible service.. And im not even one to complain about service. One of the waitresses is always in a bad mood with an attitude. Fire her and ill raise the rating to a solid 4"}
{"text":"Great food, family atmosphere for everyone! Highly recommended, oh and they have great breakfast!!"}
{"text":"I've only had one experience at Frank & Shirley's, which was enough to be my last. I didn't even get to sit down before I was disgusted by this place. While waiting to be seated, a man came from the kitchen with a toilet plunger in hand, and went to unclog the toilet. Afterwards, without washing his hands or anything, walked back into the kitchen, still carrying the plunger, dripping the entire way. I was absolutely horrified! I will never ever consider going back there."}
{"text":"Get here early as there is a line. The diner itself is small so you're pretty much standing over folks while they're eating, which is hilarious. The service is hit or miss, honestly. We had one lady who was very quick and nice and kept checking on us while there was another lady that just looks mad at the world like she hates your guts for even asking for a glass of water.  Food is diner food and hits the spot when you've been traveling from the DC Metro Area to a Steelers game and in need of nourishment."}
{"text":"This not a real diner, there is always a sign out front advertising for a cook. My husband put his napkin over his food and laid it to rest. I really wanted it to be good but Tom's Diner is better , much. I worked in a diner back in the day, the food was top notch and we had a line to get in on Sundays. This is NOT that place."}
{"text":"3am on a Fri or Sat night and this is the place to be. Food is OK"}
{"text":"We absolutely love this place. Its traditional diner food, so don't expect anything flashy. But the pancakes are huge and always melt in your mouth- I especially recommend the strawberry pancakes. Delicious! Lunch options are also good- standard diner food but I've never been disappointed. Haven't had dinner here. It is one of our go-to breakfast spots when we're looking for comfort food!"}
{"text":"I haven't been here in awhile, but I definitely miss it. They do hold slightly odd hours as it is a mom and pop joint and they are definitely more of a breakfast place than anything else. Their omelettes are to die for. I'm also a huge fan of their potatoes for breakfast and especially with their gravy. Yum! My boyfriend is more of a burger person but he loves their burgers and fries. They have a few breakfast specials that are just as awesome It is very small. And they do not take reservations to my knowledge. If you go on a Sunday morning you will def be waiting for a table. They never used to accept cards but to my knowledge they recently have begun taking credit cards which is a big plus. This is definitely a mom and pop place you need to try."}
{"text":"Nothing great, nothing awful either.  Service is OK, but they were slow when we were there.   Food was descent, eggs were good, but the bacon was over cooked til it was dark and crumbly.    They do take credit cards, but you'll have to get up and go behind the counter to enter your PIN as debit, and still leave a cash tip.  The building and the interior could use a bit of work.  Our booth had a huge patch of duct tape and was lumpy.  What you would expect from a diner in the Saaathills."}
{"text":"Been coming here since late 80's and 90's...loved the food. Now hours are limited and portions are tiny...food is okay, nothing to brag about."}
{"text":"This place has been around forever. I remember my mother bringing me here when I was little. The food is cheap but good! Well worth it and the parking is nice for it being a busy street."}
{"text":"Wife and stopped in on the way to the Steelers game on Sunday.  Victory by the way!  I have always passed this place on visits to the Burgh since I have moved away but never stopped in.  Well we miss Old fashion diners in the Washington D.C. area.  This one when you walk in its like you step back in time to simpler days.  The ladies behind the counter we so darn nice and the gent busing tables was super nice to us.  We loved the atmosphere.  Eggs were good and toast with warm melted better good.  The hash browns under cooked and the sausage was not so great.  But if you want to step back in time..this is the place."}
{"text":"Great service in a quaint mom and pop spot with delicious breakfast menu!  Not gourmet but is consistently good and has brought me back again and again."}
{"text":"Frank & Shirley's now accept credit cards, but unfortunately, they are no longer open 24 hours on weekends, closing up at 9PM on Fridays and Saturdays, so those who complain that there aren't enough independent late-night restaurant options in Pittsburgh have more ammunition. However, expect the same above-average diner food they've been cookin' up for as long as I've been alive.  P.S. They have wi-fi too now!"}
{"text":"One of my weekly lunch or breakfast place. Good home cooked food and reasonable prices. I would avoid busy times. An Sunday mornings. The staff is limited and cannot handle the full crowd. I never have a problem usually, except today my glass of milk was chunky( turned sour ). Sadly Shirley has passed on and will be missed."}
{"text":"Great place for breakfast! Staff is friendly and food is great.  I rarely go out for breakfast, but when I do, this is where I go.  Small \"mom and pop\" place, with all the usual breakfast foods.   Last I drove by they are now serving lunch and dinner too...?"}
{"text":"If you've ever been to Gab and Eat in Carnegie, the interior and atmosphere at Frank and Shirley's is similar. The food isn't quite as good or filling though.   When we got there around 10:30 on a Sunday morning there was only one open table and they seemed pretty busy. But they keep the line moving incredibly quickly. We were seated, drinks delivered and order taken with five minutes. Our food came five minutes later, and we were out the door in about 20 minutes total. I ordered a ham and cheese omelet and my wife ordered poached eggs, extra hard. The omelet was OK; nothing special. It was actually on the small side and instead of freshly cut ham off the bone it was prepackaged ham cubes. My wife's eggs came out very runny, aka the opposite of how she asked for them.   I gave it three stars though because while it wasn't the best, the eggs still had flavor and the whole process was very quick and efficient. But sometimes, at least at breakfast, we kind of like waiting and relaxing."}
{"text":"Had the meatball sub special for my first time. Always ride past this place always wanted to stop. It was good home cooked food. I'll stop back"}
