{"text":"I LOVE the Sumatra whole beans they carry.  $13.50/# is not bad at all for great organic coffee.  I usually get my bag at the Town Square farmers market on Fridays.  Very nice and knowledgeable folks."}
{"text":"I bought his Kona Coffee, It was every bit as good as the last time I was in Kona sitting in a street cafe overlooking the harbor.
Yes, it is pricey but, it costs no more buying it here than buying it there.

Now to try and find something else I like as well. They have so many different coffees to choose from."}
{"text":"I am not too crazy about their coffee. I was at a farmers market on water street a few months ago... And saw his tent pitched.... But the man looked too busy on his tablet, so I thought I would catch him next time....

When my mother in law and I went to the next market, there was a young lady there.... The coffee was okay. I was not impressed, I have had better, cheaper and  organic coffee from else where. After each of us buying bags of coffee... The girl gave my MIL a coupon for next time... And didn't give me one...

We both didn't buy again."}
{"text":"He is super helpful, giving me new ideas on how to get the most out of my coffee, offering me new tips & techniques. He debunks coffee shop myths & his cold brew latte is amazing. 
If you love strong robust coffee try Red Rock Blend, it's aroma is unmatched."}
{"text":"The vanilla latte here is amazing! It delivers with a double shot of espresso that really gets you going! So delicious! The owner is amazing and fun to talk to. You can also purchase coffee to brew yourself at home. Definitely my spot moving forward on Thursday mornings. Give them a shot! You can catch him at the Farmers Market on Water Street in Henderson on Thursday's. Definitely worth it! Good, good coffee!"}
{"text":"Absolutely the finest cold brew coffee on the planet. The best gift coffee I have found in all my travels. Roasted right on site by the pound this coffee is to die for.  Worth the drive from where ever you are in Las Vegas."}
{"text":"I order Frankly Good Coffee online, or try to find his pop up booth wherever he is. It's the best coffee. I typically go with the Dam Good Blend. This coffee is a staple at my house :)"}
