{"text":"Ok. The meatballs are AWESOME. But on Wednesday they do Nana's hot meatballs.  Probably the best you'll ever have.  The pizza is really, really good too. You can tell when quality ingredients are used, and this pizza is all that and more. My brother says the Steak & Egg hoagie is the best he's ever had (you can consider him an expert).  You can taste the quality."}
{"text":"What a great find!!! Frankie makes everything homemade... the sause is delicious! And the meatballs are amazing!  Hancut fries!... try the Buffalo fries with ranch dressing... you'll thank me.  Just had an Italian  hoagie yesterday sitting at the outdoor tables... nice  break area for lunch!  My aunt had them cater a surprise party too... everything was delicious and looked so nice. Definitely need to put this place on the top on your list!"}
{"text":"If you ever get lost in Lawrence you have to stop at Frankie's. I love that Italian place. Especially that spicy meatballs that they serve every Wednesday. It is a family owned business. Very friendly. On my first visit Frankie introduced the whole family to me. It is not a place to sit down, they only have one table with two chairs outside. So far the Hoagie's and meatball are awesome."}
{"text":"We had the chicken parmigiana sandwich and a meatball hogie and a complimentary order of breaded zukinni bites. We ate in the new dining area which looks great! Such a great atmosphere here and Frankie and his son give incredible service! If you are in the Lawrence you have to stop in, you will not be disappointed!"}
{"text":"We are from Columbia Mo and like to try new places as we travel. I had the philly steak- wonderful. My Husband had the meatball hoagie- flavorful.  We also ordered a small pizza with white sauce, tomatoes and bacon for the road.... But I could not wait.    Frankie the owner is genuine and made us feel welcome.   We had the sweet pie cinnamon sticks and homemade icing for desert and wow was that a way to top it off.    Thank for a great lunch!!!!"}
{"text":"I work near Frankie's and I have ate there a few times.  The food is good and the pricing is good.  I will go back again, but I would not go out of my way to eat there."}
{"text":"We tried Frankie's after looking to Yelp for pizza ideas and we're really glad that we did! Delicious pizza! Sauce was flavorful and the crust was chewy-crisp and cooked perfectly.  Our waitress was super friendly and attentive.  We will definitely be back!!"}
{"text":"Pizza was pretty darn good. Also got the breadsticks with cheese. They were lacking flavor, it was literally was just pizza dough and melted cheese, no garlic, oregano, etc. would have liked some garlic sauce on the side too. The worst thing we had the cinnamon sticks. There was hardly any cinnamon on them, they looked exactly like the cheesy breadsticks just plain. Definitely needed a lot more cinnamon, and sugar on them to be worth getting them. We would order pizza again from Frankie's but not the other stuff."}
{"text":"Awesome! Eat in and chat with some very friendly, nice people!  Pizza steak hoagie and fries were The Bomb! And I have had my share. Atmosphere is very nice, but casual. Service excellent, traditional Italian music, decor' relaxing, inviting and clean. They treat everyone who comes in like family. The cook didn't bristle when I asked to have my fries well done."}
{"text":"Small but mighty, this little eatery is a gem. Homemade recipes combined with specialty dishes. Pizza, pasta, meatballs (oh the meatballs!) and salads, daily specials and more. I'm partial to the huge Italian hoagie and meatball casserole. Even the wings are good. Get in the car and go visit Frank and his son Frankie. Molto Bene!!!"}
{"text":"Excellent family owned business.  Efficient friendly service. Invested in the community.  Excellent food/ pizza / good Italian food"}
{"text":"The Pasta Joanna was delicious and surprisingly light. Per other reviews, order the meatballs! Your stomach will be happy and FULL. My leftovers provided 2 more meals! We'll be back for the pizza next time."}
{"text":"I picked up lunch from Frankie's earlier this week for the first time. I work very close and have called Baran toy forgotten to go there but finally remembered. After hearing very good things about it, I had fairly high expectations and Frankie's didn't disappoint. The food was excellent. But even better than that we're the friendly staff. In a world of disappearing customer service, it was nice to have friendly discussion with a great local business owner and staff member. Thanks Frankie!"}
{"text":"Frankie's has a very good pizza, better than most in the Peters Twp. area.  Hand tossed thin-crust pie that is crisp along the edge yet soft and tasty.  If you are a NY style folder you will like this pizza.  A good tasting homemade sauce.  Will have to stop back and try some of the other items on the menu. Frankie's is take out since there is no where to sit.   We stopped by after biking on the Montour trail and just took the pizza back to the trail and eat on a bench.   Service was friendly and they asked if we needed plates and napkins, which we gladly accepted."}
