{"text":"Buffalo chicken pizza is really good, but defiantly avoid \"Frankie Fries.\" $5 for 10 French fries with some cheese and three bacon bits. Honesty could not have been more disappointed with the fries. I could have made them myself for 50 cents and they would have been fresh and not done 30 minutes before my pizza was."}
{"text":"The white pizza and steak hoagie are good. I think their menu is a bit overpriced. A dollar or two less on most items and I would order from them more often."}
{"text":"The food is good. It's ALWAYS good, and thankful for that, that's been the reason we come back. The girl that answer's the phone though makes the whole ordering pizza experience awful. You would want someone to answer your phone to sound the least bit inviting, but not saying hi, giving attitude towards questions, and just giving the time the food is ready/total price then just hanging up is so unprofessional & genuinely makes me feel like a burden for bringing my business to you."}
{"text":"The chicken and pizza are very good. However, the service is usually poor at best.  Our order is frequently wrong but we keep coming back because you can't beat the broasted chicken.  Use a bit of patience and pick up instead if ordering delivery."}
{"text":"Why is Pizza listed first in the name when the Chicken is the star of the show? Oh, how we love you, Broasted Chicken, you tender, juicy, crispy, delicious chicken. We've had it probably 20 times, only once was it sub-par (a little dried out).  For Memorial Day we offered to bring some to a large family picnic out by Kittanning to lighten the load on the other food-bringers. Frank's packed it in two large aluminum trays covered with foil. The foil was made with pre-punched holes so the chicken wouldn't get soggy - but that meant my mouth was watering the entire way to Kittanning smelling that chicken. The family raved about how great it was. Asked if we would bring it again for the 4th of July get-together (and we would have, but alas, they were closed on the 4th). Looks like it might be on the menu at most family events now.   Never had a problem ordering on the phone, having the order ready at the desired time, or not getting the order right."}
{"text":"Ordered a buffalo chicken pizza and a dozen hot wings. Very disappointed with both. I thought this was the spot for buffalo chicken pizza? I think you yinzers must not know anything about how buffalo is supposed to be, and I feel sorry for you and myself. The crust was very hard and thin, the chicken was super dried out, there was no buffalo taste to the pizza at all. It was edible, but I think rural, West Virginia gas station pizza would have been comparable. The wings were just the opposite. Although good in size, They were SUPER gooey, you could actually eat these wings if you had no teeth, just slurp them off the bone. I like a more balanced wing, some where between gooey and burnt to a crisp.  Super disappointed I spent almost 30 dollars on this meal that more than half of will likely go in the trash. Highlight of the meal was my Pepsi cola."}
{"text":"The place was great besides the one guy laughed when I said I was vegetarian."}
{"text":"Karen said 2-1/2 \"Tastes like every other pizza chain\" but I'll say 3 \"Good mushrooms and crust\""}
{"text":"These guys are great...  My son lives in Shaler w his mom and 2 brothers and he goes to the middle school next door. This place is my son's fav & only after school hang out and the employees treat him great.  I know this because he's always calling me, asking me to order him some food.  He loves their Buffalo Chicken Pizza, their BBQ Chicken Pizza and I'm waiting to hear how much he liked the Philly Cheese Steak I ordered for him today.  Thank you Franks- you guys rock...!"}
{"text":"Frank's is clean and the service is a lot better than it used to be. If the Millvale location didn't exist, this place would get five stars, but it's just not the same. Obviously, the buffalo chicken pizza and ranch are amazing, they are just better in Millvale. The chicken and ranch are the same, I think it's just something about how they do the crust in Millvale. Either way, you can't beat the buffalo chicken pizza and Frankie Fries."}
{"text":"With this location only right down the road from our house, we order Frank's on the regular for a solid \"wings and pizza night\" option.   The call-in/ pickup service here is just OK. When we call, the cashiers on the other end often seem too busy to be picking up the phone and usually we feel like our call to order food to them is more of a nuisance than anything else. They speak quickly, seem frantic, and are typically rude most of the time. Good thing the interactions are short and the wings are good, otherwise I cant say we would order from here based on service. But the location is convenient for us, so we continue to come back to Frank's.   As far as the food goes, the wings are what keep us coming back again and again. The wings here are a bit pricey (about $24.00/dozen) but they are decent in size and meat quality, always fresh and hot (even when we pick up), and have DELICIOUS sauces. I highly recommend the teriyaki wings and their regular medium spiced buffalo. The garlic wings are also very good.   Pizzas here are just OK. I would skip the Sicilian altogether (tasted like a dry cardboard crust that you would buy at a Wal-Mart and \"bake\" yourself) and just go for the regular round pizzas. We have had several varieties - their \"famous\" buffalo chicken pizza was just OK, and the white pizza was also underwhelming. Just some tomatoes and a white cheese, nothing to write home about. I would stick with their regular pizzas - pepperoni, cheese, etc.   If you are in the mood for wings, give Franks a try. They are crave worthy, which is why we come back again and again."}
{"text":"Sadly, this Frank's location (Shaler) lacks any consistency. I haven't been to the other ones, so maybe they're OK. When they're on it, they hit it out of the park. However, the last several visits have consisted of horrible food and/or poor service.  Far too often, I receive the wrong food, extremely burnt food (I mean solid BLACK on the bottom), poorly made food (raw dough in a calzone), and on my last visit, I received chicken pieces that looked like someone had eaten part of them. I made it a temporary profile picture so people can see it. It's a half-eaten wing. This is the way it came in the box. The exposed edges aren't fried, so it didn't come out of the fryer this way. Someone bit on this piece of chicken and then they put it in the box. Gross!  I have contacted them about these issues, and they are always very apologetic. However, this last incident makes me fear for the safety of the food."}
{"text":"We live in Glenshaw, right down the road from this location and it's one of our go-to's for take out nights. Their pizza is delicious and their claim to fame is the Buffalo Chicken Pizza which I think is delicious, but I find it really hard to eat more than one slice.  Recently, we tried their jalepeno poppers and Frankie Bites and I fell in love. The Frankie Bites are a boneless chicken wing and it was literally the best boneless chicken i've had in all my life. It was the perfect balance between chicken and breading and the chicken was so moist. It was cooked to perfection. They also have a good variety of sauces you can have the wings tossed in. I actually crave them on a regular basis. It was that dang good.  The poppers were also good, but I don't think I've ever had a bad popper!  And if you're a loaded fries kinda person, the Frankie Fries are delicious.   Everything on the menu is so bad for you, but it's oh so so good!"}
{"text":"Stopped into Franks Pizza & Chicken today.  I have been to the Millville location a few times so thought I would try out this location since I was in the area.  The joint looked clean and organized.  I ordered a pizza with pepperoni to go.  The pizza was good, but not as flavorful as the Millville location.  The sauce seem to lack an ingredient of some sort (perhaps garlic and salt).  Over all I did enjoy what I ate, so I would recommend this place if you happen to be in the area."}
{"text":"This review is not about FP&C food because we did not get the chance to eat here. We looked online and saw this particular location had a dining area. We wanted to try all things buffalo they had to offer over dinner. We arrived for a late dinner at 8pm. The sign said they are open until 11. When we arrived the open sign was off. We asked if they were open & they said yes. We proceeded to enter seating area and they said they couldn't seat us because the seating area was closed. We said \"your sign says you are open until 11\". They said \"yea.......: well.....but .........we are .....cleaning\". My mom's comment after we left was \"wow things have changed, when I was young businesses didn't turn away patronage.\" We took our money elsewhere."}
{"text":"This being the first time I've order from Frank's, I will try to be gentle. Placed and order for delivery (whole steak supreme hoagie, 6 hot wings with ranch, breadsticks and a 2 liter of Pepsi) came to about $25. The order came in 45 minutes, not so bad, however it was not correct. The hoagie and breadsticks were fine but I got 6 plain wings and no ranch. Called them back spoke to the manager who was happy to remake my wings and have them sent back out, that took another half hour but I had breadsticks to hold me over until then. My boyfriend said his hoagie was great, the breadsticks were different but good and the wings were nice and crispy. Also the replacement wings I got were a dozen hot wings so they hooked me up which was cool. Not a perfect experience but still pretty good. I'd probably order from here gain but for pick up, not delivery."}
{"text":"Always had good fried chicken from Frank's in the past but not tonight.  The chicken breasts were the size of the buffalo wings.  Make sure you check your order before you leave."}
{"text":"My husband and i order from here all of the time. Love the buffalo chicken pizza, you can't go wrong with that order. We also love the buffalo chicken hoagie (but you have to ask for ranch with it which is extra). The only reason I'm giving this 4 stars is because the service is subpar and we are always put on hold for at least 2-5 minutes when calling. It is an annoyance, understandable that they might be busy...  but an apology every once in a while would be nice. Plus having to hassle for the ranch dressing. I would highly recommend take out.. the atmosphere is very small and not inviting. Good food though."}
{"text":"I can sum Frank's up in three words:  Buffalo. Chicken. Pizza.   I don't know about their other menu offerings and I don't care.  That is all."}
{"text":"I had been wanting to try the Millvale location (there are 4 total as of this review) for some time now, but alas, they're take-out only and do not deliver to my Lawrenceville workplace. So here we came, not only in search of good pizza but good fried chicken as well and scored on both counts.   Kay wanted a Cheeseburger Pizza, which sounds ludicrous to the unhip. However, after one bite, detractors will stop laughing and realize that the cakey crust,  richly delectable sauce, and that mozzarella/ provolone/cheddar cheese tryst, draped o'er the pie like a silk nightgown, ranks up there with any of the best pies they've ever eaten 6 cuts of. Unh. Kids, it's not all about mush, pep, and mozz.  We also ordered one drumstick each just to try that \"broasted\" chicken and upon first bite reached an epiphany: KFC and Popeye's are on notice for Frank's cluckers are a near tempura-battered meltaway Southern-fried dream.   They were out of the potato bites, so they gave me a half of an Italian Hoagie to make up for it. The meat was plentiful, the dressing pungent, the veggies fresh, but methinks they yanked it from the oven a touch too soon since the cheese was still solid.   Yes, the service was somewhat off, but with food this good and a back dining room with a big screen TV and an old-school quarter-a-play arcade machine, I can only deduct one lousy star.   The machine had Ladybug! And Phoenix! Frickin' Phoenix man!!! I haven't seen that in decades!   P.S. I hear they make their own ranch dressing. Intriguing."}
{"text":"This place is ok. If you decide to try it, get the buffalo chicken pizza. It's really good."}
{"text":"Buffalo Chicken Roll FTW!  Simply the best around the North Hills of PGH.  Fried chicken is really good as well, or broasted chicken I guess it is.  Never had a problem and I use this place at least twice a month for deliver and pickup.  Both are stellar.  I prefer the buffalo roll to the buffalo pizza, other say the opposite, both are good, so try them both!"}
{"text":"CLASS. ACTS. The people who work here are AWESOME.   Just called in a takeout order that I needed to pay for over the phone (weird) and then called back to make it delivery... to another restaurant (double weird). They were 100% cool as ***k about it!!  Little did they know I'm trying to feed a friend who hasn't been able to afford to eat lately, and I had just called the Pizza hut down the road to try to do the same thing and they were HELLA RUDE to me about it. What a relief to then have the exact opposite experience when I called these classy classy pizza folks.    LOVE YOU FRANKS. You made my night and reminded me how awesome real Pittsburghers are."}
