{"text":"Myself and my boyfriend stumbled upon this place while we were actually headed to another brunch place, which was packed to the rafters! 

The interior is simple, brick wall, with a nice arrangement of fresh flowers on every table. The menu is divided up among two sheets, which I really think they should have just stuck with one for simplicity. The only draw back to this place was the items on the menu. My boyfriend wasn't too thrilled that most of their dishes served eggs scrambled and no other way, while other items weren't very brunchy as there were some spicy Indian style choices. Although different from what we were used to eating at Brunch, we took a gamble. 

I ordered the Salmon Scramble ($11) and coffee. The coffee was really good, I even had to ask the waitress for the name of it. My boyfriend liked that they were served in a basic white coffee mug. Our meals didn't take long to prepare (20 minutes) and were quite delicious! The salmon and caramelized onions went really well together. The side of baguette was fresh and different from the usual toast. The side salad was rich in color and thank god the dressing was good too, as most other places I've been to just serve greens on the side to make the plate look full, but lack any flavor in the dressing. The eggs were bright yellow and delicious. All in all, a very yummy meal. My boyfriend also ate his up, although we both thought that there was just a bit too much egg served. 

The rest of the cafe was very clean and nice to look at. The counter draws your attention and the washrooms were clean.

Total bill for the two of us, $30. A definite place to recommend to friends, just don't be put off by the menu, although unique in their choice of dishes, it's definitely worth a try!"}
{"text":"Went for brunch on a summer Sunday.  A short wait for a table for 6 at 11:30, which is to be expected since they can only seat ~20 in total.

I had a spicy egg scramble, which was fine, and my daughter's French toast was pretty good.  Two of us ordered the breakfast wrap, which was well-prepared but sort of bland. $3 gets you two mid-sized pieces of tasty bacon; do with that information what you will.

Service slower than I would expect for such a small restaurant.  Friendly, though, and no major errors.

Biggest issue was climate control. It was really quite hot, much more so than outside.  (Some blinds would probably be a wise investment.)  The air conditioner was totally outmatched, but eventually they opened the front door, which only helped a little: not much circulation. We had to take the 1-year-old outside to cool him down at one point.  Really detracted from the meal, unfortunately, especially since it affected critical coffee intake.

I wouldn't object if someone suggested it again, but if it was hot out I'd probably try one of the other bazillion brunch places in Leslieville."}
{"text":"I thought the food here was good. It is unique because it has this Indian fusion aspect, so if you are looking for straight up bacon and eggs I would go elsewhere. I had the ricotta and pesto scramble with prosciutto, which comes with a mixed green salad and baguette. The eggs were good and plentiful, although I will admit that eventually I did get kind of tired of the taste. Not that it wasn't good, it was, it's just some foods are five bites good, but not necessarily thirty bites good. 

The service was excellent, just enough attention, not too pushy. 

I don't think this is the kind of place that could be your regular brunch spot because of the unique food offerings, but if you are looking to mix it up I would highly recommend Frankly."}
{"text":"YES!
Great coffee. Friendly service. Scrambled eggs with cheese and chives cooked just right. Simply delicious thick cut maple smoked bacon. The side salad was dressed perfectly! The baguette could have been toasted... Hey.

The music was GREAT! The staff kind and calm. No rush, no fuss, no muss.

A perfect addition to Leslieville. What I appreciated the absolute most was not the typical Leslieville attitude! What we got was attentive service honest and direct answers to question, and the owner/staff making sure we were enjoying our meal and our time spent in this pleasant space with these polite and gracious hosts.

I hope that there will be more of this in Leslieville.

I will be back again the next time, later in the day to explore the Indian twist on breakfast."}
{"text":"If you yelp it - they will come.....and I don't want you to! I would like this little gem to stay just the way it is. Sadly, I feel compelled to give credit where credit is due and tell everyone how great Frankly Eatery is!

I spent a long time trying to find a new restaurant for our Easter Brunch. Both of us are vegetarians so finding somewhere that has multiple options is key. I stumbled on Frankly and thought that I would take a chance with this quaint little place. The risk paid off and we may just have a new favourite spot!

Despite the teeny tiny size of the place we were seated immediately. Service was super friendly and quick. They were more than happy to accomodate our \"hold the meat\" requests and even left out the onions for my partner. My pesto scramble was egglicious, the salad dressing was great and my capp was much better than expected. 

I did find a long black hair in my food which prohibited me from finishing my meal but I get that these things happen. 

Frankly is in fierce competition with Aunties and Uncles. Only time will tell who comes out victorious."}
{"text":"Frankly, this place seemed promising but was a let down in the end. Service was friendly and the atmosphere pleasant. 

But then it took forever for our food to arrive. Like, really, forever. When the food did arrive it was ok but the spicy eggs were not spicy and the smoked salmon was the SMALLEST piece ever!  Like a sushi roll more than a smoked salmon with eggs. 

Not recommended."}
{"text":"Frankly was regrettably only OK for now. I will definitely revisit at a later date to see if things change, but for the time being I cannot give more than 3 star rating.

One of the newer additions to the Leslieville brunch circut, Frankly offers an unconventional alternative to the usual Eggs-Benedict.  Everything here is \"Indian Inspired\" and even though it is an unlikely pairing, the flavours seems to work quite well. The space is cute but tiny, and when we visited had one waitstaff and three kitchen staff present. 

I ordered a special, which was a chickpea flour crepe stuffed with Indian spiced Potato, eggs and an aoili. It came with a generic Spring mix side salad with an un-memorable dressing. We were warned that the meal would take some time, as my crepe takes longer to prepare. Even though we were warned, we were still restless, waiting almost 35 min for our meals. When I finally did get my crepe, it had Bacon in it, (I don't eat pork and I specifically requested no bacon). The waitress returned it to the kitchen, where I assume they removed the fillings and re-stuffed sans bacon as the crepe returned to me in less than 5 min. if I was a more ardent vegetarian this may be an issue, but I was hungry and happy to dive in. The flavours were really nice, and I really enjoyed the crepe. My companions found their more standard egg scrambles to be \"basic\" and not as interesting. 

The prices are the typical $10-15 each for breakfast (most of Leslieville is about the same) and the quality is similar, although they do not mention anywhere about Organics or using Rowe farms meats (which is typical for the neighborhood, and welcomed)

The Coffee was great and CONSTANTLY refilled, as was the water. The service deserves a full star. Minus Points for the generic and uninspired spring mix side salad. The fusion is definitely unique and I would definitely recommended trying one of the specials."}
{"text":"A frankly great brunch.

When my girlfriend described it as \"Indian fusion brunch\" - I didn't really know what to expect. What you should expect is really delicious food and fantastic service.

I had the \"Rockin' Risotto\" special which was a jalapeno and asparagus risotto pancake with scrambled egg, bacon and jalapeno creme on top. It was served with a baguette and side salad. Hearty portion and so so so tasty. The latte I had with my meal was top notch.

It's quaint, but a fairly small space. We had a short wait even arriving at 2:00 pm. The menu is fairly small but they had a list of about 6 specials. Everyone really enjoyed their meals.

See you again soon Frankly!"}
{"text":"Brunch, Indian style, short lineup, delicious food, reasonable price... It did not have AC, and at some point our eyes starts burning and tearing because of the spices in the air! not a lovely experience!"}
{"text":"Another delightful brunch restaurant in my hood! We got here just in time (12:30) right before a few others wandered in and filled the petite restaurant. 
I had a nice chai tea which I got a free hot water refill by the friendly waitress. It definitely beats red rose! I ordered the pesto scramble with tomato cream, baguette and salad while my partner ordered the scramble tacos that came with a cilantro sauce and a chutney sauce on a chickpea-based tortillas. My dish was delicious and full of flavour. The salad dressing was a very pleasant sweet vinaigrette.  We're not huge fans of cilantro (i can handle it some days while i find it overpowering other days). The sauce with the tacos wasn't overpowering so bonus there! i'd be more inclined to choose a dish with that sauce next time.
An elderly couple were sitting near us and the man said his dish was too spicy so they kindly returned it to the kitchen. I'd probably be an asshole and say \"can't hack the heat, gramps, get the hell outta here!!\".  i'm kidding but seriously, i didn't find the food spicy at all.  if you find black pepper spicy, then probably best not to try the food here.
I, however, will definitely return! I'll try the ghobi parantha next time. It looks delicious!"}
{"text":"Great brunch innovations - fusing breakfast with indian flavours - very cleaver and delicious!

I came here with a friend for Brunch and it was a fun chill atmosphere that is not pretentious - very Leslieville - real.  My friend had the PARANTHAS, which they warn you takes 20 minutes, but the good new is, they make it fresh!  It was delectable and fresh, comes with a fresh salad.  I had the INDIAN SCRAMBLED EGGS (sorry, I don't remeber the name of the dish) and it was a big surprise of flavour for a breakfast bite!  It was a bit spicier than I would have preferred but it definately did not lack flavour, it was very nicely blended together and was a great way to introduce and dress up your eggs! 

The service was lovely, they are very nice ladies and gentlemen in there, can't complain, must go try.. maybe lunch next time?"}
{"text":"I went there for brunch recently and was impressed! I ordered the Indian Open Face Taco off the \"Weekend Brunch Special\" menu. The menu describes it as \"Two besan puri topped with scrambled eggs, tomato-red onion salsa, cilantro sour cream and mango-cilantro chutney served with a side salad\" for $10. Add sausage for $1 more. The eggs are from free-run chickens.

Don't expect a Mexican taco. The \"besan puri\" is the taco. According to what I've pieced together from research, besan puri is made with chana flour or gram flour, wheat flour, and spices such as chili pepper, ginger and garlic.

This Mexican-influenced Indian dish created a party in my mouth. I procrastinated writing this (though I started on my phone before leaving the restaurant and got distracted) so I don't remember what my friend ordered (\"Pesto Palooza\", maybe) but I remember that while his was good, mine was better! 

I was surprised that while other restaurants in Leslieville had lines out the door, my friend and I were one of 4 groups dining. Clearly more people need to know about this place. I raved about my meal to the owner and will return."}
{"text":"YUM! 
Service was excellent. Food was delicious. I think this is my new all day breakfast/brunch place and it's perfect for a quick, yet non-fast food lunch place. 
(I believe they do takeout as well, since we asked if I'll be dining in)

They specialize in Spicy Indian Scrambled eggs and sandwiches with an Indian twist. I got one of the specials - Jalapeno/Scallion/Pesto topped with back-bacon (more quality than the street meat) and tomato cream sauce. Side Salad, 2 slices of baguette. $11 even + tax
It was so delicious,and flavourful, the saltiness of the bacon complementing the tangyness of the scallion/japenos.
 I was already thinking about the next time I'm going to come here. 

I was greeted by the one server. The place is small, about 5 tables, fits maybe 15 persons at most. Immediately asked if I wanted coffee or tea. And I noticed he was always ready to serve the next person that walked in. 
 
Wooden tables/chairs, with exposed brick and a large mirror on the back wall, gave the place a cosy feel. There is a white metal bench near the entrance, I guess for people waiting. 
What I liked was that they were playing good music (the Cure etc.) but soft enough you can talk above it, loud enough where you can listen to it and enjoy. 

I came by here on a recommendation from that little pastry shop across street, and I'm sure glad I did! 
There is free parking on Larchmount Ave, or paid on the street. 

They are open on weekends, but gets busy around lunch time. He said best bet is to call and see how busy they are."}
{"text":"Although I'm yet to taste the food, I have been in for coffee, which was great and the people are incredibly nice. And, their choice in music was awesome--retro, early 90's hip-hop. Looking forward to eating there soon with the family.... Okay, I've tasted the food. One word: fantastic! The tandoori chicken wrap was superb, the vinaigrette dressing on the side salad was the best I've had in...forever. So good. Felt good eating it. Felt great afterward. Keep up the good work!"}
{"text":"Big fan of Frankly's indian-infused menu, charming decor and warm, prompt service!  

It is indeed a small place with probably 10 tables and bar seating along the front, but I was here over lunch on a Thursday and it wasn't too busy, so no line-up for me!

I ordered the Indian Crepe, which is a crepe made with chick pea flour, filled with scrambled eggs, peas, pototatos and a very tasty sauce with kick.  The crepe is nice and crispy, which provides the perfect background for the delicious filling.  The eggs, peas, potato mixture is fluffy and well-seasoned (nice that the eggs are free range Omege 3).  It comes with a side salad that's nicely dressed in a sweet dressing, nothing to crow home about, but it's fresh and tasty!  Dish was $11

The service was friendly and efficiently.  We got chatting about the business and the neighborhood.  Frankly is run by the chef who also has a young guy at home. It's good to know that I'm supporting someone passionate about their food and trying to build a viable biz in the 'hood!  

NOTE: They use to do dinner, but no more.  The chef/owner was saying that it felt like she was working 24 hrs a day if she did day and night, so now they're 11-3, 7 days a week.  

VERDICT: great place for a Indian flavoured brunch/lunch in a cozy enviro!"}
{"text":"Frankly, Vivek S gets all the cred for this pick. 

Spicy Indian scrambles? Homemade granola parfaits? And the apple cheddar triple decker sandwich with maple butter and walnut-raisin-bread? Hummina-hummina-oh-be-still-my-beating-heart. Seriously simple brilliance. It begs the question \"Can't I make this at home?\" But like all yummy sandwiches, isn't it better when someone else puts love into making it for you? 

Frankly is small, but on a late morning on a weekday, you'll probably have your pick of tables. Watch the one in the front - the staff will warn you - it's a greenhouse! 

And it seems that those who work in the neighbourhood have a system figured out. 6 people arrived and were promptly served their lunches... way to order ahead!"}
{"text":"Being Mothers Day, it was, of course, my job to take the kids out for brunch so mom could sleep.  However, as luck would have it, they decided to sleep until almost 9AM this day, vs their usual 6:30 wakeup.  This meant Lady M, OkayOkay and the other established spots would already be queued up.   Having two hungry toddlers on my hands, I decided instead to try out Frankly, the new kid on the block.

We were seated pretty quickly, and they had high chairs and boosters, which is a nice touch.   We ordered as soon as the waitress came and then waited, and waited, and waited.  Too long: -1.5 stars too long.   The table that ordered 90 seconds before us got their food about 10 minutes before us, and the table that ordered 15 minutes after us got theirs 5 minutes after us.  Bad luck, I guess.

Now the good.   They had a special \"Indian open-faced taco\" on.   At last I've found a rival for Lady M's huevos migas.  It was a couple of indian pancakes topped by scrambled eggs, tomatoes, cilantro mayo, chili sauce, and home made sausage.  Very tasty, and just at the line of spiciness acceptable before 10AM.    The kids had french toast (simple but tasy - but a small portion,) and scrambled eggs with cheese.   

Prices were good, service was friendly, kitchen was a little slow.  If they keep that open-faced taco on the menu, I'll be back."}
{"text":"If I can be frank...ly, I'm not certain why this place doesn't have more reviews. The menu is extremely eclectic, Indian for breakfast is unlike anything I've experienced and there's a super tasty tea with hints of pear that you should drink even if you're not a tea lover... for the love of pears! 

Get to know me and you'll learn quick brekkie is my jam, man! Such a great way to start the day, and I love when I'm thrown something unexpected. In this case, an egg white scramble with onions, peas and tomatoes (Egg Bhurji on the menu) that floored me. The sliced baguette it's served with is perfect for scooping up the delicious concoction, and a small green salad with zippy dressing adds the tang this puppy needs to wake ya up in the morning. The Indian spices are incredible! I'd name them, but I don't know them. Just go there and try it. Oh, I also suggest you get a side order of their house-made spicy sausage. It's a little pricey IMO at $3 a plate for some small links, but the mango chutney it's served with is worth $3. I would bathe in that chutney if Frankly would let me!

The fact that I pulled up a chair twice at Frankly over the course of a week and a half speaks volumes to what they do. They don't have a lot of chairs to pull up though, so avoid going with more than 3 buds, or plan to get there at off hours to avoid waiting if you're with a large group."}
{"text":"Even though I am \"of Indian descent\" (I hate this phrasing), I've always had a hard time eating Indian food for breakfast. I'm more of a coffee and croissant kind of guy; very continental. If it helps, picture me eating holding a scone with two fingers while wearing a houndstooth blazer over a black turtleneck -- a black mock turtleneck. I'm probably reading the Economist too. Or if it's Friday, The Atlantic.

Enter Frankly, an East-meets-West take on brekkie. We're talking paranthas, daal, and spicy scrambled eggs mixed in with your more standard brunch fare like french toast, yogurt or omelettes. As others have mentioned it's pretty small in here, so if you can't come early and grab a seat, you can call ahead for take-out. That said, it wasn't busy at all during my visit.

My skepticism of turmeric before noon runs deep so I opted the decidedly non-Indian smoked salmon scramble which is topped with caramelized onions and cream. And it was grand. I vow to be a little braver next time I go and try something a bit more subcontinental.

Obligatory Title Pun: FRANKLY my dear, it's time for breakfast.

Menu Readability: Using Birch as body text is like finding out your only son wants to go to clown college (instead of clown university, obvs).

Need to mention: They also have daily specials.

What this place teaches me about myself: It shouldn't be this hard to convince me to eat paranthas for breakfast. Also: I'm mad pretentious."}
{"text":"This place is TINY. Literally can only hold about 15 people if that.

But the staff are super friend, if a bit overwhelmed a bit, due to one server for everyone.

It is quaint, but delicious.

TYPE OF FOOD:

Indian Twist. All food has a dash of an indian skew to it which is quite lovely.

I had the Pull Pork Taco with scrambled eggs. It was fucking delicious.

I recommend this place.

-z"}
