{"text":"I can't count how many times I have recommended Frank's Kitchen to my friends looking for a great place to dine out. Note: call and make a reservation in advance, the restaurant is small. 

Of all the meals I had in 2015, this one ranked near the top. Yes yes the service was good and the décor was nice, but it was the food that made this restaurant stand out to me. Every dish was excellent and the sauces were on point. 

Food highlights:
- The pork entrée was cooked and seasoned to perfection - every bite brought new flavours and textures... it was just so well done. 
- The crispy gnocchi wasn't too heavy and it was a perfect way to start the meal. 
- Steak tartare - one of the best in the city. 

It's not too often when I stop and marvel at the food I just consumed - trust me, the food coming out of this kitchen is knocking it out of the park. I look forward to the next time I visit Frank's Kitchen to explore more of the menu."}
{"text":"I was really excited to try this place and, after reading the mixed reviews online, had a good idea of what to order. 

Like so many restaurants on the Little Italy strip, the setting and ambience was great. Service was attentive and friendly. But the food was forgettable. 

The little house-baked breads were warm and fresh, but bland. I ordered a salad which had way too much cheese on it. I also found it to be over dressed. The lobster dish had a really lovely broth, but was so herby that you could barely taste the lobster meat. 

All of the little between course soups and spoons were fine, but again, not really worth eating. 

I noticed a lot of half eaten plates at the tables around us, so maybe it was just an off night or a case of being overhyped, but I think I'll try some where else next time. 

Note: there is only one vegetarian option on the menu - a mozzarella appetizer"}
{"text":"Been here once with a group of friends. 

Food was delicious..!  Very nice establishment friendly staff.. Would highly recommended it."}
{"text":"For a few weeks now, I'd been passing this gorgeous, little restaurant on College street on my way home from work, vowing to go in and check it out at my first opportunity. Just reading the menu posted outside the beautiful, yellow exterior made my mouth water! 
Upon our arrival at Frank's Kitchen, we were warmly greeted by one of the staff. He was genuinely happy to see us, and even offered to take my coat. I was struck by the beautiful interior - gorgeous wood floors and bar, lovely seating arrangements. My bf and I were seated, and given a little story on the place. We found out  that Frank, the chef makes all the food from scratch, including all the breads and pastas. Instead of the usual tap water, or sparkling, we were given water flavoured with cucumber, which I just loved! I like to have a fair bit of water (and wine!) with my meal, and this was a luxurious twist on the usual. 
The menu was a perfect array of appetizers, pastas and mains. Our server was very helpful in his explanations of the menu items, not that the descriptions were too complicated, just that the story behind the food, from the fresh caught fish, to the meat from St. Jacob's added to the experience, My bf and I were having such a good time and we hadn't even ordered yet. 
So on to the meal. I ordered a tomato and buffalo mozzarella salad to start, and the bf had an arugula salad. Before these arrived, a basket of bread came to the table with a couple of tapenades. This bread was HEAVENLY! Really, unlike anything I've\"ve ever had. The salad was gorgeous and fresh, and not a single leaf went uneaten. The tomato and mozzarella salad was perfect. It's nearly impossible to find a decent raw tomato dish in this city, and here it was on the plate. There was just enough dressing, basil oil, to dip the incredible bread into. 
As he refilled our water glasses, the server was attentive without hovering. He was also able to help us choose our wine, which really made the meal. The wine menu was a carefully crafted selection of wines, with something for everyone. 
We were both so surprised when an amuse bouche came to the table, which was an elegant avocado gazpacho. There was a lot of flavour going on in that little thing. 
We continued on to our main courses. My bf, a pork lover, ordered a pork dish which was pork cooked three different ways. What a succulent dish! I ordered fish, the catch of the day, that was cooked to perfection. Thanks to our server, our wine selections complimented the dishes exquisitely. 
At this point we were in for the whole nine yards, and so ordered a dessert of pear strudel. It was delicate and flavourful, and something you don't see in other restaurants. 
The food is the best I've eaten in a very, very long time. The attention that Frank puts his dishes can be tasted in every bite.  I wished I had brought my camera because every food item that arrived at our table was beautiful to look at, as well as eat. 
The service was genuine, friendly and knowledgeable. And here's something else, the table setting was perfect, and CLEAN! I can't count the number of restaurants, high and low end, where they don't bother to polish the cutlery. 
I am recommending Frank's Kitchen as the best. It was a wonderful eating experience and I will go back again, and again."}
{"text":"Eating the food at Frank's Kitchen is akin to a sexual experience.  The chef obviously knows how to take control of your taste buds.  There are already many Yelps on some of the highlights of my meal (carpaccio, gnocchi, chicken supreme, the fresh breads, the desserts:  everything was as good as it gets).  I just want people to know that this is a true foodie experience and the meal, the server and the ambiance were all a delight."}
{"text":"This is a great restaurant. To start off the service was terrific. My red wine originally arrived quite cold and the attentive waiter replaced immediately on request and was quite apologetic. As a starter we got the Oysters Rockefeller- wow. Such a treat, especially as I don't usually enjoy oysters. If you are in the same boat- fear not! These are baked and smothered in hollandaise sauce and spinach with a crusty bread crumb topping. Sinful. I had the lobster as a main and it was delicious and not too rich. The bread and amuse-bouche were fun treats, but nothing special. The bread is baked in house we were told. For dessert we split the creme brulee. I have to say Scaramouche still wins for best creme brulee. Frank's needs to add more fresh vanilla IMO! Tip: When making a reservation ask to be seated near the back of the restaurant. We sat near the bar at the front and it was very busy with waiter traffic and often noisy/distracting."}
{"text":"Amazing!  I selected 5 stars, but my experience here deserves 10 stars!!!   My husband and I had a memorable experience at this restaurant tonight.  We just returned from Paris where we thought we experienced fine dining at its best.  We have also been to many fine dining spots in Toronto and this one is by far the best restaurant we have been to ever.  Now if you're into basic foods with low prices this isn't the place for you.  But if you want a place for a special night out, a simple menu, knowledgable/friendly staff and food that will blow you away, come here.  Dinner for two with appetizer and dessert and a drink or two and tax/tip will cost approximately $150 but it is worth it!  Call ahead to make a reservation.  It's a gem!  Have walked by it and had no idea this dramatic looking fine dining spot existed!  I can't even explain the dishes other than to say they are creative and the owner of the restaurant had put a lot of thought and care into his dishes as well as the decor and the training of the staff.  We will definitely come here again!!"}
{"text":"The amazing night started with the phone call into book the reservation.  You could feel the passion of the person who answered the Phone.  The server (who we learned had been there since day 2 of the restaurant opening) was friendly knowledgable and attentive.  We had other staff continually stoping by to ensure we had what we needed.  

But the best part was the food - it starts with the presentation - when the food arrives you almost do not want to eat it because it is so beautiful - almost!   You eat with your eyes first - but even that was underwhelming compared the complex and complimentary flavour of the plates.  Truly a night to remember - we found our new favourite restaurant."}
{"text":"A few weeks ago, we tried out this restaurant for the first time.  We actually weren't expecting much because of the standard eateries on this strip of College don't usually leave much of an impression other than the location/scene/patio etc.

The service was very attentive, knowledgable, and friendly.  They brought out an amuse bouche from the chef, which was a delightful cold soup and the gesture pleasantly surprised us.  There were affordable wines on the menu, both by the glass and the bottle, another surprise!  I had the chicken supreme and my date had the gnocchi.  We basically shared with each other and both dishes were fantastic - balanced flavours and perfect textures.  

It's my new favourite place to eat on College!

Update: gone way downhill since its opening and becoming one of the dining darlings on College. Owner is super rude and pretentious. I was a very early fan of this place when it first opened its doors and nobody had ever heard of it yet. Will never go back because I don't enjoy feeling like I am a burden as a customer!"}
{"text":"Did the taster menu and was it amazing.  Great atmosphere for the special occasion.  Our server Matt was very knowledgeable on everything we had and was a great server. Will come back."}
{"text":"This was one of the best restaurant experiences I have had in Toronto in a long time.  Although the prices were high, every item on the menu was intriguing, which is always exciting when you want to try everything that they have. All of their ingredients are fresh and everything is made in house (including the pasta, which I had specifically asked about).  The servers knew how to cater to you and make sure it was an exceptional experience.  I had the lobster ravioli and for my main I had elk loin wrapped in foie gras and truffles.  It was absolutely delicious and rich.  For my cocktail, I had the Butter Rum Tart, which tasted like a butter tart and got me pretty tipsy and set me up for a fantastic meal.  The additional treats were the fresh baked rolls, the amuse buche (mushroom soup and a salsa with deep fried goats cheese), the palet cleanser (a sorbet of sangria), and the complementary desert of fresh donuts and chocolate.  There was nothing I could have criticized about this meal at all.  I was not expecting what was provided and that was also what gave this trip the five stars.  Don't expect too much and get blown away by the experience."}
{"text":"A great restaurant that always delivers. 

First of all, the service we've had at Frank's has always been exceptional. Having worked my way through university by waitressing and bartending, I can be a little picky at times and Frank's has always been excellent, which is saying a lot. The servers are always knowledgeable and friendly without being disruptive while you're trying to enjoy an evening out. 

Everything we've had on the menu has been delicious and we've eaten pretty much every single dish. For me some of the highlights are the lamb, the gnocchi and the pork three ways. There hasn't been one dish that I'm not a fan of. I also like all the small touches - from fresh bread and olives with spreads, an amuse bouche and the sorbet, to the truffles as you leave. 

The one downside (and a small one at that) for us is that the menu doesn't really change much - it changes a bit but not much - so we've now had pretty much every dish. It's a tough call since some people balk at their \"favourite\" being taken off the menu but I'd like to see a little variety. 

This is our go-to restaurant for special occasions - anniversaries, birthdays, big celebrations etc. Absolutely worth checking out and visiting again and again."}
{"text":"We went there on a snowy Sunday evening so it was a little quiet. The food was.. incredible. I got the steak and my wife got the rack of lamb... both were so tender and juicy. Cooked perfectly with great presentation. The sides were all delicious. Service was also super welcoming. We ordered two cocktails each (one was a Jalapeno based spirit that I highly recommend). 

Overall, it's pricy but totally worth it. Highly recommended."}
{"text":"Visited Frank's kitchen for the first time on a friday evening at the end of April.  We thought the service was attentive and really enjoyed the bread and butter provided at the beginning of the meal.  My appetizer, the gnocchi in gorgonzola cream was also very good.  The rest of the items we ordered were not as exciting  The catch of the day (black cod), the lobster ravioli, the octopus and the sticky toffee pudding were alright but not great."}
{"text":"I feel like Frank's has changed the face of College St.  It was getting a little stale, and apart from the great standby, Sidecar, I was starting to feel like there was no where left to go to eat in Little Italy.  Frank's food is perfectly prepared, the menu is enticing, and the service is excellent.  

I had a wonderfully prepared lamb dish the first time I ate at Frank's and a fantastic pork dish the second.  

And these folks are generous.  I love the standard amuse bouche.  The overflowing breads and spreads were so filling and delicious it made me almost not want to eat my main.  The second time I went I ordered the cheese and charcuterie plate which came with such a generous portion of cheese that I couldn't believe the charged so little for it.  Sadly, I was too full for dessert.  

I recommend it to all my friends for a great meal out.  I can't wait to go back."}
{"text":"My wife and I visited Frank's Kitchen for our first anniversary dinner on a Sunday evening.  We were met warmly at the door and given choice of tables.  We selected one in the back so we could listen to the kitchen working and see other dishes coming out.

We opted to have a cocktail each before our meal and were very happy with what was prepared.  The amuse-bouche was perfect - a small, flavourful bowl to start things off.  I ordered the crispy gnocchi to start while my wife had the caesar salad.  The gnocchi were very good, with a creamy blue cheese and pancetta sauce.  While maybe a touch on the saltier side due to the sauce ingredients, it was a great starter.

My main was the striploin steak with black truffles and parmesan frites.  My wife chose the mushroom risotto with duck confit.  Both were exceptionally good main courses - the red wine reduction sauce under my steak was absolutely to die for (and I ended up bringing a little bit home on my shirt when I dropped a piece of steak and it splattered...).  My wife's risotto was flavourful and her duck completely fell apart when touched by her fork.

For desert we shared a peach tarte tatin with a chai latte ice cream.  It ended the meal on a triumphant note and was a great incentive to return to Frank's again.

All in all, we were VERY happy with our whole experience on our first anniversary.  Everything, from the welcome to the food to the service, was on point and perfectly executed.  Thanks to everyone there for making our night so special."}
{"text":"We went here for my husband's birthday last night and were blown away by the incredible food - we didn't leave a scrap or a crumb on our plates - it may have been the best I've ever eaten at any restaurant, ever. Every little detail, even the decorative sauces, were so flavourful and delicious. Service was attentive and friendly too. This is going to be our special occasion go-to place from now on."}
{"text":"This is a little gem on College, where others on the street fall very short.  The area itself is full of overpriced food that is hardly worth the time for a visit.  Some issues with College is that it has become overly popular, so much so that many of the restaurants just cannot keep up with the demand - this place has managed to do it perfectly.  From the confirmation of the reservation, to the accommodating of any request, amazing.  Food was incredible - foodies will enjoy this refreshing little nook - keep up the good work!"}
{"text":"Tried Frank's Kitchen for our anniversary April/14. We lucked out booking the day of as there happened to be a last-minute cancellation that we snatched up. All the same, I would advise to make reservations well in advance. Wonderful, knowledgeable & attentive service. We had the Tasting Menu which comprised of 22 courses ($80/person). No regrets! Food presentation & balance were exceptional. Loved our cocktails. We're definitely coming back as it was worth every penny. Great spot for special occasions such as Every Day."}
{"text":"Frank's Kitchen deserves its place in nearly every Top 10 list in Toronto.

We managed to get the last reservation on a Friday at the bar.  It's a good thing we did, because Jessica's service was the best I've ever had in this city.  She was informative, attentive, descriptive, and clearly passionate.  I'd definitely request sitting with her again.

The food we ordered exceeded our expectations, but at Frank's, it's all about the unexpected (or more accurately, the un-ordered)

The artisan breads, baked in-house, came with a variety of spreads and olives.  The hot and cold amuse bouche were outstanding.   The sorbet tasted like lemon-lime-tangerine and was refreshing and palette cleansing, just as it was intended to be.  Lastly, the dark chocolate truffle that came with the bill was the perfect way to end a memorable meal. 

What we did actually order was also amazing.

I started with a beautifully marbled, melt-in-your mouth beef carpaccio.  It was topped with a generous amount of shaved truffle and foie gras torchon (that was divine spread onto sweet brioche).  What really made the dish was actually what sounded most peculiar about it: the French bean salad.  The barely-blanched, still-crisp, finely-diced beans added a lightness to all the indulgence.  I highly recommend trying this dish.  My friend loved the arugula salad with mortadella, pistachio and roasted figs that he ordered.  I took a bite, but was too caught up in the carpaccio to actually remember what the salad tasted like.

The lobster ravioli in tomato broth was lovely.  The pasta was hand-rolled, and the ravioli were bursting with nothing but big chunks of lobster meat.  They were floating in a delicate tomato broth that packed much more tomato flavour than you'd expect.  It was light and refreshing and the perfect follow up to the rich carpaccio appetizer.   What also helped was the complimentary glass of white wine given to me, because according to Jessica, \"it goes too well with the ravioli to not have it\".  It was a great and most appreciated pairing.  My friend had the elk loin wrapped in foie gras and truffles and said it was absolutely delicious.

Since everything we ordered completely over delivered, we thought dessert was a good idea.  Unfortunately, the plum tart we chose was too sweet and too sticky for my likings, but the chai ice cream it was topped with was really fantastic.

The combination of outstanding service, impeccably executed food, and a warm ambiance, makes Frank's stand out from any other restaurant in this city and a truly memorable experience.  I simply cannot wait to go back."}
{"text":"It's the little details that sets Frank's Kitchen apart from the other (very) good spots along College.
From the warm and genuine welcome, the gorgeous, but understated decor, the little hooks for my purse at the bar (should be standard everywhere), to the attentive and smart service, dinner on a Thursday night was remarkable.
 In a city where nothing good can possibly be 'free' Frank's Kitchen delights guests with house made bread, warm olives and a parting gift of the best chocolate truffles I've ever had.
Our meal highlights include the plum, cherry and buffalo mozzarella salad, the delightful amuse of tuna and avocado cream soup and the fresh, mild oysters with 3 amazing house-made sauces. 
Strong, strong like for Frank's Kitchen."}
{"text":"This is the place to go for a special event, like anniversary, birthdays etc., Arrived at the door and got our coats hung up. Was greeted with nice baked bread from the morning with nice dip.

Started things off with the 'Tuna Tartare'. Very light and tasty... A must try for sure.. Also got the 'Seafood Cocktail'. The mixed seafood was sitting on top of a block of ice . My only complaint is wishing there was more shrimp, lobster pieces, and crab meat for the price I was paying...

Anywhooo the mains we got the St. Jacob's 3 way pork. It had crispy pork belly, and two other meats that were very tender when cutting it was effortless...I wished there was more of course, and my gf got the milk fed lamb which she enjoyed very much...

Desserts: Got the black plum to share and that was great as well...
Definitely a great place compared to other restaurants out there. Great service, price, atmosphere, and would definitely come back to this place."}
{"text":"This place was a bit hard to find out about for a foreign traveler, but I saw so many great reviews, I thought I would give it a try.  Booked my reservation.  Since I was a single, they made my reservation at the bar.  No big deal, but the restaurant was definitely not full and I likely could have had a table.  Not the end of the world, as the bartender was very nice, but it sometimes gets old being treated differently because I have a tendency to dine alone.

Arrived, opened the menu and was super excited to see there was a tasting menu.  I tried to order it, which is when I was informed that it is only served at 6 pm and you have to make reservations for that specifically in advance.  When they took my reservation, they never said anything about this.  I have never had to book the tasting menu in advance at any restaurant (and I've been to my fair share), so it never occurred to me that I might have to do this.  

So, I ordered a starter of steak tartare.  Sadly, there was nothing on the menu description that indicated it would be spicy.  It WAS.  I ate it because I really hate to see good food go to waste, and since I work in kitchens, I know how it feels to have food sent back.  But I couldn't taste anything other than spice (in all fairness of full disclosure, I cannot tolerate any heat - it is not their fault about that, but tell someone that a dish is spicy! I'm not the only one who doesn't like that). 

I then had the charcuterie board which was quite good and the pork three ways that really was very yummy.  It tended a little sweeter than I like, but it had fairly decent balance and a really nice texture balance.  I ordered dessert and it was... fine.  In all fairness, I found almost every dessert I ate in Toronto to be a bit sweeter than I like so maybe it's a Toronto thing.  Also, I'm a bit pickier about desserts than anything, as I deal with them daily.  But it was... fine.  I didn't even finish it though.  Not because I was full, it just didn't make me want to finish it.

Overall, I see the creativity in the menu and I like the idea behind the local and farm-to-table movement that the chef is behind.  The service was good (outside of the information about the tasting menu being delivered beforehand, which could also be easily solved by having a website).  The wine was... not bad and they really did try to find one that I would like.  It was probably my least favorite meal in Toronto, but that isn't to say it was bad.  It was just up against some very stiff competition.  I think if I had a chance to do it over again I would have found out about the tasting menu, as the single best bite I had all night was apparently an extra dessert that they had left from the tasting menu that they gave me (it was a take on a cheesecake and was actually quite delightful).  I think that is the way to go..."}
{"text":"We came here for my birthday and I couldn't have been more impressed... The 22 course tasting menu, yes 22 courses, was outstanding. It's very rare for every item on the tasting menu to be consistently delicious. Frank and team have obviously put a lot of thought into each dish. The host and waiters provided  impeccable service. This is easily one of the top three restaurants in Toronto right now."}
{"text":"Excellent food, awesome service, and perfect atmosphere.  We went to Frank's Kitchen for the first time yesterday and loved our experience.  The staff take a lot of pride in their work, which reminded me of restaurants in parts of Italy.  I would recommend this place to anyone.  I will also definitely go there again!"}
{"text":"Went on a recommendation from a Torontonian.  He said it was his favourite restaurant in the city.  It was not to be disappointed.  Excellent service, excellent food, and favourable abidance.  Defiantly will be on my stop next time i am in Toronto.  It has the whole package."}
{"text":"Amazing meal and evening! 
After reading all the great reviews, my husband and I were super excited to try (and actually have been eyeing this place for a long time) and FK did not disappoint! 

We had a bottle of brut - celebrating husband's new job! 
We also had: 

Warm mushroom salad - amazing, so flavourful!
Beef Tartare - usually I don't eat this but it was exceptional I couldn't help myself! 

Lobster Ravioli - this was maybe our least favourite item but it was still quite good. 
Lamb - when I asked the waiter about the lamb - he said he's heard its the best in the city - and I whole-heartedly agree! This dish was unreal. The lamb was beautiful cooked and tender and the other aspects of the dish complemented it beautifully - eggplant puree, mint yoghourt, fried artichoke! 

Thanks Frank for an incredible evening :)"}
{"text":"Fabulous Food and service.  Beef Carpaccio was outstanding, as was the Catch of the Day.  All 6 of us loved every app, main and dessert ordered!!!!"}
{"text":"Not really my cup of tea.....simplicity and perfection can be bliss but Frank's is the complete opposite....sophistication and maturity is missing in the food especially if its suppose to be french...Really french??? ....Frank tries way too hard...instead of 3 sauces on a plate that conflicts with each other, how about 1 great one. Instead of 3 ways to making mediocre pork, how about just 1 great pork dish...This was my overall problem with the chef here....."}
{"text":"Worst reservation strategy ever!  They took my reservation only to call me back two hours later to cancel me. Hmmm.  Now I reallly don't want to go and check this place out."}
{"text":"What a disappointment.

After more than a year, here we are, to have a romantic dinner but most important good food (or at least we hoped for that). Seating is available and the atmosphere still pleasant but the pleasure ceased to exist right there. 

Appetizers are still good (especially the tuna tartar). But this time we wanted to have a real dinner and after brief appetizer experience went for the mains. The fresh bread is still there, as is the two-sips tasty soup in a little glass. However:

18$ Bolognese pasta is disastrous, tastes like it's from a can or something. And it's over-spiced on top of that. Bolognese sauce is never very spicy, this is obviously some \"fusion\". And on top of that the server tried to charge it 25$, explaining that \"the version in the menu is a small one\". Pure fraud, so he had to go back and put in the correct value. They probably think they can get over it since the clientele is \"rich, so they will not care to pay 7$ more\".

32$ fish is *extremely* small portion, on a bead of corn (did you just say corn??? Yes, no other vegetables, just the good ol' lousy corn from a can). There were 2 tiny little pieces of scallop as well. It's both half-tasty and laughable at the same time... for 32$ you certainly expect more. At least a hint of a real vegetable.

Ah well... I guess this is the new trend in town - small menus, small portions, and high prices. Gotta pay for the rent, so let's rip off people. Thank you, but I'm going to spend hard earned money somewhere else."}
{"text":"So this review is a little late, given that we dined here in December. Hopefully things have improved since or we caught them on an off-night, who knows.
To start off with, I really wanted to like this place and I had bookmarked it early on when I first heard about it so was very excited to finally try it.
Overall, the food was admittedly good but the service is the reason I had to deduct a few stars and why I won't be returning for a second visit.
The dinner started off promising as the complimentary breads and dip were delicious.
Our server however could not have seemed more uninterested in us, beginning with our questions, whether it be for recommendations or to describe dishes if we were trying to decide between them, answering us all seemed like an inconvenience to him. Requests for any changes to a dishes to omit an ingredient was 'impossible, absolutely not, just choose another dish then' - a simple polite 'no, i'm sorry, we can't..' would have sufficed?
Food-wise, the entrees fared better than the appetizers. Perhaps we should have  ordered something other than the oyster rockefeller but I didn't find them that great. I enjoyed my elk loin but the striploin was a tad salty. It did come with a generous portion of fries though. Not a generous portion of truffles, but that's to be expected when not served as a supplement. So I still appreciated the shavings. 
We inquired about the tasting menu that was mentioned on the menu thinking it might be a good option for occasions, but no details are given (price, # of courses, min ppl)? Waited and waited for someone the server was supposedly sending over to give us more details that would 'be right over' (he never did). When that never happened, we were directed to speak to the woman at the front who could give us the information on our way out. But apparently that's not possible during dinner service even though nobody was waiting at the front. 
So we left still knowing nothing about it but not wanting to return anyway.
While not the most expensive restaurant in Toronto, certainly not the cheapest and not one I would come back to."}
{"text":"We were regulars at this establishment, we had to cancel one night no choice  The manager/owner phoned my husband and beratted him for 10 mins  We have never experienced such a situation before and frankly were agahst.  Clearly we will never go back nor recommend to friends  Absolutely insane behaviour."}
{"text":"The food was absolutely amazing. We had the Baked Oysters Rockefeller, Lobster Ravioli, and the aged beef striploin. We had the creme brûlée for dessert. For drinks, their cocktails were created with extreme precision and tasted fantastic! It was hard to get reservations, even weeks in advance, so PLAN AHEAD! We sat at the bar, but still had a great experience. The only point of improvement I would only note is that the service got really slow towards the end of our meal. Otherwise, it's a great restaurant, definitely recommend."}
{"text":"Simple fresh local ingredients, cooked with amazing french technique, what more could you ask for? 

Amazing dining experience! 
From the host, to the waiters, to the cool lounge music playing in the background, to of course the crazy AMAZING food from chef Frank Parhizgar, this is the kind of place you ACTUALLY want to go out for. 

My husband and I went to Frank's last week and I can't stop thinking about how great of a dinning experience it is. My husband is a chef so taking him out to eat is hard.... He's busy and picky, and only wants the freshest best food. And he loves it here of course! We hardly go out anymore because it's just always such a disappointment (crapy food, rude waiters, waste of money). But then we found this gem.

I love how small and intimate this restaurant is, very romantic. We've been here a few times now and will keep coming back for our special occasions and when my chef husband gets tired of cooking lol.

The waiters are amazing, very knowledgable with all ingredients and wines. Very informative. Fresh bread so tasty. The amuse bouche is a lovely surprise each time from the chef. I love the pottery plates, very different. Palate cleansers (sorbets) another lovely surprise. Meat always made to perfection as ordered and  chocolates from scratch with the bill, Yum! 

This time we sat at the back beside the kitchen and actually had a chance to talk to Frank while he's cooking. He seems like such a cool guy, very friendly. (Would love to have a drink with him and talk lol)

Anyway I can go on and on about how fantastic this little french restaurant is... But better yet, just make a reservation now, and take your date out on a beautiful night for wine and food. 
you won't be disappointed!! 

Ps: I wish I can come here every night of the week to try everything on the menu haha

Thanks to everyone at Franks kitchen for a great night out."}
{"text":"Loved this restaurant. All the freebies  like the bread, cheese balls, gazpacho soup, sorbet and truffles were a nice and unexpected touch. Will definitely go back."}
{"text":"I took my boyfriend here early October for his birthday. Food was PHENOMENAL. We started with the Oyster Rockefeller which was extremely tasty. For mains we had the catch of the day, which was scallops topped with Kobe beef stuffed ravioli and a corn salsa, and we also had the steak frites. Scallops and ravioli were delicious; especially the stuffed ravioli (I wish we had more than three!). The steak was honestly probably the best steak I have ever had, better than the steak I had at Jacob's. It was so flavourful, and a perfect medium rare. They add a nice herb flavoured crust on the steak while keeping it tender and juicy on the inside. The amuse bouche and truffle accompaniments were such a nice touch. We had a dessert that was like a deconstructed apple pie. It was good, but nothing mind blowing, and was probably my least favourite part of the meal. The apples were much too big for the dessert in my opinion (made it difficult to eat). Our cocktails were delicious. Service was excellent. I had an amazing experience here, and it's hard to believe that anyone else could have anything less than that with the food being that good. We'll be back for the tasting menu :)"}
{"text":"Hahahahaha!

This IS a restaurant.   Food quality perfect.
Low key.  I'm so impressed. 

Look at my pics"}
{"text":"Definitely a spot for special occasions, unless of course if you've got the dough.

We were late half hour for our reservation (*rolls eyes*), but they kept our table and was very nice about it. We just had to eat fast.

- homemade bread and hummus dip - Amazing! the bread was fresh and warm. hummus was oily and flavourful. I hate it when place give out gross store bough hard bread.

- corn soup with goat cheese fritter - YUMMY! The fritter of course. The corn soup was just OK.

- two courses down and we haven't even ordered anything yet.
  We got a bottle of McMannis Pinot Noir... received a bottle of Cab Sauv instead. The bartender should really pay more attention next time....

- finally, real food: appetizers:
1. tuna tartare: Good. Fresh, tasty. Worked really well with the avocado and a side salad. 
2. Lobster ravioli: DELICIOUS! big chunks of lobster, simple yet tasty tomato based broth. one of the best ravioli i've had.
3. oyster rockefeller: can't come here and not try it. It was amazing! Though I knew with all the hollandaise sauce it's probably a very fatty dish, I was enjoying it too much to care. 

- here comes the sorbet between our courses. Nice and cold and sour.....

- main course:
1. I got the lamb. It was good! very tender. but nothing too special about it. 
2. No he didn't! ..my friend got another dozen of the oyster Rockefeller! LOL. SO GOOD!

- dessert: chocolate cake and i had the black plum tart tatin with chai tea ice cream. It was really good. many different texture from the cold ice cream to the warm fruit. YUM.

- last but not the least, how can we forget the homemade  chocolate truffle that came with the bill? :)

Will go back for sure."}
{"text":"So glad to have discovered this small delicious restaurant.  This restaurant does well in every area that I value: food quality, presentation, service and atmosphere.  It deserves five stars from me.  

Food: 
The menu changes monthly which is good, gives me excuse to come back often to try new dishes.  Also, it's dependent on local ingredients and what is in season.  We ordered the baked oysters, beef striploin, comfit duck leg with foie gras and a cheesecake.  All were delicious and done well.  From the presentation to taste, everything complemented well.  The portion size was good too.  In addition to what we ordered, they served us freshly made bread with homemade hummus at the beginning and an amuse bouche (soup) in between our appetizer and entree and truffles to end our meal.  

Atmosphere/Service:
Spectacular service! They explained the menu and came by to check up on us periodically.  The decor and overall atmosphere is very soothing and comfortable.  Can't wait to go back again."}
{"text":"Booked a reservation for 2 ppl 3 days in advance with no issues. The service was fantastic. We had dinner at the bar and the staff was super attentive. The cocktails were delicious. The home made bread and olives were very fresh. There were little surprises between courses which added a nice touch.  We started with the gnocchi which was fantastic. Then the husband got the rack of lamb. The portion was really hefty and the sides were very rustic. I got the catch of the day which was a lobster in a tomato broth. It was amazing! We finished the meal off with espressos and an apple tart dessert with chai ice cream. Overall the food was amazing. A great dining experience. It was on the pricier side, but well worth it."}
{"text":"All in all a nice fine dining experience.
My only gripe is that brussel sprouts were slivers of outer leaves so really no veggies for a kinda pricy place.  Still better than many other fine dining places...if you must"}
{"text":"***4.5 Stars***

One word: Ah-mazing!

My SO and I were at Frank's Kitchen to celebrate my birthday.  When you arrive, you get an instant vibe of warmth and felt like we were dining at Frank's home.  

After we were seated, our server walked through the menu in details.  Everything at Frank's kitchen is fresh, locally source and made in house.  The bread we got to start our meal was phenomenal - Frank makes the bread in house as well.

The oysters we got were so fresh and I loved the different sauces were accompanied with the oysters.

Our entrees were also stellar.  The amuse bouches between courses is a really nice touch. 

Service was top notch; my birthday celebrations were even a bit more special when they presented our dessert with a birthday candle.

I highly recommend Frank Kitchen's for anyone looking those a date night or if you are out to celebrate a special occasion."}
{"text":"Hello Frank,

If only my kitchen was like yours!
I had such a wonderful evening! 
Five star service and food that was perfection.

I forgot to make a reservation at Woodlot and well, we were hungry and we didn't want to wait an hour.  Frank's was just down the street and even though they were busy, they made room for us! =)

* Bready Bread* 
The olive tapenade was freaking delicious served with Chianti loaf and baby brioche.  I thought the sweet brioche was perfect with the salty olives.

*Amuse Bouche*
I didn't love the chilled potato-leek soup.  I felt like I was drinking salad dressing... However I loved the goat cheese croquette...deep fried, soft and melty on the inside and oh-so-yummy! 
I want more! I love fried cheese. =(

*Seafood Cocktail ($15)*
Cool presentation.... ha, because the seafood is served on a block of ice with a banana leaf!  Big chunks of fresh lobster, shrimp, and crab meat!  I was worried that I would be disappointed with the size of the serving... but I wasn't!

*Sorbets -- Super tart and limey (sour face)

*Elk Loin ($34)*
This main is a good meal on a cooler evening.  It's hearty and heavy!
The elk loin was tender and juicy.  I did wish there was more foie.  =(  There is a quarter sized piece tucked under a morsel of beet ravioli.  The chestnuts-and-foie-gras jus was spectacular though.  

*Molten Chocolate Cake ($8)*
I didn't love the cake.  It was a bit dry... and not... molten enough.
The cherry sorbet was a good pairing with the chocolate... the flavors are like a black forest cake.. (But I sort of don't like black forest cake). 

The food is four star.
But they treat you like royalty and I loved eating here!
The waitstaff took wonderful care of us!  On the way out, all the cooks turned and smiled and said goodbye! 
And you get free homemade mini chocolate truffles?! 
Five stars!"}
{"text":"Franks Kitchen, a delicious little restaurant nestled on a busy street. Understandably packed when we arrived without reservations, you get a great feeling when you step inside and the hostess greats you with a warm smile. 
As mentioned we didn't have a reservation, coming from Vancouver we are somewhat used to not making them, we did try and call around 8pm but couldn't get through, so chance it we did. The hostess tried to get us a table but suggested we might first take a seat at the bar and then later move to a table, we agreed. 
The service was good and friendly but confused at times, sitting at the bar we were looked after by about three people - something you might expect in this situation (servers, a couple of bar tenders, food runner etc) - the only thing I will say is we were seated at the far end of the bar by the beer taps and the servers tended to congregate there, a couple of times I was witness to gossiping, complaining about other guests and a little joking around, not really appropriate. 
The food was wonderful. The appetizer I ate of Goats Milk Burrata was fresh, zingy and well put together but perhaps a little heavy on the muddy beetroot. The next course of lamb was delicious, well cooked and seasoned perfectly, it was however despite the generous cut a little naked on the plate served with a simple reduction and a small single cube of polenta alone for $37. 

I would come back for sure, ensuring to book ahead. We never did get seated at a table, some did become available I noticed and I would suggest trying to keep it a little more formal at the bar. I noticed the other guests received small chocolates at the end of their meal, I saw them being prepared in front of me - a small thing but we didn't receive ours."}
{"text":"Loved it! What a great addition to the neighbourhood!
Our server was great. Really attentive and informative - I love when servers take the time to tell you about the food and the care that went into making it.

Also loved the free amuse bouche' that were showered upon us, including
a cheese croquette with cucumber dill gazpacho, a lemon basil sorbet, and really rich chocolate truffle. 

We started with baked Oysters Rockerfeller sauced in hollandaise - seriously yum! My companion had the lobster ravioli that seemed like it was literally stuffed with freshly shelled lobster. I had the striploin with foie gras and a huge bowl of parmesan crisps  - these were a bit of a surprise because I was expecting something more akin to a frico, although I see now how this meant fries...

Overall this was a really fun foodie night out."}
{"text":"My bf and i love this place* smart casual but easy going atmosphere* 
The food is beautiful in presentation and great standard in taste* the quality is definitely good because they know how to bring out the good flavour of the meat while not boring with the sides of sauce,veggies or complementary all on the same plate*  it reminds me and associates like a plate of art :)"}
{"text":"Good food, excellent service, great experience overall.  The amuse-bouches were fun, the entrees were solid, and the atmosphere is nice.  One of the best restaurant experiences we've had in Toronto so far."}
{"text":"This was a culinary experience not just a meal. The flavor in each dish was exceptional and some of the fresh ingredients came right from the chefs garden. We had 4 different entrees and all were excellent. The lamb, pork, short rib and lobster ravioli received raves. The service was impeccable and yet friendly and relaxed. You've found a gem if you've found Frank's Kitchen! Bon Appetit!"}
{"text":"OMG!  This place is the bomb.  We literally ordered almost everything on the menu and we were totally blown away.  My husband is a CIA trained chef who travelled France and Europe's sidewalk cafes for 6 summers while in school and I admit I am totally spoiled.  Why eat out when this guy is at home cooking?!?!  Frank's is such a beautiful treat!  Food was absolutely gorgeous:  whipped homemade goat cheese salad with cherry tomato confit = heaven!!  Amuse Bouche of butternut squash with truffle creme fraiche and pumpkin seed crackle in dishes the chef made.  Are you kidding me??  The food is absolutely top notch luscious.  Service and detail seals the deal.  5 stars aren't enough."}
{"text":"We went to Frank's to celebrate my mom's birthday. It took a while before the food arrived but we received complimentary fresh peas and amuse-bouche while we were waiting. We shared appetizers and they were really good. My father and my husband both ordered striploin steaks with black truffle shavings and loved them. I had Kobe beef short ribs and my mom had lamb. My mom said that her lamb was a bit dry but my dish tasted incredible. I think Frank's is perfect for small celebrations, the place looks very sophisticated, it is on the pricey side, though. This review should really be 4.5 starts, I went with 4 stars because of slow service even though the place was half full."}
{"text":"Amazing.

We sat at the bar.  The bartender was lovely and provided great service.  I had about five blueberry bellinis - made with real blueberries (you can watch her making it) and really fresh and light tasting.  

They give you a bunch of free surprises along the way, all that were absolutely perfect accompaniments but I don't want to detail them as the surprise is half the fun.  

We had four appetizers - seafood plate, lobster ravioli, the venison three ways and oysters Rockefeller.  Everything was stellar; the ravioli was just meh.  I'd skip it.  

For the main, we shared the pork three ways.  I commented it tasted like pork - too often pork isn't done to really bring out the delicious natural flavours.  We had the parmesan fries with lemon aioli (the dip was soooo good).  These were good, but I was so full at that point I could barely appreciate them.

Note they don't have a website, which is kind of annoying if you're with someone who can't just eat anything, as you can't check out the menu beforehand.  It's small enough though (the menu) that you could probably call ahead and they could read it to you over the phone.

Great evening."}
{"text":"I don't know if I would give it a full five but it's pretty darn close. I called a week before to book a reservation for 6 and Elizabeth was able to fit me in for the Saturday after Valentines Day. We got there and they kindly took our coats. They forgot to tell us the specials as they did for the other tables but I'll let it slide. We ordered a glass of wine to start and they brought us out a beautiful plate of fresh made bread with olives and a red pepper paste. We ate it all up! They gave us an amuse bouche which was a delicious potato leek soup and a crostini with a Chestnut spread. It was perfect. I could have had ten servings. Our next course was the papardelle bolognese that we shared. It was a perfect portion and the meat was so flavorful. They brought out a sangria sorbet pallette cleanser that was so yummy it could have been a dessert. My date had the lamb which was tasty but could have been cooked longer as it was really pink. I had the gnocchi sans the pancetta which was heaven. It is an appetizer size but I wish they warned me how small it was gonna be. If it wasn't for they bread I would have been starving. We ended the meal with complimentary handmade chocolates and it was exquisite. I would definitely recommend this place to sweep that special someone off their feet. The ambience is dimly lit and romantic. The service was impeccable. Thanks to the Huffington Post for the suggestion!"}
{"text":"I Love this restaurant!

Went last night with no reservation, which is bold on a Saturday night. Got lucky and got a table after a 15 to 20 minute wait.  But I recommend making reservation.

The service was excellent. Friendly, attentive, knowledgeable staff.

OMG the bread was yummy! As were the olives and radishes it came with, and the spread.

My friend and I shared the arugala salad which had artichoke hearts and a delicious, light dressing. I had the duck which was cooked and seasoned to perfection. And my friend had the rack of lamb. He gave me one, I was in heaven.

I had a glass of the Pinot noir, which complimented the meal very well.

We even shared a desert: the flourless chocolate tart. Wow!!! Super rich and so tasty. I suggest sharing this dish. 3 bites is enough. 

The tables are a bit close together, but the food was so incredible I'm still giving Frank's Kitchen 5 stars!"}
{"text":"My boyfriend brought me here for my birthday last month and I'm still dreaming of this dinner!! Very intimate ambiance, our waiter was very hospitable. We requested an off the menu order of foie gras as an appetizer and the chef did not disappoint. Would come back for sure!!!! Prices are very reasonable for the portions and great flavours!"}
{"text":"After many raving referrals - we finally came in for dinner.  Couldn't get a table reservation so we were happy to sit at the bar!  Food was honestly amazing.  I can't remember the name of the dishes anymore but I had a seafood appetizer and that alone was to die for.  Amazing plating too!!!  (I never take photos of my food and that night I did!)

Bartender was very friendly and chatty when we asked him questions about the restaurant.  

Drinks - AMAZING.

Bill came to over $200 for 2 adults.  Romantic, cozy spot.  In fact, someone got engaged there the night we visited!

Highly recommended spot for special occasions and romantic date nights!"}
{"text":"I was having an early Valentine's day celebration with my boyfriend. The atmosphere of the restaurant was nice. Their service was awesome. The food was perfectly matched. I definitely will recommend this restaurant to my friends. This restaurant does worth 5 stars. I will come back for sure!"}
{"text":"I've tried coming here twice before and it was full on a Friday/Sat w/o resos.  Made reservations for a Sunday evening and the restaurant was barely half full.

I had heard great things about their artisan bread and it lived up to expectations.  Came with several pieces with their home made hummus and a stack of warm olives.  It's worth the $1.50 for another order if you're hungry.  We had the lobster ravioli and warm mushroom salad to start.  The salad was very nice if you're a mushroom lover with kind of a slaw on top which helps balance the strong mushroom taste.  Ravioli was one of the best lobster raviolis I've had.  It's also home made with generous chunks of lobster in it and a sweet tomato sauce.

We had the 5 seafood medley and foie gras wrapped elk loin as our mains.  The medley was delicious, but more of a tasting menu portion.  The crabcake and scallop were particularly good.  The elk was absolutely decadent - foie gras + elk (medium) + truffle shavings in a sweet jus...  You cannot go wrong if you are looking to indulge. You get two pieces of foie gras wrapped elk, and one piece of foie gras with a small piece of pasta on it.  The 3-way pork also caught my eye.  For dessert, I had the flourless chocolate cake with a sorbet on top, which was amazing.. I could eat 3 of these!  The sorbet really adds to the taste.

The nicest part was we were given several small tasting dishes compliments of the chef.  I am thinking that this is a regular thing there, but we were given something between all our courses which was a very nice touch.  First was a cheese + potato puree/soup, 2nd was a sorbet type pallet cleanser and the 3rd and possibly the best were the chocolate truffles after our meal.

With some alcohol it was definitely on the pricey end, but Frank's Kitchen is worth every penny for a special occasion."}
{"text":"So this guy Frank is apparently a sauce specialist and I'm not even going to try to pronounce the French word for it because last time I did that I said the French word for sausage and was ridiculed, but anyway the food here is incredible and incredibly expensive but it's worth it, especially the seafood medley entrée I had, which was a little lineup of bits of various rich fishes and seafoods each with their own little amazing sauce, and it was all worth the money and waiting over half an hour for my friends to arrive while the hostess not-so-silently judged the foundation of our friendship."}
{"text":"RIP. A fantastic and memorable experience from start to finish. One of the best meals that I've had in Toronto in a while. 

I was here with my family during the last month of operation as the owners announced they were looking for a new space and adventure. I'm so thankful that I got to eat at this College Street dining secret before they officially closed (okay not \"secret\" per se, but rather a 5 star gem that didn't seem super overrated in the Toronto food scene). 

I can't imagine things going wrong with Chef Frank in the kitchen. Even a simple salad is scrumptious: Arugula Salad with Avocado, Hazelnut, Broccoli & Green Goddess Purée in a Sherry Vinaigrette.

I can't wait to see where Frank and Shawn go and what they do next. 

Highlights: Seared Sea Scallops with Puy Lentils, Sunchokes & Black Radish in a Kumquat Jus 

Anything meat or oyster 

The aged beef stripling with shaved truffles in a a shallot jus with a side of parmesan frites was apparently one of the best values ($40) for steak of this quality in Toronto

Rack of lamb is solid"}
{"text":"I've been here once before and I will tell you, I will definitely be back. Whether it be the food, decor, or service this restaurant exceeds expectations.

Frank you have done a wonderful job, sir."}
{"text":"Amazing service from the wait staff. 
A tasteful and creative menu from chef frank! A must have in the city."}
{"text":"Was here again recently (Oct. 2015), and the quality is still outstanding. The owner still marches the premises each evening, which I think is why the excellence has been maintained.
Interestingly, they try and maintain a short profile of the preferences of repeat clients which is unusual and helps to make the experience all the more pleasant.
Surprising, constantly changing and interesting dishes. 
Well worth the detour to go and try."}
{"text":"This is easily the best dining experience of my life.  From front of house to the waiter to the food and the ambience.  It was pretty much perfect.  I highly recommend eating here you will not regret it.  Great for a date as well as a group of friends or family."}
{"text":"Really pretty resto with fantastic service.  It is amazing the difference a well coordinated seamless service team makes on the dining experience.

We had a lovely trio of bread to start.  Made fresh on site marble bread, cheese bun, and a fluffy brioche bun with an olive tapenade.  We had the raw oysters and seafood cocktail to start.  There was a porcini mushroom soup amuse bouche to start.  Beautiful presentation and fresh perfectly cooked seafood. This was followed by a palette cleanser sorbet.  Lamb chops and BBQ pheasant was delish.  Flourless chocolate cake dessert ... I think I'm in chocolate heaven...  They put a candle on the cake plate to celebrate a birthday.  Come as often as you can.... Seriously....."}
{"text":"Had a very pleasant experience dining at Frank's Kitchen. Ambiance was intimate, staff were friendly and knowledgeable, and the food was consistently good across entree - main - desssert.

We came on a night where there was a set menu ($100 per person). It started off with a select variety of warm breads with a delicious tapenade, along with a sampling of charcuterie, cheese, pickled vegetables and olives. The house-made cheese stood out to me as being especially tasty. Then came the amuse bouche - mini french onion soup (this was cold? Not sure if that was intentional), ravioli with cheese inside, and oyster rockefeller (yum!).

For my entree, I ordered the scallops. It came with a deep fried chicken skin which I wasn't a huge fan of. But the two huge scallops were nicely done. Then I had the rack of lamb in syrah reduction. The lamb was super tender. However, compared to some of my other dining experiences, I do think I've enjoyed the rack of lamb more elsewhere in terms of unique flavour combinations. I also tried a bite of the sirloin steak dish which was also very tender and delicious.

Finally, the desserts! Mmmmmmmmmm. We got a sampling of chocolate lava cake (my fav of the three), sorbet with warm blueberries that burst in your mouth (amazing), and a meringue tart (which I found too sweet). With the bill, we got petit fours which included a melt-in-your-mouth heart shaped truffle, shortbread type cookie w jam, and a mandelin. 

The service was fantastic for the most part. I asked our waiter to recommend a wine to go with my dinner, and he picked one that I was extremely satisfied with. Also, throughout our dinner, we had many different staff check in on us to make sure we were enjoying our experience. We definitely appreciated these check-ins and the smiles that came along with them! Only time I was a bit taken aback was when our waiter was wiping off our table in the middle of our meal - and ended up smearing something all across the table. I don't think he noticed this, and put our cutlery down and left abruptly. Thankfully, another staff saw us wiping off the table with our own napkins, and came over right away to rectify.

All in all a great experience here! Would certainly recommend for a nice evening out."}
{"text":"If you are looking for this restaurant they are back and now open in a different location in Toronto. You can find them under the name FK and they are better than ever!! Yum"}
{"text":"Excellent service, exceptional food, all around a really special place to take someone for a perfect night out"}
{"text":"This was such amazing food, we really felt as if we were back in Italy! Frank is a outstanding saucier chef! The amuse bouche was amazing.. The service was also amazing. I just wish he was closer.. We are in southern Cali but will be back! Thanks frank and wife and staff you truly are gems!"}
{"text":"What a great restaurant - excellent service and amazing food. We did not have reservation and were seated at the bar -  some times this can go badly but not at Frank's. I recommend it ever chance I get. Keep you the great work!"}
{"text":"After several attempts to try to get a spot at some of the restaurants on College, we began to check out menus of places we had not visited before. 
As we were looking at the menu and deciding whether we would try another new restaurant after my horrible \"restaurant adventures\" this past week, the waiter approached us and gave us a bit of info on the chef and the fact that they had only been opened for 4 weeks. He was so genuine we decided to follow him inside. He quickly rushed and filled our glasses with Cucumber Water, which was a nice twist to the ever so popular Lemon Water. 

The decor was warm and inviting and definitely romantic, since we were celebrating my SO's birthday it was appropriate. 

The menu is limited with a few items including appetizers, pasta and mains. The waiter informed us of the specials and explained some of the menu items, including the fact that the pasta is homemade. 
This is a special occasions place when it comes to their pricing. 

My bf went for the Catch of the Day - Sea Bass, his description word for word \"it tastes like something, it has a fish tank taste\". I don't think you have to know fish that well to know that a fish tank taste is not exactly a taste one craves or enjoys. 

I went for the Squid Ink pasta, I was informed that the chef had added extra shrimps because I did not want the scallops, I had a total of 4 (most likely defrosted) shrimps. The pasta was cooked well and the sauce was average. 

There was only about 3 other tables other than us in the restaurant so I had a hard time understanding why our dinner was taking that long. They did manage to keep us busy with \"special\" appetizers on the house that we later agreed tasted better than our actual meals. 

For desert we shared the Vanilla Creme Brulee, which tasted exactly as its title, nothing special there. 

Overall rating, doubt I will revisit."}
{"text":"Ambiance/decor-5
Service-5
Food-4
Strikeouts-0/3

Frank's kitchen was nothing short of classy, good service and good food. I honestly went in here expecting sub-par mediocre food, as most restaurants that don't specialize in steak or lamb chops, but focus on Italian food typically wouldn't be the greatest. Thankfully, I got money's worth for every bite! We ordered Fois Gras ($24), which is an off menu item, but we got about 4oz, which was a large portion. It was definitely good and flavorful, but not too over powering as I've eaten many there were. Also ordered the pork loin and lamb chops. I feel these two items are always a risky order since many places cannot get a right pork loin. It's so hard to cook just right without it being too dry or undercooked. This could also be relatively said the same for the lambchops, but Frank's Kitchen did a good job on both. Very surprisingly, the pork loin was the juiciest piece I've ever had, and the lamb chop was actually done well. Even though it was the best I've had, I couldn't say it was amazing, but I was definitely satisfied with what I ordered. I also saw the steaks other people were getting and it enormous! Some of my friends shared some and it wasn't bad at all. 

If you have a special occasion or have some extra cash for a good meal, this is the place!"}
{"text":"I agree with all the rave reviews about this restaurant. Usually I am a bit disappointed after trying out a highly rated place due to expectations, but not here! The ambience was warm and cozy, the service was excellent and the food was unique and quite good.

They started us out with 4 different kinds of homemade bread with a red pepper dip. The bread was soft, warm and tasted very different from the usual hard bread you get. There were 4 of us and we ordered escargot as an appetizer, striploin steak, catch of the day, butternut risotto with a duck leg, and gnocchi. The escargot was soft and flavourful in a flavourful creamy sauce. The steak was crunchy on the outside but soft on the inside, and sat on top of a bed of spinach and a red wine type sauce. The gnocchi was also delicious. The catch of the day and butternut risotto were less amazing, but still great.

The \"amuse bouche\" dishes were complimentary and a great touch. They were a cauliflower soup and frozen sangria balls (sorry for the crude descriptions), both lovely. For dessert we had New York style cheesecake and chocolate cake. The chocolate cake was better but both were good. We loved the truffles they gave us as a gift at the end.

All in all, I would recommend this restaurant and plan to go again whenever I get the chance."}
{"text":"We had a sampling of appetizers, the Gnocci was the chart topper and the Oysters Rockefeller were good too, but for a signature dish nothing too special in my mind. The tuna tartar was also great. 

A range of items were ordered at our table, lamb, duck, steak frits, and veal. I was able to sample my partner's duck and it was remarkably excellent, my choice was the lamb, and it was unremarkable - rack of lamb should be like candy to me, perhaps if it were to have been served hot it may have been (just a thought - hot food). 

The couple who joined us seemed to very much enjoy the steak and the veal, and the frits were indeed shared with all and were excellent - but you don't go to a $200/person restaurant for frits (wine & cocktails boosted price). 

We ordered some stellar wine, which was decanted but unfortunately more than once we had to resort to pouring it ourselves ie the service wasn't commensurate with the price paid (but granted it was packed but staffing is a part of a great experience). 

Surroundings - very Paris-like; we were across from the kitchen in the back and it was tight and noisy from everyone talking over the open kitchen - but we enjoyed that part of our experience. 

One major criticism; if you're going to accept Amex, accept Amex, don't have your wait staff say (at the table) \"do you have any other card, Visa or Master Card - Amex charges are ridiculous\". Make it simple and just don't accept American Express, THAT left a bad taste in my mouth and it wasn't my card! 

3.5 stars but not 4.



My response to management's Message 03/02/2014:

Hey Shawn,

I'm not going to get into an online pissing match on social media.  It's a review of 3.5 stars on a not so perfect night for you guys - I get it.  Your message is laced with excuses that reveal a lack of process and procedure at the management level.  

This is what I experienced, regardless of excuses.  

Popular restaurants like The Keg, Kelsey's and even McDonald's have \"on call staffing\" policies in place where \"on call\" staff are expected to be available through first seatings and beyond - so a no show waiter, kitchen staffer etc is an excuse and one that shouldn't have been mentioned to people in the industry as we'll call you on that every time. 

So yes - staffing, it gets mentioned and I think that's a fair consideration for a restaurant with your pedigree and level of pride you reveal in other managements messages to reviewers.  Staffing could be \"one of 30 points\" of stellar service - don't you think (rhetorical)? 

Thank God I didn't mention about bussing the table, having to put select items on the planter rail behind us.

As for the number of times I had to pour wine, beyond the initial pour of each of our two bottles and being interrupted to finish the last pour of the second, \"the top up\" as you called it, I personally poured the wine - so it was more than twice and less than five - how's that - fair?

As you know my wife and I were quite tardy (45 minutes) to meet another couple who were hosting us there. However, I can't imagine that you're referencing us as being the cause of being slammed - but if you are taking a shot - then you got us - we were late. But I would hope that people arriving late for reservations wouldn't be the cause of regular chaos, because then that would be the case for you quite often, because when I worked in the industry it was pretty routine to see latecomers... 

As for the Amex issue - the conversation went something (in italics) like this:
 
Waiter (seeing an AMEX Card): \"Oh would you happen to have another card, Visa or M/C?\"  

Me (even though it wasn't my card I am always curious as to why businesses don't take Amex as I am a card holder): \"Why don't you take AMEX?\"

Waiter: \"well we prefer Visa or M/C as the fees are so incredibly high\"

Me: \"what if Amex is the only option?\"

Waiter: \"well we could if needed but it's through a different entity and it's complicated\"

So - we'll have to probably agree to disagree on a few points, but I stand behind my review - it was what it was.  

However that said, I am sure it could have been much better, everything from hot food to having our wine poured.  My wife thought that it was a 4 star experience, but then again I was pouring her wine...

Thanks for reaching out, albeit I experienced your message as being quite defensive.

Vince"}
{"text":"So disappointed!  This place came highly recommended by a regular customer, so my husband and I were excited to try it.  Food was great (gnocchi, lamb).  Service was dreadful!!!!  
We were seated at a very drafty table - that likely can't be helped, but they opted to not move us, even though there were lots of empty tables available at that time.  
Husbands cocktail was served without tequila.  After about 10 minutes the bartender realized what she had done and brought a replacement over to him.  I let the waiter know that i couldn't eat onions (typically a waiter will relay that info to the kitchen, and typically a double check is done to see if its an allergy or a dislike).  Waiter obviously didn't care - served me food with onions.  Even when I said the tuna had onions he argued with me (its NOT in the tuna, its in the guacamole).  He slammed replacement food on the table.  I don't know if the waiter hates his job, is new, doesn't know the food served at the restaurant.  I heard him also being rude to the table behind me.
I was impressed as the manager read a negative review on facebook and called to understand the issue.  She told me the owner would call within a day or 2 - as they wanted to make it right.  However, no call.....
Crazy experience.   Food was good, but not worth the treatment by the waiter."}
{"text":"For my birthday dinner dates, my hubby often treats me to delicious tasting menus. We look for all sorts of different tasting menu places in Toronto and this has been one of the places high on our list to try. We hear of the many different dishes that are served (plentiful plates we hear... ) and we got really excited. 

Glad we got to try it. It was not difficult to book reservations. 
In the past, they only offered tasting menus on certain days of the week. We booked for an early meal on a Sunday. 
We did not have the chance to try their regular menu but may consider for next time. 

 Our waiter was very knowledgeable and polite when serving each dish to us. We were the other ones that were there that evening for tasting menu (i think we had about 12-14 small dishes) and our waiter also had to attend to other regular customers around us as well. 

Each dish was presented very nicely in a dish that looked like a shell-bowl for soupy dishes and spoons for small palate cleansing dishes. I was a little disappointed in the amount I got to eat because each portion was so tiny (this is me comparing to GEORGE's tasting menu which we chose the 7-10 courses and felt that each dish was proportioned with a lot). 

For a cheese lover (my hubby), everything was great because some dishes incorporated a lot of strong cheesy flavours. Unfortunately, I am not a fan of cheese and did not indulge in those certain dishes as much as my husband did. 

The ambiance was very romantic, soft/dim lighting, and cozy atmosphere. I dressed up because it was my birthday but I'm sure you can still fit in by wearing casual outfit as I saw some other customers in the restaurant was not decked out in blazer/jackets."}
{"text":"I keep trying to find one thing wrong with Frank's but time and time again they exceed my very high expectations! To call what is on the plate food is not giving it the respect it deserves. Frank makes everything from scratch and turns your meal into art. He's like an artist who uses your tastebuds for a canvas. Honestly, he's that brilliant of a chef. Shawn (Frank's gorgeous wife) takes front of house to the same level that Frank has taken the kitchen. The servers are knowledgeable, friendly and around your table, just the right amount. I recommend Frank's Kitchen to friends all the time and each one of them has thanked me for introducing them to this amazing restaurant."}
{"text":"Found this gem in Little Italy a few months back. The place was very homey and elegant; especially with the antique architecture, wooden floors, and the candles. Our waiter for the evening was especially delightful, even though we automatically assumed his name was Frank (which was quite embarrassing). This is one of the places to splurge once in a while for lavish food and a lovely ambience, ideal for an evening date. We were first served a bread basket, and my favourite was the one with the pate. Even the butter had a salty richness that I've never tasted with any other. My most to least favourite dishes:

Elk Loin Wrapped in Truffles with Chestnut Agnolotti & Foie Gras Jus ~$24 - the elk loin was succulent and was served with a candy-glazed cherry, a dumpling, and a piece of foie gras (my absolute faveeee).

Escargot Bourguignon with Braised Oxtail and Manchego Foam ~$18 - this was a memorable way of serving escargots. each piece would be taken with a piece of oxtail where there'd be a battle between soft and dense chewiness. the manchego foam tastes like cream and was an interesting take on molecular gastronomy.

Crisp Gnocchi with Pancetta in a Gorgonzola Cream Sauce ~$18 - the gnocchi was made crisp on the outside and fluffy on the inside. I've never tried gorgonzola cream sauce (blue cheese) before but it was almost like a mix of salted alfredo and chilli spices. it was most definitely a memorable dish.

Between the making of our dishes, our waiter served us an amuse-bouche where he poured some parsnip cream into a tiny dish of pears. If only it was in soup format I'd get more! And to add onto that, he served us with hand-made truffles on a cold slab when the bill came in. The chocolate was so decadently filled with what seemed like a denser version of the inside of a lindt chocolate."}
{"text":"OMG.

This was hands down one of the best meals I have ever had. 

My sweet sweet BF took me here as part of my 30th birthday present and I was blown away (thank you honey!!). Everything we tasted was amazing and the service was just top notch. It was a very wonderful evening to say the least.

We started with Oysters Rockefeller, the seafood cocktail, and Ontario heirloom tomato salad with house made mozzarella.

The oysters were cooked perfectly, still very moist and tender, just warm, covered in hollandaise, topped with bits of spinach and bacon - very decadent but very enjoyable.

My seafood cocktail was just incredible. I loved the sweetness of the lobster and shrimp partnered with these amazing orange limes (I forget the exact name of them oops!) and a tequila laced guacamole - outstanding!

The heirloom tomato salad was very tasty, a great lighter dish. I loved the creamy housemade mozzarella, so good!!

In between courses, we were presented with tiny soup bowls with a couple of peas and creme freiche in a little clump. The waiter then proceeded to cover the contents of the bowl with an amazing bright green soup which tasted like springtime. I did not want to stop eating the yumminess, it was amazing!!

Our mid course was lobster ravioli, very tender and slightly sweet from the seafood, just delicious!

My main was a seafood platter of sorts, absolutely beautiful presentation, with a razor clam, crunchy seafood croquette, a tender piece of halibut, and an awesomely tender scallop. I loved this!!

My BF had the steak with shaved truffles on top accompanied by parmesan frites - it looked incredible and he said it was the best steak he has ever had.

For dessert, I enjoyed a birthday edition of the apple tarte tatin, which was just lovely. It was very sweet but delicious, with a crunchy lattice work topping of caramelized sugar - OOOH BOY!!

Loved the housemade truffles which accompanied the bill. Try this place, its awesome! I can't wait to go back to try the 22 course tasting menu!!"}
{"text":"Everything you hear about Frank's Kitchen is true. It is the best, best, best. The food is absolutely unbelievable, the service impeccable and the restaurant is lovely and subtly romantic.

I went with a group of 6 and for appetizers we had the arugula salad, beef pate, baked oysters and the special, which was a chestnut pasta. Everything was absolutely sublime. The food was presented and described with care and each individual flavour came together in an amazing way.

For mains, I had the seafood medley! which came with salmon, scallops, crab cakes, clams and ravioli. Amaze. We also had the steak, and most of our party had the lobster special. 

Though it's on the expensive side, it is worth it."}
{"text":"Frank's is a great place for a special night out. You know you're in for a treat when you could order anything on the menu and be happy. That's how I felt when I saw Frank's menu, and what I ordered made me happy.

The staff is excellent at Frank's. Everyone is friendly, attentive and extremely knowledgeable about the menu.

I found the most difficult part of ordering was on the appetizer menu. I could have ordered anything on the menu and been happy. Since summer is almost over, I chose to order something that won't be fresh much longer - the tomato and mozzarella salad. It was stacked high and drizzled with balsamic sauce, and very pleasing to the eye and the taste buds. Thumbs up!

My entree was the elk, wrapped in foie gras and topped with truffles. To say it was rich is an understatement. It was decadent and delicious and I was happy to have two friends to help me enjoy it. This also meant I got to try their entrees: the fish special and the steak. Both were delicious, but I really recommend the elk!

Every bite of food I ate was really good at Frank's. from the amuse bouche, to the sorbet palate cleanser, the fresh bread, all of it make Frank's well worth it. Call now and make a reservation. Apparently you have to wait a month for a Saturday night reservation, but go on a Sunday. You'll love it!"}
{"text":"Tremendous service.  Excellent quality.  Nice little treats provided by the chef to cleanse the pallet in between courses.  Overall a great experience, not too pricey.  Only issue is getting a reservation.  Book well in advance if you want a table for 4 or more, even on a weekday."}
{"text":"This place is amazing!!

I went here on a date with le boyfriend last week, and everything was simply great. 

The setting is very cosy. 
The service is excellent (though potentially a bit too good)
The food ... wow

Let's talk about the food!

They started us off with a little amuse bouche which was not bad at all. We then had the asparagus and mushroom salad to share for our starter, and it was amazing. The truffle sauce and the tiny hazelnut kick was perfect. They then gave us little palette cleansers between courses (sangria sorbet ... perfect!!) while we wait for our mains.

The mains, oh the mains! I had the veal, he had the BBQ Kobe beef. Both were amazing. Potentially top 5 best veal I have had in Toronto in a very long time. 

We were too full for desert, but the bill came with two pieces of dark chocolate truffles, and let's just say my heart melted. 

The service was really good. Frank runs the kitchen, while his wife runs the floor. She came up to us to introduce herself and check in. Sweet and elegant lady.

The waiters were all quite helpful and very well informed about all the dishes. 

The only downfall would be how often they come in and check on you ... it was just a little bit too much, and quite interruptive of our conversation. 

The decor is very warm and cosy. 

I love Frank's Kitchen, my sincerest compliments to the chef!"}
{"text":"Frank's Kitchen --put on your thick skin and be prepared to be chastised and even spoken to harshly  if you dare to even ask for another table. Also bring your own alarm as they are obsessed with people evacuating their allotted seat on time and yet seem unable to pace their own service to to ensure you are finished--if you can put up with that then the food is indeed tasty, especially the simpler dishes--choose the steak and fries as they are yummy.  Stay away from anything complex--this is a solid college street restaurant--not a foodie temple as the prices and attitude would suggest."}
{"text":"Excellent food... Bursting with flavour. Everything was done to perfection!

Service was amazing too. 

Only negative : They did take about 45 minutes for our entrees to be served following the appetizers (about an hour from ordering).. It wasn't peak dinner time and restaurant wasn't busy so not sure why it took so long (we went in around 8:45 and ordered by 9 and got our entrees at 10). We were both exhausted and starving so that kinda ruined our dinner."}
{"text":"Very fancy place, with absolutely amazing service. Our server was super friendly and very helpful!
Rockefeller oysters were delicious! 
The lamb was perfectly cooked, accompanied by Frank's special sauce - tasted as good as it looked!
Their dish of the day was salmon with scallops,tiger shrimps and lobster ravioli - the best I've ever tried: soft and crispy, served with creamy sauce. And yes, again, 5 stars for the presentation!
I will definitely come back to try their tasting menu!"}
{"text":"My boyfriend and I came here for dinner. The atmosphere was cozy and the service was excellent. Our waiter was very knowledgeable with the menu - not sure how often the specials of the day changes, but he got those lines memorized pretty well haha.

DRINKS:
Napa Cellars Chardonnay 2013
Beer - Beau's

Bread with white french truffle butter were on the house. I've always loved truffles and there was a lot of its flavour in the butter. We finished this up really quickly haha.

AMUSE-BOUCHE (2/5)
A miniature tart topped with goat cheese.

APPETIZERS:
BAKED OYSTERS ROCKEFELLER (5/5)
(spinach, bacon and hollandaise sauce)
This was DELISH! I'd recommend this, the hollandaise sauce was amazing. A very light appetizer to start with.
Note: For those who do not like raw oysters, the oysters are cooked semi-raw.

DUO OF RAW (3/5)
(tuna carpaccio and tartare with cucumber, avocado and lemon olive oil vinaigrette)
This dish was yummy but it didn't stand out as much as the baked oysters rockefeller. The highlight of this dish would be the tuna tartare - very fresh!

MAINS:
CATCH OF THE DAY - POACHED LOBSTER (5/5)
I loved the poached lobster. At first when the dish came I thought to myself, this is not enough (I was very \"hangry\"!!). But as the night progressed, I realized this dish is actually pretty filling. The sauce is cream-based and it paired well with the lobster tail and claw meat. Delicious! If they have the poached lobster as the catch of the day again, I'll probably reorder this!

AGED BEEF STRIPLOIN WITH SHAVED TRUFFLES (4/5)
(with shallot jus and a side of parmesan frites)
My boyfriend ordered the beef striploin. He loved it. The truffles are shaved on top of the striploin by the waiter when the dish is served. They actually put quite a bit of truffles on top so I was very happy :D
The beef was very tender and the paramesan frites were tasty too. It wasn't too dry since they provide a dipping sauce with it.

The two complimentary chocolate truffles was a nice touch at the end of our meal :)"}
{"text":"Wow- honestly one of the best dining experiences I've ever had in the City. Nothing short of brilliant. Great ambiance, decor, service and flawless execution by the chef. 5 star service without the stuffiness of some other high end restaurants. Very relaxed atmosphere and refreshing to have an entire restaurant of staff that are actually smiling and enjoying where they work. 

Our server was extremely knowledgable and passionately explained every aspect of each dish and along the way the Chef brought us several surprises. Absolutely amazing in every way. I had the Tuna Tartare to start and the Pork three ways as my main. The pork three ways was a chop, loin, belly and to top it off a chicharron! Yum. Wine list is impressive and server was very knowledgeable and helpful. 

I think we have found our new \"date night\" spot for my wife and I. Will definitely be back."}
{"text":"Don't let the casual-sounding name fool you, they are deadly serious about producing some excellent plates.  In fact, this may be the best food I've had in Toronto.  I recently took my boyfriend here for his birthday and was thrilled.

Let's start with the FOOD.  We started with appetizers, and he ordered the star of the show, a beautiful Kobe beef tartare.  This was not some chintzy portion, no, it was an ample strip of luscious raw beef.  The menu mentioned truffles as almost an afterthought in this dish, but no, it came with thick, aromatic slices of the magical mushroom.  At $20, this dish is a steal.

My appetizer of soft-shell crab was also quite good, but did not quite blow me away as much.  All of the dishes are incredibly well-composed and garnished with lots of house-made pickles and sauces.  

For the main, I won on that course with a beautiful dish of pork done 3 ways.  First an incredibly flavourful pork dish (around $27) served 3 ways: a luscious loin, perhaps the tastiest and most expertly seared pork belly I've ever had, and a great crispy chicharron.  My boyfriend had a smaller portion of lobster ravioli that were also quite flavourful and in a beautiful broth.  

I almost forgot the amuse bouche (a very pure gazpacho) and palate cleansing sorbets that were a nice bonus.  The chocolate truffles provided as mignardises were a little too cold and fell a bit flat, but hey, it's just a free treat.

The SERVICE was also excellent.  The waitstaff were causal but attentive...I hate the stuffy vibe you find at some places.  They also were able to steer us to an excellent, yet affordable, Oregon pinot noir that beautifully complemented our meal.  

The AMBIANCE is intimate in a small, well-decorated space.  

I sadly did not get to meet the eponymous Frank, but whatever magic he is working in the kitchen, I hope he keeps it up.  They also offer a 20 course tasting menu for $95 on Sunday-Thursday nights, which I would love to try out.  Reservations are recommended for weeknights and a must for weekends.  

OVERALL, highly recommended.  As I mentioned earlier, this is probably the best meal I've had in Toronto, with a California-cuisine like laser focus on fresh, local ingredients.  In addition to being outstanding, it is absolutely good value for high end dining."}
{"text":"Oh my..what a great experience.

What we ate:
Fresh oysters: (4/5) nice and fresh!
Roasted duck breast with foie gras and polenta: (5/5) Holy moly...might be the best duck breast we ever ate
Catch of the day...seafood plate: (5/5) I wish I could have licked my plate..fresh salmon, scallop, squid ink ravioli stuffed with crab.
Blueberry creme brulee: (4/5) Not too sweet and very light!

Drinks: Caesar (3/5), Let the Sun In (5/5), Pinot Gris (5/5)

Complimentary: Lovely mini app, amuse bouche, and olive+ bread platter.

Service and food were top notch...I think you can see that I am a big fan! You get what you pay for -and more!"}
{"text":"In preparation for any trip to Toronto, I always research the latest hot spots of deliciousness. Toronto is teaming with incredible restos and I must indulge at least once or twice on my yearly trip. This trip was just me and my Dad so knowing our savory meats and potatoes kind of taste, I honed in on Frank's Kitchen for our first night out.

My parents started the family trend of sitting at the bar as it's always fun to talk to the bartenders and meet people at the bar. Especially when on vaca. I loved the ambiance of Frank's Kitchen. Pristine, polished and sophisticated. As we nuzzled up to the small bar, our eyes grew big as we eyed the plates to our left. Yes, we had selected the right place.

We ordered a bottle of wine and were greeted with fresh baked bread. Chef/owner Frank Parhizgar spends four hours every morning baking fresh bread for the evening. I could taste all the work that went into each piece. Delicious! The bread was and served with two tantalizing smears of roasted sun-dried tomatoes and olive tapenade. Wow. That would have been a meal in and of itself!

The Chef sent out an incredible amuse bouche! What a surprise! Very classy, Chef Parhizgar, keep 'em coming!!!

While not terrible hungry, the milk-fed Ontario lamb - rack, loin, braised shoulder & grilled sausage in a Syrah reduction with ratatouille & white bean puree kept winking at me. F*ck it. I had to have it. When the dish arrived, I was taken aback and speechless, as this work of art took my breath away. This picture does not do this dish any form of justice. Each element was gingerly placed on the plate to create this masterpiece and there was intense flavor in every bite.

My Dad ordered a charctuterie plate. Shocker. Loved the colorful pickled vegetables and the pate served alongside it with more fresh baked bread! We asked for more bread to finish off the plate, and at first the waitress said they only make a certain amount of bread daily and that if everyone were to have more, Chef Parhizgar would have to bake for six hours a day. Seriously? Don't make me feel bad for asking for more bread. I want to respect the Chef as he spent four hours slaving over this impeccable bread, but, come on! I want more bread!!! I'm sure someone else didn't eat their fair share :) She did find us two more pieces so we were thrilled.

While stuffed, I was not leaving without trying a dessert. The trio dessert special sounded sensational. There was a chocolate lava cake, homemade cherry sorbet and a milkshake!

The night would have been perfect if our waitress was a bit more friendly. She had a bit of an attitude, which I could have done without, and her way of handling our ask for more bread was a turnoff. 

Other than her, I highly highly recommend indulging at Frank's Kitchen if you ever get to Toronto!"}
{"text":"41/2 yelp stars ;Hey  a gottabe ? Nyet!Not bistro not sophisto cuisine . Smallish slightly dried out oysters Rockefeller  undistinguished charcuterie usual farmed Elk drowned in wannabe reduction sauce OK marrow . Nazi -weird reservations policy- behavior ( ? This ain't Tom Keller's ) friendly bar staff.Wine list wanders toward decerebrate.Not inexpensive."}
{"text":"Prior to eating at Frank's, I had enjoyed an expensive tasting menu only once before. To celebrate a milestone birthday, I took my brother to Canoe and we both consumed their $100 tasting menu. It was delicious and perfectly executed, so the bar was pretty high.

Enter Frank's. My dining companion's birthday was the special occasion and we decided to go for the 22 course, $85 tasting menu. It now ranks as one of the best meals I've ever had.

We knew we were in for something special right from the get-go, as the meal kicked off with a fantastic appetizer consisting of a hummus-type spread and three delicious, completely fresh types of bread.

From there, the 22 course tasting feast ensued. I won't describe each course, but believe me when I say everything was amazing. (The only exception to this was the cheese course, which consisted of an old cheddar sprinkled with aged parmesan atop a sliced date. The cheese was fine, though it was completely overpowered by the date.)

The highlight for me was the Kobe course, which consisted of Kobe beef prepared two ways. It was pretty much the best beef I've ever eaten and the sauces that accompanied it were nothing short of mind-blowing.

The service was friendly and attentive, and our waiter was incredibly patient and willing to answer all of our questions. All in all, this was a fantastic meal that justified the hefty price tag."}
{"text":"I have to say that I was surprised with how good this restaurant was.  My friend and I were looking for a place to grab a quick bite and settled quickly on Frank's kitchen.

I had a caprese salad and a trio of pork and both were delicious.  They were also reasonably priced.  On top of that, we got a couple extras from the chef including a shot of dill gaspacho.  

My only quip with this place was the service.  It was friendly but a little slow at times.  Other than that, the dining experience was fantastic."}
{"text":"Celebrated my 24th birthday here with a fabulous Sunday dinner. Excellent service. Excellent food. 

Started with oysters Rockefeller with bacon and spinach. They make fresh bread from scratch, as well as all menu items. Everything was prepared to our liking and included great bite sized plates in between our meals.  

I enjoyed a 12 oz strip loin steak cooked medium-rare and served with Parmesan frites.  

Overall the experience was great and very enjoyable."}
{"text":"What a find! The decor is beautiful, ambiance very welcoming, and the food could not be better. We went with a group of 5 and shared everything family style so we could sample more of the dishes. Other reviewers are right that the amuse bouche, currently a beet soup with a bit of goat cheese and herbs, is fantastic. Right out of the garden. We didn't have a single thing we didn't think was excellent, and I'm pretty sure there wasn't a bit left on a single plate. 

Service was equally good, with great attention and recommendations from our server, and attentive service from the co-owner and front-of-the-house manager, Shawn. 

There's no question about the commitment to great quality, fresh and high quality ingredients, and a real desire to please their customers.  A must visit in Toronto!"}
{"text":"Great food and service! Will definitely be back to try some of the other menu items. Although I look forward to getting the flourless chocolate dessert again!!

Frank has a great talent for cooking, baking and making pottery!"}
{"text":"Best dining experience I have had in Toronto in last few years. Cozy ambiance, kind and knowledgeable servers, and absolutely delicious food. I am gluten-intolerant and had to skip the in house fresh baked bread, but it smelled divine and was quickly gobbled up by my dinner dates. My husband and I shared the catch of the day - seared black cod, and the beef sirloin with parmesan frites as entrees and both were exquisite. The complimentary salted dark chocolate truffles at the end of our meal were also perfect - not too rich or sweet, and a very nice touch! Will definitely recommend to friends, and hope to return soon."}
{"text":"To die for! The food here is so amazing that I cannot put it into words. I'm definitely a foodie and have been to countless restaurants in Toronto, and this is among my all time favourites."}
{"text":"I have to admit, Frank's Kitchen deserves all they credit they're getting on here. I had dinner ast night and it was very enjoyable experience. 

First off, they had a really nice wine selection. I tried the below reds. I would choose the second one listed over the other:

2012 Carmenere 'Reserva', Falernia Elqui Valley, Chile 
2012 Syrah, Pinot Noir, Merlot \"Red Twisted\", Flat Rock Cellars, Twenty Mile Bench, ON VQA 

We shared the following app (very good, very tender):

Grilled Octopus with Capers, Chickpeas and Cured Olives in a Blood Orange Vinaigrette,
topped with Squid Ink Chicharron 

I order the lamb and it was amazing. Prepared perfectly and just the right portion:

Herb-Crusted Ontario Rack of Lamb with Braised Lamb Shoulder Croquette in a Syrah
Reduction with Grilled Artichokes and Crispy Parmesan Polenta

My dinner companion had the catch of the day (which was the Arctic Char) which I was able to try, it was very good as well...

All in all; I would highly recommend Frank's to anyone. I will definitively go back to try to the rest of the menu..."}
{"text":"Fantastic experience!  

Begin your evening with Champagne.

Enjoy the comfortable environment with warm, professional service.

Satisfied your hunger with outstanding food: oysters fresh and delicious; escargot; mushroom soup; duck confirm with champagne & chanterelle risotto...

And save room for dessert!  The plum tatin was excellent.    

We'll be back again."}
{"text":"This restaurant has been always our first choice to celebrate special occasions. Attentive service, intimate setting and of course always great food. Never disappoints. Highly recommend this place"}
{"text":"Preface: I am an industry Professional and Lifetime member. I find myself uncomfortable and unable to relax at most restaurants because I am always en guarde (pardon my attempt at french)

upon entering Frank's Kitchen without a reservation I was greeting immediately by the owner, \"table for two please, got room?\" I was ushered to a kitchen-side table.
Our coats were checked at the table by the server, tap water with cucumber was offered and received with no talk of bottled this or that. a few moments later \"May I interest you in a cocktail or glass of wine?\" I was browsing the bottle list and let our server know \"we'll start you with some bread then\". I when I thought I had chosen I asked for a taste, chose a different bottle, SUD Primitivo Di Manduria for $60.

The wine arrived and was presented properly and tastefully. we were told about a special and chose our single shared appetizer and separate Mains.

They Split the appetizer for us and it was a beautiful minage of light flavours with a gorgonzola undertone. 

the Mains came up as my dining partner went to the ladies, so Kalashes (spelling?) were supplied and applied to keep the food warm, when she returned our food was immediately freed and explained, and answers were given to our questions. 

The mains were expertly cooked. divinely plated and voraciously eaten.

after a polite mourning period a sweet desert course was verbally offered. we asked for a cheese board and were supplied with a colourful and diverse selection along with a dark chocolate desert. The cheeses were magnificent and the desert thought stopping.

I ordered a half glass to finish my desert with, I got a Montelpulciano/Sangeovese Blend.

This was the Best Dinner I've yet had in my life.

 I will return as soon as I am able."}
{"text":"Great news! Frank's Kitchen is reopening soon as FK at 770 St. Clair Ave. West at Arlington.

I just had the immense pleasure of attending a soft opening at FK for family and friends this weekend at their new location on St, Clair. WOW!

The decor is absolutely stunning, modern eclectic and heartwarming - the perfect venue owned and managed by the dynamic couple Shawn Cooper and Chef Frank Parhizgar. The food was devine as always, service was impeccable, with an impressive wine list to match.

This will be the first of many incredulous meals. Can wait to bring all my friends back to the new FK!"}
{"text":"Came here with the manfriend and his parents for a casual but refined night, and it was absolutely lovely. Cozy atmosphere, kind servers and delicious food.

Homemade chestnut pasta, seafood platter, salad and more - every dish we ordered was delicious, thoughtfully executed and worth savouring each bite. I love that the quality of food and service wasn't eclipsed by any sort of attitude or pomp.

Would absolutely come back again soon."}
{"text":"The food was excellent.  The escargot had a light sauce n was cooked well.  The short ribs were tender n the coleslaw that accompanied it was very refreshing.   The only reason that it got 4 was because the food took awhile to come n the waiter can be a little bit more friendly."}
{"text":"I don't understand why people like this place so much. Our friends (who are super picky like us) recommended if and were very excited to take us there. The decor is super outdated and borderline cheesy. I only state that because for the price of the food I expect better. The wait service was terrible. It took 15 mins for someone to address us after we were seated and it wasn't very busy. I had problems choosing items off the menu and what I do choose was underwhelming to say the least. I had the soup which lacked flavour and the steak which was just average. I wouldn't go back or recommend this place to any of my friends. Definitely not at all close to the talk."}
{"text":"Frank's is a classic restaurant. Too classic, in fact. The dishes and plating are trapped it the 80s along with the decor and service style. The food was just OK and really lacked any 'wow' factor. Nothing was bad but nothing was innovative. I think a drastic makeover is needed here. ASAP."}
{"text":"Excellent from start to finish!

Made two visits to Frank's Kitchen. Both were fantastic.

Visit #1 - Had the Rack of Lamb. Has to be #1 on my list for best lamb dishes.

Visit #2 - Did the Chef's Tasting. AMAZING. Every dish was so thoughtful and detailed in both taste and presentation. It's definitely a little pricey, but worth the price for a very special meal."}
{"text":"great atmosphere, wonderful food, the chantrell e salad with the hazelnut was just a perfect combination and the duck was to die for!!  seating a bit on the cozy side for five people, but food was amazing!!"}
{"text":"Frank's Kitchen has always been one of my favorite restaurants in Toronto. I first went here since they were newly opened and have been re-visiting since then because of how delicious the food here are. One my second latest visit, I was lucky to finally get to try Frank's infamous 16 courses tasting menu and I must tell you that I was totally blown away. All the courses came out at a perfect pace and everything was amazing. I ordered it with wine pairings and it was definitely worth every dollar spent. 

On my latest visit there, I opted for the a la carte menu. I ordered the deep fried gnocchi in gorgonzola cream sauce. I was intrigued by the name and was curious as to how this would taste like. It turned out amazing and I was thankful that I ordered it. For the mains, I opted for the scallop bourguignon and Aged beef striploin with truffles. The scallops were cooked to perfection, but the beef was not cooked right. I ordered medium rare but it came out a little overcooked. Furthermore, I found the meat to have a very weird texture instead, it could because the knife wasn't sharp enough and caused the meat to fall apart inside. But it felt it was also pretty dry inside and a little off. Nevertheless, the meal was amazing overall and I would definitely come back for another visit and give this place another chance!"}
{"text":"If you are looking for great ambiance, wonderful service and fabulous food, look no further.  

We were at Frank's Kitchen last Friday night with a couple of friends and we all loved it!  The hot and cold amuse bouches, sorbets and truffles at the end were such a pleasant and delicious surprise!  The mini brioche and homemade breads served with an amazing green-olive tapenade were so good we asked for a second serving.  

For appetizers, my bf and I shared the seared foie gras with quail confit and the seafood cocktail  with shrimp, lobster and crab.  The presentation was beautiful and the taste was even better.  

For the mains, my girlfriend and I shared the lobster and the lamb (prepared three ways).  The lamp chops and lobster were cooked perfectly and the portions were reasonable.  My bf had the fish special (I think it was halibut) but the portion size was quite small and was probably the least impressive dish we had that night (although it was highly promoted by our waiter who otherwise did not steer us wrong).  

Frank's Kitchen did a great job making our evening very special.   It is a foodie's delight.  We will be coming back for sure!"}
{"text":"We came here as a party of 3 ladies, 2 gents.  As a main, the ladies ordered the steak and the gents the seafood sampler.  Granted, the steak was good.  But the seafood sampler was so dainty that it could hardly pass as an appetizer.  The Ladies had to share their meals with the gents out of pity.  

But that would have been forgiven if it weren't for one fact: the waitress - who was easy on the eyes - was not so easy on the ears.  From the minute we sat down, she came back every 20 minutes to remind us that our table has a time limit which expires at 9 for a second sitting.

So embarrassing.

Follow-up: Thank you Frank's restaurant for the follow up below.  I don't have a problem with the policy of a 2 hour time limit on a table, but I do have a problem with the attitude with which it was enforced.  You are insinuating that we were late to arrive, or slow to order, but that was not the case.  There was no real reason to keep mentioning the time limit again and again.  Even if there was, one single gentle courtesy reminder would have sufficed.  As for the seafood sampler, if it's not meant as a main, then it should be made very clear to the diners, but it wasn't, which explains why two diners made the mistake of ordering it as a main."}
{"text":"My wife took me for dinner which I enjoyed very much . Not quite 5 stars but gave it 4 . Service excellent food very good a few problems with certain dishes scallops large plump but could be more exciting.. steak was good not great but they drowned it in sauce ... the oysters Rockefeller were nice but a bit cool should of been hot out of the oven . The goat cheese salad was excellent and the beet soup was excellent as was the chocolate tort.. wine and drinks great overall 4 stars will go back to see if can make it 5 stars ..."}
{"text":"I had dinner here twice. The first time it was quite good, though I can't recall what I ate. The second visit however, was pretty terrible. I had the tuna tartare and the lobster special. Both were under-seasoned and utterly bland. Lobster was under cooked in a tasteless (saffron?) creamy bisque.  Could barely eat it. Service was fine, if not slightly overbearing. HUGE disappointment."}
{"text":"Great restaurant! Enjoyed our food thoroughly. Must-try's are crispy gnocchi with gorgonzola cream, and elk loin wrapped in foie gras and truffles. Their pink grapefruit fizz cocktail was also delicious. There's a green P parking north west of the restaurant."}
{"text":"I was very disappointed with this restaurant, mostly as a result of lousy service.  The first problem is they apparently reserve each table for the full night.  So, despite a table being booked for 8pm, they refuse to allow earlier reservations.  It took a lot of convincing to get a 6pm reservation with the promise we would leave by 8pm sharp.  The next problem is they don't open until 6pm on weeknights.  When we arrived at 5:50pm, there was another couple waiting who knocked on the door.  The hostess came out and rudely stated they didn't open at six, and she would not let us in from the cold weather because they were having a staff meeting.  A more courteous response would be to have allowed the five people waiting to wait in the inside vestibule until 6pm.  Essentially this restaurant has all of the pretentiousness of a fine French restaurant, without that quality of food.

While the food was fairly good, it was far from outstanding. The amuse bouches we got were mediocre.  The tuna tartare was excellent, but the accompanying crackers were too salty.  The lobster was good, but again far from outstanding - it was fairly bland.

Overall, I will certainly not coming back to this restaurant as the service (or at least these bad experiences) has permanently coloured my opinion."}
{"text":"Frank's Kitchen? When my Yelp friend suggested that we go there, I have no clue where I am going and what to expect.. but I am always IN! 

I didn't realize how popular this restaurant is and reservations seems to be necessary.. when we walked in and the hostess told us that they were fully booked and I just giving her that sad looking eyes.. she was nice enough to get us a table...even I dressed like a casual yogi.. +1 star! 

Love all the small touch and attention to little details all through our meals. Our waiter was informative, attentive and all the energy! 

My waiter giving me the thumb up with my selection of: 

Elk Loin wrapped in Foie Gras and Truffles with Heirloom Beets in a Chestnut & Foie Gras Jus ($34) 
- I was looking for my foie gras and the waitress pointed out it was the little quarter size piece hiding somewhere under the ravioli :) 
- Elk was light and lean.. cooked medium rare.. as the waiter suggested was quite tender.. 
- The whole presentation reminds me of French Country Style cooking which the freshest ingredients would be used 

White Peach Tarte Tatin ($8) 
- So buttery and rich... for some might be heaven.. for me all I think of is the calories count... reminds me of eating a Super sized Danish cookies 

Even we only order a main but we were served the hot and cold amuse bouches, palate-cleansing sorbets and gloriously creamy truffles at the end. +1 star! And all house made!!!

I really enjoyed my dining experience at Frank's Kitchen and I think its concept of sourcing their ingredients locally is wonderful and everything was prepared in house... and a reasonable price?! Awesome!"}
{"text":"Solid, tasty, great presentation, and really good waiters.   Our dinner for 5 adults came with some cocktails and a bottle of wine (around $110) came to $580 including generous tip.  The wine list was limited although price and quality were excellent.  We stayed there for awhile for our business dinner, and we felt perfectly paced and attended. 

And food was good overall - but raw oysters were fresh but not as great as expected -,and the condiments I felt could be more fresh or tasty.  Vinegar for example tasted old - if there's such thing.   Appetizers were excellent.  Then the main -I had the signature pork dish - with three types of pork - two out of three pork tasted great, but the main pork loins were average at best - nothing special.  

The dessert was also underwhelming - I guess I expected something little more splash to end dinner.   And after a great selection of homemade bread to start, and the dessert ended with less umph, I left thinking it's not 5 stars even thought I desperately wanted to give him."}
{"text":"As always, Frank's was an amazing taste adventure!  Well balanced appetizers and main courses never leave you feeling Harvey and bloated at the end of a delicious meal .  All the while having a delicious dessert available to fill that last little morale of hunger!   It is always a pleasure and looking forward to the next taste adventure."}
{"text":"Came here for a birthday. Unbelievable. The service is phenomenal and our waiter answered all of our questions and even offered to take pictures for us. The steak was the best steak I have ever had, and my partner had the riblets or pork I believe which wS also to die for. A must for anyone who wants flavour and good food."}
{"text":"The name of this place belows to the owner and exec chef. The name feels casual and almost lulls you into thinking that the food will be fairly pedestrian. But it's not. This place is packed and full of happy diners. protein and produce are sourced from local purveyors, Frank makes everything, his wife works the front of the house, they make fantastic bread, the owners and staff are passionate about this place. 

Started with an amuse bouche from the kitchen. Then a fantastic bread basket with various breads I can't remember for the life of me along with an olive tapenade. We even received a lovely sorbet palate cleanser between our starter and main.

Escargots Bourguignon with Oxtail and Machego Foam $18 - nice dish to share 

Provimi Veal Tenderloin, Kobe Beef Short Rib and Bone Marrow Arancini with Porcini Jus $32 - seasoning was very subtle to let the quality of the locally sourced meat shine though. the bone marrow arancini was pure genius and I would return just to eat that and the rack of lamb.

Herb Crusted Rack of Lamb in a Syrah Reduction with Rototouille and Grilled Artichokes $37 - the most tender lamb I've had in a long time. The portion was fairly large so I was very surprised at how tender the meat was. 

Service was top notch despite being quite busy - all class. Absolutely lives up to all the great reviews."}
{"text":"When people ask me what my favourite restaurant in Toronto is and without flinching I tell them Frank's Kitchen. I didn't know casual fine dining actually existed, the atmosphere of the restaurant is relaxed but still classy. I've seen customers dine in shorts, suits, sandals, etc.
The service is outstanding, the servers are very knowledgeable, friendly and a tentative.
 
We started off with the daily complimentary amuse bouche, tomato bisque with a side of housemade focaccia &amp; dip. The bread was lightly toasted, I enjoyed the small portion of starters so you don't actually fill up on bread before your meal.

The daily appetizer special was the Deep Fried Squash Blossoms stuffed with Homemade Goat Cheese &amp; Spinach. It was my first time having squash blossoms and they were delicious! Light and crispy with a creamy sweet and savoury filling. I would definitely order this again but it's hard to find squash blossoms on menus because it's such a seasonal item.

I also got the Kobe Beef Tartare with Fried Egg, Shaved Black truffles, Pickles and Guiness Mustard, $21. Look how beautiful the plating is. The truffles paired very well with the beef giving it an earthy element to the dish.  The pickled vegetables cut through the fattiness of the beef, I could eat this over and over again. The dish was also served with truffle brioche

The main courses were outstanding.
Catch of the Day: Salmon with lobster sauce, $26 &amp; 12 oz Aged Beef Striploin with Shaved Truffles in a Shallot Jus with a side of Parmesan Frites, $40. The steak was perfectly cooked, the jus was flavourful without being too salty. It was everything anyone could want when ordering steak frites. The salmon had an asian style flavour, my boyfriend really enjoyed the dish."}
{"text":"I've read many positive reviews on Frank's Kitchen, so I decided to come here for dinner one night. It was pretty difficult to get a reservation to this place, and you usually need to book more than a week ahead (probably 2-3 weeks ahead if it's for the weekend). 

The bread and amuse-bouche were nice, but not extraordinary in my opinion. The first pasta we had was the lobster ravioli in a basil, olive oil, and fresh tomato broth. There were generous chunks of sweet and delicious lobster meat in every pasta pocket. The tomato broth was light and delicate, which really allowed the lobster to shine.

For myself, I chose the crisp gnocchi in a gorgonzola cream with pancetta. I usually find gnocchi to be rather heavy, but in this case, I enjoyed chewing the potato dumpling and their crispy, pan-fried exterior. I'm usually not a fan of gorgonzola cheese, but in this case the sauce wasn't overwhelming. 

For dessert, the black plum tarte tatin was quite nice, though I wasn't a fan of the Chai latte ice cream. Complimentary chocolate truffles ended the meal nicely.

Overall, service was very good, and the food was also pretty good. That said, nothing really wowed me, and I've had better meals elsewhere for similar prices."}
{"text":"Great restaurant start to finish
It all started when the hostess went above and beyond her call of duty to accommodate us without a reservation and really helped put a start to a great night

The waiter explained that everything in the restaurant was cooked from scratch, which was extra points right there

First the waiter brought out home made bread (with fig, brioche and baguette) which were all warm, flavorful and delicious, and this was followed by am Amuse Bouche which was a gazpacho type of shot with a small spoon of fruit and other goodness

For my entree I got the Aged beef striploin with shaved truffles in a shallot jus and Parmesan fries.
The steak was large, cooked to perfection and the jus was flavorful and light

Lastly, for the quality of food that is served, the price point is not expensive at all

Overall a great experience, great for a date or for a great dinner with friends!"}
