{"text":"Disappointing. Dry and tasteless barbequed beef, BBQ beans from a can, better cole slaw available at the supermarket. Slow service for take-out, and they forgot the BBQ sauce. Eat some tuna from your pantry instead."}
{"text":"Starved and crazed one afternoon, a co-worker and I set out for lunch and decided to head over to Subway for a sandwich.  Instead, armed with pure greed in my belly, I looked up at the sign for Frankie Boys and said \"What's that?\" and it turned out to be the answer to my gluttonous prayers.

The place was fairly new and the owners are super sweet.  I ordered the half slab of ribs and I couldn't have been happier.  The ribs are fall off the bone tender and the fries are tasty.  I've only gone during lunch but each time it has never been crowded and the food comes out fast which is perfect for a one hour lunch.  The \"egg rolls\" might have to move to the top soon as one of my favorites.  Bonus is that the participate in the Ballantyne corporate card discount so that knocks a few bucks off the price."}
{"text":"I'm giving Frankie Boys 4 stars for my first impression and first visit. I had the basic pork sandwich with the red sauce. The pork was moist and had a good smoke flavor. They don't blend the sauce with the pork which is the way it should be. The other reviews describe the ordering, drinks, etc. so I won't repeat all of that. I will return here to try the other menu items. A couple of friends that went with me had the The Frankie Boy signature sandwich. The said it was a gut-buster; implying that it was a lot of food. The flavor was really good too they said. So all in all we had a really positive experience, good food, etc. We going to add this to our list of lunch spots for our office."}
{"text":"Oh boy...   Very nice staff and owners.  BUT, this is not BBQ.    Not even close.   The pulled pork appears to be steamed, not smoked.  No bark whatsover. No fat, good quality pork, but missing that smoked all day-taste.  The sauce they offer is actually very good, and the menu items are very creative.  (bbq, mac and cheese,fried onions on Texas toast)  Friend had the BBQ spaghetti and loved it.  The food is good overall, but it's not what this region would consider true-BBQ.  In my opinion, the best taste test for BBQ is to try it without any sauce.  The sauce should compliment the meat, not carry it.  

I'm torn because the owners are very nice, they care about the product they put-out, and they obviously have a lot of pride in their business.  I guess my issue is with the authenticity of the BBQ...  Maybe I'll try the ribs next time.  Brunswick stew was very good!

That said, if you're not a BBQ snob like myself, you will enjoy it here.  Service is great, lots of choices, clean and neat.  I hope they stick-around."}
{"text":"Tasty bbq and delicious french fries!  Reasonably prices and a lot of food!"}
{"text":"After walking into the restaurant, I was greeted with a wonderful aroma of smoked pork products.  The decor was a little bit dark for my likings, but they have a nice mural and you can tell that the decor was thought thru. 
We decided to try a few different menu choices to get a good sampling.  The favorite side seemed to be the french fries (these fries had a great flavor to them, with a nice crunch on the outside).  Honestly, I thought that the mac-n-cheese was ok, but not great.  The pulled pork on the other hand was wonderful!  Nice smoky flavor and very juicy.  The ribs also were nicely done, and fall of the bone good! As far as the sauces are concerned... I wasn't super impressed with the red sauce, but the mustard based sauce was INCREDIBLE, it has just enough zip to wake up your mouth but wasnt overpowering."}
{"text":"My son suggested Frankie Boys this evening...
This restaurant is fairly new; opened in December 2011. It's located in Camfield Corners Shopping Center (near Bi-Lo).  It is a small, very casual spot, but the management has done a good job with the decor and squeezing out about as many seats as they possibly can.
You order at the counter and they bring it out to your table.  Every order is made individually, SO everything doesn't arrive exactly at the same time.  No big deal.. really.
I had the Ribless Plate (pulled pork) that comes with either a (rather unique) side of BBQ Spaghetti OR two other sides of your choice. The price of this plate (as of 2/18) is $6.95 which I thought was pretty good!  The spaghetti, you choose the meat topping... I thought it was okay.  It's basically pasta, with a tomato sauce, and meat on top.  Once you add seasoning... it starts to \"grow on you.\"  But I ordered an extra side of the Rum Baked Beans and they\"re excellent!  At that price, I thought the portion (pork) was very good.
My son had the Western Taco (pulled beef, cheese, onion straws, and their BBQ Red Sauce).  It was really good!  I think he inhaled it.
The \"word\" is that the ribs are very good, but I haven't tried them - that's next.  And, I will be back.  Okay, for the really picky BBQ types - this isn't Lexington BBQ.  But, for everyone else - it's good.  Well cooked, good taste, very nice portions and good prices.  As mentioned in other reviews... 3 sauces. I had the \"signature\" BBQ Red Sauce and thought it was good.  Neither of the 3 were hot, but not to worry... they had a big bottle of Hot Sauce right up on the counter!
Serve yourself beverages... so free refills.  Thanks!!
Plenty of parking in this strip shopping center.
It's nice to know that we have yet another solid option for BBQ close to home!"}
{"text":"Beats a lot of BBQ places!

Three good House made Sauces.  The Mustard sauce was one of the tastiest mustard sauces I have ever tasted - Fantastic!  The Vinegar and Tomato Based sauces were also good, though they may need some refinement.

The Pulled Pork Sandwich was EXCELLENT and with a gourmet bun that I should have asked them to slightly warm it for me!  This sandwich gets 4.25 yelp stars!

The Brunswick Stew was good!  Super FRESH!  Close to 4 yelp stars.

Babyback Ribs!  These are Thicker, MEATIER and Fattier than the super lean ones I like most.  Still these ribs are Tasty and better than the cheaper ones!

They have an OPEN Kitchen which I love!  The Owner works here and everyone was friendly and helpful!  I will probably go back and get a Burger and another Pulled Pork Sandwich!"}
{"text":"Nice staff, fast service, reasonably priced... so so  bbq. No flavor. But better than QShack"}
{"text":"Just finished our third lunch trip. Very good pork & beef BBQ. Only have tried the red sauce..it's good. If you want spice they have hot sauce to add to it. The chicken fingers are real pieces of chicken moist inside and crunchy outside. I do like their slaw. The Brunswick stew is on the sweet side  - daughter really liked it as well as the hubby."}
{"text":"I tried the sandwich meal with some friends, which included 1.5 pounds of BBQ with buns, 2 pint-sized sides (Brunswick stew and beans, we also got slaw). 

The BBQ was ok - it was pulled in larger chunks, had pretty good flavor, and reminded me a little of pulled pork at Q Shack.  The \"vinegar sauce\" (it wasn't a pure vinegar sauce - definitely had some tomato in it) was pretty good - probably the sauce I enjoyed the most.  The mustard sauce was good, I just wasn't used to eating it with my BBQ, and the tomato-based sauce was a little sweet for my liking.

The buns for the meat were pretty thick, almost taking away from the BBQ.  It was nice quality bread, but just too thick.

The Brunswick stew was not great - it was way too sweet and tasted kind of like ketchup.

The beans were pretty standard.  The slaw had too much relish, and wasn't very impressive.

The staff was very nice and accommodating.

Overall a pleasant experience, but nothing to absolutely rave about.  The BBQ was decent, but the sides were forgettable."}
{"text":"Frankie Boy's is the quite possibly the best BBQ I've ever had.  The Frankie Boy sandwich is awesome.  It's not your typical BBQ place.  Don't be afraid to try something different.  The service is fast and the owners are friendly.  I can not wait to come back."}
{"text":"A group of friends and I got the sandwich pack with sides of Brunswick stew and baked beans. The choice of sauces were red, gold, and vinegar. I liked vinegar best, and the other sauces were a bit odd IMO. 
The pulled pork was neither stringy nor dry, and was delicious with the vinegar sauce and generic coleslaw. However, the bread bun was thick and dry, I'd have preferred less bread. 
I wouldn't recommend the stew, it's cloyingly sweet. The staff was very nice and helpful, giving us samples of all the different sauces. 
One more thing - they didn't have hot sauce. Unthinkable!"}
