{"text":"In the past, I've had some mixed experiences here, but it seems like they have improved their menu and quality.  I had a house salad and the Königsberger Klopse (meatballs and spatzle with cream of mushroom sauce).  Both were excellent.  My wife had a salad and the vegetable soup, also great. And, as always, the beer selection was phenomenal.  I almost forgot to mention that the Gluhwein is wonderful on a cold winter evening."}
{"text":"Great addition to Monroe street. A long list of German beers on tap, with a nice mix of traditional and contemporary German food. The schweinebacken appetizer was phenomenal.  Service was friendly and attentive- our server made sure to explain the various dishes and beers."}
{"text":"Relatives took us to Freiberg Gastropub in Madison WI.  Parking is hard to find in the neighborhood, but it turns out that a local office has spaces after 6.  If you want really good German cuisine, definitely go to Frieberg.  We shared 2 appetizers, pork cheeks and the wurst platter.  The weiswurst is particularly good, but all 4 of us enjoyed both.  Each chose a different entree, and all four were very good.  Of the 4, the trout special(Friday night) was great--the fish covered the plate and the potato pancakes side dish was really tasty.  The pork shank had great crackling on the skin and was very flavorful.  The wait staff is knowledgeable on all the dishes and gave good advice on beer and wine pairings.  Service was professional and attentive.  The only reason this doesn't rate five stars, in my book, is the noise level.  With a full crowd it was hard to carry on a conversation.  If management could place some noise-absorbing wall hangings this would earn the next star."}
{"text":"Delicious food and fantastic selection of beers on tap. The service was excellent. I really enjoyed the vibe in this place, and it is family friendly-- open kitchen to show the kiddos how things are done and enough ambient noise that you aren't too concerned about their energy impacting other tables."}
{"text":"Only suggestion would be for the female restaurant/bar manager...not impressive to berate your staff in front of customers.  Obviously, busy times will get stressful but most patrons are patient enough to understand service may be a bit slower.  There is no need to yell at and degrade your staff in front of us!  Top 5 best restaurants in Madison.  The food is on point every time.  Reminds me of my grandma's sauerkraut...fabulous.  Beer options are never ending!"}
{"text":"Hard to do German poorly, but this isn't German done well either. Good beer on tap. The rest is meh."}
{"text":"My husband and I have been talking about going here for weeks. We love German food and beer. We used to frequent The Essen Haus but the last two times we were there it was not a good experience. This place has all the German staples and does them well!  You'll love the German potato salad if you are a fan of mustard. I had the schnitzel sandwich and it was great!  Spätzle didn't disappoint either. There's a HUGE beer menu with lots to sample. The place itself is attractive and CLEAN. We will definitely be back and recommend to others!"}
{"text":"I had the Koenigsberger Klopse which were excellent and authentic german but could have used some more caper sauce. The pretzel also is authentic, apparently comes from Clasen's. The bread,however, as others noted, is decidedly not even remotely german and desperately needs to be changed. Service was good, but it was mid afternoon and I was the only customer."}
{"text":"My wife and I are delighted with Freiburg.  Great food! Great service (thanks Ashleigh!). Amazing beer in the best atmosphere we've enjoyed in Madison for a good long time. Maybe ever. If you are vegetarian you can make a meal from the excellent sides, soups, and salads.  We'll be back for the fish fry for sure."}
{"text":"Always order weiner schnitzel when I go to a German restaurant - it's my favorite. Have lived in Germany so know good schnitzel.  What was put down in front of me was a piece of meat with GLOBS of red cabbage covering the whole piece.  I like red cabbage but wanted to taste the meat - not the cabbage juice on the meat.  The potatoes were cold and covered with GLOBS of onions.  When I said I preferred tasting the meat our waitress told me the restaurant was doing \"modern\" German food - whatever that means. The pretzels and mustard were very tasty along with the beer I ordered.  But my meal didn't look at all like the picture in the ad!!!!"}
{"text":"Went here last Friday for lunch with my fiancé. He picked it out to try their large German beer selection. The beer selection is great and if you love German beer this is the place to go. For the beer alone I would do a 5 star. The ambiance and decor were also great. All the bar tappers light up which is really neat!   I wasn't that hungry so we ordered the sausage plate to share. Neither of them thrilled me and fiancé thought they were ok. He is a sausage and mustard aficionado so I partly base this off his opinion. The lunch menu was interesting but I felt they should have had schnitzel. I would have ordered a schnitzel sandwich or smaller portioned dinner type entree if they had it. I peaked at the dinner menu and found schnitzel.   I would go back for dinner to try it again for sure. I wish I could do 3.5 stars but can't give them 4.   Worth trying out though as Madison doesn't have tons of German options. I'd recommend going for beer at minimum."}
{"text":"Word of caution: the review (and the stars) are entirely for my bar/beer experience at Freiburg. We discovered this place while wanting to grab a drink waiting for our table to get ready at Everly. I was kinda surprised that I had never noticed Freiburg before since I have visited Jacs Tap that is across the street from Freiburg several times.   Regardless - the vibe inside is very informal, warm and welcoming. The dining area felt pretty spacious but the bar where we were sitting is smaller and slightly cramped - it was a cold and windy spring evening so we declared it cozy. The bartender was super friendly and as the pictures show, we ordered flights and let her pick the beers (only requirement, one of them should be IPA). I also asked her to not tell me the type and names of beers because I wanted to judge them without any biases. Needless to see, beers were excellent and as you can see, they have an excellent selection. If you like beer, you won't be disappointed here. They also have a well stocked full bar.   After spending about 30 minutes, we were liking the place so much that we were thinking of blowing off our Everly reservation. However, one of the guys in our group is vegetarian and there ain't much for vegetarians at a German/Austrian place so off we went. However, I am due back here for dinner (and I will update my review after that)."}
{"text":"Went there for lunch expecting authentic German food and was very disappointed. The atmosphere is lovely, the food not so much. I had an open faced pork sandwich. The pork was very fatty. The sauerkraut and the gravy had little flavor. And my side of German potato salad was NOT German potato salad. It was some Americanized version similar to German potato salad. My mother and grandmother made splendid authentic German potato salad. Perhaps they set the bar too high. But I will not eat there again. If you love German food, go somewhere else."}
{"text":"A serious disappointment and one of the weirdest and worst dining experiences.  The waitstaff was welcoming and friendly, but the management was unprofessional, naive and bad for return patronage.  After waiting more than 45 minutes for our entrees, we were served two out of the three that we ordered.  After a bit, our server informed us of the delay in the third entree, and the house offered to buy us a beer.  After another period of waiting, the third entree, a trout dish, arrived and after a couple of bites, we realized that the fish was practically raw.  After informing the staff, the dish was sent back and the server returned to tell us that the fish and the beers were being comped.  So now we've been at the restaurant for over an hour, still without all of our entrees.  After waiting an additional TWENTY-FIVE minutes for the fish to be thoroughly cooked, we finally asked the staff to wrap everything up to go.  When we got the bill, we noticed that the fish was indeed comped, they had charged us for two beers and comped one.  Now rewind - we originally ordered one beer, they offered to buy us another beer, then said they would comp all of the beers and then comped the beer THAT WE NEVER ORDERED IN THE FIRST PLACE.  To top off the whole debacle, the manager reacted as if we were trying to weasel out of paying for our beers when I tried to clarify the situation.  And this is happening over an hour and forty minutes after we sat down for dinner.  Without actually being served all of our dinners.  And eating raw fish.  Oh, and not getting any silverware or napkins until we had to ask.  Oh, and while a baby, two tables over, got water dumped all over him by the host who was acting as a server.  Big, big thumbs down."}
{"text":"Overall experience was very good. We planned on coming in for a beer and a small bite to eat before restaurant hopping and ended up staying the whole night. The bartender Emily was the friendliest and most engaging bartender we have had in a long time. Food was great and many of the German beers are hard to find on draft in the city. We even got an impromptu lesson on German from the bartender!  We can't wait to return"}
{"text":"Food's ok...kind of bland. Nothing's been bad but nothing spectacular either. To be fair, German food isn't something that really speaks to me and I can't speak to the German beer as I'm not much of a beer drinker. Still, there are many better choices in Madison for food, including in that area. The times I've been there they've never been busy so it's a place you can be seated right away, which can be good if you're hungry but that probably doesn't bode so well for them. They also screwed us over on Restaurant Week. We didn't want dessert and the bartender told us we can order a la carte. So we ordered two of the apps and two of the entrees, thinking we were just forgoing the dessert portion that would have been included in the price which was fine with us. What he didn't tell us was that he was entering the orders individually so the portion sizes are the same, we'd just be charged double for the same thing. How he thought that's what we'd want to do is beyond my understanding but hey it was a lesson learned."}
{"text":"It's funny the wide variety of experiences that are reported when a restaurant first opens. Two different diners can simultaneously have delightful and disappointing experiences on the same night.   We thought the food at Freiburg was fantastic. I had the brat stickers, and Jaeger schnitzel,  and my wife had the meatball appetizer and the chicken. Our kid devoured his chicken fingers.   Great selection of German taps and wines. They brought samples of Kolsch by our table in tall .2 liter glasses just like they do the in beer gardens we visited in Cologne.  Really true to the concept,  give Freiburg a shot. It's not 'Heritage' or 'Le Toille', but it really brings German to this city with so many German connections."}
{"text":"Went on a Sunday. Food was very good, serving sizes more than ample. Great beer list. Server did a very good job of walking through the beer and food menu. Did the Sunday sauerbraten special. Tender and flavorful. Joint diners each had a schnitzel. Very tender, nice breading. Appetizer was a liverwurst pate...yum!!!"}
{"text":"I love this place! I've been at least a half a dozen times and have always had great food and great service. It's one of my favorite places to go for dinner or brunch!  My personal favorite is the Huhn. Though I've also enjoyed the Käsespätzle and the Sauerbraten."}
{"text":"If you are looking for tasty German food, this is the place.  Terrific German-themed food and great draft beer selection.  Wonderful on a cold winter night.  The service is terrific.  In addition to a great selection of wurst and meats, the salads, soups and desserts are top-notch. This was our fourth visit and we have been impressed each time. Just returned (6th time) for Die Forelle (trout) - marvelous!"}
{"text":"We were at Freiburg Gastropub on 9/27/2015 and everything was fabulous. I can say without any doubt that the wurst was the best I have had since 1982 when I was in Germany for REFORGER 82. We had a celebration at the end of the exercise and all of the food and refreshments were fantastic but my wurst sandwich on Sunday brought back the memories. I will be back in this case both places!"}
{"text":"Great beer!! But also great tasting cheap food. The musturd is imported from Germany and excellent."}
{"text":"Had a late dinner here shortly after the restaurant opened in July. As the grandson of German immigrants and a German history major who has traveled in that country and eaten a lot of German food, I really wanted to like this place; unfortunately, I did not. The interior is a cliche, like Der Rathskeller moved a couple miles to Monroe Street. The service was slow and uninformed, and the tables were a mess. German food is pretty tough to carry off in a restaurant serving urban American tastes, and this missed the mark. There were too many dishes using pretzels, and the menu was uninspired; coating trout in pretzel crumbs doesn't quite do it for me, and it just came off as awkward. I hope they can get their act together and breathe some creativity and inspiration into this place."}
{"text":"Pleasant staff and enthusiastic server who knew the menu.  We had the potato pancakes, wiener schnitzel and jaeger schnitzel.  The potato pancakes were more like a hash brown style than the heavier variety I have had at some German restaurants.  Very good.  The schnitzel dishes were good but I prefer my schnitzel made with veal rather than pork in terms of flavor so I found them a little bland.  If I lived in the area, I would return."}
{"text":"We enjoyed freshly prepared sandwiches (a reuben for my husband, which he said was excellent, and a vegetarian doner kebab for me--Turkish style grilled and fresh veggies rolled up in a warm Naan). Generous portions, accompanied by either green salad or grilled potato slices.  Plus an interesting draft beer, all in a pleasant cozy atmosphere with very nice service."}
{"text":"I had a good dining experience here. My Dad and I went for trivia night and it was my first time there. My Dad was visiting Madison from Germany, and having grown up there myself I was excited a new German restaurant opened in Madison.   The hostess was extremely friendly, she would seat guests and also make rounds and conversation with guests once seated. Our server was friendly as well, although it seemed he had little to no knowledge of Germany which I am sure is not a requirement for staff, although it would be nice.  We shared the potato pancake appetizer which was really good. The two dipping sauces, sour cream or apples allow you to eat them sweet and/or savory depending on your preference. I think they could have been prepared crispier.   I ordered the Doner and am thrilled they added that option to the menu because it is as much of a staple in Germany despite being Turkish, as Tikki Masala is in London. The Doner was excellent, although I am not a huge fan of Lamb meat and it does taste very \"Lamb-y\". I think blending it with another meat could improve the taste, then again if you are someone who loves lamb then you will really like it just the way it is.   I ordered a Radler to drink which was good.  A few recommendations I would make to the restaurant would be to include Gluhwein on their winter menu. Also, I noticed they spelled Wienerschnitzel \"Weinerschnitzel\" on their winter menu. Not a big deal, but if you want to be an authentic German restaurant the spelling should be correct. If you need a proof reader let me know, I'd be happy to."}
{"text":"A fabulous restaurant. A modern take on German cuisine, with a large selection of German beers. A place where you can bring your kids or your co-workers - I have been to many German restaurants in the US, and this one stands out. Highly recommended!"}
{"text":"Took our German friend who is from Düsseldorf area and he gives the restaurant 4 stars. Wide variety of German beers you do not normally get in US. He said the mustard and food is authentic and good variety of dishes from across Germany."}
{"text":"My wife and I just drove from Milwaukee to this restaurant. It was worth the drive. Some of the best German food I have ever had. The atmosphere was cozy and located in a nice urban area. My wife love's sauerbraten  but there was only one place she liked it and it closed. The sauerbraten was excellent and melted in your mouth. My schnitzel was large , thin and crispy-outstanding. The sides of spaetzel and red cabbage were good. Excellent beer menu. The prices were very reasonable for the quality and portion sizes. I wish this restaurant was in Milwaukee. Nice to see a newer German restaurant open."}
{"text":"Had a great meal here tonight.  The atmosphere is great, and has a nice cozy feel. The service was very friendly and attentive, and the place was hopping busy.  They have lots of German beers on tab, and a full bar.  The menu seemed well thought out with lots delicious looking options (we'll have to return to try other dishes!).   Wife had several sides (cucumber dill, German fried potatoes, and kohlrabi salad).  I shared my Wiener schnitzel entre, that came with German mashed potatoes and red cabbage salad.  It was all so good!  Also had a Rottler to drink, just like in Germany!  Great place, we'll definitely return!"}
{"text":"Updated:  It seems like you could cut the tension between the servers and the management with a knife! My advice is to treat your employees with kindness are care! While I enjoy the food, I think I'll be heading elsewhere when on Monroe Street.    The Kasespaetzel is well worth the visit! This is basically a German Mac and Cheese that reminds me of a great comfort food. The service was great, the hostess, Ali, was very knowledgable and helpful in identifying a vegetarian menu, and the atmosphere was a lot of fun. This is a great new spot in Madison, and I would highly recommend stopping by. Oh, and the complimentary soft pretzels and Düsseldorf mustard are the icing on the cake!"}
{"text":"Food was good.  If you have kids who are picky eaters, don't take them with.  Make it a date night.  The menu for kids was limited and the food not good from the childrens menu."}
{"text":"My Boyfriend and I stopped into Frieburg Gastropub for dinner last night. I'm taking a German culture class so as an outside of class assignment we were to experience something German-y. This was the perfect choice! There was a map of Germany with a few facts comparing the Frieburg region to Madison. I thought that was a neat touch, especially since I was partially there for the purpose of education.    We started with two beers, I had the I had a Weizen Bock by Schneider Aventinus, he had a hefeweizen by Hacker Pscorr. Both were very much enjoyed his a bit wheatier and light, mine was a lot richer, maltier and sweet.   For eats, I indulged in the ever so rich Konigsberger Klopse (beef meatballs) with spatzel and creamy mushroom gravy. He had pork weinershnitzle with red cabbage and heaven and earth potatoes (mashed potatoes and apples). We also got a side of the bubespatzle, these guys are pan fried potato dumplings, almost like a gnocchi french fry! It was all so, so good, my meatballs were the favorite. The weinershnitzle was ridiculously large, probably the size of his head.    Our server was knowledgeable and honest, and for the portions we could barely finish, the price wasn't too hefty either!"}
{"text":"The House Manager was so friendly and attentive. She takes pride in her job. The Bloody Mary was a little underwhelming, just needed a tad bit more flavor but the minute they asked us about it they brought out more seasonings and hot sauce for us to rectify it. The food was great!! The German potatoes are so tasty!! I had the pork schnitzel with egg sandwhich....oh my gosh it was so good!! And the bar was so impressive on looks, we had to take some pics!"}
{"text":"So good. I love the jaegerschnitzel but wish it would come with spaetzle, instead of potatoes, and sauerkraut, instead of braised cabbage. I tend to make one of the substitutions and live with the other but it's so good even as it comes.   Also the pre-meal pretzel is delicious (try the mustard in the crock on the table if your sinuses need some clearing).   Looking for an appetizer? The potato pancakes and bratstickets are both phenomenal and have unique twists to make them super memorable.   Any time I'm craving something hearty, this is the first place I suggest.   Oh--parking in the area does kind of suck. Just go up the side streets and you'll almost certainly find a spot to squeeze in to."}
{"text":"While in Madison we decided to look for a German restuarant and did a Yelp search.  The food was very very good.  We were so glad we found this place.  Thank you Yelp!"}
{"text":"Being huge supporters of our neighborhood restaurants we ate at Freiburg when it first opened.  We were overwhelmed by the portions and underwhelmed with the taste.  We gave it some time, actually a long time, and tried it again this week hoping they had gotten their sea legs.  But this time was even more disappointing.  Both varieties of wine we ordered tasted like bad box wine.   The wienerschnitzel was heavily fried and the spaetzle bland. Except for the lovely pot of excellent hot German mustard along with tasty bread the food at Freiburg is much like the tourist restaurants in Germany."}
{"text":"This is getting four stars for the food...as service was lacking...  We visited for brunch on a Sunday and we were one of two tables. We were quickly greeted and while the staff was super nice, we couldn't figure out why it took so long to get coffee, order, or get our meals. I'm not sure if they had just opened and had to brew coffee and start up the kitchen, but it took a very very long time to get everything.   Having said that, the food was quite good. I had the Benedict and it was not too heavy and quite flavorful...I unfortunately had to share it also since it seemed to be the most coveted menu item.   Worth a visit for the cute atmosphere, good food and friendly service but don't go if you're in a hurry...."}
{"text":"Great german food and beer.  Pretzels and mustard are great."}
{"text":"In full disclosure, I am NOT a big fan of beer nor do I eat meat. However, our visit to the Freiburg gastropub was an excellent experience. We took our mother in law who likes beer, likes meat, loves German food. She had a blast. We ordered a flight of beers to taste various German regional beers. I ordered the stuffed trout and my mother in law had the wurst sampler. What makes me give the gastropub 5 stars is that the service was superior. They have over 50 German style beers on tap. I think if you go, you'll have as good a time as we did."}
{"text":"It was.... fine.  I wish I could give this a higher rating but felt for what we paid, the experience could have been much better.  It's a beautiful space minus some kitschy touches (too much logo going on EVERYWHERE inside for what I was informed is not a chain after inquiring).  Service was unenthusiastic and seemed scripted/strained both at the bar and in the dining area.  Wine glass had an obvious lip stick mark on it that went unnoticed (not my husband's  shade).  We dropped around $85 for 2 people, minus tip, and could have gotten equally salty food and service at Taco Bell for $12."}
{"text":"Very well prepared food. Typical German fare. I had the wienerschnitzel. It was delicious."}
{"text":"Monroe Street needed a place like Freibrug Gastropub! It's got a great beer selection, friendly  staff and plenty of space. I've only been here for happy hour and can't speak to the dinner menu. I can recommend you get a big soft pretzel with your pint."}
{"text":"Went with a larger group (7 people, not sure if that was a large party for the restaurant) on a Tuesday night we made reservations and were sat promptly at 6:30pm. The meal started with pretzel bites, pretty hard to chew, but good. Around 15 minutes later our server took our drink order. This was the first time he had came to the table, no greeting or welcome, no description of the specials. Just asking for drink orders. Another 10 minutes later our drinks come. Delivered by another server. He walks away without saying anything. 15 minutes pass and we finally receive our drinks, at this point we decide that service is slow and we should put both the appetizer and entree orders in to save some time. Since most of the dishes are in German, we needed clarification on what was what. Unfortunately our server was completely clueless and had to go in the back to ask multiple times. We talked and enjoyed our beers. A server didn't once check back to see if we needed more drinks or pretzels. We had to wave our server over to get more beers. Only for a different server than the previous two to tell us they were out of that. The appetizers still hadn't arrived after 40 minutes, and we again, had to flag over a server to ask where they were. He said he'd \"Go find out\" and that \"he'd be right back\" that server never came back. And I had to get up and ask where our appetizers were! And asked for a manager to be sent to our table. Immediately after that our appetizers, and entrees came out together. No manager to be found. And some dishes were cold.   In short- I'm sure this is a great pub to sit at the bar and have a couple beers - try some new things. And maybe have an appetizer. But if you're going to go to dinner here - google the dishes in advance because the servers know nothing. And don't bring more than one or two friends along."}
{"text":"Food was not that warm. We had to send back a cold piece of meat. They did have a good drink selection. But still, the did didn't taste good. Overall I wouldn't go back."}
{"text":"Stopped back in for a German beer on tap because their selection is unprecedented.  The place seems cozy and welcoming.  I sat at the bar with my left arm (wife) and we were given an excellent rundown on the beer selection.  I went with a dunkelwiesen from Andechs and it was one of the best beers I have tasted in my 40 years of drinking beer. I guess those Monks brewing the stuff over in Germany really know what they are doing.  We really appreciated the bartenders knowledge in explaining the selections.  Had some apps that really hit the spot.  Definitely will be coming back for a full meal some night and plan on bringing my friend Vinnie.  What 'til he gets a taste of that dunkel - he'll be asking for a growler for the road!"}
{"text":"We tried Freiburg Gastropub for dinner last Tuesday night. I'd been wanting to try it mainly because the name Gastropub intrigued me. We arrived @6:15 and were seated immediately. Our waiter seemed friendly and knowledgeable. The ambiance was clean and modern. It was comfortable and bright.  Both the beer and the dinner menu were filled with German options. I found a dark German beer which I enjoyed. I've never really loved German food. What I've had has been OK, but not something I rush back for. This night I tried the Konigsberger Klopse which were meatballs with spatzle and mushroom gravy. It was delicious! The meatballs were tender and moist. I think the spatzel may have been fried after it was cooked which gave it just a slight crunch that I loved and the mushroom sauce was out of this world. I highly recommend this dish! My partner had the weinerschnitzel which I tried and it was also quite yummy! And the portions were great! We had to get a box for leftovers which is very rare for us.  In addition to our entrees we did try the Haus Made Bavarian Pretzels. It came with obatza which is a spreadable cheese which reminds me of the cheese at a supper-club salad bar. I liked the cheese, (though there wasn't much of it), I can't say I liked the pretzels. I found them gritty with almost a sandy texture. They also served pretzel rolls which were warm and tasty and I would just eat those next time.  I'm looking forward to returning to Freiburg Gastropub and trying more of their take on German food."}
{"text":"Freiburg has an interesting ambience, very nicely done Germanic decor. Several large tables are available for bigger parties.  I was there for brunch/lunch, their menu for that time of the day doesn't seem too specialized, as a German gastropub.   We tried the potato cakes, with lox and poached eggs, which was a horrible choice. The cakes are simply hashbrowns, no flavor what so ever, and they couldn't even poach an egg. They were fully cooked. The lox was chewy and disappointing. If I had only had this $12.50 dish, I would have given it 1/2 star.  However, their Apple pancakes with Bavarian cream was decent. It was moist, creamy and more so Germanic I suppose. The redeeming dish though, really was the stuffed kohlrabi with oyster mushrooms and barley. It was a very interesting and well done dish that had certain eastern European essences.   So in all, they have a lot of work to do. Change up their half-A menu and get serious about the German food that they are trying to provide."}
{"text":"I ordered the Schweinshaxen. The food amount made me feel guilty for committing the Gluttony of the 7 deadly sins, but the delicacy of the food made me unstoppable.  5 stars, burp :)"}
{"text":"THIS PLACE IS AWESOME!!!!! Why are newbs giving it 3.5 stars? Time to regulate:   -Stellar service -Very clean -Inviting bar with a delicious and diverse beer selection from all over Germany -Not tacky. Has a cozy german feel to it -Exceptionally well-paired german food  You've got to come here, try out the beers, have a brat or pretzel or schnitzel or what have you, and just vibe out to the cool ambience. Way worth it."}
{"text":"I love Madison, but I noticed that although there are a lot of people with German heritage many of the bars don't carry any or many German beers. This place has a monstrous amount of German beers and great happy our deals. I only ordered some red cabbage and spaetzle so I can't judge much on the food, but anyone looking to drink some high quality Munich brews should come hang out and enjoy the good prices"}
{"text":"We came into Freiburg at 9:00 pm and waited to be seated and no one greeted us at the door. We went up to the bar and no one asked us how they could help. I will say the food was very good, but service could definitely be better."}
{"text":"We discovered that they don't take Bucky Book coupons during Restaurant Week because they \"have such good deals for lunch.\" From 3 selections in each category, their deal was to choose a starter, an entree, and a dessert for $15. $15 is pricey for lunch, and when there are 2 of you eating and you share a glass of their least expensive wine, the bill came to over $40, which, with the tip, was an easy -- but sad -- $50 lunch. Ouch! Here's another ding. No vegetarian, foul, or fish choices . . . NONE. I don't eat red meat and their 3 entree choices were a hamburger, a gyro, and a pork something. I asked to replace the lamb in the gyro with additional vegs and they complied. Both my husband and I opted for the salad for the appetizer, which was good. I opted for the strudel and he for the black forest cake for dessert, also good. But not for $50. I would have easily done without a dessert choice but that wasn't an option on their limited menu. That's all they offered for lunch: pick one item from each of 3 categories, pay $15. $12 would have been a stretch but a little less painful."}
{"text":"Came here for dinner on a Sunday night. There were about 4 or 5 other tables sat down and two waiters working. Waiter brought us water and then forgot about us for over 20 minutes. With two waiters and only ~5 tables with people, I don't think it should be too difficult to check on your tables.  I can understand forgetting about a table on a busy night with overworked waiters, but this place wasn't busy at all and one of the waiters spent quite a bit of time talking to the bartender. What's worse is that after the first 10 minutes of waiting, one of the other waitresses noticed we weren't being helped came over to us, made some small talk, and told us that our waiter will be with us shortly. A little over 10 more minutes went by with no one coming up to us and at that point we just left.   I've never been forgotten about at a restaurant before so that was a new and unpleasant experience."}
{"text":"I was only cautiously optimistic walking into Freiburg for the first time, because my vote was for Jacs across the street instead.  But you have to try something new once in a while.  The first visit was several months ago, and my second was just a couple weeks ago.  The first meal I ate at Freiburg was terrible.  A Lamb Doner Kebab sounded really amazing, but the meat was so tough, I couldn't even eat most of it.  It was so overcooked, it was more difficult to chew than the worst beef jerky you've ever had.  My friend lucked out and ordered the Jägerschnitzel, which was quite good.  The second meal was far better.  Amazing, freshly-baked pretzely buns and lots of delicious mustard.  A fruity summer cocktail.  And Huhn that was perfectly cooked.  The Huhn is a plate featuring really delicious chicken, Spätzle and seasonal vegetables.  The chicken is a bit salty, which didn't bother me, but something you might want to consider before ordering.  The Cucumber Salad was also great.  The space is beautiful, and they spared no expense on building materials, with wood detail everywhere.  The layout is a little awkward, so don't be surprised if you get crammed into a corner somewhere.  The bar is large and has very brightly-lit tappers.  Plenty of alcohol and beer to choose from, both local and otherwise.  On my first visit, I tried some beer that was recommended for tasting similar to Spotted Cow, and it was very good.  So I'd say that things have improved quite a bit, and I'm feeling quite optimistic about this place.    Looking forward to visiting again."}
{"text":"My boyfriend and I just heard about this place and thought it sounded like a home run so we decided to come for Brunch.  $3 mimosas was our selling point, along with it being a German style restaurant and bar.        We had a lovely and attentive server, Amber.        We ordered our mimosas and they were GIANT and delicious. Such a good deal.  (They also had $3 screwdrivers and greyhounds as well as a bloody mary bar.) We both ordered the 3 layer omelet and I can not rave enough about how scrumptious it was. My only complaint is that I wish it were a little bit bigger of a portion.  The flavors were amazing and I couldn't shut up about it while I was eating it. I will come back here again just to have that dish.  The decor was great and inviting and everything was very clean. Can't wait to come back and try their beer and other German style entrees."}
{"text":"Great Oktoberfest beer. Had sauerbraten with red cabbage and dumplings. All was delicious. We had pretzels with cheese and mustard that was very good.  My husband had meatballs with spaetzel, he really like them. I tasted and had to agree it tasted very good.  Our server Randy was friendly, informative and attentive. First time there we will be back."}
{"text":"We had a wonderful dinner at Freiburg's today ... terrific selection of bier and German food.  Our server, Rachel, was awesome!  We'd return for sure!"}
{"text":"The food was good. Tables are very tight. Our waitress did not do a good job juggling the tables she had. We were a party of four. Seated first she took our drink orders and said she would be back for our food orders. It was maybe 10 minuets or more. Meanwhile she got two more tables of two. She took their drink orders and their food orders before ours. They had their food way before we were served.  We were not in a hurry but it is annoying to see this happening."}
{"text":"The spicy horseradish mustard is awesome, great beers, and get the Riesling chicken with asparagus and spaetzel!!!!! You won't regret it!!!! However over half the dishes at our table were not worthwhile."}
{"text":"Went there with some friends and found the place lacking. We have one guy in our group who loves all things German, even if they do not deserve it.  This place seems like that.  The food was heavy and if you just wanted an appetizer there were few options.  The beer list is great if you love German beer but if you want anything current or an IPA your options are very limited.  My biggest gripe though was how unbelievably slow the service was!  It was a full ten minutes from when we ordered our beers before we got them.  If the owner would just make sure that drinks got to the table faster, his revenue would be much higher.  I do not recommend this place."}
{"text":"My husband and I went to Freiburg Gastropub on Saturday night for date night.  I had been there to play trivia before and I thought he would like it.  I really like the spatzel and meatballs.  We got there around 5:15 p.m. and the restaurant/bar was about half full. I told them that we wanted seating for 2 and they said that they didn't have a table for 2 and did not want to give us a bigger table in case larger groups came in so we could sit at the counter.  I asked the hostess how long we would have to wait for a table and she didn't know.  So we sat at a little counter off of the kitchen. It was right next to the hallway entrance to the bathrooms.  As we ate, more couples came in and they were seated at table.  So basically, because we were there early, we had to sit at the counter.  I have never experienced this at a restaurant. Usually, they seat people at the counter after the tables are full. The service was fine and the food was good but this experience of seating has really put me off. And my husband was not impressed.  I don't know if I would go back which is a bummer because I liked playing trivia there."}
{"text":"Everything about this place was great!!  Cozy, warm environment, partly because of all the wood interior. Some family style tables and a fab bar.  Great potato cakes... AMAZING with the apples. Saturday pork loin special, at about $15, was phenomenal, stuffed with pickles, bacon, garlic and cheese.  The beer selection is huge, bigger than the menu. They do sampler flights too, which is great if you don't have experience with German beers. I had a dark lager which wasn't heavy and was very flavorful, at like $6.  We would definitely go back. Parking at the chiropractor clinic just down the road too, off the street."}
{"text":"Finally a good German restaurant in Madison! Considering that a large portion of Wisconsin residents have some German Heritage it was always surprising to me that we had no good German cuisine in Madison. Our waitress at Freiburg Gastropub was quite friendly and informative. When we told her that it was our first time to the restaurant she went over the whole menu with us. I ordered the jaeger schnitzel and my wife had a German pasta dish. The pasta dish was good but the jaeger schnitzel was exceptional! It came out perfectly fried, moist and with just the right amount for sauce and Mushrooms! Freiburg Gastropub has now been added to our list of favorite Madison restaurants!"}
{"text":"Love this place! Very authentic German feel. Huhn with spätzle and Brussels sprouts is delicious, and very filling! Try a classic German beer."}
{"text":"This review is not based on the food, as the lack of customer service drove me away before I could order food.  I sat down at the bar, after a lesson with Madison Log Rolling across the street (awesome experience!), at approximately 7:10 P.M. on a Thursday.  There were four or five other guests at the bar, and the restaurant was about 1/3 full.  I looked at the menu for about a minute or two, then set it down and looked up.  What I saw when I looked up were two bartenders (maybe one bartender and one server) who were chatting it up.  They both sorta looked my way, without actual eye contact, and then went about their business of chatting, placing a glass in the dishwasher, straightening up menus a the cash register.  \"Okay,\" I thought to myself, \"I'll wait a bit longer and then one of them will make eye contact and then I can indicate I'm ready to order.\"  Nope.  No eye contact, in fact, it appeared they tried to avoid turning in my direction.  No, I was not sitting in a corner at the back end of the bar, I was sitting in the open at the front of the restaurant.  At this point, I was hungry and pissed, so I walked out.  I was not going to spend my hard-earned money on bartender/servers who don't know how to take care of customers.  I headed back to the capital and spent my money there."}
{"text":"One of our favorite places. The selection of German beer on tap is the best in the area, as is the Wiener Schnitzel!! I'm not a red cabbage fan, but if it was prepared this way everywhere, I would be..."}
{"text":"Had a great diner at the bar here. As a solo diner, I felt totally welcome and not rushed The bartender was friendly and fun. He made great beer and wine suggestions that exactly fit my preferences. I had a robust, buttery, dry Riesling that was very good. My entree came with complimentary pretzels and mustard. The sauerbraten was fantastic. The most tender meet and not overly tart. I would go back for it again!"}
{"text":"Freiburg Gastropub is phenomenally amazing German food... provided you've never actually eaten any German food.  But other reviews here rave about the authentic tastes... if that's true, it makes me want to cry a little bit.  I was so excited when I heard about its opening. My partner is a huge fan of Germany. She even lived in Freiburg!  Our trip had all the makings of a warm fuzzy European reunion.    The decor is great!  Beautiful photos of Freiburg on the walls.  4-5 Stars! The place was clean (also brand new, so I'd hope so).    You can't go to a German restaurant and not order beer!  My partner ordered some powerful sounding beer: KrackenHoldenWeisenFurter (or something like that) - and let's face it - all German beers sound incredible.  \"Will it come in a stein,\" I asked ignorantly.  \"No it comes in an enormous glass!  You can use both hands to hold it.  Wow!  Exciting!  And then the beer arrived. Um...  The waitperson sets down a tiny, little glass.  A tiny baby bunny of a glass.  More like a glass-ette. Bigger than a shot-glass, but falling far short of the expectation. Maybe a juice glass?   Oh-well, it's just beer.  It's not like Wisconsin people care much for beer, right?  Onward to the food!  I ordered the Doner Kabob!  I grinned evilly. \"What's with the smile?\" She asked.  \"I'm gonna eat one of Santa's reindeer!\" I cackled.  *eyeroll* Turns out, it wasn't Santa's lead reindeer on a stick.  It was, in theory, a German version of a Greek Gyro but with beef instead of lamb.    it arrived quickly and I dove in.  The pita was soft, warm, as you'd guess.  The cucumber sauce and the cabbage were exactly what I'd expect from a Greek restaurant - but where's the beef?  I opened the pita and dug down past the cabbage, past the onion.  There at the very bottom was a tiny ... brown ... lump-like thing.  A dollop of brown Play-do?  A piece of beef?  Maaaaybe...  It tasted like beef.    My partner's wurst platter was not the worst.  Not the best.  Middle-of-the-road.   You won't starve at Freiburg, but you might leave hungry. Maybe the management is going for a 1918's German famine sort of theme.  Fortunately, there are plenty of other restaurants within close walking distance.  You can go to Frieburg Gastropub, say you've been there, and then grab some food somewhere else.  If Yelp let me use 1/2 stars, I might give it 2.5.  It really wasn't terrible.  It just didn't live up to the hype, and perhaps it's my fault for dreaming it'd be so much more."}
{"text":"Overall a great restaurant. We cannot wait to go back and try more dishes!  Great ambiance. Our party of 8 fit well at one of their normal tables. Service was great. Our server (Barb?) was knowledgeable about the menu and had some great suggestions for us.   Food was high-quality and excellent, though the maultaschen had a very (too?) rich flavor. Huhn (chicken) and wiener schnitzel were excellent. Great beer selection."}
{"text":"I have to start by saying how much I WANT to love this place. However, we went at 8:45 for drinks and apps and we were met with almost a resistance to seat us. The staff was stacking chairs on the tables and eating throughout the restaurant as if it were after hours and it doesn't close till 10! I haven't tried the food yet, but have to admit to not being all that excited to go back with that service... :("}
{"text":"Excellent addition to the Monroe Street area. Parking as always around there stinks but totally worth the hassle to check out this place. The space itself is very cool and unique. It honors the old German beer hall feel with an updated twist. Be sure to look at the ceiling-it's very cool.   Service was friendly and prompt. They have an extensive beer selection and true to theme, most everything is German or Austrian. The tap list is enormous and they do have some bottled choices as well.   Fairly wide variety of food choices while also somehow staying true to the German/Austrian theme. They provide a complimentary basket of doughy pretzels and bread. I didn't notice the awesome looking jar of mustard at our table til it was too late but my guess is it would have been great for dipping the pretzels in.   I had the Wiener Schnitzel and it did not disappoint. Fried to a perfect golden brown without being greasy. Pork was juicy and flavorful. It came with some really yummy sweet and sour cabbage (which I really enjoyed despite not being a huge cabbage fan) as well as mashed potatoes topped with bacon and grilled onions. Mmmmm.   My dining companion had the Tuesday night special-the Arctic char. He throughly enjoyed it and he can be one tough critic."}
{"text":"Consistency is an issue here. We've had some very good meals here, and some just average. That said, I love having a German restaurant in town. The schnitzels and cabbage are delicious. And the pretzel rolls are an amazing start to the meal. They also have a great German beer list."}
{"text":"I was pretty excited to hear that there was a gastropub opening on Monroe! It's such a cute area that could use a bit more imaginative, creative food (not that I don't love Pizza Brutta, Gates & Brovi, Brasserie V, Jac's, etc).  This is not that place. Don't get me wrong, it was perfectly okay. The menu contains what looks like fairly standard German fare. The soups sounded intriguing, but I ended up getting the jagerschnitzel (pounded pork chop with spaetzle and cabbage). It was fine, if I was craving some sort of German meal, but the spatzele I've had at Heritage positively blew this out of the water. I did like the mushrooms on top. My friends both got the chicken, which the waiter, Sam, raved about. According to them, it was cold, and the flavor was just all right.  Other than that unhappy recommendation, the service was very pleasant and Sam was helpful with the beer selections for the guys! They have a pretty extensive menu of what seems like a good variety of mildly unpronounceable German beers on tap (~30?). Since I'm not a huge fan of beer in general, I can't speak to it, but my friends said that they would come back for the beer if they were in the area, but not for the food.   TL;DR: maybe this place hasn't hit its groove just yet, but so far, just get the beer."}
{"text":"It was a Friday night around 5:45pm and already very busy.  We were luckily seated right away as its difficult to wait with a 3 year old.  The beer list is good, and the menu is what you'd expect.  We started w the potato pancake which I thought was too thick and heavy.  I like them thinner and crispier but it was OK.  We ordered our daughters chicken fingers with the appetizer so she could begin eating.  Our entree order was placed at the same time as the appetizer but came out well after our daughter had finished and we were questioning whether our server forgot to put the order in.  Finally when they showed up, both schnitzels respectively, they were good.  The wait was excessive....but I'd probably come back in the winter when I was in the mood for a nice German meal."}
{"text":"The first time I've had schweinhaxen was in a Hong Kong cafe in the San Gabriel valley. They called it a German style pork knuckle and it was beautiful with crackled pork skin, tender meat and melty tendons.   Since returning to Madison, I've been on the hunt for as amazing a schweinhaxen as I had in LA. After all, we're in Wisconsin where German culture abounds. But schweinhaxen wasn't that easy to find. It wasn't on many menus except for the Essen Haus, which was okay but falls flat compared to what a Hong Kong cafe dished up. When I saw a picture of the schweinhaxen in this week's Isthmus for Freiburg Gastropub, I had to visit and try it out. And well, I'm still thinking about the Hong Kong cafe version. Frieburg's schweinhaxen was tasty and better than the Essen Haus version, but it still didn't have that beautiful crackled pork skin.  We also ordered the Huhn - roast chicken with spaetzle. I've never been a fan of spaetzle, or any little mounds of dough cooked in water for that matter. Never understood the appeal of gnocchi, or the Korean spicy rice cake Ddeokbokki. It seems like what others love about these dishes is the texture of the dough - \"soft and pillowy\" they say. Okay.   But tonight, Freiburg changed my mind. Their version of spaetzle was delicious. Buttery and well, \"soft and pillowy\". I was a fan. I also really enjoyed their potato and apple mash. You couldn't quite taste the apple, but it lightened up the mashed potatoes, and gave it a subtle sweetness.   I would come back, but I'm not in love."}
{"text":"We found Freiburg Gastropub on Yelp while visiting from Chicago and stopped in for lunch on a beautiful Saturday afternoon.  First, the restaurant has just opened so we weren't put off at all by some service glitches because everything turned out right in the end and we appreciate the difficulty of getting a new restaurant up and running. On the other hand, the bartender was friendly and very competently described each of the German beers on tap. She even offered a few small samples which I kindly repaid with a full-size Spaten and then a wonderful flight of three beers.  Now, the food. It ranged from good to really good but, in general I'd say three out of four stars.  We started with the potato pancakes and Koenigsberger Klops (meatballs). The pancakes could've been a bit crisper but they were delightful and most filling. They were accompanied by a delightful sour cream and a flavorful topping of something that resembled apple pie filling but, don't get me wrong, was pretty good and a perfect accompaniment.  The caper sauce on the meatballs was nice but rather bland. This may not have been a bad thing, though, because it let the magnificent flavor of the meatballs shine.  Did I mention the flavor and texture of the meatballs was superb?   Another appetizer we tried were the 'Bratstickers'; pot stickers filled with a traditional bratwurst filling. Interesting. I guess they could've use a bit more filling to plump them up but they're served with a perfect mustard and a small garnish of pickled onions or radish which was terrific, too. Don't miss it.  We added to this the cucumber/dill/sour cream salad which did not disappoint. It brought back memories of family picnics in Kenosha when the same dish was served in large ceramic bowls after good-hearted German grandmas spent the afternoon picking cucumbers, slicing, and stirring.  Finally, I ordered the Schweinbraten sandwich which looked more like pulled pork. At first I was disappointed at the appearance because it looked rather plain BUT at the first bite the flavor and juice exploded in my mouth. Wunderbar!  The draft beer selection is wonderful and I strongly suggest one of the flights, either three, six, or maybe even 10 4-oz tastings.  I found two new favorites!  Be patient as the restaurant staff works out the bugs and I think you'll be satisfied with this newest place to eat in the heart of Monroe Street (which, if you don't know, is a wonderful district in Madison on Lake Wingra and featuring almost all locally owned stores and restaurants)."}
{"text":"First date night in a while and we decided to try something new. I did an exchange program in high school where I lived in Germany for a summer. I can 21st from experience that Freiburg Gastropub is super authentic. Wiener schnitzel was incredible. Everything was super delicious and reminded me of a time almost 20 years ago. Thanks Freibug Gastropub! Now on to drink more ridiculously big beers."}
{"text":"Fabulous drinks and appetizers at this place tonight! The beers were great and the lemon drop martini was great! We had the Bavarian pretzel appetizer with the spicy mustard on the bar as well as the meatballs were to die for! Great service at the bar!"}
{"text":"We have been here twice and the food and service is great. Will continue going. Also is kid friendly and loud enough to not worry if they are talking loud."}
{"text":"One of the best German meals I've had! Stopped in for lunch with the family and was super surprised. Our server was quick, friendly, and the food came out super fast! As a vegetarian, I was pleasantly surprised to see many delicious options! My meat-eating children and husband loved their schnitzel and wurst! Loved the spatzle and the heaven and earth potatoes!"}
{"text":"Watching Euro Cup today, we decided if Germany won we would finally check out Freiburg, and if Italia won we would get pizza. Deutschland was victorious, and we were treated to a truly fantastic dinner! Not busy at all on a Saturday night around 8pm, maybe cuz it is a holiday weekend? He had the Saturday special - juicy brisket with vinegary, tangy BBQ saucy deliciousness. Came with kügel (noodle/egg bake) and veggie of the day - green beans today. She ordered a side of käse spaetzle (plenty large enough for a main course) - very creamy and yummy. Quite rich so it paired perfectly with a side of kohlrabi, Apple and carrot slaw in a mild mustard vinaigrette - I am not a mustard fan, so was a bit worried about ordering, and I'm so glad I did!! Soooooo good. Beer selection, of course, was out of this world. We will definitely be back again."}
{"text":"I lied, I said I wouldn't be back but we went because the food was good. But that isn't the case. The dinner is great, but the lunches suck. What happened to that great roast beef sandwich? Now no flavor & it's just sliced deli meat. The Reuben was gross! Have these people ever been to NYC? You trim the fat, all of it. And why 3 pieces of bread? Just to be different. How about make it great not different. We won't be back."}
{"text":"Yum!  I was able to taste three of the appetizers: the Brat Stickers (more like empanadas than potstickers, but great flavor), the Kartoffelpuffer (potato pancakes) (very good) and the Konigsberger Klopse (meatballs and potato wedges) (good, but not as good as my aunt's!). We got the Familienessen, the family-style meal.  Thursday is the sauerkraut-braised spare ribs: unbelievable!  Huge ribs, fall-off-the-bone tender, great flavor.  Sides (mashed potatoes with apples and bacon, sauerkraut, red cabbage, and cucumber salad) were all good.  I topped it all off with the cherry trifle (not the kirschtorte, but a special: custard with chocolate cake crumbs and cherries.). Service was earnest, but not skilled (appetizer dishes weren't cleared before the entrees arrived, resulting in some juggling of plates, and my soda never did get refilled.)"}
{"text":"When you walk in to Freiburg, it feels like you are walking into a set for a german themed movie.  The interior feels gimmicky and tries way too hard on being \"German\".  And quite honestly, the same can be said about the food.  Yes, they use German words for their entrees.  Yes, they feature German beers.  But the execution of the dishes falls flat, real flat.   Let's start with the beer.  I am impressed with the variety and options featured but not impressed with the glassware used.  Yes, it's branded to the beer you are drinking but their sizes are laughable.  If you have \"pub\" in your name, bust out the steins or Maß glasses. For food, we ordered the kasesspatzle and the rinderbraten.  The former is basically Freiburg's play on mac and cheese.  The spaetzle was gummy and came off oily.  The rinderbraten (roast beef and gravy) was ho hum.  The roast beef was not tough but not exactly fall apart tender.  Gravy was fine.  But for $17.95, it didn't bring enough flavor or appeal to ever order again. I doubt I would venture back and I wonder how the Monroe St. crowd will receive them in the long haul.  The area restaurants that have been successful have been ones that serve real and honest food and are authentic about who they are.  This can't be said about Freiburg."}
{"text":"Went with my Mama J, I had the shredded pork with slaw and potatoes and she had the brat stickers. First the decor is fun, am I in Germany? No just a place that looks like a German restaurant on Monroe Street, okay that's fine. My meal was delicious, the potatoes are amazing, crispy on the outside and just the right softness in the middle. The pork sammy was great, my only beef (he he) was that the bun was too big and got in the way of the great flavors. Mama J had the brat stickers, the mustard was too strong for her, but I loved them. I love mustard, I just eat it right out of the jar. So we went there about 12:45 on a Friday, service was fast and our waiter really knew the menu and restaurant. Great experience! I can't wait to go back and try something else, the menu is heavy but it's German...I mean we've all seen Oootter on the Simpson's."}
{"text":"Nice beer selection.  Extremely slow service on a day with 3 tables w/ people.  Jägerschnitzel was good, but speed of service on what appears to be a slow day is always going to kill a review."}
{"text":"The food was good, flavorful without any of the spices being overwhelming. Three of us had the spaetzle with meatballs and mushrooms and we all loved it. The noodles themselves were especially tasty. Another one of us had the German French Toast but we all tried it. It was very good, not too dry or too soggy. Finally, we had German fried potatoes which were crisp and not too oily. Our waiter was very sweet and helpful with the menu since we had never been there before. The decor was good as well, if you like dark wood decor. We will definitely try to go again next time we are in Madison and will try something new!"}
{"text":"Rich comforting German dishes.  And OMG the beautiful tap rail!  2nd visit.  I find the food tasty though sometimes too salty.  Our waiter was excellent.  The beer selection is incredible - so many German beers you won't find anywhere else in town.  I love the spaetzle.  As long as you've got a taste for German food I think it would be hard to go wrong here."}
{"text":"I came here with my parents the last time they were in town. My Dad lived in Germany for 2 years when he was in college so has a major soft spot for wiener schnitzel and sauerkraut. He is always looking for a new German restaurant to try.  We came for lunch on a Saturday. It wasn't too busy so were seated right away. The space is really campy and the bar is huge and cool looking. The lunch menu is a good mix of traditional German entrees and more familiar offerings with a German twist.  I thought the food was very good, but the service was a bit on the slow side, especially given how few patrons were there at the time. But our waiter was very friendly.  One thing that stood out on my visit was the mustard! I love mustard and ever since I experienced the intensity of mustards in France and Germany I've been trying to find them here in the States. Well, I found some amazing mustard and it's been under my nose for years! Each table had a pot of the most lovely mustard that is flavorful and gives you that coveted horseradish burn I had been looking for. It paired wonderfully with everything, especially the pretzels.  All in all, I think this place is worth a return trip or too.  What I tried Wienerschnitze- nice and crispy. My dad approved, so must be pretty good Käsespätzle- Mmmmmm. Cheesey and delicious Blackforest Burger- there is a lot of flavor going on with this one. Haus Made Bavarian Pretzels- this was a great opener. I love carbs and especially carbs that come with dipping sauces."}
{"text":"The food was alright, but the bartenders were rude and oblivious. The management seemed on edge giving the place bad vibes. It made my dinner uncomfortable. Won't be going back... Better places in Madison."}
{"text":"The all-wood interior is warm and welcoming in the winter, if a bit dark for the summertime. The beer list is German-focused and impressive, as is the selection of glassware available to the bartenders, apparently. The bar itself is a great place to grab a few beers or catch a soccer game.   Although Freiburg's dinner menu is generally well executed and I live nearby, I rarely go there for dinner. The food is so heavy that I nearly never want to go in the summer, and even in the winter the sheer amount of it feels like a splurge. I've never been for lunch or  brunch, though, so I can't speak to that.   That said, the dinner menu is definitely for you if you enjoy German food. The bread basket includes soft pretzels and replaces butter with a pair of sharp mustards. The schnitzels and wursts are excellent, and most of what appears on the plate next to them is quite good (although I found the spaetzle surprisingly uninspiring). If your dish doesn't come with the Himmel und Erde potatoes--a pile of fluffy mash studded with apples, caramelized onion, and bacon--add a side order. They reheat beautifully, so you won't be missing anything."}
{"text":"First time in this restaurant and I am greatly impressed. Great one for trying some German food ."}
{"text":"Highlights/lowlights  1) huge beer selection! 2) delicious food 3) friendly service  I visited Freiburg in October 2015, about three months after opening. Freiburg is a great addition to the Monroe Street neighborhood. The space is clean and open, the service is friendly and the food is great!   We came on a Monday night and sat at the bar. The restaurant was busy enough to have a nice atmosphere but not so busy that you needed a reservation. There is full service dinner at the bar so you can eat there if you want (we did!). The bartender was super friendly and answered all of our questions quickly.   The dinner menu is German food. So think a variety of wurst, potato pancakes, spaetzle etc. There are a bunch of appetizers, salads/soups, and entrees to choose from. Our group ordered a variety of appetizers and entrees and everything was amazing! Prices are very average probably ($$).   As far as g free options go. I confirmed with the bartender that the potato pancakes were just potato (this is what I ordered! So good!). And the variety of sausages and mustard give you some other g free options. As far as I know, there wasn't a g free bread or pasta substitute but you can still find things to eat on the menu.   Fun place to check out if you haven't already!"}
{"text":"Freiburg Gastropub is the place to go in Madison for German food and beer! Tucked away on Monroe Street, this joint is a nice stop for dinner if you want to get away from the busy restaurants near the city. The interior was sort of a mix of American pub and German brauhaus...which was fitting considering that the food tastes more fusion than \"German authentic\".   The portions are generous and their Jagerschnitzel is tasty! It's almost impossible not to have leftovers. Freiburg also makes a delicious red cabbage. Though not all the entrees are typical German, or taste like what you would find in Germany, I appreciated the creativity and good flavors!   One more thing --- be sure to try their warm pretzel rolls and German mustard which they serve before bringing out your meal. It's divine!"}
{"text":"We were there on Tuesday 7/5/2016. The food was horrible and come to find out later they did not even have a cook working that night. The food was old and dried out from reheating. They did not let us know but was happy to take our money. Horrible decision by management to not let guests know that their food was not going to be fresh but old and just reheated. We will never go again!"}
{"text":"I am so glad this place is here, I will come back and bring others!  The food is wonderful, great cooks. And that beer selection, right?! The staff are well timed and knowledgeable about the menu, and full of helpful advice about reheating leftovers.  Couldn't ask for a better experience, truly.    The spicy mustard on the table is deliciously spicy -careful with this one, remember to breathe through your nose!   The jagger schnitzel with the mushroom sauce was dank!!! This is a great addition to the already adorable  Monroe Street area!"}
{"text":"awesome german beers!!! This place is super clean and has great service. Not pretentious in any way. There's a homey germanic feel to it. The food is pretty awesome and paired in a creative way too. Saurkraut, brats, schnitzel, spatzle, etc., etc.,  Not sure why this is only 3.5 stars. This place is way cool. Hope it sticks around for a long time"}
{"text":"I don't know why we haven't tried this place sooner. Its right down the street and I have heard good things. On a whim, we gave it a shot on Saturday. Initially we weren't sure if it was open. There was not a soul in sight. We pulled on the door and it opened, so we went in. From there we were pleasantly surprised every step of the way. There is a HUGE (overwhelming) variety of German / European beers. I can't remember the name of the one I got but it was served in a giant sparkling clean Pilsner glass. Our server seemed genuinely interested in us and the restaurant's offerings. I really wanted the Schnitzel but was reluctant to order a large dinner portion so I was happy to hear they had a Schnitzel sandwich for the lunch special. We also ordered the honey braised pork cheeks and split both. The Schnitzel was super crisp and fresh out of the fryer. It was served on a buttery brioche roll and we opted for the side salad which was fresh and interesting. They also split it for us without asking (or charging) which I thought was nice. Moving on to pork cheeks... AMAZING! One of the best things I have had in a while and it was so interesting. The pork fell apart and was served on a tangy room temperature lentil salad. It was a decent portion, really unique, and quite gourmet for only $10.50. I will be coming back at my next opportunity. We agreed that the next time we could go for two beers and split the one pork cheek appetizer and be happy. We'll done and welcome to the neighborhood Freiburg."}
{"text":"Great little place we found for brunch today! The service was wonderful as was the food. I had potato pancakes with a lemon-cream sauce and a side of sauerkraut. My boyfriend had the meat version of the hopple-popple and really enjoyed it.   Best part...$3 greyhounds and mimosas from 10-1 on brunch happy hour!"}
{"text":"Friends wanted to meet up here after work, and I'd never been, truthfully because I'm not that interested in German food or beer. So let's get that out of the way before I begin. At best, I could see going here in the fall or winter, when heavy, hearty food is more what I'm craving.  That said, I arrived here around 6 pm last Friday night, slightly before my friends, and took a seat at the bar. I was struck by the relative brightness of the interior, light woods mixed with the expected heavy dark woods, and was heartened considerably by that. Large windows with awnings let in the summer sun but not the glare. Very pleasant interior.  I was greeted very nicely when I arrived, and the bartenders were also good-vibe givers. Helpful, relaxed and friendly. I don't like most German style beers, but they had one pale ale on tap among the scores of others, and it was quite delicious. I'm not sure if they brew or just serve their beers; either way, there's a huge selection on tap. The bar was gleamingly clean and neat, and everyone seemed to be enjoying themselves.   My friends arrived and we sat at a table by the window for dinner and drinks. I kept to just my one huge beer, and one friend had a drink called something cake (I don't remember the name) but she ordered two so I guess they were pretty good. She got the spaetzle, which we all sampled and found to be delicious. The cheese sauce is a bit thin, but that seemed to suit summer better. Her bf got the vegetarian ravioli, and I wasn't inspired by the looks of it to sample it. He said it was fine.  I was looking forward to my first bratwurst of the summer, and I subbed out the salad and house fries for German potato salad, a dish I've always loved. It arrived and I eagerly took a bite...and was instantly disappointed. Like Essen Haus, the bratwurst has a smooth, white interior, nothing like a Johnsonville type brat, which is the style I prefer. I took a couple more bites but left the rest, underwhelmed. The German potato salad was good, but way too intensely flavored with mustard and vinegar and salt. I had to take tiny bites between sips of beer.  We devoured the warm pretzel rolls and mustard that arrived before the meal, and had another basket after that. This is definitely not a place for those avoiding gluten, and I suffered for it later, but the rolls were worth it. There are salads on the menu, but the online menu is not up to date, fyi. If they'd had the salad described online, I'd have gotten that. As it was, almost every menu item comes with apples, onions, or apples and onions. I just can't get worked up about that combo. Another friend swears they are fantastic in their mashed potatoes, so I'll come back in the fall when it's mashed potato weather and give them another try.  I wavered between three and four stars, but I think four is justified. If German food and beer is your thing, I think you'll be pleased."}
{"text":"If you're going to a German restaurant chances are you're going to get beer and sausage. But if it's only day 2 of your New Year's resolution and you haven't yet thrown in the towel on it and decide instead to get the radish salad you will be in heaven. Truthfully I ordered it only b/c my options seemed limited. I fully expected to walk away hungry and disappointed but it was fantastic. And tons of beer that the staff seem pretty knowledgeable about and will let you sample before ordering. I'm definitely going back for that radish salad, even after I give up on my New Year's resolution."}
{"text":"A must-visit restaurant that is making German food modern and memorable. The space is open with high ceilings, staff is friendly and the menu is modest in size, which I interpret as a sign of a chef who would rather send out a few great dishes as opposed to a plethora of mediocre ones, so thank you!  The weinerschnitzel with red cabbage, caramelized onions and mashed potatoes were phenomenal--reminded me of the weinerschnitzel in Zurich. The Königsberger Klopse (German version of beef stroganoff, if you will) was homey, light and quite flavorful.   And if you enjoy cheese curds, try the ones at Freiburg where they're served with a refreshing cucumber dipping sauce. They were delicious probably in part because the chef used to work at The Avenue Bar and The Old Fashioned who know how to make curds in their own right.  Freiburg is great for couples, small groups and children (who eat free on Mondays).   Note to late-night eaters: the kitchen has a habit of closing early (even on a Friday) if it's not bustling so don't waltz in at 9:25pm unless you have a back-up plan."}
{"text":"Excellent food and great service. I'll be back and I recommend you check it out if you're looking for good German beer and food."}
{"text":"This place is a pretty decent German restaurant.  The food is fairly true to what German food is.  It has some items that are more of a cross breed of American/Wisconsin and German.  One of these are the Brat Stickers, think potstickers for Wisconsinites.  They also have some family style specials that sounded great.  All you can eat at a decent price is always nice.  They really have a good selection of German beers on tap, which is much better than the bottled versions you can find that have that aged funk to them.  I sampled a fee and was very happy.  With Madison becoming such a hot spot for craft beer and tap houses, the quality of beer was very welcome.  I did have an issue with their billing though.  I had ordered a 17oz beer and the server told me that the keg was tapped.  They were only able to offer me a partial pour, but she confirmed that the amount would be reflected in the price.  The beer was $4.25 for 17oz.  I was given an 8oz glass that was barely half full.  The charge was $3.75.  So they discounted it $0.50 for only receiving about 1/3 of a full glass.  Up until I saw the bill, I was enjoying my visit.  Who doesn't love beer and cake?  If that hadn't happened, I'd happily put this place at a solid 4 stars."}
{"text":"I rarely submit reviews, but given the experience of one of the diners below I felt compelled to. This restaurant was one of the most authentic, comfortable, and truly delicious German based restaurants I have been to. Having lived in Germany, I often try to find food that replicates my experience there. This restaurant came closer than anywhere I have tried in the U.S.   We went for lunch, so I ordered currywurst with the bratkartoffeln, my partner ordered the rheinwurst. The imported mustard from Dusseldorf provided at tables was the perfect addition to an already delicious meal. The bratkartoffeln were served just as they are in many parts of Germany. We tried some of the beers on tap that are not available in other Madison restaurants (as far as I've found), and they were great German beers, served perfectly. As evidence of not only the service but degree of authenticity they clearly seek, our waiting staff provided a complementary beer after the original that I ordered was served in the incorrect glass (Ayinger instead of Aventinus) - I would not have noticed but the fact that they went out of their way to remedy this was a perfect example of good customer service.   A note on pricing - the lunch menu was incredibly reasonable, and the beers very affordable (imported beers for around 5-6). The dinner menu looked a tad more expensive, but nothing unusual for Monroe Street.   The atmosphere facilitated an amazing dining experience. Open area with an open kitchen, as German beer halls strive for. The staff was still learning as they recently opened, but nonetheless we felt welcome and valued. We left with smiles on our faces."}
{"text":"Tried this place for lunch, was really excited then really let down.  I'm a Wisconsinite, beer and german food, sign me up. We got there around 11:30 for an early lunch on a Friday, no one else was there the whole time. Felt a little creepy.   I started with the Tomato Maultaschen Soup, I never had it before but really enjoyed. I then got a brat and my wife got one of their sandwiches. My brat was good, I didn't really care for the German potatoes, too bland for my taste. My wife's sandwhich was picked at by her. It was thick cut meat and a little fatty."}
{"text":"Freiburg does a great job selecting beers and an awesome job serving them. You can be assured that your beer will be served in the correct glass here! If my review was only of the bar and beer selection, they would get 5 stars. But... the food. Not good. Consistently not good. Honestly, I could have gotten over the many mild issues I've had with the food... except the last time I was there I had the worst pretzel I have ever had in my life and it was unforgivable. I came with a group of people, and we were going to have dinner there, but after seeing how they massacred the pretzel, we weren't going to give them the chance to serve us more jacked up food. The pretzel, iconic Bavarian bread, helps to soak up some the alcohol you're putting into your system. Traditionally set with lye, it has a beautiful brown chewy crust and a soft pillowy inside. Not at Freiburg. The pretzel served to us a few weeks ago was barely golden on the outside and crumbly like cake on the inside. It was dry and sad. The dough was horribly over worked, and the crust had little to no Maillard reaction happening. The beer cheese served along side it (for an upcharge) was almost as bad as the pretzel itself. Not that it mattered because I couldn't bring myself to eat more than two bites of the abomination they called a pretzel. Please fix your pretzel. I know lots of people are scared of lye, but just wear gloves and eye protection and you're fine. The interaction of the lye with the surface of the pretzel helps to aid the Maillard reaction while in the oven, and it's the only way you can get that authentic deep brown pretzel crust! If your pretzel is going into the oven white, it will come out white. That or go back to purchasing your pretzels from a third party."}
{"text":"Stopped in for a beer and immediately noticed the decor. Vintage look with brick and wood pillars. Definitely a nice ambiance. The bar had dozens of taps with a huge variety of authentic German beers. I didn't get a chance to try any of the food but maybe next time."}
{"text":"This is the best German food we have ever tasted in the U.S.A. We went there by bike for the first time and then by car for the second time. They have ampel parking for both bike and car. I have spent a year in Germany and truth be told, it is almost up to their standards! We enjoyed our wonderful beer (which was given to us to taste), dinner and conversation with the bar manager, waiter, and lastly the main chef, all of them extremely nice! It was an actual experience that anybody should have and that night, we felt, was ours.  Now for the wonderful food that was had. We both had the Ayinger Brau Weisse which was a light beer (5.1% alcohol) with a real fruity taste. It was wonderful for a blistering 29°C day (ca. 88°F). Then we ordered, Jägerschnitzel (Hunters Schnitzel*) and Sauerbraten (Sour Roast). The Jägerschnitzel (*) was wonderful!!! We saved part of it for the following day!!! Now, the Sauerbraten was amazing, and that was all eaten up before we left! Now, we also ordered a helping of Himmel und Erde (Heaven and Earth), which is to die for however, that also came with us for the next day!  We had such a great time, we would visit there again! Good food, great people, and wonderful service. Five Stars!"}
{"text":"Best German food in Madison. I have been waiting for an authentic German menu for YEARS now. Fun to take people that have never had German food and introduce them to it. Parking is in a lot down the street so you don't have to park on the street. Does not take reservations on Fridays or Saturdays, which is too bad. Just have to get there early! Can't wait to keep going back."}
{"text":"Beet salad is absolutely the best thing ever! Super crowded every time we go, so you have to fight a little bit for a spot at the bar. Overall a great neighborhood place with great food"}
{"text":"Came here for lunch. Never got my food after one and half hour. So I left. Worst service ever."}
{"text":"Waited 20 min without service, not even water. Food looked good, but not worth the wait or the apparent disarray of FoH."}
{"text":"Stopped here for lunch today and it was so great I have already planned dinner back here with my husband!  First, the service was great!  Sam was knowledgeable, friendly, and timely (particularly important on a lunch hour, but I know if it was dinner he would have kept my beer full)!  We ordered their lunch special which was a wiener schnitzel sandwich with red cabbage slaw as well as their rinderbraten.  Both were phenomenal!  I ordered the gurkensalat (cucumber, dill, mustard salad) instead of potatoes and it was perfect with the meat laden sandwich.    The interiors are great...not too dark like some german gastropubs but still full of character.  Their tap list was INSANE!  Before I even tasted food I had texted my husband a photo of the list and told him we had to come back!  Weinstephaner, Paulaner, and Spaten all on tap....yes please!  There isn't any outdoor seating but well worth the venture inside...great job Freiburg!"}
{"text":"Really excellent and authentic German fare. Friends and I sat at the chef's table, so were able to see the clean, efficiency of the cooking staff. Our waiter was friendly and made great recommendations. We shared the mixed plate appetizer, which had meats and cheeses, as well as pickled goodies and some sauces. The Jaegerschnitzle (spelling?) was phenomenal - I asked for the sauce on the side but it wasn't necessary. Really tasty and leftovers to boot! We also shared the apple strudel, which was divine à la mode."}
{"text":"Farmer's Market rained out? Bluphies closed for good? Well then leave your bundle of asparagus in the car and head over to Freiburg for brunch. Crazy Leg runners abound with their medals proudly hanging from their necks, hunker down and wait out their massive table tops in order to get biscuits and gravy, along with a loaded brat. But most importantly, it's important to get coffee to-go for the rest of your weekend errands; hope you're not too cool for a kid's cup!"}
