{"text":"My sister and I discovered French Made over the weekend and were over the moon. Amazing coffee, desserts and most importantly service. The two young ladies behind the counter took the time to talk to us, explain their favourite desserts in the shop and offered to warm up our treats in an oven! This simple touch enhanced the flavour of the items we ordered and made us love the cafe even more. I think I'll be back there again ... like every weekend:)"}
{"text":"Omg their pistachio croissant was to die for!!!!!!!!! Coming back for sure. Also the carrot muffin was amazing but nothing compared with the pistachio croissant"}
{"text":"Wonderful drip coffee!    I haven't had a chance to try the baked goods, sandwiches and salads.  They look insanely good though.   Prices are abbot dear, but it's part of a 5 star hotel, what can you expect.  

The staff was upbeat and helpful. 

It was sparkling and clean, but what else can you expect opening day!   

UPDATE.  

So make sure you get the cakes when they are fresh and full.  Seeing as they don't have enough fridge space and the don't cover the exposed edges, some of them dry out. 

The sandwiches all look expensive, but don't let it fool you as they all come with salad!  

The fresh croissants in the morning are also one of my favorites."}
{"text":"After an iced americano here, my mouth tasted exactly like I had just smoked a cigar.  Ick."}
{"text":"I was craving something sweet after our meal at Kost. Beside the main entrance to the Bisha Hotel (where Kost is located), I saw this little pastry shop.  Man, am I glad I went in. They had lots of delicious looking pastries and treats, but what really caught my eye was the Rocher, a giant version of a Fererro Rocher chocolate.  It was $8 and change, but large.  And the best dessert I've had in a long time. Definitely need to come back when we're not encumbered by time."}
{"text":"Marble floors, beneath the only 5 star hotel in Toronto Bisha, this place is not hard to miss..with whose who of Toronto getting their cafe fix here...I am a regular. Their coffee beans are pretty legit if not one of the top five roasters in Toronto..their Americano, lattes, are extremely strong..

As I have chkd in before and multiple times raved about their Almond tart..which is delicious perfectly sweetened with Uber amounts of almonds inside..Coconut Tart is also worth trying..

I have also tried their butternut squash soup which is creme de la creme ...Good!

Overall quality of this cafe is 5/5, with a great patio outside perfect for people watching this spot is a must stop on BlueJays Way!!"}
{"text":"Delicious baked goods but prefer other places for coffee and my London fogs. This cute French cafe is located beside the beautiful Bisha Hotel, love the decor and cute atmosphere and its right beside home so I'll come here on my way to work if I have some time to spare. Cookies are always so fresh!"}
{"text":"Cute spot. Great staff. Great location. Terrible coffee.... hopefully they will make some changes."}
{"text":"Stopped in for a quick breakfast. My breakfast sandwich was perfectly tasty, and my dad's \"scone\" was good (but as he put it, more like a cross between a muffin top and a scone). It gets 4 stars because my dad didn't stop talking about the cappuccino he got there until a day later. I was also pretty happy with my drink, a mocha made with coconut milk, which interestingly didn't make it taste like coconut. (I wasn't going for a coconut flavor, so this was fine - but beware if you're seeking coconut, this might not do the trick)."}
{"text":"The coffee and service is always top notch and can be the perfect wake me up before a long day at the office.

The cakes are amazingly moist when fresh, although they can dry out a bit if you leave them out for too long, or go at the end of the day when there are only a few behind the counter.

My personal favourite has to be the strawberry chocolate, a flavour I don't find elsewhere, especially considering that you can taste the fresh strawberries in the icing!

They've also recently been added to Ritual, which offers its own specials and perks!"}
