{"text":"Friendly service. Salads, soups,and sandwiches are yummy! Comfortable seating. Feels right at home!"}
{"text":"Pretty good coffee drinks.  Their sandwiches are hit or miss, but the crepes always hit the spot.  Plus it's the only potatoe salas I would actually choose as a side dish."}
{"text":"Atmosphere and decorations are a 3 out of 5. 
(much better on the inside then it appears on the outside) 

Service was also a 3 out of 5. 
(you order at the counter, seat yourself, and they bring you the food. You clean your own table and they don't ask you i you need anything else) 

Went to lunch with a friend and split 2 different selections. The first was the Cajun Kicker Wrap (baked chicken, lettuce, red peppers, tomato, feta cheese, house vinaigrette, light mayo in a jalapeno wrap)/ There wasn't any distinct flavor, very little feta cheese, and very little red peppers. The chicken was high quality but it was lacking flavor overall. The second selection we got was the French Market Dip (roast beef, melted Swiss cheese and grilled onions, served on French bread & steaming Au Jus for dipping). Again, could hardly taste the onions, but the roast beef was good quality. 

Probably wouldn't go out of my way to go back, prices were average, but you can get the same food with better taste at panera."}
{"text":"Interesting concept, but not well executed.  Nice comfortable atmosphere but didn't remind me of Bourbon street.  A friend and I split a cajun kicker chicken wrap and a french dip sandwich.  The 'cajun' chix wrap completely lacked flavor.  It was one of the most bland chicken wraps I have had, and there was nothing cajun about it.  The owner who took our order even recommended it.  The french dip was good-no complaints there.  Nice small portions so you weren't over stuffed.  SIde options were potato salad or a bag of potato chips (boring).  We got both and the potato salad was also bland.  We used the salt, pepper, and hot sauce on the table to attempt to add flavor to the food, but it just wasn't tasty."}
