{"text":"Let me preface my review by stating that I have not stepped foot in the restaurant. Therefore, I will be speaking on behalf of the food only.  I ordered the Santa Fe chicken salad. The chicken they use is comparable to canned chicken you may find at a supermarket. It was cold, bland, and chewy. Frankly, my buddy and I weren't sure whether it was tuna or chicken.   I was pleased with the chips and the varieties of salsa they offered. The salsa was flavorful and the chips were chips.  I must add, my buddies swear by the fish tacos and even consider them some of the best they've ever had.   I would've given this restaurant another star- However, for the prices they charge, the quality of their chicken is unacceptable. I would not go back and would only recommend it to people who prefer fish tacos to chicken."}
{"text":"It's good, not great.  I've tried it a few times, one dine in, one ubereats (delivery), and one time takeout,  The guacamole is OK, somewhat bland could probably use a little more lime/salt. The portion isn't that big either for the $6 price tag (for the appetizer version). It's about the same price as chipotle when it comes to price for volume, and I think chipotle charges too much for guacamole.  Everyone always compares these places to chipotle, which makes sense since chipotle really made the whole quick texmex thing popular. I like that they offer queso - chipotle doesn't offer a melted cheese. They also grill their burritos which is another win IMO. You'll also find much more diverse flavors here than chipotle - for better or worse, the salsa bar is nice and has a good variety of salsa that are unique in flavor.  Don't like the chicken, I've seen many other reviews commenting the same thing. I don't think it's really chewy and inedible as others have claimed but it's bland and sure to be the worst thing on your meal. Get a different meat, the pork is much better. Ownership should fix the chicken though.  Overall I can't strongly recommend this place. Similar prices to chipotle or even barrio during happy hour ($7 for a burrito). It's a smaller portion and isn't as good as either of those places. I probably prefer Qdoba/Moe's more to - but neither are really close to me.  3 stars because the salsa is good, I like that they offer things like queso and refried beans, and on Wednesdays they have $5 burritos - but I don't think it's better than their competition especially at the price point. I'll still come here once in awhile but I don't think it'll be very often - probably on Wednesdays."}
{"text":"I have to say this is by far my new favorite restaurant! Love the salsa bar! Such a great concept! And the key lime pie is to die for! Great staff that is so friendly and polite! Will definitely be having many dinner dates here! And some frozen sangria girl nights as well!"}
{"text":"This place is a must try! The food is delicious and so is the salsa bar. If you're a picky eater, which I happen to be, this is the place for you. I ordered a Fresco vegetarian burrito and will continue to order for the foreseeable future.   The staff is so helpful and friendly. The head cashier, Jesus, can help you pick something out of you're undecided. Super helpful and welcoming staff...can't stress that enough.   Side note: if you're craving some pretzel bites, this place has some yummy-delicious bites with homemade \"queso\"! Loved it!!! A+"}
{"text":"We had Fresco cater a recent party, and we were beyond impressed!  All guests raved about how fresh and delicious everything tasted, and we could not believe the amount of food for the price!  They even had options for our vegan and gluten-free guests.  If you are having a party, Fresco is hands-down the best catering option around - Highly recommend!"}
{"text":"Have been to Fresco Mexican Grill & Salsa Bar several times - we often go for special occasions. The menu continues to be inventive and exciting. Don't miss the Carne Asada in black mole! The wine pairings are not to be missed. I really believe their Sommelier is their secret weapon - she does an incredible job with her pairings, and they added depth to our dining experience."}
{"text":"I LOVE FRESCO!!! It's fresh, and delicious, and inexpensive. A delightful treat."}
{"text":"What a great place. I've been to the one in Kent, and since I was in the area stopped by the new location. Just as good as I remember. I love the atmosphere and of course the tacos, guacamole, queso, burritos, tortilla chips and salsa bar! Delicious and fresh food made to order, I highly recommend it."}
{"text":"My husband and I went to downtown Kent about 2 weekends ago.  We heard a lot of great things here and we gave it a try.    Food - was pretty good and tasty. I had 3 beef taco and my husband had the Quesadilla. Now,I like mine spicy but, my husband does not heat at all not even pepper.  I was not to crazy about the salsa bar.  When we arrived maybe they had a wild bunch because they destroy the salsa bar.    Drinks - reasonable prices . I am not a margarita drinker at ALL but, the frozen drink was nice and cold on a hot day.   Atomosphere- Was really nice! Love the place and walking all downtown Kent.   Staff - very friendly  Would I go back?? Absolutely!!!! Great place to hang out and have a good time!"}
{"text":"Love, love, love this fresh Mexican food!  The salsa bar is awesome!  Fish tacos are great!  Slims quesadilla with pulled pork is to die for!  Service is always fast and friendly!  Anytime we get near Kent we go, got our friends hooked too!  Definitely try it out!"}
{"text":"Excellent food and excellent service. The tacos were made fresh and tasted better than chipotle. It is definitely worth a try."}
{"text":"Not a fan- menu is too complicated, and takes way too long to get your food. Very small portions, and the staff are \"questionable\". Salsa bar probably sits out all day"}
{"text":"A great addition to the neighborhood with lots of freshly made salsa to enjoy.  It's family friendly.  The menu is tex/mex with a nice counter order and then sit down and they deliver your food service.  So its actually nicer than other similar fast food 'esque places and the salsa is FREE with your order provided you ordered a taco, quesadilla, burrito, or something else that comes with chips.  From what I learned at the counter, this store is a variation of the Kent store ...similar but not an exact copy.  Clean and brightly decorated, quality food and friendly staff are a plus.  They are breaking in a lot of new employees only open a week now but you can see they are aimed in a great direction.  BTW Monday night are $2 Fresco Taco's - so that's outstanding!  Outside patio will be nice in warmer days ahead.  Parking is tight but drive around and you can find a spot even if you have to walk from the garage in the back.  *babies were crying so it was loud ...underneath that was some nice 80's-90's music I think"}
{"text":"I have eaten at Fresco three times. The first two times I didn't have any complaints about the food. The tacos are really good. The last time I ordered take out, the chicken was slightly overcooked and dry. The prices are a little high, but the service is fast. I would eat here again."}
{"text":"Best place for fresh, flavorful, inexpensive tacos. I've had the Baha tacos and the blackened shrimp tacos. Both were excellent, the shrimp tacos were a little on the small side but still good. You get three tacos, chips and the help yourself salsa bar, which I love.    My daughter had a burrito  that was so big I thought some would be going home, but she ate all of it and said it was very nice...    We also had some guacamole and it was very good too, along with the fresh, warm chips.   You have your standard soda fountain, some Mexican bottled sodas, an iced tea dispenser, an assortment of bottled beers, and Margaritas if your thirsty, and water, of course.   The place is very casual, you order from the counter and they bring it out to you. I've been there twice and didn't have a wait or see the dining area very crowded.   I did see alot of take out, which makes sense because this place does what they do very well!   My go to for tacos!"}
{"text":"I am rather confused by the great reviews and high star rating. We decided to try this place today and it was a major disappointment. We had the steak fajitas and they were underwhelming. The meat was two different colors which was a little confusing. The salsa bar was not fresh and not very good. This place is overpriced for the quality. This place is going to struggle with all of the good taco places around. Save your money."}
{"text":"Ok food, really lame gimmick with the burrito names and fairly overpriced.... also, please turn down the music."}
{"text":"Food is good, but staff could benefit from some improvements. I've never been greeted, only asked vaguely if I have any questions, and what did I want to order. I saw one worker leaning on the side of a refrigerator. Another was working and drinking from a cup at the same time. Of the three times I've been here, no one has ever asked me how my food tasted! This kinda makes me feel like fresco doesn't care how it tasted, just that I purchased from them. Also, never has any fresco staff said \"thanks! We'll see ya next time\" nor anything of that measure.   If fresco wants to stay in business alongside other fast casual joints in this area, they're going to want to maintain a staff with more outgoing personalities and better interpersonal skills to retain regular customers. Otherwise, it's gonna be a short-lived franchise."}
{"text":"This was our last hope for cinco de mayo and the food didn't disappoint.  Burritos were on sale for $5, which was already great.  I got the cheese please bowl with chicken and it was very good.  The chicken was cooked perfectly and was tender and not over done.  Also got the chips and guacamole and the guacamole had a very good flavor also.  The salsa bar was a cool concept. I really only ate the standard tomato salsa, but it was the perfect amount of spicy.  Overall I'm glad to have this restaurant so close to my house for takeout."}
{"text":"Food is always good and the salsa selection is phenomenal. Service is fast and its a great place to stop for lunch. Fresco can get packed on evenings there are college events."}
{"text":"SO DELICIOUS. I just moved to Kent, and I saw Fresco while driving around one day and I just knew I had to try it. It looks clean and well-maintained, the atmosphere is great and it is very welcoming. Although the menu/ordering method is different, I don't think it's confusing at all. It was nice to pick up a menu and not be pressured to be ready to order yet! I went on a Friday and I saw that the special was Shrimp Tacos, but they were all sold out, which was a little disappointing, but I decided to get the pulled pork tacos, and that \"Special sauce\" on them is absolutely amazing! Everything I ate had great flavor. We also got queso dip which was magnificent - I could have eaten just that and been satisfied. Everything I had was really fresh and it didn't make me feel like I was overeating or eating anything super unhealthy. Also, the gluten-free option for everything is a really nice factor. They also had a nice selection of beer and mexican sodas on top of coke products, and the hot sauce and salsa bar is a great (free!) addition to the meal! I will most definitely be one of your new regular customers!!!"}
{"text":"We don't eat out often but when we do its limited to about three places- and this one has fast become a favorite. The food is delicious and the vegetarian options are great! Service is always prompt and the staff is attentive. Jesus in particular made our visit! He has a great disposition!"}
{"text":"Went here for the first time a few weeks ago and I really enjoyed myself. Was a little confused about the ordering system. The prices are also a little much but the food was very good.  Had the grilled fish tacos and the queso and they were both wonderful! Highly recommend if you're looking to get away from Chipotle or Taco Bell."}
{"text":"while the food wasn't terrible i too agree that the price was a little steep for what it was. chipotle is better flavored in my opinion and easier on my wallet. i am undecided on if i will return."}
{"text":"Fresco--still incredible and I haven't had another \"slow service\" experience! Highly recommend either of the fish taco options and the fajita Santa Fe quesadilla!"}
{"text":"I had originally given 3 stars because I was offended by a hot sauce bottle label with a confederate flag on it, but the owner was wonderfully attentive to the matter and plans to remove it from their stock. This responsiveness, coupled with the great atmosphere and delicious tacos, earns them 5 stars for sure!"}
{"text":"The staff was very welcoming. The lady behind the counter was very informative and answered all of our questions. You order your food at the counter. You get to pick your seat and they bring your food out to you. They check on you to make sure everything okay. They have an intense salsa bar and hot sauce bar. Both are self serve. Same goes for fountain drinks. Good place for quick food. Fajitas were awesome!"}
{"text":"I have been to Fresco's three times since it has opened in October. Now, considering the fact that I live in Akron and its location is in Kent, that shows the effort I have gone to get my dose of their freshly made tex-mex and salsa bar.   Your first thought walking in, I reluctantly admit, is that you are at a chain restaurant. A well designed flow and layout of the rest, along with a well branded theme. (I appreciate these thing due to my marketing background).  But when you find out that this is a locally owned restaurant, you will appreciate the effort that went into the decor.  You begin to think that they know what they are doing in the restaurant biz. It makes you a little more optimistic about what food might be waiting an the end of the line. The art is also very cool and it has a open and relaxing layout.  I was pretty impressed with the food.  The menu has something for everyone.  I have had the quesadilla, the Santa Fe Tacos(awesome double shell taco), Queso Dip (very good), and a variety of their freshly made salsas. I think my favorite was the fruit salsa.  It had mango and pineapple and a little heat too.  YUM! And you can't forget about dessert, unless, like me in many instances, you have overstuffed your face. They have the best Key Lime pie I have ever had.  At it's all made fresh, daily.    I just wish this place was located closer to Akron because it would get the nod over any Tex Mex restaurant in this neck of the woods."}
{"text":"The staff is friendly, and the place looks clean. Those are the positives. The food is just really bland. I ordered a chicken taco, and received a beef taco. It tasted like Taco Bell, except for the fresco salsa on top, which was so mild it was hard to distinguish from plain diced tomatoes. The chicken was blah. I doubt they even season the chicken with salt and pepper, let alone Mexican spices or marinade. Honestly Taco Bell and Chipotle both have more flavor. The $8 Cheesy Burrito, which was supposed to have 3 different kinds of cheeses, seemed to have no cheese. Chips and a salsa bar are included in the meals. We tried every salsa they had, and really none of them were that flavorful. Although they were ranked in spiciness from mild to very hot, theres only one I would even consider spicy. We ended up going home and putting our own salsa on the food anyway. It wouldn't have to be this bad if they would just season everything a lot more. They do have a large selection of kitschy hot sauce brands, but the food should have more flavor of its own without having to add it yourself."}
{"text":"Since Fresco opened up in October, I have been here more times than my stomach and wallet can admit.   I am OBSESSED with their Santa Fe tacos. SOSOSOSO delicious. Their pico de gallo salsa is a force to be reckoned with! I could eat it by itself without a taco or chips. The other salsas aren't as impressive but I know others who think otherwise. The hot sauce bar is neat if you like that sort of thing. I'm happy with a hot sauce name I know on the side of my Fresco taco. Not a whole lot is needed to make it good.   The workers are all very courteous and one of the owners is almost always there and will greet you and ask about your food.   I don't really know what everyone's complaining is about the prices. $7.99 for three huge tacos with chips and unlimited hot sauce/salsa? Definitely not unreasonable and completely worth every penny.   If you're looking for a delicious, filling meal for not a whole lot of coin, check out Fresco. You won't be disappointed."}
{"text":"Well, this place just didn't live up to expectations at all.  When my girlfriend and I saw it had 4.5 stars, we had to try it.  Unfortunately though, it really wasn't that good.  We're HUGE fans of Barrio, and we weren't quite expecting something like that, but something more like a Chipotle, and it didn't even come close.  We both tried (3) different tacos, and honestly, none of them were really that great, and I believe one of the fish tacos my girlfriend wanted, they had run out of fish, which was odd because it was around peak dinner time on a Saturday.  We also ordered some of the queso dip to go along with our chips.  This wasn't bad, but was a bit runny for queso dip.  The concept of the place is great, getting to try a bunch of different salsas and hot sauces is what caught my eye, which I loved doing, but I think it's a swing and miss on execution here.  The food just isn't up to par on taste.  My girlfriend told me after we left that the best thing about the place was the diet green tea...so that's saying a lot right there!  I'm hoping the food improves because we wanted to like this place, but after this experience, I'm not so sure we'll be back anytime soon.  Again, it wasn't terrible, but it just wasn't that good...much better options out there."}
{"text":"How bout some chicken ~ on the \"chicken taco salad?\" Had that yesterday and could have counted the cubes of meat, very  very few. The salad look very pretty but all lettuce!"}
{"text":"We really enjoyed our visit. Everyone that worked there was friendly and all of the food was fresh and delicious. The Baja fish tacos were excellent. This restaurant is 4 year old approved and pretty kid friendly."}
{"text":"My first visit wasn't all that bad. I decided to have 3 tacos fresco- chicken, beef, and a mahi-mahi. Love the texture of the soft taco, and its taste. I completely missed the fact that the pulled pork and the barbacoa were the signature items, and found myself debating whether or not I should get 2 more after finishing mine. I didn't really care for the chicken at all. While it went well with the default toppings, I get the impression that its canned chicken. Dry, bland, and just lifeless. The ground beef was a little better- definitely better than Moe's. Like the mahi-mahi, but I woul have liked to have more fish portions as I mostly just tasted mouthfuls of cheese and pico. Whatever that sauce is they put on the fish tacos is awesome, and I think would go really well with the barbacoa...if I go back and get...which I probly will.  Can't remember the 4 salsas I got, but the 2 at the farther end that were advertised as spicier weren't even that. Not sure what the dope reviewer is talking about needed salt in them, they tasted just fine. Really liked the corn and black bean salsa, however the other roasted whatever corn choice also tasted like a canned sweet corn to me.  Chips were awesome and perfectly seasoned with salt.  I'm really glad I decided to NOT get a burrito. It seems they are all probably grilled, and that doesn't mix well with sour cream inside. Trying someone's burrito yielded a chunky/curdled sour cream that was far from creamy. Seriously guys, you can't bake things that are meant to be cold, and they really shouldn't be encased in a tortilla while doing so. No beuno.   Definitely feeling another visit at some point in the future. The tacos are the way to go, but even after 3 and alot of chips I still felt pretty hungry."}
{"text":"Love this place!  Great menu with lots of variety, and always super fresh. Fish tacos of any kind- amazing! And the best part is the variety of house made salsas. Yum!"}
{"text":"The people who work at the Rocky River location are consistently pretty rude and non-friendly, but if the food was fantastic it would be easier to overlook that, but the food is pretty bland and not memorable. I would never go out of my way to get here, but it's on the way back to my car after the gym and I stop in every so often. Not the best food or the best experience, but it is decently priced and the food is okay."}
{"text":"i ordered the water street with chicken. i got the water street with beef. the manager quickly fixed my order. fantastic customer service. 5 stars.   follow up. my second burrito got me sick. the rice was hard and there was hardly any chicken or fillings. i have food poisoning, and i will not return to this restaurant.  beware!"}
{"text":"Get you some of that! This place rocks!  Fresh salsa bar and homemade tacos!  Very kid friendly!  Great service too!"}
{"text":"This place beats Chipotle in so many ways. First, I can drive here from Lakewood, order, and eat in less time than I would be standing in line at Chipotle. Second, refried beans! These come with several of their tacos and burritos, including the Santa Fe taco, which is excellent- layer of beans between a hard and soft taco shell- heavenly! The fried fish tacos are also excellent. Third, free chips and a selection of fresh salsas. Fresco is a great value and it is my new QSR taco fave!"}
{"text":"I've been here twice and I'm over it.  Please save yourself from disappointment, if one of the specials is the Perch taco - DON'T DO IT!  Not sure if the fish was old or if it had been sitting around for awhile, it was just nasty.  The other two tacos were ok (barbacoa and the pork). These 2 weren't as bad as the fish, but I would only get the pork again.  The chips were good."}
{"text":"Tried for the first time today and immediately fell in love! Friendly, helpful staff, great food! Definitely better than chipotle and qdoba by far. Fast and good prices for Mexican that actually tastes authentic!! It's always good to support local businesses and this is one that deserves support! Shop and eat local!"}
{"text":"I've been here a handful of times with my husband and two year old daughter and I love everything about it. It took me 30 seconds to figure out that there's no posted menu but then I enjoyed the flexibility of holding a menu while I figured out what I wanted.   I love the quesadillas and the portions are generous in my opinion. A full quesadilla is enough for me to share with my toddler and my husband usually gets some of it as well.   The salsa bar is great! I wouldn't mind seeing some salsas with a little more kick but I'm always happy with my selections there.   They might consider having the order taker do a quick explanation to new patrons, letting people know that their food will be brought out and the table cleaned for them when done. That would eliminate that bit of ambiguity and also would probably encourage more people to tip at checkout."}
{"text":"In the last year or so there have been so many taco places popping up on the west side. I feel that if they are going to keep popping up they need to stand above the rest and Fresco just fell flat for me. It reminded me of Moe's with the salsa bar and Qdoba with the queso.   I tried 3 tacos a Steak, pulled pork and chicken taco and ordered a side of queso. The food was sub-par and since there are so many other locations offering the same thing it is hard to say if I will return."}
{"text":"Worst guacamole and black beans ever.  Portion size is extremely small.  Tried it twice, but will not go back."}
{"text":"We come here for dinner almost every time before a show at Kent Stage.  We love the food. Great beer selection.  Service is always excellent."}
{"text":"I give it 5 stars for consistency, price, and playing decent music all the time (well, decent if you're over 40, which I am plus a decade or so). As to the food, though, we generally buy the fish (Baja) tacos, and again, they are consistently good, and the cabbage slaw that comes on them is crunchy, tasty (not spicy), and works well. Add in your own salsas from the bar as there are loads to choose from, not to mention the many varieties of hot sauces available. Guac is good too; chips are good. It really is our go-to place when we want tasty food, don't want to look at a menu and debate what to get (their menu is nice; the pork taco/burritos are good too), want it fast, often on a Sunday (open 'til 8!), and want a nice Mexican soda too.  Always good. That gets 5 stars from me."}
{"text":"I have been coming to Fresco for a few years now. Great food,always fresh and flavorful. While I love all their salsa options, the Cucumber salsa is incredible. Get extra when they have it. You'll regret it if you don't. I work in fast paced retail,and the staff here are rockstars. Attentive,polite and quick. If you are in Kent and hungry for some tacos,come to Fresco."}
{"text":"The food was fast, fresh, and delicious. The salsa bar is fun and really adds a pop of flavor to the food. There is a great atmosphere in the restaurant, and I really enjoyed fresco. I will be back!"}
{"text":"Outstanding fresh Mexican food.  Fun atmosphere, great salsa bar, and even Sangria and frozen Margaritas. Definitely my new \"go to \" place for fast casual FRESH Mexican."}
{"text":"My husband I stopped into Fresco tonight for our first visit. We were very happy with the food and service.  We both enjoyed the burritos.  The food was very fresh and the service was excellent!!! The highlight is definitely the salsa bar! My only complaint...we are from Akron and had to drive 30 minutes BUT it was well worth the trip.  We will be back!"}
{"text":"I've been to Fresco's many times since it has opened. There is nothing on the menu that I haven't liked! The fish tacos and bonitos are my favorite. Whenever I walk in there is always an employee greeting you. They don't rush you when ordering and will answer any questions you may have about the menu. The last time eating at Fresco's the employee, sorry I didn't get your name, came over and asked if everything tasted OK and if we needed anything else. I only wish they would post their  lunch specials on Facebook on a daily basis."}
{"text":"I would have to say I am very impressed with this business. I recently gave them a bad review and they took the time to make it right. Not many places care enough to do that. I look forward to giving these guys another try."}
{"text":"Great, friendly, fast service.  Reasonable prices, and certificates on restaurants.com.  The salsa  and hot sauce bar boosts plenty of options.  Love the enjoying a sangarita on the patio on a beautiful night in Kent."}
{"text":"Fresco is a great spot. The place is clean & well maintained. I ordered the steak tacos. They were accompanied w/ tortilla chips. They have a salsa bar w/ about 8 different salsas that are complimentary w/ your food. My tacos were great & the steak was very tender. Price was fair & taco were average size. I will be back..."}
{"text":"Baja fish tacos were great. I loved the salsa bar. Happy to have the habanero salsa and other choices (what, like nine or ten of them?). And the price was great. I'll be back."}
{"text":"We have been to the Kent location a few times so we were pleased to see them opening a Rocky River location.  Our biggest fear - it's located in the Beachcliff shopping plaza which already has significantly limited parking.  It will be curious to see if they can make it because of this major factor.  On a Wednesday at 5:45 pm, we drove around a completely full parking lot and followed an individual to their car in order to grab their parking spot.  Once that major battle had been staged, the Fresco experience went well!  For the money, they deliver as expected.  We had the queso as a starter and a bowl of black bean soup.  We had the Fresco tacos and the Barbacoa tacos.  Everything delivered as expected.  Everything was tasty.  Were all the products fresh, as advertised.  Yes, I'd say so.  They offer a salsa bar with about 8 fresh offerings from pineapple salsa to habanero.  They also have a section of about 25-30 bottled hot sauces for your choosing.   The price - $4 for the soup and $5 for the queso (easily enough for 2 to 4).  Tacos were 3 for $8.  Soft drinks machine - $2.  I'd definitely recommend it.  Just don't be put off by that always packed parking lot!"}
{"text":"I am all about this place from beginning to end.. value is excellent! Atmosphere is comfy and festive... open salsa and hot sauce bar for your taking!... great baja tacos... cook is legit from mexico! Oh btw, they have frozen margaritas with sangrias!"}
{"text":"i am usually not a fan of Mexican style food, however fresco was great, atmosphere was great, staff was helpful and polite,  i had the steak quesadilla  with peppers and onions very good,  had y the key lime pie it was excellent  will be back"}
{"text":"I had the blackened shrimp tacos with chips and queso- both were very tasty- their salsas are extremely good"}
{"text":"FINALLY!  A place that reminds me of Rubio's in California.  Got the \"say cheese\" burrito with grilled chicken.  Very good.  The queso inside it made it.  Next time I need to try the grilled Mahi tacos or the barbacoa.  Lots of choices here and good for kids.  The salsa bar is chock full of tasty salsas..but unfortunately I don't think they are made in-house.  There is quite the garden variety of hot sauces to choose from, too.  I am not a Chipotle fan so I dig this mini-Rubio's.  The only thing I would suggest is they make the silverware more readily available.  Knives and spoons are on the counter but I had to ask for a fork.  Chatted briefly with TJ, the owner.  Cool dude.  And BYO cerveza until they get their liquor license!  Go."}
{"text":"First, the good news. Gluten free soft tacos! What a joy to come across those. Also, the chips are done in a dedicated gluten free fryer. Didn't appreciate it when I expressed my joy at this and the cashier said, \"yeah, it's really trendy right now.\" Sigh. I LOVE when people assume you're eating GF because it's a diet thing and not a medical thing.   ANYWAY. The food iteself was incredibly disappointing. We were headed to Barrio (which was closed for the holiday), so decided to give this a try to get our Mexican food on. I got 3 different tacos, all of which were very bland. My husband got the fish tacos and said those were bland as well. It was like they were anti salt. It's unlikely we'll be back."}
{"text":"Amazing food SoCal Style if you like real Mexican food and none of that sissy stuff come down I'm sold on it"}
{"text":"One More neat place in Kent. We have been there a few times and we always sit right outside the door. The food is great and the people that work there just seem to really like it. They are a lot of fun Try it, you won't regret it."}
{"text":"I decided to give this place a try based on its closeness to my house and other people's reviews. To say I was disappointed is a slight understatement. The guac had no taste, we even tried to doctor a little with extra cilantro and some salsa and that had no effect. I felt like the barbacoa and pulled pork tasted exactly the same (way over seasoned to my taste) and drenched in sauce...Actually everything I had was mushy and way over sauced.  Maybe this is not my kind of taco place; Maybe I am just picky or maybe it was just an off day- whatever the reason; I will not be returning. I try not to be completely negative in my review so I will say that the staff seemed very nice and we didn't have to wait long for our food; the very best part of the experience was the ice (when it was refilled). Oh Those little nuggets of coolness....the ice was on point!"}
{"text":"This place is great! Had the Cheese Please Burrito as a bowl and it was very fresh and filled with so many great flavors. The complimentary salsa bar is a great touch, added a few different salsas to my burrito too! The guacamole is also awesome. Will definitely be back."}
{"text":"Loved everything I had here. The barbacoa rivals another local chain's braised beef. And the salsa bar has so many great options, it's hard to choose!"}
{"text":"I don't really understand the high reviews. Has Kent lost all their taste buds? We are a college town but you can get better food than this at lower prices. The food is mediocre at best and the salsa bar very lacking."}
{"text":"I've gone to Fresco twice, so I'll probably refer to both experiences in my review.  ATMOSPHERE 4/5 It's colorful and very open. It's kind of stylish and casual. Lots of variety of seating; you can sit on a stool at bar (not like a bartender-at-the-bar bar, but like, ya know, a bar that's really just a long table), a little tables, big tables with benches, or whatever.  STAFF 4/5 Staff has been friendly both times I've been there. There's not much interaction with the staff, outside of ordering your food and someone has stopped by my table each time to ask how my meal was. I knocked off a point because my order was messed up both times I was there. Each time, I ordered ground beef tacos without pico. The first time, it came with pico, but without sour cream. The second time, my tacos didn't have pico, but also didn't come with sour cream. Which the menu says sour cream, so that's strange. I never bothered to ask anyone to fix the mistake, so I can't speak to how they'd handle it, but I'm sure it wouldn't be a big deal.  TASTE 3.75/5 After my first visit, I'd probably had said 4/5. My second visit, however, wasn't quite as good though. The first time, things were great, but the second time, they pulled a Chipotle on me and filled my tacos with lettuce, then seemingly dropped some beef and cheese in there on accident, and there wasn't much of the latter two. Though the cost of food is like Chipotle, I think the Fresco food tastes MUCH better (when they aren't giving you lettuce tacos). It's Americanized mexican food and I think it's done pretty well. Also, they have a salsa bar which has regular salsas, habanero, pineapple, corn, and others; a really cool feature of the bar. Conveniently, they have a wide variety of hot sauces for you to use as well. Also, they have a decent selection of bottled beers, which I appreciate.  COST 3/5 Again, I think it's about the same as Chipotle. My tacos cost around $7 for three of them and some chips. My beer was about $3. Pretty fair prices.   OVERALL 3.75 I do quite like the food there and will definitely go back. They have daily specials that they have marked outside on a board, which encourages some exploration of their menu. If you live in or will be around the Kent area, it's certainly worth stopping by. I've lived in Kent or surrounding cities since 2004 and will be moving away in a couple months. Fresco, among other new establishments in downtown Kent, make me wonder why the city waited so long to get so many things going right for it."}
{"text":"Holy Frescola!! Wow this place just surpassed Chipotle as my favorite fresh/casual Mexican fast food! Been here 6 times now.. tried tacos, fajitas, quesadilla, soup, apps. All excellent and delicious.   Their special sauces and queso are amazing.  Salsa Bar is unbeatable w/ 12 options = All Free! ...pineapple, pico, fire roasted corn, & blackbean salad were my top picks. Not to mention huge hot sauce collection.   Great ambiance, trendy music, cool decor and super clean! Service was speedy, food comes out quickly. Plus they've had specials on the weekends I went."}
{"text":"I've been to Fresco twice now. There are many things that I love about it, including: the atmosphere, the design and decor, the friendly staff, the daily specials, the drink selection, the reasonable prices for the amount of food you get, the website, the location, the cleanliness, the speed, and finally, the hot sauce and salsa bar.  However, the main point of a restaurant is the food. Unfortunately here it is a bit too bland for me. Even after adding a variety of salsas and cilantro to my burrito and tacos it just didn't have a satisfying taste.  Now, I must admit, I'm a bit of a snob when it comes to Mexican food.  But with Fresco, I'm not even rating it on my authentic restaurant criteria, I'm judging it as an Americanized chain style casual fast food spot.  Bottom line:  If they do a bit of tweaking to their seasoning and boost the flavor up a bit, I'll definitely be a regular customer."}
{"text":"Shwappy food. First time here and my last. Save your $15 and go to Chipotle. My burrito was beans and lettuce, maybe 10 little pieces of chicken. Paid .50 cents for sour cream lol. All you can eat tortilla chips with your meal?! No way!"}
{"text":"If they didn't have the only menu with fish tacos (they are quite good) I can find around here I wld never go back. The flavor profile to the bowl (instead of burrito) is bland at best. My 3rd time here for yet again the fish tacos and the cheapskate ringing me out tried charging me full price for 4 tacos. The menus clearly states 3 to an order are a discounted price. As I was waiting for my \"to go\" order an employee opened one of my orders and commented \"oh this looks so sad\" to the cooks. I'm standing right here....so thanks for making the cooks and I feel awkward! There seems to be no seating option for small children either so I can only get orders to pick up. Unless I get some undeniable craving for fish tacos again I see no reason to go anywhere but Taco Tanos!"}
{"text":"Great food and they have a great salsa bar I love to go there for lunch really nice location"}
{"text":"This was my 2nd time there. Each time I tried the burrito in a bowl. They do a great job of labeling gluten free on their menu, which is helpful for me since I can't eat gluten. Had the Slimms Burrito this time with pulled pork. Its basically just the burrito minus the tortilla, in a bowl with chips around it. It was good, not something I would go bragging to my friends about though. Also, I have to mention that I found a bone(or cartilage, or something hard) in my meal. It wasn't a big deal, I kept eating after finding it. But i could see this scaring others away.   The salsa bar had tons of options which was cool. The salsas that I tried were pretty average tasting though.   I have to mention that the service was awesome. One guy was running the register taking orders and bussing tables and taking out orders. This was when the place was pretty crowded at lunch time and he did great.   That being said, it's a good switch up from Chipotle and I will definitely be back."}
{"text":"We decided to give Fresno a second chance yesterday and our experience was much more pleasant.  I clocked how long it took for the burritos and chips to arrive.  Only five minutes.  The wait time was much longer last time, probably 15 minutes, so big improvement!  The burritos were as tasty as last time.  The salsas were a tad bland on our last visit.  The flavor had remarkably improved! :)  We took a piece of key lime pie home, which was delicious!"}
{"text":"This place was ok. You can't go wrong with a variety of salsas. My burrito was good, but the rice inside lacked flavor. I was left with a mouth full of bland flavoring and had to constantly add sauces and salsa to every bite to give it taste. Price wasn't bad. Portions were nice. Just lacking in flavor and taste."}
{"text":"It was just okay. Honestly, if you want median food and a real Mexican atmosphere then head over to Guac's. But overall the food was good,  little over priced, and very Americanized. It's always fun in there though."}
{"text":"Love the Baja fish tacos and blackened shrimp tacos. So good! One time my friend ate it and puked so I don't know. I'm still gonna go a lot."}
{"text":"I love FRESCO! Great food...delicious...staff is so friendly...very fresh! Many great dishes to choose from! Stop in and enjoy the great food!"}
{"text":"Ok, so it's not totally authentic Mexican. But what it is, it's very good at. Fast, fresh, tasty food. The salads are nicely garnished, the burritos are big, and the tacos are creative. I like the pork or the shrimp tacos, especially. Prices are very good. Best of all, the guys that own it are nice people. They want you to enjoy your food and come back, and it shows. Great salsa bar and a nice selection of fancy hot sauces!"}
{"text":"Everything here is fresh and delicious. I just wish it was cheaper): but nonetheless, their tacos are amazing with just about anything. They have vegetarian and vegan friendly menus(: and tortilla chips with just about every single type of hot sauce and a variety of salsas. I recommend the pineapple jalapeno salsa, it's the best imo."}
{"text":"Great fresh Mexican food. All vegetables and lean proteins. The manager is exceptional at making you feel welcomed. He is passionate about his restaurant and his employees. Gives great suggestions!"}
{"text":"Not at all impressed. Food was bland, salsas tasted like they came out of a jar, not at all fresh. Taco tonto's is a much better value."}
{"text":"Love the food but... I noticed when an employee was preparing my food (Baha fish tacos) that he was not wearing gloves.  I thought food safety laws in Ohio require gloves for ready-to-eat food.  He handled the soft tacos with his bare hands and put them in the takeout box."}
{"text":"Food is way better than I expected. All tacos are seasoned well. Generous portions all fresh ingredients. The salsa bar is delicious."}
{"text":"I got the Fresco burrito and it was quite good. Still somewhat bland, but it had good flavor. I still wish there were better options around here for some good Mexican food, but this place is definitely worth going to if that's what you're looking for. The prices are good and the staff is very friendly."}
{"text":"Surprisingly good faster food place with unexpectedly good flavors.  Wife loved the pork tacos and I had the barbacoa.  Complimentary salsa bar was filled with delicious options.   Sadly tucked away from other local options in a city full of dining options.   Please give this place a chance!!!"}
{"text":"This is my second time visiting this restaurant. My wife loves the fish tacos. We both enjoy the chips and salsa bar. She requests the fish just grilled instead of battered. You have to request this option, but they will accommodate the request.  On my first visit I have the steak and cheese tacos with the soft shell corn tortillas. They were ok. On my second visit I enjoyed the pulled pork tacos in the hard corn shell tacos. The menu says the pulled pork is award winning. I agree. I am already thinking of returning for the pulled pork tacos. The kids loved their tacos and cheese quesadillas. Great location in downtown Kent."}
{"text":"Food is great, always fresh and always fast.  Staff is friendly and premises are spotless.  I just wish they would do away with that loud music.  From time to time it's so loud people can't enjoy a conversation.  It's a restaurant, not a bar.  Get rid of that music, and let patrons enjoy their meal in peace."}
{"text":"My family and I stumbled upon Fresco and I'm so glad that we did! The service is friendly and fast. The food is delicious. The restaurant is clean the atmosphere is really relaxed.I tried the queso with beef and I ended up eating it all and ordering one to go because it was so yummy. The guacamole is really good as well. This is weird but Fresco also has really good ice. I was really pleased with my meal and the prices were reasonable. I definitely recommend trying Fresco."}
{"text":"Great spot, never have to wait, nice little patio in the summer.  Their signature burrito with beef is great, keep coming back for it.  My kids request to come here over Chipolte, Qdoba and Moes."}
{"text":"Drove 'round and 'round looking for parking, but it was worth the effort.  Beautiful little restaurant, right on the corner, lots of windows, clean.  I think they intentionally keep the food from being too \"challenging\" or spicy, as you can sample from the salsa bar or pick one of what seemed to be hundreds of hot sauces.  The midwest palate thinks \"spicy\" means \"scary,\" so they play it safe.  You will have to work the food up to an interesting heat level in order to eat if.  I tried mine un-sullied by any additives.  Not worth eating, really.  And let me say a bit about this part of downtown:  I was last there about six years ago, before the city's \"Kentrification 2015\" program was in full swing.  Sweet mother of Mother's, is that place gentrified.  Looks like Boulder, without the clean air, mountains and uber-fit boy babes and girl babes.  \"I'm living in this world. I'm what, a slacker? A \"twentysomething\"? I'm in the margins. I'm not building a wall but making a brick. Okay, here I am, a tired inheritor of the Me generation, floating from school to street to bookstore to movie theater with a certain uncertainty. I'm in that white space where consumer terror meets irony and pessimism, where Scooby Doo and Dr. Faustus hold equal sway over the mind, where the Butthole Surfers provide the background volume, where we choose what is not obvious over what is easy. It goes on...like TV channel-cruising, no plot, no tragic flaws, no resolution, just mastering the moment, pushing forward, full of sound and fury, full of life signifying everything on any given day...\"    Richard Linklater, Slacker"}
{"text":"Awesome!! Came here last night after participating in the Kent Potterfest 5k. I got the quesadilla with chicken and chips with salsa from their salsa bar. SO GOOD! I was so happy that their quesadilla wasn't greasy or overloaded with veggies or cilantro. It tasted like the quesadilla from my favorite Tex Mex restaurant Chevy's (wish we had one in Ohio)! The salsa bar had so many options and service was fast and friendly! Will be back for sure!!!"}
{"text":"Kent location is definitely better. Both times I've been here the service was terribly slow and the food is mediocre at best."}
{"text":"This has been my go-to restaurant in downtown Kent for the past three years. The people are nice, the food is great - what more could you possibly want?   Fresco has a decently sized menu full of totally customizable tacos, burritos, and quesadillas, AND my favorite feature - a complementary bar of about a dozen fresh and delicious salsas. The salsas are even labelled by hotness, which helps a weak-tongued girl like myself avoid the spicy choices. Try the corn salsa - perfect mix of sweet and cilantro-y.   If you're vegan, vegetarian, or gluten-free, you can still get in on all the fun - Fresco offers gluten-free tortillas and can make any taco veggie-friendly by replacing the meat and/or cheese with rice, beans, and guac. My favorite vegan option here is the veganized version of the Sante Fe taco, which consists of a soft tortilla spread with refried beans wrapped around a hard shell stuffed with rice, black beans, lettuce, tomato, and topped off with Fresco's life-changing guacamole. Their website claims that the guacamole is \"the best in Ohio\" and I wholeheartedly agree!   If you're looking for food that's a triple threat - fast, delicious, and fresh - Fresco is your best bet. Stop by for lunch, and if you're feeling fancy, try one of their frozen sangaritas! You won't regret it."}
{"text":"Our family has been here twice for Sunday lunch, enjoyed it more the second time.  The wife and I had burritos, daughter had the Santa Fe salad.  Had to ask for utensils. No left overs.  The plastic cups that they use for the salsa bar are too small to actually dip a chip into and you need three refills to finish your chips, the ones that they use for the salad dressings would be a perfect size."}
{"text":"I don't know why I haven't reviewed this excellent place sooner, as I've eaten there more times than I can remember. Everything I've had -- from queso and guacamole to fish tacos and several of their burritos -- has been great. Add to that an awesome salsa bar with at least 6-7 options and you've got a great meal.  Service is always top-notch... extremely friendly and thorough. This is definitely our go-to place for fast-casual Mexican now. Keep up the great work, Fresco!"}
{"text":"Fresco is a great place when you're looking for something fast and cheap but want something healthier and tastier than McDonald's! I've been here numerous times for that reason. I love their salsa bar. I usually order a salad, but their tacos and burritos are good too. It's American Mex. they have quite a salsa bar, I've found that only a couple of the salsas are any good. Most of them don't taste the freshest."}
{"text":"By far my favorite restaurant in Kent. The flavors are not overly complex, but the wide variety of salsas offered at the salsa bar allow for everyone to customize their food the the appropriate level of complexity and or heat. Although I've tried a majority of their menu, the chicken  Santa Fe tacos keep me coming back.  Think of a grown-up, fresher, delicious version of a double decker taco from Taco Bell. Unlike the Taco Bell variety however, Fresco delivers a product which actually tastes amazing when you're sober, and doesn't originate from a caulking gun. The portions are huge, and you get refills on chips and any salsa when you dine in. $7.99 is a steal with the quality and quantity of food being well worth the expense. Wash everything down with a Mexican soda or a frozen 'sangarita' ( mixture of sangria and margarita) all while enjoying the vibrant interiors and views out to the newly revitalized downtown kent. If the delicious food, dynamic interiors and polite staff aren't enough to get you excited, the upbeat music and outdoor patio should do the trick. I can't recommend fresco highly enough."}
{"text":"Stopped here on Easter Sunday with my fiance and her mom and grandmother.  We wanted to try something new and glad we did! We entered the restaurant and were greeted immediately. We were asked if we had been here before and if we had any questions.  My fiance and her mom are gluten-free and it's always nice to see a restaurant that makes accommodations for that dietary restriction.  I ordered the fresco burrito and a 9 oz margarita. The food was delivered promptly and tasted great! Of course I took advantage of the salsa bar and tried everyone of them. The pico de gallo was delicious with big chunks of onion, which of course I prefer. The habanero salsa will knock your socks off but it was delicious and very flavorful.  I loved the huge selection of hot sauces to try. I wanted to try them all. This approach to burritos and tacos is very refreshing and I will definitely be back!"}
{"text":"My God, has Kent changed. They have added office buildings and a hotel to Downtown Kent. Instead of visiting Taco Tonto's like I normally would, I thought I'd check this place out after hearing good things about it.  When you order, there isn't an overhead menu that is hanging off the ceiling like at most places. They only provide you with a paper menu.  Compared to Taco Tonto's, the waiting time and taste are very similar. Both places have amazing burritos, but there are slight differences between the two. Without customizing burritos, I guess Taco Tonto's has a very, very slight edge.  However, this is where Fresco excels. They have a salsa bar that has every salsa you can think of. They even have a pineapple salsa (!!!). Their habanero salsa is extremely hot (obviously). I'd skip that and go for something milder and more exotic. They also have a hot sauce bar featuring 50 different hot sauces.  My only complaint was that only two people were working when I was there, so I had to wait to be served.  Nice addition to Kent."}
{"text":"Was excited about this place because I love tacos, but ended up leaving slightly disappointed.  Appreciate another fast casual option for this type of food.  This place has tacos, burritos, quesadillas, and taco salads so I like having more choices.  I was looking forward to the salsa bar, but in the end, I only liked one of the corn salsas.  I ended up ordering a taco salad which was pretty good, just not amazing.  The queso was alright.  You get your money's worth with the portion sizes.  It's worth going to if you want to try a new fast casual place. I'm sure kids really like the salsa bar.  I would go here over Chipotle, and it's not a bad place to have a quick lunch. But I'm not in a rush to go back."}
{"text":"Stopped in today to finally use my groupon that was about to expire.  Wish I would have tried this sooner because it's great!  My husband and I both got 3 different tacos and guacamole.  The guacamole was delicious and the tacos were amazing and flavorful.  Our favorite was the steak and cheese taco.  The service was great.  We came in behind a large group of about 10 parents/kids and were worried we'd have to wait long for our food but only took maybe 5-8 minutes for our tacos.  We will definitely be back to try out more items on the menu!"}
{"text":"Love the food here. The service is always spot on and friendly. I've never had anything bad here. In a lot of ways I think that their food is much better than Chipotle. They always have different salsas on the salsa bar."}
{"text":"Chipotle? Qudoba? Moe's? GARBAGE compared to this place. Fresh food delivered SO quickly. Tons of salsa options and the BEST queso we've ever had. Plenty of food for the price and everything was amazing. Im from the East Side, and MORE than willing to make the drive for this place. Can't rave enough!"}
{"text":"With all of the options in or around Rocky River for tex-mex (Chipotle, Qdoba, Moe's, the soon to open Bomba Tacos), I just wasn't impressed with Fresco and probably won't make a second trip any time soon. Don't get me wrong, the food was okay, but I suppose I prefer food that tastes better than okay. I like the kind of food that makes you happy you have leftovers, the kind of food that you crave and think fondly of, the kind of food you tell your friends about. I didn't get that here.    Fresco takes over the short lived Mad Tex Burgers N' Mex in the Beachcliff plaza. Walking in you've got the standard set up and decor for fast casual dining. The place is new, clean, and the staff friendly, but unless you're talking to the manager don't expect them to know much about the menu as they are still learning it so be patient. Portion sizes and prices aren't bad, you're going to pay about $7 for a Chipotle sized burrito. They do have a salsa bar, but so does Moe's in North Olmsted.   Now the food: I got the Fresco Burrito with the addition of sauteed peppers and onions. Although big, this burrito lacked flavor and left me disappointed. In addition to the rice, chicken, and sour cream, there was a very thin layer of refried beans, very little pico de gallo, MIA lettuce, MIA shredded cheese, and MIA queso fresco (those things might have been in there, but since I couldn't see them or taste them, I'm saying MIA), plus the burrito was so dry inside that I had to break open my burrito and add a couple 1.5oz containers of the fresh tasting salsa from the salsa bar. If you're getting this to-go, word of caution, they dump the chips on top of the burrito in the bag so good luck with that.   I also sampled the Pulled Pork Tacos (3 for $8) which are labeled as award wining, but I didn't see any information on what award was won? The soft tacos were better than the burrito, but I wouldn't call the meat juicy or flavorful. In regards to the Fire Roasted Poblano & Jalapeno Bites (pretty much jalapeno poppers), they had a little kick and were good with the creamy cilantro sauce. You get 5 in an order for $6.  All in all, I hate that I can't leave a better review for this family owned business, but the food was just basic and lackluster in my opinion. They are new so maybe I just came in on an off day so I might eventually try them again. Listen, I love food, and I have definitely eaten more than my fair share of dishes at hundreds of places, I just think there's a lot of competition out there with similar offerings and if I'm going to spend my money then I want something that stands apart from the rest and is full of flavor. Sorry, Fresco :(  ****UPDATE The owner reached out to me in a private message that was very polite, addressed any issues I had, and offered to make up for a mistake in my meal (apparently I was given the wrong burrito). I greatly appreciate businesses that take the time to listen to customers and truly want them to have a great experience. Because of this I am raising my two star review to a three star and will definitely be back to give the food another shot (waiting a couple months so they can settle in a bit more).  As for the award, they competed with over 25 restaurants at the Grill for Good in Kent in 2013, to win first place for their pulled pork, all the while raising over $10,000 for the Coleman Foundation, based in Kent. They got the same award in 2014 for their barbacoa."}
{"text":"Had the Cobb salad, chicken was dry tough and horrible. The restaurant was dirty, I would have had a better salad from Wendy's or Burger King for less money and the chicken taste better. I will never go back."}
{"text":"Goodbye Chipotle, Hello Fresco! Great menu, excellent flavors, healthy options, and a great salsa bar--including a seasonal spicy watermelon. Our order was taken by the owner, who was so excited to tell us his favorites. He even brought a tester of their tortilla soup to the table, which was delicious. We will definitely be back again!"}
{"text":"Been meaning to try Fresco and I was in the shopping center so I figured why not.  Fresco is a modern fast service take on Mexican food.  The decor is nice and clean with bright colors and a good feel.  At Fresco you order your food, pay and then they bring the food out in a couple of minutes.  Service was just fine, but it was a quiet day.  I ordered the Baja Fish Tacos and got 3 soft tacos with flour tortillas on a platter with a nice portion of crispy chips.   For a place like this, the presentation was very nice with the food looking good and attractively arranged.   The fried ocean perch was well prepared and very tasty, crisp breading surrounded a nice sized portion of mild fish.  The shredded cabbage added a nice crunch.  The creamy sauce was advertised as cilantro, but it was hard to taste any.    Fresco stresses its Salsa Bar and while they had a decent selection I found most of the items to lack a certain zip.   Nothing was bad, it just seemed that the flavor profiles were a bit flat.  Also the signs don't indicate how hot each salsa is, which would have been helpful.  Overall Fresco does a pretty good job at a decent price.  I would have liked a bit more risk taking in the flavors, especially when there is a Barrio location not too far away."}
{"text":"Oh my I cannot believe some of the negative reviews that I just read about Fresco!!  It blows my mind.  I guess if you don't like fresh delicious food then don't come here but otherwise you are in for a treat!!  I eat at Fresco at least two times a week and sometimes more - I'll tell you why:  Food is excellent - Oh my gosh the owner and staff really cares about how they prepare the food and more importantly they care about their recipes.  They are constantly looking to make sure that they are offering the best tasting and satisfying products out there.  If you want to explore the flavors of Fresco I would recommend getting three different tacos (it's 7.99 with chips and salsa!) the fried fish is amazing, the pulled pork are award-winning, and the Santa Fe is the best bang for the buck since it has both hard and soft shell with their delicious refried beans in between!!!  I could go on and on...  Salsa bar - OK so any regular menu item that you order comes with chips and the salsa bar is complimentary.  They have at least eight or so salsas on the daily and there is a great variety!!  If one doesn't quite fit your desires, then try mixing them!  Plus they offer seasonal salsas throughout most of the year and the menu is always improving.  The best part:  THEY ARE MADE FRESH DAILY...seriously people it makes a difference!!!  Prices - So I saw some negative comments about people thinking that Fresco is too expensive...that's bogus.  For one thing, the quality and freshness of the food alone is enough to justify the prices.  Honestly I often feel guilty paying as little as I do for this stuff!  If you don't want to spend much try a Santa Fe taco.  They are nicely filling for the price since they have two shells and beans.  They are only $3.50 and they come with chips and the salsa bar of course.  The only comparable deal like that around here is Moe's but I haven't eaten at Moe's once since I first tried Fresco...that should tell you something.  Besides tacos, the other prices may be slightly more than what you're used to at Chipotle - but you get chips and salsa complimentary, people who don't just look at you like hurry up and move, and food that is REAL.  Environment - The staff is ALWAYS friendly.  Since I am a regular I have gotten to know many of them.  They are very polite and will always listen to any concern that you may have about your order.  As I am sitting inside listening to a great mix of tunes across genres for everyone, I see and hear the staff periodically checking with all of their customers to make sure everything is good.  It's awesome.  By the way, it's so clean inside and the colors and feel to the place are very invigorating.  Plus when we aren't locked into this cold winter they have a great patio outside right on the corner.  Special Dietary Needs - My girlfriend has many dietary restrictions and Fresco accomodates her order without the slightest hint of a sigh every time.  They have all kinds of vegetarian and gluten-free options.  Ok I've spent enough time on this review - but seriously TRY IT!  If you aren't happy with something about your experience try telling the owner (his name is TJ) to his face because I guarantee that he will do what he can to make sure that you have a pleasant experience.  You could not meet a more passionate person in the biz!!!"}
{"text":"Mostly tacos and burritos, like a Chipotles but better. Had queso with ground meat and then the steak fajitas. Very good salsa bar with a nice selection, including a spicy habanero salsa. Key lime pie was good for desert. Employees were very friendly, helpful and attentive. Will come back when in the area."}
{"text":"Fresco's is the BOMB. And their \"sangrita\" is so good. I wish they were open late night."}
{"text":"We checked out Fresco Mexican Grill & Salsa Bar last Sunday and were pretty psyched as we love \"Chipotleish\" food.  From the outside Fresco is tastefully decorated and the interior is just as nice.  From the great reviews on Yelp, and the appearance of the restaurant, we were expecting good things.  Surprisingly, around noon, there was only one person in the restaurant other than us.  Guy at the counter wasn't very warm and didn't seem to care much when I mentioned the great Yelp reviews.  I order a chicken burrito with rice and cheese.  Very basic order, but another well known burrito chain can knock my socks off with this same burrito.  Sadly, white rice is not offered at Fresco.  I LOVE white rice with lime and cilantro and have a hard time understanding why this is not an option.  Mexican rice is only offered, so I get this on the side since I am typically not a huge fan.  This version proves to be so dry and unappealing - like the dryest rice I have ever tried, hands down.  Absolutely zero moisture.  I was very happy I opted to exclude this from my burrito.  We also ordered chips and Queso and even though the chips tasted like old cooking oil, I was so thankful for the Queso which was pretty decent in my opinion.  It proved to be the only thing that could save my burrito as the chicken was not fresh, was dry, and had little, if any, seasoning.  It tasted as if it had been cooked, frozen and defrosted.  I was so unimpressed that when starting to write this review I could not remember what I ate at Fresco seven days ago - thankfully I took lots of pictures which jogged my memory.  My wife tried the chicken crunchy tacos with lettuce and cheese and did not like them at all.  She was even more disappointed than I was with her major sticking point being the cheapness of the ingredients which I could totally relate to.  The taco shells, lettuce, cheese, and chicken were all just blah.  Nothing exciting about any of the ingredients.  My burrito and my wife's tacos had a GFS quality to them.  The salsa bar was a cool idea, but we tried several of the options and were unable to find even one that we liked.  Interesting note:  yesterday, in a pinch, I picked up a couple of crunchy chicken tacos from Taco Bell for my wife.  She actually commented that she thought they were better than what she had at Fresco.  Yikes...   I went back through the Yelp reviews and was unable to find one as negative as mine since April of 2016, so a lot of people are enjoying their food here so keep that in mind (I am definitely in the minority).  For me, this is one of those places you go to expecting awesome food and you leave wondering WTH everyone else is talking about (come on, all Elites have experienced this).  I am glad others are enjoying Fresco, but I won't be back."}
{"text":"Fresco is a typical fast food mexican joint, but the service and food are great! Salsa options are always plentiful and delicious!"}
{"text":"I really hate to be harsh, but that was the worst burrito I've ever attempted to eat. I say \"attempted\" because I made it about a third of the way through before I finally gave up and tossed it. We got it to go, so I didn't have any recourse for getting it fixed. It was supposed to have chicken, beans, cheese, rice and sour cream. It had chicken, beans and rice, but no cheese or sour cream, which left me with a bland, tepid, mushy mess. To make it worse, it was peppered with fatty, rubbery chicken that was literally inedible. As in, I couldn't chew it. It was like hard, chicken flavored chewing gum. I spit out more pieces than I ate. I have friends who talked about how good this place was, so maybe burritos are just a bad choice here?  Sometimes you make a bad menu choice in an otherwise solid restaurant, but I can't tell you the last time before tonight that I actually threw a meal away because it was bad.   On the plus side, the chips were good. And the place was clean, the service was great and the workers were friendly, it's just too bad this food was such a train wreck. Usually I'll give a place a few tries before making a decision but this was bad enough to be a one-and-done. There are too many other solid options in the area to keep trying here."}
{"text":"I'm not a huge chipotle fan so, I hoping Fresco wasn't anything like it. It's not, it's even better!   I got a burrito with ground beef, queso, jalapeo, & rice. The burrito was toasted which I really liked. The burrito was delicious! It was flavorful & you can the ingredients were fresh. For $6.99, you get a big burrito, chips, & unlimited salsa at the salsa bar.   The employees were super helpful & friendly. They kept checking up to make sure everyone was okay & see how we liked the food."}
{"text":"This evening my boyfriend and I decided to go to Fresco as it is extremely close to our downtown apartment. We were inspecting the menus when the owner (or manager, whatever) explained that they had specials on specific items. My boyfriend asked him what the difference between two of these items was and the he replied with (in a rude tone) \"Every item on the menu has a detailed description.\" Any time we asked a question about something, he gave the same, bratty response. So, we sit down and our food is brought to the table. Mine came with soft corn tortillas which had completely fallen apart during their preparation and yet they were still slopped on to the tray. They were messy, fell apart and impossible to eat. Normally I wouldn't  judge a place on one bad experience but during my previous visit to this establishment, I observed the same man yelling at & belittling one of his college aged employees. I understand it can be frustrating to run a business in a college town, where the average age of your employees and customers are 18-21, but we are grown adults in our 30's and this was a very unsatisfactory experience. I will not be returning and will not recommend Fresco to my friends and family. Do yourself a favor and just go to Taco Tantos, the food is way better, comparable in price and their staff is always awesome."}
{"text":"Amazing! The pulled pork tacos were awesome. Plus the salad bar is great!"}
{"text":"My family tried this for the first time tonight. The food was outstanding. The food was fresh, chips were crisp, and the salsas were mighty tasty with a large variety. Would recommend this place to anyone."}
{"text":"This place was great! I will definitely be back. Get the queso and add the ground beef. It was really good. My husband's burrito was not mixed very well, but still very tasty. I got the fresco cobb salad, which was also really good. Good service and all the food looked really good. Check it out!"}
{"text":"I ordered the fish tacos and the amount of fish in each taco was deplorable. The sauce it came with when added to the pico de gallo is fantastic, unfortunately there is just too little of what it is. At $7.99 for 3 tacos you should definitely get more fish than what I did. Also, the guy preparing my food scratched his nose with his gloves on and then kept preparing food, I noticed but didn't say anything. Next time I will, I didn't want to make a scene, but my health is worth more than asking someone to change their gloves!! Final thought: it's so so, go to taco tonto's around the corner and you will be hit with better flavor, quantity, and quality that's for sure!!"}
{"text":"Hands down one of the best Mexican grills I've ever been too. Friendly staff, great environment but better yet... Amazing, tasteful, fresh food.  I know everyone says they use fresh produce and all but you can tell fresco actually does. The mahi fish tacos are incredible. Another plus is that fresh made salsa bar which has a variety of different types of salsas. I am so glad they finally opened up a fresco around the Cleveland area!! And keep in mind, I'm not one to post a review on yelp but Fresco is worth taking the time writing about as much as it is worth trying! You will not regret it."}
{"text":"Fresh. Cheap and lots of options!  Loved the salsa bar and the portions were huge. Great lunch place or  weekday dinner place."}
{"text":"This place has become my go to when it comes time to fulfill my Americanized taco Tuesday fix. The prices are very reasonable and the salsa bar yum. Everything is prepared fresh and depending how busy they are the wait times are actually pretty short. The staff is the staff I've never had a problem (some reviews have complained) it's a step up quasi fast food place in a college town, so with that in mind I think their service is actually quite better then you'd expect.   The only negative I'll say about this place and it's not their fault is sometimes the parking situation sucks.   So if it's a Tuesday and you want tacos in Kent, there is only one place to go for my money !"}
{"text":"Stopped here while visiting friends in Kent. The Tacos were AWESOME.... Better than Taco Bell and Chipotle.. Check out the salsa bar, there's a lot of really good salsa. PLEASE COME TO ALTOONA PENNSYLVANIA!!!"}
{"text":"We loved it for fresh Mexican. We just moved here from Chicago and we love to find places like this that know good food and how to offer it in a friendly and unique way. Would highly recommend!"}
{"text":"WOW.. Real Mexican food in Ohio! For a born and raised Texas girl, this is a real treat. Don't pass up the pulled pork tacos or in any form they offer. Chips are super fresh and salsa's (salsa bar) amazing. Even though I live in FL I will be back to visit."}
{"text":"Ehh...  I really wasn't impressed. Let me start off by saying that the food isn't bad, but it also tastes not a whole lot different than any run-of-the-mill cookie cutter Mexican restaurant. Their salsas are delicious, but to me personally the food was somewhat bland without it.   I ordered the low carb burrito as a bowl with the tort on the side + guac. The portion seemed pretty small for the price. I'm wondering if I got it as a burrito option if it would have been more appropriate because the amount of ingredients I had wouldn't have been enough to fill the tortilla. I'm not a big eater, and I'm still hungry after finishing my meal. Spending $9 on a casual fast food entree and still being hungry is a pretty crummy deal. I could have went to a sit down Mexican restaurant, spent the same, on the same food, and went home with leftovers easily.   I'm also really confused as to why my low carb burrito came with a ton of tortilla chips? They're loaded with carbs. Tortilla chips are just deep fried tortillas...it makes no sense to have a low carb tortilla and then eat a normal tortilla."}
{"text":"I went here today with my best friend, and it was so good! I loved the atmosphere, and the salsa bar has pretty good variation of spicy-ness. I had a half chicken quesadilla and it was super good! Can't wait to come back."}
{"text":"Love the salsa bar!! The pulled pork tacos are really good too. They also serve alcoholic beverages."}
{"text":"I asked the girl at the counter what was best.  She recommended the pork tacos and I was very happy with them.  The salsa bar is a cute gimmick, but I'd rather have one really good salsa than ten mediocre ones."}
{"text":"Really cool spot. Great staff. Just decent on the food. Wanted to try something new while visiting Kent (heck, every time I visit there is something new). This place really catches your eye. Wasn't super busy at the time so we ordered and sat down. Had a special on frozen margaritas. They were enjoyable. Food came out pretty quickly! I got the standard burrito, while my wife got one of the salads. She really enjoyed it. Great dressing. I automatically compare every burrito to Chipotle. This one wasn't better. Not even close. The wrap was nice but inside it was just a lot of soggy iceberg lettuce and beans. Kind of like any random soft taco you might make at home. Plus maybe mine was done before the salad and the warm ingredients really didn't play well with the cold ones. It had chicken but I couldn't tell. I loved the variety of salsas at the bar. Tried a few. Verde, some Pico, an orange one.... They were just okay. Lesson. Not a burrito place."}
{"text":"All. The. Salas's.  salsa bar is such a great idea. I love to chose my own adventure.  Had a burrito and tacos. Fantastic food and love love that they have crushed ice in the soda machine. It is the little things."}
{"text":"Big thumbs up.  Great food!!  Try the Salsa picante from the salsa bar. Check it out."}
{"text":"Great fresh Mexican food. I always get the queso dip for my chips and the best chicken quesadilla. One of the best places in Kent!"}
{"text":"Been here twice, tasty food both times. Good sized portions, had a great quesadilla last time. Really love the selection of both a ton of different hot sauces and also a variety of salsas; keeps the food even more interesting! Also a really nice setup for the restaurant, very spacious inside and nice seating outside in good weather!"}
{"text":"My wife and I visited this upbeat eatery and were delighted to find a Mexican grill that offered more than burritos and bowls! The ordering process can be a surprise after waiting in line only to find no menu on or above the cashier. (You have to make your choice from their trifold takeaway menu before ordering.)  My wife ordering the Low Carb Burrito bowl and I tried the Grilled Fish Tacos.  The bowl arrived in a square shaped dish filled with chips with the good stuff hidden in the center! She found her dish fresh and enjoyable.  It is difficult to find good (non tilapia) fish tacos in Ohio, but Fresco in Kent hit a home run! Three flour tacos later I wanted more!  They also have an ample self serve salsa bar and three tier platform of specialty hot sauces for the adventurous.  Next time you are in Kent and hungry for fresh Mexican style food, Fresco will not disappoint!"}
{"text":"Their fried fish tacos are so good!  And I really love their pineapple corn salsa.  It's divine!"}
{"text":"This is my favorite fast casual Mexican place in the area. So many menu options including two different fish tacos. The pulled pork tacos are good too. My favorite item might be the the fajita Santa Fe quesadilla. The guac is excellent and fresh. It may seem pricey but the portions are generous and there's a free salsa bar."}
{"text":"I am SO HAPPY that UberEats is a thing now because I would never have tried this place.. Just because I didn't know it existed. I've ordered it 3 times now & it's been perfectly fresh & delicious each time. The burritos are huge, comparable to Chipotle. I love that they offer soft CORN tortillas; my go-to is the pork or barbacoa tacos. There is no fat on the meat. It's juicy, shredded & flavorful. I also tried the chicken burrito & the chicken was good - a good amount, not fatty or overcooked. I love the pretzel bites that come with a side of queso.. I get those every time. I wish they'd put the nacho chips you get with your order in separate packaging because they can become soggy/chewy when in a box with tacos or something else. I also usually get a side of pick de gallo to eat with the nachos because it's so fresh-tasting; I haven't tried the salsas. Also, the Baja fish taco is great. It's all great!"}
{"text":"Quickly becoming a favorite! I never gave them much of a chance with Chipotle so close but this is really different! Lots of different flavor combinations! It's a decent sized menu! The salsa bar is great I just wish the cups were a little bigger so we didn't have to continually go back up. The people that work there are VERY nice! Very welcoming and I love the fact that they bring the food out to you."}
{"text":"Reliable place for a burrito craving - hits the spot! Finding burrito/Mexican places has been a challenge since I moved here from CA so I'm glad I found Fresco Mexican Grill. This place is chill about customizing your order and they have a nice selection of salsas and hot sauces, which is key. Note: I'm vegetarian so can't speak to the meat items."}
{"text":"Enjoyed my first visit here over the weekend - I had the Fresco Burrito vegetarian style with fajita veggies added and the sour cream and cheese removed. The burrito was a good size, had great flavor, and had a nice slight crisp to the outside. I loved trying the different salsas, but some were much tastier than others.   My husband had a chicken burrito that he said was pretty bland. He wasn't impressed but said he would try it again. I MUCH preferred my veggie burrito here than at the Other Burrito Place.   My one big annoyance - I asked to leave the sour cream and cheese off my burrito but they charged me for the lettuce I requested. Seriously? I just SAVED you some money!"}
{"text":"Ordered take out. I'd give the tacos 3-3.5 stars. Tacos were pretty good, not amazing. I had 3 chicken fresco tacos, I think they were closing so it didn't seem like it was grilled fresh. Also, the chicken was missing some seasoning.  Reason for the 4 stars is the salsa bar and sauce selection. I loaded up and didn't have to feel bad about it. :)  PS- Hey management, how about you switch out the styrofoam? It's lame. It's pretty depressing knowing my takeout will be around for the next few thousand years."}
{"text":"This is a great, casual taco spot. Delicious food, friendly service and affordable. They have a happy hour too. Highly recommend."}
{"text":"Yummy! Good food! Good service! Love the salsa bar! Went with the grilled Mahi Mahi- fresh and light. Spicy cream sauce made it fabulouso -order extra!"}
{"text":"SOO GOOD! This was the first time I tried this place and loved it through and through!!   The homemade queso was to die for, I wish I got more than just a side portion, and the homemade guac was on point! So light, tasty and extremely refreshing!! Their complimentary salsa bar has a variety of salsa'a and fresh toppings (like my fav Mexican topper, cilantro) that added immensely to the whole meal! And with their complimentary chips, you can't go wrong trying them all!   For my entree- I had one beer battered fish taco, which came with this yummy white sauce! The fish did not taste overly fried or greasy; it was fresh and had a tasty crunchy slaw that went perfectly with it. I also had a ground beef fresco taco, and the meat was seasoned so well!   Everything was just so fresh and delightful, I was extremely happy with my entire experience and will most definitely come back when I'm back in town!"}
{"text":"Ate ate Fresco for the first time today, and I can't say how great of an experience it was! Staff where very kind and customer centric. The location is extremely clean and ingredients are fresh and flavorful. They definitely have a regular with me and my family!"}
{"text":"After living in Tucson for many years, I am always skeptical of Mexican restaurants. That being said, they have the most authentic tacos on Kent. I have only eaten here once, but I will be back. I wish they offered margaritas on the rocks instead of always frozen. The guacamole was great and I love a good salsa and hot sauce bar."}
{"text":"Chicken quesadilla was average, but the salsa bar was phenomenal!! Highly recommend trying it and the queso dip, very different than your typical Mexican dip. Seating are is very spaced out, which is nice, and the service was very good."}
{"text":"Ay, caramba!  For a quick and relatively inexpensive lunch this is an alright fast-casual joint to hit up. Bright colors and hip design create a cool, fun atmosphere to chow down on their selection of tacos, burritos, quesadillas, and other menu selections they offer. As far as I know this is the only location so it isn't a chain, which is perhaps the only reason why I would choose to come here over other similar fast-casual restaurants. I like supporting those just starting out, otherwise I would prefer to eat at a place that is more conscientious of their food and offer organic and naturally raised vegetables and meats.   ..lets get into the food. As far as the flavors go, I was happy with my choice of shrimp tacos but not thrilled. The food was good and I would possibly order the same meal again if that puts any depth into my feelings on it. However the chips and salsa need some help. I felt the chips were your average run of the mill corn chip - lacking flavor and possibly on the stale side. This in and of itself is easy enough to get past if the salsa bar that was offered had any options that impressed me and I could douse over my meal. Nope. Each salsa seemed to take on the flavor of whatever ingredient dominated it. There was a serious lack of spices blending and creating a complexity that most salsa's have no problem with. What was left seemed like fresh enough ingredients sitting in water. Sorry Fresco, that salsa bar needs to spend some time out west and get in touch with its roots!  Staff here is friendly and helpful with smiles and advice! Though if you ask for corn tortillas and they say they don't have them, keep in mind that the hard shell tacos are corn. ;)  To summarize, definitely stop in and see if this could be your lunch spot of choice but don't be expecting an amazing party in your mouth. This is not as good as it gets but it is good!"}
{"text":"I have to revisit my review, sadly. But this is the second time I have been to Fresco since my last review and some things need to be addressed!  First, the young adults that work here don't seem to really care about the food or the restaurant. They are kind when they are interacting but are super aloof! And they just give a terrible vibe. Last time our fajitas were burnt and we made a comment and the YA was like: yup.. And??  You should recook them. The veggies were burnt beyond edible and the meat was so dry. I chalked it up to terrible customer service last time but seems like that may be the norm here. Sadness.  This time a few things: 1. They were out of kids cups. We ordered three kids drinks. They charged us for three adult drinks because they were out of the cups. Didn't say they would charge more, just did it. No reason why a little five yr old needs a 32 ounce beverage. Just think it's courtesy to charge the same and give the larger cup. Or to at least say something before charging it. I actually said something to the girl and she was like, 'yeah? Well, we are out of the small cups.' Like I should know I would be blamed that they were out of the small cups?  Little thing. But kinda a big thing. Attitude was annoying and off putting. I don't care about the extra charge really, but I hate add ons and extra charges for no reason. I ordered something and you charged me for something else.   2. Queso came out with a layer of film. Like it had been reheated? Overheated? I brought a group of people in and spent almost $50 and was a bit embarrassed to be  bragging on this queso. I had to take it all back :( I would rather have had Taco Bell queso tonight. Scary.   The burritos were good- we did enjoy them and it was nice they were on special. Just good though- something with them seemed off. Not well constructed and seemed reheated? Not fresh?   I just hated feeling like we were burdens to the staff. Again, they were nice but treated us with disdain. What happened to the 'do you need more chips?' 'Is everything ok?' atmosphere of this place? Stinks when little things- i.e gross film on queso- could maybe have been easily fixed but with staff that is aloof I didn't even bother.   Sad to see that there weren't more people in there and also seems like the crew I brought wasn't very wowed. Such a bummer since we had 1.5 nice experiences here before (.5 for the time with the overburnt fajitas!)"}
{"text":"Hands down this place offers the best queso dip I've ever!!!! And the staff was amazing when it came to attending to our needs & maintaining a friendly aura. The manager was out on the floor busing tables, delivering food & cleaning with the rest of his staff; loads of respect to this man for not falling into the same stereo typical management fog that seems to surround most of the jerks we work with.   The food was fresh, reasonably priced and delicious. Although there was some miscommunication on the line & my order was made incorrectly, I'd definitely be willing to return to this joint. And drool all over their floor as I drown my taste buds in delicious queso dip :)"}
{"text":"I have been to Fresco a number of times since it opened in the new downtown Kent development with a mixture of good and \"meh\" experiences here so let me explain in more detail the +/-'s.   +The place itself is hip and colorful. The atmosphere is probably the best thing about Fresco and they really outdid themselves on this criterion.   + Their chips are pretty good. Not Quoba-awesome but are definitely better than most chips I've had at nearby \"Mexican\" sit down joints.  +I really like their grilled fish tacos. They come along with some special tangy cream sauce so make sure that if you do end up ordering the fish tacos, put the sauce on it. Otherwise the tacos will just be \"OK.\"  +They do have pretty decent daily specials. I usually come in on Tuesdays and Thursdays when I do for reduced taco prices & a burrito deal.   +The service and managers are very friendly!  -As someone before my review posted mentioned, their ordering system is very odd and confusing. They don't have the menu on a wall, and instead have it in 2 locations by the door and by the ordering station printed out in almost \"to-go order\" formatting pamphlets. I would be interested to know their reason by doing this method instead of putting it on a wall that would be simpler for people waiting in line to order to look above and see the options.   -Today when I came, I was waiting for 5 minutes to order. Two patrons had just ordered in front of me, and I can completely understand only having 2 people working the kitchen and ordering station together is difficult, but I was very close to  walking out the door before they noticed me standing there waiting.   -The salsas are just not good. They appear to look really tasty, but they just don't get the flavour profiles down right at all. Also, their \"hot\" salsas are mild in comparison to the hot salsas of a nearby competitor.  I can understand Midwestern taste buds are pretty tame, but if you cannot get the taste & texture down right, then your salsa is at a loss.   Overall, I think Fresco is a very good establishment, and I hope they listen to their patrons and their experiences. I think they're doing well in several categories, but some improvement needs to be tended to in their food quality & ordering system to go from a Good to \"GREAT\" place to meet with company whether it be for  lunches or late nights."}
{"text":"First time here and we will be back! Great food, prices, service and overall experience"}
{"text":"I got the Fresco burrito (pork), which comes with chips, and I tried four different salsas.    The Fresco burrito has sour cream and pico de gallo in it, which I normally love with chips, but after eating it I should have rethought it.  One or the other made the burrito slightly \"soggy\".  I ordered to go, but I ate the burrito within 3 minutes of leaving.  The burrito was had a nice crispy fried part on two sides, which was nice, but after a couple minutes the whole thing was kind of a mess (maybe the pork was too juicy too?).  The pork was good, nicely cooked, not gristle-y at all, good and tasty.    Service was very nice, quick, professional.    Salsa bar - I tried the hottest one (habenero), and it was fairly hot (I love super spicy things, so be warned), but it was a little bland, so I mixed it with their pico and a seasonal which was nice.    The building is very nice, well lit, clean looking, comfortable atmosphere, great location!  Overall, it was a good experience, but I think maybe the burrito bowl might have helped with the tortilla being soggy."}
{"text":"I've been reading about Fresco for the past few months and have heard that there is a popular location at my alma mater, Kent State. I've been hankering to try it but my fianc is pretty partial to Chipotle. Last Friday, I was able to convince her to give this place a try.   I actually liked how bright and big the restaurant was. I was kind of surprised that there was not a large menu above the ordering counter as we referenced a small menu to order. The guy who took our order was definitely a bit strange. I mean I have no problem with how some people dress and look but when you're at work and you're wearing a large bondage style looking necklace, it kind of rubs me the wrong way, especially with my 3 year old present.   After ordering our food, we decided to sit outside on the patio since it was a nice night, a great touch of the place. I went with an order of the 3 steak tacos, my fianc went with the $5 dollar special of a Fresco burrito, and my son got the kid's cheese quesadilla. To be honest, everything was just kind of bland. I really didn't feel that much of anything we ordered was fresh and it didn't seem seasoned at all, especially the super chewy steak in my tacos. The kids quesadilla was a joke, super small and surrounded by a bunch of chips. I did enjoy the queso in my tacos but that was about it.   Fresco also offers a complimentary salsa bar, which was cool but none of the salsa's really stood out. They were all watered down tomato sauce; pretty disappointing. I had high hopes for this place and even though the other staff members were friendly in coming around with our orders, I most likely won't be back. There are too many other Mexican options in the area, my opinion is to simply pass on this one."}
{"text":"Num num num! The food here is delicious, the service is great and I love the atmosphere. Think chipotle (probably not someone theyd like to compare themselves to) but locally owned and better!   The taco specials are great and my favorite is the poblano bites. The best part...no matter what you order, you get chips and an unlimited salsa bar. Salsa is homemade and changes every day!   For sure coming back! I especially love sitting in the little patio when the weather is nice."}
{"text":"I had higher expectations as our plan was to go to Barrio, but it was closed on New Year's day.  On the surface and looking at the menu, we were eager to see if we could get some yummy food from this new establishment.  We ordered one veggie burrito and one quesadilla with guac to start.  You get lots of chips!!! These are pretty nice chips.  Deep fried and lightly salted.  The guac came out quickly and was a pleasant appetizer.  Similar to something you would make at home (I would not have added as many tomatoes as the whole dip became watery).  My girlfriend secured just about ever salsa that was available...this may have been the most disappointing part of the place.  I think there was NO SALT in any of them!  I wonder if they didn't taste the salsas that day as they made them.  All of them were really bland which was a shame as we had so many chips.  The burrito and quesadilla were equally bland and disappointing.  There is a salt shaker and some sauces in the place and that helped save the meal a little, but this amount of rework should never be necessary.    My thoughts: maybe the meats and fish have lots of seasoning (SALT) and perhaps the entrees are saved with those ingredients.  Unfortunately, that doesn't make sense since the salsas were all bland as well.  There is potential here.  Someone needs to taste the food and salsas and make some adjustments.  I am not sure if we will be back.  If Bomba, Chipotle, or Barrio are open, they are MUCH better choices."}
{"text":"My one & only time there because they are closed now. Food was good service was good. We even got free cinnamon chips with whipped cream."}
{"text":"I was really impressed with this place. Right in the center of downtown Kent, Fresco is an Americanized Mexican joint with ample seating, good food, and a nice salsa bar.   My son and I are both serious fans of Mexican food in all shapes and sizes. We happen to be queso connoisseurs.   We ordered the queso and each ordered a taco. He had the normal beef and I had pulled pork. The tacos $3.50 each, came with chips and were out in about 3 minutes.   The queso was good and the chips were equally tasty. The salsa bar has about 8 options and the three that we tried (corn, tomatillo, and mild) were solid offerings.   The tacos were fine. Nothing to rave about, but nothing to complain about either. They were super nice to my little guy which always is important to me."}
{"text":"If you're looking for a place to grab lunch under $10, then look no further than Fresco! This place is easily one of my favorite places in Kent. I've been here at least a half dozen times and I highly recommend the grilled fish tacos on corn tortillas. The location is very clean and had a happy, uplifting color scheme. The way this restaurant operates is that you put your order in at the cash register and they bring it to you when it's ready.   I am subtracting one star from this review for lack of consistency. While the food is good, the appearance and portions vary. I have ordered the Cancun salad a few times and every time it looks completely different. I also have to say that if you are looking for more authentic Mexican-style tacos, then this is definitely not the locale for you. The food lacks the flavors that Mexican food embodies. While the food tastes fresh, it feels very toned down to suit less experienced palates."}
{"text":"My new favorite burrito place around town!  Grilled burrito's kinda like Tonto Taco's, but you get free chips and they have a salsa and hot sauce bar with all sorts of different kinds.  Definitely glad we checked it out and we will be back again."}
{"text":"Just ordered lunch from work thru UberEats.  We got the orders and all of our salsas are missing.   Called Fresco and let them know we were missing the salsas.   At first they argued with me as to if we were really missing them.   Yes, we checked under all the chips in all the bags, no salsa.  Then the first employee told a second employee to talk to me.  I was polite and did not raise my voice.   The second employee once again asked if it was in one of he bags.  We checked again, no salsa.  None.  He finally said, well i can take it off your bill I guess.  I'll take that, since I'm at work and only have so much time for lunch.   But you know, we are right down the street... Both folks seemed like it was a pain and that I was lying.  Being in customer service myself I was a bit disappointed.  Food was hot, but pretty dry and meh, not much seasonings it seemed like."}
{"text":"I absolutely LOVE Fresco!  First, they are clean and neat.  That's a biggie for a person like me.  Next, they have a great kid's menu.  I have two very picky eaters and my boys just love eating at Fresco.  Best of all, my husband loves this place and it's many choices in salsa.  I love their salads!  Everything is fresh and tasty.  Everything I have ever eaten here has been brought out looking just absolutely fabulous.  You can't go wrong with this place!!!"}
{"text":"Great food! They have like 10 different types of delicious salsa! Their guacamole was delicious! We locked the roasted poppers so much we had to order few more. The staff is very friendly! The burritos are pretty large and tacos are delicious. Ask for their special sauce. Its delicious. If you like spicy, try the habanero salsa. Its delicious."}
{"text":"The food is great and the atmosphere is wonderful, especially since they agreed to  remove the hot sauce with the confederate flag. There is no place in our society to have a flag with a racist, treasonous symbol in it.  It's offensive to all people.  I'm very happy they agreed to remove it."}
{"text":"I absolutely love this place. The style when you walk in the door is fun and colorful. The employees are all very attentive and nice. The bathroom is very clean which means a lot to me. Most importantly the food is solo amazing. Definitely is better then chipotle. Must must check this place out."}
{"text":"I had a quesadilla. It was one of the best i have ever had.  The staff was friendly and helpful.  The frozen sangria is delicious,  but quite strong. The salsa bar was a little underwhelming,  but it is more than made up for by everything else. I would recommend highly!"}
{"text":"The food here is always made fast and tastes fresh. They have different specials. A good variety of options and a large salsa bar. All the meals come with chips at no extra costs."}
{"text":"As Yelp puts it on their four star ratings, 'Yay! I'm a fan.' I had been meaning to try this place since they opened and finally got around to it the other night. Glad I did, as it was worth the time. I will definitely be a repeat customer.  I tried three different kinds of tacos along with the chips and guacamole. They make a good, solid guac, slightly heavy on the lime but not so much that I wouldn't get again. It was pretty great overall. The chicken soft taco was so good, and topped with salsa from the bar it took it to the next level. The pulled pork soft taco was also a tasty choice, and so good on its own that I didn't even need salsa for this one. As an added bonus, the tacos came with chips. Who knew?!? I love happy surprises like that one. And, the chips were good! Sometimes, when you get free chips, they aren't the best, and then you're all, 'oh man! I thought I was getting something awesome for free!' Don't fret, not the case here. They're awesome, and they're free!  The people working were also very friendly and helpful, and the dining room was super clean.  There were two reasons I didn't give it a full five stars: 1. No utensils. Maybe I missed them, but I searched high and low and none were found. I get that the chip is supposed to be the vehicle for the salsa, but not everyone wants to dump salsa on the taco, and sometimes you need a spoon. Or even a fork if some of the taco filling falls out and you want to put it back in.  2. The crunchy beef taco tasted decent, but the taste was pretty-much the same as any other crunchy beef taco you would get at taco bell, but with a higher quality beef. It wasn't bad by any stretch, but I would probably not get this one again.  Yelpers, if you haven't been, I would recommend you give it a whirl."}
{"text":"First time to Fresco.  The guacamole was tasty, the portion was huge, and the price was incredibly reasonable.  But the burrito concept needs to be reexamined.  I got the Slim's Burrito with chicken, a variety that includes fat free refried beans and a whole wheat tortilla.  The ratio of cheese and tortilla to chicken was way off--there was barely any chicken.  Also, the pico de gallo seemed oddly sweet.  Or perhaps it was the tortilla, or the beans?  Not sure, but there was strange sweetness to the whole dish.  The salsa bar is evidence that Fresco is dedicated to a variety of spices and flavors.  I just wish that this variety could've been incorporated into the burrito."}
{"text":"finally got to check this place out. its been around for awhile so they must be doing something right, and they are. Sometimes its nice just to order an item with out having to pick a bunch of items. i ordered up and they served it to my table which was nice. While I waited they brought over some chips and invited me over to the salsa bar, of which i really enjoy. I like trying different salsas especially hot salsa (actually hot salsa) I also go a side of queso as recommended. I def don't regret it! this quest is bomb! i got it in my burrito too, which i would caution because the cheese is strong and can over power the rest of the flavors. The burrito came, bake and wrapped. I ate it and enjoyed it. Chips are bottomless but i did not take advantage because i left more than satisfied."}
{"text":"Went there for a quick dinner last night and was pleasantly surprised - the service was quick, the food delicious, the atmosphere very youthful. I had the cheesy burrito - love that they grill their burritos, adds a bit of unexpected crunch. The queso was really, really good - highly recommend it. Will come Back again for sure!"}
{"text":"In and around River there are all sorts of taco places, big chains and local restaurants. When compared to the other taco places around, I would say this one is better! I love that they have the all sorts of choices for tortillas, flour or corn, crispy or soft. We went with the soft corn tortillas. I had the Fresco taco, the Barbacoa taco, and the grilled fish taco. All of them were simple, but done well. They didn't have exotic ingredients, but I really think that made them better. The tacos came with chips to eat with the SALSA BAR! Generally, the chips and salsa is one of the best parts of going to a Mexican restaurant, right? Well this place you get many salsa choices and you get as much as you want. This is the best idea ever. I liked all the salsas, they were flavorful. I also liked that they had an interesting assortment of hot sauces to choose from. The place was clean and the prices were fair. They also have a happy hour which I did not partake in, but seems like next time that might be fun. We will absolutely be back. Yay, tacos!"}
{"text":"I noticed Fresco Mexican Grill when I was in the Beachcliff market square area for brunch 2 weeks ago. I finally made it out this past weekend for a late lunch after work and I really enjoyed the food and service. One of the employees who was helping me (first timer here), named Miranda, was SO nice and so helpful. She literally explained EVERYTHING to me - went into detail about all of the daily specials, explained the menu, etc. etc. She clearly loves where she works and got me so excited to try the food! Anything can be made gluten free (bowl) or vegetarian (sub beans, rice, guac, and cheese) which helps cater to different diets!   I got the Fresco burrito vegetarian style (basically added rice and guac since it comes with cheese and beans) with added fajita peppers and onions and the Cinnamon chips for dessert. Miranda said she could come check in on me a little ways into my meal to see when I wanted the dessert so it wouldn't get cold and I could try it fresh - I really appreciated that!! I definitely enjoyed my burrito - very flavorful and every ingredient seemed perfectly seasoned on its own (rice and veggies in particular). It came with a ton of chips and I definitely took advantage of the salsa bar- which is color coded according to level of heat which is super helpful! I didn't try the spiciest (habanero), but tried a few of the others (salsa asada - decent but could use more flavor, salsa picanta - basic red salsa- delish, salsa verde - tangy and good, pico de gallo, and the seasonal - had some heat to it and was very good!) As far as the mexican chips go, I was pretty full about 1/2 way through my burrito, so I sampled a few of the warm cinnamon chips (basically sopapillas - fried tortilla pieces with cinnamon and sugar coating them) - absolutely delicious! perfectly sweet and paired with whipped cream mixed with cinnamon. I found myself liking it better without dipping it in the whipped cream and enjoyed the chips (AND remaining burrito) just as much served cold later at home.   Overall, I paid 11 dollars for my meal and I thought the food was definitely worth it. The friendly employees I encountered definitely made my experience immensely better. It was pretty empty when I went since it was for a late lunch, but I hope they are just as great when it's busy! I'll definitely be back to try more on the menu."}
