{"text":"I have had their smoothies before and loved them. However, we went today for lunch and I was very disappointed. I got the turkey bacon avocado wrap. The spinach wrap itself was very good but the turkey was rubbery. It came with American cheese which was the same consistency as Kraft singles and the bacon was more like a slice of ham (rubbery as well). The soup was pretty good, but we were told it was a Mexican tortilla but it was a veggie minestrone."}
{"text":"Got a yummy Protein Power Bowl - w/ chicken, spinach, avocado, black beans, tomatoes, cucumbers and sesame seeds. The citrus vinaigrette was amazing. I will definitely be back to try more bowl combos, and other items on the menu."}
{"text":"Tried an Avocado Dream recommended by my server. It was delicious! Thank you for the friendly service and smiles."}
{"text":"This restaurant is amazing! I had the portobello panini and a pitaya bowl. Both were very delicious and I would definitely eat them again. The two girls that were working were very nice and welcoming, since this was my first visit. I would definitely go again! I'm interested in trying a juice on my next visit."}
{"text":"they call it a smoothie, but is it really? more like water. priced as high as it is, i'd expect something that tastes good. but it doesn't. tastes sort of like gogurt mixed with cold water, so if you're into that, well you're in luck. additionally, the service is mediocre at best. better off throwing that $5 into a trash can. you'll prob get more satisfaction."}
{"text":"Friendly staff, fresh food, and a beautiful day. Definitely coming here again. Service was fast and they have a few tables outside that make for a nice healthier break."}
{"text":"My wife and I had amazing salads and juices here today. We will definitely be back soon."}
{"text":"Great place finally super fresh juices and yummy food. Highly recommend it for mall meal worth the price"}
{"text":"Sexy drink it was! :-) We had cool terminator (or something like that)  Carrots ginger & orange.  So R E F R E S H I N G!!!!  Loved it enjoyed it & being a big fan of juicing i felt nothing can beat the Phoenix summer heat better than the freshly squeezed cool terminator   One note abt juicing, the person who was processing was really wasting a lot od produce, either she needs better training or better juicer!!"}
{"text":"This place is not worth your time. They serve subpar quality food and brand it as healthy. Their chicken is not real chicken."}
{"text":"Dragged in here by my healthfood crazy girlfriend. I was looking forward to a nice thick steak or a rack of ribs at Westgate before a movie. She got really excited when we passed it so i reluctantly agreed to eat here. You know what? Not half bad! I had a Mediterranean panini that was pretty tasty. We'll come back,I'm sure of it. Still woulda liked my med rare new York strip..."}
{"text":"1 St time trying this new place. I am very picky when it comes to so called healthy food places. Especially in a mall food court. However this place delivers the real deal. I had a protein bowl with extra chicken kale spinach chic peas and hemp hearts. It was not only made fresh and quickly but it tasted great. Thanks for offering healthy options to a broader audience"}
{"text":"Bad coffee, small portions, doesn't seem very fresh or healthy with loaded in mayonnaise on the breakfast sandwich."}
{"text":"Got a protein bowl and Caesar salad for us.   Both were delicious.   Would come here everyday if I lived closer.   Great choices and the juice bar and smoothies that others were getting looked great too."}
{"text":"I ordered the protein bowl and it was heaven! I love the healthy options. My mom ordered a wrap and she said its the best wrap she's ever had! 10/10 recommend! We will be back."}
{"text":"I have been waiting for a place like this on the west side of town! The owners are incredible sweet and accommodate any food allergies you may have! The sandwiches, wraps and bowls are so fresh and flavorful.  This is my 3rd time coming in this week! Their smoothies so so yummy! My favorite is the Avocados and Cream, you can add a fortifier too if you like for a little extra. I haven't had anything I didn't like and will keep this lil gem as my go to spot!"}
{"text":"The sign said they had un-chicken for vegans and vegetarians. I asked the worker what the most popular vegan options were, and she suggested the Caesar chicken or pesto wrap. I asked if the Caesar dressing was vegan, she said no. I then asked if the pesto was vegan, she said no. Confused and frustrated that had I not asked, I would have been eating animal products, I settled on the southwest wrap without the cheese and sour cream and substituting the faux chicken. Then she says they don't have the fake chicken... I expected that an establishment focused on \"healthy eating\" would know the difference between a vegan and non-vegan as well as offer non-salad meal options to vegans. Ridiculous. I stop by here for smoothies all the time, and now I'm wondering how many times I was given smoothies with dairy despite asking for non-dairy. I can no longer trust this establishment, so I'll be sticking to Panera at the mall from now on."}
{"text":"Great healthy food. Smoothies are amazing and breakfast sandwich was fresh and refreshing!"}
{"text":"We come here frequently. Not many places to get a quick, healthier meal. I love the turkey avocado and the smoothies are really good. The cappuccino is my favorite. The service is good most of the time."}
{"text":"Little kiosk in the middle of the food court. Across from Panera. They have a pretty solid menu. I, myself ordered a full Panini. My wife ordered  1/2 a wrap. She was disappointed by the size of the wrap, even though yes it was half of a wrap. I think maybe the sizes for wraps should say \"Snack\" and \"Whole\" they do have nice healthy choices. That's what's going for them. I ordered a southwestern Panini, everything that wasn't the bread was flavorful, the bread left a little to be desired. I would have loved it more had it been a fluffier bread. It seemed a little thick, maybe even dry. I would definitely go back because it was good. But until I return this review will sit at 3 stars."}
{"text":"I like to swing by at this kiosk in the mall to get my husband something. Today, I'm a bit disappointed as the cashier messed up my order for a fresh squeeze juice with ingredients are as follows:  - Ginger - Kale - Cucumber - Celery - Apple - Lemon  I wrote it down on my palm to make sure I won't forget it, after 15-20 mins of waiting, I saw my large juice colored red. Like really red! I suspected they put beets. I told the other girl who made it she said there was beets on the slip she received. Well obviously, the cashier (short girl who wears a pair of red eyeglasses wasn't paying attention when she took my order). I felt bad for the other girl who was assign to make the juice as it wasn't her fault, she was just following instruction. And take note, I told her no crushed ice but the juice had some in it.   The girl who made the juice was fine to correct the mistake right away and offered me a new one. Another 15-20 minutes of waiting again. Kudos to her! I hate people on the frontline that do not pay attention and cashier never repeated my order, just nod and took my order. And for the cashier? She needs to pay attention and always, always repeat the order.  And oh to the management - Please make sure to let these girls wear some hairnet. For crying out loud, they are handling food! At least in my country most of the people that works in the food industry (those who prepares the food) wears hair net!   ***Update 3/3/17*** By the way, my husband loves his mean green juice! Another KUDOS to the girl who made it!"}
{"text":"I was recommended this place by my dad who had an awesome experience with this place. Unfortunately, I ordered the pineapple smoothie which wasn't the best choice. It had an odd flavor and didn't taste refreshing at all. However, I had a taste of the smoothies my two friends had (peach and strawberry/banana) and they were AMAZING! I will need to come back and update my review next time!"}
{"text":"I have eaten at FHC several times now. I often remark when I am in there how little business they have. I think, perhaps their lunch crowd is holding this place up. After all I am sure that overhead in Westgate is obscene. Especially for a small business.   I continue to go frequent the place, as I like the turkey bacon avocado panini, and my wife enjoys the protein bowls.   I have made my last visit though. I was particularly turned off during my last visit. The store is open until 10 PM, but upon arriving I was told that only smoothies were available. I looked at my watch and it was 9:10 PM. Unfortunately for myself and FHC, I did not want a smoothie. I wanted a delicious turkey bacon avocado panini.   I have worked at numerous restaurants and bars. Unless otherwise stated everything is available until exactly when the restaurant or bar closes. I have no idea if this was a rogue employee who wanted to get on with their evening after being slow and cleaning almost everything up, or store policy. It may be stated somewhere, and I just didn't see it on this trip or any other trip....HOWEVER.... I see this business as one that is not long for Westgate. People want to go feed their fat carcasses fried foods and liquor on the weekends. Not eat a healthy protein bowl.   Which makes this all the more surprising when you are turning away one of 42 people in the Phoenix area that wants to eat healthy, albeit later than most.   If you can get someone to serve you food in here, it is pretty tasty and healthy. However I won't be back, and before long FHC you will be gone. When I stroll by I will be conflicted. I will be forced to eat something unhealthy in the area, but you and your food peep show (where I can look but not consume) will be long gone. All my hard earned money will be given to all the places that are dying to take my money and put any amount of fried food, and animal hooves I can afford into a giant sling shot and blast it at my mouth. All the while cackling about how much business they have, and how much money they are making.   Meanwhile you will have squandered your life savings and wonder, why wasn't that restaurant more successful? Here is a hot tip... Restaurants that don't feed people aren't restaurants. You are a smoothie bar pretending to be a restaurant. Take your smoothie bar elsewhere.   FRESH HEALTHY CAFE YOU ARE DISMISSED!"}
{"text":"Love this place! I've had a lot of different drinks but my favorite by far is the avocado dream. I never leave westgate without stopping here. I really want to try their power bowls. My daughter loves the kids meal there, her fav being the pb and j roll. I think they are a little pricey which is my only complaint but hey, at least it's not as fattening as everything else in the plaza"}
{"text":"Thought I'd try this place after arriving in town for business.  Ordered the protein bowl- what you get is a bit misleading from the photos on the menu.  The choice of protein is not on a bed of quinoa with other veg toppings, rather a small portion of each of your choices put in a \"to go\" carton.  The food seemed fresh, but nothing stood out since ingredients are what one can do at home.  Seems understaffed with only one person working- food prep, cashier, smoothies, etc.  Had to wait quite a while before she could take my order."}
{"text":"first time here...very bright and light atmosphere.  breakfast egg muffin was good and they had a great choice for smoothies, food and they now serve alcohol!!!  guess they need to change their yelp page.  they also had a nice small seating area outside.  staff was friendly.  will definitely be back!!"}
{"text":"Nice signs for healthy, organic, detox...walk in and signs says \"now serving bud light\". My bad for not walking out then. Ordered a breakfast sandwich combo. Got charged twice for my coffee. Another testament to their healthy vibe...mini moos for creamer. Get my breakfast sandwich and it's missing the turkey bacon I added on and it's served on a white English muffin. My bad again for assuming that a healthy cafe would serve a whole wheat muffin instead a of a white one. Maybe my standards are too high but I expect more than mini moos and a white English muffin from a healthy cafe."}
{"text":"VERY poor customer service. Ran out wheatgrass & blueberries for the bowls. He would not substitute any other fruit because he said they were frozen for smoothies. Our juice tasted unbalanced & didn't taste good. A BIG disappointment."}
{"text":"Went to this Juice bar/cafe and was told they wouldn't make juice because \"it takes too long.\" We won't be going back."}
{"text":"This place is incredible!  We've had the protein bowls a few times and NEVER disappointed. We've had wheat grass, natural waters, smoothies and it's always on point. This is our favorite place to stop at when we go to Westgate. Plus they give a military discount too, so that's always appreciated. Will be back soon!"}
{"text":"This place is phenomenal! One of the only places to go in Glendale if you're looking for creative healthy food. Juices and smoothies are great, try the pomegranate blueberry! If you're looking for a hardy meal try the protein bowl, it's filling, healthy, and delicious! The staff is also incredibly friendly and helpful."}
{"text":"Food products are good, but service is slow and unprofessional. I ordered a wrap and the teen was so busy texting, she rung up the wrong sandwich. Moreover, my napkin and fork were afterthoughts. Lastly, she totaled me out before I could tell her that I wanted to buy more stuff. She didn't take advantage of any upsell opportunities. The owner needs to get the staff in line."}
{"text":"This place is so fresh and delicious, I actually felt lighter after eating here. They have a great selection. I got the turkey bacon avocado panini and the chunky monkey smoothy and was so satisfied. And the prices are ridiculously affordable for being so fresh and healthy. I will most definitely be back!"}
{"text":"My co-workers and I went to this place for lunch this week, I ordered the 16oz lemonade drink along with a full Chicken Caesar Wrap. The best lemonade drink I've had this year, as for the Chicken Caesar Wrap, it was delicious enjoyed the Creamy and crunchy Chicken the croutons, fresh tomato, olives and parmesan cheese was delicious!"}
{"text":"The smoothies are super yummy and are full of good things for you, or so you think! There's actually quite a lot of sugar in these smoothies. However, you probably didn't come to the food court at the mall to be healthy. So TREAT YOSELF.   I really like the caribbean smoothie. The guava juice is something that is kind of unusual. The smoothie is not too sweet, but a little tangy! I like it a lot, but not enough to constantly spend 5-6 dollars per smoothie. Every once in a while when I'm feeling like I deserve a treat or having a bad shopping day, I'll swing by. But, really, Giant Eagle is right down the street and I can get a Naked juice or something similar for a whole lot cheaper."}
{"text":"We love this little gem! Try the Avocado smoothie.. You won't be disappointed!!! Wraps are healthy and delicious and they have an amazing pesto. Service is always friendly and HONEST."}
{"text":"Fresh Healthy Cafe is situated in a small kiosk located in the midway between Panera and Mitchell's Ice Cream at the Westfield South Park mall in Strongsville. Menu items feature healthy fare such as wraps, paninis, quesadillas and smoothies.   I visit this mall frequently, but yesterday was the first time I had ever gotten food from Fresh Healthy Cafe.   Since Fresh Healthy Cafe is in the Food Court area of Westfield mall, it doesn't have its own seating. There are dozens of tables and chairs all over the Food Court, including several near this cafe. There are bright, colorful, easy-to-read menus in front of the register that conveniently detail all their menu items.   I ordered an Asian chicken panini and my husband ordered the 4-cheese quesadilla. The food was tasty, but portions were on the small side. No sides were included with my panini. The quesadilla came with small cups of salsa and sour cream. We also ordered a pineapple punch smoothie and a tropical smoothie. Those were very good, as well.   The cashier who took our order was friendly and courteous. It did not take very long for our food + drinks to be ready. (We were the only ones on line at the time)   Our total bill came to about $23 (quesadilla, panini + 2 large smoothies).   While the food is tasty, the portions are small and I don't know if I'd want to plunk down $20+ for 2 people to dine here. It is a good option if you're looking for healthy food at the mall."}
{"text":"Just went here for the first time after a workout at the gym and it was delicious! I got the protein bowl with quinoa, chicken breast, chickpeas, kale, red peppers and cucumbers with citrus vinegrette. It was a little small for $7 but it was surprisingly filling. I finished with a smoothie and now I'm stuffed. I would definitely recommend this place to others!"}
{"text":"First time at this place and it was great. Very clean restaurant and the staff was nice & friendly. I had the kale Caesar salad w/ chicken and I'm glad I got the full size because it was yummy. Now please open a store in or close to Buckeye. :)"}
{"text":"Came in here last week with my boyfriend to avoid the calories from chipolte across the way and i was extremly satisfied. I got a protien bowl and was only able to eat half and save the rest for later that day. A little bit pricy but it was definitly worth it. Clean location and a friendly, patient staff were a huge bonus. They waited patiently for me to look over the entire menu unlike chipoltes workers who stood there rolling their eyes at my boyfriend.will definitly be back :)"}
{"text":"Not even sure about what the food tastes like, we have waited thirty minutes to get two paninis and although I have walked into the cafe from the patio three times to check the counter to see if our food is ready, no one has said a word to me about the wait time. Terrible customer service and not a single person even greeted us or smiled when we came in and ordered."}
{"text":"I was town for a work conference and I was DYING for an açaí bowl. I wanted to find a place within walking distance and I was excited to see Fresh Healthy Cafe! I walked across the street with high hopes. The customer service was okay. The açaí bowl was absolutely disgusting. No flavor, watered down, and the bananas were mushy. I couldn't even finish it. It was like a fruit soup before I got 5 bites in. I threw over half of it away and went elsewhere. I left dissatisfied and pissed off that I spent $8 for absolute garbage."}
{"text":"LOVE this place so much! The wraps & smoothies are phenomenal! I always stick with their asian wrap & my husband enjoys the bacon/turkey wrap. The kids meal is a great deal as it comes with a kids smoothie as well! I do wish they had gluten free wraps/bread but maybe that will be something they will add!"}
{"text":"Place is definitely not closed here in the Robinson Mall!  I got an acai bowl. So tasty! Definitely fresh! Lots of flavor! My friend got a turkey pesto panini. Smells so good and she says it's really good. She also got an acai mega berry smoothie- yummy!!  Definitely worth eating here over the unhealthy choices in the mall!"}
{"text":"I have eaten here twice and it's becoming my go-to place to eat before I go to class at DeVry/Keller. The owners are extremely welcoming and helpful with the menu. It's great that they cater to allergies and food sensitivities and accommodate to dietary restrictions.  I've had the Portobello and Hummus sandwiches on gluten-free bread and they're both delicious. Don't be surprised if the gluten-free sandwiches come small for the price, but if you get a combo with the smoothie, it's enough to keep you feeling full.   The Chunky Monkey and Avocados and Cream are to die for! They have different kinds of milk like soy milk or almond milk. I literally had a Ratatouille moment when I drank the Avocados and Cream. You know from the movie, where one taste takes you back to your childhood because it's such a positive and delicious experience?  I totally recommend this place because it's a healthier alternative among the plethora of fast food and restaurants at Westgate. Try Fresh Health Cafe now!"}
{"text":"I got the Asian chicken wrap which was very good. However, my husband was extremely disappointed with his tuna melt panini sandwich.  It was very skimpy on the tuna and very heavy on the bread. Happily we had a coupon, so didn't feel as bad about it as we would have at their regular prices."}
{"text":"We ate here a few times while at a conference. I was terribly sick with a cold and the flu and so the smoothies were a godsend and were delicious. The breakfast sandwich wasn't very good but the breakfast bowl my wife got was great. Overall, I'd eat here every day if I could because it's a healthy alternative to all of the brewery/grilles around!"}
{"text":"I usually stop here everytime Im shopping at Beachwood Mall. The smoothies are delicious. I usually order the Jolly Green Kiwi super smoothie or the Caribbean Splash. It's a healthier option than what they offer at the food court."}
{"text":"Great service and fresh good food. I enjoy the smoothies as well! What a great place to get a healthy meal breakfast, lunch or dinner."}
{"text":"Really good smoothies. My favorite is the Caribbean splash. I have a banana allergy so it's difficult for me to find smoothies anywhere that don't have banana, they do. Which is a great relief for me because I love smoothies. They also make pretty good fresh juices. I haven't tried any of their food though to be honest."}
{"text":"Love this place! Salads are amazing!!! I ordered the Turkey Bacon avocado salad! Taste really fresh!"}
{"text":"So we love fresh juices, especially green juice. We came to this place at 9:08 PM. The lady says they took apart the juicer and can't put it back together. Sad because I'm sure this place is good if it wasn't for lazy workers. Just sayin. Shouldn't break stuff down early and keep your doors open at the same time."}
{"text":"Nice little cafe for drinks and smoothies, the employees were pretty nice and it was really good as expected. Defiantly may come here again but 4 stars because I had to wait a little long for my smoothie and it took longer than I expected a place like this to make a smoothie..."}
{"text":"Nice alternative to all the junk food around it.  The protein power bowls are healthy and filling.  The citrus ginger dressing is delicous.  The lemonade and teas are yummy.  I had peach juice added to my tea.  Good value for the price.  You can actually spend less than $10 and get a healthy meal.  I would have liked it if the employees were more welcoming.  We were the only customers in the building and were not greeted."}
{"text":"Fresh Healthy Cafe is a little kiosk located in the middle of the SouthPark Mall food court and is probably your best healthy option when compared to the likes of the other vendors available (save for perhaps Panera).  A selection of fruit smoothies and paninis (or wraps) are available, as well as fresh juices, salads and power bowls consisting of granola, fruit puree, and fresh fruit.  Half of a panini with a medium-size smoothie was more than enough to curb my late lunch appetite. Fresh ingredients and great flavor combinations.   Fresh Healthy Cafe is a great alternative for a meal on the go while shopping at the mall."}
{"text":"Ehh... After finding a parking spot for this place took me forever it was not worth my time! Disappointed with the service and the smoothie was average! Don't waste your time parking 2 miles away to get disappointed when there are better options out there!"}
{"text":"Trying to eat out when you're on a diet is a bear.  Tried Fresh Healthy since I forgot my lunch.  Calorie counts are relatively low, food tasted good.  It's worth another shot.  I had the Turkey bacon avocado panini.  A whole one is 630 calories, but I figured I was getting whole grain and some healthy fat so I pulled the trigger.  They weren't busy, so I didn't feel rushed picking what I wanted.  They handed me a pamphlet with the calorie counts when I asked about nutritional content.    Next time I'll do the build your own protein bowl.  I'll update the review then."}
{"text":"Warning never order a protein shake from this place! So I'm tracking via fitness pal and needed to see some numbers so I can add to my daily log.  I asked to see the nutritional info of the protein after I purchased one and found out after they showed me the container that the whey protein they use is only 10 grams. So I thought ok I can work with this and asked a few more questions. Overall I come to find out the scoop they have to use wasn't the one that came with the protein. I'm assuming it comes with one that's about a quarter of a cup.  Instead they use a teaspoon! False advertising for what we call a protein shake. I asked how much will it cost for more and it's 50 cents for an additional teaspoon.  The 3 people working at the time were great and understood when I asked for my money back."}
{"text":"This place is amazing, J the owner is very friendly and can help you make a decision on the menu. Since I found this place my fiancé and I have been coming back here every other day for smoothies and great wraps!"}
{"text":"Needed some lunch before a Coyotes game and this place fit the bill of \"decent, and not a bar\".  Never a bad idea to eat healthy, especially when you've got beers and stadium food on the horizon. The Asian chicken wrap was tasty. Not much more to say...there are plenty of food options around here, but this is solid for the healthier side."}
{"text":"I had raspberry blast it was tasty. I would buy another. But the girl who ran the cash register was sitting on the counter playing on her phone."}
{"text":"A great alternative to the typically mall food court options. I ordered the fresh greens salad with chicken and the green lemonade fresh squeezed juice. I really enjoyed the juice. It was nice and fresh and the mix of ingredients went well together. I wasn't fond of the salad though. It was expensive and small. The amount of chicken was also disappointing. I tried a few smoothie samples they were giving out. They were all really good. I'll be back to try some other juices or maybe a smoothie next time!"}
{"text":"The crepe was ok. The service was terrible we stood at the register waiting to buy food while the girl finished her texting session. Probably 6 people working- all with an attitude."}
{"text":"I came here once when they first opened. I got a mango smoothie and my boyfriend got a protein bowl. My smoothie was really good, but it was over $5 for a small. The bowl though, wasn't that good. He had 4 veggies, hummus as the protein, and I forgot what else. All I remember was the hummus coming in this small sauce container. Disappointing.   So then I never went back, until a couple days ago. I finished my workout and thought I'll eat something healthy...ah, what about fresh healthy cafe? That sounds healthy, and if I just put the ingredients I like into my bowl, it'd be good! So I drove over and got the protein bowl w/ chicken breast, black beans, spinach, kale, and chickpeas. Well, black olives ended up in my bowl, which I do not like at all. So I went back to the girl and she picked it up and gave me black beans. She was apologetic and I'm fine. I kept eating, and saw a piece of chicken breast had pink stuff all over it. So I set that aside and found a piece that didn't. I bit into it and it had those chicken veins in it still and it just did not taste like chicken breast. It's like those cheap \"chicken breast strips\" you get in the frozen aisle. So, with that said.....I'm not spending my money here anymore."}
{"text":"Workers seemed very confused when asked about a lite smoothie was when it was advertised on the board. Only one lady really knew what was going on and how to operate everything. Also,  fairly certain my wife and I got the same smoothie when we ordered different items. I can't speak to the food though. Overall the quality of my smoothie was average."}
{"text":"First timer today at Fresh Healthy Café! The service was wonderful and I tried the Pitaya bowl! Fresh ingredients and it was delicious! I recommend everyone give this place a try!"}
{"text":"I ordered the apple harvest chicken (which I usually get) and when I opened it up it was fairly empty and had no spinach--which it typically does. I called to complain and the girl tried to convince me that they don't put spinach on it. All their menus says it has spinach on it so I'm not sure why she was saying this. They offered to replace it but the girl was very rude about it. The owner is a nice guy but some of the people that work here are rude and incompetent. Wouldn't recommend."}
{"text":"Love this place!! JJ is an awesome guy and runs a great little cafe specializing in gourmet coffee, wraps, bowls, and smoothies just to name a few! Stop by on your lunch break and give them a try!"}
{"text":"It's been quite a while since I've been pleasantly surprised by the simple quality of the food provided by such a random little restaurant. I have to admit my expectations were pretty low when I decided to give Fresh a try. I figured it would just be another spot that served \"healthier\" meals; meaning smaller portions at higher prices. Yes, the prices are a little high. But the payoff is a fantastic little panini or wrap, made with higher quality ingredients, that kept me satisfied for hours.  If you're looking for a bite to eat before an event at the stadium or arena, Fresh is a fantastic alternative in the vast array of traditional fast-food and full-service restaurants that make up Westgate."}
{"text":"I ordered kale salad and added hummus on the side.  When I got my order I asked what kind of dressing they had.  The male server kept saying it's in the bag.  I said no that's the hummus I paid extra for.  A woman server comes up and asks me \"what's my problem.\" I said I want salad dressing what kind do you have? I  the man makes the dressing and hands it to her.  She dropped it on the FLOOR and PICKED IT UP and Tried to hand it to me with NO hesitation!!  She got an attitude because I didn't want it from the FLOOR.  The owner witness it happen and said nothing.  I asked to speak with him and THEN he apologized.  She and the rest of the team, including the manager and owner did not look surprised.  The kale was turning yellow and they left the stalks.  I had an Unacceptable experience which Completely Ruined my appetite.  I will never return!!"}
{"text":"Slowwwwww, NOT healthy. Ingredients are not fresh, recipes are with added sugar. Crepe came out to dry and hard. The staff is clearly clueless..."}
{"text":"It seems lunch time is not the time to go to this place. There was only one staff member working who had to man the register and entrees. Myself and several other customers ordered food and waited for eternity. However we got the watered down \"real fruit\" juice. Yuck! Myself and others had no time to wait for our lunch and had to ask to refund our money."}
{"text":"I was in the mall yesterday during lunch and noticed this place. There was no line - yet Subway, chik filet, Villa pizza etc were packed. So I was wary.   I noticed on the menu that they have a kale hummus wrap so I tried it.  It was awesome!!  It had the right portions of everything, and I felt great after eating it.  This was a total surprise to me, especially for a mall food court. I hope they open more locations!"}
{"text":"The workers had a terrible attitude, did not know what they were making, or how to make the smoothies. It was awkward, and only one woman appeared to know what she was doing. Ended up getting the pomegranate smoothie... my husband ordered a different one but I'm pretty positive he also got the pomegranate one in the end since I think they throw all of the ingredients into one blender and hope for the best. Very disorganized and poorly run. I hope someone else steps in because it has potential."}
{"text":"I tried this today for the first time. I got a chunky monkey smoothie and it was beyond awesome. It's a fair price for the quality of what you are getting. The staff is extremely nice and the owner is awesome. I will be back for more!!!"}
{"text":"Mediterranean wrap was awesome!! Very nice and friendly. The service was just as good as the food."}
{"text":"Very healthy options for a fast food stop. The only complaint would be that the lines are always so long."}
{"text":"The place only deserves 2 stars because of the young man that helped me today. We were not greeted by the girl who was at the counter, she did not say a single word when it was our turn to order...so as we were giving our first order, she stopped and started making it, without asking for a size and without telling us that they were out of bananas (which btw was one of the main ingredient in the shake), did not complete our order and completely ignored us. Just to be clear it was not busy at all, we were the only costumers left in the joint and two other employees were there with her too. Finally another worker noticed that we were just left standing at the counter and continued to help us, gave us al the info and complete our order. The smoothies that we got sucked! And I'm not saying that because of the bad service, I mean...ingredients were missing, it did not taste healthy at all. it's almost like they butchered the healthy part with some extra sweetener because they did not have all ingredients on hand. This is the last time I'm going to the place."}
{"text":"I was at Westgate to meet my grandma for a movie and decided to grab a bite to eat first. I was excited when I saw Fresh amongst the other options there because I had just completed a yoga sesh and wanted something healthy to grub on.  Their vibe IS \"fresh\", like Jamba Juice-esque. Service was good. Unfortunately, though, I wasn't too impressed with the food. I ordered the Turkey Bacon Avocado Wrap and it was good, but definitely nothing special. Too much lettuce, not enough meat, clumps of cheese, the ratio was just off.  A side note was that their outside patio tables are SO wobbly I couldn't even rest my forearms on it without it tipping over. I checked another table because I thought maybe it was just mine, but it was the same. Super annoying.  I might try them again if I'm in the area because it's a healthier option, but don't expect to be blown away by your meal."}
{"text":"Maybe good for food (haven't tried, but likely won't)...but very disappointing for protein shakes. In a nutshell both the trainer and the guy at the register didn't know what went in the shake, which I thought was strange. They \"figured\" it out but it came out really runny...the trainer said put some in the another cup so she could try it. She did and then they put the lid on my cup and gave me water with protein powder in it. Literally couldn't stomach it.  Besides the fact the I was charged more then the menu listed, which I didn't question, I spent $7 on a smoothie just to throw it away in the garbage outside...bummer cause I was hoping this would be a better spot."}
{"text":"Very careless workers who are never in the best spirits and also they take FOREVER to make the food and smoothies!! Waited for a crepe for 20 mins!! Might as well go to a sit down dinner at that point! Don't recommend. Also they close 30 mins before they actually close so don't waste your time going any time near 9"}
{"text":"So yummy! It's awesome to have a healthy alternative here at westgate. I had the protein bowl and it was fab.  We will be back!"}
{"text":"I had their turkey pesto panini and a sample of their pineapple/kale smoothie while waiting.  I can honestly say that it is so great to have healthy options when you're at the mall, excited to check out more items in the future."}
{"text":"Love this place. Thanks for providing goodness to me and my body. Everything I order is delish. Have a Tennis tournament tonight and heading over with my boyfriend after to get something tasty and healthy. Grateful that they are open past 8pm. One of our favorite places!"}
{"text":"I love Fresh Healthy Cafe because it's one of the very few healthy options at Westgate. I always order Beach Salad and Kale Pineapple as my meal. Delicious and Nutritious!!! And the service here is really good as well. The staffs are really kind and nice."}
{"text":"I was in the Westgate area for an entire weekend, thanks to my fangirling at a convention for a TV show. By the second day of the con, I was in need of something healthy. While walking to a different restaurant, I spotted Fresh & Healthy. I stepped inside and was happy to find that they offered vegan options, including vegan \"chicken,\" which they call un'chicken. I decided to eat here instead.  I ordered a protein bowl. It comes with warm quinoa as the base, then you add one protein, pick 4 veggies from the list, one nut or seed (if you want), and dressing. I got the un'chicken, added spinach, kale, black beans, jalapeños, and I also added avocado for only 75 cents more.  On my first visit I got hemp seeds and balsamic vinaigrette. On my second visit, I got the same protein bowl, but with sesame seeds and their citrus vinaigrette.  The citrus vinaigrette is by far my favorite, but I wish they gave you more. I didn't have enough of the dressing for my bowl.  Both of their vinaigrettes are vegan-friendly.   The protein bowls don't look big, but they are packed with your ingredients of choice, and it energized me for the rest of the day.    The first time I went, I didn't feel very welcomed and I wasn't given a utensil with which I could eat my bowl.  On the second visit (the very next day), I had great service. I was doing a lunch run, so after placing and paying for my order, I ran next door to pick up a friend's lunch. When I came out, a Fresh & Healthy employee was standing outside (in the blistering AZ heat!!) with my food in his hand.  This above and beyond gesture earned them the extra star!  I am so happy to know that this healthy option is in this area. I didn't get to try their smoothies, but the flavor descriptions looked great. I will definitely return to this cafe the next time that I'm in this area."}
{"text":"The wraps and smoothies were delicious. The young man working behind the counter by himself was a machine!! He greeted everyone walking in and knew a few by name. We are there at lunchtime and we saw the other restaurant's employees in the area eating here as well."}
{"text":"When here yesterday for lunch for a he first time, we are going wheat free. This place was great! Their BLT was yummy!!"}
{"text":"Love this new place.  Too bad this is the only location they have around Western PA.  As the name suggests, they offer fresh premium ingredients and healthier food options such as wraps, salads, paninis, smoothies, acai bowls, etc.  I've only tried their strawberry banana supreme, carribean splash, and chunky monkey smoothies and they were all delicious!  One thing I like is that their smoothies definitely taste like they are made of fresh fruits and  the consistency is definitely blended not like slushies.    You can also add what they call \"fortifiers\" in your drink such as whey protein, vitamins, flaxseed, etc., and cut down calories by trying a lite blend.  I also noticed that they use agave nectar on some drinks instead of sugar.  Just looking at the ingredients make me feel like I'm already healthy, and supposedly, they use ecofriendly containers so that's also a plus.  Also, The staff is very friendly and attentive."}
{"text":"Excellent smoothies, but stop making samples when there are 15 people waiting for the drinks they already paid for! Very annoying standing here watching one guy continue to make samples while we've been waiting for almost 15 minutes. Get your act together!"}
{"text":"It's hard to diet when your favorite exercise is chewing.  Another good exercise is retail therapy.  My girlfriend and I were ready for a full day of putting the hurt on some credit cards and we decided to start the day right with some healthy eats.  I ordered a Tuna Melt Panini and a Fountain of Youth Blueberry smoothie.  So my Tuna Melt panini had tuna salad, romaine lettuce, cheddar, tomato, and red onions.  The panini was perfectly toasty and it had a lot of good stuff inside.  It was also huge and I really should have split it with Jannette.  I ended up eating half and stuck the other half in my purse.  Purse-food while shopping makes sense, okay?  My Fountain of Youth Blueberry had apples and blueberries and you know what that means --- I was full of antioxidants and dietary fiber!  It was tasty and I was happy.  I also had like half of Jannette's Beet Punch which was also insanely good.  Fresh healthy eats for a decent price point, I dig.  It's one of the lighter and healthier eats offered in the Westgate area.  Service is a little slow so don't come in if you're in a rush.  Do come in if you want to be kind to your tastebuds and waistline!"}
{"text":"Awful. We chose this restaurant as a healthy start to our road trip. Ironically, the food is so bad that I'm leaving hungry & will need to fill up on chips.   Don't bother getting a gluten-free Panini. The bread falls apart & leaves you with a luke warm, barely edible mess. The chicken was rubbery and gross.  I didn't realize we were supposed to bus our own tables because the trash bins are hidden. That is until I was waiting for the bathroom & the employee passive-aggressively asked, \"Did you want me to help you get your trash?\"   Oh, and the bathrooms are FILTHY. Do not eat here!!! I almost never give one stars but this was overpriced, dirty, unpleasant and nasty."}
{"text":"This place has gone downhill quickly. Asked for a juice recommendation for detox and the cashier said \"uh, not really\". The A/C isn't on and it feels to be about 85 degrees inside, can't be good for a sanitary food environment. It's unfortunate that folks looking for healthy choices don't have a good option here at Westgate."}
{"text":"This place was perfect on a hot day in Glendale! Lots of awesome smoothies and fresh greens. Had the Beach Salad~ so good! Good healthy alternative to all the crap out there! Kale/Pineapple smoothie was my favorite! Great staff helped with recommendations. When back in the area, we will go back! Highly recommend!"}
