{"text":"Rating for bad food bad and rude service and for removing my last review. I thought yelp is the place where bad reviews don't get deleted. SHAME"}
{"text":"2 stars for the location and setting. food was not amazing- I had the short ribs for $33 it took forever to come out and was not worth the price tag. Kale Caesar was good, crab cakes were alright...The waiters are friendly and informative but not too attentive. It took me forever to receive my bill and even longer to get my food wrapped to go. The hosts at the front of the restaurant got my food and left it behind them to tend to customers coming in...How can you run a celebrity chef + celebrity owned restaurant and have clueless, lazy staff running around? My whole dining experience there was a waiting game and left me with absolutely no interest in coming back. I will never go back there. It does not live up to the hype whatsoever....maybe the drinks at the bar were good from what I saw but definitely mediocre food. For ribs, salad and crab cakes my bill came to $85 all in...I wish I went to the Keg instead."}
{"text":"I would have given this restaurant a much better review had it not been for our waiter.  We were a group of 7; the waiter suggested we should order a chef selection, which would start at only $65 per person.  We told him that we would prefer to order individually. The waiter said that he didn't recommend that and that he could not promise that we would all get our entrees at once since the kitchen was more set up for a chef selection type meal.  Now I have eaten at many restaurants all over the world and that story was a first.  We persevered with ordering our meals separately.  One of our party was a little late arriving, so we ordered some appetizers for the table.  The waiter kept telling us that we should order our main courses soon because they needed to \"turn tables\" and as such we only had 2 hours to eat before the next party would arrive.  We told him that our late party was arriving any minute, but he still suggested that we order without him (even though all of our appetizers hadn't arrived yet).   We were told 3 times that we had to hurry so that they could accommodate the next table settings.    The meals came, one was about 5 minutes later than the others.  A couple of our drinks never came or were incorrect.  Other tables drinks were delivered to our table mistakenly. Once our meal was finished the waiter was pretty lethargic offering us desert or coffee.    I will say the food was excellent and the ambiance was great.  We ended up leaving just after 9:00 pm and couldn't help but notice a few empty tables and no one lining up to get at our table. I am probably inclined to conclude that we just had a poor waiter, but it really left a bad taste (so to speak) with everyone in our group.  The only good thing for the waiter was the automatic 18% gratuity levied on our bill because of our huge group of 7 (used to start at groups of 8's) - he wouldn't have fared out so well if the tip was at my discretion."}
{"text":"Pretty hyped up and popular right now however I didn't find that anything really stood out. You can find better tasting cocktails and food at many other downtown restaurants. We sat at the bar since no tables were free. The bar is rather large so it's actually quite comfortable eating a meal there. I did love the decor and feel of the place but nothing else would really draw me back to Frings in the future."}
{"text":"Appetizers were amazing ( guacamole, tacos ) I ordered salmon it was alright. My friends and I ordered a bottle of wine and a couple drinks which were really good. Definitely will be coming back !! Parking was a little bit of hassle since we did come around 9:45pm. And overall service was great, especially seeing the manager on the floor helping out."}
{"text":"It took us 3 month to get reservation at Frings.   We went 3 couples that love to eat and DRINK!!!! They gave us a half moon shape  table  We were squishy and hot(not a good start).  Place wasn't so busy I may add,so I don't get the 3 month over hyped wait!!! The service was friendly.  We love food so we ordered the chef menu($60 per person and they bring you random dishes on the menu).  It took a while for the food to come out and in between dishes.  I really didn't think the food was that amazing at all.  Nothing to brag or wait 3 month to eat there.  One thing for sure the brought the drinks order much faster than the food.  End result we paid $300 a couple with tip.   Atmosphere/decor 7.5/10   Me personally can't see my self going back there.  Cheers."}
{"text":"We went to Fring's twice in one week, on Wednesday and on a Saturday. The food is very good and on Wednesday it took a long time to arrive at our table but we thought that it was because it was a busy night. The backup waiter Chico was very friendly and told us some places to visit while in town. We brought another friend back on Saturday and this was a nightmare. Our reservation was for 9:00pm and they brought us to our table by 9:20. We still had not been asked for our order or been brought a drink by 10:00pm when I finally had to complain. The rest of the evening was downhill, the music and crowd was so loud that we had to raise our voices to talk to each other and each dish took at least 20+ minutes to come out after we ordered. I had to ask other waiters to please get our waiter twice because he was MIA for over 15 minutes both times when we needed silverware or another drink."}
{"text":"Service was super slow, food was OK, drinks were the highlight."}
{"text":"It's an obvious that most people come here because of Drake, me? no...well that's a bonus. I came here because it's Susur Lee, a top chef with a number of successful restaurants. I have been to Lee and Bent and always enjoy it and Frings did not disappoint! I also came because it was my birthday :)   We started with the wild mushroom toast which was packed with flavour and a nice crunch. Along with an order of the very famous Jamie Kennedy fries which I'm so glad I can still enjoy!   For mains we had the slow braised short ribs because if I learned anything from Chef Lee's other restaurants - the man knows how to cook his beef! (amongst other things!) the potatoes were very light and flavourful. We also had the pan seared branzino which was deboned and so light the vegetable componada it came with was out of this world. I have to say overall, it was a great meal.   For dessert we had the creme brulee which was beautifully presented on a plate with Happy Birthday. A beautiful end to a wonderful meal! Will I be back? Of course!"}
{"text":"Great vibe, decent food, small portions for the price, good cocktail options but super pricey $18 per cocktail on average $15-$20 for a glass of 6 Oz wine!!!! A little overrated forsure but I guess that's what you get when Drake and Susur Lee tag team! Overall not bad but definitely not blown away!"}
{"text":"The sangria is one of the best in town made by Taylor.the service is amazing. Adrien suggest my meal and everything was extraordinary. Highly recommended. Good food good ambience nice staff  What else ..  will be back for sure"}
{"text":"Not something that blew my mind and would urge me to go back. Ambiance was nice. Food was amazing. But some staff did not meet my expectations.   My experience/thoughts: -A worker walks in rounds with a sangria / specialty drink that is available to purchase. Noticed she asked all the tables except for me. However, I was sick and just ordered hot water so maybe she noticed that... but would still be nice to be offered it. -Music was great -Interiors were interesting -Food quality and combinations was perfect and would recommend  -Service is rated average or below average for the vibe and vision of the restaurant (some staff) -Hostess was very friendly, had no problem moving us to a lounge seat  Overall just satisfied!"}
{"text":"My friend and I went to Frings last night at 6. Neither of us realized it was a Susur Lee restaurant until we spotted his name at the top of the menu as \"Chef/Proprietor\". Then our expectations were even higher!   Let me say here at the outset that the food was good but the service and atmosphere was terrible, and not for the usual reasons you might expect.   We were first welcomed at the table by a waiter who asked if we wanted water etc. While we were waiting, all of a sudden the volume on the music went from loud to \"I can't hear my friend speaking\". We asked the passing maître d' to please turn it down and it may have been turned down a slight amount but it was still loud. Keep in mind this is at 6 PM not 10 at night.   Then a second waiter came to the table and rhymed off in a staccato unintelligible accent what the specials were, while not once looking at us. When I asked what the favourite item on the menu was he replied everything is great. I said, well if it was you what would you order and he refused to answer.   Then a third person came by to pour water. We then from the second guy ordered the buttermilk chicken with waffles (delicious). Asparagus (side dish) and beef short rib tacos - again very good. The menu is full of meat and chicken items with very little options for greens. These were delivered by yet again a different waiter!  A fourth waiter later came by and tried to take our plates too early as we weren't finished. The same thing happened with my glass of wine that wasn't finished.   All told, 5 waiters \"took care of us\" but not one was interested in anything else other than getting us the hell out of there. I understand that tables are probably booked in two hour increments but they had us out of there by 7:30 - it was ridiculous.   We won't bother going back. There are so many restaurants in downtown Toronto that are far more pleasant without blaring music and food just as good."}
{"text":"I don't know if it would be considered tapas styles but it's definitely promoted as shareable dishes. I tried the crab cakes and spicy maple fried chicken. Both were delicious but you definitely can't go wrong with the maple fried chicken. Cocktail menu sounded interesting. I didn't get any cocktails but I've been told it is strong; plus, they have happy hours during the weekday for $10. I ended up getting the sangria which was good and aesthetically beautiful. The menu is a bit on the pricey side but it's worth given the quality of the food."}
{"text":"Wow.  What a place.  Great food.  We sat in the basement where Drake hangs out.  There is a photobooth to take pics. Upstairs is noisy.  Ask to sit downstairs.  The food is excellent.  The service even better.  Sliders were great; pasta was special Lamb chops to die for.  Susur burger was very good."}
{"text":"Of course if you live in Toronto you know Drake opened a restaurant with Susur Lee. It's one of those places you have to check out. The thing is at the moment it's one of the places to be in Toronto so a reservation is highly recommended, especially if you're a larger group and on a weekend. It's perfect for what it is. A fun night out with some great food and atmosphere. Drake also makes an appearance from time to time. It is on the louder side as it is very busy so if you're looking for a intimate evening of conversation this may not be the perfect place for you."}
{"text":"I love the vibes here and the food is fantastic. Try to order multiple small dishes so you can taste everything. The drinks are fantastic as well."}
{"text":"Food: If you want overpriced snacks at an average taste go here...Went to subway sandwiches after the snack-accident.  Service: Our server waited half an hour to ask if we wanted more snacks even though he had forgotten two of our initial orders.   Our Orders included: coconut mojito, chicken sliders, tacos, crab cakes, and truffle fries total $100. Pro tip their is 18% gratuity that is mandatory."}
{"text":"The food here is stunning! Everyone at the table tried the Summerlicious menu and loved it! Ambiance in the restaurant was great and service was excellent. Drinks are very expensive here. Ended up sharing a bottle of wine as it was more affordable than getting individual glasses!"}
{"text":"Great vibe and a very cool bar. Service was good and staff were attentive. We had the ricotta toast and salmon crude to start which were both really good. Entrees were not as good. The grilled lamb chops were a bit too charred and overdone in my opinion. I've had much better fried chicken elsewhere (Bar Isabel, Dirty Bird, Patois to name a few). The saving grace was the Pappardelle.   I'd try it again to test other entrees and because of the location."}
{"text":"Came here for a friends birthday. Definately not impressed. The service was awful right from the beginning. We felt like our waitress was ignoring our table (4 people) and it just got worse and worse. It took 3.5 hours to get everything we ordered! 45 minutes for fries?!  people that came in after us, and ordered after us, left before us! They even ordered some of the same things. Once we started complaining all of the waitresses cared even less.....(dont you want to make our experience better? do you want a tip??) The bathrooms are far away and down 2 sets of stairs :/  The food was ok, but definately not worth the price tag. The only positive part was the patio, it was beautiful. Would not ever come back. Unless they hired all new staff."}
{"text":"My son is a huge Drake fan and wanted to check out Fring's during our family's recent holiday trip to Toronto. I'm pleased to say that the restaurant didn't disappoint. Very hip, trendy vibe and decor with delicious food. We had the sweet and sour meatballs, the spicy maple fried chicken, and the whole branzino. Everything was prepared and presented well. We will definitely return on our next visit."}
{"text":"Just went to Fring's for the first time. Not very impressed. Small portions and overpriced. $18 for a Sangria, $20 for a tiny French Fry dish. The food also took a very long time to arrive.  Not worth trying, much better choices in the immediate area."}
{"text":"My sister and I came to Fring's for the first time on a Thursday night around 9pm without reservation. Only seats available were at the bar, but everything on the menu is available there as well. Our waiter was very attentive and explained to us that all the dishes are meant to be shared, and that the portion sizes were on the smaller side.   We ordered a half dozen of oysters ($25), the tomato salad and the seafood ceviche. Our waiter told us we probably won't be full from that and recommended the king prawns, which we also got.   The oysters came first, and they were a bit on the smaller side, not the meatiest oysters I've had. Nonetheless, they were very tasty and presented very nicely. The fresh horseradish and two salsas they came with complemented the oysters perfectly.   Next we were served the seafood ceviche and the tomato salad. The ceviche was spicier than we expected it to be, full of flavours. I may have loved the sesame chips it came with more than the ceviche, they were THAT good! As soon as our waiter saw that we finished the chips, he offered another serving. My favourite thing about the tomato salad was the burrata cheese, so fresh and perfect to have with the tangy tomato and roasted beets. Flavours all paired very well, but that's expected at a celebrity chef restaurant.   There was quite a bit of wait between these dishes and the king prawns. One of the waitresses asked if we wanted to see the dessert menu, not knowing we were still waiting for our last dish. When the king prawns came out, we were amazed at how fat and perfectly cooked they were. I loved the spicy mango salsa and potato croquettes that came with the prawns.   We really wanted to try dessert but we were very full at this point, but we will definitely be going back to try their other dishes as well as the dessert.   Thank you, Fring's, for such an amazing experience. This visit has inspired us to try the rest of Susur Lee's restaurants in Toronto."}
{"text":"Quite possibly, the worst service I've ever received. Dismissive staff allowed us to sit for 1.25 hours without attention. Very sad this is the impression I have of Toronto fine dining."}
{"text":"The poor service overshadowed the great food! The chef even made a special Quinoa dish for one of my vegetarian guests, but the level of service killed the whole experience for the meal... terrible beyond belief! I'm a huge fan of Susur Lee and was excited to try Frings to add to my restaurant roster. The service this waiter provided on a Tuesday night, not even a busy night, was not only insulting to me and my guests, but to the Susur Lee name. I eat in top chef restaurants around the world and have enjoyed the attention to detail provided by servers. Our waiter spilled water on one of my guests, forgot some of the dishes and a drink, couldn't be found for 45mins to get the bill (but I found him chatting up a table and he ended up sending someone else with the bill), then we couldn't find anyone to pay the bill to, and throughout he was flippant when we tried to get him to give us what we needed, like cutlery to eat dessert. This is just the big stuff. There were so many other things wrong that I won't go back. A female staff member tried to fill in the gaps that our server missed because they were THAT OBVIOUS! Not worth the money to have such low level service."}
{"text":"2/5! We were warned by several friends that this place is overrated and the service was slow. We knew that the food was not as good as the other Lee restaurants but we still had to try it given the hype. For starters, we ordered the chicken sliders (recommend), meatballs (recommend) and crab cakes (nothing special). We also ordered the lobster poutine but the server forgot the dish and by the end of the meal (when he remembered) we were too full so we said forget it. For mains, we ordered the Mushroom & Winter Truffle Pappardelle (highly recommend), Southern Spicy Maple Fried Chicken (not worth it) and two burgers. One of the burgers came out just fine - but we had a very unfortunate experience with the 2nd one. As my friend bit into it she felt something hard (wax like) and that's when she realized the plastic that separates the burgers was still on the meat. We were so disgusted. Our waiter took away the burger - and we told him we didn't want another one - but they still brought it out and offered complimentary dessert. Honestly - I don't think a free chocolate lava cake and eliminating the cost of the burger was enough - but we were too fed up by the end of it to argue. They messed up our bill twice - and despite promising to take off a few items we ended up paying for one because they kept messing up the bill. I would not go back - very unfortunate experience :("}
{"text":"The venue is really cute and the music they played was awesome. The customer service was amazing, our waiter was very enthusiastic and came by to check up on us frequently ! You guys HAVE to try their sangria it was absolutely amazing, the rose pedals gave it such a lovely taste. The food are mainly sharing plates, the sliders are delicious and so are the truffle fries, we ordered a few more other things but I guess I had one two too many shots to remember what they were lol"}
{"text":"My friend came to visit Toronto from Paris and I decided to treat him to dinner at Frings. We were both  very disappointed, the food was disgusting and the service was really bad. I regret taking him there !"}
{"text":"Underwhelmed. Great food however service was subpar. I'm a fan of Susur Lee....wish I could have given a better review."}
{"text":"Husband and I came here on a Sunday night during a long weekend. We were able to make reservations same day as it was a last minute decision. We made reservations for 9:30 pm but ended up getting there earlier. They had no issues seating us earlier as it was only the 2 of us. The setting is very elegant/romantic. Music was good. It wasn't too loud as well so it was easy having a conversation throughout the night. Service was average. We ordered the Susur burger and shared that. The burger was amazing! The sauce in the burger really does it! My husband said it felt like he was eating a gourmet Big Mac lol. Come to think of it the sauce did have a Mac sauce type of taste to it. We got it with a side of the truffle fries instead of regular. I found it had a bit too much Parmesan and it left a really garlicky taste with each bite. I would have done it with just regular fries. We also ordered the southern spicy maple fried chicken since we noticed a lot of good reviews on it. We thought the portions were going to be small but they were actually pretty decent. The spicy maple sauce really makes this dish. Without it I felt the chicken was too dry. I probably wouldn't order the chicken again. Overall this place seemed average. Now that we've crossed it off our list of restaurants to try I probably won't come back. There wasn't anything that stood out for me."}
{"text":"For a Tuesday night, this place was pretty happening. It's a great spot for some cocktails and bites. The food was pretty good, with decent (to small) portions. We had the avocado toast, meatballs, shrimp, branzino and potato rosti and they were all quite nice. The service was nice as well and our waiter made some good recommendations. The Proper Ting is pretty good and I would get it again but could do with a tad more love. All in all a good experience and I would visit again if someone else suggested it."}
{"text":"Visited Drakes \"joint\" with my two sons who are very much into the whole OVO deal. Must say, I was sceptical.  We made our way over, on foot on a rainy evening in December. Vibe was definitely polished but not over the top. Cocktails were exceptional. Food was on point, if not a tad expensive but I guess that's somewhat to be expected. DJ toned things down a bit as the evening progressed to a more chill feel, which was perfect whilst enjoying a meal.  Our server was very professional. Made excellent suggestions and a nice wine pairing. Even offered to \"wrap up\" the unfinished bottle to take with us. Will be back"}
{"text":"The food and drinks were quite good but the service was a 3 out of 10 at best. Lined up to be seated even with a reservation. Staff was incompetent and actually seated the people in front of me in the wrong booth and had to ask them to get up and move. Had to wait 10-15 minutes to be seated while the staff argued with one another. The hostess didn't do much hosting and couldn't be bothered to even smile or show people to their tables. Oh an the server asked me if I knew that the tuna tartare was raw...ahahhahaha. I loved Lee restaurant and have been a guest there many times. This was a big disappointment for me."}
{"text":"Sorry Drizzy and Susur Lee, not all business ventures are successful, and unless there are major changes, you can group Fring's among the unsuccessful.   I work in the beverage industry selling alcohol to restaurants and retailers. I frequent multiple restaurants per day, which includes ordering from the kitchen as well as the bar. I visit hundreds of restaurants per month, giving me a fairly experienced understanding of what goes into a successful dining experience. This is the first restaurant review I've ever written. The sole reason is because of the astonishingly poor dining experienced myself, and my party received at Fring's.  \"Wha Gwan Fam\" was the opening line of our server, who, upon first impression seemed to be on his first ever shift in his role. It became apparent that it was not his first night as a server, he was merely unable to perform his role as he should. Apart from a demeaning and pretentious attitude, the inadequacies of our service require more than two hands to count on.   It took 25 minutes after ordering to receive our drink order. Was it busy? homeboy had three tables. We were very clear to express that it was our first time at the restaurant. Was the menu explained? not in the slightest. Our server was nowhere to be found, so I literally approached the hostess about the menu, who was far more helpful within 30 seconds than our server was all night.   We ordered oysters, kale caesar salad, short rib tacos, salmon crudo, rigitoni, pan roasted salmon, branzino, and seafood ceviche. We were prompted to order all plates at the same time and to share all of them. Knowing some plates were smaller, and some were larger would have been helpful to know. I wish our server was able to communicate that type of relevant information, rather than spouting off regurgitated facts about sake, and Hennessy xo than none of us suggested to have, or gave, any interest in.   All plates arrived in a random order at different times, in a fashion that may logically be explained by when they became ready in the kitchen. I use the term \"all\" very loosely, because two of our plates did not arrive upon a second prompting. And one of our plates never arrived at all. I ordered the branzino. The \"waiter\" (another term used loosely) informed me that he had forgotten about the order, and that it was in fact too late to prepare as the kitchen was now closed. I convinced him that he had what it took to approach the kitchen staff about preparing the branzino, and about 4 minutes later it was on our table, piping hot. The seafood ceviche never appeared.   Out of all the plates that arrived at our table, the oysters were the only order that was plated in a fashion able to share among the four of us. None of the other plates were susceptible to sharing in any fashion.  The decor was incredibly synthetic, almost to a laughable state considering the cost of the meal. The unexpectedly spurious decor included chandeliers made from coat hangers, and fixtures sourced form Ikea. The decor definitely matched the service we received, but did not match the brand of, and the expectations we had for Susur Lee.   The oysters were just fine, the pan roasted salmon was very sweet, and the branzino was far too hot to be properly enjoyed. This is as far as the food review will go.  Unfortunately, the admitted skill and experience that Susur Lee brings to the kitchen is juxtaposed against an uncomfortable physical setting, and feeble service from wait staff. My $200 bill was unjustified, and I will not expect to return to Fring's unless significant changes are made."}
{"text":"The food was ok but it was overpriced and it's way too dark here. Bring your flashlight!"}
{"text":"From Vancouver and only in Toronto for a few days, we chose a few restaurants to try. Fring's was one of them. Our experience was overall 5/5. Our server was friendly and attentive, and the food was well-timed & top quality. Shout out to the Korean Marinated Skirt Steak - it was absolutely amazing! The only thing I found a bit odd about the dishes was that it seemed like everything was topped with onion straws. Maybe we coincidentally ordered every item that was served with onion straws? The \"Comfort Foodie\" inside of me was happy to see them, nonetheless. I'm surprised to see some of the poorer reviews here, because we had a great time."}
{"text":"Awful... Awful... Awful!  What a disappointment this restaurant was from the service to the unbearable DJ. Sounds of a haunted house, docking ship and chimes pierced our ears while trying to enjoy an xmas dinner.  A deliciously anticipated pre fixed dinner turned into a rushed Buffett with all but dessert being served family style at one time. Even after speaking with the manager nothing improved! Oh thanks for taking off that extra asparagus we ordered lol.  Dying to get out of this place and will not return."}
{"text":"The food here was a huge disappointment, but the atmosphere and decor of this place is great for drinks. I had high expectations as I've been to other Susur Lee restaurants and have enjoyed the dishes and felt that they were worth the cost. However, at Fring's I felt that everything was overpriced for what it was - as in, none of the dishes were special. Just okay.   We had the mushroom and prosciutto toast, organic salmon crudo (the salmon was not that fresh), susur burger (pretty good, but no better than Burger Priest and double the price?), sourthern spicy maple fried chicken (way too much batter compared to chicken, and not spicy at all?)."}
{"text":"Made this reservation for 2 people two months in advance and requested seating in the dining room in either the booth's or the elaborate seats for 2 that run along the middle of the dining room. Thought since I was making the reservation well in advance and since I also confirmed with the staff when they were confirming my reservation that they would honor my request, but this was not the case.   Upon arrival, I made my way to the desk as there is always a mass of people hanging out by the front desk and it is not clear whether they are waiting to be taken or are just hanging out. I was seated promptly which was nice but had to ask for my bulky jacket to be checked.  Service I am glad I had asked for my jacket to be checked. We were seated in what felt like a makeshift dining area between the booths in the bar and the dining area. It was literally a dingy corner that didn't even have its own lighting like the other seats in the restaurant did. The chairs were stiff and uncomfortable wooden and steel contraptions, the kind that you can't even drape your jacket over without it falling off 20 times throughout your meal. There was space for maybe 1 plate and a couple of glasses to fit comfortably on the table--quite a nuisance having to rearrange the table multiple times since the waiters were no where to be found to clear the table (this could also be due to the fact that we were tucked in the middle of nowhere so we were easily missed.   Food Food was okay. I don't mind paying a premium for food but only if it is unique/I can't have elsewhere. The food here is comparable to the food found at chain restaurants i.e. Moxies, Earl's, and Jack Astors.   Crowd Abound with lip injections and silicone.   Decor Pretty dingy decor considering this is a product of Susur and Drake. Vinyl stickers on the bathroom doors to signify which is for the \"6God\" and which is for the \"6Goddess\". Cheapy lampshades, florals haphazardly placed everywhere.  Verdict Would not return."}
{"text":"I've been dying to visit Fring's ever since word got out about the restaurant last month. I'm a huge fan of Susur Lee's cooking and also enjoy Drake's music  (who doesn't love delicious food and good music) so was really looking forward to seeing what the two Canadians would come up with in collaboration with eachother. I decided to visit the new Toronto hot spot this past weekend. Upon walking in we were welcomed with some really cool art hanging off of the ceiling and stretching its way though the restaurant. The hostess was polite and quick to seat us. The ambiance was something so very different from any other spot in the city. The decor was a mix between modern and vintage pieces. The DJ really helped set a cool, hip vibe. And the food was nothing short of great. I decided to go with the burger and fries. WOW! I'm a fan of simple but good burgers and that's rare to find at a lot of restaurants in Toronto (they are always topped with a million and one things). It reminded me of a fast food joint burger (think Burger's Priest or In-n-Out). The bun was fresh and soft, the meat was perfect - nice and juicy and the toppings like I said simple but great. And the fries complimented the burger nicely. I was very happy with everything - from food to service to ambiance and these are all things I take in when reviewing a restaurant. Definitely a must-try!"}
{"text":"Nice atmosphere, however, it took a very long time to get our food. The server was nice enough to check in a few times at the end to explain why our dessert was taking so long. Overall, I'd come back but just for drinks!"}
{"text":"Such a great restaurant, classy decor, super cozy and the staff were proffessional, friendly, and good looking. I actually really liked the low light setting, matched with good music, food, friends, and drinks.. The atmosphere was really great. Definitely worth trying if you haven't gone already. The only thing that was a bit of was how long it took to order, to be fair it was really busy."}
{"text":"The wait for the food was super long. The food was good, but not great. Overpriced. But I guess if your a Drake fan you have to make your way here. Tree out of 10 for sure. No forest."}
{"text":"From the decor to the ambience and food, it's an overall great resto that's worth revisiting.  The spicy friend chicken waffle: I had better but this was still tasty; chicken was deep fried and juicy inside.  Crab cakes: three balls of friend crab cakes, light and tasty.  Pappardelle mushroom with truffle oil: savory and fresh.   The dessert was not the highlight of the night, however. It was called Monkey Bread topped with hazelnut ice cream, caramelized apple and salted caramel. I personally didn't like the taste of it, my friend did. It's $14 and obviously best shared.   Service was a little cold from the staff but not at all rude; everything very fast and efficient."}
{"text":"Went there with a few friends last week. First impressions are that the place is small, like extremely small. I was expecting something with a bit more room. The crowd can best be described as \"interesting\". Half of them looked like the stepped straight out of Yorkville and the other half looked like they stepped out of Jane and Finch.  I ordered the salmon and it was served to me basically raw. I pointed this out to the server and he apologized and said they were really busy and the chef had probably just forgotten to cook it. Really? Food overall could be described as mediocre.   Would I repeat? At current prices, absolutely not. Service was professional, nothing spectacular, but the prices do not mesh with the food or ambiance at all. Cut the prices by 60% - 70% (we all know that won't happen) and yeah it would be a nice place. However, at current prices I simply can't recommend it."}
{"text":"Worst experience at a restaurant ever. It has a nice atmosphere which draws you in but the terrible service and small quantity of food with inflated prices would disappoint anyone. Drinks are over-priced at 19-20 a glass. The food is served family style however the portion size is only really good for one person. Although I will say the dishes were tasty, I don't feel as though after spending 60 at a restaurant just for myself, that I should be leaving hungry. The overall bill of our party came to 1500 with the hefty 18% gratuity tagged on. The service wasn't remotely good to be receiving such a hefty tip. Overall the entire party left highly diasspaointed and hungry in the end."}
{"text":"Nice atmosphere and great service, but I would say the food is way overpriced for the quality. My friends and I shared the gnocchi, the tacos, and the sliders. Everyone really enjoyed the food, but I feel that I could go somewhere else and have an equally delicious meal for half the price somewhere else on king street. These \"sharing plates\" are getting old, as it seems like a way to charge too much for a smaller portion."}
{"text":"Went here on a dinner date with my girlfriend. Loved the ambiance - low key and chic. Excellent service accompanied by a great prix fixe for Summerlicious. We had the Balinese Avocado Salad and Eggplant Parmesan. Both were delicious and kept us wanting more. Dessert trio was light and palate cleansing. Will be back to try their regular menu for sure!"}
{"text":"I wish I got a chance to taste their food but unfortunately the poor customer service got in the way.   After calling ahead to check the availability at the bar I was told that there would be room for 2 people in 10 minutes. Upon arriving I stood in the entrance waiting to even be acknowledged by any of the 4 women standing around looking at a computer screen. I gave them the benefit of the doubt and assumed they were just busy with something important. A few more minutes go by without so much as eye contact. So I ask them 'is this not where you go to get a seat?'. One of the girls tells me it is, so I proceed to let her know I called ahead about the two bar seats. She goes to check, comes back, and let's me know she currently has 1 seat. I ask her if another will be opening up soon. She tells me that the bar is first come first serve so she doesn't know...I ask if anyone is getting their bill soon and she says she doesn't know without even checking or asking the bartender. There was zero effort put in to giving me a time frame of how long my wait would be. The entire event was simply a poor excuse for customer service and lacked professionalism every step of the way.   But I must say, the doorman was absolutely lovely. Maybe someone should pay him more and have him inside greeting people. Then maybe I'd consider coming back."}
{"text":"This place is alright. Came with my boyfriend because he wanted to take me out for Valentine's dinner, we had the Valentine's dinner menu they were offering that night. It was a 5 course meal but only one dish really stood out to me. The butter poached lobster and sage ravioli with butter nut squash/teriyaki sauce was super delicious the flavours within the sauce the made was something i've never tried before but it was definitely something I would lay full price for. On the other hand everything else on the menu was okay, not worth the price. I honestly didn't go in with high expectations anyway since my friends have told me about Fring's. I think one visit is enough for the experience. I personally wouldn't go back as it's pretty pricey for the quality of the food. Service was great, although I must say servers sounded like they were reading a script when they were explaining each dish they brought out. It was like hearing them read to me from a piece of paper instead of romancing the food so that was a little awkward; they seemed nervous as well. Overall this restaurant is meh.."}
{"text":"One of my favourite spots in downtown Toronto. The atmosphere is great, staff are very attentive and the apps. are incredible. I have gone back from my initial visit, just for the ricotta toasts on a few occasions. Reservations are recommended in advance as it has gained much popularity in the last while. Be prepared that the music is quite alive, so no cozy first dates at this place.   From the front door charm to the mixologists at the bar, the staff are truly on point. Now if I could only figure out what they do to the sweet and sour meat balls...They are incredible and I almost didn't try them as I'm a savoury type and the thought of 'sweet' didn't initially appeal. Seriously awesome. Grilled octopus is so nicely done as well!   The main bar lighting was adorned by what I later realized was plastic hangers! Very cool - all the decor is very nicely done."}
{"text":"I'd recommend ordering the avocado toast appetizer which was very flavourful. Other food ordered was good but not amazing especially when you factor in the inflated prices due to the celebrity status of Susur Lee and Drake. Service was decent until the end when our waiter tried to force us to order dessert and then gave us attitude when we declined firmly after \"thinking about it\" as he told us to do."}
{"text":"Although I'm not usually into overly hyped-up and trendy places, a friend made a reso at Fring's, so I came along to check it out. I must note that my expectations of a restaurant are commensurate with the price tag. Because Fring's is on the pricier end, I have a level of expectation of both the service and the food.  We had an early-evening reso tonight (Thursday) at 6:15 pm, immediately after work. So given the time, this wasn't a big spending night out for our group.   Unfortunately, the waiter was incredibly aggressive in upselling us to a prix fixe menu of upward $50 each, which was a bit off-putting and kind of sad. When he discovered that we were each ordering a la carte and having lighter meals, his mood turned cold and transactional.  After delivering our meals, the guy didn't even ask how our food was (?!). Not because he was busy (the restaurant was barely hosting anyone at that time), but because we weren't going to rack up the bill he wanted us to - and our table spent roughly $300. I was embarrassed for him. He was a horrible, and obviously a miserable, server.   My standard tip is 20% and I easily go up from there, but this guy barely got 15% from me... and even then, I was being WAY too generous. I guess that I felt bad for him. At an establishment like this, he should not be employed. I expect that kind of low and bitter service at a joint in Chinatown... not from one of Susur Lee's restaurants. That said, I still have a lot of respect for Susur Lee.  Anyway, my 2-star rating is mostly because of the terrible service. The food was okay, but sadly overshadowed by our server's miserable attitude. It was sad to see."}
{"text":"I really don't know what the hype is about the food here. Don't get me wrong, the place is class, but the food we ordered didn't have any balance in its flavors, most of the dishes we ordered were overpowering to the point where my stomach started to hurt. Maybe I didn't get the right dishes. The special poutine with lobster was too cheesy with less fries, and such a small portion for it's price. The toast we got too salty. The grilled octopus was good, but I wasn't sure if it was supposed to be served room temperature, I was expecting it to be somewhat hot. The monkey bread was good also, but the caramel was so strong and so sweet. If I only knew Lee's restaurant was down the road before we headed here. On the other hand, the servers were courteous and on point."}
{"text":"Service was fantastic...the food was great. We had the truffle fries, grilled octopus, kale caesar salad, and Brussel sprouts. Highly recommended."}
{"text":"WOW! I came here for the first time for my birthday, and it certainly lived up to the hype.   While the food was amazing and the waiters fantastic, what really sold me was the VIBE of this place. Me and my friends were really able to enjoy ourselves while dining to our favourite songs. Additionally, the decor of the place was sublime! There was even a rolling bar cart where the waitress could make drinks table-side. We were all very impressed.  I would highly recommend the melt-in-your-mouth short rib as well as the JK fries, but honestly, you can't go wrong!"}
{"text":"Went there for a friends bday dinner. Several people of our party did arrive late which actually resulted in our server being extremely rude. However, the manager was really kind and accomodating which resulted in the service experience being great. Their food was also good overall. Will go back"}
{"text":"Food: 8/10 Atmosphere: 8.5/10  Service: 8/10 Overall experience: 8/10  Fring's fits into the King and Spadina scene seamlessly. It's a dark and trendy restaurant, boasting fancy drinks and upscale decor. Luckily, the restaurant goes beyond its hype and celebrity owner status, with really good food and overall cool experience.   Was greeted by less than friendly hostesses (there are three crammed at the front desk). They didn't crack a smile (too cool??) but hung my coat and seated me with no negative vibes.   The waiter explained it was a sharing menu, although if you aren't one who needs an army-sized portion, you could get away with ordering a main and splitting an app. My friend and I started with the ricotta toast (had pomegranates and plum jam), the kale caesar salad, the spicy beef tartare and the king prawns.   I get the sense that the toasts are really good, if the ricotta one was any indication. Bursting with flavour, the simple dish was a highlight for me. The salad was forgettable but fine. The beef tartare was great and the prawns were enjoyable.   Overall, the food is good but what helps with this kind of place is the atmosphere and the experience as a whole. They played great music (not just Drake, but even jammed to Pop It Like It's Hot at one point, which is +10 in my books) and the whole scene just had a fun and cool vibe.   THE BOTTOM LINE: the food is good, but the overall experience you'll have is really fun."}
{"text":"Came to Fring's for an early dinner right when they opened at 5:30. We were greeted by friendly hostesses who took our coats and exchanged tickets for retrieval later.  Fring's offered an 8-course tasting menu (ended up being 10 dishes) with custom printed menu's for the 20 of us.   We were seated in the basement of the restaurant in a secluded room with it's own photo booth! Right around the corner from the infamous 6 on a Wave neon lighted emoji. Fring's created an 8-course tasting menu (ended up being 10 dishes) with custom printed menu's for the 20 of us. The decor of the restaurant was spectacular. All the chairs looked unique, almost vintage like.  FOOD:  Guacamole with Olive Crumble - comes with homemade corn chips 5/5 -very well seasoned. Perfectly balanced guacamole with endless corn chips  Fring's Caesar Salad - parmesan, garlic crouton, bacon 4/5 The bacon was unreal. Had a smokey taste to it. Asked them to bring more, and they did!  Mom's Homemade Sweet & Sour Meatballs - breadcrumbs, crispy thin onion 3/5 -These were savoury, sweet, but a tad dry on the inside.   Spicy Rigatoni Rose - parmesan, basil, sweet onion, fresh corn spinach, marjoram 3/5 -This pasta was average. Sauce was not flavourful. It was a light pasta dish.  Pan Roasted Salmon - grilled polenta, asparagus, lemon hollandaise 4/5  -The fish was cooked perfectly. The combination of the soft polenta with the tangy hollandaise worked well.  (Surprise) Beef Tenderloin Steak - cooked medium rare 4/5 -perfectly cooked steak  Slow Braised Short Ribs - garlic potato puree, sour cream 5/5 -This was my favourite dish. The short ribs were melt-in-your-mouth deliciousness.   DESSERT:  Monkey bread - bread pudding of caramelized apple, creme anglaise, salted caramel, hazelnut ice cream and macerated blueberries - 3.5/5 -This looked like it was going to taste way better than it did. Everything melted quickly and it became a pool of, well; caramel, melted ice cream, and the bread.  Drinks and service were A+. The Sauga City Mule and Old Fashioned were perfectly made.  Fring's lived up to the hype. Great food, drinks, music, vibes."}
{"text":"Hoping that the hype surrounding this place has died down, we got a last minute reservation on a Thursday night for 2.  The place was just as packed as if it was a weekend! I loved the decor and that there was a live DJ playing all my favorite tunes.  Our server was great in making recommendations and was pretty attentive throughout the meal.   I think my favorite thing on the menu was the dessert. Monkey bread is my weakness - If I see it on the menu, I MUST get it. Fring's version of the monkey bread was drizzled with caramel with ice cream on top. The dough was a bit undercooked and I would have preferred the outer edges to be more crispy, but it was nonetheless delicious.  The cocktails here are one-of-a-kind and STRONG! Definitely sip on your drink with some appetizers!   The grilled octopus was really tender, I would Definitely order it again. The slow braised short ribs was also really tasty!   I have to come back to try out the other items, but reading other reviews, I might want to try Lee's before coming back."}
{"text":"The food here is very good. We especially loved the tacos and the cheeseburger spring rolls. The service however was not up to snuff.  As soon as we didn't order drinks, we were rushed through our meal. The food here is served to be shared and each type of dish come one after another. The waiter cleared our dishes when we were still eating certain dishes. We made reservations for a special occasion and were rushed out in less than an hour.  The attitude of the waitstaff changed so dramatically when we didn't order drink ( half of our table was underage anyways)  we asked for water and was brought lukewarm tap water( which was never refilled). We probably would have stayed longer and ordered dessert but we were made to feel unwelcome"}
{"text":"Fine dining isn't usually my scene, just because I feel like you pay a lot of money for a quantity of food that only a cat could get full off of. Moreover, if the food sucks, well too bad you're out a 100 bucks. However, Drake and Chef Susur Lee team up like their TOPSZN to break that stereotype at Frings. They definitely sprinkle that TOPSZN with their finger tips because the food is just . The venue is a lot louder than most fine dining places with some amazing hip hop and rap music in the background. Definitely the urban street version of fine dining.  They have an immaculate wine collection and if you're willing to splurge, you can get hold of some of the rarest wines here. Also, if you plan on drinking more than one glass of wine, getting the bottle would probably make more sense. We went with the glasses and I got the Chiraz from California and my partner got the Sauvignon Blanc from Italy. For food, we decided to go with some of the favourites that were mentioned in the other reviews. The menus is designed for of a shareable tapas kind of experience so we just ordered 4 dishes between the 2 of us. the Souther Style chicken with their maple syrup drizzle and hot sauce was our favourite dish and it was just heavenly. It was so good that it was kind of nostalgic of the southern food we have tried in Texas. The Braised Short Rib Tacos had perfectly cooked meat and it was flavourful but their just miniature so it's not that filling. The Crab Cakes were spectacular and so soft when you cut through them. We ended it off with the Ceviche which so perfectly flavoured but our only complain would be small amount of chips they give you with it.  The service was good but nothing spectacular. I found that our waiter spoke very fast at times, making it hard to follow him. We were checked up on occasionally but not as much we would have liked especially when we wanted to pay the bill. They could definitely improve on this aspect of the restaurant but the food was so good that I had to give it a 5."}
{"text":"So far I've been here and to Lee out of celebrity chef Susur Lee's restaurants. I enjoyed Frings much more out of the two.  Located on King West, the restaurant described their menu as international comfort food which was reflected by a selection ranging from southern style fried chicken to Korean marinated skirt steak. The food was all very good both by taste and presentation. We shared six dishes among four people and were satisfied with everything we had.  Cocktails and the wine list were generally good although definitely on the pricier end and the Caesar was not very good.  Ambience was great and service started good although it deteriorated as the restaurant filled up.  Overall, we ended up spending less than at Lee for a much better tasting meal, I would definitely come back."}
{"text":"You used to call me on my cellphone - late at night when you need some food; Call me on my cell phone - late at night when you need some food; And I know when we go to Fring's -  That can only mean one thing:  Crispy fried chicken, octopus, and lava cake!  So Drake and Susar = genius. We had such a great time here! They take reservations at Fring's but you have to be quick, they fill up faaast.  The fried chicken with maple syrup sauce was amazing. We drank the sauce.  It was sweet, salty and out of this world amazing.  The octopus was tender and one of my favourite share plates.  The lava cake was ooozing with rich chocolate.  Topped with hazelnut ice cream, it is one of the best lava cakes I have eaten in the city!  Started really hungry, now we're herree.  :)"}
{"text":"Fancy restaurant, unique dishes and super overpriced. Paid $18 for a sangria, but it was the best sangria I've ever had. The waiter had great suggestions, and made great conversations. Came here at 5 PM expecting the place to be packed since the only times available to make a reservation were super early for a dinner so I had the impression that tables were all booked. When we arrived the restaurant was not busy and lots of empty tables.. since I wasn't trying to have a full dinner at 5 PM, we only ordered appetizers and drinks. I would come back to try their mains. Great food- very overpriced, good experience."}
{"text":"I would expert better from Sursur Lee.  The mama's meatballs were great, other than that the rest of the food was ok tasting, but presented nicely. The wine list is small and over-priced (as is the food). It was a case of picking the best of the worst. The atmosphere is that of a lounge and the service is lacking. Our waiter was pushy, impatient and bordering condescending.  To say the least, the reviews were true, the hype, as usual was wrong.  Skip Fring's and go somewhere else."}
{"text":"Disappointed with my experience at Frings. Was really excited to try it out, had some friends visit from out of town and I had suggested Frings. Service was terrible, and as the night progressed, it got worst and worst. I've been to lees multiple times and it's not even comparable. Food was good, but will not go back."}
{"text":"I was a bit worried this place would be all hype... Definitely not.   This was one of the better drink/eat experiences I've had in a while.  My friend and I started off with cocktails (Sweeter Man for the win) and shared a bunch of apps. The sweet and sour meatballs and the sliders (they taste like mini Big Macs.....) were incredible.   Service was also great. Our waitress, Coco, was an angel and the manager was super attentive. And, in true fashion, Su Sur himself made a couple of rounds to make sure everyone was satisfied.  I'll definitely be back."}
{"text":"I only gave 3 stars because the food was pretty good. But, we had a reservation,  and they made us wait outside in a line (like a club) for no reason as it was half empty inside.  We also tried to add 2 people a week before and they said absolutely not, but the place was half empty!!  Very frustrating.  Food was very good, bit over-priced,  and will never go back.  It's trying to be trendy for no reason."}
{"text":"This restaurant was fine but felt very pretentious. Our first few minutes in the place....the sommelier came over and without even asking what kind of wine WE liked, launched on a diatribe about a few \"amazing\" wines they carry: clearly the most expensive bottles. I am glad the grapes were carefully chosen, hand-washed, caressed, photographed and then gently crushed... don;t care: I like what I like. The food: good, but nothing amazing that I couldn't get at most other \"hip\" places. Price? felt expensive. Crowd? it felt like a whole lot of people who wanted to go to an expensive place to \"pretend\" to be fancy. Interesting experience, but I won't be going back..."}
{"text":"I ate here the other night.  I had a reservation for 9.  The hostess got five stars right off the bat in asking me how to properly pronounce my first name which is tricky.  Since I was dining alone I was also offered a bar seat as well as a table.  Personally, I hate dining at the bar.  It's usually way too noisy, there's no support for your back and the food is not at the right height for eating.  I was seated at a nice table.  ( not near the kitchen or the restrooms as often happens when dining solo ). I loved the food and found the servers courteous and attentive.  The rooms are dimly lit so you may have to squint a bit to see the menu.  My only caveat is that as a cocktail lover, I found the $16 a pop a bit hard to swallow. ( pun intended ). I would revisit this restaurant."}
{"text":"The restaurant was so hard to find, took about 15 minutes to see the sign. Great ambiance, Drake songs playing throughout the whole dining experience. Our waitress was very attentive. Drinks were alright but the price was sky rocket for a 2oz cocktail ($18). Food was bland, had the lamb chops and Korean skirt steak. Thought it would've been more well marinated but there was no special twist to it. ($32-$38) am entree. Would rather eat at mcdonalds. Giving it a 3 star because of the hype and customer service."}
{"text":"Booked reservations for four people and we were seated on time, if not, a bit earlier.   Food: For appetizers we ordered the Avocado Spread and Homemade Ricotta toast. It was amazing! If you are going for a sour taste the Avocado is your choice and if you want something sweet then choose the Ricotta toast. The toasts were 10/10! My friend ordered the meatballs and it was cooked thoroughly and very flavourful. Also a 10/10. For the meal, we ordered the Sursur Burger and Southern Spicy Maple Fried Chicken. The burger was juicy and cooked exactly to the suggested preference. The burger I would give an 8/10 only because I've had Burger's Priest and I haven't found a place to top their burgers yet. The burger came with fries and a side dish of mayonnaise and ketchup. The southern fried chicken came with maple syrup gravy and it gave the chicken more flavour. It was sweet and had a hint of spiciness. I wasn't a fan of the side salad and coleslaw that it came with but I was already stuffed from the amount of chicken that was on the plate. The proportion was definitely a 10/10 - I was able to give my boyfriend a piece of chicken (I don't like sharing). I would rate the southern fried chicken a 9.5/10.  Atmosphere: Super romantic but please do not bring your first date here as you are not able to have a conversation. At one point, I disengaged from having a conversation and went on my phone. It was pretty loud!  The chatter and the background music combined make it noisy. I enjoyed the live band they had and it really blended well with the restaurant. The set-up is very romantic and the seating was very comfortable. It was very clean and the lightening was dim. For some people it can be dark but I found it nice. This is definitely an atmosphere for a romantic date or a group of friends celebrating an occasion (birthday). The decor was super nice and it looked like an up-scale fancy restaurant.  Service: I wish they told us about the 8$ still water charge. We weren't given an option but the waiter only said \"still\" or \"sparkling\". Maybe, we should have said tap. So be careful of that! Our food arrived quickly and waiters were around if we needed anything. The waiters were very informative and attentive to the table.  Pricing: The pricing of the food were reasonable, however, I don't think the burger was worth 20$. If you want to have a good burger, go to Burger's Priest! Southern Chicken and toasts were a fair price.  Overall: I would rate this restaurant a 9.5/10. This place hit pretty close to perfect aside from the $8 dollar water I had to pay for."}
{"text":"Did anyone get sick after eating on Friday April 1st 2016?  I threw up the same night and both of us are sick to our stomach Saturday morning.  We shared tuna tartar (my favourite), crab cakes (needs more seasoning but loaded with lots of meat), grilled octopus (tender; but is this what got us sick?), and spare ribs.   Just curious if anyone else is sick? Or if this is a weird coincidence?   In addition, this restaurant is good but not great as the music is blasting to a point it feels like a club.  I recommend bringing a date and sitting at the bar so you get super close to talk.  Yelling over the table is horrible.  Book on their website because there's more availability!  I called and checked their website on the same day and was surprised there was a 6:30 time slot (and I was placed on the waiting list for an earlier time!).  Sketchy.  Lastly, music is the best part of this restaurant!!  My type of jam.  But again, it's a restaurant and not a club, they shouldn't make people yell over dinner."}
{"text":"I was impressed with Fring's since I had written it off because of its affiliation with Drake lol. But it is a Susur Lee restaurant so I decided to give it a try for Winterlicious.  We were seated at the bar, my boyfriend and I started with the soup and the salmon dish, I really loved the Tuscan soup with spicy sausage, definitely not overly spicy and so rich in texture and flavour. The salmon was essentially just a really good piece of salmon sashimi. I got the octopus as a main, I eat seafood often, and was not very impressed.  The Korean skirt steak on the other hand was delicious! Dessert was good, the trio option leaves you with no choice but to try all three and I liked all the options.  We also got the truffle fries on the side! I understand how expensive truffles are and this was tasty but these fries were not worth $20.   Cocktails were delicious and bartenders were helpful when making a selection! The cost quickly added up to be more than the cost of food, so if you're looking to stay within a budget, don't go for seconds with the wine or drinks.   Service was friendly for the most part. Waiters were attentive, knowledgeable and always clearing up quickly. Food came out very quickly we had all 3 courses in 37 mins. Only thing I was taken aback about was a waitress we hadn't seen all night sprung up on us to tell us she'd get our bill....after a 37 minute dinner while our glasses were still full and we were looking to order more. We had made a reservation and weren't just a walk-in they were squeezing in. We only stayed about 45 mins after that but did not appreciate the side-eye between the gentlemen walking around with ear pieces and that same waitress who hadn't been serving us. I think 2 hours is a standard allotted time for reservations...  Besides that food is good, drinks are good and service is generally good."}
{"text":"Delicious food and incredible atmosphere (especially for a date), but found the dishes to be overpriced for the small portions.   My favourite was the southern fried chicken.   The decor and overall ambience was very swanky and urban. Loved the music and 6ix details around the restaurant.   Overall good. Will visit again but does not compare to Chef's Susur Lee's other restaurants."}
{"text":"Food was delicious and felt at home. Atmosphere is very posh and staff is vey attentive. Only negative I have about the restaurant is make sure you ask for tap water or you'll get stuck with a 8$ bottle of water. Wish I knew that ahead of time."}
{"text":"Came here for a late dinner and drinks on a Saturday night for my wifes birthday. The atmosphere was trendy. We had 2 food allergies on the table. One was for peanuts and other was for dairy and gluten. The peanuts they could easily accommodate for but for the gluten and dairy free it was almost impossible and we felt bad for the guest we invited. Our good was amazing. The server said he could make a special pasta dish that could accommodate for the gluten and dairy allergy. The waiter brought it out and right away we pointed out there was dairy on the pasta. They took it back right away and the manager came out to apologize. This was already after we had our meals. We had to wait another 20 mins while we were done our meals for the gluten and dairy free meal. The meal came out and atleast he had a meal rather then go home hungry.   The music for some reason was putting us to sleep. Other then that it was a good experience and we would come back again."}
{"text":"We tried Frings on Thursday, Dec 16 2016. Ordered the beets and Ricotta salad, short rib tacos, jk frites, crab cakes and monkey bread. The food was mediocre and non memorable with the exception of the tacos. The service was terrible! The waitress had no tact and was pushy in getting us to settle our bill. Even after complaining to the manager who told us to take our time, the shitty waitress came back to rush us to settle up. Terrible service...I won't be back. Susur Lee and Drake should be embarrassed to be associated with this place."}
{"text":"When we heard Fring's is soon to be no more, we made a reservation and went this past weekend. I had read previous reviews (overall: good food, bad service) and our experience was similar.  Decor was super different, jewel toned colors and lavish faux fur chairs. Low key hip hop music all night added to the experience, I mean, it is with Drake's influence.  Our server was knowledgeable enough but I think there's a disconnect between the servers and busboys; the same busboy came and cleared our personal plates and our unfinished truffle fries before we even had the chance to say we weren't finished. The servers kept bringing us food that was meant for the table beside us (including a birthday cake, ruined the surprise for the guest two tables down lol). Anyways the food was otherwise incredible, true to Susur's style.  We had the tuna tartare, spicy rigatoni, chicken and waffles, truffle fries, and short rib. The tartare was delicious with perfectly seasoned chips. Spicy rigatoni was so simple but perfectly executed, probably my favorite of the meal! The chicken and waffle was also amazing and the fries are an absolute must. The short rib for some reason wasn't my favorite, but we were also incredibly full at this point so that could be partly why we could barely eat it. If you get the chance to go in the next few weeks before they close, highly recommend just based off food!"}
{"text":"So let's be real, I came here because of Drake! I was in town for Caribana and and my girls wanted to check this place out. It's really easy to miss the restaurant when driving because the sign is so small lol You walk upstairs and they had a yummy candle lit! We had to wait for our reservation a bit but we were seated at one or the booths. The staff are very friendly and they offer to make sangria for you which is really cool, but also pricey. I got the salmon with mashed potatoes and asparagus. The portion sizes were okay. I just feel like for the price they could've been larger. You can tell that want to be fancy with this place, but it needs a bit more. I love the music they play but for the vibe they're going for, the food doesn't really match. Do NOT get the onion rings, they had no flavor whatsoever lol I wanted to like them.  Overall, I'm happy I went, but for the food selection/quality, and pricing I'm giving 3 stars. I still recommend giving this place a try!"}
{"text":"Food was great - unfortunately, the service was absolutely horrible. Our waiter, Kevin, started off by trying to persuade us to order a more expensive bottle of wine AFTER we had made our choice. When we turned him down, his attitude changed. He then took our order, and insisted on the fact that we should order more (we had ordered more than enough for our small table). We shot him down again, and he made sneaky little remarks about us, loud enough for us to hear. He came back a few times to fill our water glasses - funny part : he only filled one glass out of the 4 empty ones at our table.  Absolutely terrible service. This is enough to make us never want to step foot in there again."}
{"text":"We made reservations and arrived on time. We were promptly seated.  The seating is very comfortable.  The atmosphere is very casual.  You can even go \"dressy-casual\" at this restaurant.   The menu has good options that are both vegetarian and non-vegetarian.   The style of the food is shareable  plates. It's enough that you can make the palate happy with a wide selection of food.   We started off with guacamole and chips.  The guacamole was very fresh and delicious. It was nice and cold.  It has a lime and basil flavour.  The chips that were served with it were crisp and delicious as well.    My husband had the sliders and he thought they were amazing.    The next sharable plate we ordered was spicy rigatoni in a rosé sauce. It was cheesy and the sauce was excellent.  The flavours were very satisfying and the pasta was done al dente (perfectly).   The dessert here was absolutely amazing!  The molten lava cake was sweet, but not too sweet. The mixture of berries and banana and pineapple with the molton lava cake was a nice balance.    We had ordered the asparagus, but the kitchen had forgotten about it. Our waitress was nice and removed that from the bill without any issue.   Would go back again.  If you are in King West/Fashion district, try this place."}
{"text":"My best friend and I went to Fring's last night for dinner and were pleasantly surprised (especially after reading all the Yelp reviews). Our reservations were at 6:30pm and we were seated promptly. Once we sat down our server came over and told us the specials for the night and gave us the wine and dinner menus. After we ordered our food a young lady was walking around with a cart making cocktails right in front of the customers. We opted for the 'Aubrey Palmer' and it was DELICIOUS. It was Drake's whiskey and I think mango/pineapple mixture. Incredible drink. The first item we had was the toast with the prosciutto and that was by far, the tastiest part of the whole dinner. Every bite made you wish that instead of just a piece of that toast, you had the WHOLE bread loaf made just like this.   Next we had the bao, also, very good. Followed by the j.k frites and the surf and turf sliders that were to die for. The fried chicken and waffles were the only things that were just OK that we ate. It tasted exactly how you would expect fried chicken and waffles to taste, nothing particularly spectacular.  Overall the rating is still a perfect 5. The service was impeccable, quick and attentive. The food was delicious, and that cocktail was VERY worth the $18/per price tag.  Great date or girls night out place, definitely will be coming back."}
{"text":"Price range can be hefty but food experience was uniquely pleasant.  Cheeseburger spring roll was an intriguing concept. While I had my doubts, this item really worked. Filling was flavourful, the exterior was perfectly fried and the lettuce wrap provided freshness.  Drinks are pricey but they make some delicious cocktails.  Service was great and what you can expect from a restaurant of this level. I do recommend making a reservation in advance. I did not make a reservation, so ended up eating at the bar. However, this was quiet enjoyable. Bartender was entertaining and knowledgeable. The recommendations he provided to try were spot on."}
{"text":"When in Drake's city, you know I had to make a pit stop at his resto collab. We made reservations on a Sunday night. The inside is very nice, a classy, romantic ambiance. Service was a little slow, but I think there might've only been a couple servers taking care of all the tables. The cocktail menu was cute, I loved it. They were drake related drinks, I had an Aubrey Palmer. So good. For dinner, I had the beef short rib tacos and my fiancé had the skirt steak. It was a good amount, especially for what you're paying for. If you go to Toronto, definitely make a go there."}
{"text":"came here for my boyfriends birthday on Civic long weekend. As he's a drake fan, thought it would be a good way to celebrate.  I feel this restaurant is over hyped up because of the name attached to it, I did not enjoy my time here at all.  I asked on my reservations to be seated inside, yet we got a patio seat. I had mentioned on my reservations we were there for his actual birthday and that after we completed our meal if a cake could be brought out for him, I even spelt out his name for them. he was seated before me as I stopped at the lady's room. when I went up to ask to be taken to my seat I confirmed with not only the front desk but also the girl who sat us about the birthday cake, both confirmed his name said it wouldn't be a problem. I asked them not to bring the dessert menu, to bring the most popular dessert, it wouldn't be a problem but if they could just surprise him right after our last dish. did that happen?!? NO! they cleared our plates and then the server (whom I hadn't talked too about the cake) brings me a menu and tells me no one told her about the birthday... I was so upset! at this point he knew what I was doing and the element of surprise was gone.   I dined at Chef Lee's restaurant for my birthday and I can say confidently I was floored with their service and food.   Our water glasses were constantly empty, we had to asked for it to be refilled on more than one occasion.   the other server that came by once in a while to clear our plates and top off our water was WAY TOO BUSY entertaining her friends on the other side of the gate. there was a party that just finished and she was busy taking selfies with people who walked by.   on to the food, as a previous diner at Chef Lee's restaurant, I am used to my food being described to me before we dig in. that was one of the reasons I loved Lee's. Our food was brought to us and we were told what item it was on the menu and that was it.   for the price we paid, was not the service we received."}
{"text":"After making a rookie mistake and not reserving anywhere for dinner, we ended up finding a table at Fring's around 7:30pm on Saturday night after trying to get into a few other places around it. The ambiance was great as was the decor but I was nervous about the 3.5 star review. Our entire table (4 people) ordered the Summerlicious menu which turned out to be great value for money at $48 each for an appetizer, a main dish, and a trio of dessert. I ordered the avocado salad to start while hubby had the pulled chicken and we both opted for the braised beef as our main. I second guessed my avocado salad wondering how on earth they would be able to pull off an outstanding salad but boy oh boy did they deliver! The salad was more like a base of guacamole topped with onions and stringy dried potatoes. On the side were a few leaves of lettuce topped with a very spicy mango salsa. Together, the dish was phenomenal. The adobo chicken appetizer that my husband got was good but the avocado salad definitely had it beat. The braised beef was super delicious and sat on top of a parsnip purée which was outstanding. That dish too was amazing although I found that it was very heavy on the sauce which took away from the flavors of the dish. The desserts were just okay - nothing special. Overall, we had a great meal and everyone was happy with their food. The bill for four Summerlicious menus, a bottle of red wine and two rum and cokes came out to $307 so it wasn't too bad. The only annoying part at the end was that our waitress didn't want to split our bill between both couples - coming from Montreal, this is always annoying but after a bit of back and forth, she agreed to do it. Overall, great place and excellent portions/food! Would recommend!"}
{"text":"Food was good, but pricey ($90 for just me). The bartender who was serving me at the beginning was clueless, but the manager took over and he was very good."}
{"text":"This restaurant was awesome!  We requested to change our reservation a few times as we were running late and the restaurant was accommodating and honest about when we would need to give up the table based on the next reservation, which was appreciated. In terms of the service,  I have to say, I think I had one of the best servers of all time. She was attentive, relatable, relaxed and really shared a good vibe with us.   There were three of us so we ordered a few items to share and I loved every single one of them. We ordered the beet salad (so fresh and amazing), the crab cakes (the red sauce it came with was really well done), the pappardelle pasta (we didn't add the extra truffle but this was the best dish of them all) and the fried chicken (some of the best fried chicken I've had as it comes with a side of maple syrup, which is so Canadian).   With 4 dishes and a nice bottle of wine, the total, with a good tip, was about $330. A little on the steep side price wise but well worth every penny.   I can't wait to go back!!!"}
{"text":"Overall rating : 3.8/5   Good energy - not a fancy interior but a funky one. Great service ( had a male waiter-forgot his name)   Mushroom truffle pasta  was delicious.  The tacos were okay. Had the bao tacos and fish tacos. Ceviche ..Don't remember what it tasted like. Chicken waffle not bad! Slow cooked braised beef ribs was tasty!  TIP: Park across the street in the underground parking.  I think like most customers in their 20s.. I was hoping for Drake or some celebrity to swing by but NOPE it was just a regular Thursday night! So people, don't get your hopes up.  Overall... enjoyed the experience !"}
{"text":"The atmosphere of this restaurant is very nice! I find the food just average though- nothing spectacular and a bit on the pricey side.  We tried:  - butternut squash soup - fried chicken with hong kong style egg waffle - lamb rack (from their daily special recommendations)  The soup and the lamb are our favorites. The lamb  was very moist and flavourful.   The chicken waffle was quite heavy and i would recommend this for sharing - the two of us were quite stuffed after this dish lol.  Overall the food tastes pretty good, but it's not a restaurant that i would crave to come back for another visit. Service was pretty good- they made good recommendations on what to order.  If you plan to visit this restaurant, make sure you reserve a table as this place is always super busy even on weekdays."}
{"text":"The food at this restaurant is actually very delicious. At first I thought it might be over hyped because of Drake. But honestly, for the most part, it was worth waiting 3 weeks. (Pretty much always have to book 3-4 weeks in advance if you want to eat between Thursday-Saturday at a decent time in the evening.  I really liked the ambiance, the seating (Some chairs had fuzzy backs. Different.), and the music. The music wasn't overpowering to the point where I couldn't hear who was at my table. Music was pretty much anything OVO related.   For the food...  Caesar salad: Thick long chunks of lettuce. I normally don't like the hard lettuce but it actually tasted good with the cheese and dressing. Grilled octopus: Delicious. Flavorful. And i'm not usually a fan of grilled octopus either.. Wild king prawns: Super flavorful..must have Slow braised short ribs: Fucking delicious. i highly recommend this to everyone. It's juicy, tender, flavorful  I also tried their drink \"wasteman\". Must be named that for a reason..nasty af. It was around 18 dollars for a small glass.. I can't remember how many oz of alcohol but it tasted pretty strong. I also had chocolate lava cake for dessert which was of course amazing.   Great place for a date. I went with my boyfriend and 80 percent of the people there seemed like they were on a date as well.  I would come here again, I just wouldn't get any of the cocktails...too expensive."}
{"text":"Over priced but good food. Paying for extra wait staff etc... small portions for most dishes we tried."}
{"text":"Came here for dinner on a Sunday.   Pros - Reservations   Cons - Slow service (even when the restaurant was fairly empty  - insanely overpriced (when compared to quality of food and portion size)  - For the prices you'd hope for a classy ambiance but it's nothing of that sort. You're paying for the name. Nothing more.  - Average tasting food."}
{"text":"Went with a gluten-free preference/vegetarian eater and a picky eater (not vegetarian) and we both left super happy.  The staff were very pleasant and it was pretty damn busy but everything happened at a nice pace.  We had to wait at the bar for our table to be emptied and cleared but we didn't mind... but I am mentioning it, haha.  I had asked for an intimate table because it was for my love interests birthday so I didn't want to rush the staff.  Definitely a place you will spend time at, don't expect a quick turnaround if you've gotta watch the clock... enjoy your time here. Innovative pairings and lots of flavours that were packed onto each plate.  Had mussels, octopus, pear salad, steak... delicious. All of it.  Will be back again for a second round hopefully sooner than later."}
{"text":"This Is My First Time At Frings And The Food And The Dessert Is Great And The Service Is Great. ! ? I Loved Asian Fusion Cuisine But I Wish Yelp Could Create A Cuisine Called Innovative Cuisine That Would Make Me Happy  Ok. ! ?"}
{"text":"I came to Frings as a group of three for the first time last night and was extremely impressed.   To start off, the decor is beautiful and well done. The lighting is dimmed, which really sets the tone for the restaurant. Everywhere you look, you are able to find a unique detail in the staging.  Very modern and upscale.  The service was great. We ordered 6 or 7 items off the food menu and 4 drinks off the drink menu. Everything came to our table quickly. Our waitress was extremely helpful and friendly. She was very personable and could answer all the questions we had. She was able to answer right away; while demonstrating a large amount of knowledge of both the food and drinks. There was a mix up with one of the drinks I ordered, however, it was quickly resolved and she was very apologetic about it. It was handled extremely well.  The food is fantastic. Every dish that we received we all really enjoyed. You are able to really taste the different flavour that bring the dish together. I would personally recommend trying the cheeseburger spring rolls or the chicken and waffles.  The drinks were also very enjoyable. Most of the drinks are made using Virginia Black Whiskey (Drake's brand). They have a ton of selection of drinks that have different flavours and strengths of alcohol. I would personally recommend the \"Worst Behaviour\" or the \"5AM in Toronto\".  Overall, Frings was a great experience and I look forward to returning. I would say this is one of the best restaurants located on King Street."}
{"text":"We had a small group double date on this snowy night. They had a few tables but we were still seated right away for the reservation we made.   The ambience is intimate and dark. The booths are nice and cosy for small groups and couples.   We all had the Winterlicious set menu. The price was $52 per person.   The appetizer was the main highlight for me. I had the Peking duck waffle and it was the best combination of waffle and meat that I've ever had. I wish this was the main because it just goes down from there.   The crispy jerk chicken was more of a popcorn chicken than a jerk chicken. The flavour was alright, nothing stand out. The seafood option was better.  The dessert was decent because you got 3 different ones all for yourself to try, but again, nothing stand ou  The servers were polite but service was slow. We waited a long time to order and for each course to be served. It wasn't busy too.  Overall it was good to try this much-hyped restaurant.    Edit: Manager reached out and offered to make things better on my next visit. This sufficed for an added star and I will update this again when I come back. I appreciate when businesses offer to correct things, as no business is perfect. But good ones try hard! Thanks"}
{"text":"Went for a date night; food, service and overall ambience was amazing. We ordered oysters, truffle fries and deep fried artichokes as appetizers. Portions were very generous. The oysters tastes so fresh, truffle fries were stacked and the artichokes were surprisingly my favourite out of the three. We ordered lamb chop and also their paradelle as entrees. I couldn't finish the paradelle cause of the size. But it was delicious!!! Overload of mushrooms. Their lamb chops were cooked perfectly, so moist. We ordered their take on deep fried ice cream for dessert, also a 5/5. Loved how crunchy the batter was."}
{"text":"Went here with a few girlfriends - service was great and food solid. The octopus was incredible, tacos delicious and guacamole as well as ceviche solid. The only thing I'll complain about are the accompanying chips (deep fried and really not good), but other than that was good meal. Unique decor, and not as sceney as i expected"}
{"text":"took my best friend here for her birthday and it was such a great restaurant. First of all, the food was amazing. everything tasted so good! we got the eggplant parmesan and a spicy pasta (i forget the name) and they both were so amazing. We also got sangria (which were really expensive lol $35 for two) and a desert. The atmosphere was amazing too. Loved the service! Would def visit again!"}
{"text":"Came here on a Saturday night. Booked an 8 PM reservation by phone weeks in advance.  TIP - they block off the peak hours on open table here so if you want a reservation after 6 or before 9:30 I suggest you call.   I don't think I will return to Fring's. It was a bit too dark and way too loud. The table they initially seated us at was in the middle of the room with huge furry chairs that were slightly too low for comfort. We moved to a dark table against a wall, which was only slightly more comfortable. We had to yell over the music.   The service was excellent.  We had:   Chicken sliders  - 2/5 - nothing special.   Mushroom and prosciutto toast - 4/5 - very tasty but the prosciutto added nothing.   Salmon cruda - 2/5. This was a tremendous disappointment. Salmon sashimi with ponzu sauce and a jalpeno. Nothing I haven't had at like 100 different places. However Fring's puts citrus cured apple on top of the salmon which is like a PUNCH IN THE FACE of citrus. So sour it made my mouth pucker. We picked it off and the dish was palatable but NOTHING unique or special, which is really disappointing for a place by Susur Lee.   Lamb chops - 2/5 - mediocre. The lamb had almost no salt. The best way to eat this was to take a bite with the over salted okra on the side. A bit too much work to make the food taste good IMO.   Branzino - 3/5 This was good. I liked the pumpkin seed topping and the side dish it came with.   For desert we had the monkey bread which had the consistency and flavour of a cinnamon bubka. The ice cream it came with was good. 3/5   All in all I would say Fring's is overpriced for what it is and a tremendous disappointment if you are a fan of Susur Lee. This restaurant is extremely middle of the road. Not offensively bad, but there was really no standout dish. I would not return, nor do I recommend it."}
{"text":"5 stars!! Amazing drinks, cool vibe. Love the music (Drake, The Weeknd, PartyNextDoor) and the atmosphere.   The food was delicious! Chicken sliders were sooo good. And the pappardelle was unreal.  Also, Massimo the general manager is like my new fairy Godmother. Long story short, my first night in Toronto for a quick weekend trip, which was also my bday weekend, he invited me and my 2 girlfriends to a private party below the restaurant. Ended up being a super private, like no cell phones, no pictures allowed type of party with Rihanna and Drake and all of OVO, right after the Toronto leg of her ANTI World Tour. Can't tell you much about the party except...YOU HAD TO BE THERE, and IT WAS THE BEST NIGHT OF MY LIFE. Massimo, you are amazing. Not sure how I got invited but I really think it was divine intervention. Couldn't have asked for a better intro to the 6."}
{"text":"Absolutely amazing!!! But beware of high prices.  From the moment we walked in, the service was exceptional. The staff pay very close attention to you and are very welcoming.  It's a tapas style restaurant. For the 2 of us, they recommended 3-4 dishes. I'm glad we ordered 4 because the serving sizes are small. I tried the following: - Guacamole (I'm a huge guac fan and I have to say this is the best guac I've ever had!) - Grilled octopus - Beef carpaccio - Beef short rib tacos (tacos in a crispy wonton, very interesting and so good!)  Everything we had was amazing! No complaints at all. I had the Sauga City Mule to drink and it was really good too.  The ambiance was nice. Sit on the fully covered patio if you can.  I loved my experience here and only downfall was the high prices. Expect to spend at least $90 per person for food and drinks. If I was ballin' i would go here all the time!"}
{"text":"Good after work atmosphere. Reservations a must for now. Food is great. Server Corey was superb he's very attentive and can't stop raving about Susur Lee. Lol."}
{"text":"I simply just loved the atmosphere and their music there, coz we only went there for drinks, their service is just alright."}
{"text":"Booo. I don't know what was worse, the food, the service or the decor?! Being the business-savvey man that he is, it's evident that Susur Lee recognized a prosperous opportunity to join Drake in a restaurant endeavor. Sadly, the objective to make a quick buck while Drake is top of the charts overrides Lee's desire to prepare quality food.    Don't be fooled by this place. Although it appears to be chic and classy, it's just a facade. Everything has been cheaply orchestrated by someone who spent too much time searching DIY on Pinterest. The light fixtures hanging over the bar are made of transparent plastic coat hangers, the pendant table lights were fabricated with a simple lamp shade, an old halloween flapper girl costume, and a hot glue gun, and the glass candle holders are from none other than Ikea (I know, because I have the same ones). One could consider this to be economically resourceful, however I expect more from an establishment that charges $15.00 for a glass of low grade prosecco. Drizzy needs to step up his game."}
{"text":"If You're Reading This, It's Too Late.   I don't mind drinking the Drake kool-aid once in a while and the cocktails were delicious (and beautiful) indeed. The spicy maple chicken was the yolo dish of the meal.   Decor and tunes are exactly what you'd expect.  Apparently every Wednesday night someone performs smooth jazzy renditions of current and classic hip hop and R&B.   There are going to be haters, but why change, Fring's?  Just do you, you six god *praying emoji*."}
{"text":"The staff made me feel like a celebrity. 10/10. The food was incredible, HIGHLY recommend the crab cakes, asparagus, and eggplant parmesan.  I'd get married here"}
{"text":"When I visited Toronto, I had to come by here. My cousin brought me and everything was delicious. We got the \"Waste man\" to drink, but it was too strong for me to finish. If nothing else the 6 on a wave sign is worth the visit alone."}
{"text":"The worst and strangest part of my meal was that twice things were taken from me before I was finished. I went to the bathroom midmeal and literally my plate with half of my food was gone. I was starving! Then I was looking at my phone and a waiter literally snatched my drink. Fortunately my friend stopped him to say I wasn't done but so off! I've literally never experienced that at a restaurant. Also, when I went to tip and chose other. The machine didn't let me choose an alternative.   Positives they gave my friend who was celebrating a treat.   Order the Cobb octopus eggplant and pastas. Skip the tacos."}
{"text":"The restaurant is definitely still working out kinks/experiencing growing pains,    The Yelp reviews from the first week made me expect a loud restaurant with inattentive staff. Management must have read the reviews and tried to rectify them - unfortunately they over corrected.  Instead of fun music (which you'd expect from a bar style restaurant in King West by Drake and Susur) - it was light jazz, the kind you hear in an Air Canada lounge.    The staff were over attentive to the point of hindering our conversation - every member of staff that night stopped by our table to talk about the food/wine/ambiance/weather, which at first was nice but got excessive by the end of the evening.  In terms of the ambiance - its again just off - we were seated in oversized wingback chairs that looked like they had shag carpeting hot glued to them and there was definitely not enough light to read the menus.  The china said FRINGS on it - in a 90's steakhouse font.    Now the food - our server was very interested in our feedback so hopefully most of what I say has already gone back to the kitchen.  We had the home made ricotta on toast and it was phenomenal - I would go back to sit at the bar and order this.  The salmon crudo was slightly under seasoned and the salmon seemed like the cheaper grade stuff you get at an all you can eat sushi restaurant instead of the buttery, melt in your mouth feeling you would expect when Susur Lee is behind the menu.  The grilled octopus was pretty good - had a nice olive tappenade as garnish but we were confused by the boiled egg on the plate - it didnt add a complimentary flavour or texture to the dish.  The Fried chicken was super moist- but the delicious glaze made the breading fall off the chicken too fast. The bed of slaw under it tasted like something you'd get in the prepared food section at Loblaws and the small pile of greens in the corner was just confusing.  The King Prawns were well cooked but an odd addition to the menu - everything else we tried seemed to have a slightly Asian flair and this dish was strictly Caribbean.  (I also wish they kept the heads on the prawns)   For dessert we shared the monkey bread and plum tart - the hazelnut ice cream was phenomenal but both desserts were too hot for the first few bites and then went cold and hard.  Seemed like they were re-heated in an industrial microwave a la Starbucks or Subway.    Overall - the restaurant has potential but I suggest giving it a few months so they can get their act together."}
{"text":"We were so impressed with Derek and the staff's willingness to be flexible with our party of 16. Our service was impeccable, and to no surprise, the food was incredible. We could not ask for a better server. Thank you!"}
{"text":"What the hell with the service?  It was atrocious at best.  Food was pretty good, but completely ruined by server's inattentiveness and lack of serving.  My drink came after our second dish.  Seriously?  When asked about it he barely acknowledged nor did he come back with any drink nor status. It was also super cold and drafty in the restaurant.  The food does not make up for the bad service.  Avoid."}
{"text":"We had a great time at Frings.   It was the night of the All Star Game in Toronto and we had just watched the game. We head right over to Frings for post-game drinks. It was also Valentines day and there was a $95 prixe fixe which were not going for, but it was made available to us as an option.  The bar seating is relaxed. Décor is similar to Susur Lee's other establishments - lighting is key, lots of rouge glow, incredible detailing. Seating is comfortable.  The bar staff was incredibly friendly. They confessed to being just as star struck  as we were when we saw celebrities there.   We tried most cocktails - sweeter man, waste man, etc. My partner actually does not drink and they made him a fabulous concoction of black cherry juice and something else. Drinks were about $20.00 each tip incl.  We saw Kevin Hart here and his partner, we saw Drake's dj/ road manager, we saw Bun B here as well. There was a party going on downstairs with Lebron and the rest of the celebrities in town for the game.  The music was really good - obviously a lot of drake and rnb being played. It is a great place to unwind and relax and also to be seen (if you want to be :))  We arrived at about 10 and stayed till 2 am. Great night."}
{"text":"The ambience was nice and luckily we got the cool throne chairs/tables. We saw that a couple was leaving so we quickly requested it and our server moved us there.  My girlfriend and I ordered the chicken and waffle, the burger, the tacos, and the guacamole dip. The chicken and waffle was the best chicken and waffle I've ever had. The syrup plus the Hong Kong style waffle made it very special. The burger itself was below average, the tacos were delicious, and the guacamole dip was good.  I'd come back to the restaurant to try other food out , and of course order the chicken and waffles again."}
{"text":"This is a MUST if you love amazing food combined with a vibrant dining experience.  Frings is like nothing I have been to before.  The restaurant is gorgeous.  Appropriately dim with brick, wood, and leather.  Cozy tables, a perfect setting.  Chic and inviting without any pretentiousness.  The staff were amazing.  Service was timed perfectly.  The food was incredible.  We had several share plates.  The grilled asparagus was perfectly done.  The squash ravioli was delicious.  We also had the fried chicken, which was to die for!!  The drinks were delicious.  The whole experience was a treat for the senses.  I will definitely be going again!"}
{"text":"Felt like I paid $24 for $5 worth of Popeyes chicken. Didnt love the food but the atmosphere was nice. Disappointed as I had high hopes for this place. I love the other restaurants by Su Sur Lee so I dont know why this menu deviated from his usual standards. Didnt like the burger - the meat felt like they had blended in beef tendons which I didnt expect."}
{"text":"Second time coming here, about a year apart and it looks like not much has changed in terms of service. upon arrival we were quickly seated even though we were 20 minutes early for our reservation. But that didn't matter because it took the server about 20 minutes to take our drink orders and another 10 for the food order.   The best part was, the girl walking about with the Virginia Black cocktail stand or whatever you want to call it, Came by more than my server did.   Food was nothing to rave about it wasn't that good considering the price point, although we did get the price fixe menu which is suppose to showcase your food for customers so they would potentially return. I do not think I would come back. Not sure if my partner eat fast or they are just slow to bring out dishes.   Service ... kinda know my opinion on it.  Environment is dark with live music playin in the background, romantic but busy.   Two Stars; one for environment one because I'm being nice it was horrible but it doesn't wow!"}
{"text":"More like 2.5 stars because I've definitely had much better food & service at this price point.   I had been waiting for Fring's to open every since I heard about it and even got a friend to physically go there and check to see if it was opened yet, so when my friend was able to make a reservation for Thursday (2? days after it opened), I was super stoked.   My friends were already seated as I arrived ~10 minutes later than our reservation time. I was told they had been trying to the waiter's attention for a while but the waiter kept \"ignoring\" them aka pretending not to notice them. I didn't think it was bad as I got my water quickly but I understood what they meant soon after. I wasn't entirely sure if the waiter was ignoring us but he was definitely slow and didn't notice us after we tried to get his attention many times. For example, when he finally came to the table, we told him we were actually ready to order but he said he'd put down the order for our drinks first and then come back. Not only did he take forever to come back, but the two drinks didn't arrive until ~15 minutes later. He gave no explanation of anything other than heavily emphasizing that their food is served \"sharing style\" meaning that each dish will come out whenever it's ready and not together with everyone else's dishes. He would come and \"check up\" on our dishes by saying an awkward comment and then leaving.   For drinks, we ordered two Tom Skudras ($18). It has \"fresh lychee cactus pear juice\" in it but I tasted none of that. Did not taste the mint either unless a mint leaf came through the straw and definitely did not taste any raspberry unless they just meant the two raspberries that came as garnish. All I could taste was the rum and Cointreau. It was more tolerable after it was watered down but my friend hated it and did not drink it after her initial sip. When we asked for the bill, her glass was completely full but the waiter did not ask about it at all. I usually don't care if waiters do not acknowledge an uneaten dish/drink but I wanted him to do something about it to give this place some redeeming qualities.  For appetizers, my table ordered steak tartare ($20), organic salmon crudo ($18) and the wild mushroom & prosciutto toast ($10). As others have said, the tartare does taste a bit like pate and not like the regular tartare I'm used to having. There's a lot of tartare for the amount (5) of sourdough they give you so if you like piling it on or just eating it without the crunch, this would be a good ratio. Personally, I would have preferred more sourdough. The salmon crudo was good, especially the salmon, but there was nothing special about it. The toast was good, very creamy but like the crudo, nothing special. I would not be dying to come back for any of these dishes.  I got the pan seared branzino ($32) for my entree. It came with the fish sitting on top of a squash puree with almonds and capers on top of the fish skin. First few bites, I really liked it. The fish was very moist and seasoned lightly so it's natural flavours came through well. However, I started noticing fish scales with each bite. At first, I thought okay, it was probably just that one spot but it was actually throughout the whole fish. I wanted to enjoy the dish but the scales were just ruining the experience. It's annoying to have scales stuck in various places in your mouth and throat. If diners are not meant to eat the skin, they shouldn't have put the almonds and capers on top. If we are, then maybe I just don't know how to appreciate fish scales. The fish does come deboned though and this I appreciated.  There is a dessert menu available even though it doesn't show on the site. Everything is priced at $14 other than the ice cream selection ($12). Our table did not order anything though.   The restaurant or at least the bar area which was where we were seated was pretty dark but it didn't bother me, just not ideal for talking pictures. My friends found the music to be too loud but it didn't really bother me either. They played a few drake songs, some weeknd and other similar types of music. I didn't notice any songs replaying more than once. If you're into that kind of music, it's a great bonus. The table (for 4) we were seated at was much too small for more than 1-2 dishes at a time, which I guess worked out because we never had more than 2 dishes at our table due to the \"sharing style.\"  Overall, I must say I was disappointed. I had been really excited for the opening of Fring's but neither the food nor the service lived up to expectations. I'm hoping that it was just because Fring's is a new restaurant and they're still working on everything but at the same time, I won't be asking to come back.   *A reviewer said her waiter told her they don't do split bills (but ended up splitting it afterwards) but one of our friends asked for a separate bill and did not run into any problems or reluctance from the waiter."}
{"text":"The food & service was pretty good.. but $80 for a small pitcher of Sangria?!?!  Daaayyuuummm..  I started at the bottom but now I'm here."}
{"text":"This was my second time here. Overall, the food, ambience, drinks, and the service is great! Only thing is the price. I feel that the food is overpriced for the amount that they give you. If you're in town, I would definitely come here to try it once, but I'm not sure if I'll be back after trying this again."}
{"text":"Drake hype aside, this place is fantastic!  You'll have a fantastic time, drink phenomenal cocktails and eat even better food.  The service was impeccable and they have the best live, instrumental hip-hop band in town on Wednesday nights."}
{"text":"Ever since this place opened, I've been dying to get a reservation. Although the sign is quite modest and the place isn't the easiest to find, the restaurant lives up to the hype. Drake and Susur Lee's cached away restaurant is the perfect blend of Toronto-based references Asian inspired shareables. Come with a group of friends because all of the plates are meant to be served tapas style. Although the drinks are a bit on the pricey side, the Sangria is DEFINITELY worth the price.   The cocktail waitress came out with a Sangria cart and explained the process while serving the cups to the table. Great service. Great food. Great atmosphere."}
{"text":"For some bizarre reason I had really low expectations for this place - maybe just because it was somehow associated with Drake and Susur Lee that the quality would somehow fall short however, it didn't at all. After waiting a lengthy period of time and getting a 6:45 reservation on a Tuesday night (I'll take it!!!!) I was pleasantly surprised by how chill the vibe was in this place. The music was perfect....it is a bit dark -- especially for my 32 year old eyes that require bifocals like some 72 year old but all in all great great great. I arrived a bit later than the rest of my party due to some heavy traffic so they had already dived into apps and smaller plates. They had the avocado toast, tuna tartare and thought both were great. 3 of us got the braised short ribs and baaaaaaahhhhhhh goodness in my mouth. These things were cooked for 18 hours and just melted in my mouth. They were so tasty that they've made me want to return to try every other inviting item on the menu.   Keep in mind, these are more shareable items -- which I always love doing with a group of people.   The only thing I found inconvenient was that this place is incapable of splitting a bill. So, get your fingers, toes and handy dandy iPhone calculators out (because everyone knows these numbers aren't magically being calculated in my head....)"}
{"text":"CONFESSIONAL: Thur. July 28th, that one time I hesitated on finishing my dinner hoping to catch Chef Susur Lee walk through hahaha. The servers kept insisting he was leaving Lee Lounge and due to walk in any moment now. LOL I stalled and stalled LOL   But back to Fring's!  I made my reservations in advance so when we arrived there were no issues with seating. We were seated and greeted almost immediately.   Our server was very welcoming. I kinda knew what I wanted *having stalked social media pics* but everything on the menu sounded so yummy.  The décor in Fring's is awesome - from the red chandelier lamps to curtains to the furry chairs!  We were just a party of two so we sat in the mid section on the floor. We had no issues with bumping/space while dining.   Though they have a good amount of entrée size meals, the menu is set in a tapas-style so that you and your guests can order a bunch of things and share. No complaints on my end - I've had this style of dining before. Price wise - its average for a \"named\" restaurant. I've actually been to a few non-famous restaurants and was met with the same prices.    TIP:  1) The Fring's Sangria is both beautiful and delish. Get yourself one or two or three!!  2) If you really want to enjoy Fring's - go when the traffic is low. Try dinner on Thursday evening instead of the Saturday. We were not rushed at all. I have to come back for the monkey bread desert I was too full this time!  WHY 5 STARS: Well ... I'm not a celebrity but from the time I walked in to the time I walked out I was treated well... the food was aesthetically beautiful, fresh and delicious and the service was excellent."}
{"text":"So I finally tried this place out. Been waiting awhile since reviews in the early days when it first opened weren't so great. So I waited awhile till they got their service and kitchen right. Fast forward few months later ... here I am trying it out. So far so good. Our waiter recommended additionals since we were a party of 7 and the tapas menu were more for 4 people to share. He also took our order for drinks right away but it never came.  We had to ask what happened to our drinks. But they were very fast to rectify our missing drinks. A cool touch was a waitress pushing a cart of house made sangria which she put together for us in front of our table. Cute added touch there. We ordered a whole bunch of items in the menu (see photos) and we also ordered some nice cocktails off their drink menu (see photos). The food came pretty quickly so bonus for that (since a lot of the earlier reviews said that food took too long and service was horrible) ... I didn't feel that way this evening. Everything came out in a timely manner so we weren't left waiting for our orders for too long.   For drinks I highly recommend: - Proper tings  - Raspberry Mojito  - House made Sangria - Spicy old fashion   For food I highly recommend: - Ravioli  - truffle fries - Chicken sliders  - watermelon salad with fig (except I found the price for this a bit on the pricy side. It didn't give me a wow factor the price of this should be less. It's watermelon with literally mint leaves and a sick of fig)   Susur came into the restaurant around 11pm to see how things were going. He seemed casual and we asked if he'd join our table for a photo and he did. Very much appreciated. It was nice of him.    Overall experience I give this place a 4 star only because we still had to find out where our drinks were while we waited 30 minutes.    I'd come back here again but not with a party of more then 4-5 people ... 7 people it was hard to share dishes because each dish only feeds 4 people and not everyone gets to try everything."}
{"text":"Great fusion. Really enjoy the tacos.   The atmosphere is cool. Very Toronto hip   Interesting cocktails."}
{"text":"I'll be honest, the hype brought me to make a reservation at this restaurant but as the true foodie that I am, I knew it will not be disappointing.   I was in Toronto for the weekend, made a reservation for party of five, upon arrival we were seated promptly,  After reading the review now I wish they would've told me they had a patio. I always prefer al fresco dining when the weather is pleasant.   The waited did a good job in up selling the pre-fixe menu, we decided to be spontaneous and go for it. Everything was delicious. My favorite were the short rib tacos, the octopus, the duck, fried chicken and the monkey bread.   The sangria is phenomenal, very refreshing.  The music gets an honorable mention. I'm Dominican, they were playing bachata which is rare to hear in Toronto. All the vibes were right, Def satisfied. and got a glimpse of Susur, It's always a nice touch knowing the chef is present."}
{"text":"It was tasty. Would I go again? Probably not. The atmosphere is way better than the food. There wasn't anything specific that blew me away or I would crave. The service was great but of course, like every restaurant in Toronto, it's allllllll about turnover so we felt very rushed. Our bill was brought to us immediately after eating and we had about 3 different waiters come to our table asking if we needed anything else. At one point I said \"yes! A moment to finish our conversation without being interrupted!\" Ugh! These restaurant owners need to take a page from Southern Europe's page and just chill out."}
{"text":"My wife and I came to Fring's before a show.  The food was Amazing!  We ordered a Kale Caesar salad, short rib tacos and the signature Lee's cheese burger spring rolls.  The Kale Caesar came with a pleasant surprise of a spicy kick.  The cured bacon mixed with the fresh figs offered an refreshing taste.  The short rib tacos were very good - they came with a thin slice of red pepper to add the spicy taste - a perfect combination with the juicy short rib.  We liked the spring rolls too but found the parsley was a bit too strong.  The staff was very friendly and we had a great time at Fring's."}
{"text":"We were a party of seven and ordered a variety of items, from the Tuna tartar, the spicy caeser kale salad, burgers, cheese burger spring rolls and tacos, all of which were fantastic.  The food is great!   The burger was super messy, be prepared to either lick your fingers, order extra napkins or use a fork and knife.  That's the good news. The not so good news - the service. Nothing worse than great food and mediocre service.   People got meals earlier than others (hate that) which made wait times seem even slower (go ahead and eat, no I'll wait, no please eat while it's hot...) drink orders were forgotten prompting us to have to get up out of our seats to chase down our waitress to attend to our order. But wait! They have enough staff to come by and wipe your dining area after they've bused your plate - you know like a fine dining experience where a small blade is used to clean your table cloth of crumbs in front of you, but they can't get meals out together or serve your beer with a GLASS (which we had to ask for).   Oh - beer selection - ready for this one. Nothing available on tap, which is no problem and available by the bottle Steam Whistle, Heineken, or Stella. Virtually all the same beer. All lagers, nothing distinctly different about them really. That's like having only chardonnay as a wine choice. How about a lager, an amber ale and a dark beer (Guinness) or a red ale?  Finally we were visited by the GM before we left who gave us his card and asked us to give them another try and he'd buy us an aperitif and appetisers. In my world you don't ask a customer who had a poor experience to come back and spend more after a poor experience, you simply adjust the bill, apologize, take it on the chin and hope for the best...   Go for the food and hope they tighten up on the service and put someone new on the beer order..."}
{"text":"Came here for date night and we ordered 6 dishes to share. The bao and eggplant parm were edible but were under seasoned and a waste of calories to consume to be honest.  I was also very disappointed with the truffle fries. Despite the shavings of truffle on top, it lacked flavour. Maybe use truffle infused oil as well? Enough with the negative, here are some highlights: The tacos were flavourful and very good. However, the best dish was the salmon tataki! I wish I had ordered six orders of this instead and I would've been very content! Soooooo delicious!"}
{"text":"We got seated by the emergency exit door where it seems to be an extra space. It was cold and ruined the whole dinner."}
{"text":"I'm a Drake fangirl so dining at this restaurant was a must while I was visiting the 6. FYI, for those from the States, Chef Susur Lee's status is comparable to Bobby Flay (Fun Fact: They had an Iron Chef battle and they tied!). Pro tip: Make a reservation via OpenTable!  I would describe the cuisine as Asian comfort food. Our server suggested 4-5 plates but we were feeling stuffed after 4. Their drink menu is also very extensive and consists of several different wines and cocktails. You can also choose from a 5 or 9 oz. glass of wine, or the whole bottle! We ordered: guacamole (I would probably do without the olives, but that's just me), freshly chucked oysters which came with all of the fixins', grilled octopus with potato salad and the mushroom medley and black truffle pappardelle and it was ALL flavorful, hearty and delicious.  The restaurant itself is cozy and romantic and ideal for a date night. Hiphop and r&b songs are playing softly in the background and there are even fuzzy chairs to sit on! The service was on point throughout our meal and we felt very welcomed there. There's also 6 memorabilia and a glow sign that says \"6 on a wave\" in emojis downstairs right by the bathroom.  Definitely a must try when you're in the 6."}
{"text":"It was about time I went to Fring's after hearing and seeing a lot of my friends come here.   My partner and I got a seat on the patio which is literally beside Brassaii I believe. The ambiance was lovely, more of a fancy romantic date feel. Our server Anthony was professional and helped my partner pick out a wine that he greatly enjoyed and when Anthony was done his shift he let us know that someone else will be taking over and that he will be leaving!   The menu is based off tapas, so sharing.  The price point is a little on the higher side but then again very alike to the Lee's prices.   Beef short rib tacos - I highly recommend this, it was delicious and I loved the crispy wonton taco shell  Crab cakes - I don't usually get crab cakes when I go out, I'm pretty sure these are my first, but I'm so glad I got them. There was a big amount of crab pieces inside which is good because I hear a lot about restaurants not putting enough crab in the crab cakes  Parmesan asparagus - We decided to get this because we wanted to feel a little healthy. The asparagus was cooked to perfection and didn't have the bitter uncooked taste to it  Cheeseburger spring rolls - I was quite hesitant on getting these because when I went to Lee's and got them they were super messy to eat but my partner didn't listen and got them anyways and he has no regrets. I really enjoy the spring roll and I loved how you can taste the Vietnamese fusion on it because of the pickled daikon and carrots. But yet again it was messy to eat but still delicious.   Gave a 4/5 because prices are high but besides that everything is perfect. I am now determined to try the rest of Susur Lee's restaurants in Toronto."}
{"text":"This is definitely a restaurant on the fancier side. We came here on a Friday night. We ordered the guac, the crab cakes, surf and turf sliders and the fried chicken. The food overall was very good. I thought the guac really helped fill us up more so than the other dishes. The fried chicken, sliders and crab cakes were quite good. The ambience and attentive service were definite plusses. The different kitchen staff came out to explain the dish to us in great detail.   Side note, I loved the drink names. I  was a bit disappointed in the cocktail prices.   Overall, It was definitely interesting to see a Drake and Susur Lee collaboration come to fruition I liked the decor and overall ambience. I probably will not return unless I happen to be in the area."}
{"text":"Frings has delicious food. I had the heirloom salad and short rib and it was fantastic- probably one of the best entrees I've had.   The reason for the 2 stars...the service. It was awful. To start, the server took away the drink menus before we got the chance to order drinks. When she took the food order we asked for the menus back, but we never got them. So, I cannot review the drinks because I was unable to try one.   From the time we sat down until we ordered our food it was nearly 35 minutes...mind you this was without a drink order in between.   We ordered double espressos at the end of our meal, but only got single espressos, but we're still charged $9. Even after we questioned it.   We had a party of 12 and were told we had to make 2 separate reservations for 6, which we obliged. However, at the end of the meal we were presented 1 check and were told it could not be separated despite the fact that they required us to be treated as 2 separate tables.   For a restaurant at this level and expense, my expectations were much higher and I was left very disappointed."}
{"text":"Very loud cool trendy restaurant. We ate at the bar. We went on a Friday night and they squeezed us in at the bar....we usually like to eat there....it's fun. Fantastic food. We split 4 items and all were awsome. Our bartender was great and the place was packed.....we also saw Drake there with his buddies. Mojito's were great too!"}
{"text":"We had a really nice experience. Friendly staff and really nice atmosphere. Each dish that my friends and I were sharing was absolutely delicious. Loved the grilled octopus, chicken and waffles and the crab cakes!"}
{"text":"I've yet to eat here, only been here after hours. Thank you for being open, I'm so grateful. From the bottom of my heart thank you. Being open when you were honestly saved my life."}
{"text":"Dined early at the bar as there were no spots available for reservation. service was great and food was prompt. Went w my daughter.   Enjoyed and shared the Kale Caesar Salad quite good w Chicken sliders. And split a Susur burger and fries. All delicious. Great decor.   I'd return and recommend."}
{"text":"Quick recap - love Susur Lee and I wanted to love this place, but I don't.  Susur Lee and Drake's swagger - what could go wrong with the combo? Surprisingly, the food. Having seen Drake the night before at ACC, I wanted to go to Fring's to cap the weekend with one more great experience.  Don't get me wrong - the food was not bad. Started with $20 truffle fries - good but not great. Sorry but I expect great food for $20 appetizer. Next was Spicy Rigatoni Rosé - again quite good but not great. Second entrée was Pan Roasted Salmon - once again good, but not great. Dessert was Crème Brûlée and I hate to say this but it was one of the worst I've ever had.  The ambiance was great and very cozy. Service was great, expect when we left - getting the bill took forever. The server while very pleasant had too many tables to serve and he was running around like crazy. He tried to save some time by bringing a single bill to our table without asking, but we wanted a split bill. He said the terminal doesn't allow that (first time I ever heard) and he was splitting the bill by calculating the prices by using his phone while looking anxious by the fact that it took so much of his time.  I might come back here for drinks, but not food. I ended up paying $127 for a meal that was worth maybe half of that."}
{"text":"Love this restaurant. The interior decoration is amazing! Very \"drake-style\" I would say ;). Came here on a Saturday night. We didn't do winterlicious but regular menu pricing is affordable. The chicken waffle was amazing! Definitely recommend this place to everyone. Make sure you book in advance though."}
{"text":"Its a nice place if you like exotic food. I personally love octopus, and they do a very good job preparing it.  The staff is friendly, they are a little bit in a rush, the only reason I have given this 4 out of 5 stars is because the seating outside is not that great, it doesn't seem to have a very clean feel to it due to the nearby passersby, and outdoor cash register?? that is taking up half of the walkway near one of the tables...looks odd. There are some better and some worse seats outdoors, so make sure you choose wisely."}
{"text":"For a restaurant of this caliber, it was quite disappointing to find that 3 of our 4 dishes weren't seasoned with salt. We ordered the tomato and burratta salad, the gnocchi, the crab cakes, and the fried chicken and Hong Kong waffle. The fried chicken by far was the best dish and would gladly return to just eat that. The Aubrey Palmer cocktail was also the highlight of the restaurant.  My suggestion for Fring's would be to come for a drink and have a small bite to eat, which would only be the chicken and waffles."}
{"text":"Cool spot. Beautiful people. Loving the music. Went there for drinks with friends around 11pm and had two desserts with our cocktails which tasted pretty good (lava cake and the monkey bread). Nothing sensational but good and well presented. You can see that there are still a few growing pains of a new restaurant that's trying to learn its flow, with Front desk staff not really knowing when the kitchen closes, and not getting the usual table clots and water that comes with having some food served. No big deal at all though, and the waitstaff were super keen, cheerful, and were checking in on the regular. Fun vibe. And if drake came in and pretended to be my homey I'd be so psyched."}
{"text":"Amazing food. Decent portions to share with the group. We had 4 dishes, a side, and a dessert. Didn't need to wait long for food and were full at the end.   We had 3 glasses of sangria (which might be the best sangria i've had). Not sure if it's worth $80 a pitcher but definitely try a glass."}
{"text":"Food is great, atmosphere is great, service is okay.  Dont even bother listening to the waiter saying its a \"sharing is caring typa thing\"  just order and eat your own food and dont share with your friends. As great as your friends are, you know you all too hungry to eat one bite off one dish at a time."}
{"text":"Ive been to Fring's a couple times and I havent been disappointed. Came here friday, ordered 4 drinks, 2 bottles of wine, 6 dishes + 1 dessert and it was about $100/person which is very reasonable for the amount of alcohol and food we had! For food, we started with the spicy kale salad with delicious bacon bits, beef carpaccio (good but portion could be a bit bigger), chicken bao (2 orders), chicken and waffles, brussel sprouts and truffle frites. The best dish was the chicken bao.... the flavour combination is just right! Must try that!! They should offer plain fries though, truffle seems abit overated nowadays, and pricey! Chicken and waffles was perfect for 4 to share. And to finish it off, we split monkeybread which is a classic. Would come back here for another night out ... and the chicken bao! I would give 5/5 if they increased their portion sizes alittle bit (i.e. beef carpaccio and kale cesar salad)"}
{"text":"Generous portions, and delicious food. Shared one appetizer and got an entree, and that was plenty. Excellent drink list. Our waiter was nice, but service took too long. We had to wait over a half hour after being seated to actually order food. And it took way too long to refill water after I asked. But man, don't live of di hype huh? Check it out for yourself."}
{"text":"Went here with a friend who was a local.  We had a great meal and we didn't even order anything.  The waiter and the manager were great...  they told us to let them bring a bunch of different things to the table and we put our trust in them.  It was a great decision, we tried numerous small plates and they were all very good.  Drinks were expensive, but ambience was very cool.  If you can afford it, give it a go."}
{"text":"I know when that Hotline Fring's, that can only mean one thing.  Okay, seriously. Drake jokes aside, I really enjoyed my visit to Fring's. Susur Lee never disappoints, and he doesn't start here. Food-wise, I'd definitely try the fried chicken, the rigatoni, and/or the chicken sliders. Furthermore, our party tried a sizable chunk of the drink menu and the general consensus was that the Sweeterman was the best of the bunch, so try that too!  The place was on the smaller side, but not cramped. It's dark, moody, ambient, and candle-lit - the whole nine yards. The music? What do you think? While I was there, I heard a combination of Jay-Z, The Weeknd, OutKast, and... Drizzy. Of course.  Oh, and for whatever reason, the detail that stands out the most is the fact that on the bathroom doors, it says \"6 Gods\" and \"6 Goddesses\" instead of Boys and Girls.  Thought you should know."}
{"text":"I've been here twice now: still no Drake sightings, but one sighting of Susur Lee!   The first time was in March 2016 for my birthday. It was hard to get a reservation (even for 2) but we finally got one, and when we arrived, the place was not busy at all. I think it was a scheme to build the hype and anticipation.  The second time was in July 2016 when my cousin and I were walking down King, trying to find a patio to have a drink on. We decided to pop in to see if they could accommodate us, and they were able to!  The food was good- tapas style, so small, shareable portions. The waiter recommended 4 dishes would fill us, and we ordered 4 (see pictures)... It was way too much. We also ordered 1 sangria, and in total, the bill came out to $118 including tax for two people.  This place is a nice treat but I wouldn't go out of my way to come back. I much prefer Lee's Restaurant over this one."}
{"text":"The food here is unbelievable - as are the cocktails! It definitely has nice ambiance as well - my only complaint is that they make a big deal about splitting bills for parties.. \"it's too time consuming\" is what I was told. Your customers aren't worth your time..? Left a bad taste in my mouth..."}
{"text":"This place is definitely worth checking out! We went as a group of four and were seated in a comfortable and lush booth near the bar. We shared multiple dishes but my top picks were the mamas meatballs, the prawns and the cesar salad. Good food, great ambiance, and friendly service."}
{"text":"The hype of Drake's restaurant is real and that is one reason why I decided to make a reservation to Fring's. The main reason was because it was my boyfriend's birthday and his favourite artist is Drake so the first thought in my mind was Fring's.  First off, I booked a reservation from almost two months in advance and I still got a pretty late time. So if you plan on dining early, I suggest you book as early as you can because I tried and I still had to get a 10:45pm reservation although I don't mind it but some people might.  Second, I LOVE THE VIBE of this restaurant and I definitely didn't expect it to be so small? I mean I didn't have high expectations for the interior of it (only high expectations for the food) but I really thought the restaurant would be bigger. I'm not complaining though cause I LOVE the small tight knit low key vibe the restaurant has got going on. Also, I wanna point out that the restaurant smells so damn good right when you walk in. Probably because of the candles that are everywhere.  Lastly, I enjoyed every single bit of the food. Maybe 5 stars is a high rating for such a hyped up restaurant (because it's owned by Drake) but I definitely love the food enough to come back. I ordered guacamole which was AMAZING and I do recommend it! I also ordered the jerk pork bao, maple brussell sprouts and the Susur burger. The jerk bao has a hint of spice but the bao is nice, moist and soft. The maple brussell sprouts were sweet, crunchy on the outside and soft on the inside and my boyfriend enjoyed it a lot. I didn't really like that they had onion balls in it (not a fan of onions) but it's something different.   Last but not least, the susur burger was tender and soft with great flavours but it made my bottom bun soggy and I had to hold it really tight to stop it from falling apart. But the fries were cooked to perfection, I loved it!  Overall, I would come back and try everything else on the menu."}
{"text":"Really nothing special. Presentation wasn't anything amazing and the food we had tasted good but not for the price.  The service was inconsistent- we would have some servers set the food nicely and describe it, while others just dropped it down hard and left.   The BEST thing was the crab cakes! They are the best I've had in Toronto and remind me of the ones in Maryland. These actually had chunks of crab without fillers and fish. I would come back just for these.   Cheese burger spring roll wasn't as great as I had envisioned and I don't know how this dish cost $17.  The tuna watermelon ceviche was pretty good and refreshing.  The chicken baos were okay, you can get similar ones for half the price at night market.  Braised beef was soft and well seasoned, but that's not really that hard to do...  Really does not live up to the hype."}
{"text":"This is a great place to wine and dine your date, or others you want to celebrate with!  Located at Spadina Ave and King St W, it's the perfect place to have your dinner before a great night out.   Ambiance: Swanky, delicious, and cool. Servers are super nice when you ask them anything. I did have to ask some of the servers to refill my water so that was a bit off but not bad at all. Decor was super nice though!   Asian Steak - It was quite good, however it was quite heavy on the potatoes. Grilled Octopus -  Although it was nicely flavored, it wasn't much for a main course. Good thing my company ate beforehand.   Overall, a good restaurant however there are many better restaurants on King St W."}
{"text":"After waiting for so long to try this place, I can say it was a great time!. We went on a Sunday night, it was not busy, which may explain why the service was FANTASTIC! Our server was attentive and was happy to make substitutions to food we ordered, very nice.   We did not order a main course but instead ordered some some apps. All the food came out at a good time, we never had too much on the table at once, and plates were taken away and replaced with new orders very timely.  Everything we ate was generally good, I really liked the toast we ordered. I would skip dessert however. If it were not for the bad dessert this would have received 5 stars.  Oh and the atmosphere was great! great music, was not pretentious at all (many people wearing t-shirts and kicks). Highly recommended."}
{"text":"This is my second time visiting Fring's and it was one of the most disappointing dining experiences. Our menu was fixed due to the size of the group which should make it easier on the kitchen because they already know what they're serving us. Just for some background, when ordering the fixed price menu - it is a sharing menu. So for example, a group of 16 people, would be served 4 servings (1 per group of 4) of a particular course.   We were seated in the lower level lounge and there is a small bar there to cater to that room specifically. The first issue was timing. Our reservation was for 9PM and we were promptly seated at such.  Once we were all seated, the first round of appetizers did not come until well after 10PM, the mains until 11PM and the dessert until 11:45PM.  When all was said and done, bills settled, it was 12:30AM. Why were we dining for 3.5 hours??? After waiting for so long between courses, I was already full after the appetizers due to such poor timing!!!  Secondly, the servers seemed incapable of handling drink orders. The servers never even came around to take drink orders from us so we ordered drinks from our server when he came by to ask about allergies pertaining to the fixed menu. Surprise, surprise, never received half of the drinks! A simple bottle of beer took over 45 minutes to arrive after two reminders.   During the last course (dessert), only three servings were brought out. The entire night, all courses, the servers were bringing our four servings (1 serving for each 4 people), but somehow, they managed to forget that a fourth serving of dessert was needed. When this was brought to their attention, they said they would go ask the kitchen. 20 minutes later, the missing dessert comes out. Mind you, it was three scoops of sorbet (which takes 20 minutes to scoop out and dish) at 11:45PM at night.   This is not to take away from the fact that the food quality was good, but the service is absolutely horrendous. The servers never once apologized or seemed aware of their shortcomings. An automatic gratuity of 18% is already tacked onto our bills for larger groups so what do they really care? I've had better service at hooker Harvey's and McDonald's. Fring's you are an ultimate disappointment, you couldn't even get our bills right.   I would not suggest anyone to dine here in large groups on a the fixed menu. Just save yourself the headache and go with a couple of friends and order the burger. Until this restaurant can improve it's disgusting customer service."}
{"text":"I had a fun night at Fring's. Our server was very nice and super-attentive to our every need. The vibe is decor is cool. The live music was great. So why only 3 stars? Well, knowing this is a Lee establishment, I was a little disappointed in the menu. Very bare bones, tried and true dishes that you find in many other chains. Where's the creativity that made Susur Lee a force to be reckoned with? I get that they want to offer a simpler menu that will appeal to everyone. But the price should reflect that simplicity and at Fring's you are paying top dollar. I just don't see the value.  Probably would not go back. Lots better places for the money. Still glad I checked it out. I had spicy asian tuna tartar which was light and not spicy at all but very tasty. I also shared a Vietnamese lemongrass chicken in a lettuce wrap. A little messy but fun to put together. My date had the chicken and waffles, a generous portion and very good. We did have monkey bread for dessert which I did not like. It was rock hard and way too sweet. One of the interesting features offered here is a travelling champagne cart. We did not partake but a lot of the guests were.  It's hard to get a reservation but there were a few vacant tables while we were there. Maybe in case some of Drake's friends pop in."}
{"text":"The grilled octopus is one of the best if not THE best in the city. I was very impressed.   From a design perspective it was very fashion forward. I loved the interesting use of cow hide in the most unexpected places."}
{"text":"Came here with my boyfriend and two other friends. I had the squash ravioli with lobster, the veggies were SO bland. I didn't even finish it, and there was literally 3 pieces of tiny lobster in it. So ridiculous for almost $40.00. My boyfriend got the chicken and waffles, they were sooooooo good. I really wish I got that instead! Our waitress sold us on the sangrias but when we got them, they were so bland and didn't taste like they had much alcohol in them, and on top of that they were so expensive. Overall I feel like this place has a beautiful atmosphere and nice ambiance for a date night but they are super overpriced and over rated."}
{"text":"For all the hype about this restaurant, i was truly let down.  Maybe it was the high expectations  i had especially coming from a restaurant by Susur Lee, but still. For the price, and resteraunt the service was exactly what you expected. Great and friendly.  You would expect nothing less from a place like this.  So my ratings is more about the food.  We ordered the Crab Cakes, Tacos, Sliders, Guac, Truffle Fries, and pasta.  And the dessert (which slips my mind)  The best by far was the Guac to me.   The Tacos were great too.  The others was in my opinion meh.  Truffle fries was disappointing to the table.  Carb cakes was (ok i know this is going to sound weird) but to fishy.   Pasta was good.  not great.  Sliders wasn't mind blowing.  Had a table side drink service which was fun, had a few shots with that.  I would come back as the location, and the bar is pretty cool, but probally more for drinks next time.  I probally hold Susur Lee's food to a higher standard, as Lee's is probally my fav restaurant in the city"}
{"text":"Great food, great service. Like any new project it takes a little time to work out the kinks. Highly recommend the chicken sliders and spicy rigatoni.  That's what I had for dinner Friday with a glass of sangria!"}
{"text":"I did not expect to like this restaurant this much. Actually, I didn't really expect or plan to like this restaurant much at all.   I booked a dinner at Fring's for a client dinner because a few people were coming in from out of town and I thought the novelty factor of it being Drake's restaurant would be fun. The menu looked good online, but expensive and I wasn't sure if we would enjoy much beyond the decor and the cocktails.   The experience was completely different. From the moment we walked in the door the staff were incredibly helpful, they moved us to a different table because the booth they had given us wasn't the best for a client dinner - no one would end up facing each other in the U shape. Our coats were checked and our cocktail orders were taken right away.   Then our fabulous server Mark totally took control of the show. He came over, introduced himself, suggested his favourites and then proceeded to send us wave after wave of delicious dishes.   Also: this restaurant is a hidden gluten-free gem!! I always make a note on my reservations that I am a celiac and would appreciate help navigating the menu, this was the first time that my waiter had been made aware of that note. Mark quietly took care of my dietary restriction, and another diner's no-pork dietary restriction without making it the focus of the business dinner. That is such a wonderful feeling - because I never want to come across as high-maintenance, but I also don't want to leave a dinner feeling physically ill.   The chef's choice dinner that Mark sent us included:   Guacamole - SURPRISINGLY good - fresh with a warm chipotle smokiness Tuna tartare - sparkling and bright  Grilled Octopus - very good  Bao - GLUTEN FREE BAO with Beef short rib, julienned veggies and frings sauce. 10/10 OMG I haven't had bao since being diagnosed celiac 8 years ago! I will come back for 1000000 more of these.  Maple fried chicken and waffles - not gf but everyone else loved this!  Cobb salad - good  Miso salmon - this was amazing  Beef shortrib - I was soooo full at this point but kept eating this because it was so tasty!!   There was supposed to be dessert too but by this point we were wayyyyyyy too full.   Mark still sent out a couple scoops of delicious mango ice cream, which we happily devoured.   It was the perfect sweet end to a fabulous meal. I was completely blown away by the quality of the food and the level of service. With a celebrity owner, I expected this spot to rest of its laurels and put out so-so food. I was so wrong - and so happy to be wrong!   I'll be going back to Fring's ASAP - and so should you!!"}
{"text":"They did not want to take our coupons. And they took forever. We didn't know what to do. Th y continually said someone should be in their way but we waited over one hour and no one showed up. Awful place. Better go to Patria. Drake never shows up."}
{"text":"Came to Frings, Drakes restaurant, on a Monday night with 6pm reservations. The service was great and the place was clearly too cool for me. But with great friendly service it doesn't matter if you don't feel like you fit it. A drink cart rolls by every now and then with prepared cocktails. Our waitress picked our foods for us - and was confident in being able to profile us to do so. She did well - although I cant remember what we had. I don't think the bill was cheap but the experience was good and the food decent so I'd go back."}
{"text":"Great restaurant! The atmosphere was amazing, and the service was great. Our waitress was very helpful and nice, and he food was amazing, especially the grilled octopus! Would definitely visit again. Highly recommended."}
{"text":"2nd time at Fring's.  2 Stars because the food was good.  This time with Family + 1 child.  Saturday night, busy.  Susar Lee greats us at the door. Nice fella.  We are immediately seated at the front room, really nice space.  1 French guy as our waiter + 2 servers + 1 girl + 1 tall guy with CIA headset roaming around this 10ft x 10ft room. Not sure why we need security.  We give our orders to the French guy.  The food starts to come.  Crab cakes are excellent, as is the Papardalle pasta; FYI someone at our table hated it, really they hated the truffle flavour. Savages.  Ok after 8 courses, the guy with the headset is now a fixture, hovering above our table. Constantly staring at us. Eventually he takes all the plates. This is clearly not a job he does often or well. But why?  OHHHHHHHHHHH he wants us the fuck out.   French waiter, after receiving a whispered speech, at our table from CIA Steve.   \"umm ok are we all le finished? or shall I bring the desserrrr menu?\"  Me: \"no, you can bring out the remaining dishes that we have been waiting for.\"  French waiter \"oh, I am not a'whereee\" riffles through his notes  Me \"well I am not sure who is, you took the order. Its 2 orders of chicken and waffles + 1 papardalle\"  France: \"oh of course...it is here...le kitchen has made a mistake\"  CIA STEVE IS VISABLY PISSED, because we are here for another 20 mins at least.  Food arrives, well worth the wait.  Finish it up fairly quickly, CIA Steve drops the dessert menu, we plates still at the table.  We pay the bill and leave.  NEW RULE: if you are wearing a headset, because you are security, be security. Which mean you will hide or stay in the background."}
{"text":"I am currently from NYC flew to Canada for a get away trip and I noticed Frings was down the block from where I was staying.. when I went I sat at the bar I had the ribs & the cheeseburger roll let me tell you something everything tasted so good with so many different flavors blended perfectly together. I also tried multiple drinks that was on the drink menu.. The bartender was extremely knowledgeable about the food and the drinks which made my experience more enjoyable.   I will have to fly back to Canada before June 23rd which I believe is the last day for Frings before closing for good."}
{"text":"Loved their cocktails, their Sangria was my favorite. Nice, hip spot, very cool, young crowd, nice ambiance and decor. Came and shared a couple of plates with my girl friend before heading out for a night on the town. Enjoyed the guacamole and the Eggplant Parm, the dishes were flavorful, but I feel like it's a bit over priced for the quantity and quality, you pay for the name really... not a very upscale place, just trendy. Don't believe the Asian fusion title either, not Asian at all except for maybe a handful of dishes on their menu. All in all not bad, I'm a fan."}
{"text":"We had a tasting dinner by Chef Susur, and eash new course was treat. The variety and blending of flavours were delightful. The presentation was as well planned and executed. The atmosphere had energy, and welcoming feeling. 5 star experience, delivered. Very memorable evening."}
{"text":"With all the hype surrounding this restaurant, I had to give it a try for myself. First things first, if you are planning on coming here make a reservation!! This place gets busy QUICK and is filled up all night long.   We parked across the street in an underground parking which was just a short walk to the restaurant. We were greeted by two lovely and sweet ladies, everything seemed organized from the start, they took our coats and our table was ready right away. We sat in the middle between two other couples, it seemed tight at first but didn't really cause much of an issue to my surprise!   For the food we started with the tacos which were amazing, sooo much flavour. Next we decided to share two plates, the chicken and waffles and the short rib. OMG the chicken and waffles were... ugh I just can't even describe you just need to taste them yourself. And the short rib was done perfectly!! Literally melt in your mouth.   ** reminder, they have a girl coming up and down the restaurant asking if you want her to make you a table side drink, very clever idea, and would be an automatic YES from me, that's if the drinks didn't cost $18 each!!! So we made the mistake of saying yes yes yes and ended up with two $18 drinks. (Should of stuck with wine)      Overall, the hype lives up to its name and this place definitely blew me away. I WILL be back!"}
{"text":"I'd come back here, but not for the food. Definitely not for the food (sorry, Susur :( ) . We came here hungry for a Tuesday night dinner and ordered, a) the sweet maple fried chicken ($28), the Susur burger ($20), ricotta toast ($10), and a bottle of spring water ($8). The chicken batter was really starchy and quite heavy, with the batter tasting actually quite dry (honestly, I'd take Popeyes over this). The ricotta toast could have been better and may potentially have been better if it was served warm. The burger was fine, but nothing to rave about. I'm sure we could have had an infinitely more delicious meal for a quarter of the price at many of the other options a couple steps away. I'm a huge fan of Susur Lee, and I'd stick with his other restaurants for food options, hands down.  However, in terms of environment, Fring's is definitely a class act. It's swanky, splashy, but still very charming, with plush couches and luxurious decor - it could definitely be an option for a drinks/meetup spot after work or dinner. Despite the meal, I was still really glad we went. Service was actually quite pleasant, and while we were told that seating time for dinner is usually around 1.5 hours for the time of evening we were there, we weren't rushed while we ate at all. Aside from the food, I was pretty pleased with everything else.  Time of day visited: Tuesday evening at 6:30 PM Amount spent: with tax, tip, for two people, we paid $87.58. (Keep in mind that's without drinks, and for the quality of the food... ouch)."}
{"text":"This was my first and last visit! Extremely disappointing from the mediocre wine list to the very limited menu. Was told the chicken and waffles were a \"must\" but it was a flavourless dish served up dry. The Brussel sprouts were over cooked . The only decent dish we tried was the short rib tacos but even then, portion very small.  Dinner for two was $170.00 and we left hangry. Our server Luke was knowledgeable and well trained but the young lady who brought our wine had no idea which winery we were tasting and told us Luke would return to answer our queries - Luke never returned, however, he had no problem leaving us the bill and returning with the debit machine. We were not offered coffee since service is limited to 2 hours and we had to give up our table. Très Toronto. Hip but lacking class."}
{"text":"Yes, Drake brought me here. I can admit it. But Susur did too, I swear.   Hip, trendy little place. Dimly lit and beautifully decorated. My friend and I were seated in two large, fuzzy grey chairs which were very comfy and had great views of the room. Unfortunately there was no sign of Drake, or the (cough, super cute, cough) Lee brothers either. Ho hum.   I started with the Spicy Asian Tuna Tartare and it was absolute heaven (albeit a tad under-seasoned?), followed by the Mushroom & Winter Truffle Pappardelle (gluten free). It was phenomenal. My friend had the Crispy Lump Crab Cake and enjoyed it, followed by the Susur Burger, which she found a bit too greasy for her taste. The portions were larger than I expected and I took half of my pasta home.   We didn't have dessert but I was eyeing up the Creme Brûlée. Next time.   Service was impeccable -- our guy was knowledgable and super friendly. I'm sure I'll be back. I'm already craving that tartare."}
{"text":"Had my birthday dinner here and they made me feel so special; the food was great and service was, too. Make sure you make reservations as it is very difficult to get in without them. We tried the octopus (first time!) and it was fantastic, cooked so well and not rubbery at all. Next time we are in the city, definitely will return."}
{"text":"I can honestly say it was nothing to rave about! They played mostly drake songs i felt like i was at a concert lol and we waited about an  hour to get our drinks and order.. And if the food was fantastic it would be worth it but it wasn't it was OK.. I much enjoy all of Lee's other restaurants much better and if I'm going to spend the money i'd rather go there."}
{"text":"The hype is what makes this place going. But the truth is...this place is garbage! The food was shockingly not good. Like the most random menu. No flow whatsoever. The service was unfavorable to say the least. The girl in the front with the really big hair was rude and made us feel very uncomfortable. She even showed up to our table while we were eating to let us know that there was another group of people coming in over an hours time and that she wanted to move us to a smaller table to accomadate a group of 5. I found this to be  very unproffesional and awkward. The music was way to low you couldnt even here a beat. We had 5 different waiters and had to repeat our orders because of this issue. The crowd is w.e mostly ppl are coming to see what the hype is all about...just to be dissapointed. I thought susur lee being involved was going to make the menu an epic experience but it turned out to be an epic fail. The floor plan & decor was nothing special, the decor is like really basic and less then mediocre. The only thing i liked was the alcohol selection louis etc.. the only reason im giving it a one star was because their moms meat balls were actually pretty damn good and the bartender who was 1 out of the 5 waiters who served us, made a really nice drink for us. In addition to all the above, the prices are not acceptable for the shit they serve. Ill pay for quality not over priced garbage that has been hyped on social media.  So would i recommend it? Hell no. Would i go back? Hellllllll naawwwww"}
{"text":"If you are visiting Toronto or even live in Toronto and looking for a good place to eat, you HAVE TO COME TO FRINGS!!!! Oh. My. God.   I am still trying to formulate my words to efficiently express my adoration for this restaurant. I came to Toronto with friends for a birthday trip and we were interested in trying this place because of its connections with Drake.   We made 7pm reservations and were seated promptly when we arrived. Everything on the menu looked good and I'm sure we looked confused so our waitress suggested doing the \"Chef's Special\" which is basically a menu prepared by the chef that allows you to try different things on the menu for $55 and up. So we're like....ABSOLUTELY.   We started off with housemade guacamole and chips which were SOOOo good. They put a tomatillo sauce on top of the guacamole and that honestly just sets the tone for the entire dish. I knew from the beginning that this was about to rock my world. Next, she brought out short rib tacos and crab cakes. Are you kidding me?! IT WAS AMAZING. I loved the tacos especially. Ugh, so flavorful! From there, she put out the gnocchi and farfalle? I think the second pasta is wrong but it was a mushroom pasta. They were both delicious! From there, we tried the short rib and steak. I was honestly full after the tacos but I tore into the main course and it was soooo good.   For dessert, we tried the monkey bread and cheesecake. When I tell you I left there with a 6 month old food baby, ugh. I was SO STUFFED. It was worth it!!!!!!!!!"}
{"text":"We had a reservation & were seated quickly. We chose to sit out on the patio because of the beautiful weather at night. We were seated at the very back in the corner. Even though that's where we were seated our server was very attentive to us. Our servers name was Charlotte & she was wonderful. No complaints. She recommended my date & I to split up to 4 dishes which ended up being the perfect amount. Each dish that we ordered, she would tell us what was included. We shared the Truffle Fries, Tacos, Fried Chicken & Waffle & the Short Ribs. The Truffle Fries were actually a decent sized portion that you will need extra sauce for it. The Tacos came in 4 a dish; they were really small but was bursting with flavour (I definitely recommended to try it). The Fried Chicken & Waffle tasted great, the fried chicken was boneless & so tender. Lastly the Short Ribs was cooked to perfection. The sauce & the mashed potatoes complimented the soft short ribs so well. I also got Fring's Exotic Fruit Sangria & it was really good. Overall it was a great experience & we'd definitely come back. Ps for parking; park across the street in the underground parking beside Weslodge. We only paid $5 on a Wednesday night! I read this tip from another yelp user (Ssutu.S)"}
{"text":"I'm not going to lie, I'm a bit disappointed :(   I made reservations to come her months ago. I was going to be visiting from San Francisco and was SO excited about being able to try this place out. I studied the menu and totally prepped myself for our dinner.   We were seated outside, which was beautiful (so was the inside!), and were quickly brought water. After that, we ordered drinks and a few plates. Shortly after receiving my glass of wine, it got knocked over. Although a server saw it happen, no one offered to help clean it or replace the $12 glass that I had taken one sip of. Our table was mistaken for other tables several times, and servers kept trying to take our plates when we were not done. The waiters seemed all over the place.   Most of the plates came out quickly, but the last one took almost three times as long as the others, to the point where we had to remind them about it. When we were trying to pay, another waiter watched us as we paid, which seemed a bit awkward.   The food itself was great. We had truffle fries, fried chicken, and crab salad toast. All awesome!   Overall I think the service needs fine-tuning. If we're paying so much for small portions, then we should be paying for the experience."}
{"text":"After MANY suggestions I finally decided to try and brought my mom and sister along. The food was really great, we had the duck confit, the short rib tacos, cheeseburger spring rolls, truffle fries and the chicken and waffles. Despite being good, the service was awful. It started out well, but then we got a table beside us with four people. The server must have known them. They got their food before us, despite arriving a half hour after us. The server was very attentive to them gave them each a dessert for it being their birthday, when they expressed that it was intact only ONE of their birthdays. So they all got dessert with a candle. We were still waiting for our last entree. They had all 8 of their plates come out and we were waiting for our 5th. It took 25 minutes to get the bill and the server went to the group beside us to cash them out first. It was extremely frustrating seeing everyone getting their food and special service. The food was great but the service seriously put a damper on the night. I honestly won't go back, there are way better restaurants with great and attentive service. After all, it's a part of the ambiance and experience."}
{"text":"I had wanted to go to Fring's since they opened, and I found the food pretty good. The ambiance was great and super trendy, the service was hit and miss, some of the staff were super nice and others quite pretentious.  It's a nice night out at a trendy resto owned by Drake. The food is not amazing, as it could be for the price you are paying, but it's pretty good. I would give it 3.5/5, but don't know how to select half a star."}
{"text":"Came here on the weekend for dinner. Decor of the restaurant is pretty cool, nice atmosphere. But not sure if it's because my expectation was too high, hearing this restaurant is by celebrity chef Susur Lee, but the food was just average and a bit pricey for what I am getting.  We ordered the Crab Cakes, Five Mushroom Pappardelle and Spiced Short Ribs. Of the 3 dishes, I would say the crab cakes had the best flavour and was the most well balanced dish of the three. The short ribs are really tender and breaks apart with a spoon, but flavour was average. The mushroom pappardelle was my least favourite because the cheese flavour was too strong for my liking, but that's just my personal preference when it comes to cheese. I also ordered the Exotic Sangria which tasted so good at the beginning and looked so pretty, but the flavour was watered down quickly by all the ice in the drink and tasted a bit weird towards the end.  Overall the experience was just average and for that price, there are many other restaurant options."}
{"text":"Absolutely beautiful patio. I would definitely come back and have drinks here again.  The food?  So so. The spicy tuna tartare wasn't spicy at all. The fried chicken was crispy, but the batter came right off when I cut into it. Sorry, that's a big no no for fried chicken and for battered food in general! The octopus was cooked well but it didn't pair well with the tapenade, it actually made them both more bitter. Drinks were good. Expensive of course, but that's to be expected for King West."}
{"text":"3.5 stars rounded up just for Drake/Susur  I was super excited for this restaurant to open up because well... Drake and Susur were involved. I made reservations on Tuesday and was able to get a table for 4 at 6:45 pm.  When I arrived at the restaurant, it was quite busy already. Once we were seated, the first thing my friend and I noticed was that it was extremely dark. I love a good ambiance but if I have to consider bringing a flashlight to read the menu, I think that's a bit too dark.  The waiter was very quick to pour us some water and took my friend's drink order. We were all starving and we knew exactly what we were getting so we mentioned to him that we were ready to order food. He told us that he'll be right back but it felt like an eternity before he came back.  When the waiter finally came back, he stressed to us that it was a \"sharing menu\" which means that the dishes are not going to come out all at once. My friends and I joked that maybe the kitchen has not worked out all the kinks yet so they're not able to make everything at once (but I feel like there's some truth to it, I guess I'll find out if I come back in a couple of months and they still call it a \"sharing menu\").  We started with the steak tartare ($20) and I thought it was very tasty. It tasted more like pate than steak tartare. For the amount of tartare they gave us, I thought that there wasn't enough bread.  Next, was the wild mushroom and prosciutto toast ($10). Again, it tasted fine but you really cannot screw up toast especially with those ingredients. I would skip this dish and any of the toast dishes if I come back.  Our last appetizer was the organic salmon crudo ($18). I think that this dish was the most unique out of the three appetizers. After we finished the dish, I tasted some of the soy sauce and it's definitely an elevated and more sophisticated soy sauce. Its description from the menu is \"soy yuzu vinaigrette.\" I also thought that the thinly sliced jalapeno added a nice subtle kick to the salmon.  I got the southern spicy maple fried chicken ($26) for my main dish. The chicken was perfectly fried and the inside was moist. The highlight of the dish was most definitely the side sauce of spicy maple syrup glaze. Personally, I would've liked it a bit spicier because the sweetness of the maple syrup really toned down the spiciness. The chicken came on a bed of coleslaw. I think there were raisins and some sort of nuts in the slaw. It was a bit on the sour side but I kinda enjoyed it.  My friend ordered the pan seared whole branzino ($32). I tried a piece of it with the squash puree. I really like the almonds with the squash puree. The fish itself was very moist and done well. However, my friend said that there were a lot of scales on the fish still. This is quite unacceptable especially at the price that it is at.  Lastly, I have to mention their cocktails. Starting at $16, I expect perfection. My two friends both got the Tom Skudra ($18) which took forever to come. I knew it would be very strong but I expected it to taste good. I had two sips and it tasted like cough syrup. None of the fresh lychee cactus pear juice came through.  Before we got the bill, we had to wait (again) for our waiter so that we can check out the dessert menu. There weren't anything we wanted so we just asked for the bill. Good thing they listed the prices on their website so I was able to do my calculations and leave because I was not about to wait for the waiter again.  Since I didn't order the drink and the fish, I thought everything I ordered was done very well. They just opened up so I think they really need to work on their service and consider brightening up their restaurant a bit. I swear I spent more than 30 minutes waiting/looking for the waiter AND the waiter didn't take the initiative to bring us the dessert menu even though it was clear we were done our meal. However, I want to end this review on a positive note and say that their music choice was on point (they obviously played a lot of Drake and threw in some Weeknd)."}
{"text":"With powerhouse collaborations to the likes of master chef Susur Lee and 6ix god Drake, one would expect Fring's to be on the same level as these Toronto bred icons. Unfortunately, the restaurant falls quite short of its creators creativity and flavor.  Between 8 people, we were able to order a myriad of items from the menu including ribs, pasta, fries and dessert. The ribs were the best part of the order both flavorful and tender but wasn't anything standout.  Similarily, all other dishes were okay but lacked flair or a creative flavor profile which would make it memorable or different from chains like Joey's or Earls restaurant.  Perhaps the most disappointing item of the evening were the truffle fries. For over $20 for a small basket of fries, I was expecting a bigger punch of truffle 'umami' than just a very slight scent of truffle. In fact everything was so distinctly lacking in what I've come to expect from both Mr.Lee and Drake that I can't even recall any favorite dish of the evening.   Cost wise, expect to pay on the higher end. Value wise, I found Fring's very lacking since similar dishes can be found at chain restaurants for substantially lower cost. IMO walk a few blocks up and enjoy a great meal at Lee's instead.  giving this more than 2 stars because the ambiance and service was great."}
{"text":"I had the fried chicken with the waffle.  The waffle was very light and the chicken was not drenched with oil.  The sangria was the best I've EVER had.  I gave it 4 stars because this was my second time and they took the monkey bread dessert off the menu.  I'm glad they came to their senses and put it back on the menu! Hopefully by the time I go back to Toronto this summer they don't take it off again."}
{"text":"My second time visiting. First time we sat inside, food was decent but the noise level was too loud, tough to hear by friend across the table.  This time I came with a group seated outside on patio, which was lovely. The food was slow to come and... terrible! Very little flavour and boring, not acceptable given the prices. Our group hated it and I was embarrassed for suggesting this place. Last time for me."}
{"text":"I was in Toronto for Halloween and a friend wanted to come here. We tried making reservations but they said it was booked but when we arrived with a group of five people, there were booths available and had gotten seated after a five minute wait. We ordered the following: kale caesar, crispy chicken sliders, wild mushroom and prosciutto, avocado spread, chicken piccata, grilled lamb chops, N.Y. strip loin, yukon potato rosti and grilled asparagus.   The toasts were pretty good but I recommend the avocado without the pistachios. The mushroom toast was tasty with the prosciutto as the textured was more like bacon. The kale caesar was fresh but the crispy chicken sliders were amazing! The chicken wasn't over cooked and was tender. I'm glad we had gotten two orders! The lamb chops and strip loin came out perfect (cooked medium-well, although I would've gotten them medium). We had to accommodate for the rest of the group. I wouldn't recommend the potato rosti which is like a potato pancake with a sour cream-like sauce on top. The grilled asparagus came out crisp and was a great side to lamb and strip.  I was a little disappointed in the menu options but hopefully they can add more interesting dishes to the menu. I wouldn't mind coming back but would most likely do it with a group of people on some occasion."}
{"text":"I've never heard much about this restaurant until a friend of mine brought me here. The interior decor is probably what stands out the most about this place - the super fluffy/furry chairs, dim lighting, and a bar-ish vibe.  We ordered the Aubrey Palmer (warning..this is a very girly drink)..pretty good but was expecting a bit more from it. As our server introduced, all dishes here are meant to be shared. For two, he recommended us to get 3 different dishes to start with. We ordered the Spicy Asian Tuna Tartare, Beef Short Rib Tacos, and the Pan Seared Salmon.  Food came right after we finished our previous one. The Tuna Tartare was my favourite, even though I'm not crazy about tuna. It's seasoned so that you can eat it on it's own, or with the corn chips. Couldn't get enough of it! The Tacos were delicious too, although messy to eat. They creamy sauce on top of the tacos was delightful. I'd probably add that to anything I eat. Salmon was definitely not the highlight of the meal, even though I somehow expected the most out of it. The salmon itself was cooked beautifully but the sauce and everything didn't go too well with it. I would definitely give the Tuna and the Tacos a 5/5, would definitely order again.  Ice-cream and sorbet for dessert and I was expecting a lot more from them.  The downside of the place is probably how crowded it is, and how terrible their washroom is (for such a nice place)."}
{"text":"I'm a huge fan of Lee but for some reason avoided going to  Frings because I thought it would be overrated and attract a pretentious crowd. Was I ever wrong. The meal that I had at Frings was by far the best I've had in years.  I went with a group of 6 and we ordered the tasting menu for $75 a person. The waitress asked what items appealed to us and what price point we wanted to stay at (tasting menu ranges from $75 to $95).   Service: 5/5 Price - 5/5  It's pricy but I didn't feel ripped off. If came to about $330 per couple including the tip. Ambience - 4/5  Food - Honestly, every dish was incredible Here's what we ordered. Everything was so good I can't pick a favourite. I recommend everything below!  -Kale salad (even my boyfriend who hates kale loved it) - beet and burrata salad - beef carpaccio  - salmon tataki in ponzu sauce (wow the sauce was unreal) - bao chicken sliders (maybe my favourite...it was  like a fancy more delicious mcchicken) - short rib tacos (we ordered these on top of the tasting menu... delicious short ribs in a fried wonton taco) - cheeseburger spring roll (very unique dish so order it while you are here) - gnocchi (perfectly cooked and the sauce was excellent) - truffle fries - asparagus  - braised short ribs with mashed potatoes (probably my favourite of the night) - fried chicken and Asian waffle (I was too full by this point to have more than a bite but everyone else raved about it) - bread pudding for dessert  (yummy but I was too full to enjoy and would like to try the monkey bread next time.  We also had the sangria. They make it for you at your table. It was  a special experience and delicious. We also enjoyed a few bottles of red wine. Excellent selection at different price points.   I'll definitely be back! I was blown away by the experience!"}
{"text":"Going to start this review by prefacing that we only knew about this restaurant because of Drake. However, it definitely does not disappoint! We went here on the first opening night of 2018 and it wasn't too crowded for our 8:45 reservation, but started to pick up as time went by. They have 3 tables with oversized fur chairs which we would've loved to sit at, but they're almost always taken. The music is great, it's mostly rap/hip-hop, for a millennial audience. The food is sharing style and it's mostly comfort food/appetizers, so pick things your entire party likes! Cocktails are amazing (Worst Behavior is my fave) but a bit pricey so I only ordered one. Dessert menu is limited but the ice cream trio was very tasty. We decided to move to the bar after our meal for one more drink. Downstairs is the famous 6 sign where a ton of Instagram pics are born (we of course took some of our own). Overall the decor and vibe is very modern and contemporary and if you are willing to splurge a bit then definitely try it out, as it lives up to the hype!"}
{"text":"I was very excited to learn about the sudden opening of Fring's as my friends and I had been waiting weeks for the grand opening. I was delighted and surprised to have secured a table for the opening night. We are weekly customers to chef Lee's other restaurants Bent and Lee, and love his culinary style, execution of his dishes, and the unique flavours he incorporates into his dishes. Going into the space, I was shocked to see the restaurant was very empty. We ordered 3 starters: the grilled octopus fried chicken sliders, and avocado toast. The octopus was served cold, and had a chewy, rubber like texture. It was served on a potato salad that had a store-bought like taste and appearance, and the dish was garnished with what seemed to be Frank's Red Hot sauce. The avocado toast was a very small portion, nothing special to speak of. The chicken sliders were very plain, no garnishes and served with a basic chipotle mayo. For entrees we ordered the prawns on a mango/pineapple salsa, grilled fish on butternut squash puree, and steak served with fries. The quality of the dishes was so poor, and resembled something you would order at a chain restaurant. The dishes lacked unique flavor, and the ingredients were not up to par with the quality at chef Lee's other restaurants. As for dessert, the crème brule seemed to be uncooked, but the lava cake was done nicely. Overall, I was very disappointed in my experience at Fring's as I had much higher expectations for the culinary genius, chef Lee. The quality, originality, and superiority of the dishes was missing. The atmosphere, and friendly staff were all there (as per usual), but as a regular customer I was very unsatisfied with the dishes at Fring's and do not plan on returning to the restaurant. I think people will be curious to try because of the co-branding with Drake, but it would be ashamed if this is the first and only experience customers get of Chef Lee's menus, because he really has so much more potential. It saddens me to say this, but Fring's did not live up to my expectations."}
{"text":"A fun place with good unique cocktails (we didn't try the food). Great hip hop music by DJ Bambi on a Saturday night. As a venue by Drake and Susur Lee, it had good classy hip hop vibes from the crowd. Would be even better if it turned into a dance floor at night."}
{"text":"Overall summary: not saying it's not a nice ambience and restaurant and the food isn't good, but if you're looking to get your bang for your buck, this isn't the place.   I had the maple fried chicken and Mac and cheese. Definitely original and savoury recipes. The band was playing, the ambience and decor was great. The price tag though is pretty steep, this is a place I would take a significant other to impress."}
{"text":"I gave it 3 stars because it's not really my place.  the music was all hip hop with a little drake *teehee* mixed in, not my thing. the food was good, but for the price not that good.  Same with the drinks, they weren't worth over $12. all in all was glad I checked it out, but won't be back for the overpriced comfort food.  I can get that elsewhere, like fast food restaurants...  the fried chicken was very tasty, the meatballs were delicious, so I'm not saying the food was BAD, just overpriced for what you get."}
{"text":"Reading the reviews before I went it seemed like a pretty polarizing place. But after going, it makes one more sense.   Yes- it is a little stuffy and the service is pretentious. And yes- it's expensive and a scene. However, yes- the quality of the food and overall experience is great.   I had the mushroom and prosciutto toast, meatballs and chicken sliders. Can't complain about anything, including the portion size or value. Also had the bourbon smash cocktail which was also perfect.   Eager to go back and try out some of the entrees and other cocktails."}
{"text":"Went for my girlfriends birthday! The food was good as we had amazing service and the quality of food is impeccable. The servers are enthusiastic and have a passion about what they are bringing to your table. \"They passionate from miles away\"!"}
{"text":"Made a same-day reservation for 6 pm on a Wednesday night but there looked to be a few tables free, so maybe you don't need a reservation? So of course, we gotta check out Drake & Susr Lee's collaborative spot! The restaurant is dark but has a lounge-y feel. It's loud with the other diners chatting but the music is also a bit loud as well. I expected only Drake music but there was R&B, hip hop music in the background. I was very impressed with the service. We never had an empty glass of water. The food came out pretty fast and our waiter was easy to flag down.   We ordered the Grilled Octopus, Salmon crudo, maple fried chicken and the truffle fries. We also tried the black berry ginger drink, which wasn't too sweet. It was refreshing and even came with some flower petals, perhaps inedible but looked pretty. The grilled octopus probably came 5 minutes right after we ordered, so we were very surprised with the fast service. It was a large tentacle with a slice of the body, red pepper relish, tampenade and potato salad. The octopus was tender but a bit too charred. Seasoned okay. I enjoyed each bite with the relish, tampenade and the red sauce (some spice?). I would've liked more relish since the octopus serving was bigger than expected. The salmon crudo came with salmon sashimi with green apple, jalepeno, cilantro and gluten-free ponzu sauce. The chip that came with this dish was a corn chip with sesame. I thought the chip flavour didn't go with the crudo and salmon flavour so we ate it without it. I liked the combination of the salmon with the fresh green apple (with some ginger?), jalapeno and cilantro. Each bite was well balanced and seasoned well. The truffle fries came in a regular sized bowl in a wax paper folded cone. There were a ton of truffle shavings, which were nice, but definitely not worth the price tag ($20). Finally, the maple fried chicken was definitely the best! The maple syrup with whipped butter sauce came separately, which was thoughtful since the fried chicken batter wouldn't be too soggy when the dish came to our table. There was also a watermelon coleslaw salad, which was fine. This dish (served only 4 medium sized pieces) was smaller than expected, especially since it came off the \"large plate\" section of the menu. However, each piece was moist, batter was thick and crispy enough for a good bite. We lathered the chicken with the maple syrup sauce along with the hot sauce they provided, mmm prolly the best fried chicken I've had in the city, period. This satisfied my Korean tongue, which usually looks for something sweet, sour, spicy and rich flavours. The batter could've been lighter but with the maple syrup and hot sauce, perhaps a lighter batter wouldn't have held up as well.   All in all, I would come back and recommend this place to others. Pricey but it's a nice atmosphere and good service."}
{"text":"this is like Susur Lee does the suburbs. over-rated and over-priced. everything was very nice and safe, but expensive and not memorable. lamb chops: under seasoned, disappointing.  tuna tatare: zzz. nothing special. Vietnamese cob salad: it's a dry take on a bün noodle bowl, minus the flavour. go to Lee if you're a Susur fan."}
{"text":"Food 4* (service 2*, space 3*)  We went to Fring's for a friend's birthday, shortly after the restaurant opened. I do realize that they still need to work things out, hence 4 stars. Call it a leap of faith.  The space is really nice and cozy. That said, it would work much better as a bar/lounge than a restaurant. It's ridiculously dark and loud there. It's like having dinner at a club. Just to give you an idea, here's a snippet of our conversation:  Me: \"What is this? This brown or...maybe green stuff on the chicken?\" Friend: \"Yeah, I'm stuffed too\"  And that's how the entire night went. When I left the restaurant after 2.5 hours (I did mention that the service is 2*-sloooooow), I had a sore throat and partially lost my voice.   If you have to yell to communicate with your friends, and you're not at a club, and if you are not able to see what's on the plate in front of you, there's something seriously wrong. Come on, Fring's, get it together, pronto.  The service is a disaster. At that price point, it should be impeccable. Yes, they have a lot of staff but they mostly just stand or walk around, not coming up to the tables. It took forever to get our drinks, food and the bill. I could tell that they are aiming to provide a \"fancy\" service but it looked ridiculous. At times, there were two servers at our table, bringing out dishes and clearing our plates or glasses, resulting in complete chaos. Thank universe, they managed not to spill our $18 cocktails. You would think that Fring's would hire experienced servers. But nope, it's a disaster.  (Now that I'm typing it all, I'm almost convinced that I should give Fring's 3 stars, instead of 4)  Now on to the good stuff. The food is really good. Overpriced, but tasty.  They have this thing that they bring dishes as soon as they are ready and encourage people to share the food. It probably just means that their kitchen doesn't have it together though, but anyway...At one point we had a couple of appetizers, an entree and a side dish ordered for another entree at the table. I actually can't imagine not sharing at this restaurant. Everyone would get their plate at a different time (and we're not talking within minutes, we're talking a span of 2 hours).   Since there were 5 of us, we managed to try almost every dish on the menu. I think we only skipped the pasta dish and lamb. We liked all of them, the only thing that we all complained about was frites, which were very salty. It funny how a fancy restaurant can get every dish right but destroys fries...  Highlights:  Appetizers - avocado spread and wild mushroom and prosciutto toasts  Entrees - chicken piccata and pan seared branzino   We will come back if they decide to let people see what's on their plates (this place begs for additional light, especially in the booths; the bar area seemed sufficiently lit) and turn down the music."}
{"text":"My favourite Susur Lee restaurant. Made a reservation for 4 easily online. I highly recommend a reservation, the restaurant was full on a Wednesday evening.   Our server was knowledgable, she went through the menu and debriefed us on the daily food and drink specials. I opted to order the drink special which was a rosé sangria with 32(?) ingredients at $18 a glass. It was a damn delicious drink but unfortunately it was served to me about 20 minutes after everyone else's drinks, during our second course- even though we all ordered drinks at the same time. The manager did stop by our table to ensure everything was ok. Overall the service was great, the staff were all courteous.   The 4 of us shared the fresh ricotta, tuna tartare, grilled octopus, the seafood pasta dish, southern spicy maple fried chicken and the Susur burger. It was plenty of food for the four of us. Loved getting to try it all although the burger was a bit difficult to share. I highly recommend the grilled octopus and the spicy maple fried chicken. Very tasty. We shared the monkey bread and lava cake. The lava cake was average but the monkey bread was a delicious light and fluffy cinnamon infused yum bomb.    Although a bit pricey it was a great experience, I will return. Oh ya and Susur was in the house!"}
{"text":"Amazing food. The short ribs are a must try. Bill was $200 with 6 drinks. Service was excellent and they have pretty decent music."}
{"text":"Make sure you book reservations! My friend and I did about a week in advance and I'm glad we did because it was extremely busy! Firstly I believe that it lives up to the hype. The ambience, staff, design of the restaurant, and food was great. The truffle fries were amazing and rich, the guac was topped with an amazing garlic flavouring and came with bottomless chips, and I ordered Bao's for my meal which, although small and slightly too Americanized, were great. The prices weren't crazy (which I came in thinking they would be, especially for the amount of food I ordered) and the staff was helpful, sweet, and overall very friendly. Great experience and definitely want to go back again!"}
{"text":"Great experience, overall. Food was not as amazing as Susur's other spots, but given the goal was comfort food, they're doing that pretty well. As others have mentioned, it's too dark - could barely see the food. Salmon crudo was the highlight - a perfect combination with green apple, jalapeno, and cilantro."}
{"text":"Had the pleasure of going for my birthday and it was amazing. Our server Taylor was awesome, extremely knowledgeable and helpful. The staff is on top of everything, kept our table nice a clean always checked on us. I suggest this place for anyone, the music is great too. Might be loud for the older crowd though."}
{"text":"Loved it! Amazing food and great music. Hard to get a reservation but managed to get one in the bar area! The avocado toast was bomb!"}
{"text":"What a disappointment. As many people, I was excited to go to Frings due to the association it has with Drake. I have never in my life been so irritated at a place and so rushed. From the beginning of the night to the end, it was just one disappointment after another.   1. Coat check - they insisted on taking our coats but lost them and couldn't find where they put them. We were stuck waiting nearly 10 minutes while they tried to figure out who put our jackets away.   2. Maybe because it was all star weekend they wanted to seat more people and make more $, but we had a reservation. We came in for our 8:30 reservation and were told that we have to leave by 10 because they'll have to seat other people. We were already limited on our time.   3. Our servers name was Jennifer, and her goal for the night was to get us to leave. She gave us our menus and within 2-3 minutes asked us 5 times if we're ready to order yet. She was hovering around our table until we finally ordered. She then took all the menus and as soon as we got our meals, she constantly kept asking if we're done. Hello? If you still see me eating I'm probably not done... My friends were still working on their meals, yet their plates were taken away while they were in conversation.   4. I expected a different atmosphere and louder/hip-hop/rap music. They were playing jazz. Although this doesn't contribute to the lack of stars, it did kinda throw me off. :/   We arrived at 8:30, and we were gone by 9:00. It was to the point where even the man at the front door asked us why we're leaving so soon. It's a shame, we only had the chance to buy the toasts and appetizers. It was evident that we weren't welcomed so we decided to take our business elsewhere. In terms of food, we didn't get to try much but the Avocado Toast and Truffle Fries were great."}
{"text":"The service was not the best. It was a Tuesday night but it was packed and we had reservations for 8pm. The waiter took forever to come around and take our order. I checked the time and it had been 30-40 minutes after being given out menus that our order was taken. Despite the long wait time, the waiter himself was very pleasant!  We ordered kale salad, crab cakes, guac, rigatoni, brussel sprouts, asparagus and chicken and waffle between 5 people to share. It was all delicious! I loved every dish - everything was seasoned well and tasty. Atmosphere was also very chill although a bit noisy when we were there so it was a bit hard to hear each other sometimes.   If I had the money, I'd come back for special occasions!"}
{"text":"There were a few bumps with our visit but overall a good experience!   The restaurant is in the trendy entertainment district and we booked a table for the patio. The patio is a beautiful shady spot, it's comfortable but upscale. There are several bars and restaurants around so it was a bit loud and rowdy.   We ordered two pitchers of sangria which was delicious, we found pieces of lychee and dragonfruit which is certainly a step up from any sangria I've had, but I don't believe it warranted the $80/pitcher price tag! I suppose it is a higher end restaurant but it seems a bit steep.   There was a patio party going on at one of the nearby bars and things got a bit violent with some guests so we, as well as some other tables requested to move inside and we were promptly re-seated inside. The staff were extremely professional and empathetic towards a situation that wasn't even their fault.   We tried a number of dishes, the salmon tataki, kale salad, gnocchi, eggplant Parmesan, short rib and chicken and waffles. The food was not bad, however I did find for the portions, it was a bit overpriced. Nothing for me was particularly outstanding. My favourites were the chicken and waffles and the eggplant Parmesan.   The pacing of the dishes was a bit off. Some dishes came out simultaneously but then we would wait 20 or 30 minutes for the next one. We let the manager know and he gave us the cheeseburger spring rolls as a compliment which was nice but at that point we were full and after 2 hours we were just wanting to leave.   I really love the look and ambiance of the restaurant, it has a swanky vintage hotel lounge feel to it, and there was a guitar player playing some lounge versions of Drake songs which was amazing. The service was also outstanding, other than the slow food service, the wait staff were extremely well-prepared for a seafood food allergy in our party. They seem to know what ingredients are in the food and were able to guide us through the menu. One table was a bit loud and they told us to let them know if they were being too loud; they seem to care a lot about your experience.   Prepare to spend about $100 per person for food and drinks, it's not a cheap or quick meal.   I probably won't be back unless someone else is footing the bill. The portion sizes are too small and for the price, I'd probably rather have a steak at Morton's!"}
{"text":"This place is good and has an adorable patio tucked away while still being right on King West.   Service is very attentive and friendly.   I heard a girl in the bathroom say \"this place is good but what's up with all the rap music?\" LOL I guess that's what happens when you go to a restaurant co-created by a rapper? That made me laugh.   Overall, definitely would recommend checking this place out for the ambiance, food, and drink."}
{"text":"I was having a birthday dinner with 7 people. It was our  first time at Frings. At first everything was great. Nice ambience.. Good service at the front desk. We had a corner booth to ourselves.  I don't remember the name of the waitress but she was first of all very slow in brining us simple drinks. (It was not even cocktail). Took her about 15 minutes to bring us the first round. We asked for another round.. 20 minutes past by and she was nowhere to be found. She could have checked on us in between at least to inform us that they are on their way. But no communication what's so ever. And the bar was not even that busy.   Once they came to know it was a birthday, they decorated a dessert plate (which was already ordered) with the name and a candle. You would expect they would at least offer a small cake or a pastry for the occasion on a total $800 bill. But no. Food however rated very good.  Well  presented. Kitchen staff explained each dish which I think is a good idea.   Overall customer service is pathetic. I would never go back and would not recommend to anyone."}
{"text":"I made reservations for my birthday and I wish I hadn't. My waitress was sweet and Insisted we ordered several things and split it between my sister and myself.  But everything went left after there we ordered a chicken sandwich which was The only good thing we had:  The salmon was raw  The truffle fries were over cooked and nearly burned It got to the point we started turning food back  The bill was not worth the dining staff   Not to mention the decor and music in there was terrible the music constantly shifted and was never consistent one minute it went from drake to the supremes.   My chair had fur in it there's mirrors and funky chandlers. But the bathrooms were cute they had 6 God for th guys and 6 Godettes for the girls.   Just go for the bathroom lol"}
{"text":"Ok so I booked Fring's for Mother's Day because I love my mama and this place is so hyped up (and closing down soon). If this were an exam, I'd give a passing grade of 65%. First, the service is sort of odd: they were oddly stilted at the door and the servers speak really fast so I'm not even sure what you just said? Friendly, though. Second, the food was hit or miss. We started with the chicken baos: good but would not order again. The cheeseburger spring rolls were the novelty item we decided to get. I cut mine open and it was hollow...it was like I got a brief glimpse at the cheesy beef supposedly on the inside. The truffle Parmesan fries were VERY good, until you get to the bottom of the cone that is. Now, the mains. My dad ordered the chicken and Hong Kong style waffles: we are very familiar with HK waffles and these were soggy and frankly, I can find better at a Chinese food court. The chicken, however, was fried nicely and juicy. I ordered the gnocchi and no complaints here - it was delicious! My sister's short rib tacos were small and inedible. Should have returned them back to the kitchen. My mom ordered the tuna tartare: it's nicely paired with the sesame chips but honestly, the tartare is nothing we haven't tasted before. Meh. Oh also, ambience is quite dark (as expected) and there was a slightly lingering musky/urine-ish scent (not expected). If you're wondering where that famous neon sign is, go to the bathroom, you'll see it."}
{"text":"I don't recall the last time I loved a restaurant as much as I loved Frings.  I went there last night with two girlfriends and our experience from start to finish was outstanding.   Our server, Coco, was fabulous. The food was outrageous and the portion sizes were much larger than any other sharing plate restaurant I have been to. We were stuffed after 5 dishes (I was full after four to be honest).   We ordered the ceviche which was the best I've ever had. I'm not huge fan of ceviche to begin with but this dish was so fresh and light with avocado and mango and a kick of heat that I became a fan!   I think my favorite dish was the octopus. It was so tender it just melted in your mouth and so flavorful. I can't wait to go back to have that again.   We also ordered the slow braised short ribs (delicious) and the Korean marinated skirt steak (yummy) but my favorite dish apart from the octopus (ok, they are tied for 1st) was the mushroom and winter truffle pappardelle. Simply wow!!!    We ended the meal with the churros. They were the perfect not-too-rich ending to a perfect meal.   There were so many dishes I wanted to try but couldn't, I can't wait to go back."}
{"text":"Obviously a lot of hype over this place and it did take some time for us to get a weekend reso but nonetheless we got it. I was hearing from people that I know and through reviews that this place wasn't as good as they expected it to be. Everything was shared between my friend and I.  To eat: Crab Avocado Toast- Big fan of toasts, this one was full of crab chunks and probably one of the best I've ever had. Every ingredient on there complemented each other in taste and presentation. Definitely a must have when you go.  Sweet and Sour meatballs- This was good, I feel like it could've been hotter but still a dish I would order again.   Fried Maple Chicken- Came with two sauces, spicy and a honey butter (i think) one. Went really well with the chicken. It was cooked perfectly.   Mushroom Pappardelle- This came out last and if it came out first I probably would've licked the plate to finish. I was so full at this point but this was my absolute fav next to the crab toast. The pasta was perfectly cooked and it was fresh, the seasoning and flavours were all there. I would go back just to order this...twice.   Dessert: chocolate souffle with ice cream- Huge fan of souffles, i found this one to not be so sweet like most other ones I've tried. The ice cream was tasty, the sauces were a nice touch. The inside was steaming hot and had banana and jack fruit pieces in it. This put me over the edge but it was worth it.  To drink: Aqua Panna Bottled Water Proper Ting- tasted great, overpriced though. Barrell Aged Tequila Negroni- not too bad, wouldn't order it again. Too bitter for me, also overpriced. (All cocktails were $18).  Our server was great, friendly and knowledgeable. They changed our plates often and checked in on us. If you take anything home, they hold it for you at the front of the restaurant and you take it as you leave. No complaints about the service at all.  I think anyone who didn't enjoy the food had their mind set already that it was all hype and didn't give it a real chance. I will always give credit where its due and I will be going back to try some other things off their menu....and of course for that mushroom pappardelle, ya heard meh?!"}
{"text":"We did the tasting menu at fring's on Thursday night. It was just enough food for us three and exactly what we needed after chugging a bunch of $3 gin tonics and rye ginger at the rosewater. I wanted to love this restaurant because I'm a fan of Drake , I really liked Bent when I went last year and I've heard such good things about Fring's. Bottom line the food was good but it did not wow me. Basically nothing really stood out to me and I probably won't remember what I ate there a week from now.  First came the guacamole followed by the kale salad. I surprisingly enjoyed the kale salad. It wasn't bitter at all. You probably could make your own version at home though. We also had the salmon tataki which was good and the grilled octopus. The one at bar isabel is better. The homemade gnocchi with spinach and pine nuts was good and it had a white thick parmesan sauce. My favorite dish was probably the fried chicken waffles. My brother told me last time he had the chicken waffles it also came wit watermelon and it was awesome. The guys also liked the slow braised short rib with garlic potato puree. It was good but not something I would normally order or want to order. Lastly we had the cheesecake with apricot passionfruit coulis with blueberries. The cheesecake was good and not too sweet.   Thinking back I think it would have been better for us not to do the tasting menu and just choose which dishes we wanted and share everything."}
{"text":"When Fring's initially opened up, EVERYONE from Toronto visited to see what the Drake wave was all about. From my friends experiences, everyone expressed the same sentiment, that the food was sucky and it was all for the hype. So when I walked by on a Monday evening, I didn't have high expectations for the food served. However, I actually enjoyed my meal. We were seated in the patio and there was no wait time. Staff was friendly and informative and said that the dishes were 'family style' - so shareable. My friend and I opted to NOT share what we each ordered. We got the eggplant parm, beef tacos and onion rings. Portion sizes were rather small... especially disappointing after being told it was a family style dish... We expected a larger portion. The food itself, was actually really good. I really liked the super crunchy onion rings, they had a sauce in the middle that was spectacular. The beef tacos were great too, nice balance of spice, tender and flavorful meat and fresh and creamy avocado. My friend enjoyed the eggplant parm but also said the portion was too small. I also ordered the Sangria, which was super floral tasting... it was just average. The music sucked, and didnt match the whole '6 on a Wave' movement they had going on... expected some top 40 music, maybe some soft trap, maybe some OVO Sound? No luck with that. I think it was all 80's music that played. Overall, it was a good experience, with surprisingly decent food."}
{"text":"I got the spicy rigottini pasta and it was AMAZING. Unlike other dishes that claim to be spicy this actually had a very prominent spicy flavor to it which I loved. I got the worst behavior drink and it tasted amazing as well and actually had alcohol in it unlike other places that serve ice cubes and juice. The only reason why I left out a star is because of the price. It is pretty expensive (Over $100 for 2 ppl) but you honestly get what you pay for. I would definitely recommend this place."}
{"text":"Came here for Winterlicious 2018 and I wasn't impressed with what I got given the price point. I ordered the peking duck pancake, seafood duo, and also two a la carte dishes -- guacamole and chicken bao. The guacamole was standard, and the chicken bao wasn't bad...just made me crave Banh mi Boys' bao. As for the peking duck pancake, they fried the pancake and made it super hard to eat. The octopus portion of the seafood duo was delicious. Definitely the redeeming portion of the meal. The dessert was a dollop of chocolate mousse, deep fried banana wonton, and a small pumpkin tart. Everything was just okay."}
{"text":"Frings is surprisingly affordable and the food is really good. The drinks are all quite expensive but damn, they're strong.   Ambience is gorgeous, albeit a bit cramped, and the servers are definitely attentive.   One star off because on the truffle pasta on which I added the $18 truffle topping, it didn't look like I got any."}
{"text":"Went here before a Raptors basketball game and was thoroughly impressed with the quality of the food. Great service from staff here as well."}
{"text":"3.5*  I came here with 3 other friends on a Thursday night and I particularly was hyped up for it, because of Drake and it was also my first time dinning at one of Susur's restaurants. It was basically like a double win, Drake and Susur.   Upon entering the restaurant, the first thing I noticed was how dark it was. I almost tripped, because I couldn't see (totally could just be me). We quickly got seated in the booth area beside the bar. After being seated I noticed the music - I love Drake and The Weekend, but it was a tad too loud for a restaurant. It some times felt like I was yelling over the table. And as for the decor, I like the exposed brick, the comfy tufted booths and the overall trendy vibe.   Service, this is where I had to take a star off. The good we got water as soon as we sat. The bad we had 3 waiters come to greet us, which was really confusing, because I wasn't sure which server was the one I had to \"flag\" down. My friend and I wanted to order an app as we waited for our friends, but that never happened, because our friends eventually came before I could get the attention of our waiter. Normally, I wouldn't be as harsh, but our waiter was at the table beside us the whole time. I jokingly consider raising and waving my hand.   The food. I shared 2 apps, the steak tartare and the wild mushroom and prosciutto toast. I really enjoyed the steak tartate, although it seemed like a cross between the raw steak tartare and the tartare aller-retour - only because it looked cooked vs raw, which is why I think it looked like pâté and like the other reviews the ratio of bread to pâté was off. The toast was okay, but for someone who doesn't like mushrooms I really liked them; you could taste the earthiness of the mushrooms.   I also ordered the Tom Skudra. On paper it sounded delicious, but when I took my first sip, all I could taste was rum - it was overwhelming. The plus side, I guess you get your money's worth of alcohol. I didn't touch it after a sip, which was sad, because it costed $18. This is where I took off half a star.  As for the entrée, I order the fried chicken. It comes with 3 pieces of chicken - decently sized, with a raisin slaw, few leafy greens (dressing too sour) and a spicy maple glaze. The chicken, I had a drum and a breast. I drum was very moist and the crust was a tad burnt, but I personally like a crunchier crust. The breast was 5 seconds overcooked, but still better than most places and the crust was also very nice. I think the winning part of this dish is glaze. I like the sweet, spicy and salty balance it gave to the dish.  Overall, I did enjoy my experience. I did have a higher expectation, but it only opened 3 days before I went, so it's forgiveable. As for the our waiter, I did appreciate that he recommended us to share our entrée instead of getting two. I left perfectly full and satisfied - apart from the Tom Skudra that was chillin' on the table still filled to the brim."}
{"text":"Fabulous crab cakes! Great lighting for selfies in the cool bathroom. Generally friendly staff and great ambiance."}
{"text":"Went here at 6pm with reservations. Really nice first impression and ambience. Had the ginger cocktail which was amazing - not to sweet and very boozy. Ordered 4 things between 2 people.  The guacamole was amazing,  didn't know olives and avocado would be so good together. Chicken baos were alright, bao bun wasn't great but meat and sauce were good. Eggplant lasagna was hands down the best thing I've had in a long time, definitely worth a try. 4 cheese gnocchi was okay - too many things in one dish. At first we got amazing service, but after they got us the wrong pasta we had to waited over 30 mins for our last 2 dishes. Anyone who passed by the table would ask how the food is, but actual food took very long to come. We were there for nearly 3 hours. They were really nice and gave us complimentary champagne and cheesecake to make up for it though. Worth a try at least once - you wont find a mix of flavors like this anywhere else."}
{"text":"Great vibe and place for a date ! Food was excellent. The bartender could have been a little less formal and more friendly. Other than that I'd definitely recommend it and would return."}
{"text":"Lees, Bent and now Frings!   We had reservations for four last night at 8:00 p.m. and for a Wednesday night this place was pretty happening. My husband and I had arrived earlier then our reserved time but there was no issue as the hostesses seemed more than happy to seat us until our friends joined us.   Upon walking to our table I noticed that the ambiance was perfect. The comfy tufted booths and the contemporary vibe was ideal in terms of décor for this King Street location. One of Susur Lee's sons was walking around and mingling with individuals in the restaurant which gave more of an intimate setting. I did find that it was a little too dark to take photographs but that didn't bother me too much as the flashes on our cameras gave us the perfect captures.    The waitress asked us if we had been to Susur Lee's other locations and we had and the waitress asked if we were familiar with the sharing style menu and we were and it was time to order!   We ordered three appetizers to begin with:   1. Homemade Ricotta Toast: This incorporated jalapeno plum jam and pomegranates. Every bite made me crave the next until I was super disappointed that this dish had ended and wanted more.  2. Avocado Spread Toast: This incorporated pistachios, lemon, black olives, fresh mint and sumac. What a phenomenal fusion of flavors this was. Every kick of flavor felt like there was a party in my mouth and I savored this until the last bite.  3. Mom's Homemade Sweet and Sour Meatballs. The sweet and sour sauce, parmesan and toasted bread crumbs had a very homely taste to them. The meat was cooked well and the sauce had the right amount of tang to it.  For the entrees we ordered:   1. Southern Spicy Maple Fried Chicken: The chicken pieces to this dish were perfectly fried to give a crunchy taste yet the inside was tender and moist. It came with raisin slaw and leafy greens. The focus of this dish was the side sauce of spicy maple syrup glaze which was sweet but had a bit of a tang in it which was perfection. 2. Susur Burger: This burger was epic and there would be no other word to describe it. On a menu that had very elaborate dishes, we were curious if the burger would stand up on its own. The meat was freshly prepared and cooked to be very juicy when bitten into, drenched in gourmet cheese and dressed with crisp lettuce and tomato. This burger for me will rival any other gourmet burger place that I have been to thus far.    There is a dessert menu available despite not showing on the website however our group did not order any as we were completely satisfied with the portions of our appetizers and entrees.   The waitress was attentive to our needs. Our food came on time with waiting periods that allowed for conversation. And we had asked for separate bills and that did not pose as a problem either as some of the reviews may have suggested.    Now with all of these positives comes a downfall. And the only downfall about this place is that it gets exceptionally loud. At first when we arrived the track list and music was great. It was soft and in the background of our conversations. But closer to 10:00 p.m. the music became overpowering and I found that I had to shout across the table to communicate with my husband and our friends. If this little hiccup could be improved, I think this restaurant is overall perfect!"}
{"text":"A collaboration between Drake and Susur Lee did not disappoint. The staff was well informed about the dishes and recommendations, the ambience was nice and the decor very insta worthy. Dined there with three friends and each of us ordered different sharable plates. A variety of food, great conversation and ambience turned into a lovely evening."}
{"text":"Sorry Aubrey, I was excited to try this place but I can say with certainty that it's overpriced and overhyped. There was nothing wrong with the food, it was all pretty decent, but there was nothing that stood out as being amazing, the portions were small, the prices way too steep, and the service was so incredibly slow that it was practically non-existent. Granted, I went back in December when it was still fairly new, so perhaps they were still working out the kinks.  If I recall correctly, our waitress first came over when we weren't quite ready to order, then disappeared and didn't return for like half an hour. Food took way too long to come out, and my main dish was completely missed due to some kind of error, so I just watched my two friends eat while I waited for my food. Our waitress tried to make up for it by taking it off my bill, which I appreciate, but overall I wasn't impressed with the whole experience.  The actual food we ordered was as follows:  Beef sliders (no longer on the menu) - Comes with 3 in an order. They were just like mini burgers. Pretty tasty, but also small.  Grilled octopus - This was literally just a single octopus tentacle on a plate :S Again, it was good and I love octopus, but I wouldn't pay $24 to eat one tentacle as an appetizer. You can get octopus at Gusto101 just down the street and I'm pretty sure it's cheaper and you get at least two (maybe two and a half?) tentacles which taste just as good.  Of the mains, I remember the southern spicy maple fried chicken was pretty good, although I think it was mostly because of the sauces and less to do with the actual chicken. Either way, it's $24, you don't need to pay that much to eat good fried chicken.  The other two mains (one of which was my own which I had to wait for) I can't even remember, I think one was lamb and the other probably beefy which doesn't appear to be on the menu anymore. In keeping with the trend for the night, I'm sure both were perfectly adequate but just not amazing enough to be memorable.  The restaurant is nice on the inside, obviously they tried to make it hip and trendy with dim lighting and the like. Solid music choices while we were there, mostly hip hop and R&B. Cocktails are also pricey, hovering just shy of $20 for a drink.   No sightings of Champagne Papi or Susur Lee, disappointing.  Still glad that I checked it out, but won't be coming back. I'll try to stalk Drake elsewhere."}
{"text":"Service was impeccable. Very warm and inviting staff.   The food was exceptional. Most of the dishes were designed to share which I really enjoyed.  The slow braised short ribs blew me away.   I wasn't impressed with the wine selection though considering the cheapest glass of red wine was $37 per glass. They could offer a more reasonable selection of wine.   Overall, I really liked Fring's and would most certainly go back."}
{"text":"Dim, cozy, candle-lit, lounge vibe, a restaurant by celeb chef Susur Lee and the Drake. The surrounding music is just loud enough but not overbearing so you can still carry a conversation with the group across the table. The place features a bar in the center occupying most of the space with surrounding booths for dinner/drinks. I would say a scene to impress a date, but note cocktails are $16-$19. The service was really attentive, we had reservations 5:45 - 8pm but they didn't shoo us out even when there was another reservation after us (maybe because of the $$$$ spent). From trying the menu from top down, expect small embellished overpriced plates that do not quite live up to expectations.  Overall I enjoyed the environment and the highlight would be the cocktails and toasts.   Our group had tried quite a few drinks from their cocktail menu. If you're like me and prefer a milky fruity concoction without tasting so much of the alcohol then I recommend the Proper Ting or the Coconut lime mojito. I've tried the Sweeter man but the name can be misleading as it's not as sweet and you can taste more of the alcohol in that drink. Our waiter told us that the dishes on the menu are meant to be shared as they can't guarantee that they can have every plate come in at once.   Ordered  Toasts (all 3 - $10/each) - Hard to decide which is my favorite as all 3 had a different taste palette and was the highlight of the meal along with the lamb.  - Wild Mushroom and Prosciutto - warm hearty meaty as expected - Homemade Ricotta - sweet jam paired nicely with the ricotta cheese didn't expect it to be so good - Avocado Spread - If you love avocado this is a joy, as it's loaded with avocado and mix of goodness  Small plates Organic Salmon Crudo ($19) - The ingredients were fresh and good  Kale Caeser ($15) - Kale salad with parmesan and bits of meat.  Spicy Asian Tuna Tartare ($24) - I only remember trying a bit of this but it was okay Crispy Chicken Sliders ($14) - 3 sliders each  Large Plates Pan Seared Whole Branzino ($32) - a quite small dish and was nothing special  Grilled lamb chops ($38) - They can customize to give a bone per person at the table so you can each have one New York Striploin and Truffle Fries ($52) - Perfectly cooked medium rare. Fries were fried in a special way so they remain crisp for longer periods of time. I don't think the truffle on top was necessary Mushroom & Winter Truffle Pappardelle ($40) - I don't recall mushroom, the pasta was really good but also very small portion  Sides  Oven Baked Buttered Sweet Potato ($8) - I love sweet potatoes but this fell flat for me as it was cooked more al dente than I would like, I prefer my potatoes cooked more on the softer side. The seasoning also didn't bring out the sweet taste of the sweet potato.  Grilled asparagus ($12) - Very tiny portion, asparagus were so thin (less than 0.5cm) and only had 5-6 pieces.   Dessert Tiramisu in a jar - It's okay but a little too sweet for my palette and I have a sweet tooth too Lava cake with Ice cream - My favourite as it's not as sweet as you may think Creme brulee - Always good and this is creamy and richer than the normal creme brulee. I would recommend Sweet bread dessert with ice cream (don't remember what it's called) - I wouldn't recommend as it had a fried dough but wasn't as nearly as good as funnel cake."}
{"text":"My boyfriend and I came here on Friday night for my birthday dinner. As I had never been before I was so excited to finally try it. When we arrived for our reservation the hostess seated us in two comfy furry chairs - which we thought were pretty cool.  Almost immediately being seated after our server came over, didn't introduce himself (only reason I know his name is because I heard him say it to another table), didn't tell us of any specials, didn't suggest any drink or food items and when we asked for his opinion between two menu items he replied \"Both are pretty good.\"   I won't go into every detail but throughout our dinner we felt very uncomfortable. Our server literally treated us like he couldn't wait until we left and was rushing us out. His attitude was absolutely terrible and he had no personality. It was upsetting because I overheard some great servers just a few tables away and was upset that we got stuck with this guy... I'm sorry, but a huge part of a great restaurant experience is good service. I was really surprised... and for that I give the restaurant 3 stars. All in all, I would probably come back because I enjoyed the ambience and the unique food options but would absolutely request a different server."}
{"text":"Exactly the kind of place you'd expect a hip-hop star to open. Uber cool vibe, trendy decor (read: faux fur chairs) great music, great food. Service was also bang-on.  Must try's: fried chicken, Bao chicken sliders, crab cakes and rib tacos.  Gnocchi was awful  While I loved our server, there was an underlying attempt to upsell at every possible moment. If I want a double, I'll order it :)  Special mention to the in-house band. Sexy AF music....LOVED LOVED LOVED!!   Will go back."}
{"text":"Came here last night with my boyfriend for our anniversary dinner and boy was I pretty disappointed. I love Drake and all, but this restaurant is WAY too overhyped.  As it was a Friday night and knowing how busy it will get, we decided to make reservations. Upon arrival, we still had to wait for a while and got seated downstairs. To be honest, I wanted to sit upstairs but I didn't really mind. This restaurant is much smaller than I expected. The downstairs seating was a bit crammed up. The music kept stopping and didn't play at times. However, the hallway outside the room we were in and the upper floor had different music playing and it was MUCH better!  The service was pretty good. Our waiter checked up on us here and there and gave us suggestions.  The food was good, however the portions were much smaller than expected. We got the truffle fries for an appetizer, which was amazing! I got the spicy rigatoni rose pasta and my boyfriend got the short rib tacos. The pasta was so good, I loved it!! The tacos were okay, I definitely have tried better. I felt like the food was way too overpriced for the portions and for how it tasted. I also got the Fring's exotic fruit sangria and it was SO good! The best sangria that I have ever tried. The drinks were also really overpriced.  All in all, it was an okay experience, not horrible but not amazing. I feel like I was disappointed only because of how overhyped this place was.  P.S. try to get a seat on the upper level, because it looked much better and the music was really good."}
{"text":"Almost immediately the ambience was set. From the music playing you can just tell that the playlist was tried and tested to pair perfectly with the overall dining experience. I particularly enjoy pan-Asian cuisine, well anything really that Chef Lee serves up, and Fring's is no exception to that. I can't wait for when Fring's opens to the general public and I can finally bring my friends to see what I'm talking about!"}
{"text":"I would likely give this 2.5 stars if I could - It is hard to write a review because the food was definitely good, but everything else just wasn't. There's so many good places in the city now, that I likely won't be going back here. It took us about an hour to receive our food (Even the apps) after our order was placed. The waitress was apologetic, but the kitchen must have been in way over their heads. All the staff seemed to be running around confused.  Once the food arrived, it was good, but not the best I've had. Susur's other restaurants impressed me more. It was also extremely overpriced, which seems to be a consensus on here. The music was way too loud for a weeknight, everyone was yelling over each other. We honestly couldn't wait to get out once we were done (hours later). Definitely not a good place to go if you were looking to have a conversation with someone. I was excited to try this place, but left dissapointed and annoyed. Overall, maybe a good place to go for a couple apps and drinks on a weekend with a friend, but not a place to dine with a larger group. Maybe worth the try if you like Susur's food, but I would recommend Lee, his other place down the street, in that case."}
{"text":"I don't even care to go into detail on how horrible the front of house service was (specifically referring to the bartenders and waitstaff, as the hostesses and food runners/support staff were great).   The food was absolutely amazing. It's exactly what you would expect from Susur Lee. Unfortunately, it does not out-weigh the worst service I've had in a long time."}
{"text":"I absolutely loved this place! Let's start with the setting- a beautiful moody spot with your choice of armchairs, setees, and tufted benches to sit. The setting is complete with a DJ who is playing on-trend hits throughout dinner. Vibes.  Drinks? Yes please! Bae and I had an Audrey Palmer and I had some sort of spicy margarita situation. Lit.  For dinner we started with the crab cakes. I would describe these as crab donut holes because that is the size. Followed by their Parmesan Asparagus and the Korean skirt steak. The flavors were amazing, the food melted in your mouth, and we opted for a family-style dinner so sharing each plate still left us very full.  For a birthday dinner date night, the setting was perfect."}
{"text":"I really wanted to love this place. But the food was disappointing and overpriced for what you get.   The good: Went on a Wednesday night. Live hip hop cover band. Great ambience. Good date place for sure. Tasty cocktails (with NYC prices though, so not for everyone).  The average: Food was just OK. I had sort of upscale big mac mini burgers. Avacado on toast. Short-ribs that were really flavorless. I'm a huge Susur Lee fan. Maybe we just tried the wrong food items, but we've only been back for drinks and apps."}
{"text":"Food and service is above average...   The space was tight and way over priced for what it is."}
{"text":"Good food, small portions, rigid unfriendly service. Nothing stuck out about the experience."}
{"text":"I am such a big Susur Lee fan but I prefer his other resto, Lee. A lot more creative than Fring's. That being said, it's still very good food in a trendy atmosphere. Those furry chairs though - so Drake."}
{"text":"*Solid 3.5 Stars*  First off, shout to Kai (Bent-Lee) for running a dope restaurant.  As a rap aficionado, I cannot deny that Drake brought me here. Cool hip restaurant. As a matter of fact, Drake and his friends were sitting across the bar from me, which is pretty cool.   Don't get me wrong, I love Drake, but I simply think this place is so so. I had a Mojito to drink and the Lamb Chops as main dish. The drink was good, but the food was iiight. Ultimately, these 2 items came to a total bill of 68$, with tip.   The service is nothing to rave about either (at least for our waiter). The hostesses were friendly, but the waiters were nothing memorable - especially at those price tag."}
{"text":"Although not totally my cup of tea in terms of taste and ambiance, this Susur Lee joint is par excellence in terms of execution.  Was here for a large group on a prix fixe menu and the service was seamless as dish after delicious dish was ferried our way.   The grilled octopus was particularly nice, I've never had it before but it seemed cooked to perfection...not at all rubbery or overdone with full grill flavour. The beef carpaccio was to be savoured.  The spicy maple fried chicken was perfect. Not too spicy at all and just a hint of maple, it was a surprising flavour combination that worked well.  The beef ribs and Brussels sprouts were hearty and filling. My wife and I split in the desserts - she was unmoved, but I enjoyed the freshly made chocolate ice cream the kids were given (and turned away..used to store bought flavours sadly)...the other desserts were adequate as well.  A faux pas with my coffee ... the cream had spoiled ... was quickly rectified and a new one produced quickly.  The mark of a truly good restaurant is not perfection as there is no such thing, but instead, how well hiccups are fixed.  Overall I'm not sure if I'd be back.  But this has more to do with the loud droning Drake-influenced hip-hop and nearly pitch-black lighting, making conversation difficult and offending my less urban musical tastes. The prices will keep me away as well, as I tend to favor spending this sort of dough on a nice Barberian steak or Scaramouche duck confit and cheese plate.  But for those who don't mind, this is a sure home run."}
{"text":"Cute place and relaxing ambiance. Our server Alex was great. We ordered the crab cake/balls, fries and the southern fried chicken with maple syrup. Man O Man! That was gooood, ESPECIALLY that fried chicken which was fried to perfection. It was soo juicy and tender in the inside, crunchy on the out, and the maple syrup was mmm mm. My tastebuds made love to food lastnight. Ha!  Now, if you have an huge appetite and small pockets, this place may not fill you up. It was the right portion for me though. I would most definitely come back again and again."}
{"text":"Ah the big deal with Drake and Susur... Ok so this post is late. Came here the first week it opened.  Maybe they had a few stuff to iron out so not sure if it has improved.  I have to say the food is why there are even stars on this post.  From what we had it was delish.   But right from the get-go - wholly confusing.  Our waiter, though a bit awkward explained to us the whole TAPAS idea. 'But it wasnt like regular Tapas. It was larger in portions. So it didnt matter what section you ordered from it was all tapas. Since there were 3 of us he suggested 4 tapas.'  He came back and re-iterated TAPAS. Ok already.  But then said so for 3 of us 5-6 dishes would suffice. Wait. You said 4. No, the dishes are kinda small. Wait. You said larger than regular tapas. Im confused.  We decided on 3 appys and a main pasta dish.   Sooooooo basically when the sizes came in the apps were app size and the main was a main size all for one. The waiter looked like he was running around with his head cut off yet we had to keep calling him over because he seemed to be running back and forth with none of our dishes in hand nor water refills.  Got here at 8 was served the main by 10pm. All this \"Tapas\" confusion and one of us still pretty hungry and now sleepy at this point.   My friend had to say something to the manager.  Twas a bit riddonkulous.    Final note: We could have done fine without all the tapas nonsense. Its just a regular menu size. Use it like one.  Yummy dishes. And I know Susurs dishes are delish but 35$ for the pasta regular size - I duno about that. I guess at that point with all the confusion it didnt seem worth all the effort.  They were nice enough to dock that dish off our tab. So cudos to the manager for trying to manage a frustrating night. Waiter def needs a lot of work - maybe it was a bad night, or maybe he was misinformed himself with the tapas stuff.   Stop with the tapas, please, if I hear that word one more time...... Dont pretend you're something you are'nt."}
{"text":"They are advertising a special \"truffle menu\" for TIFF so a few friends and I, being huge truffle fans decided to check it out. Hugely disappointing. Paid 75 dollars for a truffle pappardelle dish that ended up being unsalted and contained huge chunks of plain mushrooms. The truffle was shredded, not shaved, could barely taste it. Not sure if they are trying to be sophisticated with a \"truffle festival\" but definitely not worth it if you are a true fan of truffles. Go to Buca, it's the same price. Service was also slow."}
{"text":"Good but not overly Impressed. Walking I loved the decor and atmosphere. The service from the time you walk was friendly and pleasantly attentive.  Unfortunately for our group, we came hungry. Everything we ordered was really good. Portion sizes were though were not substantial and not shareable. When you have a great taco, who wants to share.  Overall, it was a pleasant experience."}
