{"text":"Un endroit génial! On y mange bien, les frites sont excellentes. On se croirait en Belgique. Les employés sont sympathiques. L'ambiance est assez agréable. Si vous êtes étudiant, c'est tout juste à côté de l'université."}
{"text":"Good (not perfect, but good) poutine place. Many different kinds. Friendly service. Also has a liquor licence!"}
{"text":"Creative burger selections! I was actually hoping NOT to go to a burger joint during a vacation away from Burgerland USA, but I was pleasantly surprised. Yes, this is a Belgian frites chain, but the poutine varieties and the burgers really opened my eyes to the possibilities. You can upgrade the beef in your burger.  There are chicken, fish, pork and veggie varieties, each combined with yummies, like brie, apple and lettuce, or other breads and sauces that complement (yes, that means complete) the choice of patty.  Even the chien chaud had a life of its own.  Sit inside or in the little parklet in front on a lovely afternoon and you won't be sorry."}
{"text":"Great combinations of flavours and nice quality in burgers portions aren't crazy big so you'll be full but not stuffed. Really cool relaxed joint don't go in expecting crazy amazing service because it's not about that it's in a highly population student area so it's more the food then service and food but they still do a good job. Overall experience was awesome wether alone or with friends it's awesome to relax and just chow down on cool burgers. They have English and French menus and the staff is bi-lingual."}
{"text":"So far my favorite place to eat in Montreal. I love a good burger and fries. The sauces are a great complement to the fries which are good on their own. The staff was very friendly and did not seem to mind our young kids. Lots of students she we visited. Clean bathrooms."}
{"text":"Not too shabby. Will do in a pinch for a poutine fix. Relatively generous portions and staff have a great attitude. :)"}
{"text":"The poutine was pretty good, what made it outstanding was the fries. I ordered a small portion of fries (there was a LOT by the way) and two different dipping sauces. The sauces tasted amazing and refreshing, good accompaniment with the greasy fries."}
{"text":"Not sure about the food because it's been over 45 minutes waiting for fries and a veggie sandwich.   Saturday night , one cook  and one waitress.   My  4 and 7 year old are asking \" what's their deal here!"}
{"text":"I've lived near by for over 3 years and never knew they were open here until very recently. Small place but the same great food and very friendly staff!  Just like any Frites Alors, I recommend it!"}
{"text":"Love this place. I had the pulled pork poutine. Very big portion (compared to the other frite alors places). Very tasty. My brother had a burger which I found good but nothing special. Honestly go there for the poutines. Much better than la Banquise."}
{"text":"I really like this place. I find the portion pretty small for the price but the taste makes up for it.I got a pulled chicken fried in duck fat poutine. DELICIOUS! The place is cute and hipster like. The waiters look very laid back but the service was good. Obviously the fries are the star there. Its like an upscale fast food. When in doubt this is always a good plan B."}
{"text":"Après une deuxième mauvaise expérience, j'ai décidé de ne plus jamais remettre les pieds à cette succursale.   À ma dernière visite, je suis entrée avec mes amies vers 20h. Dès notre arrivée, une serveuse nous dit, depuis derrière le comptoir : \" ouais on est comme genre fermé... \". Le resto fermant à 21h, nous avons demandé pourquoi. La réponse : \" ouais.. Non on est fermée \". Une explication logique un minimum articulée aurait aidé à comprendre et à respecter la situation.   Sans explications logiques, ni professionnalisme, ces filles nous ont demandé de partir.    Habituée de la succursale de Côte-des-neiges, j'étais heureuse de retrouver cette ambiance et ce bon service dans mon quartier.. mais non. Après trois mauvaises expériences d'oublis de commandes, de manque de services ( aucune serveuse à notre table? les autres refusent de nous servir car ce n'est pas \"leur table\"?) et de non professionnalisme, c'était la dernière fois que je mettais les pieds dans cette succursale. Très dommage.."}
{"text":"J'ai bien aimé. Bon choix de menu, les frites sont excellentes. Pour des étudiants, c'est parfait, un bon choix, rapide.  Mon hot dog, mes frites, tout était parfait"}
{"text":"We loved it. Excellent french fries.  I had the hamburger frites aloes with American mayo.  So good.  We loved it.  The poutine was also excellent. Marc is an excellent host.  Bon appetit!"}
{"text":"I haven't had Frite Alors in about 5 years. Since then gourmet burgers have sprouted up all over the place so I wanted to see if one of the originals around here has kept pace.  I had the Frite Alors burger ($13 with $4 more to get a poutine), it really was a mishmash of flavors that hit and missed.   The patty was very thin, like a Whopper and i could barely taste it. There was a  red pepper mix that tasted sour and the bacon and cheese were not really as present as they should.  The biggest flaw was the ciabatta  bread, nowhere was it mentioned that it was not a traditional bread. To me, that type of bread already overpowers a weak patty.  The poutine was ok, but very small, the fries were a bit limp and soggy.  The only upside is the nearby park where we can enjoy the takeout goodies. Theres's alos a terrace to soak in the Fleury Ouest vibe."}
{"text":"I would've thought that a Poutine place would be excellent, especially since I was in Montreal at the time...alas, it was not that great.   The fries were good, but the cheese curds were still hard and cold, with minimum gravy that didn't melt the cheese curds at all. Alright, to be fair, I had the Mexican Poutine...but you would've think that the cheese curds would be melting...  Cold, disappointing...it made my night sad. I really wanted my Poutine night to be special in Montreal. It just didn't meet my expectations, unfortunately."}
{"text":"Ordered the half an avocado burger got a little spread. What a joke don't advertise it has half when it's barely anything. Huge fan of avocados  so they screwed me at this place.  New French girl failed to mention the burgers came with fries so stuck with fries and poutine.   Poutine with the sausages made my friend violently ill. Terrible food will never order from here again.   Thank you for food poisoning from my friend  And the shady burger."}
{"text":"Ever since they changed the management, it hasn't been as good. I still love going but the charm is kinda lost. The fries are excellent and they have a variety of sauces. It is kinda expensive but it's a great place for a family dinner."}
{"text":"Delicious burgers and fries! I'd never had poutine before, and now I'm afraid it won't be as good anywhere else because the fries made it fantastic. Wish we lived in Montreal, we'd eat here all the time!"}
{"text":"I found out the hard way that saucisse aparently translates to hot dog. What a disappointment. Sub-par fries, tasteless gravy, and a hot dog instead of a sausage. Don't order the Viennaise."}
{"text":"When you are in Montreal, you have to try out the Poutine. Even though this is a chain restaurant, they know how to make their poutine! Being a Toronto resident, I found their poutine to be one of the best I ever had. This is one name I will always remember for poutine."}
{"text":"C'est toujours agréable de se retrouver chez frite alors. On y trouve une ambiance des plus agréables, un service correct, du personnel sympathique.  Les burgers sont très bons et les frites maison aussi. On y mange bien pour pas beaucoup plus que chez McDo. Seul défaut : le choix de bières pression seulement réduit à une belle gueule rousse et une boréale pilsner..."}
{"text":"I come here from time to time when I crave a burger because their options are always good. The service is quite slow sometimes, for no obvious reason... But other than that, I have nothing to complain about. The prices are good, the atmosphere is good, the burgers are good. Nothing outstanding but still a nice place."}
{"text":"It isn't that the food isn't good....the fries are delish. But the people who work there are just so scattered. There were only 4 of us at the counter. One threescore in the back. And two people outside. Yet they acted like the Forum just let out and that they were ambushed...yet not one person complained. We actually got our drinks ourselves because we had been at the counter 20 minutes and she never bothered.   Everything tasted fine..upper crust grilled cheese with onion and sundried tomato and duck poutine. Delicious gravy (although I love regular Quebec *orange* gravy...this was a beefy rib sauce over tender shredded duck).   My kids love a fry cone with harass a sauce or the lime mayo..but we miss the walk-around Jean Talon market space. It was the best."}
{"text":"We stopped in for a bite before a Yelp Event. We sat on the terrace and waited for the waitress to stop by our table as she delivered the only other terrace table's meal. She didn't even make eye contact. A few minutes later we ventured inside and were told someone would come give us menus (there were 2 kitchen boys + waitress/cashier). The waitress came out and dropped our menus. After waiting another 10-15 minutes for her to come back and take our order we went inside to order at the register (if this was the procedure, our waitress failed to mention it when dropping off our menus). The food was ok, the chef guy was super nice/helpful but I don't get the point of using half waitress techniques and half cashier techniques with customers. Telling us to wait for service that doesn't come. It left us very confused and feeling as though customer service wasn't the point of this establishment."}
{"text":"I got myself a small classic poutine. It wasnt bad and it wasnt good. The food is nothing amazing.   The staff was nice... Not much to say about this place but it satisfy my poutine cravings of the month.  Overall, this place is worth a try at least once.  They have many variety of poutines to choose from.  If you dont like poutine, they have hamburgers and hot dogs."}
{"text":"Les meilleures frites se trouvent chez Frites Alors !  Sans oublier les meilleurs budgets. Mon préféré est dans contre dit le burger à l'avocat.   Les sauces sont toutes savoureuses !"}
{"text":"Stopped here with some friends before heading to a concert. There weren't any tables left so we sat at the bar. Service was slow but there were only two staff left to man the cash and the kitchen. Ordered a stout I hadn't tried (some Scottish beer), a sandwich and curry sauce to dip my fries.  The meal was served quick enough. On the menu my sandwich was said to have pork rib and smoked meat. I imagined this to mean my sandwich would be served with pulled pork rib and slices of smoked meat among other dressings. What was actually served was a beef patty and a strip of bacon. I am still not sure if I was served the wrong sandwich or if the sandwich was meant to have any part of a cow and a pig. I'm not one to make a fuss so I ate anyways.  The sandwich was good enough. Very saucy and savoury, though it was very greasy. It had not stopped dripping grease until I finished it. The curry dipping sauce was fun. The fries were golden and crispy but bland.  I have to forgive this experience due to a lack of staff. Maybe next time I'll just order the poutine!"}
{"text":"Great place to have a quick lunch or supper with kids. I tried the fish and chips and it was good! The burger looked awesome. Kids had hot dogs and they enjoyed it. Good quick place"}
{"text":"Came here at 10pm on a Monday with my friend after a hard day of studying at UdeM. It was so close to school and it's two steps from the metro (côte des neiges)   I always thought it was a small fast food place, but to my surprise, it's a decent sized restaurant with a bar and everything!   (They have a little sticker on the door that says \"they love us on yelp\"! I thought it was super cute)   The place wasn't that busy and the waiter was really nice and attentive. We ordered a large \"frites alors\" poutine to share. The food came very quickly and I was so shocked by how much food they gave! (Thank god the metro was so close!)   The fries were cooked to perfection, the sauce was the perfect amount of salty, the veggies were cooked perfectly, I could go on, but I'm running out of ways to use the word perfect.   I wish the cheese was a bit more melted, but that's just a TINY thing. I still loved loved loved it!   Can't wait to go back!"}
{"text":"Ma sur m'a faite découvrir le restaurant frites alors pour la premier fois et j'ai adore ça   Après la game de hockey de mon filleule nous somme aller dîner chez frites alors   Dur de décidé quoi prendre tout à l'air délicieux   Je suis arrivé sur un choix le L'Engraufrez-Vous Ses un burger de buf sans antibiotiques servi sur une gaufre belge salée au oignon avec cheddar vieilli St Guillaume avec poivrons rouge et oignons grillés et mesclun et dijonnais servi avec frites belge   J'ai tout manger tellement que s'était trop bon :)   Le service et rapide et la serveuse très gentille   Beau décor du restaurant et chaleureux   Bon choix de bière local et choix de vin et liqueurs et jus"}
{"text":"Always great food for fair prices. The burgers and poutine are both really flavorful and they may have one of the better poutines in Montréal so far. The staff is always friendly and fast."}
