{"text":"This was one of the worst experiences I've had whilst spending this kind of money. I would've been upset by the service and quality of food if I had been at Taco Bell. Drinks took over 20 minutes, if we got them. Waiter was awful and rude. Out of 8 of us I was the only one who got what I ordered...everything was cold and not worth the money IF it was served (charged for the food and beverages that never came, by the way). Finally, we were all charged closer to 30% than the mandatory 20% reflected on our bills for a tip with a group of 8. We spent hundreds of dollars for an absolutely awful 2.5 hour experience without a single apology."}
{"text":"This is a review specifically for the weekend brunch. It was fantastic. I dined with two other companions and we all really enjoyed our meals. The service was excellent and the food so tasty! We were kind of sad that we were the only ones dining on a busy weekend morning (Art Fair happening close by as well as Farmer's Market) and felt the restaurant needs to make it more clear that they offer brunch. We were even confused when we saw the menu until the server pointed out that one side said brunch in spanish haha. I hope they can find some ways to increase traffic whether through special offers, coupons handed out during Madison street events or the like. Once people stop in, I'm sure they will be back for more."}
{"text":"My partner and I tried this place recently, and we really wanted to like it. As a vegetarian, I thought the vegan options looked amazing. My boyfriend is a meat-eater and seemed pretty excited about his options as well. We got to the restaurant around 6:30, planning to go to a concert afterwards that started at 8. We figured we would be fine on time (hint: we were very wrong). There was a 30 minutes wait, which we expected and planned for, so we sat at the bar. After deciding on drinks and an appetizer, we waited quite a while to get the bartender's attention despite it being a very small bar. After ordering, it took roughly 10 minutes to get our drinks. That should have been a sign. We ordered the goat cheese for the appetizer. This dish itself was great, but for whatever reason, we were only given 3 thin slices of baguette with it. Not even half the cheese was gone when we finished the bread. We eventually got a table in roughly 30 minutes, which was totally fine. We placed our order with our waitress. My boyfriend ordered the lamb, and I got the vegan pozole. I also order a whiskey sour, which came out 3/4 full with the glass overflowing with ice cubes (seriously, they were over the rim of the glass). Not cool. It took quite a while, but the waitress brought us some bread and dipping oil that I assume comes as an appetizer with every entree. No more than 5 minutes later, she came out with my entree (which seemed poorly timed). It was then that she informed us that they were out of lamb, so they couldn't make my boyfriend's order. I'm not sure how that wasn't communicated to us at least before my entree came out. It all seemed pretty ridiculous. We were told we'd receive a decent discount on whatever he ordered in place of the lamb. Eventually, my boyfriend ordered something else. In the meantime, I tried my pozole and tried to eat slowly so I could wait for his food to come out. I was pretty bummed about how flavorless and under-seasoned it was. I figured with a full vegan menu, they'd know how to season it, but I had to basically drench my dish in hot sauce to enjoy it. We waited quite a while for his second-choice dish to come out, of course. When we got his food, they added a steak to his dish to make up for the mishap. Unfortunately, he said the steak wasn't that great, which was a real bummer. In the middle of his meal, he wanted to order another drink after finished his, but he chose not to simply because he didn't want to wait another 15 minutes for it. I don't think anyone should have to consider this at a nice restaurant. Eventually, we were given our check, and we were charged full price for his entree. We were told that the steak (which unfortunately wasn't great) was supposed to replace the discount. Don't get me wrong: we were very appreciative of this, but I'm not totally sure giving someone something they didn't ask for was the way to make up for this. We negotiated a while, and eventually they only took 20% of off only his entree. I don't think that really compensated for the extensive wait for literally everything and the lack of communication concerning his dish. At this point, it was nearly 8:45. We spent over 2 hours there. We wanted to negotiate a bit more, but already missed nearly half of the 8:00 concert we were going to and just wanted to leave. My boyfriend tried to speak with the manager again, and they ended up giving us 20% off of our next visit, assuming we wanted to come back after all of that. I don't think we will be back. (I truly feel bad giving a new restaurant a bad review when they're trying to get one their feet, and normally I wouldn't, but more than just a few minor things went wrong during our visit, unfortunately.)"}
{"text":"My husband and I went to Fuegos for our 10 year anniversary dinner this past weekend.  After reading rave reviews, we were really excited to eat here.  We were several minutes early for our reservation and despite there being several tables open, they had us sit at the bar until they were ready to seat us.  Normally that is fine.  But with two bartenders working behind the bar and the restaurant not being full, it too forever for us to get our drinks and to pay our bill.  We were finally seated at our table, between two very noisy tables of groups of 4 and it took forever for our server to come take our order.  Our server had no idea about anything on the menu and was not very helpful.  We ordered the cheese and meat plate for an appetizer and it was delivered to us on a floor tile. No joke.  A ceramic floor tile.  It cost us like $15 for this plate and it comes on a floor tile.  Okay whatever.  Server didn't tell us what the cheeses were and when asked, he had no clue.  We ordered our main course and it was nothing to write home about.  My steak was undercooked and had little seasoning to it.  It has Steakhouse in the name, you'd think I'd get a good steak.  Not so much.  My husband order the paella and was not impressed with it at all.  Needless to say, we probably won't be going back any time soon."}
{"text":"We tried to go to this restaurant on a Saturday night. They had a TON of open tables. When we told them there was 3 of us, the hostess pulled up her tables on her iPad, which we could see the reserved tables and open tables. There were many reserved tables, however there were also MANY open tables. It was 630pm and the hostess told us they wouldn't have anything open till 8pm. That was definitely not true!! Are they under staffed that they can't fill their tables? was it because we had a child? We will never know, but we will also never be returning! Terrible first expression!"}
{"text":"Amazing food. Service was a bit slow, but it was Mother's Day and very busy. Will be back!"}
{"text":"Good food and reasonable prices.  An innovative menu and the opportunity to have a tapas as an appetizer and then a main is fun - the calamari were delicious.   The service was quick and pleasant."}
{"text":"We tried Fuegos for a lunch/brunch. Their vegan menu is impressive and the food both vegan and non vegan was great. It's not often that in a restaurant you can have a vegan dish that's so distinctive and good that it stands out as a dish and it's vegan! They have a separate and always available vegan menu, food prepared and served with style. Fuegos is worth talking about!  Add a great mojito and Max our server, made this a memorable visit."}
{"text":"In town for a conference and my colleagues and we went here for happy hour and dinner. Great place for a group, especially if there's a vegan in the group. Our server, Tamika, was amazing!  She gave great guidance, was attentive, and added to the overall enjoyment of the experience. You will not be disappointed with the atmosphere, food, staff, or presentation of meals."}
{"text":"My friend and I went to Fuegos last night to celebrate our birthdays together. The menu choices were phenomenal.  I started with a happy hour margarita for $4.  It was fantastic!  Their drinks are all made from scratch with no mixes.  She ordered some tapas for her dinner and I ordered the lobster tail.  Our food was amazing.  The service was outstanding.  The décor was gorgeous.  We will definitely be back.  I already have plans to return next Tuesday.  I love the Willie Street area and this is a great addition to the neighborhood!  I highly recommend this restaurant!"}
{"text":"Friend suggested Fuego' s and I looked it up on Yelp and unexpectedly got a free Sangria!  Went out early on a freezing Friday night to beat the crowd. Cool ambiance, greeted quickly and got to grab a comfy booth.  Nice Waiter explained the way the menu worked.  All ordered drinks which were quite tasty - best mojito.  Ordered empanada, crab cake and calamri to start. Empanada was bland, not much chorizo to speak of.   Crab cake was meh, decent flavor but looked deep fried-for $15 for 1 crab cake, i expected better. Calamari was fabulous!  Made with calamri steak, perfectly breaded and cooked with a little spicy sauce.  I love calamari and this was a great. Special was lobster stuffed with crab and shrimp.  Don't normally care but beautiful presentation. And the dish was just as beautiful. Again, this seafood was perfectly cooked, tender, sweet, yum!  Had a great time, very good service and wonderful meal."}
{"text":"Solid service, food, and drinks. Would definitely come back. Salmon, scallops, and rib eye were highlights."}
{"text":"I made a reservation for a Friday night, but probably didn't need to. The restaurant was respectably busy, but it didn't look like there was a wait for walk-ins. 

First, I get that we are having unseasonably warm weather for mid-September, but holy cow, the a/c was on full blast. If the food wasn't so good, I would be distracted by my shivering.

We ordered off the conventional menu - 3 tapas to share: Tigres (mussels and blue crab in the most delicious buttery, cheesy, heavenly broth that we sopped up with bread), calamar frito (fried squid strips with a delicious sauce that I wish we had more of), and tostones maduros with a delicious spicy mango sauce. The tapas sizes were respectable - not too small, and not so large that they spoiled our dinner. 

For our main courses, we ordered the pechuga de pato and relleno de pato. I guess we really like duck. The pechuga de pato was well executed - medium duck breast with crispy skin. The port sauce and manchego grits rounded out the dish well. The relleno had great flavor (don't order if you don't like spicy), but don't expect large pieces of duck. 

For dessert they played the \"bring out some samples so you can't say no\" game. It worked. We shared a coconut cake which was the perfect size to have a couple of sweet bites to end the meal. 

Well constructed dishes, great ingredients, nice atmosphere, and attentive wait staff. Hopefully this place is here to stay!"}
{"text":"I made a reservation online 2 weeks in advance. I arrived 10 minutes before our reservation time (8 pm) & since my guest wasn't here, the hostess sent me to the bar, which was fine. My guest arrived & she was sent the bar. We order a drink & waited until 10-15 minutes after our scheduled time (it wasn't that busy...open tables, no one waiting, only 6 ppl at the bar) & asked the hostess about our table. She asked if we wanted to eat at the bar. I asked for a table & she told me she'd let me know when one was available. A few minutes later, we were seated, thinking this was strange (both my guest & I have spent decades working in restaurants). We ordered appetizers right away & dinner later. The service was quite lacking due to the fact we were one of 2 tables in there after sitting for 20 minutes. We waited for drinks....and my entree was burnt. I probably won't be back."}
{"text":"I have never posted a review but am forced to share my experience. Horrible!!  We visited on a Sunday night and they were very slow. Took forever to get our drinks which were fair at best. Ordered the grilled octopus app, very fatty octopus w a very oily sauce.  On to the main course, my wife's shrimp dish literally was flavorless and I ordered the deconstructed paella which promises chorizo, langostines, mussels, clams and chicken. Worst dish in my life, the chorizo was basically a Hills Farms polish sausage, the langostine ended up being the smallest crawfish of all time.  All swimming in a hideous broth that was close to tasting like dish water. The huge clams did not even open up and I pried them open to find way underdone clams. I asked for the manager and told him I refused to pay and get my check as we were leaving immediately. Just nasty, stay away"}
{"text":"Our group of 5 were really excited to try Fuegos and it did not disappoint! We had a great waiter, Max.  He made the night fun and gave us great guidance in regard to the menu.  We started with the blackberry and mango margaritas paired with one non-vegan and one vegan order of nachos.  Both the drinks and nachos were great.  We then tried the paella, salmon, pecan chicken, and vegan Ropas viejas de verduras.  Everything was fantastic so of course we went for dessert. We loved the carrot cake, mango cake, and white chocolate cake.  It was a great night of sharing good food and fun.  We will definitely be going back soon!"}
{"text":"Not such a \"happy\" hour!
We ordered drinks during \"happy hour\"...nothing fancy...rail drinks.  They were out of any great vodka (i.e., Tito's) and wanted to substitute.  The drinks were  not good, and were certainly overpriced...cannot imagine the \"regular\" price.  Food was ok...but not great.  This was a business meeting, and was very disappointed!"}
{"text":"Service was HORRIBLE. The food would have probably been good if it got to us warm. This place has potential, but unless they improve their system, it's not going to survive. Also, they were not as accommodating as they seemed to food allergies. Disappointed."}
{"text":"We got to the restaurant without reservations around 4:15pm. They said there would be a short wait and we were seated at the bar. We waited at the bar for almost 30 minutes and at no point did anyone ask us if we wanted anything or take a drink order. In that time no one updated us in the status of our table despite many tables being open. We then left."}
{"text":"We originally went to Fuegos for burger week. We were a week early. But Tuesday is 1/2 tapas day. So we stayed. Everything was delicious. The lamb and rice meatballs with mole and walnut cream were so good! The crab cake on onion rings was delicious. For our dinners we ordered the shrimp and scallop plate and the tenderloin. I've never seen such whopper scallops! The tenderloin: perfectly medium rare. A beautiful hunk-o-meat. We can't wait to go back. Wednesday is $4.00 margarita day. The service was friendly and timely."}
{"text":"Beautiful food and nice drinks. We were there for brunch, a group of vegans and two omnivores. Everyone was exited be the food options! We tried vegan cheese, garden balls, and guacamole for appetizer. Everything was amazing. We also tried nopales (cactus) salad and La Isla (yuka, beans, tortillas, and pineapple salsa) for the entree. Everything was delicious"}
{"text":"Second time at Fuegos last night and it blew us away just like the first time! I will echo a few other reviewers and ask why isn't this place totally packed?! We went in at 8 on a Thursday night and there was only one other table. Oh well, more flawless fresh guacamole and in-house made chips for us. ;) 

Between my boyfriend and I we've tried multiple apps and entrees here. All have been standout. Beautifully prepared, good portions, and superb flavor profiles. The boyfriend tends towards seafood, which is a clear specialty here; his deconstructed paella our first visit showed just enough innovation alongside its authenticity, and his conchas entree this time around was a complex balance of heat and flavor, richly studded with a generous portion of mussels, clams, shrimp, and prawns. I am a consummate carnivore, and last night's tenderloin was cooked to precision and seasoned with smoky salsa and chimichurri. SO. GOOD.

This is phenomenal food, authentically made with love and served with poise- we loved our server, she was perfectly attentive and gave us good input on my wine selection. Both times we were too full for dessert but excited to try it. Last night the owner came out and chatted with us after we finished. He makes a gracious host. It's clear not only that he cares about the experience there, but the food quality. We will be back, if we have to keep this place in business ourselves it'd probably be worth it!"}
{"text":"I was so excited about this place, but the food is very bland. The elote is kernels of corn on a plate, not served on a cob, and has the wrong queso on it; it's missing a bit of spice. The pozole was like water with processed meat  drowning in it. The Diablos y Angeles was unseasoned seafood with butter poured over the top, and the rice was also unseasoned with what seemed like butter added to it. One of our table mates also ordered the paella; he said this was equally bland, and a very expensive dish. Although our group had a bad experience there once before when they opened, we tried giving it a second shot and were disappointed. I will not return. The staff was very friendly to us, but we were also the only group there at the time."}
{"text":"I ordered food from uber eats. this cost me $17!!! this is ridiculous. $17 for one crab cake and a handful of fried onions!? absolutely ridiculous. completely takes away from how good it tasted."}
{"text":"I've had my eye on visiting Fuegos since it opened and hadn't found an occasion to come, but we did a little girls' night tapas dinner here on a Monday night.  We were pleasantly surprised at how busy the restaurant was on a weekday evening, but we had made reservations beforehand, thankfully.

The benches were remarkably uncomfortable despite the deceivingly comfortable-looking pillows that are there.  Otherwise, decor is cute and modern, and the atmosphere is dimly lit (great for a date night!). Anyway, not that important, but we started off with a pitcher of red sangria to get the ball rolling. It was solidly ok.  Usually, I expect sangria to have fruit in it, but there was but one slice of orange for a whole pitcher. Welp.

Our waitress was kind of standoff-ish.  When we asked to order empanadas, I found it strange that she asked why one of us didn't eat pork. It's a personal preference and I've never had waitstaff ever pry like that. For our time there after that, I had my water glass empty for most of the meal, and we couldn't really flag her down because she disappeared until bringing our check.

And now, for the food! I'll start with the highlights:
- Nopalitos: Get this. This salad was delicious and the dish that I would come back for. The dressing wasn't overdone, the nopales had great texture, and I was about this 100 percent.
- Tostones verdes: the sauce that accompanied it was yummy (mayo-based?).  They were crunchy and hot, there is nothing bad or regrettable with tostones.

Less memorable:
- Yucca: Crunchy. Served with ketchup. Not bad. Not worth how much you're paying, though.
- Empanadas (veg): I was super excited about these, but ours came out and the skin porous compared to other empanadas I have had.  They were soft.
- Queso de chiva: Wasn't a huge fan of the guajillo tomato chile, it was a little sweet for my tastes.

Even after bringing our check, service took forever. We stayed and talked for a while, and despite the emptying restaurant, we were perplexed as to how slow service was. Would I come back? Maybe, but not anytime soon. Perhaps I had bad luck in having a mediocre first experience, perhaps I ordered the wrong things, and perhaps our waitress was having a bad day, but this was enough to keep me from coming back for a while."}
{"text":"We came in around 7 and were seated in Emilio's lounge,  a relatively quiet and intimate portion of the restaurant where one can enjoy the company of a date or best friend without being bothered with excess noise. I asked to meet Chef Oscar as I have read a few articles about him now. He was a charming, joyful man who was clearly interested in providing restaurant patrons to the utmost standard. I also met restaurant manager Cassandra, Oscar's daughter, who shared her fathers interest in keeping patrons happy.

Overall the atmosphere of the restaurant was enjoyable. Smart, colorful, rustic, and busy. Service was appropriately timed overall with a couple delays.

I really wanted to have the experience that Chef Oscar wants for his patrons and so I asked for his recommendations. He recommended a mix of vegan and carniverous options. Surprisingly, the Tostones were one of my favorite. It was pieces of plantains perfectly fried for a crispy outside and soft inside, complimented with a cool mango sauce and topped with just a few pieces of green and red pepper. It really was an impressive marriage of cool and warm temperature, sweet and savory flavor, and soft and crispy texture. We were also served a grass fed filet and lobster tail. Both were cooked expertly and well complimented with Spanish flavor. 

What is interesting about the menu is that there is a mix of authentic and reinvented flavors. A lot of blended pepper sauces which bring bursts of flavor without the discomfort of heat. Things wont be exactly like the Tapas you would encounter in Spain - as one reviewer seemed to come to expect.

Overall a very enjoyable night. I think with the performance like I experienced yesterday evening, Fuegos will have a lot of happy customers.  Congratulations to the father and daughter team who is bringing a new token of diversity to Willy street."}
{"text":"Shout out to our waiter Max! He was super informative and gave us a lot of good recommendations with the menu. We started with the rainbow cocktails which were absolutely delicious. I had the burger for my main meal which was cooked very well and finished my meal with a dessert that was a mix of flan and cheesecake. It was just the right size, tasty, and nice and light. I like that they cater to vegans and meat-eaters alike, which was why we chose this place to begin with (we had a mix of both in our small group). I intend to come back to try more of the delicious sounding dishes and drinks!"}
{"text":"Our first time here even though it's been on our list since it opened.  The service was great, from them being able to move our reservation when we were running late to being very accommodating of dietary restrictions.  We ordered a number of small plates and all of them were very yummy and generous portions that were perfect for sharing.  The wine list was also fantastic and they had a good selection of craft beers on tap.  We will definitely return!"}
{"text":"I have been to Fuegos quite a few times now, and loved it every time. I am not a vegan, but love the choices I have tried off of the vegan menu. Chef Oscar sure can cook, and the staff are always friendly. Give Fuegos a try, it's my favorite when I am in town."}
{"text":"Fuegos was fantastic again!!! Gina made the night amazing!!! We will definitely be back"}
{"text":"The food was 5 stars while the service was a 3. I understand they're busy and possibly understaffed, but it took the server 20 minutes to even greet us once seated and we were rarely checked on. However, I loved the ambiance and the specifically vegan menu. I would recommend this place if you don't mind dining out for 2 hours."}
{"text":"Tried Fuegos for lunch during restaurant week (ate vegan). The service was slow - which wasn't the waitress' fault, she's was the only one serving 20 people. I had the squash soup and vegan tacos. Both were decent. But the bread that came with the soup tasted stale and the tacos themselves fell apart easily / didn't have much flavor. 

To be fair, this is a vegan restaurant - so that probably partially explains the tacos/bread."}
{"text":"This place was amazing!! I love how they have a huge separate vegan menu. I had the vegan chili rellenos and they were great. My b.f had something from the regular menu called paella, (rice n seafood) we were impressed with how large the shrimp and mussels were in his dish. They were huge! Largest seafood I have seen anywhere.
I can't wait to visit the area again to come back and order more from the vegan menu.
Our waitress Tamika was great as well!"}
{"text":"My gal friends brought me here for a birthday brunch!  The main attraction was that, per their website, they offered bottomless mimosas!  However, upon arrival, we were told this was not true.  Our server offered to \"check with the manager\" to see what he could do about it, but after saying that, he never mentioned it again (we didn't bring it up either, as it was pretty apparent that checking with the manager was a statement said just to appease us).  We settled for a pitcher of bloody mary's and a pitcher of mimosas.  Both were good (although when we ordered the mimosas, they did sit at the bar unserved to us for a quite a while).

When we were seated, we were given menus, but noticed a brunch menu was missing.  When we asked about it, we were told the chef was off that day....  Which of course made me wonder who was going to cook our food, but I assumed their brunch chef must be some kind of specialty chef?  It was a little disappointing since my friends were very interested in the brunch options.

I, however, was satisfied with the menu they gave.  I ordered the sopes.  SO GOOD.  Actually, pretty much all the food we ordered was delicious (which is why I am giving this a 3 star review).  When they found out it was my birthday, I was offered a free birthday dessert, which was a nice touch.

The service was very friendly and initially super attentive, but that dwindled as the meal went on and the restaurant got busier.  However, I think there was only one server; so, I can't fault him.  He was trying his best.

I really loved the interior/colors!  The decor and rich blue lighting was so calming and relaxing. 

I would love to come back and try their brunch sometime when their brunch chef is available.  I would recommend that their website be consistent with what they are going to provide/offer in their restaurant.  There is nothing more disappointing than a misleading ad.  It would also be great to have another chef who could prepare brunch so that it could be offered regularly.  There are probably details about this that I don't know, but as a customer, it was a disappointment.

Love the food got.  Love the ambience.  A few more tweaks and I can give this place 5 stars.  Hopefully next time!"}
{"text":"Fuegos is still working out some kinks as a new restaurant. Some seafood aspects of our meal, were \"best I ever had\" good. Overall, we did not have the best experience here. I do think we will be back for mainly seafood dishes, their weekday tapas happy hour deals and brunch $12 bloody Mary or mimosa pitchers. I do think we will not be back for a while though, because our service was very slow.

Drinks - My boyfriend had a traditional margarita and I had sangria. Both these drinks were great. I loved my sangria. 

Tapas - The waitress told us that the entrees were large enough that you didn't need to order tapas in addition to main meals, but we did get one. We decided to get the grilled octopus. It was the most delicate octopus I've ever eaten. I would recommend this dish. My boyfriend also got the seafood bisque that was awesome, full whole shrimp in it!! I got to take a few bites, it was great. 

Entrees - I got the deconstructed paella. I didn't have a clear understanding of what that was going to be and I was surprised when it came out as a seafood platter with a side of rice. Nonetheless, it was delicious. I would recommend, but understand that it is not traditional paella. Secondly, my boyfriend, got the 8 oz steak. He asked for it cooked medium rare but he said it came out blue rare. He was disappointed (he's a real big steak eater).

This comes to the slow service aspect of our dining experience...we had a 7 o clock reservation and we needed to be on the capital square at 9. The problem was, he wanted to send his steak back, but we didn't have the time to because of how long it took to get our meals in the first place. We didn't get out of the restaurant until over and hour and a half after our reservation time. Fuegos was busy but not packed, many empty tables next to ours. We saw 4-5 tables who were seated after us, get served before us without a word from the waitress. When she did come back and acknowledge us, she would not clear our dishes on our small table. We sat Infront of dirty dishes for almost the entire experience. Don't get me wrong our waitress was very pleasant, but we did not feel very cared for. The hostess was very aware of what was going on and started clearing out dishes and had the waitress give us a free dessert for the wait. The chocolate cake was also tasty, but we wouldn't have ordered it, if it wasn't free.

All in all, we really hope this is not a regular thing for fuegos. The location of the restaurant is prime. The ambiance of the place = A+. Their seafood and drink game ...on point! We will be back later...after a breather."}
{"text":"We love Fuegos. We have dined for dinner, happy hour, brunch and lunch. Great service, great food. Love the Vegan menu. The 3 course Vegan lunch is a wonderful dining experience. Our new favorite Madison restaurant."}
{"text":"AWESOME PLACE! Chef Oscar rocks!! Also, ask for Johanna! She'll make you a cucumber elderflower Martini to rock your world!!!"}
{"text":"Came to have the mother's day buffet brunch. Was glad to be able to reserve on-line with short notice. Unfortunately, the experience was \"meh.\" They seemed really short staffed. We wait nearly 20min to give the drink order. We were offered a \"Mother's Day mimosa\" that sounded complementary, but was charged at full price. Some the items were okay, but nothing special. Was disappointed that they felt the need to throw a bunch of standard American fare times (eggs, sausages, pancakes) on the buffet that had nothing to do with their theme. It took a long time to track down the server for the bill. Perhaps they just weren't ready for the brunch crowd, but I can't say I'm inclined to go back."}
{"text":"I've been here a few times.  I thought it was wonderful initially then the past couple times service has been slow and the food inconsistent.  Like another reviewer, we reserved for a large party -14- for my birthday and we sat for 20 min. We had to go to bar to get our own drinks.  The server was slammed with tables. The management was not prepared for the level of business on a Wednesday night. The salmon has always been amazing so I plan to go back in a few weeks to see if things are more consistent."}
{"text":"I ate here a couple days ago.  It was great because my sister's friend who was with us was vegan so there were options for her.  Also, they mentioned the sangria and mojitos were good (I don't drink so I wouldn't know). I did think it was more on the pricey side though. The service was good and we had no problems with that but I just think maybe the food was not for me. I couldn't speak for the others that I was with but none of us actually finished our plates of food and I really didn't want to take the leftovers home. I ordered the pork chop and while it looked great,  it tasted a bit too gamey (I don't really know if that's the right word) but I suppose I should have expected that seeing that they seemed like a farm to table place.  Also the purple potatoes were a little too interesting for me. Again, maybe it just wasn't my cup of tea but might be worth a try for others."}
{"text":"Fresh and fantastic!! I love the flavor combinations and the wonderful array of choices here.  The seafood was delicious, the steak was melt in your mouth tasty and the vegan choices were seasoned and cooked to perfection.  The casual, western chic decor and open floor concept give an interactive feel  for the diners.  Enjoyed a wonderful malbec and then finished with rich coffee and velvet smooth cheesecake with sweet berries.  I will be back soon!!!"}
{"text":"Okay, it was their Grand Opening Night, but they had done a slow \"roll-out\" for 2 weeks prior, so why did our meal take 70 minutes to arrive???? !!!!  And when it did there were 2 rookie mistakes made on my wife's entree.   The eggplant was so bitter (did we forget to to salt-out the bitterness??, Yes!) and the pineapple was so bitter (not ripe at all) that she or I could even eat the entree.  Again, this was after waiting 70 minutes for the entree to arrive and being told twice the our entrees will be ready any minute.  How can a chef allow bitter eggplant, when the process is so simple to remove the bitterness.  And pineapple in a mango chutney that was not ripe and bitter.  My chili relleno was suppose to have \"cashew cheese\", but there was so little of the 'cheese' it did not resemble a 'chili relleno' and the squash in the relleno was over cooked to the point of mush.  More cheese!!!!! please... The red sauce was lacking a robust flavor, too much heat without the balance of full flavor.  The waiter was nice enough to allow my wife to get a replacement entree, which took 15 minutes and was better, roasted cauliflower, but still not outstanding (maybe due to the 1-1/2 hours).  The appetizers 'fried plantain' was delicious so we were ready for great entrees, but with the lonnnnngggg wait then to be served disappointing entrees.  
It is great they have a vegan menu and offer very a good selection of vegan entrees, appetizers, and desserts.  
I think they should have extend the 'slow roll-out' they were not ready or the chef needs to go back to the basics of culinary school and 'taste what he/she serves' (e.g. the Gordon Ramsey rule!!!).
Oh, by the way, there was no apology for the long wait, the bitter first entree, and no compensation (e.g. free drink??) for the disappointing experience.  Another lesson in 'customer service'???  Comp the bad experience! 
We are rarely critical, but this meal and visit deserves criticism.  I hope they get their act together they have a great theme and great potential. 
I would give them about another month or so before 'counting' on a good to great experience."}
{"text":"Where are the crowds? I do not understand. So many positive reviews, great neighborhood excellent staff and fabulous food.

I went to Fuegos on a Wednesday evening. There were a smattering of guests inside and outside the restaurant. The staff was working hard, not just hanging out despite the low attendance. Beautiful plates flew by convincing me that I need to come back and see what's cookin'.

I ate at the bar with my friend who had been here a few times before. We decided to order from the vegan menu. The food was absolutely delicious and prepared with a lot of care and pride. 

We had two dishes, the Betabel, which was roasted beets, greens, walnuts, goat cheese and a raspberry vinagarette. Absolutely yummy. We also had a plate with roasted cauliflower and other veggies. It was a beautifully plated and very tasty and filling. The two dishes were distinct and equally yummy. I am capable of eating large portions but I was more than satisfied sharing both salads with my friend.

I look forward to try trying some of their seafood and meat dishes. 

Don't let this excellent restaurant disappear!"}
{"text":"I decided that the whole30 was a great idea back in October, without realizing that I would still need to go out to eat. Fuegos was the most respectful and accommodating restaurant! They made me whole30 friendly meals and I was like a kid in a candy store. I truly appreciate fuegos and everything they do for their guests and the food was delicious!!!!! You should go here now!"}
{"text":"What was up with your brunch service today, Fuegos? My part of three showed up at 11:50 this morning for brunch not realizing it would have been smart to make a reservation. The hostess said there were a lot of reservations at 12:15 and had no idea how long it would take to get us seated (not even an estimate?) It looked like there were a lot of empty tables (your three side rooms were empty plus some empty tables in the main dining room) so we gave her our name and number anyway. 

By 12:45 we asked if we were ever going to get seated (we had never received a text) and were seated right away. There were six empty tables in the part of the dining room where we were seated. What gives, Fuegos? 

We ordered drinks, soup and salad right away but didn't receive them until we asked for them again at 1:30; it took an hour to get another drink and a top off on water. The soups were good but the salad was totally underwhelming for how long I had to wait for it. Around 2:15 we received our food. My burger was good but the \"side\" of papas fritas was like two chips. The dessert included with the restaurant week menu was okay as well. We were out of there by 3pm - seriously, a three hour brunch including the time we spent waiting for a table. 

I don't know if you were short-staffed or under scheduled in the kitchen or FOH, but the service was just really bizarre, spotty, and we felt completely ignored. It was a total disappointment for a first try here, especially since I've been hearing such good things about you from vegan friends. It was just completely bizarre to spend so much time waiting when there were so many empty tables. And the wait-staff knew we were waiting for a long time but didn't seem to make up for it in checking on us or attentiveness. I shouldn't have to ask more than once for something I ordered. Or for a top off on water! Get your act together, Fuegos."}
{"text":"This is a nice and unique restaurant in the Madison area if you're looking for a nice evening in the willy street area. The drinks were pretty good and the tapas we ordered were really good as well. We didn't order anything from the dinner menu as we wanted to try a variety of different items from their tapas menu. Overall, a nice experience and we'll likely be back again to check out the dinner menu next time."}
{"text":"Perfect place for a birthday party for 12 guests.  Chef Oscar outdid himself with an array of tapas and the best carrot cake any of us ever had.  Their small private dining room was just the right size (if you have more friends, they have a bigger room!).  Wait staff was very welcoming  and attentive."}
{"text":"We went for a dinner for two on a Saturday and overall had a nice time despite a few mishaps. We made a reservation earlier in the day, the hostess made it sound like she was making an exception to squeeze us in, but the restaurant had plenty of open tables while we were there, so that didn't make sense. We enjoyed the food (La Borracha and Lengua con Nepalitos, and flan and carrot cake for dessert, would have them all again) and drinks (good margaritas). My chicken seemed a bit undercooked to me, but they quickly fixed it and offered a free dessert which was appreciated. Favorites: testones, tomatillo sauce, fire grilled tequila lime chicken, and carrot cake. I agree with many previous reviews about slow (but pleasant and helpful) service, and I'm usually not one to complain about that. I felt that the decor felt a bit unfinished, and noticed that one of the sink handles in the bathroom was broken. Nothing major, but there were a few things during the night that just felt a bit off. Still, we had a nice time and will likely be back."}
{"text":"My family went here with my grandmother who is in from out of town. It was our first time, and thoroughly enjoyed our dinner. We ended up getting three appetizers, and two entrees to split. Plus our server Max helped us choose three different desserts that were delicious."}
{"text":"Great dinner and atmosphere! Dillan was an excellent server and this was one of the best dinners we have had in Madison."}
{"text":"Don't come looking for a huge mug of a tasty margarita and a big bowl of chips. This place is sort of rustic posh. When you first enter the restaurant you are greeted by a charming hostess and are lead to your seat. There is a variety of different seating options available including banquette seating which is very nice. There is a wonderful smell of mesquite barbecue in the place.

The menu is interesting with lots of new entrées that I haven't seen yet in Madison. I tried the octopus for my entrée and I had a cactus salad on the side. I also tried out the pineapple margarita.

I absolutely love octopus and it is very difficult to find it at any restaurant in Madison. This particular dish was cooked as it should be, but it is topped with a sauce that is a little bit too salty for my taste. The cactus salad was really yummy. You could probably just order that on it's own for lunch. The pineapple margarita was unfortunately not anything special. We have some pretty stiff competition on the isthmus when it comes to making a decent margarita. These guys are going to have to ratchet it up a notch to compete with the likes of Tex Tubbs Taco Palace and the El Dorado.

My bill was a little over $30 for just my lunch, so I asked the server if they ever had any lunch specials. She said that they're still working on their menus, but the menu that I ordered from was the lunch menu. I don't usually spend more than $15 for my lunch at any of the wonderful restaurants on Madison's Eastside. 

I think with these guys need is a very specific lunch menu where you can get an entrée a side and a drink for $15 total. 

I will probably go back in a month or two once they have got their footing. It's definitely worth a second try."}
{"text":"Good food; strange habit of turning away business. We tried to get a table for 2 on a \"busy\" night, tables open everywhere. \"Sorry, full of reservations!\" We go elsewhere and on the walk back look in; STILL EMPTY. Tables everywhere. What gives? Did you look at my partner's tattoos and figure we weren't good enough for your establishment or something?

2 stars instead of 1 because they truly care about vegan diets."}
{"text":"Understandably, things get hectic during Restaurant Week, and here seemed to be no exception. 

I made a reservation ahead of time for a party of two for Restaurant Week. We were seated right away and the host kindly asked our diet preferences on whether vegan or vegetarian options were needed for the menus (a plus for those in need). 

Our server didn't appear until about 15-20 minutes after to greet us, but luckily we used the time to get our order for the first two courses ready. After this, we didn't see him until he brought out our bottle of wine we ordered (without ice to chill, at first). The appetizers were fantastic - the Queso de Chiva came out with a sweet/spicy chile sauce with warm bread and the Calimar Frito had an evenly crispy exterior.

Our entrees arrived after we'd been seated for at least an hour. I'd gotten a salmon dish with Mexican street corn, a perfect combo of buttery and savory and would totally recommend. My SO ordered a medium steak that included some tasty jalapeño mashed potatoes.  Sadly, it was brought without a steak knife and it took my getting up and finding our server to get one brought out. Once he cut into the steak, we saw it was a  very deep red and bled quite a bit. During the experience, our server didn't stop to check how we liked the food, fill waters, or ask if anything was needed, which we would've liked for follow up on the steak. We ended up sharing my entree and boxing the steak to cook it more at home. Even after taking it out of the box, we saw it still bled in the container. 

Our server didn't ask if we wanted to finish the three courses and proceeded to just bring the check and have items charged separate. It's a tapas place, so we were prepared for the smaller portion sizes, but we ended up going to another restaurant to get food since sharing a tapas-sized entree and apps wasn't filling for two people. 

I'm not sure if they were a bit understaffed for the evening, if our server was over-assigned, or what the situation was (it didn't seem so busy we couldn't be checked on), but I can surely recommend Fuego's food. For the service, I hope Fuego's takes this feedback into consideration."}
{"text":"Max was great with us, when we went in last Friday night! The food was awesome and big portions! Great atmosphere.....we'll be back!"}
{"text":"Fantastic food.  Service was a little confused yet solid.  We had 5 different plates and they were all outstanding.  Great deal of pride taken by the owner.  Wonderful fit in the area.  Not cheap but not too spendy either."}
{"text":"WOW. Just, WOW. 

First time here this evening and husband and I were incredulous that we'd waited so long. Everything we had was excellent. Granted, we only had a couple of tapas - the crab cakes and beef nachos - but they were so, so good (and filling), we can't wait to return for a full meal! 

We sat at the bar and had several of the margaritas - original,pineapple, and strawberry, expertly made by bartender Max, who also shared his favorite dishes (he swayed us to the crab cakes, fortunately). The staff all seemed quite attentive, and we loved the open kitchen, the space, and the music. I was really surprised that it wasn't busier, but perhaps it was early (we were there for happy hour, around 5pm). BTW, great happy hour specials - $4 margaritas, half-price apps. I really hope this charming and unique place makes it...it's such a breath of fresh air on Willy St, and the flavors are incredible. 

I admit that I was puzzled by the \"steakhouse/vegan\" combo but I swear, it works. The vegan paella is on my #1 next dining out must-do list, and I love my meat! They could do a bit better on happy food specials, such as chips and salsa for cheap (not currently offered). While Willy St has evolved into more sophisticated tastes, the price point needs to be consistent with the other neighborhood places (ie perhaps a bit high for the neighborhood). 

Overall, I loved this place and I have no qualms paying the price for excellent food...hoping my fellow Eastsiders follow rank and that Fuegos becomes a Willy Street restaurant \"institution\"."}
{"text":"Great option for a visiting and varied group that included vegetarians, tapas lovers, and spanish food novices. The service was great and they didn't blink an eye when we asked for a few of the entrees to be delayed for sundown to honor a couple of fasting members of our group. They easily accommodated the entire group and the food was amazing. The guac was actually two types, and pleased everyone. The entrees were beautiful, tasty and well prepared."}
{"text":"Food was delicious and we tried a number of items.  lamb chops cooked to perfection and large portion.  Drinks were also great.  Service was very slow and that is only reason for not giving 5 star rating."}
{"text":"Fuegos incorporates very good food, well presented, with an extensive menu selection and an inviting atmosphere."}
{"text":"Such a great place to eat with vegan and vegetarian friends. Almost everything we had was SO flavorful. At our table, we had steak, plantains, yucca, chips/salsa/guac, vegan pozole, chicken, salmon, and more. The yucca was dry, and chips were ok, but everything was FANTASTIC. Super server, too. And very unique drinks. We will come back when we return to town!"}
{"text":"Excellent vegan selection along with meat-lovers menu. We had the Torre de Aaron Ceviche (tuna ceviche), Vegan Empanadas, and the Plata de Huevo (wonderful eggplant dish with fruit salsa, black beans and coconut rice). All were fantastic!

Drinks were fab, too. We had all tequila based drinks, margaritas and Grapefruit Milo. As a tequila snob, I worry about the default tequila served at most restaurants. For my first margarita, I requested a specific tequila for a $2 up charge, but when I tasted my friend's who ordered it as is, I realized I hadn't need to worry. 

Daily specials abound. This will become a regular dining spot!"}
{"text":"We came here for their Mothers Day buffet so we didn't get a chance to try ordering from the normal menu. To be totally honest, the setup was a little disappointing. They were a little slow to fill up some of the dishes. Some of the dishes (I think one of the examples of this was a fish) only were refilled when we were about to leave. The food itself was okay. Plantain omlettes, lamb, and an excellent guacamole were among the ones we enjoyed.

Service was okay but because things were so crowded it took a while to get drink refills and extra silverware."}
{"text":"I was super excited to try this place out and was very disappointed. I have worked in the service industry for years so I think I am pretty forgiving of any hiccups that can occur. This was another story. I went for brunch at 1 pm on a Sunday and with only 5 tables seated and an empty restaurant I was asked to wait at the bar for a table for 20 minutes. I figured they just needed the kitchen to catch up on orders or something so I obliged. Once finally seated at a table it was another 20 minutes until our server who had a 4 table section even acknowledged us and came over to greet. As soon as she came my boyfriend and I wanted to order and to our surprise their lengthy menu was completely sparse due to a \"busy and late Saturday night.\" Literally all of the tapas were sold out and most steaks and burgers. They only had eggs and pancakes to offer at a Latin American restaurant.....Busy nights happen and I get that you can't always anticipate a hustling Saturday service but if you are going to be open for brunch you may want to have enough food to offer your customers or at least explain this limited menu to your patrons before they waste 45 minutes in a restaurant and leave empty. Needless to say we left as did another table next to us. This place needs some work to get the front of house on top of their game. The food looked and seemed like it would be delicious but I don't think I will be back until the front of house learns how to do their job."}
{"text":"Alright friends. Let's start at the beginning.

Got here slightly after 7pm on a Wednesday. There was going to be a 30 minute wait. No problem - we weren't in a rush. We waited* (scroll to the end for a \"fun\" story) at the bar. After about 30 minutes, we got seated. We got our initial glasses of water, and then browsed through the menu, as one does. At around the 20 minute mark, we realize that we haven't had a server check in on us. This seems like a long time, but ok. At the 30 minute mark, we're thinking this is a bit strange. And we are really hungry at this point, as this is an hour later than our \"planned dinner time\" and ice-water can only take you so far. So we let one of the staff members know about our situation. At around 45 minutes, our server comes over and asks us if we're ready to order (and offers no apologies). We tell her our order. After another 10 minutes, we get some bread... we're thinking, \"gee, this would've been nice when we initially got seated.\" And then soon after, our food arrives.

We got the Pastelito to share - which was a sort of rice dish with coconut flavor, served with a mango/pineapple salsa. The salsa was pretty good, but the rice seemed a bit lacking in flavor. Not terrible, but I would order something else. For my entree, I had the Filete de Coliflor from the vegan menu, which was a big thing of cauliflower cleverly crafted to look like steak. I actually quite appreciated the look and thought it tasted pretty good as well. And they gave you a steak knife, which turned out to be useful to cut off the little pieces of cauliflower from the \"rib\". 

Oh, and when the server finally brought over our check, that's when we got the apology for slow service.

Overall - I rate them VERY poorly on service, and not too bad on the food. I'm going to give them another chance because they might just have been having a bad night.

But hold on, I haven't even mentioned the worst part yet. Here we go:
*I realize that most Yelpers only want to read about the food/ambiance/service, so I decided to footnote my story. But it's relevant. While waiting at the bar, I kept feeling my leggings getting pulled on the chair; I feel them to see what's going on - they're no longer smooth (they were a VERY smooth pair of leggings). I get a little sad. Then I feel the same thing happening again on the other leg. I feel that one - now I'm really sad. Both legs of my leggings are snagged?! I feel under the chair to see what's going on - the stitching is bloody prickly! What kind of monster... who does that?!! What's going to happen in the summer, and people's bare legs get scratched from that monster chair?! And when I get to finally properly examine what happened to my precious leggings when I get home - y'all I am pissed. I had only bought these leggings 3 days prior. And they are (faux) fur-lined. They are very warm and WERE very smooth. And now they will never be the same. Will I continue wearing them? Of course. But will I curse Fuegos every time I do? You bet your ass I will."}
{"text":"My husband and I were visiting for the Crossfit Games, and looking to try something local. We found this gem and got a table right away. The male host had a long ponytail (I didn't get his name!) and was very helpful! We ordered a Pinot Grigio and a Spotted Cow and really enjoyed the crab cake appetizer. It was sizeable and served with crispy onions. We also were given bread and olive oil for dipping. Big fans of seafood, I ordered the salmon (which was a tiny bit undercooked... just how I like it!) and my husband ordered Pozole and really enjoyed it. Large portions, great flavors, excellent presentation, and an extremely friendly staff made for a fantastic date night. Our waitress Tameka was smiley, courteous, helpful and really made our night! She was excellent. They also have a vegan menu if that's what you're looking for. I highly recommend!"}
{"text":"Great food, including a large vegan selection. One of my new favorite restaurants in Madison. I've been here for lunch, dinner, happy hour, and brunch -- trying different things each time -- and it's all been fantastic."}
{"text":"Amazing place. Celebrating with Bill! Special anniversary. So many choices for both of us. I'm vegetarian and my husband is not and we know Oscar. Many years ago now. It has been a long time and I love the menu! Please consider doing desserts by Bloom bake shop Middleton and Madison. Excellent! We will be back as soon as we can."}
{"text":"Excellent service, outstanding food and a fun atmosphere.  We'll definitely be back!  We set reservations ahead of time and we were seated right away.  
We were feeling adventurous and gave the octopus tapa a try.  I was surprised at the generous portion size of the serving.  I really enjoyed the flavor of the octopus and it was very tender.  
I ordered the salmon which was the highlight of the dinner and my boyfriend ordered the paella.  I will be craving the flavors from this dinner for awhile.  Portion sizes were excellent and the atmosphere was great.  For a brand new restaurant, everything ran very smoothly.  
We can't wait to come back and try some new menu items!"}
{"text":"The only reason fuegos gets any stars at all from me is because their food is rather delicious. Aside from that, some of the worst customer experience I've ever received. And as someone who has waitressed and hosted at many restaurants in my life, it's rare for me to complain. My family and I made reservations at fuegos and upon making those reservations, we asked if they would have their full menu in addition to the restaurant week menu, to which they told us yes. However, upon sitting at the table, all that was offered was the restaurant week menu. We asked to speak to a manager and she said, \"sorry. We changed our mind and decided not to serve the full menu.\" But was highly unapologetic. I could've forgiven the miscommunication, however the service was bad on top of that. Never filled our waters, took 40 minutes to serve our food after ordering and neglected to ask how things were tasting and if anyone needed another drink. We got a free round of drinks, but only after pointing out that we felt we were owed. Extremely disappointing. We will not be back."}
{"text":"This was our first time dining at Fuegos and it will not be our last. We went early in the evening on a whim. We knew nothing of the place other than they had recently opened. My wife was wearing business casual, I was in a T-Shirt and jeans and the kids were still in their (elementary) school clothes. I felt underdressed but no-one seemed notice. We managed to hit happy hour just right, which means there was a discount on my mojito and my wife's margarita. The (shaken) margarita had good flavor and my mojito was close to what I like (I'm spoiled after just spending the week in Florida). The guacamole and chips appetizer was fantastic. It had good flavor, the right texture, and just made my mouth happy. My youngest orders the Mac n cheese while I had a medium rare filet. The girls in our group took the simple route of salads; they were good but they were, you know, salads...
The mac n cheese was excellent. It had the right amount of cheesiness and the flavor was better than I expected any mac n cheese to be... My filet was done right; it did not require and additional condiments. 
We all had different deserts; I can only speak to the white chocolate cake because no one wanted to share even the smallest amount of their individual desserts. They were all just too good.
Ok, so by this point you are probably wondering why is it only four stars instead of five? One word, timing. You could tell it is a newer place because the timing was just a bit off. It took too long to get out food. The food came out hot so it wasn't sitting in the window waiting. If they had been more prompt, then I would've given the place 5 stars. When I go back, i am hoping they will have it all worked out so that I can give them a five star review."}
{"text":"We had really poor service during our trip - we had to ask the hostess for a waiter after not getting served. If they had offered us a free drink or chips to make this up to us that would have been a good gesture and they didn't so they have not won our return service. We had to ask for a candle when they were being placed on other tables. Drinks were slow despite coming at a slow time. A giant platter of food was served with three tortillas and we were charged when we ordered more. The tostones were not flattened which is literally what tostones means. The guy who bused our table and brought us water was incredibly nice and the highlight of our trip. Will not be coming back."}
{"text":"Gotta love a restaurant that's able to accommodate meat-eaterians and vegans at the same time. I tried the vegan paella and I must admit it was absolutely fantastic. My friends and I enjoyed a great glass of wine and many of the well made dishes. The service was also on point and the waiter was able to make great recommendations. As a new restaurant, they really hit the spot and I will definitely want to go back there again."}
{"text":"This is out new Go-To restaurant for a big meal with another couple.

Been here three times in three months, and it blows my mind.  Always come with four or more, and share meals. The sea bass, sliders, tacos and specials all rocked. We ate inside each night, and were luckily able to sit within ten minutes. Some of the best wait service I've experiences in Madison, very comfortable and knowledgeable about the ingredients and the meal.

Someday this place will be packed, but for now, I like that it's very accessible."}
{"text":"WOW!  Fuegos exceeded my expectations!  The service was excellent and the vegan menu had more to choose from than I knew what to do with.  The albondigas de verduras were excellent, incredibly savory.  I wish they had an entree of just the vegan albondigas!  The queso de nuez was good too.  There were a few pieces of appetizer bread and bread in the entree so I would probably get a different tapas without bread next time.  The filete de quinua was a flavorful cutlet over a piece of bread (the bread is excellent, crusty but soft in the middle).  The elote (sort of a creamy corn) was amazing.  Who knew corn could taste so good.  The flavors of all the food are difficult to describe but there was not one bland item.  Even the side of potatoes were infused with cumin.  My only suggestion is to make the lemon tart with more lemon, less crust.  The berries and whipped cream were a perfect addition though.  Oh, and get the red sangria, it does not disappoint!  I'm very excited to have someplace with a plentiful selection of higher end vegan/vegetarian food in town.  It's about time!!!  Will definitely be back!"}
{"text":"I have been so excited for this restaurant.  They've done a great job marketing and building up great interest.   We normally do not go to restaurants during their opening week, month, etc but I really wanted to try Fuegos out.  We love tapas and looked forward to having an option closer to the east side.   

We ate there Friday night and I was super happy with the availability to make reservations online, as well as easily change the time on my reservation.  

Aesthetically the pace has a nice decor.  We were frustrated with the acoustics in the restaurant as the floor is concrete and there is a wide open feel.   We sat at a two seater table and it was rather hard to hear each other as well as our waitress.  

Our waitress was very nice, but it took way to long to get our drinks (we only ended up having 1 each because we didn't want to wait for another) and the 4 small plate orders.   Our water was never refilled and I ended up having to drink my husband's water. 

We had the Tigres, Nopalitos (non-vegan), Pastelito and Torre.  The presentation was excellent, unfortunately the actual food did not live up to our expectations.  

The Tigres (mussels, crab in what I am assuming was a butter sauce) was way too salty and this is coming from someone who puts salt on everything.  Our other choices were just very underwhelming and little to no flavor.   I had mentioned on our reservation that we were celebrating our wedding anniversary and they graciously provided us free dessert.   We had the chocolate cake, which again, was rather underwhelming.   

I would be interested in seeing how an entree tastes, however, with so many options in Madison I don't know that we will be back.   

My rating is based on the fact they are brand new and I wanted to love it, but in the end I was so disappointed."}
{"text":"So it's hard to describe a Vegan Strakhouse. Like pick a side, folks?!?!

But I must say I was quite impressed. As someone with dairy allergies who also eats meat, they were able to provide some interesting tapas and a phenomenal steak. 

And I can't say enough about the blue mash that comes as a side with the steaks. Amazing. 

A little pricey, but isn't that true if just about every tapas place. 

Highly recommended. A great place for dates between a vegan and a carnivore."}
{"text":"I've been to Fuegos 6 times now....  my wife and I thought the world of this place at first. But now?  It's a sinking ship. Higher prices, lesser quality food.  It seems all the great employees we became to love have disappeared.  We have overheard the owner and chef talk down to his employees, talk down to his own daughter.  This is not a place where we want to ever go again. And we will be telling our friends the same.  So much disrepct from the owner. Over priced menu. Food qualities lowered.  Run away from this place. Please"}
{"text":"Service is that of a Michelin star. Food is excellent and reasonably priced, and the atmosphere is wonderful. The vegan menu is probably the best plant based food in the state. It's my new favorite restaurant in Madison."}
{"text":"We came here for restaurant week and while the food was actually quite good the service was SO terrible that it ruined the entire experience.  

We had 6:30 reservations for 4, and while they were busy there were plenty of empty tables so I would not expect the complete lack of service we received.

We were there for 2 hours (waay too long) and during that time our waters were not refilled a single time. All 4 of us ordered the steak medium rare but when our waitress arrived with the entrées she asked who had the medium steak.  When we advised we all ordered medium rare she basically argued with us before saying they were all medium rare. (they were not)

Most of our 2 hours were spent waiting for food to arrive and wondering why we were not being checked on.

The dessert was a highlight from the menu and the steak quite tasty as well, but with the service I don't know that we'll be back."}
{"text":"My fiancé and I really enjoyed this place. They have a great, full vegan menu in addition to the normal menu and a variety of wines, drinks, and desserts. My chicken was well-cooked yet juicy and tender; flavorful and matched the wonderful fried banana.

My fiancé got the grilled cauliflower, which she said was amazing, though her roasted vegetables/peppers were a little too spicy for her taste. I tried them and they were toasty and warming, slightly above jalapeño on the hotness scale.

We both agreed, this is a place we'd return to for sure!"}
{"text":"Amazing!!! They have a whole separate vegan menu and everything we got was delicious! I would definitely go back!"}
{"text":"Came back here after attending a Yelp Elite Event. We won a free drink ticket and a free entree ticket. My wife ordered the Lobster dish and I got a glass of the Cabernet, which was really good. On Tuesday, they have half-price appetizers, so we ordered three of those. Yelp check-in gives you a free glass of sangria, which was a very generous pour. They have red and white sangria. The food was incredible and well-presented. Our servers Boyd and Cassandra were great. The place is a little expensive, but it is reasonable considering the atmosphere and the quality of the food. It has a very romantic atmosphere and I would highly recommend coming out here for a date night. Parking wasn't bad, which is nice when you're in the city of Madison. We parked within a block (on a week night)."}
{"text":"I went for Restaurant Week lunch (1/24/18) and it was so disappointing. We arrived on time for our noon reservation and were promptly seated. It took 25 minutes for us to order. Whenever the server would stop by if we asked a question or paused he just walked off so we could \"decide\" and wouldn't come back for at least 10 minutes. We were ready right after but had question, most people allow for a modicum of think time instead of just walking away. 

We both had the chips and salsa as our first course. It took 57 minutes to get out to us. This was after waiting 25 minutes to get an order in. It's chips. Granted they were busy but everyone had reservations so they should have been prepared. It wasn't even that busy when we were seated but got busier around 1.  The chips and salsa were good but not worth the wait. Honestly, nothing really special. The verde was good and my friend liked the roja and we both felt the guac was okay to good. 

The tacos were disappointing. We had to order all the same, no mix-matching which  is fine. I asked for one taco without cilantro and my friend asked for no cilantro (so we could trade one to try different kinds) but the couldn't do any accommodations and ended up bringing out hers covered in cilantro as well. It was literally some meat and pre-made pico with queso sprinkled on top. The corn tortillas were so dry they basically crumbled in my hand. 2 of mine were already split down the middle when they were brought out. I had the bisteak and it varied between overly fatty chewy chunks and charred burnt pieces. There was basically no seasoning or flavor to it. My friend had the Tequila Lime chicken and it tasted like bland, over-charred chicken as well. The tacos were small and unimpressive. Honestly, the tacos at Qdoba/Panchero/literally any other fast casual Tex-Mex place are better. 

The desert was really good though. The vegan options may be better and I can see how this would be a good place for groups with mixed dietary needs but after this experience I just can't justify a second visit."}
{"text":"We dined at Fuegos last weekend and were extremely underwhelmed.  We didn't have a reservation but were sat right away on a Saturday night.  It took our waiter about 10 minutes to come to our table.  Once he did come he asked if we would like a drink, I ordered a grapefruit and tequila drink and my friend order a margarita. We both asked what tequila was used in the cocktails and the waiters answer was \"just rail tequila\".  So, we both ordered Don Julio for our drinks.  Well, when we got the bill - those drinks both cost $16!  Which was a total joke considering it took 20 minutes for them to come after ordering them and once we did get them, they were so watered down, they had no taste at all - this was my first disappointment of the evening.  Once we were ready to order the waiter asked what we would like.  He didn't ask if it was our first time - since its a new restaurant - and didn't explain the difference between the two very large menus placed in front of each of us.  I asked if he could explain what was different on them and he just said, one if vegan and one isn't. Yea, I got that - I can read.  But some of the same dishes were on each menu and some weren't - very confusing - but we proceeded to order the tuna ceviche dish, scallops on corn chips, and shrimp ajo.  While we waited for our food, the waiter came over and set down a basket of bread and olive oil/butter concoction but didn't say anything until we looked up at him and he goes, \"oh this is just some bread\" - nice dude.

 - Tuna Ceviche came out first with about 6 chunks of tuna and an overwhelming amount of guacamole and mango.  It really had no taste at all other than avocado
 - It then took 20 minutes for our next tapa of scallops and corn chips to come out.  Supposedly some other waiter took ours from the kitchen for another table so they had to make another one.  Manager ended up taking that off our bill  - which was nice.  It was actually the best dish of the night even though it was 5 small scallops sitting on a large scoop of guac on a blue corn chip
 - Last dish of the night was the shrimp ajo which was just over buttered and oiled shrimp in a dish with soggy bread on the bottom - oh and it came with some cold rice and beans on the side.

Needless to say this was an extremely disappointing experience for us.  We were really excited to try a new tapas restaurant as Icon has gone down hill over the years.  Unfortunately, this was not any better.  Skip this new restaurant and head to one of your go to favorites."}
{"text":"I was in town visiting my sister and she gave me free reigns to decide on dinner and, after browsing Yelp for some good eats, I chose Fuegos. I was very intrigued by their vegan menu and the thought of Mexican food sound good. I was able to book a reservation through Yelp (though didn't really need to as it wasn't that busy). 

I like the set up at Fuegos. Their dining area is open with some seating near the window or large and nice booth options. I didn't check out the bar but apparently they had happy hour specials going on that are only available at the bar. Luckily, they were offering a BOGO 1/2 price tapas specials for dinner. We certainly wanted to take them up on that offer!

Between my sister, her boyfriend and I we all ordered six different tapas plates and one main entree. We started with their guacamole and salsa with chips and their queso dip. The queso dip is unique as it is actually baked goat cheese with a chile sauce on top served with toasted baguette slices. Although it isn't the typical queso dip you'd think of at a Mexican restaurant, it was pretty good! I really liked the flavor of the goat cheese with the chile sauce. The guacamole and salsa with chips were pretty standard. Next, we ordered the crab cake and fried plantains dish. I didn't try the crab cake but was told it was good. I'm not usually a fan of fried plantains but they were delicious at Fuegos! The sauce paired well with it and they were nicely cooked. Next, I ordered off the vegan menu to try something new. I ordered the vegan empanadas and the potato salad on romaine \"spoons\" dish (Cucharas). I wasn't a huge fan of the empanadas because they were really dry. The cucharas dish was delicious! It was an interested concept to have a potato salad with quinoa on romaine lettuce but I actually really enjoyed it. I would have liked it to have fresh jalapeños for a kick but adding some hot sauce also did the trick. My sister also ordered the La Borracha, which she really loved. 

Overall, the food was great! Fuegos definitely has enough of a variety to please everyone--even vegans! I wish the customer service was a bit better though. Unfortunately, when we asked our server about things she couldn't answer or explain things so it turned into her having to check in with her manager several times. At one point he had to come out to our table to further explain something. I'm chalking it up to her being new, but I appreciated that she always had a smile on her face and readily tried to meet our needs when she did come by our table. Maybe they still have some growing pains? I'm not sure, but this place is definitely a must try if you're in the area and wanting to try something different!"}
{"text":"I was real excited for this place. The drinks and ambiance were great, but the food not so much. Most of the food came out had mistakes. Server blamed the \"swamped\" kitchen, but the restaurant was half full. Also, the bathroom were super, uncomfortably short."}
{"text":"Three of us were quite satisfied with breakfast last weekend. Interesting choices (maybe too many), competent server, all good. Portions seemed a little too generous--but if you are really hungry, this is the place to come. Love that you can find migas in Madison."}
{"text":"Well, The first visit with them with my two friends was kinda not that great. The apps were amazing, but my lobster dish was less than good. But, being so impressed with the apps and the promise that the Salmon dish was exceptional I tried it again. Well, we are going back tonight.  It was amazing, the service was also really good and we both so enjoyed our meals.  I had the salmon and he had the dish with the mixed seafood and it was amazing.  I am so glad I went with my gut and went back that second time. Now again tonight for his birthday. Well, yes thank you!
Try the calamari, it is to die for, and the street corn is simple and so tasty."}
{"text":"Do yourself a favor and GO HERE!!!!! It's very obvious they craft each dish. 
Amazing food, great atmosphere, and good advice."}
{"text":"Loved every single meal there. This restaurant is amazing! It's impressive how they put so many fresh vegetables together turns out to a stunning meal. And the seafood is pretty fresh and the way they cook it makes so good. If you all about vegetables, all about seafood, all about good food, this place won't let you down. Big plus- every Tuesday topping are half price!"}
{"text":"Really great option for vegans and meat eaters alike. Our group really enjoyed the nut cheese queso (great spice in the sauce). The chile relleno with duck was very good...lightly battered and a good balance between slightly sweet and spicy. The tuna ceviche was good...we liked the combination of mango with avocado. The vegan paella was good, but maybe not as substantial as some would expect as it's \"deconstructed\". Overall great service and presentation."}
{"text":"We were looking forward to going to this restaurant and trying this place, as we have heard good things about the food from friends. So disappointed with this place. I was excited to find a good tapas place as I used to live in Spain and have been craving some good tapas! 

We made reservations for Valentine's Day and they had a pre-set menu, which is fine, but did not have any information about how it was to be executed on their website, nor informed us at the time we made the reservation. I work in the service industry, and if you are to have a pre-set menu, it is standard to call all those who made reservations to confirm they are aware of the pre-set menu, which did not happen. 

I called to confirm that we were going to have our own table, as they were to have trivia, which we did not want to be a part of, especially if we are to be sharing a table. When I called, the woman who answered the phone didn't have any specific answer to what the menu entailed, or what was to happen for that evening. She ensured me that we would have our own table for our reservation and told me she even made a note. 

When we got there, they sat us at a long table that was crunched into a small room. We went to the host to ask if we could not participate in the event and have a table out in the restaurant as I had asked for on the phone. The woman did not apologize, but told us she could get us a table in 45-50 minutes and to wait at the bar. Was completely rude...terrible customer service and management. 

We ended up leaving and not taking the reservation as there was no point in waiting 45 minutes for our 7:00 pm reservation. I was excited to try their food, but won't come back even at a later time due to the poor management and customer service. I hope they can get it together and will consider trying it 6 months from now, if they are still around..."}
{"text":"This place is so amazing! Eclectic decor, open concept kitchen, outdoor dining garden, spectacular service, and options for everyone! With the unique mashup between a vegan dining menu and steakhouse, there is a multitude of amazing options. Highly recommend the vegetable paella, the plantains, and the cauliflower soup! Can't wait come come back and try more things here!"}
{"text":"From the outside Fuegos looks like any other restaurant in Madison. Once you enter, you enter a world of flavor. Every dish we ordered was an experience within itself. The deconstructed paella was a cornucopia of savory seafood. The Tuna ceviche was a cool break from the light Latin heat of the other dishes. The server, Max, was attentive and directive through the expansive menus. Whether carnivore, omnivore or herbivore. I highly recommend this gem of Madison."}
{"text":"Second time here and unfortunately it didn't get any better. The level of service is definitely lacking. If you're thinking of getting any drinks you might as well order two due to how slow their service is. 

The second time the waiter seemed kind of rude not bothering to double check to see if we needed anything else. The restaurant wasn't busy and it shouldn't have taken as long as it did. 

Food is good if you're willing to wait that long..."}
{"text":"Fuegos offers an ambience and entertainment unmatched by any other restaurant in the Madison area. If you and your date haven't shared a good laugh in a while, do not go to the comedy club, come eat here. Upon arriving, we were tricked by the professional decor. Although we both eat meat, we also took a look at the promising vegan menu. Our experience went something like this -

We will first discuss our drinks.
Unsure by the cheap desktop printed drink menu. We started off with a Tequila Old Fashioned form the \"Specialty Cocktails\" section. It was brought rather quickly, which we now understand why. Our first impression was that it was a pre-made drink. It was watered down and fizzy, like something you get out of a keg. This drink comes with a rather large straw. Nothing in this drink was muddled, it didn't have the sweetness we were looking for, nor did it have any alcohol content. We exchanged it for a drink one would assume cannot be messed up; the classic margarita. Again, this one had bubbles and tasted like a margarita flavored sparkling water. It was also accompanied by a big straw. We were starting to loose hope. It was here that Barbi took a leap of faith and ordered the white sangria. This also tasted like a soda. We truly believe all of their drinks are diluted in half with Canada dry.

The food menu resembles a rushed school project. All of the meat options were accompanied by the same Peruvian potatoes, as if thought of last minute (see picture). However, we were excited by seeing tostones on the menu. Sadly, our first two choices were no longer available. They ran out of sirloin steaks and the blue potatoes that accompany all the meats. We ordered the Pollo Loco (includes tostones) and a Baked Goat Cheese appetizer. The rice and beans were cold, weird for a place called Fuegos. The \"tostones\" were actually undercooked sweet plantains, not the flattened, fried and salted tostones popular in tropical and subtropical Latin America. The chicken was your average $6 deal rotisserie chicken from the supermarket.

We came home excited to write this review, but ain't nobody got time for that. We had a good laugh and by now you get the picture. Unless you are a small town gringo looking for a \"cultural\" experience, this fine location is a disaster.

Papi and Barbi"}
{"text":"Sigh. So good. Wow! We had the Toro and Margarita for drinks (fresh squeezed lime, anyone?), alligator chorizo, steak and crab cake special, and the salmon. I was tempted by the chicken but Tameka steered me to something more my style (thank you!!). Our service was fantastic and Tameka was very attentive. The food was incredible and we savored every bite! We shall be coming back."}
{"text":"What a great find! This place does not only have a cool ambiance and friendly staff but their food is phenomenal!
Such a great mix of flavors, ingredients and uniqueness. As a San Diegan, I didn't know what to expect but this place blew my taste buds away. Their vegan menu is a nice change of pace and allows vegans and meat eaters alike to enjoy some delicious Latin American food. Go check this place out!"}
{"text":"Great atmosphere, cocktails, dinner, and desert. Went the meat route. Shared a cheese and sausage platter. Then, Paella and coconut cake. Everything was presented beautifully and flavor in every bite."}
{"text":"First visit to Fuegos for lunch. Interesting decor, excellent service by Martin, terrific food. I had the Cubano and the ham and pork were moist and tender. The mustard was tangy and just spicy enough. The homemade fries were crisp. My husband had the Postito salad, cactus, and the soup of the day which was vegan. All was excellent as well. My gratitude for the lovely bread!  We'll be back!"}
{"text":"Ordered off the vegan menu and were big fans of everything we got -- cauliflower steak is to for for and the ropa vieja was really flavorful and satisfying. The plantains are really where it's at.

I also got the banana cake, and while delicious was very dry.

It's also VERY loud. We had trouble talking over the noise."}
{"text":"Decent but overpriced food, sterile ambience.

Recommend the scallops w/ guac and corn chips. The fried plantains with mango sauce were good too.

Shrimp cocktail and crab cake were average, lamb meatballs were a bit dry and tasteless."}
{"text":"Another outstanding experience!
Three of us did a sampler meal, sharing 5 tapas, a salad and cheese/meat platter - all were delicious. I highly recommend both the octopus and squid with amazing sauces!
Our server, Brad, offered impeccable service, dealing well with a spilled glass of the delicious white sangria.
My 3rd visit, better every time!"}
{"text":"We went here for our first time with another couple for dinner on a Tuesday evening. They had been to Fuegos for lunch before. The atmosphere is very cool in this cool neighborhood. We needed some help from the waiter when looking at the menu since this is not \"typical\" Mexican. When we asked for some explanation of menu items, the waiter acted like we were stupid. He was generally abrupt and hurried throughout the meal. Not the treatment I'd expect for an \"upscale\" place! Good food, poor service, and pricy!"}
{"text":"I love this new restaurant! We went to celebrate Mother's Day. Service was great- the menu has something for every taste! We shared crab cakes, cheese and meat plate, scallops, and the biggest Jalapeños wrapped in bacon and stuffed with goat cheese. The Frito calamari strips were huge!  Entrees ranged from duck to steak to seafood - all delicious! Finished the meal with three different desserts! We'll be back!"}
{"text":"Had a delicious meal with dear friend. We started with happy hour half price margaritas and ordered the fried plantains w mango / garlic.  They were delicious.  I had the lamb shanks.  4 served with chimichurra sauce.  I enjoyed the lamb.  The potatoes were just ok- I didn't eat much as they weren't very tasty or warm. 
My friend had the filet of beef- very tender and tasty. 
Dessert was a chocolate parfait.  We enjoyed sharing that with a fresh cup of decaf coffee. Our waiter was from Peru and did a great job explains the menu.  
For a restaurant just open for a month I give them high marks!  I've already been sharing our great experience with friends."}
{"text":"Congrats to Fuegos on their opening! I got to attend the second night of their \"soft\" opening, which was really exciting for me. I've never gotten a sneak peak like this before.

I love the concept behind this restaurant. They source local and ethically raised meats and offer just as many vegetarian/ vegan options as carnivore options. As a flexitarian (cue eye roll), I was so jazzed to see this place go up.

The ambiance and decor is upscale and with some rustic elements, and with the huge wall of windows it feels very open and airy.

Since I went during their \"training\" session, I could tell there was a nervous excited atmosphere. So everyone was on their A game.

Very friendly staff, lots of checking in and requests for feedback, which I appreciated.
And the food was interesting and very colorful.

What I tried:
Nopalitos- spring mix with cactus, tomato, and a lime vinaigrette: this was very fresh and nice. It had loads of toppings, and I love me some salad with lots o' toppins. Very good starter. It's interesting and the acidity makes it very bright and prepares you for your next course.

Cincos de championes- blue corn chips with guacamole and roasted mushrooms: this one is basically chips and guac but plated like an hors d'oeuvre. I liked it, but it didn't wow me.

Champinones Portabello- portabello mushrooms, roasted peppers (bell and poblano) and sweet potato: I really loved this one. Everything was so flavorful and it felt very hearty. The portobellos were very meaty and savory and it was fun to mix all the components together to make the perfect bite.

All in all, I think they did a great job! I can't wait to come back for the full menu!"}
{"text":"The hospitality was great! Awesome service and amazing food. The food came out really quick and was cooked perfectly. I love Fuegos and the entire staff is always so friendly and helpful. Dylan was our server and did and amazing job!"}
{"text":"So good! Calmar Frito and the crab cakes were amazing! Finally there is authentic Tapas in Madison! Tameka was so nice and knowledgeable. Would recommend."}
{"text":"Highlights/Lowlights

1) big menu! 
2) outdoor seating
3) friendly service

We stopped in to Fuegos on a warm fall weeknight with no reservation and were able to eat in the outdoor patio space. The restaurant wasn't very full so we were able to be seated right away.

The menu is HUGE and has many options for vegans and carnivores alike. We had a really hard time deciding what to eat because there were so many things on the menu that we wanted to try. We had the sangria which was delish and then ordered the peppers and goat cheese dish. WHOA. It was almost too spicy to even eat and I think we took down several glasses of water in the process. We also tried the alligator assuage which was good. Overall the food was pretty good, but nothing to really write home about. We plan on coming back but mostly because we have some vegan friends that we think would really like I, and here are some other menu options we really want to try.

Service was so friendly and Fuegos has a great ambiance it just wasn't very lively because there weren't a lot of people there. This is a fun spot to try and I think it will only get better when it gets busier."}
{"text":"I've been looking for a chance to try out this place and Madison Burger Week seemed like the perfect opportunity, with having vegan and meat options! Of course we also had to order something off of the regular menu as well. 

For our tapas selection, we ordered the albondigas de verduras. This pretty much reminded me of a falafel, but instead of chick peas, black beans and some other veggies were subbed. The 3 balls were placed atop some mole, with a walnut cream drizzle. The mole was our favorite part of this. 

For our soup, we ordered the sopa de marisco. This was by far our favorite thing we tried!! There were loads of seafood, with a hint of heat, and a very smooth texture to the soup. Definitely will be going back to order a full bowl of this.

For our entrees we ordered the Madison Burger Week meat burger and veggie burger. My friend gave the meat burger good reviews, although his favorite part was the side chips. Very spiraling!! The veggie burger had really good flavor, but I cant call it a burger. The plantain \"bun\" was too greasy to hold up the cauliflower to eat it like an actual burger. 

Overall the food was pretty good, with the soup being one of the best we've found in Madison. My only complaint was that I had to specifically ask if they had the burger week burgers, because there was no mention of them at all. Also there could have been a little better explanation of the menu after being specifically asked if this was our first time there."}
{"text":"We share:
Tuna cheviche- 5 of 10
Calamary - 7 of 10
Pallea - 6 of 10
Bone in rib eye - 8 of 10
Flan - 8.5 of 10

Pricy for these small dishes"}
{"text":"Awesome vegan menu! Best black bean burger I've had in Madison. It was smoky and flavorful with good consistency.  My boyfriend had a beef burger that was tough and gamey and the mimosas were weak. Service was great."}
{"text":"Best vegan food in Madison!  My husband and I went for Sunday brunch and had our minds completely blown.  Everything was on point and this place clearly cares about making great food and doesn't leave vegan menu items as a mere afterthought.  Great job Fuegos!"}
{"text":"For the price the tapas is less than you'd hope for. However the steak was excellent. We ordered five tapas and only really like the mussels."}
{"text":"I recommend for lunch, especially a business lunch or meeting! Convenient (good service, no wait, lots of seating type options) and enjoyable. The atmosphere is more comfortable and casual than it looks from the exterior. The food is really delicious and well presented."}
{"text":"this restaurant has some MAJOR issues.. i'm not sure if the bartender, the manager, or most of the staff in the front has ever worked at a restaurant. i never tried the food as they had nothing on the menu , and waited a hour of us waiting at the table/bar to tell us. i thought i was on a reality tv show or prank show. the only thing they had to eat at brunch on an extensive menu were eggs and pancakes.."}
{"text":"Excellent restaurant with top notch service. Martin was my server and he was attentive, friendly, and helpful. The food is simply outstanding. From small plates to large plates and everything in between. Do yourself a favor and go to Fuegos as soon as possible. It will be your new favorite restaurant in Madison."}
{"text":"We came for brunch and loved it so much we came back for dinner. The vegan menu is also amazing!"}
{"text":"My roommate and I came here on a whim one Friday evening when we wanted to do a girls night. We sat at the bar and immediately noticed the beautiful atmosphere of the restaurant. The bar staff were SO friendly, attentive, and helpful especially when it came to my vegan diet. The drinks were amazing and the vegan dishes were so good especially the VEGAN ELOTE yes I said it the VEGAN. ELOTE. It was too good for proper words. Will definitely be returning."}
{"text":"I like Fuegos a lot. The only thing that keeps me from eating there on a regular basis is the fact that it's a bit of a shlep for me to get there. We are trying to reduce the amount of red meat we eat so we're constantly looking for more veggie forward restaurants and Fuegos does both meat and veggies very nicely and creatively. 

Today's lunch was roasted cauliflower, vegan empanadas, grilled Caesar salad, shrimp cocktail and a wonderful roasted sweet potato. A bonus surprise was the fact that the tapas were half off today.  The cauliflower was crispy and came with a drizzle of 2 sauces. Both were tasty. The shrimp cocktail had 4 jumbo shrimp with a salsa--guac-cocktail sauce. It came with chips. The shrimp were sweet and firm. Loved it. The creative Caesar had wonderful smoky flavor and was not overly dressed. 
Like this place a lot and hoping to get back for a margarita some time soon."}
{"text":"Complimentary sangria for Yelp check in is a plus. And the Birthday treat for my husband was a definite plus, he got the cheesecake flan, yummy! We got great seats by the window on a weekday at 5:45pm. We had a little issue with parking but that's ok. The paella was not the traditional tomato-based paella that I'm used to but is still good. The lengua didn't have the gamey taste and spiced just right. It was a good portion so I had leftover for lunch the next day. Overall a great experience, ambience is great too."}
{"text":"Fuego's - the very name \"steak tapas vegan\" says it's trying to do too much. The menu has some tasty items -- the pozole and the alligator sausage are definitely worth trying. A mezcal cocktail, however, tasted more like seltzer water with some cilantro in it. Servers were very friendly, but we weren't given small plates when the appetizer we were sharing came out, so it was a bit messy. The overall takeaway is that this restaurant would be great if it were in a smaller space and focused on a smaller array of dishes, such as just Mexican street food."}
{"text":"Our waiter Dillon was fantastic. The drinks were nothing special and the food was pretty good, but service was great. Thanks Dillon!"}
{"text":"Went here for lunch on Wednesday. I think I am seriously going to have to keep coming back until I've tried everything on the menu. Max N was our fabulous waiter! Very attentive and helped me select my meal--I was having option anxiety because everything looked so amazing! I had the Vegan Paella. Very generous portion (but I ate it all because it was so awesome)! My lunch date had the tomato salad and another yummy appetizer that I can't remember the name of right now, but I'm definitely ordering when I go back!"}
{"text":"Great food but crappy service, our waitress told us multiple times that they close at 10:00 even though we arrived at 9:50. I get it that she wants to leave but if you want to leave at 10 then close your doors early.

I would like to mention that both the manager and owner stopped by our table to apologize for one particular waitresses service which was much appreciated. They made what could have been a negative experience much much better. We will definitely return! 

The bartender Paul was great, very friendly and fun to talk to! 

Give Fuego a try for sure!"}
{"text":"This local business is inspired by family & run by family  they have great tapas dishes for all types of eaters. I'm not vegan, but I have to say their vegan desserts are crazy good! The Calamari is a must try! The empanadas are mouth watering and the margaritas are made with fresh pressed lime juice made in house!"}
{"text":"I love this place. Great, hearty, vegan options and one of the best happy hours I've come across in the city. Jim and Johanna, two of the bartenders, are EVERYTHING!"}
{"text":"I met a friend for dinner on a Thursday evening and it wasn't too crowded and the atmosphere was just right for catching up.  The experience started with being asked if anyone in the party was vegan or vegetarian as I'm sure there was a separate menu--great for those with dietary restrictions.  This is a cloth napkin sort of place so plan accordingly for your budget but I would say the food is well worth what you pay in terms of quality and flavors!  
My dinner companion and I had great service the whole evening.  The waiter was very patient with our talking instead of deciding on food and then he was further patient when I had a lot of questions about their seasonal salad and needing things taken off of the salad and dressing on the side.  He found out the answers if he didn't know them and it was all served as asked which was quite refreshing.  The waiter checked in as we ate and he was even attentive to water glasses when we were close to paying the check (rather than just assuming we were leaving right away and not asking).  With the light crowd that evening we didn't feel rushed and we enjoyed our dinner and catch up session.  I'm sure I'll be going back in the near future."}
{"text":"Went here twice with friends. We shared numerous plates and entrees.  Not impressed. Paella was not good at all. Tasted old, very salty, chicken was dry.  I love paella, we been eating it for 27 plus years across the globe. This place was on bottom tier. No taste of Saffron at all, chicken was dry and over spiced. Shrimp, clams, mussels and sausage were good.
A key indicator it was going to be bad was that  from the time I ordered to the time it hit the table was roughly 10 minutes.   Paella should of taken longer, even though it was pre prepped for restaurant.  The other dishes were bland.  Maybe the Vegan lovers are ok with that but myself look for flavor that something special.  Service was ok each time. I wouldn't applaud it."}
{"text":"Goat cheese, sea food, and yuca. Very good! I was excited to see a South American/sea food place open in the area and was very excited to try. The food did not disappoint, the service neither. We were seated quickly and given very useful information on the menu. So I think everything is very good right? Must have a rave review- 5 star worthy! Unfortunately though, I give it 3. The reason being is that while it was good food the prices were extremely high. Presentation of the wood was good, but I would argue the food should be a little better or more food should be given. For 2 people on a Sunday afternoon, I believe our bill was about $70. Might not come back soon but only because I don't think my wallet could handle it. If you have that kind of money, go for it, as it is good food! But I do think you can get same style/quality elsewhere at a better value. Thank you"}
{"text":"The Tigres and Tostones are my favorite small plates. Yum! The food was good but the service was even better. Dylan was a wonderful server and the sangria deal can't be beat!"}
{"text":"Our family of three stopped in for an early dinner at 4pm.  My first impression was that the prices were pretty steep.  The least expensive non vegan dish was around $18, and the biggest steak was approximately $90.  At those prices I expect a lot.  I ordered the salmon as recommended by the waiter, my daughter ordered one of the chicken dishes, and my wife ordered shrimp and scallops.  They got my order wrong, sending out two plates of shrimp and scallops.  However, it looked so good I told them I'd keep it.  All of the food turned out to be very flavorful and well presented.  I was particularly impressed with the scallops.  Too often scallops are gritty and overdone.  These were seared perfectly, tender, and not at all gritty.  The shrimp and rice were also done well.  My daughter enjoyed the chicken, but the coconut rice was underwhelming.  Overall we were very impressed with the quality of the food - particularly the seafood."}
{"text":"Definitely 5 stars. There was nothing wrong with our time spent there or the food. We took part in Restaurant Week, so we each received an app, main course and dessert for $30 each. While we waited for our table we were greeted by Oscar himself. He was very nice and had a few stories to tell us. Explained to us about some upcoming promotions at his restaurant. I was impressed and flattered that he took the time to chat during a very busy time. Big thumbs up!!

Onto the food:

Appetizer - I started out with the calamari. Perfectly cooked with just the right amount of heat in the Chile sauce. Super tender. A big hit with me. My wife had the baked goat cheese. The sauce with it was a home run. It had just a little kick to it at the end that was perfect. Very delicious. 

Main Course - I had the steak with jalapeño mashed potatoes. Mmmmmmmm!!! Steak was cooked perfectly with that ever so delicious grill flavor and sauces on top. I believe it was a chimichurri sauce. Could maybe use a little bit more of that sauce, but overall no complaints. Fantastic main course. My wife had the grilled chicken breast with coconut rice. She really liked it a lot and commented how great the grilled flavor was too. 

Dessert - I honestly don't remember what my wife had but it was a Vegan cake with coconut and pineapple on it. Outstanding she said. Mine on the other hand, was out of this world. It wasn't outstanding it was perfect. No word can explain it better. Blueberries, pineapple, toasted pecans, crispy tortilla with cinnamon, honey and of course ice cream. I loved it. 

Thank you Fuegos for making top notch quality food with a lot of flavor. We will be back!! Service was great and the drinks were tasty. #RWMADISON"}
{"text":"WOW!  What a HORRIBLE first impression!  It's burger week and my BF chose Fuegos as his first burger to try this week. As we walked by the windows we commented on the empty room set up for a party and we were pleasantly surprised when we saw the lack of people waiting and empty tables in the main dining room. We asked for a table for 2 and the hostess asked if we had a reservation. I replied no and asked if we needed one. Her response, with a haughty air, was, \"well, in Madison on a Friday or Saturday night we recommend one.  Soooo, it will be a 45 minute wait and if I can seat you sooner, I will.\"  I told her not to bother and we left. Suggestion to the management, you're on Willy street, an area known for eclectic tastes and fun people - if I were an out of town visitor I would have thought the hostess's attitude was a representation of a snotty, upscale restaurant - not what this area or Madison represents!"}
{"text":"Made a reservation about 5 days in advance for my birthday- party of about 15. They have rooms to fit large groups and we had some vegans in the group, so fuegos seemed like the best option. They confirmed our reservation and we were so shocked they could fit all of us on a Saturday for dinner with only a couple days notice. We asked if we needed to provide an email or anything for confirmation and they told us we were set to go... We get there with our large party on Saturday and they said they couldn't find our names but could have a table ready for us. 15-20 minutes later we're finally seated. So that's fine, they fixed their mistake and we didn't have to take the large party elsewhere...

We get drinks and food, which were all good. The vegans in our group were extremely pleased with their food. I love the fried plantains personally--delicious!

Service took awhile but it's completely understandable with our one waitress and large party. The thing that was not great was she checked back in with us after she put the order in the make sure she wrote it down right... She only missed a side which she said she'd put in right away. All the food comes out and one of my friends was told that she didn't put that specific order into the kitchen and he had to wait.. He only got his food when the rest of us were done eating. His meal wasn't taken off the check either which didn't leave us happy. 2.5 hours later, we finally get the check. 

Basically I would never bring a huge group here again. If you do, get solid confirmation from them and allot extra time to be there. But I've come with one other person before and the service and food have been fine."}
{"text":"Dear Fuegos, quit you day job! Vegan food is your true calling! 

Seriously tho, I was completely impressed to find such amazing vegan dishes served at a steakhouse. I especially loved that the dishes were not \"faux meat\" dishes. We ordered off the tapas small plates menu and found that every one of the dishes were very thoughtfully prepared. A little pricy so perfect for a vegan date night, believe it or not."}
{"text":"I was looking forward to returning to Fuegos after a fun Yelp event that gave me a preview. I came here with coworkers for a Restaurant Week lunch in the later afternoon. As before, I loved the decor. The service was fine, albeit a bit slow, especially for not being crowded at all -- I was glad we were not in a rush. Overall, it was an OK experience, but nothing special.

I ordered the chips and salsa for an appetizer, which ended up being surprisingly good. I was thinking the regular old chips and salsa combo, but the presentation was attractive with a spicy red salsa and a mild creamy green salsa with some tasty guac in the middle, and housemade chips sprinkled with chili pepper.

For my main, I ordered the 3 tacos. For Restaurant Week, you are limited to choosing one kind of taco for all three, so I chose barbacoa and my coworker got al pastor, and we swapped one each. The barbacoa was tender but the beef seemed unseasoned and pretty bland. I was glad the pico de gallo was there to save it a bit. The al pastor tacos' pork was amazingly seasoned and had a super flavorful fruity salsa on top.

Dessert time! Two of us ordered the buñuelos, which were deep fried tortillas topped with cinnamon sugar and ice cream... It was a dream. My other coworker got a little coconut cake that he enjoyed as well. 

This experience was a little disappointing. I'd consider returning during a more happening time to experience the ambiance and maybe just order the couple of things that I did really like."}
{"text":"Fuegos has something unique and incredible for everyone! There are especially great vegan options. It's perfect for a group who is looking to try a few dishes. This restaurant is a great addition to Madison- I've not had anything like it. You must try the margaritas here as well, the limes are hand squeezed! The service is great and Chef/Owner Oscar really cares about his customers! He is happy to make things right for customers who are dissatisfied- although I don't think you will be! The decor is also very unique and the atmosphere is comfortable and inviting. This is a new regular for me and my family!"}
{"text":"Fantastic flavors - vegan done right! Service is questionable but the food is awesome!"}
{"text":"Oh how I wanted to love this place...we did not. I would have given it 1 star based on the food but I gave it an additional star because our waitress wasn't awful. She did appear to have pleasant personality. Overall the service was just generally SLOW. This surprised me since they could have sold us several more drinks in the time we wasted sitting around if anyone had ever bothered to so much as pass by our table...
We ordered 2 different cocktails, the guacamole, chips & salsa, meatballs, jalapeño peppers, shrimp a la diabla, betabel (think beet salad) and elote. 

Pros: 
the guacamole was fresh and flavorful. We both enjoyed the elote flavor, it was not overly saturated with ingredients so it had a good balance. The peppers were big and cooked so that they retained much of their consistency. For those nervous about too much spice, they would be just fine eating these. The salsa had some heat and the chips-to-dips ratio was good for us.

Cons: 
ugh, where to start! Well, everything was barely room temp when it arrived at our table except the salad, which was warm enough that it was starting to wilt. The lamb meatballs were over cooked, dry and lacked any flavor. Perhaps the most disappointing of all were the shrimp. Not only was it nearly cold, but they tasted irony and were served atop these hard pieces of bread that had at some point been toasted or baked in excess oil and were nearly hard as a rock. To top it all off, the menu says the shrimp is prepared with chile de arbol, which I hoped would have provided some kind of spice, but this dish was totally void of that. Lastly, despite the elote tasting good it was over cooked and chewy. 

I would not return to this restaurant with so many other amazing options in town, and I would even go so far as to recommend others just skip this place altogether. 

* after writing and then submitting my review, I went and read several of the older reviews about this place and noticed that those who had issues seemed to have had nearly the same complaints as I've listed. Hmmm....not a good sign."}
{"text":"This place is awesome because we can eat here with our vegan companions. Our service was a bit slow tonight, but the tapas were worth the wait. We had the vegan taquitos and fried plantains, both were delicious. The entrees were well timed by our waiter Jason. Y'all got to check this place out if you haven't already."}
{"text":"This is possibly the best Mexican style food I have ever had. Far and away better than the prices. Paid only $60 for lots of food. Everything was incredible. Plus 10% for meatless Monday!

Yay yummy vegan food!"}
{"text":"Great food with a huge selection of unique vegan options (there's an entire vegan menu) but plenty of meat and seafood too. Almost an overwhelming selection, but our waiter gave us some great recommendations. The cauliflower steak, and the mussels and baked goat cheese tapas were both fantastic!"}
{"text":"I love the fact that a fancy steak restaurant took the bold step of not just offering vegan options, but actually adding the word, \"vegan\" in their title. Gutsy move for an omni restaurant.  I have visited a couple of times between August 2017 and February 2018, trying the vegan options from their dinner and lunch menus. Of the two, the lunch menu is my favorite.

First visit I ordered carry out from the dinner menu:
FILETE DE COLIFLOR-
$15.30 - Ordered sans the cheese. Although I found the cauliflower \"steak\" to be cooked and seasoned to perfection, there was too much \"bone\" in the middle and not enough edible cauli-florets. I also found the accompanying sweet potato bland. It could use some vegan butter or brown sugar.

YUQUITAS -
$7 - I wasn't a fan of their yucca. It was lacking in flavor, but it came with a yummy dipping sauce.

ARROZ DE AZAFRAN Y FRIJOLES NEGROS -
$8 ($4 each) - The rice itself was bland, but mixing the rice with the black beans made for a winning combination. The black beans are very flavorful.

VERDURAS CON AJO - 
$4 - This garlic infused spinach dish was excellent. I love garlic and salt and this side order had plenty of both. (On the menu in August 2017, but I didn't see it on the menu in Feb 2018.)

COCONUT CAKE - 
$5 - A delicious little bundt of joy. The coconut taste was subtle, which was perfect for me, as I'm not a big fan of coconut.


On the second visit, I dined in for lunch and opted for the LOS TRES COMPADRES on the vegan lunch menu. For $17, you get a 3 course lunch with your choice of appetizer, entre, and desert:

ALBONDIGAS DE VERDURAS -
Veggie balls in delicious mole sauce. Delicious! You only get one veggie ball with the 3 Course Lunch special. $9 when ordered a la carte off the tapas menu, but I'm not sure how many albondigas come with the tapas portion. 

EL GRINGO NEGRO
Their own homemade vegan black bean and veggies patty with vegan chimi mayo and spicy ketchup. A-MA-ZING! This is no ordinary veggie burger. The flavors, the spreads, the surprising papas fritas topping, and the buttery bread all made for an excellent hamburguesa vegana. Even the presentation was outstanding. I was extremely impressed with El Gringo Negro and would certainly order it again. $11 if ordered a la carte. 

BUÑUELOS 
Their version of vegan buñuelos are basically sweet tortillas topped with fruit, raspberry compote, and vegan vanilla ice cream. It was alright, but unimpressive. I wouldn't order it again.

I love their inventive vegan dishes and appreciate their effort to offer quality options for non-meat eaters. Keep it up, Fuegos!"}
{"text":"I had terrible service, and the waitress knew nothing about the menu. She did not know the difference between dishes and rarely checked on us, she knew she did a poor job because she mentioned that she knew she wasn't attentive. The appetizer was really good, but the vegan option ended up being a bunch of raw veggies on a plate displayed beautifully. This was very expensive to receive such a poor main dish.  Overall, I would go back, to give it a second chance, but would not have high hopes."}
{"text":"Amazing food and beautiful decor! Not to mention excellent service from Max! Civche atun is Fresh and delicious! I can't wait to try dinner here."}
{"text":"I know it's new and you expect quirks and kinks.   First off, we did check out the online menu and I was disappointed that prices weren't listed.   That is a real negative for me, but we still gave it a try.  

We got a table right away, we had a reservation.  The drinks were good but VERY slow to come out (arrived after apps).  Most of us ordered the steak special medium rare but it came out so tough and full of fat.  The manager stopped by and told us the steaks were a delivery error that they were trying to get rid of them.  That's not what you should tell your customers when you're offering that to guests as your special.  The manager did offer other options off the menu but the rest of our party were almost finished and we didn't have faith the cook really knew how to cook the meat.  

Positives:  The drinks were good.  
Negatives:  SLOW serve, items coming out at random times, food quality, and disappointing customer service (from the manager). 

I hope they can turn it around as they go forward!"}
{"text":"Really was excited to try Fuegos!! It's date night with my honey and we get there at 7:00. We are sat at a cute table with a wooden bench but turned out to be uncomfortable and the table wobbled. I asked to be moved to a different table. 
Ok, we are at a much better table. After 10 minutes, we are finally greeted by our server. Put in our food order and order our drinks didn't arrive until 20 minutes later. For a martini and wine. Kind of slow. We receive our soup and it's so thick. Not good. 
The calamari was not garnished and just a pile of fried calamari. Not attractive. The scallops were amazing! Get those. The mussels were missing seasoning in the broth. We never saw our server after the drinks were dropped off. Terrible service. 
2 stars for the scallops and the bus boy who was awesome!"}
{"text":"My husband and I went here for brunch and loved it! I'm vegan and got the pancakes and they were delicious. My husband got the El Alpastado and it was more than we expected. During our meal the chef came to our table and greeted us and checked on us and made us feel very welcome!"}
{"text":"I came here with a group of about 15 people for lunch and they were very accommodating for us on short notice. They pulled together a handful of tables and quickly got us situated with place settings, waters, and menus. 

After the initial set up, the service was a little slow and our dishes came out two at a time, but considering the size of our group I'm definitely not complaining. In total, we were probably only there for a little over an hour.

I ordered the 3 taco platter (I chose two Tequila Pollo tacos and one Al Pastor), which for $9, was a pretty good value. The Al Pastor one was supposed to come with spicy pork and pineapple salsa, but there definitely wasn't any pineapple or any salsa on that taco. I've had similar experiences at other upscale taco places though, so maybe I'm just under-educated in taco culture. :)

Overall, tasty food, friendly service, and I would definitely come back!"}
{"text":"Great menu and the food lives up to the description. Crab cake, scallop nachos, fried calamari appetizers all 5 star. Vegan pozole duck relleno and vegan pozole were outstanding. Friendly knowledgable waiter. A really nice enjoyable evening for a $$ price. Highly recommend."}
{"text":"First, the good parts. Friendly, excellent staff. Everyone working the bar and the floor was very welcoming and knew what they were about when it came to greeting, mixing a drink, etc. We enjoyed our margaritas very much. The dining room could be described as colorful, hipster funk with well-sanded strips of rough-hewn wood sprinkled throughout. 

The food was an irksome mix of weird and bland, with some truly lovely bits here and there. Our server and her manager could not have been nicer or more willing to bring me something else when I sent my dinner plate back after only a few bites. All I wanted was distance between myself and that plate. 

We ordered the guacamole and the empanadas from the vegan menu. Both were tasty, and the empanadas were perfectly fried. Then it got weird and bland. 

The guac plate was very odd. A fine scoop of excellent guacamole was set adrift in a sea of what I can only describe as liquified guacamole. On one end of the plate, the tiniest--a soupçon would be an abundance in comparison--amount of an amazing, spicy salsa was drizzled on the surface of the sea. 

I am most decidedly not in favor of liquid guacamole, no matter how it tastes. Why would anyone do that to a poor, innocent avocado? Oddly enough, I think an avocado foam would have been both welcome and appropriate. Go figure.

The empanadas were my personal favorite of the meal. The dough used fries up beautifully, and is crispy on the outside and delicate on the inside. It tasted like it might've been a blend of corn and wheat. The filling was yummy and not at all overpowered by the squash. I'm just not a fan of a super sweet squash. The empanadas are topped by that fabulous red sauce, but not near anything like enough of it.

The main courses were aggravating and strange. The picture is of their \"fried pasta\" dish. The only crispy pasta we noticed were these stalks of dried, uncooked spaghetti standing up in the middle of the mound of boiled spaghetti on the plate. My husband ordered this. There was a nice mix of veg, but the sauce was almost entirely without any sort of specific flavor. I ended up snacking on the dried pasta just for something to do.

I ordered the chile relleno. It was stuffed with some very lovely vegetables, all perfectly cooked: the poblano was gigantic and very nicely roasted, the vegetables inside were just the right amount of crunchy and soft, but I've had air with more seasoning and spice than that chile and its filling. A nut cheese was mentioned, but I failed to detect it. The red sauce--there was tons of it--was not that aforementioned amazing salsa I could eat a bucket of, as I'd hoped. It only tasted of sweetness, and also had vegetable oil pooling here and there in it. There were also well-cooked black beans and coconut rice. No seasoning or spice in the beans, and no coconut flavor to the rice.

I'm sure I am sounding harsh, but if you're going to name your restaurant after fire--multiple fires, at that--it seems like salt, pepper, and at least a few spices ought to go into everything you make. I got the sense that there was more care put into how a plate looked, pasta stalks aside, than how it tasted. I never send food back, and my husband was horrified, but give me a sloppy plate of super tasty food over something meant for display purposes only any day."}
{"text":"Excellent vegan options. I had the cauliflower steak but can't wait to go back to try some of the other vegan menu items as well. The food is fresh and flavorful. Good drink menu as well. Staff members are friendly and efficient."}
{"text":"We went for brunch and had a respectable experience.

The food was excellent. The stand-out was the omelette, which had quality chorizo and a frittata-like crust. I will be ordering this again. We were able to try the migas as well, another fine dish. The empanadas were of the less greasy, not so crispy style but were quite tasty as well. I enjoyed the music and space, the whole place is very classy and it has an open patio tucked away from the street. I liked the beer selection, the El Wisco is a good pairing with the dishes we had. The menu is quite extensive, so I would love to try to experience more of it, especially some of the vegan dishes. 
The only drawback was the speed of the service. It took a long time to get our food. I'll cut them some slack as they opened relatively recently and everyone was as friendly and reasonable as possible. Despite this minor inconvenience, I will be coming back and hope to revise this review in the future."}
{"text":"Got the chance to try some of Fuegos food this weekend at the Willy Street Fair. They had a booth set up outside of their restaurant. 

I had two little shredded beed tacos. The BF had a slider. I didn't try the slider, but he said it was really good. He also said it was cold, bummer. Being as this was set up for the outdoor street fair, it's a little more understandable. The tacos I got were delicious! The flavor was spot on. I got them in corn tortillas which tend to fall apart, as mine did, but that was totally okay with me. The flavor made up for it! They were super moist and the toppings seemed very fresh. Two thumbs up from me! 

I hope to return soon and eat inside. It looked really nice from what we could see through the windows. The Fiesta Garden was also a super cute little space for outdoor dining!"}
{"text":"Really great service with awesome medium rare bone-in ribeye and medium pork chop. The chef was nice. He made every dish tempting and he cares guests' feedback. The restaurant is crowded. But I still highly recommend to spend a great night here!"}
{"text":"We were excited to dine at Fuegos tonight. We had tried to go a couple of other times and they were not open. So tonight was the night. We started with the Tuna cerviche, and the baked goat cheese appetizer. The baked goat cheese was great however the bread they served with it was stale. The cerviche was very different. The
 tuna was fresh but not marinated. It was the weirdest cerviche I have tried.
One person in our party ordered the something off the vegan menu, it was tasteless. Now my chicken dish was prettg good, and the salmon was tasty too for being frozen. Some hits and some misses, don't think I will be back. I must say the dining room and the overall space was very well done. Just bring the food up to speed."}
