{"text":"Amazing food and friendly atmosphere. Some delicious vegetarian options and the Honey Goat Cheese Pannacotta w Passionfruit was a great way to finish the meal. Enjoyed the evening and food immensely!"}
{"text":"Really delicious, beautifully presented and skillfully executed food. Service was warm and friendly, and chef Stephanie Brewster came out and chatted with us for a little while. Super friendly, and obviously very passionate about what she does. The only minor thing that I think could use some work is the interior design. Perhaps with nothing more than a change in the lighting, the space could become much cozier and more inviting.  The oddly placed chandeliers with overly bright bulbs diminish the comfort level of what could be, I think, a much warmer and more comfortable space. Thanks, Stephanie!  We'll be back!"}
{"text":"Fun, small and intimate tapas restaurant.   Great $5 lunch plates.   Everything made very fresh, and cooked properly.  It wasn't too busy, so not sure how a true stress test would be on a busy night.
Service great.  One thing I wasn't a fan of, they made made a great fresh applebutter, but it was served with 5 of our 7 dishes.   Once was enough for me."}
{"text":"Wow, just wow.  Four of us enjoyed an incredible meal at the 8pm sitting on a Saturday night.

The food is creative, fresh and amazing.  We loved the pork belly and the churros, you MUST have the churro for desert! 

The service was attentive, professional and fun.  The Chef came out and chatted when she had a minute and it was wonderful to meet her.

This is a great restaurant addition to the village!"}
{"text":"You should read the menu before going as it's not for everyone. The ladies struggled to find items that were either not fried, had bacon and/or duck fat, or butter. The decor is not great, and the restaurant really needs a make-over. The service and wine were good. It's one of those places you are glad you went to, but not sure if you would return."}
{"text":"Went here for lunch to celebrate my wife's birthday with some friends.  The restaurant came very highly regarded to me so we were excited to try it out.  It looks very unassuming from the outside but the menu and service is outstanding.  Stephanie, the chef also came numerous times to talk about the food and was very friendly.  I would certainly recommend this restaurant!"}
{"text":"Went to Fuego tonight after initially heading to Maluca, which was closed due to renovation. When we got there there were quite a few tables available but we were told most were reserved. Nevertheless we got a table. The beer and wine selection is good, I had the Estrella beer. The food is excellent. We had the manchego stuffed dates, candied bacon, chorizo, patas bravas and the Frito mixto (calamari)....all was more than good. My only complaint might be the decor. I had a bright light shining in my eyes from the large opening to the kitchen. The other thing was the large mirror at the end of the restaurant. I know they are trying to maximize the space but it could be done a bit more stylishly. The flooring, not the greatest. But the main things the food and the service were excellent. I will go back for sure."}
{"text":"Great food, great atmosphere, great time. I'll definitely be back quite often. The staff is extremely friendly and helpful and the food is some of the best I've had. They really take you under their wing and make you feel at home."}
{"text":"I went here on a Wednesday evening with my family for my birthday celebration. I made a reservation at 5pm for 7pm. They said it wouldn't be a problem. When we got there there was no parking nearby -on the street or in the lots  nearby, so we had to park far away which made us a bit late for the reservation but, when I called to tell them we were running late they said 'take your time'.

 We were 5 adults and one baby. The stroller was in the way of the washroom but we parked it close to our table the waitress was super helpful.  

 We started off with drinks. My sister got the Fuego Caeser with candied bacon. It was good. I got a gin and gingerale. I had never been to a tapas restaurant before so I didn't know how big the portions would be. All of us just ended up ordering what we wanted to eat then shared. Most of the dishes were a little too small for 5 people so we ordered a lot. But we were full at the end. You definitely need to order some meat like the steak or lamb to get filled. 

My favourite thing on the menu was the scallops with orange butter. That had the best flavour I would order 10 of those haha, the sauce is amazing. Also the scallop ceviche had great flavour - good acidity and creaminess. We also ordered Chorizo - we found we needed more bread to soak up the sauce after-salty and swert. 

 I usually love oysters but theirs had tequilla in it and I did not like that flavour. Otherwise I would have ordered more (I did order 3 plates-3 on each). I would have eaten them without the tequila and just the cucumber and cavier. 

My mom loved the beet cured salmon. And the lamb was to die for-melt in your mouth. The steak was a bit too salty for my liking but cooked well.

 We finished off with the dairy free chocolate mousse perfect for my sister who cannot have dairy. Chef Stephanie explained how it was an emulsion with water. Tasted very good. 
 Also a foie gras covered in chocolate and the churros with a sparkler for my birthday. Those were my favourite.  I only wish they had the panna cotta like it is shown on the yelp reviews. 

Chef Stephanie came out twice to greet us. The second time with her husband. They're such nice people. She took a picture with us and gave us cards for social media. 

 I have to give the biggest props to our server though. I think her name was Kaylee/Kayla but really not sure. She was the best server I've ever had. Although she is only there part time.  She played with my sister's baby. She was extremely friendly and warm. She made sure we were taken care of and did an excellent job  explaining the dishes to us. I would definitely come back just for the service. 

Overall the bill came to around $237 for the 5 of us.  It was a great experience."}
