{"text":"Hey!! Get over to Fuel!  Why? Because this restaurant's food and drinks are awesome! The location is right across from Cozumel, which does a great business and THIS Fuel is the BEST I've enjoyed that's ever been offered here!!  REALLY - my daughter texted me to go here and we made it over the same week!  We had smokey bbq chicken wings and they were SO delicious!! Also an (aloha) burger that was right up there with one of the best - ... an appetizer... AND the most amazing blueberry mint muddled drink(s)!! I can't remember the name but I'm already craving another.  Tuesday is Karaoke. There's a happy hour daily. Good beer selection. Prices are good. Rodney took care of helping with decisions and made those awesome drinks too! TASTE is delicious and I highly recommend the signature type drinks....they know what they are doing!!  There are other details, they have music some nights... it's a keeper, relatively newly opened and want this place to stay!!!"}
{"text":"Don't waist your $$$. Mediocre at best. Drinks seemed good, atmosphere bad. Chicken sandwiches horrible. Won't be open long unless they make some serious changes. If not for the great cucumber martini would have gotten one star."}
{"text":"It's a nice try, and much of the food is creative, but poorly executed. Chicken tenders deep fried with over seasoned italian bread crumbs, deep fried breaded meatballs that seem like a nice idea but were burned. The deep fried breaded stuffed shells were already pulled off the menu.  As were the Shepard pie sliders. And the stuffed peppers. And there was nothing vegetarian for the veggie in my party except potato skins, onion rings, fries and a side salad. And the chicken tenders were so over seasoned the kids would not eat them even without the sauce.  But the beer was cheap and a very nice selection."}
{"text":"Italian Wedding soup is OUTSTANDING!  Burgers are to die for.  Can't wait to try the rest of the menu. Everything is so fresh. The staff is friendly. Service is great. Bathrooms are the cleanest I've seen in any local bar. I could live here. Love this place."}
