{"text":"Ate lunch buffet.  Thought it was solid.  Had good watermelon, honeydew melon, clams, mussels, salmon, sushi-esque tuna and salmon bites. 8 basic flavor of ice cream including cotton candy.  Had cold oysters and shrimp and solid salad bar.  Their USA type fried food was sketch, but fried potato wedges were good.  I don't like sushi but they had lots of it.  Used imitation \"crab\" in alleged \"crab\" dishes so those were all gross.  Bathroom was not super clean but satisfactory."}
{"text":"I went with my wife and son today. I thought the food was so so. While we were there they had a movie on that was not appropriate for young children because of the violent content. We went for the lunch buffet. There was a large selection of food choices. I think there should have been more vegetable choices. I believe I am more picky than most people since I am very health conscience. The servers were helpful."}
{"text":"Not as gr8 as other Chinese buffet, they could add some more variety of chicken and shrimp items"}
{"text":"My son who is half Chinese brought me here for dinner Saturday and it was very good and friendly. We will definitely come back."}
{"text":"Large variety of very tasty dishes. We went on Sunday for the first time and returned Wednesday for lunch. Can't beat the senior prices. Good bye golden coral and double dragon, hello fuji!  The staff was friendly, it was clean and the decor was inviting. However, I would  like napkin holders on the tables and knives available without having to ask."}
{"text":"Awesome Asian cuisine buffet. They have a make your own pho or udon noodle soup station and a hibachi grill station. The sushi here is good as well as their fresh fruits. The staff here is very friendly and always clear plates and bring drink refills in a timely manner. The price also can't be beat."}
{"text":"This is probably the best overall Asian Buffet I've visited. From the wide selection, and the quality of product, to the cleanliness and decor of the space itself...all outstanding. The fresh sushi and attended hibachi area were a nice bonus. You can also carve yourself ham or beef, both were hot and delicious. I can't go into all the selections, way too numerous, but if you want it at an Asian Buffet, it's most likely there."}
{"text":"I really liked this place. I would say Fujis is very comparable to Kumod and at a lower price point. The sushi (for being budget sushi) was very tasty. The interior was nice and clean. The staff was very friendly. I would go back again!"}
{"text":"Thought to come here to try a new restaurant, kinda disappointed and wish we went across the street to Kumo. Food tastes like if I had a cold. Sushi making right next to raw chicken section for the grill, and the worse part is seeing staff scoping food fell on the counter back to the tray right after finish eating :( I guess this is last time for us to be here. I hope the kids and I won't be sick later."}
{"text":"This was our first visit to Fuji Grill and Buffet on Saturday at about 6:30 p.m.  We entered into a long corridor and to a counter/desk where we waited to be seated.  There were about a  1/2 dozen customers there and after a few minutes of confusion, we were told we had to pay before being seated.  I was taken aback by that, but we paid.  After ushering us into a spacious dining room, the server took our drink orders.  I looked around and noted that the dining area appeared slightly dirty, mostly the floor.  CNN was on a TV monitor up near the front window.  I detest CNN and didn't want to watch politics.  I wanted to relax and forget all of that but it was right there in my face.  As we made our way to the buffet area, I first passed the soup station, where placed next to the soup pots, was a FULL BUSPAN OF DIRTY DISHES.  I swear, if we hadn't already paid, I would have insisted on leaving.  But I was with hubby and he's more forgiving of such things in a restaurant.  The buffet area is large and has a big selection of choices from seafood to prime rib to American choices such as pizza and potato skins.  I love prime rib but it looked dried out and customers had chopped away at it rendering it a tough piece of meat.  Why it wasn't already carved up is a mystery to me.  For this review, I'm only commenting on the food I ate since I didn't pay a lot of attention to hubby's plates.  I chose some sushi first.  Decent selection, but not as nice as Kumo's across the street.  I ate the sushi and it was slightly above room temperature.  Not chilled as it should be and that made me nervous.  I then ate some coconut shrimp, clams in black bean sauce, dim sum, mei fun noodles, fried chicken wings and shrimp.  All of those were tasty except the dim sum had a slightly strange taste that I didn't like.  I avoided the dessert section because most of it was boxed, frozen-then-thawed sweets.  There was some fruit but I have that at home so I wasn't interested.  As we were winding up and digesting the meal, I watched some of the action in the restaurant.  Two servers were clearing a nearby table and one of them wiped the table with a wet cloth, then wiped down the chair seats, and then WIPED OFF THE TABLE AGAIN.  OMG, I was so shocked that she did that.  People's derrières were firmly planted on those seats and if you saw some of the customers, you would understand my reaction.  That sealed my initial decision to never frequent this restaurant again.  Exactly 24 hours after we ate the food at Fuji, I experienced, ahem, shall I say, intestinal issues that are still with me this Monday morning.  After I conferred with hubby, he said he had issues as well that presented on late Saturday night.  Overall, I will not return to Fuji.  Kumo is a much cleaner restaurant and the sushi is fresher tasting.  And in the more than two dozen times I've been there, I've never had intestinal issues either."}
{"text":"HOLY COW!!! $11  and all you can eat!!!! Great variety of food, sushi selection was great but a little more would have been nice, food was fresh and very good! What more can I say!"}
{"text":"Hey its a Chinese buffet but one of the best I've been to.  No crab legs but other than that very good.  looks like the younger generation of the family has taken over and given it a more modern vibe."}
{"text":"Just discovered this restaurant tonight and we were very impressed. Outstanding variety, flavor was awesome. Very clean and friendly crew. Prices were more than reasonable!!! I recommend this place to everyone if you like Asian food. We will definitely go back again and again!!!"}
{"text":"Amazing selection, wonderful fresh sushi, well maintained buffet, and even the desserts were awesome. I was full before I got to try even a quarter of the selection. I will definitely be back again and again. I am full, happy, and wishing I had a second stomach."}
{"text":"I did not enjoy my time here. It was definitely above cost for quality, and I did not experience friendly staff. I think that good staff and a good experience really go into the value and time at a restaurant. I would recommend better management."}
{"text":"The food on the buffet was hot and fresh  everything was so very good.   The staff was very attentive,  your glass never sits empty, I can't tell you how good the Korean beef ribs were.   So tender you could cut it with a fork. The chicken wings we're very well seasoned. All that's left to day is I wish I could give this buffet another star."}
{"text":"My husband & I went the first week it was open.  There weren't many people.  The place has been empty for quite a while since the old buffet went under so I think they should start advertising.   Anyway, this buffet is clean & well lit.  The staff was always stirring the food so it would not dry out & replacing items as needed.  We both had the fried shrimp which was done to perfection.  My husband only likes \"American\" food so he stuck to that & really liked the beef ribs because they had no sauce.  I tried several of the chinese items & they were good.  I did not take anything from the sushi bar but it looked pristine.  Then this week,  I took my friend.  We cruised the selections, some of which were different then my first visit, & made up our plates.  I, again, had fried shrimp.......cause I'm no fool & it was great.  I had mashed potatoes which needed some seasoning but were, at least, real potatoes.  I was somewhat disappointed that they did not have the chocolate cake they had on my first visit.  The rest of the dessert selections were picked over except for the cookies.   I agree with the other reviewer who commented on the placement of the soup pots.  But speaking of children...........there was a family sitting at the tables next to the row of booths along the front windows.  At this visit, there were many more patrons than the other day & most of them were seated away from the front.  The kids from this family were running all over, chasing each other & climbing all over the tables.  Literally climbing on the tables !!  They were Asian & I thought, at first, they were relatives of the buffet staff because they seemed to be ignoring them.  No adult that brought them in was making any attempt to discipline the kids.  The women just sat there like they did own the place.  So this part is for the owner:  it is better to ask one family to leave than to lose customers because they do not want to eat in a place that allows this sort of behavior.    All in all, this is a nice place to eat & relax.  We will be back."}
{"text":"Bad food, too much MSG, you saw that a one penny  in my food, there is no next time"}
{"text":"Hello yummy food!! Kumo is old news now. Fuji is my new buffett go to!!! The sushi was amazing - just wish the staff labeled what was what. Didnt matter much to me though since Im open to trying anything. The hot food was hot and amazing. I saw the staff constantly stirring the hot food areas and checking for needed re-fills. My favorite hot food item was the coconut shrimp! The interior has also been fully renovated and is soo clean. I cant wait to go again!!"}
{"text":"I am definitely a fan of Fuji Grill Buffet, for the price that is paid and the type of food you get you cannot go wrong if you come on a right day (-1/2 star).   The food is absolutely delicious when it is fresh there are a lot of choices ranging from sushi, chicken, seafood, noodles, deserts and many more. I will not over explain how many choices there are because other users probably already have.   The other (-1/2) star that goes to would be the way that patrons treat the customers if you eat too much seafood they will pace back and forth and constantly look at your table and act like they are angry. After about 1 hour of time inside the place they will rudely put a bill on your table trying to give you a clue that they want you to leave and stop giving you refills which really turned me off. Otherwise the place is superb you cannot beat what you get for the price anywhere else.  - TheOneS2K"}
{"text":"My aunt recommended this place saying the food was delicious and the choices of food was awesome. I absolutely agree. The plethora of choices from American to Chinese American was great. Crawfish,  cooked salmon, whitening,  shrimp, spinach lasagna, ribs, chicken,  chocolate mousse cake,  plantains, soups salads.... too much to name... and for 4 children and 2 adults I paid 47 bucks. Check them out you won't be disappointed"}
{"text":"This place by far is better than Kumo.... The people are nicer.. Lots of different selections to choose from... The server always make sure to clear my plate(s) as soon as they see I'm done... Definitely better experience than Kimo..."}
{"text":"Went here for the first time tonight. It was very crowded, which most people would take as a good sign, until you look at their buffet. A lot of the trays were empty, and it took them a while to refill it. And, empty containers were being stacked up on a rolling cart. That being said, a lot of their stuff was mislabeled - a label said 'stuffed crab' and it was some kind of chicken dish instead. And, something next to it was mislabeled as well. (Were they out of it?)  I sampled a bit of everything, and enjoyed my food for the most part. The only thing I didn't get to try was their sushi. I didn't see any signs in their sushi section, so you weren't sure what you were getting.   Their hibachi station was ok. I wished they had more vegetable offerings aside from broccoli, green peppers, onions, and squash. They killed the flavor of my food with too much sauce. (Oh, and they cooked their pot stickers on the same grill. I watched him cook it and prep it to go back on the buffet, but it took them a while to retrieve it from the grill - over 5 minutes. And, I know that item was empty on there, because I wanted more.)  Their dessert offering was the typical fare - cakes, fruit, and ice cream. However, the big turn off for me was watching the person who was restocking the dessert section, wipe off a cake cutter / server on a dish and put it on the one she replaced it with. Mind you, it was serving a chocolate cake, and the chocolate cake was replaced by a white cake.   I found out this has been open for four months. And, I think they still need to improve on their buffet service. Or, hire more help.  UPDATE 11/22/16 - Man this place went downhill fast. The person manning the hibachi grill was more concerned with texting on his phone than cooking my order. The guy in the sushi section was on the phone, but stopped long enough to tell me to leave my hibachi fixings on the table so the person can come cook it. (Mind you, it took them a few minutes to get there.)  I loved their Korean bbq steak. \"Loved\", because even though they brought it out from the kitchen in front of me, it was barely warm. Such a disappointment.   Plus, everything seemed to have been sitting out too long - string beans, deep fried butterfly shimp, donuts (did the squish test - none passed!), miniature cakes were dried out, as was the cream puff. Only thing hot & fresh was my hibachi.   I don't think I need to go back anytime soon. 2 strikes & out for me. I am not a glutton for punishment. And, mind you, I maybe go there maybe 3xs a year. But, today was pretty disappointing."}
{"text":"Had a fantastic experience here at lunch. What a great value, and with high quality options like sushi rolls, soups, baked fish, tons of fresh fruit. Next time I'm in the area I'll be coming here. I honestly can't identify any flaws with the experience here. This is the no brainer way to go if you're hungry and like to eat."}
{"text":"WOW! What a bargain in this day & age. $10.99 plus drink - food is good  - quality above the average buffet. Sushi is good (it's a buffet people not a Sushi restaurant) hibachi was good - first one I've tried at a buffet - the prepped food for the hibachi looked fresh & was. Buffet had many different choices of food then I'm used to from the buffets I go to. Wish they had fried catfish.Brightly lit - clean - not a shabby looking place at all like some of the other places. Only complaint I have was my beverage \"hot tea\" - they seemed to use hot water from the faucet cause the water wasn't hot enough. Stop reading & get going your stomach and wallet will thank you!"}
{"text":"place was your typical buffet. went for lunch. wish i was there for dinner. nothing was all that exceptional. crawdads were extremely spicy"}
{"text":"It's okay.  We go for the sushi which is a hair above average.  The hot food is pretty run of the mill.  I probably would have given it 4 stars but the last time we were there, they let the bins of ice cream get really low and people were reaching their arms all the way down in there to scoop their ice cream.  It was very unsanitary - people's clothing scraping inside the thing of ice cream. Gross."}
{"text":"Visited for a late lunch on a weekday.  The place was still surprisingly full, considering we were well past the typical lunch hour.  I'd say Fuji is generally above average for a Chinese buffet.  I think it's biggest strengths are cleanliness and variety of non-Asian food offerings, if that's what you're looking for.  They have more American style food on the buffet than I've seen at most places - the typical pizza and potato wedges, but also macaroni and cheese and mashed potatoes.  There really wasn't anything here that was a surprise or new for me, which to me is a negative.  The sushi selection was just ok, nothing exciting.  My favorite dish was probably the salmon, and my husband said his was the ice cream (just standard hand-dipped, serve yourself).  The worst part was the service.  We got very little service - had to find our own straws, only got a single drink refill, and our dirty dishes piled up.  I don't think anyone would regret eating here, but there was nothing distinctive enough to make me want to come back.  For those who prefer Kumo (across the street - I think I do), if you get the coupons in the local circulars they end up being the same price for lunch ($6.99)."}
{"text":"Ate here last night.  Usually go to Kumo across the street.  This was a very pleasant surprise.  Maybe my new favorite Chinese place. Reasonably priced, the decor is very nice and spacious. Had no complaints about any of the food and they had a fairly decent salad bar for a Chinese buffet.  Had all of my favorites. Will probably go here from now on instead of Kumo.  There were enough sushi choices here to satisfy any sushi cravings that I might have.  The service was excellent as well."}
{"text":"I have long been anti buffet because I don't believe that most are sanitary. I was nervous going to this buffet for that reason but my dad was in town visiting and LOVES Chinese buffets so we tried it. I was very impressed by the amount of food selections they had as well as the availability (everything was stocked), temperature, and cleanliness. For the price this place is the best I've been to, and my dad liked it so much he went back again before he left town. I've been back as well and enjoyed it the second time just as much as the first. I gave four stars because they didn't do much with the decor and the hibachi feature is just mediocre."}
{"text":"Take away points from this trip: - The sushi was beauitful and delicious - the hot food was hot and yummy - the price was extremely cheap ($14 for two people)  I decided to visit again out of curiousity, this time because it was a busy day and I hadn't had a bite to eat yet-- I was starving. It's kind of weird to go to a place again two days later, but I was curious to try the takeout.  Was not disappointed.  I got a box of sushi and sashimi, and a big box of hot food.  the total came to $14, and the box was able to feed both my husband and myself until we were full. :)  I AM SO GLAD THIS PLACE IS RIGHT NEXT TO MY HOUSE!!"}
{"text":"Delightful! They have build your own pho, hibachi, and soba or udon noodles. They have a huge amount of options on the buffets as well. They also have ginger salad dressing like you would find at a hibachi restaurant, which I absolutely love. Discovered this place on a whim one day and have been back several times. Also, the people watching is usually prime!"}
{"text":"Great selection of food, always pleased with the food, no complaints there.  Bathrooms do not have a baby changing area which is extremely fustrating.  Although the place is busy, the servers don't keep up with keeping the tables cleaned from dishes and keeping drinks full. Also on several occasions while eating there the staff doesn't pay attention and will walk into you and not say excuse me. That's rude. I would like to give 5 star but in fairness not having a place to change your baby is a big deal and servers who frequently bump into customers because they are simply not paying attention and not say anything to customer isn't good."}
{"text":"People can surprise you obviously. Looking at me you would not think that I know much. But If you dig dipper, I am pretty good at sign language and know a bit of German. My friend is fluent in several oriental dialects and languages. The staff make comments about you, and what was worse two of them were right next to our table when they said comments about my guest and myself. Not exactly the most comforting feeling. I would not go to a deaf person and gossip about the hearing because they don't understand sign; they should keep that away from the guests. Especially when a white person knows what they are saying"}
{"text":"Rarely am I this satisfied from a buffet and the shoe variety of options. Not only were there many things to choose from but the flavor of each item that I tried surpassed what I'd hoped for. Too often you find a buffet that goes the cheap route, or tastes like every other buffet. It is not to say that some of the food probably doesn't taste like everywhere else. A good standard is just that. But the sushi was fresh and phenomenal. The hibachi bar while there were not many choices for vegetables and meats was very satisfying and always enjoyable to watch. For my children it was great to see several American standards as well as the traditional fries and pizza and other fried goodies. Our chief complaint (and if this is all we could complain about then this is a great thing) was there was no crab Rangoon and my favorite type of dim sum was not available.   Price was very reasonable, just a dollar higher than the restaurant we often go to closer to my home, but the quality so out-shown that location it's a clear choice where to go next."}
{"text":"Goodbye Kumo ... Hello Fuji!!!  We were very impressed with this restaurant. The food were cooked fresh and that we had a lot of options. We were so full we didn't even get further out to the hibachi portion.   We definitely recommend this restaurant.   We will go here first before we step foot in Kumo again."}
{"text":"Buffets are good because they have a good selection of food for a good price.  Fuji Grill Buffet is a giant restaurant with a very large buffet area.  It's one of the largest I've seen in a good while.  You pay right up front which saves the hassle of waiting for a check when you're finished eating.  I don't usually rate buffets on how the service is because the staff is always running around because there are so many people.  I will say that the staff was pretty attentive for how large this restaurant is.  The restaurant is clean and so is the silverware and plates.  Even though they have a lot of traffic, you can tell they don't skip on cleanliness.    The sushi was wonderful, there were so many choices, far more than Kumo right across the street.  The hot dishes were pretty much like any Chinese buffet fare.  (I can't go to one of these places without getting a teriyaki chicken stick). They had noodles and hibachi that I didn't get to try, but I do plan on trying in the future.  They had a good dessert selection as well.  Lot's of ice cream to choose from.  Overall, this was a decent experience.  I"}
{"text":"Great selection. Pretty busy and crowded, but plenty of food nothing was empty. Noodle soup bar is a nice addition to the hibachi. Something like 8 buffet tables of options. Fried dumplings were good also bitesize crab rangoon"}
{"text":"Just ate out there for lunch with my mom and brother. The inside of this buffet reminds me of a buffet in South Korea."}
{"text":"Great food and service! A place you can enjoy food to a different level of satisfaction!"}
{"text":"6/5 stars if I could! Best ayce I've been to in the states :) They have a great selection of Chinese, American, Japanese food, sushi and sashimi, fresh veggies and fruit. Everything tasted really fresh and delicious- I particularly loved the sushi area: they even have so many different types of sashimi (salmon, egg, different types of tuna, etc/all fresh and delicious).  11/10 would recommend Fiji Grill Buffet! :)."}
{"text":"Good food. Can't imagine someone not liking something with such a larger variety! Lots of seating and clean place. Lunch until four is now up to $8.49?!  Only complaint is while at the buffet I asked a female worker were was the soy sauce and she turned her back to me, like she couldn't be bothered, mumbled on the table. Not very helpful, professional or nice."}
{"text":"I came here today with a friend after visiting Kumo across the street the week before. Kumo is better.  You pay when you come in like the old Hometown that used to be there. I like that. I bought, and received, a ginger ale.  When I needed a refill the server told me they don't have ginger ale, so she gave me water. So what the hell did I drink?  None of the sushi was labeled. Like not at all. I think that's a terrible idea. I liked this fried Cajun fish they had and when we were there every thing was getting changed, coming out fresh. This time all the fish wasn't cooked all the way through. Not good. All in all the selection is better at Kumo and idk if it's bigger but it seems more accessible. I'm sure I'll try this place again at some point maybe this was an off day.  Label your sushi."}
{"text":"When we first moved to the area, my husband and I began looking around at all the dining options near us. We were excited to find what we thought would be a great buffet, based off of reviews. To be honest, this was one of the worst dining experiences either of us have had to date.   To start, the service was extremely rude and barely present. I can honestly move on from that if the food is stellar. But, alas, it was not. We are huge fans of Asian cuisine, and we also like many American-Asian style dishes, and have had quite the variety across the US and internationally (including China, in my husband's case). Now, we weren't expecting fine dining from a buffet; they're usually like a Denny's-reliable and decent when you really want it. The food at Fuji though fell far short.   First, the bits I grabbed from various noodle and vegetable dishes tasted like they were cooked in dirty water. There was some sort of a grit to all of them. The flavor was not good, either. My husband went to the pho spot at the back and was not impressed with what he saw. Besides the pho itself, the young man attending the station was more concerned with his phone and was rude to my husband. FYI-While they say they can make you a vegetarian pho, it really isn't. They were cooking meat and seafood all in the same water as the vegetarian bowls. He's not a vegetarian, but if you are, BEWARE. Also beware if you are allergic to seafood or can't eat pork! My husband with the iron stomach will eat anything; but he wouldn't eat the pho. He said it tasted like mop water. It smelled pretty awful too, to be honest.   This was the very first time I've ever left a restaurant and not only did not leave a tip, but also left with lots of food on my plate. It was truly a horrible dining experience. We will not be back."}
{"text":"One of the better buffets in the area.  I wish they would have more vegetarian options, however.  The value is pretty great, but would love to see a little better variety for non-meat eaters."}
{"text":"Three solid stars for good variety and quality at a fair price. Much better than Kumo across the street.   Venue: Fuji is very large so regardless of your party size you are always seated right away. You pay first which is nice because you can just pig out and leave. Not much decor but it's a Chinese buffet so who cares..Place is very clean btw.   Service: I have only dined in for lunch but it still gets pretty crowded. Never had any complaints from the staff. They are always on point with the refills and clearing your table when you get up for more food.   Food: Compared to other buffets in the area, it's one of the bigger ones with more variety. You have your typical Chinese but they also have seafood, salad bar, dessert bar, soup station, \"American\" station, and Sushi/Hibachi. Quality of food is for the most part is pretty average."}
{"text":"No complaints,I was very impressed with everything.food was great,price was reasonable,nice updating inside. Much better than when it was Hometown.Nice and clean.friendly people."}
{"text":"Food did not appeal to me at all . No salt added to anything.  Maybe we came on a busy day , but was not satisfy from what I have read compared to what I had tasted."}
{"text":"Food was good for the price.   Could have been a little warmer.  4 of us went for dinner. We will be back.  Price is what we can afford. Thanks."}
{"text":"The food was great!  People very friendly and the place was clean. Huge selection of food. In my top 5 in the world. That's great!"}
{"text":"Horrible Place! They serve raw fried shrimp!!!!! And ignore my compalint!!!! They still have other costumers eat nasty food!!!"}
{"text":"Went for the first time today and it was great.. so many choices. I'm not a seafood/sushi person but that's all my friend who went with me got and he said it was very good. I had different kinds of chicken, ribs, and prime rib and all were good. Service was very friendly and quick in taking away plates and refilling drinks. It's a huge restaurant so I wouldn't imagine ever having to wait unless it was a holiday. They bring you fortune cookies towards the end of your meal.   You have to try their donuts for dessert as they were amazing! They also had 8 kinds of ice cream, cookies, pies, cakes, and fresh fruit but I didn't get any of that.   I will definitely be back here in the future."}
{"text":"This is the best Chinese buffet left in the area.  The Kalbi steak (dinner only and very popular) and Pho station are worth the visit.  Sushi is ok. They also have have stir fry.  People watching is a plus!"}
{"text":"Ate here again last night. The food was not good at all. I didn't like any thing I ate. It was all cold and had no taste. On top of it all my boyfriend and I have been sick all day today. Never going back here again. It seemed great at first, but the service continuously gets worse, the quality of the food is getting worse, and now the last two times we are here we both spend the next day sick."}
{"text":"I have to admit.. I can be a bit of a buffet snob.. Lol. Been to buffets around the I.E. in Cali. To the buffets of Vegas. Always been a sucker for choices, flavors and food safety. This place was very busy, bright, and had this aroma of come and eat.  The sushi.. Let me tell you.. Was errrmaahhgerd .. Like YUM. MADE FRESH !!  And offered different varieties. .. Now let me tell you about their HIBATCHI oooo food porn at its finest lol. They even offer you fresh udon and pho made the way you WANT. This place was busy.. Especially for Valentine's day.. We both still were seated quite quickly.  Dumplings, shu mai, sio pow, yes my asian favs were served here as well. Seriously made me feel at home. Food coma induced by the great tasting selections. Just didnt have room for deserts. Ooo well next time. Dinner for 2 was under $30. Not expensive at all. The people who eat here .. Aren't ghetto fab which is always good. So forget about hearing obnoxious people wild n out during your fat fest."}
{"text":"Against my better judgment we ate here again because my son likes the food, but I refuse to eat FILTHY SHRIMP.  To me, everything tastes the same and the choices never change.  He had to agree with me that the staff needs to step it up, be friendly to their customers, and make them feel welcome.  That's basic customer service!"}
{"text":"Was very excited about this place, heard a good review about it, and was told it was better than kumos (across the street, and happens to be my fav sushi bar) well I was very disappointed.   Yes, there was a lot of lunch choices which was great, but the food was very greasy and didn't sit well with me. Not a lot of choices for sushi either, if that's what you're going for. Not a great atmosphere either, although service was very pleasant.   Left feeling very sick, will definitely not be returning. If you're looking for a good seafood buffet, go across the street to kumos. You won't be disappointed."}
{"text":"4 stars for overall dining experience and food  5 stars if comparing to just  buffet style food  Fresh food, lots of selections from typical Chinese food staples to Hibachi to Sushi to even PHO...awesome   Staff are very friendly   Note: price is well worth it....$11.99 for dinner...but with the cheap price ...you will have to deal with some Ignorant , crass,  rude  people (fellow customers)...complaining loudly that the ice cream was \"too cold for my gums\"??? !?  Plenty of room...no wait on a busy Sunday"}
{"text":"What a wonderful buffet. The food was excellent and one of the best we have been too. Everything was fresh, wonderful flavor and a greAt variety. With the senior discount it is one we will return to often"}
{"text":"Extremely terrible service attitude Hibachi cook, rude and cursed at me when I didn't get my egg in fact I was going to stand back in line to wait for my friend. ???????????"}
{"text":"It's a Chinese buffet, a little below average in some aspects and above average in others. The sushi was very good and smaller than I'm used to, so that was good because I could try all of them, but the bbq ribs were inedible, they tasted freezer burned and I spit out the first bite.  On the plus side the fruit was sweet and ripe snd they had Lychee jello, even if they didn't have actual lychee."}
{"text":"I'd like to start the review with I'm not a fan of buffets, so this wouldn't normally be my choice cuisine.  A family member reserved a portion of the private room for a birthday celebration.  All-in-all, there is a large variety of offerings and the restaurant is clean and organized.  There is sushi, hibachi, asian, american, soup, salad and dessert.  The buffet stations were continuously re-plenished.  The items that I tried were mostly asian, and were on par with dining at a buffet.  There was nothing outstanding, not a whole lot of flavor.  I didn't really enjoy the sushi, but there is a large selection to choose from.  Value ($11) and selection rates 4 stars, but just not my type of cuisine."}
{"text":"MY NEW FAVORITE RESTAURANT! Everything here is good! The place is clean and well lit, and such a variety of food! My husband doesn't eat Chinese, but there are plenty of other selections, including chicken and prime rib!  By the way, The hot and sour soup is delicious!"}
{"text":"Buen buffet pero es la tercera ves que vengo y una comida en particular tiene un mal olor(dañado) la segunda ves se lo indique al camarero pero esta mi tercera ves continua oliendo mal! Opte por no comer ese alimento, de lo demas pues buen buffet! Dias especiales suele estar el rest lleno adi que vengan con tiempo!"}
{"text":"Went for lunch, honestly, about what you would expect from a typical Chinese buffet. Not great, not bad. Surprising, for some reason they were out of knives-heard another customer ask for one also. It wasn't very busy. Good service on refills, otherwise. Big place with a lot of space"}
{"text":"I Went here tonight with my cousins because we heard that it was new so we didn't go to kumo. We drove 40 minutes from Akron and found our that this place was horrible! We were denied service at the Hibachi because he said that we kept eating the Hibachi food! He threw my cousins plate to the side and refused to cook it! The cook was very rude and he had headphones in! Why is he even allowed to listen to music when working? How will he know how we want our food cooked? What kind of Buffet is it if we can not eat as much as we like??? I Paid 10.99 +tax and was told that this is all you can eat. We told the manager and he didn't do anything about it. He whispered something in Chinese to his wife when we complained. The waitress didn't even refill my drink! She gave us our fortune cookie when we were still eating. I would rather pay an extra 4 dollars to eat at kumos than to ever return to this place. I've never wrote a review about any restaurant BUT I want to save you guys a trip and 10.99+ tax.  YOU HAVE BEEN WARNED..."}
{"text":"Last year, I wrote a review, as an Asian food enthusiast, that Kumo was my extended family's favorite place to gather for a buffet meal. 7 weeks ago, Fuji opens right across the street. How quickly loyaties shift! Again, still not the biggest fan of buffets, but what's nice is that Fuji's menu is not your typical run of the mill Chinese buffet. They have a diverse variety of offerings, even slightly different from Kumo across the street. I was surprised to find that they have a Pho station, where you can put all the desired Pho ingredients on your plate, hand it to the soup chef, and wait while he blends it all in a pot for you. Granted, it wasn't the greatest bowl of pho I've ever had, but still... the first buffet I've ever been to that had 'make your own pho.' They literally have something for everyone to enjoy. The best part? Their pricing is a lot more wallet-friendly than Kumo! I could eat here nearly every day and not break the bank! Awesome! Found a new buffet home!"}
{"text":"Sweet baby Jesus, this place is ginormous! Talk about looks being deceiving....walking into this place was a complete shocker.  Not only are there hundreds of tables and 10 buffet lines, there are hundreds of people eating!   Now, I go into a buffet with an extremely low bar for quality. When you pay under $15 and can eat enough food to make you comatose, something's gotta give....and that's typically food quality or service....or both.   A few things to warn you about off the rip. Their dishwasher needs to be fired. Like right now. I must've gone through 10 plates to find one that wasn't covered in oil. I like slip and slides....but not at a buffet. Second, their bathroom was undeniably one of the dirtiest I have seen in recent years. The smell in there reminded me of the geriatric ward of a nursing home.   I must say this place has a rather nice aesthetic. Modern and updated and definitely not your typical Asian-style buffet. Setup more like cafeteria in the table aspect for sure, but the buffet area was well lit, well stocked and generally clean. I can tell they took some effort into food presentation and everything I tried was cooked properly, warm and had good flavor at its best and mediocre at its worst.  The sushi here was the mediocre portion. Rice was hard and the ingredients were just ok. They had a huge selection of sushi and some of the raw fish had a horrible coloring to it. The hibachi grill had minimal selections and what I got wasn't cooked very well. Veggies were hard and the flavor was meh.  I enjoyed the green beans, teriyaki chicken, chicken on a stick, mei-fun noodles and their fresh fruit was very sweet and very fresh. I made my rounds by rotating those selections. I don't do bread, so that cut out pretty much everything else. Their ice cream station was messy. Since it is self serve, all the flavors were mixed into one another.   The service here was very good. They were attentive in removing plates and also refills. Not the friendliest bunch, but I have yet to experience a cheerful wait staff at any buffet....much less an Asian buffet.   Parking here is plentiful and it is easy to get to. I won't come back here on my own volition....but my friends liked it so I'll be back."}
{"text":"The food was cold and not fresh at all the customer service was horrible they walk around and count your bits I would never go there ever again the one across the street called Kumo is realllllly good!"}
{"text":"This place was average. Buffet and a drink at dinner with a tip for one was $17. A bit pricey. This should not be one dollar sign imo."}
{"text":"This is hands down the best value for an Asian buffet. Lots of items to choose from and everything so far has been pretty good.   There's a good selection of Chinese staples such as fried rice, noodles, beef, fish and chicken, as well as a few dim sum to choose from. There's even American favorites such as ham, ribs, mac & cheese and mash. Good selection of sushi items and their fish quality isn't too bad for a buffet. Their selection of seafood includes mussels, shrimp, crayfish, and clams but doesn't include snow crab legs, however, for this price I don't expect that. There's also a hibachi grill and soup noodle station for udon and pho (which has gotten better)!   The biggest kicker for me is their crawfish! It's fresh and delicious every time! I can't think of a better place that offers AYCE crayfish. I've had this about a dozen times and it doesn't get old.  The staff is quite attentive with clearing out plates and refilling drinks. The place was never too crowded but there are times where there's a 20-30 min wait."}
{"text":"Pretty much any kinda of quality food you'd want, buffet style - and part of the buffet is a hibachi cook to order service! Sushi, fresh clams, lots of fish varieties, shrimp, crawfish.... And then lots of great offerings for non-fish eaters like braised beef, various kinds of chicken offerings... Sheesh they even have fried plantains!! Inexpensive prices for what you get. Clean spaces and good food. Aahhhh, Saturday afternoon the way it was meant to be!!"}
{"text":"Good but as I kept going it went down hill out of food empty trays not as clean but I have faith this place will step up its game don't go to close to closing time I think that was the problem lunch time was best"}
{"text":"Went again on Sunday March 26, got there just before noon to beat the crowd.  The sushi and sashimi was the best that I have ever tasted, I left a $10 tip for the crew.  They have a new tray of raw tuna with spicy mayo that is fantastic. The Dim Sum came out about 10 minutes after we got there, it was excellent.  The only items missing were the raw oysters and fried shrimp.  I wish that my stomach could hold as much food as it appears to from the outside."}
{"text":"The entrees are alittle \"meh\" but they have some bangin sushi! Which is actually better than what they have across the street."}
{"text":"Food looks great but disappointed. Everything was cold. My boyfriend went to talk to the manager about the situation,he was very hostile"}
{"text":"I live right down the street from this restaurant so i pop in every now and then its an okay place for a buffet i think there crab ragoon is probly the best thing but thats just me sometimes its just way to many people there somedays"}
{"text":"Worst buffet i've ever been to! Horrible service! We came an hour before closing and the young lady at the front was on her phone. Took her about a min or so to help us out. Then when she finally did, she looked like she was forced.  I also work in a food restaurant so i understand how they feel to have people come in last min, but c'mon we came an hour before closing. Like really? Might as well close earlier if you didn't want anymore customers?  Their sushi was good but i wish they label them. Other selections of food was okay.. nothing special. They looked liked they sat their for awhile. I was so excited to try their salt n pepper shrimps but turned out to be really gross. Like super dry & old.  Only good things are.. place is big, cheap prices & sushi aren't so bad. Everything else are a no no. Never coming back for sure."}
{"text":"Refreshing new Chinese/Japanese buffet in the Parma area. Price is very affordable, even cheaper than all the competition nearby, and food quality so far petty good. They have a very large selection of Asian cuisine as well as a small section with regular home style food like roast beef and mashed potatoes. They have a decent sized sushi bar with very fresh sushi. Also, as if all the selection isn't enough they also have a soup section with about five different soups. My one complaint was about the crab legs. I love crab legs but theirs were a little bit disappointing. Somehow some of the legs were empty once I cracked them open(with my bare hands because they didn't have the special shell cracking nutcracker tool).  In general a great experience for a Chinese buffet.  Not your five star restaurant experience but very satisfactory."}
{"text":"One of the better buffets in the area. I am sure that the people over at Kumo are worried, as this place is a little cheaper, but offers the same, if not better, quality food.   There is a wide range of buffet food here, not just your typical offerings. Sushi, Pho, and Mongolian grill. I agree with other reviews that there are too many American offerings.That's the absolute last thing I want to see at an Asian buffet. Stop catering to fat, unadventurous Americans!  Staff is awesome! Very attentive and great with the kids. Place is very clean. Like brand new clean. Which is not something one could say about the former business at this location."}
{"text":"Pro: large selection of items.  Cons: marginal quality and I almost didn't make it home in time, if you catch my drift.  If it wasn't for my daughter, who loves Chinese buffets, I would just give up."}
{"text":"Whenever my BF and I are craving Chinese food, (which is quite often for us), this is the place we go to. I wouldn't call it the best Chinese food Ive ever had, but for the price the quality is great, the selection is large, and we always leave happy and too full."}
{"text":"Meh.  I have tried both Kumo across the street and this place. Personally, I recommend Kumo. Here is my personal breakdown :)  Atmosphere: equal - both have an atmosphere that you would expect from a Chinese buffet. I would  call it stripped down and modern.  Service: Kumo - The servers at Fuji obviously hate their life. They definitely didn't want to be there.  The guy at the front was pretty rude also.  Sushi: Kumo - more variety, better flavor, fresher taste  Sashimi: Fuji - if you only like sashimi go to Fuji! The sashimi here is definitely worth the entrance fee, I absolutely loved it!!  \"American\" food - Fuji has a nice selection. If you're going with your kids or your grandma or just some little nut who doesn't like sushi, Fuji has a better selection of American choices. They had pizza, chicken fingers, fries and a few other options that Kumo does not.  Beverages - Kumo - they have beer and wine, Fuji did not have any alcohol to my knowledge. Also, the guy at the front MADE me pick a drink...I just wanted seltzer water. Their unsweetened iced tea was good tho ;)  Cleanliness - equal. Both places are very clean and I don't worry about eating there."}
{"text":"Ate there the other day with my husband and two kids. There were plenty of food options, but the food was horrendous. One of the worst Chinese buffets we've been to. Even the kids were turned off."}
{"text":"I have been here 2x. This place was good considering the price point.  The only thing to compare in the Cleveland  is Kumo. And considering Kumo is 5 or 6$ more than this place is a no brainer. Sushi was decent, just as good as Kumo, maybe even better. I did ask them to make me something and they did not.  The oyster s were good and pleantiful, however could have been cleaned better. Shashimi was always filled, and their sushi was not playing the game of let's rice these rolls up so you have to pick it off.  Typical Chinese, Americanized Chinese, fresh and not to greasey. My only gripe is they could have more seafood dishes.  The hibachi and pho stations impressed. The night we went the pho broth was really good, like stupid good. The hibachi was prepared really well. I got my shellfish buzz from that station. Flavorful and not drenched in oil.  I really see no reason to go to Kumo, beg for sashimi, oysters, and fight over cold snow crab, when I can get the same or better right across the street for 35% less yuan."}
{"text":"This place has unseated Kumo as the go-to Asian buffet. They offer almost everything Kumo does with better quality at a lower price. It's a no brainer.  I've been a loyal customer to Kumo since they opened, and they know my family well, but I'll be the first to admit they've fallen.  Fuji is my shiznit."}
{"text":"My son was excited to try the new sushi buffet close to our house. I was surprised that an 11 year old was the same as adult price. The place was pretty empty but it was opening week. The hibachi vegetables were onions and broccoli. That's it. I tried to use the yum yum sauce even though the bottle looked like it hadn't been cleaned in years and the top fell off into my food. Sushi was completely tasteless. The deserts were the worst imaginable cheap crap you find at the worst Chinese buffets.  The other items we tried were hit or miss. Must have been sitting there since lunchtime. We will definitely not be going back. Wish I could leave zero stars."}
{"text":"HUGE variety of food I have ever seen at a Buffet!  Has sushi, pho soup, Mongolian grill and more.  The seafood is abundant and they even have pizza for kids who don't like much else.  Always packed when we go.  Reasonable price for dinner.  Worrh giving a try!"}
{"text":"Good food, lots of varieties. Price was ok but I wish they had self service drink section. Was uncomfortable to ask every time for waiter to get my drink refilled."}
{"text":"They had allot of options that I would not expect like baked sweet potato, fried plantains and 5 soup options....sadly none was miso but oh well. They also have 8 flavors or ice cream, true butter pecan was super delicious."}
{"text":"3 is generous and mostly due to the variety and some of the fresh seafood and the price. Really more like a 2.5. The cooked food was greasy and too sweet for the most part. Anything with cooked seafood tasted fishy and off. At least we didn't get sick- the place was clean. Not going back."}
{"text":"Not my favorite place and the food wasn't amazing. There was juice stains on my cup and I had water on it. The rice was way too yellow. Other than that. It wasn't crowded but the party room was way too small."}
{"text":"Lets just say for the price I don't think you can beat it.  10 for seniors/elderly, and 11 for adults and kids eat on the cheap as well 3-4.  I'd say my favorite item was the Korean Kalbi short ribs even though you have to wait cause it goes quick!  A lot of things ranged from that taste ok and I'd eat it again to.. yuk what was that! But there were only two things I thought were unexpected.  Good news is there are plenty of other things that made up for it.  Kumo which is across the street has to either get their pricing together or they will soon find themselves out of business."}
{"text":"It was Eh, not great and not horrible. I've been to better and I've been to worse. Both my husband and I feel this way. If you love sushi, they have an assortment of it and you can definitely eat $11 worth (adult buffet price)  They charge you for a beverage so be prepared to pay $2 for that, unless you have water like we did."}
{"text":"Not the best, not the worst. I'm vegetarian and was disappointed too see only one vegetable sushi. Only a handful of meatless dishes. My advice if youre veg is to go at lunch when its cheaper so you get your monies worth."}
{"text":"I miss Fuji and have only been once, but I am definitely going back on every Cleveland trip I have.  I was not expecting much for the price I paid, but under $15 for an adult with great sashimi, hibachi, AND a noodle soup section? Damn son.  I had a plate full of salmon sashimi and it didn't make me sick. The sushi was good too, and I went back so much that one of the sushi chefs made me a temaki with huge slabs of unagi, salmon, and avocado. Yum.  The clams and other seafood selections were good too. For a buffet, the pho was pretty good. The udon uses the same pho broth so it was a bit weird for me. Hibachi grill was good too. Just try to use the right noodles because if you use the frozen udon noodles meant for soup, the chef will throw it back on the pile.   I miss Fuji. Would love it if a similar buffet with the same price opened up in Chicago! Seriously, the best value Chinese/Japanese/Viet? buffet."}
{"text":"I have to agree with a lot of the reviews here about the customer service...it's horrible!  When you are greeting your guests and walking them to your table, get off your damn phone.  I've never encountered such rude service in my life and it doesn't stop there. The food was actually ok, however when you are asked what kind of sauce you want for your hibachi meal and you tell them Teriyaki, it is very rude to mock them as they are walking away when that person can clearly hear you.  It seems that everyone who works here hates it.  We all have to work, it sucks, but when you are in customer service, your main goal in the business is to please the customer so that they come back.  Guess what?  I'm  never coming back....the only reason I didn't give them a one star is because the food is actually pretty decent."}
{"text":"I do like this place and go here often. Food isnt bad. Only complaint is they are always out of my favorite think. Kalbi steak!!!!!!"}
{"text":"This is a really good buffet. Plain and simple. Sushi, Hibachi, & broth/soba/pho bowls are made fresh in front of you. Everything is filled quickly and kept clean. Usually five soups to choose from and a huge ice cream and dessert bar. I gave four stars because they have such a typical buffet bathroom it's like golden coral all over again. I'd wait to use it. Otherwise A+"}
{"text":"I've been here multiple times and it amazes me how I still haven't tried everything they have to offer. They have so many different choices of foods! It all tastes so good too. I have never been disappointed when I go here. Their sushi is great, staff is friendly, and they have a nice environment. I highly recommend if you are looking into trying a new buffet."}
{"text":"Wish I could review the food here, but when we arrived we were told that there would be an extra charge for the holiday (Father's Day). I totally understand that for the staff it can be incredibly crummy to have to work the holidays, and I would absolutely understand and have no problem if the restaurant was closed for the day, but if you are going to stay open then I think it's  unreasonable to charge extra --- to the tune of almost half of the price of the entire meal itself.  Their prices are listed on their website but this \"holiday pricing\" wasn't mentioned anywhere, and if it had been we wouldn't have bothered. Honestly it's only a couple of bucks, but it really just rubs me the wrong way."}
{"text":"This was the grand opening weekend for Fuji Grill Buffet in the Midtown Plaza in Parma.  I hate to give a bad review on a place that has just opened and hasn't worked out any of its kinks yet, but this place has some issues.  First of all, there are no prices posted anywhere.  Not a big deal, but you have to ask, as you pay before you are seated.  One of the 2 hostesses was wearing flip flops.  I don't care how cute your pedicure is, if you're working anywhere near my food, I don't want to be looking at your bare feet.  I'm not sure how to word this next part.  I know that restaurant work of any kind is hard, and maybe it had been a long day for all of the staff.  That being said, most, but not all of the staff didn't look very clean to me.  Here again, maybe it being the grand opening everyone was just exhausted and dirty from working so hard.  The decorating and atmosphere were as bland as the food.  There was almost nothing to the surroundings that hinted of Asian dining.  Staff stood at the periphery, staring at the eating customers.  Way too much of the food was American.  I expect there to be some American at a buffet place like this to appease picky eaters, but this place was about 50/50 as far as the actual buffet tables.  None of the dressings were labeled at the salad table.  Only one dressing looked to be an Asian-influence recipe - everything else was typical American stuff.  The soup area is a disaster waiting to happen.  Seriously, someone is going to get hurt if they don't change that up fast.  Giant vats of soup on a ledge that is just barely 2 foot tall, and those vats were very close to the edge.  It is just going to take one inquisitive 6 year old. or an elderly person with bad balance, and we are talking some 2nd to 3rd degree burns that will be happening.  My husband and I had the hot & sour soup.  It was a gelatinous, bland bowl of yuck.  I opened the lid labeled \"Seafood Soup\", and the smell was overpowering.  I closed the lid and moved on.  At the ice cream area, there wasn't one of those little wells with the running water to put the scoops in to keep them clean.  My hands were covered in ice cream after scooping myself a small bowl.  It's baffling to me that the ice cream would be kept up high and safe, while the boiling soup kettles are kept low and precariously positioned.  I did not like the food.  I felt it was bland, dry, and of low quality. All of my selections were from the buffet tables, and I did not try the sushi or the hibachi stuff.  My husband said that he was happy with what he got - a honey chicken and a whitefish.  I found it odd that there was no vat of the special soy sauce used specifically for sushi anywhere to be found.  There also was no sliced ginger (unless it was somewhere I didn't see), and none of those little sauce holders you see at most places serving sushi.  There were little plastic disposable type cups available, though.  I'm giving a 2 star rating instead of a 1 because my husband was happier with his food than I was, the restaurant was clean (buffet table ledges wiped down, floors were kept up with, ladies restroom was stocked and clean), and the person who waited our table was very nice."}
{"text":"There was a hair in my fruit plate but that's ok, I just got.... another plate of something else, hmm... The pho was fishier than usual because I put octopus in it. But the sushi was still good here. I'm surprised by this visit but only mildly."}
{"text":"We never ever go to a buffet because I am always afraid of the freshness and quality of the food you get at them. But we heard about this place and decided to give it a try.   Well..... our buffet fears were unfounded. Fuji's food was fresh, delicious and the variety was fantastic. It was well above average and the price was outstanding. They have a happy hour special for seniors that is $6.99 including your drink. You can't beat that! Regular adult price is only $7.99 for lunch and $10.99 for dinner, but still a bargain.   What is great is that they also have a Hibachi Menu. You pick out what you want and they cook it in front of you. It includes beef steak, chicken, shrimp, crabmeat and fresh vegetables, rice and noodles.   They also have outstanding sushi. No fishy, slimy taste that can come from old sushi that has been sitting around. They make it in front of you with a large selection of specialty rolls. Their sushi rolls are fresh with quality ingredients. We were pleasantly surprised. We will definitely return."}
{"text":"Many options to choose from. Good sushi selection and fresh. Reasonably priced. Plenty of seating. You won't leave hungry!"}
{"text":"Came here by accident. Wish we had turned around. The place is very dated inside. The food was mediocre at best. The hibachi chef was no where to be found, although i believe there selection was better, the cook top he was using needed to be cleaned. The food tasted like dirty oil and i couldn't eat it. The sushi was standard for buffet sushi, it didn't stand out even though it is the focal point of this place. The buffet food in general was sub par for buffet food. Price was a bit on the high end for the quality(i know its a chinese buffet, im not expecting world class food) Wont be back."}
{"text":"Wanting to try something different, signage is very deceiving first sign says beverage included was charged for drink then was explained, I don't mind paying for my pop, but at least come bring me a refill I shouldn't have to ask the waitress, she saw my drink 3/4's gone she should have brought one over or took my cup & refilled it, what I really enjoyed was the pepper steak w/onions, fried rice was really good, I was surprised they had riped plantains oh how I loved them.      My other gripe is I saw the waitress wipe the bottom of her shoes with the rag she uses to wipe tables off then put it back on the counter to use again but the other waitress caught her told her something in their native tongue threw it away, had she did that.     Well for the food it was mediocre at best, would I go back? No, I should've went with my gut instinct on this but oh well lesson learned..."}
{"text":"The food is good and their line usually moves fast.  Even with the line all the way back to the  doors we have never waited more than 30 minutes to be seated.  The have a descent combination of Japanese, Chinese and American buffet.  They surprisingly have really good pork ribs.  Reasonable price to take a family as well.  Staff is well mannered and dressed.  On the down side there are a couple of items on their buffet that are not always available."}
{"text":"Huge dinner buffet, a little bit of everything.  Sushi, Japanese items, Chinese items.  Plenty to choose from, all seemed hot and fresh.  Recommended."}
{"text":"Buffet lunch here on business in Cleveland. $8.95 lunch buffet. Huge selection of sushi but on par w a buffet type taste. Lots of rice, mayo and sweet sauce. They had clams and mussels in brown sauce and fried shrimp, along w boiled shrimp. A lot of fried foods... not much fresh vegi like dishes. They did have the make your own hibachi type station. There were 4 soups to choose. Oddly nothing spicy. Lots of teriyaki chicken, fake crab this and that.   3-Cleanliness 2-Quality of food 3- quantity of selection- no spice 3-price for buffet  I won't be back but fits the public who want large selection of fried, low cost food."}
{"text":"Large facility..plenty of seating. Variety of dishes for a big place is descent.  The Amercian Chinese dishes were good and plenty. Regularly serviced. However, i did notice the steak a while to get stocked. Seems when the kalbi steak is stocked..its more korean bbq sliced. The self serve ice cream section had a lot of traffic. One thing threw me off, the sushi wasn't labeled and some of it looked sloppy. Nice price for adult dinner 10.99. With a drink and tax 14.02. Waaaaaaaay cheaper and worth the trip. Belly full and satisfied!! What could be better??? I think the sushi area and have that steak ready (not the prime steak)."}
{"text":"I loved the food here and thought it had well above average selection for a chinese buffet. It was very reasonably priced at 12$ a person including soda. I particularly liked the steak options and the chicken on a stick.  The only thing preventing a 5 star rating is the feeling I got in my stomach before I even left the restaurant. Probably my fault as I definitely overate, but I was on the ivory throne for 20 min mere minutes after finishing my food."}
{"text":"Great value. Food is good, has a wide variety. Like the hibachi and noodle soup bar."}
{"text":"Service was rude and an employee coughed up flem into a garbage can in front of or table. My whole family was really put off by that. They had almost no sushi at the sushi bar! Go to Kumo across the street! Way better :-/"}
{"text":"DO NOT EAT HERE! The most disturbing experience ever. Paid about $75 and only ate a piece of fruit before I couldn't take it anymore. My party of 5 was seated near the back of the restaurant, right next to a group that included roughly 7 toddlers/kids and two very inattentive adults. My chair was bumped about 10 times in 10 minutes before I had to move so close to the table that my chest was touching the table. The adults from the table continuously left the kids at the table and the kids were throwing the food towards our table, one of the little girls was spitting the food out and eating it again. The larger adult had her shirt up and belly exposed. The adults were very loud and every other words was a curse word directed towards the children. The entire scene was stomach turning and my entire party lost our appetites. At this point I was fed up so I walked to the cashiers desk and waited patiently for one of the workers to get off of her cell phone, she ended her call and I politely requested to speak to the manager. When he came to the desk I explained how awful our experience was and was told by the manager/owner that we should have expected the people from the other party to act in such a way because it's a buffet. He quickly noticed that I was not going to settle for that sorry excuse, so he went to the waitress to get a copy of the receipt. The waitress went to the table and snatched the receipt off of the table. He returned back the desk, where I was waiting and proceeded to tell me that he could not give me my money back because we were in the restaurant for longer than 20 minutes. I offered to pay for the drinks but the plates of uneaten food was still on the table so it didn't make sense to pay for food that was barely touched but he said no because it's a buffet. He then said that if I wanted my money back I needed to call the police. -_-! He then rudely told me to move to the side so he could take care of the other customers behind me. I ended up leaving the restaurant with only 50% of my money back and 5 empty stomachs. I will never come back to this place. I should have stuck with my normal buffet that is located across the street."}
{"text":"Pretty good , lots of choices and variety.  Seemed a bit on the dirty side, but nothing too terrible.  I don't like that you have to wait for drink refills, and I'm a little sketchy on the bright yellow fried rice, though the flavor was ok.  Pros were the hibachi area and the bomb ice cream."}
{"text":"Most def love it! It's clean it's tasty! Get there if you haven't..Fruit is always fresh food is always great!!.. Only thing I didn't like was this waiter changes napkin despencers when your eating And will reach right over your plate...Plus they don't have crab legs"}
{"text":"WOW! WOW! WOW! WOW! WOW! WOW! Ok now that I got that out of the way, lets get on to the review. My family visited this place when it first opened and they said that it was pretty quiet and not a lot of people in the restaurant. I thought to myself \"yeah mom because it's probably dirty and the food is probably all fried with a bunch of crazy sauces.\" So when my parents suggested I go with them this past weekend to try it, I wanted to go in with an open mind.   An open mind was not needed after walking into the place. The first thing you see is modern decor and warm colors. You are greeted by a friendly face where you pay before eating. A hostess asked us where we wanted to sit (nice gesture). Our table was clean and the atmosphere of the place was great. Very modern, warm and clean. There are big TVs on either side which make it nice to watch some news or sports.   There is so much food and so much variety that I didn't know where to begin. I saw sushi, hibachi , coconut shrimp, soups, ice creams, broccoli salad, lo mein and the list goes on and on. I wanted everything. I knew I needed to be strategic of what I got so I just got a little of everything that looked good. Oh the mussels, yes they looked good.   We usually go to Kumo, and I'm sure we will continue to go there too but this place is pretty awesome and for the price you can't beat it. We are a huge Romanian-American Chinese and Japanese eating family so Kumo and this place will definitely be visited often, very often."}
{"text":"Visited Fuji buffet with the family this past weekend.  I was not impressed, but my wife was, so I'm giving three stars.  Items that stood out in my mind: baked fish, salmon, sushi, chicken on a stick, and ice tapioca pudding.  All of these items were pretty decent, but most of the other stuff was over steamed, like the green beans.  I find that this restaurant lacks passion.  Honestly, I'd rather go across the street to Kumo, but again, my wife liked it.  My kids didn't complain either.  The waitress offered to refill my drink when we were leaving, which didn't help my empty cup and dry mouth throughout the meal.  They also had a small American fare offering, but it was unremarkable and very over cooked, so I skipped that.    I liked the sushi, but again, not as good as Kumo.  Not sure that we'll be back, even though it was a couple bucks cheaper than Kumo."}
{"text":"Excellent food for a buffet. Food was really fresh, specially the sushi. Hibachi to order, even had Pho. Very impressed with staff as well, prompt and courteous."}
{"text":"The WORST buffet! The RUDEST employees!!! RUINED my road trip!!! Pls remember DO NOT refill more than 3 times here, otherwise the employee will say: YOU ARE NOT WELCOME HERE!!! when you leave!!! Yeah, it happened to me and my friends today! TERRIBLE experience! Actually we just passed through there and wanted to find a place to have lunch."}
{"text":"We used to go across the street to Kumo semi regularly. There's nothing wrong over there, but since we discovered Fuji we've been regulars. We're there at least weekly for lunch, and probably monthly for dinner. The food is better and more affordable.   The food at Fuji has always been fresh and there's a great selection. I can't stand seafood, but my husband loves it. There's plenty of options for both of us to be satisfied. On Sundays they have dim sum on top of the hibachi, sushi, and regular offerings. They even have decent \"American\" options for those who want that (kids, picky adults?). And the desserts are better than any of the other Asian buffets I've been to, and even most American food buffets!   It's always been clean, the staff seems nice.   My only complaint is that they have the freezer soooo cold it's quite difficult to get ice cream scooped out. But really, that's not THAT big of a deal."}
{"text":"Not great as Kumo plus beware of the chicken wings. I took a bite  into a chicken wing and saw that it was still raw. I told the waitress about but I think she didn't understand what I was saying. Once I show her the raw chicken wings then she got the point. Everything was plain but the crawfish was good. Would I tell my friends about coming here? Yeah, I would tell them the experience to avoid food poisoning."}
{"text":"Fuji is changing the sushi buffet game. It was a very bold move to open a restaurant that rivals the sushi buffet juggernaut Kumo which is directly across the street. I saw pictures posted on this here website and decided that I needed to try it. The nigiri really drew me in. The interior is modern. Guests pay before eating. I always find it weird to tip before eating. I don't skimp so I don't trip on that. They can see upfront that I am a stand up dude regardless of service level. I don't think I am better than anyone, let alone the dead fish I prepared myself to eat. They have made-to-order hibachi as well. I cannot speak on that but my friend said the quality was good. They offer food to go by the pound. $3.99 for regular land animal type food, $4.99 for seafood. My friend Tuni with whom I have the pleasure of lunching with around town texted me with an update today. His to-go hibachi order was $3.69 for a full Styrofoam container. He said they also have a pho bar which I am highly skeptical about. A pho bar could be FUBAR."}
{"text":"I see fat people.  It's a buffet, what can I say.  Food a plenty and priced cheap.  They have a large variety of food from sushi to Mac and cheese and everything in between.  I would come here again."}
{"text":"Sunday fully jam packed, and still some old food. Honestly I believe that they did a positive marketing campaign to boost good reviews... this place sucks"}
{"text":"The place is very nice, food fresh and good!!! It does seem even more Americanized than a typical Chinese buffet. But they do have sushi and other Chinese soups to make up for not having as many Chinese dish items. So clean and neat, the price is very decent! Definitely will return!!!"}
{"text":"I've always enjoyed this place. Food is tasty, and the prices are reasonable. If I've ever had a reason to complain, it's usually due to another customer not having any common sense or manners...never the staff or the quality of food. If you're looking for cheap buffet food that's of good quality and flavor, I'd choose this over the Golden Corral not too far from here."}
{"text":"I'm usually not a fan of Chinese/Japanese buffets but this place was very good. Everything I ate was delicious and obviously fresh. I found it kind of weird though that we had to pay in advance. I've never seen that done anywhere else."}
{"text":"Went here tonight. It's in the former old country buffet. Huge variety. Full salad bar with lots of options, make it yourself pho and make it yourself hibachi. Lots of typical buffet food and also an American section. There were baked sweet potatoes which I thought was great. The staff were friendly but also mostly young and focused on their phones. The guy cooking the hibachi was texting on his phone the entire time. But the variety of food, the quality and price make up for the staff."}
{"text":"Everything was just O.K., many of the selections were not hot, the buffet plates were wet,and the waiter gave me a refill of my iced tea without any ice in the glass!  Best part was the sushi.  Unsure if I will return."}
{"text":"West side Asian buffet eaters, Kumo is now in second place. Fuji has one upped you and to pour salt on the wound is directly across from you. Typical Asian favorites: chicken beef and fish in Asian sauces, but what knocked my boots was their hibachi and pho section. I was real impressed with their pho broth. Also has AYCE sushi, sashimi and oysters ! Not too shabby for 7.99 adult lunch or 10.99 dinner 7 days a week. Place is nice and clean and extremely spacious for big groups"}
