{"text":"I went to fusion for the first time yesterday and I have to say that I'll be going there a lot. As soon as you enter you'll know that the place is happening. Fusion has great ambiance and the service is just excellent. Out of the very big menu of sheesha flavours, you find what you'll like and even if you are doing sheesha for the first time, you can't go wrong with anything you pick. Everything works out so great when you combine their amazing sheesha with their top notch food and impressive service. Definitely recommended this place for sheesha fans and to anyone who wants to try it out."}
{"text":"This place is really packed and have to wait for a bit for seating. Service was good because every once in awhile server would come by and ask if anything is needed. Price is good for hookah and also they offer ice pipe which is nice to have sometimes. The lighting and ventilation could be better."}
{"text":"Been to this place a few times. It's a little far for Missisauga dwellers but Bramptonites are always filling up this lounge. Culture here is laid back and somewhat stylish. 

Seating arrangements are decent. There's tables, booths and leather couches. Dimmer spot lights. Music is same shitty hiphop played everywhere. 

Food is decent. Tried the Jalapeno burger and the shawerma. Burger and fries were great, shawerma was undercooked. They serve decent drinks but no alcohol.

Shisha is somewhat inconsistent but usually done right compared to others in the area. Pan Rasna flavour is incredible and they always pack that one right. I'd highly recommend it. 

For the prices, this place is great and since its open late I'll definately be back many times for the shisha."}
{"text":"I've been to a lot of sheesha lounges but this place is one of the few that have very good service and a nice environment (TV's and video games, good music) to kick back with friends and enjoy some great food and sheesha. The sheesha is amazing and for the price it's a steal. I tried paan flavored sheesha here for the first time and it was amazing. They have a nice selection of food and drinks that I'm sure appeals to a lot of people and their desserts selection is nice. Would definitely recommend to everyone!"}
{"text":"Shisha is amazing, they make good shisha, food average at best, vibe?... well it's mostly guys that come to this place and it's more or less a Loud environment it's okay if you're chilling wit your boys but there's too many cocky guys in this lounge who act up. Frustrating to deal with. Don't bring a girl here you'll have all these dudes staring at her. Good shisha food alright staff ? The young guys are chill the one older guy wit glasses sometimes he's not too nice . I come here all the time love the shisha ."}
{"text":"Seems like a lot of Sheesha lounges are popping up in Mississauga! I received an invite to the grand opening (they have a Facebook page). Just dropped by with a friend on their grand opening night which was this passed Friday. The overall experience was very good as I feel that most of the sheesha lounges here in Mississauga seem to feel just too unapproachable in some senses, but there was a good balance in the atmosphere here! It wasn't too relaxed to the point that you felt like you're settling for just about anything when going out for sheesha (no usual messes like dirty floors and lack of walking space, ew.) and it wasn't too unapproachable so you would feel pretty comfortable walking in wearing whatever you threw on earlier in the day. The night seemed pretty busy, but luckily the wait was relatively short as people were served pretty quick and service was warm and enthusiastic and that is always greatly appreciated! I asked for the server's recommendation when it came to their variety of sheesha when I was informed that the top-selling sheesha flavor of the night was \"Mint Paan\" which my friend and I ended up ordering and the price was reasonable ($10). My friend seemed to be pretty amused since we usually stuck with regular flavours that are more readily available like lemon-mint so this change was exciting and we both enjoyed. Food was not too bad, but what really made it for me (quite weirdly) was their dessert, specifically their Crème brûlée. WHO could have guessed that a sheesha bar would serve up the most perfect, creamy, non-eggy textured Crème brûlée...?! I have been to various restaurants in Toronto that serve up this classic dessert and they have yet to match the consistency of the crème brûlée that is served over here! I only wish they would use real vanilla bean, but that's just me being picky because the flavour and texture was spot on, yum. Another interesting thing that I noticed was that the music wasn't the typical kind that you tend to hear at most hookah bars (not too loud arabic music). They actually had a variety ranging from Romanian house music to the current radio favourites. All in all, I felt they had most of the things I was looking for, good music, great service carried out by informed servers that check up on you, good food, delicious desserts and quite a unique variety of sheesha flavours to choose from!"}
{"text":"It's a great place to chill and have fun.

The shisha is amazing.

I just wish they would change up the lighting as the lighting makes the place alittle too dark."}
{"text":"This place was a horrible experience for many reasons and would never return here, even if I was paid to do so.
1) the ambiance is dingy and unpleasant
2) the shisha flavours are horrible. We asked them to change the flavour because it tasted bad and they made us pay for another shisha.
3) the tea we ordered tasted horrible
4) it took 25 mins to get our shisha. When we went to ask the server, it was sitting on the side
5) service was unpleasant and server was impatient with us

Given the abundance of alternative shisha lounges in the area this is a no-go!"}
{"text":"Fusion lounge, service not so good; they made us wait so long to order our shisha & then they took forever to bring our shisha  the jasmine tea is good butttt they bought it out almost cold  I must say they have a great Hummus tho IF YOUR THERE U GOTTA TRY THE   HUMMUS! 
If your a group of guys who are looking to chill, well this is the right place for ya not a place where a girl would enjoy much.... 
Ps looks like there's a lot of underages in there butttt it just looks like, I ain't no one to check that place out"}
{"text":"Found this shisha place on yelp and decided to give it a try. I have been to pretty much all shisha lounges in Mississauga and GTA and this is now my favorite!

Most importantly, the shisha here is fantastic. This is probably the only place that serves Afzal shisha flavors. That means if you like paan, you can smoke it here!

Service is great and crowd is decent too.

Good job guys!"}
{"text":"Not Bad!
It's been eons since I've stepped into a Hookah Bar. I've been to a variety ranging from the old Aladdin's in Mississauga, to Café Awtash downtown. Fusion Lounge, although located in the middle of no-where is as low-key as the location. 

There is no required dress code, people came here for comfort and lounging so don't worry about digging up those nice shoes or shirt. 

Prices were very reasonable and if you're coming with a group, its even more affordable because you can share and try different flavours. 

Unfortunately I didn't try the food, but in passing of other people's tables I saw some of the dishes and they looked well presented. 

The only thing that was sort of a downer was the service, during ordering it was often rushed.. The server would take an order and not take much concern for other peoples order at the table.
This may have been because it was really packed in here! 

I would return again!"}
{"text":"As the rating says I've experienced better. 

Although the place is jam packed, I was not impressed with the restaurant. I don't like closed-in Shisha places as you need proper ventilation to be able to enjoy the time over at the place. 

We tried 3 Shishas - Paan Grape, Cloude 9 (pomegranate, Kiwi & mint), Boom Mix (blueberry, lemon & mint) - all of them were average and quick to burn out.

Foodwise, we ordered the Nachos and Mint tea. The Nachos were dry and the tea didn't have any mint in it but was simple green tea not even mixed properly. 

The service was okay."}
{"text":"Love fusion shisha specially paan kiwi with ice pipe amazing!!!!!! Food is fineee. But too much of waiting line if u come late at night . Interior is pretty decent. Good spot to chill with your friends."}
{"text":"I am at fusion right now. The people are absolute assholes. Eminem's dad left him with a whore, and these people are still worse than him. We asked for them to reserve a table for 8, they said yes. Upon our arrival these bastards informed us that it is walk-in only and that there are no reservations. Not only that, we were also never asked for our order and they treated us worse than MJ treated 10 year old adolescent boys. The place is tiny, there are no recreational activities. This boy that looks like a 9 year old on steroids mocked us for getting pissed for the bad service. Michael Jackson, if you're out there, I have a 9 year old man child for you ready to be raped. Please avoid going here at all costs. The shisha is dirt cheap, probably because it is comparable to smoking dogshit. Even yelp said to me that I wrote the pants off this review. They're saluting me as I speak. Trust this review, trust me: don't come here. BEWARE OF THE MANCHILD. best regards to you and hope you are not abused by this lounge as we have.

Burhan Syed"}
{"text":"Went to this place last weekend. The sheesha is great,  but definitely agree with the others on the very slow service. Service is so slow to the point where we had to go remind them of our order at the front desk every 5 minutes. Most of their employees seem very lazy and one of them was probably stoned."}
{"text":"Been coming here for a few years before the big renovation, with the new Reno fusion looks so much more upscale and has a chill vibe, amazing shisha menu, food is mediocre so if you're just looking for dinner I give that 3 stars! Service is good for the most part but you usually have to let them know more than once if you want something extra like sauce or drinks."}
{"text":"Somehow stumbled upon this place on the day of their soft open. At first we thought it was a little sketchy but it quickly became clear this was because the place was still being set up!

Glad to have a shisha bar in this area of Peel finally.  Our server was happy to recommend some interesting flavours and to explain how the coals works since we were kind of beginners at this. Customer service was great, we felt really welcome.

Place has a really cool atmosphere and I look forward to coming back."}
{"text":"Great shisha, friendly service. Over 30 flavours for shisha, an incredible food menu including starters, sandwiches, platters, desserts and smoothies. 

Their paan flavour is definitely recommended! I tried the Fusion ice with the ice pipe. 

They also now have an option of adding ice cubes and mint leaves to the shisha to enhance the flavour. 

Definitely worth checking out!"}
{"text":"Shisha bars are typically low end type of places but I found this place to be especially boring and dreary.  

The booth we were placed in was awkward and seated in wooden patio fencing on boarded seats with dusty cigarette burned cushions.  TV was playing sports on all units and the only PS4 in sight was taken up with no possibility it seemed that staff would help with cooperation like at other establishment that try to get everyone included.  

Dimly lit and dingey. 

Ordered nachos... cheese was half melted and sringey so the veggies had nothing to cling onto.  Lessee quality than bar food.  

Gummy bear premium shisha was the only highlight and what they can be known for really that's it."}
{"text":"Try the double apple shisha (regular). Heard the bluemist premium is good too... Will have to try next time! Thanks to Ubaid and Mohamed B. for such great customer service! Hopefully I will learn to blow O's in the air like Ubaid (aka superman!)  ha ha"}
{"text":"Dreadful! Absolutely dreadful! 

While trying to find new shisha spots, we found this on Yelp and decided to give it a shot and I immediately regretted it as soon as we walked in because I suddenly remembered I'd been here before and swore I wouldn't come back. 

The first time we came here, the staff left a sour taste in our mouths - and it wasn't from the food or shisha. To say the least, they were lazy and rude. The shisha came quickly, no complaints there. We ordered some food - which itself was a mission, because no server came to check up on us despite us being seated in a booth right in front of the counter. Odd considering every other place we've been to, the servers would at least ask how the shisha or food was. I walked over to the counter and ordered some food. Fifteen minutes later, still nothing. We had to go over to the counter twice after that to ask about when our food was coming. We would have gone and asked more than that if the staff weren't so rude and intimidating in answering us the first two times. When the food did come, they gave us the WRONG thing.  To avoid having to socialize with the staff, we ate what we were presented and left. 

Upon walking in accidentally the second time, the dim lighting made it impossible to navigate the place. Purple everywhere! Not to mention, noises coming from the gaming console and huge TV they've set up. It is definitely a man cave as both the times we've been here, there's been an overwhelmingly higher male to female ratio, which makes it uncomfortable if you're out for some girl friend bonding time like me and my friend were. If you don't care about that, you'll be fine. Anyways, we were seated on a chair with a wonky leg, and the table had a screw or two loose so much so that we were afraid to put our food on it - so we ended up not even ordering anything and sticking to the shisha which was average at best, with poor quality coal. The shisha wasn't BAD, but it wasn't GREAT either and because of all of the other factors, we just could not bring ourselves to enjoy this place. Never have I left anywhere quicker than I did here. If you're in Mississauga looking for a welcoming atmosphere (both staff and decor wise) and good food & shisha, you're better off driving the extra five minutes to Mazaj instead."}
{"text":"Their shisha is amazing but their service is EXTREMELY SLOWWW.  you need to get quicker at making shisha, food and attending customers rather than chilling at the desk the whole time."}
{"text":"Been a while since I went to a shisha lounge.  This is a big man cave! Sofas / chairs all around, PS3 with games setup, sports on the tv. Good crowd, great customer service. 

Had the pan mint with a frozen pipe. Very very nice. Gave a nice chill! Good options available. Nice malt liquor (no alcohol though), had the chicken platter shwarmas. Came on a plate, tons of dressing, the fries were nice as well as the chicken but I'd hope for a little more chicken! Only real gripe. Other than that great relaxing place. Chilled out! Buddha bar be perfect!"}
{"text":"I have actually being going here for some time but never got to actually writing a review. They have recently finished a pretty major renovation and look quite amazing inside now! So if you haven't been there in a while I would give them a check. 

I visited this place with a few friends of mine. We ordered drinks, food, and of course shisha. The food is relatively cheap compared to other shisha places, but sadly you get what you pay for and the food was rather lacklustre and quite frankly, crappy. One of my friends and I both ordered their chicken fingers ($8), while that does seem quite reasonable keep in mind with that you get 3 very small chicken fingers and some old and cold fries. My other friends ordered a chicken shawarma wrap, he complained about the vast amount of fat that was found inside it; something that is unacceptable in any restaurant or price point. As a joint dish we ordered their nachos and paid the extra $3 for chicken ($11). I wouldn't necessarily recommend this dish either as they don't use real cheese but rather cheese sauce. 

However, their shisha is quite good, I had the bubblegum flavour and the mango paan flavour. Both were quite enjoyable and I would recommend both depending on your tastes. My friends had the orange mint flavour and the gummy bear flavour, while the orange mint was enjoyable, my friend said she would skip the gummy bear flavour next time. 

Generally, if you want a place with good shisha I would go here, I would just stay away from the food."}
{"text":"The sheesha wasn't great. The food wasn't great. The customer service was worse. Staff seemed disinterested. 

One group walked out after smoking their sheesha for 5 minutes. Bit easy on the wallet but quality is below average. 

There's much better places out there."}
{"text":"Fusion has drastically changed from 6 months ago.  This place used to only have several tables and the black couches dominated half of the lounge. 

Coming back this time - it was packed; with people and with tables.  
The shisha was average priced with odd prices for their drinks ... soft drinks are $2 but Nestea goes up to $3. 
Their menu offers a wide variety of appetizers, entrees, and even dessert.

The shisha itself: the flavour paan honestly tastes like scented soap.  HOWEVER, the smoke was consistent and the flavour (although undesirable) was consistent.

However, I'm a little concerned about the quality of their coals as they tend to do their little mini explosions.  I don't mean the little sparks that go up when lit, but more like the top layer of my coal blew off."}
{"text":"I see a lot of pu***ified compliments!

However the place looks rundown! 
With a f**ked up priced tag! 

$5.00 for a tea that taste worse than dollar store 500 tea bags for a dollar. 

The bitter salty girl that served us acted like a pure misandry! Like she hates her-life. What an amazing customer service.

My idiot friend tipped her because he said it's too rude to ask for change. But promoting a bad attitude of ppl only enhances their behavior.
I think I understand why most ppl in their country become bitter and anti-social!"}
