{"text":"This place has the best burgers in the world. Friends and myself go almost every Thursday for the burger special, which is only $5.99. It is a juicy, tasty, 1/2 lb burger with a good toasted bun with lettuce, tomato, and pickles. You can get it made anyway you want. I, personally like it pink in the middle. What a burger? You also get a choice of french fries or sweet potato fries which are also, great.  We have had their brownie, ice cream and fudge. What a great dessert.. Not expensive either. The brownie is served, warm, with 2 dips of vanilla ice cream and fudge sauce.
We have also tried other menu items, which were good, too.

The entertainment is wonderful and mellow. The guitar player does such a great job. He plays such great 70's music. Since I am a boomer, I can really relate to this. 

 I don't understand why this place get bad reviews."}
{"text":"My hubby&I were in for lunch today Nov29. There was 1 bartender/server for whole place including outside. We happened to be in the area, they have Buzztime, so we tried it. Don't think it will be a repeat. Server just not as friendly as we are used to in telling us any food or beer specials. Hubby ordered French dip which was the special and he said good, altho falling apart in his hands. I ordered Caesar chicken, not specifying the wrap,not the salad. The salad was served, I said, I wanted the wrap and server said \"You ordered the salad but its an easy fix to make it a wrap.\" She took my food,was gone about 10 min. and wrap appeared (including the croutons) I guess I should have been more specific about wanting the wrap or she should have asked.My tea refills were not timely. Beer orders and re orders were taken care of tho. Taste of the wrap was good. However when we go out to eat its not ALL about the food - need great service, atmosphere, Buzztime, good prices. Server said they have WiFi but its been problematic lately - we had no signal.

I bet regular customers find better service."}
{"text":"3 stars for good customer service and good bar food but really $5.50 for draft beer, small glass Ouch! Won't catch me again, first and last!"}
{"text":"Great place to hang out!  You walk in the door and immediately feel like one of the family!  Mike does a wonderful job selecting  his staff, menu and music!  No one leaves disappointed!  Fantastic place to hang out!"}
{"text":"I'd been here many times when it was new but not since.  We were there a week ago Tuesday for the Blues--really good by the way--and last nite w/ friends who suggested the $5 burger special.

FWIW, I've only written one previous review for a local restaurant as it was exceptional.  I write this as this was possibly the worst food I've had in years.  I'll gladly take a Carl's Jr. or Big Mac over the 1/8\" thick, tough hunk of meat that was masquerading as a hamburger.  

I enjoy BBQ or seafood sauce w/ my french fries; the BBQ sauce (the friends) and seafood sauces were tastless.

I ordered the house wine.  I believe swill would be preferable.  The server brought me their 'Premium' Cab.  A bottled wine I can buy locally for $5-7 for only $7 a small glass.

Terrible food.  Rip-off wine.  Sweet young average waitperson.  Dynamite, personable young man with appendages serving the food.

Don't waste your money.

Oh, the Sunday morning football is good."}
{"text":"Just went to Fuzzy's today around 3pm and we asked for two jack and cokes, we received two diet cokes. Went to the bar told the waitress we ordered two jack and cokes and even joked to her how we thought we were getting huge jack and cokes and left our untouched diet cokes on the edge of the table.

 The waitress visited as few times as possible and barely stuck around to hear us talk, actually walked away from us while we were talking to her... Needless to say we were charged for those 2 diet cokes we never ordered. 

SW Steak sandwich was just meh.. french fries were good but how hard is that?

Will NOT be going back..."}
{"text":"Upon entering the business we waited at the entrance as the staff stared at us. My daughter went to ask if we need to wait to be seated and she was told to sit anywhere. There was no sign or hostess at the door indicating to seat yourself. Once seated, i asked for a drink menu and was told we dont got one. They have a full bar with beers on tap with no drink or beer menu? After ordering one ice tea we decided to leave. While the waiter went to get the bill for the iced tea i just left $5 on the table and left. Will not be coming back."}
{"text":"My family and I have been here 3 times in one week. We have had great service and delicious food!  I've gotten the French dip every time, it's prime rib and it's the best I've ever had. The homemade chips and the fries are so good.  My grandma had the fish and chips which she loved and my mom thought the patty melt was quite tasty! I highly recommend this place!"}
{"text":"This place is such a cool bar... It is just a shame that the service is so terrible. Last night I sat at the bar top for over 10 minutes while the female bartender walked past me 5-6 times.... Ignored me... And checked her phone. She never looked at me and finally I had to shout at her and ask if I could see a menu... She was an older woman who looked like she was trying to be 18. She finally got me a drink and I ordered the beef dip sandwich which said it came with a side of spicy mustard. 35 minutes later I received my sandwich... No spicy mustard... No ketchup... No napkin... Nothing. I ate my French fries... Which were actually really good. I got the girls attention and asked for a side of horseradish for my beef dip and she said ok... I waited and waited and waited... Finally after i had finished all my fries, she walked back by and said... \"Oh Horseradish\"... In total time I was now 45 minutes from when I had ordered my sandwich.... Finally I received my horseradish and could eat my sandwich... The most frustrating part of the whole thing... The sandwich was one of the best beef dips I have ever had... Au Jus was perfect! Except that it was cold... Really pretty good food for a bar... Just really really terrible service. I have been here several times and the service has always been less than average... But they stay busy... This is a HUGE Sun City hang out with the average age about 55. It's a shame that the owner/manager, who has himself ignored me once while he was standing in front of me in the bar, doesn't spend more time training his staff. Really could be a great place. :-/"}
{"text":"This is my go-to place in a pinch when I need to get my drink on and want to survey dating options in Surprise Arizona.  The atmosphere is OK, but kind of loud sometimes.  The drinks are strong which is a big plus with me.  The food is surprisingly good and the service is even better.  My favorite is the French dip.  I order it every time.  The homemade chips and the fries are so good.  Overall you won't be disappointed."}
{"text":"We decided to go here for dinner because we wanted to watch a game. Got there at 630 and it was packed. We found a table on our own and a waitress was there immediately.  One ordered a hamburger and it was delicious. Two of us ordered the French dip since we read good reviews on yelp. The dip was dry.  And the bun was  over toasted.   Next time we will order the burger."}
{"text":"Very average place. It seems to be a popular place for locals. But since spring training visitors bring some revenue to these places, you'd think we would get some better service. Average food too....everything here must come frozen."}
{"text":"The owner Eric is a drunk. Needs a course in PR!
Food is ok. I like Mike, and the food is average."}
{"text":"The food is OK... Jenna is an awesome server, but this place needs a \"Bar Rescue\" ... If you don't want much, you found your place... Lotsa TVs = Good... Lotsa junk laying around... Needs a good scrubbing... Be aware trivia Monday night... Even if NCAA championship is on.... Sports bar...huh?

Continue on down the road, there is better"}
{"text":"Have been going to Fuzzys for the past 2 years. We have always had good food and good service. Last night we went for build a burger night. The wife got the burger and I got chicken strips. We sat at the bar which turned out to be a mistake. The woman behind the bar looked like she was more interested in her purse and looks than waiting on customers. She threw the silverware on the counter and walked away. Next time we go back I will get a table and forget the bar."}
{"text":"Super fun bar to play Team Trivia.  We have gone many times on a Saturday night to play and the guy who runs the game does a great job.
The menu is pretty typical bar food.  The ribs are fall off the bone good and the fries are crave-worthy.
I would give Fuzzys a higher rating of they would just get better lighting.  It's so fluorescent bright in there it feels like you're being interrogated."}
{"text":"This place actually has great food and I see some new bartenders so maybe we are moving up"}
{"text":"The service at Fuzzy's is terrible. Had to wait a while before anyone even came to ask us what to drink or give us menus. Need to work on customer service. The food is just average, can get better food elsewhere. Also, the soda or seltzer they use in their drinks Three of us had vodka and soda) is rancid. It actually smells and tastes like sewer water. When we told the waitress she talked to the bartender and he really didn't care. We weren't offered another kind of drink. In their defense they did not charge for the drinks. Will never go there again. Go somewhere else and enjoy yourself."}
{"text":"The owner is an asshole - acts like he wishes no one would show up. All the gals that wait on us are great. Hamburgers are excellent - the manager has driven our group of 20 to another place - good luck if you have to deal with him"}
{"text":"Food was ok, not great like I read on all the rave reviews. I've had much better fish elsewhere. Our gross table was permanently embedded with dirt. Very loud atmosphere, which was expected being at a bar on a Friday night. We waited quite a long time to receive our check. Not a great experience and won't be back."}
{"text":"Great build a burger with good service and a friendly atmosphere. Hows that for original review? Do try the fish fry."}
{"text":"This is another sports bar. Typically, serving wings, burgers and tacos. Tonight, their special were steaks. All the food were a little overpriced. Service was slow, the place was busy but the servers were rushed. Lastly, it was very noisy."}
{"text":"Had club wrap,hubs had grilled chicken, he said bun could have been better but chicken was great, the wrap had dressing all in center, not spread out much.   BUT the French fries!!! A must have.  Service was really slow, said because of lunch crowd and kitchen backed up.  Maybe more employees are needed?"}
{"text":"Friendly place to hit on the way home from work. Thursday is build a burger(always good). Also Friday fish fry is a winner."}
{"text":"Probably shouldn't give them two stars but the owner Mike is a fairly nice guy. If you've a pretty face he's way nicer. Three times we've been there for lunch. Twice with coworkers and once with my husband. Kept trying the Reuben to see if it would ever be decent. Won't go back, last one I was served was on untoasted white bread. If you are on an hour lunch, don't go you won't have enough time. Waitress was not interested in working, except working the old folks at the bar. I believe retirees love this place because they have time to spend and this seems to be the crowd it's geared for. Not the working locals. Sorry it was a strike out."}
{"text":"Hmm! If it's slow they kick you out and close early!!! Mind you 15 people in the bar is not enough!"}
{"text":"I went in with my boyfriend. We sat ourselves as the sign said we should. We sat for over 5 minutes. A waiter in the area definitely saw us more than once. A couple sat down next to us and got helped right away. We walked out after that. Terrible service"}
{"text":"When you walk in there was no sign or hostess at the door indicating to seat yourself or not. I went on a Thursday for the Burger Special. Just make sure that is what order. If you want cheese you will be charge for it. Waitress are very different. They are hit or miss. By this I mean when you walk in and sit down you have to wonder if they saw you or not. Getting there attention is a task. Sure not a place to go if you are in a hurry. Outside they have smoking area and a couple of tables. I think if you walk in and go to there patio you be sitting for a long time waiting for the waitress. Like I mention before they have a good burger."}
{"text":"I love fuzzy's!  I've been here multiple times.  I usually end up ordering the Reuben and fries with ranch dressing.   It's a great atmosphere and I've even done a few paint nights here with Vino and Canvas!"}
{"text":"I'm not over the hill yet, fit. happy and take care of myself...that said...my husband comes here sometimes and I'll meet him.  Lots of regulars who are fun...wow though what a stuck up waitress , shes pictured above with Elvis...fake everything and completely stuck up....zero zero help to any women at the bar....I hope the men can pay the rent on this place as when shes on -not a women is served...its happened 4 times now.  Some of the other gals working are fun..its a sports bar for goodness sake....not expecting much but get rid of miss stuck up...even the men make fun of her...guess Ive been here 2o times and its fine but when shes on now...I leave....go to Roadhouse and have hubby meet me there.  Honey, that look went out in the early 80's!"}
{"text":"The food is way better than the atmosphere. If you are retired and like sports, this is the crowd for you. The rest of us may feel a bit out of place. However the drinks are good, the service is decent, and the food is surprisingly good. Try the Ruben!"}
{"text":"Fuzzys Sports Bar has something for everyone!! When you think of Sports Bar great food isn't usually the first thing that comes to mind but at Fuzzys you get treat food at great prices plus great sports.
one of my favorites is pasta Tues when the chef makes homemade pasta followed by homemade cannoli for desert. Now that's a winner.
Breakfast on Saturday and Sunday will knock your socks off with Texas French Toast and huge omlettes!

The cheese curd and pretzel appetizers are awesome and I highly recommend them

Yes the atmosphere and staff are wonderful and so is the food!"}
{"text":"Stopped in couple times for dinner and to watch a game a few years ago and from those experiences decided to never come back. In a moment of weakness I decided to try it again tonight. Same distain for the same reasons. If you are looking for the local drunk hangout with a significant low-brow clientele that is apparently made up of peers or friends of management, and mediocre food at best, this is your place."}
{"text":"The wife and I have been here a few times.  The chicken quesadillas are great and the chicken sandwich was really fresh. Nice easy going crowd and plenty of TVs.  I would recommend this place to go and relax, have a couple of beers and catch a game."}
{"text":"This time we came in on a weekend night and not for football and had a better experience. The owner ( brown hair 50?) sat and talked to us and made us feel welcome. I had the french dip which was outstanding and we ordered the cheese curds but they were pretty greasy."}
{"text":"PLUS - walkable from the Hampton Inn where we were staying

MINUS - service was slow, they barely wanted to serve us and we were a party of 14....

PLUS - tons of TVs so if you want to watch the game this is a good place to see it!

Anyway...not sure if there is better in the area....it suited a purpose but wasn't a must visit."}
{"text":"A-Ok. Seems to be the only happening place in this neck of the woods. Pool table is a nice touch. Bartenders are hit or miss. Some are extremely attentive and awesome, others not so much. Huge bar smack in the middle of what seems to be a diner. Small outside seating area overlooks the exquisite parking lot. This may be a cool place to grab lunch and a beer in the middle of the day, but I would skip it in the evening. Oh wait, no I would go here in the evening also cuz there's not much else around;( Just watch out leaving this place so you don't get run over by a golfCAR."}
{"text":"If you are looking for a combination sports/semi-dive pub - this is the place! They have some large flat-screen TVs, decent pub style food, and the staff is friendly. They also offer karaoke!

The age group of patrons while we visited ranged between 35-70 years old. This is not a night club for the \"clubber\" 21-25 set! This is more like a neighborhood watering hole.

I had their fish and chips - delicious!"}
{"text":"Been back a bunch more times and the place is really spotty. Not sure if they have two different cooks on weekends but it sure seems like it. We still go back from time to time but not as often.... Service is always amazing though, except with there is a Packer game on. When its packed to the rafters you can't expect the same service. Still not bad but hey, they get busy!"}
{"text":"Plus side, food was very good. Both fried fish and grilled fish.  Onion rings excellent. Server, JV, was very friendly and very efficient. 
One and only con was they were very slow and stingy with the all you can eat. 
BTW,  JV wasn't  our server but he was the only one that came by our table. Was very pleasant and helpful even though he didn't have our table. 
We arrived at 2pm, not lunch or dinner hour"}
{"text":"My brother and I were there for lunch on may 10 at 12pm for.mothers day. We ordered drinks and it took the bartender forever to make the worst bloody Mary I have ever had. It took forever  because he made everyone a drink and until I made a stink with my waiter..did he make it. 
Though the food wasn't bad..the bartender was totally unprofessional. His child (maybe 2) was with him behind the bar and when i went to the bar he picked and choose who he wanted to wait on.  I will give it a 1 only because the food was ok. The staff, Espicially the bartender, was unprofessional.  Needless  to say we will NOT be back."}
{"text":"This place is what I'm talking about! The food is hand made and it shows. The hamburgers are awesome! The consistency is great! The servers are really good and the booze just flows. They also have the NFL ticket so that rocks! This is what a sports bar should be like."}
{"text":"Service is atrocious. Tried to order takeout and was left on hold over 10 minutes before giving. Service in the restaurant is just as bad. Find someplace else for your burger."}
{"text":"Friday Night All You Can Eat FISH FRY . Have it deep fried and clog your arteries or grilled the healthy way. Both are delicious. Friendly crowd and short wait for table. \"Ryan, our handsome and personable waiter, was a big help with the menu and specials. If you have a nut allergy, have no fear. They use soy oil. Occasionally the owner makes cannoli and tiramisu. I'm told they are delicious."}
{"text":"came in on a tuesday night. awesome service, fresh food came quick and cooked perfectly. i got the bacon, avacado burger and it was really good! the wings were really good too. i gave it a 5 star rating because i honestly have nothing bad to say about the place. food was came quick and was perfect. service was stellar and manager came after our meal and asked if he could give our 2yr old a scoop of ice cream on the house. nice little gesture and whole place was just nice. no complaints, perfect score."}
{"text":"Good food, good ambience and great service.  The French dip sandwich was well made with prime rib meat and a homemade dipping sauce that tasted like beef broth and not the onion soup mix you normally get.  Probably will get the French dip sandwich the next time we come here."}
{"text":"We went to try the Friday fish fry? It was packed, but we expected that! Anyway, the hostess said there was overflow seating in the back with folding tables and chairs if we didn't want to wait, so we took the overflow seating. The tables were pretty nasty looking, but the service and the the all you can eat fish was great! They were small pieces of fish, but hey, it's all you can eat, and they bring it to you quickly, so no big deal. The creamy coleslaw was excellent, and I liked the floured and seasoned fries a lot. We will go back again, but we won't sit at the overflow tables!"}
{"text":"I had a chicken Cobb salad and the meat was dry like wood.  My mother had a hamburger which she ordered medium rare and she got well done.  The waitress did give us a 15% off the bill, but needless to say we probably won't go back.  The place wasn't busy and it took a long time to get our meals to the table."}
{"text":"Not the best bar in comparison to all other bars in area.... servers girls are acting that they too busy for you! Seriously? They should find different jobs if they don't like to work as server or bartender...."}
{"text":"Almost didn't check this place out because of bad reviews but now I'm a regular. If you set expectations accordingly this place is great. It's a bar, not a kid friendly restaurant. If you just want a basic place to hang out, get slant eyed and watch sports and BS with random people this is a good place for you."}
{"text":"My wife and I like to frequent establishments that aren't chains. We wandered in here the other night just to check it out. Not a single head turned our direction. My wife wanted to give them a chance. She stood in the doorway waiting for about 10 minutes with no response. Finally, just took a seat at one of the tables ourselves. So we sat there; waiting . . .  and waiting.  After about 25 minutes or so, we walked out. Unfortunately, I can't tell you about their food or drink. What I can tell you, is that their service is non-existent! Save yourself the trouble and go somewhere else."}
{"text":"Figured I would give this place a shot since we were meeting family that live in El Mirage. We drove all the way from Avondale to attend this location. It was recommend by Places to Eat in Surprise. 

My family of 4 walked into the restaurant around 7 pm last night. (7/05/2017) (2 adults and 2 teens) 

We were also waiting for 3 more family members to join us. 

Appears they were having a poker night. So we took ourselves to the back by the pool tables since there would be enough seating for all 7 of us. 

Not a place for teens/children. They were playing a very inappropriate sexual song over the speakers. I am not offended easily but was pretty surprised by the lyrics to this song. Of course our teenagers thought it was funny. 

We sat around maybe 10, maybe 15 minutes. No one looked our way, no one waited on us. So we gladly got up and walked out and went to Little Sicily and had an amazing dinner there."}
{"text":"We go here for lunch and dinner and are never disappointed. The food has consistently been delicious, and the service quick and friendly. 
They have different activities and specials. We have made this our main restaurant in town because it's just that good."}
{"text":"Wow! What an experience! We went on Friday, which just happens to be all you can eat Fish Fry night. I had a meatball sandwich with BBQ chips. It was good. No complaints with the food. My buddy had the fish and I sampled and it exceeded expectations. 

Now the strange part. The \"sports grill\" was filled with a 60 and older crowd of all regulars.  We weren't greeted when we walked in so we seated ourselves. A regular told us there were \"rules\" about who sat where. A drunk regular, \"Wally\" told my buddy he was supposed to tip $5 for a beer in a very awkward exchange at the bar. Wally then stumbled out of the bar hanging on to walls and rails before pulling out with his car lights off. 

There were a few drunk men over 60 who were hitting on and inappropriately touching the younger (40's) women at the bar. One in particular kept offering elbows to a man's chest to fend him off as he tried to cop a feel. He made multiple visits while his wife sat across the room. 

The waiter apologized for neglecting us. My buddy did wait 20 minutes for his second day plate of fish. Service was spotty but I give them a pass as the regulars were a handful.

There were 20 TV'S and yet many were turned to the same games so there were only 4-5 games viewable. Although this crowd didn't seem all that interested in sports.

The visit was surreal, and yet awkwardly entertaining. We didn't feel welcome as we were \"outsiders\".

 I don't think I'd ever return, but then again....no...I won't return."}
{"text":"Seriously the best food I've had in a long time! Great customer service, great environment and awesome blonde bartenders!! Highly recommend this restaurant. Definitely coming back!!"}
{"text":"If you are looking for a locally owned sports bar that has lots of TV's, home cooked food and friendly service...Fuzzy's is the place.  I moved to Surprise this summer and was looking for a spot to watch Sunday morning NFL Football.  After checking out a number of the sports bars in the Surprise area I decided to give Fuzzy's a try and glad I did.  It is located in a strip mall corner location just off Grand Avenue.  Despite being between two of the largest retirement communities in the nation the Sunday morning crowd was pretty varied age-wise.  There are lots of TVs with large flat screens at both ends and multiple TVs above the horseshoe shaped main bar.  There are plenty of regular and counter height tables available.  The owner, Mike was greeting regular customers and made sure I got a seat at the bar near the proper TV to watch my favorite team.  Mike is from Cleveland and there were lots of Browns fans in addition to plenty of Arizona Cardinal fans.  My server and bartender was Kyra who was friendly but super efficient as she handled drink orders for all the folks at the bar.  She checked back with me regularly to make sure I had everything I needed.  They have a breakfast menu and from what I saw the food looked basic but pretty tasty.  I opted for the signature Build Your Own Burger which was excellent.  It is a half pound of good quality beef which I ordered medium rare and it actually came out medium rare.  You have a choice of sides and I had sweet potato fries and they were very good.  Fuzzy's is a local, neighborhood sports bar with a mid west friendly atmosphere.  The food and drink prices are competitive and I thought the service was efficient.  I will be back next Sunday morning.  I'm ready for some football!!"}
{"text":"This is a great place too have some good food & drink and have fun!....but!...if you want good coleslaw...go elsewhere!"}
{"text":"Wife and I actually had a good time here. Been here twice now, service is very good. In two visits, we have had their BLT, cheeseburger, sports fries w/chili, chips and salsa, prime rib sliders. All of it were very good! Daughter had their meatball sandwich, even though she wasn't that impressed. I liked it very much!!! Music was great, and we will come back again!"}
{"text":"Fuzzy's is now under new ownership. They brought in an actual chef ( I have met and talked to him) and the food is excellent. This is not your ordinary bar food folks! I recently had the Maryland Crab Cakes and they were wonderful! Absolutely NO fillers! Just crab! They are the best crab cakes I have had since I lived on the east coast. The chef makes all of his own salad dressings, sauces, gravy, etc. For those that tried the place under the old ownership, do yourself a favor and try it again!"}
{"text":"Looks like a sports bar, sounds like a sports bar, must be a sports bar.  Not a restaurant/bar.

We had the cobb salad.  Safeway mixed greens, MAYBE one slice of bacon, one egg, lots of black olives, lots of dry chicken chunks...dry!!  Some bleu Cheese \"crumbles\" and what they call bleu cheese dressing.
Price was ok.  Salad was SAD!

I won't go back, but if you decide to, try the hamburger."}
{"text":"When I planned to meet a friend of mine for a mid-afternoon meal, I asked her where she would like to go. She recommended Fuzzy's, which was under new ownership, because their prices were are reasonable and it has a good atmosphere. 

We met as agreed, shared a pleasant meal, and decided to stay after paying our original check to in order to finish catching up on each other's lives. We started a new bill, ordered a couple of drinks, and much to our dismay the waitress \"misplaced\" my friend's debit card. 

Although the food was actually very good, the owner of the establishment could use some classes and/or seminars in best practices for customer service/satisfaction. My friend asked the waitperson to bring the manager to our table to handle this very serious situation because my friend had already been a victim of credit/ID theft and was extremely upset that history might very well be repeated. 

Instead of coming directly to our table and reassuring my friend that he was \"on the case,\" the manager was conversing with our waitperson in the back of the restaurant allegedly gathering her facts from her. My friend became more and more anxious and was about to burst into tears. I walked around the restaurant in order to scan each area for the missing debit card (since no one else seemed to be doing anything of any value). 

After making full circle, I approached the manager (who turned out to be the owner) and advised him that my friend was becoming increasingly upset and needed to speak with him. He turned to me and talked to me as if I was a kindergarten-aged child (I have a Masters degree) and advised me he would be over as soon as he got the \"facts\" from the server (never mind that my friend was the victim). I told him not to talk to me as if I were a child and again requested that he at least speak with my friend to assure her that he was \"on the case.\" He eventually made an appearance about 15-20 minutes later. 

Without trying to at least sympathize (let alone empathize) with my friend's anxiety, fears, etc., he became increasingly agitated with her because she was trying to tell him that the waitperson brought the charge slip to our table for her signature without the card and should have never done so. He took it as a personal affront, advised my friend that complaining about what happened would not make her card \"magically reappear,\" and exacerbated her already anxious mood by arguing with her instead of placating her. 

After giving her contact information to the proprietor, she and I left the establishment and returned to her home. Moments later she received a call informing her that the card was located and would she return to retrieve it. We returned to the restaurant where my friend returned cash to the server (who had taken the money out of her own pocket to ease the situation) and received her debit card from the \"night manager.\" Apparently the owner decided to use him and a bouncer to make sure we got in and out of there as soon as possible (for two women who have grown children of their own). 

Oooooh....a bouncer! We felt very dangerous after that. How scary we must appear to be! The bouncer, a guy wearing a muscle shirt and tattoos going up both arms, followed us out to the parking lot to apparently make sure we didn't spread our happiness to the patrons on the patio. 

For the inconvenience of having to cancel her debit card when she returned home (it was in a compromised status for over 2 hours), being embarrassed by the owner of the restaurant in front of a restaurant full of patrons, and being followed by a bouncer (she's probably 5'2\" tall in her sandals) to make sure she didn't stir up trouble, she was given a business card with a note for future servers to honor her with a free meal (AS IF!).

If the rating was solely based on the food, service (from a different waitperson), and atmosphere that we experienced for the first few hours we were there, Fuzzy's would receive a five-star rating from me. However, due to the owner's attitude and performance (which rated a negative five-star status), I will give them a two-star rating for the quality and quantity of the food, the atmosphere, and the friendliness of the other patrons. 

If you still want to try Fuzzy's food, go for the chili made with ground buffalo meat, the buffalo chicken wrap (I had the grilled versus the fried), and the chicken Caesar salad.

I would caution you, however, to pay in cash and go when the owner is on vacation (or get your order \"to go\")."}
{"text":"This place sucks. Shitty service me & my girlfriend walked inn & nobody noticed us"}
{"text":"Worst place I've been to around Surprise or Sun City. The service was bad but the food was even worse. Asked to order a beer at 6:55 before happy hour ended.  The waitress told me it was past 7 and I said \"It's only 6:55, look at my phone and watch.\" She told me they go by bar time and not my time. Fries were so salty I was dehydrated hours later. Ordered the burger medium rare and it was pink and under cooked. This place is the bottom of the barrel. I'm wondering how it stays in business? They should rename this place Scuzzy's."}
{"text":"I am a regular customer. The last 2 times we have been there the service was absolutely terrible. Last time there they ran out of fish at the fish fry--- one regular order for all 12 of us and that was it. We were offered  extra French fries instead of fish Tonight it took forever to get drinks and for someone to take our orders. Once they took our orders it took 45 minutes for us to get our food. When we received our checks --- there were 4 couples -not one check out of the 4 was correct. Then it took another 20 minutes for our checks to be corrected. Don't think we are coming back for awhile until someone gets a grasp on things."}
{"text":"Fuzzy's has been changing recently.  The crowd's been getting younger, there's entertainment a couple nights a week (DJ/karaoke) and there's a cool vibe there that hadn't been in the past. The food is great for inexpensive bar fare - the Chef salad I had was awesome (get the balsamic vin.) and they say they have the best burgers in the West Valley, too. The service can be sparse at times, but they make the effort and usually do it with a smile."}
{"text":"Friendly people and good food at a fair price. We WILL return! Good food at a fair price. Get there early if you want to eat. Get crowed early"}
{"text":"This is a sports bar and to fancy but ok.  It has a good Friday night fish fry.  You can get either grilled or deep fried.  Only item we have tried here   It was ok but not our kind of place.  They smoke on the patio and then come in bar you can smell it sometimes.  Will not return other places for fish fry in the area"}
{"text":"Fuck this place! Way too goddamn expensive. Food was subpar at best. Drinks get weaker as you order more drinks. I will never go to this place ever again!"}
{"text":"I've been in for a couple of times. Once during lunch hour. The place wasn't very busy and the waitress was just perfect. Friendly and very attentive. I liked the menu because it offered so many options and the food was great. 

The second time was during a Packer game and it was okay. Service wasn't as fantastic, but we were sitting at the bar and the server was busy. 

This place is conveniently located for us, and the fare is delicious. I will visit again."}
{"text":"I've been to Fuzzy's twice now and don't think I'll be returning, the first time my Wife and I went about a year ago we couldn't find a seat inside.  the sign said seat yourself we sat on the patio and after about 20 minutes a server never acknowledged our presence.  Even though they looked at our table several times.

The second time was after a work christmas party with a few friends we stumbled in about 10PM to check out their Karaoke, some interesting characters, this time the server acknowledged us and brought us a round of drinks but they never checked on us again over a period of maybe 45 minutes to an hour, and eventually I went to the bar and asked for the tab.  Oddly enough the people that seemed like regulars we're getting service.

dissappointing to say the least."}
{"text":"Decided to stop in with my sister and was so unprepared for the amazing service we received!!! Kira was our bartender and as soon as she heard it was our first time here, she immediately explained the full menu....the prime rib is made in house, the corned beef as well AND because the owner is Italian she mentioned that the meatballs were also made in house! I was thinking about the fish fry but decided to go with the prime rib, as she totally sold us one it!! A few moments later she asked how I liked my fish, which I responded to that I didn't order the fish....she then surprised me by saying \"you're from the Midwest you're going to love it, I'm getting you a piece to try\"....OMG!!! She also brought us a sample of their home made chips...can I say UHmazing!!!! Now I have to admit when we first walked in the crowd was a little older than we were used to, the only comment I have to say is THEY CLEARLY KNOW HOW AMAZING THIS PLACE IS!!! The young kids have no idea what they are missing!! Food: Amazing!! Service: Outstanding!! You better get your asses in and enjoy!!!"}
{"text":"Ok let me start by saying Mike the owner is a really nice guy and goes out of his way to make you feel welcome. The crowd is old and older , which is fine for the neighborhood.  If you're in your 60s-80s and single this is your place! The French dip is wonderful and the chili is also great! It's ridiculous to reserve bar spots for people who don't spend that much and the service is hit or miss. But we come back because of the French dip and Mike's great attitude! !"}
{"text":"Just walked out. Sat at bar. No acknowledgement from bartender. She talked to people on both sides of me. Took their orders and served them. Never been ignored quite like that before. Won't ever go back."}
{"text":"I popped in at noon to buy a gift card was told only the owner/manager could do that and he wouldn't be in until 3. I called at 3 to make sure he was here to purchase a gift card. I get here and there is no manager and I've been waiting for 30 minutes to buy a gift card.  I watched the bar for anyone who looked in charge  after the owner was there for 10 minutes the waitress finally got him to come over.  I did not buy a card.  I will NEVER be back to this place again. Also the bartender kept the bottle opener IN her pants. Not in a pocket. Between her buttcheeks and her pants. Again never will be back."}
{"text":"I love Fuzzy's!   It's very close to where I live and they have great people and there is always something special going on. They have a good beer selection and the food is above average. Most of the staff is friendly and they remember your name and what you drink.  Rhonda, Lora and Bailey are great.  I think Katrina was having a bad night, but usually she's awesome and has an amazing voice for Karaoke night.  Otherwise everything is great at Fuzzy's!"}
{"text":"Great happy hour deals - horrible bartenders - they look like they hate their jobs and treat the customers like it"}
{"text":"This place is about as good as a place called Fuzzy's Sports Grill can be. Most of the waitresses are nice, how often you'll see them at your table, is up in the air though. 

Friday is all you can eat fish fry day. Do not expect fast service on this day. Everyone and their mom is there for fish! A group of us went for lunch and were trying to get out as quick as possible to get back to work. We got there at 11:45, and didn't leave until 1:15. Receiving the initial order of fish took the longest amount of time. By the time we got it, we really needed to leave, so there was no time to ask for more. On top of that, the six of us were on separate tabs and the checks came every single one of them were incorrect. That took a long time to fix.

I typically order the burger. The burger itself is pretty good, the bun is always hard around the outside though like they leave the bag open throughout the day. 

It's not a bad place though. Lots of TVs, plenty of games to play, clean bathrooms. For a sort of dive bar, it's not too bad."}
{"text":"Local Sun City bar crowd, friendly regulars , great fish fry on Fridays.  
Kira and her sister are just the best."}
{"text":"Our group goes here Monday nights for Team Trivia, so we understand that the kitchen is very busy. Usually, our server is Toni, who has to be the most pleasant and hardest-working server in the state of Arizona. (FIVE STARS FOR TONI!) 

Tonight, unfortunately, we had a different server. First of all, it took her nearly fifteen minutes to acknowledge my existence. My order took a while, which I can understand, but it was delivered without my diet Coke, silverware, and napkins. (I got my own utensils and napkins from the servers' station and flagged down another server for my soda.) 

In addition, whenever one of our group would try to get our server's attention, she would keep on walking, while calling, \"Hang on!\" to us. (It became a joke that when one of us at the table would start to talk, another would interrupt by saying, \"Hang on!\") 

When Trivia ended, none of us had received our checks, and we had to stand around waiting nearly fifteen minutes for them to be printed out. Meanwhile, the place had nearly emptied out, and we were stuck there. Later we found out that the printer had jammed; okay, not their fault, but shouldn't we have received an explanation and an apology? I usually leave 20% tip on anything over $12.00 and 30% if it's closer to $10; tonight I left $11.00 on a $9.93 bill, and now I'm thinking that was too much."}
{"text":"The place was aweful! The bartender was rude and not friendly she needs to move on. We got a hamburger and told her no onions ... Of course she didn't listen and the meat was under cooked -- she basically threw the order at us."}
{"text":"We had dinner here on a Friday night when they have an all you can eat fish fry.  You have your choice of batter fried or grilled.  We had one of each.  The plate arrives with 2 large pieces of fish, cole slaw on the side and french fries.  It was delicious.  The batter fried was crisp outside and very moist fish inside.  The grilled comes with a bit of butter sauce and was perfect. It is about $11 per plate.  Husband had 2 servings.    Only thing is, it is a sports bar, and also packed on Friday nights because of their special, so expect it to be quite noisy.  We would definitely return, however..."}
{"text":"We have been going to fuzzys for about three years off and on. Mainly for the fish fry on Fridays. We haven't been there to often this year so I don't know if things or owners have changed, but it seem to the group we were with that the servings have been reduced. I know for the fish fry it's all you can eat, but not quite the same as before. Service was okay. If you have more than four plan on waiting for a seat. I do agree with a past post. The bar staff seems a little off on their customer service. Anyway, food always good, service can be a little short at times."}
{"text":"The Friday night fish fry is great. You can order fried or grilled cod. Makes a wonderful meal, with fish or fries refills !"}
{"text":"Was there today. Had the build a burger (Thursday special)  it was a delicious hamburger for 5.99 (a little mo $ for bacon and cheese. One time on burger day the waitress, Donna, forgot it was burger day and charged full price, good thing I noticed. The service was good. Used to go regularly but the service used   to be poor, so I stopped going. Also we used to order fries to have a light snack with some drinks. All of a sudden the fry basket got so small, we stopped ordering them. About a dozen fries for $2.50. 
  When eric was manager things were screwed up. No training for the staff.  Things have gotten better. I'll probably be back!"}
{"text":"Went there  after shopping with a friend  best  burger in surprise  can't wait to go back for 5.99 burger with Alot of friends"}
{"text":"The food here is amazing. 
Two full steps above bar food.
FULL. STEPS.
A couple of cute waitress. The smoking hot Latina is off the chain.
Fish fr is best in Surprise. They also do a good breakfast. 
Only problem is they fill up with blue haired snow birds come winter."}
{"text":"This is one of my favorite bars. I like the staff and it's comfortable there. We order off the menu and the food is always good. My only complaint is that it's always full of senior citizens and there is rarely a seat at the bar because of that, especially on their fish fry day."}
{"text":"Noon. Not busy. Waitress friendly and efficient. Ordered Reuben sandwich. Had so much dressing on it you could hardly taste the meat. I hate to send things back or make a fuss. Aggravated that they don't take care to pay attention to what they s/b doing. 3 stars folks."}
{"text":"Food was good.  Went there the first time and got tired of waiting for service, gave up and left. Second time - absolutely the worst service ever. I like to give a place a chance and give the benefit if the doubt.  Twice is enough.  In addition to slow service the server was unbelievably rude."}
{"text":"Not recommended.  Mediocre food at somewhat high prices.  Although the servers are usually friendly, they usually seem understaffed and never come around quite enough.  Although the wings are pretty good, they are just not worth the trip.  We wanted to like this place, and went a handful of times.  However, after several lackluster trips, I doubt we will be back."}
{"text":"We had been here multiple times and enjoyed this place and food. Today we sat at a table near the bar for ten minutes with no acknowledgement that we were even there. The bartender was more interested in the women at the bar, and the waitress apparently could not walk to our side of the bar. Terrible service today... Fuzzy's is in the penalty box!"}
{"text":"They've always been friendly here at fuzzys. The drinks are decently priced. And it's nice to have a place that opens early (9am) when you're wanting a bloody mary. I haven't found another place in surprise that does. It's a win."}
{"text":"There gotta be a law against surly mgmt.  Ordered a burger well after a wait for service. After 25 minutes chased down the server to check on my order, a bit later it came.  Meat was dry, overcooked and tasteless.  Called this to the servers attention she came back to tell me the mgmt. said that is what happens when it is well done, it takes a long time etc.  I won't be going back."}
{"text":"I am giving this place three stars because the food was excellent. However, the service was ok. The girl who helped us was not so friendly."}
{"text":"A few weeks ago the hubby and I found ourselves in the far northwest side of town and we were both pretty hungry. Most of the options nearby were of the fast food or chain family restaurant variety. I spied a sign that says Fuzzy's and we jumped at that option. It turns out that to my dismay this place is not at all the same as the one on Mill Ave (they are not affiliated in any way according to our server) so there were no tacos to be had. However it was Friday and they had an all you-can-eat fish fry going on so I took advantage of this option. Since this Fuzzy's is kind of a divey sports bar I didn't have high hopes for the food but it turned out to be pretty good. I had both the fried fish and grilled and both were pretty tasty (for cod anyway). They were not served with the wedge cut type potatoes that you would expect for fish and chips but rather their regular seasoned crispy French fries that turned out to be quite addictive. I also added on a side salad which was nice and fresh as well. I can't really say the service was too warm and friendly but it was adequate. They seem to cater to a core group of regulars which appear to consist mostly of senior citizen soccer fans (at least at 2pm on a Friday that was the case) and quite a few of those with familiar faces did receive a warmer welcome than we did. I can't say as I'll be back since we live on the opposite side of town but I do highly recommend the Friday fish fry!"}
{"text":"Terrible attitude from service.

Showed up to the bar an hour before \"closing\". My partner and myself were looking to catch a quick round or two before calling it a night. There were still small groups of people inside and outside of the bar.

We head inside and meet no resistance having a seat at the bar. After a minute the bartender, young girl with curled, dark hair, turns to face us begrudgingly and mumbles 'We already did last call.' Understandably, I look confused as it's only 1am and the Yelp says they close at 2am. 

I say 'Really?' 

She says 'Yeah...', looking at us poisonously before dismissing us.

To this I simply respond, 'Ok' as we get up and prepare to leave.

The best part is the she raises her voice and sarcastically says 'Thanks!' to our backs. As if it wasn't bad enough we couldn't get service. She needed to really make sure we understood we weren't liked.

That's fine. Now, so does everyone on Yelp who looks you up. Enjoy! (Catch that karmic sarcasm?) Welcome to the age of technology.

Protip: if you want bad reviews all you have to do is take people who walk through your doors willing to spend money and treat them badly."}
