{"text":"Fynn's has expanded their patio this year and it's much better than it was! It is certainly not the best pub bar, even compared to the rest on King Street but they've done what they could with the space. 

Fynn's has decent food and drink specials and it's always fairly easy to get a table (save for St. Patrick's day). On this day I had a jerk chicken wrap and thoroughly enjoyed it, I was surprised by the quality of the seasoning and the 'roti' style wrap. I'm sure this wasn't the last time I'll end up here!"}
{"text":"I live across the street from this place but only really started going on a regular basis when my favourite coffee house changed hands. Now I drink beer instead of coffee! 

...Anywho, contrary to some of the other reviews, this is *not* your average pub menu. They cover the regular pub-like fare in a delicious and well-priced form but they also do an exceptional job of some east-inspired dishes like tandoori tofu and lamb curry. Also, what 'typical' pub has boar shanks on the menu? (Sidenote: my girlfriend is vegetarian and they actually have some pretty great menu choices, i.e. their quinoa and tofu pie.)

Add in their daily specials (Mondays are $5 full-sized appetizers, Tuesdays are $4 Strongbow pints, etc.) and the recent two-can-dine-with-a-bottle-of-wine deal for an astonishingly low $40 (Sunday to Wednesday only), and you can sorta see why I like this place. 

It helps too that the staff are friendly and the Wifi is free. Now if you'll excuse me, I have to get back to my beer... er, I mean work.

(EDIT: I've updated my rating from four to five stars. I've been back enough times to see that they consistently deliver great food and service.)"}
{"text":"I loved the different Caesars on the menu.  I read a review on blogTO about how delicious The Red Maguire Caesar was.  I have to say, I disagree wholeheartedly.  The rest of the table shared my opinion.  (The ones brave enough to try it)

It was my friend's birthday, so we went in a group of 10.  We didn't try any food, but definitely tried lots of different drinks.  They have a unique drink menu, and it caters to a lot of different tastes.  Our server was attentive, and the bar had a pretty good crowd.  No obvious tards, and it wasn't a super young crowd either.

However, the selection was great, the rest of the Caesars were great, and overall a fun night out.  I was a huge fan of the London Calling Caesar It's Dill and Cucumber,and pretty refreshing.  The breakfast Caesar was good too!  (Mmm bacon vodka)

I'd go back for sure."}
{"text":"Does Toronto really need another Irish pub, that tries to be yet another Irish pub?  You know, for some reason on every corner, of every street, of every neighbourghood there's a McSomething's , or a Something O'briens, or better still, my personal favourite, the blatant Something's Irish Pub (in case we weren't sure); each desperately trying to fill their stools and line their tills by conforming to an exhausted Irish Pub template of dark wood, Celtic music, kilt clad servers (which is actually ok ;)) copious amounts of draught variety, and of course potato dishes; lots of fn potatoes.  Well when I first walked into Fynn's of Temple bar on King, I thought shit, I'd been fooled yet again; that those bastards at the Irish Pub University (IPU as it's graduates like to call it) have pulled the carpet from out underneath me once more, and that for the next couple hours, I'd have to again endure the Big Mac equivalent of being Irish. Where's the Camogie sign up sheet -- anyone?
Well I have to say Fynn's surprised me.  I think what happened, was that at first some collective wanted to open an Irish Pub on King, and then somehow a sensible local got a hold of it, and made an Irish Pub, Canadian- huh? Well that is, the décor is definitively Irish, down to the high back mahogany stools, and \"the Snug\" private seating, but the feel is very much a cozy Toronto bar.  The music is modern, and appropriate, the vibe is cool and comfortable, the food variety is wide and priced accordingly, live bands are often playing, and the staff are.....well just fun. It really is a great spot; perhaps a little too dark at times (likely shame and them trying to hide what they once were) but it's definitely worth checking out.  Word is that their brunch is great and getting better -- woohoo, no more Cora's!  Now if only we had a truly Canadian pub, where servers wore toques and hockey jerseys; where beer flowed from hockey stick taps, and where 'eh and 'aboot were bounced around the staff's lexicon as much as the hockey puck shaped fudge brownies they served.  Wait, shit that's Wayne Gretzky's down the street! Cheers!"}
{"text":"Rude about paying the tab, left for the washroom and they chased me down, embarrassing!"}
{"text":"We stopped by this location Saturday, April 5th, after the Jays game.
The place was full of fans, and others out enjoying the nice Toronto weather. 

We only stopped in for a few drinks, but we found the service to be exceptional, given how busy the pub was throughout the duration of our stay. We were seated immediately, and our waitress came by enough to make sure we felt attended to, even though we were only there for a short time.

The pricing on the drinks was in line for the area the location is located. 

Will be back in the future, mostly due to the good atmosphere and the 'people watching' opportunities."}
{"text":"Good food, fast and friendly service and decent pub atmosphere. Have been to this place many times and have never been disappointed with the food. If you like food and you want a pub in King West, this is the place to go."}
{"text":"OK, so I just got back from (yet) another trip to Fynn's of Temple and I feel the need to comment on this experience.
Normally, I just have a pint & ap's.....(or just multiple pints), but, I was feeling like something different today.
I was browsing the menu and figured I would try the Grilled Tenderloin Steak Sandwich. 
I'm VERY thankful that I made this choice as it was outstanding! (As I type this, I'm still drooling from that first, incredible bite of the sandwich!)
Not to toot my own horn, but, I consider myself a connoisseur when it comes to sandwiches. That being said, I had pretty high expectations, but, this sandwich didn't disappoint!
I know a lot of places offer a steak/beef sandwich, but, I find they're usually terrible! Besides the amazing taste, I especially liked how the meat was perfectly tender and moist!
Overall, it was a great experience (as always); excellent service, and a great atmosphere (perfect for Euro 2012)!
Pricing was decent (for a King West Pub experience) - Pint and Sandwich was $22.
If you've never been before, try Fynn's, as there is something for everyone (salads, fish, sandwiches, soups, etc.)!"}
{"text":"Fun, non-pretentious pub with delicious food and drinks. Food prices very affordable for the area. 

Menu is very pub style, some nice burgers, steaks, salads, and the usual appetizers. 

Service is great, everyone is super friendly. 

Though this place won't blow you away by any means, it's a great option and I highly recommend it for a drink with friends or colleagues. It's a nice down to earth environment, which is sometimes rare to find on King west. 

_______
My Reviews:

1 = Never again, stay far away 
2 = Not a great dining option
3 = Not my first choice but will make an exception to come back if it's the popular vote
4 = Solid restaurant with high potential to return
5 = Exceptional"}
{"text":"The reject spot on king west.  Food, atmosphere, service is terrible.  Stay away"}
{"text":"It has the nicest bouncers and staff in the world.
There are spaces where you could sit down and eat and also an area around the bar for people to mingle.
The crowd seemed to be 28 to 35 tonight.
Mostly dressed casually. Girls were not making much effort and boys were in jeans and t-shirt."}
{"text":"Came here for a office function with 20 people. Our server was great but ended up being charged for 2 bills. I contacted the bar who refunded my money and offered me lunch on the house. I Was in a rush so I declined but was very happy the way the management fixed the error. No for the food the brisket sandwich was excellent and quite frankly could pass for food from a pure BBQ place. Dessert was also good I high recommend the bread pudding."}
{"text":"If you're looking for a cozy-comfy space to enjoy a delicious meal with friends or perhaps alone, look no further - that's because Fynn's of Temple Bar has you covered. 

It was a regular Tuesday afternoon. Nothing exceptional had happened that morning, other than when I decided to mix the dark roast coffee with the regular blend coffee at my office. I put a little of both into my 'Crazy Cat Lady' mug and to my surprise the balance in flavour was actually quite nice. 

I decided to go with my co-worker to Fynn's of Temple Bar for lunch. We were hoping to get some work done and were looking for a yummy meal to accompany it. Well you can imagine the looks on our faces when the food arrived at our table, because our desires were fulfilled to the fullest degree. 

I ordered a Piri Piri Chicken Wrap, spicy, with fries. The waitress tried to up-sell me on a side of gravy, and succeeded. The hook was it's made with Guiness beer, which made me excited so I ordered it. When I got the wrap, I thought it looked so yummy, oh my gosh. 

I took the first bite into this one-of-a-kind wrap and my day took an immediate turn. The flavours exploded and did a salsa dance on my tongue. It's almost as if there was a party in my mouth and I had gotten the invitation. 

Every bite was amazing, and I finished my lunch with a smile on my face. My regular Tuesday afternoon had actually turned into one for the books. Thanks Fynn's, and see you again soon.

Your pal,

Mitch"}
{"text":"Tried the lamb and hummus dip and it was fantastic. Great sharing food and great service. Lovely atmosphere for a night out with your significant other or even a good place to get together with some buddies."}
{"text":"I find everything about this joint to be mediocre.  It seems more like a generic pub you'd find in Brampton or something.  Decor is nice enough, menu is standard pub fare, food quality is average, prices are on the high end of average...especially for pub.

They work hard to promote their weekend brunch, and as a bit of a brunch connoisseur I have to say I've been very disappointed with Fynn's weekend brunch.  Overpriced, underportioned, and no standard bacon and eggs option.  Better off elsewhere."}
{"text":"Fynn's changed their menu a bit and added some vegan options. The quinoa tofu pie is back (one of my favs), as well as tandori tofu and edamame. They also have some other interesting vegan/vegetarian appetizers like flatbread and sweet potato fries. Fynn's only gets 4 stars because the veggie burger bun looks like McDonald's quality. That aside, still one of my fav places to get out of the office and work over a beer."}
{"text":"We came hoping for live music, but even without it, there was a great atmosphere.  Definitely a good place to hang out."}
{"text":"I really like Fynn's of Temple Bar. I went there with my friend on
Tuesday September 16, 2014 around 4:45 p.m.. The service was terrible and the restaurant was not even that busy. First of all I had to ask for water. I think water should be put on the table regardless if people want it or not. I ordered a spring mix salad with grilled chicken,  beets, goat cheese, walnuts. My friend had steak with Yorkshire pudding. Our food took about 1/2 hour to get to our table. Not cool. As well when we asked for the bill the waiter took a while because he went to serve another customer. Hopefully next time I go I will get better service.  I do recommend this restaurant because  the food is great. 

Jacqueline K.
Toronto, On"}
{"text":"Went here last night around 8, it was jam packed! 

Food was delicious and you all have to ask for the hot sauce (it's a ghost pepper one) ..I had a teeny bit and my mouth was on fire! haha .. but seriously, everything I tasted was great. Service was prompt and very friendly!

$20 for an entree and drink is pretty damn sweet!"}
{"text":"I would stay away much better places around here horrible-food. We spend there over an hour defiantly would not recommend this place if you visiting from out of town like me. Maybe the local enjoy bad service and worse food"}
{"text":"The noise level could be too high. Atmosphere is obnoxious on busier nights. Service is hardly satisfactory. Food is alright. My friends and I love their wicklow chips. They're pretty much the only reason we go there. Their patio is nice too. And the brunch is delicious."}
{"text":"My new favourite after-work hangout - one baby step up from a grimy Firkin (I still heart you Firkin), but still very pub-like, casual, great location, and dim lighting that's great for masking a haggard appearance after a long day at work. 

Tuesday - $4 Strongbow... need I say more? There's also a martini night, tapas night, Guinness night, a complimentary oyster bar, and other daily features on the regular. Thank you for the Irish hospitality!

The food is good, what one can expect from a pub. The poutine is delish (a little light on the cheese), club sandwich is superb, spinach dip is decent, and the brie is UNREAL. I'm a big fan of ordering multiple apps as a main course, and Fynn's has a satisfactory menu for this. They also have some tasty Wicklow chips - the usual greasy satisfier after a crap day - waffle frites, faux cheese sauce, salsa, sour cream, onions, yummmm.

They have average fare, as well as some strange features like mahi mahi sliders, jerk tilapia & butter chicken (none of which I've tried).

My one complaint: the ladies bathrooms are always freezing. What's with that?"}
{"text":"Can you say identity crisis?  Is it an Irish pub or a night club with the music turned up twenty notches too loud?  How anyone was carrying any sort of a conversation is beyond me.  Our table had a screaming match with our server just to place our order.  The music itself was fine, unfortunately the volume was just obnoxiously loud for the small space.  I can appreciate good music, but when I walk in and see what appears to be a pub, loud music is the last thing I'm in the mood for.  Expensive pints, slow service."}
{"text":"Today's travels brought me into Hogtown for lunch meeting. Whipping out our Yelp apps we decided to try out Fynn's of Temple bar which was only a stones throw past Spadina on King West for us. 

I've been here numerous times before, except usually its for a little more liquid and little less lunch. Today I stuck to 1 pint of Amsterdaam Blonde (gotta love those blondes) and ordered Fish and Chips. Ill give this place one thing a really eclectic meal, a strong mic of Indian, Asian and UK fare, pretty good mix and from what I could tell from my dining mates the other items seemed up to par. 

We sat on the patio (which was steaming hot) but who's to complain as it might be some of the last patio days for awhile. If you can, drink and dine out here FOR SURE. 

My fish and chips were just the way I like'em. Deep fried with a good crunch to it. I did however find that the coleslaw was lacking a certain something...or maybe the fact that it was 75% shredded carrots is what threw me off. Also while the taste of the tartar sauce as on point the consistency left something to be desired. 

My one major complaint was the speed of service, I'm not sure how a lunch like this takes nearly 2 hours, but food took forever to come out and the wait in between us finishing our food and drink and receiving the bill was painful. If this is the speed then I would avoid this spot for you busy business lunchers. That being said, give it an honest try and perhaps suggest that you are on a tight timeline and not here to siesta LOL.

I'm sure I'll be back again, I loves me a good Irish bar with Indian, Asian and Irish foods.....

Another good thing, pretty respectable selection of Ontario Craft beers... looking forward to trying some of their stuff in bottles. 

Cheers and have a good weekend all.

Seacrest - OUT!"}
{"text":"Second time here and the food was as always, extremely delicious. 

Service can be a little slow but the alcohol makes up for it. Many choices and they are all very good. 

The wings were just the right amount and were the right mix of crispy and saucy. Loved the flatbread too, that was my favorite. If you are in Toronto, this is a good quick food spot/bar."}
{"text":"I was invited here by a friend to join a group of people for brunch. Normally I shy away from pubs. In Ottawa, pubs seemed to be the only option, so now that I am in the Big Smoke, I want to explore more \"exotic\" options. But, I am a gracious person, so I didn't complain about the choice of venue. Plus: $4 Caesars on Sundays!

Fynn's (I keep wanting to say Flynn's) is large and well laid out, with lots of different seating options and configurations. They also have a big-ish patio down one side, which is a bonus. Our server was super accommodating to our constantly expanding group, which included two little kids and a request for separate bills. 

The menu is pretty good -- there is a wide range of pub options, including curries, and veering into pasta. So: something for everyone. 

Would I come here again? Let's just say I wouldn't make a point to come down here, but if I were in the area, I would suggest it as a place to go if I were with a big group."}
{"text":"I haven't been here in years... and now I know why!  

I saw a poster for their \"patio opening party\" and decided to check it out.  

The live music was excellent.  Two man show.  They get an automatic 5 stars.  

The service was disappointing.  We were seated at a table that hadn't been cleared.  Half consumed water on the table.  Yuck.  We were given dirty plates.  I understand outdoor seating is iffy, especially when you leave the place settings out in the open, but every plate had black dirt.  It was gross.  We didn't use them.  

We ordered some wine and beer.  The second glass of wine took a really long time.  My husband didn't drink his beer because he didn't like it.  Not once did any server ask, \"Is there something wrong with the beer?\" \"Are you not enjoying the drink?\" Heck, the performer actually made a comment as we were leaving about the full glass of beer on the table but not one server did.  Terrible service.  They really seemed like they couldn't care less.  

The food was passable.  We shared the fried fish, shrimp, and calamari.  Shrimp were minuscule.  The calamari had zero seasoning.  So bland.  

Oh right, they advertised food and drink sampling.  We had a tiny cup of beer and one shard of flatbread.  That's it.  How is that for a \"patio opening party\"?  Pathetic if you ask me."}
{"text":"I have a confession: I love the music they play at Fynn's.  Last night, around 12:45, they were pumping out some Whitney Houston and it made me smile.

Great hangout for a drink or two.  Don't try and sit down and have a meal and get service -- the service is basically nonexistent unless you order at the bar and then sit down.  We were constantly hunting our server down all night (granted, she appeared to be serving a large portion of the place, but she also would stand FIVE INCHES from our table and not make eye contact with any of us EVER).   Some bill mistakes made as well, so pay attention!"}
{"text":"Ok, here is the thing, It seemed like a nice place until the waiter staff shit all over the bed. It was almost easier to stand up and walk out than it was to get another drink or pay the bill. Also, the bathroom toilet looked like it hadn't been flushed this week."}
{"text":"Went for late night dessert and came out satisfied. Chocolate Volcano is the way to go."}
{"text":"Had a pint and an appetizer in the afternoon here today. It was a solid irish pub, doesn't stand out per se but the music they were playing (we were sitting outside) was awesome. All this oldies music from Elvis to Tom Jones to The Supremes. Definitely made it a place to remember based on that alone. 
Service was fine enough, prices average, food average."}
{"text":"I wouldn't consider this bar to be 'authentic Irish' but I still thought it was great!
Went there for a few pints. Pretty standard place. Got some late night snacks from there which is great. 
I'd go back!"}
{"text":"Second visit to Fynn of Temple and both times loved it. Great service, ambiance and food. As a vegetarian I love the range of options, veggie poutine too die for and quinoa tofu pie was delicious. My carnivore crew was equally happy with their meaty options although my husband found his steak a bit too salty. All in all a very good experience and will definitely go back."}
{"text":"Great crew! Friday's are amazing! $3 pints 3 to 5pm and free oysters at 6 pm.,.,.,.,?!?!? where does it get any better than Fynn's on a Friday. cheers!"}
{"text":"If you're looking for older men, dark-lit rooms, and a decent patio - this place is for you.

I, unfortunately, wasn't looking for \"all\" of these things (feel free to interpret). Despite having your typical array of pub food and drinks, Fynn's overall atmosphere was a bit ... forward."}
{"text":"Very dark in here and quite loud. Food was alright and price was reasonable. The waiter was quite good and came to check often. I'm not a fan of the tables and how cramped it is with a large group. Not sure if I would come back."}
{"text":"Stopped by here on a Sunday evening about 9:00 with a friend.  Nice decor in the pub and very \"clean\".  We sat at the bar and began talking to the manager.  They make their own bacon vodka.  So he recommended the Ceasar.  It was served with a Slim Jim sausage to stir, with a bacon bit type of rim and was absolutely delicious!  The experience was limited to just this drink, we did not eat but will next time!"}
{"text":"Literally worst service I have ever had at a restaurant. After some drinks and some food (which was good), wanted to order more, waitress was MIA for 40 minutes (I guess a big table came in and they just decided we were not important anymore). After 40 mins ordered a pitcher through bus buy I flagged after waiting patiently, it never came after 20 mins. Finally flagged someone down to get Bill, another 15 minutes, some random bus girl brought without a pen. At this point decided I wasn't tipping (I am always a 18%+ guy, NEVER done this before) so just got up and left. They decided to add a 30%+ tip on themselves. E-mailed the head office, no reply. Disputing charge now out of principle. Screw this place"}
{"text":"An average low-key pub found on the King West strip. There's no need to dress up or call a limo to come here. They carry a number of beers on tap along with an average wine list. We ordered the garlic bread with cheese, which went really well with my glass of red wine. Price point isn't too bad as well.

Good for: casual drinks, snacks"}
{"text":"Amazing food! I was amazed. So good. Great, cold beer as well. Always recommend Fynn's."}
{"text":"Amazing Food and Fantastic Staff...  The place to go to hang out with your friends and enjoy great music."}
{"text":"Decent food, good price, overall great fifa final game watching experience!! You should try the coffee there if you are there during the day it is organic and tasty;)"}
{"text":"I can't believe I haven't reviewed this place before. When it comes to relaxed pub environment and good food, it just doesn't get any better than this. I've been going there for at least 8 years and the pub is extremely well managed - everything just works. The menu is much better than average pub food, yet the prices are reasonable. The service is always fast and friendly.

HIGHLY RECOMMENDED"}
{"text":"This Irish pub used to be part of the Fionn Maccool's franchise but has since become Fynns of Temple Bar, although I couldn't really tell the difference. 

I used to hit up this spot on a friday after a long week at work. Apparently all the 9 to 5ers in the area had the same idea. It's a busy spot and on the summer after work hours, good luck finding any room on the patio! 

The inside of the pub is large - tons of seating and an area to rent out for parties. We went here for many a work function and the service was always great. The food is predictable pub fare, but it's done perfectly. The steak and mushroom pie is savoury perfection. Their appetizers (like the calamari and nachoes) are also perfect with a pint after a rough day at the office."}
{"text":"Came here for their caesar and mimosa special... Totally worth it. Even tried one of their specialty Caesar's and it was delicious!! Lots of flavour and came with a nice pepperette. Two of us shared the smoked salmon breakfast dish, and the regular breakfast (two eggs toast etc) and it was all done really well.  Really impressed with the selection of foods and drinks - everybody else's meals looked amazing! Great ambiance and great service."}
{"text":"Overall, a great dining experience. The food was cheap yet hearty! I am definitely coming back to try more of their food!

Ps. They don't accept debit but they take credit + cash!"}
{"text":"Literally ended up here to get out of the rain.  Had a great meal (burger/fries, steak/mushroom boxty). Excellent variety of beverages. Super attentive waiter.  Cosy atmosphere despite large size. Musician friend impressed with the music choices. As pubs go, what's not to like? We will visit again."}
{"text":"For the ye olde pub feel with a modern twist- this is by far, the best 'pub' I've ever been to- you can even take a walking tour of the bar for its detailed decor~

Get your local microbrews and listen to live music or dj's spinning the perfect party time playlist- but make sure you arrive early and get some eats, as they have a chef preparing all of their meals... not just regular pub fare!  They even have daily drink and food deals!

Fynn's is in the prime location, in the heart of the King West scene, but offers a much more enchanting and earthy ambiance than its neighbours.  

Fynn's notably hosts some of the best, and best value, events.  We recently attend the Beer Tasting Dinner, hosted by celebrity Kevin Brauch, where we were served 5 beers and 4 courses for only $40!!!  Unheard of!!!

Last but not least, Fynn's has extremely awesome staff - courteous and consciously catering a high level of customer service- highly recommend!  Looking forward to the next event!"}
{"text":"There's something about this place that makes me come back over and over again. The room is a little bit dark and the tables spread out in an odd configuration, some high tops here, long tables here, banquettes, not particular layout but it still works. The waitresses are attentive and can rhyme off the 20 beers they have on tap which is quite impressive.

On thursdays, they have $6 martinis including a double grey goose cucumber fresh martini.... are you serious? I can drink those things all night - tastes delicious and makes me happier by the second! Their food is pretty good also at a really afforable prices (compared to all the other high enders on the street). Their menu is pretty eclectic, anywhere from fish and chips, butter chicken, to pot pies and the whole nine yards. I think every month, they have a specials menu which contains surprising items like mahi mahi.

I'm a yam fry lover and considering theirs were a little skinny, it still had good potato in them. 

When I went on Friday night, who knew that there were free oysters until they ran out! Sure I can't say they are the highest quality of oysters i've had, but can I really complain? Their mango salsa and their orange dill sauce were interesting flavours to top up a piece of raw oyster, but once again, it works!

I don't know how they do it, but I'm impressed. I will keep coming back to see what else they have in store!"}
{"text":"DO NOT USE YOUR CREDIT CARD THERE! A couple of my friends got their credit card declined and had to order a new card and one got it stolen there. Always use debit or cash. The food portion is large. Food is pretty good for an Irish bar."}
{"text":"Service was so-so. Some of the girls did work allot harder than others. 
Didn't have my water glass refilled at all. 
The prices and food portion are amazing. Massive portions for what you pay. Was very pleased with this. However just some small things that were a miss. Sheppard pie was bland and the fries they served with the poutine are just burnt tasting and soggy. (Not from the gravy).

Another annoyance was the wobbly table. Almost had a few drinks get knocked over."}
{"text":"It's 2016, we're about to colonize mars, and the management at Fynn's thinks it's cute to accept cash only, and *not tell you until the bill arrives*.  You're in the middle of the tech district, guys--get with it.  And no, we don't want to pay $6 in ATM fees so you can avoid $0.25 per transaction by accepting Interac.

Everything was fine until the cheque came and Fynn's decided to conduct business in the 19th century."}
{"text":"So, I got to know this place as another Fionn MacCool's (http://www.yelp.ca/biz/fionn-maccools-toronto-4), twin pub to the current incarnation of Fionn MacCool's on the Esplanade.  The King West incarnation of that pub was fairly similar save the huge patio the current Fionn MacCool's has.  Then suddenly I looked up one day as I was walking by and noticed that it was rebranded the cryptic \"Fynn's of Temple Bar\".  It's the same Irish style, same look and feel.  Just a new name it seems.  What caused the rebrand I've not been told but hey, it appears to be as good as it was.

You step inside below street level and there will often be bands or DJs playing depending upon the night.  There are daily specials as well that may well tickle the fancy.  $5.00 appetizers on Monday, Tapas Tuesday, $4.00 pints of Keith's on Wednesday, Martini Thursday, Free Oyster Friday, Caesar and Mimosa brunches on Saturday, and $4.00 pints of Steam Whistle on Sunday.  Now normally I'd be wary of a free oyster, but they've done it for a while without any closures by the city, and I can only guess that they may get their oysters from Rodney's down the street.

If the specials and the entertainment don't drag you in, vying for a spot on their patio may.  A long and narrow strip along the side of the building, it's somewhat sheltered from the din of King Street.  When you do get there, ask them what the deal is with the name."}
{"text":"Amazing brunch and daily specials. Service is fantastic. Highly recommended if you're looking for delicious comfort food  and cheap drinks."}
{"text":"Cheap beer on Wednesdays ($4 pints of Keiths) and really REALLY tasty food. The steak and mushroom pot braised with Guinness really hit the spot. The service was a little slow and it took over 45 minutes to get my order in, but it was packed and I was in a large group so it's pretty understandable."}
{"text":"This is a true \"local\" pub. The food is great, prices reasonable, staff are friendly and you'll find the owner in the bar most of the time. Did I mention the food is great? Located in the heart of King West a lot of restaurants have opened (and some have closed) but Fynn's keeps on going. Typical warm Irish pub vibe. I love this place."}
{"text":"This place really shocked me, I heard great things about it and decided to head over after work with a coworker/friend to grab a few beers and a bite to check it out. First of all the inside I found very dark and dreary feeling... the patio seemed nice but it was getting a bit chilly when we had arrived so we thought it would be better to sit inside.

The service was ok, really nothing to write home about but then again  I would rather service that is efficient then sociable, I'm there to eat not chat. So that didn't really bother me but the meal itself  was nothing worth mentioning either... they have a large menu with some rather odd selection of items considering the theme of the bar itself. Much of the food on the menu was actually Indian inspired, which I love but I prefer eating Indian food at an Indian restaurant mind you. So after having two small chicken dinners which were nothing like the menu described; cause if these chicken breasts were stuffed it must have been with chicken because it was basically a chicken breast, some mashed potatoes and a few veggies we asked for our check which was when we found out that they conveniently DO NOT take debit. There are no signs and the waitress doesn't mention anything until she hands you the bill so you are then FORCED to go to their ATM and pay a $3 service charge plus the charge from your own bank! Clubs don't charge you that and this grungy little pub does?!? 

So we paid an $80+  bill for 1 small app, 2 small chicken meals and 2 beers each... ridiculous, I won't be back"}
{"text":"It's a few steps from work and I've been there a couple of times. It's a good looking place, with plenty of options on their menu - not just the regular pub fare, but a little bit beyond. 

Martinis are $6 on Thursdays, you can't go wrong! But their hidden secret, in my opinion, is more expensive - the smokehouse caesar, ABSOLUTELY DELICIOUS, it costs you 11 bucks, but worth a try. It's nice to see they offer a vegan caesar too! 

Food, all the times I went, was good. I've tried from poutine and french onion soup (delicious!) to burgers (they had bison and I loved it!). 

Definitely, a place to go and have good food."}
{"text":"Been here twice with my girlfriends for food and drinks. Great atmosphere for a pub to just chill and catch up. Music is great for old school early 2000s top 40 hits. Would come back again."}
{"text":"Fynn's is a pretty decent place. I used to work down the street so we'd all end up there quick often.

On Friday's they have complementary oysters, so I definitely like to take advantage of that. Also on Tuesdays they have a 4 dollar strongbow special which is great for those who like cider. Innis and Gunn is probably the best beer they have on tap which they just started doing a while ago. As for food, I recommend the lamb shank, or the flatbreads. The waffle fries is also a nice plate of food to share. 

All and all, it's a good place to go with co-workers or a group for drinks. Not so much the one on one place to have a date with the Mrs, or a first encounter."}
{"text":"A bars a bars a bar.  Fynn's is just a bar, but it seems to stay afloat due to it's location.  It's in a prime location for after work drinks, so they don't need to try to hard to draw a crowd.  If you'e in the advertising or entertainment industry - you've probably been here many times.

The food is just so so and the staff, although sweet girls as kind of slow.  They only have an ATM, so bring cash or be ready to take out your credit card."}
{"text":"Scotch lovers, this is a great place for you!

They serve the scotch up all fancy for you, neat, and include on the side a little water container with a straw, and ice. You can order it neat and then try it with water or ice or both and decide how you like it best. I thought that was a nice touch. I was impressed! This was the place I discovered some of my favourite scotches.

I've been here twice. Monday night with $5 appetizers was great deal and I was happy to be there on a Monday for that reason. My friend and I got some appies and they were pretty tasty as far as pub food goes. Definitely better than your average pub fare.

The second time I went there I ordered the Great Canadian Wilderness burger, which was made of ground bison. They were able to make it medium for me (even though I asked for medium rare), and it wasn't dried out. The patty was more or less flavourless compared to other bison burgers I've had (and the ones I make at home myself)--I wasn't impressed. 

I ordered a Manhattan Proper, which was what it was called, I'm not just being pretentious. It's made with Woodford's Reserve and some other stuff that makes it taste delicious. This cocktail was awesome. I was very impressed to order such a cocktail at a place that looks like a pub.

The mediocre bison burger and somewhat slow service would be the only down sides, otherwise this is a solid place to go. No debit FYI.

Every drink I've had here has been great (mainly just scotch and the Manhattan Proper). The food complements it well enough that I would say this is a great place for drinks and munchies."}
{"text":"Very nice restaurant with many varieties of food on menu. We were pleasantly surprised  to find Indian food on the menu and much to our delight the mixture of spices was excellent. Definitely recommend the chicken tikka masala. Also got the chicken salad with goat cheese that was amazing as well. Very cozy restaurant. Street parking is close by."}
{"text":"Slow service - and food was not that great. We had the curry and it was relatively flavourless. I had an item on their summer menu - a salmon and soba noodles dish and salmon tasted old and was way overcooked."}
{"text":"We came to Fynn's for birthday drinks on a Saturday night around 9pm.  The place was relatively quiet so lots of seating for our group of 14.  Apparently, it's more of an after-work drinks kind of place so it's busier on weeknights says a friend who works in the area.

We ordered a few pitchers to start ($17).  They had Mill Street Lemon Tea beer on tap so that was a bonus.

We got a some snacks - poutine ($8) and wanted to get nachos but they didn't have that on the menu.  What kind of pub doesn't have nachos?  Fynn's version of nachos were waffle fries topped with nacho dressings.  Okay, good enough.  We also tried the pull pork poutine ($10) later in the night which was actually much better than the regular poutine.  We also ordered a few cocktails from the drink menu ($8-$10).

Service was a bit slow at times.  It didn't seem like they had too many wait staff working.  We did have to wait to order more drinks and get our bill.  It wasn't terrible as we weren't in a huge rush anyway but we wished the service could have been more attentive.  The server didn't have any issues with splitting bills and keeping the tabs separate so that was a plus.

Fynn's is a nice place in a sea of trendy expensive bars in the area (Brassai, Brant House, Spice Route, etc) so if you're looking for something more casual then I would recommend Fynn's."}
{"text":"Classic pub food at a decent price but has spotty service. Came with friends during weekday lunch and it was less than a 5 minute wait for a seat. Located in the basement floor, it had a typical pub ambience with a dark, wooden interior and comfy seats. We ordered from the Temple Bar Favourites list as the rest of the menu was all over the place (they serve Banh Mis??), and they were all decent:
- Shepherd's Pie: savoury with the right ratio of ingredients, good beef
- Steak and Mushroom Pot: same comments as above, plus a bonus of nice flakey pastry 
- Fish and Chips: Crispy and cooked just right 
Good that they offered smaller portions cause the regular sizes were food-coma inducing, definitely good value for the size. 

Perhaps it was an off day but we had to wait 45 minutes for our food. Our waitress was very apologetic and offered each of us $5 vouchers for our next visit, though it would've been nicer to get an immediate discount. Wouldn't recommend for a quick lunch, that's for sure."}
{"text":"I'm not sure why I have been visiting/reviewing so many Irish pubs lately! (perhaps I am heartsick for Dublin?)

Fynn's is another basement pub, but the ceiling is high and you don't really notice you're half underground at all. Everything is dark and it's really quite spacious for an Irish pub. Some nice booths and other areas with more open table sitting too.

The wine here tastes of absolute piss. Of course, ordering wine from an Irish pub was bound to end in failure, but I thought I would mention it in case you have any bright ideas about sampling the wine here. Both my glass of cab merlot and my friend's glass of shiraz were awful, maybe poured from bottles that had been kept open for far too long.

Anyway, please order beer; they also do decent caesars. 

On Tuesdays they have some kind of \"tapas Tuesdays\" food menu but to be honest it didn't look particularly appealing.

Place gets packed with an after work crowd and Friday and Saturday evenings can be full up too. I like the clientele, mostly 30+ crowd and low on the douchyness scale."}
{"text":"Just another Irish basement pub. However, it's pretty chill compared to the other options in the King West area. It's a good, solid space with high ceilings and a good selection of beers on tap.

If you just want a place to relax without getting all dressed up or waiting in huge lines in King West, then this would be a place worth looking into."}
{"text":"The weekend bruch here is pretty good with $4 mimosas. I had the eggs benedict with a side of salmon, a mimosa and a pint of Erdinger, all good."}
{"text":"Definitely no more than 3 stars. I've come here twice and it's usually relatively busy, but later in the evening, it can be slow. This is not an authentic Irish pub by any stretch, more like a faux North American tourist trap. Beers are OK and service is shruggable. Seeing as this place is in the financial district, with so many other pubs out there, why come here? Wouldn't really recommend."}
{"text":"I've been here three times now, two of those being right after Elite events. Always had a good time.

The second time I came was for their Octoberfest beer tasting night hosted by Kevin, the MC of Iron Chef. From beginning to end it was a great evening. Awesome food and solid beer choices.

On my last trip I was a little confused as to how the table service worked. My friend and I were at a table and there were waitresses milling about, but we had to get our drinks from the bar the whole time we were there. Not a big deal, just confusing. 

February Food-Free Yelping Challenge 3/29"}
{"text":"Nice, romantic and cozy décor with a great selection on the menu. Excellent flavours and much better than your standard pub."}
{"text":"Surprisingly good pub food. Love this spot for a nice lunch patio. The salmon quinoa salad is great. As well as the chicken sandwich. Drinks are always good too."}
{"text":"I came here on a Friday, free oyster night, with several coworkers.  An excellent ruse to get us in there!  The oysters were not amazing, but if something is free you can't complain!  

Your typical beers on tap and beverage menu.  Typical pub fare.  

Staff here are friendly and prompt with service.  Laidback and unpretentious vibe.

We ended up staying for dinner, and I shared a grilled chicken tabbouleh and a lamb burger with my colleague.  The meat parts (grilled chicken and the lamb burger patty) were a little bit tasteless.  As in, it tasted like no seasonings, not even salt, were added to them.  Which is great for someone with high blood pressure, but I would likely not order them again unless I had to.  However, the salads were good, although the tabbouleh was actually not tabbouleh (it was couscous!)  

Overall, food is A-OK and is there to soak down your drinks.  You're there for the atmosphere and the company you're with."}
{"text":"I've passed this place many times and still have yet to go in, yet I've tried many of their dishes. Oh the magic of UberEats! What can't you get delivered these days?

I had a hankering for French onion soup and my friend wanted chowder. It's soup season, baby! Fynn's magically had both on their huge menu so we ordered them. Our warming bowls were delicious, as was their tika masala curry. 

If I'm on King W and looking for a cheap pint and some more heart-warming snacks, I'll definitely finally dine in at Fynn's."}
{"text":"For some reason I really dig this place...came here twice so far in the new year, both times were great.  Did you know, that on Fridays - a random dance floor emerges like an oasis in the middle of a desert of tables and chairs?  I didn't know it was going to happen, but it did.  And it was awesome.  Sort of.

Anyway, the food is pretty decent for pub food - the first visit I remember cramming some sort of interesting pouting into my drunk face, so I suggest any of the poutine.   I like sitting at the bar itself, it's got a good vibe and you can peer around and check out the situation.  The second time I visited, I had reserved a long bench like table at the back, which felt a little too secluded for my liking (we were also partially hidden behind a large curtain) - I'd suggest grabbing seating closer to the front.  We were also beside some sort of awkward gathering on the step-up platform area, and people kept leaning against the iron-fence thing which meant we had a row of butts behind our heads for most of the night.

Depending on what types of butts you want to see, this can be good or bad.

*Editing* I added a star, because I like coming here on Wednesday and getting a cheap pint of Keith's.  Alright!"}
{"text":"Fynn's is a reasonably cheap local restaurant, successfully pretending to be a \"bar\".

Enough space inside, though it always feels a bit too crowded. Well prepared food (a bit more to choose from, compared to a usual bar menu). Not that ample, but still acceptable drinks menu. Lots of cozy spots (book them in advance), and the noise level is just a tad bit too loud, to my taste.

I would not plan to visit this place in a group of more than five, maximum six. And I would not expect any chefs' marvels, or mind-blowing beer list. Service is generally ok, but variable.

Yet, Fynn's is a perfectly good choice as an inexpensive dinner location, or a drop-in place when you are around King and Spadina."}
