{"text":"Was disappointed that they didn't have a vegetarian entrée on the lunch menu so I ordered 2 salads and two vegetarian dim sum to go. I Was not impressed with dim sum but we enjoyed the flavorful and healthy salads.  (Roasted carrots and heirloom tomato). My lunch companion and I were still hungry so we stopped and got bagels after.

Staff is friendly and decor is nice."}
{"text":"Enjoyed lunch.

Curated wine list, our choice went well with the food.

Dim Sum small bowls:
small bowl of brussel sprouts sour/sweet/spicy - good
cubed pork belly - may be the best I've ever had, would come again just for these.

Carrot salad - plain carrots on top of lightly dressed romaine with a unique and lightly spicy (coriander?) dressing - would love to recreate this dressing at home.

Bun with mortadella, pickles, mayo. Not my favorite, too much meat, not enough other ingredients.

Pork ramen entree was okay. Lots of noodles and surprisingly bland broth with two big pieces of good pork belly that were unwieldy to cut down. Other choices looked better.

House made condiments:
Red spicy one, my favorite, saved the ramen and could have helped the bun dish.
Sweet, chutney - not my favorite flavor profile with all the sweet, more like a jam.
Soy sauce with some vinegar.

Overall, I would return to try more menu items."}
{"text":"Highly recommend this restaurant. Very trendy and upbeat atmosphere. We didn't have to wait at all which was surprising considering how crowded it seemed. The waitress took us back to a more quiet area in the back of the restaurant for smaller parties. We ordered off the menu and although small, plentiful. There was also someone who wakes around with smaller fishes on his platter for anyone who wanted to take one right away. We got the edamame and a pork pieces dish. These dishes were filled with flavor and perfect starters. Our first dish that we ordered that came out was the pork potstickers. These were probably the best pot stickers I have ever endured at any restaurant. Next we got the summer California roll which was like any California roll but with mango and very crunchy crab. Very light but still delicious. Still to come are the pork ramen noodles and the green tea crime brûlée. Very excited"}
{"text":"Great atmosphere and decor! The staff were friendly and accommodating. But the food was only average. I had eaten here once a few months before but wanted to give it another shot. This time I had the Seafood Coconut Curry Noodles. The scallops and shrimp were cooked nicely, but the noodles lacked flavor. I felt indifferent about finishing the meal. It's a couple steps above Chinese takeout, but not particularly outstanding.

The service was also only average. Our waitress was not attentive. It took a long time for our drink orders to be served. The Dim Sum server stopped by our table before we were ready, but then he never returned to serve us later. When our dishes were brought out, three of us were served at once while the 4th person in our party waited a significant amount of time for his dish.

Overall, there are too many other great restaurants with similar atmospheres and prices to return a third time."}
{"text":"Ate here Christmas Eve and was not disappointed!  Loved the atmosphere and the service was excellent. Our waiter made great recommendations. Definitely will go back."}
{"text":"Spectacular!  What a great evening we had!

We made a OpenTable reservation and in the notes requested a different time.  They called us and told us \"No problem, thanks for choosing to dine with us!\"  Very nice.

The Dim Sum was awesome as was everything else we ate.  Perfect match of flavor and texture.  Everything was also properly seasoned....HUGE plus!

I had a cocktail, and it was delicious.  I've drank there before, and those bartenders have genuine skill.  They use great products...local and beyond...and mix it up well.  Their homemade tonic is out of this world!

We dined here before attending a show at Heinz Hall.  We will absolutely repeat that next time...thank you Grit & Grace for being a great spot!"}
{"text":"We went on a Sunday night for dinner and we loved it. We were pleasantly surprised by their concept of small and large share-able plates which meant we got to try more things.

We got a bunch of different things but the real standouts were the pork belly bites, the brisket sandwich and the chicken meatball ramen. Those dishes were fantastic and we definitely left with full bellies and smiles on our faces."}
{"text":"Our first time there and it was terrific. Nice conccept, Asian fusion, Dim Sum and a modern twist to traditional dishes and preparation. Might sound confusing, but well executed all around. The meal started off with cocktails, again with  G&G's own take followed shortly by a selection of 5 Dim Sum dishes. Pork belly, scallop ceviche, beef tartare, duck confit and an asian style cold noodle....wonderful all. Mains included a seafood sausage in brodo, a crispy and unctious pork cheek with a fried egg and a tremendous goat curry stew. All I can say is that, after being open only 6 months, this is a \"must\" stop, being a foodie or not. Excellent  food, service, and ambiance."}
{"text":"One of the top two places we have been to this year. Every thing we ate was awesome. They were packed so we sat at the bar. The two bartenders were awesome (Erin and Aerial I think). Friendly and quick. Awesome date night."}
{"text":"I rode the Amtrak Philadelphian train with my lovely girlfriend for our first trip to Pittsburgh last night, did a little research as I approached the city, and finally decided on Grit & Grace for dinner. 

It was largely hit-or-miss. We chose it because it had a nice stout on draft, Asian-fusion sounded good, and it seemed like most of the nearby restaurants expected you to pay double or triple what G&G was charging for a meal. 

The interior is nice and comfortable. Dark woods mixed with tarnishing brassy metals atop segmented communal tables. The booths look comfortable and lit abstract wooden sculptures spot the walls. Utensils and plates match the theme, and everything just feels solid.

The wait staff is kind, young, and attentive enough, and the food came out quickly. I ordered the chicken ramen, and my girlfriend ordered duck confit lettuce wraps and the mortadella bun. After requested, the American dim sum plate strolled by, and we picked the famed pork belly bites and crispy buttermilk-ranch chicken wings.

Pork belly bites were unfortunately disappointing. Not as tender as I was hoping and the drizzle on them didn't add much. Chicken wings were delicious and gone very quickly. Decent portions for each of the $5 dim sum bowls. The lettuce wraps were great, and the highlight of the meal. A bit unwieldy, so pick off some of the meat before diving in. The ramen was okay. I asked which of their three varieties was best, and was told the chicken was the most ordered. The broth was better than expected, and the chicken balls were flavorful but very salty. Finally, the bun had a great filling, but the dough could use work. It might have been Pillsbury.

Overall, it was okay. The environment was lively, and the dark beer they had on draft was awesome, but there's probably a better food option nearby."}
{"text":"We went on a Friday night (we had reservations) and it was rather busy, but we enjoyed the experience.  I had the chicken meatball ramen, and it was excellent, especially the meatballs.  We tried a couple of the dim sum, which were pretty good as well, although I would probably just stick to the ramen next time.  I thought the price was reasonable and the atmosphere fun, I would definitely go again."}
{"text":"I picked this restaurant because it sounded like an interesting place for a night out while my foodie husband and I were visiting Pittsburgh from DC. 

The restaurant was fairly empty when we arrived, but we were shown to a small dark table at the very back of the restaurant right across from the server's station and an open door to a service corridor--not the most appealing location for a special meal.  I asked whether we could be seated at one of the empty booths closer to the front of the restaurant but was told no.  I assumed this was because they were being held for parties of four, but on our way out, noticed that parties of two were seated at most of them. The host spoke to us as we were leaving to ask whether everything had been OK and I told him I was unhappy about his having said we could not have a booth when other parties of two who came in later were seated at those tables. His explanation was that the restaurant's computer system assigns tables based on when reservations were made.  Perhaps that is so, but we weren't exactly walk-ins--I'd made our reservation nine days in advance--and being seated at a crummy table when better ones were empty at the time we arrived got our meal off to a bad start.  

I was excited to see that the draft beer list also included a draft cider.  I ordered it expecting a long drink--something similar to the large glass of draft beer my husband received, but cider rather than beer--and was surprised when what came was a small portion in a brandy snifter type glass. The menu or the servers could make clearer that the cider is not a long drink.  The cider itself was OK, but nothing very special (in contrast, for example, to the truly wonderful local cider I had recently at Woodberry Kitchen in Baltimore) and at $10 for a small portion seemed overpriced. 

We chose three of the dim sum items.  The smoked tofu with noodles was tasty; my husband liked the pork belly bites (I would have liked them better if they were less fatty); and we both agreed the squid salad was uninspired.  Next, we shared what was described as a cooked carrot salad with romaine hearts and other ingredients.  The cooked carrots were very flavorful and the dressing was nice, but the salad was mainly romaine and again seemed overpriced for what it was.  

For the main course, my husband had the goat, which he thought was tasty--not wow, but tasty.  I had the scallops with Brussels sprouts; the scallops were nicely cooked and the dish overall was OK.

Our server was pleasant enough but not especially engaged.  If we asked questions, she answered, but she didn't offer any explanations.  For example, the menu is structured unusually and I would guess most first-time guests would appreciate some tips about possible ordering strategies, but we had to ask.  The same was true of the dishes--both of our entrees contained unusual ingredients (thin pancakes with the goat, a large sort of crouton with the scallops), but we had to ask for an explanation.  

Overall, I'm glad we tried Grit and Grace, but don't think we'd go back."}
{"text":"Went to Grit and Grace after the ballet on a Saturday night.  I ordered the pork ramen and I was very disappointed.  I was expecting a savory pork flavored broth, but instead there absolutely NO flavor--as though it had been watered down to extend it at the end of the evening.  And it was served lukewarm at best.  The only flavor was in the mushrooms which seemed to have been marinated in soy sauce.  And even though many foodies are enamored with pork belly, I'm not and its not what I expected when it's billed as roasted pork.  I have rarely ever told a server I didn't like my meal, and can only remember a handful of times that I didn't even care to eat the entree I ordered, but this was one of those times.  Thankfully they took it off of our bill which was good of them, but I also would have expected the manager to come over and find out what was wrong.  My husband and daughter had the brisket and mussels, respectively, and even though they liked their entrees better than mine, I doubt we'll be going back.  There are other places we've enjoyed a lot more.  Perhaps we hit it on an off night or they were off their game due to the late hour, however, it certainly didn't live up to the accolades it's received on this occasion."}
{"text":"In a word...perfect! We'd initially reserved a week past, but Open Table screwed up and failed to find the restaurant was closed."}
{"text":"I don't often write reviews on restaurants because I work in the industry, and usually critique pretty hard whenever I dine out.  The only thing lacking in this restaurant is their service, and as a front of house restaurant manager, these are the things that peeve me the most.  Our waitress was okay, nothing special.  We had a 9pm reservation and upon arriving 15 minutes early, the host quickly brought us to our table.  Our waitress greeted us after about 5 minutes, mind you, the restaurant might have had a total of 6 sat tables at this point.  She took a drink order for 2 of the people in our party, and quickly walked away before checking to see if myself or the other guest in our party would like to place an order for a drink. We waited 20 minutes before the ordered drink came back to the table, only to have to wait another 10 minutes before my drink and my friends drink to arrive.  I ordered a Manhattan, but again had to wait for the server to obtain their bourbons available before placing my order.  After the drinks were dropped we got to take a peek at the Dim sum tray.  I ordered one of everything: house made kimchee, general tso cauliflower, pork belly bites and a himaichi roll.  These were all fantastic aside from the himaichi, which was good, but nothing anymore special than my usual takeout sushi order on a Friday night.  For dinner we all ordered multiple plates so we could all enjoy the multiple dishes that sounded incredible.  I myself ordered the Pork Pastrami sandwich, Mortadella Steam Bum, and the Dan Dan Ramen.  That's right, I ordered two entrees and a small plate for myself--and I ate everything.  The pastrami sandwich was honestly one of the best sandwiches I've ever had at a restaurant.  Simple preperation but the flavor combinations were on point.  Between the garlic aioli, the provolone cheese wiz and the baguette, I don't know what I loved the most.  The steam bun was tasty and a nice use of Mortadella, that you don't often see most places.  The Ramen....oh the ramen!  It was a great combination of 5 spiced pork sausage, mustard greens, a soft poached egg and a spicy chili sauce.  I honestly can't remember the description of the dish but it was again, a flavor explosion that I had no issue inhaling along with my 2 other plates.  Friends at the table ordered the beef tartar (the quality of the beef was outstanding, sweet and delicious, and the set on the plate complimented the dish well), short ribs (the biscuit was incredible and it reminded me of the holidays, great flavor and presentation) and other various types of ramen.  Overall, we left full, but not feeling like death.  The prices were more than fair for the quality of the product, presentation and location of the restaurant.  The only suggestion I could make is get on top of the service staff to be more attentive and personable with tables.  Our server was sloppy in appearance and seemed like she \"wasn't all there\".  The guy expoing plates to the table was more personable than our waitress was, I wish we could have just had him all night.  I will be returning and telling all my friends about this unique spot in town!"}
{"text":"Dinner: 

Carrot salad with edamame and sake dressing was light and savory.

Vegetarian ramen (which is not on the menu) was perfectly sized for a light eater. It had button mushrooms, amazing fried tofu and was garnished with perfectly crispy seaweed.

The short rib on the biscuit was beautiful and creamy.

They also serve unique and inviting tea and ice cream flavors.

Overall the food was light in quantity, which to me is a plus because it leaves room for variety and is not overwhelming. 

The waiters were all very nice and truly interested in the menu, they all loved this restaurant's food.

I've lived in Pittsburgh for nearly a year and this restaurant is within the top 3 for where I've been!

Pricing is medium. Not too cheap, not overly priced either."}
{"text":"Great staff. Very chill. Delicious food. I literally walked all over the area looking for a spot and this is the only one that offered anything remotely delicious and healthy."}
{"text":"It's hard for restaurants to earn a 5 star review from me, but I think I found my 5 star in Pittsburgh. The food was perfectly portioned -enough for a small dinner after a workout or order multiple dishes to share with friends. The service was excellent the bartender knew the menu and the drinks. I highly recommend this place to my friends and I will be back in the future. 

The ambiance was nice. The food was delicious. Some homemade mixers and locally sourced food. A solid restaurant."}
{"text":"The pork dim sum was amazing for the first time. It was alright for the second time I went there. The beef biscuit were amazing for both times. Loved their sandwich which I forgot the name.(I believe they only have two sandwiches) But I have to say it is pretty greasy and salty. The atmosphere was quite relaxing and the service was good."}
{"text":"In a word...perfect! We had originally booked a week ago, but Open Table screwed up and failed to notice that the restaurant was closed. Grit & Grace was super apologetic (even though it wasn't their fault) and treated us very well. The decor is a big improvement from Taste of Dahntahn, which used to be in this space, and so is the food and service. The Dim Sum Girl (that's how she introduced herself) brought us some amazing appetizers. I particularly like the Crispy Brussels Sprouts. The Corned Duck Breast with rye noodles and pickled daikon had a rich soy-flavored broth. The desserts (not on the website) were unique. I had Coffee Mochi with chocolate, lemongrass cream, chocolate and crumbled Froot Loops.  We will be going back. One caution: this place is noisy!"}
{"text":"huge fan of Grit & Grace! their food reminded me of the asian food I grew up eating but elevated and with a twist which made my inner foodie very happy! we tried all of the dim sum except the kimchi and the pork belly bites were my favorite and actually the highlight of my meal. they were cooked perfectly, melts in your mouth, and had a delicious complimentary sauce. I'd also recommend the short ribs, so good!"}
{"text":"We have eaten here several times, as we live in the neighborhood.  Had dinner there just the other night, and had to write a review.  

In short, this is the kind of cooking that made me want to be a chef when I was a younger person.  Truly creative, beautifully expressive, engaging.  Yes, those are some pretty tall words for a restaurant review, but truly fine food should be an experience, and Grit & Grace delivers that in spades.

First, the cocktails.  They don't make as big a deal about it as say Tender in Lawrenceville (which makes some SERIOUSLY good cocktails), but I would say that their Gin-and Tonic is right up there with the best of the \"new-old cocktail\" trend.  You will never think of a gin and tonic the same way again.

Next, the Dim Sum.  This is part of their theme, and it really works.  They have my favorite Kimchi in all the land.  Maybe not as funky as the best authentic Kimchi, but fresh, tasty, spiced very well, constantly good, and delicious.
They have a Soba Noodle and smoked tofu dim sum that is also excellent.  Noodles cooked perfectly, great layering of flavors, beautiful tofu.  Did he just say \"beautiful tofu?\" Yes, he did.  If you've seen my review of Nine-On-Nine, you know how I feel about restaurants serving lame vegetarian dishes.  Grit & Grace serves unapologetically excellent vegetarian dishes, and that's how it should be done.  A restaurant should never say \"we're serving this dish because you don't eat meat\".  They should say \"we're serving this dish because it's truly great tasting.  BTW, it doesn't have meat in it.\"
The Pork Rillette (sp?) Dimsum is also beautiful, so good in fact that you're veggie-friends can just eat the greens and pickled veg and have a terrific experience (if they're not hung up on letting you eat the pork Rillette, which is yummy).

For dinner, we had the Seafood sausage, and their Ramen dish with pork belly and 5 minute egg.  The seafood sausage was one of the best plates I've seen, and enjoyed in a long-long time.  Beautifully layered flavors, and if I could get that sausage in the market, it would be in the cart ever week.  The Ramen was equally good, with a fantastic broth and perfectly cooked ramen.  And the star of the Ramen dish?  The marinated shitake, and the triangle of seaweed on the side of the bowl.  No kidding. Again, beautifully layered dish, where each component brings something to make the dish more interesting, not just more complicated (I'm looking at you Cure...).  In case you were wondering, the smoked pork belly was also great, just not in a way that was so unexpected.

Portion sizes are perfect as well, just a little on the small side, so you're satisfied without being fatigued.  With the Dimsum beforehand, it's just right.

Now, I've given 5-stars because I don't think you can serve food that's this truly interesting and not get the recognition that that deserves.  But all is not perfect at Grist & Grace.  Their front-of-house has always been a bit \"wobbly\" in our experience. Just a bit not quite right.  And for a restaurant that has the Dim Sum thing as such an important part of their overall theme, it's a bit surprising how long it can take for the first round to make its way to the table.  The dim sum dishes are cold, so....

But with that in mind, go there, it's definitely among the very best of the 'burgh."}
{"text":"My husband and I were bowled over with the level of service AND the fantastic menu options. Every dish we chose was excellent, and while some may not have aligned with our preconceived notions, each was flavorful, unique and delicious. 

Our favorites: 
-Tasso ham flatbread: definitely for sharing, the nuttiness of the fontina cheese worked well with the mushrooms and greens. 
-Steamed bun: mortadella was fantastic--this was my husband's favorite. He was disappointed I made him share a bite:-)
-Porkbelly bites: this dim sum option was superb--smoky and melt in your mouth
-Squash and farro salad: definitely big enough for a meal on its own, the green curry really set off the other flavors

Also great:
-Short ribs and cream biscuits: super tasty, but the steamed bun was better:-) 
-Cereal dessert: really great texture--loved the fruity pebbles!

Additionally, the cocktails were swoon-worthy. My bourbon loving husband, who never orders mixed drinks, loved the G&G. I ordered the Jambie the Genie, which was served out of vintage Tiki themed glass. I wanted about 4 more!

On top of all of that, the service was excellent. Alexis was informed, personable and not at all schmoozy or pushy. 

We will definitely be coming back:-)"}
{"text":"I got the opportunity to come to G&G for restaurant week. My husband and I got our own appetizer, main course and dessert for $25.00 each (worth it)! 
I got the crispy wonton salad and Jake got the deep fried chicken wings. My salad was okay. To be completely honest, It was a bit bland and basic. The deep fried wings, however, were very crispy and filled with flavor. 
We both got the pork ramen for our main course. I love ramen and this place did not disappoint! The pork inside the bowl was generous, they were large cut tender pieces of pork. I ate my ramen to the very last drop. 
Dessert was also good! I got the five spice sticky buns and my husband got the green tea creme brûlée. I personally liked my choice better:-) It was a pumpkin flavored sticky bun with coconut icing. I don't think I would ever have thought two flavors would be good together but they were delicious! 

The drink menu was large and they had everything from canned beer to cocktails made for four people. I personally can't say too much about the drinks, I stayed with beer:-) 

The ambiance was cool. They had a rustic but modern vibe. As for the service, it was okay. It took a little bit to first get waited on but it went smoothly after that. 

Recommend!"}
{"text":"I attended a birthday dinner here for a friend on a Thursday evening. I had high expectations, as I'm a huge Asian food lover and have heard great things about Pittsburgh's recent restaurant openings (as I've just returned to the city). However, I was disappointed with the food and service. The dishes we ordered really lacked a meaningful Asian influence (although no one ordered the noodle dishes) and flavor. Skate cheeks, placed on top of small pieces of white toast, were pretty bland. The fried Brussels Sprouts were the highlight (obviously, but don't beat Meat & Potatoes). We should have skipped the desserts - both options were vanilla custard-based, one topped with Fruity Pebbles (somewhat cute, but very poorly executed).

In addition, our server seemed to lack experience and confidence - we had to ask to place our order AND had to ask for recommendations, as our server never introduced herself nor asked us if we'd ever dined there (no one had). 

Hopefully the next season's menu will feature more \"grit\"...authentic Chinese and/or Southeast Asian flavors (ala Red Farm in NYC), b/c right now it seems they are trying too hard and missing."}
{"text":"I came here on a girls' night out adventure. Though we came down on a rough night (cultural events galore!) We had placed a reservation ahead of time (woohoo no waiting!) and we were happily seated in a comfy booth in the back. Our server was warm and pleasant and her over all demeanor was attentive and very much on point. 
The food and drinks were as spectacular as they were anticipated - the type of quality that you find people instagrammin' about :) and we left feeling happy and content. 
Thumbs up Grit & Grace!"}
{"text":"Pittsburgh's food scene is killing it.  Had the brisket, steam bun, pork belly, and chicken wings.  A lot of creative and delicate flavors (except for the wings which were pretty typical)."}
{"text":"Went today before a show, which happened to be a Sunday.  We didn't know until we were seated that it was a \"brunch only\" menu.  Honestly, we're not fans of city restaurants doing away with their regular menu in order to ONLY make overpriced eggs and toast on Sundays.  We were inclined to leave, but stuck it out.  The bread service was delicious, however, even after informing our server that it was our first visit there, the bread service wasn't explained.  We were surprised when the tray came around. I had the frittata and my husband had the short rib crepes.  This is not a breakfast joint, so it comes as no surprise that the breakfast dishes weren't very good, and that's what we were afraid of.  The frittata was dry and bland; the crepes were tasteless and the meat was tough.  Please restaurants, please serve your regular menu on Sundays and make the brunch optional for people who really, truly must have eggs and bacon.  We would've much rather used that opportunity to sample your regular menu and get a feel for what you specialize in, since coming into town in the evening isn't possible.  Surely we are not alone in this.  Another thing we weren't big on were the hightop community tables.  Very few people like to share their space with strangers.  We made it through 3/4 of our meal alone at the table, but towards the end another couple was seated with us.  They were clearly unhappy with the arrangement, too, as I watched them make several awkward facial expressions and eye rolls - the universal sign for \"oh great, we get to sit with strangers\".  Unless we have our own private booth and a menu comprised of items other than eggs and breakfast meats, we will not be dining at G&G again."}
{"text":"If only Yelp had a 3 1/2 star option!

GREAT staff. I sat at the bar and the bartenders were excellent; knowledgable, friendly, and observant. I was describing one of their beers on draft (Brooklyn Sorachi Ace, one of my favorites) to my friend, and the bartender heard me and poured us a small taste without even asking. Great at mixing cocktails, explaining the restaurant, etc. Staff can be such a problem in Pittsburgh, but the bartenders were aces.

The decor is...okay. The space is surprisingly small, and the bar area even more so. The cramped dining room feels like you're an airline passenger in a cramped 707. Points for dim lighting, but overall the concept for the space never comes together. The walls and seating are all classic dark fine dining, but then there's a faux-rustic wooden box  on the table holding condiments in rough glass jars - very strange. Some drinks come in tiki glasses which is also at odds with the decor. No TVs, though, which is a major bonus.

Food: Good not great. The skate cheeks dish was excellent; creative & tasty. The chicken thighs were sort of a deconstructed chicken fried rice dish that was unexceptional. The dim sum portions are small, as many people have commented. I don't mind paying a lot for fine dining, but other than the skate cheeks, nothing blew my mind. As many other reviewers have commented, the food might develop as the chefs find their footing. 

I would try this again, especially because it's rare to find a place where the staff is already at the top of their game right after opening. That speaks well of the management, and restaurant in general."}
{"text":"This is my little Pittsburgh gem in the middle of downtown. It helps that I work within a stones throw of this well done restaurant. The lovely manager behind the bar one night mentioned that \"Grit & Grace is not trying to be something that they are not.\" I have been twice, once for dinner, ordering from the dim sum tray and another time with friends having a glass of wine at the bar. The service is always very attentive and efficient. The steak tartare and brussels sprouts on the dim sum tray are both great options as starters and at $5 each, it is a great value. The patio is also a nice addition if you want to sit on the patio. Be warned that many of the tables are communal and I sat with a friend in the middle of 2 other couples so if you value privacy; ask for your own table. If not, make new friends. In all, I have always been impressed, it's great food in the middle of downtown Pittsburgh."}
{"text":"Food was amazing waitress was really nice and outgoing and it really couldn't be any better you guys have to come here"}
{"text":"This looked like a nice,hip place to grab a quick bite.  Menu looked great. Service was fine but when the food started to arrive it was all down hill. We ordered edamame that were literally swimming in salt pepper and sweet soy sauce. If they had only used 10% of this mix, the dish would have been stellar! (Dear chef,  less is always better). Next came the Pork Ramen. It looked beautiful! The five minute egg was perfect. The pork belly was perfect and the noodles were good but the broth was too heavy with MSG and spiced so hot that my son could not eat it. I like spicy food, but this dish wasn't labeled spicy and I was SWEATING my way thru it. I felt like the chef was trying hide the canned broth with red pepper. (Dear Chef,  I don't care if the broth is canned just buy a decent broth and don't try to mask it with heat. The pork,egg and noodles would more than cover it and make a nice ramen.)

In the end, the meal could have been great. The.place is cute and reasonably priced for the area. If you go there,  just instruct the waitress to reduce the spice loading on these dishes and you'll be in for a treat!

Good luck, G&G. I hope you read this!"}
{"text":"We were looking forward to trying this new restaurant, as we are fans of Spoon. Came here with friends after a performance at Heinz Hall. As we were looking over the menu, a server came by with dum sum offerings. We tried the house made kimchi and crispy brussel sprouts. Loved the crispy brussel sprouts!! The kimchi was good but didn't taste like a traditional kimchi. 

We tried the pig face roulade, which was exceptional! Can easily be shared by two and was a larger portion than some of the small plates. For small plates, we ordered the braised pork terrine and short ribs. These were two individual portions. Both were delicious and could've ordered more. We also tried the crispy tofu and short ribs with flat rice noodles. These were tasty and all the flavors melded well. 

We would've liked to get more direction from the server on how to balance ordering dim sum with small and large plates. Ambiance is cozy, relaxing and made for a great evening with friends.

Chef Pekarcik and his team have opened up a great establishment in downtown Pittsburgh."}
{"text":"I've been to Grit & Grace twice: Once for dinner and once for lunch.  I've enjoyed both times.  Like other reviews have said, the pork belly bites are insanely good.  I also love the kimchi - a bit on the spicy side for some at my table, but I thought it was spot on. For lunch, I had the crispy tofu.  I would give that more of a 3/5.  Some elements were great - the tofu and mushrooms were perfect.  There was just too much braised daikon in the end. For dinner, I've ordered the scallops and tried the braised goat.  I enjoyed the scallops and loved the goat! I just wish the goat had been on the lunch menu."}
{"text":"I went to Grit & Grace during lunch.  I liked the overall vibe of the restaurant.  I ordered a salad with the roasted carrots and cheese curds.  It was definitely unique, and I enjoyed it, but it didn't stand out as being one of the best salads I ever had.   I dined with 4 others.  Their dishes seemed to be hit or miss.  

We also shared some items from the dim sum, which were tasty.  I'd like to try this place for dinner."}
{"text":"Tried this place for the first time this past Sunday! My co workers and I had a ladies brunch here. Service was exceptional! And the food.... My god! So good! I got the apple French toast. We love trying new places and this was a good one! And of course we had cocktails with our brunch. We had a great time. Our server was awesome. Super friendly and fast! We will for sure be back!"}
{"text":"Cocktails, Dim Sum and main courses were all excellent! Desert was a ok. Would like to go back soon!"}
{"text":"I was super excited to come here and try everything! Our reservation wasn't quite ready, so we grabbed a seat at the bar while we waited for our table. I ordered the Mai tai, which was not super sweet, which I like! They also have a decent beer selection too! Now onto the dim sum...the calamari salad was just ok, nothing special. The Kim chi was ok. Now the pork belly bites with some of the hot chili sauce=amazing! I ordered the dayboat scallops for an entree and sadly the dish fell short. There was crispy pepperoni in the dish and it just did not work out well with the flavor of the scallops. So I will be back to try something new because the service was wonderful and I'm hoping that I can find something new that I like."}
{"text":"Surprise! It's not southern food despite its name. However, everything I tried was paired nicely and different. Because the servings are smaller I was able to try 3 different things for $18! 

The waitress came around with a variety of dim sums to try for $5 each. I tried two and they were both amazing! One a sweet & spicy quinoa blend. And the other a fried grain fritter ball with spicy sauce. 

Then finally tried the short rib plate ... Words really can't describe how good it was. I sat at the bar with two locals on each side and they swore by it ... And now I do as a visitor."}
{"text":"We went here last night for my birthday dinner.  After reading reviews on here I was a little apprehensive, but in the end I was glad we went.  The drinks were very good - definitely the high point of the meal IMO.  However they were really strong so by the time I was half way through my first drink I really needed something to eat, preferably a starch, but our food took a while to get to our table and none of it was very satisfying.   I ordered the duck and soba noodles, the mushroom salad, and the brussel sprout dim sum - it was all fine.  It wasn't great or bad, it was fine.  

The other thing was that there was a group of very drunk, obnoxious adults sitting next to us who were so, so loud - this didn't matter as much when we started drinking too, but it was off-putting to begin with.  However the atmosphere was great!  While the service was so-so, it kind of didn't matter because it didn't feel like we were in downtown Pgh, usually a sure sign of a great atmosphere in a Pgh restaurant.  

All in all, I would probably only go back for drinks before dinner at another restaurant.  I would not recommend it for its food."}
{"text":"My wife scoped this place out and this was our first stop on a long weekend for our anniversary. First time here and we were NOT disappointed. What we ordered: Chicken Thigh Steamed Bun, Korean style chicken wings, Chow Fun, and DanDan Noodles. 

VERDICT: 

Service - Excellent service, very attentive and seemed really knowledgeable about the menu, as you would expect. If the staff are raving about the food because they eat it whenever they're at work, then you know they know.

Food - First of all, the portions, especially for the main dishes, were smaller than I expected. The steamed bun was just that...one steamed bun. About the size of half a baseball. For $8. 

Having said that, the food was really good but both my wife and I had reservations about all but one dish we ordered. Example: the steamed bun filling was phenomenal but the the bun itself was store bought and microwaved a bit too long (just a guess but I've microwaved store-bought steam buns before and it ain't pretty). I love me some chow fun and these were pretty good but the noodles were slightly undercooked. The DanDan noodles are my go-to whenever I spot them on the menu and I've sampled them everywhere. These were pretty good, but the noodles make or break the dish. And these were, I suspect, store-bought not made in-house and unevenly cooked. It's like I got noodles out of two different pots. I will say that the Korean style chicken wings were pretty spot on. I'd get those again, for sure. 

Atmosphere - Very cool vibe. The decor and ambiance of this cozy little place makes this a great date spot, not too loud and just enough background noise and electronic music to keep your conversations private."}
{"text":"I'm not a fancy man but I really enjoyed pretending to be this time. (It's a rare occasion.)  My friends and I were the first customers for a late Saturday lunch.  Our lovely waitress explained the tapas style dining but we opted in for the \"every man for them self\" adventure where we order what we want and refuse to share.  Across the table we had the shaved flank steak ramen, day boat scallops, smoked brisket and the buttermilk chicken wings.  All of it was fantastic and the portion sizes were ideal.  Drink wise- I usually don't go for super sweet cocktails right off the bat, but sometimes I strike and hit a home run.  I ordered their gin and tonic, made with house made tonic and orange bitters.  Ladies and gents, you can't taste an ounce of liquor and it's well worth every penny.  This is a great place and I'd go back fo sho."}
{"text":"Love this place! Been here a couple times and never disappointed. Each time, we sat at the bar and the bar staff is exceptional. Friendly, helpful, social and on top of it. The food is outstanding. I've eaten about half the menu and I dont have one bad thing to say. It is delicious everytime. I went with my husband one time and before we went down he looked at the menu online. He said the menu had a \"bunch of werid stuff\". I promised him it would be good and I came through on my promise. We ordered one of the ramen bowls and he ended up drinking the broth right out of the bowl. The dim sum is also phenomenal, especially the pork belly. I crave it all the time. Definitely recommend and looking forward to my next visit."}
{"text":"Had a wonderful dessert/cocktail date there with my husband.  The drinks were inventive and the dessert was out of this world.  Love the vibe and we will definitely return."}
{"text":"Was in Pittsburgh for a conference and was brought here by a local. By far one of my top 3 places to eat this year. 

The place is small so a reservation is recommended for dinner. 

Everything we tried on their dim sum menu was spot on. My favorite was the brussel sprouts in buffalo sauce and blue cheese. Holy moly! We liked it so much we ordered another round. The pork belly was also amazing. Definitely try these items. 

Highly recommend it!"}
{"text":"This might possibly be my favorite restaurant that I've ever eaten at! Truly perfect seasoning on every dish! Real crab in their sushi rolls... Did you hear me? Real crab... Yum! Melt in your mouth pork belly. We loved everything we tried... noodle dishes, lettuce wraps, cauliflower, tuna tar tar. Server was great... made us feel right at home in a trendy spot.
I wish I could take them back home to Connecticut with me!"}
{"text":"This place has so many deceptive titles. It is not dim sum by and large, not tasty from an Asian perspective, and not a $$ in any means. Also the noodles and chow fun were too salty,  and only had weird soy sauce flavors.

to be fair, the service was superb. there are many westerners seemingly enjoying it."}
{"text":"Spent 10 dollars for lukewarm pot stickers and tepid water. Went to Noodles and Company after, spent the same amount and got an actual meal. Aesthetics over quality seems to be their main focus."}
{"text":"Several of the \"nice\" restaurants in town, for me, haven't been totally satisfying in terms of food or price -- sometimes I have felt that I was paying for the atmosphere alone.  I finally made it to Grit & Grace, and loved it all around...beautiful décor, good service, creative and elegant food.  I recently recommended it to friends visiting from out of town, and they also had a great experience."}
{"text":"Fresh ingredients, creative flavor profiles and combinations and helpful staff.  Recipe for goodness and love the pigs face sandwich!!!  A winner."}
{"text":"Pork bun was soggy and sushi rolls very mediocre, especially for $8 per piece. Hostess was very nice, but server was obviously not happy to be there.   Too many great restaurants in this town to try this place again"}
{"text":"Lots of amazingly crafted food from all over Asian. They had a DJ and came around to the tables with small plates of food to purchase. I think the only downside was how exotic some of the dishes were. It was harder to find something I would like."}
{"text":"\"Grit & Grace\", yep. \"It was the best of times. It was the worst of times.\"

Outside seating is at once invigorating & stiffling.. beautiful shade, fast service (sometimes an issue for outdoor seats). It's also right next to a bustling sidewalk and there's a bus stop fifteen feet away.. prepare to eat on view for 20+ people if crowds bother you. 

Service was fast, efficient & robotic. \"Do you want another drink yet\" started our interaction and was quickly followed by \"are you ready for food?\" No name, no \"how was ____?\" during our entire visit.

Cocktails were disappointing.. the B squared and Lady Boss are refreshing with nuanced fruit & yet little booze and no interplay.

Food was equally mixed. The tangy pimento needed more spice. The dry short rib cheddar biscuits were rich & one-note, bernaise-dominated. The pork-belly bites had more nuance, nice contrast from pork to pineapple, the smokey aioli adding requisite salt and spice. 

The best of all was the soba w/crab and edamame. Light & husky, bold & subtle, crunch & creamy. Prob the quintessential dish at Grit & Grace, a definite must when visiting."}
{"text":"We tried really hard to like this restaurant. Menu sounded great. And while some of the ingredients were expertly prepared - the shortrib in the shortrib appetizer was excellent, as was the goat in the goat curry - on the whole the food was drenched in overpoweringly sweet, cheesy, and/or spicy sauces that hijacked our mouths and obscured the main ingredients rather than enhanced them. As well, someone in the kitchen was going crazy with the salt shaker. On the positive side, prices were reasonable. It's also not the most comfortable restaurant, with lots of high tables and backless benches for seating.  While the bar area and main seating area are pleasant, the room in the back opens onto a bland hallway that leads to the bathrooms and feels like Siberia. THey have a good beer selection, but alas, one of the two bottles we ordered wasn't cold enough. It wouldn't take much for this restaurant to be a 4-star place. Let the food do its thing without the crutch of gloppy sauces and a too heavy hand on the salt shaker."}
{"text":"My boyfriend and I came in on last Saturday and we couldn't get a reservation so we sat at the bar. Our bartender Erin was just absolutely amazing she helped us pick the menu and everything was delicious. She made us old fashions and had us try the ginger beer which was unbelievable. The dim sum was a nice surprise. Hands down this is one of my new favorite places to come, the quality of good, the service, and the atmosphere. The bartender Erin really was just soo helpful, friendly, and she really helped us. Please go to this place if you haven't already and if you can't get a reservation, go to the bar because we had amazing service."}
{"text":"Fantastic! Had a brisket sandwich and it was perfection! Definitely a place to check out for lunch!"}
{"text":"Not for the picky eater. Stopped in for a drink before heading elsewhere for dinner. The drink was a very heavy pour(always appreciated) but couldn't decide on on an appetizer because of the choices. I was not the picky eater in this group but just a fair warning to those who plan on dining at this place. Decent place but doubt I'll venture back."}
{"text":"This place is phenomenal - seriously! The service is super friendly, laid-back and knowledged on the menu items! The food...my mouth waters just thinking about it. The best advice, go with a few friends and plan on having a little bit of everything !"}
{"text":"I had a small dim sum starter that was 3 bites. Head cheese and stuff. Light, good, but not too flavorful. And a salad with eggplant, romaine, edamame, and house cheese. Not flavorful at all. Small. 10 dollars. Nothing to it."}
{"text":"I was in town for business and was pleased to find this place across the street from my hotel. I sat at the bar and got fantastic service. I tried really hard to like the food but it just wasn't working for me. I had a weird cauliflower thing that had oats or something in it. It was bland and had an unpleasant consistency. I also had the pork belly ramen, which had some interesting toppings that I liked, but the broth and noodles missed the mark. The broth was over-salted and had too much soy sauce, and the noodles were overcooked. On a positive note, the beer selection was great and it looked like they had really good cocktails. I would come here again for the drinks, ambiance, and service."}
{"text":"I ate lunch at this establishment twice.  The first time, everything was delicious.

The second time, I ordered a \"crispy pig BLT\".  It was one of the worst lunches I have ever purchased.  The whites of the egg were uncooked.  There was no tomato.  The bacon was soggy and not at all crispy.  The bread was greasy and tough.  I have had better sandwiches from fast food joints.  

This place is a great example of undeserved pretentiousness.  The food is insipid -- their entire schtick is pickling, and they don't even do that well.  The drinks and food are overpriced.  This is about as bad as SixPenn, and that is one of the most laughable eating establishments downtown.  

I will never return, and hope that a real restaurant replaces it soon.  Restaurant owners need to realize that cooking skills need to match the menu.  If you can't cook an egg, get the f*** out of the kitchen.  Congratulations on knowing how to prepare kimchi."}
{"text":"My friend brought me to this restaurant and I should say it's brilliant! The food is delicate, healthy, beautiful and beyond imagination. Sharing is encouraged. That means you can try various dishes without getting stuffed by just a single one. Even they do Dim Sum, or appetizer, tapas, whatever you call. It's a small plate prior to your main dish and somebody will walking around to serve these dim sum so you can stop them and get one anytime. What you see is what you get. 
What I like most about this restaurant is its fusion style. Somehow you can tell the chief may be a cantonese or the cuisine is oriental-inspired, but they are cooked in pretty \"western\" way. It doesn't contain too much oil or sauce so the original flavour of the food is kept. And almost every dish has multiple ingredients but nothing overwhelms. They work together very well and it adds to your fun when you taste it and try to tell what it is.
Definitely recommend to everyone."}
{"text":"Grit and Grace was just ok. I was really looking forward to it and was disappointed.  I visited for lunch.

I had the Kimchi (a la Dim Sum, brought around to the tables) appetizer which was spicy and delicious.

The roasted pork ramen was fine, but lacked any serious substance, and I hated the mushrooms.  I'm not 100% sure of the preparation of the mushrooms, but they were way too strong and they certainly didn't gel with the rest of the dish. The roasted pork was small bites of pork belly --- I would have appreciated either more of it, or real pieces of pork. Underwhelming at $13.

I get that Pork Belly is all the rage.  I had some recently at the nearby the Butcher and the Rye. But I need something more substantial than that.  More than $0.40 worth of pasta.

The flank steak with rice noodles was better, but again, underwhelming for $16.

The ambiance is nice and very modern. The service was good.

While the dishes looked very good coming out of the kitchen, I felt like the appearance wasn't supported --- Grit and Grace didn't really deliver.  It was style over substance!

The total price for lunch for two was $50, not including tip.

For similar cuisine, at around half the price, I'd rather take a short walk down to Penn Avenue and go to Nicky's Thai Kitchen.

While I would have given G&G four-stars for the food and service, I've got to round down due to poor value."}
{"text":"My girl and i went here.  The small plates are an attraction for us. Craft cocktails were well made. The small plates are unique and worth the prices"}
{"text":"Centrally located and trendy / cool decor made this a perfect stop after walking around Steel City.  We were greeted by a welcoming beer menu and tasting plates to satisfy the whole family.

The seating area for our meal was comfy & cozy.

All of our sushi, noodle and dim sum selections were delicious and brought out as ready.

Service was attentive and efficient.  

Both desserts we tried were well done and both disappeared quickly.

Give them a try, I promise you won't be disappointed."}
{"text":"The best way to describe this place is an Asian-fusion, New American bistro. They come around with these \"tapas\" for appetizers, and bring them around for you to buy as you wait for your food to come out. 

Our table tried the pork belly bites, which were essentially just un-fried pork rinds and were delicious in their sweet sauce. We also grabbed the steak tartar, which was prepared with peanuts and spices. It was a nice flavor combo. 

The main dish, I had pig face! This is a rarity on any high class menu across the nation. It was stripped and put on top of an open face piece of bread with apple butter on it. A fried egg and greens finish it off, as well as spicy green sauce.  

This was a very tasty meal, in an upscale location that clearly goes after the local business clientele. As good as any meal I've enjoyed in LA."}
{"text":"This place is amazing. The port belly bites are a must. The dandan should be renamed dayumDAYUM because it is excellent."}
{"text":"Pittsburgh really is a city that has some outstanding restaurants, and Grit and Grace is no exception. A group of us dined here recently, we ordered a lot of small and large plates that we shared between us. The food was excellent. I can't say a thing wrong. I will tell you to not be put off by their website, it does not do the restaurant justice, I don't know who designed their web page but it does not conjure up a restaurant that is trendy, stylish, innovative and creative. 
They have their own take on a dim sum experience, when one of the wait staff brings over a selection of small plates that you can choose. We tried each other's and agreed they were all yummy, we then moved onto a series of plates, I don't think you could order poorly here. 
We ordered a lot of food, highlights were the miso braised eggplant, seafood sausage, short ribs (melts in your mouth good), and scallops. We were satisfied and had a wonderful evening and left absolutely stuffed. Although we did go for a sharing all of our food experience. 
The decor is very aesthetically pleasing. The cocktails are good, those bartenders know their drinks! and the restaurant has a wonderful vibe. Go here! You'll be really happy that you do!"}
{"text":"Not a fan. Spent $185 between us - left sober and hungry and sadly neglected

A friend and I were very excited to try this restaurant after work. The place was dead, yet we were seated in the farthest booth away and our waitress barely stopped by. Happy hour specials are only available at the bar - which we were not told ahead of time, we definitely would have just grabbed seats in the bar area. And it's a different concept of restaurant, but no employees would explain what was happening, so it was frustrating.

Admittedly, the food was great - but we shared a medium plate, a large plate and an appetizer that we snatched off of the traveling app tray (weird) - and we were still starving afterwards. My cocktail was delicious though, but it took half an hour to even come. And getting new bevs was nearly impossible. I'm glad we checked it out, but I was incredibly disappointed and I would not return."}
{"text":"Food was great. Small tapas plates which were fun for our group. We ordered the Dim Sum which they bring out on a platter and you can pick which plate you would like. That made it easier. The steak tartar was amazing and the chicken liver was also great. Needed a few more slices of toast to spread. 

The scallops were good but a little too cooked and not many to share and the steak w flat noodles was good but not enough steak for the price and a little too much oil. We had the \"dirt\" for dessert which was really good. 

Bar looked fun and drinks were creative. We would come back to taste a few new plates for sure and or even just have a cocktails.  Located on liberty ave so you can walk around to Penn and venture around."}
{"text":"Grit & Grace is a combination bar/dim sum spot/ordinary restaurant. Their food is a fusion of various Chinese and Japanese themes with an American slant. The dim sum works as follows. There are five dishes (I don't know if they rotate) that are in small bowels carried around the restaurant on trays. If you want to grab one, just get the tray-bearers attention and take it off the tray. We tried the pork belly bites (very good) and the kimchi (amazing). Our cocktails were excellent. However, I'd say the real star of the night, to my surprise, was the chicken meatball ramen, which we tried over the more traditional tonkatsu broth ramen. Our last food item was the steam bun, which was good, although the housemade mortadella (an Italian-style sausage) was too reminiscent of a hot dog for me to really fall in love with the dish.

The service was very good, and the setting was great. Above our table was a terrarium. I couldn't tell if it was a permanent fixture or part of the holiday decorations."}
{"text":"I went to Grit & Grace with friends on February 13.  For a Thursday night, it was nicely crowded but not too packed.  It did take a couple weeks to get a reservation.  The bar area is very chic and is a decent size.  The main dining area is also aesthetically pleasing and has warm lighting.  There are interesting art installations on the walls between tables in the main dining area as well.  The lighting is both artsy and very functional.  There are some communal-type tables but my group was seated at a large U-shaped booth, which was pleasantly cozy.

The service was pretty decent.  There were a couple times we had to flag the waitress down, but I blame that in part because we ordered things in a staggered fashion as we were waiting for a friend to join us.

We ordered all of the dim sum options that night, including a Brussels sprouts dish, salmon tartare, a kimchi dish, pork belly, and breaded sweetbreads.  These were all very nicely done.  The pork belly had my mouth watering for more.  Probably if I had to rate the best to least best, the pork belly was the best, then the Brussels sprouts, the salmon tartare, the sweetbreads, and the kimchi.  The kimchi was good but kind of typical for kimchi.  I thought the salmon tartare was really unique.  The Brussels sprouts were tasty but it is sort of a trend at local restaurants lately.  

A friend and I split braised short ribs made with rice noodles, bean sprouts, broccolini, mushrooms, onion, and garlic.  I thought the short ribs were very flavorful, tender and juicy.  We also split braised goat which was done with appams, and garlic/ginger smashed potatoes, with curry.  The smashed potatoes were awesome, and the combination of the goat (which was firm but not overdone) with the potatoes, wrapped in the appams (rice pancakes) with creme fraiche was delicious.  The potatoes were nicely browned and crispy on the outside.  The appams were also cooked well - not too dry, and a nice consistency paired with the rest of the dish.  

The wine list is rather good.  I had a petite chenin for a good price ($9), which was great because I don't see petit chenins in Pittsburgh restaurants that often.  I also had a G&G Club Cocktail which was a fresh take on a bourbon cocktail.  It included orange bitters; anything with bitters is good in my book - bitters are good for your health!

Overall I had an enjoyable dining experience at Grit & Grace, and look forward to my next visit!"}
{"text":"The belly pork was so good. Although dim sum is not really Hong Kong style dim sum, but they are still good. Sometimes. Ppl just too judgmental if the food is not what they thought. 
I also had noodle soup there, according the waiter, they spend 2 days to make the broth so I think it's good, it tasted mild and you can tell they didn't put too msg. I def will go again."}
{"text":"Perhaps because it was 8:30pm on a Sunday (they close at 10 I believe), the service was disappointing. Our waitress was minimally enthused and was experienced as irritated by our questions (\"What do you recommend?\"). However, the food was very tasty. I ordered the pork ramen which was the perfect portion for a later evening meal. I also had the New Holland Dragon's Milk stout which has sweet vanilla tones. Their menu says they have Strong Bow but they no longer serve it at this time."}
{"text":"Like the combination of dim sum style food bites and the menu selections. Savory was our theme. We enjoyed the porkbelly bites from dim sum tray f/b carrot salad, scallops, mortabella bun and pork face open sandwich. The waiter was spot on with helping us put a delicious dinner together."}
{"text":"I really liked this place. We had a shared drink called Scorpion which had a citrus taste, it was good. We had the sweetbreads dim sum. I'm not sure why it was called that but it was delicious. Dinner was short ribs biscuit and scallops. We would definitely go back."}
{"text":"It's tempting to do a 1-sentence \"OMG\" style review, but Grit and Grace deserves better. Absolutely everything that comes out of that kitchen is delectable, balanced, and brilliantly conceived. The menu itself is an adventure that can be intimidating (pig face) and confusing to the casual diner (schmaltz carrots). To add to the drama is a concise yet varied dim sum offering. I love being able to preview and discuss the concatenation of food, and time spent with the dim sum server was fun and satisfying in that regard and the only hardship was having to make a choice. EVERYTHING was wonderful. That almost never happens. I've been to the best dim sum in Chinatown San Francisco where everything is decidedly NOT wonderful. This chef has designed dim sum for the American palate no matter how so-called sophisticated it may arrive. Every bite of every dish was brilliantly thought out and balanced, but lets face it the TASTE was amazing and that is what was most important. You don't have to be a foodie to enjoy the food here, but foodie's rejoice because you totally will. If you're not a foodie and you validate yourself with the notion that you are an unpretentious eater and fancy food isn't for you... well think again... this food is for you too. My guess is that this chef knows his clientele, and he knows how to raise the bar high enough for the foodies and keep the flavors in the right zone for the \"unpretentious\" as well. I could go into detail on each dish, but each dish is its own journey and that would take up too much space. I will say the small plate portions may throw you, but the richness of the food fills you up so smaller is better. The larger plate portions are very filling so don't let appearances deceive your appetite. We were stuffed by the end of our meals after sampling only 3 dishes each (and sharing of course). The desserts were sublime as well. Rye cake with strawberries and coconut mousse... fabulous. Can one give this place 6 stars?"}
{"text":"Prices in general were a bit high for what I had, though I admittedly did not try much food. Steam bun was OK at best and not worth the price. I did enjoy the craft cocktail I had (called Purple Rain I think), but was surprised how quickly my tab added up after a few beers with my wife."}
{"text":"This review is for brunch- they just started! I am glad we made a reservation this place does not have a ton of seats. Very cute place and love the decor. Our waitress was super bitchy and made a few mistakes however I applaud her for letting us know it was their first day at bruch. I think she was stressed and I will let it slide. It took a long time for us to get our orders taken so we did drinks and entrees at once. They have some cool breakfast drinks including one called captain crunch milk. They also had someone go around serving 4 kinds of pastries which you could get one of each for $3. Glad we tried it ( should be included in brunch) and the small piece of banana bread and sugar donut hole were delicious!  For my entree I got the French toast which came with grilled pineapples. The bread was delicious and homemade syrup to top it off made it exceptional. My date got the monte cristo sandwich with a side of home fries. He was pleased with his choice but for the price of each entree they were not big portions and did not come with sides."}
{"text":"We came here while traveling through Pittsburgh on a road trip. Excellent small plates menu with Asian influences. Absolutely loved the short rib with cream cheese biscuits. The smoked brisket sandwich was also a standout. Overall, very reasonable price point for a tasty and creative meal."}
{"text":"I enjoyed my evening there. The room is elongated, with 4 types of seating arrangements: bar, high table with (very comfy) stools, booths, and parallel tables. Avoid the tables at the back of the room if you can - given the organization of the room it looks a bit gloomy, and you are further from the bar action. Nice crowd, not too packed, good music not too loud. 

The drink menu is good, with a list of 7-8 cocktails. Those we tried ranged from good to excellent (white lady), and the wine/beer list is also substantial. The food was overall pretty good with a few misses. The highlights were 2 dim sums: a korea-inspired shrimp salad and a sashimi of scallop. Very fresh and tasty. The meaty dishes were good too: I enjoyed the short ribs (a variant on the traditional egg benedict, without the egg!), and the pork belly dim sum. It's a bit heavy however, with perhaps a bit too much of a quite rich sauce. The most notable miss was the vegetarian dim sum.

Price wise, it's reasonable considering the quality and the kind of place it is supposed to be. 

we'll be back, for sure."}
{"text":"Great dining experience.  A bit different then anything I have ever had.  My only complaint was that there were not a lot of small plate choices.   A few items on the menu and 5 dim sum options on a Sat night.  Everything we had was good but we would have ordered more if there had been a wider selection.  One thing for sure is that the roasted octopus is a MUST"}
{"text":"Goat. It is very good apparently. Plus their a la carte dim sum is too delicious not to buy off the literal cart that rolls around.

Cocktails were extravagant and well worth the slightly higher cost. Ambiance was also very nice and well designed."}
{"text":"I think a fair assessment of a restaurant's food is \"will I randomly crave it\"?  I may have a year ago.  But it seems like there has been a noodle restaurant explosion for Pittsburgh overall (not to mention more than one noodle place Downtown).  I ordered the chow fun, which has thinly sliced steak and other accoutrements.  It was decent.  But I was slightly underwhelmed.  There wasn't anything wrong with it, it was just the definition of okay.  It was a little pricey considering it was lunchtime however.  (I am always reluctant to mentioning price, because it kind of implies that I demand mass quantities of food per unit of money spent, I just don't want to be hungry afterwards).  I mean, I feel like I need to explain myself more, but this isn't a college paper.  Therefore I should abstain from needlessly interjecting hyperbolic jargon for the sake of satisfying a bare minimum quantity word count (this was me trying to build a weak joke by adding self awareness to it). 

Weirdly enough, I'd recommend it, if only to get it off your \"try it\" list.  You'll see what I mean.  It's just fine, but fortunately Pittsburgh's culinary game has really stepped up, and 'just fine' is hard to get by. I personally think it's days are numbered, if the lack of customers at noon-thirty on a Wednesday are any indication.

Sidenote:  This restaurant had a completely different menu at one point, it's kind of a bad sign when you completely revamp your menu. Which reminds me, I'll be opening up a Subway sandwich restaurant soon, but we'll be serving spaghetti.

Sidenote 2:  If I were a tourist, I'd be a little creeped out by the downtown location.  It's perfectly safe, but shady looking as all get out.  It's attached to probably the crappiest Wine and Spirits downtown (I can think of three that are located here, but there may be more).  Enjoy your noodles, but avoid stepping on a used hypodermic needle!

IF THIS RESTAURANT WERE A MUSICIAN/BAND:  Steve Miller Band.  Perfectly capable and semi-enjoyable, but when was the last time you really needed to listen to Steve Miller, there are many better options available. (I personally think he sucks, but I think the metaphor is appropriate)."}
{"text":"I had not tried this restaurant back in it's old carnation, but I can tell you that this take on a street noodle bar hits all the right notes. The food menu concentrates on quality over quantity. You aren't overwhelmed with pages and pages of options, but given a good handful of very different dishes to choose and enjoy. We shared some of the wings and potstickers, then all 3 of us got an individual noodle dish.

The drink menu had a bit more variety with lots of \"harder to find\" items (small batch beers and liquors) but we weren't there for the drinks, mainly the food.

Overall, the food was excellent, the service was great and I can't wait to go back and work my way through more of the menu."}
{"text":"The atmosphere was great, food was fine, service was fine. 

It took a long time to get our food (apparently the runner gave it to someone else) and our server seemed like she was ready to go home the entire time we were there. The seafood curry was good. Not what either of us was expecting, but still good.  The short ribs were excellent, I would definitley order those again. We ordered something off the dim sum menu (I don't remember what it was called) that was supposed to be served on taro.  Maybe they ran out and replaced the taro with potato because it did not look or taste like taro- which was dissapointing since that's why we chose it. The sizes were smaller than I expected for the prices.  

Overall, I wouldn't chose to go back on my own or reccomend it, but I'd go if someone else wanted to."}
{"text":"Great atmosphere and very stylish layout. The food is excellent, and love that it's in downtown Pittsburgh."}
{"text":"The 3.5 star review just goes to show,  yinzers don't know what good food is. This place is amazing. Marcus was awesome, very knowledgeable about gluten free. Applause!"}
{"text":"The pork ramen is made of all soya sauce, the worst ramen I've ever had. But their pork bites are fantastic"}
{"text":"Decided to return here since the name and menu change. It appears that the menu has shifted to serving only Asian inspired dishes: sushi, noodles and shareable plates. 

I ordered the Dan Dan while my friend ordered the Szechuan chicken. Both dishes were noodle dishes. The type of noodles used were the same for both dishes, which they were kind of similar to a lo mein noodle, texture-wise. My last visit, I was told the noodles were made in-house but I'm not sure if that is still true. Anyway, both our dishes were rather spicy. The Dan Dan had a lot of different textures with the ground pork, bean sprouts, pickled radish and the soft boiled egg. I will say the egg complemented the dish well. Flavor was extremely bold. The Szechuan chicken was even more spicy and that was the main flavor you could taste. The chicken was cut into small bite-size pieces and they were very flavorful and crispy. 

I definitely like the changes they've made to the menu. Not entirely authentic but I appreciate the hip, modern spin to Asian classics."}
{"text":"Decided to meet a friend downtown for lunch on a Friday. We originally planned on hitting Tako, but they aren't open for lunch (of course!). The place wasn't super busy, which for me is a plus during lunch hour. I ordered a Yacht Rock cocktail (i think that's what it was called) I LOVED it. So refreshing and delicious. I got a salad because I wasn't feeling incredibly hungry and truth be told I had already scarfed down a piece of barbecue chicken my fiance made around 10:30 a.m. because i had skipped breakfast. The salad was lovely and fresh with some mandarin oranges, fried wonton, crisp lettuce, finely sliced onion, and radish. Of course the delicious ginger dressing was just the icing on the cake, or dressing on the salad if you will. Our waiter was just great! He was adorable, helpful, and attentive but not overwhelming (you know when the waiter is at your table like 100 times while you're trying to eat and you always have a mouthful of food and feel guilty and annoyed?). He filled our water when we needed it, offered to get more cocktails after I sucked mine down like a thirsty camel that wandered in a desert for 10 years. I would definitely go here again and try more things on the menu. 
My lunch date got a beer, some sushi and don don. I tried to sushi and it was great. You can tell they are quality ingredients!"}
{"text":"Terrible service. They forgot my order after I reminded them several times. The rest of the food left a lot to be desired. Not sure how this place got 4 stars."}
{"text":"I went to Grit & Grace for lunch during the workday. I've been hearing a lot about it and was excited to try the food. We went around 1pm and I was surprised to see there weren't more people there on a Friday for lunch.  We started off by sharing the three different dim sum plates they were serving. They were $5 each and all of them were very good. The pork belly was definitely my favorite.

For my meal, I ordered the ramen pork with the carrot salad. I loved the carrot salad. The dressing was delicious and I always love purple carrots on anything. The ramen itself though was just okay. I enjoyed the pork and egg that came with it. Overall though, the dish was really salty. I left feeling like I needed to down three glasses of water. I kind of wish I had gotten one of the sandwiches the other people I was eating with ordered. For the price, I'm not sure it was worth it.

Our server was nice and very attentive so no complaint there. I liked the atmosphere, but as far as lunch goes, it was just okay. I'd like to go back and try their dinner though. It seems like everyone has lots of good things to say about that!"}
{"text":"Stopped in on a Monday for lunch after flying. Still new to the Pittsburg area but was happily chatted up by the bartender who gave me some great recommendations on places to visit and other restaurants to try. Ordered a very delicious pork ramen noodle bowl.  Pork and the egg were cooked to perfection. Noodles were great too. Will definitely be coming back."}
{"text":"(11/10/2014)  Was doing a self-guided restaurant crawl of downtown Pittsburgh and stopped in at Grit & Grace.  It came highly recommended by some friends in the industry.  I'd have to say overall, was disappointed with experience.  Place seemed pretty bustling for a Monday night, the only available seats were at the communal tables, which is fine, I don't mind sharing, but they have you packed in pretty tight, like I have to touch elbows with you every time I want a sip of water tight.  

I've been to many a traditional dim sum, I was intrigued by the American dim sum.  We let our server know we wanted to try the dim sum menu when we sat down and she said \"they'll be right out\" took our drink order and disappeared.  More than a half hour passes and no one comes with any food, nor does our server check back in on us at all.  Eventually a guy comes out with a tray (no carts as promised on the menu), we get 3/5 items offered in microscopic portions, the other 2 items were essentially condiments (not sure I'd count kimchi as a \"dish\").  The Pork Belly Bites were delicious, sweet and savory, some caramelized bits and dressing in a sweet orange and chili mayo based sauce (reminded me of PF Changs, everyone's got a sriracha mayo something or other on the menu now).  Smoked Tofu and Soba Noodle Salad had 1 cube of tofu in it, soba touch overdone (or was last night's batch) and mushy, dressing was flavorful and zippy.  The Steak Tartare was a fine specimen, enjoyed the green curry flavors and nutty sweetness from peanuts (1 lacy crostini was a pretty skimpy though, what's with every restaurant ever not giving you enough toast, is it the most expensive thing on the plate??).

Overall, a little disappointed in at least the dim sum menu, perhaps will choose off the regular dinner menu next time, it reads interesting enough.  Asian food made with American ingredients or mix and match dishes was was Mom did for 50 years after immigrating to the U.S. Guess we'll see what happens next time."}
{"text":"It's a charming place with quite a warm ambience. Definitely call in beforehand for a reservation if you plan on dining during prime hours. The service was phenomenal with attentive, patient and knowledgeable staff. Even though we did not make a reservation, they were kind enough to seat us.

I had the chance to try a wide variety of items on the menu, but I'll just expand on my favorite and least favorite. My favorite was the steam bun with mortadella, pickles and some mustard sauce. It pretty much looked like a white burger, but tasted so unique, unlike anything I've ever tasted before. The pickles and mustard really added a special kick. Even though it's one of the cheapest items on the menu, it's one of the best. The pork belly dim sum small plate was pretty good too--savory pork bites with a crisp sweet glaze on the outside. The best part was the fat (go ahead and cringe, but I love my fats). 

My least favorite item was the roasted pork ramen. How can you really mess up ramen? Well, just have terrible broth and add a crap load of sodium. I was not a fan of the broth at all, tasted straight up like soy sauce mixed with water. The noodles were good though, but the bit of goodness was drowned in the pool of horrible broth. If you want to try ramen, I recommend the chicken meatball ramen over the roasted pork. 

The food was overall great, but there are a few hit or miss items. The portion was itty bitty, but the price left a decent dent on the wallet. Bill ended up close to $100 for a party of 5. Not super expensive, but still expensive enough for me to label this a luxury. Even with that hefty bill, I didn't leave the restaurant full, just satiated not fulfilled. I definitely recommend Grit and Grace for its unique flavors, but crack open that piggy bank! As for me, oh praise Mc. D for their fries and nuggets!"}
{"text":"This was a really great experience.  My husband and I reallllly liked all of the entree options that we received.  The soup was unique and delicious.  The restaurant overall has a cool vibe.  It's great to have restaurants like this downtown!"}
{"text":"I went here for dinner with a few friends. I ordered the pork pastrami. The meal was incredibly delicious and the wait staff was very nice and attentive. There are small plates that are offered as well which are presented to each table throughout the meal. My friends and I had a cheese spread and that again was very good. You won't find average American dishes here, they are all a little different, but if you enjoy different tastes then this place is great to try."}
{"text":"Unimpressed.  Used yelp to find a place that sounded great.  G&G did not hit the mark.  Pork belly was ruined by the ridiculous mayo based dressing which overwhelmed the fat of the pork belly.  

General Tzo cauliflower was special and something to try if there.   Great texture.   Terrific for vegetarians missing texture of meat.  

Skirt steak chow fun was boring and tasted like midwestern attempt on Asian food.  I can get much better in Asia town in Cleveland.  

Their Manhattan was excellent.  I'll give an extra star for it."}
{"text":"Great service, good food, but not overly amazing.

I had the pork belly bites which were cooked perfectly but the mayo was a bit too much. Also had the duck confit with scallion pancakes, duck was a bit dry (which is hard to do with confit and also duck) but the scallion pancakes were delicious and tender but chewy. 

My friend ordered the short rib which was very nicely cooked, but the sesame sauce was not that great and the cream cheese biscuits just seemed out of place. 

For the price, I expected something a little more mind-blowing. Nice ambiance, nice staff, just not overwhelmingly good that I'd come back."}
{"text":"To be fair, we stopped in around 8:15PM on a Friday night during the busy holiday season.  We were seated in the back area and the server came right over to take our drink order and mention the dim sum tray.  Another gentleman swung by with the dim sum tray as we perused the drink and food options. The General Tso's cauliflower looked great and was very tasty. 

I'm not a beer snob by any stretch but I do enjoy my beer and try a variety of them at many restaurants and watering holes.  I have never seen Fat Heads Head Hunter IPA served in a short brandy snifter type glass like you would a strong ale/double or triple bock or imperial ale.  Head Hunter is only 7.5% alcohol.  The price for such a wee 8 oz. glass of local beer?  $8  I was floored!  I had to pull out the menu again to check the price and noticed in a tiny itty bitty  font (8 oz) underneath the name. Don't keep the Head Hunter light under a tiny bushel!  Let it shine!

It was a long and busy week for me so I was yearning for a nice tall cold pint so we left and went to a nearby pizza place where I could get a 16 oz. pint of the same beer for a dollar less.

I'd like to try some of their other food when I'm not as thirsty."}
{"text":"This place was absolutely amazing! Everything we ordered was pretty much flawless. The pork belly dim sum actually made me say \"holy crap!\" when I put it in my mouth. It was just soooo delicious. The braised pork biscuit was so decadent and wonderful, and the brisket sandwich could bring a tear to a glass eye.

I have a pretty adventurous palate, but I am also critical. Having said that, there is not a thing I would change about anything we were served. The balance of flavors and textures was perfect and the plating was simple and attractive. I am staying in the city for two nights and I'm considering coming here again. This is totally one of my new favorite restaurants."}
{"text":"Wow. Wow. Just... Wow. 

I wasn't sure what to expect when my friend told me we were having Asian/American tapas, but I will tell you: they are AMAZING. 

Let me paint you a picture: Pork belly, kimchi, steamed pork buns and short ribs gliding around on trays served dim-sum style accompanied by a menu boasting such items as brisket sandwiches with pickled veggies, fresh day boat scallops and pork roulade to name a few. There are also plenty of vegetarian items, as well. 

Grit & Grace also has a rather impressive cocktail menu along with a lovely beer and wine selection. The space is gorgeous -- sleek and dimly-lit, with a bar up front and smaller tables and banquettes in the back. It's a great option for groups and couples alike. 

I was impressed by the service -- super on top of things and really friendly. They're all about making it clear how things work, and explain the different dishes (some of which have many components) happily to ensure you get exactly what you want. 

Out of all the restaurants I was lucky to visit while I was in Pittsburgh, I'm going to go ahead and say this one was my favorite -- it's very cool, very unique, very welcoming and very enjoyable. Well done Grit & Grace!"}
{"text":"Another example of how Pittsburgh restaurants are killing it lately...

We made reservations for this place early in the day at the recommendation of family who live in the area.
Throughout the day, I asked locals where a good place to eat was and most of them pointed us here.
Went here with some family. 

The design of this place (especially the ceiling behind the bar) was amazing.

I would describe this as a dim sum meets tapas sort of vibe. Alot of shared plates, mainly a Asian and French feel.

We tried the:
Roast Pork Ramen (This was enough to bring me back, perfectly cooked 5 minute egg!)
The pigface sandwich (I need this in my life daily!)
The roast pork dim sum
the Kimchi (get this with anything you order...it is the perfect tang!)
The Scorpion bowl (watch out for the fire...had a small paper umbrella set a scorch on ours...but my boy scout training lead me to extinguish the flame..no worries!) 

I am craving this place as I type...
Pro Tip-If you get the Ramen and are a slurper like me...wear a bib. I lost a shirt to their amazing Ramen broth...but it was worth it."}
{"text":"We walked past this place every day going to PPG, so on our last night in Pittsburgh, my coworker and I decided to try this out. Besides, I saw dim sum style on Yelp, so I've been dying to go for the few days I was at Pittsburgh. 

They have a lot of communal tables, so we sat at one of those near the front window. We didn't want to sit outside because it's really close to traffic, and there're buses all the time. Even at our communal table, the traffic was pretty annoying. 

I had the try the pork belly after reading all the yelp reviews. It was tender, but with a nice sear on it. And that sauce on it was amazing! It was worth all the hype! Even my coworker agreed, who didn't feel like pork belly after the fat eating week we'd had at Pittsburgh. We also got the Italian meatballs which was really good and flavorful. Oh, before I forget, all the food here is meant for sharing and is small plates/tapas style. 

From the main menu, we had the following: 
- Chicken wings: sooo good. It was crispy and sweet and whatever that yogurt curry sauce is just fantastic. It was also a lot of wings, more than we both expected. Definitely recommend this. It was probably my favorite of the bunch we ordered, along with pork belly. 
- Duck breast and confit in lettuce wrap: comes in two wraps, perfect for two people to share. It's kind of messy though, since it's less of a wrap and more of bunch of chopped up duck and nuts sitting on lettuce. I really enjoyed it. It's sweet and sour and that's one of my favorite flavors. Not to mention the duck is also really tender. 
- Meat bun with the chicken and kimchi - this one we had to cut it up because it comes in one \"bun\". So the bun is not burger buns, but Asian style steamed bun you would get from meat buns. It's served like a burger though, with top and bottom bun and kimchi chicken in the middle. Really good as well if you like Korean food, and the chicken was really tender. 
- Short ribs served on biscuits with gravy - really creamy and heavy. It's different from the rest of the bunch because all the other dishes had Asian flavors, but this one is purely American with its chunk of meat on half of a biscuit covered in gravy. 
- For dessert, I had the chocolate mouse with coconut ice cream, and my coworker had the peach cake. They were both OK, nothing to write home about. My mouse was really light and fluffy. And the cake was kind of dry with little bits of peaches on it. 

I also ordered a Pimms since I hadn't had one for a few years. Still really good, taste kind of like sprite. Very strong mint flavor though, since they stick a leaf of mint in it. 

This is definitely one of the top Pittsburgh restaurants I visited. I'd love to go back."}
{"text":"On our last day in Pburgh, we were eager to get brunch before our 2 1/2hr drive home.  1st choice was Meat&Potatoes.  but they were completely booked!  2nd was a place down the street, but they also had a long wait.  After walking around, we settled in at Grit & Grace.  I personally was not expecting to be so impressed.  We started off with a KIMCHI BLOODY MARY. i don't even LIKE BMs.  but this.  out of this world.  I ordered the brioche french toast and my man had the mid rare steak & eggs with a broccoli rabe.  The setting and interior was so cool! My only complaint, including the finance's, was the service was far from warm.  Not that it wasn't good, everything was fine and timely.  but there was no smiling, chit chatting, or welcome attitude from one single female (the entire staff was female) there. Despite this, it was a spectacular food experience!"}
{"text":"Pretty good food, albeit a bit pricey for the quality.

The dim sum approach the restaurant takes is very interesting, but a bit disappointing as there isn't much of a selection.

From the dim sum menu, I tried the porkbelly bites and the beef tartare. The prok belly was delicious and probably my favorite dish. The beef tartare was good as well.

I also ordered a smoked brisket sandwich which I enjoyed, but was a bit heavy on the horseradish cream even without the whole extra cup of it that comes with the sandwich."}
{"text":"First time there great atmosphere, slow service to start but they made up for that in the end. Ordered the seafood curry  dish that was delicious but it has zero curry flavor and zero coconut flavor. So in the end I would order it again but they need to rename the dish it is totally misleading. And it has very little broth. It also needed more spice for my taste.  The Korean wings were fantastic definitely order those!!"}
{"text":"My new favorite Pgh restaurant! Hip/trendy ambiance, super friendly service, a-MAZ-ing cocktails, and of course the food was outstanding! This is not your normal \"meat and potatoes\" kind of restaurant (no pun intended), so I would only suggest coming here if you're ok with eating outside the box. Very different than any other restaurant you'll find in the area. They approach every dish with a lot of creativity in both taste and presentation.

We had the following \"large plates' (entree-size; they also have \"small plates\" for sharing if you prefer): 

Dayboat scallops, shaved Brussel sprouts, crispy pepperoni, buttermilk, garlic crouton, pickled banana peppers

Braised goat, appams, garlic + ginger, smashed potatoes, curry, creme fraiche, lime

I would highly recommend them BOTH. The braised goat is now my ultimate most favorite entree I have ever had. It didn't come out with smashed potatoes but actually a kind of na'an (Indian pancakes) made from semolina flour that I used to soak up the curry... absolutely divine. 

A great date place but be sure to request a booth when you make the reservations otherwise you might end up at a communal table, which is fun with friends but not quite as romantic an ambiance."}
{"text":"Overall not impressed, the food is not all that great and the atmosphere treats itself bigger than it should. Pork dim sum was bland and the $16 flank steak noodles were drenched in salt ... At the very least the staff was extremely nice and I hear the tofu dim sum was decent... Just not my place I guess"}
{"text":"Pork ramen was the worst ramen I've tasted in my life. Tasted like pure soy sauce and salt. But I'll give the pork credit for its taste, that was delicious. But everything else was terrible

Short ribs are overhyped. Interesting  flavor, but it's mediocre-tasting."}
{"text":"Really good food!  The pork bite dim sum and brisket sandwich were standouts. I knocked off a star because I think it's a bit over priced for what you get."}
{"text":"So, as a cap to Pittsburgh Restaurant Week (Winter 14), the wife and I decided to go for a Sunday-Funday dinner at Grit & Grace.

We were really excited to give the American Dim Sum a try, and figured if we were going to do so, why not get one free?!...  wrong choice.

I'll start with the ambiance.  This place is 100x better than the disgrace it replaced (Taste of Dahntahn).  The relatively cramped space is arranged in a well-thought manner and the modern aesthetics are welcoming.

Relative to drinks, they have a decent cocktail menu with a few limited drafts.  While the wife's drink tasted great (and came in a Tiki glass to boot), it was mostly ice and at over $10, didn't last more than a few sips.

Now to the Dim Sum...  save yourself and pass.  All of the dishes we got left a ton to be desired.  Outside of being $5 per serving (for a single bite portion), they were relatively bland and left a ton to be desired.  Adding insult to injury, as we were finishing up, I saw what looked to be a FANTASTIC sandwich get served to the table next to us...  lesson learned. 

Based on feedback from others and the taunt I received while there, we'll go back for something other than the Dim Sum (likely for lunch), and I expect (or at least hope) the food to honestly be a lot better.  All things created equal, Grit & Grace is still a welcome addition to downtown."}
{"text":"Food was ok during lunch. Main issue during this visit was that it took over 30 mins to get our food, which is too long for a downtown lunch. They were not very busy and it still took long to get our food. The ramen soup was also a bit too salty.  Lastly, they need some kind of sound leveling for their background music. For some sings, the music was too loud."}
{"text":"Will not be back.  It was not busy on the Thursday night we went. The 'dim sum' menu was laughable. Got the chicken wings off of it and crispy pork belly bites which were a little too crispy (overdone because it was too tough). The short rib on a biscuit with a sauce was the highlight but the service was terrible and overpriced for the chicken leg my husband got for dinner. We had to wait 25 minutes for them to bring the 2 glasses of rosè we ordered.  Again, it was not busy and I forgot what our waitress looked like because she never came back to check on us. Disappointed with the place and will not return."}
{"text":"I stopped by for a quick happy hour with friends, and we were lucky enough that a party cancelled a reservation last minute, and we got to be seated. The hostess couldn't have been friendlier. The ambience is quirky and modern, and the seating in the back of the restroom isn't overly crowded, and there are some fun wood accents on the walls giving you that modern, yet cozy feel.

I'm not drinking these days, but my friends enjoyed their cocktails and wine by the glass. The most notable drink at the table was the gin & tonic that was anything but boring, according to my friend. The tonic is made in house, and my friend loved it so much that she ordered a second.

I need to go back and sample more menu items. This was a quick happy hour, and I only had time for one dish. I ordered the flank steak noodle dish with rice noodles, bean sprouts, and broccolini. The flavors of the dish were there, but it was so overloaded with salt that my fingers literally started swelling five minutes after I finished eating. This is a huge problem. If the flavors have potential, but you can't even enjoy food due to the inordinately high salt contact, you've got a problem.

The dim sum options looked interesting, and there were various other menu items I would be interested in trying, but if I come back again and leave feeling disappointed due to salt overuse, I will be disappointed."}
{"text":"The pork ramen was good as was the carrot salad.  However I found it ludicrous that I could not substitute the beet salad. The beet salad was available with other lunch selections but not with the ramen or the sandwich. I even offered to pay extra and was told I couldn't (even though the beet salad was actually $1 cheaper on the menu).  The waitress even said its been a big point of contention with customers. That is terrible customer service!"}
{"text":"Really enjoyed our meal at Grit and Grace tonight.
Service was top class, the dim sum was ok, but what charmed me was the menu and my Strip Steak dish. Delicious, filling, gorgeous looking! I will be coming back to try the appams and Braised Goat for SURE!
Also curious about the ramen. 

THANK YOU G&G for accommodating my friends requests and still serving her an excellent meal!"}
{"text":"Ordered the American dim sums. The taste is just ok but the quantity is really small. Not worthy the price. You can get much better options."}
{"text":"Pleasant brunch! Kinda a darker atmosphere for daytime.

Greatly enjoyed the choice of some breakfast breads- delicious biscuit, donut, and Siracha type bread which was so fun for us to all try.

For a lighter savory brunch I had the tabouleh and a side of the hash browns which were 2 triangles made of potatoes- a fun take on a breakfast staple."}
{"text":"There are few things more exciting in life than realizing you're at a restaurant on the VERY FIRST DAY of their brunch offering.  Congrats to Grit & Grace on adding this necessary meal to their line-up.

When I called to make a reservation, I was advised to allow two hours for a party of six.  Thankfully, I didn't listen, and we were done in under an hour.  Points for speed.  Among our party we ordered several items from the Breakfast Breads Dim Sum including Donut Holes, Banana Bread, Kimchi Pastry and Cheese Biscuits; and a series of Monte Cristo sandwiches, Braised Goat crepes and French Toast for our entrees.  The two French toasters didn't seem to be in love with their entrees, but the rest of us gobbled everything up with a smile.  My Braised Goat crepe was lush with goat, roasted potatoes and scrambled eggs accompanied by a simple romaine salad (Side note - I asked for scrambled egg whites because I'm a jerk like that, but instead received a side of egg whites and regular scrambled eggs in the crepe.  No big deal - I chalk that one up to first-day jitters).  Hooray for the food, but a bit Boo on the service.  To be honest, our server seemed a little sad yesterday. We all have our days, but when your mood is that palpable, you might want to take a sick day.  She is the one who explained it was G & G's first day of brunch as an apology for the egg white oversight. Again, no huge deal there.  It wasn't the egg whites that bugged me - it was her general attitude and lack of attention that left me wishing for a side dish of service.  Long after our checks had been collected, one person was still awaiting change.  It took him quite some time to hunt her down and she seemed surprised at his request. I suspect she forgot (happens to everyone), but if she thought she was collecting a 150% tip, she might want to REALLY consider a sick day.  Sooo - I'll be back, with the hope that the service end of G & G's brunch lives up to the crepes the next time."}
{"text":"The dim sum was not all the great. Save your room for the meals. 

Everyone I was with enjoyed what they ordered but we all agreed the best we had ordered was the pastrami sandwich! It was super tasty.

They have some wicked strong but good cocktail drinks as well."}
{"text":"Not good didn't like. The pork  belly was cold and unappetizing. Would not be back. Hard pass!!"}
{"text":"I really liked this place. Came here when it was grit and grace well over a year ago now, and I pretty sure it's the same for the most part minus the name change which makes sense because the name might have been a bit misleading.

I ordered the Szechuan noodles which had a bit of a kick to them with chicken. Tons of flavor and spice and the price was really reasonable to me. Did not take too long, and staff was very friendly. My friend got a chicken thigh rice dish which she also said was delicious. 

Overall a really good experience. We only went for lunch but I would definitely come back to dinner and to try some different entrees/apps."}
{"text":"This is a really nice restaurant to go on a date or just hang out with friends.  A cozy atmosphere with great service.  With respect to the food it is good, even though I am not particularly fan of this type of cuisine but nevertheless it was very well prepared and tasty.  I got the brisket sandwich, which was great while my company enjoyed their plates as well (hanger steak and scallops).  The fritters dim sum was also great and highly recommended.  One more plus of the venue is the large selection of beers, wines and cocktails! I will be definitely going back! 

ps Since parking can be an issue downtown do not circle around looking for a street spot, but there is a parking garage just behind the restaurant on Penn avenue (2 mins walk)."}
{"text":"This is my second time at G&G. I came two years ago when the sign still said \"Grit & Grace\" and vowed that I wouldn't come back. Yesterday, I passed by and saw the name change \"G&G Noodle Bar\" thinking that they had changed their management, menu or concept of some sort and decided to venture in again. They had me fooled. (Yes, I probably should've done some more research into it though.)

My mom and I shared all our plates being the typical asians we are. We got the bulgolgi lettuce wraps which was majority rice with some meat and veggies. It was quite underwhelming considering the hefty price of $12 you pay.

Since the place seems to specialize in some fusion dim sum, we decided to get their orange? pork belly dim sum. The flavor was good but the pork belly itself was dry and unsucculent. 

Lastly, we decided to order the seafood green curry noodles. The shrimp and mussels themselves were cooked well, but curry base was so salty that my mom even poured some of her water to distribute the salt. If they haven't changed the recipe of their dishes, the saltiness applies to their pork ramen dish as well (although it's not AS bad.)

Service is decent.

I don't get the overall 4 star review on this place. Compared to noodlehead in Shadyside, everyday noodles and ramen bar in squirrel hill, and even the asian vendors on CMU campus (yes I went there), this place is shit. Don't waste your time."}
{"text":"This place has so many mixed reviews I will admit I was a little apprehensive to go, but I was so intrigued by their menu and the good reviews that I thought hey I'm an adventurous eater!  These opinions will not hold me back from trying this cuisine.  So the night of Yelp @ the Benedum for Porgy and Bess, me and the Hub make reservations for 5:30.  Well we arrived much earlier having parked in the garage that was less than a block from the restaurant so we went in at 5 and was promptly seated.
I really liked the décor of the place.  Swanky, upscale, modern, but not pretentious.  The servers wore jeans so one would assume there is a laid back quality to the place.  There weren't many people in there when we arrived.   The waiter came promptly to us, poured us water and started to explain the concept of the restaurant, how they prepare dishes and deliver them as they are ready not delivering plates at the same time and the concept of sharing.  He seemed really knowledgeable about the menu and gave us a few minutes to look things over, and went to get our drink order.  

So after reading some negative reviews that portrayed this place as being \"overpriced\" for the quality and quantity of food, I am going to go ahead and disagree with you... However fearing that I may be hungry when I left I think I overdid the ordering.  We started with each getting something small to share.  I ordered the butter lettuce cups, braised pork terrine, , and the H ordered the short ribs, cream cheese biscuits.  Prior to our plates arriving the Dim Sum tray made its way to the table.  I could have passed on this because I know people talked about the portion and flavor VS the price, but let me say I am so, so, so, happy we didn't!  We got one of the pork belly dim sum to share.  I am not going to pretend I have some in-depth knowledge on what some have called \"real\" dim sum, and I don't care!  They could have called this pork belly in a bowl and it wouldn't have mattered because it was delicious.   I think the H didn't enjoy it as much due to the fat, but I simply thought it was about perfect with a nice spice of heat behind it.

The waiter brought out our lettuce cups, and the short ribs biscuits.  I only had a taste of the H's ribs&bis and unfortunately he cut me a piece that was mostly biscuit with very little sauce and small amount of pork.   I caught onto what he was doing, NOT SHARING!!!  Well from what I tasted I can understand why he bogarted the plate because it was good and I bet way better with all the ingredients present.  My butter cups were very good too.  I offered him a bite he declined.  I think all the different herbs and spices scared him off.  They were really good!  I would say my only complaint was the lettuce cups were wet like just washed and not dried so with every bite some water dripped off them onto the plate, the table and my hands.  Still an excellent fusion of ingredients.  

Lastly I order the corned duck breast ramen, and the H had  smoked brisket, , baguette.  When they delivered my duck soup for lack of a better word, I was taken back!  I seriously could have just ordered this that would have not only fulfilled my hunger but was wonderfully tasty!  The one hour egg lay in the middle of the dish.  I slowly pierced it to reveal the lovely yellow yoke drizzle down through my dish and sending me into a euphoric state of mind.  I have only had duck one other time in my life, I know weird, but if I told you about my first experience you would probably understand why.  However, I took a chance and let me say, if all duck is supposed to taste like this then I have found a new favorite poultry!  It was awesome!  So awesome that the H had to tell me to stop eating knowing how miserable I am if I overeat, oh and friends your dear narrator is very miserable when that occurs.  So I stopped, and within seconds I said why did I even get anything else?!  This was enough food for me and was delicious.  We both agreed that it was good to try the other items so we had a better experience with the food, but I am just saying this was more than enough for one person and it was not overpriced. I took the rest home and will be enjoying it for lunch today.  

Lastly the staff there was so friendly.  When we left every single person working there that saw us said \"goodbye\" or \"thanks have a good night\".  This was about 6 people.  We walked out saying wow they certainly are a friendly bunch. Overall I really, really liked just about everything.  One thing, possibly because it wasn't busy, our waiter kind of hovered over us. When I was eating my lettuce cups he seriously pulled the plate from underneath me as I took the last bite of the wrap.  I was still chewing and he snuck his hand under my jaw and swiped the plate!  I gave the H a surprised look......  Other than that it was really good and honestly I would much rather have an over attentive waiter than one I can't find...    Definitely will be returning."}
{"text":"Good snacks good drinks. Slow and not very friendly service.. Sat at the bar friday after work with co workers. Bartender was nowhere to be found and there was 4 hostess that stood around and did nothing. One even came to the bar and poured herself a glass of water! What about your customers?! Then this hipster guy in tattoos and plaid comes out and starts making drinks and takes our order but he was very short with us and was such a know it all. Soooo that was kinda of an annoying experience. The food and drinks WERE good but there was nothing about that place that was like I HAVE to come back."}
{"text":"I was very excited to go to Grit and Grace, however I felt a little let down. The ambiance is wonderful, and this is certainly a great place to hold a conversation.  But the food often sacrificed taste for the sack of novelty and cuteness.  I ordered the brisket, which was a very playful take on a Reuben Sandwich. That's fine, if you knew that's what you were getting.  The desserts were the same way...smoked apple crisp with crumpled cheez-it topping.  Fun and tasty, just not completely satisfying.  The concept of American Dim Sum is fascinating, but the Dim Sum menu was limited to 6 items, I was expecting more variety.  But if you think about it, how different is what they are doing from Tapas/small plates.  This is a very playful and inventive restaurant, it's just that the food was not as good as I was hoping for."}
{"text":"The atmosphere is sophisticated and modern. Dimly lit, and long but narrow, the effect can be likened to stepping into the hippest, glossiest closet you could ever hope to step foot in.
I ordered Rosé, even though it was only lunchtime. I highly recommend doing that.
Normally I'd have tried a bit of both dishes we ordered, but my boyfriend was NOT sharing his Crispy Szechuan Chicken noodle bowl, so I can only vouch for the Seafood Coconut Curry.
It was not like most curries I've had; in fact, the 'curry' aspect was simply a light curry infused sauce on the noodles. The mussels and shrimp were few but tasty, and the flavors combined beautifully.
It wasn't what I expected, but it was still good. The portion for the price, however, was a bit of a let down."}
{"text":"The food and service here for midweek lunch were wonderful! The waitstaff are knowledgeable and very helpful with suggestions and recommendations. We sat outside in the sidewalk seating area, but the interior decor is also lovely: modern with a sleek aesthetic. My favorite of all I had was the housemade ginger beer!"}
{"text":"Stopped in on Friday night, after enjoying \"The Nutcracker\". I had never been before & had been meaning to check it out. We were in luck- we arrived after 9pm and made it for their late night happy hour, which is Mon-Fri 9-11. 

My mom ordered the Singapore sling- which was a featured cocktail during the happy hour. She loved it. I ordered a glass of Pinot Noir, which was very tasty. 

We decided to order a few small items to munch on. We went with their seasoned chicken wings that were drizzled with honey & a side of white bbq sauce, and their chicken thigh slider with kimchi and spicy aioli. As we were waiting with for our food, one of their employees walked by with a tray of small dishes. He showed us their featured items- the cauliflower general tso's caught my eye & we had to order it. Each of the items I ordered were $5- not bad for a snazzy place like this.

Speaking of snazzy- this place is pretty cute. We didn't make it upstairs, but enjoyed the ambiance of the bar/ dining area. 

The food was awesome. The wings were DELISH- crispy, very meaty & the honey/ white bbq combo was incredible. I would definitely return for some of these again. The chicken thigh steamed bun was very tasty. The steamed bun was almost too sticky, but everything else about it was absolutely wonderful. The cauliflower general tso's was delicious. It was a very small portion but delicious none the less. 

The bartenders were very friendly & attentive to my mom & I. We asked them a few \"bartender questions\" & they were really helpful & nice. My mom & I enjoyed watching them do their magic behind the bar- they were creating such beautiful and unique drinks. 

Overall, I had an awesome time & am looking forward to returning!"}
{"text":"The food is good, but for the price, you can get similar meals for much less at other local establishments.  They do have some fun, over sized drinks, made for sharing that are quite boozy and delicious."}
{"text":"This is my second visit to Grit and Grace since it's opening back in 2013 [I know - a shame] and I absolutely loved the experience and am beyond happy that they have worked out the kinks in the menu.

I dined at Grit and Grace on Friday with my boyfriend and another couple after my annual admins meeting for Pittsburgh Happy Hour and we were hungry for Dim Sum. Being a drop in, we found a place at the corner of the Bar closet to the door. The restaurant is an elongated space with two large group tables at the front of the building, the left of the restaurant, and booths lining the right side. The setting is intimate and the decor is modern brass elegant.

Our first round of drinks consisted the Rivertowne Lager and the New Holland \"Dragonmilk\" Imperial Stout [11% ABV] and myself and two Mai Tai's for my friends. The beer selections is select draft crafts and slightly larger bottle list, yet they focus on their prohibition style cocktails and their assortment of wines.

The restaurant is known for their Dim Sum menu. Each day a selection of 3-4 Dim Sum selections is placed and ran through the restaurant on a tray by a designated waitress who lets you choose your selection from the tray. Each couple ordered two Dim Sum. We had the Steak Tartar, which was perfectly prepared and served with toasted bread [2 slices - there could have been another slice or two for the amount of Tartar], the corned beef hash [no complaints] and from the other side of the table the kim chi [received good reviews]. In the past the pork belly bites were great, yet sometimes oversalted.

Our party ordered a second round of drinks [I switched to my current go to Whiskey Sour with Eggwhite wisk] and we embarked on the next round of food.

For the main courses we shared an assortment of smaller bites and larger bites. My friends shared the carrot mixed salad which Lindsey went crazy about as a gluten free girl with a tender stomach. From afar it looked a little heavy on the vinegar but I will never doubt a tender stomach. We ordered the short ribs [which were melt in your mouth], the scallops with caraway gnocchi, pork cheek, and hazelnut crumble [with a few extra ingredients] which frankly was delicious on all but the scallops which were a tad tough, and the crispy wings. Of all of these, the wings were the most disappointing from the bunch. Unfortunately the herbed buttermilk sauce was not enough to make up for the dish. 

Here the kickers of this evening and my last visit and my absolute LOVE LOVE LOVE recommendation for any trip to Grit and Grace: 

first - the Crispy Pig Face Roulade - a small plate with just the correct amount of crisp and egg yolk. Deliciously put together, you bite into a well balanced flavor fest. It's just what I would make when I get home from a night out and have the hunger for drippy egg and toast.

and second - the HIGHLIGHT of the current evening - the ROASTED OCTOPUS! What an absolutely surprising find on recommendation of the Bartender and something I would have usually not looked twice at until now. Accompanied with Mussels and potato bites, this tentacle delight swims in a lemongrass broth on tomato base that will make your taste buds go bonkers. We could just simply not get enough of the broth and before we knew it we were dipping everything we could find, and slurping it up with delight [well practically]. This is my favorite dish of February and the reason that Grit & Grace will be pushed and recommended to all of my friends in the area.

Absolutely splendid and an amazing way to spend pre-valentine's day dinner."}
{"text":"At the end of a 4-day trip in Pittsburgh, dining at Grit & Grace ended up being  the best experience we had in downtown Pittsburgh. On a Monday night, they weren't very busy so we were seated quickly. The combination of the modern decor with a casual feel along with creative food options was something that suited my dining style. 
Their menu features a lot of food options from noodles, salads to small plates to share or larger plates as entrees. In addition, they also have 5 American dim sum options that they bring table side for you to see and choose. We had the pork belly dim sum that was totally worth all the fatty calories that kept staring at us. Edamame hummus from the standard menu was a lighter refreshing version of a standard hummus and was great for sharing. I don't know about the portion size of their other dishes but the noodles were definitely served in huge servings. The chicken meatball ramen came in a rich flavorful broth that you would only get after long hours of cooking and simmering. We were all stuffed but somehow I talked everyone into sharing the sticky toffee cake with me. It was so tasty that I could have licked that plate clean but for the sake of not embarrassing my friends, I decided to act like a mature adult and refrain from \"cleaning\" the plate. Yes, G&G was so good that it brought my inner child to the surface but I don't see any problems with that!"}
{"text":"This street food-type menu is a yummy treat! The drinks are quite good as well. We order several small dishes and dim sum and split a noodle dish. I really enjoyed the chicken wings with hot honey, such a unique flavor combo. We prefer a more varied meal where we can try a lot of options, so this style of service is great for us. Try G/G to get out of the normal restaurant rut!"}
{"text":"Wonderul! What a great contemporary take on Asian dishes.

I recommend:
1) Starter: Karage style chicken wings
They're perfectly crispy on the outside and moist on the inside. They're spicy and sweet, and the dipping sauce is a great complement.
2) Entree: Dandan
It's not the soupy kind of ramen, rather resembling a stir fry of sorts. But the flavors are excellent. Very pickle-y.
3) Dessert: I don't remember what it was called! But it's a butternut squash purée(mousse?) with a ginger snap crumble and salted caramel. It was just so decadent and delectable. Absolutely perfect.

I'd definitely go again."}
{"text":"I've been here 3 times, and I absolutely enjoyed each of the visits! The dishes represent a nice blend of Chinese, Korean, and Japanese ingredients and flavors. My favorite is definitely the dandan noodles; I'm from the area in China where dandan noodles were originally invented, so I can tell you it's not authentic. But who cares! It's delicious!!! The dim sums are quite tasty as well. Last time my bf and I couldn't decide between pork belly bites and General Tso's cauli ower, so they let us have one on the house - such a nice gesture! I highly recommend this place and am definitely going back soon. :)"}
{"text":"I visited Grit and Grace last night with CM at 6pm prior to seeing a performance of the Pittsburgh Opera at the Benedum.  Since we dressed up a bit more than we usually do on a daily basis to attend the performance, we figured we might as well take advantage of it and check out one of the trendy downtown restaurants.  We were originally hoping to go to the Commoner--the newest trendy restaurant to grace the downtown PGH dining scene--but they didn't have any reservations left for a time that would be conducive to seeing the show.  Thus, we made a reservation at Grit and Grace, a restaurant I'd been wanting to check out for a long while.  We're certainly glad we did, since we were both quite favorably impressed with our experience at G&G.

Knowing that G&G is known for their American dim sum, we started off by choosing two of the dim sum options from the tray brought around to us by one of the waitstaff--the pork belly bites and the chicken \"chips and dip\" ($5 each).  Both consisted of a harmonious medley of flavors and textures, pleasing the palate.  The \"chips and dip\" consisted of fried chicken skins with a chicken liver mouse, which was quite savory, if a bit redundant in flavor.  The pork belly bites were crisp on the outside and incredibly juicy on the inside, and were highlighted by a orange chili sauce.  Although they were great on their own, they were improved even more by a bit of the sweet onion sauce, one of the three house made condiments at our table.

For our entrees, based on past reviews, we ordered the pig face roulade sandwich ($10) and the roasted octopus ($16).  Although a bit unwieldy to split, the pig face sandwich presented extremely well, and the taste matched the presentation.  This sandwich reminded me of an upscale version of a breakfast sandwich, in the best possible sense!  It consisted of pork belly bacon and an egg served sunny side up adorned with greens atop a slice of sourdough bread with miso apple butter.  As in the dim sum, the flavors and textures struck a nice balance between savory and sweet and crispy and tender.  My one criticism was that the ingredients weren't evenly distributed, especially after splitting the sandwich in half, and it was difficult to separate them, making sharing a bit of a hassle despite G&G's emphasis on shareability.  As for the roasted octopus, this dish blew everything else we ordered at G&G away in terms of flavor.  The sourdough croutons were the perfect medium for soaking up the broth, which was mouthwateringly savory.  The octopus itself, as well as the mussels, were perfectly cooked--tender, and not rubbery at all.  I only wished this dish had come with more than one piece of octopus--but then again, it is listed as a small plate.  Although this dish needed no addition, it provided a wonderful medium to try out the house made soy vinegar sauce, which added an extra layer of flavor depth to the sourdough croutons.

The service and ambiance were commensurate with my expectations for a trendy upscale restaurant in PGH--helpful, but not overbearing, and interestingly decorated, featuring geometric elements.  In total, our check came to $36 before tax and tip, which we felt was very reasonable for a restaurant of the caliber of G&G.  Having said that, it would be easy to spend quite a bit more, since we didn't order drinks or dessert and stuck to dim sum and small plates.  We'll definitely have to return at a later date to check out the tiki drinks, since I've heard so many great things about them. 4.5 stars."}
{"text":"Ready for a grown-ass person's cocktail and some appies?  Of course you are.  Grit and Grace is a mainstay for foodies on the prowl near downtown's Cultural District.  It's a wee bit off the circuit, although still right off of the main drag, so you have easy access to Market Square and parking garages.  But, location isn't its main selling point.  The food is pretty unique.  I'd describe it as Asian fusion, which is more than appropriate given that they are specifically going for \"American dim-sum\".  Like a dim sum restaurant, small plates periodically make their way around the floor, you take what you'd like, and it's marked on a card for your table so that the server knows what to charge you for.  They do, however, have a regular menu with both small plates and large entrees.  My most recent visit was after a night at the ballet, where my friend and I ordered a cocktail each, then split several plates.  The clear winners were the short ribs on cream biscuits and I personally could have eaten a bucket of the honey spiced chicken wings.  We also shared roasted fingerling potatoes with an aioli, and some ahi salad.  Everything was excellent.  Our server was cool.  Even the hostess chatted a bit with us.  People seem to like working there, and that goes a long way.  Be ready to shell out a couple of ducats, but know that you'll be getting some quality eats for it."}
{"text":"I did a quick review on Google and wondered why my friends wanted to meet here for dinner. Wow was I surprised!

The bartenders know a LOT about what they are serving and allowed us to taste what interested us.

The food was well done, but anything with pork belly was amazing.

Highly recommend that the chef not refer to kimchi on the menu. I was raised in Korea and I was expecting more sour.

The decor is simple and clean. Exactly what I like.

I included a nice pic of my friend John showing us how to enjoy wine. LOL"}
{"text":"I stopped in Grit and Grace for an early dinner on my way to work. I enjoyed the atmosphere, which is a sharp change from the urban bustle of downtown. I had a little nibble from the dim sum tray, which was a bit lacking in my opinion and at the price of $5.00 for two little bites was stiff. I throughly enjoyed my pig face open faced sandwich,  it really hit the spot. 
Overall, a nice place, despite the few dollars over they're charging for their dishes."}
{"text":"Good food! Went with the boy and started off with the GT Cauliflower. A good little appetizer to share, and our meals were out not long after. He got the fried rice with Chicken and I got the beef ramen. The beef was SO GOOD. So tender and perfect with a bite of noodles and broth. The noodles were a great consistency and the dish was very well complimented by pickled mustard greens and hot pepper slices, all tied together by a soft poached egg. My only complaint was that there wasn't enough broth for my preference in the bowl - although I like to be able to have a spoonful with each bite : ). Fried rice was pretty awesome too! Kimchi, beans, pineapple, egg, and very very tasty chicken. Not too oily, but had a lot of flavor! Went on a Monday night around 8:30p so there was no wait, but I could see it getting pretty packed during peak times."}
{"text":"We didn't order any entries but we shared quite a few small plates. Everything was delicious! I didn't like my drink but the food was amazing enough for me to overlook that."}
{"text":"After reading about the opening of Grit and Grace in a Pittsburgh based magazine (maybe Whirl? can't remember). I anxiously awaited the opening. We made reservations for a Saturday in early Jan., not long after the opening. When we arrived, I noticed that the restaurant was full. There were also several people at the bar. The decor is modern with great character- exposed beams and duct work. The tables were set with 3 mason jars of something different in each one. I'm not sure what they were because our waitress never explained this to us and I forgot to ask with trying to decipher the menu. When we ordered, we were told that the food comes out as it is ready. There is not an order to it. I can imagine this would be an issue if you are not inclined to share with your dinning companions. I chose the braised short ribs with rice noodles, broccolini, mushrooms, bean sprouts, onion and garlic. I also wanted to save some room for the dim sum. Luckily, four of the 5 plates our table ordered arrived at the same time so we each had something to eat. I enjoyed the beef short ribs dish. The noodles were cooked perfectly and complemented by the tender veggies. The beef was also very tender but extremely fatty. Then I waited and waited. At this point, we had been waiting for the dim sum for an hour. After asking our waitress, the dim sum quickly arrived. I chose to try the noodle dish again. This time it was cold with julienne veggies. I really enjoyed the idea of dim sum but was not blown away by the dish I chose. It also seemed a bit on the pricey side as each dim sum was $5 and most had 2-3 small bites. Overall, I love the IDEA of the restaurant so much that I will probably give Grit and Grace a second chance and will try some of the other options.  Stay tuned for a future update."}
{"text":"Grit & Grace lives up to the 4 stars. I'll break down my experience for you all!

Busy on a Saturday as you would expect. Need reservation at least 5 hours prior. Service was good and friendly. The atmosphere was hipster/industrial. They didn't have the air on and it was very warm. This is one of the reasons I dropped a star due to me not being comfortable. 

Drinks: scorpion bowl is great looking and tasty but for two people it falls short. Paid $15. Worth $12. 

I recommend one of their signature cocktails they have listed on their menu. These run $8-12 but worth it. Very good value! Whether you like a drink that taste good or someone that likes to taste the liquor, you will enjoy!

Food: think tapas before showing up. This part was confusing because they don't mention tapas anywhere but that is the style. Some items are very small, some are medium. The price will help determine size. 

The 2 dim sum options we tried were good. The tofu is served cold on purpose and flavorful. The pork belly stole the show. We ordered two of these. Dim sum = $5 each. Worth it!

Wife ordered roasted pork ramen. The pork and broth were delicious. I wasn't a fan of the noodles but my wife loved the whole dish. Medium size and was a good portion if you had apps/dim sum before. $13. Good value at that price. 

Steam bun: tasty, but it was a glorified hotdog. It was a good hotdog taste. Just be ready for the similarities in taste. $7. 4 bites and I was done. Should be a $5 appetizer. 

Shaved flank steak: the steak was great. Not much but it was delicious and tender. Not chewy. Good amount of noodles in this make it a meal vs tapas option if you have some dim sum before. $16. Worth $13. 

We will go back. They seem to excel when it comes to pork. The signature cocktails are great but the place was to warm and we would have bought more drinks if they could serve them faster. We will be back."}
{"text":"This was a bit of a disappointment I would have to say. For the dim sum, I had the kimchi. The server informed us that it was not as spicy as regular kimchi, but I would say that it was not spicy at all. I did not feel like there was a lot of flavor.

I also had the beet salad for my meal, and it was much better. I'm not sure that there were that many beets in it, but it was good all the same. There was avocado puree beneath the salad, but I expected it to be pieces of avocado, but that is my only complaint about that."}
{"text":"I came here with really high expectations. There were a lot of articles saying how it is an amazing place to eat. The dim sum experience is nothing like the asian experience and the variety is very limited (4 options). The pork belly bits were very tasty and they were the only ones we got. The ramen (chicken meatball) wasn't anything special either. The ambiance was very nice, but the food itself was very mediocre. Howeverrrrr, the dessert was really good. Something like dirt pudding dessert. That was very worth getting. If you are craving asian dim sum, don't bother coming here. If you are craving anything asian don't come here."}
{"text":"Came here on a Friday night after seeing a show in the Cultural District.  It is a nice upscale place Downtown with a rather unique menu.  Best way that I could describe it was Upscale American Asian Fusion.  The atmosphere is nice and it was quiet in there.  The staff was friendly and helpful.  My friend and I ordered the Pork Belly Bites and the House Kimchi from the American Dim Sum menu, as well as the Flank Steak and the Roast Pork Ramen for our entrees, and some kind of a salad that was pretty good.  Everything was absolutely delicious!  The pork belly bites were cubed and the thickness gave it a flavor that you don't usually get with thinly sliced pork belly.  The kimchi was not very hot or spicy, but it had a really unque flavor to it that was quite tasty.  The Flank Steak and the Roast Pork Ramen were both as delicious as they sound.  This place is a little pricey, but I expect that from an upscale place Downtown.  Besides, the food was so tasty that it was definitely worth it.  There are so many wonderful places to eat Downtown and I like to try new places.  But I would definitely consider eating here again anytime I'm hanging out Downtown."}
{"text":"I had the Arctic Char for the meal and the \"dirt\" dessert.  Excellent flavors from beginning to end!  This may be my new favorite fine dining place in Pittsburgh."}
{"text":"They take their ramen seriously! My friend and I both had the chicken ramen with 5 minute egg, so it was cooked in the outside and runny on the inside. Totally recommend it! I am Indian and am used to much spicier broths which I have tasted in New York, so a milder one was refreshing. I might go so far as to say it was too mild but who's checking. For a appetizer, my friend and I shared the pork pieces. They were very well glazed and the spring onion bits added crunchy freshness to them but there is no taking away from the fact that we were eating pure unfiltered fat. For the flavor they are amazing, but I would recommend 2 people finishing that little heartattack in a bowl. The price was really good but too bad I couldn't stay for dessert. The call from Prantl's bakery was just too loud :)"}
{"text":"Overall had a great experience! Went here for brunch and got the French toast! They were very fluffy and delicious. The cocktails were fun and enjoyable! The menu at times can seem all over the place but whatever is ordered will be good!"}
{"text":"I'm kind of on the fence about this place, I really could take em or leave em. The food wasn't bad but not really that great either. I get the concept they're going for and I dig it, I just think the food could stand to be a little better. The portions are very small so you have to order quite a few things to fill you up. So therefore the bill gets pretty pricey. I was a little weirded/grossed out when I sat down at the table and there were 4 different sauces without any lids on them already sitting out on the table. I sat at a table outside so people walking by were walking right next to these open sauce dishes. One sneeze or cough by someone walking by or someone sitting at the table and there it goes..germs in the sauces. So needless to say I didn't try any of the sauces that were sitting out. Same thing goes for the tray of dim sum dishes that the waitress takes around from table to table. Maybe I'm too picky/paranoid but it kinda grosses me out. 
Chances are I won't be back. Wasn't that impressed to try again, prices too high and not many vegetarian choices either."}
{"text":"I went to Grit & Grace on Friday for a colleague's goodbye celebration. I thought the cocktails were solid, the vibe was energetic, and the service spot on. But I'd give the dishes I ordered only 3 stars. So I bumped up my rating to 4 stars.

I'd definitely go back. The ladies sitting right next to me ordered what looked like an awesome spread with a lot of vegetarian options and from the looks of it, they really enjoyed it. 

I may have ordered the wrong dishes which were the spicy prawn papaya salad and mortadella steam buns. The papaya salad was really bland and lacked the pungent goodness of fish sauce. I'm familiar with this salad from my days traveling in Thailand, so I was a bit disappointed when the dish delivered such lackluster flavor. Loved that it was served with whole prawns though.

The mortadella steamed bun frightened me because it looked like a slab of spam between a bun. Ouff.  The flavors were tasty nonetheless, but as the saying goes \"you eat with your eyes first\"."}
{"text":"We'll prepared food .

Amazing drinks ,they were the best. I lived the chickpea fritters. 

I would have loved more vegetarian offerings.

Friendly and attentive bar and managerial staff. Nice atmosphere 

Perfect tiki drinks

This isn't for the stroller crowd, no tater tots or hotdogs here!   I love eating in an adult environment!"}
{"text":"New inside, very nice use of space. Knowledgeable server, friendly. I had short ribs on cream cheese biscuit with aged white cheddar and hollandaise. It melted in my mouth, it was so freaking delicious. I also had a glass of red Zinfandel. It was $13 a glass and I believe it was a 6 ounce pour. My wonderful husband had the My Dark Storm cocktail, rum with house made ginger beer. I tasted it. It was the best dark and stormy I have ever had and for $8 we will return and sit at the bar for another. The tapas portions are small, as expected & expensive. But if you are looking for a very tasty treat, this is a place to visit."}
{"text":"Love the dim sum concept - almost wish they'd just go with that and skip the whole menu entirely.   

We ordered two dim sum options from the tray, two salads, and two small plates.   The dim sum options were by far the best things we tried.   They were actually pretty amazing.   The smoked tofu & soba noodle salad was tangy and delicious - a perfect compliment to the pork belly bites, which were rich and buttery.  

Then on to the salads.  The iceberg was described as \"inspired\" by the ginger dressing salad you get at Japanese restaurants.  It was actually almost identical to that, which ended up seeming a little uninspired after the two very special dim sum treats.   My salad was the miso braised eggplant, which was delicious and flavorful, albeit a little small for $9.   

Finally, we tried some small plates.  The confit chicken wings were great.  Tender and saucy, with a kick of spice from some red jalapenos.   The crispy pig face roulade, though, was a disappointment.  I'm not sure where the \"roulade\" was actually - it was presented as an open faced sandwich with meat, etc. and a fried egg on top.  I was given a steak knife to cut it with, but it was insufficient to tackle the task.  In the end, I had very unevenly balanced bites and I worked really hard to keep it all on the plate as I was butchering it.  Way too much work for something that paled in comparison with everything else we ordered.  

Bottom line - stick to the dim sum.  Everything on that tray looked amazing!"}
{"text":"Delicious Asian fusion noodle house. Great drinks, delicious food and friendly service. They also have unique dim sum dishes available."}
{"text":"The dim sum really rocked my world.  Pimiento cheese spread on fried chicken skin?  Yes please.  Pork belly bites?  Obviously.  

The pork ramen entree is enormous - I think it took me 30 minutes to eat it.  We also sampled the short ribs with bearnaise at the end, though at this point I was barely fitting into my stretch pants.  

G&G is an excellent value for the price.  My only complaint, if you could even call it that, is that the wine list was somewhat limited for food that is on the level of fine(r) dining, but that's not really a real complaint."}
{"text":"Ramen done right! My son is loves ramen and talked me into a to-go pork ramen! It's so damn yummy! The egg was perfect, the meat was tender and the mushrooms were meaty. The price is right for a hearty lunch. I was surprised and impressed! Good job y'all! I will be back for date night."}
{"text":"This is a good place for a business meeting, happy hour or a first date. If you're starving and looking for comfort food, this is not the place for you. Most of the dishes are appetizer like portion. Their dimsums are not what you'd expect a dimsum would be like. 

The food is good however, you may want to manage your expectations. I was still feigning for some food and went to Proper Brick and Oven after ."}
{"text":"So sad that we didn't get here until the Restaurant Week RIGHT before it's closing. We all enjoyed our meals and the service was great. Hope the owners open up another cool restaurant instead of putting in a chain."}
{"text":"Went here on a Monday night with a group of 4. Not busy, but we still had a reservation just in case. 

We enjoyed the dim sum to start. We grabbed 4 bowls from the selection, and that was a good number for our group. The pimento cheese was difficult to eat with chop sticks but still enjoyable. Also, the pork belly was gone instantaneously. 

We then ordered 2 small and 2 large plates, which appeared to be the right amount for 4 people. The ribs plate only had 2 portions on it, so be careful if there are more than 2 of you. This was the best plate we got and we were all sad to split the portions. 

We also got chicken wings, hangar steak, and a tofu dish. Everything else was good, but it was all about the short ribs on biscuits. Period. 

Oh, and I've been craving biscuits since then. Ugh."}
{"text":"Food was super interesting and tasty.  Sit at the bar and get great service and cool drinks from Erin."}
{"text":"Very good. Portion size is small but great the decor is cool it's very LA. Very 80's Patrick Bateman would eat here in Pittsburgh."}
{"text":"I absolutely love Grit & Grace.  Another one of my favorites for lunch and dinner.  

First off- every time we have been here, service has been great.  Everyone that works here truly seems nice and happy to be in the hospitality industry. They make us want to come back. 

My lunch go to is the chicken thigh salad- it's the perfect size and so good.  The vermicelli noodles are always a perfect texture in my opinion and the dish has such a great flavor.  I always opt for the pork belly dim sum... The soba noodle one is great too.  They also have a nice selection of hot teas... Now that it's getting colder, that's a huge plus for me.

In terms of dinner- we opted for a steam bun, more of the same dim sum, plus another one or two.  The steak that I got was perfect... Cooked to perfection.  My hubby liked his beef noodle dish too- but I don't recall what it was.  The bar has some crazy mixed drinks - including the Scorpion (I have had in other cities). I have not yet tried it here yet but am looking forward to.  

I am finding that G&G is becoming one of our go to places.  It's consistent, has great service and great food in a great environment."}
{"text":"We ventured here last weekend, and I'm already looking forward to going back. 
The drinks were excellent!  We tried the Kaffir Lime Gin and Tonic and the Jungle bird. The gin and tonic was an interesting twist on a gimlet, and the hint of smoky pineapple in the Jungle bird really balanced the sweet, rich taste of the rum. Next, for dim sum, we tried both the steak tartare and pork belly bites. The steak tartare was a hit- a definite must try! For our entrees, we tried  the chicken Ramen and shaved flank steak noodles. The Ramen was so tasty- delicious miso broth, veggies, kimchi, and chicken meatballs blended together in perfect salty-sour-spicy harmony.  The flank steak noodles were not as exciting, but still tasty- I likely wouldn't order it again. I'm looking forward to going back to try more from the menu!"}
{"text":"Went here on a date with my fiancé and the atmosphere really quite nice for a night out. I ordered the pork ramen and it was just so juicy! It came with the most delicious pickled cucumber which I still can't get out of my head haha. Our waiter was also super friendly and helpful. I would definitely go back for sure!"}
{"text":"Made it here for Pittsburgh Restaurant Week Winter 2016, pre-name change.  Our party of 6 sat in a mostly empty dining room on a Sunday night.

We had the KIMCHI and PORK BELLY BITES off the dim sum menu, the MORTADELLA STEAM BUNS and CHICKEN WINGS from the small plates menu, and FLANK STEAK RICE NOODLES and VEGETABLE RAMEN for entrees.  Across the board, our appetizers were delicious, while our entrees were extremely underwhelming.

The kimchi, made in house, was wonderfully executed, a well-spiced blend of napa cabbage, daikon, and carrot.  I could understand the hype behind the pork belly, which was well-cooked but toothsome, and the aioli pushed the dish over the edge.  The mortadella buns were my favorite dish of the night.  The authentically soft steamed buns tasted like my childhood, and the mortadella surprised me with how well it complemented the Chinese-style bread, especially topped with the bread and butter pickles.  A truly delicious bite.  And the chicken wings didn't particularly stand out but were no slouch.

I wish we had stopped there (and ordered more appetizers), because both our noodle dishes were so lackluster I could barely believe they came from the same kitchen.  The primary taste of both dishes was simply salt.  The flank steak completed lacked flavor, as if all the taste of the meat had been simmered for stock and boiled away.  And the broth from my ramen, which is the test of a great bowl of ramen, simply tasted of sodium and nothing else.  As a salt junkie who frequently overseasons my food, I was surprised by how disappointing I found the dish.

I'd perhaps return to give G&G another try post-rebranding.  After all, the space is beautiful, and buns are definitely worth repeating.  The direction they chose to take the restaurant surprised me, as I wouldn't have expected them to shift towards a heavier reliance on more authentically-Asian dishes.  It just didn't seem to me like their strong suit.  A true dm sum menu should be much more extensive than 4 or 5 dishes, and ramen broth, even vegetable ramen broth, should taste as if it has been stewed with aromatics for forever.  Hopefully, these deficiencies that feel like huge shortcuts will be finessed as they continue to streamline their menu."}
{"text":"I went here for drinks. I will be back, although I will say that my review is subject to change with upward bias. My review was conservative because I am a food snob and I don't like to hand out great ratings. Drinks were good for pittsburgh. I don't care what anyone says, PBurgh is not a great food town. This is a decent place and if you are from out of town you should embark confidently--you will have decent drinks and food. It's no Steven Star, but it's a decent spot for Pburgh.

Update: I changed my rating after evaluating my consistency. I like this place. Agree with my comments earlier, minus the conservative rating non-sense"}
{"text":"I took my wife there for her birthday after she had done exhaustive research on new and trendy restaurants. We had been to Spoon (same owner and chef) and loved it. We expected at least as much from Grit and Grace. We were greatly disappointed.

The pork bellies that other reviewers seemed to love, we hated. They were full of fat and had virtually no meat. Basically well-seasoned, tender cubes of pure fat. As tiny as the serving was, we left nearly half of it in our bowl. It was gross. 

A second Dim Sum dish yielded mixed reviews. She loved this dish she remembered as Brussels sprouts. I remembered them as artichoke hearts. I found them over-seasoned and likely to overpower anything that came next. Very heavy on the vinegar. I couldn't taste anything else in this dish even though it had onions and other ingredients. She liked it well enough to order a second helping at the end of our meal. My reaction was that she ordered it more out of hunger.

We tried two rib dishes. The ribs on a biscuit were excellent, but as you would expect in a small plate restaurant, the portions were small, just a bite or two each. Not much for your money. 

We also ordered the hanger steak. We both enjoyed the dish, but the portions were so small I had forgotten that we ordered it by the time I sat down to write this review. My wife reminded me. We liked it, but we can get a full meal some places for what we paid for a couple of bites.

The ribs with noodles were nearly as fatty as the pork bellies. They were also covered with a layer of salt. Healthy cuisine is one thing. This dish was not only unhealthy, it tasted awful. The rice noodles were a soggy mess. You know you're in trouble in a small plate restaurant when diners leave nearly half of a dish on their plates. In retrospect we were angry at ourselves for not sending it back. 

Some people across from us ordered the brisket and left much of their food behind when they left as well.

The decor and seating leave a lot to be desired. One side of the dining room has elevated hard benches opposite elevated padded bench seats. No one on that side seemed comfortable. My wife, an artist and art teacher by trade, felt the artwork looked unfinished. She did like the wood sculpture suspended above us. The lighting was so dim that reading the menu was difficult.

The bottom line was that we ordered five dishes. Two we found in-eatable. Two we liked. One dish one of us liked and the other did not. We spent a fair amount of money. I should mention that we have dined out in some pretty expensive restaurants and really enjoyed the experience.  The issue for us is value, not price. 

On the plus side the service could not have been better. The service is what earned this place a second star. Even so, we are not planning a return visit. We stopped somewhere else on the way home to get something to eat.  For so much money Pittsburgh has many better choices."}
{"text":"REALLY enjoyed my meal here.  Was dying to try it as Grit and Grace and by the time I pulled the trigger...it was...not.  So...G&G Noodle bar...

Small Plates:  get the General Tso's Cauliflower.  I'm serious.  Do it.  Now. 

Entree:  I had the Dan Dan Noodles and they were delicious.  

Atmosphere:  was dark but trendy casual.  My only complaint was my seat, that sort of stuck out into the main aisle.  

Bar:  I had El Luchador (the El Luchador seems redundant) and it was just as smoky and spicy as I'd hoped...a little ginger, a little mezcal, some jalapeno.  I stopped at two, and if I wouldn't have been on a time crunch would have sampled a couple others that looked intriguing.  

Seemed like a nice place to take a group.  Maybe not the MOST romantic place, but still a good date destination if you're not popping the question and just want to enjoy conversation, drinks and good food."}
{"text":"What a delicious meal! I'm a sucker for a restaurant that offers small plates and suggests you share. It's a great way to truly experience the food in one visit. 

We started with two items (general tso cauliflower and chips and dip) off the American dim sum menu. The cauliflower was absolutely delicious. The chicken skin chips and chicken liver dip were unique but not something I would want to order again. The pork belly looked divine and is already on my list of must try's for next time. 

We shared the chicken meatball ramen, fingerling potatoes, and short rib cheddar biscuit. The short rib was by far my favorite part of our meal. Next time I'll get an order just for myself. The fingerling potatoes were cooked perfectly and the queso fresco and salsa really added to the dish. 

Our dessert, chocolate mousse with curry ice cream, praline macaroon, and coconut was the perfect ending to an excellent meal. 

The location is small, so call ahead for reservations."}
{"text":"I was excited to finally try this place after hearing so many great things about it.  I am happy to report that it did not disappoint.  

I visited with a friend late on a Friday evening.  We were promptly greeted and given the option of bar seating, communal table seating or the booths in the back.  It was nice to have a variety of options.  We chose the booths because we wanted to be able to chat.  The waitress asked if we had ever been there before and when we said no, she explained the menu and the dim sum \"cart.\"  I like the way that the menu is laid out essentially by portion size.  It gives you a better idea of what to expect from each item that you order.

After hearing so much about their cocktails, I was eager to try them.  I tried the Jungle Bird which had 
dark rum, campari, smoked pineapple and lime.  I enjoyed it but it was different than I was expecting.  I was also hoping for a larger cocktail for the price.

We started with the pork belly bites and teh house kimchi.  Both were delicious.  I often don't like kinchi and I found myself wanting more once it was gone.  The pork belly was perfectly seasoned and tender.  The next course was the roasted carrot salad.  It had just the right amount of each ingredient (edamame, romaine hearts and cheese curds) and the dressing was a great combination of sweet with a litte kick.  It was refreshing and fun.

For the main dishes, we tried the roast pork ramen and the flank steak.  It was a toss up between the two since both were so excellent.  I also enjoyed that the server brought two bowls and spoons so it made it easier to share the ramen soup.

The downsides to this restaurant are the price.  Everything is tasty and I did leave totally satisfied, but with the smaller portions, things can really add up fast.  The bathroom is also down a set of stairs and through a hallway which can be a tad inconvenient.

I did really enjoy our experience and hope to return with my husband soon."}
{"text":"Nice Asian fusion place in Downtown Pittsburgh. First time we had lunch, this time - brunch.
Lunch menu options we liked better, but appetizers impressed us more then entrees both times, and definitely no ramen for us. Next time we try them at dinner time."}
{"text":"this is more of a place to be seen, tourist trap almost --  somehow i spent $180 on a few glasses of overpriced champagne and beer and still left hungry, better asian option in Lawrenceville etc"}
{"text":"I came in tonight for drinks and dinner with a good friend. I didn't feel like waiting for a table so I sat at the bar until my friend showed up. Immediately, I was engaged by a bearded bartender who made me feel totally welcome. He promptly made me my drink and provided great company until my friend arrived. A female server gave us excellent food recommendations and then another really friendly server with dim sum took the time to explain the food he was serving. The pork belly was amazing. He went above and beyond in talking about the menu and gave us good company. Justin and Collin are awesome!"}
{"text":"This place was great! They seated a very large party of us quickly, and the hosts/manager were incredibly friendly. Food was fantastic with great service. I like the idea of dim sum that they walk around with; our table went with the Kim chi. We had a party of 9 and everyone was happy with the atmosphere and the food. In fact, some folks walked by the restaurant where we were sitting outside and asked if we would recommend it, to which we emphatically said, \"yes!\""}
{"text":"I have been to Grit and Grace a couple of times and I love this place. From the decor, which is quite cozy and elegant to the food and the drinks, I just keep coming back.

The first time I was here we had a couple of different cocktails and all of them were really nice, fresh and simple. We also had the dim sum with it and who really can say no to those pork belly bites that are to die for? I do believe they change their 4 dim sum items from time to time, but you can't go wrong with any of those dishes.

I have also had the beef tartar and the pork belly ramen. Now the tartar was super fresh and tasty. The ramen, while tasty, was a bit too salty for me, but still good. I was a bit disappointed that it was soy based broth, but they mentioned this when we ordered so we knew what we were getting into. The second time I was here I tried the pork buns and gyozas and we tried some additional smaller dishes. Everything always seems to be fresh and made with love.

Grit and Grace is also the only place that I know of that has a happy hour from 9-11pm (Monday to Friday) which is perfect for me. The only think I don't like is that you can only enjoy the happy hour when sitting at the bar, which is quite disappointing!

Nevertheless, the quality is always right here and if you're looking for a nice place to enjoy a cocktail and a couple of bites, this is the place to go."}
{"text":"Absolutely love this place! I was there last summer with my family back when it was grit and grace and we all enjoyed it, so I was really excited to check out the new menu with my boyfriend! The food was awesome! We started with Korean fried wings and yellowtail sashimi (I know, it's a strange combo, but this is two of our favorite things to eat so we had to try them both) and then shared noodles for s main course. It was great! I don't remember what noodles we had,but they were spicy, flavorful and delicious! We will definitely be back!"}
{"text":"First time for 3 of 4 of us. Birthday dinner on a Sunday evening.

No need to give a play by play. This place is trying to do something unique for Pittsburgh. That's awesome. But, they should ensure their customers understand what they're ordering. Setting expectations is a key to customers' happiness. It was a really confusing dining experience. 

tl; dr: Cocktails are meh. Food is really delicious. Service is lacking. 

Here are the key points:

- quality of service doesn't match price point, ambiance, or cuisine. Service made us feel like we were an inconvenience. 
- food/drinks are not clearly described. On more than one occasion, a wine, dish, or cocktail ordered came out and didn't match our expectation of it in any way. 
- generally weird experience. 

We (four of us) shared several dishes and were willing/planning to order more. Had a number of issues and ended up leaving hungry. We went elsewhere to finish our dinner and enjoy dessert. 

On another note, upkeep of the restaurant is lacking. Lots of dust around our table and wall. I think that's a strong indication of the attention management is placing on the restaurant's success.

We definitely won't be back."}
{"text":"Stopped by on a slow Tuesday evening at Grit and Grace.
We had the small plate of Short ribs over cream cheese biscuits. It was one of the recommend items by the bartender and is was not the fall apart short ribs my girl makes. I was expecting much more. The small plate was good just not \"WOW, so I gave the 3 star rating. 
So I finish my red wine then left. I figured if I had one of the best items I could only go down hill from there."}
{"text":"It's difficult to remember a time where I disliked a meal so much I couldn't finish it or didn't think it was worth taking home for a second chance later.  Took my mother here after a theater performance and neither of us will be returning.   Had heard negative comments about this place when it was Grit & Grace but never bothered to try for myself. I had hoped with the rebranding it might have improved; not so."}
{"text":"Fun choices for food
Casual/formal environment, better food/environment for drinking than eating 
not typical dim sums which tasted average but looked amazing
Really good ribs on biscuit with cream cheese
Not spectacular food but very good drinks
Not recommended for kids but recommended for big groups or for couples
Excellent service!
Only dinner served
NEED to make reservations on weekends"}
{"text":"This place was very very good. The cocktails (too many ingredients, boat drinks) were absolutely delicious and the beer menu was acceptable. The food was also very good. The most memorable dishes were the pork belly dim sum, brussels sprout dim sum, the steamed bun, the wings. The pork face roulade, and the brisket sandwich were very good and larger than expected. The sunchoke salad, the beef tartare, the brisket were good but not the best. The brownie in the dessert was just ok but the sesame crispees were pretty delicious. 

The service was good, the ambiance was trendy. I would highly recommend for a group to share all their delicious little bites family style. It would be good for date night but you just don't get to try as much!"}
{"text":"This place is right up my alley,  from the atmosphere,  the fresh ingredients that are in every dish, to the selection of adult beverages.  

The pork belly bites are fantastic and the kimchi is perhaps the best I've had.
 If you have a chance to hit this joint, don't pass up the opportunity. Even if it's just for a glass of merlot, the setting is quite tranquil."}
{"text":"I'll give it a star for its ambiance and a star for the sweet waitress that waited on us, but overall my first experience here was poor.  The food was just ok. My friend and I shared the pork belly and salmon tartare appetizer and then we both had the short ribs flat noodles as an entree. I explained that I had a severe dairy allergy and was assured they would prepare it so that I wouldn't have any problems. Unfortunately there was a 'miscommunication' in the kitchen and after 3 bites I started having an allergic reaction. I asked the waitress to double check with the kitchen and she apologized profusely and told me it would be taken off my check. Really? I would expect so since I only had a few bites. The strange thing was that the manager never came over to apologize, nor did they offer to comp a glass of wine or one of our appetizers for almost sending me to the hospital. Not that it would make a difference, I wouldn't have trusted that it was prepared they way they said it was. 

It's unfortunate that my first experience here was so bizarre. I don't think I'll be going back any time soon."}
{"text":"This review probably isn't indicative of a 'full' experience here, since I stopped in on Christmas Eve and only tried a single dish. Overall the service was nothing bad, nothing great. My guest and I were seated quickly and picked a prime seat to overlook Liberty Avenue from. It was unseasonably warm, so the front store window was wide open. It definitely offers a beautiful view of Downtown. 

We both had the pork belly ramen, which costs about $14. I felt the price was reasonable given the quality of the ingredients, as well as the portion size. (I was definitely full from the single meal.) 

From what I could tell, they offer a 'dim sum cart' where you select whatever combo of pre-meal bites you'd like, probably to share with other diners. It's a fairly community-oriented setup, with small, communal-style tables, so I didn't feel like I got the full experience just going with one friend. 

The menu is limited but this is clearly because of the small plate emphasis and quality ingredients. Since I live in the North Hills, and am usually not willing to drive all the way to Oakland or Squirrel Hill to get decent ramen, Grit & Grace will probably be my new place to do so if I'm stopping by Downtown anyhow. Pretty satisfying all around!"}
{"text":"From the excellent service to the modern interior - this place is one of the most enjoyable spots in Pittsburgh. 

Bartenders put time and effort into making drinks for you. Check out the menu and wait for the dim sum tray to come around. We took a bit of each - the pork was excellent. 

Altogether the price isn't too bad considering you are paying for the atmosphere and it's in the heart of downtown. 

Definitely a good spot to check out for dinner dates, drinks, or quick bites."}
{"text":"While grit and grace is unique, to me the drinks are extremely overpriced and the food is tiny. I know that they are tapas style but the price is ridiculous. Of course the food is delicious but it is not a place for someone like me who enjoys lots of food. Might be fun after a show or for a late night snack and bar scene."}
{"text":"Ummmmm I have mixed feelings about this place. It's a nice trendy environment. However, the food was just okay for me. Small portions for a lot more than it's worth. Dim sum is a cool idea, although they should add more items to the menu. Their dessert options were too far out for me- deconstructed apple pie with cheez its on top. We passed and went around the corner to Butcher in the Rye for dessert (which was fabulous). Doubt I'll be retuning anytime soon (or ever)."}
{"text":"Do NOT come here for brunch. We were a large group of 8 so we called early in the week for a reservation. The only reservation was Sunday at 1:30. We thought this place must be the place to be  and it's so popular! We come here at 1:30 and there is NO one here. Why did they state this was the ONLY time available. We even double checked the day before that there wasn't any other reservations. We arrive and it was very disappointing from beginning to end. The Bloody Mary was TASTELESS, didn't even have a hint of any kind of flavor despite claiming to be kimchi flavored. It was sent back! The dim sum was $5 an item for ONE piece of bun or ONE biscuit. It was actually sad because the pork bites were flavorful and the biscuit was delicious it was just SUCH a small portion. Not even authentic dim sum portions are this small. When we were grossly disappointed we asked to order more and they told us the kitchen was closed. WHY would you make a brunch reservation at 1:30?! The wait staff didn't even warn us there was a last call. All the other brunch reviews share the same sentiment. I should have listened to my fellow Yelpers."}
{"text":"What a great experience!!!  This is somewhere that I will go back and recommend to others.  My best friend and I came here for dinner and our service was spot on.  We made an reservation and we were greeted promptly at the door, seated immediately and it got better from there.  Neither of us had been here before so we were not sure how everything worked and our sever was patient and took us through the menu.  Also, we were clearly not in a hurry and we were not rushed.  Very nice wine and drink selection and we both liked everything we had.  Try the dim sum - we had pork belly bites, beef tartare, and confit chicken wings and we loved every bite.  We also had the short ribs and duck confit small plates.  I had the poached halibut and it was perfect.  My friend had the roasted pork ramen, again, perfect.  And make sure to save room for coffee and dessert.  A great time.  I am sure this is not the place for everyone though.  The menu is smaller and they do not have the largest selection.  But the menu is online; check it out before you go.  Also, price does not scare me.  I have lived in a lot of places and I think people from Pittsburgh forget how affordable the city is.  I read a lot of reviews that it is overpriced. I am not afraid of a $20+ entrée.  I will be back, and I am excited to come back!"}
{"text":"I'm 50/50 on brunch here...so I only gave it three stars.  I had the crispy pork belly that they offer pre lunch. I like the idea of the 'dessert' like tray filled with small portions that you can choose for $5. You can see what it is, know the price, and eat immediately!  The pork belly is sweet and crispy, cut into small pieces, and topped with a delicious creamy sauce. 

I ordered the pork ramen with rice noodles as my main dish and I wasn't happy. I think that I don't like ramen. I want to like it! There isn't much I dont like honestly. The pork belly was sitting in the broth too long and it took from the flavor and softened the meat too much. The rice noodles were undercooked. I don't think you can do a rice noodle al dente, it just won't work! The noodles wouldn't twist. They kept breaking.

Talking to friends, I only hear good experiences! Don't -not- try this place! The friend with me had an eggplant sandwich and she loved it. Check out my pics!"}
{"text":"Wandered in on a thurs. Night with my husband and so glad we did!  They walk around with $5 dim sums you can choose right off the platter..so good. . We had the crispy pork belly, a tofu slad, and braised tongue.. also had the iceburg salad, meatball and chicken Rammen soup (fantastic) & my favorite which was the short ribs on biscuits with Hollandaise sauce. .so scrumptious!  
The atmosphere is really cool also. . Seems more like a restaurant that would be in New York. . The architecture is totally trendy.  We didn't have any alcohol that night but there were plenty of beers  and specialty drinks.. Can't wait to go again with some friends!"}
{"text":"Went to pittsburgh for something different.  This restaurant was about 4th choice.  All the other places we tried to eat were booked solid for the night.  It amazes me that ordinary bar style restaurants run on so purely on reservation alone in this town.  65% empty tables and they say they are booked.  I have never been in town with such nonsense.  So this leads is to grit and grace.  I had this bookmarked on yelp because of its proximity to the other restaurants.   Also the fact that it was rated 4.5 stars on yelp.  4.5 stars should have ensured an amazing meal.  I guess people don't ask for much in this city.  The bartender was nice and good with what she had to work with.  The food was mediocre at best.  They call it American dim sum, someone with a tray brings around small bites.  You are lucky to get her to stop at your area once an hour.  We went and had pizza right after this place, we were starving!    They also refill the liquor bottles behind the bar with half gallon bottles.. Makes you wonder where else they are cutting corners.  I have also eaten at many tapas places in other cities.  amazing tapas restaurants with very high end ingredients, and creativity that were way cheaper run by celebrity chefs.  The prices were very high for what you were ordering.  They also talked about all the fresh ingredients for drinks, all the pride in this category.  The liquor selection was a step above dive bar status.  They were using heaven hill bourbon for cocktails.  I do though think this place has an interesting concept that's a bit different, it's just executed poorly.  My final thoughts are that I wouldn't eat here again.  Nothing was memorable.. In Pittsburgh, don't rely on user reviews.. Pittsburgh is a food desert."}
{"text":"Breakdown of what we ordered followed by a subjective assessment of taste, texture and overall experience:

Our group ordered: 
Tasso Ham Flatbread
Pickled Dates
Roasted Carrots, Edamame Salad
Short Ribs with Cream Cheese Biscuits

Dim Sum:
Pork Belly
Salmon Seviche
Shrimp Seviche
Pig Face something or the other

Desserts:
Coffee and Cereal
Apple/Cheez-It Cracker Ice cream Concoction 

Out of all that we had, I would say my favorite dishes were the pickled dates and carrot salad off the menu and salmon seviche from the Dim Sum tray.  That being said here are a few comments about all the items we had:

Menu Items:
-Flatbread was ok, but I wasn't a fan of the slabs of ham laid on top of the cheese.  The cheese lacked that certain sharpness which I appreciate on my flatbreads/pizzas.  
-Pickled dates - explosion of flavors and textures, LOVED it!  Crunchy cheesiness  (essentially fried cheese cubes), with shredded cheese (manchego), coupled with tartness (pickled dates) and sweetness (pears and apples).  
-Roasted carrots, edamame salad - this salad was fresh and flavorful.  The vinaigrette was subtle as was the crumbled cheese curds.  The carrots were the stars of this show.
-Short ribs with cream cheese biscuits - no comment as I didn't try them but my friends enjoyed them.

Dim Sum:
-Pork belly - I noticed that many reviewers really enjoyed this dish, unfortunately I didn't.  I guess I was expecting melt in your mouth pork belly and it was cubed pork pieces that didn't have me swooning.
-Salmon Seviche - the salmon was fresh, tender and successfully flavored.  I added a bit of soy sauce which made the dish complete. 
-Shrimp Seviche - I had a bit of this and thought the shrimp was fresh but lacked in flavor.  I'm not a big fan of cold shrimp so take that for what you will.  
-Pig Face - all I know was this had something to do with a pig face.  It was a fried cube looking dish with what essentially tasted like some very salty ham in the middle.  Didn't do anything for me.

Desserts:
Coffee and Cereal - tasted like melted vanilla ice cream, sprinkled with fruity pebbles, with chocolate pieces (maybe coffee flavored) with fruit roll-up type pieces that had no taste.  I did enjoy the fruity pebbles and melted vanilla ice cream - it was nostalgia in a bowl (at least part of it).
Apple/Cheez-It Cracker Ice cream Concoction - a bit odd, more savory then sweet but the apples sweetened it up but the cheez-it crumbles and ice cream overpowered this dish.  

Service was great, they were attentive without being bothersome.  Love the trendy, deep color decor.  I'm on a no-alcohol kick for a few weeks but the drinks looked amazing and from what my friends said they were.  I'll be back to check out the drinks and order me some pickled dates, carrot salad and salmon!"}
{"text":"The pork ramen soup was terrible. The broth was essentially soy sauce and huge pieces of what looked like fatback instead of pork. Super salty, uninspired and certainly not worth the price. Additionally, their ginger beer tastes like lemonade. 


I'll be looking elsewhere for my ramen fix! 

Only good thing was the service. Pleasant servers."}
{"text":"I absolutely loved this restaurant and can't wait to come back. The American style dim-sum is an awesome and fun way to eat and the food is excellent! Get the scorpion drink to share, you won't be disappointed. 

Some of the staff were a pretty snobby though. Big buzz kill (and I am coming from NYC, so wtf...). Hope that attitude dies out soon."}
{"text":"I see that it's now closed, but G&G was a shining bright spots in my visit to PIT last September. I stumbled in here on my way to watch my Cubs get nailed by the Pirates that night, but at least I arrived with a belly full of pork belly ramen. Brilliantly salty and hearty broth, balanced by crunchy carrots, cabbage, and caring. The bartender helped me select a locally brewed goze beer to pair with the bowl, and even let me sample a variety of Suntory whiskey they carried. I hope the staff have found other homes within the ownership group, and that the foodservice gods will smile upon them somewhere else!"}
{"text":"Had the confit wings and they were amazing!! The smoke and mirrors cocktail was strong and deliciously different. This place is awesome!"}
{"text":"This was my second time at Grit and Grace. I originally went for brunch which was very typical American style breakfast. 

My second time I stopped by after seeing the Pittsburgh Symphony Orchestra. The four of us orders a scorpion bowl to drink which was tasty but not enough to split between four people. I ordered the shaved flank steak with thick noodles. When the food was brought out they only brought the meals of the other three members of my party. This typically doesn't bother me except my food did not arrive until almost five more minutes. 

The meal itself was devoid of flavor and the broth tasted like instant ramen noodles. The overall plate did not fill me up and left me wanting more. The rest of my party enjoyed there meals but my experience was not as great."}
{"text":"I stopped by here this past Saturday night with my fiancé and another couple for dinner.  We had made reservations for 7:30 and arrived 5 minutes before then and were happily told that our table was ready for us.  This was a surprise because the place was absolutely packed, we even had a hard time avoiding people to get to our table.  The décor in here is actually pretty cool as the table tops are a copper color and everything screams chic.  While my fiancé and I waited for the other couple in our party to arrive we decided to get some drinks since we had seen people on Yelp rave about them.  I ended up choosing the G&G Club Cocktail which consisted of bourbon, amaro, crème de cassis and orange bitters while my fiancé went with the Mai Thai.  My drink was served in a brandy sniffer type vessel with an orange peel floating in it while my fiancés was served in a tiki like wooden cup that had a face on the front.  I was actually a little disappointed in the amount that was in my glass for $10 but went with it anyways.  It was decent but I had a hard time discerning any bourbon flavor at all from it which is the main reason that I went with the drink in the first place.   I am guessing that the crème de cassis just overpowered everything else.

Whenever the other couple arrived the waitress told us that she would go over the menu with us but didn't really say too much about it other than what was already printed.  She did mention that they also had some dim sum and that it would circulate around.  On one side of the menu is a section entitled salads, sandwiches, noodles, etc. and the other side is entitled for sharing, small and large.  The salads, sandwiches, noodles, etc. section made sense in the fact that you knew you were getting one of those but you had to discern what it was you were getting from the ingredients on it.  Call me old fashioned but it's easier for me if you just tell me.  Then the other side I was confused on how much food we were actually going to get from it.  The prices ranged from $6 to $20 and I am guessing from appetizer sized portions to entrée sized?  In the end I decided to go with the smoked brisket sandwich as well as a crispy tofu dish while my fiancé went with the beef short ribs noodle dish.  The couple across from us went with the sandwich and noodles dish as well and those happened to be the 4 dishes that arrived first.  My smoked brisket arrived on a baguette with kohlrabi kraut, sabayon, pickled red onions, corned beef tongue  and horseradish cream with some thousand dressing on the side.  The sandwich was pretty good albeit a bit messy as I almost had some oil drip off the sandwich and onto my sweater with my first bite.  After that I made sure to keep the sandwich over the plate.  The brisket and beef tongue on it were both tender and tasty and that went well against the crunchy baguette.  I can't really say that I noticed the pickled onions on it although the kraut was decent and then I was not sure that I could tell the sabayon or horseradish on it probably due to the mixing/dripping.  After all 4 of us had finished our first courses the crispy tofu came out and consisted of the tofu with daikon, bok choy, mushrooms and a foam that was supposed to be hot & sour mushroom essence.  I found this dish to be ok but much more exciting in the description.  The tofu was not crispy as described and ended up being more of a soft silken texture than anything else.  At least the vegetables were cooked nicely and while I have had some good foams before, I was a little confused by its use here.  After my fiancé and I finished that our waitress came around and asked us if there was anything else we wanted.  We responded that we still had not seen any of the dim sum and then amongst ourselves commented on how we had been sitting there for 55 minutes without it.  Within 10 minutes of our comment the dim sum guy was once again walking around with some food and would stop by our table twice in the next 20 minutes.  On that first stop I ended up grabbing the pork belly bites while the fiancé went with the squid salad.  I have to admit that I really like the idea of American Dim sum, I only wish it had been available a bit earlier.  The pork belly bites ended up being my favorite part of the meal as the pork belly was cubed and had some orange, chili, garlic and ginger with them.  My fiancé also really enjoyed her squid salad of which I took a bite and loved the kimchi flavoring in it.

The bottom line for me is that I probably will not be back here again in the future.  Am I glad that I came?  I sure am as I think the idea of the place is cool, especially the American dim sum, and love that they are located downtown.  The service was also pretty good in that our water glassed got filled up fairly quickly through most of the evening and our server was around when needed.  However I ended up leaving the restaurant $80 lighter in the pocket and still hungry and unsatisfied."}
{"text":"Dim Sum was pretty good. Very interesting/unique. The atmosphere was very nice, and wait staff friendly, quick, and helpful."}
{"text":"I've only been a few times but it has always been enjoyable.   The staff is always friendly and fairly quick and the few times I've sat at the bar I've always had a bartender with the right attitude for the atmosphere. 

Awesome place for a nightcap after dinner to keep the date going."}
{"text":"Came here with the family for post graduation dinner. As an Asian family, we're not the type to do Asian fusion as we don't like to mess with classics. We had two of their dim sum dishes, the tuna tartare and pork belly. Both were good and had a nice twist on the classic. We ate the dinner family style and shared the Chow Fun, 5 Spice Pork Ramen, and Szcheuwan Chicken. All were delicious and were done well. However, the 5 Spice Ramen was not an easy dish to eat family style, especially since they gave us plates instead of bowls. Any Asian knows noodles are much easier to eat in a bowl, especially ramen. 
We also shared their Painkiller cocktail which was a nice way to alleviate the fun from the graduation weekend."}
{"text":"The hubby and I met four friends at Grit & Grace for dinner before Jim Gaffigan's show in late March. I had selected the restaurant and made the reservations, and I therefore felt a lot of pressure for everyone to have great food and a great time. Good news is that we all had a great experience here!

I arrived about 15 minutes before our reservation and was a little nervous when the hostess cautioned that the party before us had arrived an hour late. However, she did an amazing job of seating us only 5-10 minutes late and even having a backup plan in case the previous party did not promptly leave.

I started with the Mai Tai while we waited for our table. I'm generally pretty disappointed in mixed drinks that I order out.... However, this drink was pretty tasty and came in a really cool glass. My second drink was Arsenal's Fighting Elleck Cider followed by the table doing Wigle Whiskey Ginever shots. Both drinks are delicious, and I love supporting local businesses.

Let's get to the food! My husband and I wanted to try a variety of things, and we definitely achieved our goal. First, we got the Pork Belly Bites off the dim sum menu. Though descent, we had recently eaten a similar dish at Butcher and the Rye, and this dish did not come close to that restaurant's incredible creation. I felt similarly about the Dayboat Scallops. Though it was a nice dish, it seemed overpriced for the very small portion of food received.

However, the dishes that I expected the least from delivered the most! The small plate of Short Ribs with Cream Cheese Biscuits was my first surprise.This dish was like eating bites of home-cooked heaven. I'm not one to order sandwiches at restaurants other than Panera, but my husband wanted to try the Crispy Pig Face Roulade. Though the crispy pig face portion of the dish was disappointing, this sandwich packs incredible flavor.

Outside of drinks and food, service was descent, and the interior is very well decorated. I look forward to returning, ordering my two favorite dishes again, and trying some new items!"}
{"text":"A large amount of gluten free options!!!!

In all honesty we tried to go to Butcher In The Rye but they were full. I was told we would need to book a reservation two and a half weeks in advance. No thanks. We then remembered that Grit & Grace should be opening anytime so we went to check it out. Turns out they had, indeed, opened. I asked if they had any seats open. Turns out they have tables designated just for walk ins. I asked before being seated whether they had gluten free items. They said many things were gluten free or could be made to be gluten free. The lady at the door added that they took allergies very seriously. 

Food:

Dim Sum: we ordered Steak Tartare, chips + dip, and scallop seviche. All were amazing. Chips plus dip was the best. 

Dinner:  he got beef short ribs. The sauce was mild. Not bland, not overpowering. Just right. I got the goat. So buttery. So flavorful. Please get this. You will love it. It has a very mild kick. If you dislike spicy foods I do not think this will bother you."}
{"text":"I recommend this as priority! What an experience! Staff is great, ambiance is great, and the food.... From the dim sum to dessert, everything was excellent! The menu is designed to order share-able plates, which is wonderful so you can try many things. My boyfriend and I ordered Pork belly bites and corned beef tongue from dim sum, then the braised goat, hanger steak noodles and short ribs on a biscuit and for dessert, their take on \"DIRT\", the boyfriend doesn't typically like dessert or sweets but he helped me clean that dish!!! With every bite we lite up! My boyfriend keeps repeating \"I love that dinner\" \" That dinner was great\" \"That was such a great time\"!! As a chef, I love going out to all these great restaurants in Pittsburgh and appreciating their charm, and this is one of the best."}
{"text":"I went to Grit & Grace just wanting a cocktail. But the moment I saw the waitress walking around with plates of dim sum, I completely changed my mind. A group of friends and I shared a few of the dim sum plates and for $5 a piece, it was well worth it. We had some cold soba and pork belly with a chipotle cream. Both delicious. My favorite was the steak tartare though. Everything was exceptional and I can't wait to go back."}
{"text":"Some friends made reservations for us after the opera and and based on the description of \"American-style Dim Sum\" I was pretty excited. But I thought it was \"Grits and Grace\", so I was imagining Asian-Southern dim sum: carts coming around with spicy chitterlings, country-fried chicken feet, and kim chee style collard greens.  Some fried-salted szechuan crawfish, and of course cheesy grits with bacon and jalapenos.  Maybe even a small fried peach pie, or a plate of pecan tassies to polish things off

It is not \"Grits and Grace\", it's \"Grit and Grace\".  Obviously my disappointment at that is my problem. But honestly, the praise this spot gets is mystifying to me: the dim sum aspect of the meal was perfunctory, the service was poor, the food was expensive, and the quality of the food ranged from from inedible to good-enough.

First, the \"dim sum\".  I love dim sum.  At my favorite spot for dim sum, Hei La Moon in Boston, you sit at a table while cart after cart of delicious delicacies comes by.  Nearly all the the little steam baskets have at least 2-5 individualized servings, or plenty to share.  You and a few friends stuff yourself with a half-dozen to a dozen uniquely tasty things, while drinking tea, the servers stamp your card, and when you're stuffed beyond reason, and you get the check everyone marvels at how inexpensive it was.

Grit and Grace has a card with 5 options on it.  A server came by with a tray exactly once over the 1.5 hours we were there.  It had 3 of the 5 options listed on the card, and we took one of each. The beef tartare was fine.  Fried capers? Why not! The roasted eggplant was adequate. The pork belly bites were spicy and greasy.  Yes, I know it's pork belly, but I expected \"melt in your mouth\", not \"coat your mouth with spicy fat\".  The meat that was on the belly was chewy in an unappetizing way.  None of the portions were really shareable, except the pork belly, and that's mostly because no one really wanted to eat it.

We also ordered several things from the main menu.  Everything on the menu sounded delicious and tasted disappointing.  Hunger is the best sauce, and I brought it, but the main sauce Grit and Grace believes in is chili and salt based.  There were also some inexplicable bitter things.  The smoked brisket was extra-fatty.  The seafood sausage, for $16, was slightly less than half of a sausage cut into 4 bite-size pieces. It was actually pretty good (not special, but good flavor); however, the portion was miniscule for the cost.  Seriously: $16 for half-a-sausage.  If it were $5 and on the dim sum menu I'd say it were great, but as an entree, that's ridiculous.  

We also ordered the braised daikon, crispy tofu and stuff.  The plate that came out was beautiful, with artfully arranged daikon, baby bok choi, and \"essences\".  The essences took the form of foam, and had two natures: spicy and flavorless.  Most importantly, there was no tofu.  They brought it out 5 minutes later and mumbled an apology.  There were four wafer-thin triangles.  I'd guess about two ounce of tofu, on a main course, for $17. We also got a tiny bowl of kim chee for about $8.  Tiny.

Our reservation was at 10:30, and by 11:30 we were the only people there.  Despite that we barely saw our server.  Fortunately (please add sarcastic emphasis), everything came out at different times, so I was able to order a couple cocktails. \"This One Could Use a Few More Ingredients\" was pretty good.  Were never even offered desert (really, no desert?), and they brought us our check at 11:45.  When we got out, around midnight on a Friday night, the streets were empty and though we were still hungry, there was no place in sight to get more food.  I think I saw a couple tumbleweeds blow by.

We went home and heated up one of those ham and emmental cheese tartes from Trader Joes. It costs $4.49 and was better than anything we ate at Grit & Grace.  

But I still like the idea of a Asian-Southern-America Dim Sum place: someone please get on that."}
{"text":"Last night we tried Grit and Grace for the first time.  The dim sum was unbelievably delicious, we had the pork belly bites in the steak tartare. The pork belly bites were buttery and melted in your mouth. The steak tartare was surprisingly very tasty and complex. I was surprised having never had a raw steak before.  
We also had the confit chicken and hanger steak both very rustic, filling and perfectly prepared. 
As far as cocktails go we both enjoyed a in house made dark and stormy. The Ginger beer was made in the restaurant and was frothy. I would venture to say the best we have ever had. 

The only complaint was last night it was 27° and the heat was not working in the restaurant. We ate our entire meal with their coats on. We felt that they should have just closed down and repaired the heat before they took reservations. Due to the heating issue the dim sum was not served warm and the copper topped tables were freezing.  

We will return again but will not stay if the heat is not working."}
{"text":"There were four of us who came here on a Sunday around 12pm for brunch. Our lovely waitress mentioned they're fairly new to the brunch scene so I was just going to roll with it. When I walked in, I kind of imagined it differently in my head and the name of the place didn't match up to what it looked like or what kind of food they served. Of course we all have different imaginations so what I thought it was going to be didn't mean it wasn't great on its own.

The decor was really cool, dim, and trendy. It was a more compact place with a small bar up front with a few booths on the right and two long high tables on the left. Towards the back there was some seating and they also had what looked like secret pathways to the sides and downstairs to the back. I felt like I was going on an adventure when I wanted to find the bathroom. Four of us sat at one of the long, high tables, which I found to be a good height with great lighting. Our waitress approached us quickly and explained the menu/poured water.

I wasn't going to get an adult beverage, but I saw the cereal milk punch that has bourbon, brandy, brown sugar, cinnamon toast crunch milk, blackstrap cream, and nutmeg. I don't even eat cereal and I thought this was such a cool idea. I had to have it! I was really pleased with the serving and the overall taste of it. It came in a smaller glass and smelled like apple pie. When I tasted it, it wasn't overpowering and it did remind me of cinnamon toast crunch. Yum! One of my favorite things was their bread platter. A nice young man walked over with four different kinds of goodies with homemade butter and jam. We could pick four for $3. I decided on one of each and I am so glad I did. The pumpkin bread, the chive something or other biscuit, and the other two items were amazing. I added butter and jam with delight.

For the main dish I got the stuffed crepe with braised goat, roasted potatoes, pepper relish, scrambled eggs, and a simple salad that came with it. Man, what a combination of flavors! Even though the salad was simple, it still had great flavor. The crepe with goat was my favorite. Incredibly satisfying with all kinds of tastebud approved experiences in there. I'm happy we came here. The food was a new experience for me and the cocktail I had is probably my new favorite on this planet. I'd like to come out for dinner at some point to really get a feel for their take on food."}
{"text":"Great food, great drink, and cozy atmosphere! We ordered short ribs biscuit, pork belly dim sum, and hanger steak. All are awesome!!!"}
{"text":"Lacking the wow.  First of all, We were seated in the back by the open kitchen door to have full visual and audio access of the  hectic coming and goings of the wait staff, mound of dishes and wash rags.  Not the best start for a place that is supposed to have ambiance.
Dim Sum was a fusion of kitchen pantry staples and an attempt of Dim Sum.  The taste left me wanting to go home and brush my teeth and leaving the establishment was necessary.
I will give a fist bump for the ginger beer."}
{"text":"I ordered the veggie ramen (off the menu but vegetarian friendly) and boyfriend got the steak flat rice noodle dish. Food was mediocre. Presentation was great! The dishes were aesthetically pleasing. However, the rice noodles were doused in an extremely salty sauce. Boyfriend said the texture of the meat was great but the entire dish just tasted like soy sauce. The noodles were hard and tasted old. My ramen noodles were chewy and had great texture. However, it came in this strange sour soup (I have never ever had ramen that tastes like this and I'm from California where they have amazing ramen). The tofu was crispy but breaded in this strange mochi like chewy covering. The entree was also extremely oily and left a weird aftertaste. I have never had a ramen that tasted insanely salty, sour and oily at the same time. I probably wouldn't come here again even though the decor here is fantastic! We did not try the dimsum or any of the drinks. This place is overpriced and the entrees here aren't very good."}
{"text":"Great atmosphere, good service. Crisp tempura, eggplant on focaccia. Highly recommend for a culinary adventure."}
{"text":"This place is now my favorite restaurant in Pittsburgh. 

The service was great, the presentation of the food was phenomenal, and the food itself was creative and ughp39orielk amazing...

If I could eat here for the rest of my life I'd be happy.  We wanted to get a little bit of everything, we got the smoked tofu & soba noodle salad (dim sum - but I wish I had more) the sunchoke salad (I didn't even know sunchokes were this good) and the Arctic char (chickpea fritters that accompanied it were spectacular)"}
{"text":"This gets my \"it's no less than a 4\" review ... not sure it's a five ... but I bumped it up when I thought ... well ... have I ever had BETTER ramen? Have I ever had a BETTER steamed bun? Nope.  Sure haven't.

The mortadella steamed bun was one of the best dishes I had in the last five years.  A++ ... will buy again from this seller."}
{"text":"I have written pretty extensive reviews of G&G in the past so I'll do my best to keep this short and sweet. My boyfriend and I had 8pm reservations and we were seated at one of the long tables right away. Our server, as always, was efficient and friendly. My boyfriend, being here to visit for the weekend, had never been to G&G so I made some suggestions based on what I had in the past, however, the only thing we ordered that I had sampled before were the short ribs on the biscuits, which I said was not an option to NOT order (haha). They were amazingly delicious as always! Off the regular menu we also ordered the chicken meatball ramen ( one hour egg, confit chicken thigh, housemade kimchi, schmaltz roasted carrots). They brought out two bowls and two spoons so we could share the dish. I was pretty impressed with the ramen! The broth was flavorful and not overly salty, the chicken meatballs were flavorful, and the chicken thigh was practically melt-in-your-mouth. The size of the portion made it perfect to share since we also were partaking in the dim sum options. When the dim sum server came around  we opted for the beef heart empanada with salsa verde. The portion size was only one, however, it was quite large and filled to the brim with beef heart and potatoes. Personally, I thought the portion size was perfect for sharing. We wanted to try the chicken wings as well, however, there were none available at the time. The server had the kitchen make a portion for us and we are so glad we chose to try them! There are 3 large wings in the portion which is served with buttermilk ranch (the best ranch sauce I have ever had hands down!) and serrano chille peppers (which I gladly let my bf eat since they are far too spicy for me) so we each took a wing and then sort of shared the last one. The wings, we were told, were fried in duck fat. The skin was so crisp and delicious-the best wings I have had in quite some time! I was very tempted to order another portion but was pretty full at that point. Drinks here are still top notch as always-I ordered the Postmark Pgh which had White rum, Maggie's Farm spiced rum, wiggle lavender, and some other ingredients I can't recall but it was very good! I did notice they changed the drink menu since this drink I ordered is not featured on their online menu and the Mai tai, which I typically ordered, was no longer on the menu. My boyfriend ordered a drink with chille infused tequilla and WOW what a spicy kick it had, but he enjoyed it very much! G&G is one of my favorite places to dine in Pittsburgh, excellent food and drinks, and I find it is typically never crowded, so if you have not already visited G&G, I recommend paying a visit soon!"}
{"text":"Some of the best food I've had in Pittsburgh. I love the dim sum, both for the experience and the taste. Pork belly bites, brussel  sprout kimchi, meatballs, and steak tartare all great. The short rib cheddar biscuit is amazing. I may order two next time. Scallops were fantastic as well."}
{"text":"Grit and Grace is excellent. Modern dim sum in Pittsburgh is a risky bet, but they're executing it perfectly. They have some offerings in addition to the dim sum, also small plates.  Great place for a date. My girlfriend and I went here once dressed as a cowboy and cowgirl - we are good eaters who were just having fun, and they were cool with it."}
{"text":"My fiancé & I were in town for a concert & we decided to grab a bite to eat here before the show. The food was incredible! The braised short ribs over biscuits were amazing, as was the pork ramen, the dim sum, & the steam bun with house made mortadella!"}
{"text":"First time eating here yesterday.  The food was delicious.  The pork belly as general tso cauliflower was delicious.  We also had the chicken meatball ramen and the flank steak.  The food was really good and the atmosphere was very chic.  For desert I finished off the night with a butternut squash cheesecake.  We had a great night and enjoyed our meal very much"}
{"text":"I went here recently to celebrate the birthdays of 3 of my friends.  We were really excited to try this place and a reservations had been booked over a month in advance, since we were a relatively large group (12), but we were assured this would not be an issue and that they could accommodate a group of up to 15.  

Some of our party arrived early and everyone had arrived by the time of our reservation at 7pm.  However, when we got there, our table was clearly not ready yet, though the staff were evasive about this.  They pointed vaguely to this seating area just past the bar that consisted of a couple of sets of large shared bench tables and there were 3 DIFFERENT PARTIES sitting there who didn't look anywhere near done!  I was perplexed when they said \"just a few minutes.\"  Well not surprisingly it was over 45 min before our table was ready.  And unfortunately given that the chairs and tables in this area were bolted to the ground there was no way to sit all together, so half the group was sitting at the second bench table like 3 feet away!  Really, we booked this reservation over a month in advance?! Most nice restaurants won't seat any parties for 1-2 hours before in an area where they are expecting a large group with advance reservations, to ensure they won't keep the group waiting (and given that there were a few sporadic small tables available in the restaurant it makes no sense they wouldn't put these 3 different couples there, as they could fit in small tables).  I saw a back dining room area that looked like it would've worked much better and been much more comfortable for our large group and there were several smaller tables free.  I'm sure they could've accommodated us in that room had they planned ahead to have a few small tables together back there to push together.  But it was too late to ask for this since the available tables back there weren't together so we would've had to wait even longer.  There was no other large group back there so it would've been easy to sort out had they made an effort to really accommodate us and planned adequately for a large party in advance.  While we were waiting for a table, it was nice that the bartender did come from behind the bar and walk out to where we were standing by the wall to take our drink orders and bring our drinks over.  The cocktails were very high quality.  The decor was also very nice with some interesting pieces of art and a cozy ambiance.  

Once we got seated, things continued to be rather chaotic.  Given that we were all squeezed into a table that was a little too small and there were no seat backs to the \"benches\" we were sitting on we had nowhere to put our coats, but we were informed that this restaurant has no coat room! How can a nice restaurant in PA in middle of Winter have no coatroom or coat rack, especially if they have seating without any chair backs!  There wasn't even room to put our purses.  But they did nicely offer to put our coats in their office for us when it was clear this was not going to work.  So then I thought things would finally settle down but they did not take all our orders or explain the specials or dim sum options to our party all at once.  One person kept getting passed over for his drink order and wasn't able to get a drink until about a half hour after we were seated amidst all the chaos.  Also it was so loud in there I couldn't hear when they were explaining at the end of the table.  I wasn't even sure who our server was, as he/she never clearly introduce him/herself.  We ended up all ordering and getting our food and drinks at random unorganized times, though it worked out ok given the tapas/dim sum style and that we were sharing food.  

The majority of the food items were quite delicious, which is where the 3 stars come from.  I particularly liked the pork belly bites and the beef tartare from the dim sum tray they bring around.  I also ordered some other tapas/small plates from the menu, and particularly enjoyed the short ribs cream cheese biscuits.  A few friends ordered entrees, but my sense was that the smaller plates and dim sum were all much better than the larger entrees.  Would've liked to see some more dim sum options as there were only about 5 to pick from, though that was a really fun option.  Portions were decently sized for entrees and tapas/small plates but the dim sum were quite small (just a few bites, for $5 each).  I think this place might be great to go as a couple or a small group, but they need to do some work to accommodate larger groups adequately.  Most importantly, the food was quite delicious, as were the cocktails, so I think this place does have potential."}
{"text":"Easily one of the best trendy meals I've ever had. I'm usually not a fan of the small plates concept, but it works for this place. We had reservations at 5, arrived 10 mins early to an empty restaurant and we're seated promptly. 

Our server, Sena, was spectacular. Now that I think about it, most of the staff was pretty spot on. They were all friendly without being fake or entirely too upbeat. Sena hooked us up with some fantastic recommendations and we regret nothing. 

The American dim sum was a treat, with the pig belly and shrimp salad being my favorites. The short rib cheddar biscuits are the stuff dreams are made of, and the Mai Tai's we ordered were stiff. I didn't mind because for $10/cocktail I expect my drink to have a kick. 

For our main dishes we had the Tasso ham flatbread (which I think was one of the better values, size wise) and the pig face sandwich. I 100 forgot that it was the face of the pig (let's blame it on that Mai Tai) and cringed slightly as I bit into it, expecting a crunch. To my surprise it was smokey and tender and tasted like very high quality stuff. 

Each table is adorned with house made condiments and I thoroughly enjoyed the relish and the soy sauce. The chili sauce didn't have the kick I was expecting, so it was a bit forgettable. 

We ended the meal on a weird note, with the restaurants take on Apple pie with cheese. The dish was apple pie filling, Cheezit ice cream, a bit of pie crust and a Cheezit crumble. My friend and I both took a bite and was expecting a sweet ice cream, but to our surprise it was smokey and more on the savory side. Once we got past that, it was smooth sailing and absolutely delicious. 

By the time we left (around 6:15) the place was almost packed. This is certainly a very memorable meal and I can't wait to be back!"}
{"text":"So when I walked out of the door of Grit & Grace I didn't think it was a five star experience. You may be wondering why my review has 5 stars then...

The fact is that in my rumination over the past two weeks, I couldn't help but reflect on the solid and delicious menu that was superbly well crafted and executed. The ambiance of the restaurant was nice - your typical relatively high end PGH downtown feel. However, the food was just SO well made. 

I had some of the best Kimchi of my life here which I did not expect. (I say \"of my life\" but I don't really remember the taste of the kimchi I ate as a toddler when we lived in Japan and my dad would bring home jars of the stuff from Korea.) 

I had the hanger steak chow fun and it was absolutely delicious! It had a light sauce that was full of flavor. The steak was thinly sliced and very tender. We also had some of the \"dim sum\" which was NOT dumplings but just table delivered appetizers. 

All in all, I felt like it was a wonderful experience and great for both dates and nights out with friends."}
{"text":"I just don't know where to begin...there's SO much wonderment to be found in every nook and cranny. Let's start at the bar. Duh. 

Tiki drinks in an Asian fusion sorta kinda restaurant? Well, why not? Damned fine tiki drinks and OTHER drinks, too. My very first dabble into the G&G tiki selection was a lovely little, innocent tasting number called Jambie the Genie. Apparently inspired by Jambie in the TV screen at Pee Wee's Playhouse, what seemed mildly entertaining at first packed an evil punch of Metaxa, shochu, St. Germaine and Benedictine along with just enough guava to magically convince one there was barely any alcohol onboard. Wrong. Woo! 

Over the course of several visits (I keep going back!), I've sampled most of the written cocktail menu. (Sharing with non-germophobic friends is a great way to get to try everything without overindulging...just sayin'.) I can honestly say you can't go wrong...especially when Greta is behind the bar. Awesome barkeep! And for sure she's not the only skills behind the bar. I haven't yet tried the drinks made for a group. The Scorpion Bowl and the Porron are cocktails made to be shared when you're getting your party on with friends. (So WHY haven't we tried either of these yet?)

Back to my habit of sampling. The Dim Sum trays that circulate the room with little dishes of delightfulness-es are another thing that bring me back again and again. Especially the Pork Belly Bites...please Mr. G&G, don't ever take these off your menu! For $5 a plate/dish you can choose as many or as few dim sum items as you wish to accompany your cocktail or as a pre(or post)-appetizer. In addition to the required pork belly, try steak or squid or scallop or chips. Chips? Not your usual chips, these are crisp-fried chicken skin pieces with a chicken liver mousse dip. Mmmmmm....

And then there are the main dishes. I wish I could give you more detail here, but I keep going back to the braised short rib,broccolini,  cippolini onion, mushroom and rice noodle bowl that I can't get enough of! Bonus is that it's gluten-free - YES - G&G has GF options! Just ask. Fortunately I've also sampled a number of other dishes (thank you, friends) and haven't found anything that wasn't spot on scrumptiousness. 

Desserts? No clue. Good drinks, dim sum and an entree have always been enough for me...but they sound as fab as the rest of the menu. Then again, that gluten issue precludes many dessert choices anyway.

Any downside? It's hard to get into. I go early...and obviously often."}
{"text":"Everything is just absurdly good! I cannot accurately put in to words how utterly delicious Grit & Grace is.  Without a doubt my favourite dish was the short rib biscuit. Heavenly!! The cream cheese biscuit is It is topped firstly with melted aged white cheddar, followed by the tender succulent short rib which is delicately topped off with a creamy hollandaise sauce. Perfection. 

It was also Negroni Week, which meant $1 from every Negroni cocktail purchased went towards Rainbow Kitchen Community Services. Excited to try one even before I even sat down, I start chatting to the hostess about them and she recommended one that wasn't on the menu. A Negroni variation composed of Campari, Vermouth and...Mezcal! It was a surprisingly smokey and a winning combination. In fact, I recommended to the the two ladies seated next to us. They ordered it too and were very pleased with the recommendation.

Everything was amazing --
Dim sum: steak tartare, \"sam\"chi, fried pig's ear (special of the night) and of course the pork belly bites. 
Menu items: short rib biscuit, braised goat's curry.
Cocktails: Boulevardier Negroni (Bourbon, Campari, Sweet Vermouth) and off-menu Negroni (Mezcal, Campari, Vermouth)

Get your behinds Downtown and into Grit & Grace. Your tastebuds will thank you!"}
{"text":"I went there with a friend because the menu looked unique and they had dim sum. My friend and I split the dim sum beef hearts and pork belly. Both were good. I ordered the chicken meatball ramen and she ordered the pork ramen. Once again awesome ideas but the food was just ok. The dessert of coconut ice cream with salted caramel was delicious. I really want to give 5 stars because the atomosphere, the menu ideas, the service was 5 stars. However everything but the dessert was just ok. I believe with a few tweaks the food could be great."}
{"text":"The service was great. My cocktail was really strong, but that's okay. I got the pork belly bites, which were delicious. They have a delicious glaze, but I'm pretty sure the creamy orange sauce is Sriracha mayo. I'm not complaining.
 Then I got the vegetable ramen, which has a miso mushroom broth (if memory serves), which was very rich and flavorful. The variety of exotic vegetables inside was really nice. The tofu was crispy, which is a nice touch. Also, instead of traditional ramen noodles, there were udon noodles, which are thicker. I really liked that.

Seating at tables is reservation only, which I thought to be strange but I was by myself and sat at the bar.

It also looked like their bar was stocked with some more rare liquors which is cool. It's a bit pricy, but I recommend it for a treat, because the taste and atmosphere definitely merits the price."}
{"text":"There was only one other table there during my visit and the wait staff acted completely oblivious that we were on an hour long lunch. We basically had to scramble to even pay the server before jogging back to work. The pork in my noodle bowl was extremely fatty and chewy. They put additional ingredients in my bowl that were not listed on the menu and I was unhappy with that. I might give it another try but I'd rather not loose my job by taking a 2 hour lunch."}
{"text":"We love, love, love this place.  This is our go to bar downtown.  Cocktails are more than worth it. My new absolute favorite was (2 week later update: no longer on the menu, changes so often!) a long combination of whiskey, rum, brut, amaretto, grapefruit, Cherry Heering, bitters, I don't even know what else.  It's called \"This One Could Use A Few More Ingredients\" .. Pretty cute.  The +1 always orders a drink that is typically almost completely liquor and actually enjoys it, so I can only assume it's made well.  They also have \"shared\" cocktails that come in some sort of bowl with crazy straws and will get you reeeeal loose.  Not recommended unless you're out with THOSE friends or trying to have that kind of night. Wine list is always good too!  Somehow every time we're here, we are able to get a spot at the bar.  They do take reservations for table service as well.

We even eat food here sometimes.  First of all, I don't want to warn you, but they will offer you dim sum on a little platter like a cigarette girl a few times.  I'm not a fan because of the mostly beef and pork offerings, but who knows. Could be great.  Mostly annoying. The idea is cute though.  I typically eat the chicken meatball ramen as I am a picky eater (who knew!) and have no complaints.  The meatballs are seasoned and somehow are incredible in the huge bowl of noodle soup. I love the chicken confit wings though. That's my go to sitting at the bar food.  They're made with buttermilk and coriander and sprinkles of happiness, probably.  They are so good I can't tell you what the +1 gets because my brain can only think/dream of the wings in front of me.

The absolute best thing about Grit & Grace is how laid back it is.  It could easily be stuffy or difficult, but it's relaxed.  It's cool.  The staff is funny and engaging.  We dine and drink often downtown, and there is a big spot at the top for this place."}
{"text":"Grit & Grace is a new addition to the downtown dining scene in the old space occupied by Taste of Dahntahn. What a transformation this space has seen! The entrance has floor to ceiling glass windows offering an unobstructed view of the city streets. The restaurant is comfortably albeit dimly lit with dark walls and copper-topped tables. There are two long communal tables at the front of the restaurant, with bar seating in the middle and booths in the back. The staff were very friendly and welcoming and, although the place was packed and all of the tables were booked, were able to seat us at one of the communal tables.

Now, the food. We weren't certain what to expect as we had not read any reviews about the restaurant. One unique offering is that they have staff who float from table to table with beautiful, tiny dishes of dim sum. Each dish is $5 and varies from pork belly in a General Tso-like sauce to delicate roasted beets. Each dim sum dish had a meat component, save for the beets, so vegetarians take note.

The meal-size dishes were not large but not so small either. The comment that my partner and I both made was, \"Wow! The flavor!\" The dishes we ordered had a wide variety of wonderful flavors and textures. I ordered roasted daikon which included some type of foam (isn't foam kind of passé by now?), tiny perfectly-cooked long-cut carrots,  mushrooms that were intensely briny yet not overpowering. They were like small, dark buttons of concentrated umami-saltiness. There were about three vegetarian offerings for the small and not-so-small plates.

If you are starving and head to Grit & Grace, be prepared to shell out big bucks. The dim sum are $5 each and the small to not-so-small plates range from $10 to $17. We had two dim sum, two plates, two cocktails (which were absolutely wonderful and unique in that hip artisanal cocktail kind of way) and our bill came to $63.50, including tip. We loved our experience but we went elsewhere afterward and got more to eat.

Grit & Grace is a hip new addition to the downtown area. We think our next visit will be better suited for pre-show or before a larger dinner and we'll stop by for a great drink and dim sum instead of a full meal."}
{"text":"Such an unassuming and dark entrance.  We didn't think it was open, but thankfully it was... started with the General Tsos cauliflower.  Perfect small plate with a tiny late bite to it!  Would order every time.  Then had the big eye Tina poke.  By mistake but so happy for the mistake.  A very fresh salad with a tang.  Ordered the shrimp tempura roll which was just ok, too much cream cheese.  My daughter ordered the roasted pork ramen noodle bowl which had uncooked carrots, mushroom, uncooked cabbage, in a port broth.  The egg was on top.  She'd give it an 8/10 and the pork was a little too fatty for her.  Quick service.   Friendly and helpful.  Would visit again fer sher!!"}
{"text":"Grit & Grace highlights the wonders of our Pittsburgh food scene: An affordable, creative upscale dining experience in the midst of a thrilling growth spurt, not without those irksome growing pains.

The food: 4.5 stars
The drinks: 3.5 stars
The atmosphere: 4 stars reduced to 3 for our bummer table
The service: 2.5 stars (see below)

This meal was stupendous. It was however weighed down a bit by the dim sum offerings, 2/5 of which looked awfully unimpressive, even for $5. What excited me were our dishes from the main dinner menu, miso-braised eggplant ($9) and grilled octopus with mussels ($12).

The eggplant arrived in a stunning crescent moon presentation, complete with a delectable sphere of housemade yogurt cheese and two small marinated tomatoes serving as planets. The combination of flavors and textures was dynamic and unexpected, and the eggplant itself was smooth and meaty, like seafood. The semolina crisp added necessary crunch while marinated cucumbers delighted me with their punchy brightness. This dish is a dream boat, and something I've never tasted before. ORDER IT.

The octopus, undisguised by unnecessary slicing, arrived as a whole tentacle in a scrumptious broth with mussels and perfectly-cooked potatoes. This octopus was well-marinated and massaged; my only complaint was that I was sharing and wanted more!

Our dim sum selections were the pork belly bites, beef tartar, and Brussels sprouts. I was impressed by the Brussels sprouts' ability to be flavorful, ultra crispy, and not greasy. The tartar was also a great combination of flavors and meatiness, and my favorite dim sum of the night by far, though not quite as delicious as Meat & Potatoes' tartartartar.

The atmosphere: Upon walking through the front door, the ambiance is warm, classy, and hip. Unfortunately, we were seated all the way in the back, completely removed from the spirit of the place and shoved up against a divider. I've never cared about my table in a restaurant until last night.  This table was just bunk and I kept bumping my gangly elbow into that dang divider.

The service: 2 stars. Again G&G compels me to do something very unusual and complain about the service. First thing's first, the woman (MOD?) who ran our eggplant to us is a star. She was sparkling and funny and we loved everything about her. Our server's performance starkly contrasted that of our eggplant angel.

My experience in the industry makes it very easy to attribute a less-than-stellar attitude to a stressful night and shake it off. Our cold, rushed service was made a little personal as we witnessed our server treat the neighboring table very differently than us. That made her unwelcoming attitude admittedly difficult to ignore. Whatever we did to irk you, dear waitress, we are sorry. Please try to be a little nicer next time.

Of course, the best way to fight unhappiness is by leaving a big 'ole tip and a smile, and that's what we did. :D

I give G&G four stars because our two menu dishes were just that lovely. Don't fill up on dim sum, as the main menu is where this place really shines."}
{"text":"Made a reservation for Grit & Grace on a Saturday night before going to a later show--we wanted to share some plates and enjoy some drinks, and heard that this place was worth checking out for doing just that.

The dim sum was poorly executed. When we sat down, we said we'd get a few drinks and probably some dim sum; the waiter let us know that the dim sum cart should be around shortly. The cart didn't come, and so we put in an order for one of each; a waitress then came out with a tray and asked us which ones we wanted. Everything tasted pretty good.

The food off the menu wasn't bad, but for a gourmet joint with higher prices and small bites, I expected a bit more. Most of the dishes we tried were combinations of a lot of flavors and ended up a bit messy. The dim sum acts moreso as an appetizer menu in addition to the selection on the actual menu, and so I'm mostly just left confused as to why the entire place isn't dim sum or why people don't just order off the menu. Given that it gets busy and it seems best to order through a waiter either way, I just ended up feeling anxious and then let down.

Apologies that this review is moreso about the service and atmosphere than the food; the food was what you'd expect from a nice restaurant downtown owned by a solid chef. It was tasty, albeit nothing memorable. I'd give Grit & Grace another chance and definitely wasn't disappointed. The giant drinks were boozy and the food put us in the right place to enjoy the show."}
{"text":"Love this spot for a nice adult meal.  Great selection of drinks and there dim sum is super fun.  The pork belly is fantastic.  The atmosphere is great and it's fun for lunch or dinner."}
{"text":"My wife and I decided to try Grit & Grace after watching a Cubs/Pirates game at PNC Park after seeing the wonderful reviews on yelp. We were definitely a fan.

What We Got (Copied from Menu):
 - lettuce wraps, duck confit, corned breast, fermented kohlrabi, peanuts, cilantro
 - short ribs, cream cheese biscuits, aged white cheddar cheese, bearnaise
 - roasted carrots, edamame, romaine hearts, fresh cheese curds, chili + honey vinaigrette
 - pork belly bites, orange, chili, garlic, ginger

How They Were:

Lettuce Wraps - Probably the most delicious thing we had. It had a nice combination of sweet and savory. The peanuts and cilantro added some nice mix of flavors.

Short Ribs - Decent and average, but didn't blow us away

Salad - Too spicy for our taste. Would not recommend.

Pork Belly - Delicious and great value. It's on the Dim Sum menu

Other Tips and Advice:
 - Order a few at first, but make sure to wait for the dim sum menu (they bring this out to you)
 - Come a bit earlier to avoid the crowd
 - Chilly inside"}
{"text":"Overall the food tastes good but can definitely improve. 
I really liked the idea of showing you a tray of appetizers to pick from. The smoked tofu noodles was tasty. 
I had the brisket sandwich for lunch. Taste was good but I think the kraut was a little too sour and also it was too greasy."}
{"text":"Of the things I tried (chicken wings with yogurt, pork belly bites, and spare ribs on buttermilk biscuit), the spare ribs were the thing I thought was really special.  It is a small plate for $8, but it was a great dish.  The chicken wings were fairly good for what they were, but the pork belly was below average if you are a pork belly regular.

The space was great, we sat at a large \"communal table\" in the front and watched people scurry by in the rain. No one else was at the big table, so no shortage of elbow space. Cozy ambiance, and great place to have a conversation."}
{"text":"I ordered the beef ramen and it is too salty for me. But the atmosphere and service is good."}
{"text":"We decided to try Grit & Grace to kick off our restaurant week.  I was excited about the concept of this restaurant - American dim sum.  There is definitely nothing else like this in the Pittsburgh area.  

Our server was great, he explained the process of ordering very well.  The dim sum appeared at our table, and we decided to try each one.  In addition, we ordered the steam bun (with house-made mortadella and pickles) and the brisket sandwich.  

Each of the various dim sum dishes were good - the pork belly bites being the stand out.  I'm not quite sure the flavors were worth $5 a pop.  However, our two orders off the menu were fantastic.  The mortadella was a nice thick slice, and the pickles added an extra kick.  The texture of the steamed bun was great too.  I'd order that again.  

After we consumed all the dim sum and mortadella sandwiches, we still weren't feeling satisfied.  So, we opted to order one more item - the brisket sandwich.  Our server raved over how amazing it was.  It definitely didn't disappoint.  I, personally, love Reuben sandwiches, which is what it really was.  My boyfriend thrown off a bit, expecting a slice of brisket with toppings, but after a taste he agreed it was great.  

The ambiance of this restaurant reminds me of something in NYC, which I really enjoyed.  I'd like to reiterate how wonderful the service was.  Overall, I think it's a little overpriced for the portion size, but I'll be back in the future.  It's a really cool, unique place to bring out of town guests."}
{"text":"Just OK in my opinion. I had the pork belly bites which I have had before at another restaurant and compared to he first place I tried them, these were really sub par. They were under cooked and tasted like I was eating just fat.

The kimchi salad was okay but again not as tangy as the real kimchi I've had at Korean restaurants. When we ordered our food it came out in a decent manor. I also ordered a Lemonade that the dolled up really nice with pomegranate juice and some homemade grenadine. it was very delicious. Back to the food, I ordered the crispy tofu dish. The tofu was perfectly cooked as was the book toy but everything tasted like different flavored salts. Almost like when you eat Ramen noodles with shrimp, chicken and beef flavor. I didn't taste any real seasoning though. No significant flavors just Salt.

My husbands dish was similar, he ordered the flank steak noodle dish but It was even saltier than mine was. I was very disappointed especially since they have such good reviews on YELP and the prices are in the moderate range.

I don't think I will visit this place again. I'd rather spend $15 on an entire athentic again spot in Oakland then to waste $75 on imitation or americanized Asian."}
{"text":"The short ribs and 
pork belly bites are fantastic!  Great atmosphere and good service!"}
{"text":"My friends and I decided to go here when we walked by on a whim. We looked up the menu before entering and was excited for the type of food served here. We started with the dim sum with the pork belly bites and pepperoni arancini. Both dim sum choices were delicious. For entrees, the crispy pig face roulade and seared hanger steak were selected. Although the pig face roulade was good, there was not much to the plate so it left me wanting more. The same feeling was with the seared hanger steak. It left us feeling more. The one redeeming factor were the drinks. I highly recommend Jambie the Genie and Scorpion. Not only were they a lovely combination of liquor but the cups they came in were awesome. The food was good but I would hesitate to go back because of the serving size to price ratio."}
{"text":"Maybe we went here on an off day (eventhough the place was relatively empty) but me and my foodie cohorts were not really impressed with the food that we were served during our visit here.

First let me say that the decor was impressive(Why that's important to me, I'll never know...)  A completely different take on the space from the previous Taste of Dahntahn and  much appreciated.

Okay, here are my thoughts on the food.... I was kind of disappointed with my food.  I am a beef brisket addict and so is one of my co-workers.  We both ordered the smoked brisket sandwich (I actually ordered the sandwich as a part of the G &G Power Lunch, along with the small carrot salad.) and my other co-worker ordered the the Roasted Pork Ramen. The beef brisket was not tender and actually chewy, with a greasy aftertaste that was not pleasant.  It was almost as though the beef had been made quite some time before we got there and sat in beef fat until the taste became less beefy and more stale tasting.  The carrot salad was really nothing to write home about either, however, it was attractive looking. (And I mean that in good way...)  I was very surprised at the lack of available side dishes too.

My co-worker who ordered the Roasted Pork Ramen made out like a fat rat!  The broth was delicious and the serving size was decent.  

Overall, it was okay.  The food was less impressive than I expected and the decor was better than I expected.  Additionally, the service was respectable and the wait staff knowledgeble.  All things considered, this adds up to an \"A-Ok\" rating versus a \"Meh, I've experienced better\""}
{"text":"DISCLAIMER: THIS IS NOT A \"DIM SUM\" restaurant by any means. I think the restaurant took the concept of Dim Sum/Tapas and thought they could get away with it.

This place was mixed bag for me. The good stuff was REALLY good, and the bad stuff was REALLY bad. Typically my reviews are broken down into Venue, Food/Drink, & Service. This time I've chosen to do what I found to be:

THE GOOD: 
- This restaurant screams \"swanky, downtown joint\" for a date or small get together with friends.  It's got a good vibe with good music and low buzz. It's small so don't expect too much noise.
- The CRISPY PIG FACE ROULADE. Delicious. It will feed one.
- The PORK BELLY BITES - incredibly savory and yummy.
- Service. Every server that came to our table was friendly and accomodating

THE BAD:
- The \"dim sum\" plates have 2-3 pieces on them. One of the dim sum plates we ordered was basically a table spoon of cole slaw (aka noodles). The dim sum portions are NOT worth the $5 you're paying.
- The BRAISED DAIKON, CRISPY TOFU, BABY BOK CHOI... dish. Imagine the size of one square of tofu cut into four pieces. That's how much tofu you get. Also if you're hungry, you will not be able to share this (contrary to what the menu describes as \"For Sharing, small, and large\").


Basically we paid an arm and leg to eat nothing. I felt like for the amount of food we got it was NOT WORTH THE PRICE! And what really grinds my gears is I've been to a handful of REAL dim sum and tapas restaurants and their plates (though small) are NOT microscopic and actually taste good. I tried to like this place, I did. But if you don't find that this place fills you up...or at all...there's a jimmy john's down the street."}
{"text":"Delicate decoration! Everyone has different plate for the same or different dishes! The service is great! Everything the waiter recommended is so delicious! Love it! Strongly recommend!"}
{"text":"I ventured here for Restaurant Week and it was most definitely a great choice. Their mojitos are heavenly but a little on the expensive side but you do get your bang for your buck. The waitress was very nice and I enjoyed how attentive their staff was. They tend to be proactive about things. This was my first experience with a Ramen restaurant and it was a great one. The veggie Ramen (minus the tofu. Tofu tastes like sadness ) but the broth blew me away. It amazed me how much flavor they packed into it. I also tried their dessert which left much to be desired. I wouldn't recommend sticky buns. They had a frosting that wasn't sweet enough for me. I just equate dessert with Sugar and I didn't get any in that department but I think that was only for Restaurant Week.  These guys are known for Ramen and they know their Ramen. I'll be back most definitely especially after checking out their happy hour menu."}
{"text":"I went to Grit & Grace for the Yelp after hours Snack Attack. Man! What a great time. Right when I walked it I got a seat and started talking to the fellow Yelpers that were there.

We had a snack menu of dim sum and two drink options. I of course was able to sample everything on the menu and I was really impressed. The only other time I was here we just ordered drinks. I will say that since this little snack attack I plan on coming back and trying their entrees. I was impressed by the presentation of the food and the drinks. The little extras that they threw in really made the event. 

Drinks:

I started with the mulled wine sling: red wine, vermuth, hum, cinnamon, topped with arsenal cider. The toppings to this drink were an orange peel and some dried roses. It was so pretty you almost didn't want to drink it. I of course did and loved it. I wanted a tub of it. The wine sling was subtle but satisfying. I really liked the extras and knew it was a drink that was mixed really well. It didn't taste too winey or had the after taste of alcohol. It was a really good drink.

The second drink was the pina colada: old port rum, nero infinito sambuca, coconut, pineapple. This was a little strong for me. I liked the more subtle taste of the wine sling. The presentation was beautiful. It had a little anise star on top and was just a beautiful drink. But the sambuca was too much for me to handle. I liked it, but not enough to order it again. If someone likes strong drinks then this one is for you!

American Dim Sum:

The idea of \"small bites\" always makes me raise an eyebrow. Like is it an appetizer? Is it just a taste? How much food am I getting? Is it ok to order like 7? Small bites puzzle  me for sure. It was nice to come here and see the presentation of the small bites and that will then help me gauge how many to suggest ordering. 

Empanadas: sweet potato, chorizo, herb ceme fraiche.  These were served with some pepper slices on top. They were baked to perfection. The stuffing inside was just blended do well. Crispy dough and the flavor of the stuffing was impeccable. Just really, really well done. I loved the taste. I only got to tasted a piece of the empanada  but that tasted was enough to make me want to go back and try more. 

Crispy fried wings: Honey, togarashi, ginger mayo. These wings were sooooo crispy. They were amazing. The skin was just so crispy. When talking to the owner about the wings he told us he recently changed the recipe and they are now more \"Korean style\". What I know is that the wings tasted amazing. I was not that impressed by the ginger mayo, but I am not the biggest fan of mayo sauces. 

Pork Belly Bites: Orange, chili, garlic, ginger. These were the winning dish of the night. The waitress said that they were the best sellers! They were just so good. The glaze on them was wonderful. They were just so tasty. I ate more of these than anything that was brought before me. The bites weren't small either. They were well portioned to fit in your mouth but not to just be a small taste. It was wonderful. 

Kimchi: carrot, diakon, nappa cabbage. SPICY. SPICY. SPICY.  I really liked the kimchi. It was savory and spicy. It had a lovely kick to it. I wish that there was something that I could have eaten it with. I know that kimchi is more of a side but it seemed a bit out of place to just have a bowl of it with nothing that went with it. I am really happy that I tried it and kept on going back for more, but as a warning it is spicy!

Cauliflower: general tso, sesame. This was a game changer! OMG. Cauliflower that was fried and had a general tso sauce on it. OMG. Soooooooo amazing. The breading was crispy and the sauce flavorful. It didn't even taste like cauliflower (probably because it was fried). I will say that some of the pieces of were really tiny. The cauliflower that was used wasn't a whole chuck but some little pieces. So some of the pieces were more breading than they were cauliflower. I would say that this was a really good dish, but I would say I would be disappointed if it came out with the smaller pieces. 

Pimento cheese: chicken skin. I only saw one of these plates come out and I got to try it. It was good. I mean pimento cheese isn't my number one go to, but it was ok. I would say get the pork belly instead!

The night was wonderful, the food delicious, and the drinks flowing. I would say that it was a little cramped so if you are looking for a larger party this is probably not the place for you to be able to all sit together and talk. But for a nice drink with one or two friends or a romantic late night bite, Grit & Grace is the place for you! Stop in! You won't regret it."}
{"text":"Grit & Grace was one of the more unique restaurants I've been to in a while. It's a pretty narrow restaurant and a lot of the seating is high top tables with stools on the outside. I was happy to be seated in a booth during my visit with a friend. 

While waiting for our table we ordered cocktails at the bar. I wasn't crazy about my selection and moved on to beer for the remainder of the meal. Once seated, the dim sum made its way to our table right away. We opted for the pork belly bites, kimchi and something that had to do with potatoes - I can't recall the details but I liked it very much. Same with the kimchi. Pork belly really isn't my thing. 

Of the larger plates we ordered, the short ribs and octopus dishes were two of my faves. The confit chicken wings were also very good. We ended with the hanger steak which was a struggle because we were so full. Probably could have done without that last plate, but it was fun to try so many different things. Definitely a cool spot for dinner in Pittsburgh!"}
{"text":"Went for lunch. The pork belly bites are great! But I'm in love with the roasted carrot salad, that I added the Arctic char. The fish was cooked beautifully & matched great with the salad! Can't wait to go back for dinner sometime! My boyfriend's ramen was a little less spectacular-- something with the broth..."}
{"text":"I'm sorry to say that the food was salty. They were nice enough to replace my order but unfortunately it was still salty. The ramen soup wasn't bad though."}
{"text":"Had the roasted pork Ramen, good flavor! The mushrooms were a bit much, but added a nice taste to the broth, which was also good. Loved the noodles, and poking open the egg helped."}
{"text":"Interesting restaurant! Stopped by on a Tuesday evening and it was surprisingly busy. They specialize in small plates and \"dim sum\" style dining, although most of their entrees are more gastro pub inspired than traditional dim sum. I strongly recommend the Pork Belly Bites or the Short Ribs with Hollandaise (which were excellent). They also have several Asian inspired noodle bowls were looked great. I tried their two sharable drinks, and they were definitely an interesting experience. The first was very tropical and was served in a shallow bowl with a floating lime that had been lit on fire, and the second was a tad stronger and was served in a Porron. Very fun, will definitely return."}
{"text":"I went to Grit & Grace for valentine's day brunch with a bunch of my friends. Our reservation was for 10:40 and we arrived at 10:30 with the restaurant being mostly empty. 

The reservation had been made a few weeks in advance and because of the size of our party (about 15 people), we were asked to pre-order our food. This was a great move by the restaurant's part because everything went really smoothly and there was no fuss over ordering. The one turn off to hosting brunch here was the ridiculous corkage fee. It was $20 per bottle and for a mimosa brunch of 15 people, the cost of simply opening the bottles in the restaurant was going to cost us an extra $60 not including the cost of the champagne and orange juice. Upon learning this we decided to go without the mimosas for the table and people ordered their own. I ordered a mimosa when I got there and was charged $12 for one which is pretty expensive considering you can get unlimited mimosas at most restaurants for $13-$15. The one saving grace to their mimosas was that they were 3/4 champagne and 1/4 orange juice. 

When we arrived at the restaurant, the service was a little unfriendly, the girl taking our coats for the coatcheck looked incredibly unhappy and was pretty cranky the whole time we were there which was kind of a turn off at the beginning. But everyone quickly got over that when the food came out. The food was absolutely delicious. I had the French road and was floored by how amazing the flavor was. Everything from the oatmeal to the farmer's breakfast to the banana rum pancakes was delicious. 

I probably wouldn't come back here with a group given how put-upon the servers looked by having a party larger than 4 people there, but would definitely go back to try some of their dim sum and noodles."}
{"text":"I haven't been back to G&G since my previously reviewed experiences.  I also had not been since they changed names to G & G Noodle Bar.  

After a brief stop in the Pop Up bar (Miracle on Liberty) next door we head over to G&G.  Things have certainly changed on the menu!  I was VERY happy to see that they kept a few of their Dim Sum items - most importantly the pork belly bites.  I remember those, I loved those, I got more of those!  We also tried the General Tsos Cauliflower - GET THESE. Holy crap they are awesome.  I've been on a cauliflower kick for a while - but these are amazing.

We tried a few other small plate items. My friend had been a few times - and wasn't a fan of the sushi or noodles - so we didn't get those.  Although I would happily go back and try them out.  The other items we tried - Short Rib biscuits (these are from the old menu as well - and still just as scrumptious!)  Bulgogi lettuce wraps - these just make me happy!  Steam buns (Beef and korean fried chicken) - both were scrumptious as well!

I left G&G Noodle bar looking forward to my next visit.  After past experiences, this says a lot.  If you go, I PLEAD with you - get the pork belly, but more importantly - get the general tsos cauliflower!"}
{"text":"I had extremely high expectations for Grit & Grace - not just because we had a horrible #PRW dinner two days before but because the recommendation had originally come from PGH Taco Truck's main man, James. And, let me say that I was not disappointed. We had the 3-course #PRW menu, as well as a dessert, including:

--Dim Sum: pork belly bites (orange, chili, garlic, ginger); confit chicken wings w/ herbed buttermilk
--Small Plates: steam bun - mortadella / bread & butter pickles / coriander mustard; charred endive - dill pesto / cured pork jowl / caraway gastrique / herb bread crumbs
--Large Plates: smoked brisket, kohlrabi, thousand island sabayon, pickled red onions, horseradish cream, baguette; roasted pork ramen, mushrooms, carrot, 5 minute egg, tonkatsu broth
--Dessert: chocolate mousse with caramel and a macaroon crumble

I could give you the play-by-play of each dish but I don't have to: Suffice to say, we finished every last bite and had to restrain ourselves from licking our fingers. I even dipped my brisket in the ramen broth. 

There's a certain X factor for good food - when it's done just right, when you don't need any salt or pepper, when you wish you could stop and start the meal all over again, when you start thinking about your next visit before you're even done eating. Grit & Grace is a unique keystone in the Pittsburgh food scene.

I have to also say that my husband was please to find one of his favorite IPAs (Grapefruit Sculpin | Ballast Point Brewing Company); and, I enjoyed a beautiful viognier - something I seldom find on a Pittsburgh wine list.

Overall, I will absolutely go pack for a smorgasbord of dim sum and small plates!"}
{"text":"Delicious! Great menu for both food and alcohol. Good mix of vegetarian, pescetarian, and meat options."}
{"text":"We sat at the communal tables, you needed a reservation for the others. But it was okay because we weren't that dressed up. The dim sum feature was fantastic. We tried all 5 types-I thought the fritter was the best. For my entree I ordered the pig face roulade. It was great but to me it felt like a good brunch  entree rather than a dinner entree. Nevertheless, I will definitely come back here again. Great atmosphere especially at the common tables. Very reasonably priced."}
{"text":"Pros: Great ambience and lovely place for a date. Not many choices for a vegetarian or pescetarian unfortunately. I loved the heirloom tomato dish and the scallops were great too. We ordered the dirt dessert and it was delicious!! 

Cons: The eggplant with miso was a little bland and not what We expected. The plates are very small, so you end up spending a little more to fill up... The staff there acts a little too cool for school and could be a little more warm."}
{"text":"My husband and I come here after work fairly regularly. I always get the pork Ramen which is to die for especially with the five minute egg and marinated mushrooms that are included. My husband gets various things but lately he's loving the pork belly dim sum and the general Tso's  cauliflower (also on the dim sum menu). The two of us can eat for under $30 and it's delicious!"}
{"text":"Following a misunderstanding with our reservation, we were promptly accommodated in the vibrant atmosphere of the restaurant.  Starting with the most exquisite dirty martini and Cosmo, the evening took flight.  Every course was better than the last.  The freshness and crispness of flavor covered each dish with poise and grace.  It may became the next Pittsburgh prime."}
{"text":"I've dined at Grit & Grace for dinner twice now.  Both times I sat at the bar and had a lovely experience!  The food was delicious and the service was fast.  I ordered the pork face roulade both times because I loved it so much the first time.  It was reasonably priced and I would have been full from the sandwich alone (however, I still ordered more plates because we wanted to try other things).  The octopus and steam bun were both really good too.  The Brussels sprouts with cheddar sauce was an excellent dim sum!  My favorite part by far though was the drinks and dessert! I ordered the jungle bird cocktail and the smoked flavor with the pineapple was perfect....the bartender is the man!  He recommended the dirt dessert and it is still my boyfriend and I's favorite dessert of all time!!! Will be back for sure!"}
{"text":"First off, the location used to be home Taste of Dahntahn and thank goodness that pace is gone! Grit & Grace is a welcome replacement, however their \"mantra\" of \"pushing opposites to the extreme\" is a bit pretentious. That being said, the food is unique and the service is excellent. Our table of 4 tried each dim sum option, which was kind of confusing. In traditional dim sum they keep coming around to offer you additional tastings. This instance it was more like an appetizer setup. At any rate, everything was delicious. the porky belly bites and steak tartare in particular. Then I went to TOWN on the roasted pork ramen. Overall an enjoyable and unique, if not a bit over the top in terms of the concept."}
{"text":"One of my top brunch options so far!  Adorable and cozy atmosphere, very accommodating and even had cost check!  

I had the crab omelette, which I was a little skeptical to try - but delicious!  My brunch choices are 90% omelettes so I've got a lot of omlexperience.  This was definitely one of the best, comparable only to Carmella's.  

The drinks were more expensive than I expected at $10 for a mimosa, but it's hard to gauge that based on brunch not dinner prices.  It was very well presented and tasty, however I wish I'd only ordered one! 

But the coffee.  I would venture to say this is some of the best coffee I have had in Pittsburgh.  It was smooth to perfection.  Absolutely phenomenal.

Overall a great spot and a short walk to Market Square where we got drinks after!

Pro-tip-:  Don't bother driving around looking for street parking, give in and go in a lot or call an uber.

#brunchsohard"}
{"text":"No matter how hard you try, you will not be able to resist the dum sum.

I have been here a few times, and only once did I actually go with the intention of eating.  Usually what happens is that I will drop in with some  friends for a post-workday cocktail, but as soon as the dim sum comes around it's all over. I have had a number of the rotating dishes, most recently the salmon tartare (super flavorful and served with very thin and crispy pieces of bread), and the pork belly bites (in a delicious sauce with flavors of orange, chili, garlic, and ginger). Some others that I remember from past visits were the cold soba noodles, steak tartare, and some amazing pork meatballs.

Aside from the small dishes, I have also had the roasted carrot salad. It was a good portion and included romaine hearts, edamame, cheese curds, and a fantastic honey and chili vinaigrette. It was pleasantly spicy and tangy; I want that dressing on every salad!

They also offer a selection of interesting cocktails. The bartenders are very friendly and offer great suggestions. This place is great because they serve high-quality drinks and food without being obnoxious about it, and it's a very comfortable atmosphere."}
{"text":"Really amazing experience eating here. Hostess staff was extremely accommodating for us, we were a group of 4, later to become 6. They found us a gorgeous outside table and added on an additional table as soon as two other guests left. The dim sum waitress was fantastic and had really great knowledge of the dishes, the beef tartare and samon tartare were delicious. The celery root was amazing as well. Our waitress was absolutely wonderful. She had really great suggestions for sharing dishes and paid cocktails/beer. We had the steamed bun, the beef brisket over a biscuit topped with cream fraiche, duck breast with rye noodle, and the pig face. Overall, an amazing experience."}
{"text":"It was our first time dining here a few days ago because I was craving ramen.  My hubby and I figured we'd try out this place bc of great reviews.  My hubby loved the food.  It might not be the best place to get ramen and not the best tasting ramen I've ever had, but it's still pretty good and satisfied my craving.  The soup was a little sour for my taste, but I just balanced it with a little seasoning.

The rest of the food we had were amazing!  Our server came up right away and talked to us about the menu.  The dimsum server came up with a tray and we got the pork belly, which was good! It was sweet and salty and cut the perfect bite size.  For some reason, my hubby said he thought or wished it was actually deep friend like chicharon or pork rind. Lol.

We also shared the short rib biscuit.  My hubby got the pig face roulade and chicken wings.  He loved the wings because they were the crunchy dried ones that you dip in the sauce instead of it swimming in sauce.  The only thing is, they probably should've told him the rest of the sauce is at the bottom of the dish, or maybe serve it separately.  He enjoyed both dishes.  The wings were delish just be careful biting into the red chili. One order had 7-8 wings.  If you are really hungry, you might have to spend more bc some dishes are super small portions.  We also had the brownie with pears and rice krispies.  Can't go wrong with a brownie dessert.

I like the decor but the place is small.  We were seated right away without a reservation but that was around 6:00 on a weekday.  When we left, the place was packed, so always safer to have a reservation.  One of the cons was that we were seated in the two person table, crowded by the bathroom, register and kitchen."}
{"text":"Came here on a whim with the bf for a late night drink and snack and was really impressed by the ambiance of Grit and Grace. The stand-out, spectacular dish of the night was the eggplant marinated in miso. Seriously, this dish blew me away, because the texture of the eggplant is like sashimi in an amazing, original way. Great dish for vegetarians and non-vegetarians alike. We enjoyed the dim sum as well, but it seemed a little bit less fresh and inspired (maybe because it was around 9 at night), although the kimchi was so tasty. My biggest gripe is with the cocktails, because at $10 a pop they were very light on the booze. I recommend ordering a reliable classic off the menu for a better bang for your buck."}
{"text":"I stopped in with a coworker while in town on business based on the Yelp reviews. They were booked but the hostess squeezed us in. Nice atmosphere and good service. But the food is what won me over. Everything on the menu looked great but I went with the bulgogi lettuce wraps and a pork noodle dish. Both were outstanding. Maybe a bit salty but fantastic; especially paired with a Founders Kentucky Breakfast Stout. I really enjoyed my visit and hope to go back."}
{"text":"Came here with a Yelp event during their newly rolled out \"late night happy hour\" which runs from 9-11 pm on weekdays. It features $5 drinks!

I'd never been here, although it has been on my \"restaurant wishlist\" for a while. I had the mulled wine - beautifully presented, not too alcohol-y! And my favorite re dim sum: the chorizo sweet potato empanada!!! OMG and the chutney on top - was minty and sooo good. I strongly recommend it. The pork belly was also very delicious. It's super flavorful so a few bites can satiate your palate.

The restaurant itself is deceivingly small - especially because the outdoor sign is very big. The decor is beautiful. I could see my house being decorated like that. Will definitely come again, especially to check out the HH (I'm trying to get this acronym going ... happy hour, duh)."}
{"text":"This is exciting and different. I'm interested to see how they grow for sure. 

I came during Pittsburgh Restaurant Week, which meant we were able to get 5 dim sum dishes for the price of 4. Not bad, not bad. I was so pumped when I saw the tray going round and eagerly awaiting which dishes I would choose from! So the chick came round with the tray of 5 different dishes and we all grabbed them up.

I was able to try every dim sum item on the menu. How? Because that's all the options they had. I'm not privy to how most dim sum restaurants are, but I thought there would have been more options. I'm wondering if they're starting with the five (which seem to rotate out on different days when I peaked at the menu) and expanding from there. I'm actually hoping, more than wondering!

While the pork belly bites rocked my world, the others were tasty enough, like the cold soba noodles, steak tataki and shrimp salad. Looking forward to seeing what else they can come up with to rock my world 5 to 10 to 20 times more!

I was also excited to try some of the cocktails, since I'd heard they were pretty crafty (get it, craft cocktail??). I tried the G&G Club Cocktail $10 (bourbon, amaro, creme de cassis, orange bitters). It was good and STRONG. Be careful... 

I really like how they set the main menu up, aside from the dim sum. They list the plates by size. So the top of the list is smallest and runs to largest. While the short ribs $6 (cream cheese biscuits, aged white cheddar cheese, hollandaise) were AMAZING. We split between four people, when I really wanted to shove both biscuits in my mouth. So maybe share with two people:)

The salmon $17 (crispy pretzel bread pudding, braised cabbage, pickled mustard seeds) on the other hand was enough for one person, but we did split, with so much other food to share. I thought this dish was very creative and loved the homemade pretzel bread and cabbage. The salmon was also expertly cooked!

The tasso ham flatbread $14 (black garlic, olive oil, leeks, mushrooms, fontina cheese, kale, arugula) was also very good. Actually, come to think of it, the main dishes may have been better than the dim sum... I just came to this realization after typing all this out. I feel like they set out to potentially conquer dim sum in the Burgh... and hopefully they will, but for now it seems like main dishes rule."}
{"text":"First visit to try the new menu.  Outstanding.  Steam Buns, Korean Fried Chicken Wings (fantastic!!!!), Five Spice Pork Ramen, Bulgogi Lettuce Wraps, Fried Pot Stickers.  All excellent.  Definitely a winning combination and a place to put on your list."}
{"text":"I've been 4 times and the highlights food-wise have been the pork belly bites, the short rib biscuit, the kim chi, the eggplant (outstanding!!), and the hanger steak.  I was not as blown away by the ramen.  Since my vegetarian diet adoption, I tried some truly kick-butt General Tso's cauliflower.  At the risk of being a broken record, they could use more vegetarian and vegan options, especially for brunch.

The atmosphere is great. The curved wooden, flowing bar and backdrop are lovely and soothing.  

Get a reservation in advance!!"}
{"text":"We went there for lunch and shared the dandan noodle and a chicken rice dish. The latter tasted quite weird. I didn't like it at all. The dandan noodle is not too bad. If you are looking for authentic Asian noodle, this is not the right place, but the flavor was still good. I guess we were a bit underwhelmed after seeing the great photos and amazing reviews. I'd come back and try some other dishes and drinks."}
{"text":"Tried this place out & VERY happy I did. The food is a great Asian inspired fusion with a modern take which is really refreshing. 
I always get a shaved flank steak as it's just the perfect amount of food. ... not too much & fills you up. 
Really enjoy the small appetizer plates that they bring to the table... really different & I think they change them up daily. I've LOVED all of the appetizer plates that I've tried thus far & expect I'll continue to feel that way. 
They've also got a super cool drink for 2 or for 4 called the scorpion which has a flame in the center. Way cool looking drink as well as good."}
{"text":"I will not eat there again. The service was spotty and so was the food. The dim sum was interesting and tasty, but then my partners food was brought out all together (main course and salad) I then sat and watched him eat. His salad looked like it came right out of a bag from the grocery store. A little while later my \"salad\"
came and it was a very odd and not tasty arrangement. Then while I was trying to eat my salad my main dish was dropped on the table. For the price and the hype it was very disappointing. We asked if they were overly busy that night and were told it was slow for them, so that wasn't a reason for the poor service. We mentioned to our waiter that it was our anniversary and not only did he not congratulate us, it was as if he didn't listen. Save your money, go someplace else."}
{"text":"I've eaten here twice, the first time for dinner and next for brunch. If brunch had been my first visit, I'm not sure I would have returned. The steam bun was overcooked and dry, and the service was badly timed so that my 2 courses came out at nearly the same time. Dinner, however, was great! One of the best meals I've ever eaten- a particular favorite was the small plate of a cream cheese biscuit and short rib."}
{"text":"Came here specifically for the pork belly bites, and they definitely did not disappoint! Pork belly is by far the best thing here. Everything else is mediocre.

The dim sum menu has all of 3 items on it, and cannot even be called dim sum...nothing like real dim sum. The ramen is nothing close to authentic ramen, just a simple noodle soup. Best thing about the ramen was the super tender pork belly and soft boiled egg.

Steamed chicken bun was ok. Bun was soft, but the flavor was overpowered by the kimchi.

WARNING: DO NOT drink the water. Tap water is one thing...this water is straight sewer water!"}
{"text":"I ordered the Kimchi, Pork Ramen and Dumplings. The ramen was good but not worth $15. The Kimchi was disgusting and I had to throw it out. There was WAY too much vinegar...I guess that passes for Kimchi in Pittsburgh. The dumplings were good but reminded me too much of the frozen kind that you buy at Restaurant Depot in the Strip District. If they were homemade, they somehow figured out how to clone the frozen ones that taste nasty. Total bill was around $40 delivered....NOT worth it. Will not order from this place again."}
