{"text":"Matt is absolutely incredible with his knowledge, customer service and all around skill. This place is amazing despite all the horrible reviews. Ask him about any of the 100 or so tequilas and watch him take your order without writing anything down! Please! He's incredible! Melinda, the manager, is also very friendly and knowledgeable with her peoducts and great with customer service! I hate that people use YELP for bad experiences and never for the great experiences that happen daily especially at this restaurant! Try it for yourself! It's great!!!!!"}
{"text":"Gallup was in the original Pasqual's - Verona location and stayed open after Pasqual's closed. Now Pasqual's has re-opened but without Gallup."}
{"text":"When I heard that Pasqual's reopened their Verona location, rebranded as Gallup Coffee and Bakehouse, I was initially excited.  There aren't many (any?) fast-casual options in my neighborhood of far southwest Madison or Verona.    

Gallup's no longer has the southwest/New Mexican focus of Pasqual's,  but instead offers pastries, coffee, breakfast, and most recently, lunch options.  It is the second Gallup to open - the first is attached to the Hilldale Pasqual's, and does not offer lunch.  The Verona location is only open until 1:30, which is also worth noting if you're looking for a late lunch or dinner.

I tried the Balzac calzone ($9.50), and truly hope it is not an indicator of the rest of the menu.  The menu said the ingredients were meatballs, artichokes, parmesan, and garlic, with a side of pizza dipping sauce.

What I got was a decent sized calzone stuffed with cheese and a soupy, watery marinara sauce, with solid, flavorless chunks of meatball.  And no artichokes to speak of.  I figured, that, for the price, there would be lots of artichokes mixed in, and saw nor tasted none at all.  The artichokes made this item unique to me, and was the reason I ordered this item.  In addition, large portions of the calzone were extremely salty, to the point of being disgusting.  There were also chunks of onion, which I attributed to the marinara sauce - neither of which were discussed by the menu.  The crust was decent, but the pizza sauce was ice cold, which could be a put off for some.  

Overall, the calzone was a disappointment, which was too bad, because I would love to see this local business succeed.  I'll probably give them another chance and come back to try breakfast or a different lunch option."}
