{"text":"Awesome place to down some beers whilst watching your favorite sports team. Patrons and staff are equally friendly. Loved it!"}
{"text":"I love this bar. I've been a regular here for over a year. It's definitely the best Sports Bar in Little Italy. I was so happy when it opened, because the area was in desperate need of a good Sports Bar at the time, and it delivered! There are numerous tv's, and typical bar food (burgers, poutine, wings, etc...). They also have some craft beers on tap as well, and they change them up every now and then. They also have food and drink specials, daily, and everything is really affordable. The best thing about this bar though, is the staff. They are the #1 reason why I keep going back. They are all extremely nice people. They'll treat you like you're family. It's a small bar, so it has a very intimate, cozy feel, which I love. I highly recommend it!"}
{"text":"This place is exactly what College St. was missing. While there are plenty of great places to grab a bite to eat or coffee, there are a serious lack of places to go catch a game (with the exception of soccer/football of course). Gameday has come along and filled this void.

A modern take on the old school sports bar. A clean and friendly place to go catch a game or the big UFC fight with friends. Great pub food with some interesting menu twists and a great yet not too snobby selection of beers. 

Definitely worth visiting on \"game day\""}
{"text":"Ok I thought this was a nice place in a nice area after an amazing meal (vivoli) and went for a drink at this place... They poured half the amount of one shot and when I tried to dispute it (I had one drink the whole night so was not under the influence), the server there not only took my drink and poured it down the sink but also did the same to my partners. Unbelievably rude service for no reason. I can't believe that such a nice area in Toronto would be subject to such atrocious customer service. We went across the street to bar radio and had a blast. Please avoid game day at all costs..."}
{"text":"Stopped in the other day with a buddy for a bite and a few beers. The service was good and there was a decent selection of beers for a small bar. The food unfortunately was a bit of disappointment. The burger, while tasty, had a patty too small for the bun (expected more for $11-). The fries were mediocre, and the onion rings were bland and oily. The menu did have  a tasty looking selection of wing sauces to choose from so I will pop back in to give the wings a try... Overall an average experience food wise, the friendly service made it an overall positive experience."}
{"text":"La propriétaire des lieux tient à la fois cet établissement et un stand au marché St Laurence. Sa spécialité ? Le sandwich gaucho style argentin, l'éflioché de porc et bien entendu les fameux 'wings' ou ailes de poulet frits et qui se consomment avec une sauce très piquante."}
{"text":"Came here to watch the raptors vs nets game 6. Atmosphere was good, service was good although had to flag a waitress down to get her attention at times. They had several TVs on each side, wouldn't have any issue seeing the TV. Food wise was what you would expect at a sports bar and prices were very reasonable. Ordered the 1 pound hickory BBQ wings and poutine. Wing came with two slices of cucumber. Wings were standard but would it kill them to serve a few more cucumber slices?? Poutine was average and the gravy was pretty salty. My friends ordered the fish and chips - the fish batter came out pretty dark. Didn't look great but not sure how it tasted.

Overall, my experience deserved 3 stars. Good place to come to watch a game and grab a bite but don't expect amazing food."}
{"text":"did you know that at gameday they have some cool things that others don't... they have a charging station for my phone-free i might add, some leather couches with a ps3 to play games- also free, a wicked jukebox,mit's like a huge ipod, it takes pictures too. the beer is cold and great prices. the food id hot and consistent. the staff know their sports and are friendly. honestly what more could you ask for, oh wait i know.. a patio equipped with tv and sound, free use of a multiude of board games. oh yeah and monday to friday between 4-7 all beers are $4, taps and bottles. i love the place, and so will you once you come and see it with your own eyes. i like that it's smaller. more intimate where folks talk to eachother forgetting that we are strangers. see ya there my friends!"}
{"text":"I'm not sure that I'm necessarily a fan (as Yelp's 4 star rating system implies), but this place is pretty good, perhaps even better than I was expecting. 

First off, there are tv's pretty much everywhere so you'll be able to watch whatever game is on from any seat in the building. The food menu has lots to choose from, and there is also a pretty good draught beer selection including a few more brands than just what is listed on their little laminated beer menus at the table. But lets talk about chicken wings - the reason this place earned a 4th star. 
There are probably a good 30+ chicken wing flavours to choose from, and all 4 that we ordered were pretty darn tasty! More importantly, they were big and meaty wings. My dining counterparts wanted them to be more crispy but personally I prefer them more tender and easier to pull off the bone. What I can also appreciate is how saucy and seasoned they were. Each wing really looked like it was its own, versus a lot of multi-flavour wing joints which all look like they were cooked in the same batch, sorted into their serving trays and then lazily/minimally sauced up.
The only disappointment was the poutine, which was terrible. The portion was large but the gravy was especially lacklustre in flavour, and not as warm as what would be ideal.

We were able to get a pitcher of beer, 4 pounds of wings, deep fried pickles, and a poutine for around $81 after tax before tip, which seems about the standard... So yeah, this place is somewhere between a 3 and a 4 star but since the wings were all good, Im feeling generous."}
{"text":"Trying to find a bar on the same day as the Italy game during the Little Italy street fest can be a nuisance... buuuuut I must say the soccer Gods were looking after my entourage of two lovely Italians and myself. 
Passing by over crowded bars it was a bit nrrve wrecking just trying to find a seat for three but lucky after passing Cafe Diplomatico and CHIN headquarters Gameday came to the rescue. 
A small table right by the opened window was a perfect spot...though it was missing a chair we had no issues finding another one! Their beer on taps had a handful of good selections so all three of us agreed on a pitcher of Sapporo Japanese beer mmm.... 
For food...... I just stuck to your typical bar food!!! Burger and fries served with a pickle and coldslaw for $5!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Just for checking-in on YELP! Way to represent!! Meanwhile the ladies had a veggie burger (which looked like it was going to fall apart) and turkey burger which looked decent hahaha.
The place is clean, service is somewhat satisfying. .but keep in mind it was busier than usual due to crazy world cup clientele......I can say that I've experienced a better bars before, however I wouldn't go out of my way to come here. 

Fyi....Check in and get your burger n fries for $5"}
{"text":"I stopped in tonight to check out their half price wing deal. I went with the double order of wings and chose BBQ and honey garlic for the sauces. Both were good, but the honey garlic was very different than expected. It actually kind of tasted like peanut butter..? Very strange, but not bad. And I definitely can't complain about the $10 price! Best deal I've found in the city so far.

I did visit the restroom to wash my hands when I first got there, and I have to say I briefly considered going elsewhere after that. The bathrooms are down this weird, unmarked, narrow staircase and the ladies' room was not very clean. I always assume a sketchy bathroom is a sign of a sketchy establishment, but luckily that wasn't the case here."}
{"text":"Yuss GameDay is where it's at. Lots of TV'S, awesome attentive staff, nice cheap pints, and proper strong bar rails. It's a little on the smaller side and has a cozier vibe than your standard sports bar mega-plex. The food can be hit or miss, I got the poutine and it was meh, but my boyfriend got their fish and chips and that was stellar. It seems like the stuff they cook and prepare on site are their standouts and I'm definitely coming back to try out their Gaucho sausages.

However, they seemed to have a bit of a fruit fly & bathroom odour problem when we came on a Friday night. It was stuffy and weirdly humid in there on a crisp fall evening? There where a few flies that were quite bothersome at our table and then quite a few more in the women's bathroom. Nothing to really cry about, but annoying nonetheless. Hopefully they can figure out an effective way to make their bar smell like fresh delicious food/beer combo and lower their fruit fly to people ratio.

All in all a great experience and definitely the hep new sports bar in town. Anything is literally better than Toby's..."}
{"text":"Not living up to the hype.

They had one server and she didn't acknowledge us at all. We had to approach her and ask if we can seat ourselves.

They have big wings that are delicious. 

Their beer and wine menu is really lacking.

We had an average dining experience. Not too special and nothing too bad."}
{"text":"this has got to be the football bar you've been looking for.  i was in toronto with my son and his family and we all walked over to Game Day for the early NFL game on Sunday between the Ravens and the Browns.  No better place to watch.  Clearly it's the place that friends meet friends to engage in that singular past-time of Sunday football.  And the munchies are great --  nachos, of course, and wings, of course, plus burgers and mac and cheese and ...."}
