{"text":"After a great first experience I decided to head back there with my brother who loves a good Reuben as much as I do.  I had told him about how good it was but boy was I disappointed this time.  I'm not sure how he felt since he didn't have a previous visit to compare it to like I did.  The pastrami was super fatty and portion was significantly smaller than the last time although that was probably a good thing since the quality was so poor I didn't want any more of that gross pastrami.  I had been so excited and felt so short-changed.  Definitely a poor experience especially for the price I paid."}
{"text":"When for dinner on Thursday 5/16 and the store was closed. No information as to why or if they will reopen or not."}
{"text":"My company caters breakfast from here once a month or so. I've loved it every time.   This morning, I decided to grab a sandwich on the way to the office. I ordered the Manorville because I'm a sucker for avocado. Plus the turkey, swiss and tomato combo was going to be light enough to fill me up, but not slow me down early in the morning.   Sadly, it came up remarkably short of my expectation. A few bites into the sandwich, I thought they'd forgotten to add any avocado. My next bite had me completely confused.   It was crunchy.   Mind you, it was turkey, avocado, swiss, and tomato.   I opened the sandwich to find three, one-inch, completely unripe chunks of avocado buried under the tomato.   When ordering a sandwich with avocado it's reasonable to expect the slices to actually resemble an avocado. It's also reasonable to expect them to be ripe. Not to resemble a crisp apple.   Suggestion to management, spin up your team on proper avocado etiquette. What a proper slice looks like and most importantly, when a avocado is ripe.   Luckily, they've been great to my company, so I'll continue to let them pay for my breakfast from here on out."}
{"text":"So incredibly disappointed in the young man taking orders, the attitude of the entire staff...I have a feeling the manager wasn't there.  I asked for a half turkey with lettuce tomato and Russian dressing on marble rye.  What I received was a whole turkey sandwich with toasted soggy oily bread and the grease from the griddle had soaked through into the turkey.  It was so gross, I threw the entire thing away after one bite...there goes $8.69."}
{"text":"FanF'ingTastic! We order breakfast from Gandolfos on a daily basis. Their Crew breakfast sandwich is great to share or eat all yourself. I have been dipping my toes in their lunch menu and other sandwiches and would have to say their Meatball Hero Sub is by far the best meatball sub I have ever had. I am not a big fan of tomatoes and if you don't either make sure to order your Meatball Hero without them. They make a lot of things fresh and give it that homemade taste. I recommend to anyone in the nearby Tempe area to give them a shot. The faculty is pleasant and the food is simply amazing.   http://www.gandolfosdeli.com/photos.php?directory=Tempe%20(Elliot),%20AZ&album=store"}
{"text":"Loved the New York Liberty...Pastrami Swiss Marinated mushrooms!!"}
{"text":"Huge selection and the sandwiches are pretty good...prices are good and I would give the place 4 stars but the service is suspect. For example, when I say ''thank you'' the response is always ''yep.'' I'm a customer, not your buddy... I often go back because the sandwiches are good and I like the wide selection...also don't be fooled by the name, this is not a New York  deli in any way shape or form..."}
{"text":"I would love to comment on how good/bad their food was, but I can't. I showed up at 6:45pm, and they close at 7 per the sign I was looking at on their front window. However, they were closed when I got their, and the 2 girls standing there just randomly looked up at me while cleaning. I wanted to give them a shot for the first time, however, with them closing early and not acknowledging me about it when me and my friend where looking right at them, makes me not want to got back. What gives?"}
{"text":"I am going to give this place an extra star because the sandwich I had today was sooo good. They actually had everything in the sandwich it was supposed to have AND wheat bread. There was an insane amount of vegetation in this sandwich as well. I had mushrooms, lettuce, and avocado falling out all over the place.   I think I have figured out that if you want a decent sandwich from this place you need to order at lunch.   Do me right next time Gandolfo and I shall grant you an extra star!"}
{"text":"I went to Gandolfo's today with my wife for lunch. There is nothing really bad about Gandolfo's, but there isn't anything really special either. The place is average in my book and better places I've gone to.  Gandolfo's does have a wide range of sandwiches, which is nice. Way more choices than most sandwich shops and it's not even close!   I went with the large Greenwich Village, my wife went with the small Dagwood. The sandwiches were a little expensive for what you got. A large sandwich could be up to $9.50, most average around $8. My wife's small Dagwood was $6.  While in line, my wife and I spotted some potato salad that looked great. We decided to forgo any chips and go with this side. This was a mistake. This was the worst potato salad I've ever had! There was no taste.    I like the decor on the wall with the various sports images.   Staff was friendly and our order came out within 5 minutes."}
{"text":"This place is awesome. Today they had some missing items but I was okay with that because it was New Year's Eve and they probably ran out of. It has always been busy but it's not because it was slow. I only noticed if you take their sandwiches  to go  they may get soggy if you get a sandwich with oil and vinegar it got really soggy. Nice sandwich shop."}
{"text":"I LOVE THIS PLACE! They have a huge menu. My favorite sandwich is the Dagwood with guacamole/avacados.  Gandolfo's is unlike other sub shops where you get crappy meat and get charged 8 bucks. Gandys uses Boars Head meat and they pile it on! I would drive 20 miles to get sandwich from this place if I had to! Eric is the owner and is super friendly. Keep up the good work guys, I LOVE YOUR SANDWICHES!!"}
{"text":"Love the sandwich names, and the sandwiches. I wish there were more vegetarian options, but the ebbetts field is pretty much my ideal sandwich, so for me Gandolfos is hard to beat. My only real complaint is that I wish the hours were longer, I remember when you could come here for dinner too."}
{"text":"Tried this place on a Groupon. The sandwiches are good, but not worth the price without a Groupon. The hours are 7am-4pm, which is pretty limited. Tried to go a 2nd time a 2pm and they were already closing up. What kind of a restaurant can have inconsistent hours with a well known sandwich shop in the same parking lot & a great Asian restaurant 2 doors down, which is where we went ultimately, since they were closing st 2pm. I am surprised this place is still in business. I wanted to love it, but just couldn't with the limited hours and the lack of reliable hours. Sorry. Probably won't be back, even with a Groupon. This must be a franchise location. You wanna see how a Gandolfo's should be run, go to the Reno, NV location. They have it going on and are always rocking."}
{"text":"The sandwiches are great... yes the menu is overwhelming, but pick your meat and go from there... this is a favorite lunchtime spot for me and the BF."}
{"text":"First visit to this place and it will be the last. Apparently it has been open for about 3 years and it appears that it hasn't been cleaned well since it opened. Instead of talking about it, since words are subjective, I posted a bunch of photos in the gallery. Just take a look at them and see for yourself. A picture is worth a thousand words.....  Additionally, I aw employees using the restroom but when I went in the men's room there was no hand soap? The iced tea container at the drink station was uncovered and there was visible \"stuff\" floating on top.   I emailed the CEO of the company to inform him of the condition of this franchised location and included the same photos that are on here. His response was unbelievable. No apology, only a statement that the owner has always done a good job but he is currently away from the business. What? Always done a good job but the place is clearly not maintained and hasn't been for many months. The CEO then suggested that he would be willing to \"buy my meal\" IF I tried another location and did not find it to be better then the Tempe location. Wow, way to extend yourself and try to retain a customer. I declined his offer to try another location. Once was enough and if the CEO doesn't care enough to even apologize or say he will find out what is going on and get it fixed, then I certainly don't care enough to spend money with them.  The food was mediocre. Meat heated in the microwave is really not appetizing.  Would you like any chips with your dirt??"}
{"text":"I read the reviews and all were true. I had a groupon and wanted to try this place. I ordered 2 Ruben Rockefellers. Here are my issues 1. The manager was a jerk, not sure why they even do groupon 2. The sandwich and orde was \"grouponized\" it did not look like the picture on the site. There should have been 3 layers on the Rockefeller but they made it two. Also the cashier said it comes with free salad, the manager said no, not for Groupon. Making up new rules on the fly not exposed in groupon 3. The manager was slamming microwave doors and talking to the help the whole time about the crappy deal the groupon was.  I liked the sandwich but will never go back. I don't respect a business that works this way"}
{"text":"Great sandwich. Not cheap but it's not a skimpy sandwich. Good portion fresh meat big sandwich."}
{"text":"Great breakfast sandwiches....like Chaz, Callie and Radio City"}
{"text":"The one star is for the rudeness of the cashier. I came in with a groupon and he did not seem happy about it, he was very rude. The sandwich wasn't bad, but for the price I have had much better."}
{"text":"Servicable lunch joint. Large selection of sandwiches and quick service. Slightly higher on the food chain than Subway or Blimpie."}
{"text":"An authentic New York delicatessen sandwich shop. Offering a awesome breakfast and lunch options. I highly suggest you try the Harlem breakfast sandwich (roast beef), or the Eastport breakfast sandwich (pastrami).  For lunch you got to try the taxi driver.   The owner and staff are very nice and accommodating if you would like to take the sandwich to go, they will give you the ingredients and tell you how to make it so it's fresh when you're ready to eat it.   Note they are not open on Sundays."}
{"text":"Just at lunch here because I was at the T-Mobile store in the same complex. Whatever, it's a sandwich place but they actually have a pretty unique menu and they serve breakfast all day. I wouldn't go way out of my way to eat there but I'd def go back if it was convenient. If you work around here it's a good option."}
{"text":"I love Gandolfo's and this location is excellent!  I had the Mama Leone, one of my three stand-by sandwiches.  The quantity & quality of the ingredients is far above what you'll find at a large chain.  To put my review into perspective for you, I would never eat at a subway or a jimmy John's.  I like independent sandwich shops but when I find a which wich or a Gandolfo's I don't hesitate to stop; preferably a Gandolfo's."}
{"text":"Went here last week with a Groupon and had an i love New York with Russian dressing. It was really good and I could not finish it.  The pastrami and corned beef had a very good flavor. The soup I had with it was very good also. Two large sandwiches, two sides, and two drinks cost about $30. Service was fast and friendly. One of the better NY style deli's I have tried in Az, I'll eat here again if I'm in the mood for deli while I'm around Tempe."}
{"text":"If slimy sandwiches and salads accompanied by rude staff completely lacking in personality are what you're looking for, than Gandolfo's is the place for you!  My husband and I had lunch at this location yesterday and I honestly still feel nauseated even thinking about it. Never having been to Gandolfo's, we needed a few minutes to look at the menu, which was certainly not a problem as there were no other customers in line.  This should have been our first warning sign but sadly, we persevered and ordered our lunch.  The girl behind the counter answered our questions with simple yes/no answers in a completely deadpan tone with no hint of an expression on her face.  My husband decided on the Madison Square Garden sandwich and I had the salad of the same variety.  I ordered a soda and my husband asked for a water.  The girl at the counter then asked him if he would like a cup for his water.  What a ridiculous question!!!  No, he doesn't need a cup, he'll just seal his lips around the soda machine and push the button!  After a bit of a wait, our food was ready and I brought it to our table, however, a better option would have been to throw it directly into the trashcan.  My husband unwrapped his sandwich to find it so heaped with mayo and sopped with oil that even the outside of the bread was saturated and slimy.  My salad also contained the marinated mushrooms that were in his sandwich, and while they sounded good, the taste and texture was sickening.  The lettuce was anything but fresh and the gelatinous Italian dressing made the whole thing even worse.  The croutons that were supposed to have come on my salad were nowhere to be found, but I didn't even bother asking for them as I'm sure they wouldn't have been enough to overcome the already offensive taste/texture combo that I was attempting to choke down.    As if the food itself wasn't already enough to send us running out the door never to return, we then had the pleasure of watching the girl \"clean\" the counter by flinging all of the food that was on it onto the floor into the area where customers stand to order.  I looked around to see if there was a mark drawn on the counter or wall anywhere so that when the food on the floor reaches that depth, one of the staff comes out to actually sweep it up but didn't see anything so I'm guessing that they just allow customer to wade through the food buildup throughout the day.  I honestly have no idea how this place is in business given the fact that there is a Jimmy John's accessible from the same parking lot. I'm guessing that the sparse crowd in Gandolfo's at noon on a weekday is a direct result of a far better option available within walking distance.  If the rest of my review hasn't been clear enough as to what my opinion of this place is, let me just add that if I were stranded on a deserted island for a month with nothing to eat and the rescue boat showed up and offered me food that came from Gandolfo's, I would throw it overboard only to have the sea life also choose to ignore it."}
{"text":"I have eaten here 3 times now.  Each time, the owner has helped out at the cash register.  And, every time, the owner has been extraordinarily rude.  It's a shame because the sandwiches are quite good.  When met with such poor customer service, it far outshines the product that is being put out.  Due to this alone, I will never eat there again.  And, I will be certain to inform everyone I know of the way the owner talks to his customers."}
{"text":"Came here on Saturday(1/6/18) at 1 pm to find them closed and looks like out of business. Not a thing in their cases even. Website said open until 3pm, door said 2 pm but totally closed up. Another customer was there too trying to get in so I don't know if they are still in business or not. What gives???"}
{"text":"So many great sandwiches to choose from, I almost lost count. There's gotta be at least 30. The quality is very consistent. I ordered the \"Castle Gandolfo\" today. It comes with turkey, pastrami, marinated mushrooms, swiss, lettuce, tomato, oil and vinegar. Try ordering that at Subway. :) lol  I definitely recommend this place if you are in the Ahwatukee/Tempe area. Fresh quality ingredients, friendly service, and great tasting food. Here, you get what you pay for."}
{"text":"Still on the hunt for a decent sandwich place.  I used to live near the Gandalfo's in Bellingham, Washington, where the store was clean, the service was great, and the manager was a pleasure.  We were excited to see a Gandalfo's here in Tempe.  Walked in and stood at the counter for a few minutes before we ordered.  The guy who took our order didn't know the specials (and the sign is outside, so I kind of depended on him knowing them).. And neglected that a salad came with mine.  We took a photo of the \"salad\" from my husband's account--it was broccoli with a crapload of mayo and some chunks of cheese.  It was probably the most disgusting thing I've been served in a restaurant EVER.  They only had five salad options, and my usual broccoli bacon favourite wasn't available.  I'm pretty sure they would've even ruined that, so it's probably better they didn't have it.  Counter guy had a hard time maintaining eye contact and a difficult time taking our order and writing it down.  Surprisingly, it was almost accurate when we got our order--one of the sandwiches was wrong.  We decided not to stay and eat, since none of the tables were clean even though it was 2pm!  I'd hope that Gandalfo's corporate would want to save face a little and remove their name from the side of the building where this place has set up shop.  We used a Groupon, and even if they offered $20 for $1 I wouldn't go back."}
{"text":"One of the most reliable delivery services I've had the pleasure of using! I work right up the road and start at 6 AM so finding a good breakfast place that delivers was a Godsend already, then it turned out to be one of my favorite restaurants period. Their breakfast sandwiches are great and they have a variety of lunch sandwiches that will knock your socks off, I personally like the Double Play, The Crew, and The Meatball Hero. I've brought my girlfriend here during the weekend for breakfast and always recommend it"}
{"text":"My first time at Gandolfo's was good. I decided to eat here on a whim, originally wanting an egg salad sandwich, but decided a deli sandwich would do. The staff was incredibly friendly, which was awesome and will definitely make me come back again soon. Since it was my first time there,and they have lots of sandwich options, I asked a lot of questions and they answered each one of them with no resistance. After looking at the menu, I saw they did have an egg salad sandwich, though now I wish I would have ordered one of their best selling sandwiches. I was a little disappointed with my egg salad sandwich since it really only consisted of toasted sourdough bread and egg salad (I was hoping for some lettuce and tomatoes and cheese, but I may have just had to ask for it.)  Overall, I like this place a lot. They're reasonably priced, good portions, great first time experience. I'm excited to come back and order some of their more popular sandwiches and see if they are the real deal."}
{"text":"Heard about this place from my roommate and decided to try it out with a groupon. As I was making my order the store owner kept giving me dirty looks after I mentioned I was using a Groupon and seemed frustrated. The food was sub par but the customer service is really lacking. The quality of the food does not equal the service I received."}
{"text":"If you order takeout, be sure to check your sandwich before you leave.  I ordered the Rockefeller Reuben and when I got home and opened it up, I realized they left out most of the ingredients.  How can you make a classic like a Reuben sandwich and leave out the sauerkraut and also the swiss cheese?  I should have known better --- I've been disappointed at this location before. Overpriced and poorly made.  Who manages this place????"}
{"text":"I LOVE Gandolfo's! For breakfast or lunch, I'm never unhappy, just fat and extremely satisfied. Eric the owner is awesome & all the staff is friendly and works with me being a \"picky eater\". My faves: Eastport pastrami egg and cheese OR Brooklyn Bridge turkey and bacon sub"}
{"text":"Great deal great meal! Had Groupon and was pleasantly surprised. Wie had a half Mama Leone and only ate 3/4 LOVED IT I had corned beef on rye and it was EXCELLENT LOTS OF MEAT  Pickle spears very good. Not fancy but very good. Owner was there and tends to business.  I RECOMMEND"}
{"text":"I've made this a required trip at least once every couple weeks for lunch, delicious.  Everything is high quality... you're looking at $6.50 for a half sammich or $9.50 for a full (a -real- foot long) but holy crap is it worth it.  They have a ton of sandwich options, organized on the wall by meat.  Sooooo good!"}
{"text":"Slowest place ever. I ordered 25 minutes ago and I am still waiting. Just 2 sandwiches. Not rocket science. Then I get both sandwiches and they are both wrong. Wish I could give less than one star."}
{"text":"This is one of my favorite sandwich place to go to lunch when I am at work-lunch. Guys love the quality of meats, and quantity of meats. I love the hot cheesy sandwich.  The Yankees on rye is around $9.00 but it's one of a few items that I would eat until my stomach hurts. Give it a try!"}
{"text":"Tried Gandolfo's for the first time today.  Excellent sandwich.  Some co-workers and I gave it a try for the first time and we were very impressed!  We phoned in our order and had it picked up since they were busy and I can believe it.  i had the I Love NY sandwich and it was grilled perfectly!  It had corned beef, pastrami, swiss and your choice of Russian dressing or spicy mustard grilled on marbled rye bread.  I chose the spicy mustard since I never had Russian dressing, I didn't want to try it for the first time while trying Gandolfo's.The prices were fair and the food was delicious and filling.  My next sandwich on deck is a meatball on the hero roll.  I will definitely be a repeat customer.  Now if they only delivered?  Lord have mercy!"}
{"text":"We love Gandolfos! The urban cowboy is the best! Eric, the owner, is awesome. Ask him to go for a run some time."}
{"text":"Ah, the great combination of tasty sandwiches, fast service and walking distance from work.    I eat here maybe once a month or so, occasionally more often.  I have always been pleased with the sandwiches.  They have a wide selection, and are always generous with the meats, cheeses and toppings.  A few times they have had trouble going with wheat when the standard bread is white (yuck!)  Other than that, they always get any odd little requests (like replace the cheese with bacon) correct.    My biggest disappointment is with the sides.  They have a red potato salad that looks AMAZING.  I mean, my mouth starts watering as soon as I see it - with a nice creaminess and a some fresh dill.  Sadly, it's about as flavorful as their Styrofoam containers.  No taste at all.  Not even salt or pepper.  I can't remember what the other side I tried in the past was, but none of their prepped salads have done anything than break my heart.  I mean, how hard is it to ruin potatoes?    The soups are good, as flavorful as the sides are bland, nice and hearty.    It's a small, narrow place, but perfect for a quick bite on lunch, or a very casual dinner."}
{"text":"Update:  I had to knock them down a rating because they are closed today (Saturday) by 1pm. They are supposed to be open but no explanation as to why they are closed. The food here is good but that's about it. This place is irritating now.   Original post: I'll first say that I love the food. I ordered the Carnegie Hall and it was out of this world. My complaint is around how all of these delis, restaurants, and fast-serve counter  places all feel the need to ask you if you want to tip when you make a credit transaction. I order food, pay you money, and you hand me food. That's how a transaction works. You didn't \"wow\" me...and I haven't even tasted the sandwich yet to know if it was even made good. Why do all these places need to make you feel awkward about tipping? Yes, I could elect \"no\", but you're already making this awkward for no reason. And the WORST part about this place is the lowest tip amount they offer you is 15%.   15% for taking your order and handing you food. This movement towards tipping for people not waiting on you hand-and-foot needs to stop. You're doing your job. That's it."}
{"text":"This place is around the corner from my apartment and right next to a Jimmy John's. I was on may way there when I decided,to give Gandolfo's a try. It took me 10 minutes to read and re-read the menu because everything sounded great. I finally decided on the Carnegie Hall with pastrami and both spicy mustard and Russian dressing. Only took a few minutes to prepare and I was back home enjoying it in a few minutes. I will defiantly be back to try more of these sandwiches."}
{"text":"A New York style sandwich shop with a huge menu. Great mix of hot and cold sandwiches. Their pastrami is delicious. A couple of my favorites are the Harlem for breakfast, which is served all day. And the Taxi Driver, hot pastrami sandwich with grilled onions and jalapeños. Woo!"}
{"text":"The pros: Excellent food, good customer service. I have eaten at Gandolfo's three times now, and they consistently use high quality breads, cheeses, and meats.   The Cons: The drink options are lacking and the potato salad is awful. Other than that, they are excellent.   Overall, I would bring my friends and family here for lunch."}
{"text":"My brother and I used to come here once a week for pastrami sandwiches. He will still go once and a while, but I have since stopped going to Gandaolfo's. Last time I was there I had a really poor customer service experience. I went in around lunch time. The place was empty. There was a guy and a girl working. The guy (Glasses and tattoos) was cleaning the microwaves. When he looks up and sees that I ( a customer of all things) walked in he says \"Oh, great...\" and continues to clean the microwave. The girl was washing dishes or something. She asked if she should take my order and the guy has her continue to wash dishes. He continues to clean the microwave. He doesn't greet me. I'm standing there waiting at the register. It was as if he wanted me to leave. I started to clear my throat and he finally has the girl come over and take my order. The girl was polite and took my order. She gave my order to the dude and he did not look happy that he had to soil his counter by making me a sandwich. He makes my sandwich while grunting and moaning and rolling his eyes. I go to the drink counter to fill my drinks. Both ice tea bins are barren and empty. Is this place still in business? I finally get my order and I leave without tipping. And I always tip. That was the last time I've been there. I love pastrami, but am willing to go without because of that rude experience. Get it together owners. Fire this kid and train your people better. You lost another customer."}
{"text":"I came here a few months ago, and wasn't impressed.  The menu is huge - the print is very tiny on the menu up behind the counter. I ordered the egg salad sandwich not toasted. They toasted it, and it just wasn't anything special. It wasn't bad, but I could have made a better sandwich myself. Probably won't be going back."}
{"text":"Wanted to try something new.  So i got a Groupon  to try out the sandwiches. Ordered a Staten Island (chicken) & The Taxi Driver  (pastrami). They were both really good, but the Taxi Driver was my favorite.  Cannot wait to come back and try it out again."}
{"text":"I have only been here twice but so far so good. My husband got the picnic hotdog and I got the Big Apple sandwhich hot. The food was super yummy. Messy but good! Everyone I have encountered in both trips have been super nice. The only reason they are nit getting a 5 star is my second trip I ordered the picnic dog and this time the potato salad had HUGE chunks of potato. Big enough that I would take two bites out a piece. Kind of doesnt go well with the hotdogs when it is that big. I don't remember my husbands being like that but I could be wrong. Overall this place is wonderful."}
{"text":"First time!!  Had the Urban Cowboy, it was amazing and wonderful customer service too!!!"}
{"text":"I to bought this on a Groupon I came a few times but they close early which is fine they have their own hours they're not evening restaurants are just a daytime restaurant. I ordered pastrami dog and a Reuben sandwich and they were very good I was impressed with the service and the people here are dedicated to what they do I'd say it's very much a New York deli and I really like the restaurant     I would agree however there's not much personality hear everyone's just a worker bee I went to tell the manager I like to's restaurant and the service and the food he could care less. Maybe they should consider a personality frontline person but definitely would go back it's all about the food"}
{"text":"What a fantastic sandwich shop!  I bought the full Knuckle Sandwich and it was absolutely delicious! It wasn't too dry or too wet, it was just right. It had plenty of meats and other toppings. I went at lunch time and they were very busy. They were patient with my wife and me as we decided on our order.  I would definitely eat there again."}
{"text":"This was my first time trying Gandolfo's and I loved it!   I ordered the Urban Cowboy: Chicken breast, turkey, bacon, pepper jack, cream cheese, lettuce, tomato, bbq sauce and mayo   It was so delicious. I can definitely see myself craving this sandwich and having to come back in the next couple of weeks.   It was pretty pricey but there is a groupon for it right now so check it out!"}
{"text":"I've been here many times to grab breakfast before work. Owner is a friendly guy whom works extremely hard (he does deliveries himself a lot). Food is delicious and prices are certainly fair. If you're looking for a cool, local joint for a quick bite, this place is it! Stop in and try it out!   Side note- first time I came here the owner gave me free cookies because it was my first time in."}
{"text":"So the look of the place does not remind me of NY, the sandwich names are familiar places, but not the names used in NY, but the taste is on point.   I just finished a Riverhead on toasted roll w/jalepenos, I'd call it the Bodega Special, closed my eyes and I was back in Brooklyn. Mmmm, sooo good."}
{"text":"Groupon: Fail. New York: Fail. Deli: Fail. I am pretty sure most New Yorkers would try this place an tell you to Fugeddaboutit and leave it at that but a yelper shares.  I judge a deli on a few things: the meat, the bread, the sides. Being jewish and from the east coast I hold \"new york\" deli's to a higher standard and judge them on corned beef/pastrami, potato salad, rye bread and pickles. You get those right you have a happy camper, wrong and i'm cranky. I got the I Love New York which is Corned Beef and Pastrami with Swiss and spicy mustard on Rye, probably my favorite sandwich and potato salad anda  kosher pickle.  Lets start with the main course it was fair and that is being very favorable. The meats were a bit overcooked but nice and hot and had decent flavored and the pastrami had a good amount of pepper to it (which i like). However it was very greasy and soaked the bread and made it slick...not good. The bread itself wasn't bad just generic rye you would buy on the shelf at any grocery. There also wasn't enough mustard on it or much meat probably double the bread to meat on a $9 sandwich. Compared to Chompies where its a nice thin slice of rye and piles of meat. Overall edible but not that enjoyable.  Now the sides where I decided this place struck out like A-rod in the playoff's. I have never had potato salad that was so bland. I am normally not a huge fan of white potato salad but i do enjoy it. This was probably less exciting to my taste buds than a baked potato with no toppings. I tried dumping on pepper to no avail. Next was the pickle which was a whole \"kosher dill\" and from a new york deli i expect something a bit more more than vlassic out of a jar but that is exactly what i got.  For the money (and for the record i spent $2 on the groupon) this place just doesn't cut the mustard (pun intended). Better options exists for this stuff like Chompies or Goldman's Deli up in scottsdale."}
{"text":"I finally made my way to Gandofo's for lunch last week after hearing rave reviews from my boyfriend.  We missed the lunch rush, arriving at 1pm, so the service was pretty quick.  I agree that the menu was a bit overwhelming, being it my first time there and all, but after analyzing the options I chose the Brooklyn Bridge.    On a side note...there were certainly some interesting combinations, such as roast beef+pepperoni+pepperjack cheese+BBQ sauce+butter+mayo.  Not for me, but I suppose New Yorkers are much less picky than me.  So getting back to my sandwich....service was quick like I said, no complaints there.  The sandwich, well....it was ok.  The bread was really good, definitely a step up from Subway, but it completely overpowered the sandwich.  I don't know if my particular sandwich came with less meat, or if the assembly line had a light hand, but I was definitely left with a bread sandwich with a side of meat.  Plus the \"veggies\" consisted of a small amount of shredded lettuce with one half slice of tomato.  I LOVE veggies on my sandwich, so this really disappointed me.  So to recap: I'd come again, but apparently would have to pay for \"extra meat\" and would definitely make a special request for extra veggies.  I think I would choose the big \"S\" over this place though, if simply for the variety of veggies available."}
{"text":"Today. I stopped in & picked up lunch from here to take home. It was my first time trying Gandolfo's. Mike has had it many times & loves their food. He had the I  New York sandwich with Nacho Cheese Doritos & a large Diet Pepsi. I had the 6-inch Brooklynn Bridge  & it was very delicious! Accompanied it with a bag of Nacho Cheese Doritos & a large Sierra Mist. I really enjoyed my meal & would definitely order this sandwich...& from this place...again!  The ONLY drawback? They serve Pepsi products...I'm a Coke girl...so that was the only strike against them.  If you love delicatessen sandwiches & meals, Gandolfo's is the place for you. If you haven't been there before, give them a try!"}
{"text":"Love it. Had a Gandolfo. Lots of flavor, quality was great! They even offered a wheat roll."}
{"text":"Save your money. One of the worst eating experiences ever. Do not order chicken cutlet or pastrami. Take the extra 10 minutes and go to Chompies or anywhere else"}
{"text":"The Hampton was one of the best sandwiches I have ever had. The bread and meat were so fresh and delicious. I am definitely going to order from here more often."}
{"text":"Great sammiches, the lady who took our order was nice and the food was made super quickly. Also the Egg salad was pretty good."}
{"text":"Disappointed! Like any New York Deli the pastrami sandwich was load with meat but before I even took a bite they lost me as a customer! They heated the pastrami up in a microwave, I think that's actually a felony in New York! Definitely not a New York Deli! Just a sandwich shop."}
{"text":"Friend and I were headed to work and she suggested Gandolfo's for breakfast, now I love little deli shops and was up to trying something new. So off to Gandolfo's I went, already knew what we were ordering so I just ordered when I got there, after I did that I looked up at the menu on the wall and thought dang I need to come back sometime and try a sandwich for lunch. I told the owner this is my 1st time here, he looked shocked and said how did you know what you wanted to ordered, just figured you to be a regular,  I told him I did research before I got there. Too funny.   Got the Huevos Locos, which is sausage, eggs, pepper jack cheese, and salsa on a roll. OMG it was soo dang good!!!!  I saw they have a sandwich called the Rockefeller Ruben, that has corned beef or pastrami on it and its been calling my name, got to try it out soon!!!!"}
{"text":"Sandwich was blah. Not bad. Not at all good. Music was loud, the lady was singing along loudly and poorly, and gave me attitude when I was asking simple questions. I doubt this is anything like a sandwich from New York."}
{"text":"I wanted to like it as a native new yorker but goddam this place employs the most personality deprived people they  can find,  which is so not NY. I thought the first time was a fluke but no.  No greeting, no goodbye every time. Order 2, 11$ sandwiches  and they're out of pickles...no substitute offered. It's 1pm and  they're also  out of grilled chicken.  Dude it's a DELI. What the hell?  It also dirty as heck in here. The tables, the floors, under the counter. Gah im grossed out.  Take some pride in your establishment ffs."}
{"text":"I ordered the Rockefeller Reuben and as always it was fresh, hot, and amazingly delicious. The team working seemed to get to my order right away and I received my food within 5 minutes of ordering! Great sandwich, great Service, what else can you ask for?!!"}
{"text":"I have had a good sandwich once at this place, so I went once again despite the high price for a sandwich (a whole sandwich is almost $11- tried to check on the menu later for exact amount, but prices aren't listed).  Ordered 4 sandwiches- it was slow, there was nobody else in line, just a few customers finishing there lunch).  All 4 sandwiches were reubens- 3 were with russian dressing, one was with spicy mustard. On 2 of the sandwiches they added spicy mustard instead of russian dressing- which changes the taste of reuben.  They first told us they were out of corned beef and only had pastrami.  Ok, we got the pastrami, then they said only we only have enough to do 3 sandwiches- then they said oh, wait we have more.  This was on a Friday, they said manager was not due back until Monday.  You claim to be NY Deli, but you are out of corned beef, and running out of pastrami??  Oh, and the sad part was the meat on our sandwiches was not pastrami, it tasted like corned beef- there was no spice to it as in pastrami.  Unfortunately, these were to go, so could return them given where I live- besides manager off the whole weekend anyway.  Overpriced and inconsistent."}
{"text":"First time here today, selections are great portions are large and based on my Pastrami sandwich the quality is top notch, yet at a fair price. So many sandwiches on the menu look good, it will take quite a few trips back to try them all"}
{"text":"WOW!! Working near Gandolpho's I was a fan a couple years ago. The last 3 times I have visited this place has gone from great....straight to okay...now to would not recommend!! 2 years ago when I wrote the review they were open for dinner hours....now they close at 4pm and closed weekend! The new owners/management had taken it straight to the toilet!! The food portions are half the size on the subs....the management is HORRIBLE...and the customer service dropped to RUDE! I got a sub a couple weeks ago and the person who took my order was very negative....not happy about having to write down my requests to delete tomato/onion and was clearly upset I was there at 345pm and they closed at 4! I figured it was near closing and they were cleaning up...due to they had already wrapped the salads in the display and had all the meats/etc out on counter wrapping them.... soooo.... decided to give it another chance Monday at 11:30 lunch time!     It was the WORST experience EVER!! The older man (who I assume is owner/manager) was SOOO RUDE I was amazed! Not just to me, but to the man who ordered before me and even the poor young girls and guy who were making sandwiches!! He was too busy unpacking a box when the gentleman ordered in front of me to help him.... he came over with big attitude and tried to work the register and YELLED at the poor girl in the back to get out there NOW!! She came out with a scared look on her face and he pointed to help make sandwiches. Then he hollered at the older woman there to get to counter and take my order.... he got on the phone (right on counter) and was very rude to caller too! When I asked for just what I wanted on sandwich he corrected me and told me \"What do you NOT want on your sandwich!) I was caught off guard and redid my order without the 5 things I didn't want (coz I only wanted the meat/cheese and lettuce) and she proceeded to write them down. He actually ROLLED his eyes and went back to unpacking his box!! I was just AMAZED how horrible the service was, the tables were dirty, and after all that they STILL PUT ONION on my sandwich!!      The potato salad is STILL good but I will never go in there again with a competing sandwich shop two doors down! I work for a HUGE call center around the corner and my bestie works for a HUGE call center right behind there and both of us posted notices on the \"do not visit this business\" reviews on our co-workers boards! ... that is how bad it is! No wonder they now close at 4pm....it was a HORRIBLE EXPERIENCE and I gave it three strikes before it is now OUT of my choices of lunch! :)"}
{"text":"I have gone to this place for years, it is soo awesome! It's the only place in the valley where you can get a real egg (not microwaved) sandwich! I am sure people on here complain about the wait time but waiting for food means you are getting good, real food! The wait is worth the NY style deliciousness!!"}
{"text":"Great sandwiches and great variety!  Breakfast and lunch. Probably wanna try n stay away from the salads as it's not always fresh produce."}
{"text":"This place isn't bad but it's not great especially for the prices they charge. What really brings this place down is is employees and management! The girl at the register is beyond slow and if she could go any slower she would be going backwards. The manager is just an ass he argued with my employees I sent to get lunch over trivial stuff. The food as I said is Ok but for the price I would expect much more. If you use a Groupon there watch out the manager gets annoyed and starts arguments. If you order ahead of time you're food might be ready and you won't have to feel like a sardine in the small cramped building. I would recommend going elsewhere unless you make money like Donald Trump and have the patience of a monk."}
{"text":"If you want a filling, delicious sandwich come here! Best hot sandwich I've had in a long time. Missing the east coast? This place is the bees fucking knees when it comes to hot deli sandwiches. I get the taxi driver! It has everything plus those jalapeños just give the mustard that kick it needs to send you back for more. Plus! The guys are so sweet and always wrap your sandwich so it's not completely all over the place. Keep up the good work boys !"}
{"text":"The sandwich that I had was great! It was the Italian one, and I got it toasted. So yummy!"}
{"text":"To all the people bitching and moaning that the place isn't pretty or that their sandwich was not grilled before their eyes to their exact specifications... It's a DELI not THE W! Take your bourgie business elsewhere, you're getting pretentious all over my delicious sandwich. Fresh, delicious bread; quality and flavorful meats; and just the right amount of condiments. You will not find a dry or drowned sandwich in the place (unlike subway, whose sandwiches swim in mayonnaise). If you come here expecting the Royal treatment, don't come here. But if you come here expecting a delicious 'wich, welcome home!"}
{"text":"The sandwiches are great!! Like some of the other reviews the sides and also the cookies are better left alone. I always have a hard time picking something off the menu cause it's so big. I don't have a favorite yet, but I have ordered the Shea stadium the most.  The sandwich makers are OK, some what friendly but for the most part don't talk very much.  The other day we went in for some food and the TV. was blaring a sports game so loud we really had a hard time hearing each other.  Good thing the man behind the counter noticed this after a little bit and turned it down with out anyone asking to do so.  The bathrooms are OK and the seating isn't the best.  I think I'm going to have to try all the subs before I find my favorite or just have like 6 or 7 favorites."}
{"text":"One of the better breakfast sandwiches in the valley! You can get it your way and it is big. The crew is my go to. Have been grabbing these for over a decade from this spot."}
{"text":"I have been to Gandolfo's a few times and the sandwiches were always good... I have ordered the Knuckle Sandwich (Pastrami, Marinated mushrooms, olives, cheddar, mozzarella, parmesan, lettuce, tomato, mayo, butter, olive oil on sour dough bread) It was really good a huge sandwich.... Another time I went with the King of Queens(Pastrami, swiss, cole slaw, tomato, & Russian dressing on a kaiser roll) I would not go out of my way to try this spot but I would give it a try if you're in that part of town."}
{"text":"If you are looking for a classic deli in Phoenix this is it. Service is good and the sandwiches are excellent. I get the knuckle sandwich every time and usually inhale it in about 3 minutes flat."}
{"text":"Best sandwiches I've had. I like the Rockefeller Reuben with pastrami (you have a, choice of that or corned beef) with Russian dressing. But they close at 4 and only delivery to businesses who make large orders."}
{"text":"Few places live up to to the good expectations but Eric and Gandolfo's is one of these.  The rolls and rye are fantastic - pastrami is outstanding especially on my favorite sandwich - The King of Queens."}
{"text":"Decent sandwiches with large portions.  They have a lot of different sandwiches to choose from, and I like how some of them come with ingredients that you wouldn't find at your everyday Subway or Jimmy John's, like marinated mushrooms.  I've been here a few times and if I am hungry enough, would like to try their massive Dagwood!"}
{"text":"Friend and I popped in here by recommendation from another friend. Staff was friendly, they ran out of rye bread for the Pastrami sandwich (we both ordered one and only one left)  but in the end it worked out great.  Food was excellent couldn't of asked for more."}
{"text":"Very poor service, i just called in today and tried to make an order for pick up and the guy got my order wrong and all i said was \"uh no\" and he hung up the phone on me very rudely and said \"hes not going to be treated like that\" i was just correcting his mistake. i order here at least once a week and now i will never ever order from here again."}
{"text":"yet another groupon try...  They have a HUGE menu, which excited me greatly, upon first gaze, however the results weren't so great. I had the Mama Leone. The bread was kinda gummy, the meats were ok, but there sure wasn't much to this sandwich.. it was supposed to be hot, but it was just lukewarm, and the marinara sauce was also cold. Yuck.  Also, the Little Italy Salad was served not-as-described by the menu (they didn't include croutons, or onions.. it was just lettuce, tomatoes, and meat. that's it!).  Finally, the dining area is cluttered, and needs to be de-crumbed."}
{"text":"Try serving this food to a Jewish person and watch them laugh at you and throw it in the trash. This \"Jewish deli\" food is awful. Their house made chicken soup tastes like it came straight out of a can and youre quick to find out why. Here's a newsflash, when you make soup with canned chicken you've already failed. Gross. The \"I Love New York\" sandwich should be renamed \"I've Never Been To New York and Have No Idea What This Should Taste Like\". It was a hot, greasy mess. The \"house made rye\" was tasty but that's about it. I asked them what kind of meat they used, house made, Boars Head,etc, the kid tells me it's Sysco. Not appetizing that it's basically cheap industrialized lunch meat.  Listen people if you want to eat a real NY deli sandwich do not eat in this sad sham of a deli, go to Chompies or Miracle Mile and eat real quality deli food for the same price. Canned chicken in the chicken noodle soup?  That's just shameful. $11 wasted."}
{"text":"My dad would eat here for lunch every day of his visit if he could.  We got him a Groupon as a present, and that makes two visits this trip, which is one less than the last visit.  There's a huge selection of sandwiches.  We like the Knuckle Sandwich best.  The sides are also good.   I'm sure I'll be back a few times once my dad returns for a visit."}
{"text":"Loved the New York decor. Pretty sure the owner was working the cash register(you could tell he's from NY), there was around 100 things on the menu. For a sandwich joint I think that's a little much, so it took me a few minutes to decide. Food was so-so it would of been a lot better if the \"grade\" of meat was better. The owner also didn't seam to happy, I mean c'mon man! If your gonna have your own business love it! Don't look like your gonna kill the next person who orders a sandwich."}
{"text":"I have been a frequent customer since 2008 and must say I am never disappointed with the quality or quantity of food.  My diet has changed over time and I'm actually hitting this place up for breakfast more frequently of late.  Again, I'm more than satisfied with the friendly service, quality and quantity of food.  For $1, the Gandolfo's bracelet gets you a special deal every day for no additional charge.  My advice, COMPLETELY IGNORE the Jimmy John's right by it.  This place is the real deal and you'll get far more food for the $$$ AND unlike Jimmy Johns, they are open for breakfast.  I'd actually consider my review more of a 4.5 as it is an awesome lunch destination.  Funny thing about it, some of the places with the best food are so small there is hardly any room to sit but being that I work within a couple of blocks, walking on down and taking one to go always works."}
{"text":"I've gone here since I started working next door at Ricoh. This is the first time I was not able to order anything. The kid on the register was very slow and chatty with the guy in front of me in line to the point that I had to go to the sandwich place next door just so I had time during my lunch to actually eat."}
{"text":"Went back with some friends and found the quality has just deteriorated for some reason. First off the place is only open 8-6 Monday - Saturday. Seems like a really silly schedule but hey, it's not mine to set. We arrived and ordered a total of four sandwiches, all of which were very messy and just not put together well. On the two hot sandwiches my friend observed them putting the cold veggies on, THEN putting the sandwiches in the microwave, toaster oven, etc. Maybe that is protocol, maybe not. It shouldn't be.  Out of the four sandwiches we ate one or one and a half. Very expensive for sandwiches that are going to the trash. Leaving two stars in hopes that there is a glimmer of hope left at this place. Could be overly optimistic."}
{"text":"The sandwiches are good but what is with the high volume place with the 5 tables? This is a frightening trend. If you  sit along the west wall,  the view during lunch is a gallery of Butts.... I'm sorry but i don't like butts with my sub sandwiches. The dagwood is very good. Oh and just say no to the microwave. I hate that machine!   They had one on University in Tempe with more room but it didn't make it. That is all."}
{"text":"Hello again my fellow Arizonians....  I am back and ready to review GANDOLFOS Deli........  I will start by saying the Pastrami is pretty darn good!    The meat is seasoned well and does have that NY Pastrami taste.....however..... (and I know you knew that was coming)....  The price for the amount of meat they give is just ridiculous!  I have read the reviews and if I had a groupon maybe I would have been less dissapointed.  Ok, a plain ole pastrami sandwich on their marble rye...which I must point out is NOTHING like good NY rye...the bread is thick and really tastes very little like rye... is $10.00.... and is supposed to be served with a pickle slice....didnt happen!  I can only compare it to other local deli's such as Chompies, who charges the same price but the same sandwich but has twice as much meat.  A REAL N.Y pastrami or corned beef sandwich is so thick with meat you can barely bite into it and just half a sandwich satisfies the biggest of appetites.  The experience started with a call to the restaurant to request they fax a menu which they were unable to do.  The young man I spoke with was not too helpful or friendly.  I had to ask 3 times..... How much is a plain ole Pastrami sandwich....  I asked if the cole slaw, which not included, was creamy or more vinegary...he didnt know how to answer that....  am I asking a strange question here?  This is supposed to be a deli....cole slaw is typical deli fare.... if I ask what kind...tell me, describe it to me... I am not there and cannot see it, nor did I have access to the internet to look.  Several of us from work ordered together and none of us got our \"complimentary\" pickle slice nor did they include the other condiments we requested.  We're talking 10 bucks for a regular sandwich....I deserve the darn pickle! lol  I didnt bother to call and have a little chat as the person who had the priviledge of picking up the order mentioned the \"old man\" we are guessing the owner? Was a grump and not the friendliest of people....so..... here I am, sharing my experience with others.  I do not mind paying $10.00 for a sandwich but that sandwich better be packed with meat....or 14k gold shavings!  Ok, maybe it was lunch time and busy....or maybe someone was in a bad mood...or maybe the young kid just started and simply wasent fimilar with their product.... I dont know, nor do I care .....  I am not getting what I paid for and that SUCKS!  So here's the 25 thousand dollar question....will I return?  Nope...not a chance!    I can get around the unfriendly employees and the lack of knowledge of their own menu but I will NOT pay $10.00 for a sandwich with 1/2 the meat that should be there.....  I will find another good pastrami sandwich or I will wait until I visit New York again.  There may be some die hard Pastrami lovers out there who simply must have good pastrami regardless of price and to them I say... \"go for it\".  But not this girl!  I feel I should get what I pay for and this was NOT worth the price!  Again, I can only compare it to other Deli's here in the Phoenix area or since they advertise it to be \"NY pastrami\" I compare it to a Pastrami sandwich you get in ANY N.Y deli and GANDOLFO's looses.  So, with that being said...give it a try and see what you think.....and until you do.....  Bon Appetite'"}
{"text":"My husband and I were on our way to the Tempe Sports Complex to play in my work softball tournament and needed to find a place to get a fast, hearty, and affordable lunch. We had originally planned to go to the Mongolian BBQ place nearby (called YC's, I think) but pulled in and realized that it would probably take too long to do the whole pick your meats, veggies, and sauce thing (we only had 20 minutes or so to get lunch and get to the field). That was when we spotted Gandolfo's and decided to give it a try.   The menu was huge and really overwhelming, especially since we were in a hurry, but we both just picked something and ordered. He chose the New Yorker (roast beef sandwich served hot with pepper jack, feta, lettuce, tomato, onion, pepperoncini, butter, mayo, and oil and vinegar) and I got the Knickerbocker (which had roast beef, provolone, lettuce, tomato, onion, mayo, oil & vinegar, and salt & pepper) served hot.   After we paid, we ended up waiting quite a while for our sandwiches  to be prepared, especially given how few people were inside. I probably wouldn't return during a weekday lunch knowing that it's not super-speedy. If you are planning to go there for lunch, make sure it's on a day where you don't need to grab your food and be back ASAP. Maybe calling ahead would help in that case.   Also, even though the sandwiches were definitely satisfying,  they weren't outstanding. My husband, who's originally from New Jersey, didn't think the sandwiches were nearly as good as ones he's had on the East Coast. And, yes, I know we're in Phoenix, but the restaurant (which is a chain, btw) has chosen to call itself \"New York Delicatessen,\" which in all fairness, can raise a customer's expectations! I also thought the regular size of the sandwich was a bit small. If you are a big eater, I would definitely get the large. Lest you think all I have to say about Gandolfo's sandwiches is negative, I will spend a second praising the hero roll the sandwiches came on, which was freshly baked and super satisfying.   I would definitely eat at Gandolfo's again if I were in the area and had time to wait for a sandwich, but I'm unlikely to go out of my way for it."}
{"text":"You want a monster sandwich that will challenge the hunger of even the burliest man? Go order a Dagwood from Gandolfo's deli. It's roast beef, turkey, ham, pastrami, swiss, cheddar, lettuce, tomato, onion, pickles, mayo, spicy mustard, salt and pepper, as close to nirvana as I'm ever getting. (In case you couldn't tell by the ingredients, I was a little indecisive about what kind of sandwich I wanted, so I just took the works.)  During lunch it can get a little hairy in Gandolfo's deli, and I'm not talking about the number of people there (which is many) but the ratio of males to females (which is very high, me being the only customer lacking a y chromosome). There is a reason why this is so. These sandwiches are monstrous meat and cheese concoctions slathered in sauce and served big. I could easily make a phallic reference about all these men consuming massive hoagies, but I'm going to take the high road this review.  I was considering the hard salami smothered in sauce, but I didn't know if it would be filling enough...  Okay. So the low road suits me better.   I opted for the $2.49 meal deal to complement my Dagwood, which left me with a gigantic sandwich, a quarter pound of potato salad, and a regular iced tea with plenty left over for dinner that night. It was close to ten bucks after tax, which is a little bit on the pricey side, but at least I made two meals of it.   The potato salad was decent but lacked salt, like they didn't bother boiling the potatoes with this necessary ingredient. I love me some salt. Get me a lick and I'll take a cheese grater to it to season my meals. Or make me a salt flavored ring pop for those mid day cravings. My blood pressure will curse you, but I'll be singing your praises. After adding this magic ingredient Gandolfo's potato salad got pretty good, and they get extra credit for using red potatoes, leaving the skin on, and preparing it with vinaigrette and mayo instead of mustard. Yum!  It's pretty decent for a sandwich shop and the menu is intimidating in size and offerings. You could do much worse *coughBlimpie'scough*, so give it a whirl if you find yourself in the area."}
{"text":"This was by far the worst egg and cheese sandwich I ever had  Gross bun is like a soggy hamburger bun which was all mushy like dough .....Not a newyork style role ...I know I'm from newyork  Nasty nasty nasty"}
{"text":"No Soup -- In a \"New York Delicatessen?!\"  Jersey guy first time in Arizona, in January, and my friend is sick. So, I call them up and ask if they have matzo ball or chicken soup on the menu to take her; and the lady said \"we don't serve soup.\"  Even the Italian delis in South Philly always have chicken soup. Oy vey!  Dan Schwartz Cherry Hill Mall, NJ"}
{"text":"I quite enjoy this place! I work right behind it so I go here alot. I mean really ALOT. Since September I have received 3 free sandwhiches! (Buy 9 get the 10th free) The King of Queens and the Bronx Barbecue (without butter) are my absolute favorites, but everything I have tried there is really good! It could be $1 or so cheaper per sandwich.  Its always dead when I go there though, I hope Jimmy John's doesn't put them out of business! (there's a new jimmy johns opening in the old quiznos space in the building right next to Gandolfo's)"}
{"text":"Normal lunch spot for me as it is only walking distance from my job.  But the food is great!"}
{"text":"Not run well at all. Ordering process was a joke. I ordered 1/2 soup and sandwhich and i got a whole sandwhich with some cold mac and cheese. Most people had to reorder whem their ticket came up. Complete mess. As for the food, I was hungry,  I ate it. I'd give all the other a pass if the food was good.  I feel robbed."}
{"text":"The food deserves five stars, but the customer service could use some work. The employee I spoke with was snarky and rude, especially when I asked clarifying questions in regards to the cost of delivery. I explained to him I had a Groupon. He quickly cut me off and ranted about how Groupons can't be used for delivery then proceeded to try to explain to me what \"Dine-in\" means like I'm a farm animal from another planet. I politely said I would pay with card and still tipped him. He texted me after saying \"I wanted to apologize for being quick on the phone.\" What he meant to say was \"I want to apologize for being rude and belittling you.\"  I will still go there for the food, but will not recommend to anyone else."}
{"text":"This place was catered to my office today with sandwiches, salad, and dessert. Food was wonderful! The owner made the delivery and was very pleasant and a pleasure to chat with."}
{"text":"We had a Groupon and went over for lunch.  Had the Holland Tunnel and NY Liberty.  Delicious,full of meat and flavor.  Sandwiches are a bit pricey but really loaded and filling.  Service was good and the place was clean."}
{"text":"I drove 15 miles to this place only to arrive to locked doors and a 2pm close time when their hours on every website ever say a 4pm close time.  I'm really tired of restaurants being too lazy to update their publicly posted hours.  If you can't bother to manage your business, you don't deserve mine.  Never again."}
{"text":"So I was superrrr hungry and craving a delicious deli sandwich , I found this place on groupon so decided to try it out . When getting there I noticed the place just felt dirty and half assed.   The service was cold and also half assed .  Watching them make my sandwich pained me they slapped some meat onto some bread and shoved it in a MICROWAVE! There was a perfectly good grill sitting there but wasn't turned on. As I was waiting for my sandwich a guy came in saw how there process of microwaving a sandwich was and literally walked rite out.  So I just now finished my sandwich and it wasn't the worst thing I've ever had but it was pretty close , it was soggy and mushed together. I've been in the food industry for years and who ever owns this restaurant must not really care about delicious quality food. When leaving the place I asked the guy behind the counter why they microwaved there sandwiches and he said it's quicker than a grill. If I wanted a quick half assed sandwich I would have gone to McDonald's ! This place has potential but whoever runs it dosent give a flying crap . I've never been so annoyed or given a place one star in my life . This place deserved it !!"}
{"text":"The food is very well made. There is a great selection of sandwiches. The only place I have been to that gives chips for free with the sandwiches!!! Not to forget to mention The bread is quite soft :)    The customer service was great. They are friendly and the quick with their services.   I will definitely be returning to this business!"}
{"text":"So disgusted!bit into my sandwich and pulled part of a plastic packaging out! So gross,what else could be in this. I want my $10 back and thinking of calling the health department."}
{"text":"I'm from NY... this place is the farthest thing from an authentic NY Deli. I was sooo disappointed! Over priced AND awful meat quality. I threw my sandwich away, it was disgusting! You can't just throw bad sandwich meat on a hoagie roll and call it a NY Deli sandwich. Save your money and go somewhere else. Even jimmy johns is better than this place (and that's saying a lot)"}
{"text":"Ordered the I love new York sandwhich on a bun because I am not a rye bread fan.  2 people in front of had already ordered and I waited 10 minutes for my food.  Meat was tasty, wish I knew where they got it from.  In order to have a decent sandwich I ordered double meet.  Total cost was over $11.00.  Still looking for a true Jewish deli in phoenix.  One that does their own meats would be great.  Gandolfo's is not my idea of a deli.  Not that bad sandwich shop yes but not a deli!  .l"}
{"text":"Decided to try gandolfo's out because I got a coupon for a free 1/2 sandwich, salad, and drink plus I love a good deli.  Unfortunately I wasn't able to order my favorite, hot pastrami, cause that only comes in a full sandwich. However, they did have tons of options. So I went with the Brooklyn Bridge which consists of turkey, bacon, lettuce, provolone, salt and pepper on a hero roll.  They did a good job of packing the sandwich and actually cooking the Bacon instead of some disgusting boiled flab of fat that you see at fast food places. Gonna eventually go back and get a pastrami so we'll see if that holds up."}
{"text":"This is NOT a Subway or Quiznos (they don't serve plastic, manufactured sandwhiches, if you know what I mean...).....They have a multitude of sandwhiches to choose from, both hot and cold. A full sandwhich is 12 inches, a half is 6 (der...)   I got a veggie sandwhich, as I wasn't in the mood for meat (why did I come here then? my hubby, of course!) It was pretty good! It came with cucumbers, avocado, lettuce, tomato, onion,banana peppers, spicy mayo...I liked it!  My husband enjoyed every bite of his....he got the Little Italy..  We are both happy to have found a great sandwhich place where we can both find something delish to eat!  Only suggestion: it would be nice if they had more a selection of drinks....like Jones Sodas or something like that....  Not as good as Defalcos, but, a nice breath of fresh air for the area!"}
