{"text":"Unser Kurzurlaub im bayrischen Wald führte uns zum Dimpfl Stadl nach Lam.
Wir hatten eine wunderschöne sehr große Ferienwohnung (120 qm) für 35 EUR am Tag.Für das reichhalltige und schmackhafte Frühstücksbuffet wurden pro Person und Tag 5 EUR berechnet.
Zum Abendessen waren wir immer dort.Die Preise sind wie bei uns in Franken (zumindest beim Essen)relativ günstig.
Alle Essen die wir hatten waren schmackhaft und reichlich
Eine Apfelschorrle 0.40 l wird mit 2.60 EUR berechnet,Der Russe mit 0.50 l mit 2,60 EUR.
Zum Essen hatten wir wärend der 3 Tage:
Kartoffelsuppe 2.20 EUR, Leberknödelsuppe 2.20 EUR,Krautwickel mit Bratkartoffel 5.80 EUR,Rumpsteak waidla Art ( mit Speck und Röstzwiebel) und Bratkartoffel 12.50EUR,Haxentellen vom Kalb und Schwein mit Semmelkloß und Sauerkraut 7,50 EUR , Spanferkel mit Kloß und Sauerkraut7,50, hausgem.Kaiserschmarrn 5.20 EUR, Fitnessteller (Salatteller mit gebratenen Putenstreifen 8,50 EUR, Putenbrust in Currysoße und Reis 9,50 EUR
Zu fast allen Gerichten gab es einen Salat vom Buffet.


 Der Service wurde von einer freundlichen Dame in leichten Osteuropäischen Dialekt gut erledigt.Da Sie alleine die Tische im Lokal und im Biergarten erledigte kam es manchmal zu etwas Wartezeiten beim. Gertränkenachschub.Aber wir waren ja im Urlaub und hatten Zeit.
Der Chef des Hauses Alois Lemberger kam auch öfters vorbei um nach dem Rechten zu schauen und um ein kleines Pläuscherl mit seinen Gästen zu hallten.Nebenbei hatt er auch seine Bedinung beim Tische abräumen usw unterstützt.


 Sollte es uns einmal wieder in den Bayrischen Wald verschlagen so werden wir uns diese Adresse gut merken."}
{"text":"Bin hier mal mit einem Freund auf einer Wanderung eingekehrt. Es gab eine umfangreiche Speisekarte und ein Salatbuffet. Das Essen(Schnitzel) war ganz in Ordnung. Es gab eine schöne Terrasse. Service war auch in Ordnung."}
{"text":"Dimpfl-Stadl - der Name deutet schon an, was einen hier normalerweise erwartet: Gaudi und bayrische Livemusik bis zum Abwinken. Es gibt eine Gaststube und nach hinten hinaus den Stadl, einen großen Mehrzweckraum mit Bühne und Tanzparkett. Das Ganze rustikal in Holz verpackt und mit dem typisch bayrischen Charme dargeboten.Die letzten Jahre hatten wir diese Lokalität gemieden, waren wir doch 2003 von der etwas ruppigen Art der damaligen Bedienung vom Typ \"Bäuerin im Kuhstall\" und den Unmengen von Fliegen im Gastraum etwas irritiert gewesen.
Heute hatten wir allerdings Glück: nicht nur, daß das Wetter so schön war, daß wir zum Abendessen noch draussen auf der bereits für die Sommersaison aufgebauten Terasse sitzen konnten, nein, auch gab es heute keine musikalische Darbietung im Stadl, so daß es bis auf einen Tisch Einheimischer drinnen neben dem Salatbuffet angenehm ruhig war. Die Tafeln versprachen neben \"Jeder Eisbecher zwischen 14:00 und 17:00 nur 3,30\" auch Hasenbraten aus eigener Zucht und hausgemachte Schlachtplatte. Die Tageskarte ist hier wohl für mehrere Tage gültig, dafür sind die Speisen recht günstig (jener Hase z.B. 8,80)
Wir sind angenehm überrascht worden: das Essen kam schnell, es war frisch zubereitet und schmackhaft. Auch wenn ich noch nie einen Hasenbraten mit hellem Fleisch gegessen habe (ich möchte behaupten, daß das ein Karnikel war), so hat es doch geschmeckt. Meine Frau aß Goulasch mit Nudeln, die wohl in einer Pfanne mit Butter angebraten worden sind und so ein ganz besonderes Aroma hatten - fast zu schade, um sie in die Goulaschsoße zu tunken."}
{"text":"Wer auf große Portionen zu kleinem Preis steht, der ist im Dimpfl-Stadl immer richtig. Wer auf Qualität Wert legt, für den gibt es in Lam bessere Adressen.
Vom Preis her ist der Dimpfl-Stadl kaum schlagbar, vor allem, wenn man die Tagesangebote (Schnitzl-Tag) nutzt. Dann gibt es zum Hammerpreis Schnitzl, die weit über den Teller hinausragen.
Qualitativ kann das Angebot im Dimpfl-Stadl dann aber mit anderen Wirten in Lam nicht mithalten. Die Soßen schmecken nach Convenience und das Salatbuffet besteht (natürlich) auch eher aus preiswerten Bestandteilen.
Von anderen Gästen habe ich mehrmals gehört, dass es mit der Bedienung Diskussionen gab, weil das bestellte Essen mit dem gebrachten Essen nicht übereinstimmt (z.B. Jägerschnitzel statt Zigeunerschnitzel) und erst nach langen Diskussionen umgetauscht wurde.
Beim letzten Besuch war dann das Schnitzel auf der Unterseite offensichtlich verbrannt.
Im Sommer sitzt man sehr schön auf der Terrasse.

Es gibt jeden Abend Musik im Stadl, allerdings eher selten typisch Bayrisches, sondern meistens Alleinunterhaltermusik mit Ü60-Tanz.
Der Dimpfl-Stadl hat sein Stammpublikum, ich persönlich gehöre nach einigen Versuchen nicht dazu. Der Wirt Alois Lemberger ist ein erfahrener Wirt, der seine Stammgäste pflegt. Allerdings gibt es auch hier große Unterschiede zwischen Haus- und Stammgästen und Laufkundschaft.
===========

Meine Wertungen in Lam beruhen nicht auf einem einzelnen Restaurantbesuch, sondern auf den Erfahrungen von fast zehn Jahren Urlaub in Lam  mit unzähligen Essen in vielen Lokalen."}
{"text":"Während unserer Herbstferien im Lamer Winkel haben wir Gasthof Zum Dimplwirt 2 x besucht; man findet hier eine gute ,bayrisch-urige, freundliche Atmosphäre ; die Bedienung ist aufmerksam und freundlich, der Wirt, Herr Alois Lemberger ist sehr gastfreundlich.
Das Essen ist sehr gut, reichlich und gutbürgerlich.
Leider waren wir etwas spät in der Saison; am Freitag gab es daher etwas wenig Gäste beim Auftriit von Manfred Vogl im Dimplstadl.
Das Haus ist durchaus empfehlenswert!"}
{"text":"-Relativ modernes Haus, zentral gelegen, mit Biergarten
-Ambiente in Ordnung, nicht zu laut
-gemischtes Publikumg
-verschiedene Musik-Einlagen auch unter der Woche, bei unserem Besuch war Manfred Vogl zu Gast und sorgte für Stimmung
-Bedienung nett, aber viel zu überfordert, weil die Gaststätte voll und sie alleine war
-Speisekarte umfangreich
-lange Wartezeit auf das Essen, falsche Beilage bekommen, Fleisch teils durchwachsen
Fazit: unser erster Aufenthalt im \"Dimpflwirt\" war leider ganz nicht unseren Vorstellungen entsprechend"}
{"text":"Schon beim Eintreten wurden wir freundlich begrüßt, diesem Charme und diese Gastfreundlichkeit spürten wir von der Kellnerin während unseres gesamten Aufenthalts. 
Unsere Essen wurden sehr zügig serviert und waren geschmacklich einwandfrei. 
Eine Fuhre Mist, so wie sie sein soll. 
Verschiedene Fleischwaren mit Bratkartoffeln, alle geschmacklich abgestimmt. 
Auch die Grillpfanne war hervorragend.
Rundum wurden wir sehr verwöhnt und kommen gerne wieder."}
{"text":"Altes Familiengasthaus mit freundlicher Bedienung und gut bürgerlicher Küche. Preis / Leistung ist angemessen, zentral gelegen direkt am Marktplatz.


 siehe auch:
http://dimpfl-stadl.info"}
