{"text":"Really big and crispy wings, side sauces of sweet-spicy and Korean BBQ were tasty and nice to dip the wings into. Super friendly service and clean interior. Will be back!"}
{"text":"Was excited going to this new fried chicken joint, thinking it would be comparable to other fried chicken joint like hot star etc. However was very disappointed with the fried chicken (had the chicken steak and wing) as there is barely any batter. There is also one flavor which is the originals flavor and they would offer sweet and sour sauce. No legit Asian fried chicken place would offer this kind of sauce.

Also this place did not turn on the air conditioner and it was very hot when I went. 

Service provided was attentive however the girl seemed very inexperienced."}
{"text":"Came on a Tuesday. Had their current promo (up to five 99c drumsticks with the purchase of a tea). Chicken only took 3mins to come out, piping hot and delicious! Very clean shop with good service. Will come back"}
{"text":"This is my second time to the place. The first time I had drumsticks and Assam milk tea with bubbles.  The drumstick was alright. The Assam tea on the other hand was so milky and delicious, made me wish I ordered a x-large.   This time I went in planning to order the Assam milk tea to relieve my thirst on a hot Sunday afternoon. I got hungry while checking out their menu, so ended up ordering the popcorn chicken. The cashier suggested me to get the Assam milk lava, which is what they are known for and I went for it.  The Assam milk lava was delicious. The popcorn chicken was so fresh and the seasoning is just perfect.  Now I am craving to try the chicken steak next time and of course the deliciousness Assam tea."}
{"text":"Bright, clean place in chinatown with a number of seats available if you're looking to dine-in. They've got an accessible washroom on the main floor, and more washrooms in the basement. Which are also clean. Kind of surprised how spacious it is in the basement really. Feels pretty ventilated and they've got the AC going, which is always welcome during a hot day.

Menu consists of various parts of chicken that's deep-fried to a crisp, so if you have preference for breast, leg, or wings, they've got you covered. You can get chicken on its own, or with a combo that consists of fries and a soft drink. For an extra dollar, you can upgrade the soft drink to one of their various cold tea offerings. Judging from the menu, it looks like they're also planning to expand the menu with wraps and sandwiches in the future.

When you've placed your order, you'll be asked whether you're getting it to-go or not. If you dine-in, you'll have your food served to you in a basket, though you should keep your receipt in case it's busy and they start calling numbers.

There's like one person working upfront when we went, and she was in charge of making the teas as well as taking orders. One imagines this can become a bottleneck in service.

I ordered a chicken steak, which is basically flattened breast meat deep-fried, bone-in. Came out about 10 minutes later, but it was definitely hot and crispy, with tender and juicy meat. In terms of thickness, the meat is quite thick. Most of the flavor is coated on the outside, but the flavor is pretty strong. They have some condiments at the corner including ketchup and some sort of hot and tangy sauce that you can use.

Another customer ordered some wings and drumsticks and they looked pretty big. I don't know if it's just thick batter, but compared to a lot of other places they were definitely bigger for the same price.

Overall an enjoyable experience."}
{"text":"Very delicious!! Ordered the signature fried chicken it's super crispy and juicy! Also very friendly staff :)"}
{"text":"Nice service, staffs are very friendly! Brown sugar marinated bubbles taste amazing! The chicken steak is very nice too!! Crispy and juicy"}
{"text":"Got the Chicken steak and yam fries
Chicken portion was huge
Service was very good 
Fair price
Recommend giving it a try"}
{"text":"It was okay I would say that it is pretty pricey the special of the day was by a drink and you can get a chicken steak for 3.99 that comes with no sides and the drink is $3.50

I will say that the chicken was extremely huge it's a lot of meat for just one person to eat I probably would share that too with someone and would want aside I didn't really see much options of sides and their menu

Do keep in mind everything is made to order so plan to spend at least 10 minutes waiting on whatever you order I ordered the spicy chicken it was tasty there wasn't that much crunch to it I prefer my fried chicken to be crunchy I also was annoyed because I ordered to go and they gave me the chicken in a Patty bag a Patty bag is paper so the greasy chicken just deteriorated the Patty bag and pieces of Patty bag on stuck to the chicken and I accidentally ate some

For a drink I got the passion fruit green tea it is pretty sweet taste like juice with a black tea aftertaste"}
{"text":"Chicken meat was so tender and moist. I was in search for a late night cheat meal and this place hit every single bone. 

Service was astounding; even got a free bubble tea!"}
{"text":"It's my second visit here ...

They are in soft opening mode due to issues with the supplier.  Most items are currently available but they don't announce it (wraps, salad) because of limited supply sometimes it's a really long wait.  Like 25 minute wait ...

Each time we came here they were sold out of something we wanted.  

Pros:

Our first HK bubble tea - tapioca was very fresh.  We were told it's organic

Chicken is good and the chicken steak is real white meat.

The cashier is very friendly and tries to be hospitable

Cons:

Portion of fries is very small

Many items can be sold out

Second visit the tapioca from the bubble tea wasn't as fresh as previous visit, even though the tapioca's were freshly made

My first visit, I didn't get the wraps though I'd liked to have.  The menu says it wasn't available.  Upon further questioning, it was in fact available but at that point we had already eaten."}
{"text":"TLDR - Managment doesn't care, the front counter staff is nice, 30 minute wait after quoted 5, served other people first, lots of kitchen mistakes, food is good

I was excited when I saw this place was opening right next to my office.  I've gone twice during the soft opening.

On my first visit, my significant other and I each ordered a chicken steak.  When the order came up, they had forgotten one of the chicken steaks.  We understood and assumed it was just a mistake with a new business getting started.  They fairly quickly remade our food and brought it out.

Today we went back for lunch since the food was very good the first time.   We brought one of our staff with us.  When they brought our food out the first time, they failed to notice there were two identical orders and the fact there should have been fries.  The ticket the guy was holding was correct.  During the next 20 minutes, we watched 4 other people served the exact meal we had ordered.  At this point, I asked to speak to the manager.  The very nice, overwhelmed young man working the register went to ask them to come speak with me.  They refused.  10 minutes later our food was brought out.  The manager never came out.  No effort was made to make the situation right.  

The young man who was taking orders was very nice.  The food is very good.  If it had just been the kitchen mistakes this would have been a very different review.  The lack of concern and attention from the management is the entire reason for this review.  Good food does not make up for terrible customer service on the part of the Management.

I can not recommend Gdous.  The staff may improve.  The kitchen may get better.  The management is unlikely to suddenly learn to care."}
{"text":"I went there on soft openning. A lot of item were sold out. So i chose w.e options they had left. The place is new and clean. And the staff is nice. There's still improvements. I will go back again next time."}
{"text":"New fried chicken joint in Chinatown. The chicken has minimal flavour though I liked the coating. If I'm craving fried chicken and I'm in the area, I'll come back. But it's not a place that I'd be willing to go out of my way for."}
{"text":"Their so called \"soft opening\" is poorly advertised. The manager didn't explain the promo well either. 
 
I opted to try the first promo by following their Facebook group. I wanted to taste their chicken wing before ordering on the second promo.  Their chicken wing tasted good. So I asked the manager that if I bought the 12 piece deal, I would get another 12 for free. He says \"yes, but you can only redeem one of the 3 meals.\" I questioned why he refused business when I want to buy a 12 piece box. No matter, I asked my girlfriend to do the second promo instead.
 
Sign says \"buy one, get one free.\" Only after she made the purchase of 12 pieces and was expecting another box of 12 pieces does he explain that it's \"buy one get ONE CHICKEN WING FREE.\" False advertising. Restaurant won't last long with these kinds of bait and switch practices. We wouldn't have made the purchase if this was the case. 

When the order arrived, only 12 chicken pieces were in the box -_-. Good thing I checked before leaving.

 Unfollowed Facebook group immediately afterwards. 

Side note, Chicken wing tastes good. Here are 2 stars."}
{"text":"I had lunch today at GDous, a Shanghai fried chicken chain.  They recently opened but apparently haven't had their official opening yet.

A lot of their menu items aren't available.  I ordered the Crispy Chicken Steak combo.  I was told it would take 7 minutes to make but it was actually 25 minutes.  The fries were kind of cold.  The chicken was good.  It looked like a boneless chicken breast until I got to the end, which was hidden in the bag, which was actually just bones.  Surprising considering the cost plus that's what the pictures on the wall look like.  I would be inclined to make it a boneless chicken breast.

There is a poster on the wall that says if you post pictures of your meal online, it's \"buy one get one free\" ... which actually isn't true.  If you post pictures of your meal, they will give you a chicken wing.  Yes, a scrawny chicken wing.  Though my meal was okay, I didn't see myself rushing back anytime soon so I didn't push it for them to fulfill their promise.

The cashier was really friendly but not overly knowledgeable.  When I asked about the sauces, he said he thought one in a container was ketchup when it was hot sauce."}
{"text":"Crispy and juicy chicken! Just like the sign says :) 

The piece they give is huge!
Wish they offered a special sauce on the side or hot sauce, only have ketchup. Guess it makes u appreciate the chicken more. A must try! :)"}
{"text":"We got 18 chicken wings, king oyster mushroom, 2 drumsticks and brown sugar lava drink. It was all amazing and service was so nice!!! They gave us the drumsticks for free and omg it was all so juicy and delicious definitely come back! 

Saw a guy from R&D bar he ran out of paper for his POS machine and came into to ask and had money but the kind lady just gave him two rolls free and said it's alright she's so humble and kind and the reason I'm coming back!"}
{"text":"Ordered the crispy fried chicken steak. Very juicy & well seasoned.  A little bit of a wait as they freshly deep fry the chicken to order.  The place is very clean- no sticky chairs and great friendly service.  A little pricey in my opinion considering I was only getting 1 flattened chicken breast for $10 when you can usually get a 2 piece combo at other fried chicken places.  However, the breast was a good size and I absolutely would order again."}
{"text":"Great value. It is a bit pricier but well worth it. The portions are large and chicken is juicy and very crispy. I had the chicken fried steak. Will be going back. The wait is a little long but did not phase me. Do not mind waiting a little longer for greater quality food."}
