{"text":"It took some convincing for this hole-in-the-wall Chinese restaurant to serve me (a Westerner) the authentic Chinese food they were serving their Asian patrons (there is no English translation for the true Chinese menu), but once they knew I wasn't going to settle for sweet and sour chicken or ginger beef, they had some great suggestions.

I ate a delicious, though expensive, Lobster Chow Mein with an egg-based cream sauce, complete with head and entrails. I was skeptical about the fried rice with salted fish I ordered to accompany it but it turned out to be wonderful. I finished the meal with a complementary red bean dessert that rounded off things nicely.

The portions are generous and you can get away with one large dish + a rice dish for 3-4 people. 

Don't expect to be blown away by the decor or the service but if you're looking for authentic Chinese food in Calgary this should be on your list. Be sure to make it clear to the server that you want CHINESE food, otherwise you may get stuck with the standard Western-style \"Chinese food\" you can find almost anywhere in the city."}
{"text":"If this place was easy to miss before, it's essentially invisible now that the awnings are gone and the adjacent businesses are boarded up.  That's a shame, since this is great, unassuming little shop, serving up good sized portions of authentic Chinese food at a good price.  The menu is not huge, but covers all your classics without being inflated by North American inventions like chop suey. 

BBQ is definitely a strong suit here, with crispy duck and ribs available in various combinations.  The three course Peking duck is good deal at about $25 taxes in and handily feeds two people between the plentiful classic wrappers with hoisin+green onion+cucumber, a cabbage+mushroom+ginger duck broth soup, and a tasty duck fried rice.  Personally, I enjoy jazzing up the hoisin with the table condiments like red vinegar and chili oil.  Tea is of course brought by default.

While it would be generous to describe the decor as minimal, the service was great.  We were asked on several occasions if everything was alright as each dish came out, and it didn't sound like a platitude.  When the food was a bit delayed, they gave us complimentary ribs (five spice BBQ), and the tea pot was never empty for long.

Gee Gong: for those who want flavour, value, and service rather than pretensions."}
{"text":"This place seemed like a bona-fide spot for Chinese food. Lots of families and kids with tasty looking dishes. I'd stay away from the tofu and veggie plate - canned veggies with bland sauce, but the shrimp and snow peas were fresh and tasty.  I was with non pork or beef eaters so missed out on the tasty looking BBQ that was in the window, unfortunately..."}
{"text":"Gee Gong is hands down one of my favourite hole-in-the-wall destinations for one thing - Peking Duck. The first time Gee Gong was recommended to me, it was from a friend from work that handed me a hastily scrawled name and address on a scrap piece of paper with a simple tip, \"Get the duck special.\"

For less than $30 you will be well fed, starting with the traditional thinly sliced duck meat with it's sinfully crispy and slightly fatty skin. Accompanied by a plate of fresh wrappers, cucumber, green onion and hoisin sauce, you will be a very happy person in short time.

As you are finishing the first round, you will be hit with a barrage of food, featuring duck including a simple soup with greens and a mound of duck fried rice with the usual additions like shrimp, peas, a little pineapple etc.

Your breath will not be taken away when you visit Gee Gong, and frankly, its something I come to expect from a place that has surprises up its sleeve in the form of honest, non-pretentious Chinese food for the people. The service is friendly and fast and the teapot is always full. I love this place for what it is."}
{"text":"Gee Gong is outstanding. Although to my discredit, I always order the same stereotypical Anglo-Canadian thing; ginger chicken, stir fried veggies and fried rice. This place is so authentically Chinese they don't even have this combo on their menu. But the staff is super friendly and accommodating. My plate is always huge, hot and delicious. Unfortunately, as of the end of August 2013 they are still closed due  damage from the Calgary spring floods. There is no sign of the renovation the sign in the window claims are underway. Hopefully they will re-open."}
{"text":"This place is fantastic! My mother and I were in a rush for service. We were really hungry and just wanted food quick. I told the server what we wanted without looking at the menu and they delivered in appropriate portions for the two of us. We wanted dumplings, mixed vegetables, duck and rice. I left with a generous portion afterwards to enjoy for lunch the next day. The server came to the table several times to ensure we were satisfied. I've been here once before to try the roasted duck. The duck is especially excellent. You'll see their roasted meats in the window since they take orders out for BBQ. I'm told the pork is excellent. The environment is simple and down to earth. Not fine dining, but fine food. The menu is in plain English unlike a few places I've tried in Chinatown where you have to ask what you are ordering. Friendly, good food, good service, moderate price and recognizable food. The tea is terrible. It tastes like cardboard. I'd give this place 4 stars if the tea wasn't awful. I'm an imported tea snob. They should charge for tea and have a good jasmine or Oolong. Ask your server if there is another tea before sitting down if tea is important to your meal (not sure if they have another). If you're used to drinking bagged Red Rose or that crap you won't notice what I noticed. It's basically hot water and hint of tea with mostly cardboard. I don't recommend the tea here. I highly recommend the food and service."}
{"text":"I have a well kept secret that I am now going to disclose and I can't believe I haven't written about it till now but ... the place my family and I used to frequent when my mother was still mobile was Gee Gong Restaurant.  I actually think my Auntie is now good friends with the owner but we actually would go here in large groups because they serve the most amazing Peking duck.

Don't expect anything glamorous from this place, it literally is a hole in the wall with tacky chairs and tables but the service is very friendly and the duck is too die for.

Imagine a plate of tender meat with crispy skin accompanied by warm wrappers, julienned green onion and cucumber.  Eating the duck and wrapping it in the warm wrapper is akin to eating tacos, it is an art form but once you have developed a style of what contents and combination to put in, it is absolutely amazing. The duck meat which it's just right herb marinating and its crispy skin, crunch from the fresh cucumber and sweetness of the sauce. Wonderful. 

I feel like going down there right now just from writing this."}
{"text":"If you happen to be in Calgary and you like Chinese food, you cannot miss this hole in the wall...and it really is a hole in the wall.  You will find it in China town under scaffolding where they're doing construction and if you can get in through all that, the interior is unimpressive but very authentic.  The menu is in Chinese with English as an afterthought and I went for the first time with Chinese friends who ordered for me...and boy what a treat!!  The Barbecue Duck and Pork are a can't miss and the Wor-sun (sp?) soup are a must have...If you aren't sure just start ordering and the wait staff will correct your order and tell you if that' not a good combo...they let you know what will go well with what you are trying to eat (no kidding) \"that not go well with what you have...choose this instead!\" and they're serious too!  So you really can't loose!  I love this place and will eat here every time I'm in town!  You gotta go!"}
{"text":"I really like this place.  I only had a duck won ton noodle soup but it was great.  It reminds me of any one of a number of similarly good, hole-in-the-wall, inexpensive, Cantonese places in NY, LA, or SF.  Dont expect nice surroundings. Dont come here if you expect a really \"clean\" place.  But do come if you like good Cantonese style food.  For this style and pricepoint, it is top notch."}
{"text":"old school chinatown restaurant, complete with half a side of beautiful glistening pork and roast ducks hanging from the window.  the hole in the wall that delivers the goods - that my friends, is what i look for.  ambiance is just a facade making it a pale second to well prepared quality food.  my first choice at gee gong is usually the beef brisket with noodle, the classic combination - where the brisket is made to the perfect tenderness combined with a nice depth to the broth.   the array of rice, noodle and congee dishes are good.  the roast and bbq pork along with all the items available from the bbq pit are worthy of tastings.   of course, i do not recommend going for your run of the mill westernized chinese dishes.  the quality is in the real stuff.  order accordingly."}
{"text":"Gee Gong has been around for years and years!  I haven't been to Gee Gong forever and decided to try it again.  Busy little restaurant.  Takes credit cards.

DELICIOUS!  BBQ Duck Lo Mein - massive plate of egg noodles with heaping pieces of chopped up BBQ Duck that taste like heaven!  Comes with some bok choy and a bowl of clear broth soup.  All for $9.95!  

I also did try their Dumpling Soup and the Lettuce with Oyster Sauce on a separate occasion - also delicious and fulfilling!

The lady in charge there has already started to recognize me!  :o)"}
