{"text":"I've been to this place a few times now, and have had consistently great crepes there! My favourite so far is the spinach and egg crepe, though I have yet to try all of them. The coffee is also really good, proper espresso drinks made the Italian way! they recently started serving Gelato and waffles too, so I got to be one of the first to try a savoury waffle turkey sandwich that was surprisingly good! Definitely my go to place for coffee and a quick bite"}
{"text":"La crêpe épinards, oeufs  & fromage était très bonne + 1$ pour une bonne salade et un bon café en plus! Bon prix et bon service."}
{"text":"A nice, simple place. The crepes are a bit hard but I enjoy them. Their coffee is good too. The cakes here are great, try the cake pops. The desserts are generally better than crepes. I usually go for the classic Nutella crepe or Turkey and Cheese. Staff is very friendly. The place is also quite clean."}
{"text":"It is inside of this weird mall so know that first if you are navigating to this location. The crepe was okay as was the coffee. Since crepes are commonplace in Montreal, I would be hard pressed to visit this place again."}
{"text":"The Nutella waffle I had there was easily the best waffle I've ever had! 

It's thick, freshly made, crispy on the outside but soft inside, and there was a generous amount a Nutella. The staff there were friendly as usual. 

I'm also very happy about the fact that they offer the choice of half waffle. I wasn't very hungry when I went there this morning because it was my second breakfast today, so a half waffle was perfect."}
{"text":"A small, agreable place for coffee and breakfast/dessert, in a neighbourhood that is certainly competitive (Cacao 70, Juliette et Chocolat, Cafe Bistro El Mundo etc.)
The menu offers a nice selection of sweet and savoury crêpes at an affordable price, but we felt the fillings could have been more substantial. The shop itself is cute and the staff is friendly. The matcha latte is quite good.

Overall enjoyable, but nothing outstanding."}
{"text":"Service is excellent here. They're so sweet and attentive. I never order anything to drink but they always offer me a glass of water and bring me my food at the table.

The location is ok, seating is a bit uncomfortable and small but I never stay long so it's ok.

The crepes are good, nothing too extravagant or awe inspiring. Very basic but tasty. I enjoy getting their savoury crepes for lunch. 
They arrive warm and are generally filling.


They are a bit expensive though, wish that would change."}
{"text":"I tried this crepe place while on vacation in Montreal. I had the Carmel apple crepe and it was fresh and delicious. The cappuccino was slightly bland but overall, okay. The price was reasonable- about 11$ for everything. It was a good choice for a light lunch. Would come here again to try the other crepes."}
{"text":"Currently eating the best crepe I've ever had... I couldn't even wait to finish it before leaving a review. Excellent customer service. Delicious food for an affordable price. Highly recommend."}
