{"text":"Ordered Gennaro's for the first time in about 6 months after the last time I had a hair in my pasta. Figured we would give it another try this time through. Ordered everything, driver calls when he gets to my house, and ends up being close to a block from my house. Had to walk well outside of my house to find this guy, as hes calling me back to ask me if I was even coming or not. After finding the driver, he hands me my food, which is an incomplete order.. Called back to a nice girl who apologized & had the rest sent out.. Went back inside to look to find my pizza was also made wrong. Easily never going back to here again after these 2 horrible experiences. Would not recommend at all. Plenty of other pizza shops in the SouthSide.."}
{"text":"We like the pizza and hoagies.  The wings are also good.  I'm editing my review as I noticed they resolved the two complaints I had with them.  The delivery is always fast and they have a good variety of items on their menu."}
{"text":"I live in coraopolis I was in the mood for some pizza so I took a drive to south side  ? There was a pizza place by PNC bank that I remember when  my going out days, but the pizza place change to Gennaro's so I saw on the wall how they have all these rewards so they must have good pizza i was like YES!!! Then man was I WRONG? big disappoint!  I must say for being a pizza place won these awards they must be the shit!!! So I didn't wait till I got home out of all fairness I had  to try it before I leave the parking lot. So 1 slice then 2  slice then by the time I got to the 3rd slice i was like REALLY??  This is what they were known for best pizza??? The sauce is to sweet for my taste bud and the dough had some sweet taste as well? I couldn't really taste the cheese to get the combination from the dough or the sauce,  big disappointment coming from these readers choice rewards good luck Gennaro's"}
{"text":"I ordered the other night from this place and got a chicken twist fit $7.49. It had 3 small slivers of chicken in it that added up to about 7 inches in a 14 inch long 3 inch wide twist. When I called to complain they told me it was my fault because it was my first order but Gary did give me a credit when I started the scream. With my credit I ordered a gourmet pizza with double pepperoni, ham, and cheese. There is one and a half pieces of pepperoni per slice and the cheese doesn't even meet the crust. I will NEVER order again but God bless you if you do. There is far better pizza shops than this."}
{"text":"I know I give this pizza 5 stars, but it isn't the best pizza I have had - bear with me.  Gennaro's has a huge menu, fast delivery and a lot of food for a reasonable cost.  That earns it 5 stars.  The pizza is really tasty, and as a new resident of Pittsburgh, I'm finding it challenging to find a pizza place that just bowls me over... still hunting, but this is the best so far."}
{"text":"There is an out of his mind, hateful, prejudiced middle-eastern guy that works there that actually called 911 on me & 2 African American guys in line behind me 4 absolutely no reason. I had asked politely 2 speak 2 the manager because was really being harassed by drunk guy in there & he screamed at me, then went off on the guys in line behind me. We at no time raised our voices, were rude back, were totally sober, polite, well dressed. I did tell the guys behind me he's just a jerk because they were stunned at how they were screamed at, young guys who happened 2 walk in while he was being rude 2 me, then he threatened 2 call 911 on us , I said why, because you're prejudiced, so he CALLED THE POLICE, screaming at me I HAVE YOUR FACE. We left. Beyond ridiculous. I believe in being honest about my actions, swear 2 God this is what happened. So an urge 4 pizza might land u in jail if u go here, not worth it, was really disturbing. What kind of place tolerates this kind of behavior from employees? At 1 point the cook walked up hearing the dude's yelling, but saw dude was just losing his mind & walked away. So I guess the middle-eastern guy was in charge. happened on a fri around 12 am."}
{"text":"Tried this place based on Yelp reviews for a recent lunch.  We decided to try both the Chicago style and regular pizzas.  I will say both of these pizzas were very good.  Delivery was fast and the pizza arrived hot.  Will definitely be back."}
{"text":"Definitely was a let down. Nothing was delicious, all food was just EH, okay.. Nothing I would go and purchase again"}
{"text":"Consistently good pizza. Only place to get good deep dish pizza in the city. This place is better than any of the Sq Hill places people flock to like Mineos."}
{"text":"So delicious. Variety selections on the menu including pizza, wings, fresh salads and baked hoagies. Everything we ordered was fresh and hot out the oven. I would definitely recommend it."}
{"text":"The Sicilian za hit the spot at 3 AM after some late night booze-related revelries. It did take a half hour for them to make it, but at least that gave ample time for macking on the local ladies who also claimed they were from LA like all starstruck Pittsburgh girls do for some reason in the seating area. However, the guy taking orders would not accept my offer of a 100% tip to bump my order to first in line on the list: Weird."}
{"text":"We used to order about six pizzas a month from this place, but are now done with Gennaro's. Last night, we ordered two LARGE (16\"/12-cut) one-topping pizzas, but when the pizzas arrived, they were MEDIUM/14\" size, with one cut into 10 slices and the other in eight. We checked the receipt to confirmed we were charged for LARGE pizzas and then called to let them know that they sent two mediums. The unapologetic response we got was that they've recently changed sizes and MEDIUM is the new LARGE. (You'd think they might have mentioned that to a regular customer?) So we ended up with the equivalent of 16 slices when we ordered 24. 

Either somebody screwed up and they lied instead of fixing the problem OR they really are now charging large prices for medium pizzas. So I called the following day and asked to speak to the owner. The man who answered the phone said the owner wasn't available, but identified himself as the manager and confirmed the story. I pointed out to him that the menu on their website still shows that a large pizza is 16\"/12-cut and he told me the website hadn't been updated yet.

There are lots of places to order pizza from on the South Side and I'm sure I can find another that's more worthy of my business than Gennaro's."}
{"text":"I ordered a small chicago style pizza. I had to write a review to warn others- it's not true chicago style pizza. Also, the ingredients are a 6/10 at best (tomatoes are diced canned kind, sausage is teeny tiny and slightly chewy). But if you don't mind the \"cheapy\" taste, go for it.

I'm from out of town and have a hard time finding places that serve great food in Pittsburgh. Unfortunately, this chicago-style pizza from Gennaro's falls neatly into the sub-par category along with the others. I think next time I'll try Proper Brick Oven even though it's more expensive."}
{"text":"The restaurant was nice and quiet. We waited patiently for our food and it was well worth the wait! I ordered the bread twist, which was a very large size so it was perfect for me and it was amazing! The texture, taste, everything was perfection!!! I definitely finished the entire thing."}
{"text":"The service was so bad  i almost walked out. Two young girls were on a computer didn't say hi just stood there at the counter and waited for us to order. They had a miserable demeanor and kept saying to one another \"i can't wait to leave \" this is annoying to me as a customer and not professional. I will not go back if the two miserable girls are working. Food was good. They need to hire less whiney unappreciative people."}
{"text":"Ordered the Family special: really like the plain cheese pizza, the hoagies are decent, but huge. That's a chicken ranchero. Nothing special, but better than other local delivery places. Wings were okay, but not very saucy. And the extra breadsticks are a nice, free touch! The super late delivery is also a perk!"}
{"text":"Eaten here a couple times before and overall was nothing special.  From my previous experience I would rate Gennaro's a 3. However, my recent order I decided to try the buffalo chicken pizza and I would not recommend it. The pizza is loaded with fries, seems like it has no cheese and is doused with buffalo sauce.  I was only able to eat one slice of the pie before I was done with it."}
{"text":"Got delivery to hotel last night. Food was not good or hot upon delivery. I'd recommend calling anywhere else for pizza, wings, and fries"}
{"text":"Best supreme pizza I ever had in my life! Highly recommend it, though price is a bit steep"}
{"text":"A wide variety of selections on the menu, with pretty efficient service (about 15 minutes). I had the seafood pizza, which toppings wise, was incredible, but the crust and cheese were average. Also had the cheesy bread which was overpriced as it was mostly bread with a minimal amount of cheese, but it was slightly healthier in that it was less greasy than pizza chains like Domino's."}
{"text":"Second time i ordered Chicago style pizza thought i would give them a fair chance.
I lived in Cicago for 35 years i love Chicago pizza THEIRS IS NO CHICAGO PIZZA.
I don't know about the rest of the menu but you will be disappointed if you know pizza and expect a real Chicago experience. The dough is not right the ingredients are not seasoned enough. 
So stay away from ordering Chicago Style unless you have money to waste"}
{"text":"Here is why Gennaro's gets three stars:
1.) Delivery or pick-up is fast, even late night (under 20 minutes).
2.) It's cheap.
3.) You can order online.

The pizza itself isn't anything to write home about.  It's better than Papa John's but not as good as Domino's.  (The only reason I'd go with Gennaro's over Domino's for cheap pizza is that Domino's is always at least twice as long to deliver as they say they will be.)  If you go in for service, you will be disappointed--definitely had staff finish taking selfies and sending off texts before acknowledging that we were at the counter at all.

Overall, it's okay."}
{"text":"Ew is the best word to describe this place.  I don't know why pizza places offer pasta if they can't do it right.  I ordered the fetticine alfredo and it tasted like a frozed michelina dinner.  Noodles stuck together, incredibly overcooked, and the sauce was like something straight out of a ragu can.  

Husband ordered a gyro and it was incredibly greasy and tasted like reheated frozen gyro meat.  Nothing we ordered tasted fresh and definitely not worth the money.  Stay away!!"}
{"text":"I stumbled on this place late one night when I was starving and looking for something by my hotel. With its booths and that tacky red vinyl seating I remember from childhood pizzerias in NJ, it looked good, so I went in.  The staff was kind of gruff, but my pizza was delicious. That was 2 years and 5 visits ago.
Fast foward to last weekend.  Staff is still gruff, but pizza is just pretty good.  It's no longer that much different from any other nearby pizza place, and it looks like their large pizza isn't as large as it used to be.  But since I never really measured them I can't be sure. 
Bottom line is I will go back if I'm nearby, but I won't make a special effort to go there anymore."}
{"text":"Disappointed. Everything (white pizza and breadsticks) was very, very bland. The spinach topping is just bagged frozen spinach for a whole $2.50 extra."}
{"text":"Worst customer service I've ever experienced in my life. I ordered 65 dollars worth of food.  First I tried to change from delivery to pick up and cancel the payment I already made and told them I'd pay when I got to the store.  They told me it would be too difficult to do  so I just had it delivered...an hour later our food was delivered.  I received a steak calzone instead of buffalo chicken and called them to let them know it was incorrect.  They told me they would have the buffalo chicken delivered so another hour passes and I finally get my buffalo chicken calzone.  They make me return the steak calzone which I had already had a couple bites of before realizing it was steak.  I thought that was strange because I knew they were just going to throw it away...so I think the ordeal is over and even though it took 2 hours to get my correct order I was only a little upset.  About 20 minutes later the manager calls me and tries telling me the calzone I sent back (which I tried as well as one of my friends and we both determined it was clearly steak) was the correct buffalo chicken. He then went on to blame me and say everything that happened was my fault.  It was unbelievable.  Not only did the mess my order up but then called to blame me for the entire thing.  I will never order from there again and will never recommend this place to anyone.  There are too many pizza places of equal or better quality on Pittsburgh to deal with this god awful service."}
{"text":"So, I'm on my way out to California and one of the stopovers happens to be in  Pitsburgh. After fruitlessly searching for anywhere nearby that's open and fairly priced, I almost gave up hope, but then I found this gem of a restaurant. The seafood hoagie is an absolute must try- it was amazing. The reason I'm on my way to California, in a very funny coincidence is to meet my newborn nephew who's name is Gennaro!"}
{"text":"Don't bother ordering extra toppings b/c you wont get more than enough to cover one slice only. The first time it happened I figured it was an oversight, but the second and third time it convinced me it was just their policy. If I ask for a pizza covered in ham, i'd like to see more than 7 little pieces of ham on it. There is nothing special about their pizza either. It's just typical American style pizza. Will not order from them anymore."}
{"text":"I am restraining myself from so many expletives but this place is effing horrible. The customer service is the worst I have ever experienced.  Don't ever ever ever ever order from here unless u want rude service, complete waste of money, cold food, high prices."}
{"text":"straight d*ck team. only reason they did not receive one star is well one, that is not an option, and two, the delivery was quick. (im only 6 blocks down the street though.) got the grilled chicken salad which was 90% fries and cheese. got about 3 bite sized pieces of chicken and maybe 4 bites of lettuce. the pizza was absolutely just sub par. my stomach has been killing me for almost two days. wow."}
{"text":"This pizza is amazing. I cannot speak for the authenticity and all of that, but good pizza is good pizza. The deep dish is what you need to get. I can't even eat a small in one sitting and I am a pretty big eater.

The inside of the place is a dive. You can eat in but it's got the feel of a take out place mostly, for instance, you have to get your soda at a pop machine inside. But yeah, the pizza is quite phenomenal. If you get the deep dish. DOWN SIZE. It will fill you up fast."}
{"text":"Mediocre at best.  See that delicious looking picture up there that shows you how great the chicken tenders are?  Well that's exactly what I ordered, except for mine, they came fried a little extra.  I might be being kind with that.  The were fried extra to the point where each bite tasted of burnt coating.  No matter what I dipped them in I still tasted the burnt-ness.

Next time I order from here, I'll make sure to order something that doesn't come from the fryer."}
{"text":"My go-to place for late night snackage. It's a small restaurant, so carry out or delivery is best. I usually order delivery on my way home so that it's there shortly after I am, and the pizza is always great. I like the sweetness that the sauce has. (Getting hungry thinking about it). ALSO, this place will deliver 6-packs of beer, so that's a great perk! Haven't tried anything but the pizza though."}
{"text":"The deep dish is the best you'll find in the burg. It rivals any authentic Chicago deep dish you want to compare it to. Don't wait just order it. It will change your life! The crust has a salty sweet pretzel like taste that you will crave in your sleep. They are always 100% on point never had an issue with food or service."}
{"text":"Not missing anything here!  The pizza has zero taste and was rather disappointing!  The dough tasted like cardboard with a very bland sauce.   Might be a good place for drunk college students but certainly not for a quick lunch while enjoying events down on the south side.  Over rated, over priced for poor quality."}
{"text":"Nothing special about this place other than you'll be disappointed you wasted your money on their pizza. Ordered a slice while walking the south side.  No real taste, dough was flimsy and pizza was greasy. Staff was very friendly, place was clean so I gave a second star.  Otherwise pass this one up unless you're r desperate."}
{"text":"Late night pepperoni pizza , and we were very pleasantly surprised. Good cheese, good sauce - yum! We would definitely come back."}
{"text":"Not only is the pizza hella good the service is AMAZING!!! I left my entire purse on the table on a Friday night And the employees who knew it  was mine did not allow the drunks to steal it. I came back and they were like \"wow TG I had to defend ur shit from drunks\" GENEROS SAVE MY LIFE !!!!"}
{"text":"I USED to love Little Chicago's.  When I first moved here, it was the only pizza I knew, and the only I cared to know.  The pizza is deliciously cheesy and greasy; which is perfect for a late night slice of pizza.

But now that I've tried the likes of Pizza Sola and Blue Grotto; Little Chicago's doesn't seem quite as tasty. 

Nevertheless, I wanted a pizza delivered tonight, so I called Little Chicago's.  At 11:30, on a Thursday night.  That doesn't seem like a tall order for a pizza joint that delivers.  But the phone call I just experienced would suggest otherwise.  The girl that answered the phone seemed...perplexed.  Why...what...where....do you want a pizza delivered???  It seemed a foreign concept.  Really?   

I know that every time I've been in there, the employees have been in an alternate state of being...but seriously.  So much so that you forget you're working in a delivery pizza joint!?  

It was really disconcerting to call a pizza place at 11:30 on a Thursday night (a Monday night, maybe?) and catch them off guard and confused about an order as simple as \"large pepperoni, delivered\"."}
{"text":"Genarros is the worst. The act like they care but they don't. I ordered a simple cheese pizza and had to wait an hour and a half and watch others getting served way before me. They don't respect their customers. Never coming here again"}
{"text":"My sister-in-law and i stopped in late night for some pizza and wings. I had never been here before but knew it would be open so we the 5 minute drive here. 

The menu offers a large list of things.. including deep dish pizza.

We ordered a regular pizza and plain wings. The wings were delicious.. crispy and by no means a wing ding. Pizza was average but eh whatever. We were all starving.

The guy taking our order was a total sweetie. We enjoyed a beer while waiting for the food. 

A cool thing about Gennaro's is that they sell (& DELIVER!) beer. You can mix & match six packs or buy them individually (not sure if that option is avail for delivery) 

Next time i will pass on the pizza and try some thing else"}
{"text":"We call this place \"Secret Pizza\" because of how amazing it is and how hard it is to find when you're shitcanned. But it's our Secret Pizza, and we love it no matter what. Hoes down, G's up."}
{"text":"Great drunk chicken cheese steaks 10/10 would recommend, cashier is a sweetheart xoxo"}
{"text":"I like Gennaros. Standard pizza hole in the wall kind of place. They're never busy and the staff is always grumpy but the pizza taste good so I keep going back. Prices are middle of the road and the same as pizza Sola and sals. If your looking for a local pizza place that serves decent food go here."}
{"text":"Don't order from this place! SCAM they gave me the wrong pizza. I called to ask if I could get the right one, they said no and hung up. Really???"}
{"text":"This is the first time my friend and I ordered from this restaurant!
It was DELICIOUS!
We both had the seafood salad!
OMG! Fresh greens, cherry tomatoes, crab, shrimp,and mozzarella cheese! YUMMY!
Choice of garlic bread or croutons!
We also had the cannoli for dessert! Double YUMMY!!!
We will be ordering from them again!!!"}
{"text":"Their Chicago-style pizza is delicious with chunks of seasoned tomatoes and gooey cheese nestled inside. Their other pizzas are quite tasty as well. Delivery is quick and easy. I can't speak to the authenticity of their Chicago pizzas, but I'll be returning many a time to Little Chicago's."}
{"text":"Long time customer... 3/22/14 officially no longer a customer. They charge you for an XL pizza, \"16 slices\" and give you a LARGE pizza in a smaller box. Took a long time but now a SELL OUT pizza shop. Hope the rest of the Southside Community stays away from Gennaros. Sad day for a pizza lover."}
{"text":"I am not a huge pizza connoisseur, so I didn't find anything that terrible about their pizza. 

I got a deep dish, and it was pretty good. The small was more than enough for one person. The cheese was plentiful and the sauce tasted just fine for me. Maybe it's not the most authentic pizza in Pittsburgh, but it sure hit the spot!"}
{"text":"Solid Pizza at a fair price.

I get this for work a lot and have found the quality to be consistent.  It's not the greatest pie ever but for the price it's good and the pies area good size."}
{"text":"I don't even wanna give them one star. 
I order from them regularly and while never am really impressed, I order again. but after tonight, never again.... After placing a $38 dollar order for a large broc chicken Alfredo pizza, there was barely any broc, almost no chicken, and no sauce what soever... One of the worst pizzas I've ever had. 
The side salad we ordered with cheese, had no cheese... Two unripe tomatoes and looked like it was sitting out all day.  
Finally,,, I called to complain... 
The rude ass guy on the phone interrupted me mid sentence and said hold on, I'm getting the manager. After ten minutes, he gets back on, says\" I can't find him\" and HANGS UP on me!!!!!
Wtf?!!!!!! 
NEVER AGAIN!!!!!!!!!!"}
{"text":"The food at this joint is delicious.  They do most things right.  

However, this is the second time that I have ordered delivery and they have screwed up my order.  The last time, they put the wrong toppings on the pizza and it took about 1.5 hours for it to arrive and then I had to wait while they re-made it from scratch.  At least they were willing to make it right.

This time, the order was *totally* incorrect and still took over an hour when they are mere blocks from my house.  When I called to get the delivery driver to return, I was told that the driver made a mistake and delivered my food to the wrong location.  Their answer was...seriously...that they were going to send someone out to swap out the food they delivered to me with the food I actually ordered.  This is not only completely unsanitary (I opened the incorrect order and as far as I'm concerned contaminated it even if I didn't actually touch any of it) but at this stage I ordered pretty close to 1.25 hours ago, and  spending further time transporting the food from point A to B and then C is going to mean it's cold and/or soggy.  

15 minutes later, the manager called to ask if I wanted them to re-make the food after I'd already asked for a refund.  This was the proper thing to do the first time, but it was already honestly still too late.  When expecting food in no later than 45 minutes, no one wants to spend close to two hours waiting for a resolution and then wait what could really be another 45 minutes to eat at this hour.

Sorry, guys.  Your food is great, but I can't handle it twice in a row.  I might still stop in, but I'm not using you for delivery in the future."}
{"text":"Have downsized their pizzas, though not their prices. I have been ordering regularly from them, but now I need to find a new place, because this last experience was not good. They did make their \"Medium\" into what used to be \"Small\" - so less for the the same price. And when it arrived, it was extremely thin on toppings. Still tasted fine, but clearly a move is on to reduce the value that you get from them."}
{"text":"Late at night and hungry, I discovered the Cambodian place down the street is a cash-only business. I chose this place because it was the only restaurant on the block with an open kitchen (many kitchens close at 10PM). Desperate times called for desperate measures, and I really should have taken the time to research a better restaurant.

I ordered a seafood deluxe pasta dinner and chicken noodle soup. I was told it would take 10 minutes but it really took 30 minutes. I had planned on eating inside, but since it took so long, I asked for the meal to-go instead. By the time I got my food, I was pretty exasperated. The knot tying the bag was too tight, so I was unable to check the food; this meant I left without ensuring a fork was inside.

The food was very bad. I have no other way to put it. The pasta was completely tasteless. I know there was imitation crab in the pasta dish, but I can't decipher what else there was; I ate less than 10 bites. The soup was terrible, and I only had a few sips. The broth looked like Campbell's chicken noodle soup (except it looked like the same noodle as the pasta), but tasted saltier. The salad looked quite plain (seen better salads in an airport), but without a fork, I was unable to eat. The soup, salad, and pasta (with tip and tax) cost about $16, so I expect a decent meal at this price.

I realize this is a pizza place and I should have ordered pizza, but I didn't want pizza. I also think if you're going to have a full menu, you should be able to properly present what's on the menu. I would've been better off ordering pasta from Pizza Hut. Attempting to eat pasta with a spoon didn't help either. Next time you're in the area, just skip this place."}
{"text":"Meh. Pizza was ok. Nothing to write home about.

Honestly, if it hadn't been 11:30pm on New Years Eve, the service would have really gotten to me. Don't get me wrong, I was still pissed. But I am a reasonable human and realized that it was not an awesome night for these poor girls serving endless drunk assholes. We ordered two pizzas, they only made one. They told us the second would just take 5 minutes, it took 20. All in all the pizza wasn't worth the frustrations."}
{"text":"Wow! That's what I have to say about their \"Hot\" sauce, Wow! I can't get enough of it. Whatever sauce is left after the wings, I dip the bomb-ass breadsticks in. Yummy Yummy Yummy. They have great specials and the girl that usually answers the phone is super nice."}
{"text":"Terrible service, refused to apologize for late delivery, rude/dismissive when when questioned on order status. Decent pizza, but will not order again."}
{"text":"The East Carson Street Pizza Gauntlet Part 5: The Conclusion

The three of us; Kay, her brother RJ, and I were battle-weary. I was feeling especially overloaded since I'd also had pizza twice the previous day. After resting at the Burger King, we found ourselves cold, stuffed with food, and slightly dejected that the last pizza place we wanted to try had changed hands and morphed into a rowdy bar. There was, however, one more place that caught my eye, a parlor I didn't know was on Carson until tonight. 

To recap, we encountered the 4 sisters; Zeeno's the fun, happy, pleasingly plump one. Sal's the darling dimbulb, Pizza Sola is the gorgeous geek, and Pi is the duplicitous doxy. 

Lo there would be a 5th sister, one that would snatch the breath from my lungs and run with it, daring me to chase her down for it, giggling playfully all the while like Catwoman stealing diamonds only because it ensures that Batman will be in hot pursuit. 

Gennaro's is the mystery blonde from either \"Fast Times At Ridgemont High\" or \"American Graffiti.\" I kept catching glimpses of her throughout the evening, encountering her briefly only to lose her in the crowd. 

We arrived at a small pizzeria with only the aforementioned sign in the window. We were the only customers. The seating was sparse, the decor minimal. The trend had been seemingly reversed drastically. 

I stupidly asked \"Do you sell pizza by the slice here?\"

Everyone chuckles, including my companions. 

I could blame it on a long, busy day, but in truth, I was just blinded by her beauty. 

No, not the girl behind the counter. Jeez, she looked to be about 15 and was preoccupied with her iPhone and makeup mirror. 

I'm talkin' about a pizza that comes out of the shadows, walkin' like a dream, makin' me crazy, makin' me feel so mean. Suddenly, I was Freddie Wilson...

http://www.youtube.com/watch?v=dmf8rZfGTKQ&feature=related

My compadres had no appetite. I barely did either, but I took a few bites and had it boxed up. I didn't want to tax my stomach any further. 

Or did the pizza slice want to play hard-to-get? 

The pizza already gave off an aroma akin to perfume. You could see the spices and herbs in the sauce. The cheese was oily or rather, glowing. One doesn't call a pizza like this \"greasy.\" The pepperoni turned into perky, crispy little goblets. The crust was built like a brick shithouse with a soft side. Instantly, it was a perfect 10.  

But again, I only got a taste. I would take it home and not revisit it until the next day. That's when she came out of her shell. It was even better after toasting it in the oven to reheat it. 

This 5th sister was obscure, unattainable when you first noticed her, but after pining for her for months, you finally took her home after she became tipsy, only to allow her to sleep it off in your bed while you took the couch. The next morning, she awakened wearing your clothes with a breakfast prepared for you on the table, not due to any patriarchal need to please but rather because she likes to cook for people and woke up starving. After that it was a few hours of Nintendo during which you discovered that she's a gifted, knowledgeable gamer, all before the Steelers game came on, of course (she's a fan!). A week later she was keeping toiletries at your place. A year later it was co-habitation. 3 years later you're both standing at the altar side-by-side. Zeeno's is weeping and smiling, anticipating the birth of your first child so she can babysit. Sal's is bored and eager for the reception so she can self-medicate with free alcohol. Pizza Sola can't wait for it to be over since she thinks marriage is archaic but came only because she loves her sister dearly despite fighting with her over silly things many times while growing up. Pi's is just bitter, hates what everyone's wearing, and is wondering how much money your obese and balding boss, whom you had to invite, makes and whether or not he and his wife get along.

The One, The Love of Your Life, was found at Gennaro's. 

Thus ended our adventure. 

No, I never expected that the last pizza I would try would be my favorite. There was no poetic license at work here, I swear. Gennaro's is the true gem of South Side's slightly disappointing pizza scene.

P.S. Thanks to Kay's brother and trained chef RJ for providing valuable insights during our excursion."}
{"text":"First, notice this little place has an application for liquor license on the door.  Just what this area needs, another liquor license!  Did not realize that Gennaro's had such a large menu.  Lots of pasta, sandwiches, salads...not sure how such a small place can have such an extensive menu, but I digressed.  

The pizza sauce has herbal favors to go with the cheese on a thinner crust that was toasted just right on the bottom.  Also, the menu has deep dish pizza."}
{"text":"You can tell this pizza has been sitting in the back.For awhile before my friend said it felt like his slice was microwaved and it was still cold. You can't even see the pizzas on display.... sketchy. The Texas Roadhouse sandwich wasn't bad. But you're better off finding another pizza place in Pittsburgh."}
{"text":"This has become my go-to pizza spot in the south side for 3 reasons. I'll expand below. 
1. It's fast and easy to order (online)
2. The price is great for the amount of food you get 
3. The food is consistently good

1. The online ordering is efficient and I've never had to deal with showing up at the store and them not having my order ready. You can order from your desktop or mobile. The order process is easy and you can pay with your card or select paying with cash.

2. I've tried many other pizza places in the south side area who charge $20+ for a large pizza that really isn't that great. Gennaro's allows you to get a large amount of food for under $20. My go-to order is a 1 topping medium pizza and 1 order of cheese twists (think pepperoni roll type of goodness). The total is just over $19 which is a great deal. The hoagies there are also HUGE if you get the full size. 

3. The food is good. Not great, certainly not horrible but it's good. The crust is usually soft and they have a good cheese to sauce ratio for my liking. I've only had the red sauce selection so I can't speak to the many specialty white pizzas they offer. The twists are delicious and make a great addition to any order. The breadsticks are big and fluffy. The only item that I had and would not get again are the wings. The wings were basically deep fried wings with bbq sauce poured over them, they didn't take the time to toss them and get them nice and saucy. 

Overall if you're looking for solid affordable pizza in the south side Gennaro's is a great option."}
{"text":"Tried them for the 1st time last night. Got the ultra huge 45 slice cheese pizza. They delivered in a good amount of time. The delivery man didn't give me any change back, he just left assuming I was giving him the whole thing. The pizza had no flavor what so ever! I think if I'm paying $39.99 for a pizza there should be some flavor to at least get my taste buds watering... & at least automatically come with 1 topping! Not sure if I'll give them another try"}
{"text":"So I wanted delivery in the SouthSide and I was done with Dominos and Pizza Hut.  Lucky for me in my mailbox was a menu for Gennaro's Pizza & Pasta.    I remember stopping into this place after the bar one night a few weeks ago and ordered a feta and spinach slice.  I remember it being fairly priced and oh so good.  Anyways I wanted delivery.  I called up and the girl on the other end of the phone was so nice.  I had a few questions and she had no problem answering them for me.  I had a coupon for a pizza, wings, and a 2 liter.  I ordered wings with just wing dust on them.  A half extra cheese..half pepperoni pizza.  

Pizza was soooooo good.  I must admit the extra cheese side was so much better than the pepperoni side.  

Wings.  Split whole wings.   I loved the \"dust\" that was on them.  It was too spicy for my kids but I LOVED it!  I think these wings could have been better if they breaded them first.  The Ranch dressing that came with these wings tasted like it was the homemade type.  

Delivery was 45mins.   Food was super super super HOT when it came.  Delivery driver was nice.  

Well after writing this review....I think I am going to go order some Gennaro's!  I wonder if anyone has tried their pastas?"}
{"text":"I was not too impressed with Gennaro's. I had a slice of the regular cheese. The crust was a thinner, NY style in consistency and texture, yet did not have the crispness necessary to make the crust good. The cheese was decent and the sauce was a little on the sweet side. It was not a bad slice of pizza, just not very good. I wish I would have known to get the deep dish. It looks really good."}
{"text":"First things first, \"Chicago\" style pizza is not pizza, it's a gimmick. Some restauranteur came up with a gimmick and it caught on. Is it Italian? Even New York Pizza isn't considered true Italian. Thin dough, olive oil, fresh tomato, whole milk or buffalo mozzarella, and fresh basil. That's a true Italian gem.

Let's dissect a Chicago pizza, why does the crust taste like biscuit dough? 'Nuff said. Sausage between the layers of dough? So you steam the sausage? Sounds disgusting when you think about it. Fresh tomato and any other topping and a sprinkle of romano on top. Basically a Chicago style pizza is a quiche, minus the eggs of course. It's American, and Chicago can have it.

Four stars for little chicagos regular pizza!"}
{"text":"Stopped in for a slice. Didn't expect it to take a half hour. Kinda weird that their kitchen isn't at all visible. Usually pizza places with slices for sale have their slices displayed right up front and are quickly available.  This was 8pm on a Saturday and it wasn't busy. Got the pizza finally and it was decent, but I wouldn't go back."}
{"text":"Gennaro's is one of my go to pizza delivery places. I tried someplace different last time just to see what's out there and regretted not ordering from Gennaro's. I usually get the \"Create your own Pizza\" option which I usually special request crispy and it is! I like a place that gives you what you want.

I also ordered their popular deep dish pizza and it was delicious. It was just a little much for me(too much crust, too much cheese), not my usual thin crust style, but I'm glad I tried it. 

I have never had bad pizza from there, the cheese taste good, so I'll keep it in my \"go to\" file under pizza delivery."}
{"text":"Ordered and paid on Yelp. Very convenient. Good pizza. Ordered original crust/thin. Not the best or the worst I've ever had. Would eat it again if in the area."}
{"text":"Has awesome deep dish! Used to be \"Little Chicago's\", still has great pizza though."}
