{"text":"seriously guys fix your website, havent been able to order a pizza online in over a month"}
{"text":"seriously guys fix your website, have been able to order a pizza online in over a month"}
{"text":"i ordered a 5$ pepperoni and a hawaiin pizza...thin. the bill was 18$!!! the dough was gross,the toppings bunched in the middle,and who forgets ham on a hawaiin pizza?! next time will be little caesars...more for  less $! i do not recommend this place at all."}
{"text":"I am absolutely appalled at the service here! The pizza is $5 you cant really expect much but Its pretty good.  The staff however are awful and I will not return.  I have had negative experiences the last two times I have gone.  The first time they refused to honor the special that was painted on the window, there was no manager just a snotty woman rolling her eyes at me when I questioned the fact that their special was painted on their own window presumably by them.  Today I gave them a second chance ordered a carry out and sat down to wait.  4 people came in ordered and left with their food while I waited.  The staff refused to acknowledge me finally more customers came in and someone came up front after 40 min I asked to cancel my order and get a refund.  The first girl couldn't help me, the second girl who was actually the one that took my order and watched me sit for 40 min said the ticket had gotten lost and she couldn't help me finally the manager came didn't say a word just gave me a receipt for my refund and walked away, no apology no effort to make it right nothing!  Clearly customer service is not a priority for the employees but as a manager you should act better.  I turned around to the lady behind me in line and wished her luck as I walked out of the restaurant."}
{"text":"Went here today for the first time. I got the spicy steak and cheese. OMG! Delicious. So good. My daughter got the chicken, bacon, ranch sandwich. She loved it.  I don't know what cheese they use but it was nails for spring. Shout out to this gem of a restaurant."}
{"text":"Oh where do I begin.. so placed my first order ever at 716 pm tonight.. 834 I get a call they delivered my pizza to wrong apartment number and they had to remake my pizza would be 20 mins and pizza would be delivered... boyfriend calls 4 mins later and asks for a discount. The manager Ryan says ok they will give us a full credit for next time and pizza will be there 20 mins... 50 mins later no pizza so we call.. Idiot so called manager had cancelled our order because they couldn't refund our money but never called us.. Oh another 20 mins pizza will be there... 45 mins later no pizza but they said its it delivery car should be 10 mins... 20 mins no pizza and we call and Ryan has the damn nerve to say they are busy and their are other paying customers... 3 hours later no pizza... worst business and don't waste your time. if I could would be 0 stars."}
{"text":"I went there tonight for the first time and I will NEVER go back. It was the greasiest, grossest pizza I have ever had. The crust was soggy and the pizza was dripping in grease. I guess 5 bucks means 5 yucks!! Plus, the place was so noisy with them banging the dough to death at the kitchen. STAY AWAY! Get a cheap crap pizza at Papa Johns instead."}
{"text":"I agree with other posts, staff is boring. Pizza very average. Order extra cheese...not a chance.
Go elsewhere!!"}
{"text":"Higley and Baseline location is the only one I've tried. I'm underwhelmed. Ordered a large pepperoni, it came about with 13 pepperonis, kind of a ripoff."}
{"text":"This location just opened by my house. I saw some less-than-favorable reviews about their other location but we figured we would give them a shot. We had a thin crust pepperoni pizza and mild, bone-in wings. The food was mediocre at best. The wings were way over cooked and the wing sauce had a funny taste to it. Aside from the food, the employees were VERY kind! That's the only reason I'm giving stars. The only \"employee\" who I wasn't too fond of was either the owner or manager. He kept saying inappropriate things, trying to be funny. I have to give him kudos for being involved in food prep, assisting customers and expediting orders though!
I don't see myself going back there since there are plenty other places in that price range with tastier food."}
{"text":"This particular location is terrible. I ordered a pizza, sandwich, and fries. Their website says it will take 1 hour for it to get here. I could've ordered twice from Pizza Hut/Dominos twice...maybe three times...and those orders would get here before that hour was up. You don't get any estimate on time prior to finalizing your order. The 1 hour came and went. I called and they said something to the effect that everything was being placed in the delivery driver's car and will be there soon. Another 30 minutes goes by. I call in and want to cancel and this time get someone else who was very rude and sounded like she couldn't wait to hang up. She said the delivery driver is on his way. Great! I should expect it pretty soon right?

ANOTHER HOUR?!

Once it gets here the delivery driver isn't apologetic at all. In fact, he's looking at me as though I inconvenienced him. By this time its way too late to eat a decent meal with the family. I sit down to contemplate wtf just happened, open the box of pizza and realize its cold. No heat at all. Nothing. They probably had the pizza ready hours ago and had it sitting around waiting to be delivered when the driver felt like it, or had more orders waiting to be delivered so they could maximize his time delivering a bunch of orders. I checked the fries. Cold.

I went to Facebook and found out that many people have had the same exact problem, even worse with burnt/inedible food, ordering in person and it takes forever, etc. I came here to Yelp and found the same stories. I do not understand how this location has remained in business with its terrible customer service and horrible time-management. It is a very poor example of what Geno's is, because other locations throughout the Valley are the exact opposite."}
{"text":"I always order here as it's cheap but still good and it's very close to my house. Lately business has been very bad,  last 3 times I've ordered here something has gone wrong. To no cheese in any of my mozzarella sticks, wrong order and this last mistake. Walked in and was told my order had been picked up already which is funny since I am obviously there to pick up said order. After 10mins of doe eyes looks they finally decided to remake the order and have me wait another 20mins. No food comps or money reimbursement, just a sorry. To me that's bad business."}
{"text":"Pizza is pretty good priced but not best I have had and the customer service needs work.  Staff wasn't very friendly and none even smiled at customers and we're too busy talking gossip amount themselves and very loudly instead of helping customers that are waiting.  Wouldn't come again."}
{"text":"Been going to this place for probably 3 or 4 years ! The service is always slow and the workers range from barely friendly to not at all! Actually the service is poor! Today was the worse! I bought two pizzas and some wings. The wings come in a flimsy styrofoam box Witch kept popping open. When I asked for a bag I got a look like what do you need that for ! After explaining why the girl disappeared and then some guy looked at me like what am I still doing here. Then he said what you missing something! I replied I need a bag. Not happy he looked for bags none to be found. The guy gives me an attitude then ask if I want my money back! No I didn't drive all the way here to get my money back! Then I asked another girl if they had a piece of tape to tape the box shut to prevent it all over my car her answer we don't have tape. Needless to say I will never go there again! Pizza Hut has same deal on pizza and much better taste! The service is always excellent there and the employees super friendly! They probably have wings too which my kids like!"}
{"text":"Went here 3 times before posting this review as my first trip there was quite bad. Half of our pizza was very thick and doughy, the other half was nice and thin but had little cheese.


This place is owned by the Hungry Howies owners across the street. So don't expect anything mind blowing. They are a chain out of Casa Grande.

That being said. It's probably some of the better pizza around if you order your Pizza EXTRA thin and ask for someone to make your pizza that knows how to do it. This place seems to be full of trainees everytime we have been in.

Judging by the name you would expect a neighborhood joint with a big Italian guy named GENO making your pie. This will not be the case. As a matter of fact you probably won't find any italians within a mile of here. It's Gilbert Arizona! The staff is friendly but not very personable in the least bit. You will have no conversation here and you won't be making any pals with the \"guys over at the pizza joint\". It's mostly 17yr old Mormon girls from what I can tell.

I think once this place understands how to proof thier dough correctly and make a good crust they will have a really decent quality product on their hands. At this point, its just too inconsistent and their crust will either taste like something decent or like the pizza was made on Bisquick. My best advice thusfar is try a slice as it seems to be much better than their whole pie.

Hope to come and edit this review down the road once things get a little more consistent. I will definately be eating there again as this place is literally 1 block from my house.

PS: NO BEER."}
{"text":"For a $5 pizza you tend to not have very high expectations...  Even an outstanding $5 pizza is still exactly what it is... But a Cold $5 pizza can only be considered garbage. To add insult to injury it was actually ordered in-house. Yup! Actually waited for our pizza to cook and get cold sitting right there on the counter! 

Like I said you tend to have lowered expectations, but you incompetent order takers (Denise and Taylor) can't even do 1 thing right! ((In my teaching a 3 yr old voice now--------\"So in the future if a customer comes thru the doors... ie: a person that doesn't work with you, say hello, be polite, take the order, process the payment, when there food is done... give It to them!\" Your food is crap, we expect that... your service shouldn't also be!"}
{"text":"Great delivery! We like the pizza and wings!! Get the extra extra large, it tastes the best!! With a side of zub sauce, it's yummy!!"}
{"text":"Great $5 pizzas, but the subs are killer! You need to try every one of them and find your favorites. The buffalo chicken sub was picked by a friend. I took a bite and was hooked. Their Giant Pizzas are great for big families or party's. They feed lots of people and the leftovers can be frozen and reheated like they just came out of the oven. Delivery drivers are prompt, the food is always hot and now that they have online ordering, it's easy to order what we want, when we want it."}
{"text":"For $5 a pizza, this is good stuff.  Got two single topping pizzas - one pepperoni and one Italian sausage.  A bit greasy but that's usual with pizza.

Service was great; cashier was very friendly. Ready to go when I picked it up."}
{"text":"Ham sub was great. Heard the food here is good..but the staff is horrible. The staff has been young high school girls with major attitudes and no costumer service. I have heard how bad the staff is from multiple people on multiple occasions. PLEASE, dear owner, FOCUS on hiring based on costumer service skills and how friendly the people are. I bet you your rating would increase..."}
{"text":"I ordered a a pizza and a chef's salad.  The salad came with no cheese.  I called to inform them of that.  The girl said they could resend the salad.  I asked they include one more dressing on the side.  She said no she would only give me one.  I was surprised by that.  I had to think to myself this place is run by a bunch of teeny bops.  It was still bad customer service.  I think they need some grown up management there."}
{"text":"Great place, the lady that took our order was Super nice.  Ordered the Italian sub and fried pickles. The Best Italian Sub I have had anywhere , hands down.  The bread they make for this sandwich pushes it over the top.  The fried pickles are spears not chips and were Amazing. You could actually taste pickle and not just fried bread crum.  Price is right too.  I'm visiting from Denver and can't wait to return to Genos on my next visit."}
{"text":"this is a very ok budget pizza other than the fact that they poor about a gallon of grease on it. probably all transfat because i got very sick after eating here. everything on the menu is disgusting deep fried oily food. Im no health nut but unless youre the type of person to eat a bucket of mayonaisse you'll find their food sickening. i've been here before and it was fine but i guess it is hit and miss."}
{"text":"With the strong competition that exists from both high and low-line pizza providers, I'm surprised Geno's hasn't gone the way of the Edsel. 

The staff consisted of mostly young girls who, while friendly, seemed to be totally overwhelmed and couldn't come to grips with their duties or the meaning of customer service (OMG, I accidentally charged you $175 for these pizzas instead of 17.50, teehee [takes picture and shares with friends]);  I happened to be wearing a Pink Floyd shirt and a gal behind the counter says, 'Pink Floyd? I didn't know she had a last name.'  

And then there's the lukewarm pizza, so bland it made frozen Totinos Pizza seem like beluga caviar; the tasteless sauce, rubbery cheese, and spongy crust would've even caused an Ethiopian village to hold out for the next UN food dropping.  I'm certainly no pizza snob, there's a Little Caesar's nearby and I'm not shy in stopping by there for a cheap gutbomb, but Geno's is just beyond mediocre.  In this day and age where people are looking to maximize every dollar they part with, I don't see them being around much longer.   2 stars instead of 1 because the staff, despite the problems noted, were certainly trying their best."}
{"text":"I order from this place a hand full of times.  I usually just get there $5 large pizza for carry out.  I do have to say they have very fast service.  No matter how busy they are I usually get my order within 15-30 minutes.  The down side is there pizza lacks fullness.  I feel like the amount of dough that should go into one large pizza, they work it into 2 large pizzas. Sauce and cheese are average.  Also inside there dine-in has a funny smell, like a sewage methane smell that is creeping through the ground.  They seem somewhat clean I just can't get pass the smell.  So I give the 3 stars only because they do have fast service."}
{"text":"Place is not good wait time is terrible and not so good on taste as the owners I feel sorry that they don't have control with there help , I guess that's the reason why it sucks they are never there to watch Quality and the staff acts like you should kiss there ass , as long I remember the customer should be one getting treated with respect , I have gave them more then enough chances , I only wish that we could give a negative stars as this is what this place deserves!!!! Please all be aware !!"}
{"text":"This is our favorite place for lunch! Fernando is the best, seriously never fails to greet us and always makes us laugh and have a great time! When we crave pizza, we always know where to go"}
{"text":"First it's super hot inside however the pizza is super affordable and very good. They have $5 1 topping pizzas to make it affordable for any occasion. The service is great and though delivery takes a while it is normal wait times just like other pizza locations."}
{"text":"2 big slices and a drink for $5! Can't beat the price, and, I'll second the review that called it piping hot.  A nicely made, thin, tasty pizza - served fast and fresh."}
{"text":"I have lived in the area for a while and had been wanting to checkout this place. Good pizza, you get what you pay for. They gave me accurate delivery times and were very pleasant to deal with. I'll be back:)"}
{"text":"Personally I found Geno's to be pretty good. They are duly  staffed by youngins (under what looks like 20) so you kinda got the feel that they had better places to be, but the gal that took our order was nice. We got a pineapple ham pizza and zucchini sticks. It all came out quickly and the pizza had two enormous bubble pieces!!! My favorite!!! The only downside: I wanted unsweetened iced tea and their machine gave me sweetened raspberry....not a biggie, I'll just dump it out and choose differently, although I think every Option is sweetened"}
{"text":"Pizza is ok...nothing special. But the wings are decent...one of the few places in the area that will cook them crispy/well done correctly. Delivery charge is $3 which I think is a little much...other big chains charge $2 and the pizza is way better. I go there cuz its convenient"}
{"text":"This place does not deserve any stars. It is disgusting. The servers are RUDE and the food is inedible. What a waste of 50 dollars. I would never recommend this place to anyone."}
{"text":"Wanted to like this place. I really did. Unfortunately, it is not to be.

Ordered a Steak and Cheese with no lettuce but with everything else. Was told it would take 10 - 15 minutes so I went outside to make a few calls. Went back in and the sub was ready. Drove home and opened it up. What I found was a 7\" long bread with barely anything on it. Too boot, it didn't even look like a steak and cheese with mozzarella. As you can see in the picture  \"Steak and cheese 1\" the one with the tape measure, this had some orange stuff on it, raw onions and nothing else. Moreover, look at how little meat there is on this thing. I mean for $7 plus tax, there should be some substance to it. And what is that orange stuff!!

I decided I did not want to eat this and wasn't about to toss away $7.50. So, I went back to restaurant with orange sub in tow. Got to the counter and the young lady said, \"Oh, you had the steak and cheese and go the wrong one. Sorry about that.\" At least she apologized. Took the new sub home and unwrapped it. Well, my other picture  \"Steak and cheese 2\"  should give you the details. 1 small slice of tomato on each half, LETTUCE (which I said I did not want), and I think there is some meat underneath that. As for the taste, eh. Barely there. It was just a mushy sandwich that had too much lettuce and not enough of everything else.

Based on the two sandwiches, it's clear that the amount of ingredients that you get is very limited. Not much of anything - meat, cheese, or veggies. If the second, correct sandwich had redeemed the first one, well, then I'd say it's a crap shoot as to what you'll get but there was no clear winner here."}
{"text":"Good pizza and fast service. Their sandwiches are good too. Don't know why people have rated this place so low, its way better then any other fast food pizza place around my area."}
{"text":"Order was taken quickly and staff was very nice.
Order came out in a timly fashion
Had the veggy pizza, it was very tasty  :) would buy again."}
{"text":"This Pizza place is perfect for the Kids...One can never go wrong with $5 pizza and flavored crust! Genos has always had excellent service and the food is consistent!"}
{"text":"The price was right but unfortunately that is the only positive thing I can say about our visit to Geno's.

The staff behind the counter looked inconvenienced by us simply walking in the door. We were hungry though so went ahead and ordered. 

When we went to find a table I was equally unimpressed. First we had to try and find a table that wouldn't leave us blinded by the sun pouring in to the uncovered windows. When we finally settled on a table it was clear it hadn't been wiped down since the last costumer used it and it looked like it wasn't the only table with that problem. Lastly the bench we sat on was half falling apart and far from comfortable.

Now to the food. Plain and simple, it was just no good. I have had far better pizzas out of my freezer at home. Wings were no better. 

Next time I want an inexpensive pizza I'll open up my freezer and put one in my oven. The food, service and seating will all be way better!"}
{"text":"Food is okay but the employees don't wear gloves. They use the bathrooms frequently but won't wash their hands. That wasn't char in your pizza. It was shit. Oh the weird thing that looks a lot like small chunks of chicken, actually foreskin."}
{"text":"The food was delicious. Great pizza and sandwiches with a very pleasant staff. Great price also. Overall, nothing negative to say about it. I would recommend to all friends and family."}
{"text":"The food was delicious. Great pizza and sandwiches with a very pleasant staff. Great price also. Overall, nothing negative to say about it. I would recommend to all friends and family."}
{"text":"Have ordered the 2 slice deal with a soda several times.. Employees are good but WTH? It was just 2 slices of pre-made cheese pizza sprinkled with olives and mushrooms put back in the oven for 30 seconds. no extra cheese on top. Please put a little effort in to it. Management problem on \"how things should be done\", no reflection on the employees.  

Also they previously had some outside tables but those are gone, they were grubby even then. Help your people out management.."}
{"text":"It's okay. Slices are okay, salads are okay. Not a great place but okay to swing into for a quick slice. If you drive an extra few miles to Venezia's at 5057 E McKellips Rd 85205 they have killer slices."}
{"text":"Solid pizza but don't ever bother with delivery - it is almost always at least an hour regardless of when you call. Note to Genos management - HIRE MORE DRIVERS :)"}
{"text":"The pizza is decent for the price. We have found that they are usually very busy so we need to check our order when we receive them because sometimes things are overlooked. I use to love the sandwiches from here but the last sandwich I ordered,  the chicken was grey and awful. When I called and explained that my sandwich was dry and had very little chicken, and the chicken that was in there was rubbery and grey, I was told that they are using a different company for their meat. Well I will NOT order a sandwich from there until they get higher quality meats! $7.50 for bread and sauce is ridiculous."}
{"text":"First time for delivery for dinner and it was terrible.  Ordered two subs from there that were burnt and a 14\" pizza.  Won't be back!  I've had take out from there for lunch, which wasn't bad.  Took over an hour to get our delivery; however, they did tell us this upfront!"}
{"text":"This Geno's location is absolutely terrible. It takes two hours for a pizza  (even when they tell you it will only be one hour). They mess up orders and deliver the wrong food and when you call back to let them know that it's wrong the management staff doesn't care. Their pizza has been excessively greasy and no flavored crust. The ladies answering the phones blame the customers for wrong orders and argue about the delivery time. Worst Geno's in the valley!"}
{"text":"Despite some times where delivery gets lost in my apartment complex I can't complain about the Pizza or wings, for the price you can't beat it! Geno's is my go to pizza place!!"}
{"text":"Okay so last night my husband ordered a 24 inch pizza. He asked for half the pizza to have extra cheese and the other half regular. When he got it home, yes one half was extra cheese the other half wad just bread, no sauce no cheese! When my husband called back he was told by the manager well thats what u ordered! No it was not. Mine you we order from Geno a lot and never has the service or this young man's attitude real bad but i do understand how he could honestly think someone would order a pizza that was half bread and i mean bread only! My husband went back today to talk with a manager but of course there wasnt one but in comes the same man from last night that not only was rude as the night before but actually had the nerve to threaten my husband. To think that someone could be that rude and dispectable to a customer and by the way a veteran, i dont think i will be giving my business here again!"}
{"text":"Is it the best? No. Is it the worst? Definitely not. But for $5 it beats the Hell out of little Caesar's pizza. I will say that their Hawaiian pizza is pretty good. Instead of just ham and pineapple, they also have pepperoni and bacon on it too."}
{"text":"$5 large one topping pizza with flavored crust!! What not to like. Their sandwiches are tasty as well"}
{"text":"Hi, my name is Millie and I loved their pizza. But the reason why I rate this restaurant it's because their pizza is way to thin. They also put to much sauce. I like how big their slices are but tooooooooooooooooooooooooooooooooooo big. I like Sals Gilbert pizza 100 times better"}
{"text":"This place is awesome! Pizza slices are huge, the Steak & Cheese sandwich is my favorite. Greek fries are also delicious. The food here isn't  overpriced like some places. Do yourself a favor and give it a try. They're  always busy, so I'm not the only person that loves this place."}
{"text":"Awesome pizza at the right price! Staff is all pretty young but for as busy as this place always is they do a great job keeping everything in order"}
{"text":"Called in today to place a large order for my team. They would not deliver to us because we are located on the west side of the street and not the east side. Very disappointed and will take my business somewhere else."}
{"text":"I called in and ordered 8 pizzas for my sons 5th birthday, I called at 1130 am, the young man I spoke with said that they could deliver for $3 so I gave all my information and placed my order to be delivered between 4-430pm. He confirmed all my information. By 430 no pizza, I called at 445 to find out where my pizza was and a young lady answered, she placed me on hold to speak to her manager, however she never actually put me on hold. The manager Mikey began complaining and bad mouthing me that I shouldn't be lazy and should have picked up my pizza. Needless to say they never processed my order and their customer service is awful!!! This was the first time I ordered and it will definitely be the last! Worst place ever!!!!!!"}
{"text":"Excellent pizza especially for the price. The garlic crust is very tasty.  Huge slices."}
{"text":"Poor quality, budget pizza.  We ordered several for a party.  The Hawaiian pizza would leave one thinking Ham and Pineapple was rationed in Arizona.  Wouldn't recommend to anyone."}
{"text":"Not trying to be mean but It's so cheap and bland it's almost not edible. And the cheese fries I ordered virtually had no cheese on them- disappointing:/"}
{"text":"Ordered two pizzas, one pineapple and one pepperoni.  For $10 dollars and change the pizza was hot, the crust was fluffy and fresh.  The Cheese and sauce were very tasty.  Service seems better than the last time I was in, they were no nonsense and got me through quickly.

Overall a very good pizza for the price.

Parking can be rough, but if you don't want to deal with the parking lot have it delivered.  The delivery service has been fine."}
{"text":"My husband and I tried Geno's for the first time this weekend, and thought it was delicious! Reminded us of real NY style pizza!! Just fold a slice in half and enjoy. Great fried zucchini and mushrooms too!"}
{"text":"Okay pizza place. Sometimes the order takes way to long, but for the price its worth it. Absolutely amazing cinna sticks. Comes in a whole pizza thing and is to die for !! Pizzas are OK.. I have had better but like I said for the price its alright."}
{"text":"Normally I love the pizza I get here. However, I ordered a thin crust pizza and it came out as thick as paper almost and oddly cut, some pieces were burnt and the whole pizza was super crunchy and unappetizing. The saddest feeling ever is expecting a good pizza but then you open the box and it is horrid. I also ordered hot wings and they hardly had any sauce and they were super dry. The only decent thing I purchased was the cheese bread."}
{"text":"You come here for a good, cheap pizza. Hands down you don't come for salads or anything else. Friendly staff and clean and an easy dinner on a budget"}
{"text":"Worst Service but pizza is great. 
Place has a bunch of snotty teenagers working there and lord forbid they mess up your order...you get an eye roll and blamed
For the mistake, then you get to wait even longer for your order and not even an apology. 
Can't lie, their pizza is really good. Especially the Hawaiian. We used to go to the one on Williams Field until it closed. I understand that it was a competing brothers location and there was bad blood...sorry to see them close. Food was comparable and service was WAY better. Unfortunately they had to compete with other restraints and pizza places where the one on Higley is all there is around. 
They could be great, if they would get their stuff together in management and service. The kids need to know that the customers
pay their paychecks and without us, they don't have a job. Whoever owns this place really needs to get a
Handle on the kids they hire and teach them a few lessons in customer service."}
{"text":"Pizza has gone down hill a lot....it use to be really good but something changed. The sandwiches on the hand are outstanding!  The staff has not been very friendly the last few times I have been in not sure when I'll go back."}
{"text":"Sad very sad 
The service was awful
They forgot to put in my order
They could remember what I ordered
They gave me incorrect change
The pizza was doughy 
Skimpy on the toppings"}
{"text":"Worst food I have ever had. I was starving after work and got a bbq chicken sandwich. It was 10 dollars and theist disgusting thing I have ever eaten. It was drenched in bbq sauce I was basically eating bbq sauce on bread. I do not recommend this place at all it was horrible and I wasted 12 dollars on that crap"}
{"text":"My second dad works here and i absolutely love it. The food is great, it's big enough to fit an entire birthday party, and the whole staff is extremely kind. Would most definitely recommend this genos location to anyone who loves pizza and awesome service."}
{"text":"I love greasy disgusting pizza so we eat Here once in awhile. The staff totally suck and now we just expect it and laugh. I think I saw a guy with a full beard and no covering in the kitchen. I checked for beard hair in my pizza and didn't see any."}
{"text":"Prices were very good.I got a large pepperoni 14' pizza for 5$ and it was very good.The staff was extremely nice and service was excellent.Would definitely recommend  a pizza night at Geno,s."}
{"text":"Wife and me have been coming here since they open up this new location,  and hands down its the best New York style pizza.  Either if you order the 18 or 24 inch you can't go wrong!  I recommend this pizza to everybody who wants a giant slice of perfection!"}
{"text":"I went to Geno's regularly until today. 
Last week I ordered a buffalo chicken pizza with no onions, which is something I regularly get from them. When I got home, I saw that there was no sauce on the pizza. Called back and told them what happened, they asked me to take a picture and send it in. Sure, no problem! 
He then decided I didn't need to send the picture in, that I had ordered from them enough that I should know what my pizza is supposed to look and taste like, so he said he was going to credit the account. 
Fast forward to today, my kids want pizza for dinner? So I go to call in an order are genos. The girl gave me my total and I explained that the buffalo chicken pizza is supposed to have a credit on it, and asked to speak to a manager. 
Same guy gets on the phone, says that they reviewed the \"cameras\" and that he had put the sauce on there, so he erased the credit on my account. I don't know what their experience with buffalo sauce is, but you know when it's there. And it sure was not. 
So at the end of the day, I am out $15 because I didn't eat the original pizza, (if I had wanted cheesy bread with chicken on it, that's what I would have ordered), and have been called a liar after being assured that they would fix THEIR mistake. 
Good job, Geno's. 
You've lost at least one loyal customer, and I'll be happy to share my story with anyone else I know who orders from you guys."}
{"text":"Two hour delivery time and we live one street behind them. Typically we pick up in 20 minutes. Today opted for delivery and called them an hour and a half later...was told they don't make orders until they have a driver, regardless what the website says for delivery time. Was told the driver is in my subdivision, again we live the street behind them. Guess we are last on the delivery agenda because we are closest, and they, \"had a rush\". 
Let's see... businesses should plan to be busy if they're successful. Might want to make sense when handling issues. When I mentioned walking over to pick up my order made fresh...was told it is fresh with this driver. At the two hour mark for pizza... ding dong. And looks confused at no tip. Soggy cold. I'm done with this place forevermore."}
{"text":"Amazing! Can't beat all this food for 5 bucks! :) this won't be the first or the last visit."}
{"text":"We ordered pizza from genos like we have lots of times before tonight because of the value. We paid like $8 for BBQ wings and they were delivered with no ranch. I called and after the girl had spoken with the manager, she offers us .50 credit on a future order. Are you kidding me right now? Nobody in this house will eat wings without ranch which I tell the girl. The manager (female) gets on the phone and says someone will be out asap with the ranch. Still waiting 25 minutes later. We will go back to venenzios and hungry Howies in the future."}
{"text":"Great $5 pizza, way better than Little Caesars.  Honey Hot wings are great too."}
{"text":"There was a miss communication... they made it right! Ordered several times from them... Always delicious and good."}
{"text":"I ordered 2 toasted subs on Sunday October 30 2016. When I complained that my sandwiches were (Burnt) I was told that was how they were supposed to be. We did not go to Geno's for almost 2 months and then yesterday Dec 28, 2016 we again ordered 2 toasted sandwiches and the mushroom caps. I was told  $19.53 and pick up in my order in 15 minutes.  When I arrived with debit card in hand (no purse, no wallet) I was told cash only , their credit /debit has not been working all day and I should go to the gas station to get cash.I asked why I was not told this when I was ordering so I could have been prepared. The \"manager\" Bryce did a poor job of explaining the employee slip. After  leaving to go get cash, I complained to Bryce the manager on duty. I was given 2 COLD sandwiches and Burnt mushroom caps also cold. I was only given a 10% discount (1.90) for cold burnt food. The service and quality of food at this location is beyond less than poor. PLEASE replace the manager and staff. I feel you could have a good quality food but I will not go back to this location until corrections are made. I am asking for a $17.63 refund or credit at another store. Thank you. Karen Heaney.  ps If I am complaining there are at least 10 more people out there un-happy with this location."}
{"text":"Generally good but this location is lacking consistency/quality control with their pizza, and the cost for additional toppings is a little high.

I've been here several times before I posted this review, and my review is on this specific location.

The taste of Geno's pizza is a far step above little caesars, dominos, and pizza hut, but this location has pretty consistent problems with pizzas coming out with 4 or 5 big bubbles, and inconsistent disbursement of toppings or little sauce. For example one slice might have 8 pineapple and the next has 1 or 2.  Sometimes you get lucky, other times not so much.

They struggle to evenly season the crust so some parts have little or none of the seasoning. Also, they really don't put a whole lot of toppings on their pizzas as it is, so charging 2 dollars to add a small amount of a second topping to a pizza seems a little high for what you actually get.  Toppings should at least be priced by cost, because some toppings undoubtedly cost less than others. 

Overall if you're ok with rolling the dice, my advice is to stick with buying the 5 dollar single topping pizza since it's the best pizza deal.

PS- My wife likes the Philly Fry's and I have not tried their other menu items."}
{"text":"Good pizza at a great price! Good service, polite, and clean place. I recommend you call your order for pick up, they can get busy."}
{"text":"I would give 2.5 stars, which equates to 4 stars for the pizza and 1 star for customer service, divided by 2.  The pizza is really pretty good and the value makes it very good to excellent.  Unfortunately when you add in the customer service, which is consistently horrid, it is tough to stop here but we often do anyway because we live down the street and it is convenient.  Tonight I called at 645 to place an order for carry out and was put on hold so long I hung up and called back, no answer after 2 tries, so I gave up.  If their service was even passable we would probably stop in once a week."}
{"text":"I just moved to the area and have eaten here a half dozen times. The food is always good and the staff is friendly. At $5 for a pizza, it is an exceptional value. Highly recommend."}
{"text":"If I were just reviewing the food, this place would get 4-5 stars. Any time I call to place an order, I am immediately placed on hold. Once someone finally takes my order, they make me feel like I am imposing on them. The attitude if the employees makes me not want to go in there at all. The have an email address posted in the store to give feedback. I tried sending an email, bit it was bounced back undeliverable. Guess the owners don't care"}
{"text":"I do agree pizza is greasy, better than dry I guess. The crust is offered with different flavors, we always get butter cheese, and for $5 large 1 topping you can't really complain! For my family of 4, we get one of their value meals which consist of 2 large 2 topping pizzas and 20 wings for $20. Not bad deal at all, we always have leftovers for the next day.
So if pizza little less greasy and yes there are teenagers working there who still live at home with mom and dad so don't really worry about their job or maybe they just weren't trained correctly, id say this would be close to 4 stars for value."}
{"text":"Ordered pizza 3 hours ago, still waiting on food... called immediately got the manager who told me delivery time was 1 1/2 hours. We ordered a simple order of two pizzas, and love 1.8 miles from this location. What in the name of hell takes so long."}
{"text":"Very disappointed. I asked the woman on the phone what kind of thin crust they had she said just the regular kind. Turns out out they use a thin crust pre made in some factory somewhere. It's basically a tasteless wafer. The fact that the person that works there doesn't know that good pizza places actually take the time to make their own crust says everything you need to know about Genos. Too bad because the toppings weren't bad. The crust was almost un edible. You'd think in today's world where people are becoming more food aware and critical that owners wouldn't take these shortcuts."}
{"text":"A Hungry Howies rip off. The flavored crusts are exactly the same just not as good.

The $5 pizza is laughably bad.

The only reason it gets 2 stars instead of one is because their giant pizzas are ok."}
{"text":"This place is freaking delicious their pizza great servers are great very friendly and enjoyable to talk to came up from Tucson with their pizza on the mind and had to get don't be a fool stop in and get a slice"}
{"text":"Ordered pizza tonight from genos and the pizza was like tough cardboard leather. 
Worst pizza ever. Beware."}
{"text":"I tried this place twice, the service is horrible. They are too busy bullshitting to tend to the customers. The second time I ordered and they completely forgot about me and did not start my pizza until I asked about it 25 minutes later. I tried to contact management but no reply. Will not return."}
{"text":"Their service is super slow and they all look like they don't want to be here. They also don't really care for customers service. Still waiting on my sub and it already has been 20 mins. Not sure what kind of sub I'm getting but it better be good for the long of a wait. Not impressed"}
{"text":"Have usually had great experiences with the pizza at this location their $5 Pizza is amazing! I ordered 2 large 24inch New York style pizzas for a birthday party and let me tell you the quality is just not the same. there was barely any cheese on the pizza and they put the same amount of toppings as you would for a regular 14 inch pizza. The value is just not there and especially since I was ordering their premium Pizza Pizza I was expecting a more premium experience and taste as well. I would buy their $5 pizza again but never again will I by there New York style pizza. Customer service at this location is Amazing by the way the staff is always kind and ready to help. So I give this place an average rating based on my overall experience."}
{"text":"Had This Genos pizza today for lunch and sorry to say it was not at the top of my list, it was flat with no flavor, no taste, the cheese melted flat onto the cardboard box, the price was cheap but so was pizza.
Little Ceasars might even be better, I know hard to believe. I will not be going back sorry to say, good luck"}
{"text":"Cheap and better than Little Cesar's! Well worth the price if that is what you're looking for."}
{"text":"I was looking for a pizza place one night, and being in the middle of nowhere, Grubhub gave me one choice.  We ordered from Geno's primarily because of the $6.00 pizzas.  The pizza itself was ok, nothing special, but definitely not bad.  The biggest problem is ordering bone in wings.  I have not had an experience yet where the wings weren't basically jerky with a bone in the middle(easy fix though is to just order the wings boneless)."}
{"text":"They really took care of me today when I called about an order I made. Awesome people and fixed my order immediately. No questions asked!!  Wings are saucy!!! Thx guys"}
{"text":"Yesterday I ordered 4 pizzas from Geno at 3:30 p.m. I didn't receive my pizzas until 5:25 p.m. They said it was going to take an hour. That is more than an hour. Not happy at all! The pizzas were already cold."}
{"text":"We have ordered from Geno's several times, the last time was just a week ago. I ordered and after waiting an hour and a half I called them to find out where our pizza was at. The guy on the phone was rather rude saying that the driver went to our address and someone answered the door and said they had not ordered pizza and supposedly the driver said he tried to call me several times. No one came to our door and my phone never rang once! So the rude guy on the phone said the driver threw the pizza away! I find that very hard to believe that they would throw away an 18 inch pizza!!! And when I told him I want my card reimbursed, he really snide that it would take 3 days. Well, I will be monitoring my bank account to make sure it goes in. Needless to say, we will never order from them again!!!!"}
{"text":"Absolutely horrible customer service at this place. At 6:45 I ordered my kids pizza for dinner and after calling 3 times it still was not delivered until almost 9:30PM!!!!! They were so rude when I called and  I will never order from here again. I would have just gone to pick up the pizza because I am only about 1 mile away but I wasn't near home so I couldn't do that. ONE mile and over TWO hours for delivery? The excuse I got was we are busy....

This place sucks, so does their staff and honestly their pizza isn't even worth the $5."}
{"text":"This my second time I have came to this establishment and this is worst experience I have dealt with. I came in and the young gentleman took my order and I asked him to not put certain toppings on my steak n cheese and when I got home those same toppings were on there. I asked for a giant slice with my order then the young gentleman told me they don't sell it after 4pm. When there is no advertisements saying so. It got so bad that they was bringing my food out and I had to ask for a bag and when I did they didn't even bag my food for me they gave me the bag and I had to bag it myself. What type of shit is that? What type of customer service is that. Idk if I was a trick customer but I won't come back here or any other one if the service continues to be like this. Save ur money make ur own."}
{"text":"I don't enjoy giving a place a bad review, but we will never be coming back. Ever since we moved out here a year ago we have gotten take out from here at least 30 times. The food is GREAT, and the prices are good too. Here's where they went wrong. My very first time I got take out from them they gave me 2 pizzas and 3-4 sides of fries and wings to me without a bag. I thought it was odd but just put it on the seat of my car. Once I got home I had wing sauce all over the seat of my car... my fault, I should have asked for a bag. Each time I went back, they handed me my 2 pizzas and 4 sides (including wings) without a bag. I had to ask them for a bag each and every time. The last and final time I went there I asked for a bag, they said they had run out. I explained to them that they never offer me a bag and that I have to ask each time I get take out. I also told them how the first time I did take out with them, wing sauce spilled all over my car. I explained that I cannot bring the food home without a bag and asked to return the food. They credited the money back to my credit card, but made no apology and were actually very rude about it. I will NEVER be back. The food is GREAT, and the prices are good, but the employees are extremely immature, inexperienced high school kids who just want to mess around and snap towels on each other while they are at work. My advice to the owner is to hire employees with a little more maturity.

I thought it would be useful to update this review to say that as of March 2018, the owner of this establishment has NOT reached out in any way to apologize for the terrible service and also has NOT apologized for the rudeness of their manager. I patronized this location multiples time, and have not been back since. It's obvious they have no customers service and don't mind losing business. Look at all my other reviews... this is my only negative review. That should say something."}
{"text":"Conveniently located, cheap, and priced right for what you get. My wife orders the pizza and by the time I get to the location its ready for pickup. Nice option for a not in the mood to cook or clean up night!"}
{"text":"Great pizza and friendly service. Family owned small business. They have sandwiches, wings and salads too...great place!"}
{"text":"Horrible pizza. Extremely inconsistent. Every once in awhile you will get a good slice if you come mid day but if you order a whole pizza prepare for disappointment.

However...awesome hot Italian Sub.

He Cheeseseak is dry and does not contain much meat."}
{"text":"I am very happy with their steak sandwich there bacon fries even this salad is very delicious of course the pizza is great too the staff is very helpful very friendly too"}
{"text":"Good pizza and wings...Great service...all of the employees that I have dealt with have always been very nice and always get my order right so, I keep coming back! Thank you!"}
{"text":"The best pizza place I've found in the area. Awesome pizza, huge slices, friendly people. I go for lunch all the time... and I'm from NY so I'm a picky pizza person :)"}
{"text":"I have never wrote a review before but after tonight and the frustration I decided to warn others. This place is a joke my daughter ordered cheese cake simple right wrong it took them 1 & 1/2 hours and 20 minutes of directing the delivery driver to our house and finally when they found the house they treated her very poorly. I didn't realize this until after he left or it would have been settled right then and there but when I found out what happened we called the manager to complain only to be put on hold for another 10 minutes. If your in the mood to get very angry I recommend ordering from here but if not try another option."}
{"text":"I really tried to like these guys. When they first opened their NY style was very close to what I was use to back east, but the last three orders were badly burnt. Plus they weren't done on time as previously stated."}
{"text":"This place has very good pizza the best ive had in a long time and and there wings are good and there cheese steak fries are the bomb and everything is reasonably priced"}
{"text":"I have only been there once before but I thought for 5.00....it was much better than Little Ceasars!!  We're going to keep going here instead....if we want better...then we'll pay the difference.  Happy with what we got for the price."}
{"text":"This was my first time ordering.  We ordered a large pepperoni pizza and honey BBQ wings(extra crispy).  The pizza was just 'okay'.  It's definitely not comparable to a real New York style pizza.  The crust had too much garlic.  The wings were not extra crispy.  We threw the wings away because they simply were not that great.  The only plus was the delivery time.  It only took 20 minutes for delivery."}
{"text":"I was craving a wizwit walked in took a good 5 min to get service, manager walked up to the counter and then walked away. When my wizwit came it was room temp. And raw onions last time I checked a wizwit has grilled onions portion for the price was not what you pay for. 

The wife's wizwit was cold and lacking in cheese save your money and stomach from this place."}
{"text":"We ordered 2 meals for pick up. My husband picks up gets all the way home and we realize they didn't put my salad in the bag. So I call, and basically was told I had 2 options, I could come all the way back and get it or pay a $3 delivery fee. After being on hold for 10 min and only speaking with an employee a Manger never came to the phone to apologies for thier inconvenience,  pick up the $3 delivery fee and get my salad to me..nope I sent my husband to deal with it. What a lack of quality customer service...I understand an accident of forgetting and item, but do what you need to do to fix it, not charge more. They need a lesson in customer relations, whose running the show over there ? They need to get it together ."}
{"text":"Tried the Italian and spicy pepper sandwiches and cheese sticks, they were great.  I loved it.  Price is right, I would go there again for sure."}
{"text":"For the love of God man, PLEASE get some decent plates to eat off of!! I mentioned in my earlier review  but again I am given a flimsy Walmart paper plate. I don't care to eat a paper plate with my pizza!! I WILL NOT RETURN UNTIL THIS IS FIXED! Get your shit together GENOS!"}
{"text":"It's (obviously) not the best pizza in the Valley, but it just may be the best bang for your buck. My wife and I cruise over probably every two weeks when we don't want to cook or spend a lot of money. For $5, their regular cheese or pepperoni pizza hits the spot. Fast, simple, cheap, and pretty darn good. Very underrated in my opinion!"}
{"text":"Haven't eaten at this location but wouldn't recommend their take out service. Saw one of their drivers down the street from their location smoking a cigarette while some customers food is sitting in the same car. Disgusting.  Save your smoking habits for when you aren't delivering food."}
{"text":"When I went into the store to pickup the pizza I had ordered, apparently I ordered at the wrong place even though I clearly knew i didn't. I checked the number I called and all and I was at the right place. The girl with the tats and piercings (who apparently was still training) was the same girl I talked to on the phone when I ordered. I just wanted my pizza and the girl kept arguing with me instead of getting my order. After one of the guys from the back came to the front and finally took my order, the two of them kept flirting with each other in the back and it took them forever to make my pizza. I've never had a problem at this store so I was highly disappointed. Never going back."}
{"text":"Pizza is just OK. However this review is for the restaurant itself . THERE IS NO REASON FOR  A DOG DO BE IN AN INDOOR DINING AREA OF A RESTAURANT. Outside maybe if they are tied up outside the dining area. I absolutely love dogs and have one myself but they are still an animal and DO NOT belong inside a restaurant. Not even if this restaurant had the best pizza in the world would I ever go back. Too bad for them cuz I eat a $HIT ton of pizza."}
{"text":"I always order takeout.  Not sure how you can't like this place for that.  $6 for a large 1 item is an excellent value.  Pizza tastes good.  Better quality than other $5 pizza pizza."}
{"text":"Geno's has been to our home at least 10 times and is usually good considering the price. Tonight after waiting over an hour and calling back they said they couldn't find out house. Not only that but it wasn't on the GPS they said and our home has been here since 2008. Our # is 7482 and the driver said he only could find 7487? Not to mention there's a light over the house # on the garage and on the porch. Manager was willing to deliver cold pizza but not remake them. We cancelled the order and doubt we call again. YOU SUCK."}
{"text":"I wouldn't give this place any stars if possible.. number one the owner is a dick. Number two I used to work here and absolutely rude to the employees. I came in for a pizza and before I walked in I could hear the manager of the store talking crap. Business of rude people. I work for apple and customer satisfaction is key and Genos definitely lacks there."}
{"text":"Best pizza in town! Awesome bacon ranch fries. Delicious subs! Great service. Beats Barro's any day! Sorry Barro's!!"}
{"text":"In receipt of some coupons, I ordered Geno's for delivery and should have read the reviews first.  I'm a fair reviewer and will sit in the same corner with the others.  Not the best pizza, not very good at all, yet not the worst pizza I've ever had.  The price-line is great and if they can pick up the flavor, PLUS improved product temperature upon delivery, they'd get another shot.

If you're looking for good pizza in Gilbert, there are options and seek them out people."}
{"text":"Ordered a pizza for take out. The gentleman said it would be out in 10 minutes, and got the pizza in 10 minutes. It was very good and at an excellent price. Very happy and will go there again."}
{"text":"Pizza was fast and delicious! Their Philly Cheese steaks are a bit on the pricey side, but it's delicious. The pizza crust was a bit thinner than expected, but it was still decent"}
{"text":"I thought that the pizza was good (7/10). We are from the East Coast and are visiting and thought that it was very reminiscent of what we get when we are in NYC. For the price it was fantastic. Lightly sauced and nice and greasy."}
{"text":"I love Geno's!  I have tried all the sandwiches and they are all excellent, my favorite being the chicken parm. The $5 pizza is great too, even great as leftover.  The best part is the friendly delivery service we receive each and every time we order which is sometimes weekly. I'd recommend using their online app to order as it is super easy and it saves your past orders. Try Geno's if you haven't... You won't be disappointed."}
{"text":"I don't understand all the negative reviews.  You can't base the quality of the food for the price solely on the delivery.  They do get busy so remember that.  Personally I have never had a bad experience here. I think the prices are fair for what you get and my food has always been hot and fresh. I have only had delivery from this location once and the pizza arrived within 30 minutes which is pretty average for most pizza places in this area so if you're issue is delivery, it can be remedied quite simply; Stop bitching and go pick it up.  Maybe because I live around the corner and opt to pick my order up almost every time and also order early (before the dinner or lunch rush). Have also never had an issue with anyone being rude to me. They tell me it will be ready in 15 minutes, I arrive, walk in and pay and  it's all said and done.  I mean do people expect them to stand there having a friggin conversation?  Get over it, they have orders to make. Let's be reasonable. I will be honest, I don't think the Pizza is as good as Barro's across the way, but it is decent pizza for the price depending on the size and what you get.  You have to try different things to see what you like and what you don't. They have awesome wings, and I have ordered a sandwich for lunch on a few occasions with fries and I have to say I am pretty impressed with the quality.  All in all, four stars.  I'm a happy customer."}
{"text":"We really enjoy this place. They serve the good ole greasy style New York pizza that you can't seem to find any where else in Arizona. 

You are not going to get southern hospitality here but service is good and consistent. The guys in the kitchen are great with my son wanting to watch them cook pizza. He stand up on the seat and looks over the wall at them. I don't encourage this but what do you do when the cook is handing him pepperoni to eat. :)"}
{"text":"Decent single cheese slice, friendly staff.  Salad was wilted, lettuce brown and had all of the crummy parts of the vegetables- heart of the lettuce and stem part of the tomato.  Everything is a little grimy.  Hope I don't get sick."}
{"text":"Love this pizza!  Genos has a great atmoshere and fast friendly service.  Great price and great quality!"}
{"text":"I'm changing my review today because of time limitations we've ordered delivery the past two times we've had this pizza and we did not experience the same problems. Super good pizza for the price!  Hopefully they keep up on the delivery end!

Very good pizza for the price, but delivery stinks. Get the garlic seasoned crust, it makes it even better. I'd give it a better review, but the delivery STINKS!  It comes 2 hours late without fail. They make you pay anyways. It tastes disgusting two hours later. They often say they will make you a new pizza, but when it comes it is rubbery two hour old pizza. Eat this pizza, but only if you can pick up!!!"}
{"text":"Pizza is really greasy.  I'd rather eat Hungry Howies or Little Caesars.  Sandwhiches are good though."}
{"text":"For cheap pizza, it is fine but only if you're looking for cheap. They said 40 minutes for pick up. Arrived early (approx 20 min) and it was already done. Needless to say, it was cold."}
{"text":"We eat at Genos often as our kiddos attend the karate studio next door.  Tonight, I am done for good.  I ordered $50 of food and was told 20 minutes - it took over an hour and I sat and watched my pizzas in the rack sit for 30 minutes getting cold.  The woman at the kept telling me 5 minutes.. 5 minutes for my wings:  I then watched her handle money in the till and readjust her hair and walked over to my wings and touched them and the paper lining for the boxes as she was putting sauce on them - never washing her hands.  She couldn't finish so she called another male employee over who also did not wash his hands or put gloves on after folding boxes who finished my wings.  This is so gross.  Never again.  The manager did attempt to give me a credit on the delay and my cold pizza - no thank you. You can find my food in the garbage can outside their door."}
{"text":"Just ordered a pizza at 8:25 for delivery. I live 1.9 miles from the restaurant and it is now 10:11 and STILL don't have my pizza. It was for a little girl sleepover. Thank you Geno's, really appreciate it. I have news for you dickheads. I'm a barber here in San Tan Valley, EVERY PERSON THAT WALKS IN THE DOOR, is going to hear a looong character assassination of your business. And you know what? I will not stop EVER. Every person that mentions food in any manner FOREVER, is going to hear what you guys did. I hope you're proud. Btw, it's now 10:20, WE NEVER GOT THE PIZZA."}
{"text":"I absolutely LOVE this place! I just moved here and there's not that many choices of food restaurants around me that I'd prefer to eat at but ever since I've discovered Genos, Id rather eat here then any other pizza places. I love their philly steak pizza, the honey bbq chicken wings and their fries! Omg there fries are my fav!  I'm probably here at least 2 times a week. Probably not good for my health but idc it's inexpensive and my family loves it"}
{"text":"We enjoy going to this pizza place before karate.  While the pizza is good, it's not the best.  What I do want to say is there is one young gentleman that works there, he has a long Mohawk, who went above and beyond for customer service!  I haven't seen a young person with that type of customer service for a really long time!  I just hope next time we go, he will be working!"}
{"text":"Used to have great service and somewhat decent food, but now dont waste your time, long waits, horrible food, my slice tasted as if it was made the day before, and some girl working was beyond needing help. I was here a month ago and it was awesome, what happened? I changed my review of this cause the guy that was so awesome before no longer works here, and the only reason I gave a review for him was because he said the owner gives a BONUS for EVERY 5 star rating and I felt he deserved that for his hard work and friendly service. I guess he asks his employees to have their friends write positive reviews to make things look better than what they are...so if you see a 5 star review on ANY of the Genos, be leary of it cause its probably a relative or friend who was helping them get extra cash....shame on genos..."}
{"text":"This place has NO CLUE what no soliciting means!!!! Leave you garbage some where else, stay off my property, and learn how to read!!!"}
{"text":"Best pizza for great prices! Husband grew up in a pizza shop, and even he was impressed! Its our new fave place!"}
{"text":"My girlfriend really likes this place I'm ok with it because pizza is pizza but it's nothing special. We did order 20 pizzas for a party and it was a cheap option to feed lots of kids and they loved it."}
{"text":"Food was great. Restaurant was super clean. Staff was very friendly and helpful. 
Lunch for under 4 bucks!! :)

Will definitely come back!"}
{"text":"I really like the Geno's on McQueen but this place has been disappointing.  Their prices are great and that's why we keep going.  However, the last couple of times the Pizza has been undercooked and bland.  The crust was too wet and soft.  Service was also terrible and they don't have the same condiments as the one on McQueen.  Wish it could be better since it's so close to our house."}
{"text":"I gave this place a whirl today for lunch had the philly cheese steak it was heart clogging delicious add fries for2 Bucks heaping order piping hot , friendly service"}
{"text":"Skip this location and go the extra few miles to the Geno's on Williams Field near Val Vista. The Famous cheesesteak at this location is hardly worthy of the name. At the Williams Field location you'll get a proper cheesesteak... 1000% better than here."}
{"text":"I thought the pizza was a really great value. It is cheap but tastes good. The AC is freezing so bring a jacket."}
{"text":"Great service. Nice to eat in and to have delivered. Always ask for the special crust toppings. And never forget the deep fried pickles!"}
{"text":"I would like to start off this review that despite my two-star rating, the pizza at Geno's is actually pretty good! I had not had pizza with breaded chicken before, and it was a pretty good combination.
That being said, almost everything else about this place warranted giving it such a low review. Out of the five or so times that I have ordered carryout from here, half the times they couldn't take my order because they ran out of ingredients. How does a pizza place run out of dough? I don't understand. Also, I've tried to use a coupon for \"Any large one-topping pizza and 10 wings\" for $11, but they didn't accept it because the only size pizza that is valid with is the 14\". How is that the large pizza, when the sizes they offer are 14\", 18\", and 24\"?
Lastly as a side note, I do not recommend the cinnamon sticks at all. When I ordered them it was essentially cinnamon sprinkled on flatbread, without the icing and sugar that it supposedly had."}
{"text":"I ordered dinner from this location tonight.  My family and I were excited to try a new restaurant, especially one that delivered.  I called and placed an order for a pizza, 2 orders of wings, 2 sandwiches and a salad.  We waited an hour and I called to check our order, while I was on the phone the door bell rang.  We paid for our food and brought it inside only to find out it was all cold.

I called this location to let them know.  The manager came on the phone and was extremely eager to make things right and within the next 20 minutes a delivery guy showed up at my door replacing my previous order with a new HOT order.

I was extremely impressed with the food and the customer service was amazing! Thank you Genos for making everything right!  We will definitely order from this location again!"}
{"text":"Worst business ever!!!!!! Ordered a pizza and wings and they told me 45min-hour. After an hour an half still nothing. Called and cancelled order. Its a damn pizza! It takes 20 min to cook. Wings are even faster. I even complained to manager and he just said sorry. I will never order from them again! I suppose cheap pizza means cheap ASS service as well"}
{"text":"I was very sad to see a new girl being 'trained' (if that's what they call it). I  am a trainer myself and was mortified to see this person being treated so badly, I'm not sure how they can call it 'training'.  It was obvious this poor girl was crying and I look over at the 'boss' and he never said or did anything to correct the 'trainer'. I wanted to say something but I felt it was not my place to say anything. They hire someone new and this is how they treat their new hires? I won't be back. That is not the way to train people. I am a very disappointed customer. Maybe people won't care about this but only care about pizza but I ask you: would you send your daughter, mother or sister to work there? This is UNACCEPTABLE behavior!"}
{"text":"I had eaten here a couple years ago, and unlike other Yelpers, once I have a really bad dining experience, I don't go back. At the time, I wasn't a yelper.  But now I am, and my recent experience with Geno's led me to do a review. 
The pizza we had there was really bad. And I honestly believe pizza is like sex... Even if you're having bad pizza, hey, you're still HAVING PIZZA.  But this was the kind of pizza that made me wish I was a pizza-abstainer. 'Nuf said. 
Recent experience was at a stoplight- no, wait, stay with me here.  Heading south on higley, just past the train tracks, not quite to williams field stoplight... Its a one lane road and traffic was backed up to kingdom come.  
I drive a nice sports car with a manual transmission.  A very persnickety clutch, may I add.  And recently have had some health problems that affect my ankles.  I accidentally, embarrassingly, and with a red face, stalled my car, started it up and drove on the whole 3 feet that opened up. Its not like we were going anywhere because of the traffic backed up from the light all the way past the train tracks, anyway. 
The Geno's delivery driver behind me proceeded to honk at and harass me all the way to Pecos, where he pulled up next to me to flip me the bird I posted up in the pictures of this business's profile.  
He then pulled back into Geno's, and I drove on, with my photo and a warm fuzzy in my heart that I could share my experiences with you smart and good looking Yelpers.  
MUAH!"}
{"text":"Not at all authentic New York. Booths are all cut up. Food mediocre at best. Like many others, I wanted to like it, but couldn't."}
{"text":"Not sure why there is so many hate reviews for this place. Pizza is delicious and definitely better then most places. I can also say the same for the wings. Honestly a lite of these reviews seem personal and driven by some other reason."}
{"text":"The service was awful. My pizza and wings say under the lamp for 15 minutes before being brought to our table. The customer service was terrible. The bathroom was disgusting. Paper towels everywhere, the toilet was filthy, I couldn't stand being in there."}
{"text":"Not bad, I tried the New York style cheese pizza for 10.00, I have to say it was very tasty, I was pleasantly surprised and enjoyed it."}
{"text":"I have been there more times than I can count and the subs are the bomb.  I have tried most of them but the meatball is the best.  It was the courteous staff and friendly smile from Jessica that recommended it; and it was as good as she claimed.  Your taste buds will thank you; but your arteries may not!"}
{"text":"I can't believe the owner allows such childish, incompetent employees to run their business! The food is decent... not good, but decent.The only reason we even order from here is because knowone else delivers to our neighborhood! Every time we've gotten a delivery it takes over 2 hours and we only live 12 minutes away! It's ridiculous and I'm sorry to say I'd rather go hungry then to spend another penny in this Establishment! Barros is the way to go or Oregano's if your out and about!"}
{"text":"We just moved to the area and decided to give Genos a try.  Service was quick and the driver was very friendly.  The food was amazing.! We ordered an Italian sandwich and a pizza.  It was fresh, tasted great, and made the way we ordered it.  I wholeheartedly recommend Genos Giant Slice to anyone that wants great food!"}
{"text":"I am amazed at the bad reviews for this place. I have been here a dozen times and the staff is always incredibly friendly. The pizza is always hot when I get it home and everyone in the family enjoys it. I will keep going and telling all of my friends about this place."}
{"text":"Do I have to give a star? Seriously?
Every time I order from here it is cold. I live in the neighborhood. Always an hour delivery and arrives almost ice cold because it just sits there.
I'll finally give up the lower price for better product.
It's not worth it."}
{"text":"Awful. Quoted 60 minutes for our pizza, and hour and a half later it still was not here. Called and said it would be a few minutes. Won't waste time or money again at this place."}
{"text":"This was one of the purest culinary experiences I've ever had. I find myself wanting to write paragraphs to explain my experiences dining here. Instead I believe I'm going to just keep it short.
I've eaten from here twice, each time had the same level of quality. And I can say that up to this point in my life Geno's is the worst pizza I've ever had in my life. 
I'm far from a food snob, but I do not say that lightly, I've had some bad pie in my life, and I can confidently state this was among the worst anyone could ever hope they avoid. 
Crust.. I've heard it said as a joke before, but it actually DID have the consistency of the cardboard of a pizza box! 
Toppings... each pie had some on them, none offensive, but no real flavor addition.
Cheese... again, I'll say this, the entire pie had a coating of it, but it was strangely non-stringy, and had no real texture, it was seriously, the worst cheese ever.  
If you're in Gilbert, and desperate for dough with stuff on it, better to get a Tombstone pizza, or go deluxe and gourmet compared to Geno's and order Hungry Howies, Pizza Hut or Domino's. 
Actually, as local delivery in the area goes, though slightly overpriced, I like New York Pizza Department, it's far from the best Pizza in the world, but I confess a real fondness for their calzones. But that's another review for another place.

But trust me, better to eat your own foot than a pizza from Geno's Pizza!
(OK, this wasn't that short! But you've been warned.)"}
{"text":"Service is so slow! It took 40 minutes to get 2 subs and I just head an employee say, \"What are they going to do, fire me after I just put in my notice?\" They don't really seem to care about their customer service at all. One sub was made wrong (specifically requested no onions and was noted on the recipe but had onions). The restroom was disgusting."}
{"text":"I've been waiting for 3 hours for my food. Every Time I call I get told its on the way. Asked if I could come pick it up and they told me it was out for deliver. Won't do a refund and cancel the order either.  I can't comment on the quality of food because I haven't ever got to eat it."}
{"text":"Not bad for pizza. The only thing I don't like is the greasiness. It just pours grease. The flavors are good but everything falls off the slice. maybe too much sauce? My husband loves the place so I guess it just depends on what you like."}
{"text":"Pizza slice was decent for a giant slice. $2.50 for cheese. Place was unbearable to dine in though. Jim the owner is to cheap to turn air conditioning down. Was about 90 degrees in dining area. Also they were out of plates right at lunch time."}
{"text":"Stopped in to Ginos at 10:15 am to grab a couple of slices. The guy behind the counter says to me \"I'm putting together a big order for a school and need about 30 minutes\". I thought to my self... 30 minutes! How long would it take to grab me a couple of slices? The name of the restaurant is Gino's Giant Slice. You would think they would have some slices ready. I didn't stick around and probably won't go back. Good luck with the lunch rush."}
{"text":"Absolutely love it here. The food is great, the employees are nice and it's a clean atmosphere!"}
{"text":"We recently moved to the area and are serious about our pizza. We eat pizza several times a week, breakfast, lunch, dinner and desert. We like variety and if it is good pizza we add it to our rotation. I even like bad pizza. 

Geno's Giant Slice became a regular in the rotation quickly. This is good pizza and very good prices. Excellent flavor. Although the family likes a cheese or pepperoni pizza, I have tried their combo and it was excellent. Wings and Zucchini are better than average. We typically get a salad and have been happy with that too. 

We get very good service from the young employees and managers. Ordering online is a convenience and our order is always right.  It's small and they have some big screen TVs. It's clean. I personally wouldn't dine in but we often see respectful Red Mountain students or small groups eating."}
{"text":"Pizza was cold, and bread was paper thin and chewy, also cold. We ordered our food for take out. We were left waiting much too long, when finally called up to get our food, the employee handed us our pizza boxes that had already been sitting for almost 10 mins. Unacceptable service for food that was just as bad.  It was our first time trying this place, it will definitely be our last."}
{"text":"New to town and ran in here for a quick slice after going to the grocery store.  The place looks pretty standard for a suburban strip mall pizza place.  I was hoping they would just be throwing slices in the oven to heat up and I could get one quickly.  The guy working was polite but said it would be 10 minutes, which wasn't what I had in mind.  When it was finally ready though I was really impressed with the flavor and consistency.  Big, chewy and crispy new york style foldable slices.    Will probably order to-go here in the future."}
{"text":"pizza was not good at all, staff wasn't very friendly.....I wont eat there again..... frozen pizza from the store was better then their pizza......"}
{"text":"I'm really surprised by all the negative reviews. I've only been a couple of times, but was satisfied. I felt the quality was good for the decent prices. I did find the cheese steak a little bit bland, but I'll try it again. 
It's not extraordinary, but it is good."}
{"text":"Pizza is not all that, slices are anything but giant and not worth the money. Postmates ordering options are terrible. Did not get the pizza I was expecting. Big bubbles all over the pizza and zio pizza and wings in Mesa on University is so much better. Will not order from this place again."}
{"text":"Giant slice is right. Very good. I wasn't a big fan of the cheese steak. Kind of dried out and the cheese wasn't quite right. Great lunch for the money though!"}
{"text":"If your looking for cheap pizza, this is the joint. For $5, its much better than Littile Ceasers. The service can be a little slow, and the staff is just ok, but for the price, go for it!

Definately try the Williams Field location for sandwiches...it is bomb!"}
{"text":"I love this pizza! Especially with Ranch crust... I crave it and have to have at least one time a week! And yet it's only five dollars? Don't let the cheap price fool ya...This is some of the best pizza in town!"}
{"text":"Don't try calling in to order. I got a busy signal for 10 straight minutes.
So I drive there to place an order. I would never eat inside there the temperature was extremely hot & uncomfortable.
I ordered and gave my debit card. They don't have a scanner. The cashier was manually typing it in and telling me it was declined. I opened my BofA app to prove I had lots of money, which I did, but she couldn't type it in. So I left with nothing.
Safe your time, order a Hungry Howies or little Ceasers, jus as cheap and way better!!
..... I drive straight to little ceasers and big surprise my card worked just fine!!"}
{"text":"The first few times we came here the pizza was fine and we like the flavored crust but we got the garlic breadsticks, they are soo greasy that the box leaked on my car seat. I would not get them again and I can't say that I would choose to go there again."}
{"text":"Terrible pizza, terrible service. This place will not be open long!"}
{"text":"Ok pizza. We preordered and it didn't seem fresh because it was dry. Not enough sauce and the dough was like cardboard. The wings were good. The garden salad was plain and the lettuce was not cut. Kind of disappointed because the pics looked great. Maybe its better if you eat it there."}
{"text":"I love this place for $5 pizza.. and the greek fries are great!!!!!!!!! get the everytime.. thanks geno's"}
{"text":"I got what was expected. 
They advertise low cost items and for the money that you pay you get decent food.
I got a large 3 topping pizza and wings for $16. I'll get 3 meals out of it, so it's a decent deal.
The food is not bad, it's not Rosati's, but I didn't pay $30 for the same size pizza either...
I gave 4 stars because I order extra sauce and certainly did not get extra sauce, that happens everywhere though.
It seems I am doomed to 2 things when eating out: raw hamburgers and no extra sauce on pizzas, lol.
I will go here again, hopefully get my sauce next time. :)
Give Geno's a try, you might like."}
{"text":"I'd give them zero stars if that was an option! Took 1:45 to deliver my pizza. Arrived semi-cold and soggy. When I called to find out where my order was, the staff was condescending and rude. Also very aloof. They admitted that the driver had left :20 earlier so my pizza sat in a bag for over a half hour. Giant fail!

You're making pizza not curing cancer. It shouldn't be this difficult! There are so many better options nearby so skip this train wreck!"}
{"text":"Pretty good pizza, wings and sandwiches at great prices!!  Young kids not real good with customer services skills, but not bad either.  We go there regular and even buy their pizza dough to make our own pizzas at home occasionally."}
{"text":"The pizza is awesome but like another diner pointed out this place lost all my respect when I was in last picking up my order. The three boys leaning over the counter and playing with sauces and spices grossed me out. After one coughed without covering his mouth I had to ask the girl behind the counter to have them get down or I wanted to speak with management (which I should have anyways). They were so unsanitary in their immature display of socializing. I can't believe this place allows this to go on. Complete disregard for other customers in a number of ways."}
{"text":"My wife and I popped into Gino's for the first time this weekend, and sadly it will be our last visit.

First, we had to veer around a mess of spilled ice cream and food in front of the entrance, which based on the crustiness of the spill it had been sitting there for a while.  We walked in, and the place was pretty dead; no customers inside and in the 30 minutes were were there we only saw one person come in for a pickup.  Just a few high-schoolers idly gabbing in the kitchen, apparently too lazy to go out and clean up the mess.

We ordered the cheesy bread, fried mushrooms, and a cheese pizza (yes, it was just the two of us, and yes we were starving :-)  The pizza arrived, and the first thing I noticed was the puddles of grease pooling up on the surface, letting me know this was topped with that oily fake cheese rather than real milk cheese.  No surprise, for $5 I wasn't expecting top shelf ingredients.  The next thing I noticed was the pepperoni decorating my Cheese pizza.  I let the cashier know about the mix up, and she asked if I wanted them to cook a new pizza.  I could see the high schooler in the kitchen giving me the stink eye and knew that I would be getting some fresh pubes and saliva in my pizza and elected to take a pass on a replacement pie.  And how in the world can you screw up a cheese pizza!

We ate the cheesy bread and mushrooms, and then asked for a box to take the pepperoni debacle to go.  The cashier hands us a box that is slimed with grease and food debris; we ask for a clean box and more stink eye ensues.

Overall, my expectations were extremely low for a place that sells $5 pies, and Geno's still managed to disappoint me.  The place seemed dirty, the food was greasy and lifeless, and the service from a bunch of high school rejects was atrocious."}
{"text":"Typically a good experience yet tonight it was poor all around... Besides waiting and waiting on the phones we received the wrong pizza size and not even cut.  I called to ask we get the pizza we ordered, the girl on the phone said we hadn't even paid which was incorrect, we had paid and tipped $3 to the driver who left 5 minutes before.  They then said we could get a reordered pizza and that's all we wanted, what we paid for.  Then 15 minutes later a different person called and said we did get the correct order just in a larger box.  I owned a pizza shop for 9 years... We did not get what we paid for."}
{"text":"The pizza is over priced for poor quality control.  The manager is rude and unwilling to atone for the lack of standards. When you have a house full of kids and wait an hour and a half for you delivery and when it arrives it has half the toppings and for what is worth poorly cut. When you ask for your order to be done right your told to wait another hour and a half. So I go in and the manager tells you that yes it's poor quality but he would eat it anyway. Yeah I'm pissed right now but it doesn't change the fact that I won't be back."}
{"text":"The pizza is great but the cheesesteaks are so amazing!!! My son constantly asks to eat at Genos because he loves the cheesesteak! The staff is friendly every time we order."}
{"text":"I've given this place too many chances and I officially am no longer a customer. They took away the ability to use your card online. You can order online but they only accept cash when they deliver, no checks. I never have cash and shouldn't have to scramble. This is 2017, not 1990! 

Last weekend I called at 8pm to place an order and was immediately put on hold. I waited, the background noise was ridiculous when talking to the order taker and if they are going to force people to call in who use debit or credit cards then at least have a decent quiet spot for people to answer the phone. I placed my order of 2 salads and a cheese pizza. The girl said it would be here within the hour. Okay fine, it's late so what's an hour...so we waited, and waited and waited. Finally at 930 I called and the driver answered the phone and told me he had been trying to call me but I wouldn't answer my phone and that the address I gave didn't exist. Okay...so he repeated back to me what the girl wrote down and she had my phone number and street name wrong...I shouldn't have to think to ask them to verify the address and number she wrote down because any other pizza delivery allows you to order and pay online, so if I make a mistake then that's on me! The manager got on the phone and said he'd make a new pizza and have it delivered...finally 2 hours and 15 minutes later our food came.

Here is where I feel horrible...I feel horrible for the employees who work for the irresponsible owner of this establishment because they take the brunt of people's frustration. I feel horrible because the poor kid who delivered my pizza got no tip because the manager said it was on the house (yes that was nice) but now there was no slip to sign and I had no cash to hand this kid. He said he didn't need the tip and I apologized profusely to him. I told him to please tell his management staff to send the message to allow folks to pay online. If the driver sees this, contact me please because I owe you a tip!!!

I'm not a fan of the pizza here in AZ because we had many great NY style pizza places in FL but I did like the taste of Geno's pizza and their salads are really good but it doesn't make up for the frustration!  I don't even have the energy to type everything that happened the time before but bless the driver (again) for having patience while he sat at my door for 10 minutes trying to help me pay with my card over the phone since they refuse checks. No more. Bye Geno's, I am breaking up with you for the last time. I don't like yoyo relationships. Please improve for the sake of your customers who keep your lights on."}
{"text":"Early Afternoon Lunch, around 1pm
December 27, 2017
Ordered 1Large Pepperoni and 2 Drinks
Dined in, myself and 14 year old daughter.

Unkept dining room, papers all over the ground. All tables in need of wipe down. We did it ourselves.

Tables are provided with individual napkin holders. The one on our table was empty. So was the one next to ours. Had to swap with a table 3 over.

Men's restroom was also out of paper towels. Employee notified took no interest. 

All employees were nowhere to be found. They all disappear somewhere in the back unless the phone rings, then the girl comes around the corner and answers it.

Pizza actually tasted decent and was as expected.

Upon exit, no lids were provided by the beverage stand. We waited 5 minutes for an employee to come out from thier hidden area, due to the fact that the phone finally rang. Only after the long call were we able to ask for the lids. One other customer was in need of a lid as well. It was a very long process just to locate the actual lids, so we we're surprised that only 15 lids were taken on and put by the station. This process is bound to repeat itself 15 customers later. 

All in all, would not go back to this location."}
{"text":"We live close and are regulars here. Tonight we went here for dinner and it was great. The pizza tasted better than normal. It was not very greasy at all. I think it was because of the new paper I noticed under our pizzas. 

I also met the manager Michael tonight. He was super nice and wanted to make sure everything was good. 

I still don't think they should charge 80 cents for a small ranch cup but that is my only negative."}
{"text":"Gave this place one more shot, what was I thinking?  Honestly I can't believe this place is still in business.  Where is the manager??  You would think with this poor of reviews, the manager would try to make some changes.  Won't be going back.  I can't imagine in another year, this place will still be in business."}
{"text":"This place is just an old school pizza joint...with really huge and delicious pizza! The place is bland, smells like pizza, kinda of reminds me of a skating rink when I was a kid. But the pizza really is pretty good and pretty quick service. Though I don't think anyone who works here knows how to smile. We go here for some quick good pizza and for the price it's hard to beat. If the service was a little more friendly and smiled it would definitely help them out."}
{"text":"I only come here with my daughter and always have the same thing.  Cheese Pizza and Cheesy Bread Sticks.  Their pizza is delicious as well as their bread sticks.   I see people ordering sandwiches and other items but I figure why mess with a good thing.  Their prices are very reasonable, less than 15 bucks for 2 people.  Their pizza is very cheesy and always served hot. 

The only thing I would change about this place is the parking.  There is always a full lot.  Probably because they share with a karate studio, a sandwich shop I won't mention by name and a vet.  Also very annoying that they have 15 minute parking spots...the lot isn't that big that they need to dedicate 15 minute spots...and ps...if you are eating pizza...maybe walking 20-30 extra feet is good exercise.  Just my thoughts."}
{"text":"#Done
After 3 unsuccessful completely unsatisfying experiences having pizza delivered I'm f'n done with these guys. Delivery times are always at least an hour.
The pizzas arrive cold. 
After speaking with the manager twice now, he guaranteed my pizzas next time would be hot. So last night I decided against my better judgement and decided to give it another go around.
This time the pizzas were actually hot, but a tad doughy, super super thin, (thinner than normal), greasy greasy greasy, and whoever cut the pizza made no effort to make sure they cut all the way through. 
It was completely disgusting.
The manager said something that sticks out...\"You're on the outer boundary of our delivery area so that's why they're cold.\" Hmmmm....Barros is in your same parking lot and they get it right every time with the same delivery times sometimes, but then again they serve quality pizza smh

Well, farewell geno's, from now on when I want ghetto ass pizza I'll call those idiots at Hungry Howie's."}
{"text":"First time ordering online, and was able to do so without any incident. I ordered a medium, thinking that should be just right for my son (which can eat and will eat a whole pizza to himself), and was blown away by how huge it was. I even asked the girl behind the counter if this was my order, she assured me it was. THE  box was huge. She started to chuckle,  and I think at  that moment she knew I was a \"newbie \" to this pizza size thing. My son then preceded to tell me that it was indicated on the box, within the name, \"home of the giant slice\". Man, they aren't kidding it really is giant. My son really liked it, and our family tried a new pizza tonight. A win-win for me. Just know that it's really huge slices, bwaha."}
{"text":"First off...I love their 2 foot huge pizza, and I've ordered it quite a lot, however, my disappointment has hit an all time high and I will no longer do business with them again at Higley and Baseline.
I love mushrooms, and when I've ordered in the past I ask for double mushrooms because I want a ton of them. I even tell the order taker what happened last time with the lack of mushrooms, so I don't want to repeat the same incident again. She assures me that there will be lots of mushrooms this time.
Mind you they charge $3.00 per topping for that pizza, so I pay $6.00 for what I imagine will be mushroom heaven, and the pie shows up with literally 2 dozen mushrooms on it...I'm talking only between 4-7 per enormous slice! Once again repeating the same disappointing pizza again!!!
At market value $6.00 buys 2 pounds of mushrooms, and they give me that tiny amount of \"sliced\" mushrooms...RIDICULOUS!!!!!!
PAPA MURPHY'S gives 1 cup of mushrooms per serving size, and they only charge $2.00, so for $4.00 I get 2 cups of mushrooms. Unfortunately Geno's has screwed me over a few too many times with an extremely cheap topping, and doesn't give you nearly what you pay for! 
After all Geno's owners...they are sliced mushrooms...not Truffles!!!!!
Your stinginess with that inexpensive topping has cost you a loyal customer.
You may want to consider revamping some things with the way you do business...your negative YELP reviews are pretty spot on with what I have experienced from GENO's Giant Slice as well.

Jason L."}
{"text":"The only reason there's 2 stars instead of 1, is I've had decent food from there in the past.  Ordered our dinner online. Never received our confirmation so I called. They said we would have it in 20 min. They showed up an hour later with cold dry pizza and a tiny prepackaged piece of cheesecake. Not good at all."}
{"text":"I waited to write this because I was upset. Last Saturday we ordered a large cheese pizza, 2 meatball subs and 1 chicken sub. We were told the wait was 30 minutes, when we got there it was packed with customers waiting, it took another 30 minutes to get our order. When we got home and opened the pizza, it obviously had multiple bubbles in the crust that were popped, but there was no cheese in those areas. The pizza was cut so sloppily that the slices were either huge or tiny. The outer crust was huge- the sauce and cheese stopped a good 2 inches from the edge. All 3 subs were BURNT. I mean to a crisp- black. We took the subs back (the kids were so hungry, we let them eat the pizza) and the manager offered to re-make the subs and refund our money. He explained that the guy making subs that evening was new. He brought us the 3 new subs, (we waited another 20 minutes) asked us to open them and...they too were way over cooked, bread crunchy and dry, but not burned. By this time we were famished so we did not complain, we took our over done, dry subs and went home."}
{"text":"This place has a bad rap and doesn't deserve it.  Yes it's not a fantastic pizza, but it is CHEAP and FAST and a hell of a lot better than chain pizza.  order the Philly Cheese steak pizza, it's freakin addicting!  For $10, what the heck do you whiners want?"}
{"text":"I had very great service it was fast and the server (Jacob) was very nice and answered all the questions I had."}
{"text":"I LOVE the food and we have been ordering since they opened however, I am no longer planning on ordering regularly because the last THREE times they forgot something when they delivered (soda, and twice fries) .  It is hard to be understanding by the third time. Such a shame because their pizza is damn good."}
{"text":"***BEWARE OF THIS LOCATION***
They have fraudulently added a tip to my pick up order! Upon contact with the management at this store they had the nerve to offer a $2.00 credit on my next order! Are you serious?  They have committed FRAUD! Do not use your credit cards here. Pay Only Cash or Go the McQueen location!  $2.00 isn't a lot of money it is the PRINCIPLE of the matter.  1 penny or $100.00 regardless.  STAY AWAY! Management didn't even seemed concerned.  It didn't overdraw my account for 2 extra dollars but it could have been an Ugly outcome for someone pinching pennies and living paycheck to paycheck! Dirty Rotten Scan Drools."}
{"text":"They make a good cheesesteak. The combo of steak and fries reminded me a little of home being from the Philly area. The young lady that took care of me was very nice. Yelp did not have my order there very quickly (I ordered and paid through the app) and people that ordered after I arrived received their food almost 20 minutes sooner. Geno's gets 5 stars because of how great they treated me despite the failure of the Yelp app to get my order in quickly and save me the time I believed it would save. If I were rating Yelp it wouldn't be a 5....this issue has cropped up several times. 

Good job Geno's 5 stars
Yelp -your ordering process needs improvement. 1 star"}
{"text":"I know you get what you pay for
Including ambiance but I went last night and it was pathetic, there were three younger boys there standing and jumping around on the booth, leaning OVER the counter while eating and playing with sauces, spices, and food tickets. They were practically yelling while talking to whoever they knew in the kitchen...then when they were bored of that they decided to ride their penny board and scooters while inside running into tables and stuff. Seriously?"}
{"text":"Not impressed. Would rather go elsewhere. Ordered our food and was told our food would arrive in 45 mins to 1 hr.

 1 hr. 20 mins later, still no food. Called to complain, staff said driver would call with an update. He NEVER called. 

Called AGAIN a few mins later, 1hr 30 mins, when the staff said: that they only had one driver and that that was the reason why our food was late. I have worked in retail AND food establishments ( a pizza place none the less) and i can tell you one thing...

---Staffing issues are NOT the CUSTOMER's problem.---

 After complaining a THIRD TIME, they discounted our food 50%.  Our food FINALLY showed up 1hr 45 mins later and even AFTER the discount, i would NOT have paid that much for our food. 

The pizza was hard and had little flavor with almost no cheese.  The wings were overdone, tiny, and cold, the mushrooms were full of grease, and the cheese sticks were only luke-warm. You could find better food at Barro's or Risotti's, and i've never had any issues when i order from Barro's OR Risotti's. 

Needless to say, i will not be ordering from Gino's again."}
{"text":"My cheese fries and wings were cold because the kids left to run the place were playing around a lot... I can't get over how they reached over the counter and started playing with the dough.... I asked for extra cheese and she forgot... I was tired after waiting an hour for two cheese fries two wings and two pizzas... I hope the manager sees this!!"}
{"text":"Worst service ever!!!!! A bunch of 16yr old kids who have no clue how to cook or provide service. Brain dead employees=a worthless place to spend your money!!!"}
{"text":"Time to update...First of all, I have never cared for their pizza but I gave them the benefit of the doubt because it's cheap and nearby.  However, after ordering a sandwich, I'm done.  First of all, toasted does not mean burnt.  I knew I was in trouble as soon as I opened up the package.  The bread was hard and way too dark with burnt areas on the edges.  Check out the pics.  In addition, the inside of the sandwich was drenched in mayo and dressing.  Some might call that juicy...I call it disgusting.  I work from home and don't always have time to go far for lunch.  I was really hoping to be a regular customer for at least the sandwiches.  Nope...never again...seriously."}
{"text":"I only do reviews in the case of amazing service/products or the opposite. In the case of Geno's Copper Basin it is the opposite. 
Let's call a spade a spade... The special is $5 Large, which dozens of chains do. In this case you get what you pay for. Sometimes it is overcooked and sometimes swimming in grease. The one thing they lack is any sort of consistency. 
Enough about the pizza, what genuinely sets Geno's Copper Basin apart from the competition is the deplorable customer service. That epically poor customer service also comes with a staff that is tragically inept. Simple requests are a waste of your time because they almost never manage to get them correct. They messed up my order yet again today and I called in to discuss with a manager. The young lady who answered was completely indignant about it. My issue was not a major one, simply a request that they cut the thin crust pie style not in squares. The employee told me (after speaking to a manager) there was nothing she could do because I don't pay for cutting and any special requests are a courtesy. She went on to say if it was not cut the way I expected then she can not \"help it\" because that is how they normally cut it. She finished by saying maybe I should have it put on my account so they will see it. I have asked to have it notated on my account which I have been told multiple times it has been. 
I will say in the past there have been mangers who have taken responsibility for the error and were apologetic but not today. 
If you are just looking for cheap (both in price and quality) pizza and you are a very patient person that can overlook 1star service this is the place for you."}
{"text":"First of all, the pizza is vastly overpriced for what you get. This is about equal in quality to a Peter Piper Pizza or Chuck E Cheese pizza. 

Second, the delivery time for 2 large pizzas was around an hour and a half. Luckily, our pizzas were warm upon arrival (not hot). I really feel for the other reviewers who waited this long only to get cold pizza.

Needless to say, we will not order from Geno's again. The pizza quality isn't worth the price and the delivery times are absurd."}
{"text":"The first bad sign was that the girl who took my order for delivery didn't come across very intelligent.  I ordered an Italian sub and honey hot boneless wings.  The sub was burnt and the wings, well, looked like something you would find in the dumpster.  I won't be back."}
{"text":"Went to Genos for my lunch and they got me my pizza in about ten minutes. I ordered the buffalo chicken and my boyfriend was skeptical at first but it was fantastic. The crust is my preferred thinness and the pizza itself was like a morph between hot wings and pizza. Definitely going to be my new go to pizza!"}
{"text":"Got a pizza from here a couple weeks ago and it was ok. They have an on going contest in store I am going to try one of these days. It involves eat in a 24 inch pizza in one sitting without any help."}
{"text":"I have never been inspired to write a review on my eating experience as much as my first encounter with Geno's. I had also had to write this review, again, considering it somehow disappeared and how disappointed I was in myself for having fed my family this quality of food...really upset.   Earlier this week we decided to order Geno's after having received a flyer in the mail.   Considering all the Pizza competition in this tiny San Tan Valley radius, we were extremely disappointed with the quality of food we received.  We are realistic people and understand what to expect when getting \"budget\" friendly pizza options.  However, when we initially placed the order via phone, we were told it would he about a 45-60 minute wait.  We figured that that since they were this busy that their food must really be good. However, we were really hungry.  It was the middle of the week, it was late evening,  and we had just gotten home from work.  We decided to call back and requested if they could have our order ready for pickup.   They said it would be ready in 15 minutes.  Happy with this option I jumped in the car within 10 minutes and got there within another 5.  When I arrived, they couldn't find my order.  I repeated to them my address,  my name, my phone number several times.  At this point I was thinking they forgot my order.  It 5 minutes for them to find it and it had been sitting on a large rack with other orders.  I don't recall if there heat lamps or not.  When I got home, the pizza and wings were cold.  Not even slightly warm.  The pizza was poorly put together and looked and tasted like whoever had put it together didn't care about taste or at least have minimum standards of quality.  We have ordered budget friendly pizza options from all the other local pizza places and not once have we ever received cold pizza and wings and that was with delivery which usually takes longer.   We have realistic expectations on what to expect with certain food options but this was NOT worthy of our money.  We won't be giving Geno's a second chance.  At the time i wrote my review, there were a alot of negative reviews (which disappeared from yelp somehow) and the owners hadn't respond once to any comments on lack of decent quality.  To me this shows that they don't care about the customer and I will  spend my money elsewhere moving forward."}
{"text":"Horrible  management . Pizza is what u pay for... a gallon of grease!this is by far a disgrace to new York. This is a chain an won't go far, if your selling this for food you should think about just donating it to the homeless \"sorry homeless\" but this pizza and service sucks... horrible... crap.... ect...ect...."}
{"text":"Ordered online at 6:45 on a Wednesday evening. 14\" Pizza with onions and mushrooms. Boneless wings $32. Arrived cold at 8:15pm. Not great. Too expensive. Won't order again, won't be stopping by."}
{"text":"Love this place! Awesome pizza and great service! Kelly was great and understanding with a difficult order!"}
{"text":"I heard some friends talking about that genos is cheap and worth the $5 they charge for a pizza, well my first experience was horrible, first i waited at the counter for about 4 min before anyone decided to attempt to help me, Finally i was able to place an order that took 5 min cause someone was training, the food only took about 15 min which is average for what i wait on the ordinary, after getting home the pizza was soggy from all the grease, flavor was a  3 out of 10, i just moved here from michigan and hungry howies was my place back home, i realized there is one down the street, and also another genos, so i will try the other location down the street and give them another try, but after all i will have to go back to my roots to hungry howies. I will give them another chance as soon as the grease stain from my car seat goes away."}
{"text":"For $5 you can't go wrong.  It actually tastes like real pizza unlike little ceasars for example.  The flavored crusts are a nice feature to add to any pizza. I will be back and hopefully will be hungry enough to try the fries"}
{"text":"decided to give this place a shot today with the family and I must say we were not disappointed.the pizza was delicious I do recommend a 18 inch because it has a different texture then ordering the $5 large. It's worth the extra 5 bucks.its thin crust, flaky and crunchy, not soggy. we also purchased the subs which were the Italian,the meatballs, and the chicken bacon ranch the bread was delicious toasted perfectlyand were all delicious. We also ordered the Greek fries which were also very good those were a bit soggy in a sense because of the Greek dressing and the cheese but all in all not bad.I do recommend you order takeout because it is extremely hot in there...and I also recommend if you will order to give yourself some time because it does take a whilebut it was worth it. The prices were not bad very reasonable and they also have online coupons in case you forget to bring the flyer they send out. Going home to NY, the first thing I do is buy a slice...this place hooks it up pretty close!"}
{"text":"Well, Geno's has raised their prices and are not accepting coupons from their site.  We've now had several not good experiences here.  They ran out of fries after taking our order that we were picking up without telling us.  That would have been nice to know before we picked up our order.  And then, they also go the order wrong.

Another time we ordered two orders of fries, one order had a lot of fries and the other had half of it, yet we were charged the same price for both.  We also ordered onion rings and I think that only 1/2 the container was filled, which onion rings are not very compact.

They would not honor a coupon from their own site.  What gives.  Tonight we ordered 3 subs and the subs were mediocre and had less meatballs than they had normally.  When I inquired why our order was so expensive, they said the price of their subs went up last week.  So, from earlier this spring the meatball subs were $5 and now $7?  Ridiculous price increase.

Maybe the pizza is cheap, but I think we'll see if we can find another place nearby maybe towards Safeway area that is comparable.  And, as some other people have written, the people they employ are a bit rude.

As much as my husband loves the bacon ranch fries, I'm just not interested in going here anymore."}
{"text":"Great tasting pizza especially for 5 bucks. Better tasting than little ceasars 5 buck pizza in my opinion. Even better than pizzas twice the price at other places. The whole menu is good and affordable, i like the wings and salads and sandwiches too. I have had good luck with service here. Always get my food fast."}
{"text":"I'm brutally stunned that a place which advertises $5 pizzas doesn't prep a few of the most common types of pizza for the inevitable lunch / dinner rush. it took 20 minutes for them to make a basic pepperoni pizza and I actually walked in before the dinner rush. joke's on me, every other customer in line behind me got their order first, and when I finally asked the counter girl if my order was coming soon, she pulled the order off the heating table and just thrust it at me, no explanation or anything.

the pizza tastes like a $5 pizza, but there's no way it was worth the wait.  also, they advertise pizza by the slice outside the building but on the inside they amend that offer with signage indicating slices aren't sold after 4P. my guess is the owner/manager at the higley&germann location isn't super bright, or he/she is super shady"}
{"text":"5 stars when they first opened (chicken bacon ranch pizza was the best!)... I hate to admit it, but we would eat something there at least 2-3 times a week. 

Now, the pizza/cheese tastes different, way over greasy/oily, people will pay a few dollars more for quality (and support a local business). 

It's almost like the ingredients were much higher quality when it first opened. 

If there was a change, back to the initial high quality and care... We would be back, sorry old friend."}
{"text":"Zero star worst delivery service I have ever seen,anytime I order  a pizza from here it takes 2 to 3 hours,and I only live in Johnson Ranch(5mins away)and know one cares that the delivery service suck!!!, why would you eat here when you have papa johns up the street,the gives you 50% off when the Dbacks or Suns win,we will never eat here,and I tell everyone I know"}
{"text":"Another 1 star review for Geno's. Why do I keep ordering from them? No other pizza places deliver out to our neighborhood, so I reluctantly give Geno's business when my kids are home, I'm at work, and they need a quick dinner. In the future, I'm going to plan better and get some frozen pizzas or something because the customer service here is absolutely TERRIBLE. Deliveries take 2 hours when they say it will be under an hour, the staff is ridiculously rude. They obviously don't care because they have 2 stars and haven't changed anything in the 2 years we've been ordering from them!"}
{"text":"Just moved to the area, we weren't impressed with the service or the food. 

Ordered three orders of wings asked for three different flavors but received all the same (naked). 

Ordered lasagna- sauce was soupy 

The zucchini sticks were good. I was pleased with them."}
{"text":"I wasn't expecting anything really when I came here. Just happened to be the closest food joint to where I was working. The pizza was pre-made (cheese) and they just reheated it with the toppings when I got it. That would have been fine, but it seemed to have been done for some time.  The prices weren't bad if the food was decent, but I won't be back."}
{"text":"-lackluster staff

-good food,  some of the time (depends on who is working that day)

-Won't honor the prices posted on their website.

   When it's good, it's great. When it's not good, I feel like an idiot for trying again.  You like cheap? Go for it, but don't say Yelp never said \"I told ya so\""}
{"text":"Pizza taste like cardboard with zero flavor and stay away from the chicken wings they are dry and were cold."}
{"text":"I love their NY style pizza. It is so good and the price is amazing. We almost always get the double cheese double pepperoni. My mouth is watering just thinking about it writing this."}
{"text":"I had the worst service! The pizza is good but very rude, the cashier couldn't even hand me the money he threw it on the counter."}
{"text":"This location is just as bad as the Queen Creek location.  Ordered 4 pizzas 1 sub 1 salad and wings and literally every part of the order had something wrong. Daughter picked up order without checking but still they should have gotten something right.  So far the Higley/Pecos location is still good if you're already in the area but Geno's isn't good enough at its best to travel for it."}
{"text":"We've ordered from Geno's several times now and for the prices you pay it's decent pizza for the price. I like the seasoned crust. My favorite choice here is The Italian -  pepperoni, ham, salami and pepperoncinis. 

Also, try ordering a Geno's large pizza and throw some bacon on it (for you carnivores out there). 

Wings are decent - not the best I've ever had, but not bad. I like the hot and hot bbq the best. Wife likes the garlic parmesan wings. 

Next time around I will probably try one if their toasted subs. The Italian and Steak & Cheese sound pretty good. 

When you call in an order, a lot of times they will give you the coupon discount or tell you about the monthly special, even if you don't know about them. 

I had to downgrade my rating for Geno's since I wrote my first review because of two experiences that I had picking up orders. On one trip to get our pizza we found that it had apparently been sitting there for quite some time - much earlier than we were told, so basically we had slightly warmed pizza. Last week it happened again, except this time I walked in to pickup at the time they indicated it would be ready and was told our pizzas should ready in another 5-10 more minutes. After waiting 15, I asked someone, figuring our order might have been lost. What they discovered was that our order had been ready all along on the waiting rack and they missed it. So once again slightly warmed pizza. 

Update: ordered some sandwiches this time instead of pizza. Got home and discovered that 2 of the 3 sandwiches we ordered were the wrong ones. They clearly have a problem and can't seem to get their act together. Downgrading to one star - I've had enough."}
{"text":"This place isn't worth the low prices!!!!! Yes it's cheap inexpensive pizza but we ordered at 6:25 pm on a lazy Sunday evening and at close to 8:30 pm the delivery showed up. Pizza was small dry and cardboard like the chicken wings were cold and limp outside and dry inside. They included an order of bread sticks yet a giant brown crouton arrived instead. I should of known better after a 10 minute hold to order I convinced myself it was because they were popular and everyone was ordering!!!! If your broke and in little league or you still wear super hero underwear this place is for you adults with tastebuds stay away."}
{"text":"Pizza isn't anything spectacular but for the price it's the best out there. The wings are pretty tasty but be sure to ask for extra sauce since they tend to be a bit dry otherwise. Here is the kicker, you need to take a deep zen breath before calling to place your order or going inside because they employ some of the rudest kids in the industry. If you can get past that this is the best place in town for cheap, mediocre pizza. Bon appetite!"}
{"text":"I like this place only because it has a cheap option for a quick fix for the family or when I am craving easy cheap comfort food. Love the butter cheese crust. Way better pizza joints out there but I compare this to the $5 take and go options like caesars and dominoes and this place is doing it for me right now. Customer service is hit or miss. The girl last night had a great smile the entire time. Thank you. They have sports on TV all the time which is nice and seems to stay somewhat clean if you want to eat in."}
{"text":"We grabbed a pizza to go... asked-for some napkins and paper plates and were told they're for dine in customers only..  seriously had I known that before I purchased I would not have..  just so you know we will never be back."}
{"text":"Absolutely HORRIBLE service!!!!  Over an hour and a half for delivery and they still never showed up. No management and nobody gives a shit. They should be embarrassed to even be in business. Avoid this place like the plague. I'd give them a negative 20 stars if I could. This place is horrible!!!!!"}
{"text":"Very disappointed! I've been here 5x. It's our family tradition to stop and get pies after our son plays baseball at nearby BLD. He looks forward to it. Today, I experienced the worst service! Girl at the counter rolled her eyes at me & the other one at the soda machine stared with a stank face while I looked up at the menu. Y? because I gave my last name instead of my 1st. It's easier to pronounce. Taylor & Denise should not be in the service industry. Couple comes in after us, orders, & gets their fried pickles app before us. 

The chef behind the counter in a ponytail tells Denise this order (3pies) is our order 2x & she does nothing to give us the pies. 5 mun after that, she calls us to hive us the 3 pies that have now been sitting there without our pickles. I ask to speak to the manager. He comes out & tells us the pies were sitting there for 11mim according to the receipts. 

We leave, 2 exits on the highway, & it's the wrong pies. I go back to give the back their cold wrong pies. Denise & Taylor saw me & duck behind the counter. Pies they gave me were toppings my son is allergic too! 

Never again. We'll just get find a new place for pizza minus the attitude & in competence."}
{"text":"Love the pizza and price but yet again make the call in at 5:27 told would be ready in 15 minutes.  Arrive at 5:45 pizza not ready no worries told a few more minutes. I literally watch the pizza be put on the shelf at 5:50 with no one saying anything.  I wait 5 minutes go up and read that it is my pizza and inquire on it. Then they realize I as well as another person are stilling waiting for the pizza.  Again the other place on Higley and Pecos are attentive and quick to get the orders put"}
{"text":"Unfortunately the only thing going here is the cheap price... it's tolerable for a while.  The last time I stopped in it seemed the employees were more interested in being on their cell phones than squaring orders away and answering the ringing phones.  If you've ever called with no answer that's probably why.  This place started off strong a few years ago but has slipped in all areas.  Not a smart move with Barros 100 yards away."}
{"text":"First off, let me say this 4 star rating is not because this is a 4 star restaurant, but it is certainly a better than average bargain for the price.  The interior is meh but clean. Staff not particularly engaging or awake. Your meal comes on flimsy 100-for-a-dollar paper plates and you are expected to eat pizza with plastic utensils -- God gave you hands. Use those instead. With all that said, our pepperoni and onion pizza was served up quickly and piping hot. It was quite tasty and two of us had lunch for five bucks, excluding drinks."}
{"text":"Pizza is good but I was truly disheartened when I went in tonight and the building was 85 degrees when I walked in. I asked the employee why it was so hot and she said unfortunately the AC is broken. Why is an establishment not taking the proper actions to fix this? GET THE AC FIXED"}
{"text":"Worst service ever !!  IAN the \"manager\"  who clearly had no clue how to do his job continually hung up on me when I was calling to make sure my order was canceled after a late delivery time!!!! Every time we Called back to ask the full name of the managers on duty so I could file a complaint   every employee hung up me ! One employee was even talking with the manager while we were on the phone trying to get  Info about her manager  and she told her manager while we were listening that she did not want want any part of this ! The  manager was clearly acting unprofessionally and tried to hand it off to his  employees. Seriously worst customer service  ever '!!!"}
{"text":"Got some Genos philly fries and they were bomb. But waited about 15-20 min for them. Id get them again but id order it in so i didn't have to sit there and wait. We were practically the only ones there too so they weren't crazy busy. But still tasted awesome."}
{"text":"This is a main staple for the kids on Friday nights, we have been going here for years and will continue to. Genos beats out all the other franchise places."}
{"text":"Bad service, bad pizza... Served to us so hot we couldn't even eat it ... Then it cooled down to a greasy mess... Go to little Caesars if you want $5 pizza instead ."}
{"text":"Shame shame.Make sure u know your cross street if you want to order from here.. Otherwise order from some place else..    JJ"}
{"text":"The guy taking our order was nice. The wait time was more than 15 minutes for two steak and cheese subs, which weren't subs. The philly cheese steak and steak and cheese are switched on the menu. The steak and cheese was serve on a burnt bread. The steak was burnt, and the veggies weren't grilled. Overall was a waste of time i would rather have eaten from a drive thru."}
{"text":"We used to love this place. But the last few times we've ordered the pizza has been less than good. It's like now you get less sauce, less cheese and more bread. Who wants more bread on NY style pizza? Very disappointed. If I wanted tasteless pizza with too much bread I would pick up Little Caesars. This last order was the very worst. Pretty sure I won't be ordering from them again unless something changes."}
{"text":"We had the best service from Michael and the Roast Beef Sandwich is the Best in Town."}
{"text":"I fairly like Genos. Its so close to our house, super convenient, and every time we've ordered, they are pretty quick. Their $5 pizza is what we usually get. With the free butter garlic crust. Its not bad at all. Cheap and good for on the go! I gave it a 4 instead of 5 because they have messed up our order once, and their boneless BBQ chicken is horrible. Don't ever get it."}
{"text":"Frustrated that I placed my order for pick after a long day of work and was advised it would be ready for pick up in 14 minutes. Get there and was told no such order wad placed, no sorry no nothing. Awful customer service."}
{"text":"I would give this place no stars if I could, this is now the second time I've had the same issue with my order. I don't eat pizza but my 6 year daughter has been asking for it and I placed it over the phone for pick up, when I arrive they say they don't have an order for me. When I ask them what is there number they tell me and I show them my phone, no response. Awful customer service!"}
{"text":"Out of mozzarella sticks? Don't be surprised if you get told the giant slice can't be ordered: its a lunch only item... \"says at the top of the menu\" Um, top of the lunch menu sure. But the main menu is a different board, without that info.
#fail"}
{"text":"This place does a great job! The pizza is super fast and easy, perfect for last minute dinner or entertainment. The wings are pretty good too!! Service is always really friendly and the staff are quick to help you. Their new manager and area manager care about their customers and live what they do!"}
{"text":"We have ordered delivery and eaten in here a few times now. No problems with delivery when we have had it. Eaten in a couple times too and it was good as well. All in all not bad for cheap pizza. Great mozzarella sticks and their ranch is really good. Will return."}
{"text":"Soooo....randomly decided to try this place because we just moved down the street...ordered online which is cool and convenient...wasn't expecting greatness..WOW!!!! I was so impressed, I am not a fan of pizza, I normally order a pizza without tomato sauce, so that's how I gauge pizza joints. This place makes a phenomenal BBQ chicken and Buffalo Chicken pizza, I mean holy moly!!!!! The pizza came got and fresh, the dough was Chewy and crunchy the chicken was breaded, fried, then put in the sauce on the pizza! Absolutely amazing!!!! Most places skimp on the chicken when they make these pizzas, Genos does not! Fan for life!!!!"}
{"text":"Every time I have ordered from Geno's on Higley and Baseline my order has been wrong. They always forget to deliver the entire order. To make it worse, they are usually late. Why quote a delivery time if you cannot honor that time? I don't understand why if this is the one thing that you do, you can't do it right. It doesn't seem to bother the manager at all that he doesn't know how to manage his business."}
{"text":"Staff just has no personality nor desire to chat. 

Pizza is some of the most poorly made and inconsistent pizza I've tried. Pass.
If you do want good pizza in Gilbert there are other places like Venezias and Cassanova Bros that make a real decent pizza.

No guy named Geno even works there. Just a bunch of personalityless young Mormon kids who know nothing about pizza or how to treat customers so they will come back."}
{"text":"This place was ok and the service was not the best. Not rude but not the most welcoming. I would give the food a 3 but a little greasy. The price was a sweet spot for me."}
{"text":"I just spoke to the manager after waiting 4 days for someone to call me back I need to speak to the owner I have my phone call recorded from speaking to the manager from this location he cursed at me 3 times and hung up the phone all because I received a pizza with a bug in it and wanted it replaced. So before I upload this audio to all the social media sites yelp Facebook google bbb I suggest someone call me and rectify this as I am not being unreasonable and I am disgusted by how one of YOUR managers addressed the situation and I was spoken to . Thank you"}
{"text":"I've only done pick up orders, so I can't say anything about dining in, but from the little that I dealt with the staff, they seemed pretty okay. 

All I got were a couple large pizzas and they were okay. I'd even say they were goodish, considering they were only $5 each and were worlds better than the $5 pizzas from Little Caesers. While they'll probably never be one of my favorite pizza places, they're cheap and right by my house, which is good enough for me when I'm broke and trying to figure out a last minute dinner."}
{"text":"For fast pizza this place is okay, I would prefer it to the other big name joints. Crust had a bit too much corn meal for my liking but I didn't get the salty and processed taste from their pizza like I do other places. In a pinch it's not bad but I wouldn't put it down in my regular rotation. Not much seating so it's best for takeout."}
{"text":"Greasy greasy! Flavored crust was not flavored. Garlic and herb but looked like they just sprinkled garlic powder on it. Couldn't really taste a difference. Won't be coming back."}
{"text":"This Geno's is better than any other Geno's I've been to.  The guy there was super friendly tonight and attentive.  I will drive the extra miles to go to this Genos verses the one in Queen Creek.  Excellent customer service."}
{"text":"This is probably the best pizza place in town they have amazing pizza for an affordable price!! They had a slip up and forgot to add pepperoni to my slice of pizza and I went back in and they gave me a whole pepperoni pizza for free to make up for it! Definitely one of my favorite places to eat."}
{"text":"Ordered and told it would arrive in 45 minutes and after an hour and 20 minutes called and was told we busy that's the way it goes. Customer service sucks. Called a second time at one hour and 45 minutes and was told the driver will get it to you when he can. The final time was just over 2 hours with not even an attempt to make anything right. When the food did arrive it was warm, not hot and again after a call the girl answering only said \"well it's not my fault\""}
{"text":"I have eaten pizza all over the country and this probably was some of the worst I've had. The price of the place indicates that the indgredients are extremely cheap and  the taste proves it. My co-workers and I decided to get pizza from here for lunch and were very disappointed. The food made my stomach so upset I almost had to miss an afterwork engagement due to being sick. We will not be eating there again."}
{"text":"The $5 large special is the best pizza value around. Not a bad pie for the price. Greek salad was fresh and tasty too."}
{"text":"Eaten here many times since my original review, mostly because it's decent pizza with an exceptional price. It has gotten A LOT better! Minus their tendency to get orders mixed up (semi-understandable because they are always slammed), I had to bump up the stars. I have also recently discovered their italian sub and honey hot wings and they are super good!!"}
{"text":"GrubHub completely screwed this up, but Ian made it right when we went there.  Ian is a good manager and made a 2 star situation into a 5 star.  They paid us back the delivery charge, the tip and gave us free drinks with our meal since GrubHub didn't even give them the order.  Thank you for a fantastic meal"}
{"text":"I have been eating at this location for over a year now, and used to like it.  But over the past few months, everything at this location has gotten to the point that I don't think I will go back.  The staff is snotty and downright bitchy most of the time and more interested in texting on their phones and talking with other employees rather than taking care of their customers and giving them a great dining experience.  The front counter girl with the piercing through her lip has such a bad attitude and makes you feel like you are an inconvenience in her life.

As for the food, we rarely get the pizza, it is not the best, but for the price, it is worth what you pay for,  We usually buy their sandwiches and the last couple times the quality of the sandwich has been really bad.  I feel having employees that care about their work and the quality of product coming out of the kitchen would be a huge step in the right direction.  Today, we sat for over half an hour waiting for our 2 sandwiches (which is more than double the normal time it takes) and when I asked where our food was, Mrs. Snotty said that they will be out when they get out.  Turns out they ran out of Mayo (guess better planning on the management staff would have prevented that, but thats just me) and that was what the hold up was.  I explained to the cook that someone should have come out and told us because we were in a hurry at that point and could live without mayo.  Once the sandwiches came out, they were so poorly put together that I didn't even finish it,  it was falling apart and half the insides were hanging out.

If I owned this location, i would fire most of the employees and keep the ones who seemed like they  cared.  Retrain everyone what customer service is and grill into their heads that without customers they wouldn't have jobs. I would also install plexiglass along the partition wall from the kitchen to the seating area so kids don't have to hear swear words come from the employees and then parent's don't have to explain what that word was and why we don't say it."}
{"text":"Great pizza, terrible delivery service...every, single, time. It sucks because the food is really great and I also have my hands full with kids this summer and $5 pizza is always fantastic especially compared to Little Caesars, but over an hour and a half for 2 or 3 $5 pizzas is almost not worth it anymore."}
{"text":"We love Geno's we have ordered many times and it never disappoints. Their ranch is amazing!"}
{"text":"I love this place!  Fernando makes the best pizza's!  We love his hospitality and his cheerfulness. He is the reason we keep coming back!  Geno's has a great menu selection...there is something for everyone!  Thanks!"}
{"text":"For 5 bucks you can't go
Wrong.
I have also tried their subs which were good!
The staff have ways been nice and friendly!"}
{"text":"Horrible! It takes them over an hour to make one pepperoni pizza! super slow ! Staff doesn't know what they are doing and are rude!"}
{"text":"Great service very fast, the employees are amazing and very helpful. When I looked at the Yelp reviews I felt like I needed to decide for myself but once I arrived I notice the place wasn't too busy and very clean so I would recommend this place to friends and family. Thanks guys"}
{"text":"We drive out of our way to go to this geno's because the one by our house is nasty. I've never been disappointed. Fast friendly service. I would like to point out how hard of a worker Julie is. She is always friendly."}
{"text":"It sounds like we fell victim to the same issue other customers have had ... we placed an order with Odalis and was told it would be 45 mins to an hour. After about 1 hour and 36 minutes, I called to check on the status of our pizza. I was told it was on the way. 

When I asked for some sort of compensation for being quoted the wrong time, a manager was put on ... Misseal. Misseal proceeded to tell me that his computer system would not allow him to enter a future credit, and then he said that our situation would not qualify for a future credit anyways. While speaking to him, the pizza arrived and my husband took the phone. 

Misseal basically explained to my husband that he was protecting their company from \"people who try to get pizzas for free and take advantage of them.\" He basically insulted us and implied that we were out for free pizza only. Ahhhhh, you made a mistake ... good customer service entails owning up to your mistakes and taking care of your customers. And, we don't NEED a free pizza; we can afford food just fine. It's PRINCIPLE! PRINCIPLE PEOPLE! 

When the pizza arrived, it was cold. When my husband explained that to Misseal, THEN Misseal said he could help us since we had a cold pizza. Excuse me? What? So, we can maybe lie about having a cold pizza and you will help us, but when there is factual information about our pizza taking 1 hour and 40 minutes to get to us when we were quoted a shorter time, then you can't? I'm confused. 

Misseal also said he didn't know who took our order and who would have told us 45 mins to an hour, but her name, Odalis, was on our receipt. Not sure if he's just that stupid or trying to insinuate that we're liars. 

My husband ended the call stating that we didn't want any credit because at this point, we just wanted a manager to admit some sort of fault. We instead only got denial, lack of ownership, and insults. We don't need their stinkin' credit. Misseal ruined Geno's experience for us, and we will NEVER eat their cheapo pizza again. We enjoyed it for the time being, but they need to hire more qualified, competent managerial staff who know how to deal with company faults."}
{"text":"Very affordable for a large family on a budget& the pizza was fairly good. The wait time wasn't bad at all. Also the staff were very friendly and the restaurant was neat and clean. A go to place when you want quick food. I defiantly would recommend to a friend."}
{"text":"I'd give the food five stars.  The pizza and subs are great but the service would get a 1.  Each time I order carry out I get put on hold - sometimes for 4-5 minutes.  When I arrive to pick up the order - 20 minutes later it's never ready.  Lastly the staff does not seem friendly or helpful.  Last time I was in there were two employees talking - they saw me but didn't come over until I asked them to.  Frustrating because the food is excellent but it makes not want to go there."}
{"text":"We love the food here! Affordable & delicious! Worker name Teresa she has an amazing personality. She's funny & kind!"}
{"text":"Usually the food from this location is great. Today I called in a large cheese pizza for pick-up. I was surprised when the guy said it would be ready in just 5 minutes. It's clear they gave me an old pizza. It was cold and stale. Normally a fresh pizza take a minimum of ten minutes."}
{"text":"Geno's is one of my family's safety nets! Whenever we run out of time they are one of our top three options of eating out. The food is good, inexpensive and as long as it is not a weekend prepared rather quickly! So if you're looking for quality pizza and don't want to spend a lot check them out."}
{"text":"Live eating here. Its affordable for family and taste good for the price. They have tv to watch while eating also"}
{"text":"If you like your cheese pizza super-cheesy (which I do) this is a good place.  For the price, it is good solid pizza.  I got two huge slices of cheese and a small soda for around $6.  And like I said, they were cheeeeeeeeesy.  I had no idea that when they said a foot long slice, they meant a giant slice that is really a foot long.  Stupid me.  So I probably could have ordered one slice instead of two (which is also a cheap deal at $4 before tax).  So if you are looking for cheap pizza that's pretty decent, this is the place.  If you like a stiffer crust, probably not.  The slices are large and the crust on the thinner side so I had to use the fold method to eat it.  But again, good pizza for a low price."}
{"text":"Mikey hooked me up!

It's great to see that customer service isn't dead. 




He's the man! And the pizza is grand"}
{"text":"Worst service ever. Husband and I decided to try something new and it backfired, should have stuck with Venezias Pizza. We ordered delivery and it took 1hr and 30 min food was cold and not the right order. My husband called to complian and the manager \"Brian\" was super rude and actually hung up on my husband. Don't order delivery from this place you will regret it"}
{"text":"Never again. We love to order for delivery, we thought maybe this time to go in. It was so hot inside as if there was no air conditioning, and I'm wondering how that effects the toppings that are laying out, pretty sure that can't be code. And the fountain drinks were all stale and flat...never go in there again."}
{"text":"Crust was good and it's cool they sell by the slice but nothing like NYC or NJ. Dough was bubbly and flavor was meh. Service was good and fast. 3 stars"}
{"text":"Good grub and good service will be back for my pizza , cheesesticks and fried pickles"}
{"text":"I'm guessing from the other reviews mine really won't be a shock but here goes. On 9/25/16 I ordered three pizzas and a couple two liters. Now we order from here all the time even though their pizza isn't great but it feeds a bunch of people for cheap.   

We received our food and received it OVER 2 hours later.  When we received our food it was wrong.  I called to speak to a manager and was told there was no manager there and I could speak to someone who was \"like a manager\"  according to the young lady on the phone.  He said he could do one of two things:  1.  Bring me the correct three pizzas or  2.  Credit my account the money I spent on this order for next time.  I chose #2.  I called today to order and the manager on duty had no clue what I was talking about and at 1:05 this afternoon he told me he was going to call the other manager and call me back \"in 5 minutes\".....it's 1:58pm now and I have yet to get that call 

This company will get NO MORE of my money"}
{"text":"My husband and I just moved to Santan Valley, we ordered Geno's for dinner tonight and it was way better than expected! First of all, we got a medium and it was huge! And I mean huge LOL... Very tasty! We also got the zucchini as an appetizer and the ranch was to die for! We will definitely be ordering again, I can't wait to stop in, in person! 
Also very fast delivery might I add."}
{"text":"I'm in love. Delivery is a hangover cure. 

Best gluten free pizza ever, the 14\" option is a god send. I wouldn't say spectacular flavor, but I enjoy the flavored crust options. Just because I eat gluten free doesn't mean I want flavor free, though sometimes they are one in the same. 

My husband had the philly with extras peppers and olives. I must say a little bit of the meat and cheese were what I would expect. The bread looked soft and everything was well melted. Delivered hot was a plus. 

Pizza was a touch chilly, but again overlooked due to the hangover. The fries were also a little weak and temped. 

Overall room for improvement but worth a shot, I'll be back."}
{"text":"The pizza at Geno's at pecos is better than baseline, not sure why?  Both are poor on cutting thin pizza in pie   cut, wish they would do it right the first time they apologize; defeats the call in if I have to come and wait while the redo it?otherwise good pizza."}
{"text":"Went in again. Had wings honey hot well done. Ian the manager made sure they were bomb for me. Then had a 18\" philly pizza the best ever. You gotta skip over the 14\" and try the 18\" or 24\". Thats were the quality is. Wings and philly pie hit the spot. Love this place"}
{"text":"This place amazed me the other day. First of all they delivered to my house, which nobody does. The food was great. Got a steak a cheese sub and 18\" extra cheese butter cheese and garlic crust. Was best pie i had in a long time. Def will be back."}
{"text":"So looked on here before going in but and decided to try the subs lije some people suggested. OMG!!! Steak and cheese. BOMB!  Ill be back.....in a hr!"}
{"text":"Great pizza, definitely better than dominos or Pizza Hut. Plus you can get a pepperoni pizza with flavored crust for only 5 bucks. Soo cheap. I think my favorite flavored crust is prolly the ranch and the Cajun. The ranch is the flavor I think you can taste the most the Cajun not so much, but still pretty good. The chicken wings are also really good. Usually get the mild bone in flavor. They have an optional bone-in or boneless wings, which is nice."}
