{"text":"Received delivery of jumbo special and it was delicious! It came when time was estimated. Definitely one of our favorite pizza places."}
{"text":"Johnny Malloys is a great hang out place. Fun karaoke and open mike nights.  Spacious area for playing pool too... Geppetto ' s next door has great pizza and the ribs!"}
{"text":"So disappointed in the way my fiancé and I were treated last night in the establishment. We were asked to finish our drink and leave after the booze hound bartender Katie who worked the day had gotten off drank like a fish and proceeded to scream across the bar profanities and insults. We had just stopped in to play a game of pool. Not only was the blonde headed owner rude, but a younger shorter dweeb was rude and asked us to leave. Here's the kicker. Not only was Katie screaming profanities and being obnoxious and causing a scene at her place of employment she also attacked my fiancé and punched him in the arm several times, as we sat there and didn't say anything or retaliate in anyway. Not to mention the place smells like wet dog and was full of nothing but trash. I smell assault charge coming her way and a nice long talk with the Malloy family in which I have contact with from working at previous establishment myself."}
{"text":"Ordered take out ribs & wings. Hubby said ribs were tender and tasty. I had wings and have to say I only got 1 \"wing\" out of 15 the rest were drums, I've never had an order of wings like that... Just sayin' Geppettos."}
{"text":"Ahh, memories from childhood.   We did not live SUPER close to a Geppetto's (growing up in Oberlin, OH), which is why whenever my dad would bring home Geppetto's pizza and ribs on his way home from work, it was a special treat.  Geppetto's does both (pizza and ribs) RIGHT. The pizza is classic, the ribs are tender but still juicy. So good. My mouth is watering right now. (Why am I writing this before lunch???)  This is not the nicest location (it is connected to a Johnny Malloy's ... bleh), but it IS perfect if you are planning to take a delicious picnic of pizza and ribs to a park by the lake."}
