{"text":"Runny instant mashed potatoes (potato pearls) and iceberg lettuce salads.  This place has the atmosphere of a dive bar and the food of a high school cafeteria but I will give them an extra star because at least their relatively low prices reflect this."}
{"text":"I loved this dive before... Menu is always great, but too extensive for cooks and functionality.  Bravo to the cooks!  I called in my order at 355, which was a rare steak salad.  Upon calling I told the waitress/ bartender I intended to eat it there.  I showed up at 413... And my food was not ready, and didn't know it wasn't to go! it was not ready till 425.  30 minutes for a rare steak!!! Unacceptable!  When I walk through the door the bartender was on the phone for a good two or three minutes before she even realized I had sat down.  My steak was medium well, if not well.  I would have rather ate a burger from McDonalds!  Temperature is everything when it comes to steak.  And, \" the old hag \"behind the bar continued to eat her food behind the bar in front of me... When she knew I was already on 20 minutes on a rare steak. Their food can be out-of-this-world... But this staff is very old and slow, it definitely shows!  Step up your game girls!!! Please!!!!  And I swear I saw the bartender *69 a number after complaining to a coworker the phone was ringing off the hook.  This bitch was too hung up on the mentally of customers ask too much of her, rather than ask herself, what can I do to wow them , and make a good tip.... Come on ladies! Completely embarrassing!"}
{"text":"My boyfriend and I stopped by for lunch one afternoon.  We live nearby and are new to the area so we wanted to check it out.  Since it was a weekday after noon the place wasn't very busy.  We took a seat at the bar.  The bartender was very friendly and seemed to know everyone who walked in the door.  It is definitely a locals place, but being new we didn't feel uncomfortable at all because everyone who came in was just as friendly.  Neither of us were in the mood to drink any alcohol so it was water for us.  I ordered the Bleu Cheese Burger with no black (spices).  My boyfriend ordered a fish, scallop and shrimp dish.  I don't remember the name.  My burger was great!  It came with a choice of fries, homemade chips and something else.  I got the chips.  They were really good as well.  I didn't get a chance to try my boyfriends meal, but he finished it all so I am going to assume that he enjoyed it.  We both really enjoyed this place and are looking forward to going back this summer and enjoying the patio."}
{"text":"Great food and prices!! Owner was super nice!!! I did not like the fact that it was after 11 and we couldn't order lunch yet and you couldn't order lunch until 12 however we didn't even get our food until after 12."}
{"text":"What to say about this place!? This is our go-to place for a good meal. This is a casual restaurant bar with great food.  The burgers are huge and fantastic (BBQ bacon cheddar- best ever). This is my favorite place for a summer salad. I also second another post- best deep fried mushrooms ever.   We come here for trivia on Tuesday nights. Grab a hopper full of beer, a few friends, and come hang out as the owner, Fred, challenges your trivia expertise.   I find the staff friendly, especially the owner and bar staff. Some of the waitresses could use a little boost in attentiveness, but I am usually there on really busy nights.   This is a great place to come after a round of golf, visit to South Park, or to watch a game. After a time or two, everyone knows your name and your order. Not to mention they always promote the local fundraisers/activities in the area."}
{"text":"There were 5 of us and none of us thought our entrees were very good. I had the broccoli chicken Alfredo . It wasn't very tasty and there wasn't much  Alfredo sauce. The chicken wasn't flavorful either. My wife and another member of our party had baked cod with some type of cheese on it. They both found it to be bland and neither of them finished their's and not because the servings were generous because they weren't. One of us took one taste of the coleslaw and left the rest. The two people who ordered the shrimp said they were small and tough. None of us plan on returning, I'm surprised by the many good reviews. The Server was fine,she did a good job, that's the best I can say about Gils."}
{"text":"Definitely not a breakfast place. I got the blueberry pancakes, three of them, each probably weighed about 2 pounds, thick, heavy, doughy. I ate a few of the blueberries and left the rest. Coffee was tasteless. I was short on cash and was not allowed to pay with a card because my order came to 23 cents below whatever their number is for accepting plastic. So I had to use their ATM, paid an extra $2 service charge, all to pay for inedible food."}
{"text":"The shrimp was chewy and dry. The fish was overcooked. Kids' mac and cheese had a sour taste. There is no doubt in my mind that everything they make is frozen or pre-packaged. Miserable waitress was upset because we had to sit in the back section that was closed due to no open tables.   Save yourself the agony and expense...get a box of Gorton's fish sticks, and a Kraft Mac & cheese cup at Walmart for $3.99 and you'll be more satisfied making it yourself and eating at home.   The steady decline of this place over the last 10 years has finally come to an end...because it can't go any lower.   Beat out South Park Clubhouse for terrible, overpriced food...by just a little."}
{"text":"It is what it is and doesn't try to be anything different-a cozy dive bar with a homey feel. We came here this past Friday night to catch the 2nd and 3rd periods of the Penguins game. My boyfriend had been there before because he grew up in the area and currently lives about 7 minutes away, but this was my first time here although I had driven past several times before on the way to his house noting it was crowded each and every time. We walked in around 8 and the whole bar (which is small by the way) was taken. A man sitting at the bar, who I took to be the owner, said we could sit \"anywhere we felt comfortable.\" We chose a table in the middle room area near the big TV so we could easily both see the game.   We were greeted quickly by our server who brought out our beers to us shortly after. The draft list was pretty basic and they only had 1 beer that jumped out at me-Troeg's Pale Ale, so I went with that. They have a pretty big menu-salads, sandwiches, burgers, pizza, pasta, and even breakfast on the weekends. It looks like they play the Premier League Saturday and Sunday mornings just FYI. My boyfriend was ravenous so he wanted to start with a chicken quesadilla. When it came out it was HUGE for the $5.99 price. It was cut into 5 pieces and there were press marks on it too so either it was grilled on a grill or in a paninni type sandwich maker. It was ok, I only had one piece though and he ended up taking 2 pieces home with him. Basically in summary, it was an above-average bar quesadilla, nothing spectacular but not inedible either.  For entrees I ordered the greek paninni sandwich and chose the regular fries as my side. The paninni, priced at $8.50, was massive! It was served cut into three portions and had lettuce,tomato,onions,tzatziki, and lamb meat. I think it could have used more tzatziki, however, the flavors were all reminiscent of a gyro which was exactly what I was looking for but in sandwich form. The fries (crinkly ones) were clearly of the frozen variety and were way way way too salty. The sandwich was solid though and if I find myself here again, I think I'd try the rachael paninni since this paninni was pretty good. My boyfriend ordered the steak sandwich. It looked kind of sad coming out to the table-it was served on this tiny hamburger bun as opposed to what you would expect-a hoagie bun. He ate it though, however, he will eat nearly anything so the fact he ate this is not a true reflection on the actual quality of the sandwich. He said he remembered getting it before and it did come on a hoagie bun so not sure what is going on here. He chose steak fries as his side and I tried one of them-also clearly of the frozen variety. The portion of his fries was about six-literally six sad looking steak fries on his plate next to his sad looking hamburger bun steak sandwich. They are not winning any points for presentation here, however, I chose to not dock points based on the fries because prices are so cheap here and fries are a compliment to a sandwich, never should be the main factor in ordering one.   We each had a couple of more beers and our bill came to a total of about $30, which is good for 4 beers and 2 sandwiches plus a quesadilla. My boyfriend did make the comment that Gil's seems to lack consistency of ingredients-case in point the hoagie bun vs. hamburger bun for his sandwich. He also noted the fries were different on his last visit as opposed to this visit. Will we be back? Probably-because it's close (to his home), cheap, and our meal on this visit was decent. Will we be rushing back here? No but we did have a decent meal and some beers on the cheap so we will keep that in mind in the future!"}
{"text":"All I can say is \"Wow\", and in a great way!  My sisters and I chose Gil's Cafe on somewhat of a whim for after services luncheon or \"Wake\" on the death of Mom.  After making the reservation for a party of 30, we started to read some of the reviews that were on Yelp and got pretty nervous.  Well, don't let those reviews from over a year ago keep you from visiting this little gem in South Park on Brownsville Road.  First, we made the reservation for 1:00pm and instead arrived very early at 11:40am with our family and friends.  Immediately, we were made to feel welcome and invited into the private room that we reserved.  Even though all of the staff had not arrived to service our party, one take-charge server quickly make sure that we were given beverages and menus allowing us to settle in.  Soon afterwards, she returned (I'm sorry I don't remember her name) to take our order for appetizers.  I think a little bit of everything was ordered off of the \"starters\" section of the menu and every one was amazing and definitely not from a frozen bag.  I recommend the awesome breaded mushrooms, fried dill pickles and nachos with barbecue sauce!  After another round of drinks and beverages, it was time to take our main course selections.  Every selection from the main menu was equally delicious and prepared to perfection.  I recommend the Neptune's Platter, Atlantic Salmon and freshly prepared Hamburger which was formed by hand and not a frozen patty.  Is Gil's a fine dining establishment, of course not.  But is it an awesome and family friendly sports and \"dive bar\" type of restaurant, yes it is.  Finally, in talking to our server about previous negative reviews on Yelp, I was informed that over the past year or so, Gil's has been going through a transformation with many of the poorly performing cooks and wait staff removed that were the reason for the problems.  My recommendation is check this place out.  I will be back when visiting the 'burgh in the future and my local family have already joined Gil's frequent diner club if that tells you their intention to return."}
{"text":"Well it's bar food alright. Ordered the mini tacos for a start and they were right out of frozen Costco bag. My wife liked her salad and I tried the hot sausage. Portions were large but the marinara on my sandwich was kind of a chunky mess. Texturally it didn't sit well with me.  The sausage itself was ok but lacking in cheese and coupled with the marinara, it was marginal at best. This place is ok. I honestly can't say that I would go back, but it is what it is. The staff seemed a bit moody as well."}
{"text":"Party of five on a Saturday afternoon. Have been seated for an hour and a half. Just got our food as I started writing this review. About 15 customers in the restaurant. Only one server, she is also handling the bar. Not a good time."}
{"text":"The first time I ate here a few months ago the food was decent and at a good price so I went back a few days ago. Never again.   The first time we ate here the bartender told us to just sit wherever. Having a toddler we sat in the back room. The second time we went we assumed the same policy was true. As my wife and two and a half year old settled in I went to the bathroom area where the high chairs were stacked in search of a booster seat. Not finding one I figured no big deal and was prepared to wedge my son in a seat using coats.   As I began walking back to the table I passed the waitress who looked at my wife and son and sighed loudly. I asked if there was a problem, realizing she'd been caught she gave me a sob story about there only being two servers on duty and the back room was closed.   She said to sit in the front. The front room has 4 foot high bar tables. I said I have a little kid who can't sit on a chair that high. She snapped \"Well the back room is closed\". (There's a back room and a front room and two servers. What's the problem.\"  So we were basically refused service for having a young kid."}
