{"text":"Nice decor. The service is okay. The food is not the greatest. The kabob is dry and simply not very good for Persian food on the pricey side."}
{"text":"I wanted to come to this place a while ago but reading the reviews made me think twice. Well, today I ended up to this restaurant because my aunt kept asking and asking to lets go try it out since its her anniversary. 

We got upstairs to the restaurant exactly at 7:25. No one was there for the waiting area to take us to our table so I just walked in and a male server seen me and totally ignored me and left to the kitchen. I waited 10 minutes and a lady server came out and she told us to sit wherever since there was plenty of space to sit. Not a good start already! We were sitting for another 10 more minutes at a table waiting for the lady to come back to the table to hand us the menu... By the time she was back it was 7:50!!!! Another family came in and they got seated as well and I guess they already know how crap the service is here so they told her to not leave and they already know what to order. Lol. 
Anyways our bread arrived 8:10 without our mast moosir so we were waiting AGAIN... PATIENTLY... At 8:20 i saw the other family got their bread with mast moosir... Oh gosh what customer service... She brought our nast moosir at 8:30. 
We got our food at 8:55 and I had to go downstairs to pay more for the parking. I didnt know it would take this long! i got a vaziri which is a koobideh and chicken. Both was so dry! I was so dissappointed! The doogh was warm. We asked for butter and onions as well and she brought it for us after 15 minutes! I was furious the whole time! We did not have a good time here! We left at 9:50. Overall the worst experience ever. Worst food and too expensive. I only gave it 2 stars because the place looked nice. Thats it."}
{"text":"Absolutely great atmosphere, really well done. Very unique and fun, never been to a restaurant like it. Service was friendly and attentive, provided good recommendations. The food is Iranian, which I had never had before, but I enjoy mediteranean fare so wasn't too concerned. Everything was good, sirloin kabab spiced nicely and very tender. Bread was very good, as were the stuffed eggplant appetizer and taziki-like starter. The only huge complaint I had was it was very stuffy in the restaurant, no air flow and almost suffocating. It was also pretty warm, they really need to keep some AC on during dining hours. Other than that it's a really cool place with good value I feel."}
{"text":"Haven't had a bad experience here before, which is rare for Persian restaurants (so inconsistent). 
Bad service because they basically forget you. 
Kabob is good. Never burnt but never juicy. Not the best Persian food in the city, but certainly better than most."}
{"text":"I am a regular customer of this restaurant and today I called to order food for delivery, I asked whether there is a fee for delivering, the waitress didn't even knew and she told me that it is based on your order, normally we deliver for 2 or more dishes.

Guess what, I ordered chengeh and sultani which is about 50 bucks or more and I live just 4 km's away from gilaneh, the manager told in the back as I heard.....tell him we charge 15 dollar. Are you insane ?

This was the last time I ever ordered anything here and I will tell any other friend which I had recommended before (as I had recommended many friends and relative) to not go here.

The gas from GILANEH's location to here, would be only 2 bucks max. Are you seriously trying to rip people off Gilaneh.

Btw not to forget that your quality is decreased anyway , and downsized! I have pictures to support my statement :).

The only reason I was still coming here is because I was a loyal customer which now you ruined any Customer relationship that was built.

Good luck to the new management !"}
{"text":"What! how does this place have only 2.5 stars!!! I have been here a number of times, my boyfriend is Persian. The food is fantastic! I would say their kebab is not the best compared to other great Persian places in TO but they have some truly delicious stews which are my favourite. 

My favourite thing about this particular Persian restaurant is the atmosphere and the decor. Feels like being in Iran! Beautiful authentic decorations. Such a wonderful experience even just sitting in this restaurant. 

If busy can sometimes take a little long to be served, but staff are always very pleasant !"}
{"text":"Gilaneh is a newly opened Persian restaurant at the Westin Prince Hotel in North York. This is a sister restaurant to the famous Shomal restaurant (reviewed earlier). \"Gilan\" is a province in the north of Iran situated alongside the Caspian sea. And the feel and decor of the restaurant are meant to represent that region of the country. 

Highlights:

- The fresh mini \"bar baree\" bread. This is a very special kind of Persian bread and I could write a book just telling you about this bread. They start serving these to you the minute you sit down and man, they are soft, steaming hot and fresh and they come with a healthy portion of melting butter. Simply mmmmm mmmmm good!
- As for the mains, the kabobs are excellent (although Sheherzade, reviewed earlier, remains my favourite in that department). And I would recommend the \"Golbarg Kabob\" which consists of alternating pieces of chicken and veal tenderloin kabobs arranged into the shape of a flower! Very elegent presentation and simply delicious.
- Excellent service. Very attentive and accomodating.
- And the view! The restaurant faces a ravine on one side, which gives it an especially romantic feel. 

Tips:

- Be prepared to spend a lot of cash as this place is a bit on the pricey side.
- DO NOT get carried away with that bread! It WILL kill your appetite! 
- Visit the restaurant during daylight hours if you want to enjoy the view facing the ravine.

Food: A
Service: A
Food presentation: A+
Atmosphere: A
Prices: B
Recommended?: Yes"}
{"text":"This place is just bad news. We came here for Persian new year and that was a horrible mistake. Last week we called this restaurant to see what they offer for Persian new year - they listed the appetizers, entrees, and mentioned that dessert was also included and that each person could order one drink for free. It sounded like a good deal for $100 a person. WRONG!! Our waitress only brought 2 appetizers for 5 people. We mentioned that she forgot one of the appetizers and suddenly that appetizer was no longer included in our package. Fine. We asked her to repeat what our options were for dinner - and she included vaziri and so did the lady on the phone when we called last week. Suddenly when it came time to order, vaziri was no longer an option - and we were the first people to order dinner. We asked to speak to the manager who we had also seen at Shomal restaurant before (she seems like new management and is doing a horrible job). We mentioned we were comparing our options last week and we chose this place over Shiraz restaurant because of what the lady told us was offered over the phone. She said she would bring us vaziri but not to let any of the other customers know - not sure how anyone else was okay with being ripped off like that, but sure. The food arrived cold but we were tired of complaining and hungry so we sucked it up. Dinner cleared and we were watching a belly dancer for about 45 minutes and we asked our server for dessert. Again, suddenly dessert wasn't included. This restaurant promised A, B, and C, and didn't deliver on any of it. They messed up all 3 courses and ruined our evening.
We asked for the bill about an hour before new year. They charged the Visa we had put our reservation under - without our consent. When I asked them over the phone why they needed our Visa, they said just in case we cancel our reservation. They brought over the Visa receipt with the bill. Somehow it came to $800. We looked at the bill and saw that they charged us $500 (100/person) PLUS everything we ordered - the drinks that were supposed to be included, the appetizers, and the entrees. Not to mention a not deserved tip of $100. Of course we complained to the managers and they both acted as if we were over reacting - they agreed it was a mistake and refunded the $800. We were going to pay the actual bill of $500 in cash but realized these people are SO shady that we wouldn't trust them not to charge our Visa card even if we did pay with cash. We paid $500 with NO tip. Everyone was so rude and kept telling us \"hearse Nakhor - as if it's our fault that they ruined every single thing that could have been ruined. We kept all the receipts and when we came home we noticed that we also had a receipt for $400. When my husband checked his account he noticed exactly $900 was missing from his Visa credit. It was so dark in there we couldn't even see all the receipts we had until we got home - so we called them right away to complain AGAIN about how they charged us $900 when it should've only been $500 and why do they keep charging his Visa card without his consent - this is total FRAUD. The man he was speaking to was even trying to get him to pay gratuity on top of that. Are you kidding?
This new woman (Samira) that is \"managing\" Gilaneh and Shomal is clearly so cheap and doesn't deliver on what she promises her customers, and even rips them off! We will NEVER return to Gilaneh or Shomal simply because of her and the shady way she is running her business. And we have a lot of friends and family and will make sure they never waste their time like we did by going to these restaurants. You just made your competition a much richer place."}
{"text":"The food quality was good although it was really pricy. The service was terrible. I've been there twice and had some bad experience with the service. I've been to bad places but never left a review but this one made me sign-up and write something.
 After serving the food the waitress did not show up until the end when we actually finished. She was rude. It was kind of hot there I don't know if the AC was not working or something. The bathroom was disgusting I think the fan was not working also. Also on a table of four they seated 7 people which I felt like one of them was sitting right beside me. The staff was really unprofessional and they didn't know the very basics of serving."}
{"text":"I visited this restaurant for a special occasion in May and loved the ambience and decor and food and would certainly
Go back or an occasion. However, the food was expensive for a regular visit, especially considering the service we received. The staff are nice and friendly
But get very lost and forget stuff when it gets a little busy.

The place was too quiet and needs serious background music so it felt dead and we could overhear other tables. 

Overall, I would pay it a visit especially if you haven't already done so. 

Very chic and prestigious!"}
{"text":"We have been coming to Ghilaneh since it first opened. The last three times the service has been extremely poor, with today marking a new low.  We arrived around 5:30pm and placed our order. Not sure what happened but our original server after taking our food order never returned.  After waiting at least 45 minutes and our kids loading up on bread, my wife asked the closest server the status of our food, and if she could at least bring our kids food out.  Another 15 minutes or so and all the food came out. We ordered tadiq which never came, nor did the doogh I ordered. 

One of the chickens kabobs that we ordered for the kids was not fully cooked and the new server said she would place a new order.  After 20 minutes or so, she came back and even to her surprise realized the chicken kabob had not been delivered.  She apologized and adjusted the bill accordingly. 

The food historically has been very good but the last few times the combination of long waits and poor service, I don't plan on going back."}
{"text":"I am disappointed with the service. Very rude servers and if you complaint to the manager, don't expect an apology or anything that makes you want to go back there. It seems like the whole staff don't have any clue about the basic principles of customer service. Not to mention that the quality of the food is not great either."}
{"text":"The decor is really nice. Food is not the best Persian food I've had in Toronto but it's not bad. The service is average (kind of bad). Our server only came to check on us once. I wouldn't come here more than twice. You don't have to pay for the parking at the meter just come to the restaurant reception and they will take your license plate #."}
{"text":"Pros: The Barg Kebab was one of the best that I have had. Very tender and flavorful. The Soup (jo) was awesome! I still crave for it. The proportion of the food is great. Price is good for what you get. Loved the flat bread at first.

Cons: No soap in the washroom! Koobideh kebab was very bad, It was very fatty and no taste of meat in it! low quality."}
{"text":"Horrible service. Took 1.5 hours to get food. Inconsiderate rude staff . Go elsewhere . Everyones got an attitude here"}
{"text":"This is our new go-to place for Persian food! 

We started off with some bread and kashke-bademjoon. Both were great! We then ordered an assortment of kabobs and rice with zereshk. The chicken was phenomenal and my family really enjoyed the lamb as well. My only complaint is that the zereshk portion is a little bit skimpy. 

The ambience is great, though the music is probably a little loud, and the service we received was also really good! Great place!"}
{"text":"Pros: The decor and atmosphere are pretty cool, with mud and adobe wall finishes which gives an old Persian impression. 

Cons: The food is just too oily. There's oil everywhere; the eggplant appetizers (which are typically oily) are oilier than other Persian restaurants in Toronto. The stews are pretty oily too. The lamb shank should practically be called fat shank! It's full of fat chunks, that should have been removed completely or at least partly before cooking. They also did a poor job of hosting our large group. although we had a reservation, we had to wait about 1 hr to get our table. They brought water to the table after we asked them several times (and 3 small pitchers are not enough for ~15 ppl!). 

Anyways, if you go there, be prepared for very fat/oily dishes and good to poor service."}
{"text":"Was there several times. If you are into middle eastern food, particularly persian foods, this place is one of the best in GTA, possibly the best Persian restaurant in Toronto area."}
{"text":"I ate here when I was in the area for a conference. I ordered the Gheimeh Bademjan. It was one of the best things I have ever put in my mouth. Henceforth, I will be accepting all conference invitations in the area whether the subject interests me or not. I need more lamb stew with split peas and dried lime."}
{"text":"Gilaneh is one of the better Iranian restaurants, and is definitely one of the pricier ones. We went there with a group of friends. A couple of friends were Iranian so they recommended food from Northern part of Iran, which apparently is the specialty if this restaurant. My food (Sour Kebob) was really good except the dry and weird salad called Shirasi (its essentially Israeli salad, just much less tasty.... Correction: absolutely tasteless!). The warm bread was great. I also tried one if my friends' vegetable rice, which i thought was very dry.
What was the most disappointing was the service!!
First they brought one bread, which is quite small, for a group if 9. We had to ask multiple times for more bread, specially as Persian food takes too long to get prepared.
Then for ordering the food, some of us were not familiar with the food so we needed to go through the orders with our Iranian friends. The server was very condescending, and making jokes and as he was not fluent in English, his jokes were not the most tasteful.  
Now the worst part: at the end of the night - I mean 11 pm in a weekend! - when there were only three tables left (each one with more than 6 guests), all the servers and the manager! sat down on a big table, with their cell phonos desperately waiting for us to leave!!! It was a horrible feeling for us as we were not even half way through our food!!! 
The atmosphere of the restaurant is interesting. Its definitely not a typical high class restaurant. So if you want to impress someone, this is not the place. The entrance is very over the top with poorly done stone works. Inside, the decor is nice, but man, the restaurant is so noisy that we should shout at each other to hear ourselves, making the the noise even louder! To out things into perspective, it was noisier than any sport bars on a weekend night!! 
The food, including the non-alcoholic drink and appetizers -which you HAVE TO order as the main dishes takes so long ( more than 30 min) - will cost something around 40-50 per person."}
{"text":"Katsura's staff recommended we eat at Gilaneh for the reason Katsura's heat was off.
We asked our waiter to help us with the menu as we were not familiar with the food and wanted to enjoy a new cuisine.  Our waiter went out of his way to put together a meal for us that was exceptionally good.  

Both of us would recommend Gilaneh's for a reasonably priced fair and thoroughly enjoyable dishes.  

If Persian food is new to you, study their menu--lots to choose from and you won't be disappointed. 

February 15, 2015"}
{"text":"I'm from malaysia and one of my persian friends recommended me this place. Gilaneh is one of the top persian restaurants in Toronto. I have been there twice with my malaysian friends. Everything was good except the price which was little bit high. The service and staff were so good and welcoming. The food was also so dope. They have a special bread which they bake by themselves and i really really love that."}
{"text":"Marvelous decor and environment. Decent customer service. Slightly over priced for the quality of food offered. But loved the classy decor!"}
{"text":"Besides the beautiful decor, I am not impressed by this place.

1. The food is bland
2. The service is terrible

I have been here several times, but this last time it bothered me enough to write a review."}
{"text":"A rather newly opened place ( I'm under the impression that the this is an extension of another successful restaurant by the same owner). It's a very cozy and tucked away place great for dates. Food quality is decent and if your familiar with Persian cuisine, you'll find this place rather pleasing.

Good: Ambiance, decor, and food, great for dates.


Bad: Difficult to find, as it is tucked away besides a hotel on YorkMills."}
{"text":"I was pleasantly surprised to go to this restaurant. Loved the decor and the ambiance. Of course there are cheaper Iranian restaurants out there but the atmosphere and decor of this restaurant make it well worth the price. 

The pros: they validate parking, the meat dishes, the ambiance, the service. 

The cons: the vegetarian main with the egg was not delicious."}
{"text":"As far as a Persian restaurants go in Toronto, this is one of the best. Great Decore, great atmosphere, great food, if you've never tried Persian food, you should really try this restaurant first. Great stuff!!!"}
{"text":"I was there about a year ago and it was a fairly decent place to eat. Unfortunately not so any more, so here are the problems:
1. Although I had made reservations 3 days in advance, we had to wait for over an hour to be seated.
2. The bathrooms were so disgusting and full of bad odor that you just did not want to breath in there
3. The service was slow, the waiter was nice and pleasant, but I think he was overloaded.
4. The koobideh has two different taste, at first it was OK but in the middle section of the skewer it had an off taste.
5. The portion of the rice was too small
6. Salad Shirazi had no taste, I mean it is more than just cut vegetables, there is lemon juice and olive oil in that salad, it seems they forgot

7. As another reviewer mentioned, they have a nice fresh baked bread, too bad getting a second serving is nearly impossible.

It's too bad since the ambience of this restaurant is nice and it is the only decent looking Persian restaurant not on Yong street."}
{"text":"As a Persian, I can't say that Gilaneh is my favourite Persian restaurant but it beats many others in North York.

If you're not familiar with Persian food, I encourage you to check it out. Especially if you love meat. They have many other options as well, including a full vegetarian page on their menu. Their appetizers are yummy, and I also love the fresh baked bread that they serve.

The only downsides are the service, and small details (removing dead flowers from vases)."}
{"text":"Located in the Westin, the location has lots of free parking for restaurant guests.

Nice decor.

The flatbread was good, but not amazing. Why do they make bread and then let it sit at the pass-through so it can get cold and hard?  We had one round which was fresh (nice and warm) and that made a huge difference.  

The yogurts and dips were delicious.  We had a good assortment.  

The meats were a real disappointment.   Most were dry, but the chicken was decent.  The fish was also dry.  I think it could've been much better.

I found it quite odd that they served Caesar salad, Greek salad, and Italian dressed house salad to accompany the main courses.  How authentic is that?  I suppose it's because they are located in a hotel?

Service was friendly, but not the most efficient.  It wasn't even busy for a Friday night.  I think one person was in training.  

2.5 stars.  The extra half star for the easy parking situation."}
{"text":"The decor and atmosphere here is unexpected gorgeous! Definitely a place where you'll want to take someone for a little bit of the 'ooh' factor. The faux stone relief and statues at the entrance really sets the tone that you're entering somewhere exotic. I love the slightly kitschy look! 

I was expecting poor service based on the reviews, and while there were a couple of things (had to ask twice for a missing set of utensils), the service was decent. There were so many servers that my dining companions commented on it.

The food was average at best. We loved the flat bread that came in beginning. The Bademjoon Kabab eggplant appetizer was yummy, though I thought there was too much stuffing and not enough eggplant. We tried this yogurt drink and I can't say that I liked it at all. We all tried different kababs - chicken, beef, veal and also a salmon steak. It all came with choices of rice/fries/salad. I would stay away from the fries to be honest. They weren't quite crispy, or limp (like McD fries which I love), but somewhere in between. Portions were large and we all left very stuffed."}
{"text":"We used to go to this restaurant a lot but our last visit made me hate going back there! The food itself is not bad, we enjoyed the food and appetizers, however, the customer service at this restaurant is so bad that would make your little family or friendly gathering into hell! First of all we made reservations, and they took us to the music side of the restaurant, it took almost 20 minutes before we got served, then we ordered some alcoholic beverages yet to find out they were just virgin drinks with a price of an alcoholic beverage! 
Then while we went dancing, the table on itself broke and fell on the ground, dragging our drinks and food onto the floor! We were so shocked and upset! My phone landed up in a puddle of coke and food! Did we get a sorry ? NOOOOOO the lady manager was so rude to us blaming us and giving us attitude ... Funny thing when this happened we were not at our table!we were so upset, never got refunded for our food or drinks because of their own mistake! What a terrible experience and night ! Not going back there again !"}
{"text":"Being Persian and having been fortunate enough to have both lived in Iran and traveled there extensively, I know what good kabob should taste like, and unfortunately, Gilaneh does NOT serve it. 

I asked my family in Toronto to take Dr. Dad and I out for the best kabob money can buy. For some strange reason, Gilaneh was what they chose, and now, thanks to this horrible decision, methinks my family hates me. While the hot noon-e-barbari they serve on wooden slabs as starters with fresh sabzi is nice, nice is not what I come for. Any good Persian will tell you that hot noon and sabzi should be accompanied by 1 thing - paneer (cheese) - and Gilaneh totes dropped the ball on this. Instead, they send weird pre-packaged butter from Costco which goes well with NOTHING. 

For appetizers we ordered everything from the traditional mast-o-khiar and mast-o-mooseer to the more unique baghala-ghatogh and mirza-ghasemi. When we arrived, they were out of haleem bademjoon but offered us grilled bademjoon instead. As far as the mast-o-khiar and mast-o-mooseer, they were both more sour cream heavy than they were mast, and while I use sour cream in addition to mast when I make it at home, there's was just too much. The baghala-ghatogh was served in a cute mini ghablameh (pot) which was its only redeeming factor. Otherwise, it was runny and flavorless, and the poached egg was far too overcooked when we had specified we wanted it runny. The mirza-ghasemi and grilled bademjoon were barely memorable so I won't even waste my time writing about them. 

For our entrees, we ordered everything on their kabob list. Their shish-lix (lamb chops) were way overdone - charred and tough. You couldn't even cut through them with the knife provided and I was afraid if I risked just biting in, I would lose a tooth or two. The kabob kubideh, which is my Dr. Dad's all time favorite, was dry and completely falling apart. I've NEVER experienced brittle kubideh before this experience and I hope to never encounter it again because it was horrid. The kabob barg was also rather tough - I'm not sure if they marinade their barg before grilling it, but something was just off. The joojeh was thin and more or less meh - no flavor and they didn't even bother throwing a piece of lime next to it on the plate so I could squeeze it and give it my own flavor. 

All in all, if you are craving kabob, and lack the necessary physical body parts to make your own, I say avoid this place like the plague. If you aren't a kabob connoisseur though, feel free to check Gilaneh out. I'm pretty sure even you will be able to tell that something just isn't right. 

P.S. they totes screwed up their homemade doogh. My gold standard for kabobi's is their homemade doogh, and Gilaneh's doesn't even qualify as gold-plated. le sigh."}
{"text":"We went there 2 times. The food was good but the service was awful!!! There was no one at front desk to give us the seat! We had to find the servers ourselves to ask them for a service. The second time the waitress completely ignored us and started to hang out with her friends!!! I will never go there again."}
{"text":"This persian restaurant has the theme of foods and  interior of north Iran. Gilan is a province in north of Iran by the Caspian sea.

The food items from that region that they have are, Baghali Ghatogh ( white bean and dill stew), torshe tare ( sour herb stew), Mirzaghasemi ( eggplant stew), Mahi sefid ( don't know the translation, special fish belongss to that sea), Bademjoon kebob ( roasted whole eggplants) and mainly Kebob Torsh ( sour kebob made with beef marinated in wulnut and pomegranate paste).

The service was overal good. Very spacious,  with free parking in Westin Hotel ( don't forget to register ur licence plate at the reception), nice and polite staff.

Quality of food is very good. I ordered \"Baghalipolo ba mahiche\" which they didn't have at the time. 

It was not like downtown restaurants that you are forced to leave cuz the waitress comes to you 50 times, very relaxing environment and  delicious food made a good memory for us."}
{"text":"DO NOT GO HERE! We came here for Persian new year, and we regret it. My family came here from Michigan and while eating dinner a pot light fell on my cousins head and cut his eye open. When we brought the incident to the managers attention his response was \"real men have scars\". The customer service was atrocious and the fact that they took the incident so lightly is shocking to me. Avoid this place!"}
{"text":"Amazing Persian cuisine. Our goto restaurant every time we are in Toronto. They features great options from the North of Iran. A neighborhood gem!"}
{"text":"After reading some of the reviews I was a little apprehensive about coming here. But we had already made reservations. 
We initially couldn't find it as you have to go in to the Westin hotel parking entrance. 
We went for lunch. They have a good variety menu and the prices were reasonable. Servers were very friendly and the food was great. 
Only got 4 stars because we asked to substitute the rice for salad, which they said was ok, but didn't tell us there was a surcharge. Only $3, but we only found out when we got the bill. It would've been nice to know in advance cos maybe we would've had both. 
I would definitely go back."}
{"text":"Very overpriced and terrible service!

We went there on a Saturday night that they had live music. It was TOO LOUD and we couldn't even have a conversation. It is not a concert! It is a restaurant! They set the tables very closed to each other. The person behind me kept kicking my seat. 

The food was OK, but the service was so bad! For the price you would except a better service. What I really didn't like was the way they tried to add to our bill. The waitress asked each of us if we liked our food with full rice or half rice/ half salad. She didn't mention it is $2 extra for half/half option. Considering the price, this $2 is really nothing, but I found it really annoying to mistreat the customers. She was really pushy to get more orders from us. We told her we need few minutes to decide if we want any dessert or not. She said (in a very rude manner) that we can order now and she can bring them few minutes later!! When they delivered the food, the waitress stood in one place and handed everybody's food to me! Sorry lady, you are charging this price and even don't want to move around a table? She didn't pour water for us and gave us a terrible attitude! Nobody checked on us after we got the food! We were \"almost\" done when she came back and took our plates and didn't ask my mother if she is done or if she wants a box (her plate was half full).

Last but not least, the band was terrible! Don't count on it!

I will never go back again."}
{"text":"Food was really bad, pretty sure rice was for couple of days ago and meat wasn't marinated well or cooked properly.
Satisfaction 3/10"}
{"text":"This place is used to be good but it changed a lot. I came here the first year they opened and everything was amazing. Last year we were invited for lunch and it was a disaster. Unfortunatly, I had to come here again for another big gathering. I couldn't even touch my food this time. I ordered chicken kebob, the first bite and that's it... It was so salty and the rice was so blend. The quality dropped drastically. I think it's way overpriced based on the quality and service. I asked a few times for water and nothing... They just forgot...The servers are basically not trained at all. You have to ask a few times to get (or not) what you want. They don't have pleasant manners to make you even come back for the second time, so why bother. 

You can try amazing Persian food right in downtown; Pomegranate restaurant and Shaherzad, Darbar, Banoo. These are a few awesome restaurants that you can enjoy an amazing cultural experience and delicious food!"}
{"text":"Not so good food but I enjoyed myself very much, hence a generous 3 star rating.

Good bread. The \"torsh kabob\" was way over done and rubbed with some cheap pomegranate sauce. I told the server too that it was bad.

Service was good but i felt I was being pushed to order more and more. Don't know tipping in canada but the server brought her little credit card machine to the table and asked how much to add for the tip, i said 20% and didnot even get a thank you.

Had a great time with the people at the table next to me. They could not tell I was Iranian (born) and were talking to each other nasty....then the waitress spoke farsi to me and they realized what was going on!  Anyways, with some fun iranian jokes on my side, they felt right at home.

Avoid the kebobs. I am sure other stuff are good unless they are made with cheap over powering pomegranate sauce."}
{"text":"Decent experience at this restaurant. An upscale persian place to dine in at. Its located beside the Westin hotel at yorkmills and don mills. Give it a try if you are in the area."}
{"text":"Good place for gatherings nice environment, food is really good, some of them are pricey but they do have dishes under $20. Must come back again"}
{"text":"One of the regular restaurants that we go to for Persian food. From our experience the food has consistently been good. I personally think their Koobideh, barg and torsh are some of the best in the city but i do hear from others (and reviews here) that the food is not consistent. Also the service has been great everytime we have been there. Only thing I remember is that once, they didn't have many of the items in the menu. We almost always order the kabobs, their bademjan kabob and baghalighatogh. The bademjan kabob is specially my favorite. We tried their morgh-e-mosama stew once and wasn't a big fan. It was too sweet and sour for my taste. The restaurant itself is nicely decorated and spacious and does have good views if you sit close to the window. They have improved the bathrooms. I remember a few times before that the bathrooms were not very clean. The parking is free as they validate it for you by entering your license plate on a laptop at the entrance. Overall, I would definitely recommend Gilaneh if you are craving Persian food.

Food: 4/5
Service and atmosphere: 4/5
Price: 3.75/5
Overall: 4/5"}
{"text":"Last week was my second visit to this restaurant. Their food is authentic and very high quality. Their portion size and value are good as well. The decor is really nice and get a seat by the window as it overlooks a beautiful ravine. If you are looking for a good Persian meal go to Gilaneh!"}
{"text":"Visited them yesterday and service was extremely bad. Their Kabab Torsh wasn't as good as before and even though they weren't busy the server couldn't do his job properly. He brought my friends cocktail with no ice and also brought the wrong order for him. When he said the order is wrong he immediately took it and tried to fix but it just got worse. My friend ordered Gilaneh Special and it was not properly cooked. Not recommending this place at all."}
{"text":"The owner of gilaneh and north are the same but the food quality here is a lot better. The portions are enough and proportional to the price. I ALWAYS get Torsh and would never get anything else. I recommend getting their homemade doogh and mast mosir as well. The view from the windows is amazing, specially in the sprint and summer."}
{"text":"I 've never been to awful restaurant like this it was herribel and also with mean staff i've never recommended to anyone"}
{"text":"I believe if you want to taste a real authentic persian dish, this resturant is the place to go. We were invited there for a birthday and it was a great experience. I love their appetizers specially the Bademjan Kabab which is fried eggplant with walnut and pomegranate stuffings. I would highly recommend their Salmon and Kabab Torsh. The servers are also generally very nice and welcoming too."}
{"text":"This place used to be a top pick for my friends and I as a Sunday get together lunch. But sad to say, I knew eventually this place would decrease in quality, quantity and customer service. Sad really... 

A group of us (7) arrived for lunch on Sunday, the place was half full and we looked around for a table that would accommodate everyone. The gentleman told us we only had one option to sit at the round table that sits 5 people comfortably and he would add chairs. We asked why we couldn't sit at one of the other vacant tables that had 8 chairs he said the other tables were reserved for 6:30... It was 3:30 :S really???.

He insisted we sit there, they added a few more chairs now imagine, a small round table 2 girls 5 guys 1 who has massive biceps and needs the extra space to eat at this itty bitty table. so we sat. 

It gets worse!!! 

So you have a table that's already disgruntled, the least you can do is get a server at their table immediately to lighten the mood as everyone was already annoyed. but noooooooo... we waited for 15 mins for someone to put menus at the table, every server, every manager wearing the fruity pink shirt walked by and just observed and kept going about their business. 

So we got up and left. the manager didn't even attempt to make us stay or even apologize. 

Won't be coming back."}
{"text":"The seafood we ordered was great an the lamb shank was so tender brought my parents here on Mother's day and came back again for lunch during the week with my cousin. The service was good as well!"}
{"text":"The food is great compare to fair price especially Kabab torsh and Kateh kabab :) the atmosphere is amazing especially with all the beautiful traditional decorations, you think as if you really are in the north part of Iran. One thing that you should remember is to not pay for the parking and give your plate number to one of the staffs and they'll take care of it, however we paid as we didn't see any sign mentioning that the parking fee is on restaurant :)"}
{"text":"Being married to a Persian, I tend to compare Persian restaurants to the food his family cooks. The food here is an upscale version with the same excellent flavours. 

The prices are somewhat high. The service was good and very friendly (thank you, Reza). The portions are large, so order accordingly."}
{"text":"On a recent mini-trip to Toronto with my Persian family we stayed at The Westin Prince and decided on giving Gilaneh a try before heading back to the airport. 

The restaurant has a cosy, rustic, romantic, village kind of feel overlooking beautiful green trees. 

As you walk in you are welcomed by a wonderful scent of Persian bread. We ordered a few dips, mast mousir was my favorite. I had a Caesar salad (nor Persian but delicious) and torsh kebab for my entree. It was very tasty. 

I've been to Iran and many Iranian restaurants in and outside of Iran, Gilaneh in Toronto ranks pretty high up on my list. Give it a try."}
{"text":"Had dinner here on Saturday with my family and some friends. When I was told we would be eating here I checked Yelp to see what was good and was horrified by the reviews. I had very low expectations of the dinner going in but I thought it was great!
We were a group of 6 with no reservations but we showed up around 830 and were seated within 5 minutes.
Most of the other diners in the restaurant were Persian as was our server. The food did take some time to come out (I was really hungry), maybe 10-15 min after ordering. They were out of the zeitoun parvardeh (marinated olives) which was a bummer but the rest of the meal was very positive:
1- the bread they bring with the appetizers is yummy, they brought us two pieces twice, the second round was piping hot and delicious
2- the apps were amazing, I liked the ghormeh sabzi over tadig best, the khashkeh bademjan was great too. The mizehghassemi was yummy but maybe a little under salted which is fine bc sometimes it can be too salty, it was super garlicky which I don't mind but some at our table did. The mastomoussir was also very mild.
3- we had a vegetarian in our group who was really happy, there were a good amount of options for him. For his main he had the veg kabob with baghali polo. 
4- I had the kabob Torsh with half salad half rice (btw this half salad half rice is massive bc u get like a cup of rice and a huge bowl of salad). My kabob was good but I will be honest I have had better juicer kabob Torsh. My friend had the soltani and the koobideh was incredible, so juicy and flavorful! I had plate envy!! His barg was excellent as well
5- the portions are generous, getting apps and mains (1 per person) is way too much food. Would recommend 1 app per person and 1 main between every two"}
{"text":"Horrible, just horrible! They probably changed their chef a few months ago because since then the food quality has kept falling. The torsh tasted like barg because it wasn't marinated enough, the koobideh was extremely dry and they served us stew from nights before so it just tasted bitter! They even reduced the portion size gradually on the last few months! When we told the manager about the food, she just said thank you for informing us! She didn't even apologize! Their service left us for 15 mins after taking the drink order and didn't respond to us! This was one of the best Persian restaurants in Toronto just last year but now it's on my never to go to list of restaurants! Save yourself time and money and don't visit this place!"}
{"text":"I visited this restaurant looking to try the special dish Kabob Torsh. I first tried this dish at a different restaurant in Toronto a few years ago. I must say I could not be more disappointed with Gilaneh Restaurant!

First the service was horrible and I'm one who usually doesn't get upset about bad service on a busy Saturday night. After sitting down it took 30 min to find the waitress. We ordered Jack and Coke drinks (as simple as you can get) and we were served two shots of Jack in a tall glass with no Coke or ice.

We were told to try the Bademjoon kabob appetizer which wasn't bad. But it took us reminding the staff after 1 hour about our appetizer. Ok fine.

Now to the actual meal. We ordered four orders of kabob Torsh for all of us. Each plate had burnt kabob (you could taste the burnt), too well done, and just not good. The rice was cold too, but whatever. I was really disappointed in main meal (as bad service happens sometimes), and I'm really hoping to go back to Shomal restaurant on this Toronto trip where I first had Kabob Torsh."}
{"text":"Staff and food is horrible 
Very rude poor food microwave heated
I mean none grilled food
Feel sorry gor that great design and interior 
Will never ever back"}
{"text":"Excellent choice of Persian food. I had Soltani. Good quality meat & lots to eat. Homemade Persian ice cream was also delicious. Setting & decor are also well done."}
{"text":"Disappointing food quality, and under average èservice. They used to be good but now..."}
{"text":"This place is great for Persian food as a lunch, dinner or banquet. The museum like entry as you come up the steps makes you wonder what's in store for you.... It's about a really great meal from outr favorite sister restaraunt to Shomal"}
{"text":"Second and last time to have a disappointing experience at this place. Arranging reservation for a group of 11 seemed to be a monumental task that even after 3 phone conversations, could not be managed properly.
Once seated, service was mediocre at best, since there was only one server for multiple tables. It was slow to start with insufficient water and bread. Once food started arriving, it took a good 10 minutes for all 11 dishes to be placed at the table. 
Food quality was poor, specially for chicken (dry and tasteless) and kebob which was salty. The quality is extremely inconsistent. It is like having a good or bad hair day. Beware.
To top it all, one of the staff was quite rude and claimed: \"Oh, regardless how bad we treat customers, people keep coming back\". Well, if you are reading this and go there to get bad service/food, then it is on you.
Follow-up conversation with manager who refused to allow to escalate to the owner, could not calm things down. Apologizing profusely with no plan to remediate was quite hollow."}
{"text":"What a great fun place.

Sister restaurant to Shamal (North), expect good quality Irani food here.

Interior wise and location wise, this is a great option, especially for family or business. 
On the weekends, they south side of the restaurant has live music and Karaoke making it a boat load of fun if you sing in Farsi. Really good for hosting large birthdays."}
{"text":"I'm seriously surprised by all of these negative reviews! 

The interior of this place is very cute. It has a old village theme and I really like it! 

When you walk in, all the waiters greet you. I have never met a rude waiter here. Our waitress was pretty quick with bringing the menus and getting our orders. Our food came right in time and we had no problems there! 

I usually get the kabab torsh which is AMAZING! It melts in your mouth and it's marinated just right! My parents usually get shandiz kabab (lamb chops) and it's super delicious. The salads are fresh and the bread they bring for you is also very good! The only thing that I can say that was just OKAY was the rice. Other than that, everything is awesome here!"}
{"text":"I gave up trying to convince my buddy that my previous horrible experience with the food is enough reason not to go again. So, we ended up going again.This was even a worse experience than my previous visit. I will leave you with a picture of gum stuck to the back of a plate and if that does not disgust you enough, keep reading my latest review:

The Shirazi salad had almost no taste.
The rice had a terrible texture and was mushy. Usually, when I go to Persian restaurants it shows that there has been good effort in making the rice, but not here.
The meat was not properly cooked.
The 1 star is for their fresh made bread, which always tastes great.
They had improved in terms of their service, but heck I came to eat good food and was disappointed.
The management sucks big time."}
{"text":"I've been here at this location twice and 3-4 other times at their other branch \"Shomal Restaurant\". I visit them for one reason and one dish only, Kabob Torsh (Sour Kabob) that is a pomegranate sauce marinated beef kabob. My experience with all my visits 80% of the time has been good beside the very last time that they over-cooked the Kabob Torsh (it was hard and burnt on the edges) but I will not hold that against them cause almost all other times they did everything right. While you are at it definitely try Kabob Bademjoon as an appetizer (that's stuffed mini eggplants also cooked with pomegranate sauce). Honestly all other dishes that I had a taste of was great: Baghalighatogh, Mirzaghassemi, chicken kabob, Koobideh and the fried white fish!"}
{"text":"1. A member of our group was alergic to eggplants. They ordered \"khoresht gheymeh\" with potatoes, they gave him the stew with eggplants. He asked the server to change it, the server offered him to remove the eggplant from the stew, while the stew was somehow mixed with it. 
2. We reached the restaurant at 8:30, at 9:45 still waiting for food. 
3. We were 15 people asked for 1 table, they gave us two separate tables after 30 minutes of waiting and didn't help moving them arround saying we cannot change the design. 
4. Visiting a Persian restaurant with traditional architecture, you want to listen to Persian music and the last thing you may want is Spanish guitar. 
5. Non-halal options are just limited to 4 vegiterian foods at the last page of the menu which can be easily missed."}
{"text":"Terrible service, not so good food in comparison with its high price. The server showed up after 20 minutes with a menu without any drink on it. After half an hour  that we thought it is a non-alcoholic restaurant, the server showed up again and said oh we have another chick menu for drink. Kebab Koobideh was very bad, the rest so so, but with that price you expect a much better food. Music and decoration were good, I wish they could spend a little on customer service.

At the end we were begging the server brings our bill and after more than half an hour finally we paid at the door with the extra %15 by force tip.
On their website is written if you like them, will get 10% discount. But don't like it! As when I told the server, she said I have never heard of discount and even Facebook!!"}
{"text":"I was a bit skeptical going to this place after seeing the reviews since a lot of people seemed to have had negative experiences here.

With that being said, I was pleasantly surprised.

Location: tucked in the North of Toronto, the place is easy to find. I liked the decor a lot, reminds you of Persepolis  and southern iran.

Food: we got a mix of dishes as appetizers. We had the spinach borani, kashke bademjan and eggplant kebab. The bread is freshly baked and tasty, so try not to eat too much of it so you can enjoy the actual food. The eggplant kebab was really good! With ground walnuts and pomegranate molasses stuffed, it was the perfect mix.

For main dishes, we got a mix of kebabs. Generally, the lamb and beef ones were better tasting than the chicken ones. The kebab torsh was specially good.

In terms of dessert, we were too full to get anything heavy, so opted for some tea and small baklava. Persian baklava is not the same as Turkish or Palestinian baklava so keep that in mind. But given that the tea is unsweetened, the baklava's sweetness is just right!

Service: this is where the lock comes. Our server was great, but the problem here is the shortage of servers. There weren't many people when we first arrived, but as more people started to come in, service slowed down because there weren't many servers working."}
{"text":"The food is great, but the service is weak. I love their sour Kabab and the appetizers. Be sure to bring a jacket with yourself, as it turned out to be very cold!"}
{"text":"Great decor and location. We tried their Bademjan Kabob, Kabob Torsh and Bagheleh polo mahicheh. Food came fast and was nicely presented. Very friendly staff. The food quality was pretty decent."}
{"text":"We were staying at the Westin and since this restaurant is within the building, we decided to visit it given my love for Persian food. The meal and service were excellent!! Impeccable clarity on the menu from the waiters and great friendly service. Our Kebabs were incredible - spiced perfectly and juicy accompanied with delicious dill rice.

Finally, I had been playing with my watch during dinner and as I left the table I forgot it. I came back 10 minutes later and asked someone if they had seen a watch. He went back and brought back my sunglasses and Rolex - I was so impressed with heir integrity. 


Thank you!!!! We will be back"}
