{"text":"I hesitate to talk about Gill's. If I tell you about it, then you'll go there, then two drive up windows won't be enough. Then the better than Starbuck's coffee won't stay cheaper than Starbuck's coffee. Gill will have to expand, (from 25sf to perhaps 50?) and this wonderful little place will turn into just another Starbuck's!  So don't even think about going there. Don't ponder getting more coffee for less money. Don't even consider getting it faster. Don't notice the Photomat sized building as you pass by. Don't even look to the East side of power road between Warner and Elliot.  (waving hand) this is not the coffee you are looking for...  move along...  See you there, I hope not..."}
{"text":"Gills Grounds is excellent and is my coffee shop of choice.  Gill, the owner, is always welcoming and enjoyable!  The coffee is better then Starbucks and priced better, plus I much rather give my money to a small business."}
{"text":"Just tried Gills for the first time today, and I am so happy I found this little shop! Easy to read menu, great selection of drinks. But the best part was that the service was excellent and my drink was AWESOME. Gill was the nicest guy, and you can tell he really cares about his business. I ordered an iced white mocha, I have to say it was perfect. I don't like when I get a drink that is overly sweet and you can barely taste the coffee, this drink was the perfect balance of sweet and coffee. And you can tell he uses good coffee. I got whipped cream because he said it was fresh cream, and it sure was! Not the super sweet whipped cream. Perfect perfect perfect all around- I will be back!!!"}
{"text":"Amazing customer service and coffee! The barista was very friendly, so much so, that when you leave, beverage in hand, you have a smile on your face and feel happy and you haven't even tasted the goodness that you bought yet. He believes in his product and is very good at suggesting something fun that you may want to try next time. I love this!  One of the best Americanos that I have had.... creamy and  full bodied. I find myself comparing others to it, wishing they were as good. The chocolate chip cookies were a big hit by my kids. Normally that wouldn't be surprising, kids and cookies, of course they like it. But they said this one was \"different in a really good way\" and one of them doesn't usually like chocolate chips. Do yourself a favor, stop by and experience Gill's!"}
{"text":"Favorite coffee shop in all of Phoenix!! Great service and fantastic drinks. Gill's Grounds is top notch in every way."}
{"text":"Great coffee and friendly!!Love going there!!Several kinds of coffee and tea to!!     Don't miss going to Gill's best coffee around!!"}
{"text":"Was very surprised by this place. I was expecting so much from the great reviews. Sad to say the coffee was terrible.. I tried the iced mocha,black tea, and black coffee, and was very disappointed. Iced mocha had no distinct coffee flavor, and the coffee was watered down and tasted like Folgers instant coffee. Was really hoping that I'd like this place :("}
{"text":"Excellent coffee at prices more reasonable than Starbucks or Dutch brothers. Gil is always delightful and friendly. He doesn't mind helping you make choices from the large menu if you can't decide what you'd like."}
{"text":"My second coffee commentary today: This is my new pride and joy coffee shop in the far East Valley.  This is an Alaska style coffee drive through with a drive up window on both sides and it is located in front of the farm on Power and Warner. I have had the best coffee and service I believe I have ever had at a coffee shop at this stand. The owner is one of the nicest guys around and puts his heart and soul into the coffees he makes. He said one time when he found out I live a bit away, \"Wow... I better make this the best coffee EVER!\" That he did! This coffee shop also serves smoothies, Italian soda's, chai's, and my daughter loved his demeanor and said, \"He loves what he does!\" If you want to feel like a real customer that is treasured and appreciated, as well as get a great cup of joe then this is the coffee shop for you. On Friday's they have \"chai day\" and you get 10% off a chai. He does have a punch card and has a double stamp Thursday. This is definitely a diamond in the East Valley and I've been known to drive a little out of my way for the service and coffee they provide. I know when he makes my coffee that he is doing it with care and trying to make it the best cup he can. Check out their FB page Gill's Grounds . Enjoy but don't get it so crowded that I can't get my coffee. The secret is out! http://gillsgrounds.com"}
{"text":"The salted caramel white chocolate mocha is amazing! Definitely goes well with the warm weather, too. Gill is an awesome guy. Coffee is one of a kind"}
{"text":"I stumbled upon Gill's waiting for my husband at a nearby doc's office. The guy working was so friendly and the coffee was perfect! I ordered an iced Americano with cream. I'd put it up there with the best cups of coffee I've had. If you're passing by definitely stop. I'd say its worth going out of your way to visit ."}
{"text":"Awesome local family owned place.friendly employees ,great coffee and other options. Beats waiting in a drive through for 30 minutes just to buy expensive coffee from one of those chain coffee places. Way to go gill!!"}
{"text":"Chris and his team do a great job!  Drinks are always fresh, hot, and delicious.  Great place for my morning drink on the way to work."}
{"text":"I honestly wasn't expecting much when I realized that Gill's was a drive through/walk up coffee stand however my friend (whom I was visiting and lives within walking distance of Gill's) told me that Gill's had the best coffee; hands down. I'm a Starbucks faithful and have to admit, the iced mochas that I had a Gill's during my visit gave Starbucks a run for their money.....actually, I liked Gill's much better . I was able to meet Gill - very nice guy! Fast and friendly customer service from Gill and his employees. If you're ever in Gilbert, AZ, I highly recommend Gill's Grounds."}
{"text":"We love gill! He always has a smile on his face which is really refreshing these days. His coffee is the best coffee in town! Cost is comparable to Starbucks, but it's going toward a local veteran, so we try to only go to gill!"}
{"text":"We went there early on a Saturday morning. The prices are reasonable. The latte was great, as was their chai. Gil is very friendly. It was well worth the trip."}
{"text":"Went here for the first time with my advocate coffee loving gf and we were instantly greeted with a smile from Gill himself and he handed us a menu, also surprised us with chai Friday, cheap prices and great coffee. Definitely will be back!"}
{"text":"I love this place! The owner is so friendly. Both the coffee and chai are excellent! The prices are reasonable. I have been here several times and never been disappointed. Definitely worth the stop!"}
{"text":"My wife who owns a coffee shop in a small AZ town turned me onto this place. I've since went through a punch card (10 drinks) and have no complaints. The two employees I've had serve me are both very professional and respectful, it's a drive thru so it doesn't take much time to grab a coffee. The espresso tastes great! I've enjoyed every cup of coffee from this nice place and friendly employees.."}
{"text":"This is by far the best coffee shop in town! Excellent quality coffee, goodies and smoothies.  The customer service is beyond comparison.  We go about once a week and have the best experience every time. They always know what we order, they are fast and they are very engaging and the drinks are always to die for.  I highly recommend Gill's Grounds! I will be a loyal customer for life."}
{"text":"Wow. Welcome back service with a smile! Gill is so friendly and my pumpkin spice latte was delicious! I'm coming back here often."}
{"text":"Excellent coffee! Great service with a smile!Always enjoy coming and supporting local businesses"}
{"text":"First timer.  \"Grog\" will get ya there on the alertness scale of 10!  Support local business!!"}
{"text":"After a disappointing peach picking experience at Vertuccio, I promised our kiddo a smoothie and rolled on over across the lot to Gill's. We live down the street and everyone in our community raves about this place. Time to give it a try.  The barrista was an adorable and friendly dude who was courteous, prompt and made a mean strawberry banana smoothie. Seriously mean, because I was upset that I didn't order one for myself. Tricked my preschooler for extra sips to \"make sure it wasn't too hot\" and then \"make sure it wasn't too cold,\" for good measure. A creamy and delish smoothie that is one of the best I have had in AZ. With newborn twins, mama needed some liquid sleep, so I ordered a large iced mocha for myself. Really high quality coffee but slightly bitter for me. My fault for not asking for Splenda.   There were several other drinks that sounded great and I have heard good things about the iced teas. It is soon to be lava hot here, so anything with \"ice\" in the description gets a thumbs up from me! We will definitely be back."}
{"text":"Hands down my new favorite coffee spot.  Gill was so genuine and nice!  I got an iced americano with some macadamia nut flavoring and it was amazing!  If you haven't tried it, do yourself a favor and go!"}
{"text":"Lattes are delicious. The staff is super friendly and helpful at making suggestions!"}
{"text":"I love coming here, I always get an iced chai tea and it's the best. Gill is one of the nicest people so coming here to see him makes it all the better."}
{"text":"Love this place. They have punch cards plus are affordable. I'm a tea drinker and was impressed by their different loose leaf teas they had."}
{"text":"Top notch coffee!!!  Had an iced mocha and wife had an iced Deadeye. Super fresh and strong.  HOO-RA!!!    Just need a seating area, which was told picnic tables are coming soon.   Just in front of farmers market.  So stop by get you a cup of your favorite style brew and enjoy the market.....then getcha another one before you go."}
{"text":"What a pleasant experience! You're going to want to tip 200% like I did. Gill is perhaps the friendliest person I've ever met. And my chai tea with almond milk is delicious!! I'll be sure to stop by this little drive-up building next time I'm in Arizona."}
{"text":"Casual, outdoor, delicious lemonade. I had coffee and lemonade there today. My friends and I sat at the picnic table. It was very nice to be on the farm and enjoy the home made drinks."}
{"text":"Great selection of coffee and tea, friendly service and excellent prices, my favorite place for hot or cold tea"}
{"text":"First off, Gil and his other employee are very friendly. They are a great example of good customer service. Secondly, their coffee is SO GOOD and affordable. I would recommend trying this place out if you haven't already. It doesn't have the typical coffee shop appearance but it has its own charm. My favorite is the iced grog."}
{"text":"Looking forward to driving through Gill's Grounds this morning. Gill is a friendly guy with a good work ethic. He's always got a smile, a laugh and a willing heart. Good to know you, Gill!!  The coffee and tea are good enough for me to come back long enough to know that!! Well done!"}
{"text":"Need a quick coffee? This is a delicious, locally owned drive-thru coffee bar. Super friendly service and loyalty punch cards! ;)"}
{"text":"Forget your major chain coffee shops.  Gill's is a great little place with 2 drive up windows for coffee, tea's, Italian soda's, light snacks, etc.  Fast friendly service and great location, right next to the Powers Road farmers market.  Stop in even if you see a long line of cars.  The service is fast and the drinks are tasty.  Support your local small business today."}
{"text":"We love this place! And by we, I mean us humans and our pups. The little guys devoured their puppachinos til the very last drop. Such a generous treat from the kind folks at Gill's Grounds. We also had an iced matcha latté, which was just the right minimal sweetness, and a dirty chai. Both were very good. This place is definitely worth checking out for their quality drinks, friendly baristas, and furry friendly treats! We give this place 2 paws up!"}
{"text":"I am extremely impressed with this business. The owner is a very nice man that obviously cares about his customers.  I went for the first time this morning to grab some coffee because I had read all the previous great reviews. When I pulled up, with my two young children in the backseat, we had to wait for about three minutes or so before the owner took our order. I guess it took him a little longer then he felt comfortable with to get to me and was very apologetic.  I said that it was no problem and ordered my drink. When he gave me my drink, he also gave me a free cookie for the kids and a punchcard with a free drink because he said he felt bad that he made me wait. Really, it was no big deal to me about the wait. It wasn't even that long! I will whole-heartedly support this small business owner because he truly cares about his customers and them having a great experience! The coffee was really great too!"}
{"text":"This is a delicious, locally owned drive-thru coffee bar. Super friendly service and loyalty punch cards! ;) try the salted caramel white mocha blended with their home made whip. Yes please, thank you."}
{"text":"I'd say something extravagant but just go here words don't do Gill justice . Coffee is amazing but Gills attitude is what makes this place !! !!!!"}
{"text":"I was here looking for a Christmas tree at Vertuccio Farms, and when I came out, I noticed this little coffee shack. It's a cute little shack right on Vertuccio's property in the front of the farm as you come in. At first I had reservations, would their idea of coffee be a milkshake or sugar flavored water with a little bit of coffee flavor as so many coffee shops do here in AZ? I ordered two salted caramel lattes and they were so good. The guy running the shop was very enthusiastic and friendly, almost too hyper, but I view this as a good thing. The lattes were good and they had this awesome salted caramel drizzled all over the whipped cream. Not too sugary, and just right. Just like Goldilocks would have wanted.   So there you have it. Come for the Christmas trees, stay for the coffee."}
{"text":"Was in town for a couple days and was told I need to go here for my white coffee fix. Great service, great coffee at a great price. Beats Seattle pricing any time."}
{"text":"Gills is always on point. The owner is friendly and a veteran. It's always a pleasure to support a local business as I own one myself.  My favorite drink is the motivator. Go try it !"}
{"text":"I am all about supporting local businesses so I had to try this place out. Friendly customer service and seriously amazing drinks. I love their coffee and they can customize it anyway you like it! Holiday season brings Gingerbread Lattes that are so much better than Starbucks.    I'm addicted to their Mango Tea. It comes one size but is huge and only $2.50! You've gotta try this place out!"}
{"text":"Cute little shack! Great friendly service. Freshly whipped cream. Lots of choices. And reasonably priced! Will be back!"}
{"text":"I had a rocky first experience ordering at this coffee stand. But after deciding to give it another try, I had a beyond great experience and a delicious dirty chai! Their homemade fresh whipped cream is bomb. They have two service windows and service is fast!"}
{"text":"This is the jam place to buy your coffee fix addiction! We love it! The whole world  should have a Gill's Grounds in their life."}
{"text":"Very friendly and fast service. The Americano I ordered was fresh and delicious.   I mentioned that I was new to the area and trying the place for the first time. When I was given my rewards card, it already had 4/10 stamps on it! Gil himself took my order and was very friendly.   I would definitely recommend this shop to anyone looking for a quick beverage on the go."}
{"text":"Best coffee ever, so smooth and the owner is so nice! Super cute military concept big menu good sugar free options"}
{"text":"I love this place - best coffee drive thru in town. Plus they offer almond milk. They are nice and the 10th drink is free!!!! Love starting my day at Gill's Grounds. And I love supporting local companies."}
{"text":"Great Coffee, Top Shelf Service!  Stopping by Gill's always puts a smile on my face. Chris has earned my business by making any crazy drink I order and if something isn't right insisting on correcting it.  His \"Grog\" which you can get whole bean or ground is a nice mellow all day coffee. The nitro/ice coffee is also a recent favorite, and when I feel the need to take it over the top the Motivator always gets me going.  Thanks for rocking excellent coffee!"}
{"text":"Gill's Grounds is by far my new favorite coffee shop. He is so friendly every time we come by. His coffee is fantastic. He is great at recommending and creating different drink combinations. During the holidays his Gingerbread Chai was my go-to."}
{"text":"This coffee shop is right in front of Vertuccio Farms and has become my favorite place for coffee.  The owner is so upbeat and positive and has phenomenal customer service!  He greets you as if you're a friend stopping by for a visit and recognizes you as a regular customer which is great.    Pricing on the coffee is great and what you get for the cost is awesome quality.  I love the fact that he is always willing to come up with drink combinations on the fly and also makes recommendations for new things he's got in the works that aren't even on the menu.  My husband tends to get the Motivator (Super Caffeine Infusion!) and asks to have him \"spice\" it up with something extra and today it was English Toffee flavoring and in the past he's done habanero and many other flavors.  I even asked if he could make something that tastes like a Chocolate Covered Cherry and he whipped something up that tasted just like the Cherry Cordials and it was awesomeness in a cup!    I'll go out of my way any day to stop by this coffee shop, this place is fantastic!"}
{"text":"Great place for not just coffee, but protein shakes, raw veggies smoothies, Italian soda, and iced teas. The two guys I've encountered working here are very nice, but they usually seem a bit hurried/worried even though I go at a time where nobody is behind me. They have punch cards and even sell loose leaf teas by the ounce."}
{"text":"Tried this place twice now. Owned by a retired Army vet would explain the military theme which i think is cool. Service was great and very friendly. Both visits were were pleasant and coffee was great. Its always good to support local small businesses but with the great coffee and service I'll be a regular! No complaints at all try it out!"}
{"text":"Coffee isn't too bad and the customer service is wonderful! Nice little drive thru coffeeshop. Good prices."}
{"text":"I've got the week off, and I wanted to go to a coffee place beside Starbucks or Kneaders, so I yelped for some fairly close places. Saw Gills grounds, had good ratings. So I drove by. I didn't know it was a drive-through, but I decided even so check it out. I didn't get the name of the guy who was making the coffee, but I think it's the owner. Super friendly great customer service.  I had my standard sugar-free vanilla latte. Very good. Delicious coffee. It's definitely strong, even though it was one shot.  Like one of the prior reviews, I like to support local businesses.  This is in front of Vertuccio's farmers market. There's a lot of cool stuff you can do there I guess.  I'm giving this four instead of five rating, just because I haven't had a chance to try enough of their drinks. So I want to make sure it's consistent. But for first-time visit, thumbs up. I'll be bringing my kids next time, because I want to also take them to Vertuccio Farms to check the place out."}
{"text":"Wow. These guys are so nice. The coffee is absolutely WONDERFUL. Such a great way to start my morning. This morning was my first time stopping at Gill's and it will not be my last! The menu offers a vast variety of not just coffee, but other drinks as well. The gigantic chocolate chip cookies are very tasty and baked perfectly. So glad I finally found a place that makes coffee the right way!"}
{"text":"I tried this place for the first time today and WOW, I am so impressed! I've been living by Gill's for about a year now and never thought to stop in, mostly because it always looked closed. Turns out it's just a stand-alone drive-thru. I decided to stop by on the way to the grocery store and I'm glad I did! Not only was the gentleman who served me super friendly but the service was pretty quick as well. I had a dirty chai with soy and it was delicious! Their price point is fair and I had a larger drink size than say, Starbucks and still paid less for the same drink. It was tastier too! Best dirty chai I've had compared to several other coffee shops. Luckily I grabbed a punch card as I know I'll definitely be back!"}
{"text":"I was in the area and looking for something that wasn't a chain. Loved my coffee and will be back when I'm around the East Valley."}
{"text":"Gill is such a nice guy! For me, the coffee wasn't strong enough and the flavoring overpowered the coffee taste so I'm not sure if I'd come back for the coffee but gills hospitality and warmth would make me come back :)"}
{"text":"This place has changed my life!!!!!!!! It is so rare to find coffee in Arizona that is not burnt or bitter. This place has smooth espresso and the perfect level of sweetness in all of their drinks that I have had. Not to mention their chai and matcha are amazing!!!"}
{"text":"This is a great place. Friendly service, great coffee and smoothies! I highly recommend supporting this small local American business."}
{"text":"This place is great! First time in. Gill has a great personality with quality products. I tried the Stinger (lemonade and espresso), and I'm a fan! I would have never thought to pair the two!"}
{"text":"Personality and a great warm greeting everytime I come.  Gill is always friendly and worth the slight detour on my regular route.  Not ever too busy when I come, but always enjoy the service and the beverage I receive.  Happy to see others had the same experience I have had.  Note: It is in a lot in front of a farm so look for it and once you come you will have no problem finding it again"}
