{"text":"I always enjoy coming to Ginza. Whenever I am there it is for some group get together and I love that the Hibachi tables are open and inviting. On my last visit, there was a group of 6 of us to enjoy hibachi..and we had a great time, our chef was charistmatic, put on an excellent show and was very accomodating. (He even was nice enough to provide a little extra of the meat as I am allergic to shrimp and didn't get to partake in the shrimp appetizer.) The scallop dinner is fantastic and yum to the miso soup. We also ordered sushi/sashimi at the table and it was brought out in a timely fashion and of course delicious. 

I will gladly come back and enjoy my evening with fun and entertainment and good food most of all. I always leave with a very full tummy and its overall very satisfying. Also Seaweed salad is a must!"}
{"text":"Been here many times.  Every time is better than the last.  Whether it's sushi in the tea room or seated at the hibachi grill my family always have a good time."}
{"text":"It's fun to watch them to do tricks but the food tastes pretty blend. Nothing bad about the food but Japanese food is pretty blend compare to most Asian cuisine. If you are a calorie watcher, it is the best way to eat your protein, carbs and vegetables in one sitting. for me, I need and want variety of different spices in my food. I can get a lot more with my money if I go for other Asian cuisine.
for me the excitement ends when the show is over. Food isn't that great."}
{"text":"Went here a few years back and I had to laugh at Kira's review because maybe he wasn't new, maybe he was the same guy we had!  We had a party of about 10 people and sat at the Hibachi grill. Having lived in Japan for 18 months I was really looking forward to this place, and I wasn't even expecting \"authentic.\" The cook, I wont call him a chef, kept dropping the utensils, sometimes on the floor, and then he'd have to go get some new ones. Once we got the food it was just BLAND. Awful! Absolutely no taste in the beef teriyaki that I had. To top it off the cook was expecting tips for his performance. It was embarrassing to say the least and a real disappointment. 
Last year my wife and I went to the east side one, did not do the hibachi, but the meal was again, not great, definitely not anything related to a Japanese meal that I have had but the server was pleasant and timely. There are so much better Japanese in Madison that we wont go again."}
{"text":"I usually go to the West Side Ginza, but thought I would give this location a shot. I had 6:00 reservations and arrived at 5:45. Didn't seem very busy as I could easily find seating in the waiting area. That was the highlight of the evening.

While waiting to get a seat, the hostesses were regularly arguing as none of them seemed to know what they were doing. At 6:15 1 of the hostesses tried taking us to a tea room, when we had reservations for hibachi. When asked when we would have a table, the hostess informed us that they were waiting for more menus. Finally, at 6:30 we were seated. My wife and I were squeezed in to the middle of a table for 8, making it 9 at the table (less than 5 minutes later another table in the same room was seated with 5 people).

After 15 minutes at the table, our waiter finally addressed our table to get drink orders. Nothing difficult here, a soda and a water. Another 10 minutes later I got a water. Finally got to place our order, 55 minutes after our reservation, and the waiter seemed to know nothing about the menu and needed to be corrected on nearly every order.

Finally, around 7:10, we started getting food. When our chef came out, I thought that dinner would finally get better. I was wrong, right off the bat, the chef burned the egg for the chicken fried rice. Instead of getting new eggs, he just continued to cook. Everything was over cooked and burned. My medium rare steak, had no pink. I was the only person at the table not getting teriyaki, and as a result, the chef did a very poor job splitting up the portions and I barely got any.

Once the meal was finally done, it was now the time to start waiting for the check. My wife and I tried making a game of it. The waiter addressed us at 7:32 stating that he would be right back with the check. I thought it would be 10 minutes, my wife thought 15, we were both wrong. 20 minutes later we got our check and it was time to go.

We brought our check to the hostess, she asked how was the meal, we told her awful, she rolled her eyes and ran our credit card. As I was signing the slip she asked if we were at the table that had to wait forever, we replied yes. She offered to take our name and phone number, but at that point it didn't seem to matter. Nobody in the restaurant seemed to know what they were doing and more importantly nobody cared to try. My wife and I have been going to Ginza's for 10+ years and over the last few, our visits have been getting worse, but I have never had such a poor visit, but it was bad enough to spoil my whole opinion of the restaurants.

Ginza has been one of my favorite restaurants, offering good food and well prepared meals, but it seems like they only care about how many table they can fill at this point. They are turning into another mediocre restaurant that just doesn't care. Hopefully this was an isolated situation, but I am not giving this location another opportunity."}
{"text":"This was the first time I've been to Ginza and I'm happy with the experience. I like the atmosphere and while we didn't eat in the tea booths I thought that was really unique. My date and I opted for the 'dinner for 2' option with the normal beginning courses, plus chicken and steak with fried rice. First, the soup was so good - brothy and not too salty - just right. Then, the small salad came out with the ginger dressing, which was refreshing. Then, the shrimp! I didn't want to eat too much before the main meal so I gave most of it to my boyfriend. We decided on teriyaki chicken an hibachi steak, both were really good but if I had to pick, I'd go with the steak. It was cooked perfectly and I just love that hibachi flavor. I ended up only eating half of my meal because I was so full, but now I can enjoy it for another night!

Our hibachi chef was entertaining, and our waitress was very nice! I'd love to go back for a birthday and get one of those cute little rooms."}
{"text":"The food was mediocre and waaaaay overpriced. We like the tatami setting but still was not worth the price. The bill was unclear. The only thing identified was our main courses. The rest was just numbers. After leaving the restaurant, we started to suspect that she might have automatically added the 20% tip. With rows and rows of just numbers, it was hard to identify.

In conclusion, I don't think I will ever come back."}
{"text":"Waited an hour for awful sushi. 

I love sushi. Even grocery store sushi. So imagine my dismay to discover that there is, in fact, bad sushi. Sushi I don't even want to finish. 

Despite its shabby but kitschy appearance, poor lighting, and strip mall location, I expected this place to be great. The people at the hibachi a seemed to be having fun and it has all the fun hallmarks of a true Japanese style restaurant. 

It wasn't. We waited 55 minutes for our food (and we were there early, at 5:30, with a 2 year old), and when it arrived, I wished it hadn't. We got 5 rolls, some of which are no brainers and impossible to mess up (Philly roll?). Yet none of them were good, and some were actively bad tasting. Not fresh, not flavorful, even the wasabi was bland. I could almost feel myself getting food poisoning. 

Good service can save a restaurant, but here it was indifferent. To wait an hour for food with no apologies or explanation is beyond the pale. Our server kept asking if we wanted more water. Dude, it's water; if the glass is empty, just refill it! 

The one good thing I will say is that they give a generous pour of the wine. Which you desperately need because everything else about this place will drive you to drink."}
{"text":"I went here on 7/28/15 and had a horrible experience. We had a reservation for 7pm and didn't get even a waiter until 7:45. They said they were waiting on a chef for our hibachi but never gave us a time. Finally after our first round of drinks (which they messed up on) and hearing there was no manager on duty to talk to, we decided to leave. We went to granite city and had a great meal. They even added free desserts just because we told them what an awful time we had at Ginza! #neveragain #zerostars #wtf"}
{"text":"I'm so sad to have to write this review. I USED to love this place.. it's the place we always chose for birthday celebrations. Which is why we went last night, for the first time in a year or so. What happened? To begin with, it was freezing in there. I'm not a total wuss, but I couldn't feel my toes after awhile. I never did take off my down ski jacket. I asked if they'd mind turning on the heat, and the hostess told me the grill will heat the place up. (It never did.) Next, the menus: gross! Mine had globs of what was probably teriyaki sauce all over it. I've never worked in a restaurant, but aren't they supposed to wipe those things down? Not only that, but the chairs were sticky, the table was falling apart.. My dad was sitting on some weird cushion unlike everyone else, and when he went to rearrange it, noticed it was being used to cover a huge hole in the bench seat. My 6 year old son put his boots straight out to the grill underneath the table, and his boot STUCK there. He pulled out his foot and showed me his boot still stuck to the side of the grill under the table. uck.

The food is yummy though! And there is A LOT of it. Too much, but I guess you can't complain about that.

After eating, we sat for 25 minutes with no sighting of our waitress. My husband hunted down a to-go container for me, and we asked a busboy, and then the hostess, for our check. We were standing at the door with our coats on before she finally whooshed out with our check. An hour and 50 minutes after we arrived, we were set to go."}
{"text":"Made a reservation for 7pm. Got there and weren't seated for over an hour.  Complained and was told \"well walk ins wait 2 hours.\" What's the point of making a reservation.? Staff was rude."}
{"text":"This is the ONLY restaurant I have ever set foot in that I would give one star or less.  I made reservations for my birthday which they completely flouted despite the fact I made it two days ahead of time and called them the day before to remind them and the day of before the reservation.  The service is completely incompetent.  I only got drinks and sushi at the bar because I left before the meal after waiting two hours past my reservation time, which were overpriced.  Utterly ghastly.  This is the only restaurant I would never give a second chance to.  That bad."}
{"text":"We had reservations for 7:00 but didn't get seated until 7:35. I'm glad that was the worst thing to happen. Once we were seated all else was forgotten. What a great time we had. The food was very good and the chef was very entertaining. The price was average for hibachi, about $30 a person. I am not a fan of the tip being included in the bill but that is what I've come to expect with hibachi restaurants. It's just me, I think a person should tip according to service received. When the tip is already included I don't tip as well. Yes, I could tip more but I think it's a bit presumptuous on their part that their service automatically is worth 18%. 
Sorry for rambling. Go, it's good food and fun."}
{"text":"My sister choose Ginza for her birthday. I hadn't been there in over 5 years so I checked out the menu and some Yelp reviews before going. Reviews on here were not great. I was hoping it was just an off day. Upon arrival, the place just stunk of oil. I realize it's a hibachi grill, it just wasn't pleasant. We had to wait quite awhile for our table, even with a reservation. One of the people in our party was going to be late and they wouldn't seat us at the grill unless we knew what he wanted. We were hoping to at least just be seated and get drinks started. We finally got to the table and it took a long time for our waitress to get our orders. I decided to order sushi. I thought I maybe needed to order this before they started the grill for the rest of the group. I asked the waitress if I should give it to her now. She took it but was rude about it. The food was good. Our problem was the atmosphere. Everyone in our party was grossed out that our shoes stuck to the floor. Someone made a comment that a nightclub has cleaner floors. The atmosphere is very unappetizing. It dark and smelly and dirty feeling. Bathrooms included. I won't be going back unless someone else picks it for their birthday again."}
{"text":"Total disappointment. I even took the manager aside to try and make it a special occasion for a visitor that had never experienced hibachi and he literally said quote I don't know what ur talking about. Onion volcano, dumb.  No patter, just a job."}
{"text":"Just ate here for the last time. Have gone here probably 20 times total in the past 4 years. Big fan of the sushi happy hour. However quality control is non existent. Found a hair in my salad, two out of my three sushi rolls were not made right and the crab in one tasted rotten. Totally disappointed. Check out VIP sushi next door. Much better and where I'll be taking my business from now on."}
{"text":"Wow.  Well.  Our experience here last night was quite pleasant.

The three of us sat @ the bar; my teen had a kiddie cocktail, he had a Belvidere martini straight up and I had a double Bailey's with cream, shaken.  They didn't have any good white Tequila (Cazadores, 1800 Silver, Milagro, etc) or Rum (no Mt. Gay, Plantation, Applewood Estates, etc.) but that's not the Bartenders fault...

After less than 10  minutes we were sat at an Hibachi table with a group/family of 5.

Our waitress took everyone's orders and while we waited for our chef (Alberto) my daughter and I enjoyed an order of California roll.

Even with 8 people at the table our chef had no problem tweaking the food and the cool presentation didn't suffer - a couple had low salt diets and asked for no sauce and my guy asked for Med. rare/no sauce on his Filet Mignon.

He and I ordered the 'Dinner for Two' of chicken and steak with garlic shrimp (a little TOO garlic-y) with salad, soup and the filet. Our daughter had the hibachi chicken and shrimp with our same two sides.

We were there about an hour and a half and had a good time speaking with the other participants and amongst ourselves.

Will return; we thoroughly enjoyed."}
{"text":"We had a reservation tonight for 2 at 6:00.  Arriived at 5:55 and were told it would be 10 minutes until we were seated.  We finally were seated at 7:30, after watching a couple without a reservation being seated before us, as well as several larger parties wh arrived after us being seated before us.  The manager did finally take 15 percent off, but still, don't over book your reservations."}
{"text":"As much as I wanted to give this place more I was really disapointed. It wasnt the staff, they were great but the food was mediocre and the place is just falling apart! The seats are ducttaped together and the carpet is disqusting! The place would do so much better with a little remodeling! 
The fish I had was very fishy and the sides were over salted. I dont think it was the chefs fault as much as the prep cook who got it ready. I was really disappointed in the food qualty and have had  better meals at take out establishments. For the price I would pass until I see progress."}
{"text":"Garlic shrimp and teriyaki filet.  Best meal there is."}
{"text":"We went here the other night and ordered the hibachi dinner for two, but they were out of filet mignon to upgrade. The chef didn't do any of the usual hibachi tricks, other than the onion volcano. The food was just ok; the meat wasn't seasoned at all and the hibachi soup was overly salty. The service was also very slow. Overall, we weren't impressed with this place and probably won't be back."}
{"text":"This ain't Benihana's.

Ginza east was once a wonderful destination but unfortunately the service has degraded to the point that the food and the tepanyaki show almost aren't worth the trip. 

On the weekends reservations are virtually worthless with 45 minute to one hour waits for seating. Weeknights are much better but even then we've notice wait staff rushing service to turn over tables faster. Courses are now served on top of each other where once you were encouraged to savor your meal and get to know others at your table. Plus this means your sushi plate, soup and salad bowls all pile up leaving you uncomfortably crowded trying to avoid encroaching on your neighbor's space.

The show is usually pretty good and, depending on the chef, sometimes excellent. Soran is one of our favorites but I'm not sure if he's still there. 

The food is usually just okay but this is excusable as we are there to enjoy the communal experience and have shrimp thrown at our heads. 

Oh, if you have kids the ice cream at the end of their meals is an afterthought. It's a solid block of tasteless confection tossed at them in a styrofoam cup. 

Watch your forced 18% gratuity for groups of five more. We're 20 percenters (usually) and have been over charged by not reading our bill.

We love tepanyaki and are willing to drive and pay the high price these restaurants demand. But I think we're going to go elsewhere from now on."}
{"text":"I went there because I read reviews talking about a happy hour with half price rolls. I was there when it opened yesterday, and was seated at the sushi bar immediately. I was given the \"happy hour menu\", and started looking at the prices... $4.75 for a California roll... $9 for their special rolls... I was like \"this is half price?\". I decided to stay, since it was cheaper than a normal night for sushi.

I wish I hadn't... not because of the food... but because of the treatment by the chefs. I ordered a total of 3 hand rolls, 1 special roll, and 2 other rolls. I was hungry, hadn't had lunch, and wanted to treat myself. I handed the first chef my menu. A second chef came in and began conversing with him in Spanish about work. Then the unthinkable happened... they started bad mouthing the fat white guy (me) sitting at the bar in front of them.

The 2nd chef asked the first: \"Todos?\" (All of it?), to which the other replied \"Si, todos\" (Yes, all of it.). Then the 2nd chef said \"No lo creo\" (I don't believe it).

So, being the polite guy that I am, I smiled at them and asked them (in English) to give me 1 or 2 rolls at a time. Instead, I get two platters of all of the sushi I ordered.

I said nothing - my waiter continued coming back to check on me. The check came, and I figured I should say something. So I wrote on the ticket: \"Por favor, pregunte a sus camareros para no hablar mal de sus clientes en espanol?\" (Please ask your chefs to not speak badly about your customers in Spanish?). I got up from the bar, and told them \"Gracias por la comida\", and walked away.

Not even 10 minutes after I left, I get a phone call from the owner/manager. I tell him I am driving, but he wants to keep talking. I apologize and say I will call him back when I get home. I get home, and call him back. He said his chefs never said that, but apologized. He offered me a free dinner if I come back. I might do that, since the food was good. But - you know how when you go to a restaurant and while the food is ok, if the service is great you still walk away and give it a favorable review? Well, this is the opposite. Food is ok, service sucked. -1 star for the chefs."}
{"text":"I recently went back on another trip to Madison. Here are some additional observations. Sadly it retains its 3 stars.

1) The every weeknight 5-7 Happy Hour Special is probably the only reason worth going.
2) The maki rolls are dissapointingly small. 

Again, try elsewhere."}
{"text":"Gimmicky non authentic Japanese restaurant. Definitely a fun place to be entertained but not to my first choice to eat. Food was ho-hum. The chefs throwing things around was OK. Not as exciting as they do hibachi in Vegas. Good place to bring the family and large groups.

Not sure of the price as it was on company expenses."}
{"text":"I am so disappointed! What has happen in the past couple of years? The sushi is always fantastic but the service is horrendous."}
{"text":"Ginza of ... well, Madison.  

I'm not going to add anything here that hasn't been said already from other reviews.  Went for the first time last night.  I had honestly never heard of this place before it was suggested to me, and I kind of know why now.  It's located in a little strip mall, which, I gave the benefit of the doubt since it's common here in Madison.  The interior is a bit dated, but they do have a lot of unique spaces for different types and sizes of parties, which I thought was a plus.  We had reserved a tea room for the two of us, and that was a first for me, which I highly recommend if you go here.  Unique, quaint.  Could probably accommodate 4 comfortably; 6 maybe.  There seemed to be a few teppinyaki tables that were going on around us outside of the tea room, which are always fun.  
We ordered edamame and a new dish to me, which was Goma-ae (spinach with a soy and semsame sauce).  Simple but very delicious.  We had 4 rolls and they were fine, but nothing special.  Definitely felt like they had way more rice than fish, which is never a good sign.  What we had was certainly adequate.  

Would I go here again?  Sure, since it's close.  But I'd rather go to Muramoto at HIlldale for a nicer experience, or Takara for better sushi.  The tea rooms are actually worth it if you're looking for a cool experience/date."}
{"text":"The food was good and the service was OK but it ends there.  THIS RESUTRANT IS FILTHY, IT STINKS AND I DON'T UNDERSTAND HOW IT CAN PASS A HEALTH INSPECTION.  When you walk in you smell rotting grease,  the hoods over the cook tops are literally dripping with grease and when you look in the cook area it is caked with dirt.  Totally disgusting.  The area behind the bar was filled with trash. I won't be back."}
{"text":"The cook did a very well job at making the food a show as he made it and still making food. I also thought there sushi was at par with the competition. There steak and shrimp were excellent and I would rather get from here then most other places. There scallops in my opinion were not amazing but okay. The service was good but when I wanted to get a sushi menu the host completely had forgot, but I asked another worker there I got helped quickly. One negative is that the restaurant defiantly needs a remodel it just does not look amazing or have a good layout it was a little cramped."}
{"text":"Used to go here for sushi all the time. Good food, decent prices. We stopped going because the wait staff was always very rude to us... we were good, frequent customers, so I don't know what was up. We go to Takara now... just down the street and they're awesome."}
{"text":"I was torn whether to give this place 2 or 3 stars, but thinking back on the food others at my table ate, I decided on 3.

My boyfriends family and I came here to celebrate his birthday on a Sunday night. He's recently become obsessed with stir fry and hibachi places so it was a must that we visit this place. We made a reservation and were seated right away when everyone from our party arrived. 

First of all, our waitress was terrible. She brought things out promptly and got all of our orders right, but she was not nice to us at all. Literally not one smile or kind remark. She also got very testy whenever someone asked her to repeat herself. Not cool. The hibachi cook on the other hand was great. He did all of his tricks and although messing up a few he was always in a good mood. He even teased my boyfriends niece a little bit which I think she thought was so funny. 

As for the food. The miso soup you get first is very good. Maybe a little salty, but I will forever crave that soup whenever I'm feeling sick because it was so brothy and yummy. Then you get a salad which I usually like. All of the vegetables were fresh, but the dressing was so watery. It was really weird. It tasted good, but the lettuce became kind of wilted because of the dressing. 

Now for the hibachi. I thought it was so weird that you have to upgrade to get fried rice. What?! I've never had to do that before at a hibachi restaurant, it usually comes for free. So that was weird. The rice was good, though I've had better. I like it when there is still a little snap to the rice from being fried on the super hot cooktop. I ordered chicken and scallops. The scallops were cooked well, however mine had not been cleaned and the tough part had not been removed so that was disappointing. The chicken was pretty tough, and the sauce/seasoning was very bland. The vegetables were pretty tasty, but again the sauce could use some work. Now, I would've given this place a 2 star review if it had not been for the steak that others at my table received. My boyfriend ordered steak and chicken and let me try some of his steak and it was so so so yummy! If you come here for hibachi, skip the chicken and go straight for the steak. Holy cow it was so good. Perfectly cooked and perfectly seasoned. YUM.

So overall, this place lucked out that their steak was so good. Minus the steak, I would've been forced to leave a measly 2 stars."}
{"text":"I had high hopes for this place but in the end, I did not have a great experience here. I went to collage a decade ago in Madison and Ginza was a thriving restaurant then. My memories of the hibachi here were very fond. Returning to Madison, I rarely get out to the west side, but I decided to make the trek out here to try it again.

Walking into the restaurant, the place looked relatively slow. My wife and I I were told it would be 15-20 minutes for a hibachi table. We went to the bar and decided to order some sushi as an appetizer. After 30 minutes, we had not received our sushi and we were still sitting at the bar. I can understand if it is a busy Saturday night. This was a Tuesday night with about 15 people total in the restaurant. The hostess was less than courteous to say the least. When we finally received our sushi, we were told our table was ready.

We sat down at the hibachi table with some other strangers since it was just my wife and I. The hibachi performance was not inspiring and the food was bland. The sushi was decent. I read in the other reviews that sodas did not include free refills, but I did not test this.

Ginza has lost its luster and I won't be returning."}
{"text":"Average dinner. Soup was hot. Sashimi plate was just OK. Selection is very limited and not as fresh as some other places. The bento box dinner is your usual stuff of tempura and teriyaki  chicekn, The teriyaki sauce is good, the rest is just OK. Over priced for the quality of the food. Tea was $2.50 and lukewarm so probably want to pass on that."}
{"text":"This place was a lot of fun, had good food and the staff was nice and friendly. The only issue I had was that we made reservations, but they wouldn't seat us until everyone showed.

My party and I were at the Hibachi tables, which I had never been to before. It was a little intimidating, but the wait staff made it pleasant. I had a steak and shrimp combo. The shrimp was amazing and the steak was pretty good too. 

It was served with rice and some vegetables. These were also pretty good. The soup that was served before the meal was a little heavy on the salt side and I didn't enjoy the salad. 

They have a decent selection of beers (some domestic, some international). 

Overall a great restaurant. I would definately go there again, even though it is a bit pricey."}
{"text":"I went here on a friday night when a sushi craving struck me while in Madison. We were seated immediately in a separate sushi room. We were the only ones there. It was a little bit awkward, just us and the sushi chefs. While seated, they called over a buddy from the bar and were joking and yelling in spanish for a while. Points go down for atmosphere...

Our waiter was either very fast or very slow with service. We ordered two appetizers and sushi at the same time. The sushi was done first, and we saw it sitting on top of the sushi bar for a full 10 to 15 minutes. It was five feet away from me, and I was tempted to just get up and fetch it, but the waiter came back eventually. He brought us one of the appetizers and the sushi. We never saw the other appetizer...like we never even ordered it. We were not charged for it, but I still wasn't thrilled.

Sushi quality was very mediocre. I didn't get ill afterwards, so that's good. We had some weiiiird looking cuts of fish on our rainbow roll. We didn't eat it but we did look at it askance before putting it on the side of the plate. The sushi is WAY overpriced for the quality. 

The close proximity to the bar was a little annoying, some guy was shouting about his ass the whole time. Decor was tacky...

It only gets two stars because I didn't get sick from the fish. I will not come here again though."}
{"text":"I'd like to start of this review by saying that Ginza of Tokyo is NOT the place to get sushi. The sushi tastes like crap, you know it, the staff knows it, don't order it here. You want sushi? Get the hell out of the midwest or go downtown to Takara. Ginza is predominately a hibachi restaurant that sells sushi to make money because unfortunately the sushi options are limited in Madison.

Now that I've proven I'm a grade A asshole, let's get to the review. 

The show is great. As far as I can tell the hibachi chefs know their stuff and you get to watch an onion volcano and shrimp tails be flicked into your empty water glass. The service is hit or miss as most Asian restaurants are. Yes, it's a bit pricey for the food but you aren't buying the food you're buying the experience here. Kogane shrimp is delicious for those of you who think eggs are the bees knees like I do. If I could figure out what exactly is in that egg custard they soak the shrimp in I would be ten pounds heavier. Hibachi steak is a nice choice as well.

Overall, Ginza is a good option for a large party on a night out. Birthdays and reunions are always a good reason to come here."}
{"text":"Not sure why this place has such bad reviews, it's fairly cheap with decent sushi and good hibachi. Service was fast and the staff was friendly, I'll probably come here again."}
{"text":"It was great service was quick friendly really enjoyed the garlic shrimp place was clean and left completely stuffed"}
{"text":"I went here for Sushi Happy hour. Did you catch all of that? \"Sushi\" \"Happy\" \"Hour\". That's reason enough to fly out to Wisconsin!

Picture this, regular rolls $1.90, and specialty rolls, I'm talking dragon roll, around $2.50.

Now to the bad. The service was slow, or rather, I had no idea who our waitress was.. because we seemed to have 3 and 0 at the same time. When ordering, we had 3, but when getting the check for 20 mins, she was gone.

It's true what they say, sushi is better by the coasts... and lakes just don't count. So the fish didn't taste as fresh as I'd like. Also, while I don't want to player hate, I prefer my sushi chefs to be Japanese...

Miso soup, mmm. As to the sushi, it was ok, with the dragon roll being the crowd favorite. Mango/tuna... not as tasty as it sounds."}
{"text":"I went here a while ago when i was little with my family. At that point it was probably the best restaurant experience i have ever had. We were sat down at a table with another group(which i didn't really care for, but wasn't a big deal) and watched our food get prepared in-front of us with awesome tricks and such. I had to eat everything, things i would normally look at question, but it was all so good. The only problem was, it costed my family over $90 for our dinner, which is alot, but was expected."}
{"text":"Horrible service, we ended up having to go look for our check. We also pretty much had to get our own napkins and chopsticks. Mediocre food. 

Edamame was cold and not even salted. Age tofu was soggy. We had to keep looking for the waitress to refill our water even though she had come by our table. Sushi was nothing to come back for. Food wasn't served at the same time, so some of us were done eating while others were waiting for the food."}
{"text":"Had a terrible experience here with a group of friends and the food definitely isn't nearly good enough to make up for it (decent at the best of times).

A number of us went to Ginza hoping to get the sushi happy hour. The staff asked if we wanted to be seated in a tea room and we said why not. We didn't find out until we got our bill  that that meant we didn't get half price sushi anymore. We talked to the hostess and then the manager and not only did no one offer anyone any kind of refund, they wouldn't even give an apology or admit any degree of fault in the situation. By the end of the ordeal, all we wanted was someone to say 'Sorry, we should have been more up front about not getting the discount in the tea room' or even (for maximum responsibility-dodging) 'Thanks for the suggestion, in the future we'll mention that  the tea room doesn't qualify for the discount.'"}
{"text":"This place is a mess.  I brought my gf's mom here for her birthday, and I was embarrassed at the state of the place.

Thick layer of grease on every table surface.  

Smells like burning dust particles.

The place was completely and utterly understaffed.

I literally can not imagine ever getting hibachi anywhere again after this experience."}
{"text":"Wish I could rate this restaurant half a star. Called before to make a reservation and asked ahead if they have gluten free soy sauce. They said yes. After ordering and assuring us that the hibachi style chicken is gluten free, they told us they didn't have the gluten free sauce. So they gave us two orders of plain white rice.... And still charged us. They also gave my friend shrimp when he ordered steak and chicken. Bye Felicia."}
{"text":"I'm really disappointed with how Ginza is now.

For one, we made reservations for 4 people at 7pm. When we arrived at 6:45pm there was a party of 35 taking up the hibachi grills and they were just finishing cooking. 20m later, we finally got seated. She tried to squeeze 4 adults onto a bench where there was room for 3. And, seriously, there was barely room for 3

There were 9 at our table and it should have sat 7-8 comfortably. 

We had to ask for refills on our hot green tea, which was $2.50! There are NO refills on soda, as two people in my party found out on their bill. Soda, which came in pint glasses, were $2.75 each! To me, that is outrageous.

The chef was either new or awful. I'll give him the benefit of the doubt and go with new. He couldn't do many tricks, except light an onion stack on fire. I really wanted to like him and not be afraid when he was jokingly putting the grill tools 2 inches from my face, however, he kept dropping them on his grill and I was actually a little scared.

The food was okay, and we ordered tempura ice cream. The ice cream took about 10m to order and 15m to receive. It was nicely plated, and fed two people.
The other downside, they were out of many things on the menu...

The server was nice enough, but probably overworked. I've been coming here for more than 15 years and while it has become a tradition, really, Ginza has gone down hill drastically and has turned into kind of a dump. I'm sorry to say it, but save your money."}
{"text":"It was fine for the area when you're in town for work and need a place close to the hotel/mall. However, I would not recommend."}
{"text":"This was the worst sushi place I have ever eaten at.  I will say that they did have a separate hibachi dining area so I can't comment on that part...although I wouldn't expect much after our experience.  The decor is very tired and not that clean.   The staff was pleasant although certainly not Japanese.   We sat at the sushi bar and continued to have waitresses and waiters grab their sushi orders from over our heads between us even though there was an open station side for this purpose...they just don't get it. Sushi was not fresh, tempura was cold, and miso soup was salty.  We went to a mall after and went through the food court- we would have rather eaten at any of these places over Ginza.  Sorry for the rant, but it was that bad!  Whoever rated this place high is either a worker, owner, or not very experienced in dining at 3,4, or 5 star restaurants."}
{"text":"Horrible to go service every time. A few months ago we picked up a hibatchi dinner and some sushi to go and it was fantastic. Every time we've been back since, which is about 4 times, it's been terrible. They never remember to bring everything that comes with the meal, like I'm paying $15.95 for just stir fry. They forget the soup, salad and rice, and then act like I'm bugging them when I ask for it. And forget the shrimp that the menu clearly states comes with all hibatchi dinners. I've never been denied the shrimp, but tonight I was. If the hibatchi, or any items, are different for to go orders it should state that on the menu. Tonight they refused the shrimp with my order, after I reminded them about the soup, salad and rice. Come on, the rice? Really? Honestly I think the hostess was too bothered to really ask if I could get the shrimp that it is supposed to come with. I'm understanding when it comes to food service. I did it for 10 years, and my husband has made a career in the business. But if you think about the long term value of repeat customers, and know that good service ensures a better return for the business, you think they'd train their staff to be a little more willing to make the experience great, even for patrons who order food to go. My order was not cheap, and I left a tip. Considering its been steadily getting worse over the past several times we've been I'm pretty sure we've decided not to go back. I shouldn't have to remind people that work there what actually is included with items ordered off of the menu. Amateur night, seriously."}
{"text":"When looking at Ginza you need to seperate it into two different aspects:  the hibachi and the sushi.

The hibachi grill is awesome if you have a group of people.  You get a private room around a table and your own chef comes out and prepares all your food.  This chef does all sorts of crazy and entertaining tricks and cracks jokes when preparing the food.  Last time I was here I had the hibachi steak which was delicious and their fried rice is great.

The sushi here is great, one of the top two or three sushi places in Madison.  But why I go here for sushi is do to one thing, \"Sushi Happy Hour.\"  Between 5-6pm Monday thru Friday all of their sushi is heavily discounted, so that you can get a good meal for pretty cheap.  Every roll I've had here has been quality."}
{"text":"We have had mixed experiences here.

On the plus side.  We took a chance stopped in on a Saturday without a reservation.  When it's just the two of us we ask for a tea room.  There was going to be a wait but we could get seated immediately at the hibachi with other couples/families.  We were unsure about this but went with it because we didn't want to wait.  We had a great time!  We enjoyed everyone at the table including the kids.  Chef was entertaining, enjoyed the food.

Given our great experience, a month or later we tried to repeat this.  This time we did get our tea room.  After choosing what we wanted, we waited and waited.  Finally I popped my head out and got someone's attention.  We got our order placed and then a short time later another waitstaff person shows up ready to take our order.  Obviously wires got crossed.  My sushi shows up first.  It's placed in front of me with a smile and then we are asked \"can we get your anything else\" and I replied \"Yes, the rest of our food\".  Hopefully I did't come across as too crass, we were just frustrated with the service.  She left with a smile and shortly the rest of our food arrived.

Most often we go with family so we are there as part of a bigger group at a hibachi grill. I believe that is the best way to experience Ginza.  On a recent group visit I went back to ordering salmon and I had forgotten how good that is.  Very flavorful and not dried out.  The whole meal was large enough that it provided me two days of lunch leftovers.

Finally, like other \"fancier\" restaurants, Ginza has the policy of not seating your group unless everyone there despite having a reservation for a specific time.  This is so strongly enforced that when we were the 2nd of our party arriving, the other party chose to wait in their car for us because there was no point in going in when you're just going to be told to wait anyway.  Other times we have joked that when there are kids in our group we'll make the run in circles so the host or hostess doesn't realize our entire group isn't there yet!"}
{"text":"You can have three separate experiences at Ginza:

* Hibachi- Totally yummy here. Definitely a fun experience if you've never done it. Great steak and shrimp(I just get the regular hibachi flavor, but I hear the teriyaki is good)and awesome fried rice. It's fun to go with a larger group(so you don't get stuck with a bunch of high-schoolers going to prom--an experience I've had TWICE), but a relatively good dining experience either way.

* Sushi Bar- A small alcove with a sushi bar is set up apart from the hibachi \"rooms'. Much more mellow, not to mention less noisy. I'm not \"wowed\" by Ginza's sushi, but it's good.

* Tea Room- This is a private screened in dining area. Complete with padded mats and barefoot requirements. I think this would be nice for a romantic date, or maybe four people. We had a party here for work once, and there were just too many people to serve in a timely fashion this way. Half of us got our food, and then the other half quite a while later. Still, nice for smaller groups.

Ginza has been my birthday tradition for the past few years. I think it's just fun to get a different experience than your typical \"order from a waiter, sit at a booth\" night out."}
{"text":"This place used to be pretty good. Not sure what happened. Save up and go to Muramoto or Red instead. You'll be happy you did. Even their eel, my favorite, is crappy now. Eel is so basic it's pretty hard to meas up. If you're looking for cheap sushi then get it from Woodman's in the seafood section."}
{"text":"This place is tired.  It smells bad and I'm guessing it would be filthy if they turned up the lights enough to see.  The steak hibachi was very tough and a few bucks more expensive than Takara.

I brought my 5 year-old for a late dinner so we were seated alone and our cook totally 'phoned it in' - didn't put on a very good show for her.  That's not ok."}
{"text":"This is your classic American Japanese hibachi cuisine. Everything I have tried here from cocktails to sushi to hibachi has been pretty good! You also get to sit in those little rooms without your shoes which is always an experience plus."}
{"text":"Very very mediocre sushi in tiny portins with slow service.  This only gets two stars because of the happy hour special.  Head elsewhere for sushi.  Takumi is better and Muramoto is much muich better."}
{"text":"We made reservation. It's Sunday night - so on the phone they says: \"no needs\" but anyhow - they took my reservation. And my phone number. 
We arrives on time - to discover that also the Resturant is almost empty - they are 30 or more min behind \"because we have only 2 chefs\"....

When I asked \"why didn't you call me to let me know you are late\" the answer was......Yaa - who cares?
Bottom line: ride and very bad service before we even start.if course we did NOT stay"}
{"text":"I enjoy taking my girlfriend and her daughter to this place at least once a month for hibachi. The chef's put on a great show for kids and the hibachi is excellent. Every meal comes with Soup, Salad, and Desert. So you Will be very full when you leave. The Steak and Shrimp are my two favorites. My only complaint is that the place is very dirty. The Bathrooms are right by the kitchen and both could use a good cleaning."}
{"text":"Awful place. Don't go rip off hot. Waiter tried to ad double tip. Really horrible place. Can't believe it. N"}
{"text":"The waiter service is sooooo slow. I was sitting in one of the tea houses for about 20 minutes waiting for my check. I had to go looking around the restaurant for my waiter. I found him flirting with the cute bartender. The sushi isn't bad, but not great. Go to Takumi right across the street where it's fresher and cheaper.

Hibachi is another story. The food was great, the chef was fun, but again the waiter was horrible. The entire table had empty drinks and our waiter was nowhere to be found."}
{"text":"Just ate here... Could be better. We ordered and got appetizers right away, but then the sushi took over 40 minutes. When we got the food, it was less than to be desired. There are much better places for Japanese food in Madison, and some even closer to where I live (near Lacrosse)"}
{"text":"I'm so disappointed that they closed.   They were the only hibachi place in the Madison area that I liked.   Are you reopening anywhere?  Where did Joe go?"}
{"text":"I would give Ginza 0 stars if I could!  This was truly the worst dining experience I have ever had.   

My husband took me to Ginza for my birthday.  Upon entering, the restaurant stunk, like dirty wet dog.  They sat us in one of the little private rooms, where you have to take your shoes off and climb in to this Japanese style table.  I could literally feel dirt, dropped food etc on the floor.  The paint and wallpaper were peeling off.  It was shocking how run down it was.  Our waiter took about 15 minutes to finally appear.  He was sweating and obviously frantic.  He took our drink orders and took another 15 minutes to return.  We placed our orders, and waited.  While we waited, 2 servers attempted to bring us food that was not ours.  Everyone seemed to be confused and rushed.  My husbands food arrived.... And we waited some more.  He ordered the hibachi.  I ordered sushi.  My food was MIA.  My husband was completely finished by the time my food arrived.  The sushi was not fresh.  Some of it I couldn't even eat.  We decided to skip dessert and just get out of there.  When the server finally brought our bill, it was hand written and very confusing.  i asked the server to explain all the charges.  I pointed out that we were charged for my husbands salad, which was included on the meal. The server went and changed it.  I asked what the charge was at the bottom, and he said it was our drinks.  But they were included above.  I finally asked to see the manager, and he explained that extra charge was an 18% gratuity already included because we were sitting in the little private room.  What?  Are you serious?  We complained about the service and food, and the botched bill, and the manager gave us the meal for free.  While I appreciated the effort to make it better, We will never return.  Don't ever go there!  That place should be shut down!"}
{"text":"The one star is being generous considering zero stars is not an option. The food was decent, the service was by to far the worst I have ever experienced. We had a girl server named Sam who paid us zero attention aside from dropping our food off, she neglected to refill our empty drinks and 17 min after we finished eating she decided to bring our bill...taking yet another 10 min to run our cards and proceeded to add gratuity to our four person table. Needless to say I will NOT be returning to the East side location. This is coming from someone who has been in the food industry for 3 years and I never complain, I suppose there is a first for everything!"}
{"text":"How can you go wrong in a place where you get your shoes taken off before you enter a lovely tea room that's private and JUST for you and your partner/husband/party.... 

Then you get brought this EXTENSIVE sushi list, everything sounding (and subsequently being) more delicious than the next, from the rolls to the entrees.

As a vegetarian, my knowledge of sushi is limited, but they've got THE BEST tempura ever.  ANd their spinach soy tofu dish is PERFECT, especially given the simplicity of the dish.  It's got the perfect balance of good salty gingery flavour, and the texture is just incredible.

For those who like the whole hibachi experience, while I've not seen Ginza's in particular (I've been to others on the coast) I can see them flipping their scallops while entering, and it seems like everyone is having a good time.

It's really fun to be in a personal tea room, IMO, so private, so calm..  such a scrumptious experience..."}
{"text":"Ginza is a delicious Madison treat.  If you can stomach the price and want a fun dinner outing, there's few other places I could recommend as highly.

The first time I went to Ginza was several years ago, and back then I found it to be fairly mediocre.  The service was OK, the presentation and show was mild, and the taste of the food was generally good.  But I became a regular patron about a year ago, and in the last several months they have seriously stepped their game up.  I've been to Benihana's and Ron of Japan as well, but these places now pale in comparison to the level of goodness you get at Ginza.  

First off, you have your choice of the cozy sushi rooms or the habachi live-action tables.  The sushi rooms are nice and peaceful, sequestered off so you and your shoeless companions can have a relaxing conversation while you gorge on tasty eats.  Service is polite, well spoken, and fairly prompt (depending on the day).  Secondly, you have the Habachi tables (my favorite), where you and another party are seated together to watch your food cooked in an exciting manner in front of you.  The majority of the chefs, especially in recent times, will put forth a big fire, do some fancy knife tricks, and provide a little dinner humor along with it.  

But the real present that you get is the food.  They have scrumptious mushroom soup, mouth-watering fried rice, and main entrees that are so amazing they taste like candy.  The Filet Mingon is supreme, the Lobster is succulent, and the shrimp is magnificent.  Ok, I ran out of adjectives but you get the point.  The vegetables are darn good too.

Don't listen to these other rants, and put up with any little issues because in the end it's completely worth it.  I've been probably some 2 dozen times and will continue to go as long as they make it this good."}
{"text":"Took family to celebrate daughters birthday.  Went especially to lobster.  We thought they were kidding when the said they were out of lobster.  This was Saturday night and we were the first customers.  

Also it was a hot summer night and air conditioning barely working.  Humidity inside is terrible"}
