{"text":"Awesome pizza gotta get a large all meat pizza including chicken, it's another one of those 5-6 lbs pizza. Definitely filling"}
{"text":"This place is amazing, I love their pizza! I grew up in lorain and have been eating it for over 22 years and while my mom was pregnant (\" I get their lrg pep saus and ham all the time (mouth watering)"}
{"text":"drove all the way from north olmsted to pick up a deluxe large burnt black all around the the edge sbout one inch"}
{"text":"I ordered a pie with sausage and pepperoni. Did not disappoint! The crust was really good and even though we did not eat it all at the first sitting; none of it went to waste because the leftovers were just as good!  The only drawback is that there is no seating. Server was polite and pleasant; I will be going back!"}
{"text":"This is a small shop and is take out only. Be sure to drive with a partner because it's not on the best side of town. This pizza is super cheesy in a good way of course!  A large pie will run you $13 and the toppings are plentiful!"}
{"text":"Having never been here, we went off the Yelp rating. The place is not much to look at and it's only takeout. We ordered a lg plain pie and asked what was on the deluxe. The lady said a lot of what one would expect to hear and then hit me with the Banana Peepers!! When we got to the car we figured we would take a peek, then a bite...... The deluxe never made it out of the parking lot. Lol. Would recommend."}
{"text":"Hands down, the best pizza ever.  We have been ordering this pizza for 30+ years.    If you love thick crust and lots of cheese this is your place.  The pizza normally has a ton of cheese, so if you order extra cheese it may be too much.    We have family from out of state and every time they visit Giovanni's is a must.    You won't be disappointed."}
{"text":"Every time I come into town I make sure I stop at Giovanni's. A true Lorain favorite. Might be the cheese all mozzarella, the sauce is not sweet nor bitter. Just a hometown favorite."}
{"text":"It depends on what you like in your pizza.  If you like cheese, you'll love Giovanni's!  2 sizes, 11\" and 13\"  The toppings were fresh and tasty... cheese was overwhelming... the sauce was mild but \"fit\" the pizza... my only draw back was the crust, which didn't hit the spot.  It's my fiancé's favorite pizza in Lorain... I'm still \"to be determined\"!"}
{"text":"Pizza is very pricey but very good took off a s star because they accept cash only no credit cards or checks and cashier lady wasn't very friendly"}
{"text":"Best pizza in the whole World. No joke. Try it. Really...I have had hundreds of pizza."}
{"text":"My ex father-in-law worked at the steel mill and would stop here on his way home from the afternoon shift at 11pm. This was 25+ years ago at least. I remember eating it with him and it was pretty good   Tonight I ordered from Giovannis for my first time personally and it has been 25 years since I've eaten their pizza. What happened?  First off, I'm not a pizza cheese lover....especially in excess. If that's what you are looking for, then by all means buy from Giovanni's. I ordered a small mushroom and sausage pizza. The cheese was a tasteless glob in the middle, followed by equally tasteless toppings. The sauce was unnoticeable and the crust was just not good. They told me 30 mins. I picked it up in 25 and it was just barely warm at best. Maybe if I got there when it was actually done it would have tasted better.  If this is the pizza I read all the raves about here, I won't be back."}
{"text":"Not the best lately, I've had it a few times giving it a chance in the new building.... less cheese less sauce and less flavor....I'll try again because it was one of my favorites. Sadly I'm not sure anymore....."}
{"text":"First time here, and could tell by the sign this was gonna be good!  I wasn't disappointed.  I saw the review about the cheese being \"overwhelming\" so what did I do?  Ordered extra cheese!  The cheese was delicious and ridiculous!  But in a good way!  It was almost like two meals in one.  Separate a piece of pizza, pick at the cheese web created, then go in on the slice.  It was really tasty!  Obviously a real cheese and not some oily processed impostor!  The sauce was good and the toppings were fresh and flavorful.  Whenever I'm in the area, I know where I'll be going for a killer pie!"}
{"text":"Thank you, Shelly & Chai... Y'all know how to throw down a Giovanni's pizza!  Love toppings to the edge, like most pizza fans, just like y'all make it!  #CustomerSince1960!! #SatisfiedCustomer"}
{"text":"Ordered the Deluxe and substituted Mushrooms with Banana Peppers.   I will keep this short and to the point... BEST.PIZZA.AROUND  Only Mr.G's pizzeria in Akron beats it IMO."}
{"text":"Some would say better than Yala's Pizza. Great pizza with hefty loads of cheese, toppings are underneath the cheese. Well priced - $12/or so for large one topping. THEY ONLY ACCEPT CASH"}
{"text":"My favorite pizza place on the planet. Of course I'm biased because I grew up down the street, but it fits all my categories for good pizza. The crust is firm, you're not getting mushy, fall apart pizza. They don't skimp on the cheese. The mass of mozzarella forms a protective cheese helmet for your toppings. And that area where the cheese, grease, and crust all meet, and get a little crispy, is pure heaven. The sauce is nice without being overbearing. But MOST importantly, not only does it taste great cold, but it reheats nicely in the oven OR microwave. Something that can't be said for a lot of pizzas. Give the ladies a wink and a smile. Once you become a regular, you're family."}
{"text":"Great pizza when fresh,  not so much when breading it up.  Uber cheese and toppings. Best in South lorain."}
{"text":"We were just in town for a college visit and we found out about Giovanni's and saw how good looking the food was in some photos. It's a cash and take out only place that doesn't offer many thrills, but it has amazing pizza. Thick, gooey cheese blankets over a good heap of toppings. Each slice is also very filling. Absolutely recommend"}
{"text":"I know everyone claims that their hometown has the best pizza, but hands down Lorain, Ohio has the best pizza. It's a small take out only pizzeria. The service is great and friendly. They accommodate to your every request as to how you like your pizza done. The prices are just as satisfying as the pizza. Five stars without a doubt."}
{"text":"I've always judged this place from the outside but finally threw the book cover out and gave it a try and I'm glad I did. Giovanni's has been writing chapters since 1956 and I don't expect them to write their last page anytime soon. I've always heard people talk about it around the Lorain county area and now I finally tried it and here's my review.   I ordered a pizza with pepperoni, sausage, mushrooms and jalapeños. All of the toppings were very good and tasted like premium ingredients. I especially loved the cheese. It was thick and stretchy and unlike a lot of places you really don't need to order extra cheese because they're not as stingy. I loved the construction of the pizza. They put a foundation of sauce, followed by pepperoni, sausage and mushrooms and then the cheese over top. I love this because it keeps all of your ingredients in tact melted under a heaven of cheese. The jalapeños were then placed on top. I loved the sauce and the ingredients and they way I was greeted and treated throughout my transaction. The only reason for my 1 star deduction is for the crust. A pizza's crust is where a lot of people have different preferences. I like either a really crispy crust or really doughy depending on my mood. Giovanni's crust was more of an in between with a chewy consistency. It's definitely not a deal breaker for me though because the rest impressed. I will definitely be back."}
