{"text":"Great menu, music atmosphere and food.  I had Penne Vodka.  Excellent.  Well priced, upbeat staff.  Eat here!  Penne, pizza, Veal and salads."}
{"text":"Best pizza in town. Made fresh with top quality ingredients. Almost as good as homemade."}
{"text":"Oh, what has become of you, Giuseppe's? We have eaten at Giuseppe's many times while living in Mission. Then they did away with brunch which seemed to be an initial decline. Fortunately, they still offered very nice traditional Italian dinners.  Last night we thought we'd go to Giuseppe's because we hadn't been there in quite awhile since moving away from the area. It has the appearance of new ownership or perhaps a lost chef. The 'Dinner' menu was a sad lunch menu. There was hardly anything on the menu, in fact, and the wine list included about 10 mediocre wine options (mostly by the bottle). We almost left before ordering but thought we'd give it a chance. The pasta was overcooked and extremely bland. They didn't serve us any bread though other tables appeared to have bread. The server, while very pleasant, was about 17 and seemed incredibly uncomfortable in his role. I hope this was just an unusual night and this isn't what has actually become of Giuseppe's as it is, quite literally, a pathetic shadow of its former self."}
{"text":"to say that the service was bad, is to assume there actually was service: from stopping in to place an order to then take home, after dropping off work at home, returned to pay for order, and did, and only minutes after that was told that the order wasn't even placed yet as--with a whole two tables worth of customers--they forgot.  and better still, after having to wait for the order to then be made (because I already, sadly, paid), the pizza almost measured up to this level of \"service\", in that, it was as disappointing as the whole experience !"}
{"text":"Walked in thinking it was a grocery store with a cafeteria style food service....discovered that it was a full service restaurant and the food was awesome. Would definately go back."}
{"text":"I work next to them and always get pizza, pasta dishes or paninis... last week I tried their breakfast sandwiches and they are yummy too.  Service and staff is good.  Had a meeting there and it's a good place to meet too or just hang out for coffee."}
{"text":"Very nice ambiance.  Food and service was great although I suspect they may struggle a bit during peak hours.  Had the vegetable risotto, which was good.  Will definitely be back."}
{"text":"I've been to Giuseppe's Market a couple of times and it gets better every time I go.  To be fair, it was pretty awful the first time, so it still has a while to go.  I'm not much of a cook, so I won't speak to the market side of this restaurant-hybrid.  But their selection of meats, cheeses and sauces does seem impressive.  The reason I keep coming back here are their $10 oven-baked pizzas.  I get a different one each and every time and they are always great.  What isn't consistent is the amount of time it takes to get them. Sometimes they are really fast and I'm eating a fresh, hot pizza before I even know it.  Other times, it feels like they've gone to Italy to get the ingredients themselves.    Giuseppe's Market is also a really popular place to order take-out, so keep an eye on your order because if someone who is picking up their order gets there early, they'll bump yours if you are eating in the restaurant.  Hence the problem with having an exposed kitchen, I guess.  So far this place is a great addition to the new 1st and in time, it will become a must visit for any Italian fans."}
{"text":"I love that I,  son of German immigrants, am sitting in a restaurant in Calgary eating a delicious oven baked , thin crust pizza, browsing a sushi recipe book written in Italian."}
{"text":"Introducing Giuseppe's! Think Sunterra Market meets Debaji's. Do you remember Debaji's in Northland mall, back in the day? I hope so.  So you walk in, and to your left are a few tables where you can enjoy the goods you purchased, and then throughout the store there is produce and Italian goods to buy. In the middle of the store there stands a pizza counter where you can sit up at the bar and eat fresh pizza from their wood oven. You can also sit up at the bar and have an espresso or cappucino,  or you can head upstairs to their restaurant and order a la menu.  I LOVE the vibe here.  It makes you feel like you've stepped off of the street, and into a little square someone in Italy.  I will most def. be back in the VERY near future!"}
{"text":"I live in the Beltline area and having Giuseppe's in my neighbourhood is a treat! The espresso is great and they make fab cappuccino's. The pizza is made to order with quality ingredients. You can pick up fresh pasta or great Italian ingredients. Often, I find the olive oil and fresh produce to be better value than nearby Sunterra.  I like that I can go there for a quick bite, or sit with my laptop and sip a cappuccino, or have a dinner date or just enjoy desert. Friendly, warm staff and easy-going atmosphere. Needless to say, the food and the people keep me coming back. Try it! And have the Tiramisu!"}
{"text":"Oh Giuseppe what happened to you? I've been here numerous times, but lately the place is just not what it used to be. There is no longer any deli items, no fresh Italian take out, no fresh produce, no cookbooks and very little canned items or kitchen things.   We ordered two pizzas (margarita and 4-cheese) both were really not good: dry and tasteless with very little topping. The service was so dismal. The poor guy who makes pizza was working both the pizza oven, while running back to serve at the hot food counter, as two other gals stood around and did very little. It was hard not to laugh when another customer, so tired of waiting, went behind the service area and got his own coffee. Considering there were only about 10 customers total in the entire restaurant during the heat of lunch hour, this was pretty pathetic.  This place seems to have turned into a former shell of itself. I hope they can turn it around because it was quite a nice lunch spot and the food used to be very well done. I'll chaulk it up to an 'off' day but we'll see...."}
{"text":"The pizzas are absolutely AMAZING!"}
{"text":"I really wanted this to be a 4+ star review...  I even waited till my third time there to write something as most of my first annoyances could have been attributed to just opening.  Giuseppe's is well laid out and sells a wide variety of anything remotely Italian.  It seems their bread and butter is the lunch, meal crowd.  I tried a couple of their pizza's and though it takes awhile for a business lunch, they were pretty good - though weak on the cheese (that may be my preference though :) )   Today though I went for a Panni for the second time and as with the first, it was horribly bungled....  I understand that a picky customer with lots of changes to a set menu is a pain in the butt - that being said, if you have Panni your way on the menu be prepared for it.  I waited 10 minutes for someone to acknoledge me at the counter - there was only one person in frount of me and two or three of my co-workers behind me....  for 10 minutes we watched complete unorganized chaos...  Suddenly someone wants to know what I want - I explain that I want the panni my way with just mortadella, tomato, bocachini, italian dressing and vegit spread.  Explaining this took a long time (may I suggest paper requests...)  I get back to work and find I have the following - a panni with 1 slice of mortadella, no tomatoes, two chunks of bocachini, no dressing, vegi spread on basically 1/3 of the bun and multiple pieces of cappicola and salami...  WTF - no one else was around when I ordered, how did this get screwed up...  Anyways - they have a long way to go before I try them again - I will continue my lunch Italian runs by driving up to Peppino's in Kensington - they haven't let me down yet..."}
{"text":"The food at Giuseppe's had always been good. In 2011, you would even put up with their terrible non-existent service to eat their pizzas.  Lately though I read that service had improved. And after checking them out again, it really has improved! Giuseppe's now has tasty food in concert with great service.   I look forward to going back soon."}
{"text":"So I had never heard of this establishment until I had a staff lunch in.  It's silly because I work 1 block away...and yet the front entrance never jump out at me.  Sandwiched between Irish pubs Giuseppe's Market is cleverly hidden. The relatively new Deli/Market/Restaurant stands out as friendly authentic family run establishment  at first glance, but getting a table by walking in off the street is a whole other story.  The staff a minority of Italians with thick accents, but bad attitudes and lacking  organization or good interpersonal communication skills. Showed very little enthusiasm.  I toke my mother for dinner on Friday night around 6pm, and expected a line up or a waiting time.... but was shocked to find out that the manager booked only 1 server and 1 Hostess for the night (both staff on edge and visibly overwhelmed).  The waiting period was 1 hour or more. The 60 table seating arrangement was minimized to 15 people at a time, baring empty seats that could have been filled. My mother was livid (with an empty stomach you become a walking whining toddler). We ended up skipping dinner.  My 1 time experience of eating the food was a few days later with my co-workers who of coarse ordered plenty of liquor and shared more than we needed to know. I ordered a Caesar Salad (dressing was home-made with anchovies) I give it 5/10 because there was not enough dressing, and I requested no Croutons (they gave them to me anyway), My main coarse was penne Arrabiatta (with gluten-free pasta). My dish was served before everyone else making it awkward to enjoy the meal while everyone eyed the food.... with empty stomachs. Again the Organization between kitchen and servers was OFF. I give it 8.5/10 because it was perfectly spiced but Pasta too al den ta. The Service was 4.5/10, I would come back to pick-up but NEVER dine in."}
{"text":"I love the pizza at this place. This crust, fired in the oven with nice light toppings, the way a pizza should be.... and the cheese cake, well, who doesn't love a good cheese cake and theirs was very good. I'll certainly pop in for pizza again when I'm back in Calgary."}
{"text":"went here sine it was so close to the hotel and because my sprained ankle was acting up and i wasnt very mobile. ordered from the market for lunch and got a pasta with italian sausage and a classico sandwich. i'm not sure if it was because we went for a late lunch, but the pasta was hardened from sitting out. the sausage was alright but nothing spectacular. also i thought the sandwich was too bready and did not have enough meat in it. probably wouldnt come back again."}
{"text":"Wondered in here on a cold saturday evening when it wasn't very busy and ended up with a very intimate group of people and a live musican enjoying a very fresh and flavorful italian meal.    As you wait for you meal you are served bread with oil and balsamic - and that bread is delicious (not something I would often say about bread).   I have done oil and balsamic tastings in Italy and I can also say they use quality product and you can taste the difference.  We ordered the bruchetta and the herbs in there taste like they were freshly plucked from the garden - I'm sure it's made to order (or they have done an amazing job hiding that it's ready made).    I ordered the vegetarian calzone and my fiance ordered chicken with mushrooms and olives.  My calzone was alright,  I think the flavors fell a bit flat (it can be hard to jazz up a veggie pizza) but I did love the crust.  I don't think I'll be ordering the calzone again but I will try another pizza for sure.    My fiance's chicken apparently was good.   I stole bites of the wonderful looking side veggies and they are the kind you find in the summer from the farmers market or grow in your own garden.  The carrots have the right level of crunch and sweetness and the young potatoes were soft and smooth. If I wasn't stuffed and already taking home a doggie bag I might have ordered a side of those yummy veggies (I can't say that often either).   Overall the quality and freshness of the ingredience stand out here.  It's not overly fancy,  the prices are decent, live music was very nice, service was good (but it should be when it's fairly dead) but the food quality is very high.   What would bring me back is the quality of food going into the meal.  I'm not positive it would lure me across the city (which is the case) because there isn't anything overly novel but it would rank high on my list for a return visit when I'm in a reasonable proximity."}
{"text":"4 STARS FOR THE FOOD. 4 FOR THE SERVICE. 3.5 FOR THE SEATING AND AMBIANCE. The food is delicious. The service is attentive. The space is interesting, casual and seems to go on forever. The seating was good. I prefer something more comfortable. Overall, they work hard to earn your business. I would return. On the expen$ive side.Or is this the norm for Calgary?  Dinner for two with tip...at least $50. With drinks....$65 and up."}
{"text":"This is one of those restaurants/cafe that you may pass it for 100 times and never notice it. Actually, I also found it totally by accident. I saw the Italian market sign and me being a cured meat fan decided to check it out. However, as soon as I stepped in I was totally surprised. This is a Market/very relax self service restaurant. Specificity the big wood burning pizza oven attracted my attention.   After browsing the array of pastas and sandwiches, they told us that it is the 10$ pizza day (Mondays) so immediately we decided to give it a try.   This is how this restaurant works:   1- You order your pizza at the counter  2- Pick up cutlery and drinks  3- Find a table and wait for the pizza to arrive   We ordered the Capricciosa. It is assembled and cooked to order with a very thin crust. The pizza arrived in less than 10 minutes. Cooked to perfection with a crispy crust. Overall great taste and texture.   I will definitely come back here to try other items on the menu. But to be honest, I am not very optimist about the pre cooked pasta in the display. They looked overcooked. However, the pizza was fantastic specially for 10$ it is a great deal on Mondays. I highly recommend this place if you are looking for a relax and quick food. 100 time better than any fast food joint and almost the same price."}
{"text":"Very satisfying Lunch.  Thin crust oven fresh Pizza makes for light lunch with room for a light dessert.  This is a quick hit for lunch but not a sit down real Italian restaurant.  Looking forward to going back and giving some of their cold sandwiches a try."}
{"text":"Giuseppe's has a lot of potential but they haven't come close to realizing it yet.  The food is inconsistent, as is the staff. I've often had people serve me who either 1) don't know enough about Italian food and cuisine to know what I'm ordering or 2) don't have enough of an English vocabulary to know what I want to order.  I've often ended up with the wrong food and I even ended up with the wrong *coffee* once. And the coffee mishap happened when I was one of 5 people in the place.  They also do the odd jazz show but it's nothing to write home about, there isn't a proper stage or PA system so the gigs are often no more than a couple of people versus a full band.  On top of all this, Guiseppe's used to have a great website and now they've changed it over and it looks *terrible*, like it was done in 1998 on Geocities.  If they've changed over the website to cut costs I shudder to think what else has been cut from the budget ..."}
{"text":"I was intimidated to enter this place, simply because I thought it was a very expensive market and way over my price range but once entering I was delighted to see an amazing assortment of wonderful things to eat that is so affordable.  Staff greeted me as soon as I sauntered in the doors and I was immediately impressed by the layout of GM.  You have a choice of tables in the foyer of the Market and then on the second floor, you simply have to go to each station and pick out what you want and then have a seat.    The most appealing area was the dessert area, fresh Italian desserts sitting pretty behind glass. Tiramisus, mousses and cheesecakes; huge portions for less than $5.  Then you have an option of pizza, made in traditional pizza ovens, everything is fresh with that authentic slim Italian crust.  The meat and cheese deli offers to slice up a huge diversity of options and then there is the deli bar, where soups can be bought for 4.99, salads at 5.99 and your choice of hot or cold Panini's at 6 and 7.99.  Other refrigerated options of homemade Italian pastas, salsas and my favourite Italian ice cream.  Hey this is better than being in Little Italy!    Reminded me so much of the deli at Mercato on 4th Street but of course with more affordable price tags."}
{"text":"A genuine Italian experience, not too expensive.  The environment is quite welcoming, it's a big place, with different sections, when we entered a few ladies were participating in some kind of cooking class in one corner, some people sitting down and having coffee, wine and working on their laptops in another corner... and we ordered two fantastic thin crust Italian pizzas with Chianti wine and sat down in another corner. Try their weekdays express lunch menus as well :-)"}
{"text":"I find it funny when a business puts their establishment date on their signage, funny in a cute way. And Giuseppe's was established in 2009,  making it even cuter when you look at their branding. Every once in a while I want to get a tattoo - Alix, Established 1984.   All that aside, what a cute, tasty place! That whole 1st Street area has improved drastically in the last few years, although who among us would deny that we don't miss the Night Gallery like crazy.   Giuseppe's is a traditional style Italian market (I think - I have nothing to back up that claim actually) with the restaurant portion upstairs and a deli style grab and go service downstairs. You can pop in, grab a seat by the window and people watch or browse around at all the spices and oils and produce and everything that makes a trendy Italian market trendy.   I had the Greek salad, which I thought was well proportioned and fresh for the price. The ladies that all worked there were pleasant, they even opened my bottle of Pellegrino for me. The tables were clean as was the restroom.  Good enough to go back to, not good enough to rave to my friends about but I do look forward to Round 2!"}
{"text":"Alright, first visit down to Giuseppe's. How many more to go? I'm not sure, but I liked it enough that I'll be headed back.  A restaurant upstairs, and a market on the main level, Giuseppe's has a fun and casz style to it. We stopped in for a quick bite, it was unfortunate the sandwich counter was closed. But freshly made pizza was right in front of our eyes. An employee was even rolling out and tossing pizza dough as we watched. Ready almost as quickly as any sandwich could've been made, this was a nice, light pizza treat-thin crispy crust and plenty of toppings. A girl needn't feel nearly as bad about eating half of a thin crust pizza ;).  With big front windows, room for musicians to play (there were a couple here on a Saturday night), this would make a cute, low-key spot to hang out for an evening."}
{"text":"I'm always proud to bring friends to this place for hand-made pizza! It's nice to be able to shop for some snack items and pick some nice treats up from the deli.  The first time I was there, the check-out was confusing but I now have the hang of it. I've only ever been there for lunch (5 times now). I've always found the lunch choices to be yummy and fresh.   I love the lively market environment."}
{"text":"Ok. I only had a chai latte here BUT I watched all of the aromatically tantalizing food come out of the kitchen while I was there - and I was IMPRESSED.   LOOKED to be authentic Italian fare - and I've been to Italy twice.   I'm hoping to get back really soon to try a pizza or something."}
{"text":"I stopped in for a pre-dinner bite, AKA carbo-loading for a tequila tasting event later in the evening. Unfortunately it was just after 4pm and the sandwich bar was already closed. So I ordered a forno oven baked pizza. It was excellent! Light and crispy crust, salty ham with chicken and peppers. Perfecto! They do have wifi, but it was really sketchy when I was in. The staff is fun and attentive. The espresso is good. But next time I definitely want to come for the Hot Table, make you own panini between, from 11 to 4pm. Just the smell of the place tells me the paninis."}
{"text":"I really want to like this place.  But they need to stop making it so damn hard.  There are glimmers of brilliance woven in with underwhelming moments of MEH.  Food - has potential. Caprese salad keeps getting smaller and more pricey, but it IS delicious.  Pizza, there are much better options out there in Calgary but if you're stuck, it'll do the trick.  Pastas have been great thus far.  The calamari is solid, and could be a meal in itself if served over pasta.  Service - this is the area where I feel that they need to pull their socks up.  I suspect they're understaffed, and offering dining options both upstairs and down only perpetuates this problem.  For me, I think the best way to enjoy Guiseppe's is to order take out and enjoy it at home."}
{"text":"We hosted our company Chirstmas Party at Giuseppe's last night and it was AWESOME!!! Thank you Connor & JT for hosting a fabulous cocktail style Christmas Party...there was tonnes of food it was loved by everyone and my favourite meatballs were all gone by the end of the night cuz they were so delicious... but thank goodness I was able to get my hands on a piece of the amazing yummy tiramisu.  Connor even went out of his way to deliver the food to the staff that couldn't make it and had to work.  JT - the funny & ever so entertaining bartender makes the best drinks ever with ever so creative names!!! Thanks again and we will be back again for Christmas 2013!!"}
