{"text":"The best corned beef sandwich between Atlanta and New York City.   Gleiberman's is a hidden gym in Charlotte.   Try the Matzoh Ball soup for a true delight."}
{"text":"Wow. This place is definitely weird. When I walked into the grocery- not a soul. No one to greet me or ask if i needed help. Shelves are anemic and dusty. I noticed they had EXPIRED deli meat in their fridge. The frozen meat looked grey.  As i explored this post-apocalyptic store, still no one came to came to check. The food here dont look like they get any turnover. At this point, they may just be putting up a false store front. Who knows.."}
{"text":"I couldn't find a good hot pastrami in charlotte until I came here, my dad's been a huge fan of this place ever since it was over on independence blvd. Everything is homemade on-site. Not that I'm jewish but he states he has very strict kosher standards. A great place, especially if your looking for a go to deli."}
{"text":"This was either the best knish I've ever eaten or I was just really high when I ate it.   

Either way, great experience!!"}
{"text":"I called Gleiberman's on Tuesday morning (5/15) requesting a delivery of two lunches and two dinners to be delivered to my office today (5/17) for two professional guests who required Kosher meals.  I was told that it would be no problem at all, and that I would be called this (Thursday 5/17) morning for payment.  That did not happen.  

At 10:45am, I was worried that I hadn't heard from anyone yet, so I called  to confirm that delivery would be taking place, I gave payment over the phone, and confirmed again that this food would arrive BEFORE noon today (5/17).  I was ASSURED at 10:45am today that this would happen.  

At 11:45, I called as there was no delivery.  I called again.  I was told that they had made a mistake with the payment, had corrected it, and would soon be on their way... they are 20 minutes from our office, but I figured that we could wait a few more minutes... Mind you, at this point our other regular caterers had delivered, and I was already apologizing that our two office guests requiring Kosher meals did not yet have their food.

At 12:11pm, I was called and told that their chef had not shown up for the third day in a row... (which they could've told me initially on Tuesday, or at any other time today during our two seperate phone calls so far this morning)... I was then told that they had resolved the issue (How? I don't know? Maybe a chef appeared out of nowhere... )... and that they were \"on their way.\"

At 12:23 I was called and told that the delivery person was parking... Useless information to me at this point as my conference room was full of people all of whom had eaten because our other caterers had shown up at their promised time... ALL, except for the two requiring Kosher meals.  Because I've now heard every excuse in the book for why they have not yet delivered.

At 12:27 our food finally arrives.

To say that this is a professional embarrassment is an absurd understatement.  These absurd explanations for and being a full hour late for such a minor amount of food to be delivered is inexcusable.  If there were extenuating circumstances, there was every opportunity (48 hours worth of opportunity) for them to call me and attempt to avoid / correct any potential problems.  I can barely express my dissatisfaction with this situation.  I give two stars because I cannot honestly judge the food.  It might be amazing.  Sadly, I will never know as I will NEVER use this restaurant again for any reason."}
{"text":"Just down the road from Shalom park, Temple Israel and Temple Bethel in Providence Square Shopping Center.  Matzoh ball soup, yo!

Oh and they are seriously kosher!  You're not gonna get any bacon or cheese on your corned beef here.  But it's oh-so-good anyway!"}
{"text":"OK, so we have established this deli/restaurant is tucked away in the plaza. You almost think you are in an apartment complex, then lo and behold, there is a Kumon Tutoring place and then Gleiberman's around the corner.

You will wait for some restaurant service. But I am telling you, this woman, who I think is the owner, is New York embodied. She's a character and a one-woman act in waiting tables, hence the slow service. She is not Southern trained in the art of charm, but neither are we so we got along famously.

We had time so no big deal. Bring some stimulating conversation and fasten your seat belts for the real deal delicious Kosher experience. 
We had the Shawarma with Israeli salad and the Beef Brisket on Rye. Sounds placid but it's not. Full of authentic Jewish seasoning and love.

Yes, it is tucked away, yes the service was slow, yes it is unusual, but I love my husband's equally seasoned conversation. So we had some giggles and patiently waited to support a family-owned business. I had a great ride and will return soon.

Would you complain about your aunt's slowness in cooking your lunch? Usually worth the wait and delicious, right? Think in those terms, put your phone away, stop texting and talk to the person you are breaking bread with."}
{"text":"Great burgers. Excellent deli. Very helpful people, but service can be slow.

Mark, the deli guy, keeps the deli sparkling clean. He knows his stuff. I've never had to wait long and never had a bad cut of meat from him..It always looks good during the short time it stays on the serving plate when I get it home.

When they have it, the Israeli fare is really good as are the homemade soups, though a bigger bowl would be nice.

Keep in mind this is Charlotte, not NYC or Miami or even Baltimore. There is only one truly kosher place in the Carolinas and this is it. Even when the store is empty, Jeff is almost always on the phone with people around a 4-state area taking care of their needs, including driving care packages out to state prisons in the middle of the night bringing food to people in jail who keep kosher.

If you need fast service, this isn't the place for you. If you want a place where you can come, eat very good kosher food, hang out, meet new people or see people you know, maybe become part of the community, this is the place to be."}
{"text":"DON'T GO - send someone you don't like. 
It seemed that they never went out to a restaurant themselves. The service was absolutely terrible. The pastrami was equivalent to Boars Head brisket pastrami. The stuffed cabbage was microwaved and frozen in the center. 
The hummus was decent.
Believe it or not Jason's Deli has better pastrami. 
I have to go back to Katz Deli in NY, that's what pastrami is all about!"}
{"text":"I was on a road trip and stopped off at this place. The staff were friendly, prices good, food terrific and they allowed us to leave our food in their freezer, lifesaver, because it would have thawed in the blazing hot parked car if not put in fridge or freezer. They have lots of pride in their business and make sure you leave happy. Would come back if I'm in Charlotte area again."}
{"text":"This place is located in a deserted shopping strip at the end of a dead end street, a cop car was parked in the far corner, watching over the area. I don't know how to describe it other than a Kosher mini-mart with a dreary dining room next to it. I don't get the impression that this deli is looking for new customers, the faithful know where to find it and that's good enough for them. We ordered at the cashier from a very limited menu - I think today was an off day due to a Jewish holiday.

In order of arrival
- coffee $2 each : bad and burnt both. 

- Chicken noodle soup w/ a Matzah ball $6 : A large ball in a small bowl, only left room for 1/2 cup of noodle soup, no chicken or carrots. Verdict was \"tasty, what the doctor ordered\".... but only 1/2 a cup Oy!

-Gefilte fish : $5.50 got me 3 smallish but thick slices. Pretty good but not great, it needed way more fish - don't forget to ask for horseradish if you order it

- \"N.Y.\" pastrami and corned beef combo:  $13.50 for only 6 ounces! and served with just a HALF a pickle and chips!!  No coleslaw or potato salad either 

OK, the sandwich did taste great but come on! For that same price in Miami I get a sandwich twice as large, served with unlimited bowls of pickles (both sour and half sour) and coleslaw.  In a nice restaurant at a ten times more expensive location -not Kosher, so sue me."}
{"text":"It is still a myth that there is a good Kosher deli in Charlotte. This place is a joke. We arrived for lunch and there were exactly 2 people in the place eating. We asked to sit near the near the window and the \"hostess\" took 10 minutes to find the cleaner to clean the table. We ordered Dr. Brown sodas and the cans were dropped on the table with no straws and no glasses. we asked and we received. Then we waited and waited and waited. NO SERVICE. There was no waiter/waitress on duty. Some young man arrived and with his winter coat still on, took an order from the last people to arrive, not us, who were first. We went to  find a server and the owner came out and said, \"I've only slept 3 hours in 2 days! I've lost $70,000 this year!!! Do you want to see my tax returns?!! Five times as many people came in for dinner last night!!!\" He followed us out into the parking lot, ranting and raving about how bad things were! He also said, \"We try to give the Jewish people around here something.\" I'm not Jewish and I'm sure it was obvious to him. Thanks for the biased remark!
Hey, if you're not ready to serve the public (all the public - not just the Jews) then don't open for business. Say instead, \"I am sorry, we cannot serve you at this time because we are not prepared. \" The guy was a loony tune to say the least -crazy at best. 

Like I said, this place is a JOKE. Too bad, because I drove 40 minutes and was in the mood for a big corned beef sandwich. One thing I know, I will never, never, never, have to come here again!"}
{"text":"My very best high school friend, Lisa, was passing through town and made a special stop to have lunch with me. They were on the way back home to Orlando.  We hadn't seen each other in like 40 years, so this was a special lunch reunion.  Because she and her husband are Jewish, they wanted to eat at a Kosher restaurant. Apparently, this is the only one within about a 200 mile radius.  I never knew this place existed because it is so tucked away off of Providence Road.  My first impression was fine.  There was a cafe attached to the market area and we were the only ones there.  The thing about KOSHER is that is supposed to be super clean handling and processing of all the foods.  I don't know all the rules of Kosher, but I know it's important to keep things clean.  My matzo ball soup was good as was my garden salad. There was nothing special happening with the food, but it was okay. The service was slow, which was fine since we were having a catch up session.  We had a shared plate of pita and hummus and that was delicious. The best part of the experience was not the Kosher stuff (apparently the deli meats are what's celebrated most here), but the visit with Lisa and Bob was phenomenal.  What's funny is that Lisa's husband is also a pediatrician and trained at the exact same place in Virginia as did my husband.  They were there at the same time and vaguely remember each other.  Small world.  Anyway, the whole irony of the experience in a Kosher restaurant was that when we were leaving, I noticed the sanitation score. It was an 86.  This suggests that something below standards is going on here.  Hmmmm.   Maybe not so Kosher after all?  Again, I found this ironic.   All in all, I'm glad I went for the experience, but will probably only go back to meet Lisa and Bob as they are traveling through town again."}
{"text":"Have stopped here many times on our way from RI to FL and back. They have renovated the dining area and it is really nice plus the food is EXCELLENT! I had the large salad with grilled chicken and my husband had the hamburger . Being a chef I'm pretty picky but our meals were prepared well."}
{"text":"Gleibermans is the only kosher grocery store in Charlotte. There is also a small restaurant on site with Israeli and American Kosher food. The selection is decent, the prices are average (for Kosher food), but the service is terrible. I've seen patrons go and get their own stuff and I have to say I'm always tempted to do the same. Always understaffed (someone always calls in sick) and never enough coverage even when no one else is in the restaurant! It still gets 4 stars for servicing a underserved population and quality food but I don't go regularly since it's a shlep from where I live and the service leaves a bad taste in my mouth (no pun intended)."}
{"text":"I go in for lunch with a co-worker literally stand for ten minutes and still was not seated
We decided to just a get a to go order, Pastrami/Corn beef combo  on rye
my co-worker orders chicken salad on rye 
We again wait ten minutes to then find out no chicken salad, we just fine
I get back to my office my sandwich literally had maybe four ounces of both meat on the entire
sandwich.
Once again another deli that does not mind charging $15.00 dollars for a sandwich but No Product!! Where not in New York so don't charge their prices if you can't back it up with 
product which by the way was the Worst sandwich ever!!
NO GO for me would not recommend to anyone!"}
{"text":"Worst food experience I've had in Charlotte. The store was dusty and barren. The food in the counter was old and cold like a basement you'd find in a horror movie. The wife and I were feeling lucky (Just like the kids that end up dying in those same horror movies), so we braved ordering. Two sandwiches and drinks. A half hour later and we were still waiting. We'd probably have been long gone, but I'm deeply in love with my wife (And she pretends she's in love with me very well), so I was enjoying our conversation. But eventually we decided we wanted to eat instead of sit alone in an empty restaurant, and so we made to depart. Only then did someone decide to make us a sandwich, delivering it as we got into our car. 
It was not a good sandwich. Perhaps it wasn't as bad as the rest of the experience. But given the baggage that poor sandwich was burdened with, it would have had to have been a lot better to make eating it feel like taking a shower at the Bate's Motel.
Maybe we caught them on their worst day ever. Maybe. I don't like giving bad reviews, but I feel this place deserves it. I have no clue how anyone could give it a better review."}
{"text":"Glieberman's is really pricey but that Kosher meat is AWESOME. Don't let anyone tell you different. One of the best Pastrami's in town."}
{"text":"I'd always thought knishes were starchy piles, tough on the outside, doughy and potato-y on the inside and only to be eaten when thoroughly hung over. Today, I had my perspective broadened, thanks to Gleiberman's. Buttery potato, zucchini puree surrounded by toasty, light puff-pastry. Wow.

This awesome little kosher enclave sits pretty far out off of Providence road, in the Providence Square shopping center. A diner-esque restaurant adjoins the store's space. A deli counter full of classics is to the left as you enter - egg salad, kugel, kosher meats, chopped liver (and today, a huge tray of zucchini-potato knishes. Yum). Aisles full of kosher products, canned, jarred, bagged, boxed. Things I had never seen nor heard of before. Rad.

Fridge and freezers full-ish of kosher entrees, cheeses, tofutti, etc. Familiar brands like Tabatchnik and Ba Tampte but many, many others. Kosher wine. Shelves were a little bare- since I had stalked the place via their awesome webpage, I had expected to see more \"bounty\". Maybe Sunday was to blame.

People were smiley to me as I wondered, poking and prodding various wares. The diner's menu, although not extremely veg-friendly, looks interesting enough. For Israeli imports and kosher products (there's a whole freezer full of weird, vegetarian \"cutlets\") this is the place. Hallah.

Note: closed Saturday, open 'till 5 Mon-Thurs, late on Sunday."}
{"text":"Okay! Let me start by saying, don't judge a book by its cover. The shopping center is run down but the restaurant is in the back. When you walk you, you will be walking into the deli. Then they take you to the dining room. I had never been before until this past time. Got there an hour before the kitchen opened so they asked if we wanted coffee. Guys, this coffee is awesome! Later on we learned the creamer was non dairy. couldn't believe it! I browsed the menu and decided on a burger. HOLY DELICIOUS. This burger was the most amazingly delicious burger and get this, with no dairy, obviously there is no cheese and I LOOOOVE cheese on my burger. This burger didn't even need cheese. I ordered the sweet potato fries.. DO IT.. no really, don't even think about it, JUST DO IT!! They are the best sweet potato fries i've ever graced my mouth with. I also tried the Mushroom and Barley Soup. So So So So good! I am a new fan of KOSHER!"}
{"text":"We heard great things from a NY transplant saying how good the food here is. We ordered two 'NY style' pastrami sandwiches. At $14 a pop, we expected a large NY deli style sandwich. Instead we got 2 sandwiches with about 2oz of meat on it. I had to lift off the bread to see if they forgot to put meat in it. The pastrami was the fattiest cut of pastrami I have ever seen. I couldn't finish it. To me it was inedible. My wife tried harder, but she too gave up. Waste of $30. I get that it is kosher and thus incurs an added cost, but this is insane. We won't be back again."}
{"text":"This is the worst Jewish deli I have ever been too. Yes they have a great Jewish supermarket. I will hands down give them that but the matzo ball soup was awful ... and barely had a matzo ball in it . The pastrami sandwich left a lot to desire. I wouldn't recommend if your looking for a good Jewish deli experience. Overall very overpriced for the quality"}
{"text":"Gleiberman's is a tough find, buried in a small shopping mall that is a short distance from Providence Road. The mall itself has seen better days and most of the shops there are well boarded up, but around the back is this small market and restaurant.

You will absolutely want to check their hours before coming over as they close early on Fridays and they're not open at all on Saturday. Jewish sabbath, donchaknow?

Lots of the harder to find Jewish and Kosher delicacies here and everything you might need to cook a meal without offending the big man upstairs. Yes, they also have the services of a Kosher butcher so you can find good cuts of beef, lamb and chicken too! Obviously, no pork or shellfish.

Prices aren't cheap, but they're not supposed to be. This isn't low quality cuts from a mass-produced supermarket dealer. These items are hand picked and hand-cut, most of which you're not going to find in the Big Box stores.

No idea about the restaurant food, we just picked up some excellent lamb and some whitefish salad. Yum."}
{"text":"Order for one of the NY delis or even from the  Krogers in Atlanta and have it isent overnight, If there is a Kroger in Clt, they will send it there and you can pick it up.

Here is why, the prices are high, the quality is bad. Being the only kosher place in town, they seem to take advantage.

We ordered meet on the same day, my husband bought it from them and I bought  it from. NY. While there was a slight, very slight price differential higher, it was sliced, trimmed and placed neatly on paper. Gliebermans was thrown in a pile and under the pile was mounds of fat...after removing the fat the amount of meat was far less than the same of the package from New York City...thus Gliebermans was some 35% more expensive.

Crave kosher deli? Have it overnight end from Park East Kosher, Supersol, Pomegranite and so on.....or again  try the Krogers idea. 

The other issue and it is mentioned below, is the owner gives a  sob story rather than focusing on using his energy to make sure he is providing services. When I was there, he followed me around whining, ignoring others,  causing me to be late, not packing bags correctly, leaving a bag out of the car as a matter of fact causing me to have to run back ere Shabbes when there was a long drive in front. I think it is selfish to be like that, at the least self absorbed.   If you send  a message, I would post the photos. Am afraid it would destroy him and I guess he serves a purpose. Too bad he does not respect his position and the fact that people would depend on him more.... meaning, he could fill his restaurant if he was less self serving...its a catch 22, make it better by investing time and money, and people will flock. It takes energy to sit there and listen to him kvetch.   

Photos available."}
{"text":"Overpriced, under quality. Pictures tell a thousand words, have attached some.

These days, easier to have it sent from New York. At these prices,  and lack of quality, you will save considering the amount of meat that needs to be tossed.
 
The way it was sliced, the way it was presented, Gleibermans was disgusting..... again, pictures tell a thousand words.

The place itself is dreary.

The owner Jeff, will ramble about how he struggles in business. If he put his energy into quality product and customer service,  instead of complaining** it might not be a struggle. 
I do not recommend this place.  Would prefer to eat Vegetarian than to overpay for a lousy product.

The first (and last) time I went, I had a large order, I flew into Clt just to stop there and to try and support a local small business. It was erev shabbos and I needed to drive 2 hours.  After complaining about his struggles in business for an hour,  I finally got out and on the road, only to be called that half the things were left behind. I went back, an returned to my drive only to find liquid dripping all over the floor... (it was a flat floor suv), they did not close the containers properly...it was a hot mess.     

Plenty of kosher restaurants attract a non-jewish crowd simply because of quality, that is the last thing you find here. 

If this guy paid a quarter of the attention to the product and customer service over his woes, he might night have any, people would flock, but he does not rock it the right way. Pathetic!!!!


When my husband brought the items in the photos home, and I by chance brought some from New York the very same day, it was amazing to see the difference. Look for yourself."}
