{"text":"New menu is superb. Food is better than ever. Creative, colorful presentation and delicious flavor combinations. It would be 5 stars if they could stop the cold air from blasting in every time the door opens. Decor is good enough for a casual dining experience, the focus is right where it should be, on the food."}
{"text":"Service was extremely slow, took forever to be seated and to pay.

Was not impressed with the sushi at all. There was way too much rice on everything"}
{"text":"I love their location that close to the mall!! I love their selection of sushi!! Great staff but too small place!"}
{"text":"Globe Fish is my go-to sushi restaurant. (Note: I've never actually sat down in the restaurant, we normally order for pick-up.) I believe that people who say they hate sushi are those who have only tried the cheap supermarket stuff or gone to a bad sushi establishment. I have made two former sushi-haters sushi-likers by ordering a Globe Fish meal. 

I absolutely love the yam tempura rolls!  They are just delicious - they are nice and big, with a generous amount of yams.  Melt in your mouth, they are a favourite among myself and many others.  I have thoroughly enjoyed all but one roll from Globe Fish, that was the Alberta Roll, with a beef filling.  I thought it was quite flavourless & chewy.  Everything else has been great & the service is efficient, if not the most bubbly in the world.

You know that sushi craving...that won't be satisfied if I get mediocre sushi and will not be happy until I get great sushi feeling?  Well, I know that when I order from Globe Fish, I will be sushi-satisfied!"}
{"text":"Sushi is one of my favorite foods and Globefish at Marda Loop did not disappoint. I've recently moved back to Calgary from the west coast and I must admit, I have been missing the stellar sushi/sashimi you can get there. We started off with PEI Oysters and Tempura Camembert - I know ... not sushi, but both very delicious!! The Stampede Roll was on special, so we ordered that, along with a couple of the special rolls - all very tasy. I loved their menu - everything looked so appetizing and I love their unique presentations. I especially loved the special rolls pages with all of the cleverly named rolls. I would like to sample one of everything on their menu. The only downside was they closed early at 9:30pm and by 10pm, they had all the chairs up on the tables and they were rushing us out the door. This however, would not deter me for going back again."}
{"text":"The most artistically plated sushi I've ever enjoyed. I thought the prices were a bit high, but I don't mind the occasional sushi indulgence, especially at a place like Globefish.
I recommend:
- the B.C. Roll
- the Alaska Roll
- the Crunch & Munch Roll"}
{"text":"Globefish is good, no doubt about it. For new to sushi people, they are sure to enjoy it as there are some very tasty options to ease into it.
The Isobe Age is delicious!! A must order every time we went. The service is always quick, even if it is super busy. Their tempura is delicious. The special/dragon rolls can get a bit pricey, and in the maki, there is alot of rice to fish ratio.  
We used to go almost every week, however, with drinks, our bill would range between $95-$120. 
If you want better sushi at a better price, try O Shima on 17th"}
{"text":"I've been to many sushi places but always find myself making my way back to globefish. I recently went back on valentines day. They are a bit on the pricey side but it is so worth it. The sushi is delicious, the staff is attentive, and can I please mention how absolutely amazing the sushi is?!

So great. Thanks globefish for making my valentines day dinner awesome!"}
{"text":"We were pleasantly surprised with Globefish Sushi.  4 friends and I decided to give it a try before we headed to a movie. 

 It was a saturday night so there was obviously quite a line up when we first got there.  We put our name down and they called our cell phone when a table was ready, which was great - we didn't have to wait around.  We walked around the mall and then 30 minutes later our table was ready. 

We ordered quite an array of sushi and it was all nicely presented and tasted phenomenal!  The service and atmosphere was great and we had a wonderful experience!  

Would definitely go again!"}
{"text":"This is my go to restaurant for specialty sushi rolls. They have a lot of delicious combinations for the rolls. I like coming here because it doesn't close between lunch and dinner so I can always eat sushi mid-afternoon. One of the rolls I always order is the cats eye. It's a deep fried roll with tuna sashimi on top. The manager is really friendly and the service is pretty good."}
{"text":"All I have to say here is......prices are reasonable, service is efficient, try the Crunch and Munch Roll, Crazy Buster, Chicken Nanban, and Isobe. 


....Oh yah and the occasional run-ins with local celebrities like Jerome Iginla (Calgary Flames), and even some B-listers like Neve Campbell makes this place a top header in the Cowtown sushi scene."}
{"text":"I've been wanting to update my review since my last few visits. Maybe its me but I've been consistently experiencing problems with the freshness of their sashimi for a while.

Globefish is still good (especially for the cooked rolls and Izakaya dishes), but if you are a 'only sashimi eater' like I'm, go to Kinjo - toro & salmon has always been fresh."}
{"text":"Ordered edamame, gyoza and some rolls to go. Service was fast but when I got home, turns out the gyoza and edamame were undercooked."}
{"text":"This is our favorite sushi place in town. We've tried a few different places and always end up back at globefish. 
The fish is always fresh, the rolls, crunchamunch and crazy buster are our favorites and are awesome, the beef yakisoba is awesome, and the beef udon just amazing. The broth of the udon is just fantastic, I haven't found anywhere else that compares. The service is always great. Sometimes you have to wait depending what time you go, but it's always worth the wait."}
{"text":"Fairly decent sushi, and the combo platters are reasonably priced. The service was fantastic, even though we were a large party we never had to wait long for food or beverages. Some creative roll ideas and a huuuuuuge selection. The spicy agedashi sushi was delicious!"}
{"text":"This place is a little pricey, but you do get what you pay for. The Sushi is truly out standing. The melding of flavours and textures will have you coming back again. Expect to spend $80 to $100 for 2 people if you are hungry. $30 to $40 for snacks. Skip the wine menu, as little thought appears to have been put in to it."}
{"text":"OK. It was just ok. Stopped in for lunch on a weekday and were seated immediately. Drink and meal orders were taken quickly and then standards sort of relaxed...

Our order took a long time to come. In a small, not very busy place, that shouldn't happen. When our lunch boxes came they were lukewarm. The portions were large for the price and things were tasty but would have been better hot. 

It took a long time to flag a waitress down for the bill and we stood at the register waiting to pay for a while too."}
{"text":"This guys are the bomb. One of my favorite places of sushi around the world. The tuna tataki and viva las vegas roll are super tasty. Place is pretty clean and staff very friendly. I always come back when visiting Calgary. Highly recommended."}
{"text":"Globefish was my first introduction to sushi, so I think I'll always have a soft spot for the restaurant.

Their rolls are phenomenal and delicious, and the miso soup is tasty but not too salty. The atmosphere is always loud and busy, especially if you're lucky enough to sit in the 4-table section right next to the door. In the winter, it can let a nasty draft in, so it might be worth your while to wait for a table inside to become available.

While the food is delicious (my favourite is the Crispy California rolls), it's definitely on the pricier side. A dinner for two, with four rolls and dessert may run you about $40, without appetizers or drinks. This is more of a treat restaurant than a place you'd be able to frequent (if you are as bad at cooking as I am). 

It's also always busy, so go prepared to wait for a table to become available. Servers are constantly under the rush, so it can take a little while to flag one down as well.

Overall, though, it's a nice restaurant and the food is delicious. Weigh the pros and cons, but at least check it out once."}
{"text":"There is a lot of variety of sushi here, and all of it fresh!  I especially love the Tsunami Roll (gotta love cilantro)!  The staff is always very friendly and helpful which really makes it for a great experience!

The only issue I have to with this restaurant is the lack of space!  If you're going on Friday or Saturday night, be prepared to wait for an hour!  But if you have the time available, I'd say it's worth the wait!"}
{"text":"I've been to Globefish in Chinook a few times, but this was my first time at the Marda Loop location. Earlier that evening, their Chinook Centre location had a line out the door My friend and I decided to make the short drive, and guess what? No line!

Their sushi is medium-pricey. Their special rolls range from $12-16, and their California rolls are $5.25 (just for reference). I think this is pretty standard pricing from my experience. They also have many other non-sushi options that also look very good. Unfortunately, they are out of octopus that night, so that sucked.

They have a ton of interesting looking special rolls, although many of them had similar ingredients. Usually you'll find some sort of combination of prawn tempura, salmon, tuna, mango, avocado, and tobiko. Maybe there will be some unagi in one and scallop in another. But no complaints - they are usually pretty tasty. I did order some salmon nigiri, and it sort of reminded me of something I would get at a food court sushi place. I don't think anything can compare to Haru Sushi's salmon nigiri...

To end the meal, we ordered the green tea ice cream, and I was very disappointed. It didn't have much green tea flavour. It came in one of those hard square packages, they unwrapped it, put it on a plate and decorated it with whipped cream. Globefish? Really? I expected more from you.

Overall, I want to give this place a 3.5. I wouldn't say that I'm a fan, but it's better than A-Ok. Some of the menu items are pretty good, some were okay, some were kind of disappointing for the price. I would recommend trying it though because some people love it.

30/30"}
{"text":"I've always had good sushi at this location. It's not the best sushi I've ever eaten, but their rolls are creative and usually well made. Service is friendly and prompt, though they don't check on you too often, so make sure you have everything you need when you order! I'm a sucker for the Crazy Buster Roll and their Crispy Tuna Roll, those ones are always a good bet. Definitely a good place to go to after a long day of shopping, and if you want something that isn't in the food court."}
{"text":"Appies: standard edamame (nice and warm), good miso, spicy tuna tacos which were clever and good
Dinner: a few rolls which were above average - while eating we saw this couple get what looked to be a mini mountain of ice with rolls all over the place - very jealous...obviously this was local knowledge I did not catch on yelp
Dessert: green tea ice cream was ok. My buddy got the pear ice cream but we needed a chainsaw to cut it open to actually get a bite it was so frozen. 
Service is splendid. atmosphere is kind of weird - they should get booths that are not so tall, turn down the bright lights, and put the tv away from the center of the room to class it up a little."}
{"text":"Dining at the Chinook location is a consistently fantastic experience. Their quality music and unique interior design lends to its cool and comfortable ambience. Our server was perfect- very kind, knowledgeable and recommended a great roll to us. Globefish is definitely a new favourite!"}
{"text":"Globefish is like a pair of hot pumps. They look pretty but the fit doesn't leave you wanting to put them on again.

The miso soup was sneakers - comfortable. Thumbs up.
The assorted tempura was 80's pirate boot revival - looks cool on the outside but there's just not something right (the batter was not fluffy and light as it should be but still decent-tasting).
The salmon tataki (seared salmon nigiri) was so overwrought with roasted garlic flakes & seasoning that it was like a stiletto, nice in theory but ridiculously overdone.
The rocky mountain roll (salmon, avocado, cream cheese) were delightful lil peaked sushi...like knee-high boots comfy boots -- something for everyone to wear and enjoy.
And the Crunch & Munch Roll (tempura prawn roll wrapped in avocado & eel) were ballet flats, nice but much too sweet for everyone (the sauce really was too sweet for the eel - it should have been savoury).

The look & atmosphere is trendy & bustling but overall, like with shoes, it's really hit & miss at Globefish. Your boots are made for walking and you should let them walk you across the street to El's Japanese Fusion instead!"}
{"text":"Yes, it's pricey. But if you want to treat yourself. This is the best Sushi I've had in Calgary. This is not the place to come if your really hungry, it will cost you a lot. Just because it is so good. But for a snack or treat, it's great. Also a great place to go for a date, provided it's not dutch....LOL"}
{"text":"I'd had a couple underwhelming meals at Globefish in Kensington, so I wasn't expecting much at the Globefish in the mall. However, I've been a bunch of times since we've moved to the south end of town and I've left super happy every time. Granted, I don't know if I'm just negotiating the menu a little better, or if living in the sushi doldrums of Bonavista has made me thankful for any decent sushi I can get.

We usually start with some izakaya items fill the post-work beer and something fried craving. Takoyaki and the Rock'n Shrimp bring the crunch, while the Beef Tataki comes with loads of umami goodness (fried garlic chips!)

Nigri is nicely cut and always fresh, with pretty average prices. Maki can be made with brown rice, and I recommend trying an avocado roll this way (brings a lovely nutty and chewyness). The creative rolls aren't always the best value (and seem to feature a lot of variations of crab stick and prawn tempura), but the \"special\" rolls on the front of the menu can sometimes be fantastic. Last year they featured a special roll wrapped in soy paper, draped in toro and finished with some yuzu mayo that was a textural and flavor triumph. Another great special was the the salmon sashimi sampler, that featured three different varieties/species of salmon, including a toro-like fatty salmon that was out of this world.

Service is fine, though not great. Like many sushi places, if you want things in a specific order, or have individuals ordering specific, different things (like your friend who doesn't eat sushi, so they'll just have a mess of udon) you'll need to let the server know specifically know when you want what.

Beer is cold. Decor is modern and pleasant, though the space is small. The HUGE tv's are ridiculous.

Plus, it's easy to wander back into the mall after supper to grab a P&S before heading home or to a movie."}
{"text":"You can't make comparisons with sushi from Vancouver to Calgary, well, not in the same context.  Globefish (surprisingly for Calgary b/c it's not near an ocean) creates quality sushi.  There's nothing fancy but simple and well-crafted dishes, supplemented by excellent service.  Aside from a lackluster ambiance, there are many reasons to enjoy Globefish--chiefly, the food and service is outstanding.  I wasn't expecting a high-end (Nobu or Toshi-like) Japanese dining experience or environment and neither should you (it's an izakaya: a Japanese gastro-pub). In fact, I wasn't expecting much at all (no offense). Globefish is great for what it is--a decent sushi/izakaya. 

Order:
Gomae and spicy tuna tacos 
Salmon sushimi and spicy tuna sashimi (the tuna was a too \"waterlogged\" maybe due to defrosting, breaking apart with a \"mushy\" texture, but no worries, our waiter apologized and took it off our bill). 
Crunch and munch roll and Dynamite roll

A large size Kirin Ichiban (Premium) beer is essential.  \"genki desu!\""}
{"text":"Globefish on 33rd Ave. is one of my favorite sushi places.  The selection of rolls on the menu is impressive and and service is quick.  The miso soup is some on the best Ive had and the presentation is clean and appealing.  

IMO Pricing is on-par with competition, the interior of the restaurant is sleeker and cleaner looking than most, but i do prefer the decor of the Kensington location.  

If you are craving sushi in the Marda Loop area, I recommend \"El's Japanese Fusion\", the service is not a good, and the decor is best described as 'basic', but for the quality of the product, El's is a better eat."}
{"text":"Fast service with fresh sushi that never gets old with friendly staff. Never had any complaints with this restaurant and won't have any anytime soon. Would recommend"}
{"text":"I'd had a craving for Japanese food for a few days and finally gave in and had some takeaway delivered. With the cold weather I specifically wanted some hot food, so I ordered the Beef Yakisoba and Chicken Teriyaki - then added on some Mexican Roll sushi because it just sounded amazing (crab meat and avocado on the inside, tuna, cilantro, jalapeno, green onion and spicy sauce on the outside).

The sushi was soooo good, and if I order from here again, I'm super keen to work my way through their list of sushi offerings. All of the combinations sound like something my belly wants, even if the 8 pieces of sushi was a bit on the pricy side at $14 plus tax.

The Beef Yakisoba ($10 plus tax) was dry and lacking any real sauce flavour... I had to add soy sauce to it. The Chicken Teriyaki ($16 plus tax) was literally just some chicken and rice, no veggies. This was listed under their entree size but for the price I was expecting something much bigger, plus the chicken was a bit dry and the chicken was next to the rice rather than on top of it to soak in the teriyaki sauce goodness. In my order I requested extra veggies, and was charged $2 for this. When the order arrived it was a small container of separate salad (?!) which was promptly ignored (because no-one's friends with salad), thrown in the fridge and eventually the bin a few days later.

I ordered online through their website and the food arrived about 30 minutes late (around 1.5 hours in total delivery time) and on the lukewarm side of things. If you're ordering from here I highly recommend just getting the sushi... and also allowing a while for the delivery or going to pick it up yourself."}
{"text":"The staff here are fantastic! The gentleman who sat us was exceptionally friendly and accommodated us promptly. He gave us a great table with plenty of room for our baby and her car seat. 

The food here is a little pricey, but it was delicious!"}
{"text":"First time there, husband and I loved it, reminded us of a sushi restaurant we went to in Vegas. Server was a bit shy, but friendly, other than that we'll be back for sure."}
{"text":"I highly recommend the ramen especially the Kuro (black) Garlic ramen and any sushi rolls with mango or avocado. Calamari is yummy!

A small note to keep in mind:
-Small location (it can get very busy during peak hours)
-High wait time if eating for a party of 4+ during peak hours
-The pork in ramen dishes are all lean

Overall, I would go back for a ramen craving. But if you are seeking a heavier and fatty ramen taste, you may wanna try elsewhere."}
{"text":"This is the anti-sushi review. 

I've tried, and tried and tried and tried to like sushi. I've gone to many different Sushi joints in cities allover the country, each time thinking \"maybe I'll like it this time...\". Maybe I did something wrong before? Maybe I just wasn't in the mood for it...9 times before.

There's something about white rice that I don't get. It's disgustingly terrible for you...I don't understand why people eat rice. It doesn't even taste good, if it has a taste at all. Maybe that's why people think it's healthy. It's not. It's an over processed grain that converts to sugar as soon as you consume it....). Pair that with a weird crunchy seaweed texture and slippery raw fish and you have me gagging as soon as I put it in my mouth. When I was a child I felt the same about eggs and about cake.  Yep, I was probably one of the only kids that had Birthday Pies at his party...yep...birthday pie!...mmmm birthday pie...) 

That being said, I have a lot of friends that love sushi and crave it. So I get dragged to Globefish once in a while. BUT it works out for me because they have a lot of items on the menu that are NOT sushi.   

The steamed edamame is delicious and piled high. 

The Beef Tataki is almost like Carpaccio and I love carpaccio.  Thinly sliced lightly seared Alberta beef steak served with garlic chips and green onion. 

Throw in some shrimp skewers with teriyaki sauce and you're good to go with a meal that doesn't remind you of slippery birthday cake. 

This location also has great service. The chick with the tattoo on her arm was awesome."}
{"text":"Worst service ever !!!!!!!   I won't be going back to this location for a very long time, I even gave them an opprtunity to redeem themselves.

My wife, kids & I were hungry for lunch today so we asked our son (His B-Day) where he wanted to go. He said he wanted to go for Japanese, so we suggested Japanese Village, at first then thought it might be too busy. We ended up at Globefish (Chinook Centre location). 
 
It started out a little shakey, right off with taking our drink orders. We ended up getting 8 glasses of water for the 4 of us. When we originally asked for water & tea, another waitress came by and asked us what we wanted to drink. We told her we already asked for water. I guess she took that as we wanted water from her as well.

Then approx. 5min passed, and another waitress came by and took out food order. It was very simple a chicken teriyaki roll for my son, my wife orderded chicken teriyaki appetizer with a small salad, also yam tempura, and 2 extra bowls of rice. Oh yeah, I  had a tempura don rice bowl.

What really started to irratate us was my wife's meal comes out first, after waiting about 10-15min. Then 20 min pass, my sons chicken teriyaki roll comes out, 5 more minutes the two bowls of rice come out. Now after all that time passes everyone has eaten, and my wife asks the waitress where my meal. and the yam tempura is. The waitress never comes back to tell us. Then the yam tempura comes out. I ask a different waitress where my tempura don rice bowl is. ( Now bear in mind 40 minutes has now gone by, and the rest of my family has now eaten) The waitress comes back 2-3 minutes later, and says it will be a few more minutes. I tell her to forget the meal and take it off the bill.

She apologizes and thats it. No offer to discount the bill NOTHING !!!!!!  no offer on a return visit.

We ask for the cheque, and that takes an additional 5 minutes. That could feel like an eternity when you're pissed off and haven't had anything to eat. The waiter, that brought over the wireless debit/credit machines asked how our meal was. I told him it was terrible, and that I didn't even get my meal. I asked if there was a manager around to talk to and he said yes. Guess who it was, it was one of the \"waitresses\" serving us that apologized for not getting my food. I could see him pointing at our table from a distance, she just turned around and ignored us so we walked out.


VERY DISAPPOINTED !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}
{"text":"They have improved their menu since awhile back and I upped my rating. The lunch specials are really good! My favourite is the veggie box weekday lunch special. It is so good!!! I would eat it every day if I could. The service has been hit and miss but okay overall. The quality of the food is consistently good. The decor is pleasant. Globefish is a safe bet for a sushi meal but it can be pricey and it is in Chinook Mall so it can get very busy. I am glad they are there. One can get a lunch here comparable with food court prices but much better quality. One can also easily let loose and spend too much."}
{"text":"Of course we had a movie to catch (like half the patrons I'm sure).  Very busy partly because of the movie theatre and the mall. Ended up leaving after a 50 minute wait - tho told it would be 30 minutes... Not sure if this qualifies as a review.  Maybe a partial review..."}
{"text":"My fave sushi spot.  Always fresh.  The variety on their menu is plentiful and the servings are generous and pretty to look at.  Get there early or even better at an off time.  It is cozy, but a great choice for above average sushi.  Bonus - they even have a tv!  

Afterwards, stroll on over to Phil & Sebastian for a nice cup of coffee..."}
{"text":"If your looking for a good sushi,this is the place.however it is a little pricey but the quality of food is good so i cant really complain.my favourite is the rock and shrimp,i order it everytime i go here. Overall the sushi is really good.very friendly servers!"}
{"text":"Amazing selection. Great use of different flavours for every item. Amazing sashimi and sashimi, very high quality and fresh. Presentation great, servers are friendly and helpful. Within my top two places for sushi in calgary"}
{"text":"Great food, I've been 4 times now over the past year and a half. I highly recommend the isobe, and pretty much any of their special rolls.

Can't wait to go back."}
{"text":"I'm actually surprised at all the mixed reviews at Globefish. While I think I'm still on the hunt for the outstanding sushi in Alberta, I think Globefish is fairly solid. I came here with a party of four on a Saturday night so we waited about 20 minutes or so, which should be expected. I know others here have had issues with service, but we experienced no such thing. Service was adequate. By the time we were finishing, the restaurant was fairly empty so we were able to take our time and chat. I was most pleasantly surprised with how fresh the sashimi was. Being from Vancouver and now living in Edmonton, Globefish (and in general Calgary)  is a happy in between for sushi between the two cities."}
{"text":"Ordered the avocado, vegetable, yam tempura, and vegatable fantasy. Sushi was not worth the over price, 6 dollars for an avocado roll. Rolls were cut thinner than your finger. Won't be coming here again, when Kinjo is down the street. The only thing good here was the shrimp tempura."}
{"text":"I've been to the Kensington location and liked it enough there + this place already won bonus points with me for NOT being Asian Ginza (awful service every time I went there). Went here last night with my brother and his friend. The waitresses at the front counter were friendly, and seating didn't take too long.

I ordered the seaweed salad and ~*vegetable fantasy*~ roll (to type that name any other way would make it seem like a serious name for a serious roll). I always get seaweed salad at sushi restaurants, so I was surprised when this one came with caviar all over it. I'm always kinda leery with sending food back (that scene from Road Trip will haunt my dreams forever), but yeah, caviar isn't exactly veg so I asked the waitress for a new one. Also, when she put down my seaweed salad the first time, she also set down a platter in front of me that she said was my ~*vegetable fantasy*~ roll. We even joked with the waitress that the ~*vegetable fantasy*~ roll should have been served by a hot muscular half naked dude. After putting one of the rolls in my mouth, I realized I GOT SURPRISE SPICY TUNA ROLLED. The restaurant is pretty dimly lit, so the tuna was hidden inside shredded cucumber. 

Cue running to the bathroom and getting a surprise tuna roll again, this time in reverse :(

After some discussion, flushing my mouth with water, an offer of a 20% discount and apologies from the staff, I got the actual ~*vegetable fantasy*~ roll and my brother's friend got her actual order of spicy tuna roll. The staff didn't really seem to communicate well with each other, because we'd have one waitress ask us how everything was, and another waitress show up asking the same thing 2 minutes later. Just when the night couldn't get more confusing and random, when we got up from the table, we noticed a PAIR OF BLACK HOTPANTS on the floor by my brother's friend's chair. WTF. Giggling ensued.

The food - when you're not getting surprise ingredients that you didn't ask for - is pretty good and the waitresses at the front counter are actually really nice. I would risk coming back."}
{"text":"This is a convenient Japanese restaurant located inside Chinook mall.  I've been here a couple of times and have generally enjoyed it - lots of options including ramen, rolls, rice bowls, and sushi burrito.

Atmosphere: 3.5/5  Overall clean, neat and modern atmosphere.  The restaurant is small so sometimes there may be a wait.  It is conveniently located in Chinook mall with parking available.

Food: 3.5/5  This time, we had the sashimi salad, cherry blossom roll, happy crunch roll, and momo sake roll.  I've also had lunch here and had a salmon and tuna bowl.  I love the option to substitute with black rice, which was very tasty!  Overall flavourful but I would've preferred a little less sauce / salad dressing.  

Service: 3/5  Servers were very efficient - we were quickly seated, orders taken, and food came quickly.  It can get quite busy so sometimes it felt a little rushed, but great for a quick sit-down lunch.

Price: 3.5/5  Reasonable for a sit-down Japanese restaurant

Overall: 3.5/5  Overall I enjoyed my experience at Globefish chinook.  It's a good sit-down restaurant for a quick lunch while at Chinook mall with various options including some special rolls.  I would probably have liked less sauce with my orders but that can always be individualized.  I would come again for lunch... perhaps to try their sushi burrito!"}
{"text":"This is not going to be top of the line sushi but as a neighborhood joint, it's pretty good.  I would go so far as to say it's better than most neighborhood sushi places in SF.

Stuff we ordered that I particularly liked:
 - Isobe
 - Spider Roll
 - Toro Sashimi
 - Soft Shell Crab Tempura Roll
 - Beef Udon
 - Pear (dessert)
 - Mochi Ice (dessert)

I was really shocked about how fairly priced the toro was considering it's such a rare delicacy.  Then I found out that the reason it's so cheap (in general and not specific to this restaurant) is that they \"farm\" the tuna.  So that's why it's not very expensive and may not taste as special as you imagined.

Our total was only $240 for 5 people (including tax + tip), which included much more food than I listed above and also beer/wine.  Not bad for good sushi."}
{"text":"Globefish at Chinook Mall in Calgary, Alberta never disappoints. Today our waiter was friendly and efficient but once he knew we were in a bit of a time crunch he stepped up and got our drinks & food pronto! My  sashimi salad was so light and tasted amazing with the wasabi mayo dressing on top of crispy noodles. My son had the order of Rainbow Rolls but after one just had to have another because they're just that good! Three times is a charm! But I'll be back many more times!"}
{"text":"Found our new lunch/dinner spot! The sushi burritos are unbelievable, and pair it with a bowl of ramen and you'll not regret it! Customer service is also up to par, very friendly and able to read when a customer is chatty, or wants to be left alone like my wife and I. Will recommend to friends for sure"}
{"text":"Love their menu. Simple, but you get a variety of popular Japanese food. Most of their ramens are chicken, i don't mind, but when I was here like the 3rd time I wanted to try a beef ramen but I dont think they have it. They serve a decent amount of sushi as well. And service is great!"}
{"text":"Dependable. Globefish isn't spectacular but definitely a great place to get your sushi fix. The menu is pretty standard but the dishes are well executed.

Mentai Calamari...5 stars. Well seasoned bite-sized strips of calamari served on a bed of chopped lettuce and drizzled with a spicy mayo sauce. The calamari is perfectly fried...a nice delicate crust and super tender (not chewy). My only gripe is the '80s presentation with the mayo sauce drizzled all over like a Van Halen guitar, but fortunately the plating did not take anything away from the taste.

Rock'n Shrimp...5 stars. A generous pile of bite-sized shrimp served on a bed of chopped lettuce and a side of spicy mayo dressing. The shrimp are perfectly fried in a light batter and lightly seasoned, as well (a nice light crust and the shrimp were succulent). You can taste the horseradish or wasabi in the mayo sauce but I didn't care for it...the shrimp, by themselves, were just as good as they're already drizzled with two other sauces.

Dynamite Roll...5 stars. Small but tightly rolled sushi. One of the best looking dynamite rolls I've had the pleasure of trying...it's simple but perfectly presented.

California Roll...5 stars. As with the dynamite roll, it's small but tightly rolled. A nice portion of filling and evenly sliced. Just a well prepared roll."}
{"text":"Recently went here for dinner, really nice interior, I prefer it over the one in the NW, I don't feel claustrophobic!

The sushi quality and service was great - as now expected from Globefish. 

The only unfortunate things were that the shrimp tempura seemed mini-sized, I expected the same quality from Sushi as you get from some of the other cheaper places. Also.. I became deathly ill after eating here; however, my two friends had the exact same food and were fine.  

I can only provide 3 stars for now.. no worries, I'll be back to give it a second try."}
{"text":"The food was good but the service was rather grumpy. We ordered the beef tataki and was delightful. Our server seemed as though we were an inconvenience was not pleasant in any way. The sushi was well made and tasted great as well. Hopefully we will get a different server next time we go."}
{"text":"Craving black rice sushi today ... and could not help but stop into Globefish in Chinook Mall.  For basic sushi-fare, the black rice option is really fantastic.  Really really great.  

Circling back and re-experiencing an old favorite was definitely worth it."}
{"text":"My friend wanted to go out for Sushi, but we only had an hour or so to eat between commitments.   So she chose the Globefish because it was close to our second destination..  We were seated fairly quickly, although the person at the counter was very busy with take out orders and failed to mention there actually was a place to sit while waiting for our table.  The foyer got a little crowded with the take out customers and the waiting diners and the paying diners.  The decor is very simple,  almost plain.  It's a fairly bright place, the better to see your food.   And it is very fine food.

 We tried the octopus croquettes, which were suprisingly tender but tongue burning hot inside.  Each appetizer we tried was a new variation of delicious.

Our server was polite, classy and accomodating. He was able to split the bill for us when I realized that my AMEX was not accepted there. 

Globefish is noted for their very good Sake selection.   We chose a Junmai style of Sake, Indigo Wind.   Although only one small crockery cup of the sparkling beverage each came out of our 'bottle',  it was a lovely dry drink with a hint of wine more than rice in the flavour.

A word of caution.  Globefish is an intense  taste experience, with a variety of interesting offerings.  If you are looking for a large, filling meal, you'll spend quite a bit of money.  

Finally, it is a great place to people watch and the tables are close enough together that they could be chartiably be called 'intimately placed'.   But again, a caution,  if you were planning to discuss a sensitive issue over dinner,  don't do it at Globefish!"}
{"text":"The restaurant is a little on the small side, so maybe that's one of the reasons that they do not take reservations.  We waited for about 20 minutes for a table which wasn't bad.  However their restaurant is located next to the malls garbage compacters/pick up area... so you do have to live with the unpleasant smell while waiting for a table.  We did not notice the smell once sat at our table.  

The food was decent.  They do have a lot of rolls on the menu to cater to western tastes.  Their calamari roll was a bit small though (only 5 pieces if I remember correctly).  The sushi were not bad either, similar freshness to any other restaurant in Calgary.  Overall, it wasn't a spectacular dinning experience, but if you are at the mall and wants your Japanese food fix,  this is the place."}
{"text":"Definitely one of my favourite places to come for sushi. The Marda Loop location is not overly loud or crowded - fast service and the food is always great. I've never had to wait for a table, even on a weekend, where I've found I've always had to wait at the Kensington and Chinook locations (they don't take reservations)."}
{"text":"Spicy miso ramen was not spicy at all but surprisingly good.  Deluxe sashimi was fresh and liked that I got 2 fresh shrimps with it.
The only miss was the sushi burrito.  For $12, portion size was pretty small.  Would have prefer another ramen for the same price/
Service was efficient.  Restaurant was pretty full for a weeknight, though catering more towards a \"westernized\" version of Japanese food."}
{"text":"Sometimes... more often than not... I become completely lost in a sushi craving. Not just any sushi, either. As I live mostly in Vancouver throughout the year, I have grown accustomed to a certain standard of sushi. Globefish definitely is on-par with the variety, freshness, and deliciousness I'm used to from living on the coast. 

Although not necessarily obviously advertised, if you ask for brown rice, your wish will be granted. The service never disappoints and the food arrives sooo speedily! If you arrive famished, you will leave feeling perfectly full, as they feed you very well here. They're licensed, too, so you can grab a Sapporo or some Sake to accompany your meal.

Our family faves include gyoza, gomae, crispy yam roll, tuna tatake sushi, among many others. These however are our staple dishes ;) This is definitely our go-to sushi restaurant in Calgary! Whether you go to sit down or stop in to pick up some take-out, it's always been a great experience at Globefish."}
{"text":"Forewarning: this review should be considered in relation to the service only. I'd never had sushi before this trip, and haven't since so I have no frame of reference for the quality of the food, and I've come to decide that it's definitely not my food of choice, but for someone who knows what they're getting and is on better terms with the fare, it would likely be a far better experience.

From the moment we walked in, until we left, we were met by big smiles and speedy service. Everybody from the greeter at the door to the server to the guy who cleared our table at the end was an absolute treat.  They did seem minorly amused by my lack of experience with the things they were serving or how to go about eating it, but in a very friendly way.

The location itself is small, and I could see how, if it was really busy, this could be a problem, but when we were there it had a very intimate feel that was great for a date setting. My date was a big sushi eater and she seemed to enjoy everything we had, and assured me that for the ammount of food we got - a plate of dumpling-like appetizer things I can't remember how to spell or even pronounce, two platters of sushi and a pot of tea - the price we paid was very reasonable.

I feel strange writing a review of a place without having any way to know if the food would pass muster with a sushi eater or not, which is why I'm holding back the fifth star, but in every other respect this was a very positive experience."}
{"text":"*WHEN YOU FEEL LIKE BEING ADVENTUROUS*


Okay so I was craving Italian, specifically; East Side Mario's but to my dismay they no longer reside at Chinook Mall :(

So I decided on Globefish instead. My first impression: The place was clean, dark, and had 1 seater booths great for just 2 people. And the ambiance was 90's music & Spice Girls- odd choice for a Japanese themed restaurant. Our server was friendly ( I don't want to sound racist- but he's Italian) so all night my mind was wondering why he was there. Perhaps he's dating a fellow waitress? Or maybe he speaks the language an is a Japanese wannabe? Or perhaps he's an ex-East Side employee? 

The good news is he spoke English and was knowledgeable about the menu, he sweet talked us into the Potato Tempura (special of the day) and always had a smile on his face. For starters Globefish offers GLUTEN FREE soy!!! 

The out come:
Potato Tempura 4.5/5
Spicy Salmon 4.5/5 (too much sauce)
Dragon Roll 5/5
Dynamite Roll 5/5
Kappa Roll 5/5
Avocado Roll 5/5
Assorted Tempura 5/5
House salad with Salmon & Ebi 5/5
Yakitori Chicken 4/5 (Needs to be cut into smaller bite sizes)
 

Everything was delicious, I left full but happy! To me the whole experience was top notch!!!!"}
{"text":"My favourite thing about this Sushi chain restaurant is their selection of unique rolls. THey don't do the typical combo platters that most Sushi places feature, but have a very extensive list of rolls that have yet to let me down. Who knew Tuna, Salmon, and Avocado could make so many different dishes.

My measuring stick for a good sushi joint is always in the sashimi, and this place meets the mark. I've always really enjoyed it here and so that means everything else is decent.

They don't have the best hours, only open for lunch and then dinner, nothing in between, which I think is unfortunate. 

The decor is pretty plain, run of the mill. Nothing fancy here at all.

The one thing I don't like is how close your'e sitting to the people next to you. They are honestly part of your conversation. Not my style!

For convenient yummy sushi, this place usually wins my vote."}
{"text":"both times ive eaten hear it was bad. dark and dingy. try kensington. sad they have the same name"}
{"text":"It's an ok place for quick sushi. It's good. But this place is pricey and suuuuper small so it takes forever to get a table. Could be a bit cleaner."}
{"text":"I was so happy to have Ginza replaced by a globefish because Ginza was starting to really suck. The new globefish is small and the don't take reservations so the wait can be long on a busy night but I think it's worth it. I love the special rolls and if you go with a group of people and order a roll per person and share, than you get to try out most of them plus it's more than enough to eat. I like to have an appetizer too because they have such awesome food. The beef tataki is tasty and better than the tuna in my opinion. I barely eat beef so I was surprised by this as well as the fact that I love tuna. If you are on a budget and you go with friends, each order a roll and only have pop or tea it can cost less than twenty dollars a person for lots of food. I also find that their sashimi is very fresh and cut into appropriate sized pieces. The service was good the times I went which is a large change from Ginza also. Although globefish kept the good servers which made me happy because I enjoy visiting with some of them."}
{"text":"Good healthy alternative to junky fast food in a mall!"}
{"text":"Honestly I never write bad reviews. Not this bad anyways. I am vegan. I don't eat any animal products including eggs and dairy. No fish or meat of any kind. I explained what that meant and ordered two vegetable rolls and two avocado rolls along with adegashi tofu and miso soup for myself. Had a great meal until multiple people told me afterwords there is fish sauce in both the miso soup AND the adegashi tofu!! 

Think about how many vegans and vegetarians order BOTH of those. Tofu?! Why would you put fish sauce in there.

Heartbroken they didn't take me seriously."}
{"text":"I have mixed feelings about this location. I used to love Globefish (Chinook) - keywords: used to. It can ascend to the heavens into a blissful euphoria just as quickly as it can descend into a chaotic frenzy. It is one rollercoaster ride I don't want to ride on very often.

I find it is a hit-and-miss with seating arrangements and waiting times. The concierge used to accept phone numbers to call you when your table was ready; in this fashion, you were free to roam the mall. They no longer permit this option - they expect you to wait in that chicken coop of a waiting room. It feels like you're a farm animal crammed so tightly against your brethren, it's ridiculous. If you miss your name being called...you will never hear it again. I've had this happen to me on three separate occasions with different friends, and we were disgruntled and annoyed by the lack of customer service. I am surprised I behaved so patiently after we returned and finally got seated (after an hour and a half). I recommend attending during the weekdays and avoid Friday, Saturday and Sunday evening (I know, I know...blasphemous!). Thursday evening can be busy too, it depends. I am one of those crazy people that think it's never worth it to wait over an hour for food, no matter how delicious it is. I would only wait if it cured every disease known to man.

I find the food is quite delicious, although very expensive. The sashimi portions have improved since my last encounter, but is still a far cry from where it could be. Speaking of size, the restaurant interior is tiny - whether it is defined as cozy or cramped, it is in the eye of the beholder. I remember my friends and family feeling claustrophobic upon our arrival on some occasions.

The service is also a hit-and-miss. If you hit a green light, you receive friendly waitresses that execute quick service. If you hit a red light, you crash headfirst into an unfriendly, slow service. I find the latest trend is to be served by multiple waitresses, which is - not surprisingly - very ineffective. Food items leave the kitchen whenever they feel like it. I've had a couple of items missed completely. I remember one server being incredibly aloof and rude when this happened. I didn't give her a tip.

I may sound like a complete Scrooge in this review, but I don't like to be treated like a number or a statistic. I do return on occasion, simply because I do not have an outstanding favourite sushi place as of yet."}
{"text":"Teriable service,sushi rolls had so much rice on it and were not even rolled tight.
I would not come back to this place again.
Sho will always be the better place to go!"}
{"text":"Food, presentation, and quality are 5Star. I love sushi and have eaten at lots of sushi restaurants. This is in my top 2 and May even be the best based on above. If we add the ambiance and service it could be improved. Based on that I give it a 4star. Definitely a must have for sushi lover."}
{"text":"Note: I am not a \"sushi lover\", so keep that in mind as you read this.

Wow. What amazing sushi. This is the first sushi restaurant in my entire life where I actually look forward to coming back to.

I had the:
- Alberta Roll (in the event all the fish related eats were gross)
- Fried california roll
- Spicy tuna roll

The california roll was easily the best sushi I have ever had, and the spicy tuna a close second. 

I can't wait to go back.

It cost us about $70 for two people - but we did order a lot. I had a few Saporro as well."}
{"text":"Great menu. Huge selection. Almost makes ordering my dinner Mission Impossible! 

Ended up choosing the Vegetable Fantasy and the Mt. Fuji Roll. 

Veg Fantasy is something different. The avocado and asparagus and yam and the tomato and the special sauce makes it all so interesting. I don't love it but it was pleasant. 

But what will probably bring me back time and time again is the Mt. Fuji Roll. This is just too delicious. Avocado + Salmon + more avocado + smoked salmon + cream cheese topping = SUCCESS. 

Their Japanese green tea is very aromatic and flavourful. None of the watered down or cheap stuff. This is so pleasant. 

Overall ambiance is nice too. Good for going with family, friends, or on a dinner date."}
{"text":"I am a big fan of Globefish as one of the best Sushi options in Calgary (considering the price, quality, service, variety etc).
However the Chinook branch still has room for improvement... and it can be really packed since it's attached to Chinook mall."}
{"text":"As much as I loved this place I cannot accept it when they bring you the bill before you're done eating and before you ask for it !

It's like: \"pay and get out !\"
Rookie waitress mistake.

But apart from that, this Globefish is in a brilliant location in the heart of Mardaloop, and if you want to order take-out, call them in advance so when you get there your order is ready to pick up!"}
{"text":"This place was once a favourite for sushi and they had a lot to choose from and their dishes were really good especially their Calamari. However we went there again recently and the menu has changed and so has the quality of the food. The Calamari was terrible and so was the beef tataki and their sushi serving size is smaller. We asked if they had new management,  they said no but that they had combined a ramen restaurant with this sushi restaurant - which for some reason has impacted the quality of the food."}
{"text":"Two waitresses and a room full of customers. One was talking to a gentleman dining by himself for almost the whole time we were there for our food. And the poor other girl did her best. The rolls were the same from one to another. Couldn't taste variety even though that's what I ordered. I can't recommend this place at all."}
{"text":"Food Quality: 4/5
Kitchen Speed: 4/5
Parking: 5/5
Service: 5/5
Value: 3/5

Portions are good and the staff are friendly. Far better than the Sushi restaurant it replaced!"}
{"text":"I headed to the new Globefish location in Chinook Centre tonight for a friend's birthday dinner. I'm happy they already had the table when I got there, as there was a line at the front door of people waiting to be seated and not a lot of room in which for them to wait. 

The interior, in fact, isn't all that big. With a handful of booths and just as many tables, it's a cozy fit. But they do have a couple of large booths that can accommodate a group of 10-12 (we had 13 in our party and that was pushing it). Despite the size, the decor is lovely. White padded benches, light colours and flattering lighting made for a relaxing and inviting atmosphere.

The service was good, we had roll after roll coming out and were well taken care of. We even brought our own birthday cake that the servers brought out for us at the end (and provided a sparkler to boot).

Being that I was lucky number 13 in the party (and arrived a bit late after thinking the 'south' location was the Marda Loop location), I didn't get in on any of the pairs or groups of people who had ordered some rolls together. But I did order myself the Flames combo (Spicy California Roll, Spicy Tuna Roll & Spicy Salmon Roll). At $15.95, I had my fill of sushi and have some lunch for tomorrow :)."}
{"text":"I discovered this chain back when they first opened their first store in the ghetto SE called Chopsticks.  The 3 of them had just moved from Vancouver and opened up this little restaurant where I would of never imagined trying because of the location; but I was amazed with the pictures they advertised so I had to give it a try.  I quickly became one of their regulars and one of the perks were free dishes that the chef would create for us.  Their service was impeccable and very accommodating.  The Globefish in Kensington is extremely busy so it doesn't quite have the same affect as their original store but I'm glad that they're successful because their cooking truly came from the heart.  

I was excited to try their new location and even more so when I saw a menu with brand new dishes.  I love the selections as they are very different and doesn't serve the typical sushi dishes.  The theme was white and ambiance was enjoyable but the seat arrangements made the place look crammed which drowned the enticing decor.   The crimson tide roll was delicious.  The roll was lightly battered which wasn't overbearing giving it a soft texture and unique taste.  I wasn't so fond with the beef tataki because the ponzu sauce was weak and the beef they used wasn't top notch; although the chop scallop nigiri tasted very fresh and had just the right amount of mayo.  Our server didn't have the best service but the quality of the food made that insignificant.  Overall, I would definitely come back and try some more innovative creations that they have on the menu.  2 thumbs up!"}
{"text":"Place is SMALL! so be forewarned that you'll prob have to wait!
If i go i'll usually only order the following: sashimi lunch special, seaweed salad, takoyaki, tuna/salmon sashimi plate... and only a few of their rolls.

I have to admit that I only really want to go for their lunch and not dinner (though I have been to dinner), I'd choose elsewhere for dinner as I don't feel as though they have much variety - especially since I'm allergic to shrimp and seems like a lot of places these days just add shrimp to all their rolls!  There's just not much that interests me on the menu.

Service is not good. After the lunch rush you'd think we would be attentive but it was the opposite, they were busy on the other side of the room where there were no customers... how strange! and no one would come to our side where there were 3 tables occupied... we had to flag down wait staff for everything.... ummmph"}
{"text":"Excellent dishes and a good price. 
The service was much faster than I expected, the food very good and the atmosphere very pleasant. Will definitely be coming back."}
{"text":"Again still on the search for good sushi in Calgary.
I was quite disappointed with Globefish in Chinook - despite other reviews from fellow Yelper's.
Their menu is huge and they have a crazy amount of rolls to select from.  It get's quite overwhelming when they all seem the same.  
The rolls are tasty but sadly the sashimi didn't seem fresh and some frozen *sad face*
Sorry Globefish - won't return."}
{"text":"Part of a mini chain of 3 or 4 restaurants, the Globefish in Chinook Centre is a nice replacement for the prior sushi house that had middling food and decor at best.  Good for a decent sushi dinner, though I really wouldn't call it outstanding.  Still, some of their rolls are quite imaginative (especially the dragon), and the food is satisfying."}
{"text":"I've gone to all the Globefish locations, mostly this one in Chinook since it is close to me. My experiences have been good.

I do think it is expensive. So one star off for value. But the customer service I received here the last time I went was very good. She let us talk in the booth. It was comfortable and she kept refilling our green tea.

During this visit the miso soup was too salty. We mentioned it to our server and she took it back no problem.

Cat's-eye was described in the menu as salmon, prone tempura and avocado encrusted in flaky Panko. It's topped with chunks of spicy tuna sashimi and garnished with tobiko and green onion. It looked gorgeous and it tasted amazing.

For good sushi I will return to Globefish."}
{"text":"Review #14 for Yelp's 30 Day Challenge 2012

I've been here twice now for dinner, we usually go before seeing a movie at Chinook. Luckily it wasn't too busy on Tuesday night and we got a table after a 10 minute wait. 

We were seated and they came to take our order shortly after.  I mentioned we had a movie in an hour and the waitress said ok. 

Our food came really quickly which was nice.  We had seaweed salad (no tobiko, the little orange eggs), veggie tempura, vegetable fantasy roll, yam roll and my bf ordered 2 other rolls. 

1 special roll is definitely enough for 1 person, I couldn't finish my two even though the yam roll was smaller.  It's a little difficult to eat the yam roll as it's really thick and falls apart when you bit into it.  I wish they made it longer and thinner personally. 

Very happy they were efficient and it was just what we were looking for.  Things can get a little pricy and we usually end up paying $70 with tip for dinner with no drinks. But you can definitely do cheaper if you skip the fancy rolls. 

We'll be back. :)"}
{"text":"I finally found a place for fresh sushi in Calgary!!.. I really liked this place!.. I cannot give them less than 5 stars!!.. the service was very friendly and fast!.. even on a friday night with all the tables occupied!.. The sushi was very very fresh!!.. and all the dishes I tried  were delicious!!.. With a very beautiful presentation as a plus!!

The location is beautiful!.. and the ambience is great if you are in the chinook mall and do not want to go somewhere else and have a good food, this is an excellent option!!.. 

In addition, I found the place inexpensive..."}
{"text":"I go out for sushi at least once or twice a month and have tried many places in the city. I'm rarely satisfied when leaving Globefish. I find their sushi falls apart and the rolls are cut very very thin. The quality does not match the price at all."}
{"text":"Sushi is always delicious and well made with great service. Best sushi I've had in Calgary"}
{"text":"Place is cool and trendy inside. (For Calgary anyway). I liked the decor and the music they had playing.

Parking was easy , off the street.

Service was good, our server was really friendly and cordial (weird for Calgary).

Went with my son, we had edamame and beef tataki and a couple rolls. 
One of the rolls (i dont remember their names) was the specialty of the chef and was delicious!. i remember it was top with bacon which i do not usually like but this roll was the bomb!.

My son ate everything also and expressed his satisfaction and it was great to see that because he really likes sushi.

Everything was very fresh and well prepared. They have a nice menu selection.
Might go back on my next trip."}
{"text":"We used to love stopping in for Sushi here on the way home but no longer. They have instituted a new menu that is filled with Ramen, overly sauced rolls, and nouveau fusion fare. I'm not sure how they can call themselves a sushi restaurant when they have almost no sushi on the menu."}
{"text":"Globefish is consistently just OK. They have a huge selection of rolls but I'm never wow'd by anything we order. Nothing has really stood out to me as my \"favourite\" or \"amazing\". 

The place is also really small so you're always going to have to expect some wait time. We'll go if we're at the mall and feeling like it but we won't go out of our way to come here."}
{"text":"I love love this place. This is where I go now since WA. S sushi closed down. 
On Jun 30 before Canada day I decided to take my mom n dad there to celebrate my dad's b day.  
We were all excited then the rain came pouring. 
We were eating our appetizer when the sewer backed up. I didn't know yet since I was facing away from the kitchen. My mom said it smells like sewer and we heard some screaming we thought that the kitchen had a small fire. We were the only customers in there at the time.
Not even a minute when the water start creeping and our food was not ready by all means. Our kind server suggested to have it packed. I was determined to eat there. 3rd world country that I came from...doesn't bother me to eat around sewer water....that's what I thought....
We brought it hope the dining experience to celebrate my dad's b day was short lived. I was very disappointed coz none of us enjoyed our DOLLAR tea each person...still got charged...I know it's not their fault however didn't get any kind of breaks. I feel bad that it happened to them they have to close down the whole night and we went there at 3pm. I gave them 3 stars coz it seems like they don't have contingency plan at place as well as how to make it up to the customer for cutting the dining experience....on top of which...later that night toilet was my BFF. ..."}
