{"text":"AMAZING! If you're planning on getting the usual McDonald's, Starbucks, etc for breakfast just stop and come here. You'll spend around the same and you'll get the BIGGEST most DELICIOUS breakfast burrito you've ever had. I was so impressed with the prices, sizes and qualities."}
{"text":"I wasn't pleased with this place, and there are definitely better Mexican restaurants around. First of all, the guy at the cash register didn't greet me or thank me after I placed my order. That's a big turn off for me. In fact, he looked half asleep or drugged out. The burrito I ordered was huge but not spectacular. It had more beans than meat and on the greasy side. It also had an unusual spice that I couldn't figure out. The rice was terrible--over cooked and dry as hell."}
{"text":"This restaurant has the best tacos hands down! The customer service is consistently exceptional. They for got one item from my order and the owner gave a free meal the next day. I offered to pay when I came in the next day to order my food and they insisted that I not. I've been eating here for the past 3 days. I haven't had good tacos since moving here from California and it's so refreshing to not only have great food but great positive people helping you out is the cherry on top. I'll prop be eating here everyday until I go broke. Which won't be anytime soon seeing as they have great prices. They also have a teriyaki restaurant inside as well with great food as well. It's very clean and well kept. I could go on and on but my tacos are ready (I'm here now lol). Stop in if you have a chance."}
{"text":"They are located right next to the gas station off 95 and Russell; their building is also where teriyaki madness is. 
It's a small and to the point menu -- tacos, burritos, TOTCHOS. 
They are tator tot nachos. It's a layer of tator tots, meat of choice (carnitas), sour cream, avocado, a sauce and cheese. I got rice and beans on the side. Totchos we're different but i enjoyed them. The rice and beans were average."}
{"text":"This had to be the greasiest food I ever purchased. When I got home my tortillas were soggy because they were literally sitting in a puddle of grease. They're also expensive . I will not return."}
{"text":"GoGo Tacos should be called Slow Go Tacos. It took 15 minutes to get my burrito bowl and I was the only person in there.  I have to say though that the food was good so that brought my one star to a 3 star rating."}
{"text":"This little shop (that shares a space with Teriyaki Madness) will serve you up some good tasting and very reasonably priced tacos. You'll likely enjoy their good food and friendly service.

I dropped by on a Monday evening to pick up a few tacos to try out. The location is a clean shared space with Teriyaki Madness. The service was quick and friendly. 

They have a good variety of dishes that I will probably return to try out."}
{"text":"Hands down one of the best taco joints in all of Vegas! The quality of meat and other ingredients is superior to any other place I've been too. The prices are fair and portions are generous. You can actually taste the difference, especially their queso - like no other queso I've had! 
Everything was super clean and the employees were welcoming and personable. Plus, these guys found their secret sauce: tater tots! I don't know what dark magic has been cast upon these taters, but they are the crispiest tots I have ever had. Napoleon would definitely ask for these tots, and they have kept me coming back 5 times this week. 

10/10 would recommend. 

Catch me there @ my lunch break."}
{"text":"Excellent tacos and now open 24/7! My only complaint is that they're a bit pricy but definitely good tacos. I'll try their burrito next.

Update: had their burrito, amazing!"}
{"text":"Carne Asada Tacos: meat was were very well seasoned and Guacamole was on point!  Prices are not bad either"}
{"text":"The food is outstanding and the service is GREAT!  Burritos are better the you could ever imagine. Oh and the TACOS are AMAZING. Fish tacos are the best I have ever had.  If you want something AMAZING try the Totchos bowls. Mind blow how good they are.  Think about Nachos but instead of chips.... Tater Tots.. you will come back over a d over for this AMAZING dish."}
{"text":"TOTCHO TUESDAY!!! Nothing says comfort food like a bed of crispy, crunchy golden tater tots smothered in spicy queso, sour cream, fresh guacamole and savory carne asada!!! I love having lunch here!!! The TOTCHOS have NO EQUAL, and are clearly what sets GoGo Tacos apart from everyone else! I highly recommend adding tots to any order!"}
{"text":"The food was under cooked and tasted horrible. Then the cashier did know what was on the menu and she was very rude when I asked a question. The food was over priced"}
{"text":"I was pretty excited to try this place after reading the two other reviews and I totally did get the tater tots and they were amazing. I did order some chicken rolled tacos as well and got home and realized they were regular chicken tacos.. got charged for regular tacos too. I'd like to give this place 5 stars cuz the tater tot nachos are genius but my chicken tacos were boring, I ate the chicken by itself and it had no flavor,  luckily I got 2 of the tiny things of salsa so I could add some kind of flavor.

The space is clean and it's shared with another restaurant and a nice atmosphere."}
{"text":"The food is amazingly taste wise but common, why tack on another .50 cents for asada when it specify let's me choose my protein?"}
{"text":"I would like to make a Public Service Announcement: 

GoGo Tacos has unprecedented tater tots and superior queso. I don't know if they are hand picking each insinuated potato, or climbing to the highest mountain peaks to obtain such fine goods, but what I can say is that GoGo's tater tots are a gift to the culinary world and foodies as a whole. 
My mouth has been tainted by excellence and cannot return to mediocrity, found among all other tater tots. 

When the 3 minute mile was broken, to which people said it was an unattainable goal, and even as men pushed themselves to the limits of human physiology and anatomy, it was finally conquered by Roger Bannister in 1954. People gasped with pure amazement and disbelief, that man could accomplish such epic feat.  However, these tots are no 3 minute mile. They have raised the bar to the unprecedented level equivocated to a 2 minute mile and has set the new golden standard for fried culinary endeavors as a whole. 

Thank you GoGo for your tots we do not deserve you"}
{"text":"So I needed something quick to eat, I saw this place a few weeks ago.  So I decided to go in and get a few tacos.  The girl was really nice.  She greeted me, and everyone else with a nice hello as soon as you walked in.  I ended up ordering a plate, it was only a couple of dollars more than just the tacos.   I also got the hot taco sauce.  The tacos were good, but the rice and beans were different (in a good way)  I'm use to other chains around town.  They all taste the same.  But the rice and beans here taste different, and better.  
My husband loves tacos.  After I showed him the pic.  He's now ready to go and check them out."}
{"text":"I had driven by this place before it open, I had gone to am/pm. I waited to see reviews, before going to eat here. I saw how good the reviews were and the pictures looked great. I knew I needed to try it. I finally made it. I was greeted as soon as I opened the door. Very nice and the restaurant was very clean, They share the space with Teriyaki madness. So I proceed to the counter and place my order. Everyone on here raved about the totchos bowl, so I knew I need to try it. I love rolled tacos so that was a must. I also got I carnitas taco and corn cup (elote). I then went next door to get a drink and so the cashier I would be right back. I returned and he was already walk towards me with the bag of food. I thank him and went home. I started with the totchos with carne asada and was instantly impressed. After several bites I knew I need to stop, so I had room to try the other Items. Next up was the rolled tacos/flautas I was expecting corn tortillas and instead it was flour. good, but not my favorite. Next was the elote, not for me. Finally I tried the carnitas taco and that was great. So much food I had lunch the next day!  I loved the flavor of the meats and the quality of the ingredients. I will definitely be back for more!!  Keep up the good work."}
{"text":"New restaurant Gogo Tacos opened up by work. I really have enjoyed the Cane Asada tacos. Small taqueria style corn tortillas, but so flavorful. They dip them o.g style and these Asada tacos are on point. It's the only thing I can review since I eat the same thing lol every time. They have tacos , burritos , quesadillas and other creations. Staff is great. The owner is there and super cool. This spot shares a dining room with Teriyaki Madness so you can't go wrong with either ! get to Gogo and enjoy their Carne Asada tacos."}
{"text":"This newly opened Taco joint that shares their dining area with a Teriyaki Madness is doing it right...

Gogo Service: Huge menu board that makes ordering easy and fast.  The service is friendly and you get your food quickly which I appreciate because of my allergy to lines. 

My Go To all stars: The Totchos bowl (#10 on the menu) which is like a tater tots nachos is fantastic.  Very creative and one of my new favorite cheat meal orders. The queso, their in-house sauce and the high quality ingredients really brings this home.  The rolled tacos are tasty. Very filling and amazing value at the price.  Great to eat on the go with their rolled bodies.   Their in-house sauce goes well with everything and is addicting for me like Ranch dressing, Caine's sauce, etc. 

Ambiance:  The casual open dining area is shared with the Teriyaki Madness and there's plenty of dining spaces available.  The Flat Screen TV is strategically placed so it can be seen by all dining areas.  I personally like eating the street tacos immediately off the grill versus taking home.

With the size portions of the orders, quality and freshness of the ingredients, you're definitely coming out ahead with their prices.  Great value.  The Totchos bowl and the rolled tacos are really something you need to try sooner versus later.  They make me find excuses to stop by Gogo's so I can pick some up. =)  I'm looking forward to trying the burritos, but that's another Yelp tale.  Enjoy!"}
{"text":"We were looking for real home made Mexican style Horchata and we found it. Fast! Fresh! Delicious!"}
{"text":"I have been here twice. I love GoGo tacos. I had their tater tots, their 3 taco meal and just 3 tacos without the meal and rolled chicken tacos. Everything is really yummy. Get past the part where you're eating by an AM/PM and just get some good munchies at GoGo's Tacos."}
{"text":"Omg the rolled taquitos also known as flautas are so bomb made out of flower tortilla soft and perfect crunch with real quac and cheese I also tried the tacos asada,carnitas and barbacoa and they were all great actually bomb the taco tortillas are fried perfectly in oil like the type u make at home fried tortilla and it's soft and perfect crunch the salsas are to die for the only thing I didn't really enjoy was the rice it needs something lol but other than that amazing !!!"}
{"text":"The tacos here are so good. The prices are pretty ok. I ordered two beef tacos and one chicken taco. They were both sooo good. The beef was perfectly seasoned and the chicken was very yummy it was cooked just right, not too dry and not bland at all. You can have the options of Hot, Medium, and Mild salsa on the tacos. I got the mild. It was very good and fresh. OH, also my order was taking a little while but the server brought me chips and salsa so that was nice. It's 24hr so that's a great bonus for late night munchies."}
{"text":"I'm here right now, but they're not open. I don't know if they're fully closed, no longer 24/7, or something else. Bummer. There's not a lot of food open this late in this part of town, so it was disappointing to drive here."}
{"text":"Nastiest overpriced tacos/burritos I ever had. Close this place down ASAP. I never leave a negative review but this place is bullsh*t. Never again!"}
{"text":"I don't know if there's a difference in the cooks because I'm usually hear during graveyard. Although today I just happened to have the most salty tacos I've ever had from gogos. There usually great, I thought I had personally over salted it my self because I had added lime and salt prior to taking a bite. Tried the taco next to it that I had not prepped and it was just as salty without me adding salt. Couldn't even finish my plate without I couldn't cover up the overwhelming salt taste."}
{"text":"I gave the place a shot twice and it was twice too many. The first time I had the carne asada totchos. First, ground beef doesn't qualify as asada. Second, over salting food does nothing for the terrible flavor. Too many toppings with little flavor on this dish. I threw away the majority of the food it was so gross. The second visit, I ordered carne asada tacos with beans and rice. This was more disappointing than my first visit. The tacos were bland and the rice and beans were inedible. Once again I threw away almost the entire meal. I will never be back!"}
{"text":"Stupid says 24 hour for the window and has a open now sign next to the gas station but the hours here say 8-10. I still give it some starts cause their breakfast burritos are great but really really greasy. They need to learn to turn off third signs."}
{"text":"First time here it's open24 hours which I really like because it's works great with my schedule not much open at 5 in the morning , very clean and well kept , fairly new. And they have a side window you can order from I like that. Because it makes me fee like I'm eating from a lunchera in l.a mmmm. The lengua they have ( cow tongue ) is so good hard to come by good lengua now and days. We also got the loaded toys they have cheese sour cream salsa avacado an Amy choose or protein \" any meat \"  I got lengua so amazing.  The fish taco was so so good love it , the barbacoa, and asada were both cooked very well overall the food has amazing flavor an he dishes are hands down worth a shot. 
They even have a rewards program which a lot of fast food restaurants don't care to offer anymore , so high five to gogo tacos, I highly recommend this place for future reference is your craving Mexican street tacos or burritos down the loaded tots I will be back for sure. All and all very clean amazing customer service so polite , they let us sample before we ordered , very quick. Love gogos tacos I'll be back soon"}
{"text":"It is faster food taco.
Love that they use tots in the breakfast burritos.
They have tatchos which are awesome.
Food is fresh and delicious.
Staff is super friendly."}
{"text":"I can honestly say this place is OK. The customer service is good however the food (the meat) is extremely salty!!!! I order a burrito and can hardly finish it because of the extreme salt intake. I would go back but may have to tell them LIGHTT ON THE SALT."}
{"text":"The name made me think of quick simple tacos made for the hurried traveler. Oh boy, I was never farther from the truth. The tacos are street taco style and made to order. After ordering just one carne asada taco just to see what I was dealing with, I went back and ordered three more and a Tacho Bowl. The bowl is beyond description mouthwatering delicious. This take on nachos with tatter tots as a replacement for the chips I'd diabolically genius. While it may be a while before I eat anything again due to the large portion in the bowl, I will be back on a weekly bases. The place is new and spotless clean. The young lady behind the counter was pleasant and helpful as well. Overall it was great food, great service, and reasonable pricing."}
{"text":"I went there because I heard about the tacos.  I got there and was standing in a line of 9 people.  Everyone of the 9 peoples in front of me ordered fking tater totchos.  So \"monkey see monkey do\" I went all in and ordered a large totchos.  It was a big fking mistake.  They topped it with carne asada and cheese.  I've been beck 7 times since Christmas.  I can't stay away from the dammed tater totchos!!!  Don't do it.  Once you GoGo you won't be able to stop!!!"}
{"text":"This place is a godsend. It's on my way home from downtown Las Vegas, easy access off the freeway - AND open 24 hours! There have been many late nights when I wished for exactly what they have to offer.

I ordered that tater tot bowl with chicken and it was a flavor and texture bomb. So good! I inhaled half it on the way home and was too full for the two tacos I had also ordered.

Sonny boy had the tacos for breakfast and he said they were good (carne asada better than the carnitas in his opinion) but SPICY. Maybe I'll get the mild sauce when I go back. Ha!"}
{"text":"Awesome fish tacos crisp with a awesome chipotle cream very good guacamole is nice and fresh as well service was quick a and polite Easley in and out  taste taste taste"}
{"text":"I was so eager to try this place when I saw they were building it and I was not disappointed! Between my fiancé and I we probably tried everything on the menu, lol. The owners were both very pleasant when I met them. The bonus is this place is close to my home and it's nice to have somewhere to go other than Roberto's! It'll be hard to give this place up once I start my diet, LOL."}
{"text":"Always fresh, fast, and tastes great. Best fish tacos and great tortillas. Super friendly staff and discounts for repeat customers."}
