{"text":"I eat here once in awhile when I get the craving for American style buffet food. Food is better Friday thru Sunday but is still just ok. Give it a try."}
{"text":"My first time at Golden Corral and I was impressed. It was very busy (Sunday Evening at 6), but I wasn't waiting in line like a prisoner in the cafeteria. They'll cook your steak how you like it, but have plenty of steaks hot and ready if you want medium well or well done. This isn't the Ritz Carlton, but I was really surprised at the quality. I stick mostly to the American and Italian fare, and it hit the spot. My wife tried some of the Asian dishes and was pleasantly surprised as well. I was fresh off a few Mexican meals I'm rapid succession, so I stayed away from that area. However, I was again surprised by the variety of offerings I saw in that section. The desserts were also very good. I expected the crowd to be, for lack of a better term, trashy. However, considering how busy they were, everyone seemed polite and there weren't families of Honey Boo Boos pushing, shoving and screaming."}
{"text":"I do not care what others have written but I really like Golden Corral. Contrary to the other comments I found the servers to be polite and cooperative. The \"mommy\" American style food is tasty and a relief from the many Asian buffets that dominate in thePgh area. The price is great plus the buffet cannot be too bad since the place is usually crowded"}
{"text":"Well I came here 2 years ago and I didn't like it. Yesterday I came again and I found a little bit better. My kids love it. It has wide variety of food with unlimited drink refill. I just like the wings and the steak."}
{"text":"GROSS, YUCK,  BLAH,  *BARF*. DO NOT COME HERE!!!!!! We came here expecting a fun family dinner, it was not fun, it was disgusting. None of the food was good, it was cold, salty, and my dad's steak was very undercooked, he was lucky he didn't get food poisoning. The chocolate fountains are a mess with chocolate spilled everywhere and not to mention the unsupervised children dipping their fingers in it. But back to the whole food thing.... Afterwards we all walked out disgusted and unimpressed. The next day I threw up a few times and couldn't eat. This place should be shut down."}
{"text":"Not too bad for what you pay for. I don't go here often but when I want a cheap lunch option this one is not too bad. I would be wary of the salad meat, it did not look very good. My husband said it was rubbery and seemed like it must have been pre-packaged. Still, good for something quick and comphresenive for everyone."}
{"text":"My first experience of this restaurant was not as bad as some reviews I saw, perhaps because it's a weekday early evening. The restaurant was not very loud or crowded. The food was not top class but for 11.99 all you can eat dinner you really can't ask much more. They did have a wide range of food choices and the atmosphere was not bad for its price tag. The waiter was nice. While he's a bit slow, I saw him clean tables very carefully so I know cleanness is something they care. Some people may hate it that they use plastic bowls and plates but I don't have a problem with that. The only thing you must beware is the deserts (many of them are not good). Overall speaking I'm satisfied with this place. You can get a full belly without spending a lot of money."}
{"text":"Ah yes. A fat man's heaven. The trough. We've been here a few times before. Its always alright. Nothing special but nothing awful. We probably won't be going back again, though. The food's okay but there's better places to get your grub on for the price.  They got all the goodies. Fried things. A salad bar. Various prepped salads (macaroni, tuna, potato, etc). There's several soups. A nacho station. A dessert station. Their claim to fame is this big grille in the middle where you can get all you can eat steak. I think its sirloin tip. Its fairly tough but its unlimited. Its also hard to get it cooked right unless you like it raw or burnt. There's a variety of sides from baked potatoes to mac and cheese to collard greens and brussel sprouts. There's pizza and bread and fried chicken and pot roast and ham. Depending on the day of the week and the season, they have different items.  I dunno..we just weren't terribly impressed this time. I mean, we didn't have like unreasonably high expectations from a Golden Corral but neither of us really enjoyed it that much this time. Ironically enough, I was able to get my steak medium rare this time.  If you're a big fat big and don't really care about the quality of the food you're shoving into your face, this is the place to go to. Maybe they were just having a bad day this time but we're not going back."}
{"text":"Everything was good about this location but I'm giving four stars because I found a hair in the taco meet. Our waitress Nika was so great and nice we loved her!"}
{"text":"This place was pretty bad. For 15$, we got to fill our plates from an assortment of terribly prepared foods. There is also the option to have a freshly grilled steak or other meat product. I asked for a medium well piece and was given a rare steak. At least the second time \"Sir\" (as his name tag said) got it right. The steak and rolls were basically the only good thing, because everything else tasted almost exactly the same - bland, cheap, and nowhere near worth what I paid. Even the drinks were bad. This restaurant provided terrible products at a terrible price, and I can't even believe that people still come here in large groups.   Stay away, even McDonald's beats this place."}
{"text":"The experience here will depend very much on the time and day you visit.  Friday and Saturday nights should be avoided AT ALL COSTS!  Those are the nights when every ghetto trash dirtbag and their ill-behaved children show up in droves.  I know people who worked there and they absolutely hated working weekends because all the slobs show up and no one tips.  Weekday lunches and maybe dinners are the best times to go.  Show up at 330, you'll pay the lunch price and get dinner items at 4. I think the fried chicken here is the best I've tasted, the steak is not so great, although you'd think it was Filet Mignon the way people on the weekends clamor for it like pigs at a trough.  I like this place when I want to pig out, we call it the Gorgen' Corral, but it must be avoided during busy times.  The staff simply cannot keep up with the demand of the hungry natives and keep the place clean and presentable when crowded."}
{"text":"First thing when we walked in we had never been there before so we waited for someone to come to the front.  Told her our drinks. Paid the bill. And she walked away so we thought we were supposed to follow her.  But she went into the kitchen.  We stood there for a good 5 minutes waiting for someone to help us out. Then she spots us from the kitchen and yells \"sit wherever\" so we did. The waitress was super nice. (Her name was vanessa and she has dark hair) on to the food. It was okay not the best but it was good. The guy at the steaks area asked me every time I was within a couple feet of him if I wanted steak. Lol. Deserts were awesome. I was like a child when it came to the chocolate fountain   overall the experience was great. Id definetly go back."}
{"text":"Is it a requirement to smell like urine and be over the age of 65 with no taste buds to eat at this establishment? Cause, that appears to be the case of you do decide to venture in for a bite or two. The service is great. No complaints there but the food is NOT edible! My whole family is nauseated right now. I hope this isn't food poisoning. :("}
{"text":"Eh.  I'm one of those people who say that they both love and hate Golden Corral.  I like the variety of food, and the quality is better than Ponderosa and Old Country Buffet.  The service is questionable. You'll either get an excellent server or a lousy one.  I used to wait tables, and people stiffing me on a tip always ticked me off, but I have actually walked out without leaving a tip because the service was so bad.  Being busy is one thing, but when I see you hiding in a corner bull crapping with other employees when people need refills, dishes cleared, ect,  that's a whole other story.  The dessert station, especially when it's really busy should be avoided.  They don't clean it or stock it.  We sat right by the desserts the one time, and saw several unattended children sticking there hands where they shouldn't have gone.  And being someone who has worked in the industry, you tend to take notice of some things.  One thing I noticed is that they seriously need to have servers at slow times wipe down tables, chairs and walls.  Very, very dirty.  As for the steaks, impossible to get one well done unless you stand there and wait forever.  They only seem to put half raw ones out for people to take."}
{"text":"Got a gift card so we tried this place out.  Lot of offerings, reminding me of school cafeteria during college days.  Long lines."}
{"text":"They charged me $19 per person for dinner...the advertised prime rib, shrimp, and smoked turkey....they had none of that! I left mad and pissed! False advertising at its finest!"}
{"text":"Ordered a steak and got the wrong one, kids sticking their fingers in chocolate fountain and when reported to the server, nothing was done"}
{"text":"I had to update since my last review.  I have been back here a few times in the past year and I have to say, it's a HUGE improvement from what it was a few years back.  The food is good, dining areas clean, and employees smiling.  So much better that I had to do the place right.  I'm not sure if there was a change in management or what, but hopefully they'll keep on doing what they are doing.  Glad to go back!"}
{"text":"This place isn't a restaurant, it's a circus.  We decided to eat here one day half as a joke and half because I was craving crappy buffet food. Well, the joke was on me.  This place is a mad house. Honestly, for such a low price the food isn't half bad, but the customers acted like a bunch of animals. I guess that's to be expected from a place that corrals you (get it?) from one feeding station to the next like a herd of cows, but still.  I never thought you could make Ponderosa look like a classy establishment but somehow Golden Corral does that."}
{"text":"What can I say, it's a Golden Corral. This one in Robinson seems way worse than the others I've been to. You will not be able to walk without bumping into at least five people on your way to the buffet tables. I don't want to sound rude, but if you are fat-phobic, don't go here. If you don't mind, then I'd still recommend passing it up.   I watched a kid drop a pair of tongs, look around, and then place it back on top of the biscuit plate. Most of the fruit looks like it came out of cans. The salad dressings are terrible (this is a Golden Corral thing not specific to this one).   The desserts, though seemingly endless, are very bad. Do not eat the desserts.   TL;DR It's a Golden Corral. Use common sense."}
{"text":"The pizza was the only thing that was edible. I'm not exaggerating when I say that the food is gross! The salad station was good but it picked over. Ponderosa is fine dinning compared to this place! Avoid if possible"}
{"text":"Almost two years since my first review, my opinion is still the same. The buffet food tasted good. The waitress brought drink refills. The price for lunch on a Saturday was $33 total for two people."}
{"text":"My family and I came to GC today around 3:30 pm (03/21/17). We were not caught in the stereotypical dinner traffic, but it had enough traffic.  Golden Corral is a smorgasbord of food. You have assorted salad makings, meats, potatoes, and desserts.  Nika was our waitress and she is a gem.  I saw some people complaining about overcooked food, but what do you expect when you put food under heat lamps?  Overall, I was pleased with today's visit and will be back again.  Review #201."}
{"text":"Don't be fooled by the rating on here. The food was very good. The staff always made sure me and my girlfriend were good on drinks and threw away our trash. Best buffet I've ever been too. The steak was very good and so were the fries,shrimp, and BBQ chicken. Highly recommend taking a look at the chocolate fountain. The desserts were amazing. I was very impressed and i will look forward to returning soon."}
{"text":"After an afternoon of dress shopping the bride treated me to dinner. Don't laugh, but I did not know that this is a buffet. The place was packed! People were bumping into each other, trying to dodge servers, and the place felt like it needed a bath. When I got up to the buffet and started at the salad bar I was horrified to see they had run out of plates! The one server let slip that the dishwasher had broken down. Lovely!  We had to use take out boxes to eat out of. There were people pushing and shoving to grab one of the few remaining clean forks. I had been smart enough to grab a handful for my table.  The food itself was just ok. The fresh brewed tea was the best part.  The mashed potatoes, though not exceptionally good, were made there (or so the sign read). Everything else just looked like food a toddler had just been playing with on their \"special cartoon plate\". The chocolate fountain is really neat. It would work better with fresher tasting goodies to dip into it though. The cherry macaroons I tried were sadly stale. The last thing I tried was the chocolate cake. It took 5 minutes to get one slice unstuck from the rest of the cake and all I could taste was icing.  Never again. I like buffet style dinning too."}
{"text":"I am not a petite woman by any means.  The ONLY item I truly enjoyed was the carrot-raisin slaw today.  What I certainly did NOT enjoy was the 4 little girls in front of us in line using the railings as gymnastics equipment, then later dipping items into the chocolate fountain, licking off the chocolate, then dipping the items again.  This happened both while they were unattended AND with their moms!  Staff saw this and did absolutely nothing about it.  There was NO pot roast, just a lot of veggies.  Practically every \"hot\" food...wasn't.  I really thought it was me, as I haven't been feeling great, but then I read other reviews.  It's not me.  Certainly the chocolate fountain incident wasn't me, at the very least.  Don't go, unless you're the type that sits patiently beside the dog dish until your pet shares his dinner with YOU."}
{"text":"I've been here on a few occasions, the food is always consistently well prepared, tasty and affordable. This is a place I bring mom to get her out of the house, she loves the pot roast, sweet potatoes, bread pudding and the salad bar. Buffets are dangerous for me, so I try to fill my plate with a trip to the salad bar and veggie station and attempt to remain seated instead of making a second, third, and fourth trip. Those rolls though! Light, buttery and oh so delicious. I could make a meal from just those! It's legal crack with honey butter. A piece of pie and coffee and it's out the door before I have to loosen my belt.   Love the grill station, chicken & steak, decent mac & cheese, baked potato bar with tons of toppings. The desert station is loaded with huge cookies, cakes, pies, and a chocolate fountain with lots of things to let that cascading liquid creaminess drip onto, like chucks of rice crispy & marshmallow squares, pound cake, strawberries & other goodies.   If you leave hungry it's your fault!"}
{"text":"Garbage, this place is a nut house. I havent been to a golden corral in 4 years. Came here today and i dont recall the food being so downhill. My biggest pet peeve aside from the food is food saftey..germs. So i waited for them to put fresh batches of food for every selection. And when they did they put the food grabbing tongs smack dab on top of the food..handle and all. I almost threw up on the kid dipping his hand in the chocolate fountain. And let me tell you about the staff...they must hire anyone. I simply went up with my gf to go get there watered down play ice cream..came back to my table and the waitress was clearing our table off...drinks, forks and all! I walked out. Joke was on me. Never again"}
{"text":"The golden corral has some good food and you can eat as much as you want. Also has some good desserts to eat."}
{"text":"It was great coming back to Pittsburgh and going to Golden Corral! It's been a while since I've been to an all-you-can-eat buffet. We decided to go to the location in Robinson because it's a bit cleaner. We came for lunch and the food had just been set out. Since it was the day after Memorial Day it wasn't that busy. Customer service was good. I had to closely inspect my plates and utensils as I found dried food particles stuck to them. Other than that it was a real treat to dine with family and observe how much food other people were putting on their plates and how many times they've been to the buffet."}
{"text":"This past weekend we had some visitors and needed a family-friendly restaurant that would please everyone's palate (including a 3-year-old) without breaking the bank. In these situations, look no further than Golden Corral. It has been years since I've last been to a Golden Corral, but I do recall a huge selection of food at the buffet. To my enjoyment that element of the restaurant remains the same, and we all left feeling like we ate our money's worth and then some!  It was tough to give 3 stars because I feel like this place deserves 3.5, but I'm not sure if it's quite a 4.  The buffet had so much food, and my only worry is the freshness when there is so much to choose from. All of what I ate looked fresh, and same goes for what I saw on everyone else's plates. It would've been nice to see some more healthy options, but I did enjoy what was at the salad bar. There were mashed potatoes, baked potatoes, sliced fried potatoes, red potatoes with cheese, a sweet potato casserole, and literally any form of potatoes you could think of. If the same creativity was put into some more healthy sides I would give GC 4 stars without a doubt.   As far as main dishes go, there were so many different meats to choose from that it would've been nothing shy of a carnivore's dream. Pulled pork, bourbon chicken, smoked turkey, ribs, fried chicken, BBQ chicken, fish, you name it, it was at the buffet. I'm not a red meat eater, so it was great to see this many options for proteins.  GC's staff was super friendly, but at times it was like our table was being double-teamed by the wait staff. We had 4 adults, 1 little one, and 1 newborn at the table but you would've thought it was a table of 10 the way we were waited on. This isn't the worst possible scenario, but it was a bit more attention than I'd prefer when trying to enjoy a meal.   For the $15 weekend buffet price, I can't complain about our experience. We left full and happy, and it was a great family-friendly atmosphere. With the freshness of the food in mind, I'd recommend Golden Corral as a great group dining choice. Until next time!"}
{"text":"This place is absolutely disgusting! I haven't been there in awhile and I went tonight and I now remember why I stopped going there. Food was so gross, nothing tasted good, too salty, tasted like it was all microwaved. Too many rude people, and mannerless kids, I watched a little girl pick up a brownie, put it on her plate then put it back. The 'waitress' was m.I.a the whole time, we actually had to go up to the front for drink refills, they said oh ur waitress does that. My boyfriend said oh Ya? What waitress? She didn't come over or start clearing off our table til we were about to leave. There as also a lady with a goatee sitting across from us staring at me...super weird. Now I'm laying in bed with a stomachache praying I don't have food poisoning."}
{"text":"First of all my mother does not like going to the Golden Corral.  My father drags here there often cause he LOVES eating at the Golden Corral.  He likes it because of the variety and reasonable price. My father even tough he loves eating here does get annoyed while going thru the line because this place hustles drinks.  My father gets a drink after he sits down.  It is annoying for the patron to have to balance drinks to a random table. They give a Senior Citizen discount.  To get the Senior Discount mom and dad just tell the Golden Corral workers that they are seniors.     He likes the broccoli and fried okra.  Yesterday he told mom not to get it on her plate because it was cold.  Mom the EXTREMELLY picky eater gets strawberries, salad with Blue Cheese dressing, and fish but it's much too salty.  Yesterday the waitress asked mom and dad how they were enjoying there meal.  Mom said it's good, but it's the fish is too salty,  and the waitress said: \" I'm glad your enjoying your meal.\"??? HELLO  Mom says many times when they sit down the table is sticky and they have to wait for someone to wipe it off.    On a different visit mom and dad were standing in line for the cook to take steak off the grill.  American cheese was near the steak that was being grilled.  It was there for the cook to add it to the steak as he grills if a patron wants it.  Also standing in line was a little boy and his mother.  The child reached for a piece of cheese while the cook was in the back, and the cheese was never intended for the patrons to reach and take and all the slices of cheese fell onto the floor and the child put all the dropped American cheese back up onto the tray.  When the cook returned my father told the cook to trash the cheese because the little boy had dropped all of it on the floor.  The cook threw all the cheese into the trash.  The little boy's mother also standing in line just laughed?  No wonder when these students get to school they are not ready to receive an education?  Yesterday mom tried dessert at the Golden Corral. Earlier mom says 3 little girls were at the chocolate fountain.  One of the little girls was twirling her rice crispy treat under the chocolate fountain and she kept twirling it, and twirling it until no more chocolate would stick.  Then she pulled the over chocolate covered rice crispy treat out licked it and stuck it back into the chocolate fountain. Later when mom went over to the rice crispy chocolate fountain and had to wait for 2 little boys to finish playing in the chocolate fountain for her to be close enough to reach the yellow cake.  She then she could get close enough  to reach for the cake that had been scored.  A patron also in line with her son noticed mom was having a hard time reaching for her cake.   The cake sits too far back for mom's petit arms to reach, so she told her son who was also waiting in line for cake and not one of the unattended children who were playing in the chocolate fountain to help mom reach the cake.  The nice little well attended boy obeyed his mother and helped mom with her cake.  Mom said when she got back to her table with her cake it tasted cheap although it was a beautifully decorated very colorful and round like a birthday cake.  Mom didn't even eat it because she didn't want to waste the calories.  My dad got the red velvet cake.  He usually gets a plate of chocolate chip cookies.  He does eat them all.    Mom says If she has to be dragged in here she prefers to go in the morning because it's not as crowded or noisy.  My dad too mom here when she was out if rehab and mom appreciates his taking her here even though mom had lost all if her appetite at that time.  I used to joke with her and say: \"Your in the 5 Grape A Day Diet\" cause that's all she used to eat there."}
{"text":"Pretty consistent for a Golden Corral. Lots of choices and very family friendly. Gotta love the \"Help yourself to happiness\" slogan.  Dinner Friday night included cut to order sirloin steak, turkey and ham. Only seafood was grilled fish. I always love the homemade mashed potatoes and yeast rolls. Taco meat is a bit salty and I wish they had hard shells. Baked potato (I think they have baked sweet potato too) is very good, especially if you raid the salad bar for real bacon bits.  Good service with drink refills and plate clearing. Friendly diverse crowd.  The Golden Corrals down in TX seem to be both bigger and better though."}
{"text":"Great food, one of the best buffets outside of Atlantic City or Las Vegas casinos. The only reason for 4 stars instead of 5 is the location. It is out in Robinson. A bit closer to downtown Pitt would be appreciated."}
{"text":"We just ate here and it was awesome expecially our waitress Nika she was very nice and helpful"}
{"text":"When it comes to buffets in da burgh, your choices are pretty limited to Asian, Asian, Asian, Indian and Asian. And the Asian buffets all range from ok, ok, ok, to bad. While the Indian is pretty 50/50 between really good, and 'meh'. So if you're in the mood to buffet out on something different, Golden Corral is pretty much the only other regular option.   Now, you have two Golden Corrals in the area to choose from, and for me, they're both way out in the burbs, so it comes down to a flip of the coin as to which one to trek to...Monroeville or Robinson. That flip of the coin is actually decided by who you want to be surrounded by as you eat. Ghetto, or Hillbillies. It can be a tough call. Undie butts, or trailer park escapees...choices, choices.  Since the flip of the coin usually takes us to Robinson, I'll focus there.  It's an inexpensive buffet. It's not brunch at the Grand Concourse. Some of the food items can be hit or miss, but for the most part, it's fine. I go here primarily for three things...fried chicken, fried shrimp and the steaks. When I'm craving those, I want LOTS of those, and all-you-can-eat covers that beautifully. I can't make decent fried chicken to save my life. It turns out ok, but I'm still trying to find that perfect batter and seasoning that I can make at home. Shrimp is freakin' expensive to buy fresh. At home I've got the steaks covered and down pat. So really I guess it's about the fried chicken and the fried shrimp. GC's fried chicken is awesome, as is the fried shrimp. Although there was the time they tried going all fancy with the coconut shrimp which threw me for a loop...  From this, they satiate the comfort food glutton in me. They also have 'healthier' options, like rotisserie chicken, pot roast, some variety of fish. Occasionally they try 'theme' nights, and you'll find five different flavors of wings.   They have a decent salad bar, soups, a taco station, and a variety of sides to load up your plate. I DO love the fried okra. Add that to my list too. The biggest disappointment to me is that they're Pepsi people...so brewed iced tea it is for me.  I will say, I gave up on the desserts. After a good stuffing, I've just never found any of their desserts to be tasty. They look pretty, but just don't hit the spot.  The lunch and dinner buffets are pretty much the same, only the prices are different. The food rarely seems much different. The breakfast buffet is kind of like Eat-n-Park on steroids. The quality level is about the same, but there's so much more to choose from. And the price is pretty low too.  As for 'service', you're really just getting a glorified 'busser' who refills your beverages and takes away your dirty plates. Some are nice, some are not. Usually they are personable and friendly.  The food quality is way above the Ponderosa's and Hoss' varieties, but as I said before, it's hardly 'fine dining'.   The benefit of the Robinson location is also one of the previously mentioned downfalls. Some of those Appalachians who are obvious regulars are a superb reminder that we only need to visit GC...occasionally. Some things are just MUCH better...in moderation.  On occasion, while taking in the indoor view...I have earnestly wondered...could there actually be a pick up truck full of goats in the parking lot?  But hey...think of it as the Duck Dynasty floor show..."}
{"text":"Easter with Family   We met about 16 family members for dinner at Golden Coral around 3:30.  Of course the place was packed and a line was out the door.  We were pleasantly surprised at how quickly we were seated.  We had 2 tables of 8.  The staff were all helpful and engaging and up for the holiday challenge.  The servers in our group worked together to make sure we had enough drinks, cleaned our used plates and were very attentive. The food was constantly replenished on the buffet and came out hot and fresh.  This was one of the best Golden Corral's I've visited.  Keep up the good work.  Thanks for making our family Easter Dinner a great experience.  We will return and highly recommend."}
{"text":"The food here is usually very good. Love their mash potatoes and dinner rolls! Lots of different foods to choose from."}
{"text":"This was my first experience with Golden Corral, and I was pleasantly surprised! I know they get a bad rap, but for less than $10 for all you can eat, it's not half bad. I came right as breakfast was transitioning to lunch, so I grabbed all the breakfast staples (eggs, hashbrowns, pancakes, french toast) and afterwards, headed straight to the endless sea of lunch entrees and desserts. I made more trips to the chocolate fountain than I am proud to admit. There were many vegetarian options available which is a big plus. I would've liked to see better soup options though. Overall, I thought the food quality was great for the price. Let the haters hate. Golden Corral, you just won my heart."}
