{"text":"Even though I've lived in the neighbourhood for many years, I just recently decided to check them out, and I was very pleasantly surprised. (And upset with myself that I hadn't given them a shot sooner!)

A substantial menu, especially considering the size of the operation.  (It's run entirely by a cute Cantonese couple.)  But, selection would not mean anything without the quality to back it up, and I'm pleased to say that this little takeout place that could holds its own against a quality full-scale restaurant!

So far I've tried their Sweet and Sour Pork Stir Fry, Beef with Chinese Vegetable (Boy Choy), Honey Garlic Spare Ribs, Beef/Chicken Shanghai Noodles, and Honey Garlic Beef.  I enjoyed everything, but I was most impressed with the Beef with Chinese Vegetables - I couldn't believe how tender and juicy the beef was!

The staff - the aforementioned Cantonese couple - were super friendly and fast with my orders as well.  Everything has always been ready in under 20 minutes and served up with a smile.  The food was packed up in reusable microwave-safe round plastic containers - a nice change from the usual styrofoam containers that most other takeout restos use.

There's not much to say about the decor, as it's just a takeout place. Two simple benches where you can wait for your order. But it's neat and clean inside, which (let's be honest) is saying something for any Chinese restaurant.

One little side plus - my girlfriend is allergic to eggs, nuts and seafood, making it very difficult for her to eat Chinese food, especially anything deep-fried or any noodle dishes.  I was extremely happy to discover that she had all of the dishes mentioned earlier and did not have ANY reaction at all!  Needless to say, we've found a new go-to spot for those Chinese takeout cravings.  It's too bad this place closes at 10:30, as I'm sure they'd have come in handy for those midnight hunger pangs!"}
{"text":"Wow what a waste of $16. Ordered the seafood pad thai I got two shrimps, that I spit out ( and I love shrimp) you can tell they were old, two muscles and three pieces of squid. The sauce was only Siarachi hot sauce. Just all around gross.....never again!!"}
{"text":"We ordered 12 spring rolls, chicken balls and 2 beef dishes...I can say I have never had spring rolls that I could wring the grease out, Bravo. I don't believe putting 12 spring rolls, and 6 chicken balls right from the fryer into a paper bag and nothing more, was the best idea. The only thing I can say is that the delivery guy is super quick cause the oil dripping from the bag was still super hot and almost burnt myself, A+ for him.

Will never be order from these guys again, unless I feel like getting 2nd degree burns on my next New Years."}
{"text":"Well I was really expecting a delicious meal but was greatly disappointed from the beginning. We were tourists had food delivered to our room. The man was polite. But as we got the food inside the bag the sauces had exploded all over our food and made everything wet and sticky. There was no utensils inside the bag for us to eat the dishes. We ordered egg rolls and got spring rolls instead. And they weren't that good. Tasty bad. I ordered ginger chicken and the breaded was so overcooked it was really hard. And chewy. And there was hardly any chicken. In them. I will say the food was hot. Bonus. And the sauce In the dish was good. But isn't that the easy part ??? I wasn't impressed."}
{"text":"Don't know why anyone said they could be pleased with this place. The initial phone call to pick up in person was RUDE. Sounded like the wife/owner was taking out her anger on lack of business on her customers. We only ordered because I was starving. Ordered a combination plate, chicken and vegetables. It's funny how they define 'vegetables' = huge, nasty chunks of onion. Makes up 90% of the main. The egg roll tastes like it was infused with old Chinese herbal medicine. The shrimp rolls tasted like fried bread. The chicken fried rice was my salvation. Sorry golden palace, never again."}
{"text":"I was very pleased to find Golden Palace through Yelp. To know that it's in my neighbourhood and it has such high reviews is reassuring. I was not disappointed. The order was ready for pick up exactly when they said it would be which is a great first impression.

We ordered the Dinner for 3 (A) and lemon chicken and we were stuffed before we even finished half of it. Everything was so delicious but I'll talk about two dishes inparticular. The beef with 7 vegetables was very delicious. It was not your standard beef and vegetables, it had a unique, dare I say, authentic flavour. I highly recommend it. The chicken chow mein also had a unique flavour that you probably won't find at any other Chinese restaurant. Again, highly recommended. To be honest I haven dived into the lemon chicken yet but I look forward to doing so. I also look forward to ordering from them in the future."}
