{"text":"Quick service, good food, would come back again.

I need to write more words or it won't let me post but I already said what I had to. Stupid yelp!"}
{"text":"Been past this place a bunch of times, it was freezing outside so we decided to dip in warm up and grab some food. The waitress (this middle aged woman with short bleach blonde hair) told us to sit wherever and brought over some menus. Almost immediately after giving us menus she demanded our drink order and when we said we weren't sure yet, she acted very indignant. I ordered a chicken burger, it has a low grade greasy spoon feel so I thought it was something that could be easily done. When my meal arrived, to my horror the microwaved-then-thrown-onto-the-grill-to-burn or left in the fryer for waaaaaaaayyyyy to long chicken burger was revolting. I took 2  bites and decided that was all I could stomach. I waited for her to come back so I could explain to her that it was inedible but she never returned. When it was time to leave, I told her that I could not eat the \"burger\" because of it being burnt and she said \"alright \"and came back with the check. She charged me for the freaking burger! when I went up to talk to her she immediately began berating me in front of the other customers, \" you ate half the burger and now you're just trying not to pay! I want you to pay and then get out!\"  (Two bites does not  half a burger make) 

Never in my life have I ever been to an establishment where they treat their customers with such disrespect.  Needless to say I will NEVER return and genuinely regret ever stepping into that place. To put it simply, AVOID AVOID AVOID this place!!!"}
{"text":"Our go-to greasy spoon for breakfast on the weekends. Large portions, quick friendly service. Reasonable prices.

They offer all the standard breakfast items. I usually go with Combo #2: three eggs with side potatoes (order them deep fried -tastes much better), ham, toast and two pancakes (we share for dessert). Comes with bottomless coffee, and a very small glass of OJ. 

I would not recommend the Eggs Benny; they drown it in hollandaise sauce which actually looks more like a big plop of whitish/grey mayonnaise. 

Their omelettes are humongous - you've been warned!

The decor is out-dated and quite worn out...but it has a great, low-key, friendly neighbourhood diner feel. I am always amused by one of the cranky chefs who likes to critique the serving staff. Bathroom seems clean. 

For what it's supposed be, all-in-all a great place for breakfast. They do offer lunch and dinner, although we've never tried it.

(Note: sign outside says \"Golden Diner\")"}
{"text":"Good greasy spoon, family run diner in the Garden District.  I had the Eggs Benny on smoked salmon.  Lots of no frills smoked salmon on the English muffins.  Hollandaise sauce was leagues better than Golden Griddle down the street.   The service team cared for my experience and were attentive to the needs of customers.  I'll be returning!"}
{"text":"This is my favourite brunch spot in Toronto, I come here every weekend. It might not be the best quality food you've ever had, but the portions are huge, and the price-performance ratio is unbeatable.

For breakfast, I'd recommend the omelette specials. I've had mixed experience with the lunch/dinner menu.

They also provide fast free WiFi."}
{"text":"Had a few good experiences there, then one day we went for lunch, and ordered falafel plates and they were beyond awful. Rice was mushy as though it had been frozen, potatoes were rubbery and tasted like they were days old. Then it got worse: a live insect crawled out of my wife's salad! I called over the waitress and I swear her exact words were \"oh that's just a salad bug, it could have come from anywhere.\"She didn't take the plate away or offer to bring us something else. Needless to say we did not finish our meals. They comp'd nothing, and offered nothing, not even an apology. 

First of all, if you have names for the type of insects people find in their food, your restaurant has a serious problem. Second, if a patron finds a live insect in anything they order, apologize profusely, take it away immediately, and don't make them pay for it. 

You could not pay me to eat at golden again."}
{"text":"Great little diner. Not the most attentive service but wasn't nagging either."}
{"text":"I come here once every month or two for breakfast. 

I like it for a local neighbourhood joint. I like how you have to go down a couple steps to the restaurant. It makes it seem like a secret bunker. The price is reasonable, the food is reasonable, the breakfast comes quickly, and if you order the 3 egg breakfasts, you get coffee AND and teensy tiny little orange juice.

Although the food doesn't blow you out of the water, for a greasy breakfast on a Tuesday morning, this is my go-to place."}
{"text":"This place is amazing! For 10 bucks you get a plateful of eggs, bacon, toast and coffee to boot! The owner is super friendly and considerate. This is the most substantial brunch I've had in Toronto and for a reasonable price."}
{"text":"NAME ALERT - GOLDEN DINER!

(\"Golden Greek\" is the corporate name, but the big sign out front reads \"Golden Diner\")

Had breakfast here on Monday with 3 friends.  The fresh coat of paint brightens this place up...'specially if you like lime green.

The breakfast special at 6.95 included 3 eggs, choice of meat, home fries, toast and JUICE.  (5.95 without meat.)  This is one of the few breakfast specials in TO that includes juice.  (The OJ was the cheap stuff...if you order a small or large glass outside of the special, it's a higher quality.)

The food was standard diner fare (average) though the home fries stood out.  Big potato-y chunks.  We all liked this version very much."}
{"text":"Greek family owned greasy spoon diner on Carlton St. which serves a much better breakfast than Golden Griddle. Tonight I decided to stop in for dinner. It was quiet here. I guess they do most of their business during breakfast & lunch. Dinner selection ranges from salads, sandwiches/ burgers, pasta, souvlaki and dinner specials. The chef salad was pretty standard and came with my chicken souvlaki on pita. The souvlaki chicken was moist & tender and surprisingly tasty. I kinda like that it was quiet during dinner time as I was eating.  The waitress was attentive but not hovering which I appreciated. I'll have to remember to drop in more often for dinner."}
{"text":"Above average hole in the wall diner. Giant giant portions. Had three eggs, toast hashbrowns, bacon and French toast for under $10. Great deal. Its also super speedy and they keep the coffee coming. Place doesn't look like it has changed since the 70s and there is nothing wrong with that. Drop your pretensions at the door and dig in."}
{"text":"This is my favourite breakfast place in Toronto. Extremely affordable prices, lovely and quick staff, and wonderful options. They definitely blow the competition away, and I love the family restaurant vibe. I used to frequent Cora's and Fran's, but after finding Golden Diner - I don't go anywhere else for breakfast."}
{"text":"Amazing service, Friendly environment, Great prices. I love having my breakfast here. Coffee is included in your breakfast so enjoy a couple of cups!"}
{"text":"Gus the owner makes the best Hollandaise sauce  I've ever had. If you wanna have some amazing Eggs Benedict, check out this place. I've travelled  to many places in the world, and know my Hollandaise! 
Right next to the Primrose Hotel, and downstairs, off the street. Old fashioned diner with charm."}
{"text":"Dimly lit, you really feel like you're in a basement. Cant read in this light.
this is a classic greasy spoon

Its a reliable diner, great for good breakfast platters that give a pleasant selection with a slice of fruit, tiny shooter glass of fresh orange juice
sausages are kinda gross, get the bacon or the ham
potatoes are always a bit of a bland undercooked mush, so I just sorta take a few dents out of them and leave em. Ive never eaten here not for breakfast. 
Good service"}
{"text":"I like Golden Diner so much... I love the food, the atmosphere is kind of hidden cornerish, and I like that! 

The Food is good, Maria is hot, and all of the boys who work there are amazing with customer service and accuracy.  I love Maria on the telephone for take away, she always gets my requests perfect and makes sure everything we need to eat the food is in there. She is also environmentally conscious, because she always makes sure you need the cutlery and napkins, and that they will not go to waste... 

The Prices are low for the quality and quantity of the food, and the special is always awesome and ever changing... never something that sounds thrown together with left overs... Were Vegan, they have a lot of veg options that are not on the menu, ask...

Soup is decent, always hot... Only reason I didn't give it a 5, is because the fries need a vast improvement... Besides the fries, the place is amazing. 

:)"}
{"text":"This is that diner that in a half basement on Carleton, just West of Jarvis.  I've walked past it many times and seen it, and walked past the same area many times and not been able to find it.  It's weird that way, how you think you know where it is, and then it's not there.  Very Platform 9-3/4.

Let's assume you've found this place and decided to order their breakfast.  Chances are you'll feel a little let down.  The eggs are often a bit gross, and the potatoes are those soft, cubed, boiled potatoes that are always as unsatisfying as you think they're going to be with breakfast.

The staff isn't that great either.  I've found the service here to be slow, and occasionally very cold and distant, as though I, the patron, were invading their space.

The upside is that it's dirt cheap, but this is one of those you get what you pay for kind of deals."}
{"text":"There are not too many places where you are served by the owner, who is always very nice. He even gave our three year old daughter free pancakes with fruit, which she loved, fluffy and barely brown just how she likes them.
Our breakfast combo was plentiful and also very good."}
{"text":"Waited a long time to have our order taken and then waited a long time for the meal to come.
Not once did anyone come over and tell us that it will be awhile for our meal and it wasn't that busy.
When we complained quietly they were loud and rude."}
{"text":"In recent times I have tried both the gyro pita and the gyro dinner.  Both come with large portions, but I'm more a fan of the gyro pita.

The gyro dinner is a large plate of rice, potatoes and greek salad salad with a stack of gyro meat on top.  While it's delicious, I prefer having the pita.  It's just too much food with the potatoes AND rice in my opinion.  

The gyro pita is a delicious packed pita with the regular fixings (tomato, onion, tzatziki and gyro meat).  For an extra few bucks you can add fries, or my favorite...chef salad (i.e. greek salad loaded with feta)

I often get take out as it's right near my house.  I call ahead, and can leave right away and my food is ready when I get there.  Fast, friendly service."}
{"text":"I only eat here when I'm hungover.  Just a no bullshit, greasy Greek diner with big portions of hangover food for cheap.

The Super Breakfast ($15) has:
 - 3 eggs
 - sausages
 - bacon
 - ham
 - peameal bacon (ALL of the meat options - not 'pick one')
 - pancake
 - home fries

For some inexplicable reason - the Super Breakfast ALSO comes with:
 - shrimps
 - scallops

I don't know why it comes with seafood - but it does.  The last time I went - it also came with a slice of watermelon and orange and some grapes... all on a Chinese plate.

If you don't love the portions, you must at least love the randomness.

Super Breakfast - the breakfast of fat bastards!"}
{"text":"Don't confuse this place with the horrible Golden Griddle down the street.  This one is an unpretentious little diner in the basement of a building largely occupied by a gay sauna.  The pancakes are standouts here - they make them really well.   Other diner and breakfast food is good quality though not amazing.  Prices are quite cheap.  Down to earth service, generally very friendly."}
{"text":"Another gem in the College area! You cannot beat the price and taste of the classic breakfast anywhere in Toronto! The food is fresh, made quick, and tasty. The atmosphere has old school bar stools and booths surrounded with bright green walls."}
{"text":"I've lived 2 blocks away from here for 20 years and have always avoided going in. It looks like such a dive from the outside. But I finally went the other day, because I waned to try something different. I was surprised! Big big portion, great pice. Fast service. I had a typical breakfast and was quite pleased. I spent $10 including tip. I usually go to Cora, down the street. There, I regularly spend $20. So...I saved $10!! Not bad.

The potatoes were bland, but overall, it was most palatable.  I'll definitely go back."}
{"text":"Such a nice down home diner. You get soooooo much food. The only negative was that the wait for the check took a good bit."}
{"text":"Went for a late lunch on Tuesday.... Located on the south side of Carlton, down a half dozen steps from street-level.... dark and old.... Seated in a booth, cushions were old enough that I sank into the seat.... Ordered the Haddock and Chips w/ Side of Soup ( Green Pea with Ham )... My lunch partner got the Liver with mashed potatoes and mixed vegetables.... Food served promptly.... Haddock was cooked well and fries were crispy.... Liver was cooked properly and was tender.... Looked at dessert menu only to be turned off by the extremely high priced pieces of pie and cake @ $7.99 a slice....Not sure if I enjoyed the food enough to return but just the same nothing wrong with the meal either...."}
{"text":"True definition of a hole in the wall diner. Amazing deal on their halibut fish and chips which comes with a huge Greek salad that is 75% feta cheese (yum). The breakfast is a hit and miss though, barely cooked hash browns but large portions. Service can be a bit strange at times, cashier will demand that you tip even before you pull out your wallet to pay."}
{"text":"Never ever ever will step in to this place again. 

I've been going to this place for years. I've always found the food good, the place definitely not visually appealing but clean and you used to be able to count on the food quality.
I ordered eggs over easy and got eggs over medium. When I pointed this out to the server she was apathetic, shrugged her shoulders and said \"you should have said something sooner\". I informed her that I would have had anyone come over. I had been trying to get the attention of the wait staff for some time.
I never received any water. When I asked if she had told the cook she informed me they apparently had a shift change which meant there was nothing they could do about my eggs.
I let her know that I would not be coming back. The bacon was rancid. The eggs were hard and when I spoke with the cook he also could have cared less and pretty much said the same thing as in it's everyone else's fault including mine that I didn't receive eggs over easy.
I would recommend you stay far far away from this place as it has gone down hill. Check out the place on the corner especially if you're really hungry (Daybreak?) they give you pancakes with everything you order AND they're really nice unlike the Golden Diner.

Because this was the first time that I had gotten sub par food here I might have given them one more star but the whole being mean to a customer attitude I got from the server (can't miss her bad bleach job) and the cook just doesn't go over well.

Oh yes and not only did they not offer to replace anything they tried to charge me for the breakfast. I refused and paid only for the coffee and home fries. Disgusting food disgusting behaviour."}
