{"text":"Food and service is alright. Weekday eat-in dim sum for $2.80 is definitely worth it here.   TIP: order on their website for takeout and get 10% off (non dimsum dishes and non seafood)"}
{"text":"Came here on a Sunday afternoon around 1630 with my husband. There was no one else in the restaurant yet we were treated poorly. We had asked for water and plates for our food numerous times. When we finally received our 1 plate and 1 fork they were dirty. So I ended up using the small plate the table was set up with.   We ordered crab corn soup, beef with oyster sauce, shrimp fried rice and spicy squid. They were average however the beef had a lot of salt.  If you can't find another chinese restaurant in the area I suggest just get take out from this place."}
{"text":"The food was OK for a place like this, but I deeply questions their business practice.  Here is what happened, we have a potluck in our office, and we've decided to order from here. The agreed on price was $30 both on their manual and through the phone. When I went to pick it up, guess what? the price suddenly changed to $45. Obviously these Chinese people knew we are in a hurry to get the food, essentially holding us hostage. Avoid this place or refuse to pay if they try to extort you."}
{"text":"Horrible, horrible service. Can't stress that enough. Went in on a week day when it wasn't busy for dim sum. No one greeted us at the door and we had to seat ourselves. The staff didn't acknowledge us, didn't look at us and didn't say a single word to us the entire time we were there. We ordered a couple items off the dim sum menu (I assume they only bring out the carts on the weekends when it's busy) and the food was nothing extraordinary, just the same bland generic dim sum you can get anywhere else in Mississauga. When we were ready to leave, we brought our bill to the cashier to pay up but because the service was so remarkably terrible we decided not to leave a tip. The person at the cashier had the gall to ask us if we forgot to tip and I replied \"no, the service was terrible\" and proceeded to leave the restaurant. He waved his hand in a dismissive gesture as if to tell us to get out. I was completely stunned, in utter disbelief. How the fudge is this restaurant able to survive for this long is beyond my comprehension. I will never step foot in this place ever again. Please stay away."}
{"text":"Amazing!!!  When you walk into a restaurant run by Cantonese and filled to the brim with Cantonese patrons, you know you've come to the right place for authentic and delicious dim sum.  We were impressed by the flavor and quality of the dishes.  Dishes were quite substantial for the price.  In fact, many favorites (like the Shumai) were considered small dishes (only $3!).  This is now my go to place for dim sum."}
{"text":"Overpriced menú and terrible food ,  the service is terrible and slow my wife ask for a glass of water that never came ,  among all the Chinese restaurant in Toronto this is the most rude and slow."}
{"text":"New owners=better food!   Get the duck.  DEEElicious.  Crispy skin, moist meat, good fat to meat ratio.  I'd say it's WAYYY better than Sam Woo.  However, Sam Woo has the upper hand on the Cha siu.    Considering it's much smaller than Emerald, be prepared for a long wait on the week-end for your dim sum fix."}
{"text":"Came here on a Saturday Afternoon with a large group of more that 15 people. I've definitely had better dim sum in Mississauga. Also considering the location of this restaurant (very close to the chinese heart of mississauga) I honestly would've expected a little better.   The service was your typical chinese service, the only good service we experienced was one of the ladies who was rolling the dimsum cart. Unlike the usually irresponsive cart rollers that you get, this one was especially attentive to our table and was always pleasant to deal with.   The food, it was \"okay\" bordering \"good\". A few things like the tripe, chinese vegetables, har gow, you could tell weren't very FRESH. They looked like they were sitting there for a while. Other items like Siu Mai, char siu bow and bean curd were good but I've definitely had better at Sam Woo, and Emerald. Overall I found that a lot of the stuff wasn't HOT like how the other restaurants serve them. One thing I DID like was there was a variety in dim sum and the variety was properly circulated so we weren't seeing a lot of the same thing. They need to focus on their quality.  The decor, again not having high expectations be cause its a chinese restaurant. But even if that, the decor was definitely lacking. Our chairs needed to be reupholstered as you could tell how many people have sat on it.   This is the third time restaurant has been changed so I'm not surprised at what we recieved. I would definitely not go again though."}
{"text":"Came here for dimsum on a Sunday afternoon with my dad. I've definitely had better...  I find that anytime an Asian person walks into an Asian restaurant, employees automatically think they can speak whatever language it is they're speaking....so of course they start speaking in Cantonese/Mandarin and there we are looking like a pair of deer in headlights! But we get seated quickly  and dimsum starts rolling around!   There weren't very many options and because they already have them on carts (which I know a lot of places do), it tends to get cold if no one wants it. We started with chicken wings aaaaand they were cold, boooo! Also there were a lot of fried stuff going around too....where's all the steamed stuff?!   Food overall was mediocre. Maybe I'll have to come back and try other items on their menu!"}
{"text":"Came here for dim sum on a Monday morning. Their dim sum is $2.90 per dish (S, M, L). Had the usual items like rice rolls, siu mai, glutinous rice wrapped in lotus leaf, etc. Overall the food was pretty good. None pretentious with things like buns in the shape of aliens or dumplings with bonito flakes. Will recommend here for the food and not the service, as you would expectedly find (or not find) in a Chinese restaurant."}
{"text":"Golden Fountain is the typical, generic, neighborhood Chinese restaurant. Nothing fancy, food is decent, tasty enough and portions are fairly generous and prices are not outrageous. The main caveat is the service. Never expected 5 or 4  star treatment but the servers were hard pressed to offer a smile and help with the menu is minimal. The attitude is indicative of \"I serve the food, don't ask too many questions & don't bother me unnecessarily\". The attitudes ruined my meal on the two occasions I was there, once for dinner & the other for dim sum. Maybe three time's the charm? By observation of the service throughout the restaurant, I doubt it. Will I return, I doubt it."}
{"text":"Pretty standard dim sum place. If you pay cash, it's 10% off, but it seems you need to be in the know about it - the waiter asked us if we were paying cash before we even sat down.   The place is busy, and it's nice to see the push cart system still in effect somewhere. The food is your usual fare - I couldn't find fault in any of their dim sum but none of it was stellar either. The service is decent (our pots were filled frequently), and all the food came out hot.   7 of us ate here for the low price of $9 per person, perfect for the wallet!"}
{"text":"This is a family favourite restaurant since we get 10% off the bill...my parents are regular VIPs.  The service is good and once the order is placed, stand back because the food begins to roll out quickly.  The meal was good for the most part although several dishes lacked a flavour punch tonight.  It began with soup and progressed through various selections supplemented with a very large bowl of white rice and wrapped up with a sweet red bean dessert soup.  (The sweet bean curd dessert is much better but they seldom offer this item; we asked and Nada again!)  We had a group of 11 people and collectively all scored this place and experience 4 stars.  Total bill was $157 cash plus tip.  The kids were amused by the newly installed seafood tanks!"}
{"text":"Best Custard buns I've had at a Dim sum. Attentative service,  and decent selection of food. I recommend going either really early or late afternoons to beat the wait times."}
{"text":"Must find good dim sum in Mississauga.... Golden Fountain hit the spot!  Came around 2pm for a late dim sum.  Dim sum to order was fresh and tasty.  Service is attentive.  Will try dinner next time for sure!"}
{"text":"Came here for Dim Sum with a party of 20 people. Come here for the food and um...thats pretty much about it. Service is horrible --- like most stereotypical dim sum places. We asked for water and the waiter literally rolled his eyes at us seeming bothered that we had the audacity to even ask for anything other than the default tea. Luckily our water came and we were satisfied.  The food comes on carts and in waves. Make sure you grab as much as you can while they come around because during lunch it is super busy and all the dishes are taken very quickly. The food itself is okay but nothing that you should really go out of your way for.  We had all the standard dishes of dim sum.. Hai gow, Siu Mai, shrimp crepes, ribs, bbq pork buns, and many more.  All of the dishes were a  good 3 out of 5.   Prices were decent...for our table of 20 it came out to $18 per person which was not bad at all."}
{"text":"Excellent Dim sum (and a wide variety too), good Cantonese food, excellent service where all waiters know your name (and remember what you like), a place where they will cook you something that is not even on the menu, what more could you ask for!!!"}
{"text":"Good dim sum. The dishes are quite filled where I find most other dim sum places to have less quantity. The rice noodle rolls were fantastic.. Good was hot. Service is like your average Chinese restaurant, I would come back for Dim Sum."}
{"text":"Came here on Sunday afternoon with a large group and expecting to have above average dim sum as the reviews seemed to be pretty good but it turned out to be the opposite...I was pretty disappointed!  SERVICE: We made reservations and were about 15 minutes late but they were still able to seat us, however, I think they saved a table for us that had chairs that seemed to be falling apart. I know you cant expect good service at a Chinese restaurant but I was pretty annoyed that when I asked one of the servers for water, he gave attitude and rolled his eyes with no response of course.. immediately this lost a star! We also had to order a separate veggie dish more than once because it took a while to receive the item.  FOOD: Pretty much the only good thing was that there's lots of variety! The dim sum comes out in carts and usually the trend is that if you order off the cart, the dim sum is not AS fresh BUT i'd have to say that most of the items were not fresh at all. The tripe was semi-warm and dry, the bbq pork bun was not piping hot like it should be, the shrimp rice roll and beef roll were cold and lacked flavour. I was also disgusted by the beef peppered short ribs as the pieces contained mostly fat. The only items that seemed to be decent were the har gow and sui mai which came at the end so we were lucky enough to get a fresh batch.  AMBIENCE: After being around since the time I lived in Mississauga more than 15 years ago, the restaurant at least looked nicely decorated and well maintained excluding some of the chairs.  Overall, I don't think i'll be coming back, I'd rather drive 5 minutes down the street and go to Sam Woo instead, pay the extra price and get fresh dim sum."}
{"text":"This place is wonderful and is my go to Chinese restaurant in Mississauga.  What sets them apart is the great service! They remember who you are and what you order.  After two times coming here, the waiter remembered who I was and my companion and was super friendly and attentive.  I love the fried cod with soy sauce. I also very much enjoy their barbecue items.  They also made us a fried chilli crab which was not on the menu.  On one snowy winter night, I inadvertently ordered delivery from this restaurant instead of the one close by me.  I didn't even know they had delivery! Even though it was snowing heavily, the food came surprisingly fast and remained hot and fresh.  I loved their shrimp in lobster sauce, it was made with actual large shrimp! I definitely recommend this place!"}
{"text":"I was looking for all day dim sum somewhere close to home and would certainly be happy to become a regular here next time I get that same craving. Food was as well done as any other dim sum place downtown and they have a weekday special between certain hours (I think it's between 2pm-4pm) where all items are one discounted price. Made our trip even better value."}
{"text":"I shall begin with the basics.  Plenty of parking, lots of seating and super fast service. A bit off on customer service but do they really care.  Lol.  I have been here for Dim Sum and regular eats. They have two Dim Sum happy hours everyday. Great deal for tasty Dims.    The Poods.  I found everything really delicious at GF.  This restaurant is more pricier than others for regular eats but I don't mind.  Yum is all that concerns me here.  Stay real Yelpers."}
{"text":"First time at Golden Foundation. Food was okay. Ordered Peking duck for $39, got the crispy skin cut from the duck, pancakes, shriveled cucumbers, brown speckled lettuce (didn't eat), and a plate of diced pork with water chestnuts, carrots and celery.  What happened to the rest of the duck with all the meat we asked the waitress, she said that's the 2 courses we get. We thunk the duck meat will be used for another dish. Shrimp with gai lan was quite good for $19. We're going to stick with Sam Woo down the street."}
{"text":"My family used to eat here regularly. However, we stopped going for 2 reasons.  We waited nearly 1 hour for a table - that's fine as it was busy but a large group arrived after us and clearly knew the owner and skipped the line.   The last straw came when we ordered our ha gow. It came with a cooked centipede. They apologized, brought us a new one and then still incorrectly charged us for the new one. We had to mention the centipede for them to remove that dish from the bill. Come to think of it, our whole meal should have been free as compensation!"}
{"text":"Saturday morning (ok lunch time)  noon Busy We were four and waited 20 minutes Worth the wait It is your typical dim sum spot w rolling carts and the usual food name calling The dishes were legit I wish I got to try the steamed pork tendons...it only shows up in the fall and winter....so have your eye for that dish if u like that kind of dish (ie it.s gooey like chicken feet)  I enjoyed this spot....even though it was rukus"}
{"text":"Been to this place quite a few times over the last couple months, due to moving. Mostly for dinner but once for lunch, as they had a lobster noodle special, which is half off from dinner price.  Didn't see many carts rolling around, but I think that is because we were there near the end of the rush.  Overall good food.  Service is typical of a cantonese restaurant.  Usually always someone around and friendly, but don't be shocked if you encounter one here and there that does not look or sound friendly lol."}
{"text":"The dim sum here is cheap and tasty. We had 8 people and paid $65 for a good brunch!"}
{"text":"Mississauga definately has slim pickings and I really mean slim pickings.  We have had a love/hate relationship with this place for YEARS but it still remains.    Ownership has changed several times and the new owner seems alright (though for whatever god known reason, they decided to keep the miserable wait staff from the previous owner).  Service is not the best and not the worst, mind you it could be much better.  I love how there is one waiter that stands dorment right by the front of the restaurant yet he doesnt' really help.  Tonight when they were clearing a table, this dude was curt with one of the staff \"move out, hurry up\".  Geez.    There is one waiter there that is indifferent though I'd say more along the sides of lazy.  This guy seems like an out dated piece of furniture that should have moved along with the last owner.  Dishes are decent but lacking in 'wok hay' if your into that sort of thing."}
{"text":"Ugh, I know dim sum is greasy and all, but I've never felt this bad after a meal.  The upside to everything is that it was cheap. Special pricing Monday to Friday 9:30-11:30 and  in the afternoon after lunch hours (2-4pm I believe).   What we ordered:  Har Gau - So bad. Soggy wrapper was stuck to the bottom, shrimp was tasteless. (1/5)  Scallop Dumpling - ditto ^ (1/5)  Shumai - Alright tasting, but the texture on the inside was so weird, a tad on the mushy side--I'm afraid it wasn't cooked all the way through. (2/5)  Taro Puff - Good. Very tasty, but served cold so we know it wasn't fresh. (3.5/5)  Dough Wrapped in Rice Roll - Good, but again it was served cold. (3.5/5)  Fried tofu with stuffed with minced shrimp - Tasteless and, you guessed it, cold. (1.5/5)  Radish cake - I don't think I've ever had radish cake this bad... (1/5)  Congee, Pork and Century Egg - Decent, though there were barely any century egg (3/5)  Meat Roll in Bean Curd Sheet - Yummy! And warm! (4/5)  Steam Custard Bun - The best thing we had. Would come back only for this! (5/5)"}
{"text":"Taste of food 4/5   Taste was good for most dim sum we ate. Customer service 1   Lack of communication Quick service for food Mixed up in food orders- no apologies provided even if we helped them to understand that those weren't our orders. Finally they got our correct dim sum paper."}
{"text":"This is the go-to place with my friends and I after a night out. In a group of 10-15 people, we all attend brunch.  The entrance to the restaurant is a tad confusing with multiple doors at the front. The place isn't a five-star in cleanliness but you get what you pay for.  The service is mainly in Chinese, very little English. Which is why I never speak up, since I can't speak the language and have others order for me.  They do cart service and or from menu if you don't see what you want. They also do take-outs.  The food is okay, I've had better.  They take all sort of payments so you're not limited to just cash."}
{"text":"Had dinner here with my work mates after all landing in Toronto.  The greatest thing to me is that all the other patrons were Chinese, which is always a good sign.  We ordered family style from sweet and sour pork, fried rice, Chinese broccoli, chow fun, coast chicken and other dishes which we wolfed down.  There wasn't anything left for us to take home."}
{"text":"Came on a Sunday evening for early dinner (5:30) with friends.  Overall the food was good - we had the Peking Duck which included the lettuce wrap."}
{"text":"One of the better Dim Sum places in Mississauga, and believe it or not the service is actually quite outstanding. They are so nice and accommodating."}
{"text":"***Rating:  Based primarily on service.***  Definitely NOT good for large groups!  Came here for a Wake, with reservations for 4 tables full of relatives.  I found that most of the servers were quite rude.  There were children in the group and servers acted as if they were in the way and did not treat our group with any compassion or kindness.  I do not expect special treatment, but if a group is dining together, after a funeral, do you not try to tread lightly, as opposed to giving rough, rude, & unprofessional service?  One person at our table asked a male server to refill the tea, and he snapped back, \"After I'm done this!\"  I would say if you're casually dining, your experience may be ok, but if you're gonna be spending a whack loada money on hosting a group, I wouldn't recommend this restaurant.  It's somewhat embarrassing to have your guests treated in this way."}
{"text":"Formerly the Happy Garden Restaurant but with a new owner.  The Tim Sum has improved which is great! Prices seem reasonable as well.  I now split my TIm Sum cravings between here and Sam Woo nearby...."}
{"text":"This place is a bit hit or miss. The shiu mai, dried egg and pork congee, and steamed beef balls are amazing. The steamed rice roll with bbq pork, fried black bean tofu and meat roll bean curd are misses. Still if you know what you're getting this place is pretty dang good. The atmosphere and service are passable but the food comes out fast at least."}
{"text":"Came by to have some dim sum lunch with my family, we were group of 20.  I like this place as it has the traditional carts being pushed around.  We had most to all the classics:  pork Sui Mai, Har Gow, beef tripe, shrimp cheung fun, beef cheung fun, black pepper ribs, sticky rice with pork, clay pot rice with liver sausage, deep fried wonton, boiled chinese broccoli, chickens feet, bbq buns, chicken wings, beancurd with pork, chive dumplings, pork and peanut dumpling, mango pudding, tofu dessert and more.  It was all good.  This place had consistent service and the there was no wait, especially for the size of our tables.    I have been to this place for dinner and it is good.   I look forward to returning to this place when I am around that part of town."}
{"text":"This spot has changed owners a few times. I've been here a number of times since the last change - and change has been good for them!  ATMOSPHERE: They've earned a crowd of regulars, just like dim sum restaurants in HK has old timers chilling out over the small bites with tea and a newspaper. Very nostalgic. The vibe is like your standard Cantonese family restaurant. It's like Happy Jade, or Perfect Kitchen, in terms of look and feel. It's not a chic place, but it's spacious and bright. Lots of large round tables for family gatherings/meals.  SERVICE: Good. Service is timely. Almost always someone is close by if you need anything. But then again, most Canto restaurants watch all their patrons like hawks! They wanna turn as many tables as they can...   PRICE: Very reasonable. Again this isn't a fancy place, so the price matches this modest restaurant.  FOOD: Dim sum is good here. For Mississauga standard? VERY good. It's been consistent and most things are made-to-order on weekdays, so it's pretty fresh.   As someone else mentioned there barbecued meats are pretty good. Try the roasted duck if you're a fan! Especially the duck lai-fun (thick rice noodle - few restaurants in Mississauga carry it!) is a pretty good deal for lunch.  As for dinner, I've had a few 10-course family dinners here. And have never been disappointed. We're happy to have a regular place we can go to which is nearby!"}
{"text":"Dim sum here is pretty good.  They have specials on everyday during the weekday from 9-4pm.  Each dish is $2.80 for all sizes.    They also have a Bbq counter where you can order BBQ pork, roast pig, roast duck and soya sauce chicken either for take out or sit in.    Their restaurant has quite a large capacity so large groups of 10-12 per table is available.  Plus they can host Chinese weddings of up to 200 here too.    During dim sum, they have specials which they push around in carts, like special veggies, fried shrimp or house noodles.    Service is quick, efficient and loud.  Lol.  Typical of a Chinese restaurant in Hong Kong."}
