{"text":"My Filipino girlfriend and I had the extreme pleasure of dining at the Golden Lion four weeks ago. This place is absolutely fantastic and unique in its own way. The ethnic food is second to none and  is definitely complemented by the staffs awesome attitude and smiling faces  It all started out by me wanting to introduce my Filipino girlfriend to the Ukrainian Canadian culture and her loving sauerkraut pierogies believe it or not out of seven restaurants I tried in the GTA none served sauerkraut pierogies. The general manager went the extra mile and brought in some fresh sauerkraut pierogies for us which I thought was just great. The servings are large the Ukrainian music is out of this world and the dance floor is very inviting. I highly recommend the Golden Lion for your dining pleasures.  Ken from Brampton"}
{"text":"I'll be honest, I did not want to go to this restaurant, but I have changed my view this past Sunday. I only attended once many years ago & was not impressed at all!  Because my mother requested this restaurant,  I called to book a memorial lunch for my family  of 12 & thankfully was offered the private room because Andriy suggested that it would be more appropriate for our occasion due to large parties with children booked in the restaurant. Andriy's foresight proved to be a very good suggestion!    The food was very good especially the lamb chops which my husband ordered & they were exactly as he ordered, medium rare. Kudos to the chef!  My mother was accommodated with a special meal & overall everyone was satisfied & quite full.    Since we were in the restaurant business for many years, I must point out that my husband's salad was brought out before the rest of the other appetizers which is a big faux pas in service. All appetizers should have been served at the same time.  The waitresses were lovely & did their best, but more training never hurts.   Overall, we had a wonderful afternoon with good food, good service & at a reasonable cost, so both my husband & I are impressed, would come back & will recommend to others.    A big thanks to Andriy & the staff."}
{"text":"My Russian partner and I decided to try this place to have some Eastern European food.  It is one of those types of establishments that outside of immgrant culture harks back to the 1950's -- a restaurant, dance hall and catering venue all wrapped in one.  While were there, there was a wedding in one room,  two birthday parties in the main dining room plus a band with dancing, and just a few small parties.  We felt a bit uncomfortable as we were just two, but the servers were helpful and friendly.  As for the food, it was good but not great.  Cabbage soup had a nice smoky flavour and the borsch was tasty.   Stuffed cabbage was a bit too bland.  The knigliki, a sort of crepe fill with mince meat, were tasty but also a bit bland.  Desserts were quite good but too expensive.    The place is huge and has some pleasant decor including a nice mural representing some town or city (Kiyyiv, perhaps).   The Etobicoke location is off the Queensway and as the name of the street suggests, is an industrial zone.  We are from Chicago (with a large Polish community) and Russia and not experienced with Ukrainian culture in Canada, but to us the environment seemed much more Polish than Russian, were we to compare it to its neighbouring cultures.  An okay place, but better for a catered event serving its own community.   Main dishes are reasonable; the remainder of the menu is too overpriced.  We are used to Eastern European restaurants in Chicago which are very cheap."}
