{"text":"This is the first time I visit this restaurant.  They have more or less the same décor as the last owner.  The food surprisingly is good given the price of the dim sum.  The portion is large.  We order the beef ball and it comes with 4 balls, most of the restaurants only have 3.  One of the baked pie and sweet milk pudding that we ordered are not that good, the rest are above average.  You cannot beat the price with the quality in the location around.  They have lots of parking in the mall."}
{"text":"Looking for a new dim sum place, we ended up at Golden Crown Dynasty Cuisine.  Greeted with smiles, we were led into the dining area.   High ceilings, bright yellow walls, and actual cloth table coverings! Sure, there was a giant grease stain in the middle of the table, but I'll pretend I didn't see it.  The dim sum menu is extensive and they have some neat items. * I really liked the spicy shrimp dumplings with XO sauce! * The siu mai had huge shrimps and was fresh and piping hot. * Sticky rice was okay but nothing to rave about. * Beef noodle roll had celery in it... that's different... * We gave the crispy abalone pastry puffs a try, they didn't taste too much like abalone though.  * The escargot pie with Portuguese sauce was tasty but very sweet * For dessert, we ordered the two colour crystal balls... They looked exactly like the description.  Tasty dessert dumplings where you could see through to the filling (red bean and custard)  The food was freshly made and the portions weren't bad.  They give you 3 of everything which is different, there's usually four.  I went with one other person and we had to duke it out for the second piece of items we liked!  Overall, I had a nice dim sum experience and I will return if I'm in the hood."}
{"text":"Food is 4. Price is 5. And it opens at 8am.  just ordered 7 dishes and the bill came at 20.79 loved all dishes in the fried section. Congee was yummy too. My chinece fiancé and I found a nice new breakfast place for a change. Enjoy."}
{"text":"They are CLOSED!!"}
