{"text":"Came there sometime! Food portion small and taste just OK and also not using a meat !! Inside the restaurant, a lady too loudy and always make me uncomfortable !! Other waitress also just OK not really friendy!!"}
{"text":"**3.5 Stars** GOLDEN FLOWER CAFE! don't let this place fool you. Its a small hk style cafe with little room to navigate around, but its full everyday with line ups. Parking there is terrible and then after parking, you have to wait for a table. VERY FRUSTRATING!!!  But nonetheless its all worth it in the end when you sit down and finally get food.  They have new lunch specials everyday of the week so you don't get bored. The price is not the cheapest especially for someone like me who orders a cold drink with my meal everytime. But I've gotta say that the extra dollar for a cold drink is worth every penny. Out of all the hk style cafes i've been to, golden flower makes the best milk tea by far! The staff is fairly friendly all the time except for one lady I believe is the boss. Don't get me wrong, shes super friendly and nice, but maybe TOO FRIENDLY.  Shes really loud and gets into your personal space. Good food good drinks, overall nice place for a quick dine and go for lunch"}
{"text":"good food, garbage service like any other low end chinese cuisines"}
{"text":"the food at this cafe is nothing special, but the worse is the owner, she is very very impolite to customer, i asked her something, she just keep yelling me and answered something i really don't understand. I really have no idea why should I to be treated like this, I don't think it's not the only Cafe in Richmond Hill area.  If you are looking for challenge, then go for it. but if you are looking for something like normal with base service, then don't go to this cafe."}
{"text":"It is a Hong Kong style café.  If you want quick service, fast food and cheap prices, here it is.  The restaurant is packed for a weekend lunch.  The lunch special includes appetizer, entrée and a drink.  If not, you can order noodle, sandwiches or rice a la carte.  The food quality is average.  What can you say about a fast food restaurant to fill you up"}
{"text":"Sure this place can be quite the nuisance when you're trying to walk down the 2 feet wide aisle or when you're trying to grab a spot with 20 other people around you.  BUT despite all that trouble this place is definitely worth it.  The gravy chicken rice is the best.  The reason why I'm not giving 5 stars is because of the screaming boss lady who tries to befriend everyone with her pouty attitude."}
{"text":"I miss this place. There are the regular morning customers and the solid breakfasts. My family goes so often that they've memorized our regular choices.   Now that I live in Cali, I really miss this place. This is really comfort food for me. Every time my husband and I visit Toronto, we definitely come here for at least one breakfast. I get my wonton noodle soup for breakfast or the ham, egg, macaroni and he gets the beef brisket soup."}
{"text":"Perhaps I am biased because I've been coming here since I was a small child but I love this place. In my opinion, you are not a true Richmond Hill HK-er if you haven't been here at least once.  Portions can be small but you're paying 5 bucks for a bowl of noodles, so you can't complain. I love the iced lemon tea here - some places just don't do it right. I've made a convert out of my boyfriend, who now also adores this place. Nothing you get here will be bad. The only thing I will say is that their HK-style french toast is quite thin relative to other cha chaang tengs.  I get that the lady-boss of this cafe can be quite loud. However, I've known her since I was really really young and she's as sweet as they come if you get to know her. And everyone's super friendly!"}
{"text":"This a typical hong kong style cafe. Food is average, nothing special, nothing bad, nothing spectacular.  However one thing they seem to do really good with is the drinks. The milk tea that they make are by far the best in the area. I will go here sometimes just to buy a drink."}
{"text":"The food here is better than most other HK cafes and the server lady is hilarious. I really like their breakfast specials and vermicelli! It can be quite packed on the weekends though."}
{"text":"This place has improved since renovation. It's more cleaner and the service is better. The food is average but it's good. The price is fair. I give 3 1/2 star for here."}
{"text":"This place brings back lots of good memories!  Small Hong Kong style restaurant with a great selection of food, healthy tomato soup based noodles, friendly staff, clean & cozy environment.  I ordered a Guilin Vermicelli/noodle soup and it totally hit the spot when I was craved something soupy but wasn't too heavy.  It was made with a tomato-based soup broth, topped with minced meat, eggplant, and tomatos. Eventhough the menu advertised it was vermicelli (thin rice noodles), it ended up being a medium thick round noodle, but it actually tasted much better!!  Had a side order of egg sandwich (untoasted bread) to go with it, as well as, a honey lemon water(came as a meal) to make my meal complete! This place has been here for a long time, and it never disappoints!"}
{"text":"Been here a few times before usually for afternoon tea though.   They're afternoon tea selections fairly wide starts from 2:30pm - 5pm. Portions are pretty filling as per one serving and it comes with a hot drink, cold drinks are extra cost ($0.50 - $0.75 more) *don't remember on the top of my head*  This time I came to try their breakfast menu. Breakfast are offered from 8am - 11am. A wide selection as well, most items comes with toast and a hot drink, cold drinks are extra cost. You can choose from simple items such as just butter on toast, eggs with toast, noodles, oatmeal, chicken, pork cutlet and even steak. Price ranges from approx. $4 - $7, which is pretty fair for breakfast.  It's a small place which fills up pretty fast but if you were to wait for a table, it doesn't take too long either because people come and eat then they're out. They have enough servers working at all times thus the turn over rate is fast.  Don't expect great service because it's just an eat and go, fast pace cafe.  Don't have high expectations on food either, it's not the best but fair enough for the price you're paying and the quality of food you are getting.  Come here to try it out if you're looking for something with a low budget that will make you full because you don't feel like cooking and cleaning at home."}
{"text":"This one definitely gets lots in the abundance of HK Style restos in the Markham area. Prices and portions don't quite align. I find their dishes a little smaller than most places even though their prices are very typical.  I've been here on several occassions but don't really have any fond memories of anything that stood out. The food is alright but there are many better options in the area.  Their milktea/ lemon tea is also...meh.  Visit if you are extremely desperate."}
{"text":"Very good for a Hong Kong style cafe. Quick and reliable at a fair price. Nice cozy feel of a small restaurant; friendly staff and owners speak loudly (it takes getting used to). Recently renovated. It gets busy at peak times. Rotating weekly specials along with regular menu."}
{"text":"We were in the mood for some HK style milk tea and cafe style food, a quick yelp later and discovered this place right around us. This little cafe is located in the same plaza as a congee wong, so most of the time when we were in this plaza it was for congee wong and absolutely never noticed this place. We figured today was as good a day as any to try this place out.   Upon first entering, the place was small but looked to be recently renovated. We were advised to grab a seat anywhere, which we did and perused the menu.   My other half ordered the chefs daily special (three cups chicken), while I went for a different daily special (currry chicken steak).  Both meals came with a clear broth soup. And I do mean clear, as in there was absolutely nothing in the bowl, not even a shred of meat or veggie.   My other half meal came out with a huge plate of rice, and a disproportionately small bowl of the \"main course\"'.  Mine came out on a same sized plate with same amount of rice with the curry chicken steak on top.  We also both got our hot milk tea, which was quite decent and thick. It hit the spot, but beyond this there really wasn't anything endearing about this cafe.  The food was decent, not bad not great. The service was lackluster, but not so bad to the point of annoyance. The servers tended to chat up what I assume to be \"regulars\" while we were largey ignored. It took us 4 times to flag someone down for the check. And it wasn't until we were nearly done our meal did our milk tea come out. Very minor, but as I said not so bad that we were annoyed, but a far cry from good.  Prices were quite decent, total came out to 22 for the meal.   Would I come back or recommend? This place would definitely not spring to mind. If someone said let's go here, I may err towards congee wong instead.  Overall a very forgettable experience."}
{"text":"This place is a little far for me but worth the trip if your looking for Hainan Chicken.    Pros: - Service: In the morning and lunch times are quick and fast. They are always efficient, but don't rush you to order.  - Parking: Although the lot is small, I'm always able to find parking to eat here  - Food: Food tastes great. Like I stated above, the Hainan Chicken is so good! Unfortunately one time I came here and the special rice was not prepared so I had other options. The Healthy Tomato Broth series is great for a hearty and not greasy meal in the morning. I also got a hot HK milk tea to go with but personally, they make the cold one so much better! Go with the cold! My partner got the Beef Vermicelli Soup, it was okay. It came with toast and butter.    Cons:  - The English speaking barrier was pretty hard. I tried to ask them what else is recommended on the menu but we had a hard time communicating - The rice for the Hainan Chicken was not prepared earlier but is available for breakfast time, this was a little disappointing but not a big deal   Overall, will be coming back!"}
{"text":"This place is hopping on the weekends - especially in the mornings during the weekends.   The place is cheap for lunch and is a great no frills cha chan tang too. Their milk tea isn't bad - nice and strong without being too strong to give me the caffine backlash that I usually get when I order milk tea.   The breakfast menu is pretty solid - I recommend their satay beef macaroni soup; which comes with toast and a drink - total meal works out to be under $10 including tax and tip.   They have another menu after 11:30 - I like their chicken steak noodle soup - which is served like Japanse Ramen style or their Satay beef sandwich.   Service is a bit hurried - but friendly at the same time.   Now if I can get my butt up more often for breakfast - I'd walk myself here for my meal."}
{"text":"3.5  Another weekend, another HK style cafe to try.  Golden Flower is a good choice if you want something pretty cheap and fast.  Pros: Food comes out fast Friendly service  Cons: Portions are smaller than others  We came on a Sunday morning.  I was always told this place is very busy on weekend mornings.  The place wasn't too buys when I came and was about the same when I left.  I notice outside that the supermarket in the plaza has closed down.  Perhaps business took a hit with the supermarket not being there anymore.  It does make it easier to get a seat though.  We ordered the French Toast and noodle.  Both were off the breakfast special menu.  We also ordered a toast for my little one.  The lady was nice to charge us a little less for the toast because we didn't need a drink for that.  The specials all come with a drink included in the price so that was something nice for them to do.  The food came out lightning quick.  We were eating within 5 minutes of ordering.  You get what you pay for here.  The prices here are pretty good, but the portions are smaller than what other places give you.  The french toast was made with thin sliced bread, not the thicker brick-like toast I'm more accustomed to at other HK style cafes.  When my noodle came out, I remember it was beef brisket, fish ball and another type of ball.  I couldn't discern what it was though.  It was like mystery meat.  Overall, the food is good for the price, it's nothing to write home about though.  Golden Flower is a nice little place to go to.  They offer a solid menu and pretty good prices.  The service is great and there's no reason why I wouldn't go back if I'm looking for something cheap."}
{"text":"You can't expect crazy good service here, and it almost feels like you're in a supermarket because of the owner or manager lady that works there, she is just super loud.   Food is descent and prices are cheap, I always visit her for their tomato broth ham and egg with vermicelli in soup.  Drinks are well made HK style.  Food is also served quickly to the table."}
{"text":"I came by on a Saturday morning around 8:30am and it was already packed. This place is always packed with people and that's a good sign.   It's a small but perfect size for a Hong Kong style foods. They also recently renovated this place and it looks a lot better. The service of this place is really fast and friendly.   I got the classic breakfast with toast, eggs and ham and another set with sausage instead of ham. It came with a hot drink but we got a cold drink for $1 more.  The HK style milk tea or milk tea / coffee is a must try, its amazing compared to other places. The two breakfast sets only costed $15 after tips.  I tend to do take-out here often for dinner and have tried most of the items, everything has been really yummy.  Definitely recommend this place if you're looking for HK style foods or even for a quick morning breakfast or lunch, it's cheap and worth the price."}
{"text":"This is a HK-based cafe who's owners take very random breaks.  Overall, my fam LOVES this place - this is besides finding a rock in a noodle soup before. I'm not sure why but every time I eat here I feel slightly nauseous.  The quality and the portions aren't bad - I'm not sure if they use MSG but when I try their gravy (with chicken/seafood/steak) I feel like I should never eat again for about 20 minutes.  HOWEVER,  My fam comes here every weekend when possible & the drinks aren't bad.  It is a very small restaurant and the lady owner likes to screech a lot.   & parking is Asian-aggressive."}
{"text":"Egg Sandwich Review 1/5 - I discovered last December that their egg sandwich is one if the best I had in Toronto with a rating of 4/5. I came back today looking forward to have the same egg sandwich and am very disappointed  - As you can see in my photo a good HK style egg sandwich requires the fluffiness, softness, thickness of scrambled eggs. This is always a place I come back to when I crave HK style food. Their prices are reasonable, their HK milk tea is decent. I will return for a meal but certainly not risking a poorly done egg sandwich. Let me know where you had a good egg sandwich please &  thank you!"}
{"text":"Love this place.  Gets pretty crowded on weekends around peak asian eating times (12:30pm - 2:00pm).  But tables clear fairly quickly.  Best cafe food in Richmond Hill by far.  My only gripe is that parking here on weekends is impossible.  The cafe shares a very small parking lot with another cafe, a super market, and numerous hair stylist.  There is absolutely no parking in this plaza on weekends."}
{"text":"Golden Flower Cafe is one of the numerous Hong Kong Style Cafes in the Richmond Hill area.  I think eating at Hong Kong Style Cafes so much do make me cheap and so value concisous!!  Such a good place for late lunch or early afternoon tea because their afternoon tea specials ($3.50 and up) starts at 2 pm over 20 items to pick from.  My Fish Ball Noodles with drink ($3.99) is A-OK! Right portion to fill me up but not stuffing me full. Just wish they put in some veggie in the soup then it will be perfect!  The ladies working here are all nice and cheerful, seems like there are a lot of regulars coming here.  CASH only!"}
{"text":"Ordered the beef briskets on rice.  The beef was so tender and tasty except this time it wasn't hot enough.  Love their soup."}
{"text":"The price is reasonable, I got the pork chop with onion sauce on rice for $8.5. The portion of the pork chop is big, but too little rice for it. End up too salty without the rice. Service is good, taste is acceptable. Will come again to try other food"}
