{"text":"I've been going here for just over 15 years simply because of their amazing Hakka Chilli Chicken. I've searched everywhere for something to match it's perfect texture, and taste. I've failed to find anything even close to as good and have been coming back here even after moving out of the area."}
{"text":"This place is good and cheap!  They give you tons of Spicy noodles. I love the Manchurian noodles.  Recently, I tried their ginger chicken, great! Good to know they are doing great things besides their noodles. I've been going there since I was a kid and I live in the west end now .  It's so good, I still stop by when I'm  out 'east'."}
{"text":"Did not like it much. The food was supposed to be Hakka, but they lacked flavours. Went in with a big group and could not satisfy my companions. The cleanliness and waiters are a plus."}
{"text":"In one word: tasty food @ reasonable price.   \"Good Luck\" is definite place to try for blend of Hakka Chinese/East Indian foods. Get generous portions in each serving (at least 3 people can share).  Very tasty food suits the various taste buds. Overall serving was quick and pleasing.   All-day special \"Fried Rice Combos - 3 varieties\" (less priced than a burger) are an attraction.  I also love the Spicy Chilly Fish and Spicy Ginger Beef there! Highly recommend."}
{"text":"Best place for chicken pakora and they make it extra spicy not like other places that already have it made."}
{"text":"Fantastic Hakka cuisine with a large amount of garlic and ginger flavour in comparison to some of the other Hakka restaurants."}
{"text":"Got Singapore noodles, chilli chicken, chicken Manchurian, egg fried rice, shrimp fried rice and 2 orders of fried shrimp for apps (which they forgot to include) food was satisfying and tasty with good portions.          The low rating is based on the fact that I was staying in Brampton and realized when I got home that they had forgotten to include the 2 orders of fried shrimp. This was a true inconvenience as my family and I were looking forward to the shrimp as appetizers with drinks.          The next day I called them to inform them of the mistake which they confirmed by having too much shrimp in the fridge. they agreed to have me pick up the 2 orders that evening. I asked if they could include something extra seeing that I would now have to drive from Brampton to Scarborough due to their mistake. The person I was speaking with would not approve any complimentary items despite having admitted their mistake.         My poor rating of this restaurant is based solely on service. Ultimately in my opinion it's a restaurant's duty to serve their customers the best they can; keep the customer happy and of course... in the right mood to keep coming back. Due to the lack of respect for my time, planning and inconvenience I will not be returning to this establishment."}
{"text":"Just in case you've ever driven by and looked at this place: I know, it looks sketchy on the outside, but it looks a lot better on the inside. It's really just your typical, run-of-the mill Asian restaurant. So don't be afraid you'll get shot if you walk in.  Went here because of the five star rating Arun gave the restaurant. Definitely not worth it.  It's reasonably cheap. It tastes pretty good, but it's nothing special: at all. The restaurant is the definition of \"Meh.\"  The food was too oily, and didn't taste spectacular. The portions were the regularly large-sized ones that Asian and Hakka restaurants normally give you. I shared with my husband and I guarantee you, the only way the portions could feed three people is if no one was very hungry.  The prices are average, and since the portions are also average and the food is reasonably tasty (except for being too oily), I'd give it no more than 2/5 stars. I could walk to this restaurant and I still wouldn't find myself inclined to go there again."}
{"text":"Great chicken pakoras, which you can have made extra spicy. They are not greasy and have a nice crunch. I also recommend the chilli chicken with gravy (breaded) it is delicious."}
{"text":"You want AMAZING spicy Hakka food in Scarborough? Then this is the place to go.   What I order (every time because I love it): -Chicken Pakoras -Manchurian Chicken Fried Rice -Chilli Chicken (w/gravy) -Ginger Chicken (w/gravy)  This meal is amazing... Amazing quantity and AMAZING quality.  Except if you can't deal with the spice ask them to tone it down a notch or you'll be burning in the morning ;P  Highly recommend!"}
{"text":"A hidden gem next to No Frills in a big plaza. Their Manchurian Fried Rice is great if you can take the heat. Very big portion. Chicken pakoras are fantastic. I will always come back."}
{"text":"Been here on 2 visits now.  Kinda average but cheap place to eat if you are on a budget.  Have tried the chili chicken, shrimp fried rice & Good Luck Special Fried Rice.  A little bit out of our normal path, this resto is located near Kennedy and Eglinton.  2432 Eglinton Ave East.  Their value of portioning to price paid is good.  Service is friendly enough.  Would likely make return visits if we happen to be in the area."}
{"text":"Excellent chilli chicken! Also enjoy their chicken corn soup, Singapore fried noodles, and stir fried (spicy) green beans. Only our second time here and can't wait to come back."}
{"text":"My family love this place. We like to order chili chicken, manchurian fried rice, and chow mien for take outs, and their sizes are so huge, it's enough for family of 4 for 2 meals. The food is very cheap and the cashiers are very friendly."}
{"text":"Came with a group of 20 after a hike that ended at Kennedy Station, and found this place nearby. We got in a little before 2:45 PM, and there were already a few tables occupied, but we managed to get everyone seated. There was only one person working out front, but she let us to move tables around to accommodate the group.  Restaurant is clean and spacious. Washroom is clean. Decor includes large fans hanging on the wall along with some portraits.  Forks and napkins are provided. Spoons, knives, and chopsticks can be requested, though they gave me a pair of disposable chopsticks rather than the re-usable ones.  They have two jars of chili sauce available on the side. You should definitely try them.  The menu is extensive, with a lot of different dishes to choose from. They also have lunch specials on weekdays from noon to 3 PM, as well as daily specials listed on the wall.  Four of us decided to go with Dinner Combo for 4, which came with  Choice of Spring Rolls or Hot & Sour Soup Garlic Shrimp Boneless Chili Chicken Manchurian Mixed Chow Mein Beef with Snow Peas Egg Fried Rice Ice Cream  Spring rolls came up first. Usually when I get spring rolls, it's usually a small cylindrical roll. However, this one was large and rectangular, with a thin crispy skin and lots of vegetables inside.  The rest of the dishes start coming in shortly. They all came in fairly large plates/bowls, suitable for 4 people. We all had a chance to try a nice portion of each dish. Chili chicken was nice and tender, drenched in flavorful chili sauce. They add spices to each dish, so the flavors were definitely interesting.  One issue is water refills. Because there was only one wait-staff, refills don't come unless you ask yourself. But this is not really a problem if you don't require waiters to check up on you every few minutes to see if you're doing alright.  They don't offer ice cream on the menu, but the set combo comes with two scoops of vanilla ice cream, which is a nice way to finish the meal.  Would recommend this place if you're around Kennedy station and looking for some indian-style hakka chinese food."}
{"text":"Tried the chilli chicken. It has a good taste to it. But after eating half of it, its not as great. It could be because of all that oil. I've been to a few places that have better chilli chicken and usually the good Hakka places are in Markham."}
{"text":"Been going to this place for years a few times.  Their prices, and portions are reasonable.  The food is always great!! Chili chicken, chicken hakka chow mein, and pakora is yummy.  Though the place is small, it can definitely fill up quite quickly.  The place could use some interior design consulting....as the atmosphere doesn't quite match the restaurant's genre."}
{"text":"Came here on a Sunday around 3pm.  The place was about 50% full.  The decor was clean but very plain.  Service was friendly and there was only one waitress so took awhile to get our drinks.  We got the dinner for four which was $39 for 5 plates of food and four spring rolls and four ice creams.  This was great value considering all the items we got were all items we were interested in trying.  We first got the spring rolls which were much bigger than springs I have gotten at other places and taste was similar.  Next we got all our entree items.  The Manchurian mixed chow mein was a good size portion and tasted good but I wouldn't consider it a chow mein because of the look and texture of the noodles.  The egg fried rice was enough for 4 of us and wasn't anything special.  The beef snow peas was small and texture of beef was chewy.  The Manchurian chili chicken had a lot of flavours and the had some spicy peppers in it but sauce was too salty.  The garlic shrimp was average and had too much batter than I would like.  Overall I enjoyed the meal as there was a good mix of different flavours, spices and textures.  Would definitely check it out again if I was in the area."}
{"text":"Was going to Zen sushi but didn't realize it was close on Monday.  With 30 mins left for lunch, just randomly drove into the No Frills plaza.  Wasn't expecting much, but the price & quality blew my mind.  3 lunch specials at $4.99 plus a handful of $6.25 combo including soup & drinks.  Add spicy at no extra charge.  I was so full at the end that I packed half my plate for lunch tomorrow.  Great deal at scarbo area!"}
{"text":"Hand down the BEST hakka Chili Chicken I've had anywhere in/around the city! Starts of with a sweet flavour (not overly sugared like at Hakka No.1 chains) and ends with some sweet heat. Lunch special is cheap and includes Chinese tea or pop, and a choice of spring rolls (which ended up being like a kind of cabbage egg roll, with just deep fried dough and cabbage inside, nothing fancy) or Hot and Sour Soup or Corn Soup for $6.99. We also had the shrimp chow mein - bland. Next time I'd only order the meals with the hot pepper next to them for more flava! Cheap and tasty!"}
{"text":"Cheap eats, friendly service and clean environment. Food was not that impressive but you get what you pay for!"}
{"text":"This place is my go to fried rice spot. Whenever I have the itch for some seriously delicious and filling fried rice this is it. What really stands out with their fried rice is the eggs they use. There's just something about having real eggs in my fried rice that makes it so much more delicious.   It's a good sit down spot but personally I like to eat with a good show on so I take it to go. Most people I feel, do the same. They are real quick and the portion sizes are huge. For example if you give their shrimp fried rice a try they will fill the container that there is no air in the container."}
{"text":"Really nice place for lunch , they offer quick and friendly service, along with amazing food!  The portion sizes are a bit small compared to other Kakka places, but they're packed with flavour.   Recommend: manchurian rice and garlic shrimp."}
{"text":"We discovered this place in our quest for great Chinese takeout.  It is not what we expected but we really enjoyed it.  It is a bit greasy but despite that, it is delicious.  We have been trying Chinese food places in the area and this one did not disappoint.  The portions are very good and it tastes really good too. It is hakka style and you won't find pork on the menu. We have gone there three times so far and got takeout because we enjoyed it. It is not as good at Steeles Garden but that is a distance away Steeles. Their spicy sauce is hot but delicious!"}
{"text":"I was craving Hakka Chili Chicken yesterday and since I moved to North York I didn't really know of any good places.. I was recommended by a friend to try out this restaurant and I am pleased that I did. I placed a take out order for Chili Chicken on White Rice (which was not on the menu) and 2 vegetable spring rolls. When I called to place the order I was surprised to be asked if I wanted the Chili Chicken on White rice or Egg Fried rice? In the past that has not been an option at other restaurants and next time I order from here I might just have to try it.  The person on the phone who took my order said it would be ready in 10 minutes which I thought was incredibly fast. When I arrived I couldn't help but notice how busy this little hot spot was. It make me feel comfortable ordering from a place that has a demanding clientele.   The portion size was enough to fill me for dinner and still have left overs to bring to work for lunch. Also the price range for the items on the menu were priced in comparison with other fast food hakka places i've been too and very reasonable.  Next time I will order the Hakka Chow Mein which was recommended by my friend."}
{"text":"Anazing service, came here since I was a child. It's my favourite local place. My favourites here are the spicey chicken fried rice, chilli chicken with rice, and songapore rice noodles! Great service and great food with a great family atmosphere!"}
{"text":"When I go looking for Hakka Chinese food in Scarborough I adjust my expectations accordingly. I do not expect to see hotties with million watt smiles taking my order or flat screen TVs playing channels you only get on the Rogers VIP Package. I only go there with only one thing in mind, food. I ordered takeout,so I cannot comment on the service. When it comes to price and portions it is very hard to beat Good Luck. I ordered the following dishes  1. Chili Chicken - Tasty 2. Manchurian Chicken - Visual delight and actually it is more spicy than the chili chicken 3. Crispy Shrimp - Served with sweet and sour sauce making it a great appetizer 4. Vegetable Fried Rice - Decent 5. Chicken Pakora - Pretty spicy beware! 6. Hakka Chow mein - Good 7. Chicken & Corn Soup - Pretty goey had better in other locations. 8. Manchurian Fish Slice - More batter than fish, which is unusual for a restaurant that is very generous with its portions.  Grand total was than 80 bucks. The portions are perhaps the largest ever. There is so much rice in the take out container that opening it up will result in a eruption that will be messy. The chicken dishes has nothing but chicken. Unlike other competitors who fill such dishes with bell peppers and onions. Needless to say I enjoyed this huge order for the next 4 days, lunch and dinner.Talk about value for money!"}
