{"text":"I placed a delivery order for a work event for 40 people. When the food arrived I was very disappointed of the portion sizes in comparison to the cost. $450 worth of Chinese food, you would expect leftovers but we barely made 1 plate each. 

In speaking with the restaurant rep, she assured me that they would figure out what was needed to accommodate this group size (as they have catered parties of up to 400 people), well the rice and noodle dishes came in 10 person portions (confirmed by the driver) along with the meat dishes. 

I don't feel that what we received for the price was worth it and I wouldn't recommend ordering from this restaurant for a party. The food tasted decent, but I'm not a Chinese Food expert and was told by a Chinese colleague that it was just ok."}
{"text":"Mmmmm...i love the Tofu Corn Soup! Def must try! :)"}
{"text":"I work close to here and I've been to Good View 10+ times now.  It is mostly westernized Chinese food (drowned in sauce) with the occasional authentic tasting dish.  Portion size is medium and price is mid range.  Lunch combo comes with a small tasty soup (hot and sour, chicken noodle etc. on rotation).  I would just order the high-turnover items to ensure the ingredient is going to be fresh.  I ordered the Chinese broccoli once, and it was old and hard to chew...
I have to agree that customer service can be a bit rude during non-rush hour when the servers treat you like you are interrupting their conversation."}
{"text":"Started ordering based on the reviews of another Yelper, and we were not let down.   Outstanding soup, great General Tsao, killer fried rice and very friendly phone service.    Delivery is pretty quick and the promotion for a free dish or free pop on the website was a nice bonus, since I didn't see it myself but was offered over the phone.  We are repeaters now."}
{"text":"At first sight I was a little reluctant to go into this place, the neighborhood seemed a little on the seedy side.  But once you get inside all that changes.  Was greeted by our waitress Ginny, who was very personable and funny.  If you want to meet someone who is proud of where she works, she is the one.

The restaurant is a little bit on the old side, but very clean and bright.  Everybody ordered something different and then shared.  All dishes were plentiful and nicely prepared."}
{"text":"Don't order online that's all I can say. Placed the order at 6:30 called back at 7:10 to see when it would be coming because they didn't give an estimated time and they told us they'd just gotten our order 10 minute ago.. Didn't even apologize just said that it was how their system works. They said it would be another 30 minutes and we hesitantly accepted that. Cut to 30 mins later they call to say it'll be another 30 mins still no apology. We cancelled the order and I honestly hope they had already prepared that shit and we're getting in their car because that's so unacceptable. 

Moral is screw this place."}
{"text":"This place is not good. Ordered the General Tsao and Curry Beef. The General chicken was overly breaded, soggy, and had very little meat in it.  The curry was watery, tasteless, and the beef was slimy. We threw it away and ordered from New Ho King to get good Chinese food! Stay away..."}
{"text":"2 stars is too low but 3 is too high. Portions are generous but the flavour isn't spectacular and a bit bland. Found a fly in my glass after I poured my drink. Other flies are buzzing around."}
{"text":"I eat here at least once a week...sometimes more! Lots of choices on the menu so you can be sure they have a dish that will appeal to you. 

Like someone else said, they truly are very accommodating since you can customize the dish to your liking. For example, if you order mixed seafood with mixed veggies, you can have it with egg noodles, or rice noodles, or singapore noodles, etc. All you have to do is ask! I do this all the time and that's why I keep going back.

The owners are very friendly and extremely hard working. These desirable qualities are reflected in their flavourful dishes. Fast, fresh, and tasty. What more do you want?"}
{"text":"Very reasonable, good size portions and very friendly staff who make fantastic recommendations! Don't be put off by the location, one of the best Chinese restaurants I've eaten at!"}
{"text":"We ordered from here multiple times and had no problem until this last time. We were scolded for not tipping the \"proper amount\" to the drivers for delivery. Although the food was pretty tasty (we enjoy the chicken lo mein) , this ruined the restaurant's appearance to me and I dont think I will be ordering from this place in the future."}
{"text":"We've had many a delivery from this place and it usually hits the spot (three entrees will feed two people for at least 3 dinners).   The fried rice is pretty good, the chow mien is a bit too flaccid, the stir fried veggies are generally good.  The lady who took our order last time is the nicest person in the city of Toronto, just call Good View whenever you're feeling sad."}
{"text":"Might be the best Chinese food between 100 and 140 Dundas St E"}
{"text":"I love this place. The food is decent, the staff is very nice and nice decor. In an area where there is barely any good restaurants close by this place has become a staple in the community."}
{"text":"Food is ok and service is reasonable...very friendly staff ... A bit too friendly and chatty to be honest...lets say you can't enjoy your meal in peace there and if you ask any questions about the menu then expect to learn about the history of the dish weather you like it r not!"}
{"text":"The view  is not good here.  It's in a sketchy area with sketchy people walking around.  If you want to eat canadian chinese food like chicken balls and general tsao chicken come here. Portion size is decent. The food is not bad and not great either. I can get the same or better for half the price in scarborough."}
{"text":"I was not impressed with this restaurant at all.  At first I thought it had some potential for cheap and tasty Chinese food, but turns out it's not that cheap and not that tasty.  Most of the dishes were around $7 pre-tax/tip, and the portion was decently sized but there is just so much better tasting Chinese food in Toronto.  I even find the fast food options in the nearby food courts better.  I had the ma po tofu and the peas and carrots that were in it (I didn't even realize ma po tofu comes with peas and carrots) tasted freezer burnt.

The worst part is, their service was really slow.  For five people to have lunch, it took us an hour.  The food took at least 20 minutes to come, and then when the bill came (admittedly we asked for individual bills and then four of us paid with credit cards), it took at least 10 minutes to process even though the restaurant was only about a quarter full and no one else was paying at the time."}
{"text":"Great lunch special for about $10 comes with Soup and a meal.

Very clean, tasty Chinese food.  Reasonable portion, feels like little to no MSG added.     No post-lunch food coma here!"}
{"text":"Always delicious food and not too salty. I usually get the chicken teriyaki which comes with crisp broccoli - which I love. The daily soups are always good, especially the hot and sour soup - perfect balance of flavours. Place is very clean and the owners are courteous - love Good View!"}
{"text":"This is certainly the best Chinese restaurant we've been to in Ontario. The staff is very friendly, the place is perfectly clean, they have many different food choices (great vegetarian food too), and everything is delicious. We walked for 20 minutes in the winter, but it was definitely worth it. Don't miss this place while you're in Toronto and craving for Chinese food!"}
{"text":"This place was okay. I ordered the chow mein with just noodles, chicken and vegetables. The chicken was super slimy and they drowned everything in the sauce. It was okay but don't think I'll be going back"}
{"text":"Surprised at the positive reviews on this place. The décor and the menu is similar to most Chinese places but the food was bland and the staff was VERY unfriendly.
My daughter and I walked in to order take-out. Felt like the soup-Nazi episode of Seinfeld. We were dismissed as the woman who rang up our ordered continued a conversation with another worker....who she was quite friendly with. Our food came out in an acceptable amount of time but it was bland. I'd never go here again whether I lived locally or was just visiting. So many other choices to choose over this."}
{"text":"Amazing food, great daily specials and they deliver.
I have been using the delivery service for years and have recently been eating in as well.
It is a family operation, it is always clean, fresh ingredients in the food and everything has that little extra touch.
Highly recommended and well worth either a visit or a delivery order."}
{"text":"I love this place, I've been ordering from these guys for over 10 years, they are the only Chinese place i will order from. The folks at Good View are very consistent, they serve fresh and very tasty Chinese food, and like most places they have their stronger and weaker dishes, but overall they have very good Chinese fare. 

Unlike many Chinese places, they don't allow you to customize dishes, change the noodles, heat level, etc. etc., well Good View does, they are extremely accommodating and often suggest choices on how to have certain dishes. Everyone loves options right! :) 

The other plus is the very friendly owners, and their nice clean restaurant. This place is definitely a hidden gem and very worthy of my business."}
{"text":"Prices jacked over 30% within the span of a month!  I've been eating here for over 12 years.  Food has always been consistent and the service has been great.  Tonight I stop in to get my regular take out order and gasped when she (the owner) told me the price.  She then confirmed my order, no errors, and tells me the adjusted their prices to match (match what? she didn't say), but my usual $35 order had now become $46, what the heck?!  She then tells me, I can give you 20% off this one time.  How does soup go from $5.50 to $7.95, spareribs from $12.95 to $17.95, and fried rice from $14.95 to $19.95, all in one go?  I asked her if the portions have gotten bigger and she replied \"Oh, I don't know. Maybe some of them\".  Needless to say that I walked out without my order and won't be returning.  Way to alienate your long standing customers and kill your business in one swift cash grab.  Luckily, there are many other great reasonably priced option downtown, like Rol San and Wah Too."}
{"text":"Somewhere out there, Ryerson students and Former Ryerson students are going to be pissed about us letting the word out on this restaurant. Often, those who go to this restaurant don't like telling outsiders about it, because they don't want it to become over-crowded and hard to find a table at. Too bad, I'm letting the word out!

This restaurant is great. The portion sizes are HUGE, and usually you can get a pretty good meal at under 8 bucks. The people who work here are really nice, they have excellent service, and the food as I mentioned is really good.

If you are in Toronto, and are on a budget this is THE place to go for \"Chinese\" food in Toronto."}
{"text":"Beef Brisket with Vegetables over rice - $10 (with tax) - Yum!  The beef were tender and delicious.  The light sauce is really tasty and I love the variety of ingredients in this dish - bok choy, onion, snow peas, mushrooms, broccoli, and carrots.
I stopped in to order my food to go and they were super fast!  I must have waited no more than 5 minutes before my food was ready and it was good.

The staff is friendly.  There are plenty of seating inside.  There are many dishes to choose from on their menu including 10 kinds of soup, rice platter, noodles, seafood, egg foo yong, chop suey, noodle soup and fried rice.  They also have all day specials starting from $7 (cash or debit only for the specials, otherwise you can pay with credit card)."}
{"text":"Good place to eat. Very clean. Service is quick. The staff were very friendly. Most importantly the food was good. Very fresh vegetables. Everything tasted fantastic and seemed to be made from scratch. Didn't taste like it was made ahead of time or with old or frozen veggies. 

Bubble tea was really good."}
{"text":"Great place for Chinese food take out!!! The prices are reasonable. The food taste great. The staff are friendly. I go here all the time as a Ryerson student. Highly recommend."}
{"text":"Ordered beef brisket soup. The meat is very fatty, had to cut the skin off before eating. Soup broth had no flavor. I added soy sauce & sesame oil to try & make it eatable. My husband ordered the peanut chicken, for $20 it was a small portion with no rice & just OK tasting. Will never order from here again"}
{"text":"Loving the lunch special available at dinner hour for a small upcharge. Although most things are fairly generic (exactly what you would expect) the crispy ginger beef is spectacular."}
{"text":"I love this place. GINNY takes good care of her customers. It's her attention to detail and her love for food that makes it amazing. I come from brampton just for this place."}
{"text":"I've never dined in, but I've had take out from this place twice. It's exactly like Manchu Wok. 

The second time we got delivery, their card machine didnt work because of a connection error. We stood by our door for 20minutes trying 4 different cards because we didnt have cash. The delivery guy called their boss and the man said we would have to wait half an hour or so for him to come and pay and during that time we werent allowed to take our food. My girlfriend and I were so angry with the situation but eventually requested to take our food while we wait for another guy to come with another card machine and they agreed. 

We probably wont order or dine here again. Their food was incredibly greasy and salty, and my girlfriend found a sponge scrub piece in her noodles."}
{"text":"Best Chinese restaurant in this neighbourhood by far.  I've been going here for years and it's always good food."}
{"text":"Yelp listing said that they closed at 11pm. Called at 10:12pm to order and said they said they were closed."}
{"text":"This restaurant has been one of my favourite places to go to since starting Ryerson University. Mind you, I graduated almost 4 years ago and I still come here. The food has not changed in the past 7 years, and has been consistently yummy every time I go. 

I am vegetarian and they have always been very accommodating, unlike a lot of other Chinese restaurants. I almost always get the tofu and eggplant dish from their \"combo menu\",  and I upgrade to vegetable fried rice. They also give me hot and sour soup because their normal wonton soup has meat. 

They take care to present the meal beautifully. And it is significantly less oily and \"itis-inducing\" than the typical Chinese restaurant. 

The other major perk of this place is the super friendly waitress. She has known me for many years, and always makes conversation. It is always a pleasant experience coming here, and I would recommend it to anyone. 

Feedback: maybe change the sign of the restaurant and how it looks from the front to make it more inviting? It actually looks very nice inside the restaurant. 

On a side note, my meat eating friends enjoy the food as well. I have heard that their general tsao is very delicious."}
{"text":"Good Chinese/Asian. Very reasonable. Hot n sour soup a great starter!

Tried the chicken curry. Not spicy enough to my liking but otherwise fine.

Arrived after normal lunch period; just one couple in the room besides me. Servers friendly and attentive. I'd def come back next time I'm in the city and this neighborhood."}
{"text":"Right in the heart of Ryerson University.  Food was really good and fresh.  Place was very clean and the service was good.  Lunchtime specials are very inexpensive and come with a hot and sour soup that we great.  Would recommend."}
{"text":"No matter where I go on vacation, at some point I've got to get some Chinese food. I was walking back to my hotel and super hungry. I walked by Good View, looked it up on Yelp, trusted my gut and the reviewed and tried it out.

First, let me say, I have no idea how it got its name because the view was not great. Yes, it had one- of the street, but again, not a good view.

I sat down and ordered one of their lunch specials. I ordered their sweet and sour chicken. My server told me that I would really like their Chinese food. She said their Chinese food was \"Hong Kong\" style which was more common and many American's prefer. I trusted her statement, but I wasn't really worried that I wouldn't like it anyway.

The food came out quickly and I began to chow down. My server came out and scolded me for using soy sauce saying the food didn't need it. I get it, soy sauce is sort of a slap in the face saying it's not flavored enough, but if it's that big of a deal- take it off of the table.

The food was delicious. I loved the sweetness of the sauce on the chicken, and even though I used soy sauce (on my rice), the dish was delicious.

Definitely worth it if you're a local. If you're visiting, it's good, but not necessarily a place I'd have you go to, but if you ran into Good View like I did, you'll probably like it like I did as well."}
{"text":"This is a great Cantonese restaurant where the food is without the oil and grease you usually expect. Their prices are great, a huge meal for four comes out to about $10-$15 per person. The owner is friendly and is always willing to talk about the food, and how she makes it. If you're in the area, it's a definite visit."}
{"text":"Amazing! Great, fresh food, and the kindest owners. Always clean and tidy, and affordable. I come from the other side of the city to eat here!!"}
{"text":"I have been coming to this place for about 3 years now, and I keep coming back for more.

Although not authentic, the food here ranks highly for quality and portion sizes. The owners and wait staff are incredibly friendly and will help you change your order based on taste.

Highly recommended."}
{"text":"Very good food, great taste un nice place to be, fine Chinese cuisine and they have a great choice of spicy meat."}
{"text":"A standard for us. We have been going to Goodview for over 14 years now. The host knows us with our standard order when we get there, veggie noodles with black bean sauce. While it won't knock your socks off, it is a good place to go for some good chinese food."}
{"text":"I wanted to order from Good View a couple of times before doing a review so here goes...

First of all, the Combos for one are an excellent deal, I got sweet and sour pork with chicken and mixed veggies, which also came with fried rice and an egg roll.

The food was scalding hot even after I got it home and was clearly made fresh, not just leftovers reheated, which is impressive for an order for one.  The egg roll was standard as was the fried rice but I was most impressed by the chicken and veggies because the veggies still were crisp and not soggy the way you usually get them in a take out order.  All the food was well seasoned with garlic and such, and not overly salty.

The second visit was General Tsao chicken and beef and snow peas.

The General was my least favourite, a bit too sweet and not enough heat and oddly there was broccoli which made the sauce watery.  

The beef and snow peas was excellent, tender beef with garlic and expertly seasoned, not too salty like most Chinese places, and once again the veggies were perfectly crisp - not soggy at all.

While hubby picked up the order today the woman at the cash was fretting because two drivers had been stuck in traffic near the Queens Quay because of Carribana and Pan Am events, and customers were complaining, so if you want to be guaranteed your food fast order and pick it up, otherwise be patient... Chinese food isn't like a pizza, it can take longer to cook properly and pack up, and if you live more than 10 minutes away, be glad decent food will deliver to you!  So many decent Chinese restaurants downtown don't deliver, and most of the ones that do aren't very good.

Being close to Ryerson, I highly recommend the combos for one, a great deal with lots of food for around $10 and if you order it when you leave, it will be ready to pick up when you get there.  Better quality food than the UofT Chinese food trucks, trust me on that!"}
{"text":"I can never be caught in a Chinese restaurant, because on the off chance my really traditionally Asian mother drives by and sees me eating other people's Chinese food, she might just disown my ungrateful ass. So we ordered takeout, to be safe, and as far as traditional Chinese goes, this isn't it. Was it good? Heck yes! I love me some General Tao chicken (even though he was neither a General nor Chinese). 

I was pretty hangry after a long day of work and we ordered the vegetable fried rice, General Tao chicken, crispy lemon chicken and the hot and sour soup. I seriously judge a Chinese restaurant on the quality of the hot and sour soup, and this one was good. There was no chunks of corn starch, nor really weird soapy flavour you'd find at your typical budget Chinese eatery with that really racist font they use. Both chicken dishes were cooked quite well as well. The crispy chicken dish was a little bland, but that's what Sriracha hot sauce is for. The chicken came with a side of shrimp chips, which is puffy and cooked to the right crunchy texture - none of that drowned in grease soggy nonsense.

Honestly, as far as authenticity goes, Good View is as about traditional Chinese as fortune cookies (they give you those too!) If you want true Szechuan or hot pot or whatever, then go to Scarborough/Markham/North York. But if you want some sweet and spicy crispy battered chicken chunks with some fried rice and broccoli and a side of guilt, then order takeout and throw out the containers before your Asian parents come to visit."}
{"text":"Great value for the price, large menu of authentic Chinese dishes. Staff are super friendly and attentive to help you find something to suit your personal taste."}
{"text":"The lady at the register unfortunately is vocally racist about her black customers. It's a shame. The sub par food will never compensate for it."}
