{"text":"During the times of finals and midterms, I turn into a coffee hermit, where I will practically haunt coffee shops...that is until I finish my exams, then I stop haunting them.
For the record, I have a huge distaste for Starbucks.  Although I live close to 10 different locations, I blatantly refuse to go near them as I can't stand the ever rapid-flowing crowds, lack of tables and getting bitchy responses for failing to get drink sizes right.  After getting coffee from this Good Earth with a friend on a number of occasions, I have been a returning customer.

Thanks to this Good Earth being located away from junior high/high schools, and high traffic streets, it partakes on a laid-back and relaxed atmosphere where its suitable for people that prefer some quiet down-time to themselves or with friends without having rocking headaches or a sore throat from shouting across the table.  Offering an array of chairs and tables to sit at, customers are always guaranteed a place to sit.
The one particular thing that (in my opinion) makes this Good Earth unique to others is the staff.  Being owned and operated by a family, all the staff members are extremely nice, attentive, and accommodating to customers.  And I truly do mean accommodating where they are always willing to serve your drink to you, or specialize a drink to your taste buds.  On other occasions when I had long study sessions at Good Earth, they never pestered me for making an overstayed visit where they always offered to turn the music down or change the station if necessary.  If you have a dog or cat, feel free to bring your furry critter as well.  During the summer the patio (yes they have a patio) is offered to customers who can sit outside with a coffee and spend time with their pet.

I can't really recommend coffee choices as I'm not adventurous in that avenue.  I, do however recommend that you try the food...obviously the mac n cheese, and baked goods are always good.  If you never had their salads or soups, definitely do try them, especially the minestrone soup as its extremely yummy.  Although Good Earth products are pricey, I rather waste my money here for good service and coffee than at a Starbucks."}
{"text":"Love the fact it is family owned, however I am not a fan of the coffee. Soy milk tastes off a bit and the coffee weak. 

I also should mention that the prices are too steep. Cheaper at SB? Yup. Who knew I would find a more expensive coffee place?

The staff are super friendly here though! Could we do a coffee house swap? The green aprons in Creekside could sure learn a thing or two from this customer focused team."}
{"text":"Friendly staff. Great specialty drinks. Generally pretty quick service. Complaints is that for oatmeal to go- they only fill up the container half way (which is cheap) and they use bananas that are not ripe and taste sour."}
{"text":"Friendly staff, delicious coffee, and healthy food make this my favourite neighbourhood spot."}
{"text":"Of all the Good Earth locations in Calgary, this one is my favorite. What makes it better than the others (in my humble opinion) is the staff. As I sat there, I watched them greet regulars by name and welcome them as if they were coming home after being away for a long time.

There are not very many coffee shops up in this neck of the woods yet. This place could give some of the posh downtown spots a really good run for their money."}
{"text":"Great coffee!  Not harsh like Starbucks, no nasty after taste.  The goodies are to die for.  People running it are real gems, very friendly."}
{"text":"I must agree with Moez that this Good Earth location is great.  Other perks that haven't been mentioned are the excellent baked goods that they offer.  The berry bran muffin and the zuchhini cranberry muffin are my favorites.  They are head and sholders above the icky baked goods at Starbucks.  Another kudo for Good Earth is that if you bring in your inuslated coffee mug, they will fill it with any drink for the price of a small.  So my latte is the price of a medium even though it's huge (medium is the smallest latte size they have).  Save the environment and your wallet at the same time!"}
{"text":"Coffee needs improvement but friendly staff, sometimes. A little loud and not very many power outlets for customer use."}
{"text":"I spent a good portion of my afternoon here today with a friend/business colleague. There is ample parking as it is located in the Creekside Shopping Centre. 
This cafe boasts good lighting, lots of seating and a clean environment that is apparently even kid friendly. (toy box near counter)
I ordered 2 chai lattes (for about $6 each, yikes, but typical these days, right?) and also I brought a berry scone home for later. They are said to be homemade, was pretty good, a healthier choice than the muffins I was eye-balling. The chais were good too. Try them with soy milk!
There was never any feeling of us over-staying and we were left alone to do our thing and it was quite enjoyable. I would meet other clients at this cafe any day."}
{"text":"Best coffee place inn the whole city and right in my neighborhood, all staff are knowledgeable and super friendly... Food is amazing....MAC N CHEESE..mmmmmmmm"}
{"text":"Good Earth, although arguably a franchise, boasts the \"Independently Owned & Operated\" tag that these days is all too common.  They are, however, one of the few franchises that are true to this tag.  I have visited several Good Earth locations in Calgary and have had mixed results.  Sure, the coffee usually tastes the same and the food doesn't vary much, but the ever important service makes the difference.

This location, found in the relatively new Creekside Shopping Centre, is esthetically no different than the other locations.  Despite that, it still retains a very unique feel and atmosphere that you won't find in other franchise coffee houses.  I'll start with the music.  From what I can tell, the music is usually chosen by whoever is working.  I've walked in, only to be greeted by everything from alt-rock to country to classical and even some light metal.  To me, awesome.  Although I may hate some of the music choices, it makes me feel better knowing that at least the employees are enjoying it.

Service here is fantastic.  I enjoy being greeted every time I enter the store.  And a few employees remember my drink of choice and start as soon as I arrive (extra large, medium roast coffee, nothing too crazy).  They always, and I can't stress how important this is, confirm what I want before starting.  Nothing worse than feeling adventurous and not being able to choose.  Although I rarely stick around longer than it takes to add some milk, there always seems to be room to sit if you want.  And they have a patio!  This location is also very pet friendly and has bowls of water outside for your best friend.

The only downside to this Good Earth is when it is busy.  90% of the time, whoever serves you will make your order, which can cause a bit of a line-up as they catch up with orders.  You can miss the oiled machine that is Starbucks quite easily as minutes fall off the clock waiting just to order.  For some strange reason, despite virtually no difference in time, I feel better waiting for my drink to be made instead of waiting the same amount of time to order it.  Maybe it's just me; my patience is fickle."}
{"text":"I have to agree with Moez that this Good Earth has extremely friendly staff, so friendly that one day I arrived just when they were closing but I had no idea.  They made me a coffee drink even though all the coffee machines were cleaned already and then stayed 15 minutes past the closing time.  I had no idea until I was leaving and I checked my watch.

Besides all the good coffee and my favourite blond cranberry square, a more attractive asset this location has, is the view.  There is a nice serene view of a pond here, and it is such a treat for me to sit at a trendy coffee place and watch wild ducks swimming around. That's the beauty of Calgary though, nature is still so present here and the animals don't seem to mind us being around"}
{"text":"Cozy place and friendly staff, food is always fresh and delicious. Sometimes it gets loud but still a good place to work on the computer or read a book. Patio with great view, one of my favourite places."}
{"text":"I went back to this Good Earth location this morning.  I tried the Irish Cream latte, and could have sworn I saw angels.

Okay, so it turned out to be two kids in mid-jump on a trampoline, but the latte was delicious, nonetheless.

I've changed the review to 4 stars, and look forward to another latte tomorrow morning."}
