{"text":"Found this place on Yelp and thought we would try. Husband and I had the brisket, kids had pulled pork have to say we were really pleased everything was very tasty (highly recommend the cheesy potatoes.) The staff were extremely friendly and we will definitely be back. So hard to find decent places to eat in the valley, love to support local business and hope this little place makes it!

UPDATE! 
We made our second visit, I am changing my first rating of 4 stars to 5 stars! This place is probably one of the top restaurants we have been to. Staff once again was very friendly and the food was awesome!  I hope they are around for a long time!"}
{"text":"had the pulled pork sandwich...was awesome. the coleslaw was great.   a friend was eating the cheesecake...stole a bite...that was very creamy was very happy...food was all great."}
{"text":"My family and I absolutely LOVED our lunch experience!  Everything was so delicious!  We traveled to Arizona from Texas and decided to give this BBQ place a try.  The meat was cooked perfectly.  The side dishes were so tasty.  Our daughters loved it so much, they begged us to go back through Surprise, AZ on our way back from Nevada so they could eat there again!  Thank you, Got Que, for making our list of favorite restaurants during our 2017 Summer Family Vacation!  We'll certainly see you again next time we're in AZ!"}
{"text":"Pretty good food. Cheesy potatoes were amazing but small portioned for the family pack. Tried the ribs and pulled pork. The pulled pork was very good, I have never had luck finding a good (not super salty) pulled pork sandwich in a restaurant. I'm not a huge fan of smoky sauce so I think they should give the option of smoky or sweet sauce. Did not like the ribs without the sauce. The cheesecake is beyond ridiculously good. However, it is WAY overpriced for the sliver of a piece that you get. Overall, I would go back again but not very often. The people that work there are very nice and knowledgeable - they gave us tips on the ribs."}
{"text":"The food was great. You could tell that the put a lot of time into their food. Great BBQ souse and favors. Love the mom and pop attitude of the restaurant. Could use more Decor it seamed a little light on that. Some fun pictures or signs something. Otherwise it was great."}
{"text":"Checked this place out for the first time yesterday. I ordered the pulled pork with cheesy potatoes and my husband ordered the brisket sandwich- lean with cheesy potatoes. You can have onions and pickles put on your sandwich. Since I had never tried either on a BBQ sandwich, I tried both. 

The gentleman who was cutting the meat was very friendly. I'm guessing maybe he was the owner? He even brought us out a sample of the ribs, which were delicious. We ended up ordering a half rack to take home. 

We will definitely be back again. I enjoyed the pulled pork sandwich, but my husband said the brisket was a little dry. I also liked the cheesy potatoes, but they were just ok to him. Next time he said that he will order the ribs. 

I just wish there were a few more options on the menu, like maybe hot dogs and fries for the kiddos."}
{"text":"The Brisket Texas Chilli is an excellent choice; each spoonful is filled with such flavor that it doesn't matter if it is cold out or hot, it's tasty.  The Sheriff Brisket Sandwich is also a great choice with a sauce from the family recipe book!

The owner (Eric) checks for feedback after the meal but all of them that I overheard were positive raves for the appeal of his Texas BBQ cooking!  I concur.

The decor will build over time but the recipes are great right now.  Thanks, Yelp, for steering me to the wonderfully surprising experience in the town of Surprise, AZ."}
{"text":"First time there today. Awesome good food and place, best service ever. Will return for sure."}
{"text":"Great new place. The owner is so friendly. Food was fantastic. Simple menu but everything was perfected. Loved how they had lean brisket. My only issue would be to add smoked turkey to the menu!!!! The bbq sauce had a great flavor. We will be back."}
{"text":"The Barbecue is Excellent!!! Loved the Cheesy Taters!!!Quick and Great Service!!! I Highly recommend this place for some Good Ol Barbecue!!!! :) :)"}
{"text":"Good service.  Small place and I always like to go to small independently owned places to eat.  Had the pulled pork sandwich and it was tasty.  I agree the buns need to be changed.  Give it more time and a bigger menu choice and it could do well in Surprise."}
{"text":"I went in on a Sunday.  The pulled pork was tender and very tasty. The cheesy potatoes were great too. Not a fancy place but very clean and comfortable .
Owner was friendly and was concerned about providing good service,he did.
Going back to try some of the other items.
Glad to have them in the neighborhood.
Enjoy!"}
{"text":"Went yesterday. Brisket is fork tender. I got the sauce on the side as brisket can be fully enjoyed without it. Meat falls off the ribs. Excellent value all around! Slaw was great. Beens not overly sweet, my brother loved them."}
{"text":"Hidden away in a Surprise shopping center, this locally-owned place served BBQ worth searching for. Pulled pork and brisket are featured in appetite-quenching portions. Friendly people doing a good job. Do yourself a favor and stop by.
Enjoy lunch or dinner or take out."}
{"text":"This is the best BBQ place in the west valley. The food was amazing, very reasonably priced, and the service was great! I plan on returning here and wish there was one closer to my house."}
{"text":"The ribs and brisket here are delicious!  They are well seasoned, juicy and flavorful.  The cheesy potatoes are great and they are generous with the portion.  The guys that work here are so friendly and I feel like I'm getting a plate at their home."}
{"text":"I just moved here and my mil picked up some food to go and I was amazingly shocked at how good this food is. The ribs don't get much better than this. The potatoes...yum.  Don't even get me started on the home made cheesecake.  All awesome!"}
{"text":"This place is awesome! Pulled pork is so tender and flavorful! Everything made from scratch and very friendly service! If you're anywhere near Surprise hit this place up! It's excellent!"}
{"text":"This place has the best BBQ r so and brisket that it melts in your mouth. You got to try it. Prices are great and  the kids will love it to."}
{"text":"My 2nd review for Got Que. 
Try it you won't be disappointed. BBQ is top notch for sure. I have never had a bad meal here. Great customer service, super nice staff and owner. They make their own sweet and spicy pickle chips that are darn good. I would give 5 stars if they used a quality bun, and freshly grated cheese. Real plates and silverware would be nice too."}
{"text":"The price is way out of line for the size of the portions of bbq. The food was average couldn't  really tell with what little portion we were served. The sides were Very blan."}
{"text":"THIS PLACE IS A DISASTER!!!

Me being a native of Texas I was finally glad to see this place open up.  The first time I went there with my wife and son at 630pm for dinner and they were out of 80 percent of there menu.  No ribs, brisket and 1 scoop of cheesy potatoes left.  A few weeks later we tried it again at 630pm and we were greeted by a sign that read \"all out of meat\".  What kind of place is this.  Then they had an employee who tried to explain why they were out of meat.  What kinda of restaurant consistently runs out of food at 630pm.  I've been to plenty of restaurants that were new and they were never out of food...especially at 630pm.  They might as well only be open for lunch.  This place would be the laughing stock of BBQ if it was in Texas.  I will never attempt to eat at this place again."}
{"text":"Excellent tasting and fast BBQ, easy highway access helped get us back in the road quickly."}
{"text":"you people in arizona have no clue what bbq is supposed to taste like.... this place is terrible the ribs are plain with no taste..the sauce is watered down also with no taste and the ribs dont fall off the bone!!!!"}
{"text":"Seen this place many time but been scared to try it as most BBQ places are sub -par . So I put on my big boy pants and gave it a try and I was shocked at how perfect the pulled pork was the portion size was very good also. Will eat here often."}
{"text":"This place was recommended so we thought we would give it a try... thank God we did! Awesome!! Customer service was awesome!! Ordered the family meal which was pulled pork w 2 sides.. we also tried the brisket chilli.. omg so wonderful!! Then while ordering a lady said to try the home made cheesecake thank u for that ..it was also great! So glad we went and will be going back soon :)"}
{"text":"Came here for lunch with my son. He had the 1/2 ribs and I had the ribs and brisket platter. My son said those were some of the best ribs he's had and I agree. The brisket was pretty good too. The owner was very nice and friendly too. Will definitely be coming back soon."}
{"text":"Family feel, small not a lot of choices but Everything tasted great.  The pulled pork tacos and cheesy potatoes were awesome!!!"}
{"text":"Great new BBQ place next to Frys Marketplace. I had the brisket and potatoes and it was delicious. Their sauce sealed the deal for me. Check them out and help support our local businesses."}
{"text":"My son and I had a couple of brisket sandwiches that were great. Not many places like this in Surprise. Nice to see them here."}
{"text":"Darn good barbecue!

I had the pulled pork, Mom had the brisket, and Dad had the ribs. We were all quite happy with our choices.

Moderately smoked and very tender with a flavorful, not-too-sweet sauce.

The sides - we had coleslaw and beans - were nothing to write home about. Fine, but ordinary. I would have liked cornbread, but that wasn't an option.

The picnic-table decor is cute, but my mid-70's parents had some trouble with the built-in benches and no backrests. A few tables with chairs would be nice for the older folks.

Personally, I like a *really* smoky barbecue and a spicy sauce. This was neither of those. Still, a better-than-average barbecue.

I think that take-out would be a fantastic choice for a large gathering."}
{"text":"Unfortunately they were out of brisket, but since it's their first day and we came off hours I read this as a good sign (high demand). My wife and I both had the pulled pork and ribs with their coleslaw and cheesy potatoes on the side. For dessert we split a slice of cheesecake. The entire meal was delicious and I was pleasantly surprised to find it easily comparable to some of the better BBQ places I have eaten at while traveling to Kansas City. We will most certainly be regulars here (and may even come back this evening to try the next batch of brisket)."}
{"text":"I have ordered pulled pork, brisket, and cheesy potatoes multiple times for my family. 
The food is amazingly delicious and the staff are super friendly. The restaurant is so clean and open. We have become regulars."}
{"text":"We recently moved from Houston, Texas. We have been looking for a BBQ place since January. Found this one on Yelp.

The young man behind the counter said the owner was from Texas, and everything was made fresh there, except the buns.

We ordered the meat plate, which was two ribs and brisket. The sides are separate. We tried the beans and cole slaw. Young man gave us extra to try since we told him we were from Texas.

The counter help was very friendly. 

The meat was very good. Good smokey taste. Sauce was sweet type, also good.

We did not care for the cole slaw, too dry and had pepper in it. We like sweeter and wet style.

Beans were ranch style, they were ok.

We will be back for the meat, probably pass on the sides"}
{"text":"The first time we came in they had ran out of some menu items so we didn't order and left. The second time they were out of things again specifically the ribs and cheesy potatoes. The menu selection is small as it is so it's not good when they are always running out. The pulled pork was good but not served hot. They recently opened so maybe they are just figuring things out. The staff was very nice. The place was clean but hot inside there. I will give them another chance before I say I won't go back."}
{"text":"Authentic BBQ from Texas.  Been open a year.  Pulled pork is excellent.  Cole slaw is homemade. Family pack offered on Monday, Tuesday and Wednesday for $22.00 Enough to feed 6 people.  pulled pork, 6 buns, 2 pint sides.  Ribs are tender.  Simple menu but well done. Can't wait to return."}
{"text":"Absolutely delicious food. Restaurant is clean and cute too! My kiddo loved the food too which is always a bonus! We will definitely be back here for the affordable and great tasting barbecue! So glad we stopped in to this place!"}
{"text":"Great little B-q place. Lots of room for the whole family. I love the pulled pork sandwich and sides. The staff is friendly and helpful."}
{"text":"Amazing Ribs!! Loved the brisket and the sides, very friendly service and very clean!"}
{"text":"I have had such great luck at Got Que in the past which why I've visited this west side eatery over a dozen time this year. I normally go for the moist brisket and it's locked in juices with smokey flavor. Very tasty.

I'm not sure what happened, but tonight's moist brisket tastes like BAD shredded beef. It is not the tender BBQ that I'm used to. There's another BBQ restaurant popping up not too far from Got Que. Sure would come in handy on nights like this."}
{"text":"Great pulled pork sandwiches 
Ribs were good
Parking can be difficult at certain times"}
{"text":"We went for early lunch, before the rush, because we heard it's first come first served. It's a when it's gone it's gone restaurant.  Simple fair and atmosphere.  Picnic tables with vinyl cloths. Very clean, including the rest rooms. Definitely will go again."}
{"text":"Ohhhhhh yeeee hawwww ! My husband I always say if you can't smell it it's not good bbq and you can smell this place a mile away!  We did the take out Family combo you get 6 buns a huge portion of pulled pork and 2 pint size sides with are either coleslaw cheese taters or beans. We did the coleslaw and cheese taters. Buns are soft and amazing the pulled pork is juicy and coleslaw is the cherry on top! So happy we finally stopped in! Restaurant is very clean. Soda station is also very clean which is huge! Employees are very friendly! We will be back with the whole family to share this greatness!!!"}
{"text":"Best BBQ in town! We tried the pulled pork sandwich, brisket sandwich, brisket chili, cheesy potatoes, and the coleslaw... all of it was delicious! The owners are super friendly and helpful!"}
{"text":"I ordered a jumbo pulled pork sandwich with coleslaw. That was it. It was somewhere around $12.00. They gave me just one small half a cup of bbq sauce for the sandwich. The coleslaw was so nasty I thought it was spoiled. One the positive side, the pickles were good."}
{"text":"First time stopping in the smell pulled in although i can not speak from personal experience but my other half says a lover of barbecue that it was really really good and seeing that says a lot for the city we live (Surprise,,az) where u cant really get a good meal!!"}
{"text":"I usually try to avoid strip mall restaurants...i was shocked to find great service..and stellar food. The brisket was the best I've had in years..ribs were delicious and falling off the bone. Simple sides were well done...and cheezy potatoes were wonderful. I highly recommend this place to anyone who actually loves good bbq!"}
{"text":"Good BBQ place not the best but it was good . I tried their BBQ ribs and they were good and it comes with 2 sides I believe you can pick any i.e. Coleslaw and beans. The staff was friendly prices are a bit expensive $$ but overall it was good. 

I gave it 4 stars because I felt like they could've done better on the food . The sit down area is pretty nice it's like a picnic table."}
{"text":"It's a tiny little mom and pop joint with the menu in chalk. You know it's gotta be good right? It is. I'm not gonna lie, it caught me off guard how good the meats are. The brisket is pure perfection and you get a choice of fatty or lean cut. The pulled pork is also amazing on its own, but there's a secret to make it better. They have a Carolina BBQ sauce that is better than anything I had living in southern Virginia for three years. Put that on the pulled pork and thank me later. Get a side of the slaw and add it to the sandwiches too, it's great. I'll be back here for the ribs next."}
{"text":"A co-worker mentioned this BBQ restaurant located in Surprise. Normally, I would drive to Famous Dave's for BBQ (absolutely LOVE their Banana Pudding).

I was thoroughly impressed. My mother always says, \"Good BBQ does not need BBQ sauce!\".
Got Que has very GOOD flavor without the sauce! Good smoke flavor and good seasoning.

Definitely will be going back! As a matter of fact, will be going back tonight!"}
{"text":"Looking for good barbecue, this is the spot. Small, unpretentious shop, order at the counter. They keep it simple with 3 meat choices and 3 sides. We had pulled pork which comes with variety of sauces, I tried Texas and my boyfriend tried Carolina, both good. The cheesy potatoes were yummy. The baked beans were good but I prefer a more vinegary taste, that's what my mom made. Owner brought us each a rib to try. OMG, wish I had ordered those. Dry rubbed, smokey, no sauce required. Thick meat on the bone. Will be back for those.

If you want atmosphere, order take out and eat at home but this is the real thing."}
{"text":"The pulled pork is really good I've had the brisket it seems as though the food is cooked somewhere else and then brought to the restaurant in aluminum trays. Unfortunately there are only three items on the menu in the meat department. You have pork ribs beef brisket and pulled pork. I sure wish they had chicken. 

Also there are no orders taken over the telephone. I was shopping next door and wanted to pick up a family size meal and they refused to take the order on the phone they insisted that I come in and order it and sit and wait."}
{"text":"Seriously LOVE this place. The food is outstanding! Service is amazing! We loved that the owner is right up in front serving food and getting to know his customers! The menu is small but i love it because they have 100 percent perfected every thing they have! My husband is obsessed with super hot bbq sauce so the owner took it upon himself to make some specifically for my husband. Don't pass got que up! It completely surpasses every other bbq place we have around here!"}
{"text":"Excellent !  Brisket and ribs are amazing! Cheezy potatoes are the BANGIN'! Best BBQ in surprise !"}
{"text":"Fantastic. We had the pulled pork with Extra Carolina sauce. Moist just the right amount on tang. Coleslaw very fresh.  I would prefer a coleslaw with some vinegar tang."}
{"text":"Driving through AZ on our way back to Cali and looked up some places grab a bite. We had the brisket sandwich combo w/ cheesy potatoes. This place is amazing and deserves every star. So good that when we finished our meal, we ordered a Brisket Family meal to go. I wish I had one close to home. Come by, the owner is down to earth and gives great customer service. You can taste the love in the food."}
{"text":"Pulled pork here tastes so good. Not a huge selection of main and sides but what they have is delicious. Five stars because of their family meal which is a huge tub of meat, buns, and two huge sides for $25. Feeds my family of five cheaper than fast food and tastes so much better!"}
{"text":"The food here is great,  down home BBQ and sides.  Service is always friendly and fast. The kids love this place.  It's not fancy but tasty and the best BBQ in the area."}
{"text":"We have been going to this place since it first opened and we love it. Cooks have changed a bit but the food is still good. You can't beat the price or those cheesy potatoes."}
{"text":"How could a restaurant run out of food at 6:00pm? What they did have was okay, not great but not bad."}
{"text":"Understanding that everyone's pork barbecue likes are different, I am a lover of good pulled pork and will pull off for it whenever the chance occurs.  This is very good pulled pork, served on a fresh bun (pulled out of the wrapper as you watch!) and served with optional slaw on top or on the side with a couple of sides available.  This is an indoor, sit at a picnic table and get your chin greasy food place, and they do very little else.  But what they do, they do quite well.  If you are in the mood for barbecue (they have chicken, beef and pork) and want to try something new, pull in and give it a try.  I would go back if in the area, and I can recommend it you, also."}
{"text":"Great food for a great price! I had the pulled pork and cheesy potatoes both were very delicious. I highly recommend it!"}
{"text":"First time visit. The staff was very friendly. The brisket sandwich is delicious and tender. The coleslaw was good. The pulled pork sandwich was very tasty and had great flavor. The Cheesy potatoes are one of the best things I have ever tasted. I will defiantly be going back."}
{"text":"I love BBQ.  This was great.  Wish I had found it sooner.  I had the pulled pork.  Sooooo good.  Lots of meat for the price.  Coleslaw was great too.  Wish I had read the reviews first about the cheesecake.  Next time!  I will be back.  I go to the Mexican restaurant around the corner a lot and never saw this place.  Nice surprise."}
{"text":"We will always come to this Non Chain Small Business Restaurant. Like to support local. We have never had a bad meal here. Dining is casual or use their carry out. Owners & staff are friendly and helpful! Yummy"}
{"text":"Great food and friendly service every time we have eaten here!  We will definitely be back!"}
{"text":"Stopped by today for lunch.  Moist brisket,cheesy potatoes and coleslaw DELICIOUS!.  I'd read previous comments on the brisket and potatoes (which were excellent) but I have to say this is probably some of the most favorable coleslaw's I've had in the last 10 years. Excellent Service and Yummy food!!"}
{"text":"Good Que...bare bones place, lacking interest or ambience, simple menu, good food, well priced.  Will be back!"}
{"text":"Cashier/Chef was very polite when taking our order and serving our food. I would tell all my friends to come eat here. Food was damn good and I am definitely coming back"}
{"text":"We love Got Que. They have perfected the items they sell on their menu, the staff treats you like friends/family. Great hidden gem within our city."}
{"text":"OMG! Delicious! We couldn't decide on dinner and we have been so tired of the limited choices out here. We were certainly not disappointed in dinner here tonight! We got the to go dinner which was the pulled pork, buns and bbq sauce, and two sides. We got the cheesy potatoes and beans! Wow! Wow! Wow! What a great choice for a super quick and really good dinner! Generous portion of food and for really the same amount as you would spend on pizza and wings. Definitely a repeat!!!!"}
{"text":"Tried this place today got a slab of ribs to go and two sides coleslaw and cheesy potatoes. Sorry to report none of it was very good. Coleslaw was awful cheese potatoes were just Ok Ribs have a very heavy dry rub which we did not like. We definitely will not get food there again."}
{"text":"This establishment was good, the meats were all very tasty. The reason I am giving it a four star rating is because they didn't sell any chicken. Over all, its a good place to eat if you love red meats."}
{"text":"Immediately upon walking in this establishment, you feel welcome and appreciated.  The couple that owns the restaurant are smiling ear to ear, very friendly, and you almost feel like you just walked into a family BBQ.  You can watch them make your food, the menu options are hard to choose from, and before you know it, the food it ready to eat.  My husband and I both ordered something different so we could share and try a couple of different items, and wow, everything was so tasty!!!  The entire experience was good from start to finish and we will definitely be going back!!!"}
{"text":"Had the regular pulled pork sandwich and loved it. With or without sauce the sandwich has great flavor. Brisket chili I didn't care for but the others in my group liked it. The prices here are excellent."}
{"text":"best \"secret spot\" you need to discover and eat at NOW! 

I honestly cannot remember when was the last time I ate at an establishment that had that 'feel-good-family-gathering' vibe to it. The owner was pleasantly friendly, (and since we were the only family eating at the time) he gave us privacy to eat; but struck up a nice conversation once we finished eating--exactly like it would be if you were visiting back home for the holidays, eating at a relatives home.

Lastly, and keep in mind this is coming from a person that is known to NOT like cheesecake: 

GET THE CHEESECAKE! my tastebuds were mind blown--I even got an extra slice to go!!! 

best part??? you can order an ENTIRE cheesecake for yourself...I mean, to share! just make sure to order 2 days in advance because this piece of heaven takes 12hrs to make!!! An entire delicious cheesecake without the hard work? YES PLEASE!

and the food??? Let's just say that my very picky 6yr old gave her dinner two big thumbs up of approval!"}
{"text":"Great place!  The brisket was amazing!  Both our picky eater kids loved it and ate every bite.  Cheesy potatoes, pickles, chili and cheesecake were all very delicious!  The sauces are not too sweet and are perfect for anybody.  Very friendly staff and the portions are very generous for the price.  Definitely recommend to everyone!"}
{"text":"This place is the best bbq spot on the west valley.  The ribs are a smoky heaven of flavor. The cheesecake is to die for.  I can't wait to go back and try the pulled pork."}
{"text":"Very VERY nice people, extremely generous to the community.  I wish I could rave more about it because the owners are SUPER friendly (5 stars all the way) but the bbq itself is just adequate; 3 star at best. The coleslaw was crispy and fresh which I love, but  the dressing was flavorless. The cheesy potatoes are unique and a great touch but flavorless. Everything felt like it needed more salt (as a chef, you can tell when not enough salt has been added) and just more pizzaz. The ribs were dry. The pulled pork was moist and lean but just meh with store bought Fry's hamburger buns I can do at home.  The real sticking point for me was that they have no poultry;  only beef and pork are offered here. The menu is super limited. 

I really want to give them better than 3 stars and while they are really super nice people, I'm not eating people--I'm eating bbq. And this bbq is just 3 stars."}
{"text":"Stumbled on this gem while looking for a house.  As Californians, this is by far, hands down THE best bbq we have ever tasted!  Friendly staff and very interactive!  We are definitely coming back here often!  Can't wait til we move here and can visit often!!  Thanks so much for great food and great service!"}
{"text":"Hands down the best BBQ on the west side! I have ordered for my family on multiple occasions, I have also ordered for large parties (60+ people). the food is always great and very reasonably priced. the employees are nice and knowledgeable! When I do the large catering sizes, the food is always ready to go right when they said it would be. they even help by splitting it up into to groups for me to help with transport etc. I will be back, and I tell everyone to try this place out. I get the pulled pork sandwhich with their home made coleslaw on top! hot/sweet peppers on the side for a little kick! 

the place is also perfect for kids, very open and well lit.

Whatever you do, you must order a slice of the cheese cake! it is one of the best I have ever had!"}
{"text":"I have tried to go to this place twice.  The first time I showed up it was just about to close and they were out of some items.  Given the time, I did not hold it against this business.  The second time I called 2 minutes before my arrival to make sure they had what I wanted to try (learning from my first experience) and they said that they did indeed have pulled pork.  I show up and the person in front of me was the last person to get any pulled pork before they ran out.  I understand that a real bbq place will run out of almost everything each day, but if it was run knowing that they would at least have the wherewithal to let the phone in customers know that they are almost out.  Mind you, I called 2 minutes before... Not 10, or 15, or 30 minutes, but literally from down the road.  I will not be trying this establishment out until they learn a little customer service."}
{"text":"Got the pulled pork with coleslaw. Pulled pork was really good but the slaw not so much. I tried the cheesy potatoes, they were good. Kind of a simple place but it's clean and the staff was very nice. I would go back."}
{"text":"Read the reviews and thought I'd give it a try.... I'm hooked! Got the brisket meat plate w a side of cheese potatoes and was stuffed, so I only got a half rack of ribs to-go. Gotta say the staff was very nice."}
{"text":"I was in the area and decided to stop by based on the reviews I read. Some of the best pulled pork I've ever had. Ribs and brisket are delicious. Owner was very nice and accommodating. I'd definitely be willing to drive 30+ minutes just to eat here again."}
{"text":"My husband and I were looking for a great place to eat after our 10 mile hike in the White Tank Mtns. We were in the mood for BBQ and found Got Que? Through the Yelp reviews. It did not disappoint! I got the meat plate and absolutely loved the brisket, so very tender and tasty!! My husband had the pulled pork sandwich and really liked it along with the cole slaw. 
We'll be back when we're in the area again. Great food, very clean, and friendly staff."}
{"text":"OMG I keep going back haven't found not one thing that was bad. THE BEST BBQ PLACE IN AZ! The ribs are to die for! The Cheesecake is really good. You have to try it. And the Cheesy potatoes are like something I've never tried before coming here they are amazing! Can't come into this place and not buy all 3. The ribs are soft and Smokey."}
{"text":"I'll just say this. EVERY time I come to this side of town I come here. Fantastic staff and haven't had a bad meal yet. The cheesy potatoes are the best I've ever had."}
{"text":"Tried the que, pretty good smoked brisket & ribs.  The cheesy potatoes were as good as I make at home.  Sauce wasn't my thing as I am a Kansas City BBQ fan, sweet sauce.  But the meat was smoked right.  Simple menu was great."}
{"text":"Ok, ok, ok.   I am not a huge fan of barbeque places so I didn't want to come here in the first place.  But, this place makes me want to become a regular.

Their appearance is minimalistic but spotless.  So clean & open.  The employees were so nice & I loved his cowboy hat.  

I ate brisket & my husband ate pulled pork.  We couldn't decide on the side so we both all 3.  I expected not to like something but i can't say that.

The brisket was moist & flavorful.  The texture was perfect.
His pork (i stole a bite for review purposes lol) was juicy & fell apart.  It was savory.

I liked that they serve the bbq sauce on the side bc I don't like my stuff drowned.

The sides were: cheesy potatoes, coleslaw & beans.
Each were very good.  The coleslaw was less sweet than I'm used to be still very enjoyable with that extra kick from the black pepper.

Cheesy potatoes were yummy like a casserole you'd make at home.
 
Those beans were ranch style recipe.  Not sugary sweet baked bean.  Not bad at all :)

Will be back with friends.  This town needs more places like this.

They made me a fan of barbeque places.
Well done!"}
{"text":"Cheesy potatoes are awesome.  Cheesecake is also really good.  I only order the Family Pack and easily feed two adults, two teenagers and an almost teen with leftover meat for two more sandwiches (can make 8 even though they only give you 6 buns).  Family Pack is only for to go but is a bargain for the price.  Crew is really friendly and treat you like family."}
{"text":"I pulled out my phone on a recent visit to AZ and searched the Yelp app to see what what new in the area and Got Que? came up.  Decided to check it out after reading the reviews. It is kinda hidden to the left side of a Fry's Marketplace in this shopping center.  Upon walking in, we were warmly greeted.  I believe it was the owner who helped us.  He was very friendly and helpful.  Menu is kinda on the smaller side.  We decided on a Meat Plate that comes with ribs and brisket and also ordered a Jumbo Brisket Sandwich.  There is mild BBQ sauce and spicy, we opted for both.  I preferred the spicy sauce which had a nice bit of slow burn to it. When ordering the brisket, the owner asked if we wanted lean or fatty.  I chose fatty because why wouldn't you, and it did not disappoint.  The mean was tender, flavorful and moist.  The ribs were equally delicious, too.  I drizzled both sauces on the brisket and ribs.   Sides are extra here and we chose the Cheesy Potatoes and Baked Beans. Both were tasty, but I absolutely loved the potatoes.  So yummy!  There was also pulled pork, brisket tacos, brisket chili, Frito pie and beef sausage on the menu and specials board when we were there. 

There was ample seating in the dining area in here.  There was a group of city service workers eating here which to me is always a good sign.  Cops, fireman and service workers are, in my book, a good indicator of tasty food from my experience :)  A nice little mom and pop hidden gem for BBQ in Surprise. Hope to be back soon in the future."}
{"text":"Stopped by Got Que with a friend for lunch on Saturday.  It is located next to a Fry's grocery store so there is a large parking lot which was pretty full on a Saturday afternoon.  The storefront location is bright and clean with plenty of picnic table seating.  The owner was behind the counter carving orders as customers stood in a short line.  The menu is pretty basic.  Texas style brisket (lean or moist), pulled pork, and ribs. We opted for the two meat plate with moist brisket and ribs.  We were given an ample portion of beef and two meaty baby back pork ribs. 
 There are a variety of sides available but based on my research we choose the cheesy potatoes which were excellent.  You get a choice of spicy or mild bbq sauce and I had the mild which was a vinegar based South Carolina or Georgia style and served either on the meat or on the side.  If you are looking to support a local business with really tasty bbq in a family friendly tidy atmosphere Got Que fits the bill.  I will be back again for the moist brisket and cheesy potatoes."}
{"text":"Went here today with the family we had the following 
Ribs: we a little over smoked you need to eat them with BBQ sauce as the rib alone did not have much seasoning. They also left the membrane on the back of the rib which is different. Half rack $12
Brisket sandwich was good 
The thing I liked the most was the pulled pork. It was the cheapest item too. I would recommend a better bun than just a regular hamburger bun. Even if they upcharged for a nicer bun I would pay more. Or talk with one of the local bakery to get a better bun or rolls to add to the meal. 
They need  to fill up the cups of BBQ sauce to the top ours were all half full.  The cheesy casserole was good and very different. 
Most BBQ places make a good tea they need to offer that as good tea pairs well with BBQ. 
Glad we have a BBQ place in surprise I think they will continue to get better."}
{"text":"My other Q experience in Surprise was Dickies.  We were so disappointed their quality, price and service that we have not returned.  A neighbor recommended Got Que?----had to try them.  No comparison,  similar menu, friendly service and the food, in our opinion, is as good as it gets.  Have been back several times and not one regret!"}
{"text":"The food here isn't that good. The slaw was absolutely horrible. The meat was ok but the sauce they put on it was gross. 
If you want good bbq, make the long drive to Rudy's they have the best and it's worth the drive/time to get there"}
{"text":"The food was amazing and to top it off, the gentleman working and the owner were extremely friendly. They didn't hesitate to make conversation and ask us how everything was after we sat down. The brisket was out of this world and the potatoes were to die for. We will definitely be returning. I recommend this to anyone into some good bbq!"}
{"text":"The day or two after they opened, I went in to get a to go menu. The wonderful smells coming from inside were to die for. So eventuallly I did go there for a family pack to take home. Holy Cow! It was delish. However, I must say that my eldest son who lives in Phoenix, has a Shanes Rib Shack near him and he took me there for lunch, they are really really good, however, if Got Que had a more extensive menue... they would deff be a major competition. Also, I think that It would be a great addition to Got Que if they had different BBQ  sauces.... spicy???  I do not like spicy but the rest of my family does. Perhaps fries? However, I understand that you are still establishing youselves.....just suggestions. Still, pulled pork.. amazing! AND a great staff!"}
{"text":"The food was amazing! Will definitely be back! I had the ribs and the meat was falling off the bone. The cheesy potatoes were delicious. Friendly staff and very clean environment!"}
{"text":"Was pretty excited this place opened locally. I had their half rack of babby backs, wife had the pulled pork sandwich. Kind of pricey, Twelve dollars for the ribs. At that price they better be great, however they weren't. Ribs were dry, not much flavoring, and you have to tear them off the bones. Sandwich was decent, need to use a better bun. Coleslaw was excellent. I would like to come back again to try something else."}
{"text":"Excellent BBQ!! The gentlemen that helped us were very friendly and knowledgeable about their menu, they adjusted our second plate and made sure what they served was fresh. We will be back soon!"}
{"text":"Its so good!! We had pulled pork, ribs and brisket for our meats. The cheesy potatoes were to die for! They are new, they run out of food so get there early! I am all for small business/ shop local, and supporting the community. The one complaint I heard was they use store bought buns, big deal! We go there for the meat, not the buns!! The manager, Ricky even went around table to table asking everyone how their dinner was. From what we overheard, every single customer was raving and are mostly repeat customers!  Glad we have a new place to eat at!! Try the cheesecake too! You wont be disappointed!!"}
{"text":"Very good food must try! The their BBQ brisket is amazing  and my husband loves both the cheesy potatoes  are to die for .You better there soon their food is so good  they run out!!"}
{"text":"This is my new favorite bbq place! The people here are very friendly, the food is just the best around. We tried both the pulled pork and the brisket. The pork was very good and tasty, but the star was the brisket. It is hands down the best I have had. Not dried out, tender and super flavorful. Just try this place!"}
{"text":"I got the six shooter with cheesy potatoes and I was extremely happy with it and it was delicious. My girlfriend got the beans and she is obsessed with them now. It's kinda pricey but at the same time it's not just burgers and fry so you have to pay for quality. I'll definitely be back."}
{"text":"The barbecue here is delicious. Would have liked a few more side choices and maybe better serving dishes. But otherwise they're doing bbq right at this place!"}
{"text":"Amazing bbque meat is tender and the cheese cake is to die for. The people are nice and friendly too"}
{"text":"This was our first time coming here and we will definitely be back!  All the food we purchased was delicious including the pulled pork, beans, cheesy potatoes, cole slaw and cheesecake. Everything is made from scratch and has that homemade taste and the inside gives you that backyard/homey bbq feel. The owner and staff are super friendly and the prices are very reasonable. Can't wait yo come back!"}
{"text":"Not the best barbeque I've had, but damn good. Very friendly, excellent sides. Why does Yelp want me to type more? Who cares if my review is shorter than most? I said what I mean to say, and that's all I have to say!"}
{"text":"We went to got que today and will not be returning.. First we told Ricky the server that we had need been there before and we asked for a sample.. He looked at me like I had 3 eyes. So said I'd like to try the brisket and pork and see which I like better. He rudely stated the brisket tastes like brisket the pork tastes like pork. I found this extremely rude. If they don't do samples that's all he had to say. Anyways we got the family package of pork.. It wasn't anything that you couldn't do in a crockpot..  The coleslaw we got was HORRIBLE.. Something was defiantly missing... And the meal was served with Sara Lee hamburger buns.. Aweful customer service and food was nothing spectacular.. If your looking for great BBQ make the drive to Rudy's"}
{"text":"I found this family owned restaurant about a year ago and have been coming every weekend. The service you receive from the moment you walk in the door until you leave is excellent. The owner and the staff are the best! The food is very good with a variety of smoked meats and sides. Try the cheesy potatoes when you go, they are the best. I would highly recommend this to anyone who wants good service and great bbq."}
{"text":"First time there, we were greeted the minute we walked in by a nice man, I'm assuming the owner?  The restaurant had great decor and was very clean. The menu is on the wall, a chalkboard and easy to read, however the cashier spoke broken english and was very difficult to understand. I recommend getting someone who is easier to understand. Not trying to be rude. We had the beef brisket which was good, a side of cheesy potatoes and a drink. They offer Coke products. It would be really nice if their buns they use were homemade or something different than Sarah Lee because the bun was soggy so we just pulled the meat out and are the meat. The kids had a rack of ribs and the BBQ sauce appeared to be delicious because it was all over their face! Lol!  They loved the ribs and cheesy potatoes. All in all a good experience."}
{"text":"Outstanding ribs and cheesy potatoes!  First time here and won't be our last. Our new go to place for BBQ."}
{"text":"The food was smoked to perfection,  friendly,  clean and great service. Definitely coming back."}
{"text":"Searched for a good place for lunch and after reading the reviews we decided to try Got Que.  we were pleasantly surprised.  We had the pulled pork.  It had a great flavor and they gave a healthy portion.  We also had the coleslaw which we also enjoyed.  The slaw was creamy but not overly saucy, not sweet, but again great tasting.  The dining area is open and bright, and the service was friendly.  It looks like it is owner operated, and the owner was checking with each guest to make sure the meal was to their satisfaction.  We don't live on Arizona, but we will definitely make this a place to stop for a good, quick, and satisfying meal!"}
{"text":"We both ordered the pulled pork sandwich combo with cheesy potatoes. It was excellent. This review isn't all about the food though. The food was great. But the restaurant was also spacious, clean, tactfully decorated, and well maintained. Most importantly, the guys behind the counter... Two young men... Very welcoming, polite, helpful, and they clearly take pride in their food and business. They spoke highly of the owner and it was clearly genuine (\"We send him home cause he works too hard!\" said with smiles). This makes all the difference in the world when you enter a business. I highly recommend not just supporting them for the food, but because they're a local business that I feel is being run well!"}
{"text":"Excellent moist brisket and pulled pork, friendly staff. Would go weekly if I lived in the area. Put this on your list for great smoked BBQ made on site."}
{"text":"If I could I rate this place 0 stars! I was not allowed to eat here or even offer to take it to go because of my service dog...gentleman was so ignorant that he had the audacity to say that no restaurant allows service animals."}
{"text":"My son and I tried Got Que? today for the 1st time. I literally apologized to the owner Eric for not trying it sooner. Living about 1 mile away from this best kept secret, and being the avid BBQ lover that I am, I simply cannot believe I haven't tried this place sooner. I have heard nothing but good things about it, and now that I am officially a customer, I am going to be an unpaid ambassador and champion for this place. Bottom line is this...we both had the \"Jumbo\" Pulled Pork sandwich ($6) and made them a combo (side and drink for $3). I had cole slaw...which I can only use my experience of slaw consumption, but this was the best cole slaw I have ever had. My son got the Cheesy Potatoes, which simply put, have been sent down from God directly for us mortals to consume while we are here. The pork was amazing as well, and we tried both of the sauces that were offered, Carolina style and Texas style. Both were great...but I like the Texas style a bit more...as it is thicker and tangier. For $19 and some change we ate lunch, at a local Surprise Small Business, and left already talking about when we are going back. If you haven't been there, do yourself the favor and go ASAP. The next time you are in line at one of the many Burger Kings, McDonalds, or Wendy's in the area....safely back up, say excuse me if you need to, and drive straight to Got Que....Greenway and Cotton, next to Frys. I promise you will not be disappointed."}
{"text":"We love this place! The BBQ is perfect every time and those cheesy potatoes...yum! Keeps us coming back!!"}
{"text":"My wife heard about this place through friends, some of whom are fans of smoke.
Stopped in to pick up the family pack enough pulled pork for 4-6 2 sides (coleslaw, cheesy potatoes) and buns $25.

Obviously we put some of the slaw on the sandwiches, and added a little extra sauce that was generously supplied. very enjoyable, more of a vinegar based sauce but good flavor, pork was perfect flavor and texture, and the slaw was the kind I could just grab a fork and go to town on.

It seemed like they had a busy lunch rush since when I arrived there was a sign that they were out of brisket and ribs until dinner. may be advisable to call ahead about availability if you have a particular meat on the brain.

We'll be eager to go back and try the brisket and ribs."}
{"text":"Best BBQ! I love this place! I'm addicted to the pulled pork sandwiches.. great service... great food!"}
{"text":"For a whole in the wall BBQ joint, and considering that we went within 1/2 hour of closing I can't dock them at all. 

The Ribs were outstanding! I can't tell you how happy I was with them and the sauces. The cheesy potatoes were good, just not my cup of tea. 

The rub had just the right amount of spice in it. 

I really wanted to try the beef hot link, but they were out, and this is my only knock on them."}
{"text":"You'll love the rich, smoky aroma the minute you walk in. Excellent ribs and brisket. Very good sauce. I wasn't wild about the cheesy potatoes - and I'd prefer my barbecue served with plain white bread instead of burger buns - but those are minor considerations. I'll definitely be back - a nice alternative to all the chain restaurants in Surprise."}
{"text":"Everything was good. Portions were excellent. Customer service was fast and friendly. I think the brisket was exceptionally good. We will be back for sure. The price was great. They have a family meal I am looking forward to trying. My kids can eat a lot of food. It was also very clean. Picnic bench seating."}
{"text":"Got Que has the best BBQ in Surprise, possibly in all of the Valley. It's so flavorful I don't even have to put BBQ sauce on it. You also have to try their homemade cheesecake. It's phenomenal."}
{"text":"Stopped in for lunch. Prices are pretty high and noticed the pulled pork was mushy (over cooked). People seemed pretty rude and curt when you start a BBQ question and discussion. Too many other better Q places to go..Dickies is better than here."}
{"text":"I'm more of an herbivore but hubby wanted bbq today... So glad he did! This place is great! They greet you like family as soon as you come in so polite and welcoming. The menu is clearly posted and the food in full view. I ordered a regular brisket sandwich with cheesy potatoes as my side. Hubby ordered 2 meat plate ribs and brisket with cheesy potatoes. OMG! The meat melts in your mouth nothing tough about it. The bbq sauce was sweet and added to the flavor. Cheesy potatoes are delicious and homemade. I hate eating at places because ppl always leave seating messy. This place was different.  The seating area was clean and neat. They even offer military discount. We will be back for sure wonderful experience! Thanks"}
{"text":"Hands down best barbecue in Arizona! The hospitality was absolutely amazing. They slow cook all the near the right way and make all their sauces from scratch. 

The brisket is mouth watering, the ribs were cooked to perfection, the potatoes were great.... Our family had everything on the menu and everyone was trying each other's food because it was that good. 

We can't wait till the next time we come back!"}
{"text":"Second time back today, the gentleman and his wife run the joint, and they are super friendly and want you to get exactly what you want. Like when I ordered a brisket sandwich and she asked me if I wanted more lean or more marbled meat. I liked the choices. Then when I couldn't decide which side I wanted they gave me a little of each. Which I thought was cool. I've also had the ribs here and they are pretty good as well. Do yourself a favor and try the homemade hot pickles too!"}
{"text":"It's ok bbq, brisket was a little dry, next time I will get more fat & less lean, potatoes were ok, I wouldn't order again, the beans are just simple ranch beans like you pour from a can, some bbq sauce helped them, the owner & service was great, It's just hard to find great bbq in the phoenix area, the cheese cake is amazing!"}
{"text":"Let me just say, this is probably one of the best BBQ places around this area. Located in the same plaza as Frys and plenty of parking. Very clean and this place lets the food do the talking! Ordered the sheriff size brisket sandwich and made it a combo with the delicious cheesy potatoes... when I say delicious I mean it! I also added a sausage to my order which tasted great, especially with their spicy bbq sauce. My brother was with me and had been stationed in Georgia where he enjoyed the bbq there. Needless to say he was in love with this place as well! Great service and very polite. Just around the corner from the house so I will definitely be back when I feel the need for BBQ!"}
{"text":"Having lived in Arizona my whole life my first thought was thrown by the name. Being mildly bi-lingual I read it as \"que\" in Spanish. Translating in my mind as \"Got What?\" 
As far as the food goes, I don't expect much from a place in Surprise. It's a local small business and if I'm craving bbq I'll order something rather than cook or drive somewhere. 
Portions are way off for quality and pricing. The cheesy potatoes that everyone's raving about were subpar, I've had better from a dry mix Betty Crocker box. Too little on the sauce and ribs that are overcooked and not near tender. 

It's a poorly done imitation. I'd say, embrace the fact your in AZ and do your own thing. Sonoran Ribs, Jalapeo BBQ. My background..? Culinary school, lifetime foodie, and bbq enthusiast."}
{"text":"So delcious with great service! So tired of no sense of urgency and horrible attitudes. Everyone in this building had a smile and said hello to me. The meat fell off the bone, the cheesy potatoes are trouble because I won't stop eating them! I hope they stay forever! Thank you for opening! ~ Mike"}
{"text":"This is my second time coming in for lunch this week. The pulled pork is delicious! The brisket is as tender as can be. The ribs fell off the bone, although I wasn't crazy about the smokey flavor. Also, didn't care for the coleslaw or beans but everyone has there own taste and opinion. The gentleman who I'm assuming is the owner is very nice. Great customer service and great meat."}
{"text":"Worst BBQ I've ever had. 
The family and I were really looking forward to this place opening. The BBQ Pulled Pork was good but everything else was awful. The ribs looked like they were boiled and were gray - you had to \"squeeze\" BBQ sauce on them after you paid for them. The buns were cold and the coleslaw had absolutely no flavor. Cheesy potatoes were nothing to write home about. My husband cooked the ribs for another 2 HOURS once he got home -- at which point they were good. The sign implies the food is \"smoked\" but I highly doubt any smoker was used for the menu items. I really was hoping for the best and to get some more Mom and Pop restaurants in Surprise, but I don't think this one fits the bill."}
{"text":"Just blown away! I'm in love with this place! The owner is friendly, the food was amazing, great prices and that perfect western style! We got the pulled pork sandwich (jumbo) and they serve you jumbo, I mean it was perfect and their cheesy potatoes are to die for! Can't wait to come back and support this new local business!"}
{"text":"OMG. What a BBQ place. Guy Fieri needs to come check this place out. Fantastic BBQ. Outstanding customer service. Delicious and reasonably priced. This is our new go to place every time we visit Arizona. 5 star rating.  recommend this awesome place 100%"}
{"text":"The Pulled Pork is Amazing. The Ribs literally fall of the bone and melt in your mouth. The beans are Great. The Cheesy Potatoes are even better. The chili is really really good as well. The owner told me try to mix the chili and the cheesy potatoes together. WOW, I'm Hooked.  This Place is so clean that you could probably eat of the Toilet if you wanted to and not worry about it. Plus the Owner and employees are really nice. I would say the barbecue is just as good as Rudy's and bobby q's if not better.  If you live in Surprise This is a must to try even just once. You won't regret it."}
{"text":"Truly good BBQ!! I've been there for lunch and dinner and have always had top notch BBQ. The staff has always been helpful and the prices are great. I am glad we have a locally owned BBQ and plan on going back many times."}
{"text":"Omg!! This place is amazing. You have to try the ribs and brisket. And Do not leave without trying the cheesecake - best cheesecake in the world!!!!"}
{"text":"I'm from the Panhandle and lived in the South  North Carolina to be exact and when we have cook-offs the loser never really is a loser so when I moved to Arizona about a year-and-a-half ago I started trying all the highly rated BBQ joints throughout Pheonix from Dillons to Dickey's Rudy's and everything in between I am a brisket connoisseur now don't get me wrong those places were fine and all but Erik down at \"Got Que?\" off the 303 and Greenway has blown the competition out of the water it helps that he's from Houston it's a shame he's so far away from the congested part of pheonix but I see other locations opening up in his future if you're looking for some authentic barbecue it's worth the trip no matter where you are in the valley I highly recommend the fatty brisket tacos thanks for bringing a little taste of the South down to valley of the Sun Erik."}
{"text":"The food is amazing. It's a very basic restaurant, no frills, just good food. We have been there multiple times a d always got good que."}
{"text":"Great BBQ food, in my opinion, best in Surprise.. excellent customer service, staff is always super friendly... Would highly recommend"}
{"text":"This is legitimate smoked BBQ. Local owned and the owner puts pride in his work. It's like a Dickies nothing special on the outside, but the taste is in the meat! Great food. No booze though."}
{"text":"Finally made here and it was worth it!  We don't have a lot to eat out West and to get a really good restaurant is a WIN WIN!!!   I really like this place. Meat was really YUMMY! .   Can't wait to go back SOON!!!"}
{"text":"My family has been looking forward to giving this new BBQ restaurant here in Surprise a try for a long time.  After countless delays, and missed opportunities due to the restaurant being closed we had our chance!  Since there are three of us, we decided on the family meal with slaw and beans as sides.  Our first choice was cheesy potatoes, but as often is the case mentioned in other reviews, they were out of something.  Overall I will say the menu is pretty limited, and you shouldn't expect to find the variety you would find at a Rudys, or Honey Bears.  As for the food, put it this way.  We ended up throwing most of everything out and going to plan B.  The positive was the lean quality of the pulled pork.  That's where it ends however.  The meat had absolutely no flavor, the store bought hamburger rolls they give you tasted stale, the BBQ sauce tasted only like ketchup, the beans had no flavor or texture, and the slaw was dry and loaded with ground pepper.  I rate \"Got Que? \" a two out of five based on the lean quality of the pork and friendly staff.  Overall however I just literally throw $25 in the trash, and just don't see a reason to return.  Sadly, if you want quality \"Que\", you will have to keep making the drive to outside of Surprise."}
{"text":"Hands down the best pulled pork sandwich around! And the cheese cake was delicious People are super nice greeting you as you walk in.  Will return"}
{"text":"We've been a few times, but I always forget to check in lol maybe because I'm it's smells wonderful the second we walk in the door and then I'm so focused on eating ha ha ha . Today I had been in meetings all day so to say the least I was starving. I brought my youngest with me because he loves anything ribs lol. They are pretty huge portions and not necessarily a kids menu option, but the gentleman taking our order said he could split the half rack into an even smaller portion with a side for my 8 year old which was perfect. He ended up with the ribs with bbq on top and baked beans. He devoured every last bit. I ordered the shredded pork regular size combo with sauce on the side so I can control how much sauce is there so the bun doesn't get messy. I chose the cheesy potatoes as my side, but certain says I'll add coleslaw as well. For all the food and two drinks it came to just under $20. For the snobby of food you get I'd say that's a great deal. The restaurant itself is very clean with a bit of a rustic touch and picnic style tables to sit at. Refills are free and there is one small to in the main area if you were alive and wanted to watch a bit. Great service every time, but the food is what has us coming back every time."}
{"text":"I realized I hadn't rated this place, despite coming here more than a few times. I like getting the boss hog and a side of cheesy potatoes. The total comes out to be 9.31 with tax, I don't order anything but water to drink. The food and portions are good. It was pretty busy for lunch this time around but service is quick. I actually prefer the pulled pork sandwich to the brisket. Definitely worth a visit if you're in the mood for some que and in the area. Food is good and around a 4 for me but I like the vibe here so I give it a 5."}
{"text":"My husband and I were driving through Surprise from Sedona to San Diego when we found this gem!  The owner and his staff are very friendly and the BBQ is SO amazing!  My husband had the meat plate and I had the brisket sandwich with cheesy potatoes.  We loved both meals.  

Don't miss this place!  What a wonderful surprise! ;)"}
{"text":"Such a delicious experience! Both the food and the customer service we wonderful! The meat falls right off the run bone and the BBQ sauce.... AMAZING! We were served by the owner himself and he was very nice and friendly! We've found our favorite BBQ place! We will be back soon!!!"}
{"text":"Tired this place for the first time and it was great. The BBQ was awesome and they people were super nice and friendly. I think they need a few TV's to spice it up but overall it's well worth it!"}
{"text":"The first thing we noticed entering the restaurant was how clean it appeared and smelled. You do take in the smoked barbeque,  but it does not overwhelm. We ordered the Pulled Pork Sandwich (jumbo), cheesy taters, and coleslaw. Absolutely incredibly delicious. The proprietor was very helpful and patient in helping us make decisions. When they are not busy helping customers, they are cleaning something. Appreciate his work ethic. I want to see this local, family owned business, survive and flourish in my  Surprise community."}
{"text":"This place is delicious! Always fresh and consistently amazing! Everything is good but the ribs are fall off the bone."}
{"text":"The owner was so friendly! The food was great! It was peaceful and clean inside. The cheesy potatoes were delicious. The ribs had a great flavor and the sauces (mild and spicy) were both perfect. My little one loved the pulled pork. We are planning our next trip with friends!"}
{"text":"Visiting from Florida. We always try to stop at restaurants which are not chains but have high Yelp reviews. Both my husband and I agreed on the 4  rating. The menu was simple so don't expect to have pages and pages of menu choices. They offered a pulled pork sandwich, brisket and baby back ribs. Also offered a few specials for the day- I noticed pulled pork tacos and beef brat. Sides were simply baked beans, cheesy potatoes and coleslaw. The cheesy potatoes were amazing. The beans were a 2 Star, in my opinion (reminded me of chili beans from a can with about that flavor)- after my husband was finished with his beans, I added some of the bbq sauce to them and it improved the flavor marginally. The ribs were served with my choice of mild or spicy sauce. The sauce was very tasty and the ribs very tender. My husband chose the pulled pork sandwich. It is a wet bbq. The flavor was good but only 3 stars in my opinion. Overall, you can't go wrong with the baby back ribs with mild sauce and cheesy potatoes. That made it a 4 Star for me.  The potatoes were so good, in fact that the fellow next to us went back and ordered a second helping. So, there you have it. A tasty bbq restaurant at a reasonable price and the owner right there cooking and serving you with a smile. ENJOY!"}
{"text":"Love love love this place!! My husband and I always get the pulled pork sandwich and I get it with coleslaw on it and on the side! It's sooo good!!! My husband gets the cheesy potatoes for his side and it's also good! We've tried their cheesecake slice too and yup it's amazing! Absolutely love this place and the prices are spot on and the staff is always super friendly! So glad we have a great barbecue place in Surprise and less than a minute from our house!"}
{"text":"Came in from out of town, we wanted some 'que and found this gem.  Simple concept, simple menu, clean setting and amazing BBQ.  I had a brisket sandwich with cheesy tots.  Brisket was tender and they served a decent pile on the bun! Cheesy tots were like bomb.com cheesy creamy deliciousness.. really enjoyed it.  The server was extremely helpful  and polite( unfortunately dont remember his name) but definitely deserves accreditation. All in all, good local spot. Recommended the place to my friends who just moved to Arizona to come by and try it.."}
{"text":"Slap your mama good barbecue. it's so nice to go to a family-owned restaurant that buys fresh ingredients every day that doesn't have a microwave or a freezer. I tried the meat platter my wife had a pulled pork sandwich so we got to try a little bit of everything and they were amazing. The hot barbecue sauce is sweet and delicious however the ribs you don't even need sauce because the authentic dry rub is so stellar."}
{"text":"The menu is hilariously small. They have brisket, pulled pork and a few sides. They don't need to offer more because after tasting those delicious options - why would you want anything else? My favorite was the pulled pork.  I ordered the big sandwich and it was a bargain for the amount of meat piled on. Everything except for the buns are made in-house and it shows that they take a lot of pride in what they do. I can't wait to return. It's some of the best BBQ I've had in a long time."}
{"text":"If you are craving BBQ, come here. I do not believe you will be disappointed. Definitely the best BBQ I've had in a long time. 

Went there yesterday for takeout for the 1st time. I got a meat plate (pulled pork and brisket) and 1 of each of the sides. First of all, he asks you if you like lean or fatty brisket so right off the bat, bonus. Then the pulled pork and brisket were pretty much almost as good as I've ever had it before (I judge all my bbq against Dinosaur BBQ in Syracuse, NY). The sides were really good too. Usually bbq beans come loaded with brown sugar, which these do not. I would almost liken it to a straight up bean chili. Nevertheless, they were very good. Next, the cole slaw was delicious, again different than usual (almost no vinegar, but still top notch). Finally, the cheesy potatoes: Yummy, but I'm not sure this is traditional bbq side. I'd probably prefer a spicy bbq potato salad or some mac sal. But that's just my preference. I WILL be back though, probably too soon.

Anyway, I had enough MEAT for 2 meals (both of which were very filling), but ran out of sides after the first go. So if you are planning for 2 people, get the meat plate with TWO of each side.

I guess the only thing I'm kind of puzzled about is the giant dining room. It's a decent dining room sure, but it just seems unnecessary.  It seems like this should have been the type of place that has people lining up outside the door for delicious takeout. Im thinking of that old fish fry i went to with my parents as a kid. Or the Taqueria Los Aquis taco truck on the corner of 7th ave and Camelback. The menu for this place is tiny but extremely well executed, so I think the rest of the establishment should reflect that. I just don't see hoards of families sitting down here for a meal given you have very limited options. I hope I'm wrong though considering it costs literally 1/3 to dine here as opposed to Bobby-Q's on I-17.

Overall, my new favorite spot in the West Valley."}
{"text":"Great smoked BBQ, always freshly smoked and great food overall! Service is always with a smile! Try it you will enjoy the experience of eating at Got Que!!!!"}
{"text":"Husband and I ate here today for the first time. It was really delicious! Staff was very friendly and informative. Explained their smoking technique, no par boiling or baking of meat, all smoked. Even gave my husband a rib sample after we had already ordered and were eating our selection. We both agreed we would definitely go back!"}
{"text":"The Que itself, to me is worth three stars, it was ok, the portion sizes are solid, and the sauce rescues it. The seating and bare dining environment 2-3 stars, but the friendliness of the staff and the cheesy potatoes rescue them to a respectable four stars. 

Side items are limited, and the slaw wasn't disappointing, bear in mind I'm Southern, so my tastes may differ from others. I do like their sauce, I just can't say anything aside from the cheesy potatoes really blew me away. 

The wife and I live around the corner, so we have been three times, and will be coming back, the Que and the friendliness get the job done and are worth making a stop."}
{"text":"Super friendly staff... I go here every Sunday and I get greeted as soon as I walk in and as my food is being prepped, the staff makes small talk with me... The food is very tasteful and you can tell the guy knows what he is doing... I have no idea why some have said the ribs are dry... I've eaten many racks from here and have yet to have a dry one. The brisket is made perfect and yes you get it served on a hamburger bun because that's how it's SUPPOSED to be served. It's BBQ, the star is the meat, not the bread. I will continue my Sunday tradition especially during football season."}
{"text":"Just pulled in thru town and found this wonderful BBQ place with the most gracious owner. Amazing brisket and ribs! See you next time we are coming thru!"}
{"text":"Great food, cheesy potatoes are awesome, beans were great, my kids love the ribs and I love the pulled pork.  A little over priced but great quality."}
{"text":"Man I love this place ! Amazing food , he makes a brisket to die for. I've tried other BBQ places and they all don't compare to they way Eric gets down!"}
{"text":"Great place! Brisket sandwich is my favorite! Service is great, everyone is very friendly too. I will recommend and will be back for sure."}
{"text":"Excellent barbeque! Tried both the pulled pork and beef brisket sandwiches. The smoke flavor didn't overwhelm the meat, which is a failing of many home smokers, and neither did the barbeque sauce which was flavorful. Both sandwiches were moist and delicious. Although I did not try the side items I look forward to sampling them on my next visit.

If you need BBQ pork ribs to go, both half and full racks are available."}
{"text":"Food was delicious! Well worth the cost! Staff was extremely friendly and helpful. Will definitely be our families new local fav. The cheesy potatoes are to die for..... Just ask my son!"}
{"text":"We had heard lots of good things about Got Que on a local Facebook group and we decided to try it out.  I had the pulled pork with cheesy potatoes.  The pulled pork was delicious and I enjoyed the BBQ sauce.  I'm not a BBQ conessueir but  I loved it.

What I loved even more was the manager stopped by and asked us how the food was.  My husband asked him some questions about how the meet was cooked and proceeded to tell us.  He spent a good 5min answering all of my husband's questions.  He seemed pretty passionate about his food.  I don't think I could get up in the middle of the night to start smoking some brisket!  

Got Que definitely worth a try!"}
{"text":"I've been wanting to try this place since it opened, finally got around to it today. I ordered the pulled pork sandwich with a side of beans. The meal was hot and very tasty, one of the best pulled pork sandwiches I've had. I got the large size and with all the pork that fell out during it's consumption it was like having another meal in itself. The best part about it is the friendly staff as mentioned by other Yelpers. Will surely be back and get me some Que!"}
{"text":"Probably the best barbecue I've had in AZ. The meat was so tender it melted in my mouth. The cheesy potatoes were delicious and don't even get me started on the cheesecake. The man behind the counter was very friendly. Great food, definitely a new favorite place to eat in Surprise."}
{"text":"Great bbq in Surprise....First visit here was not that great could have been a fluke becuase ive been back several times its always consistently amazing."}
{"text":"Coming from NC I miss good bbq. But this place was delish and filled the void. 

I had the meat plate with a side of potatoes. My husband had a three taco plate, brisket sandwich and potatoes. All were delicious. My ribs were super moist and the meat fell off the bone. Potatoes were super yummy. 

Highly recommend"}
{"text":"Had a hankering for some ribs for Saturday night dinner and decided to give this place a try.

Located just past the 303 off Greenway next to Fry's supermarket.

Lots of available parking space.  Restaurant has lots of space indoors though no outdoor seating.  Clean and well lit with little noise, and I believe 1 TV on the wall.

Staff were friendly.

Menu was easy to read and comprehend though it was very limited (-1) -- no sausage links, no chicken, no St. Louis ribs, no turkey....you catching my drift here.  Sides were also limited in variety.
Not sure how long the business has been established but it would've been nice to see a website and menu online versus having to go there and decide which isn't a big deal.
Drinks were also limited to sodas and one canister of iced-tea.

I ordered the 1/2 rack of baby-back ribs which were moist, not too tough, but tender enough.  When you are given your food, you are provided with two cups of BBQ sauce for your meats.  The tables don't have their individual dispensers however if you need more sauce, you are advised to come up to the counter and ask for more (-1).  Also had the coleslaw which wasn't runny but seasoned, fresh, and crunchy.  The beans were hot, cooked well, and had just enough kick for seasoning.

I probably won't return."}
{"text":"We stopped here for lunch and were quite satisfied with the meat combo and potatoes. Friendly pit master and clean eating area. It's reasonably priced too. We were surprised it wasn't busy at noon on a Saturday. We'd go again the next time we're in town."}
{"text":"Super nice couple that owns this place.  Food was pretty good but missed some much needed salt.  I felt the potatoes where bland and needed salt and would have been nice to smoke it to add more flavor.  The BBQ was good minus the seasoning.  Not too smoky.  I asked why such a limited menu and he said he just didn't have any more room in his smokers.  Hard to expand with only 3 which is understandable I guess.  Just was hoping for more food wise.  The home run for me was the thinner sauce which had nice tang."}
{"text":"Wow--awesome food, great flavors, wonderful and fresh ingredients...and a very nice owner!! Will definitely be going back there."}
{"text":"Finding good BBQ in Arizona is difficult, so when GQ opened I had high hopes. Walking in I found a very sparse place with picnic tables. So far so good. Some of the best BBQ I have ever had has been in dumps with mismatched furniture. 

The service is very friendly, and the food comes out fast. I had the pulled pork and beans. Both were good, but a little bit on the expensive side.

I was on the fence about giving 3 or 4 stars. This place could be a solid 4 star with a few changes: 

No sauce control! When it comes to BBQ, the sauce is everything. I have flown a thousand miles with a jug of sauce as carry on (Pre TSA). And the best BBQ places always have the sauce on the tables. But here, you must pay homage to the sauce master who hoards the sauce behind the counter, and applies it for you.

Spicy sauce! This is Arizona, and a spicy sauce should be available. 

Fries! Most of the top BBQ places offer fries. And if GQ wants to flirt with a 5 star, don't walk over to Fry's and buy a frozen bag of French fries. Cut and fry your own."}
{"text":"Yum. Some of the best bbq that I've had outside of Arkansas. 1st time there and I will be back. The Boss Hog is 6oz and very filling with the side. Cheesy potatoes were delicious. Slaw was ok, but would be better on the sandwich than as a side. Kinda thrown off by \"Que\" in the name thinking it was Spanish, until I saw the smaller sign that it was BBQ."}
{"text":"Amazing, cheesy hash browns, brisket, brisket chili, coleslaw, homemade cheese cake, all to die for.  GO THERE!"}
{"text":"Love this place. Stop by whenever I am in surprise for some brisket and their great cheesy potatoes. Secret tip;) you can get a large tub of potatoes for super cheap. This place is the best for a great meal"}
{"text":"Staff was friendly. You cannot call ahead to pick up an orders, but it was really quick when you get there. We ate the Pull Pork Sandwich and Cheesy Potatoes. The pull pork was tender and moist. It was really good. The cheesy potatoes were good but nothing to get excited about. My husband was disappointed that coleslaw didn't come on the pull pork Sandwich like the majority of ones he has ate in the past. Next time we'll just remember to order a side of coleslaw."}
{"text":"Good BBQ but not the best. Got to try this hidden bbq shack and I must say that it's good bbq. The brisket stands out, the rest of the meats including the ribs were good. Wish they give a little more love by steaming or heating the buns for the sandwiches and offer some sort of breads with their bbq. Chili was really decent, tomatoes based with hardly any other flavor, the Cole slaw was okay, and the cheesy potatoes were good."}
{"text":"7/3/2016 We are visiting here from California, found 'Got Que' on Yelp and decided to try it.
EXCELLENT food, we ordered The Meat Plate, 1/2 rack of ribs plate and The Brisket Plate...everything was delicious, service was warm and friendly and the restaurant was impeccably clean.
We will definitely go back as will the Arizona residents who came with us. :)"}
{"text":"This place is within walking distance of my house (Not right now though...114 degrees out...are you kidding?  I'm not walking ANYWHERE!  Anyways....) but I had never been here until yesterday.  I wanted to go out to lunch, but didn't want to go very far in this heat.  I decided that I would drive down here and get a BBQ sandwich.  I walked inside, got in line and then changed my mind.  Instead of a sandwich,  I saw that they had a \"Meat Plate\" for $10.00 which included ribs and brisket.  I decided to go with that and an order of beans.  Total was right around $13.00.  The owner and ladies behind the counter were very nice!  Here is how the BBQ was............

Meat Plate-  This thing was supposed to come with 2 ribs and some brisket.  It wound up being 4 ribs (a little small) and a nice pile of brisket.  I got my brisket on the \"not so lean side\".  Sauce is served on the side.  I took a bite of the ribs first.  They were excellent!  They had a dry rub on them, mostly salt and pepper.  They were delicious!  Some of the better ribs I have had in AZ and the rub they use is great!  The ribs had a nice smokey flavor.  I dug into the brisket next.  I'm usually not the biggest fan of brisket, but this stuff was definitely legit and pretty damn tasty.  I ate some bites without sauce, and it was great.  I added some sauce to it (didn't even really need it) and it enhanced it a little bit more.  Definitely some good brisket! Compared to other BBQ in the Phoenix area, I would say it is much better than Rudy's, on par with Naked BBQ but not as good as Little Miss BBQ (there is nothing wrong with that...Little Miss may be the best BBQ in the Western half of the USA). 

Beans-  I'm not going to mince words.  They were nasty!  They were more like \"ranch beans\" in a sauce.  The sauce was more savory and not sweet at all.  I am pretty picky with my beans and prefer a nice thick sauce, meat in them, and sweet.  These beans had none of that going on.  I would never get them again.  I took 2 bites and threw them in the trash.

Overall, besides the beans, the meats were great!  Maybe not the best BBQ I have ever had, but definitely above average and super close to home.  Prices were fair for what you receive, customer service was friendly, plus you are supporting a local business.  Win win.  I'm sure I will be back to finally try out that sandwich I initially intended to eat."}
{"text":"This place is a hidden gem, my family went here for lunch today and it was by far the best BBQ that we have had, the owner was very nice and friendly and the prices were very reasonable and let me tell you they did not cut back on what they served you. I think by far my daughter loved the cheesy potatoes, and their chili they had there was melt in your mouth good."}
{"text":"Really good bbq place! Great food, great service, great atmosphere, and really fast! Highly recommend!"}
{"text":"Very good BBQ. Few things could be better like toasted buns and bigger portions. Also a little more variety would be nice. However I'm super excited about how nice and clean the place is and good the food was. No good bbq in the West Valley till now."}
{"text":"Came in here recently and absolutely loved the food. I ordered the pulled pork sandwich and cheesy potatoes. The owner is a super friendly guy and the service was spectacular. The value of the food was fairly priced. I love supporting local businesses and this is one worthy of our support."}
{"text":"Excellent BBQ!!!  We got pulled pork sandwiches and a brisket sandwich. Try the cheese potatoes!"}
{"text":"Yummy brisket and super friendly staff. Being from CA, I love these mom and pop shops. I like how they ask for your preference on fat or lean meat. Currently not serving beer but they are in the process. Will be back to try others. Also, we didnt get any of their sides but we did get their homemade cheesecake. BBQ and cheesecake?! I can die happy now."}
{"text":"Great little bbq joint. Super friendly service and very clean restaurant. Loved the picnic table seating. You won't regret it!"}
{"text":"Great hidden gem!! Food is great large portions. Had a small sampling and my favorite was the brisket and sausage. Ribs and pulled pork were also very good. 
Nice, clean place for the good BBQ."}
{"text":"Nothing but bbq. Nothing but good. It's great to see another solid local restaurant. Hope they get a lot of support. Make a larger choice for a meat dinner plate. I'll order it, I'll be happy to pay more for it and I'll be even happier to eat it! Great job!"}
{"text":"Do you enjoy great barbecue with tasty sides? how about brisket that will melt in your mouth? well go to got que and you will be pleased. Literally the only thing missing from this place is free seconds and banana pudding. If your thinking about going just go because it will become a favorite."}
{"text":"Hubby and I decided to give the new place a try! We LOVE BBQ and were excited a place was opening just a block away! The restaurant is very basic on the inside, as it just opened a couple weeks ago. Let me just say, what it lacks in flair on the walls, the food makes up for it! It's all home made, no frozen or prepackaged stuff and the Brisket and Ribs are to die for! I was a little disappointed they ran out of cheesecake bc I heard it was delicious! Can't wait to come back again!"}
