{"text":"This is a brand new place to eat in town. Great location, and great food.
You can buy the meats over the counter as well which is a nice touch.
If you love a good roast sandwich, then this is the place for you.
Buy local, buy here!"}
{"text":"Just had a delicous takeaway sandwhich for lunch, it was supplied with a generous helping of homemade chips and crsipy fresh salad, delicous, would recommend it"}
{"text":"An unassuming little gem of a place, let's really put these guys on the map, they are doing something excellent! Promoting locally produced meats  see the website at http://www.stepneyhillfarm.co.uk  it's clear that they have the upmost respect for the animals they farm and bring to us in their cafe and restaurant dishes.
We enjoyed a fabulous evening celebration meal  beginning with a round of (the same!) delectable cured bacon, black pudding and poached egg and rocket starters, with a light honey and mustard dressing, then two of the party had steaks (one fillet, rare, and perfect! and one sirloin, well done, again perfect!) served with 'proper' chunky chips, tomatoes and mushrooms .. the other two of our party opted for the Confit Pork Belly with mustard mash and caramellised onion and gravy .. and Wow, the meat was soooo soft, moist and tasty, the rich gravy (a good amount) and mustard mash was just perfect. All meals were presented very well, it was a treat for the eyes and most importantly the stomach.. We had no space for dessert, but forced ourselves to try at least one, with a couple or so spoons to dig in! We went for the cherry and pear crumble, with custard and well. YUMMM ! is all i can say. It's bring your own wine and the prices for such fabulous cuts of meat, coupled with the great service (we didn't need to wait too long between courses and the waiter was attentive without being over the top) were more than reasonable. (Chef even sent us a complementary dish of mashed parsnip and carrot btw  which was also excellent : ) The restaurant opened especially for our booking as they don't usually do Sunday nights, but two of the party were coming from Sheffield and wanted to try out the Gourmet Meat Company  and i don't think you can ask for more than that. Thoroughly recommend this place! (and are doing, to all family and friends already.. we will be back!)"}
