{"text":"This place is great for a couple of reasons.   Firstly, it seems to be a Mom and Pop shop that has stood the test of time in what has been a turbulent strip mall that has seen many transformations over the years. Only a few things have survived as they were going back to Gourmet Wok opening (Hell, even Barros Pizza moved.). The Taco bell and KFC and this little place. The family vibe of Gourmet Wok is great, I love seeing places like this survive hard times.   Secondly, the food is solid and you cant beat the price for the portions you get. I have ordered many items off the menu and I have never run in to a bad one yet. Its solid, not amazing, blow your doors off, have a religious experience kinda food, its just a solid little place. You get your moneys worth.   They have very affordable lunch specials and I suggest checking that out if you are free at that time. They are closed on Sunday so be mindful of that.   Anyways, give it a go, they do delivery of you live on that part of town. Do it."}
{"text":"Well.  Here's the thing:  When it's good, it's good!  When it's bad, it's pretty bad.  I've had some pretty tasty dinners here, and the portions are such that I can get about three meals out of a dinner combo.  Awesome, considering it's costs like $8 or something.  But then I tried the Hunan Beef and it was awful.  No flavor and a strange texture.  I give it 4 stars because I don't want to change their rating.  If you get the right things (which so far have been General Tsao's Chicken and Sesame Chicken), then it's good.  But some things are very mediocre to... not good.  I will definitely go back.  Great price, generally good Chinese food, and pretty giant portions for the price!"}
{"text":"Do not go here! The restaurant stinks! I did not trust the food in the first place because of the way it smelled. After being harassed about asking for a few modifications I was basically told that I could not use my gift card on the entree I was trying to order. The place was dead and the very last thing they wanted to do was accommodate me in any way shape or form.  So we left and went down the street to L and L!"}
{"text":"Their customer service is horrible. I ordered a lunch special through cell phone. I told them that I wanted lunch special. They gave me something else which cost me much more them that. And they even denied that it was their fault! They refused to admit to the fact that I had told them I wanted lunch special. They rejected to do anything about it! And the way they talked to me was extremely rude!"}
{"text":"I ordered a family meal for four. First time since new people took over. It's not as good as it used to be. Food pretty bland and prices Much higher. Probably won't return."}
{"text":"I gave 3 star because of the wonderful taste of the noddle that i had. Price was amazing and the amount of food was shocking. 7 dollar for a big portion of noddles. The only thing that i did not like it was about the fork and spoon that was disposable. It does not go very well with noddles and hard to use. Also i order the spicy shrimp which they just provide extra chili on the side while i would like it in food while it was cooking.   There are a few tables for sitting if you want to eat there which is convenient."}
{"text":"Gross! Tastes like microwaved mush.   Everything cold and covered in gelatinous \"sauce\". Orange chicken not at all crispy....had the texture of a sponge and cold. Mongolian beef swimming in brown liquid and overpowered by green peppers....cold. Spring rolls also cold and mushy. Chicken fried rice had no vegetables in it. Just awful.... $45 wasted. The only thing edible was the plain white rice and it was also cold. 2 stars for prompt delivery but this was disgusting and I will never order from here again."}
{"text":"DEPLORABLE customer service! I have been here four times for take-outs, and I literally ripped their take-out menu b/c I won't be returning again. I will rather eat less tasty foods than coming back here again. I ordered the lunch special today, and when I showed up, the Chinese gentleman didn't greet me nor even smiled at me. He literally threw the pen at me for me to sign the CC receipt!!! Really?!! Completely RUDE and uncalled for!!   The other three times, a different guy helped me with the takeout orders, and horrible customer service as well. The guy didn't lift his head up from writing on a piece of paper when I walked in. He was nonchalant and couldn't care less about the customers!!!"}
{"text":"Food is good mmm k!!  Very good food if you are in the position of not wanting to cook at home and don't want to dine in. Def recommendation for you locals near by."}
{"text":"The hot and sour soup is great! The orders are ready quickly and are screaming hot. Don't judge this book by the cover. It is a good typical chinese take out joint."}
{"text":"Came in to lunch today try their Mongolian beef and noodles for their lunch special is actually really good proportion was good I will return"}
{"text":"Seriously the best service and Chinese food ever I used to live in California and this is still the best!! The woman whom answered the phone was so sweet! And delivery guy was great as well!! Thank you Gourmet Wok!!!! I willl let al my family and friends know about you! 5 stars!!"}
{"text":"We eat here often. Many small places like this serve generic tasting, boring food. Not this place! The Kung Pao chicken is perfectly spicy and the teriyaki chicken is moist and flavorful. Some of the best crab rangoon I've ever had is here. Portions are enough to have enough for dinner and lunch the next day. Prices are very reasonable. Everything we have here is well above average. Staff is very friendly too. Nice job!"}
{"text":"Just like Joanna V, I am wondering where my previous review went. This spot is close to my work so I order through the Yelp app every so often. The wor won ton soup and various shrimp dishes haven't done me wrong yet, and everything is served piping hot and super fast. At one point they used to have more Hawaiian BBQ items on the menu. The sauces tend to be hit or miss, either very sugary or a touch too thin but overall it's a convenient Chinese takeout spot and pricing is fair."}
{"text":"Pleasantly surprised! I ordered from here Wednesday night 5/10 via Eat 24. Whenever I get Chinese food I always want a smorgasbord of items. The family special \"A\" caught my eye. It comes with: 2 egg rolls, 2 cream cheese rangoons, a large soup, 2 entrees, and chicken fried rice and steamed rice. All the food for $23.95. Also, because I ordered more than $20 worth of food, I got an extra 6 cream cheese rangoons for free - score! I love those things!  My food was delivered piping hot in about 30 minutes. I was surprised by the amount of food, it's for sure enough for a family of 4. The rangoons were delicious, crunchy with a decent amount of cream cheese. I only wish they came with a dipping sauce. The hot n sour soup was realllllly good, and a little spicer than I am used to which made it even better. They also have egg drop if you're not into spicy. My two entrees I chose were beef and broccoli and general tso's chicken. Both very tasty. The general chicken was also pleasantly spicy, which I find is not usually the case at other places.  I will definitely order from here again."}
{"text":"not a review of the food but rather the ownership overcharging for subpar food, making up fictitious fees and poor customer service. for other reviews it sounds like the health department and better business bureau  should both look into this place."}
{"text":"Found them through Restaurant.com. I was able to use a $10 certificate if you spend $30. Ended up spending $38 w/coupon. I ordered family dinner B and when the lady which I assume was the owner/manager rang me up she said that since I used a certificate that I would have to pay for each item separately. So instead of the $27.95 price I was charged an extra $5.  The combination Fried rice wasn't bad, the wonton soup was horrible! It's had no taste whatsoever, felt like they threw a bunch of vegetables and leftover meat into a hot boiling pot of water, the honey walnut chicken was overly breaded and was drenched in that sweet mayo sauce, the chicken with broccoli had no flavor as well and it was in a white clear sauce, the crab Rangoons seemed stale like it had been sitting under a heat lamp.  So........ we will definitely not be coming back."}
{"text":"The food was great! We got the coconut shrimp just the perfect amount of almonds and sauce sooooo good! The portions are big and definitely worth the money, they also always throw in free won tons or free egg rolls !!!! Great customer service as well!  Would recommend to friends and family !"}
{"text":"Very good food huge portions very reasonably priced. Fresh not too salty.  Will definitely order again"}
{"text":"This restaurant is gone.  :(  It is now a place going to be called China Jade."}
{"text":"I'm so glad someone finally bought this place that can cook good. For quick Chinese this place is great. Everything was delicious wife is happy to see chop suey on the menu. Barely anyone in Vegas has it or makes it decent. The braised tofu was excellent. My only critique is the chicken fried rice was good but was really plain. Only had chicken rice a lil egg I expect some type of veg in with my rice. This might be die to it being free I will have to order fried rice off the menu to find out. And the chicken teriyaki had an excellent flavor but something in the dish caused a lot of water on the bottom of the container which made the teriyaki sauce water down.  So happy there is decent Chinese food again a few blocks from the house. Will be returning here very soon."}
{"text":"The food was good. Definitely should go here if you want to get your chinese take out fix. Prices are good amd they give you a larfe quantity of it. I got the orange chicken. I know basic but it did the job. It was sweet and tangy nd had a crunch to it. Fried rice was decent, but the egg roll was bomb. I love their egg rolls. My next visit i want to try the thai tea."}
{"text":"We have been here a couple of times.  The food is good, and portion size decent.  Its not overly expensive either.  The couple that works in there are very nice and you can tell that they want your business.  Of course you wouldn't want to bring a date here if you are trying to impress her.  But if you are in a relationship, have kids, and want some hassle-free neighborhood Chinese food this is definitely your place. The only thing they didn't have fountain sodas.  Which for some people is whatever,  but I don't buy soda at home so when I sit down and eat somewhere and eat I want a refillable soda.  Today we are ordering take out.  Hope that the portions are the same. But all in all, its a consistently good place to eat.  Finding good Chinese food is difficult in Las Vegas."}
{"text":"Average at best.. I had the Kung Pow Chicken and it was flooded with too much sauce. The sweet and sour soup was alright. Prices are very reasonable though. Nothing spectacular."}
{"text":"I usually order here for lunch and the lunch specials are pretty good.  They give big servings and your choice of either egg rolls or soup. Seafood here is really good. I usually order the Fish Fillet with Black Bean Sauce, this is Chef's special and I must say I am hooked and usually order this once a week.  Fast and Easy and it's usually delivered within 30 minutes once the order was placed."}
{"text":"Where's my previous review with the malasadas pics?  Uuugghh people... Well if youre looking for Hawaiian BBQ and Chinese food, here you shall find it!    The newest thing I dont recall them having last year, is Yelp Eat24 pickup or delivery.  Makes it super convenient for you busy yelpaholics.  If you dine in, the place is small, but fairly clean.  I hope their air condition works better now.    Good portions, good prices, and good food for budget seekers."}
{"text":"A hole in the wall that offers tasty food at a good price. Great alternative to the chains so prevalent in the area. Also a good option for something quick!"}
{"text":"Decent, fast Chinese food.  Can't really go wrong with a dinner that costs less than $10 and leaves you with enough food for another full meal the next evening.  The Kung Pao Chicken was pretty good, a little heavy on the sauce perhaps and the egg drop soup was basically broth only, with some egg thrown in, guess I didn't really know what I expected.   Definitely a good place for takeout, not much in the way of ambiance..."}
{"text":"I ordered shrimp lo mein for lunch here.  It was really delicious, inexpensive and I didn't have to wait long for my meal.  I didn't even mind that the place looked run down because I could tell it was clean.  The only reason why I knocked off a star and probably won't come back was because I had these little, black specs in my food that were really hard, I couldn't help but think they were pieces of teflon from the wok.  I dunno but it freaked me out."}
{"text":"I have been to many Asian restaurants in the valley, some big, some small. Gourmet Wok on Baseline & Hardy is one of the best. Hands down. First thing, it's CHEAP. $4 lunch combos with fried rice and some crab puffs, and it's more food than just about any other take out combo I have seen. You can also get a pint of egg drop for a buck. A lot of reviews, like for Quick Wok say you get A LOT of food, but I usually don't see that. At the GW I think you really do, usually enough for two sittings.  I've tried almost all the lunch combos and they are all great. I think the quality rivals any large restaurant. They don't have a fancy store with fancy containers, just good food. It also seems like a genuine small family restaurant. Nice old Asian people who don't speak great English always, and some old Asian dude in the back cooking. :]  And the food is always made right then and hot as sh*t. Not spicy, but burn though your hand hot.  I used to think Golden Canyon by MCC or YC's was the best, but since moving to Tempe years ago,  I think it's a tough choice. Although YC's is kinda in another category. A little more expensive and not really takeout. BTW, YC's is also very AWESOME.  Every time I try another place, I wish I would have gone to Gourmet Wok. Like, today I went to Quick Wok on Mill & Southern, not again. Don't get me wrong, the food was great, but less of it and $2 more.   Check it out. Buy the way this is my first review. I just didn't see any other reviews for such a great place."}
{"text":"Very pleased! Almost passed this place up due to a limited online presence. So happy we ordered here, very tasty! We ordered the \"Family Dinner A\" with the General T'sos chicken & Pepper Steak. We ordered online, I requested in the special instructions section to switch out the chicken fried rice for plain fried rice and they did (my fiancé has a chicken allergy so that was awesome). Leftovers held up nicely too as we ate the rest for lunch the next day  Overall best Chinese we've had in years!"}
{"text":"I'm trying the places close by my temporary Tempe home... it's tough to give more than two stars after my experience here.  I walked by on my way to Food Town, and I picked up a menu.  In  perusing the offerings, I was struck by the Thai Basil Chicken combination. I figured with egg roll and Lo Mein, the combination would probably work.  After picking up the Food Town items, I walked toward Gourmet Wok.  On opening the door and walking in, I was the only customer in the restaurant.  When I passed by earlier, picking up the menu, there were no customers in the restaurant.  The only people in the restaurant were a waitress, her child and another lady at the same table.  The tables and chairs...Goodwill Industries.  The menu board...with lots of prices that have not been updated, even though the prices in the paper menu have...I thought I might have found the proverbial 'hole in the wall' for take-away Chinese cuisine.  I compared prices between the picture board, the written menu on the wall and the paper menu in my hands.  The prices on certain items varied based on which source you ordered from.  My Thai Basil Chicken combination cost $6.55 based on the paper menu.  With tax, I paid $7.14.  The person who took my order advised I would wait 5 minutes and my order would be ready.  I walked to the local literature distribution near the front door, where I picked up the coffee-time news.  After reading my horoscope and several articles about truffles, I was called to pick up my order.  3:20 on my watch.  This was either an extremely coordinated cook or certain items were cooked before being commingled with all the ingredients.    The person who took my order brought the bag to the counter, handles looped through one-another.  I opened the bag, took a peek and everything looked appropriate.  I asked for some pepper oil, and was provided with a container.  Out the door and 2 blocks to the homestead...I walked in, unburdened from the trip, washed my hands and prepared to open the box for dinner.    The egg roll...it had been sitting under a heat lamp...there were no grease spots on the envelope.  Cabbage, carrots, but no seasoning...frozen, not prepared fresh.  No Lo Mein...but rice cooked in yellow broth, and it was a little hard, like it could have cooked for 2 or 3 more minutes.  As hard as I tried, I just could not enjoy the rice, either.    Last but not least, the Thai Basil Chicken with no basil.  I'm betting the cook did not read the order, or chickie who took the order wrote down chicken with broccoli, because while there was no basil, the broccoli was in large quantity and cooked to perfection.  The chicken...no.  It must have been cut and then steamed and left in a tray in the preparation area.  The pieces were very uniform, very soft (beyond tender) and flavorless.  While I could not see what the cook was doing in preparation, my bet is that he took already prepared broccoli, carrots and onion and tossed 'em with the chicken pieces, then slathered the whole thing in sauce.    First time, not very impressed.  I will give them one more try, because every time I go by, the place is always empty.  Maybe if they get the chance to impress, and succeed, they could grow."}
{"text":"I am so pleased with the lunch I just picked up here I'm writing this review while I eat it (much better use of multi-tasking than getting back to work as intended, don't you think?).   Perusing Yelp for a decent Chinese place near my office, I found the Gourmet Wok was just about a mile away hidden behind a Taco Bell in a strip mall tucked between a nail salon and a dentist office run by a guy name Nguyen. A little Google magic revealed their menu and list of lunch specials. I ordered the Szechuan Chicken, which was $4.45. You have to pay a premium of $4.75 for beef or shrimp And, because I already threw caution to the wind this morning and had margarine on my white toast, I went ahead and had them throw in an egg roll for another $0.70. I also kind of figured I wasn't getting much food for under $5, which was an incorrect assumption on my part as I will likely be eating left over Chinese for dinner tonight.   The food itself was very flavorful (albeit not hot enough for me, but that's why I keep Sriracha packets in my desk drawer anyway) and there was plenty of it. The broccoli was still bright green and crunchy, there were lots of carrots and they mixed in lots of those little baby corn bits everyone loves.   I grabbed a couple of take out menus for the office and will try to entice my co-workers into switching to this place for delivery ($10 minimum so I'll need some help) from the other place nearby, whose name I will not mention, with whom I am less enamored.   Incidentally, I would say that this is definitely a takeout/delivery joint. The interior is not exactly decorated for comfort. It reminds me of the little Asian places I would order from in Toronto or San Francisco. Sometimes there is an indirect correlation - the less comfy the restaurant, the better the food - when it comes to good Chinese and/or Mexican.    Who knows what the next visit will bring, but for the moment, for the money, I could not be happier."}
{"text":"I am only rating this against other hole-in-the-wall chinese places and this is about as good as it gets! Not much by way of ambiance and the day I went there they didnt have a/c (dont know if it is all the time or it was just out?) but the food was delish/cheap/ and close to my work! You just cant beat a $4.75 lunch special! MMMMMM"}
{"text":"Ordered some shrimp lomein and some crap Rangoon. Crab Rangoon was really good!!! N the lomein was one of the best lomein ever!!! Will be back"}
{"text":"The new owners here at Gourmet Wok really has turned the restaurant around. The food is absolutely delicious and fresh. I usually go here for the lunch special & I recommend the \"Teriyaki Chicken with Fried Rice & Hot & Sour Soup!\" Can't go wrong at all. Food is bomb and the price is absolutely amazing!!! So much food for the price too!!!"}
{"text":"This restaurant exceeded my expectations! My favorite dish is always honey walnut shrimp it is always the most expensive and every time I order it there are so few shrimp it is so overpriced. This was definitely not the case with this restaurant. My second favorite dish is garlic chicken. It was so good the vegetables they use are so fresh. If you are looking amazing Chinese food this is your place I would definitely recommend!!!"}
{"text":"I love how the food tastes. Place is clean. People are friendly. Everytime i come here i mever have regrets."}
{"text":"Gourmet Wok used to be my favorite Chinese restaurant. I live a five minute walk away, and when i craved Chinese, i was lucky to have an affordable and delicious option right nearby. I spent two years looking for an eggroll that wasn't garbage out here, and Gourmet Wok was the first place i found with an eggroll worth eating at a take out place.   But not anymore. Recently they changed owners, or at least there is a different family working it now. And the quality took a nose dive into an empty pool. The food is pretty meh, a hell of a lot greaser, and the service is much less friendly. The eggroll is still decent, but the general quality of the General Tso, Orange Chicken, and Mongolian beef has just turned bland and not worth it, where it was wonderful before.   Its still cheap, but i'd go somewhere else for chineese now."}
{"text":"I am a Chinese student here and have tried a lot of Chinese Food in AZ area. This one have terrible crappy food with the worst customer services. My roommate and I odered the lunch specical and they sent us the large size food which charged us more than $20 and they rejected to do anything for their mistake.   ==PANDA=========="}
{"text":"This place is the ABSOLUTE WORST and the furthest thing from anything Gourmet as mentioned in the name of the place. We walked in to order food for dining there. There was a faint scent of sewage in the air. We were very hungry and looking forward to getting our all around go to dish at any restaurant , Egg Foo Young. We also ordered an order of Tom Kum Young soup. 2 Thai Iced Teas completed the order. It came to 25 bucks. First of all 2 points off for plastic utensils and styrofoam bowls and plates. Any place calling themselves Gourmet should have ceramic dishes and have silverware. We waited a bit and they brought the soup. It had a ton of Whole Mushrooms just floating in a bland , tasteless broth. It was sweet tasting and not spicy at all and had NO FLAVOR !! No Thai taste whatsover. The shrimp tasted dirty and the chicken tasted old and off. Terrible !! The next dish was Pork Egg Foo Young. This is always my go to favorite dish no matter where I go. They brought our rice out in a styrofoam to go container. The Egg Foo Young was just one giant pizza like product , cut like a pizza. It had no flavor and Egg was nonexistent. There was NO GRAVY , but instead a congealed , gelatinous sauce that had no flavor. I also found 2 small dark black hairs , one on the egde of my plate and one in the stack of napkins given to us. Egg Foo Young should always be 4 inch diameter and stacked pancake like with a brown turkey gravy consistency with flavor. New York Chinese does it perfect and so does Tasty China. Both those places are incredible !!! This place is disgusting !!!!! Gourmet NOT !"}
{"text":"Really good for the price, not the best chinese food of course. Mostly average across the board, but that lemon chicken is a stand out winner."}
{"text":"Decided to try this place since I live fairly close by.  It was about 2pm and it was nearly empty but the guy behind the counter was very friendly and explained all my options.  I had the lunch special which is a good deal.  Once the food came out, he even wrapped the Styrofoam container in plastic wrap so it was hot when I got out home.  Food was very filling and pretty tasty.  I will definitely come back and try the salt n pepper shrimp!"}
{"text":"Best Chinese fast food I have found in the area.  Had Dragon Phoenix (1/2 shrimp with veggies and 1/2 general taos) --- plentiful, flavorful and fresh! New favorite take out place."}
{"text":"I ordered a Mongolian Beef, General Tsao Chicken and Kung Pao Shrimp.  If you are a vegetarian and love sauce this might be your place but I couldn't find any shrimp or beef but had a ton of green peppers and sitting in sauce.  Just not good flavor.  The General Tsao was tons of breading and didn't taste good either.  I was excited after reading reviews but what a let down.  Lady that runs it was exceptionally nice but I have to rate it according to food quality and flavor."}
