{"text":"The drinks were good and refreshing . Stopped in this morning in the middle of moving - the guy and the girl working never said anything to us - I even asked the young man about the ingredients in the protein bar he never said anything he just looked at me . They acted like either they did not like being there or they just got in a huge fight with each other- it was kind of strange"}
{"text":"After leaving a 5 star review less then a month ago...I find myself needing to leave another!! My team and I ordered take out once again using the online system. One meal we ordered came with chicken and we wanted shrimp, so we added the shrimp for $3 and in the  comments deleted the chicken. After submitting I realized we could have saved $$ had we just built or own bowl. Without ever saying a word I received an email notifying me of a credit to my card for my order. Shout out once again to this phenomenal team and ownership... you truly are many steps above your competitors!!"}
{"text":"Very courteous, friendly staff. My French Quarter was fantastic and the sauce was delicious. Also had the Energy Elevator, a great alternative to high sugar coffee drinks. With so many processed food options at other dining establishments, it was refreshing to great a great tasting, healthy meal in just minutes. We will be back."}
{"text":"Not great today. I got the Tokyo bowl and the salmon was pungent, the broccoli was yellow and dry and the avocado was over ripe. I'm disappointed."}
{"text":"This location is now closed after less than six months in business!  Not sure if it was the product, the 'Kierland' location (which wasn't close to Kierland) or the three other Grabbagreen locations nearby that did them in."}
{"text":"Okay, first and foremost, don't get fooled by the \"Kierland\" label on this location...it's just a little south of Frank Lloyd Wright where it changes to Bell...just past the gas station on Scottsdale Road.   I've been a big fan of GrabbaGreen since it opened in 2013. So happy for their success since talking to the owner who had an idea  to franchise and made it all come together. Two longtime women friends created this brand.   Consistently good, clean, fresh food here. This location is my favorite! Matt is the owner and intentionally creates a high vibe.   I arrange brunch outings once a month for Scottsdale Center for Spiritual Living. Today's brunch was fab because Matt and his crew went way out of their way for us...pushing tables together, making sure everyone got their food. This made me very happy because when you're organizing 15-20 people, it's important to make sure no one is isolated or getting poor service.   As it happens, I got very little sleep  last night and woke up late to boot. So being able to relax and have fun with such attentive service came with perfect timing for me.   Anyone who knows me knows I'm a serious foodie that is going to scrutinize every aspect of the places I go...food, service, value, flow, atmosphere, consistency...you name it, I'm gonna notice it.    If you know Grabba Green, I'd encourage you to visit this location for the vibe. If you've never been, try it for the quality, healthy, made to order fast food. It's a great alternative to the pricey stuff at Whole Foods or places with a \"corporate\" feel.   I love their made to order juices and their breakfast burrito made with a big collard leaf."}
{"text":"I was a bit disappointed when I realized my order had some kind of sauce in it when I ordered it with no sauce. I was already home when I realized it. The sauce wasn't on top so I couldn't tell when I first looked at it."}
{"text":"Great place for a quick and healthy lunch. Staff are friendly and helpful. The place is nice and clean too. Love the creative salad choices!  They also have a large variety of yummy smoothies. I had the PB&J smoothie and didn't eat the rest of the day because it was so filling!  Definitely a great addition to the busy lunch scene at FLW and Scottsdale Rd!"}
{"text":"Very friendly staff and the food was delicious! I got the Patagonia it was awesome, the chimichuri sauce is great. This was my first tine here. Can't wait to go back and try more."}
{"text":"Yelp is making me leave a long review for some reason. My wife and I eat here 3 times a week and have not had a bad meal yet. It is crazy healthy food that actually has taste to it!"}
{"text":"After a disappointment at Tokyo Joe's and lack of customer service I decided to try out this Gabbagreen location. Whoa night and day difference regarding customer service! The manager and staff were very attentive. The menu is healthy and so many options to choose from! I ordered the chicken noodle soup and Patagonia bowl. I LOVE chicken noodle and the broth and chicken were delicious. The only reason they didn't receive 5 stars is because the noodles were a pile of mush in the soup. The Patagonia bowl is amazing! I will be back not just because of the great food but because their staff is genuine and friendly. Once more people find out they are open, I'm sure they will get super busy. Can't wait to go back."}
{"text":"My draw to enter was the 1/2 smoothies signage out front  from 2 pm - and I thought a spiritulina ( play on words ) was a good choice while I sipped and waited for my take out dinner.   It had a variety of healthy greens, some fruit to make it naturally sweet and ice to make it cold and  refreshing. It was tasty and fortifying.   I'm glad I was able to enjoy the drink, get nutrients, vitamins and antioxidants. It lasted 2 days.   The young ones inside the store were friendly & helpful. I found it clean and comfortable."}
{"text":"Really impressed all the way around!! Some places stand out for their efforts to go above and beyond and this is definitely one of those places. Passionate, excited, friendly, and genuine is what I would say about this place. I knew I would come back before I even tried the food because after meeting the owner, he is someone you root for to do well. He was just so excited to be there and tell you all about the menu choices and share the experience with you. It's important to stand out when their are three \"green\" spots within a mile, but trust me this is the one you want to check out! The sauces are phenomenal and the food was tasty as well. It is a healthy spot that doesn't taste healthy which is my favorite kind to go to! I look forward to going back and root this place the best."}
{"text":"For someone who has never seen or heard of Grabbagreen, I was immediately drawn to its catchy name. The owner was so awesome and personable--he went out of his way to ensure we had a positive experience and made our evening with the genuine interaction we shared. Food was fresh and tasty as well! We will definitely be going back... I highly recommend this location!!!!"}
{"text":"Quick, efficient and helpful in making suggestions to accommodate dietary restrictions! Definitely two thumbs up, I'll be back for that Energy smoothie (with soy protein)"}
{"text":"Blown Away with the customer service here.  Clean, beautiful and delicious.  If you are looking for fast food, without the calories and fat, you must try Grabbagreen.  The selection is incredible.  There are unlimited options, from coffee, smoothies, and meals.  You can customize each to your liking.  This place is great for family meal or a quick bite.    If you are tired of getting the same old grub, you gotta try Real food on the go!"}
