{"text":"Was there around 8 pm on a Saturday night . They were not busy by any means. However all of the food looked old and like it had been out for hours. There were 2 women filling food but were just stirring it unless it was totally empty. If you asked for more of something they ignored you. The chef at the hibachi station was rude and only knew how to make a well done steak ... No medium and argued if you questioned him. Asked 3 times for lettuce on the salad bar before the manager finally filled it. The deserts were empty except the frost bitten ice cream .. Did I mention the manager not washing his hands In the bathroom gross......"}
{"text":"Would not eat here again. Food was cold and too sweet. There are better buffets in Pittsburgh area. If you like to eat low quality, mass produced food then this is your place to eat."}
{"text":"I consider myself a buffet connoisseur, so this is right up my alley (literally in terms of location, and figuratively). If I have one warning it is not to go here after dark. The reason for this is they legit leave the food there for hours, and it will proceed to come out of you for hours after. The sushi is average at best, and there is really nothing that stands out as far as quality is concerned. The dessert is horrendous. If your looking to break your diet you will painfully regret your trip here, as it is a very large disappointment. This is comparable to the Old Towne Buffet on 51 in that nothing seems fresh and they rarely change the pans. I would honestly suggest a trip out to York Buffet in Robinson if your looking for a more \"quality\" Chinese buffet."}
{"text":"They're currently closed for health code violations. I know multiple people who have gotten sick here. Don't do it."}
{"text":"Very average. Good selection. Cheap price for lunch. Dinner price not worth the increase. Food is always cold upon opening so don't rush to get there early. Overall you can find something you like for the money. Considering the fast food garbage out there this place can be a pleasant alternative."}
{"text":"I did like this place, I usually stuck with the same thing every time I went in. I never got sick, but.....sad thing is   http://appsrv.achd.net/reports/rwservlet?food_rep_insp&P_ENCOUNTER=201611160060"}
{"text":"My last 2 visits the sushi bar had no sushi available or very minimal selection. Since they opened the quality has diminished from the grand opening. Hopefully things pickup or I'll be eating elsewhere."}
{"text":"EXCELLENT. Easily the best buffet in the area. Food was hot and constantly replenished. Sushi was FANTASTIC!!! I would recommend this place to anyone. Great prices and great service! I will be back next week!"}
{"text":"We used to go here often, but because of being closed by the Allegheny County Health Department, I would hesitate to return.   This is part of the article from the November 17th Pittsburgh Post Gazette:  \"Some of the problems included holding food at unsafe temperatures, inadequate sanitization, foods not protected from cross contamination, fruit flies and poor employee personal hygiene.\"  The issues were supposed to be taken care of so they could reopen."}
{"text":"We go here about once a month. Each time has been great.  The food is hot and delicious.  Haven't been there any time when they didn't have everything out.  Lots of variety and even options that my 3 year old will eat like pizza and chicken tenders.  Will continue to go here."}
{"text":"Took the family here this evening and really enjoyed their buffet.  I think their mussels covered in a spicy sauce are as good as I've ever had anywhere.  I had a variety of Chinese items and found all I had to be very good.  How did I rate this facility:  the food gets a 5,  even without the mussels.  The service gets a 5.  The facility gets a 5.  The value receives a 5.  That adds up to a perfect 5 rating from me.    Can't wait to come back for a serving of those mussels."}
{"text":"Gross!  All the Chinese food tasted like fish - even the chicken and beef.  The pot stickers were over cooked, wontons were hard and left in container too long.  The service is ok.  I feel that the good a few doors down (classic Chinese) is much better for the money.  The bathrooms were dirty.  I will not go back."}
{"text":"I don't know where you could get more variety in a hibachi, sushi, seafood and Chinese buffet establishment. It's clean, fresh food, nice mood lighting, and so spacious.  The staff is friendly and professional. No wait time. Classical music in the background.  Great for the family or perfect if you need a quick place to go on business."}
{"text":"Ate here again recently. I decided to give this place another chance. My fiancé and I came here a hour until close for a quick bite, and I was pleasantly surprised. The atmosphere has changed for the better. The food still didn't seem 100% fresh, but I was really happy overall."}
{"text":"Seems like this place is brand new.   Over all, I liked it.   The staff was very attentive.   It seems that they cooked with high quality product.  There was a good variety of selection, though some was not as good as others.   I thing the flavors were a bit on the bland side.  The hibachi was not very good.   My favorite items were the pepper chicken and the fried dumplings.    The bathroom was new and operational, but a bit messy.  It was disturbing to see that the chart showed the restroom last checked on Wednesday (I was there on a Monday)  All in all, I didn't see any reasons not to come back, plus I did enjoy some of the selections, so I would eat here again."}
{"text":"I've gone here about 4 or 5 times since they opened in May.   The food is always hot and they have many, many options even for a picky eater. They have everything from \"chicken on a stick\" to different kinds of seafood, to steak. They also have the traditional: lo mein, chicken and broccoli, general tso's chicken, and many others. Dessert includes fruit, yogurt, brownies, orange cake (it tastes like orange, I don't know exactly what it's called), and ice cream.   This place is pretty good-a good all you can eat meal for a good price.   Also, because it's in the same shopping center as The Home Depot, Sonic and Giant Eagle, parking is abundant & plentiful.   Bottom line: If you want good Chinese food without such an expensive price, this is it."}
{"text":"As I mentioned in a previous review, my boyfriend is a buffet freak. He's been trying to get me to come here for awhile and I finally gave in (thanks to his wallet, of course).   Upon entering, I was impressed by the size of the place. It seems to go on forever! Not only is it huge, but the upkeep is superb for a buffet. Very clean and sanitary, unlike most Chinese buffets. There are probably close to 15 different stations (including hibachi and sushi) to choose from and employees are working hard to make sure everything is filled and looking great. I should mention that we went on a Wednesday night and the place was pretty slow. It made for a more comfortable dining experience, especially considering it's a buffet. Nothing worse than chaos going on around you while you're trying to enjoy a meal.   Whether you're looking for American or Chinese, you'll definitely be satisfied. They have so much to pick from. My favorite options included the coconut shrimp, green beans and salt and pepper chicken. They all were tasty and definitely had me going back for seconds! Wasn't too fond of their honey chicken, which is a bummer because I'm usually a fan of this kind of dish. I thought the chicken they used was fatty and the sauce was way too heavy.   I would definitely return! The price is right (I believe a little over $10 a person) and the food and maintenance is great."}
{"text":"I had heard some rumblings on social media about this place closing, and since I was in the area, I stopped by today, and I can confirm the rumours are true, this business has closed.   I had heard the health department shut them down back in November, and I saw a link posted here by Nick L., that showed the reports . . . all seven pages of them, and they were not good.     I can't say that I will really miss this place.  I was here a few times in the past, and I always thought the food, while large in quantity, was always poor in quality, and I always just thought of this place as generally mediocre.   Farewell Grand China Buffet."}
{"text":"I love a good buffet. They're hard to pull off if you don't have turnover. I've been here a few times now and there are land mines and safe bets throughout. I can't give any place more than 2 stars if they use MSG. There's no such thing as an allergy. This ingredient should NEVER be used. It's unnecessary. This will be my last visit here. There are plenty of Chinese restaurants in the area that know better."}
{"text":"You can't get any better for the price. You can get all you can eat for $6.99 during their lunch hours. I've gone there almost weekly since it opened. Overall the food is of pretty good quality for the price- and the selection is awesome. I was in awe at how big the place was when I first walked in. Some days the food is better than others, but it's a buffet, so it really depends on how many people are there and how long the food has been sitting in the heating trays. They are usually really on top of it though, and food is replenished quickly if it runs out. There's a salad bar, Asian cuisine, sushi, American staples, ice cream and other desserts, so there's something for everyone!"}
{"text":"Here's my guiltiest not-really best-kept food secret: I love greasy, questionable, cliched, brown-sauce-or-red-sauce you-will-be-hungry-soon-order-takeout-now Chinese food.  In a rising city of farm-to-table, manageable portions, and mindful eating, buffets are certainly not on the increase; and, while the city proper has a few (a nice small one in Oakland, a truly classic one downtown, another in East Liberty that hits the spot), my personal self-unimprovement mission to hit all of the Chinese joints in the area fatefully brought me to this buffet.  The staff is friendly. The place is huge. The seating is comfortable. The decor is perfectly classic and just what you need to hound a buffet full of Chinese menu all-stars, a sushi bar, a build-your-own hibachi grill, and some fried American cuisine just in case you can't stomach any of the other options. Everything tasted pretty alright, too. Not bad for less than ten bucks.  I wouldn't rave about any of it (except that I kind of am), but sometimes this kind of food really hits the spot--and if you're close by, or willing to drive out, the Grand China Buffet is a Chinese Buffet gem surviving the dying genre of cuisine."}
{"text":"Typical Chinese buffet, I can't complain. I liked the fact that they had a hibachi station, as far as I know no other buffet around this area has that option. I also think the pricing is very good, especially for lunch! I will go back."}
{"text":"Although this resraurant is outstanding overall, there are deficiencies: the owner does not interact with the customers nor even smile at us regulars; the tofu in  the mixed vegetable dish that I have loved at the lunch buffet is no longer available and tofu is not offered at the hibachi station as one of the ingredients.  I suppose I was the only one who was eating it and that it was going to waste.  This is causing me to dine here less often."}
{"text":"Servers were nice and fast to remove a plate and fill a drink.   Paid $9 for lunch which was kind of high but atleast the food was good.  Sushi kinda basic rolls but where fresh.    Wonton soup broth was kinda bland like out of a can.   Not bad for lunch.    Gonna have to give dinner a shot."}
{"text":"Stale food. This place has gone down.  The food was not fresh. The crab legs looked awful. Even the fortune cookies were stale. They used to be at least average."}
{"text":"Not bad for a ten buck sushi fix. You're not going to get the largest selections but the sushi is made right before your eyes.   The rest of the buffet was very good looking, meaning the food looked great, but that's where it ended. The food was bland, and in certain cases cold. Pretty disappointing because as it said, it LOOKS good.   It is a mixture of different foods, although mostly Chinese American. They do have decent sushi and hibachi stations. This night at the eleven stations featured pork loin, ham, craw dads, baked potatoes and many side dishes. Again, they all looked really good, but the seasoning was non existent. The white rice was cold as were the noodles.   The dessert table, again tasteless cakes, cookies, and puddings. What had the best tastes was the fresh sliced pineapple, so nature is the best cook. Unless you have a lot of mouths to feed and don't want to spend a lot of money, or if you need a sushi fix and don't mind not spending fifteen bucks per roll, this might be your place for dinner.   Open for lunch and it's only 6.99."}
