{"text":"Was in Toronto for the first time celebrating my boyfriend's 30th birthday. My Aunt and Uncle live in Rochester, NY and make frequent trips to Toronto. They are really picky about food, so of course I looked to them for a recommendation. They couldn't say enough good things about Grappa, and I am so glad we followed their advice!  The staff is so friendly and welcoming! However, I've heard that is a natural trait of Canadians :)  Food was great; I wish I could have eaten more of it! Reasonably priced too. Will definitely come back if we ever find ourselves in Toronto again!"}
{"text":"This was a decent place on a Thusday night. We split the mussels appetizer and stuffed salmon. Good quality food for a decent price. Service was exceptional but the place was empty except for us."}
{"text":"Was first brought here as a child, by my parents, a good 15 years ago.   We've been going back, as a family, because of two reasons; the staff and the food.    I will say that in the past the food was fantastic and there wasn't a complaint to be heard.  There was a rough patch of about 5 years ago where the food started to go downhill.  It's never enjoyable to hand over hard earned dollars for a mediocre meal - especially one that should be good.   Further, during that period, it seemed that Restaurant Makeover didn't do any favours for the quiet trattoria.  The renovation gave the resto more open space and a modern feel. But, it's now louder than it ever used to be - forcing the older patrons to find greener pastures.    Recently, the ownership and management of the restaurant has fallen to the second generation and so for, so good.  They've managed to put a stop to the revolving door of chefs in and out and i can say that the food has a consistent voice again.  In fact, some dishes are better than they used to be.  Others still need a bit of work to recapture their former essence.  The specials are far more adventurous than they used to be, which is nice.  And, Arthur, the sommellier, is back which makes choosing wine so much easier.    We have an arrangement, that he chooses the wine for me and If I don't like it, he'll buy it and at the end of the night, drink it at the staff dinner. He hasn't steered me wrong yet.   Our most recent dining experience was this past weekend.  Two people of our group of six had never been there before and found the menu to be diverse.  Staff were incredibly attentive and accommodating to any substitutions or allergies.    The guys all had land animals - Striploins and Lamb while the ladies had Pasta.  If you like hearty spicy pasta - get the Penne Abruzzo.  really nice Italian sausage and Bacon in a spicy tomato sauce.  The pastas were delicious and the meat was very well cooked.    We felt no pressure to vacate the table and we could linger and digest and enjoy the evening.  At the end of the meal, we were offered an apperatif, on the house, which is always nice to have before the bill comes (which was quite reasonable, I might add)  All in all, Nelson and Phil have done a great job of turning the resto around and making it younger and more energetic while buffeting the food back up to a consistent standard.    Would go back in a second."}
{"text":"This place was sweet and cozy.  The service was impressive.  Even though we were there on a busy Saturday night, we received full attention, from numerous staff. The decor is a bit like being in your grandma's living room but it still had  charm.  The crowd was generally older, but as the night wore on, younger groups trickled in.   In appetizers, the gespacho starter was mediocre, using tomato sauce as the base rather than fresh tomatoes. The rib starter was a winner, delicious and generous, although more reminiscent of korean style short ribs than anything italian. The angus steak was delicious, and well matched with side vegetables, as was the Tilapia. We had the creme brulee and lemon coconut pie for dessert.  The creme brulee, as always, was a winner.  The lemon pie was made with good ingredients and real fresh creme, though a bit too sweet for my taste.  Overall, a good place to go when you are tired of going to the trendy and just want to have a decent meal in little Italy."}
{"text":"What a disappointment!  I went here tonight with my parents and partner to celebrate my mother's birthday and the meal went from bad to worse.  My partner's meal was the worst of the four: his tomato and goat cheese appetizer was horrid to behold and to taste, and his pasta main course had the consistency of glue.  Meats were smothered in brown sauce and paired with oversalted mashed potatoes.  My cheesecake was simply inedible -- I literally tasted it and could not manage another forkful.  And the waiter never even asked why it went untouched!  Service faltered considerably as the restaurant filled up and they even forgot to acknowledge my mother's birthday (we had asked when making the reservation for them to put a candle in her dessert).  The coffee order got messed up.  What happened the the days when one was offered a proper after dinner drink here?  I know they are closing in three weeks and are moving to Etobicoke. .  Had they performed well this evening, I would have definitely tried their new place. I will certainly not follow them there.    So sad to think that this was such a good restaurant about 15 years ago.    Enough said."}
{"text":"SOOOOOO happy that we went to Grappa tonight.  Last year, when we visited Toronto, we went to the Italian Village and ate Marinella.  It was o.k., but we were hoping for better.    Grappa was recommended by the hotel concierge, and it was worth every penny.    They had a special 3 courses for $35 deal.  Two of us had the steak with the salad, and it was perfect.  Another had the linguini campagna with a starter of carpaccio originale.  He said it was great.  My mom got the salmon and the insalata caprese.  She said it was amazing, and they were the best tomatoes she has had in a restaurant!  The desserts were incredible.  My mom and I had the frozen mousse torte.  I don't usually eat dessert, but it was a slice of heaven!  The others had the lemon-lime sorbet and the vanilla creme brulee.  Again, both were a hit!  The service was impeccable.  And we weren't fed and shoved out of the restaurant on what is one of their busier weekends.  Can't wait to come back to Toronto.  I will definitely be revisiting Grappa!"}
{"text":"this is a delicious little Italian restaurant, right in the middle of beautiful little Italy. the menu had lots of selection of meats, seafood and vegetarian. i especially liked the fixed price menu, which had some great options and combinations.  the customer service was excellent. the waiters were very polite, organized and always checked up. the plates were also cleared out when your meal was complete.   the restaurant itself was very nice inside. the tables were spaced out well (unlike some other Italian restaurants that like to cramp you in). the lighting was nice and the atmosphere was casual.  overall, great Italian restaurant. i would recommend it to anyone, and i will be coming back."}
{"text":"I came here with a group of friends for dinner during Winterlicious.  Just like the above description, I would say that I've \"meh, experienced better\".   The place is small, and even though we made reservations we still had to wait since it was a fairly large group.  After we ordered our food, it took a while for it to arrive.    I ended up paying $35 for apparently a $60 meal.  But still, $35 for this is supposed to be a great deal? I have never been a fan of Winterlicious... but hey, food is expensive and I guess this is cheap in comparison to a regular night.    The location is fair, its on college street, you can judge what you think of the location.  Overall, I wouldn't come back to this place."}
{"text":"You know those nights when all you want is some good Italian food that isn't going to cost you a fortune, and won't require you to wait in a lineup?  Well we had one of those nights a while back (on a Friday of course, when things are going to be packed), and the whole College strip was starting to make us crazy. So we walked a bit past the mayhem of Little Italy, and we saw Grappa, sitting there by itself, with no lineup! Success.  Staff were insanely nice and attentive. The menu looked good, food was a bit on the pricey side, but whatever. The wine list was REALLY good, we ordered a great bottle of wine that made the whole night good.  The food. Oh, the food. I really want to give this place more stars because everything was good, except for the food. Unfortunately, people go to restaurants to eat food, and this place's food just wasn't good. I had a salad to start, with mushrooms. Literally there was just oil on the salad, and the mushrooms tasted like they were cooked with Pam.  As for my pasta...there was so much oil on the pasta that I couldn't even pick up the spaghetti. It slipped off my fork every time, and then would splash oil everywhere. Ew. And the sad part is, there wasn't anything to it except for the oil. What about spices? Fresh tomatoes? Some cheese? Nope. Just oil.  My boyfriend's duck wasn't cooked very well, and I know duck is generally on the fatty side, but this was just too much fat to deal with. Not to mention that the plates our food was served on were chipped. Kinda tacky, but mostly kinda dangerous.  Needless to say, we haven't been back. Nothing against the staff, the location, or the wine, but the food just isn't cutting it. Next time, I'll wait in a lineup at a better restaurant."}
