{"text":"First time visit to Grayton Road Tavern for an evening of dinner & dancing with friends and my sister August 12, 2017. We  enjoyed an evening of good food and extremely talented musicians  providing entertainment; Ace Molar Band.  
The staff is awesome, shout out to Courtney, she is energetic, has an uplifting personality and did an amazing job handling a busy night. We received excellent service.  Met Bill, the owner, he took the time amidst a busy night to talk with us. This will be our place to relax in a positive fun atmosphere.  Jason, one of the managers whom we met a couple days before is also an impressive guy who cares about the quality of the food and making sure patrons enjoy the overall experience. And learned they serve breakfast on weekends."}
{"text":"Great Service, have been here a couple times each time people are friendly and the food has been great.  Has an outdoor bar with high top tables and a little seating area with wicker furniture."}
{"text":"Gina and staff provide an atmosphere that's hard to beat. Great space both indoor and out coupled with fresh menu selections makes this a must stop tavern."}
{"text":"Sat outside at the patio bar. Had the medium wings. They were very good. Quick service. I met the bartender, Angie. She was very nice. Made great conversation and was very attentive to all customers around. I have been here before where I thought the other servers and bartenders could smile more. Next time I'm in, I'll look for Angie."}
{"text":"Pretty decent place for meet-up with friends. Excellent food with moderate prices, has a good selection of seasonal beers/drinks. Can get loud inside when a live band is playing, has a large patio."}
{"text":"To start with you have to understand this is a bar first and a restaurant second. My wife ordered the Mediterranean pita and I had the Italian beef. Both we're just Ok. If you have a group looking to go somewhere and get drinks and some average bar food this will fit the bill."}
{"text":"I'm not saying this because my house is several blocks up the road...... 

This is a phenomenal place to visit, food is great, atmosphere is fun and people are always friendly."}
{"text":"Arriving to Cleveland late, and staying at a nearby hotel... this is a great option to grab dinner.

I had a jalapeño burger (of sorts), it was not spicy or filled with deep flavor.. But it was a solid burger.  There was breaded jalapeño poppers - not 100% sure on those...they were pretty mushy and without flavor.

The burger came with fries, lots of fries (like 70% of your plate will be covered)...  If you like fries, you will love these deep fried fries.

They also have a nice selection of local & national beers, liquors, and mixers! 

It's solid bar n grill ..  Enjoy!"}
{"text":"Pathetic coleslaw, bland mac n cheese, basic pulled pork. I did however enjoy the black n blue burger. Slow service and was asked to move so they could accommodate other guests. I told them Id gladly move when the waitress brings the check. Not worth it even with the groupon."}
{"text":"I love coming here because the patio is so nice and they have the local beer I'm looking for. The burgers are pretty awesome too, so for me, it made a great lunch spot because it's not overpriced"}
{"text":"Stopped in about 10 pm. Beer was cold, wings were terrible. I've tasted better wings out of a microwave. While I was sitting there the cook came out and said the kitchen was closed. I wish it closed prior to ordering."}
{"text":"Awesome food. Great service. Excellent prices. I have never had a bad experience or meal at this place. The staff has always been extremely helpful and friendly. The owners seem to be very involved and work hard to put out a good product. The soups are top notch. Great place to enjoy a night out."}
{"text":"Tried this place last night for the first time with my husband. It's your standard run of the mill sports bar, with some above average food. I got the pulled pork sandwich, which was AWESOME and huge (had to take half home), my husband got the chicken philly sandwich which he said was definitely five stars. They give you a shitload of fries, which are also really good.

Per a previous reviewer who claimed to be a \"pulled pork aficionado\" who was salty because they put the slaw on top of the meat and he \"didn't like the mix of those flavors\" - perhaps you should stick to pulled pork from Denny's because the marriage of BBQ and coleslaw is a happening that invokes the song of angels. You need to broaden your BBQ horizons."}
{"text":"This place is incredible! The food is way better than your typical tavern. The service is good. The patio is cigar friendly which is a major bonus in my book. Good entertainment on occasion. To be completely honest, I hesitated in writing this review is because I wanted this place to remain a well-kept secret."}
{"text":"I like this place because it's spacious and has good food and it's a bit off the beaten path! You never feel like you are in a crowded bar and you have room to enjoy your meal if you're sitting at the bar or a table. The food is decently priced and they have a good amount of tv's to watch any game on.

Check out the Pizza deal on Tuesday nights!"}
{"text":"Cool outside seating area.  Inside is very spacious.  Good service.  Menu offerings range from above average to average. Great place to watch a sporting event.  Tvs everywhere.  Very cost efficient also."}
{"text":"Came here because it was walking distance from my hotel and it had a Touchtunes. The food was good and the drinks were cheap. I came on a Wednesday which is taco night and the tacos were only $1 each. Overall, a good mix of people, TV'S to watch the game, and a nice clean bar."}
{"text":"Have had great service every time I've been here. Tay is the greatest server I've ever had anywhere. He's very personable and attentive. Definitely get your money's worth on food and drink."}
{"text":"Out of 3 different beers. Out of pretzels. Pouting was just basically French fries with mozzarella sticks cut up on top. Calamari was okay but very small portion and my 5 year old niece could've done a better job with plating. 
Wanted to get the big pretzel plate but they were out of pretzels too. 
Pizza was greasy and made me ill. They were out of eggs as well. 
Waitress was chewing gum the entire time and the iPads make it so impersonal and hard for not only the waitress but hard for customers ordering. 
Won't be back."}
{"text":"Came after work at 7am for some food, wasn't aware they had some queen of hearts drawing. People lined up around the block and all inside waiting to buy tickets. Was told food wasn't a long wait so I ordered wings and mozzarella moons (yes at 7am this is a night shift breakfast). Watched other people who had just walked in not even 20 mins ago get their food. 40 mins later my food which probably takes all of 3 minutes of man time (drop in fryer, leave them, come back for them) were about to be in the window after I asked to cancel my order. They took my food off my check and I left. How about serve the people that are just trying to be in and out so you can get more queen of heart ticket buyers inside? You know the ticket buyers ain't going anywhere so why not put their stuff on the back burner? Will never spend another dime in this place after that experience. Was lied to from the start then they were more concerned about the 120 people they had inside because they were over their fire code rating, one of the guys from the kitchen came and was counting at the door while still over capacity inside. Reminded me of people trying to get a \"Turbo Man doll\" in the movie \"Jingle All The Way\"."}
{"text":"Great place, great beer, great food. The burgers are the best. The tater tots were awesome. Very kid freindly"}
{"text":"Bummed I used to love their food but they changed vendors and now everything tastes bland. Not likely to come back."}
{"text":"this was my first time here and this is way better than your typical bar food and the quantity you get is crazy; I have a pretty healthy appetite and I had to take my hamburger home after digging into the topped nachos. great atmosphere too."}
{"text":"We stopped in at the GRT after a round of golf. Our group was very tired and hungry. I was looking forward to their pizza, which was very good when I had ordered it in the past. When the pizza arrived, I could immediately tell it was very undercooked. I confirmed that the crust was almost raw by trying to cut into a slice with my fork. The bartender then commented that it didn't look right and offered to send it back. I reluctantly agreed because I am hesitant to send food back to the kitchen ever. The pizza came back (the same one, minus the slices on our plates) about 3 minutes later. The cheese was more browned, but the crust was still undercooked and doughy - to the point of being able to put a fingerprint in it. I believe they simply shoved the pizza under the broiler for 30 seconds. Of course, it was still inedible. The bartender offered to have them cook a new one or to order something else. If the kitchen staff can't cook a pizza right than I don't trust them to make anything else properly. Without asking, they removed the charge for it from my bill, which was nice, but I would have preferred something to eat besides a few onion rings.

I don't expect much from bar food, but to try to pass off that pizza TWICE, on what appeared to be an average or slower day, was ridiculous - particularly for a place that brags about its great food.  On the plus side, the bartender was friendly and poured some strong beverages, but next time I'll follow GRT's own advice. Their inadvertently ironic slogan is, \"It's better to eat great food at a tavern, than it is to drink at a restaurant.\" I'll leave it at that."}
{"text":"My first time coming here and it is good, the service was great and the food was pretty good actually for being bar food, great place to come with a group of friends to drink and eat without having to pay really high prices, this place has a patio too which we did check out because it was slightly chilly outside but I can see it being a good place to come watch sports games. I definitely recommend the sliders and the loaded pretzel, beware though, there is a ton of salt."}
{"text":"Horrible, I'm very saddened by this as this was my go to breakfast place on Fridays as they opened early. After two bad experiences here I'll never go back. Literally I was a regular for over a year and now I won't step foot in the place. My recommendation is to avoid at all costs."}
{"text":"Great new place!  Bartenders are very helpful and attentive.  Beer selection is AWESOME!  Food is pretty darn good too...try the sliders"}
{"text":"We went on the wings/tenders special night and all of the dishes we're severely overfried and overgrilled. The chicken was dry and seemed previously frozen. Stay away from the fried pickles, they were dripping in Greece grease and were soggy. The service was pitiful... Made us feel unwelcome and as if we were a burden to them. I would avoid this place."}
{"text":"Went to this place on a Saturday afternoon. Not crowded, plenty of room. Food was traditional bar food. The barmaids:  clearly did not like each other. They ignored our multiple requests for a drink; THREE requests before our order was taken. When you go for a drink at a bar, you should be able to get one. If you're looking for good service, go elsewhere!"}
{"text":"Love this place. Prices are reasonable. The service is great and the food is good. I am hooked on the double-burner wings."}
{"text":"During a stay at the nearby Hilton I visited Grayton Road for dinner and a ball game. My experience was unfortunate. The service was absolutely horrible, I had to go find a place setting, I went to the bar to change a $20 so I could pay my bill with cash rather than continue waiting for the server, etc.  I had the Italian beef which was way over salted. 

Nevertheless I will return if I stay in the area again. The atmosphere was good, the homemade chips were exceptional and tables with a different server received good service.  The burgers, pizza,  etc looked good and customers seem to enjoy the food.  I simply had a server that should be in a different business and the cook over salted the au jus."}
{"text":"If you love a great burger, then you need to try a burger the next chance you get. I can honestly say I have not had a bad burger here. The wing are good too. The sides are generous as well. The cooks are the best kept secret to this establishments sucess. Being a local is good, but visitors are greeted with the same hospitality.  Great women behind the bar. They really keep everthing in control. Keep it up!"}
{"text":"Unless you have a long time to sit and wait don't go at lunch. Eye candy not worth it. Great food however but dang where's my f"}
{"text":"We like GRT and go back when we need a wing fix. It is normally above average bar food. Unfortunately, today was a big miss. Most of it came from the waitperson. They could have just cared less about anything, including whether we enjoyed ourselves.  Asked for double burner wings extra extra crispy. It fell on deaf ears. We ate half and took half home to crisp and eat later. When you don't finish your app, it might normally be a red flag. Not today. The Italian beef was fair at best. The au jus was inedible, as it was extremely salty. When we mentioned it, the reaction was priceless. It was mentioned to the kitchen they said. Ok, then. Too bad, as we normally like it here."}
{"text":"Great lunch specials! Monday $6 burger, 1lb of wings,  or chicken tenders.  Burger was big, cooked to order, and juicy. Great atmosphere! Service is good, friendly servers. They do have wifi available as well."}
{"text":"Don't expect to get a nice whiskey or wine here, it's a beer bar. The food it passable. The acoustics are terrible. It's hard to hear people talk right across from you and the sound system from the juke box is awful. I won't go back until they fix the sound system and overall acoustics."}
{"text":"I was in from out of town and it was right by the hotel. It was a Thursday evening. They have a great daily special and that's what you should stick with, unless the special is wings. I really can't understand how people were ordering them...They were very tasteless. Other than that, our service was good until we got to the bar. 
Harder to get service since we weren't local. The afternoon bartenders were very slow. The bartender that came in at 10 pm out worked both of these girls together. They were pretty pathetic. Coming from New Orleans, I know food and bar service. If it wasn't for our awesome waitress MARIA, we probably would have never got a drink. Even after we moved to the bar she would get our drinks for us."}
{"text":"Okay local bar. Short on craft beers, but the service at the stick is okay. I ordered the cheeseburger sliders - they were overcooked and way too salty. Ate one and was done. I'll give them the benefit of the doubt and try it again if I'm in the area (HGI is right next door) but wouldn't go out of my way to eat or drink here."}
{"text":"TERRIBLE EVERYTHING!!! (Exception to cold beer) ordered pizza with chicken spinach and mushrooms. Came out without spinach. Wait staffed questioned us if it was under the cheese. Waiter took it back to the kitchen and took it back to kitchen where spinach was thrown on it. Came here with 2 friends.one got a well done bacon cheese burger. Came out rare. The waiter then asked my other friend  who got a byo burger if he had pickles both waiter and friend had to investigate the burgers due to the waiter not believing us. I had to wait 20 minutes for a plate napkins shake cheese.....My pizza was sitting on the table while my friend got a whole new reubin sandwich due to the burger being not well done. I FINALLY GOT A PLATE WHICH WAS A SIDE PLATE. My slice of pizza was hanging off the edges. I asked if they had a bigger plate the waiter said Not for side pizza. I informed him it was a whole pizza not flat bread or app...I stopped the busy waiter and asked for a box he asked if i wanted a pizza box... I ate one slice this pizza will not fit in a large to go hinged box. we walked in at 9:30pm and got the checks at 12am. I HOPE THIS SERVICE ISNT LIKE THIS FOR MY FAMILIES RETIREMENT PARTY THIS WEEKEND!"}
{"text":"The bar is new and looks it. Really nice patio. Reasonable prices. Pizza but doesn't offer pineapple but overall it's better than your average bar menu. 
Go to watch the game on the many tvs."}
{"text":"We ordered The Continental Burger, fries and BBQ double burner wings.  Food was great except for the fries.  I was surprised they had generic frozen fries.... they need to do fresh cut!"}
{"text":"Greyton is right outside my work so me and the coworkers go quite often. There's plenty of seating. I've never had to wait for a table. Service is usually pretty attentive. I've had a few instances where we've waited almost 15 min to get my credit card back. The food is good! Bar food. Best thing on the menu is their French fries. Close second is their white cloud pizza with chicken. Price is moderate. They have great specials (pic attached) best deal is their $5 pizzas on Tuesdays. Plain pizzas for $5 and $.50 for additional toppings. Overall, I enjoy it!"}
{"text":"The Grayton Road Tavern is right around the corner from the Hilton Garden Inn I was staying at for a couple of nights.

I sat at the bar and ordered their fried pickles - which come with this amazing Chipotle sauce. Both the fried pickles and the sauce were outstanding. Often times, the coating on fried dill pickles comes off when you are eating it - this did not - crisp and delicious! I'd spread that Chipotle sauce on cardboard and gnaw on it - it was that good.

I also had a plate of Nachos - which turns out is a huge serving. I could not eat it all!

I also had a couple of pints of the Nosferatu Imperial Red Ale from local craft brewery - Great Lakes Brewing Co., which was really good!

I came back the next night with a coworker and we sat at a high top in the bar area and had dinner. I had the spinach salad, then a burger sans bun - cooked medium. Both were pretty good. Fries were hot and crisp!

The place was really busy and hopping both nights I visited and yet service was good!"}
{"text":"Its a good thing the food is delicious because the service is terrible!  We went here for lunch, got sat after 15 minutes (even though there were several empty table) and a server did not take our order for another 20 minutes.

The redemption came when our food was served.  The portions are large and the food tasted amazing.  The perogies on the Lent menu were fantastic, and the salads were huge and full of toppings.  I've also heard the pizza is quite tasty.

I'll be back, but I'm sure hoping for better service round two!"}
{"text":"This place has a great atmosphere.   The bartenders were very attentive and friendly.  This place does the Queen of Hearts. They have a person specifically there to sell the tickets. 
I ordered the Spicy Cavitappi pasta.  It was perfectly cooked.  The portion size was exactly right.  I will be back.  To try something else."}
{"text":"Liked the ease of parking away from downtown Kamms and outdoor seating options, just very underwhelmed by the food. If you're not hungry, I can recommend this place for a drink. They also have live music..."}
{"text":"This place really can have great food and service and then other times it is not so good. I suppose it depends on who is in the kitchen and which wait staff is on.  

Our first two experiences were good, and they do brag about their great food so.... I guess I expected to get some, but that is not what happened. The fried calamari tasted like a bottle of salt and chewed like a rubber bands, and it amazes me that it was so hard to get waited on even though we were sitting at the bar. If it had been my first time there I may not have come back, but we will give them another try. I hope that our next experience will be better."}
{"text":"Great place near airport hotels - we had awesome food and beer, and plenty of sports coverage."}
{"text":"This is a great neighborhood bar tucked into an  unassuming strip mall. Come to play, \"Queen of Hearts\" and stay for the delicious food and well-crafted drinks. (I like their artichoke dip!) The bar is also spacious and the staff is very friendly."}
{"text":"Wonderful atmosphere and excellent people. The food is phenomenal. We had an amazing huge pretzel that had pulled pork, macaroni and cheese, and slaw in the twisted openings. We also had boneless wings that were the best I have ever had... excellent. We live in South Carolina, and I told my husband he will need to fly me here at least once a month to get these awesome boneless wings. I had that chili Thai. We will definitely be back!"}
{"text":"What a waste of money.  This place served french onion soup, but there were no onions, just French's dried onions, which of course being in soup turned into soggy pieces of dried bread.  No sweet onion flavor.  Just canned crap flavor.  Second course was the most tasteless santa fe salad I have ever had.  Of five people in our group, not one was happy with the food.  In fact one of our party had been there before and had favorite dishes which were no longer on the new, redone menu.  None of us will ever return."}
{"text":"Draft beer is always flat. This has been a problem my last several visits over the past 7 months. I love the fries here though. Just wish they'd fix this beer problem!"}
{"text":"Maybe it was a bad early lunch rush, but our wings was incredibly greasy and fries was soggy, service very slow"}
{"text":"Should have driven further for better food and family service. The hotel clerk told us that the place on the corner would be fine for my me, my wife, and our three year old. We weren't impressed. 

1) a guy tried to pick up my wife while I was parking the car. I'm so happy she decided to stay with me. 

2) they boast of a gluten free menu, and indeed the menu has gluten fee selections, they just don't have the gluten free food. 

3) they forgot to pull the pulled pork. It was just chunks of bbq pork. Also, they put coleslaw right on top of the meat inside the sandwich. I am a bit of a pulled pork aficionado and have never had the coleslaw mixed with the meat. I didn't like the mix of those flavors. 

4) unsafe accommodation for the three year old. All the chairs were high barstool type, and they offered a booster seat for him, but there was no strap to attach it to the chair, and no seatbelt to keep him in it.

The place is a clean and decent sports bar, but I wish we had just gone to Denny's."}
{"text":"Fantastic selection of craft beers on tap and in bottles. Definitely more of a sports bar environment which is ok. The food is reasonably priced and very tasty. Had a burger that was absolutely fantastic. It came tots that I I thought were kinda bland, but a little salt and ketchup takes care of that. Parking is tricky during busy times since it's inside of a strip mall. I'd definitely have no problems coming back here again."}
{"text":"Bar Service was poor. They changed the WiFi login and the server could not be bothered to give me accurate log in information. I would avoid this place.  I am typically an overtipper but I was made to feel like an inconvenience and left a dollar on my $15.75 tab.  (In all fairness, I had been there previously and the bar server was friendlier and more accommodating.)"}
{"text":"Have to say, came here on a whim on a quick overnight stay at the airport and was blown away with the quality of service and the delicious pizza. I have been craving this exact thing back in Los Angeles and have not been satisfied. 

I forget the bartenders name but she was OUTSTANDING. She checked up on me often enough but not every 5 seconds type deal. She recommended the pizza and she altered it to fit my request, which was FANTASTIC. That sausage, garlic and basil pizza was to die for. and WAAYY too much for one person, but I'm sure the hotel staff enjoyed my leftovers :)"}
{"text":"great bar, except the owner is too old, and too involved.  He doesn't understand how to run a successful, money making establishment. It will continue to be a barely above the red bar because of him."}
{"text":"I stopped in because it was convenient to my hotel. The Moscow mule was ok, the copper mug had seen a few dishwasher dings. The kickin chicken pasta was also decent and the fish and chips were ok according to my friends. The portions were on the large side. Nothing on the menu looked fancy so if you need straightforward edible, stop in. My friends and I sat at the bar because there wasn't an obvious way to get a table. I will say the locals to our right and left were friendly and gave us some tips on the food and explained the queen of hearts raffle. The lighting was a bit fluorescent bright and wierd which gave the whole place an odd vibe (sort of like seeing a night club in the day instead of theatrically lit at night.) our bartender was pleasant as well."}
{"text":"The chicken fingers are a very yearly meal and almost as good as the burgers!! 
Will defiantly return the beer and wine hit the spot and the bill was exceptionally reasonable!"}
{"text":"This area really needed a hot spot  like this.  Although in some respects it's just another sports bar - it is a decent one.  Fairly large, nice big square bar, pool table, good crowd, excellent  service. 

The food was very good.  Wings were fine. My friends had steak and said it was delish and they'd order it again.  The fires are good.  

One complaint about the food - I could taste the servers cologne on my celery.  If serving the public, first rule is,  no smells on the wait staff. 
Beers on tap were just OK. Cleveland is becoming smart about good beers and GRT could use some better ones on tap.

Overall a nice joint, hope it stays."}
{"text":"The food here is EXCELLENT. The three stars is based on the service of the food. Very very slow, and the waitresses are not knowledgable on their beer, what type of toast is served, etc... We stopped here on our way into Cleveland from the airport and only enjoyed the food. Good food, bad service!"}
{"text":"Two things. First, shut up, Roy. Secondly, I can name over a dozen quarterbacks the Browns have used since 99. Here's how these fit into my review. I first became aware of this place from watching Beer Money(the local sports trivia show that goes to local bars). Once inside, I was transported back to the mid 90's to the set of the underrated NBC sitcom, Wings. The blinds, the glow of Hopkins off in the distance, the aviation themed menu...If you are craving a 100th Bomb Group experience without the hefty price tag or stench of adult diapers, this place is first class. I ordered nachos, gar par wings and mozzerella moons. All were terrific(wings were steroidally meaty!) My server/ bartender was very attentive and nice. The patio is multi tiered and very inviting. The location is perfect for people fleeing the country. \"I just embezzled half a million dollars, off to Zurich, but first, some sliders!\" All that was missing was Antonio Scarpacci(of shut up Roy fame from earlier in this here review) played by the late Tony Shalhoub. I chowed leftovers the next day while catching some Wings on Netflix. Netflix was probably like \"wait, someone's actually watching this?\" Best part, GRT did not lose my luggage."}
{"text":"I may very well be eating the best burger I've  ever eaten in 100 ... no make that a 500 mile radius. Besides that the prices are reasonable and the staff friendly. Go. Eat. Enjoy."}
{"text":"First time visit and very impressed!  First, spacious spot with ample room to sit at tables and feel like you are dining with those next to you! Service was spot on! Told the server I was waiting for a friend to join and the server never returned until my friend was seated. THAT is the way to be a server-don't keep bothering folks who don't need it. 

Placed the order and food was served hot and without a great deal of delay! Sure it was a Thursday, but the place was filling up for the evening. Good job!

Very convenient for those who travel a good distance, since it is located at major interstate exits.

Definitely would visit it again, and recommend it to those who have not stopped in as yet."}
{"text":"This is a great place !!!!!  OMG !!!!!!!!  We had an awesome time!!!  
Food was great !!!  We had the huge pretzel with BBQ pork, mac&cheese, and slaw !!!  Amazing !!!  We also ordered Thai chili wings and the BBQ ranch boneless wings.   Guys they were the best !!!  Bartenders and manger were just the best !!   Folks this is a hangout you want to make as a regular !!!"}
