{"text":"I was recently in Scottsdale on vacation and stopped into Grayhawk Beer Co and was extremely impressed with not only the wide beer selection but the food was awesome!!!  Shishito peppers, the hangover burger(which works) then finished off with and adult Strawberry milkshake!!  The only only thing better than the food and drink was the great service we got. I have family that recently moved out to Arizona which is why we went out for vacation there so we sat a table for lunch and the server we had was on her game!!  She too great care of us and not being from around the area she had great suggestions for us. We moved to the bar after for a few drinks before we left and the bartender was a rockstar!!!  Great experience and I will say coming to visit my aunt and uncle will be a great excuse to come back to Grayhawk. Well done"}
{"text":"Was glad to find this place on Yelp. Close to home and a nice selection of taps.  Hardly anyone in the place which I couldn't understand because the food was awesome and they have a nice outdoor bar and patio."}
{"text":"Other reviewers are accurate. Beer is good. Food and service is forgettable. It's a great neighborhood spot that may struggle to make it if food quality and service doesn't improve. Waited a half hour for a club sandwich when the restaurant was nearly empty..."}
{"text":"My take: Any new restaurant is going to have growing pains.  I have eaten at this restaurant twice.  Both times the food was mediocre.  Service was excellent.  The hostesses at the door doing absolutely nothing are a bit annoying, especially while the wait staff and busboys really work their tails off.  The food needs some work - the deviled eggs were warm (should be cold, at least the hard boiled egg part), the chicken sandwich the chicken was put directly on the bread so the bread was soggy, there were flies all around the restaurant due to the bar windows being open (somehow there has to be a solution to this), the fries are really not that great and I would think you could find better and serve them hot.  The water glasses on the table I don't really understand - most people just want ice water.  Anyway, I would not rule this place out - give them time to figure it out."}
{"text":"Great food!  I really like the new menu.  It's so much better than Cheeseburgers and Cold Beers.  They still need to work on the service and getting the food out in a timely manner.  I will give the service another chance, because the food is really good. They have the Best Brussel sprouts I've ever had!"}
{"text":"Grayhawk Beer Co has done a great job with improvements since the previous owners moved out. Service and attitude of wait staff is engaging and fun! Good beer variety and great bar food with views of every game!!"}
{"text":"I have visited twice now and both times the food was great, wait times were reasonable and service was excellent. I love the patio and the open air bar.  Will definitely visit again soon."}
{"text":"The hubs and I stopped in for an early lunch and immediately loved the laid back vibe. The indoor/outdoor style restaurants are the best to sit and enjoy a cold beer on a beautiful AZ day. The waitresss and bartender were very friendly and attentive. We ordered the Cubano sandwich and it was delicious and full of pork on a nice crunchy sourdough bread. We also got the blistered shishito peppers and oh.my.word, we are in LOVE!! What a fantastic idea! A little crunchy, a little spicy  and served with a delicious aioli. I could eat them all day!"}
{"text":"Their food is terrible. I went here with my husband solely because we thought cold beers was still at this location. Not wanting to backtrack we thought we'd give this a try! We love beer and bar food so this should be a win win, right? WRONG.   It's a Friday night and the place is not busy. Not empty but no where near packed. We ordered all appetizers/sides. They took 25 minutes. If they were busy maybe I'd understand the delay but I don't want to know how long I'd have to wait if I ordered an entree.   The pretzels were cold, the cheese that came with it lukewarm and watery. The baked beans? Yuck! Their fries were the only thing I actually liked because I don't think you can mess up fries. My husband liked the wings at least.   We will not be returning."}
{"text":"We decided to give this place a try. We ordered the Barbecue platter for 4. It was terrible. The ribs were over cooked with an acrid taste & dry. You couldn't even chew them. The rest of the meats were dry & tasteless. The sides were equally bland.  I told the waitress & she advised the kitchen manager but they didn't bother to do anything. I paid $70 for a horrible meal.  If you are going to be a barbecue place then you better make sure you know how to do barbecue well."}
{"text":"Nothing but good service and a super cool and friendly manager. We love this place and couldn't be happier to have this place near our home. Our neighbors all come regularly and take advantage of the nightly specials. They struggled a bit when they first opened but new management has really turned this place around.  Everything we have ordered has been great, no complaints here."}
{"text":"I came here hoping to go to CBCB...when I saw that they had moved, I was willing to try something new and check out a local restaurant. I first noticed that it was slow for a 6:30 Friday night compared to the other restaurants around it. When my fiancé and I were seated, we were greated immediately by a server that was not too excited about being there. We ordered our drinks( their neighborhood social menu is actually really good) and an order of the pretzels. The pretzels took way too long to come out and were sub par. Tasted as though they were frozen and cooked. The beer cheese was good, however it was a little watery. For dinner, I ordered a build your own burger and it came out beautifully. My fiancé ordered the Alabama burger and it came out over cooked with a hard pretzel bun. He was far from impressed and sent half of his burger back. Our server was not the best and the food could have been better. I hope the best for this new restaurant, however, I will not be coming back."}
{"text":"Not a bad place for a drink, but probably the worst food I've ever had at a bar and grill. I've been there twice, to give it a second chance, and have been disappointed both times. The menu looks good, they just don't deliver. My advice, eat before you go."}
{"text":"Have to update this review as I can no longer stand by the original one from when it first opened. Unfortunately they have gone through many different employees. Service is inconsistent. Food is inconsistent. TV's are not monitored so as to have best live games on. Too many instances of vacuum cleaner infomercials on. I have seen people come in, sit down, and wind up leaving. Its too bad because Cold Beers and Cheeseburgers was always busy. This place its usually empty. Maybe this will close soon and hopefully another microbrew sports themed place will take over. If I were you, I would drive south to the new CB&C location for consistent experience. Or for a place closer, head to Tavern Americana which has good food, good service, and nice beer selection. It seems pretty obvious what needs to be done but doesn't look like they get it. We stopped going here even though it is in walking distance. I honestly think this place will wind up closing."}
{"text":"So disappointed- was really hoping this would be a great place to come for football season.  My burger was as not cooked as requested, fries were cold and my guests macaroni and cheese was dry and was sent back. Flies everywhere ..... same problem as when it was Cold Beers and Cheeseburgers. Had  really hoped they would find a solution to the flies. Management never addressed our returned food  item. Our server was very nice - the issues we had were not because of her. I felt bad for her and wished I had gotten her name. The many hostesses hovering by the door looked as if they would rather be somewhere else.  Overall disappointing and sad because I had high hopes for a good neighborhood place to grab a burger or snack during Football season"}
{"text":"We Just moved to the area and it's such a relief to have a local bar and grill we can ride our bikes to. The place is nice and not to mention how beautiful the new patio is and its dog friendly!!! Our server Korine was great and the bar manager Theresa had us laughing the whole time. They said their making small changes along the way to build a great neighborhood bar and we can't me more excited. The happy hour she has is amazing with great food choices and the staff is very happy and fun. We will definitely be back and letting our new friends we meet along the way know too! Cheers"}
{"text":"First visit:  They did a decent facelift to the former Cold Beers & Cheeseburgers.   It seems that the neighborhood has embraced this new spot. There seemed to be multiple regulars.  Menu appears to cover the bases. I just had a couple of appetizers, Mac & Cheese Balls and Shishitto Peppers. Large portions. Pretty tasty, though the marinara dipping sauce tasted like something out of a jar.  Only 2 \"Grayhawk\" beers, an IPA and a here, both OK.  Good list, otherwise. Something for everyone.  Bartender/Mgr. was friendly & attentive.  Good neighborhood spot. I'll be back."}
{"text":"Come for happy hour drinks and appetizers. We have ordered most of the appetizers and they are fabulous. The meals are fine, but not as unique and tasty as the apps. Bring back the BBQ pork nachos!!! The Brussels sprouts and loaded tater tots are great. Also a VERY gluten free friendly place. Most items are or can be made GF."}
{"text":"So, first off I would like to say I love the food and many of the staff members who work here. However tonight I had a very traumatizing experience there. The manager (Theresa) was in off duty very visibly drunk and as I put my arm around my mom she began to tell me how disrespectful I was and that I do not actually love my mother. After a hard day my mom was shaken to the core from this I began to tell her to leave my mom and I alone. She got up from her seat in a drunken stupor visibly falling around the restaurant, mind you her place of business, and got in my moms face and then my face. There was an exchange of cussing due to her close proximity to my face with her alcohol soaked breath. I began to record because I thought the owners would want to know how their employee conducts themselves. But as I put my phone up she looked at my with a crazed look in her eye and attacked me. I could not believe it as I shoved her trying to get away my mother began to stand up as I am only sixteen years old and about a foot shorter and a hundred pounds lighter than this woman. I began to shake with adrenaline and fear as she viciously verbally attacked my mom. My mom then was pushed by this maniac and they began to fight. Everyone who worked there started screaming with disgust and tried pulling her away from my innocent mother. I was in awe of how despicable one person could even be! I mean imagine the absurdity! She tried to kick us out keep in mind she is off duty and attacked us. The regulars that were in there vow to never come back because of the brutal aggression this woman had towards me and my sweet mom. I used to go two three times a week to this restaurant but until Theresa is fired I will never set foot in there again!"}
{"text":"Came into GBC today for my first time and I absolutely loved it! Food was delicious, drinks were great. Thank you for coming into the neighborhood!!"}
{"text":"Service very slow with 2 tables in the place and waitress seemed a little out put.  When I ask for a burger well done, they don't do that.  So I understand most folks don't like that.  However after telling her 3 times a hockey puck, I finally got it.  Burger was fine, service still mediocre at best.  Won't go back."}
{"text":"As stated by other reviews this place took over for CBCB with a similar menu. We gave it a second try my wife ordered the Cobb salad and it was delicious. I ordered a standard cheeseburger and asked to add jalapeños. .50 charge for the peppers but they weren't served anywhere. Our server asked what side I wanted with my burger and I asked for tots, they are listed as a side and the same price. There was a $2 charge for not asking for fries.  It is listed on the menu as later pointed out but still don't understand why the up charge if they're the same price. Anyway- the 13 tots I received were .50 each. There are no condiments on the table. We only saw our actual server twice so requesting more wasn't an option. The Russian dressing on the burger was hidden under the single onion string. Toppings must have been rationed tonight. I was served a single beer never offered a refill on the soda and the water glass was filled with room temp water.  We went to watch the NFL game tonight and left at halftime so we could get another drink -  Service was absolutely terrible.  Food was 50/50. Still bugged by $6 charge for 13 tots."}
{"text":"This was possibly the worst experience I have had at a restaurant for years... Dining room layout is a joke, they treat you like a packed sardine.. I was bumping the guy behind me and to my right.. After 8 minutes the server (young bearded guy) finally greeted our table only to make a snide comment about how I was blocking the aisle.. do you expect me to sit with my chest against the table I am a 6'1\" 190 pound man, not some bear taking up too much real estate. We ordered the Tots and some drinks to start..    Well about 10 minutes later the appetizer comes out and we still do not have drinks and the hipster bearded rude waiter is nowhere to be seen.. Finally he comes back with the drinks half way through our appetizer and we ordered our entrees, I ordered the wings and asked for them to be extra crispy.. Food took a very long time to come out and the wings were undercooked.. straight up pink meat throughout....absolutely disgusting!! Informed the waiter and he had a confused look on his face and acted like I was being rude not wanting to eat the raw chicken wings they just served me...at the end of the meal he acted like he was hooking me up by removing the wings from the bill and did not offer to fix the problem at all.. everything about this place is a joke and amateur.   So ill sum it up in five easy bullet points..  *Awful dining room layout *Terrible and rude service (My waiter was a younger guy with a big beard) *Overpriced and literally unsafe food (Undercooked wings that I asked to be extra crispy) *Bad management (Did not seem to give a crap about anything I said)   Save your money, eat somewhere else."}
{"text":"This is probably my favorite restaurant in the neighborhood! So glad they opened up here. As I walked in, I was greeted by a friendly hostess who promptly seated my table of 6. I noticed the 20 drafts they had and my table loved their house brews - particularly the A Mountain Amber and Grayhawk Hefeweisen. After, we shared a couple appetizers which were plenty in size and a deal for the money. Finished off with the Elvis burger and all around had a great experience. Can't wait to go back!"}
{"text":"We stopped at Grayhawk Beer Company again last eve. The new manager is very nice ! The service is friendly and efficient. The menu has many options and children will enjoy too. It's definitely a fun spot at the corner of Scottsdale Rd and Grayhawk Drive. Cheers !"}
{"text":"One, two, three strikes your out.  The first time we went it took forever to get our food.  The wings were horribly salty and cold.  The waiter was very nice so we gave it a second chance.  The second time we went we waited 50 minutes for food.  Two different managers thought we had finished our meals.  Nope, still waiting for our food. Couldn't even get water or drink refills.  Tonight, third times the try, waited 20 minutes for drinks.  Finally got it and had a bug in it, gross!!!  Now waiting on desert.  If the service is this bad with 12 people in your restaurant what is it like when you are full?  The servers and managers are clueless!  I should have had two completely comped checks for problems and horrible service. Will not give them a 4th chance."}
{"text":"Came here because my husband had a coupon. Ordered off the happy hour menu, I order brussel sprouts everywhere. These were the best! Wow! The ceviche waa equally delicious!"}
{"text":"Went at 6pm in a Friday, oddly empty inside. Wait staff was veeeeery slow to take drink orders, and then very slow to come take food orders. It seemed like there was only one waitress in and a new one in training. Food was good, can't deny that. Good beer list. Reasonable prices.  But the wait was ridiculous for how empty it was in there."}
{"text":"Tried it out because I saw they have 1/2 price bottles of wine on Wednesdays. Enjoyed our bottle of wine with appetizers, our favorite was the crispy Brussels sprouts and atomic wings, super spicy but very good. Our server was attentive and friendly. We will be back."}
{"text":"Not sure which was worse... the service or the food. There were probably only two to three other tables and everything took forever. Where shall I begin? Their website states they have numerous gluten free menu choices. We asked our waitress what was gluten free and she didn't know. Also, didn't know what the icons on the menu indicated. They shouldn't offer gluten free tater tots and fries when they cook them in the same fryer and the onion rings which aren't gluten free like the online menu indicates. I ordered a Diet Coke that never came. I ordered the Alabama burger and my boyfriend ordered just a regular cheese burger. My burger was supposed to be medium rare but was mostly gristle. My waitress never returned for me to tell her how awful it was. She picked it up and could clearly see I had only taken two-three bites but didn't bother saying anything. The kitchen got our sides wrong and the waitress noticed before she dropped them off but didn't bother having the kitchen switch them. Could be a great local place. Won't ever be returning. They are only getting one star because you can't give zero stars. Maybe our waitress was tired."}
{"text":"Great service. Ribs were awesome! If you are hungry I recommend the loaded tater tots and the chicken wings for appetizers. They compliment each other!"}
{"text":"Came here with my husband and dog, sat outside very nice and of course dog friendly! Good beers! I had the superhuman salad- AMAZING dressing (coconut & Turmeric) my husband had the butternut chicken sandwich but changed it to Swiss cheese and avocado and no tomato. He said the chicken was well cooked and gave it 8/10. Laura was our server she was friendly and gave us good service. I would come back!"}
{"text":"Waited here while my car's tires were changed. Awesome little inside/outside bar on a small patio with misters. Pretty good beer selection with about 20 taps, excellent service, and the food smells great. I'll have to stop by again with more time and an appetite."}
{"text":"Great place if you want to experience tastless golf course food. Happy hour is worth it, good beer prices however food Is subpar for the price. I have owned several restaurants and have been on yelp for years and don't review places however I feel compelled to let the owners know their investment is at risk. A good chef for a burger and appetizer concept is not hard to find."}
{"text":"I went to grayhawk beer co. for the first time and came away impressed. The drink selection is fairly wide, and they offered a good amount of stout options for those that don't love IPAs. I tried the white chocolate ale and it was out of this world delicious. Word to the wise - get the fries."}
{"text":"Where to begin, perhaps with the under cooked onion ring appetizer, or maybe the salad with the greens that were more stems and stalks than edible leaf, or the sizzling burger that was overlooked and then plated with the lettuce and tomato sandwiched with the bun so that by the time it got to the table veggie garnish was wilted and warm. Prices are on the high end. Normal variety of beer and wine."}
{"text":"With Cold Beers move down to Mayo Blvd., we wanted to at least give this newcomer an opportunity. Underwhelming, when so many great local beer and burger options under 10 minutes any direction from this corner. Only a few guests  at the bar at 6pm with just  2 tables dining was a bit of a flag to start and our burgers were simply just very average. Brussel Sprout appetizer was excellent though. I think what underwhelmed us most was the low energy level of the staff... just blah. Realizing it's August,  I would still hope for more energy and at least \"offers\" for new guests, a burger of  the day on Happy Hour rather than only apps and possibly feedback cards to help the bigger picture. Can  the chef coming out (again it was very quiet) with samples of a few creations ... have to think out of the box with so much competition and engage your customers. This one is a big maybe - wait and see."}
{"text":"Was here to go to cb & cb. Was disappointed that it closed. But decided to try out Grayhawk beer company. We walked in and sat down for 10 minutes. It looked like there may have been one person working at the time, but he/she was nowhere to be found. After being ignored (not acknowledged/greeted/ or served) for 10 minutes, we decided to leave and take our business elsewhere. Very disappointed with the new restaurant."}
{"text":"If I had to title this review , I think it would be something like ..POOR AND CONFUSING SERVICE. Met a couple of friends last Saturday afternoon for a couple of beers . First time there. Service was at a slow place . The place was not real busy . I got there after they did and it took me quite some time to get a beer . My one friend waited a LONG time to get a second beer . We didn't see our server for quite some time .. and then we noticed her leaving ... as in shift over ! As I came back from the restroom , I saw my friends second beer just sitting at the bar so I grabbed it myaelNow it left us confused on who was serving us . There seemed to be enough help to cover a small crowd . It may be the size of the place that makes you see everything that is going on . I think on this night , the place really lacked a good Manager to oversee the employees . Happy hour prices were good . Might be back someday but too many choices with the right service . One more note .. bathroom hall area was very greasy . A slip and fall accident was possible .   Thanks for the reply ."}
{"text":"For being open for such a short amount of time I would have to say I am impressed with this place! Exactly what the neighborhood needed. The beer selection is extensive and there is something for everyone. The food is amazing, I recommend the tossed tots they were delicious! Also there are so many tvs and the staff is so helpful with putting whatever game you want to watch on whatever tv you would like. The servers are attentive and super friendly. Will definitely be back!"}
{"text":"Tonight was our first night dining at Grayhawk Beer Company. The place was super busy on a Saturday night (to be expected). My husband ordered wings, he said his wings were mediocre Perhaps it would've helped an extra side of sauce was included per his request. But... I didn't come here to trash the place and get upset over sauce.  I ordered a blackbean burger. When it arrived, it was the wrong burger. Of course, we had to wait several minutes and try to flag down our server to let her know I got the wrong burger. So as my family is eating and the hangries are kicking in, they are finished with their meal before my blackbean burger gets there. It was mediocre. I don't know. I guess I thought they would be a little more apologetic about not getting my order right AND not being able to eat with my family.  We've eaten better, had better service, and had better food for less money. I'm in no hurry to go back."}
{"text":"This place is the worst. I'm not saying this figuratively. It's the worst restaurant literally that I've been to in years.  I must be a gluten for punishment, as I've been here on 3 separate occasions and ordered take out once. The take out was so bad, my wife walked back up there to exchange it. I've tried to like it because it's proximity is so close to us.  Not only is there absolutely nothing special about the menu, regardless of how empty the place is the service is terrible. Speaking of the menu, the best item on their menu literally has black electric tape over it.   It's a shame because the previous restaurant was so good they moved south a few miles due to not having enough space. The neighborhood would keep them slammed if they were decent. The Grayhawk Beer Company is located in North Scottsdale at the corner of Grayhawk Drive & Scottsdale Rd.   Save your money, time and aggravation. Go somewhere else or stay hungry."}
{"text":"The only good thing is the beer.  Forget the food.  The $12 chicken sandwich had puny little chicken breast.  The French fries were all dry, nothing to chew on.  Dessert took 15 minutes to show up."}
{"text":"We came here for a late Saturday lunch. The only Grayhawk beer is their IPA. It was okay! We ordered a couple of sandwiches, one with fries as the side and the other with onion rings. When we got our plates, the sides were swapped (wrong side with the corresponding sandwich), so we had to switch sides. There was a $2 up-charge for the onion rings but they only gave 4 onion rings. Seems like a small portion given the up-charge. The fries were great! I enjoyed my club sandwich enough; the bread was Texas toast style and very buttery, and there was a generous portion of turkey, but the sandwich still tasted a little bland."}
{"text":"Grayhawk Beer Co. has taken over the location previously occupied by Cold Beers & Cheeseburgers.  I have always enjoyed this patio.  The service was far more friendly than the previous restaurant.  Since they've only been open for less than 1 week, they were experiencing some growing pains (e.g., certain menu items were not available on a Saturday night) but at this point I'm grading on a curve.  They offer a wide variety of food and drinks.  There is something for everyone.  The food was tasty and having Sonoran White Chocolate on tap instantly elevated their status in my opinion.  We are looking forward to going back."}
{"text":"We had the worst experience.  Went in ask the hostess what happy hour was about. She had no info and what she did know was incorrect.  Spoke with another person, very corgual.  Sat down and the manager came out and ask if there was a problem.  From there it went from bad to worst. Rude, combative. We got up and left. Will not be back a great way to run off business.  We ended up at Lish Berger great food. Glad to see customers."}
{"text":"Really wanted to like this place but it failed on so many levels.  First, upon arrival we were told that the draft beer was not working.  (Bummer but not terrible.)  So, we ordered Kilt Lifter in bottles and were told that they don't have any Kilt Lifter either.  Huge disappointment since this is (A.) a 'beer co' and (B.) a 'Grayhawk' company -- you should carry local beer.  So we shrugged our shoulders and ordered food instead.  The menu was really disappointing but we found things to order.  When the food arrived, it was mediocre.  Not awful, but not delicious at all.  If it weren't raining outside, we would have left.  We finished lunch with a consensus that we'll never be back nor will we recommend this place.  Cold Beer & Cheeseburgers was much more fun, lively, and offered a better menu.  The decor of this new 'beer company' was confusing.  Subdued colors and accents (like a high-end coffee shop) and meals are served on tin trays (ala prison.)  The TV's that were working had a variety of infomercials playing while no popular games appeared.  Is this sports bar?  Is this a joke?  As we were one of two tables in the entire place on a Saturday at noon -- I'm assuming we aren't alone in our thoughts.  Overall -don't bother and don't waste your money.  Enjoy a better experience and meal across the parking lot at Chipotle, Which Which, or Pei Wei.  Or drive the mile or so South and go to Cold Beers and Cheeseburgers in their new location."}
{"text":"I will not be going back. I ordered the Cali Sandwich and swapped the meat for a veggie patty and when I got my bill it was $21 for an $11 sandwich. My receipt said $11 for the sandwich and there were 2 $5 charges for \"extra patties\". I told the hostess that I was charged incorrectly and she said I wasn't really charged twiced for the \"extra patties\" and she didn't know why it looked like that. I showed her the math again and she took it to her manager who confirmed that it was incorrect. So when I got the new bill I was still charged $5 for the \"extra patty\". I told her it was still wrong because I didn't add anything and she said it was a $5 upcharge for the \"extra patty\" even though I wasn't adding anything. I told her that I was not informed that there was a $5 upcharge to change my protein, and had I been notified, I would have just ordered the veggie burger and changed my bread - That is the only difference between the two items, the bread and the letteuce - and that in the future whoever is taking the order should notify the customer of such a large upcharge and she she just said \"they don't really think about it\". I expected them to do what seemed like common sense to me and just charge me for the burger and change my bread."}
{"text":"We love this place and if you have the pleasure of Teresa being your bartender, YOU ARE IN LUCK. Amazing food, wonderful service, and we always have the best time. It's nice to come here and be known when you walk through the door. We tell everyone about this place because the food is wonderful but mostly because we love Teresa and how she keeps this place full of energy. So happy to have our local neighborhood bar feeling so alive again!"}
{"text":"Went for Happy Hour the first Friday of March. Lots of people there. We were greeted and seated right away. Got water immediately, and our beer order was taken and served promptly. The only service glitch was that I had to ask if they had a Happy Hour menu. After I asked, it arrived without wait. We ordered the loaded tots and the ceviche. Both were, in a word, fabulous!  Even though they were regular and happy hour menu items, they were full size for happy hour prices. And, by full size, I mean huge. Having read other reviews, I can't imagine the mentioned service issues were anything more than a couple \"one offs.\"  This is a place I will come back to, recommend to friends, and to which I will bring out of town guests."}
{"text":"Dwindling fast! Man-O-Man I really wanted this place to work out. I need a local watering hole where I can work, have a light meal and feel comfortable. The location itself fills all my needs, great bar, tv's everywhere and good friendly staff. So why the change from 5 to 3 stars? The FOOD! Yikes. Well, that and draft beer that is nowhere near cold enough! I have tried something different to eat in my last 4 visits. First app was warm, when it needed to be hot. The second, a salad with grilled chicken, was served with raw chicken, disgusting, I mean that was almost my last attempt. Then \"Crispy\" wings that were warm, not hot, and nowhere close to crispy. You know the type, with the chewy skin. Yuck. Then my last and final attempt was the Ceviche. No words. Terrible. If this joint does not up the food side of their business soon, they will be gone. A shame. To be a success, and how I measure it, it is based on the atmosphere, the comfort of the bar, including tv's, the service, the quality of the app's and is it a fair price. I really should give this place 2 stars.   I will continue to stop by for a drink, but I will never eat here again!  Dutch~"}
{"text":"I was nervous to see Cold Beer and Cheeseburgers disappear - our staple Grayhawk hangout going away. Could the next tenant do as well?  They are BETTER than the old place. Love Grayhawk Beer Co. The beer selection is really good - and their beer buyer knows good craft beer. The food is a mark above the old place, and it's always very fresh. The Southwest Cubano is the best. Their Reuben has a generous portion of meat. The people are friendly and the wait staff care about their guests.   5 stars, well earned."}
{"text":"O.k., totally bummed when CBCB left but was happy that another burger joint was going to be right around the corner. Wife and I came here to try it out and sadly, we won't be back. It was dead, no energy in the restaurant, the burgers are unique but WAY overpriced and just not to our liking.   Had a beer, that was good but the food, again was priced a little too much for our liking.   They revamped the place but it's hard to compete with CBCB."}
{"text":"OMG this place is SO good. It wasn't very full for the Sunday after St. Patty's but that's fine. We had great service and everything arrived fast. The hubs ordered ceviche which was good. However they served stale chips. An off duty waiter reminded the server on duty that the chips were from the night before. Oops. They fixed it fast no problem. The fried chicken sandwich was sooooo good and huge !    We had a restaurant.com coupon which was great too.   We will definitely travel from the other side of the valley to come back !"}
{"text":"Came here on a Friday night around 7pm. The menu online looked good so we were excited to try it out since we were in the area.  Probably easier to bullet my issues: - no host. We kinda stood around until someone at the bar told us to sit anywhere - took at least 10 mins to be acknowledged when seated, and another 10 to get menus. - ordered an app and dinner once we were able to get the staffs attention.  - app took a painful amount of time to come out (we ordered the pretzel.) taste wise, just ok. Beer cheese was watery.  - because the app took forever, we ended up with some pulled pork nachos as an \"I'm sorry\" from the kitchen. They were at least 3 stars. - our dinner came out. One person in our party ordered the mac n cheese but had to return it because it was cold. Not warm, but ice cold.  - overall the kitchen seemed to be confused.  - staff tried to make amends by removing the pretzel app and Mac n cheese from our bill.  Overall, I would not recommend this place. Seems unfortunate because they could do well as a local bar/happy hour spot. But there was too much confusion by their staff, slow service, and bad food for me to want to return. Another reviewer noted the cramped space, i would agree."}
{"text":"Came here last night for dinner. So happy they added good salads to the menu and an actual wine list (including rose!) that was definitely missing from the last restaurant in this location. Started with the crispy Brussel sprouts and had the blackened salmon salad, very impressed. We'll be back."}
{"text":"I love this place! The service was amazing, the restaurant was beautiful, food was amazing, and my beer was ice cold! My favorite dish was the deviled eggs and the hangover burger! Nicole was awesome! Definitely a go to place!"}
{"text":"Ok, not worth trying. Waited an hour for sandwiches,  manager comp very little for the inconvenience.  Fries were over cooked , more like potato sticks. Drinks to expensive. Gordon Ramsey would fire the kitchen. Server was friendly and apologetic.  Will not go back."}
{"text":"Finally nice to see a restaurant with quite a few handles !! Seriously... There craft beer selection is impressive. Nitros, Ambers and can't leave out IPA's. Nice and modern inside now as well. They have all Arizona sports (as it should) playing on all Tv's and there are quite a few here. The food was great to go but will be dining in next time to check out the service which I'm sure will be great. This is going to be a great neighborhood hangout. A great play to bring your dog or even ride your bike too if you live in Greyhawk."}
{"text":"I was hoping that the food and service matched the decor. They occupied the space where Cold Beers & Cheeseburgers used to be. They did a good job redecorating the space. It's now light and open with a really good feel. I looked around and noticed for a Friday dinner service the restaurant was fairly empty. I couldn't figure out why. After a while I began to realize why there was no one there. Our server was pleasant and throughout the meal it was clear she was trying but she can't control the kitchen. My husband's order was wrong, the kids Mac and cheese was made with beer cheese which my child disliked, the tator tots tasted like they had been cooked in old oil and the lettuce in my salad was browned on the edges. The server was only made aware of the wrong order and bad Mac and cheese. She removed that charge which was appreciated but even at that the bill total was high. For the quality of food it was not worth it. I won't be going here again."}
{"text":"My baby kale and quinoa salad tasted like a mouthful of dirt. The kale had long stems still attached and I suspect the quinoa wasn't properly rinsed. The salad dressing was awful. Kids grilled cheese was undercooked and the fries were extremely dry.   Will pass on a 2nd visit. Our server kindly took the salad off the bill."}
{"text":"Nothing special. Best thing was appetizer brussel sprouts. Brisket was fatty and mac n cheese and baked beans were awful! You have to have amazing mac as a brewery - it's a rule! Won't be back... sorry bout it!"}
{"text":"I so wanted to like this place. But it's not worth it. This most recent time, Jordan was our server. My food was prepared incorrectly and by the time it came out as I ordered it, my guests had already finished their dinner. It was awful. I did email the restaurant through their website to try to let them know about my experience, but I didn't get a response. So here I am.   I'm really just here to warn all of you to watch your credit cards here. In my case, it wasn't a major deal, but if this is how they handle payment processing, I imagine there are bigger issues on the horizon. Three different amounts: the one that cleared on my credit card was $59.66; the one on my receipt was $60.50; and the amount I signed for was $60.45. Go for the beer, not for the food. And make sure you pay in cash."}
{"text":"Right as you walk in you are wowed by the layout of the restaurant. I counted 21 t.v.'s I will definitely be coming back for NFL season! The food? Awesome from the Brussel sprout appetizer to the Elvis burger down to the cream brûlée is amazing. My new favorite place to come and drink some good local craft beer!"}
{"text":"The old Cold Beers and Cheeseburger spot has already been taken over by a new place with a very similar menu! They brightened up the place with some fresh paint and minor improvements.  Looking forward to visiting this new joint often. It's close to my folks place and we are always looking for a casual/good price place to eat. And we got sick of CBCB slow and crummy service.  Grayhawk Beer Company has  more options for apps/shared plates which I love. And WAY better salads.  Wait time for our food was a little long. Which was my issue with the old establishment as well. Hopefully they can speed things up a bit. Especially as we approach busy season.  Bartender was great and attentive.  I was eyeing their brunch menu for Sunday football.  I think they GHBC will be a wonderful addition to the neighborhood once they get their flow."}
{"text":"Great place!! Awesome beers and really great BBQ and appetizers!! It's a must visit, service is great and bartender's are friendly."}
{"text":"Never actually got to try the place. We arrived and took a spot at the bar, after approximately three minutes a gal finally stopped by and dropped a beer list. Perused that for a few more minutes, she then asked if we needed food menus. We said yes, and got a \"gimme a few minutes to track some down. 10 minutes later we finally decided that if you can't find a food menu, and can't ask what we want to drink in the span of 15/20 minutes it's not worth it, especially when you have maybe thirty patrons on a Saturday night.   Walked out and same bartender looked me straight in the eye and said nothing. Won't be worth trying again after reading some of the other reviews."}
{"text":"Decent place not much changed from CBCb that was here before. Draft selection was average. Hope they rotate the taps often. Food seemed a bit high priced for a sports bar, so I had high expectations. They did not live up to those. Nothing spectacular. I ordered the club and was informed by server that it only comes with one meat. That surprised me cause then out is just a ham or turkey sandwich. I asked for ham but got turkey.  Server apologized and offered tho replace. Fries as side were awful. Not warm and were mushy after id asked for extra crispy.   Service was great and atmosphere was perfect for watching a game or socializing. Great patio. Food needs to greatly improve or prices need to come down a bit."}
