{"text":"Very good restaurant. Great schnitzels. Overall a great dining experience. Keep up the good work Petra and Randy."}
{"text":"Portions are huge...
Good place in Aurora to eat German.
Their schnitzel sausage is amazing.  Great flavor and the portion is just big.
I took some left overs home for the next morning.

Will come back for sure..."}
{"text":"Amazing food and amazing service went there on a Saturday and the food was fresh fast and fabulous staff was ver kind and generous and what I especially like was the dress code that u have to abide by no proper clothing no service I think that was an amazing idea. I definitely think any one if all ages should go there you can dance and talk and laugh its really just a elegant dining area and comfy. I will  deffinetly go there again."}
{"text":"I went to Graystones in Aurora a few days ago with my family for my father's birthday. The service was impeccable. Nice, polite, genuine servers, always clearing plates and filling our drink glasses. Not to mention, the owner was around talking to everyone and helping with service. Everyone always made sure we were comfortable and satisfied. As an appetizer we got the garlic bread without cheese, and i must say, i am a pretty big garlic bread connoisseur, and it is the best garlic bread i have ever had. Next i had the chicken schnitzel and yet again, best ive ever had. So crispy and flavourful and the breaded crust didnt fall off like ones ive had in the past. The mashed potatoes were creamy but could have used a bit more flavour to them, but the seasonal vegetables were fantastic! Everyone at the table absolutely loved their meals and the only reason we couldnt finish is because the portion size was as big as the plate! Schnitzels as big as your head! Which makes for good leftovers later, though. I forget the name of the dessert i had but it was a delicious homemade ice cream cake with raspberry coulis and caramel sauce. Everything was wonderful and i cant wait to go back and bring so many more people for their first time! I would highly reccomend Graystones to anyone!"}
{"text":"Great portion size, friendly staff and very unique decor. We had the calamari which was served with a very generous amount of cocktail sauce, caeaer salad which tasted like the dressing and croutons was homemade and the chicken schnitzel that was service with a lovely cherry sauce. I can't wait to go back."}
{"text":"Graystones is probably my favourite restaurant in the world. I'm biased, because it's in my hometown, but it is truly a remarkable gem. As amazing as the food is, I largely keep coming back because the staff, from the waiters to the owner, are some of the nicest people I've ever had the good fortune of meeting. We often have Dorothy as our waitress and she's just lovely--she's been taking good care of us at Graystones for about 10 years, now. Everybody there is wonderful, though.

The Caesar Salad here is an unsung hero. It's spectacular--the lettuce is great, and the house-made croutons are magnificent, but the dressing is out of this world. I don't know what their secret is, but I simply cannot come here without having the Caesar Salad. I used to enjoy the French Onion soup, which is magnificent with a delicious crouton and excellent cheese, but the Caesar has taken over as my preference.

I usually have the Maria Theresia schnitzel, stuffed with bacon, onion, spinach, and cheese, but you can't go wrong with any of their schnitzel; I'm sure their other food is great, but I really suggest you have a schnitzel--they have a huge variety, chicken, pork, breaded, unbreaded, plain, stuffed, sauced...you name it. One of my friends usually enjoys the mushroom-stuffed Franz Josef schnitzel, but even the plain old Wiener Schnitzel is amazing. I strongly suggest a side of Hunter Sauce, a delicious mushroom-bacon sauce which goes well with all of their pork schnitzels. Sides are great, even the mashed potatoes are amazing, but their Potato Pancakes are splendid--I suggest substituting them as your side on dishes that don't already include them, which they'll happily do for a small surcharge.

Desserts are also a standout. The Esterhazy Palatschinken filled with melted chocolate is wonderful, but I'm a convert to the Creme Rothschild, a delicious vanilla mousse topped with raspberry coulis and a lot of whipped cream. I can never decide whether the Caesar Salad, Schnitzel, or Creme Rothschild is my favourite part of the meal!

Portions are HUGE, which we love--we always leave Graystones with lunch for the next day! It's very economical when you consider that. Schnitzel warms up very well, first in the microwave, then the breaded ones crisped in the toaster oven. Sometimes we just call to order takeout, for a 10% discount, which is always great and it's ready very quickly.

Reservations are a good idea in general, it's a popular place, and not tremendously large. On Friday and Saturday nights I would say a reservation is a must."}
{"text":"Wow what a meal

My first time venturing to a German restaurant

Didn't know what to expect

Ordered the Franz Josef pork schnitzel 
Schnitzel stuffed with mushrooms and swiss cheese with a side potato pancake

When it came out I couldn't believe the portion size

True what they say that Germans like to eat

Super yummy and filling

Side of carrots and turnips that were in butter

Loved it

Portion sizes are what you expect
You get what you pay for

Certainly will go back again :)"}
{"text":"I have visited this restaurant twice and absolutely loved it each time! The first time was with my book club. I had the Wiener schnitzel. The portions are so huge that I immediately halved everything so I could have leftovers for lunch the next day. The schnitzel was so tasty and crisp.   Our server had suggested that we could order the senior's schnitzels which were smaller in size. That was a good tip on her part but I was happy to have the leftovers. Of course I had dessert: the appelstrudel was so good!
The second time I had dinner at this restaurant was with a group of friends. What a great night it was. I had the garlic bread and the Hunter schnitzel. Again, so very good and huge portions so I took half of my dinner home (this time, I didn't get to enjoy the leftovers for lunch the next day because hubby found it in the fridge and had a midnight snack out of it). I had the Esterhazy Palatschinke (crepe with chocolate) for dessert. Service was excellent on both occasions. I can't wait to go back!"}
{"text":"Absolutely amazing food, I can't get enough

But I noticed the portions have gotten substantially smaller in which the price is the same 

But other than that you guys are amazin"}
{"text":"Want weiner shnitzel the size of a manhole cover?  I'm not kidding.  The crisp, tender schnitzel at Graystones drapes over the edge of the plate!  Many in the group I was with went frequently enough to know that the weinerschitzel is a winner.

I had to try something new, so I chose the Tournedos, which were two ultra tender filet mignon, on slices of crusty bread.  You might think \"steak sandwich\" were it not for the slice of pate de foix gras hiding between the steak and the bread.  Covered in a mushroom sauce, it was delicious.

For desert, I had the \"flour less chocolate cake\", which is more like a slice of soft chocolate ganache than any cake.  Did that stop me?  No...."}
{"text":"Food is great! Perfect schnitzels. Saturday night dance club is the best place for people watching. For older crown. DJ plays oldies with the mixture of new songs.the owner Andrea if I'm not mistaken is a very nice polite man. We had our companies' party there and he was most helpful and accommodating"}
{"text":"The schnitzel I had was quite good although I felt it was pricey.  I had a chicken schnitzel which came with a very small caesar salad.  If they cut back the amount chicken and enlarged the salad portion I would have been happier with one drink my meal was $40.00.  

The decor is dated and needs some updating if they wish to represent themselves as a high end restaurant.

I would agree with the previous prost regarding the staff.  The staff was excellent they were very friendly and helpful and not pushy at all.  We didn't feel rushed to leave in hurry or order quickly."}
{"text":"German cuisine.  Tasty tasty schnitzel.  Lunch portions were huge.  Staff were friendly.

It's like the German version of Jonathan's down the street."}
