{"text":"A brand new company established in 2012, Great Bear Mountain Pie brings a unique concept to the Cleveland food scene. To test the brand they currently have opened a stand at Southpark Mall where the owner will personally make your pie, a pressed, grilled sandwich that is stuffed with your choice of meat, cheese, and vegetables and served with your choice of dipping sauce. I personally tried the chipotle sauce to pair with pepper jack cheese and it offered a nice smokey bite. The sandwiches are inspired by a traditional camping recipe often referred to as \"hobo pies\" which are cooked on an open fire. The sandwich was a very pleasant surprise and I could easily justify a 5 Star review on taste and service. I gave it 4 Stars simply because the quantity wasn't quite enough to satisfy my grizzly bear sized appetite. Definitely worth a try next time you're in the area and I hope they open a full scale location soon to mingle with local favorite, Melt. It offers a nice, fun alternative that is fast and reasonably priced for the lunch crowd."}
{"text":"Pie Iron sandwiches are very good!  They remind me of going camping back in the day!  They have both iron sandwiches & dessert pies.  If you get a sandwich, they give you the leftover crust, which is great for dipping!  They also have daily combo specials at a lower price.  Wait time is a little long, but the sandwiches are worth the wait!  Overall, unique place with great food!"}
{"text":"Great Bear Mountain Pie is not only the best place to eat in the food court at the mall, this place would be great as it's own stand alone restaurant. We were at the mall on Sunday (05/03/15) afternoon and got hungry. Tired of the same old same old food court meals, we walked to the back of the food court and saw this gem. The cashier was very friendly. She offered us a sample and explained the variety of sandwiches. I opted to try the Mt. Rainier which tasted just like the pizza iron pies we made when we were camping as kids. My girlfriend got the Mt. Vesuvius which is a veggie iron pie sandwich. The sandwiches were amazing and very reasonably priced. We were both very happy with our meals and told the cashier & cook. They were very appreciative and super nice. We'll be back to eat here when we're back at south park mall."}
{"text":"Wow! Such a unique sandwich offering. I took my family last week and have been thinking about it ever since! Fresh, local ingredients and locally owned! How often do you get that in a mall food court!? We made the mistake of only ordering one dessert pie for us to share, there wasn't enough to go around! The dessert pie might be reason enough to go to the mall!  Wonderful! Keep up the good work. Can't wait to see this menu evolve, or have a sandwich of the month!"}
{"text":"Gary and his team really have something special! Super savory delicious breakfast and lunch options. By far the best thing in the mall compared to the corporate oprions.  I've been there twice and both times it was phenomenal. I had the mac and cheese and the mount st helen and i would eat either one in a heartbeat! He made decaf coffee for my fiance on the spot even though they hadn't yet brewed any. Only problem is that  I can't give 10 stars."}
{"text":"So so good. They're fast and fill you up. Price is decent for a great meal. I live the El Fuego! I can't recommend them enough and I hope they stick around."}
{"text":"My family loves this place. Just a small business, but the food is a nice (and healthier) twist on the usual food court options. I always get the pizza pie with marinara dipping sauce. My daughter loves the slices of flatbread they give you from the pie slack. My husband raves about the chipotle dipping sauce. Prices are very reasonable too."}
{"text":"Place is amazing. Just a mom and pop shop. I probably eat here too much, but it's worth it. The crew is super friendly and they're very knowledgeable about their menu. I recommend the CCBR ;)"}
{"text":"I saw pie and was like YAY! It was not really a pie place, but it is a great sandwich shop."}
{"text":"I thought it was a dessert place but when i got there was a little dissapointed.  I tried the pumpkin spice cheesecake.  It wasn't what I was expecting (had never heard of the concept of mountain pie) but it was very good. It satisfied my sweet tooth."}
{"text":"Very tasty and a good bargain for the price. I got the chicken, bacon, ranch, and cheddar cheese sandwich with a 16oz drink for $7.00. They also give you some Italian bread with your sandwich and choice or dipping sauce and toppings for free. One of the better places to get food in the mall."}
{"text":"Tucked away in the back of the food court was this little gem. I've passed it a few times, but never went there because I don't eat in the food court all that often as it's all the same Chinese food knockoffs, sub sandwiches, and fast food burgers. So before a movie yesterday we stopped here and got some really good food well worth every penny. Skip the junk food walk a few more steps and seek this local business out. We'll definitely be heading back to try more of their food, and some of the dessert pies as well."}
{"text":"Second time in a week I have been here! Both times I got the Mt. St. Helen's and it was awesome! The pepper jack cheese had just the right amount of heat. Best pie iron sandwich I ever had, and we make them camping.....ours do not compare! Best restaurant in the food court."}
{"text":"I absolutely love this place. I've had the mac and cheese pie, pizza pies, and chicken bacon and ranch special. It was all so good. Its not pricey and fills me up. Ive also had there smores dessert pie and it was good too. The young man that is usually there to take the orders is always super nice and welcoming. One of my two go places here"}
{"text":"Hesitant at first to try, I didn't want the boring Panera or Subway in the food court. Plus this place had NO line. I walked by a couple times at first and was confused thinking mountain pies meant some sort of dessert. Not at all, these hearty sandwiches are enough to fill you up and keep you happy! My hubby and I each ordered a sandwich (mine was on special 4.99 all day, the breakfast one) and my husband had the chicken philly one... holy genius mother of god! Phenomonal. We were very satisfied for only 10.00!! Plus we were happy to patronize a locally owned establishment and treat our buds to something out of the ordinary! I would go back to the mall just to eat here."}
{"text":"Great new selection for a meal!!!  I love the idea that the owners took a family fun memory and made it into something all families could share.   The choices are diverse and DELICIOUS!   Love the Mac &  Cheese!     We will definitely go back"}
{"text":"You would be hard pressed to find better sandwich in court yard. I just wished I lived closer."}
{"text":"Love the Mt St Helens in wheat bread! I make sure to get spicy chipotle sauce to soak it in. I have past it a few times to get Ice Cream and always look back at it curiously. I've never heard of a pie iron sandwich but it couldn't hurt to try. Now I addicted and have ordered 3 times in one week (insanity workout time). I'm telling everyone of this buried treasure! Good job guys :)"}
{"text":"Never these growing up, thought it was a chain but this is the only one. Very cool concept, very tasty. The ingredients themselves are not well seasoned (read: bland) but they offer several dipping sauces and you can add several seasonings while they are cooking, so just be aware and you'll be fine.  Service was excellent and everything was well-explained, and the value was similarly excellent. The most expensive steak sam was $7 and the kids pizza was $4.50."}
{"text":"Now, I've only had the Mt. St. Helens, but that's because it's just so damn good! I've always wanted to branch out of my single sandwich experience and try one of the other tasty looking pies, but I'm afraid I'm a creature of habit. Once I find something that I love, I always have to get it! I just love how they give you the extra crust as \"fries\". Dipping them into chipotle sauce....YUM! This is a wonderfully different choice to the food court. It seems to me you always have the same things to pick from everywhere else. The fact that I never have to wait in line here is a crime! People are so wrapped up in the taco bells, mcdonalds, and the ridiculous amount of Asian food to see this awesome business. I used to make pie iron sandwiches as a kid, and places like this really bring back good memories with a great new twist. Next time you're at the mall, look a little further to this unique food option!"}
{"text":"We used to make camper pies and wondered why no restaurant ever made them. We are from out of town and were so pleased to see this restaurant. It certainly didn't disappoint!  Loved it."}
{"text":"I had been waiting for this place to open in Strongsville's South Park Mall, for a different option to the food court.  I had read about the guys starting up this business and was very excited to try it.  Since I tend to eat like a kid, I KNOW the little ones will love it, too.  They basically take two giant pieces of white bread and pile on whatever fresh toppings you want.  They grill the meat for your sandwich in front of you, which is nice, but does take a couple minutes longer.   After putting your sandwich into the 'pie-maker' it seals the edges shut like a calzone and you are offered a dipping sauce for your sandwich or the extra crust they cut off for you. I tried a pizza sandwich and it reminded me of an upscale pizza pocket.  I'll definitely try some of their other options soon.  I'd love to see a wheat option for the bread, though."}
{"text":"Hands down, Great Bear Mountain Pie is the best selection in the food court! I'm so tired of spending an afternoon shopping and being faced with the same lunch options I can find two miles down the street. I was craving something different to satisfy my post-shopping hunger, so I was happy when this little gem finally opened.   It's simple: you pick your fresh veggies, cheese, and meat. Or you can select from one of their pre-made options. I'd recommend The Mount Rushmore, which has apple pie filling, cheddar, and bacon...oh my! (Salty, bacon-y, and sweet...what more can you ask for?) They often have a deal of the week or special sandwich, which brings the price down closer to a Subway sub. The sandwiches themselves are huge, and the bread is deliciously doughy. One sandwich and a bag of chips will keep you full for hours."}
{"text":"Hidden gem in the back of south park mall by the movie theater. The pies are kind of like an adult hot pocket. It's refreshingly different and everything we've  had here has been terrific. My favorite is the Appalachian with BBQ and the chipotle sauces."}
