{"text":"While the portions were okay, they advertise 'jumbo' shrimp in some of their dishes.  We ordered two of these dishes and the shrimp weren't anywhere close to being 'jumbo'.  In fact, they weren't even the regular size but the very tiny shrimp.  It appeared that in one of the dishes they breaded 3 small shrimp together and deep fried them trying to make you think they were jumbo.   All of the shrimp were prepared this way so it wasn't an accident.  I think they need to revise their menu or change their meals.   And having a very young girl bring me my carry-out is a bit disconcerting."}
{"text":"Not sure where all these silly reviews are coming from. I have eaten at this restaurant many times and I have never had a bad dinner. Some I like better than others but that's my taste, not a bad job by the restaurant.  The rice was probably the best I've had in a long time.  The staff and owners are very friendly and accommodating, they will do anything special you may request.  I mostly get it delivered and the order is always correct, on time and hot.  After reading these reviews I probably would have never ordered from this place but I was laid up one day and the fact that they had delivery made me do it anyway and boy am I glad I did . Excellent food with excellent and friendly service."}
{"text":"Ordered with a group from work. Most thought it was disgusting. I ordered Chicken Fried Rice because I'm always wary of unfamiliar Chinese food and thought, hey! how hard is Chicken Fried Rice to screw up? Well apparently it's not hard! There were only bean sprouts, greasy rice, and dark meat/fatty/gristly chicken. HORRIBLE. Never again. If I were starving I wouldn't eat it. Oh, and my fortune cookie said \"oops! wrong cookie.\" More like, oops! wrong restaurant."}
{"text":"I've made a promise that I wouldn't give a restaurant a rating of only one star unless it had some kind of problem with cleanliness, but this place tested me on that promise. This was the absolute worse!.  Took my elderly uncle there and got the dinner for two for a variety of items and NOT one single item had any taste to it, not one. And the fried rice was the worse food of any type I've ever had in any restaurant in my entire life; no taste, no nothing, just a pile of blah.  The sweat and sour chicken was so hard I had a hard time cutting the outside with my knife and could hardly piece it with my fork. I would rate this restaurant as the White Castle of Chinese food, and that's being generous in my opinion, because I'd rather of had White Castle than whatever it was that they put on my plate. I'm sorry to say, everything, including the tea was simply not edible and I highly recommend anyone thinking of eating here think real hard about going here. In my opinion a waste of your money and a big, big, big disappointment to your taste buds. Again, if it weren't for my promise to give one star rating to those restaurants only with health issues, I'd of easily rated this only a one star. Oh how I want to break that promise right now."}
{"text":"This place is ridiculous. I ordered delivery at 6:38 tonight. Phone call was 5 minutes. They said it would arrive in 30-35 minutes. Okay, cool. 7:23, it's been 40 minutes so it should be here soon! Or so I thought. My fiancee called back at 7:48 and asked what was going on, since we ordered over an hour beforehand. The lady said \"delivery?\" He told her yes. She said \"let me check. Hold on. Bye bye.\" Then hung up the phone..... we waited another 5 minutes (7:53) then he called back in again and asked for an update. She told him that the delivery guy left 10 minutes ago. Keep in mind that I live 8 minutes away max, even if you get stuck at a light. So we waited. And waited. He finally got here at 8:12. So it took 29 minutes to drive down the street? Literally right down the street, I live in an apartment on broadview rd. Seems like they forgot about us until we called. Then I unload all the boxes and such and they forgot my wonton soup and gave me a large thing of white rice. Neither of us like white rice. I guess it only gets 1 star bc I can at least feed the rice to the birds. There are SOOOO many Chinese places around here, definitely try something else and only use this b place as a last resort. My total delivery time: 1hr 34 min"}
{"text":"Used to be ok, but now everything tastes like old grease, especially the rice. Food was so bad I couldn't finish it -- will be the last time I order from here."}
{"text":"Just wanted to warn everyone about this place. The previous owners sold it and now under new management. The new management is far more worse than anyone I've encountered who has owned any type of business. They have their ten year old daughter answer the phones and leave their food cold on the counter. They have no experience in the restaurant business and lack customer service. The owner smokes in the restaurant and really cheat you on the food. At least, the previous owners were generous in their portions but with the new owners, they even give you less. All their cooks have changed so the food doesn't taste the same anymore. I'd stop going here if I were you."}
{"text":"Best takeout south of the city! The owners now our absolutely wonderful and inviting. The food is always on time and hot. Even the Pad Thai is surprisingly great. Never been let down by this place!"}
{"text":"New owners have upgraded this place.  Orders can now be placed on line and delivery service is available.  Food is cooked fresh and portions are generous. Will be back!"}
{"text":"It was just gross. I had chicken and broccoli with fried rice and my boyfriend had General Tso.  I tried both and neither had any flavor.  The General Tso sauce did not taste good.  The egg rolls were pretty good and my fortune was intriguing, but I would never eat there again."}
