{"text":"We paused at the Greek Stop on our way back from Toledo.  Had THE BEST avgolemono soup ever! Leach was charming, the value teriffic!"}
{"text":"Not a good greek restaurant!  Souvlaki was dry and cold...and the salad..ew! Just don't even make the effort to try this place... lol"}
{"text":"A few months ago, this would have been a five star review, but they eliminated some of my favorite dishes (like saganaki) from their menu, so here we are. The traditional gyro, my remaining fave, is delicious and amply proportioned. I've never had a bad dish here, and some are excellent. The atmosphere is Dennys-casual."}
{"text":"would give this place 0 stars if I could. the food was absolute garbage. I had a salad and my friend had the gyro dinner, the food was sitting out for a long time and the lettuce in the salad smelled bad and was not crispy at all. DO NOT EAT HERE"}
{"text":"I doubt it's super duper authentic, but it is super duper delicious. They are also really fast and always have great specials. The one flaw I have found is that their lemon-rice soup is too thick for me. Otherwise, everything I've had there is delicious. I think they are on speed dial on my parents' phone."}
{"text":"This place is a find!  Small ( 6 or 7 small tables?) but the food is wonderful. You may have to wait but they do have a waiting area.  Casual."}
{"text":"Was happy to have a new place to eat at, but if I wanted that kind of quality I wouldn't even bother. It's is not even close to Quality Greek food, everything seems story bought and frozen.... . And potatoes weren't bad, but not worth to go there just for that..... quantity wasn't worth it for the money also."}
{"text":"Went here last week, great food good portions. Called in today for delivery, person who answered said we don't have delivery and didn't know why.... Then hung up! I called back, same person answered, yelled at me for calling in again, said \"didn't you hear me... We don't have delivery!!\" hung up again!!   You've lost my business (y)"}
{"text":"We have given this place many tries.  And is always disappointed in the service. The owner seems to want to cut cost and always only cook two meat items each time. Every time I order I need to wait at least 20-45 mins as they don't have enough meat item. We tried to call ahead and was still provided with a crazy wait time. Not Pleased!  If it wasn't the only place for lamb shank in Stouffville I wouldn't return."}
{"text":"Came here on a chance with an out of town friend.  We were craving Greek food and drove 30 mins to try the place (closest Greek food!).  It was well worth the drive.  The staff was super friendly, even to my ignorance of the Greek language and what's in many of the foods - I just know it tastes good!  And everything is homemade...all cooked to order!  We opted for take-out. They have a small seating area, but I prefer my privacy at home.  I ordered a mini mixed platter to sample different items. Everything was delicious, even after driving a half hour back home.  My friend ordered a lamb kebab dinner and loved it as well.  I got a piece of baklava for dessert.  It wasn't the traditional style I've always had before, so I was slightly disappointed, but it was still yummy.  I'll definitely be going back here, and telling people about it!"}
{"text":"The food is pretty good. The chicken souvlaki was nicely spiced and moist. The interior is nothing special. A basic place with good prices.  Edit: I had food poisoning the next morning after having this for dinner. It may have been too long after to know if this was the direct cause but I probably wouldn't take the chance again."}
{"text":"The best fast fresh food iin the plaza. Very nice people and a great meal for a very fair price."}
{"text":"This place is on the downward spiral. Used to be my favorite Greek Place but not anymore. They now close at 7:30 during the week & 8:00 on weekends?!? Not to mention the rude service-like we are inconveniencing them but patronizing their restaurant. Food quality has gone down hill as well. I ordered the Gyro Salad & it looked like it was just thrown together! All the meat was just piled on top as if it was an after thought. I'll pass on this one now, sadly!"}
{"text":"Great fast food restaurant that opened in Mississuaga not long time ago, I drive across GTA a lot so I love Greek food and I stop for any Greek restaurant that I notice. The Greek stop is the one Greek restaurant that I like the most, they always serve fresh food and the service is pretty quick.  Definitely recommend it."}
{"text":"Thee worst Greek salad I've ever had. DO NOT GO HERE if you are craving Greek salad because what you get is not even close to a Greek salad. The dressing is creamy and gross. They also forgot the olives. On top of it, the salad cost $9! Which is the same price for the full meal (meat, salad, rice and potatoes) How can a salad cost the same as a meal that has everything. Never again."}
{"text":"Great food. Have had a couple of mix ups concerning take out. Which were inconvenient at the time. But that won't stop me from eating there. I crave their gyros, grape leaves and lemon chicken soup. Ooo and their spicy goat cheese dip is yummy too. Just double check your take out order before you take it home."}
{"text":"Arrived here for the first time on Sun, June 12 at 11:30AM. Ordered a chicken souvlaki plate to go.   The first thing I noticed about the lettuce is that it was completely yellow and rotten. The server scooped the rotten lettuce into my styrofoam takeout tray after which I stopped her and asked why it was rotten and not fresh and green. She proceeded to say it was fresh! I pointed out the slimy brown/yellowy coloring on the lettuce - she went quiet and didn't refute it...She didn't knock the price down a few bucks for this either...no customer service.   Absolutely disgusting. Never going back here again. Buyer beware!"}
{"text":"This was my second time in the past 2 weeks having dinner here!  Both times were fabulous!!! The food was fresh, the fragrances were tantalizing as the chef prepared each dish, and the staff so friendly and kind.  We were having a family celebration and had a variety of dishes for our group- spanakopita (best ever), hummus, chicken wrap, Mediterranean pasta, gyro salad , and \"honey balls\" for dessert. Everyone raved about their dishes!!  And being able to bring wine was an added plus!  Can't wait to return!"}
{"text":"Stopped for an early dinner on a snowy Saturday.  We were greeted warmly by Tiffany.  She was friendly and attentive throughout our light meal.  We shared a full Skilpeno Platter, which was plenty for two. Everything was tasty and enjoyable.  We wouldn't hesitate to return."}
{"text":"I ate next door at MiHito the night before and felt like Greek this night so I have it a try. Solid 3. Almost a four and the only thing that lowered my rating was that there is not much atmosphere.   Well none really but the food was great.   They were accommodating to my made up dinner which was a Greek salad with gyro meat and I asked them to double the meat. It was a pile of food but the salad was fresh and the gyro meat was moist and plentiful. I'll likely be back but as it is in a food strip mall there are lots of choices nearby."}
{"text":"Sooooo I went back to this place and they've changed ownership and I love this new place. It's so fast and quick now and the food is so fresh I would highly recommend it."}
{"text":"First time here, came up from Houston Tx to visit family and we ate here for dinner, and it was amazing! felt very welcome as soon as we walked in the door. Erica was amazing and the owner, Manny was very hospitable and welcoming. Food was fantastic, service was even better. I felt at home. Can't wait to be back when we visit again!"}
{"text":"First impressions are good.  Bright open kitchen. Only seats 12 people inside though. It smells wonderful.   We ordered lamb souvenir and they made it fresh on the grill.   Veggie option so are clearly indicated on the menu and all dinners come with rice salad and roasted potatoes.   Daily specials for $7.96 each  everything else on the menu is $8.85.  Fast and fresh and friendly! And affordable as well!  This location does not deliver, but if you call ahead they will have your food fresh and ready."}
{"text":"Please don't eat here if you are vegetarian. The guy heated the pita on the grill he was cooking meat. Very disgusting . Owner should put a board outside \"only for non - vegetarians\" so vegetarians don't waste their money here."}
{"text":"Friday evening and these folks do not answer the phone, it just continues to go into voicemail.  Seriously not the way to run a restaurant if you actually would like to service customers.  This is terribly sad as this place at one time was a solid 5 stars."}
{"text":"Went here for lunch before going to see a novoe. Had the chicken souvlaki dinner, and it was aweful. The said chicken was cold; Rice and potatoes were tasteless, and the salad was old. As if I was served food prepared the day before. It was worse than McDonald's for more money... I will not be going back. If they keep this up, they will not be open for long."}
{"text":"Typical greek food. I got the pork souvlaki meal and it was pretty tasty. The salad was fresh. The potatoes were amazing. Only complaint would be that there were some fatty pieces in the pork and they skimped on the salad and rice. But flavour wise everything was good."}
{"text":"Been searching for a really good Greek place to grab a snack when I get hungry.  Mr. Greek isn't any good and not worth the money so I thought I would try Greek Stop at Courtney park on a whim.    I got here at 330 and the place wasn't busy (not surprising it's middle of afternoon).  I ordered the Greek salad with chicken and a pita.  The the chef told me that it would be 7-8 min because he cooks the chicken fresh after 3 pm.  It was worth the wait!  The chicken is cooked over coals and not on a grill but a skewer and it comes out crunchy and just the right amount of black (not burnt) the salad was massive and tasted great.    This is my new go to for quick Greek food I strongly suggest checking them out if your in the area.  Sorry no pictures I was too hungry!"}
{"text":"Hidden gem near hartwood acres. Great menu with all the Greek favorites. The gyro salad is the tops and only $10. The spicy feta dip will change your life. Awesome place to go. Entrees are pricey but worth it."}
{"text":"I am sad to give Greek stop 3 stars. We have been getting their takeout forever and their food merits at least 4.5 stars. However, I guess it is a victim of its own popularity because the wait is frequently over 45 minutes for takeout. Additionally, the last couple of times we have called or driven out there they are not answering their phone or closed. I hope that they figure out a consistent schedule again soon otherwise they might lose their otherwise loyal clientele."}
{"text":"Quality has declined since the Greek Stop opened. We live near by and get takeout a couple times a month. Freshness of the ingredients are not so good. Last meal we had was not so great. Thought it was just a hiccup. Today, salads had brown and wilted lettuce, white and yellow, hard tomatoes. Cucumbers were not crispy either. Looking like a downward trend. It's sad to know that it used to be so good."}
{"text":"Actually the worst Greek food and service I've ever experienced. Not to mention that they barely understood what I was ordering (I've lived in Markham for 15 years, and I'm an immigrant myself... I understand language barriers. But you should at LEAST know the pronunciation of the food you're serving.)  I came in on a weekend for lunch to get takeout for my family because my dad saw it one time when he had gone to the wild wings next door.   There was one customer in front of me, and she was getting takeout as well. She had to repeat her order like 5 times and they still messed it up. When I ordered meals, I had to restate what I wanted 5 times as well. Over and over again for each meal, even though they seem to come with standard sides. I wanted 2 spanakopita meals, 1 beef souvlaki, 1 of those grape leaf meals, and an extra spanakopita on the side.   They only had 2 spanakopita left (but forgot to mention this till the end when I reminded them about the extra one I wanted). They ran out of rice and were scraping the bottom of the bowl for the last of my food. The person behind me wasn't told until he had already waited 15 minutes that they wouldn't have rice. I also wanted those little grape leaf rolls. The server actually took out a can and used his hands to put it in my package. A CAN. HIS HANDS. They were wet and disgusting and I can't even believe I paid for this garbage.  The rest of the food was horrible. The sauce on the salad, the rice, the potatoes even. Place should be shut down. We have so much more greek food in Markham that's worth paying your money for.   If you're lacking places to throw away your money, come here. Otherwise, stay far far away."}
{"text":"Excellent service and amazing food.  It is not fancy so if you are looking for upscale this is not for you.  However if all you care about is how good the food is this is a must on the list to visit when you are in the Pittsburgh area near fox chapel."}
{"text":"Walked in for the first time and thought \"Lucky me, lunch hour and only 3 people ahead of me\". BOY WAS I WRONG. 3 people in front of me and it still took 20 minutes for my order to be taken...was already not impressed. Ordered the Chicken Souvlaki meal (Chicken, Salad, Rice, Potatoes). Ever been to Jimmy the Greek or really any other chain Greek restaurant? Their chicken is thick and plentiful. Instead here you get the most anorexic piece of chicken you'll ever see that couldn't fill a two year old if they ate 3 of them. As the lady was putting my salad in, she LITERALLY gave me 2 small tongs full of lettuce...so little that by the time I was ready to eat it, I finished the salad in about 3 bites. The rice was so bland, even the sauce couldn't save it. Potatoes even more bland my finger would taste better. Chicken taste is a big fat \"meh\". The ONLY good thing was the dressing - I might as well just lick it off and call it a day. AVOID if possible. Customer service - average...not rude, but not social or notably nice either. Should have gone to Subway next door."}
{"text":"This place was recommended to my boyfriend by a local dentist office and this was a great recommendation.  My boyfriend said that the take out service was very efficient and he was pleased with the customer service.  I got home about a half hour after he brought the food home and it was still fresh and not soggy.  I had the lamb gyro, and it was absolutely wonderful.  There was a lot of meat on the gyro and was definitely worth the $7 or $8 that my boyfriend spent.  The meat was well seasoned and very tender.  There could have been a bit more tziki sauce on it, but it was still really good.  If I go next time, I will ask for some on the side.  We also had the humus and pita which was very fresh, and I loved the red bell peppers in it.  I can tell this place is going to be my new go to for gyros!!"}
{"text":"Came in after a movie... No line up considered the shawarma place close by is packed. The place is not busy at all. Service was alright. Portion size was decent. Price was reasonable. I would come by again if I am craving for Greek and want something fast."}
{"text":"I got the gyros with high expectations as the place was packed and more people were coming in and leaving. I just wanted the gyros wrap. However it was not the best for a $7 sandwich. It was messy to eat. The pita had no crisp to it.   The guys were in a rush to make it. If they had a press for the sandwich after- it would taste a lot better."}
{"text":"Ordered via Skip the Dishes  *Review only based on pricing and food*   Priced pretty fair in comparison to jimmy the greek but quality of food is higher!  Gyro Dinner was good, the portion was huge rice was tasty and salad was well dressed. Gyros themselves were a little too crisp for my liking but overall were good!   Spinach and cheese pie was AMAZING, one of the better ones I've tried recently kinda reminded me of the spinach and cheese bagels they used to have in the Kensington Market. Served still warmed being baked making the filling nice and hot!   Overall I would order from them again and if I was ever in the area I would drop them a visit cause good Greek food is hard to come across in Markham!"}
{"text":"I was always afraid to try lamb, now I could eat it daily. Perfect gyros, great fries, friendly service. Oh... and the most amazing roasted red pepper soup I've ever had (and red pepper soup is my fave!!).   Greek Stop has been a once-a-week meal since we found it. :) Take out is pretty quick and packaged so nothing is soggy when you get home. Highly recommend!"}
{"text":"This place just opened. We had takeout from there. Chicken and pork souvlaki dinner. The price is great. Good was very fresh. Souvlaki was cooked just right. I would definitely go back again to try more dishes.  Very friendly staff too."}
{"text":"Terrible service but the food was tasty. I went for lunch and ordered Gyros on a pita and my friend ordered chicken and greek salad. After 30 minutes I asked how long it would be and they said the gyros was ready and they were waiting on the chicken. Then another co-worker of mine walked in and was served immediately with a take out order (chicken). I asked him if he ordered ahead by phoning in and he said no, he just walked in. Five people were waiting for their food and they gave him food first? Not his fault just bad organization. Finally my friend got her chicken and I had to wait for the gyros that they said was ready. She was almost finished eating by the time mine came - 45 mins waiting for food. I won't be back and won't recommend this place for lunch."}
{"text":"Summary: $11 daily special for meals is overpriced for the quality and quantity of food in this small spot.   6 tables, 2 chairs per table: it's not a big restaurant, and is really meant to be a takeout spot.  I ordered the chicken schwarma*. The portion size was decent, but the taste was underwhelming and did not have the kick I'm accustomed to. Definitely was bland.   I'd love to give this a second chance - lamb skewers seem good - and I will if I'm in the area again: the only problem is that it's got a ton of competition in the area!  *Schawarma is not technically Greek cuisine - but schawarma, doners, and gyros all apparently mean \"turning\" in their native language. Usually the difference is in the seasoning and spices. This place has both gyros and schawarma... Leave it to me to order a schawarma at a Greek place."}
{"text":"Owner, frank is great. Friendly and gives huge portions compared to the Greek stop at warden and highway 7.  Great prices. No msg in food.  Always go there for lunch. They even do catering at very fair prices."}
{"text":"This place is legit.  They have a lunch deal everyday, and, very good gyros.  I will be back.  We needed a Greek place in this area."}
{"text":"If you're looking for Greek Food...don't eat here. At first I was excited to see new place open named Greek Stop. I had a menu in my mailbox and thought the pictures looked good - why not try it out?    I love Mediterranean & Middle Eastern food - i've grown up eating it. The menu has items such as shawarma (not Greek),  falafel (not Greek), souvlaki, gyros etc.  The chicken looked and tasted like it was boiled. Tzatziki was very watery and had no flavour. Rice was so overcooked, tasteless and had frozen veggies added to it. They serve shawarma & falafel, but had no clue what tahini is when I asked for it. The Asian owner looked at me like I was asking for a foreign item.  Nothing I ate or my family ate had any flavour to it - very bland. Salads, meat, rice - worst \"Greek\" food I've ever eaten. Chicken shawarma was sliced chicken breast - not shawarma which is grilled on a spit.  I will not be returning - they don't even deserve 1 star."}
{"text":"If you're looking to grab a quick meal at lunch this will definitely do the trick! The food is all prepped and cooked in advance so there's very little wait time. I ordered the Gyro Wrap and was probably in and out in 5 mins, and it cost about $8.  The only downside was it was a very messy meal. because the wrap is open at the bottom, the sauce all came out and soaked the paper it was wrapped in... It took like 10 napkins to contain the leak and eat quickly through the wrap as its' contents spilled out..  Note to self..get the food in a box next time"}
{"text":"their chicken shawarma  was soggy and flavourless!! If I didn't know any better it tasted like they just put a bunch of chicken in a slow cooker and served it. The cleanliness is what threw me off as well! I should have listened to my initial thought and walked away. When I got there i was in the middle of ordering and the guy's cell phone rings and he stops to answer it. If you're looking for good chicken shawarma just go down the street"}
{"text":"I was very disappointed. Not authentic Greek food. Mediocre food quality and taste. Will not return."}
{"text":"My favorite day of the week is Wednesday.  Why?  Dinner with my kids.  My daughter selected one of her favorite restaurants: The Greek Stop.  We have been here many times and every time we receive great service and great food.   Drinks:  Since it is dinner with the kids, I drank lemonade, which I am convinced is homemade, that is great and I would recommend in a heartbeat.  They do not offer any alcohol, but you can BYOB.  Food:  I ordered the Gyro Platter.  The platter included the gyro, fries, Salad and drink for $14.  Cannot put into words how great the gyros are here but of all things, my favorite item is the Greek Salad.  Plenty of Feta cheese, a few olives, and the best Greek dressing I have ever eaten.  No matter the meal I choose, I have to get the salad.  The other thing I can never pass on when eating here are the honey balls.  If you never have had them, you do not know what you are missing.  They are like donut holes with honey and cinnamon and like everything else, are great here.     Pros:  It is very clean.  The service is prompt and friendly and the food is always spectacular.    Cons:  It is a small place, only 6 tables,  so if you have parties bigger than 4 you have to hope that tables are available to pull together.  Having the good food that they have, they can at times get extremely busy.  There were points of the night where pick up orders had a backlog of 1 hour, so if you're looking to be in and out quickly, you're gambling a little.    Conclusion:  I love this place and so do my kids.  It is always on the short list of places to eat."}
{"text":"I wasn't intended to be here today. The restaurant that I headed to was closed on Sunday. Since I walked pass by this place, it didn't attract my attention at all. When I saw the billboard outside of the place, the 'Greek' work popped up in my eyes. I hadn't had a greek food for a while, so decided to give it a try.  I don't find this place have a good atmosphere because the decoration is old and has nothing to do with the Greek cuisine. There are a few tables and couches in the lobby. The first impression for this place when I saw the tables and chairs is that it's not clean, or at least the owner doesn't clean up the left-over on the tables often.   As you know, the bad start doesn't mean it always ended up with a bad ending. I am a foodie so I pick this place is for its food. Luckily, the owner didn't disappoint me. I ordered the chicken souvlaki meal. The meat is so well-cooked and fresh. Each bit delivers its juicy taste into the mouth. The vegetables and the sauce come along are so well prepared.  I have to admit that if you want to have a good taste and filling Greek food at a reasonable price, this place should be on your go-to list. However, if you prefer a good dining environment, such as neat table and friendly pretty waiters and waitresses, then, it's for sure a no-no."}
{"text":"I'm not sure about the reviews on here, but their age does tell me something: they're out of date and possibly inaccurate.  The place looks a little bare but that's because the money and care is being spent on the food. The quality of the vegetables is clearly fresh, the meat is cooked to order, and the rice and potatoes are phenomenal.  The guy behind the counter has a friendly demeanor in his own way, but he takes great care in putting your plate together and well.  I didn't have time to take pics of our plates because they looked so good and we were starving, so we devoured them. We'll definitely come back."}
{"text":"Just came back from here. Picked up a couple Gyros. They are great.  This place gives you bang for buck.  Under 10$ gets you a meal.. ComOnMan what else do you want?"}
{"text":"Dunno what the other posters are going on about. Am I crazy or is this place better than the Osmows next door?  Salad WAY better too. Fresh veggies that aren't from a bag.   At Osmows the entire salad mix is bagged and loaded with preservatives   I know it's mall food court style Greek food but my meal was fine, I'll be back.   I'll be generous with my stars because other reviews have been unfairly harsh"}
{"text":"Absolutely the best gyro in town. My wife and I both love them. If you are looking for more than just a gyro, they've got you covered. Their menu is huge and everything is always very fresh and delicious."}
{"text":"We finally went to the Greek Stop in Glenshaw for lunch today--on the advice of my wife's fellow library volunteers at the Northern Tier Library.  The Greek Stop's a 25 minute drive from Bakerstown down Route 8 and over Harts Run road to the Saxonburg Blvd. corner Town Center, but it was very well worth the drive!  The food was excellent!  We each got Gyros with fries and a drink, and I got the set with the additional Greek Stop Salad.  Wow!  The salad was huge, and the dressing was so delicious that we ordered a cup to take home, along with leftovers of the salad which we had both shared.  The fries and Gyros were in such large helpings that for lunch we wound up with enough food to take home for supper!  And you couldn't have gotten better fries, as they were nicely crisp and delicious (I told the chef they blow some other fries we've had right out of the water).  The Gyros were the best we've ever had.  I could compare them easily to the ones I used to get for lunch at the little Greek take-out shop in Princeton, and these Gyros were not only as good, but were even bigger yet!  The only wee complaint my wife had was that though the tzatziki sauce was fine, she would have liked a more on her Gyro.   I started off with a cup of Avgolemono soup--a delightfully gentle lemon flavored rice and chicken soup which I shared with my wife so she could see what it tasted like.  We liked it enough to order up 2 nice bowls worth to take home for supper. Although the Greek Stop appears to be nothing fancy, it's clean and bright inside, the food is delicious, the waitress and chef were very cheery and helpful, the service was fast--we had our drinks and soup immediately and the rest of our food in minutes and, though small, the place was very comfortable.  We'll certainly be back--it's now on our short list of great places to eat!  Next time we'll try for supper some evening.   Incidentally, the place also seems to do a lot of take-out as there were people in and out all the time we were there eating lunch along with the other singles, doubles and triples who were there for lunch while we were.  A great spot all around, it appears!"}
{"text":"We showed up at 715 pm and there were six folks eating. Someone said rudely \"we're closed!\" I said \"you are?\"  \"Yeah, we close at 7\". However, website says 8 pm. We've been here before and enjoyed it, but now that their hours aren't so regular and we drove 25 minutes to get here, we won't be back."}
{"text":"I love this place! The food is great, the service is amazing, and it's healthy as well! This place has lots of vegetarian options from salads, meals, sides, and snacks. However, It's slightly a little more expensive then I would like it to be. The small box of salad is $5.99 and a vegetarian meal is $8.50 or so. Together I got everything for about $17.   The food itself is super yummy! Salads are made with lettuce, feta cheese, onions, olives, carrots, tomatoes, and dressing. The vegetarian meals comes with potatoes, rice, tomato sauce, salad, salad dressing and tzatziki sauce. The meal is definitely filling! It's super fresh, clean, delicious and healthy.   The place has limited seating, I assume it gets busy during lunch time but service is fast. I ordered online and came to pick it up I was out in less than 2 minutes. The guy that ordered in was out by less than 5 mins. Great place to come for fresh and healthy food."}
{"text":"Great food. Stopped in and ordered and was not disappointed. Large portions and the gyro was on par with all the other delicious ones ive had in the city. Worth a shot but make sure you do call ahead to make sure they are open(if you are driving a distance). The spicy feta dip is also delicious."}
{"text":"\"if you want food that will keep you alive because it's edible, and isn't pizza, then I guess this place is passable\"   I used to enjoy coming here but I think I was really only supporting this place because it was the only Greek place I knew in the area.  The daily specials aren't really a deal at all and they still cost you $10. Also, the place isn't really in the best \"repair\" greasy looking floors and you'll often find the guy behind the counter just sitting on his phone or one time sleeping in the booth.   The food itself is okay, but they don't give you nearly enough meat, and like most Subway Franchise owners are misers when it comes to toppings and extra stuff, literally counting the amount of diced tomatoes or pickles or radishes they include. That's a terrible attitude for ingredients and it reflects poorly on the restaurant. It also gives me the impression that despite the low amount of traffic, they don't care about giving the customer a good experience.  The tongs they use might as well be tweezers. Oh and I asked for some tzizki sauce and he told me he had to charge me an extra $0.75 for a spoon of it. Pathetic.   Would I come back? Maybe. If they dropped prices in half.  Edit: I've gone back to this place and instantly regret it. If you want food that'll keep you alive, then this is the place you can go when youve tried pizza sub sandwiches and cheap Chinese.  This place should be 1.5 but rounding up because the flavours were okay. Everything else was and still is terrible."}
{"text":"Off night?   Made a second visit and unlike the first trip this one was bad.   Everything tasted old.  The gyro meat was not cut thin, but rather in terrible chewy chunks.   The dates tasted like they sat in the refrigerator for a week.    Service was good and that's the 2 stars.  Had to make a trip to Mike and Tony's for redemption and it was awesome."}
{"text":"Went here last week with some friends and their 3 kids.  Now my wife is currently pregnant but I don't typically do dinner normally with children, especially 3 of them under the age of 5.   Now the kids weren't bad at all but the staff was fantastic with them and patient with our group while we were there.     I got the gyro and my wife got the Buffalo chicken gyro and both were great.  I reccommend this place highly as the staff was great in what they did and went well above and beyond in all aspects, the food was good as well."}
{"text":"What has happened! Several months ago the chef was on leave, but apparently never returned. While the staff assured me that the recipes were the same, on the next two occasions we got take-out, the food had clearly changed. One example was the previously delicious lemon soup was now watery both times. The next time we went, within the posted hours, we were told that they were closing early, no reason given. The staff is completely different, and not very polite. Today I called, a very electronic voice came on and did not identify the restaurant. After double checking that I had telephoned the correct number, I left a voicemail asking to called to be told if they were open. No call came. I live 10 minutes away, but I'll just start traveling a little further and go to Mediterraneo or Ali Baba. May the Greek Stop rest in peace."}
{"text":"Preface: We're loyal Mike & Tony's customers!  My girlfriend and I got takeout, for the first time, Tuesday evening. Being first-timers, we decided to try a bunch of different items. Our order consisted of two of the \"Olympic sized\" (extra meat) lamb gyros, chicken gyro, mini-Grecian platter, a full size order of the stuffed grape leaves and the spanakopita. All of the food was really good and we plan on getting it again, but Mike & Tony's is still our favorite. The only negative thing that I can say is that the prices are on the high side. For example, $11 for the Olympic sized gyro is a bit much to ask, in my opinion, when Mike & Tony's lamb gyro with extra meat is just $7.25. The one thing that it has over Mike & Tony's is the proximity to said girlfriend's house."}
{"text":"This place is easy and quick. The food is average at best It's kinda ghetto but in a nice business plaza. They use plastic spoons to put on feta and olive. Not even long enough that the person who's is preparing for food has there fingers (knuckles) in the feta. It's kind of gross. Last choice only if I'm in a real hurry at lunch."}
{"text":"I gave it a shot.  I will probably not go back.  It was bland and the chicken souvlaki was tough"}
{"text":"I felt like some Greek food & this place was on my way so I decided...what the heck! Bad decision....it wasn't good at all! I ordered the house specialty \"Chicken Souvlaki\" meal. The salad dressing for the salad was completely tasteless. The main course was slop on a plate (as you can tell by the pic attached). It was all gooey, sticky & completely tasteless. The ONLY thing about the meal that was good was the chicken itself & even that wasn't hot!!! Don't go to this place. It was less then clean & the food was crappy. Lots of other places then here."}
{"text":"The food is absolutely fantastic! They have great service and are fast when you order take out. So far they have the best gyros I've had in the north hills. It is not a very comfortable place to actually sit down and eat in, though. I would suggest take out only. Also they are a bit over priced. We would order so much more from them if the food wasn't so expensive."}
{"text":"My favorite gyro in Pittsburgh.  Great food and service. Moderately priced with nice sized portions.  Highly recommended it"}
{"text":"Super impressed and will go back. Portions were generous, meat was excellent - gyro and shwarama. falafal was great.  Great greek fries. Affordable and yummy we will definitely order here again."}
{"text":"Super nice and great food the daily meals are super good and at a great price would recommend"}
{"text":"Fantastic food, not so fantastic service.  If I looked just like some guy that kicked the staff's dog, kitty, or hedgehog, cool...I get it.  Since I doubt that I do and my dog kicking days are over* (occasionally a kitty but who doesn't?). why such unfriendly service?    *since apparently people cannot filter out joking, witty or sarcastic dialogue or sort I'll tempered bad mouthing from fact, I actually love dogs, cats, and even hedgehogs.  I've met one. Very cute"}
{"text":"I just drove about 20 minutes out of my way to order food here only to see this on the door...\"We're closed on Saturday October 7th. Thank you!\"  Big help.  When you run a business like this, you show up...or you loose customers."}
{"text":"Can't say I agree with the other reviews this is an amazing place for Greek food in Markham the portions are huge for the amount of money you are paying! Me and my friend went here last week and we haven't stopped talking about it since! Loved it and we will be back."}
{"text":"I was pretty apprehensive about this place since all the previous reviews were so polarized. Having tried it, I would call this a solid 3 stars. Don't come here expecting amazing authentic Greek food (why would you from a takeout shop in the middle of a non-descript Markham plaza?), but it's satisfying enough for quick meal.  It's a pretty no-frills takeout place. What they lack in quality they definitely make up for in quantity because the souvlaki meal I got could easily feed two. The salad was quite soggy as I don't think they drained the lettuce properly, but the meat, rice, and potatoes were decently average.   All in all, it's nothing to write home about, but I would get takeout from here again considering how close I live."}
{"text":"A tiny, very casual Greek cafeteria with pretty tasty food. We stopped for lunch today and grilled chicken kabobs with rice and salad was something like $8 (or you can get a pita sandwich for $6).  Everything is served from a steam table, so it's fast and the workers are friendly. My chicken was very good, especially the garlicky tzatziki sauce! A good place or lunch if you don't want to spend a lot of time or money, or if you prefer a healthier option."}
{"text":"Wow! Very impressed by this little shop on warden and highway 7.   My sister and I stopped in close to closing and the lady kindly served us as she tidied up. The food was delicious!! Everything tastes fresh and homemade and the meats were juicy and tender. Veggies were still fresh and the rice and potatoes were flavorful without being too salty.  The location interior isn't the most stylish buy I happily take plain interior for great food! And it's always great to support local businesses.   Food was great..portions were huge..service was awesome and price was great! Huge shutout to the lady who served us, so kind even as she was at the end of her shift :)"}
{"text":"Updating my review: We have been back many times to Greek Stop since earlier review from about 16 months ago. The food is still quality Greek fare. No slacking there, however, last night we went to have a gyro and salad before a concert downtown with plenty of time to spare. We were the only patrons in the restaurant at the time we sat down. We ordered and our salads were promptly served. We were not more than a few minutes into our salads when the hot food arrived way too soon. We felt rushed to hurry and eat our salads so the gyros would not get cold. I think there was a new hostess because the entire 35 minutes we were there she was taking our plates and asking us if we were finished even though salad still remained on the plates. Then even before we had finished she was bringing us the check to which I expressed I'll take that when we are finished eating. Again we felt extremely rushed through our meal. She didn't ask if we would like coffee either. At that point we finished and just wanted to pay our bill and get out. It is a shame because for a quick bite of Greek food it's a great little place. The owner/chef is always pleasant. They just need to slow down and serve the hot portion after salads have been eaten and not rush the entire experience for diners. Get rid of the paper towel napkins as well...tacky. Glad to see you painted over the 'mural' also. We'll certainly be back but next time if we experience the same rushed service we will politely ask them not to serve our hot meal until after salads are finished."}
{"text":"Sad to write this review because Greek Stop has been one of my favorites for years.  Over the past few months, however, this place seems to be falling apart.  The service is worse, rude order takers, sometimes its randomly closed, some says they don't answer the phone, etc.  The food has also gotten worse.  The same meal/platter is inconsistent in what you get, the gyro meat is tough and dry, and the fries are soggy and greasy.  2 months ago this place was a solid 5 for a great, local gyro.  Now its mediocre at best."}
{"text":"I wish I could give 3.5 because I was pleasantly satisfied after coming here. They have different meal deals every day of the week, and Sunday just happens to be chicken souvlaki day. We got a souvlaki and a falafel meal, and they were very decently sized. Large portion of salad, large portion of rice, nice portion of potatoes...it was pretty much on par with what I was expecting. The service was great, the man working behind the counter was pleasant, he was very liberal with the tzatziki sauce and if there's a way to my heart, it's that!  It's name really says it all...Greek Stop. If you want a quick Greek fix, Stop here! :)"}
{"text":"This place is really getting a bad reputation but the bad reputation is not deserved at all. The location is bright and clean, the employees are good people and the food is good. What else is there to ask for? Four of us ate for $35.00. I'd call that a bargain!! (Mind you, two of usordered the daily special)  The food here is very good. The owner Jay really cares about the food he serves. As a result, he has grown this brand from one store on Hwy 7 & Warden to 3 locations throught east markham and Stouffville.   I came in today as a hungry man and left being barely able to move. Needless to say, they are very generous with portion size. I got the monday special gyros meal and it was nice and hot upon being served to me. It came with rice and potatoes as do most greek places. Something that really peeves me off with take-out restaurants is when the lettuce in their salad is brown but here it was nice and fresh.   I always used to stop by his first location with my buddy and when we went here again today, it refreshed my memory! Because this location is closer, I will be sure to come again in the future."}
{"text":"I come here all the time for lunch throughout the week. Usually i get the pork souvlaki special or chicken souvlaki special. You feet lots of rice and salad. Box is filled to the top. Great place for Greek without having to go too far"}
{"text":"We came to this restaurant on 3 occasions. Food was decent and affordable. The restaurant needs renovations as it looks old. On the last occasion, the staff was mopping around us while we are eating. Cleaning around customers while eating seems to be unappetizing. Probably not dine-in but maybe take out should be fine."}
{"text":"Traditional gyro is a new fav. More flavor and texture than the chicken gyro, not too spicy, great texture. Try it!"}
{"text":"This restaurant opened about a month or two ago. I had to check it out. Its kind of small and very simple nothing fancy. I ordered a chicken Greek salad which came with a boneless chicken fillet that was spiced appropriately (could have had a bit more garlic?) a large Greek Salad and Tzatziki. I must say the chicken was excellent it was tender and juicy. I also enjoyed the Greek salad.  I notice they offer Falafel meals, Beef Souvlaki, Gyros meal, Pork Souvlaki, Lamb and all kinds of pita combos. It seems the meals come with roasted potato, rice and a Greek salad. It is order at the counter and have a seat service so it is pretty quick. Finally now we have a Greek place in Town...."}
{"text":"The delivery is ALL wrong except for the mains. I did not like the food and the Taziki sauce is way to runny.   I will not ever order from them again and I tipped the delivery guy for no reason. Give me a reason why you didn't get my delivery right? And I've had way better Greek then this."}
{"text":"Have been here a few times, the employees working are usually friendly and it's fast service you get your food, pay then leave. Although, me and my friend tried ordering take out twice and service was not that good. The food is good, to me it tastes like Jimmy the Greek but I would totally just recommended eating in."}
{"text":"The place was overall dirty, with overflowing garbage bins. The food was not as tasty was pretty bland"}
{"text":"Ever had a \"Rachel moment\" at a restaurant?  I have...several times at Greek Stop...and I don't mind it one bit!  This is my go-to place when I am hungry for Greek food, whether I'm with company or by myself.  I love their chicken souvlaki, and the portions are huge--not Zet's huge, but certainly not skimpy Jimmy the Greek small."}
{"text":"Delicious food - gyro meat was well-seasoned and the tzatziki was excellent. Prices were fair for the size and quality of food. My wife and I will definitely be going back.  UPDATE: I actually ate in with a friend the other week. Food was still great, but definitely only eat in if your group is small. We were there over lunch and, while intimate, we were still comfortable. I'm not sure how busy it gets during dinner and on weekends though - could be problematic."}
{"text":"First of all, I looked at previous reviews and decided they were mixed enough to see for myself. I ordered the Chicken Breast meal and Lamb Kabob meal.  PROS -  So Much Food! Portions were great. I asked for salad dressing, tzatsiki and hot sauce on the side so there wasn't any soggy salad etc. Potatoes were soft and flavourful. Meat was perfect. Hot Sauce was great  and seemed homemade (?)  CONS - TV was too loud and I could barely hear the questions they were asking me. The Moneris machine needs a cleaning NOW! it was so gross."}
{"text":"Got take out here once with the hubby. Food didn't taste authentic at all.  Likely won't come back"}
{"text":"I haven't had a bad meal here and I have tried a bunch of different things, but let me say the cheeseburgers are amazing.  I know what you are thinking, it's a Greek place, trust me they rock.  One tip though, the kids portion is the same size as the adult portion so save yourself a few bucks and get the kids cheese burger."}
{"text":"Went there for fast food and there's ONE PERSON working on a Saturday night. There were 5 people in front of me and their orders took over 30 minutes!  I got my gyros to go and for the price that I paid ($10) it was way worse than Jimmy the Greek or Mr. Greek and other chain restaurants. To add on, it was super humid in there and waiting in line was like standing in a sauna."}
