{"text":"Price increase BIG TIME no joke..! I personally will never go back.. To bad because prices were already up there..$13.00 for a greek salad with chicken was $9.00 i couldn't believe it when the owner told me my total..Good Luck Greek Patio..!"}
{"text":"Unlike other reviewers, I did not find the toppings on the Greek salad to be stingy. The dressing though - well, it's vinegar and oil. I like my Greek dressing lemony and unique - Pita Jungle still reigns supreme in this respect, but even the Greek dressing at Sweet Tomatoes is better than this. Despite this flaw, our overall experience was positive. We started with the appetizer sampler, which was excellent in all respects but one: the dolmas were horrible. I love dolmas. I'll even eat the ones you can buy at Fry's. These were just awful, and you'd think that if a Greek place needed to get something right, it would be dolmas. Everything else though, was excellent. The baba and hummus, taboule, taziki, grilled pita and falafel were all very tasty and well done. My companion enjoyed her gyro plate and if she had one complaint it would be that there was just too much to eat, it had to be disassembled a bit. These are the kinds of problems you want to have.   The guy running the floor was amiable enough, but distracted as he was by the football game, service was lacking. The place's decor is laughable in its dated, overly-fancy whiteness. It felt a lot like being in your friend's grandma's living room, with all the furniture covered in plastic that you couldn't sit on. All in all, I'd go back, but only if I lived right up the street."}
{"text":"I went to the Greek patio for a nice crisp Greek chicken salad and what I got was wilted lettuce that was black and slimie, when I called the owner to tell him that he sold me old lettuce with chicken that looked like it was cooked a week ago he said he would go back in the kitchen and see whats going on.Talk about bad customer service!! He didnt offer to fix the problem.I work right down the street so all of us go there alot, well my boss went there yesterday and he got the same thing I had on Friday and guess what? He is at home sick with food poisning today.Well I guess my phone call didnt work!!"}
{"text":"Food is not bad. Not sure how much they make onsite, seems like they just assemble it."}
{"text":"I was really hoping it would be better since its close to the office. Had the gyros plate and was not impressed. I wont be going back."}
{"text":"I used to really like this place but it has changed hands and the service has plummeted.  Visited last week and our server could not have showed any more contempt for her customers.  The senior person was chatting up two friends at the bar and ignoring the 2 whole tables occupied.    Afte slapping our food down our server went outside to smoke a couple cigarettes not returning until we were finished with two empty wine and water glasses.  It's a shame, I used to like seeing the owner here, he was a engaging attentive soul who kept his staff on task...  Maybe use it for take out??"}
{"text":"As others have said, decent, not amazing. Portions were ample, prices were good and we got our food pretty quickly. The tzatziki was a little watered down but the chicken in my dish was cooked really well: it was moist, had great flavor and the pieces were generous and well trimmed (fatty chicken = so gross!). When I am at the office near here, I will probably come here again."}
{"text":"I really like this place.  Generous portions, good service, always keep my water or ice tea glass filled.  If I lived any closer I'd be there once a week for sure."}
{"text":"This place redeemed my love of servers last night (read Lola Tapas review).   The service was amazing. Our server was attentive, sweet and is the only man to ever call me buddy constantly without it being annoying. Oh did I mention his lovely singing voice? He was having a good time.  Anyone who knows me knows that I love me some gyro and their food was delicious. The tsaziki sauce is flavorful and dilly, the gyro meat tender and the hummus was perfect.  The atmosphere is cute, big anough to feel roomy, small enough for cozy. I will definately return here!"}
{"text":"i eat here all the time! best food ever! called to ck the hours, no answer! are they closed? please reply anybody! im hearthbroken. lol."}
{"text":"This was my second trip to Phoenix, and nothing sounded better on a warm spring day like a tasty Greek lunch. I was not disappointed here! I ordered the chicken shawarma and a side of french fries for $6.99. The shawarma chicken was lightly seasoned with Mediterranean spices (perfect for a light lunch), and served in a fluffy warm pita with fresh tomatoes, onions and tahini. This pita was much larger than I expected for a lunch portion, but delicious none the less. The flavors of this dish completely satisfied my craving for a Mediterranean style lunch. It left me curious, and wanting to try other pitas and dishes on the menu. The patio seating was nice, cool and laid back. I'll definitely be back again soon, and I'm excited to try the spanikopita next time!"}
{"text":"So this little gem is close to mywork and makes a dang good gyro.  The wait can be a ittle long sometimes, so I will have to find out if I can order ahead of time.  They have a great selection, from dolmas, to hummus, gyros, and falafel.  I ordered the gyro combo which came with fries.  They do have a $1.50 upcharge to substitute rice or salad for the fries which I thoguht was not efficent, but I was looking forward to trying their basmati rice.  I will definitely be back here for falafel and I'd love to try their hummus as well.  The gentleman at the front counter (maybe the owner?) was incredibly friendly, though.  the meal took a while to be ready but it was tasty.  I wish they had given me more onions, tomatoes, and tzatziki and less gyro meat though."}
{"text":"dont waste your money here. the food is disgusting & the place is not clean. health code violations galore. i got extremely sick here. the manager whatever his name is a jerk"}
{"text":"I've not been real big on Greek food, but this place was good! I got the Souvlaki Sandwich (which came w/ good fries) & the Baklava (YUM) Unfortunately, I don't remember what my friend ordered, but we thoroughly enjoyed it! Servers were very friendly. I agree, they're light on the feta & rely a bit much on the dried spices. Overall, good & I would go again :)"}
{"text":"Food was good, nothing special, decent portions, gets very busy at 1120-30.   Its 'ok' a few dollars more than the other gyro places around."}
{"text":"I have eaten lunch here a hundred times or more. I am floored at the 3 star average (at the time of me writing this). I have been to many Mediterranean restaurants... in the Mediterranean and in US cities that have Mediterranean culinary scenes far superior to Phoenix. So I have some frame of reference when I say that this restaurant is fantastic at what it purports to be - a hole in the wall gyro shop. I have always found the place to be clean, the owners to be friendly, the menu to be extensive and the food to be across-the-board delicious. Literally the ONLY downside is the long lines and limited seating at lunch, relative to the high demand. A sure sign to me that they are doing something right. So I try to arrive before or after the lunch rush. Problem solved. Cant't recommend it highly enough!"}
{"text":"Came here during my lunch break with 2 coworkers. We only get 30 minutes for lunch, and even though this isn't necessarily fast food, it is also not a sit down restaurant either. By the time we received all of our food, it had been 55 long minutes since we first got there (this is not an exaggeration). Now, they do have a disclaimer that customers should be patient as they are not a fast food restaurant, but we also weren't ordering lasagna that had to be prepped and baked in the back during that time. I got the sampler plate, which was essentially just a lot of lettuce and onions and a scoop of hummus. This should not have taken this long. They lost our tickets, and even after multiple attempts asking about our orders, we were ignored. Then they messed up one of the orders. Just a disaster overall. And no apology either.  The only thing that could have made up for this is if the food was out of this world amazing, but it wasn't. It was pretty good overall, but the sampler plate was not worth almost $10 (with tax). The pita was a little rough and too chewy. The rest of the food was fine. I will probably not be going back, even though some other coworkers seem to really like it and have recommended it."}
{"text":"It's like fast food greek that doesn't taste like fast food.  The gyros are incredible.  It's cheap, fast, and you get about the same unsmiling service from fast food.  It's the food that pushed this place to 4 stars for me.  Otherwise... it was dirty... there were napkins and straw debris on the floor, tables needed to be wiped off and there was one trashcan only."}
{"text":"Jones'n for a bit of greek apps on a patio.. I end up here.. We got the greek sampler app plate.. Hummus was great.. but dont be so stingy with it, GP! Taziki was the same.. The pita got hard as it sat.. Maybe it had been micro'd too long.. blech.. The dolmades.. ugh.. no.. Im picky with those.. and they are my fav since I visited Greece & practically lived on them.. to avoid other things that I didnt care for.. :-) SO dont try and pass a canned tasting slimy dolmade on me.. The staff was sweet..couteous.. but thats about all Im gonna rave on.."}
{"text":"I like this place because you can actually taste the food not like other places. I love the Greek Salad because it's healthy but still really tasty. I recommend the Gyros and Falafel. The people are nice and the setting is really good.  Enjoy!"}
{"text":"There are a few good places for Greek food in Phoenix, but this is one of my favs. The food is always very fresh and freshly prepared. I think it's also a little more authentic than some of the others."}
{"text":"What happened to the fantastic food I used to get here?? My sister and I split the falafel lunch platter the other day and the quality and taste wasn't there. The pita was thin, the cucumber sauce was watery, and the dressing for the salad was little more than vinegar. The falafel and rice tasted the same, but everything else pretty much sucked! There were green olives in the salad when there used to be Kalamata olives. Unfortunately, we won't return."}
{"text":"I don't live in this area and I don't venture out this way often, so I have no idea what the Greek food competition is like, but for Greek Patio's sake I hope it's limited. Don't get me wrong, the food was good. I got the sampler appetizer plate that came with falafel/dolmas/tabule/baba ganoush/tzaziki/tahini & a generous helping of pita bread wedges. It was a ton of food for a really reasonable price. The only problem was, I couldn't tell which dip was the hummus & which was the baba ganoush, and normally that is very easily differentiated by both appearance and taste. Then the \"tzaziki\", if you want to call it that, though tasty, was more of a\"garlic ranch sauce\". The rest of it was fine, I have had better & I have had worse. So I guess my only suggestion is, ditch the \"Greek\", change your name to \"The Patio\" and your customers won't compare your tasty food to something its not...Greek."}
{"text":"I've had the Gyro combo for $8 dollars and change. This place just doesn't do it for me."}
{"text":"Very good, fresh food.  The prices is pretty good for the amount of food you get, especially if you order a meal instead of just a sandwich.   The folks that run the place are always very nice."}
{"text":"$8 lunch with a flavorful gyro, soda and side.  I really like the small, home feel to the place and the white onions don't bite but add to the flavor.    Then again, I read Yelp beforehand and knew the Gyro was the choice to make.  Thanks Yelp'ers"}
{"text":"I really like Greek food, and this place is okay. I come here for lunch sometimes. I like the gyros a lot better than the chicken gyros. The tzatziki sauce is awesome, fries are good, and the service is pretty quick. It's a good place for a quick lunch that's not a drive through."}
{"text":"Summary: stingy on the feta cheese and too much use of dried spices.  We started off our meal with a hummus app and 2 glasses of house wine (only $1.99/glass during happy hour, M-F, 4-7PM). No complaints about the wine and the hummus was decent.  Next up we received our Greek salads. Not much feta in the salad, not much cucumber, not much green pepper (I think there was one in mine).  For the main course, I ordered up the Greek spaghetti, which is one of my favorite Greco dishes. Again I was subjected to the attack of the missing feta, as they sparsely graced my plate with a few blocks of the good stuff. The pasta also had a good amount of dry spice mixed in with it, which wasn't very pleasing to eat.  I really wanted to like the Greek Patio, especially since it's close by to my house, but due to the issues above, I'll be sticking with the Golden Greek and My Big Fat Greek Restaurant. It's worth the drive for me."}
{"text":"I've gone by this place many times on my way to the Culvers next door and decided to finally try it out. The chicken kabobs looked good on the menu but they were really dry like they were cooked and reheated. The vegetables and rice were okay but I've had better. The person I was with had the gyro with fries. They said gyro was good but the fries were awful which I agree. The fries had no flavor and looked like they were fried twice. I will avoid going to this restaurant in the future."}
{"text":"Their rendition of taboule ($6.49) is mostly parsley and a little light on the wheat and mint. Still, a refreshing starter and definitely enough for two or three people.  I come here for the souvlaki sandwich, a generous portion of cubed, marinated pork bundled in a pita topped with onions, tomatoes and tzaziki. The sandwich ($7.99) is served with fries, which I like to dip in the tzaziki too!  The baklava ($2.99) is OUT OF THIS WORLD! Soaking in a delicious rose water syrup... yummmmmmm!!!"}
{"text":"I have never had a bad meal here yet. Of course all I get is the Gyro, with no onion and frys.   I did try a piece of Falafal today. It was alot better then I have had in the past.   Good stand by if you are in the area and crave a gyro."}
{"text":"My big fat Greek Patio -- an ass after eating here.  I don't think the owners really know how to run a restaurant.  It almost feels like eating out of a food truck here.  I ordered the Chicken Pita with a side of fries.  I think it's pretty good Greek style pita with the cucumber dill yogurt sauce.  The Chicken was grilled nicely and had that smoking smell.  Overall, the food was decent and it is what it is.  I just feel a tad bit heavier after a meal here.   Regarding the service, it's a food truck inside a building.  Don't expect much here since smile is too much to ask for and sometimes it doesn't seem they want to be there.  It's slow to get your food, but at least you know it's made to order.    The decors are very tacky and the god awful music plays.....please make it stop!  They have a pair of television sets on Sportcenter.  I guess that helps drown out the hectic scene. - Enjoy!"}
{"text":"I'm apparently not as big into Greek as some of the others have posted, but I can honestly say anyone who's given this place less than three stars probably just expected too much. I had the best Greek salad that I've ever had, and I will agree with one review that it was definitely too light on the feta.   The service was great, food was excellent, and while it may have been a bit on the pricey side I felt as though it was a great value. Not one of the places I would take out-of-towners and rave about, but a great little spot to hit for lunch."}
{"text":"Delicious and generous portions, decently priced. Definitely a repeat"}
{"text":"I ended up choosing the gyro pita from this place on a whim because I was craving Greek food.  This little shop is your typical restaurant in a strip mall.  The guy at the cashiers register fit every Greek stereotype available, and so did the music playing. I took a late lunch and the place was still pretty full, meaning the food must be good.  You do have to wait for your food for a long time...but that's expected because it's fresh.  The gyro was very good, a tad bit greasy, but very flavorful.  I was surprised that it came with French fries...and wasn't expecting that, so for the price you get a good amount of food.    I will definitely be going back again to try why else they offer."}
{"text":"There are so many good places to get Greek food in Phoenix.  You should go to one of those places because this is not one of them.  The place is VERY overpriced for what it is.  The cheapest meal was $12, and the most pricey was $43.  They had a few Greek wines and  a few California wines on their list.  Wine was not particularly impressive, yet they were charging $6 for a glass.  Some of the wines were things I have purchased for less than $4 a bottle.   The restaurant is located in a plaza behind a Wendy's and next to a Kinko's.  The interior is an uninviting cross between your elderly Aunt Ethel's white 1980s vacation condo and an ice cream shop.  Everything is white, cold and hard..... and it echoes.  The food was mediocre at best.  We started with the Dolmades, which tasted like packaged food.  They were far to lemony.... almost on the verge of a fermenting flavor, and were very mushy.  The pita bread that was served with them was good.  That pita bread turned out to be the best part of the meal.  We opted for Greek Spaghetti, and a Gyro plate.  First we were served salads.  Greek salads are usually full of cucumber, tomato, feta and olives.  Our salads were almost completely devoid of these ingredients.  Our salads were almost completely iceberg lettuce, white onion, and green bell pepper.  The salads were fresh, but very dry, as if the lettuce had never been washed... had been cut, then left  out til the edges dried out.  The spaghetti was prepared to the proper firmness, but the seasoning was unimpressive.  It was buttered with an excessive amount of garlic, then tossed with tomatoes.  There was supposed to be feta cheese in mine.  I counted the little chunks.  I didn't have to count very high. There were 2.  To be fair, I did see another table had been served the same thing.  I wouldn't have known it except I asked.  Their Greek Spaghetti looked nothing like the bowl which we were served.  I'm guessing that consistency is not a strong thing here.  I expected that the gyro plate would be good.  Gyro meat in Phoenix is not prepared on site.  It is ordered from a supplier and roasted at the restaurant.  I figured there was less opportunity for it to be bad.  I was wrong.  It was very bad.  There were no nice crispy edges.  It was undercooked and sliced too thickly. What a disappointment.  The only redeeming quality was the patio, which was fairly well tucked away from the street, considering the surroundings, and the waitress.  The waitress was very pleasant and gave excellent service.  Too bad the food was not good enough to get me to return."}
{"text":"I am hesitant to review the Greek Patio because I am afraid it will grow in popularity.   I love our quaint go to Greek place. We have been visiting the patio for the past couple of years and it is never a disappointment. The kabobs, gyros, Greek spaghetti, Greek salad, saganaki, and everything else we have tried has been tasty. The space is small and quaint and sometimes they get carried away with the Mediterranean dance music, but the service is always prompt and courteous and the place is always clean."}
{"text":"We tried this place today.  There is a lot of parking and it is easy to get in and out of the parking lot.  We went right at 12:30pm and it was pretty busy inside.  There is a Honeywell directly behind the building and it was full of their employees.  But there was seating outside as well.  The service was a little slow and the cashier didn't seem like she really wanted to be there.  The food was great!  We both had the Gyro Pita-  It was packed with meat and sauce.  The pita was fluffy and fresh.  The meat was a mixture and it was full of flavor!  The portion was very large and came with fries and a drink for only $8.  I would definitely return."}
{"text":"I can't believe I haven't tried their food sooner, it was so good.  Ok, I can't spell it but the baba ganush was to die for.  Just a little bit of a bite to it, perfect.  The gyro plate was loaded to the brim with lamb and rice and was really good.  I had plenty of leftovers to take home and eat the next day."}
{"text":"I haven't been here in about a year and boy have things changed. This place used to be packed for lunch but today it's empty. Maybe it's bc of the sign that says at the register \" Greek patio is not a fast food business fresh food takes time and your patience is appreciated\". Not a good way to start off your customer service plus the lady at the register wasn't very friendly. Now to the food this place used to have an awesome gyro sandwich but mine today was bad. The pita wasn't fresh half of my meat was dried out and looked burnt and the sauce is not what I remembered. With all the other Greek options in the area I will not be back."}
{"text":"Not sure what you did, but stop it. The tahini sauce tastes like buttermilk. The pita which used to be thick like a pancake is now as thin as a crepe. I don't know if you have new owners, new cooks, but knock it off and return to normal.  You've lost a customer."}
{"text":"This is a perfectly adequate gyros place. It's small, but clean enough. Prices are fair. People get the job done, but are not overly friendly (nor rude). The gyros are just fine - slightly dry, but better than many places. The pita and tzatziki are both good, especially the latter. Fries are standard Sysco fries.   That's about it...it's a fine place."}
{"text":"Reasonably priced, straightforward Greek food. Good service, does get packed at lunchtimes."}
{"text":"This is hands down the BEST Greek food in AZ. I've been coming here now for a couple of years with my family, and their food has never once let us down. Saganaki is AMAZING, just amazing. The same guy is always there and he's super cool and friendly. Outdoor seating, indoor seating,  and it's never REALLLY busy. . .but I won't eat anywhere else because, well, why try to change a good thing? :)"}
{"text":"This is a really cute Greek restaurant located in an obscure building.  You'd never know from the exterior that a great Greek restaurant is hiding inside.  The place has a family owned restaurant feeling to it, and you'll find all the Greek classics on the menu.  The menu is pretty extensive, and a lot bigger than many of the other Greek restaurants I've been to.  They have gyros, sandwiches, pitas, plates, appetizers- but my favorite is the hummus appetizer and the falafel plate.  They're both soooo good.  They also make a pretty mean spanakopita.    For dessert, get the home-made baklava- you'll be very glad you did."}
{"text":"the worst. Employees and owner just do not care about the customers and how they appear. The employees are outside smoking every few minutes. We waited for our to go order for 15 minutes, during that time the guy out of the kitchen went out for a cigarrette 3 times. We were also ripped off. They charged us for what we ordered to go, but did not give us all the food that we ordered. Also they overchardged us, since they had to substitute for something that cost less, they were out of beef. The plate we originally ordered was $9.99 what they charged us, but since they were out ( which they told us after we  waited for our order ) they gave us plates that are cheaper on the menu and did not offer a refund. On top of all that we ordered babaganuj, but when got home it wasnt put in with our order. Upon leaving we saw their kitchen staff with some other suspect characters outside arguing and smoking. At one point it even looked like the guy from the kitchen went outside and peed on the wall. Very turned off by this place. This is my firrst and last time I will get food from here. I lost my apetite, but the 2 others that were with me that ate their food when we got home said it was dry and overcooked. I called the owner and expressed how he charged me for items that I ordered and they werent included, and the fact that their substitute items cost less than what I paid for. He gave me a bunch of excuses and blamed it on the girl that was handling my order and she forgot to include babaganuj. He asked me to come back and get my babaganuj. Everything was wrong with this place.  No thanks."}
{"text":"Been to Greek Patio many of times and it's a good spot for lunch as it's close to my work.  The plates are a tad expensive for lunch as I got the Soulvaki plate and a drink and it was over $10.  The food is decent but nothing I would go to for dinner.  3/5"}
{"text":"Hankering for a saganaki, I ordered a carry out from Greek patio.  What I got instead was burnt cheese the had to be cut with a steak knife and tasted like ash.  :("}
{"text":"Great chicken gyro.  I forgot to ask for extra taziki sauce but it was still tasty.  This place is tiny.  I came during lunch hour and it was packed! No where to sit.  So either get here early or get it to go.  They have a sign that says they are not fast food so expect to wait a bit for your food.  Not too bad.  Customer service isn't great but a tasty gyro nonetheless."}
{"text":"Food was great but service was horrible and it was all from the owner. Very unpleasant and messed up my order and a few around me and blamed us and took no ownership. Not sure I come back if he is there's"}
{"text":"Not bad at all.  A long time ago while there, the Maricopa County restaurant inspector was there and he had been talking to the employees, then before i knew it he told the employees to close the restaurant immediately and to refund money paid for orders not yet filled and to not serve any more food.  Since that time, and after viewing the updated inspection reports, I have returned to eat here many times. The food is very good, and I've not gotten sick there.  They aren't the friendliest there, but that's probably partially due to the great location and not having to worry about customer retention since it's the only place of that food genre in that high traffic area.  Another place near there, at Loop 101, on 27th Ave, has a very friendly proprietor, and he comes out to see how things are and such.  They get a lot of business, but perhaps not as much because their location is a bit obscure.  Back to Greek Patio, the man that works there reminds me of the Soup guy in Seinfeld. He doesn't smile, doesn't say thank you after you pay, and is quite stoic. I think if you tried asking for a substitution, he may say \"NO PITA FOR YOU!\"    Like I said, since returning it's been very good. One less star due to the previous issues with health inspections.  But seems they've resolved those."}
{"text":"Quiet place for lunch on the weekend, but I'd wager it isn't so peaceful on weekedays with the Honeywell & other nearby workers.  Nice, new clean building.  Clean inside with more seating than most Gyro style places I've been to in the area.  Falafel sandwich was nothing special, but nothing bad about it either.  However the \"side\" of fries was very small.  In fact, now that I think about it was $9 for Falafel sandwich, \"side\" of fries, and drink.  Not such a great deal."}
