{"text":"Didn't disappoint. Chicken sate sub and shrimp salad roll were fresh and flavourful. Will come back again for sure!"}
{"text":"Amazing subs!  It was our first time there- each of the three of us tried each other's subs as we wanted to try not just our own orders :)   (beef satay, chicken satay and avocado & shrimp).  The buns and veggies were FRESH!   Staff were very friendly and hospitable. the restaurant is immaculate!  We will go back. This place is a hidden gem!"}
{"text":"Awful food. The place was dirty.Restroom was filthy. The owner could not even make change for a $10 bill.Will never eat at this dump again. Avoid this mess of a restaurant."}
{"text":"Ok I was skeptical based on the reviews but the sub was great! Stopped by after running errands nearby and just had to eat! Was craving Vietnamese. Glad I stoped here. Staff was pleasant, decor isn't much but the sub was so good! Fresh buns! I hate when I scratch the roof of my mouth when the buns are too crunchy. This was perfect. Unfortunately not near my house - will go again if in the area!"}
{"text":"Make a special trip to visit Green Cilantro.  This Vietnamese restaurant, with relatively new ownership, has a bright, cheery atmosphere with super friendly service.  My sub was fresh and delicious.  I'll definitely come back for the food and to support the young family operating this neighbourhood gem."}
{"text":"A nice little Vietnamese restaurant with a small billboard menu.  Cold cut banh mi sandwich...3.5 stars.  There are basically two types of baguettes used in banh mi sandwiches; one with a thicker crust and denser interior (your typical French baguette), and the other, a lighter crust and interior (more reminiscent of a toasted hoagie).  Green Cilantro uses the later.  All the proper ingredients are present: pork loaf, liver pate, fish sauce, jalapeños, pickled carrots and dicon, and of course, cilantro.  Thank goodness there's no cheese...must be a Calgary/Canada thing?  However, GC does add a fried egg.  This can either be good or bad but it did not influence my rating, as you may request to have it omitted.  For the record, I kept it...wasn't use to it...didn't care for it.  A fried egg in a burger seems like a no brainer, but mixed with fish sauce and liver pate was just a bit too weird for my palate (it goes better with the sate and grilled meats)...others may enjoy it.  My only gripe was the pork loaf...GC has theirs cut into sticks  instead of the traditional deli-style slices.  When they do this, you won't get pork with every bite (unless you've got a big mouth) and it feels like there isn't enough of it, either.  A decent sandwich but not the best.  Spring rolls...5 stars.  One of the best egg rolls/spring rolls I've had in a Vietnamese restaurant here in Calgary.  No cabbage filler here!  They're not wrapped with the traditional rice paper, but with the typical flour wrappers.  The egg rolls are filled with ground pork and carrots, the way they SHOULD be!  Glass noodles are usually part of the mix but I can't remember seeing any.  These are small egg rolls but definitely worth buying.  The accompanying dipping sauce is much spicier than most, so be careful if you can't stand the heat.  Won ton soup...5 stars.  Doesn't get any better than this.  When you can smell the dish in front of you, that's usually a good sign.  The broth is clear but full of flavor.  The won tons are even better; some of the most flavored won tons I've ever had...you could say they're a little heavy on the sesame oil but that only enhances the flavor of the shrimp and pork filling, so I'm okay with that.  Sate Chicken vermicelli...2 stars.  Despite a vermicelli sauce that's absent of the usual pieces of carrots and pepper flakes floating about, all the ingredients you'd expect to see and taste are present.  GC uses the thicker variety of vermicelli noodles, almost spaghetti-like.  I prefer the shoe string variety cause they're not as slippery and hold the sauce better, but to each his/her own.  The biggest issue with this dish is the sate chicken.  I don't know if it's the marinade or the cooking (or both), but the chicken has an awful color to them.  They weren't whitish or even yellowish but rather greyish...i almost mistook them for pork!  Whatever they did to the chicken it wasn't good.  Nor did they taste very good.  This would easily have been a 5 star dish had they charbroiled or grilled the protein.  To be continued...."}
{"text":"Green Cilantro is under new management (thank goodness!). The staff at Highlander recommended Green Cilantro so I decided to give it another go.   The owner/manager gentleman is very kind and friendly. The store was opened up later that day because of a large catering order. If you order catering and reach a certain amount, you get 10% off the menu price and delivery. Otherwise, Green Cilantro doesn't deliver.  I ordered a chicken sate sub. My sub was made with care. The bread was airy and as Alice L mentioned, doesn't scratch the top of your mouth. The vegetables were fresh and crunchy but weren't pickled. No assorted subs are sold here. I don't think Green Cilantro has pate mayo either.   The sub's filling was smaller than the banh mi I normally eat in Chinatown. The owner told me that subs are suppose to be light and not heavy. I will go back to support this business. In Killarney, there aren't many options for a good banh mi!"}
{"text":"If you're looking for a quick lunch, the people are lovely and the food is damn well good enough. Give them a try!  The lady working here, I imagine the owner, is really wonderful. I could tell she takes pride in her business, and was very much happy for me to stop by. She even mentioned that she hadn't seen me before and seemed to be interested in how I had heard about her and her business. I really like that. There's something about Ma & Pa places, (or Ma or Pa places, theirs no judgement in them not being together) that I really, really want to support.  Putting all my emotions aside, from a food only perspective Green Cilantro is AOK. I went with their spicy Bahn Mi and it was absolutely adequate and endorsable for their area. For their area, Dale? Well... Best bahn mi in Calgary? Well, no, it's a pretty far stretch... But a delicious and definitely acceptable meal in an area not known for delicious and acceptable meals? Hell yeah, Green Cilantro is right on tack. I've heard other reviewers say that it's \"nothing special\", but that only true until you consider their location and their competition. While yes, I'd always give way to a better Vietnamese experience in the area, I think Green Cilantro is your best bet."}
{"text":"Their slogan is \"the best Vietnamese sub in south Calgary\" I beg to differ . Probably the most mediocre sub I've ever had, i would have been more satisfied with subway. The bread was stale and not even toasted. I asked for medium spice, it wasn't spicy at all until I took the last bite then I had a mouthful of hot sauce . I've been here twice and both experiences have been the same. I get a mediocre sub, the owner (I'm assuming) is very sweet but somehow they never have change for bills. This is probably the best Vietnamese place in the Richmond area unfortunately."}
{"text":"I took my (superb) daughter out for an evening snack tonight and happened upon this brand new Vietnamese noodle place.  Thinking to myself, it's hard to differentiate pho in this city, expectations were \"stable\".   A few minutes in, our host, Jessica, and her talented chef brother (Crap! I failed to get his name!) made us feel like we'd popped by their own home for dinner.   Food comes quickly, tastes great and won't hurt you, financially.  This was one of the coolest dining experiences we've had in a long while (and admittedly we dine out a fair bit.)  You should eat here...often. We will."}
{"text":"Came to eat dinner today Tuesday January 5, 2016 at 6:37pm when they are supposed to be open to find out they are closed lights off and all. No info about why."}
{"text":"The sub was worth stopping in for; fresh high quality bun, tasty flavour combo and beef was great; I'll stop in again...and, very conveniently located near my favourite wine shop."}
{"text":"Nothing special. I was expecting a great tasting banh mi sandwich, but it was just disappointing. I even had chicken bones in my sub. Friendly worker, but will go elsewhere next time. :("}
