{"text":"I stumbled across this place when I was getting gas at the Speedway next door. I had no idea what to expect and didn't even know what kind of food they served. I was pleasantly surprised when I walked in because it had a small Irish pub feel and was extremely clean. I was there at lunch time and it wasn't super busy and the service was good. There appeared to be only one waitress but she handled everything fine and everything was timely. 
I ordered the corned beef and swiss with fries. The corned beef was good and had texture like they throw it in the flat top to warm it up which I loved. The fries were \"steak cut\" which I don't like, but they were cooked fine. 
Don't let the outside fool you, it is much nicer inside!
Overall, the food was good, the service was good, the cleanliness was great, The prices seemed fair and the family owned pub atmosphere was comforting. I will definitely be back!"}
{"text":"We're semi-regulars. We always sit at the bar. We love Green Island, it's our go-to when at 8:00 we realize we're too lazy to cook. The owner, Sean, prefaces everyone's name with \"Neighbor....\" And he knows everyone! It's like suburban Irish Cheers. Like, \"Oh, that's Neighbor Bud, he lives on Huntmere, he's blind, so I'll go pick him up if he wants to come over for dinner.\" [true story] Or... \"Neighbor Jerry, oh yeah, he's crazy [in the sense that he's funny], he lives on Juneway.\" But imagine him purring that out in his Irish accent. We don't go there often enough to be regulars, but he always remembers us. Everyone talks to everyone else. It's friendly, familial. The food? Green Island is obviously not Michelin-starred; it's a neighborhood pub. It has solid burgers and sandwiches, and surprisingly good entrees... like, would I normally order a filet from a place like this? No. Have I ordered it multiple times from Green Island? Yes. Have I ever seen the terrible service described in other reviews? Never. Should you drive from the East Side to go here? Probably not. Should you stop by if you came from the East Side for some other reason? Duh."}
{"text":"Good food, quiet atmosphere, Irish brew. Good service. I wouldn't recommend this for kids...Irish pub atmosphere."}
{"text":"This is a lovely neighborhood pub and restaurant. It is warm and inviting, and peaceful. Irish music playing quietly in the background, a few locals swapping stories at the bar. The food is much better than I would normally expect for a place like this. A real gem. Makes me miss Dublin."}
{"text":"Went to Green Island for the first time last night. Loved it! First of all the owners were extremely nice and we chatted with them for quite a bit as we were sitting at the bar. I had the fried cod sandwich- perfect and lightly fried. My husband had the shepherd's pie an devoured it. Can't wait to go back :)"}
{"text":"I wasn't overly impressed.  
We had the Irish Fries for an app.  They were ok....not full of flavor.  The Shepherds Pie was average, my husband makes it better.  My husband had the Perch dinner.  He said it was good but to only get 2 pieces for almost $15 was NOT worth it.  Normally you get at least 3-4 decent sized pieces in most other restaurants.
Wait staff was friendly, atmosphere at 6 pm was mostly people over the age of 65-70.
We like to travel for new places, for us it wasn't worth the drive."}
{"text":"My (Irish) girlfriend and I wanted to go out and try a local Irish restaurant. Its a Friday night probably around 7pm or so, we get seated right away. The first thing we noticed was everyone around us was probably over the age of 65 with a couple couples maybe in their late 20s early 30s (I'm 24 for reference). Whatever, we don't discriminate! So our waitress comes takes our drink orders and disappears for a good 20 minutes (meanwhile we also notice every other table has bread). Finally comes back with my water and the girlfriends wine, we place our food order and its another 45 minutes before the food comes out. We both ordered just fish and chips, even on a Friday night it should never take 45 minutes to make such a simple dish. When the waitress did bring out the food, I mentioned to her we never got bread either. She looked up at me like I was a hassle and said \"oh sorry\" and walked away. The fish was okay, a little burnt to be honest. It didn't stand out, but again it was only fish and chips. We skipped on the desert in fear of having to wait any longer. With all the great places to eat in Cleveland its really hard to give a place a second chance when you've had such lousy service. Oh and we never got our bread!!"}
{"text":"Place was nice, slow on the food coming out, not sure why. food was good, lots to choose from. Will go again."}
{"text":"Don't judge from the outside. Beyond these doors is a cozy Irish pub with good food, freindly staff and a relaxing Irish ambience. The Irish music in the background is a plus too."}
{"text":"I just ate here last night. The soup was wonderful and my strip steak was so tender and juicy. The price was very reasonable. I will be back and highly recommend this restaurant."}
{"text":"We had gift cards to use and couldn't seem to find a menu anywhere to know what we would be in for. I drove up there got a to go menu and returned home to review it (posting pictures of it so everyone else can avoid doing this as they have no menu online or on Facebook to my knowledge). 
 
We ordered the fish and chips. It came with 2 decent size cod filets that were very good, coleslaw was crisp and creamy (wish we got more) and French fries which I'm almost positive unfortunately were frozen.

We also ordered the Reuben rolls which were quite filling on their own! Would order them again.

I also ordered the French onion soup which I enjoyed and could have easily eaten another cup.

All in all after being hesitant to try this place I'm glad we did. We will be back!

Enjoy the menu pics! They were much needed to help this place out."}
{"text":"This charming little pub has great food and service. Besides all if your Irish favorites, they have great burgers and sandwiches too. The atmosphere is relaxing with Irish music playing. *This place is perfect for St. Patrick's day, but gets packed!*"}
{"text":"I feel really conflicted writing this review, but I would have appreciated knowing before I went to just avoid it. I love small, cozy, local places and really wanted to at least \"like\" Greenisland. The service was very good: warm and prompt. The French onion soup was also very good. As for everything else, not good. We started with Irish nachos. Good, well seasoned steak fries smothered in a cheese sauce with a tiny bit of sandwich corned beef. This would have been pretty good of not for the sauce. 
For dinner I had the Lake perch and chips. I ate two bites. It was extremely fishy in a bad way. The batter was outstanding, but sadly a waste. 
This was a huge disappointment. I will not be back."}
{"text":"It took more than TWO hours for our meals to arrive (party of three) after we ordered. Friends of ours came more than an hour after we arrived and received their meals, and ate, before the server sheepishly admitted that they had a problem with our order. It was getting very late and she asked if we still wanted to eat, or just leave!! We stayed and the kitchen rushed our meals out. Imagine my surprise when the the owner offered to buy me another drink (WTF - he still charged us for our meals???) to make up for our inconvenience . We took the high road, paid our bill, and even left a generous tip. Deep down I knew this could very well be the last time I come back. The food is OK there, but customer service like that will lose you customers EVERY time. The Green Island turned into a giant Green Piece of S**T."}
{"text":"I agree with the other reviews... food is way too slow to come out. We had lunch at 2pm, two other tables were seated. A buffalo chicken wrap and fish and chips entree took a full 30 minutes. We are not your average impatient, on-the-run type of folk... but come on. The food is good enough, it's edible, but not mind blowing. It's quaint inside, its clean, a friendly neighborhood place. However, I don't feel the need to return"}
