{"text":"Great place for lunch and breakfast, their rotisserie chicken salad is both sweet and satisfying, not to mention the hot gingerbeard chef and other great staff. They are always friendly and eager to please."}
{"text":"The farm croissant is the best breakfast sandwich I've ever had! The staff is very friendly, too!"}
{"text":"Their veggie breakfast burrito is supremely created. Hands down best in Cleveland, and I like to think of myself of breakfast burrito connoisseur."}
{"text":"Great place for breakfast or lunch! Fresh ingredients and friendly service.  Try the chicken salad. They have a rotisserie there on site, that and all of the attention to ingredients shows in every dish.   You can order for delivery right to your office. We tried it for a meeting at COSE/Greater Cleveland Partnership, right down the road. All of our team members enjoyed.  Look for ice-cream coming soon. We need it in the PlayhouseSquare area!!!!"}
{"text":"Pros:  - Delicious food: try the gobbler or the breakfast croissant  - There are lots of healthy and unhealthy as well as vegetarian and meaty options, so everyone in a group can find something.   Cons: - Kind of expensive for sandwiches and wraps. - why aren't they open on the weekends?????? Or evenings? This is another restaurant that focuses solely on the business crowd and forgets that upwards of 15,000 people actually live downtown and would like to eat on the weekends."}
{"text":"I dropped in for lunch while at work. I ordered the Rothschild Club (adding in chips and a small drink, it was about $10). The food was good and quickly prepared. The location is very convenient to my downtown office, so I will definitely be back."}
{"text":"Popped into Rothschild Farms a week after it opened on December 23.    Lunch was not hectic - I suppose since it was close to Christmas and being so new.  Had the \" Anti-Sanders\" a really delicious sandwich made from rotisserie chicken on some excellent bread.   Slathered with a jalapeno slaw as well as \"Hodges crunchies\", it was a flavorful choice.   Served up in a faux cast-iron pan, the overall presentation was very good.  The menu seems to have a number of strong options on it.   Was particularly intrigued by the breakfast menu - I've been on the prowl for a great breakfast burrito and the one offered by RF looks tasty."}
{"text":"Always a great experience every time we visit!!! Soups are amazing and the cinnamon buns are FANTASTIC"}
{"text":"Excellent food, friendly staff, nice ambiance. Lunch gets full fast, but service is excellent and they keep the crowd moving. I've been four different times now, had three different soups all delicious. The sandwiches are excellent as well. Highly recommend it!"}
{"text":"I absolutely adore their breakfast menu which features burritos and breakfast sandwiches made from fresh croissants. They always feature a soup and sandwich lunch special and I typically order from that but it has something I don't like or that I am allergic to in it, I always go for their chicken salad sandwich. We have an endless debate in the office on which spot downtown has the best chicken salad and Rothschild is pretty high up on the list.   If you work downtown, it's the perfect lunch spot. Sadly, it's closed on the weekends and closes everyday at 3pm. there is an area upstairs that is great for small lunch meetings for 4 or less people."}
{"text":"Wow! I wanted an amazing and delicious salad and that is exactly what I got! Today's special was Bacon and Blue. The ingredients included rotisserie chicken, thick bacon, creamy blue cheese, Granny Smith apples, cranberries, red onions, almond slices, mixed greens and a yummy strawberry vinaigrette dressing. I'll be back to eat here when I return next month!"}
{"text":"Crazy fresh ingredients Unique daily selections All-natural juices and drinks  Perky friendly staff  Great location, convenient to Playhouse A weekly staple for fresh, clean, fare!   Try the \"gobbler\"..."}
{"text":"Had a meeting downtown a few days ago, and afterwards decided to check this place out for lunch as it was close to the garage I was parking in.  In short, I would have bumped this up to 4 stars based on the quality of the food alone.  Had the farmhouse chicken salad.  Chicken tasted very fresh, and were nestled in some fresh arugala greens and some tasty toppings.  The china and real silverware were also pluses.  So why only two stars?  TERRIBLE value.  The Chicken portion was a whopping one regular ice cream scoop for a total price of $8.25.  Want a small fountain drink and a cup of soup to make it a \"box lunch\"--add on another $3.00!  Over $11 bucks for a very tasty but tiny lunch.  The other minor quibble was that we had to \"bus\" our own tray.  No bigee, but the \"bus stand\" to separate your paper products, tray, silverware, etc. was WAY too tiny and messy.  All in all, great food, poor value.  A pity."}
{"text":"I enjoy eating breakfast here! The food is great and the service is excellent! The dining area is very clean!"}
{"text":"Straight up farm to table vibe, lots of delicious items, amazing soups, fast and friendly service - you should definitely go here! The music was really bad though.. and permeated quite loudly throughout the dining room. Some kind of alt-pop station, I guess, but man it was like track after track of objectively just bad songs.. Maybe I'm getting old."}
{"text":"It has potential to be great. Love the idea and the food tasted good but wasn't very hot.   Both of our breakfast skillets were at  room temperature. And this was on a Saturday with barely anyone else in the restaurant.   The positives were that the sausage was delicious. Sweet, savory and slightly spicy. Very impressive. They turned that sausage into an excellent sausage gravy. Really like the atmosphere and the skillet plates.   The negatives were the food wasn't hot. The poached egg was a bit undercooked and slimey (easy to correct that one). My girlfriend's sweet potato hash tasted sour. Not sure if that's supposed to be that way, but it wasn't good.   I'll go back."}
{"text":"Yeah, it's pretty good and it gets crowded for lunch.  My boyfriend ordered the farm ham sandwich.  I ordered the salad with rotisserie chicken (which WAS delicious).  Of course i asked for bacon to be added.  I wish the butter lettuce leaves would have been chopped up.  They were HUGE and a pain to cut and eat especially when we were trying to have a quick lunch.  The charred lemon vinaigrette sounded better than it actually tasted.  Bummer.  I will go back and try other things on the menu (breakfast, anyone?) to give it a fair shake because I love the concept of this place and I do think the quality of ingredients is good."}
{"text":"This place is amazing. Their menu is constantly updated with daily and weekly specials, while still maintaining there regular menu. Salads are to die for, coming from a not so enthusiastic salad eater. Keep up the great work! Can we do the Pancetta Spicy salad again soon though??!?"}
{"text":"Stopped in for the first time and grabbed a quick lunch. Had the lunch special of raclette (cheese) soup and tuna salad on rye and they were both very good. Will be back soon to try breakfast."}
{"text":"I love all the food they make. They serve breakfast sandwiches all day long. I've had all their salads and soups. Everything is made fresh right in front of you. They allow you to customize anything on the menu and will work with you if you have any dietary needs. The food is served promptly and the staff is always pleasant. They give you a lot of food and the price can't be beat. If you're going to a production at Playhouse Square it is located conveniently across the street. I absolutely recommend this place."}
{"text":"For the first time in my life I walked out of a restaurant without even getting my food. Rothchild Farms should be embarrassed!  If you have never been to Rothchild's before it is a sandwich and salad place where you place your order directly with the line cook, they make it in front of you and then you pay at the cashier stand - kind of cafeteria-ish.....simple concept right? Wrong..... I walk up and ask the gentleman who appears to have just rolled out of bed wearing yesterday's chef coat for a corn beef sandwich. He makes it (or at least I thought it was mine) and puts it in the sandwich press. I wait what seems like 10 minutes, he removes it carries it by hand to cutting board in front of the stove where another line cook picks it up and TAKES A BITE OUR OF IT...he then opens the sandwich carries it over to the line where the other customers sandwiches are being made and adds some condiments and what not. I peak my head over the glass and say \"um I think that was my sandwich you are eating\" to which the cooks says, nope I just put yours is on the grill right now.   So let me get this straight. I stand there for 10 minutes, you make a sandwich for another one of the cooks and not until after he begins eat it do you put my sandwich on the press (they were the same sandwich you couldn't have made two at the same time?)?....ARE YOU KIDDING ME? In the meantime other customers are coming in ordering and getting there food no problem.   If they cooks were even remotely apologetic I would have understood that a mistake was made, but nope they were snotty and short with me and basically admitted that he let me stand there for ten minutes, made the cooks sandwich and then mine after the fact.   And just so you know, when I returned to my office everyone I work with said \"I thought you were going to Rothchilds?\".....I made sure I told them in great detail what happened."}
{"text":"I'll agree with the other posters - a \"hidden\" little gem in the Playhouse Square area.  Honestly, it's just right around the corner from Starbucks on 14th, but a couple doors down and easy to miss.    I went there today for the first time and can say it's really good.  The line moves quickly and I was pleasantly surprised to find a fairly spacious space with nice, bright, clean seating - including a small upstairs loft!  Food was very tasty.  I got a Potato Salad side which was delicious.  Like \"this really can't be vegan\" delicious.  And I didn't buy it because I'm vegan, I just like potato salad.  I also tried the Avocado BLT which was good as well.  The woman taking my order asked if I wanted my bread toasted, which was even better.  I love it when sandwich places take the time to toast.  All in all I was ready to give this place 5 stars, but they are not quite there.    As mentioned, they are a bit pricey for lunch, but I don't mind too much if I know going in and the value is there.  For me, the value was a bit off.  Billing themselves as \"farm to table\" raised certain expectations for me.  For instance, my sandwich advertised heirloom tomatoes and honestly it just looked like a regular ole slice of tomato I get on any sandwich anywhere.  I know this sounds like normal hipster, online whining, but as someone who has grown many different varieties of heirloom tomatoes - don't tell me you're giving me one unless you can deliver.  Biggest gripe was the avocado.  There were no slices of avo on the sandwich, just a VERY thin spread of smashed avocado.  And I mean thin - like just enough to make it look green thin.  There's not a whole lot on a BLT to begin with, and should be plenty of profit margin to play with to not have to skimp on the main ingredient.  Bacon coverage was good though with 4 strips.  The price is a tad high, but that generally comes from adding the side.  Sandwich was around $7, which isn't too bad, but the side of potato salad was $2.  Portion size was pretty small on the salad side - only around 4 or 5 bites, so $2 seemed steeped for that small of a portion.    Sorry to get so detailed on the downsides - it really is a good, tasty, clean place you should go to.  There were quite a few comments about pricing though, so wanted to share my perceptions (not to mention I'm naturally verbose to begin with).  In summary - I think the food is worth it, just a bit over-hyped and under-delivered.    A solid 4 stars in my book and will be headed back."}
{"text":"Just tried their ice cream a few days ago and it is so good! Definitely a must try for soft-serve."}
{"text":"See my review under \"Green Rooster Farms\". This restaurant recently rebranded themselves! Still run by the same group - Driftwood."}
{"text":"Move over, Panera...a far better sandwich shop is in town and they're killing it on portion, taste, variety, and price for what you get.  Lots of yummy sounding salads with premium ingredients and cheeses. Very interesting and unique sandwiches and wraps...whether you want something traditional or a little off-beat.   I got the luscious pulled pork with a tangy, mustardy carolina BBQ sauce, along with pickled jalapeno, red onion, coleslaw, and white cheddar shoved in between two ultra soft and fresh slices of sourdough. Now that's a sandwich for lunch! The price points are a little high $10+, but for the taste and portion size it's worth it in my book.   Will be back for lunch when I'm downtown!"}
{"text":"Stopped in for breakfast, too late, got lunch. It was very good. Really happy this place is downtown. Definitely coming back soon for breakfast, next time with friends."}
{"text":"This was my first time visiting Green Rooster Farms, and I must say, I did enjoy my meal.   I went for lunch, and ordered the Harvest Grain Bowl.  Quinoa, farro, beets, squash apples, pickled onions mixed with arugula and lemon sage dressing $7.99, I also added rotisserie chicken, which was an additional $1.50.  The ordering and payment process is a little bit unorganized and there is not a real sense of urgency with the staff.  The restaurant was crowded and a bit chaotic at lunch.  I waited in line to order, received my order and patiently waited in another line to pay.  The portion was generous, could have used a bit more dressing and a little more lemon flavor, but the flavors and textures of the bowl, were spot on.   Next time, I would not add the chicken, not worth the additional $$$, and the bowl didn't need it.  The chicken was a little mushy.  There are 2 levels of seating, I chose to eat upstairs to enjoy my lunch.  The vantage point from upstairs gave me an opportunity to peek at what other were dining on downstairs and everything looked tasty.  I will absolutely return to Green Rooster Farms!"}
{"text":"The Farm Croissant is amazing.  The croissant is good, the scrambled eggs and bacon are good, but the herb aioli is the clincher.  The aioli complements the other flavors perfectly.  The croissant is oversized and stuffed full so, though it's not inexpensive, I think it's a good value.  The kitchen is always very clean, the crew is polite and professional.  The pickup service is okay, sometimes it's ready exactly when they say, other times someone forgot to tell someone to make it and I end up waiting another five minutes, minor inconvenience.  I used to get frustrated with them because they would stop serving breakfast at 10:30am, and they would not make any breakfast food past the cutoff point even if they were completely dead slow.  I would almost never remember to get there on time so I rare ate there.  But now that they changed their menu and offer the farm croissant all day, I end up eating there once or twice a week.  Nothing takes the edge off a Monday like devouring one of those farm croissants."}
{"text":"Nice lunch spot right by CSU and Playhouse Square, in the gateway district. Lunching here can run a bit pricey, but it makes for a nice healthier alternative to the average cafe. Not too big a fan of most of their sandwiches, although they're always accommodating if I do decide to get one and alter a few things. Wouldn't rush to check this place out, unless you're looking for a bowl of soup. Their tomato bisque is perhaps my favorite in the city, and I've stopped by before just to snag a bowl of it during my lunch hour (even in summers, so that should really tell you something! lol). With a calm, green theme and nice décor, comfortable seating options and lots of lighting, it even makes for a good study spot (except during the lunch hour rush), and I've seen more than a few students grab an upstairs booth and settle in with a cup of coffee and some good food to help conquer the books."}
{"text":"I love this place for lunch in the Playhouse Square district. They are super accommodating of my nut allergy - even changing their gloves without needing to be asked! The house salad is super delicious and fresh. Servings are extremely generous, and the home-cooked meats are juicy. I return at least once a week at lunch and the staff is always cheerful and friendly. Highly recommended!"}
{"text":"I visited Rothschild Farms twice while on a recent trip to Cleveland. My first visit was a late lunch. Even though I came in literally minutes before closing, the staff was welcoming and friendly. I had the chicken salas sandwich and it was fresh and tasty. The presentation was charming - they used a small skillet instead of a plate.  Two days later I stopped by for breakfast. Again, the staff was incredibly friendly. I had one of the breakfast croissants, and it, too, was fresh and delicious.   I will absolutely eat there again!"}
{"text":"Delicious. Nutritious. Food that doesn't make me feel guilty!!! Love it. The chicken salad sandwich with gold raisins is amazing!   The set-up is kinda cafeteria style. You order at the start and pick up then move to check out with an opportunity to buy extras like chips and sweets. Then you can pick a spot to sit (tables or booths) in the upstairs or downstairs areas."}
{"text":"Wow! I just wanted a simple sandwich and got a great surprise. The chicken salad sandwich was soft and flavorful. The bread was amazing and herbs added a nice layer of flavor. Service was speedy and friendly, keep up the good work!"}
{"text":"Had the Berry Bacon Salad special along with the roasted tomato soup.  Both were delicious and very fresh tasting."}
{"text":"I still can't believe more people don't know about Green Rooster (formerly called Rothschild Farms).  Tucked away in Playhouse Square, you might miss it if you weren't exclusively looking for it. But that's what makes it great. The menu is all based on locally sourced, healthy meals that are organic and affordable. Everything is delicious. My go-to is the Gobbler...I never feel guilty after eating it. Just be forewarned: every chef in this fast casual restaurant makes things a *little* differently. Some chefs have made my sandwiches and salads bigger than others... it will be a toss up on your portion size.   Other great things: + Food to go: if you're in a rush, you can grab a pre-made sandwich (the same ones available on the menu) and a side (I recommend the beets!)  + Diversity: all of your vegan, vegetarian, gluten-free, \"I'm only eating purple things this month\" friends will all be able to find something on the menu.  + Catering: if you need it, they can do it, and boy, do they deliver, literally and figuratively.  + Ice cream: they have a cute little ice cream shoppe attached to the restaurant. Its hours are seasonal, but if you can catch it open, go for it!  Plan your trip accordingly--they are only open from 8am-2:30pm. Late lunchers will have to look elsewhere!"}
{"text":"Oh my gosh! This place is delicious. I am so happy it is right here, next to csu. I stop here and get breakfast in between my classes. It's alittle expensive, but so worth it. All fresh local ingredients, and they cook everything right in front of you! Service is great, soooooo nice and always ask you If you need anything else. Amazing place!!!"}
{"text":"The Driftwood Group provides NE Ohio a host of dining establishments (Burton's Welshfield Inn is a homespun, rustic standout), not least of which is Green Rooster Farms. An intriguing lunch place just off the beaten path, ze Green Rooster (formerly Rothschild Farms) is notable for its roast chicken breast and its field fresh ingredients (including some stellar beets!). The salads tend to be large and hearty, packed full of green veggies and excellent cheeses. Sandwiches are served in plastic skillets, which is a strange choice, but doesn't actually detract from the meal. At first blush, I assumed they were actually cast iron, a terrifying and clumsy prospect. Green Rooster's chickens slow roast in full public view, something carnivores will no doubt salivate over. While I didn't sample them myself, I was informed by my dining companion these were some sumptuous birds! The layout of the restaurant is unusual, with multiple layers and a sort of crow's nest up top to survey the lower diner area. There are many ramps and small stairwells to navigate and when you find a table  the hard green plastic chairs are a little uncomfortable. Nevertheless, this is a swell lunch establishment for those looking for something a little different."}
{"text":"Loved this fresh food on a hot day in the city. All I wanted was a delicious salad and something for my picky Hubby and Three Year Old. JACK POT! that was likely the most delicious grilled cheese of my life(of course I snuck it from the 3 year old) and my house salad was delish! Fresh, light, and filling! The pear and honey roasted almonds were a great touch!   Thanks for the Yum Green Rooster!! We'll be back!"}
{"text":"Just had lunch at Rothschild Farms and have a few things to mention.  1) While there was a clear process for preparing the dishes, it seemed that the workers were scurrying around, trying to find and replenish ingredients. This backed up the line, so sandwiches were made hastily with ingredients quickly tossed together onto the bread. It's a new place, so I can understand working out some kinks.   2) Sandwiches and salads are served in a plastic faux cast-iron pan, which is then placed on a metal cookie sheet tray. While I'm sure there's an aesthetic purpose, the effect was lost on me.   3) I ordered an \"Anti-Sanders\" sandwich, which has rotisserie chicken on white bread with jalapeno slaw and spicy aioli. Overall, it was good but a piece of my chicken was still attached to a small bone - not a surprise you like to bite into. A staff member came around to ask us how everything was and, when I told her there was a bone in my sandwich, she said, \"Oh, yeah, that happens because they pull the meat right off the chicken and they're working fast. Sorry about that. I'll let them know.\" I think that was a 75% appropriate response -- I'm not a drama queen, but things could have gone a lot worse like a chipped tooth or choking. A little more genuine concern would have gone a long way than trying to rationalize it.   Overall, a good spot for the area and I'll go there again at some point."}
{"text":"Salad/sandwich/soup place. You can see them prepare the food. Vegetables look pretty fresh. I got a croissant sandwich and broccoli cheddar soup here. The broccoli cheddar soup was really tasty, the croissant breakfast sandwich (with herb aioli, egg, cheese and bacon) was good but felt a little too heavy, would've been better with some fresh veggies."}
{"text":"Tried this place out for the first time. I got the berry salad and it was amazing! I will for sure be back."}
{"text":"I love restaurants that support local!  The food was delicious :). I had the tomato bisque and shared the marinated beet salad.  My sister and mom shared the Panzanella sandwich and quinoa salad.  Everything was excellent and the service was very friendly.  Just take into consideration the hot sandwiches are not served Sundays - it's more a brunch and cold sandwich menu that day.  I can't go back to try a hot sandwich!"}
{"text":"Honestly, the first time I went to this place ordered a salad that without chicken and cheese was not my cup of tea. It has pears in it and I'm not a fan of cooked fruit. Then my sandwich on gluten free bread was dry and fell apart BUT I went back the next day and asked for my bread to be toasted really well and a little olive oil annnnnnd OMG. It was so delicious. I asked for my tuna in a small container and I was able to take a bite of bread and a bite of tuna. Then I went there this morning for breakfast potatoes and they were the best I had in a long time. The conclusion? I like this place. Service is good. Food is good. Vibe is good. I have massive dietary restrictions so there's not a lot I can eat but it's healthy, clean and well-made....and the staff seems to be happy. I like that. So 5 stars it is! I am visiting and here working in Cleveland this week. I would go here again and recommend it to friends who are staying in the downtown area."}
{"text":"I got a great salad and a couple friends of mine ordered sandwiches and everything looked (and tasted) so yummy! Affordable meals and the interior has unexpected, quirky decor. The ice cream is also pretty good if you're in the mood for soft serve."}
{"text":"I come here for lunch at least 3x weekly. It's fast, healthy, the staff is always friendly, and they have rotating specials that have never disappointed. I typically go for the salads, but the few times I have tried the sandwiches or wraps, they have been delicious as well. Also, best peanut butter cookies in the city. I love this place!"}
{"text":"Located in the heart of the Theater District, this breakfast and lunch restaurant with only weekday hours till 2:30 PM is geared towards the downtown worker.  I stopped in for the first time on a Monday at 12:30 PM. The space offers E 14th St window seating, bar height seating and tables both on the main floor and in an upstairs loft area. You can enter from Euclid via the Hanna building or from E 14th St.   The restaurant is self-service, with coolers filled with drinks and the side options. You then go down a Chiptole / Subway style assembly line. Why they have it set up like that though I am not sure, as my lunch order at least didn't require my input along the line at all.   I ordered The Gobbler which is a turkey sandwich. It contained bacon, tomato, lettuce and cheese. Nothing fancy, but it was good. I actually think I got the most flavor from the multi-grain bread.   For $7.99 I felt the place offered a good value. I would pick this place over Subway for sure,  from a fresh and local ingredient perspective. The menu is rather small however, so this will likely be regulated to the monthly visit category of my lunch time options."}
{"text":"Amazing tomato soup! Great lunch spot. Has a good atmosphere to it."}
{"text":"I love the fresh and fast food offerings. This is one of my go to spots when I'm looking for a healthy light lunch."}
{"text":"Great food, great environment, and the employees are some of the friendliest people you'll meet."}
