{"text":"A dark, quite place tucked away in a strip mall on International Ave (17th SE), The Green Grato serves up the classics of Jamaican cuisine, but surprisingly the less iconic dishes stood out the most. Assuming the food would come out on Island Standard Time (i.e. slow), we ordered a Jamaican patty to munch on, and grabbed an apple flavored pop from the fridge. The spicy patty was the same tasty one you get everywhere. A selection of off-beat bevvies are available, so they get points there.   We ordered two combos ($16 each) in order to sample 4 mains, and the beans and rice.  The iconic goat curry was very mild, so mild that I'm not sure I'd identify it as curry if blindfolded, it mostly tasted just muttony.  On the plus side, it was a boneless preparation (goat is notorious for being boney) in a significant portion size. Defying all culinary logic, the quintessential Jamaican dish, \"jerk\" chicken, was not spiced at all either. A very fluid green pepper sauce was provided on the side, but that is definitely not what I picture when I think jerk. Ostensibly this is so you can make it as spicy as you like, but honestly if you're ordering jerk you've got to be on spice train already. The chicken itself was kind of dry.  The sauce made it palatable, but was most effective in making the otherwise humdrum beans and rice really tasty.    As hinted at earlier, what rescues the rating here are the less iconic dishes. The bone-in brown chicken was moist and flavorful, not herbaceous or spicy, just really savory from that deep long slow cooked browning. I'd order this again for sure. Similarly, the oxtail had a really deep flavour, very beefy, and I thoroughly enjoyed picking the meat morsels away from the gnarly tail bones.  Portion sizes were pretty generous, and the staff friendly. The decor is islander, but dimly lit and looking worn.  I wouldn't take a date here, but it's fine for dining with people you don't need to impress, and who aren't set on ordering the iconic Jamaican foods we'd normally think of."}
{"text":"Very Caribbean service, which is a euphemism for \"crappy, but the Jamaican lady was so nice and sweet I can't be mad about it\".   I get a large goat roti which was about one third of a pound. The flour was very fresh and while the goat was f'n delicious, it was sparse and inconsistently spread within the roti. It wasn't bad. The woman had ackee and salt fish which she thought was good but not incredible.  Not a bad dinner, until we got the bill; the roti and salt fish were $17 each. Meeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeghhhhhh...  Good dinner to be had if you want to try out a decent Carribean meal (yes, they have jerk chicken), but the price will keep me away."}
{"text":"Stopped here for lunch the a couple of saturdays and was impressed.  Not fancy and certainly a limited menu (I believe there were only 4 or 5 entrees) but clean and friendly which is a combo that works just fine for me.  Went with the ox tail and rice.  The meat was VERY well seasoned and so tender, the rice was well prepared with the right amount a red beans mixed in and the Red Stripe was cold.   Only complaint for the food were the veggies.  Not sure what an authentic Jamaican vegetable side dish would be but am pretty sure that steamed frozen mix isn't it.  Clientele for a Saturday afternoon looked like a mix of locals and people drawn in for the food.   Very relaxed atmosphere with the staff being slow but efficient in getting things done."}
{"text":"I came to Grato for a work party sort of thing and I've honestly never had Jamaican food before, so my expectations coming here were relatively low. And I may not know my Jamaican food but I know food in general and the food here was delicious. As a group, we were able to have a buffet type of dining which was great because that gave everyone the opportunity to try all sorts of different dishes.  I managed to try a lot of things such as the Jerk Chicken and the Curry Chicken, both which equally cooked to perfection with tons of flavour to it. Also had side dishes such as rice, beans, veggies and plantains which were all very fresh and I guess I was either really hungry or really enjoyed it because I practically licked my plate off!  This place definitely deserves a 4.5 for the food, and the staff was very friendly, played great music for our group. Don't expect high end furniture and decor because that's just not how they do it, and that's cool with me. I want to come back and definitely try the Ox Tail."}
