{"text":"Greg's used to be a decent, consistent breakfast and \"meat and two\" greek family owned joint.  Things seem to have taken a downhill slide recently.

The meat and vegetables offering is a little disappointing.  They typically have roast beef which is unfortunately dry and served with a canned, gelatinous dark gravy.  If you are southern or if your mother ever made homemade chicken and dumplings, you should avoid this dish when it is offered.  The dumplings are heavy, thick and chewy and the whole dish is sauced with an obviously canned white gelatinous gravy.  For a place that tries to offer southern style food I don't understand why they don't make their own gravy for these dishes.  I also found small chicken bones in my dish which is a big turn off, not to mention perilous.

The vegetables they serve either come out of a can or are frozen.  They are not well seasoned.

Various members of family and extended family populate the staff.  On a number of occasions I have asked my waitress what they recommend on the menu -- the family members that are waitresses can never tell you!  The ones I have asked have always replied that they don't eat southern food!  You can sure tell no one samples the chicken and dumplings.

I used to go here quite a lot, even though their food has never been excellent, but it was convenient, so I went.  Now that our office has moved, Greg's just isn't good enough to drive a few extra miles."}
{"text":"I like Greg's! The chicken and dumplings were pretty good. Loved the fried squash. Blue cheese salad dressing was fair - need a little more zing. Next time I am going to try the barbeque!"}
{"text":"Several of the waitresses must have been imported from a local trailer park.  I keep expecting to hear someone shout, \"Kiss my grits!\"  The barbecue is actually pretty darn good!!"}
{"text":"Let me start off by saying they failed my french fry barometer test. Very sad. You know this makes me mad, good thing I'm not the Incredible Hulk or  I would be flippin' tables and takin' names.

I was with my parents so we pigged out (pun, not intended) . Everything was lukewarm,  fried squash, broccoli casserole, french fries, baked beans and my bbq sandwich. It was fine and our server was very charming.  Sweet tea was average.  I wouldn't write it off, but I would't make a special trip to return."}
{"text":"Greg's is definitely an old-school meat & veggies family-owned place, not just a BBQ joint. They definitely serve a lot of fried foods, a lot of southern foods, and Italian foods with a Greek spin.  It is similar to places like Gus's Sir Beef.  

Growing up in Charlotte (from the mid 70's to early 80's) it seemed that all the restuarants were owned by Greek families (including lots of old-school  diners like Athens, drive--ins like the BBQ King, Italian restaurants like The Open Kitchen and Valentinos, Pizza joints like the Gondola, fancy restaurants like the Epicurean, family restaurants like the original Mr C's, The Ole Smokehouse, and The Clock, as well as many others).  Greg's definitely reminds me of all those good Greek-owned places my parents took me when I was growing up. 

When we arrived, we hit the timing jackpot and did not have to wait for a table. Before we had even placed our orders, we were served a starter (on the house) of fried squash.  It was fresh and not too greasy.  Since I don't eat pork BBQ, I went with chicken. The food was good, but not outstanding...but at this price point, it is definitely in the good value range.

The best part really was the service.  Every employee as well as the owner made us feel like we were really welcomed and appreciated.  We'll definitely be going back when we are in the mood for some old-school-Charlotte-style Greek-Southern cooking."}
{"text":"This is a great local bbq joint and Southern restaurant.  If you are familiar with the local restaurant biz you know a majority of the local places are owned by Greek families.  They do a great job and this is no exception.  We're talking about Eastern NC (If you don't know what that is you have homework to do) bbq.  It is excellent and the onion rings are too!  It isn't a fancy place, but the service is super and the food is too.  Recommend."}
{"text":"This place is so forgettable, it's almost funny. My boyfriend (now fiance) and I probably ate here in 2011. The only thing I can remember eating were onion rings. Those were actually really good and had good flavor.

But when we walked in, we honestly didn't feel welcome. There's a church literally right across the street from this place. Apparently all the old folk only eat here, and to see two young adults was baffling. Maybe one even shook their head, who knows. Even the employees seemed baffled and we almost walked out.

The lady that helped us was pretty friendly, but it was still the same thing. I've brought this place up over and over again with my fiance, but he insists on not going back. I think he felt so uncomfortable being there. What a shame because I'd like to at least try this place out again."}
{"text":"We stopped by for another try at Greg's on Friday, and the place was again packed.  So packed, in fact, that we couldn't find a place to park in their smallish lot.  When we finally did, we had to stand in line to get a place to sit.  We eventually gave up, when after about fifteen minutes the line wasn't moving.  Not to say that it wouldn't, but since they don't have a queue of any sort, or even a pad to write names on, we just didn't feel like waiting.  Get there early (or late, perhaps).  Prime time means a line."}
{"text":"Stopped in for breakfast, nice sized portions for the price, but it is average diner food at best.  Everyone seems to know everybody and the locals must really like it because it was busy, but it was overwhelmingly average."}
{"text":"Greg's was great!  The owner gave us on-the-house appetizers and an entire plate of BBQ to try. We got pulled pork and ribs and everything was tasty. The owner actually sat down and talked to nearly every table. Great southern hospitality!"}
