{"text":"Came here for cocktails one night with some friends. Drinks were good but some of the 7+ ingredients got lost to one another at times. I didn't have any issues with the service like others but there wasn't anything memorable about it either. For what we paid I would have rather gone somewhere else tbh.. Cute Lufthansa map on the wall tho"}
{"text":"We went here and were taken care of extraordinarily well. The owners sat and chatted, fixed us cocktails off the menu when we wanted a surprise--they improvised some of the best cocktails we had all night! The Jesus Fizz and Hare Trigger are must tries.  The Grey
Tiger is a labour of love and it shows from
the moment you walk in: the atmosphere is expertly achieved, their furniture is hand built by the owners. The menu is filled with beautiful hand-drawn illustrations that just shows a real commitment to their drinks. 
Really couldn't speak more highly of our time at The Grey Tiger."}
{"text":"Well, that was god awful. 

First, the good: the food was good. That's about all. 

The bad: Where did the service go? Very strange that you would open up an establishment that is encouraging something as positive as veganism and then proceed to treat your customers like crap. I agree with the review a couple of entries down that points out their 'confrontational attitude'. Bingo. To me, that's bizarre. What's the point of alienating your customers? The owners are incredibly, incredibly rude. So much so that I felt compelled to leave a review to warn others off. Do yourself a favor and go elsewhere. 

My only hope is that they read these reviews and attempt to improve their customer service. Otherwise, do us all a favor and close up shop. Thanks, but no thanks."}
{"text":"Ohhhh Priscilla. She's not the bartender. She's the toast with peanut butter, banana and coconut bacon (VEGAN!) Although the staff is equally as lovely ;).  I've never felt more welcomed at a new spot, treated more like a friend than a patron. They've already got a head start with their cocktails - elegant flavours and creative combos. I was proud and enthralled to be a bit of a guinea pig, as the owner directed his staff on the concoctions. If you want some charm, go see the Tiger."}
{"text":"Grey tiger is the best! I discovered it when I had torn my acl and wanted to get out of the house but keep it local. 

Ever since then, I've been coming here pretty often when I have to study or when I am busying writing for my blog. The overall vibe is relaxed, casual, motivating and they have strong WiFi which I need. The thing I love most about Grey Tiger is that by day its a cafe, and by the evening it turns in onto a bar. Once the liquor starts to pour, you'll be reminded to either disconnect and order a rewarding drink, or realize that you've been there since morning and it's time to pack up and get out of their hair!

During the day, I typically order a flat white. There is no acidity at all and very smooth tasting. The latte art is beautifully simple and artistic. Once I ordered the Priscilla toast to snack on - peanut butter, banana and coconut bacon. Nut butter and bananas always made sense in my life as a student but had I known coconut bacon would be a good mix, my university life would've had better days. The fresh Hokkaido milk bread is my favourite part though. Everything else is just extra :) 

When the evening comes around and I'm still working away, I like to order something on tap. The tap choices change every so often and unfortunately, I don't recall the drafts I've tried... But if the bartender likes it enough to serve it on tap, it's good enough for me. 

I really recommend Grey Tiger for times when you need to get work done outside of the home, or if you're having a drink with a friend. If you're going somewhere for a first date, I highly recommend this cafe - it's intimate, romantic and oftentimes it's generally quiet."}
{"text":"Being at Grey Tiger improved me as a human being... After my first visit, I was able to speak French fluently and became both an Agnostic Minister and a Doula within five minutes... I delivered three child/wolf hybrids capable of speaking truth to power.

This is what Grey Tiger feels like... In your bones.

https://www.youtube.com/watch?v=rvrZJ5C_Nwg"}
{"text":"This cafe seems like a great place to chill, very clean and relaxed.  I could spend a few hours here just people watching.  It was well designed and quiet.

So why the two stars?  While they have good choices of cocktails and tea/coffee, the overall vibe seemed a bit pretentious.  I ordered the Matcha cortado with almond milk and it costs $5+, which isn't too bad, but it was juist a small little cup.  Probably 4 ounces or something.  

Would I come back? Maybe, but I found things quite pricey. Even the Americano was $3+."}
{"text":"I'm updating my review because I've visited a few more times since my last visit and find the service has improved a lot. The cocktails are very tasty and the owners are great to chat with.

The only small thing I would mention is that they tend to close unexpectedly. While this is no big deal for people like myself who live in the area and just drop-by, it makes it very difficult to make plans with friends who would be travelling to the area. I think it's great that the owners take some time for themselves or to work on a new menu, but closing up shop on random days without warnings, or for weeks at a time (like right now in August), will make it difficult in the long-run for them to build up clientele from anywhere outside of Bloordale. Just my opinion anyways.

I really want to bring my friends to this great spot, but will have to wait until the hours become more consistent."}
{"text":"I love this place. My husband and I come here with a pack of cards and the ability to go out and have a nice non-alcoholic, yet complex drink. No tvs for distraction and nice ambiance.  The bathrooms are great, private rooms..nice wallpapers, and clean :)"}
{"text":"Worst cafe in Toronto. Rudest staff. Dry baked stuff. Shit coffee. Will never return."}
{"text":"The folks that operate Grey Tiger are sweet and caring. I really appreciated the fact that the expert bar tender came by to talk to us about the drinks that he personally crafted, and the other lady was extremely attentive and friendly to my party. The drinks are creative, skilfully crafted, and tasty. The drink descriptions are accurate. An awesome spot with a curious menu. I'll be back. Thanks for bringing something distinct and genuinely good to toronto--that's hard to find here!!"}
{"text":"As a vegan, I honestly get SO excited when I find a new place that I can actually try everything on the menu. Stumbled across Grey Tiger on a walk down Bloor and was very pleasantly surprised by the delicious snacks- I had the Priscilla toast (yum!!) and the banana bread. Both were exceptionally tasty and would definitely come back for those alone. However it was the lovely service that will definitely keep me a repeat customer. I believe I was served by the owner, and she was so sweet and helpful. She made great recommendations, and I think that she makes all the baked goods in house which earns an extra thumbs up from me.
The space itself is gorgeous and it looks like they have a great cocktail selection as well so I will be back to try those asap.
Check this place out if you want an overall very lovely cafe experience!"}
{"text":"What an amazing place to get a cocktail!  The cocktails clearly have an amazing amount of thought and effort put into them. We got cocktails from the menu, loved them; then got the dealers choice, where you answer questions about your preferences and get a surprise. It was perfectly tailored to my taste, interesting and delicious. Certainly one of the best cocktails I've had in the city, complete with great, friendly service."}
{"text":"I've only been once so far, but I quite like the vibe at this coffee shop.  It's warm and homely (the way English and Irish people use the word).  Friendly staff.  Space to work on your table.  Good Wi-Fi.  

I've only been here so far for the coffee, but I enjoyed my latte.  Strong and rich espresso with nicely foamed milk.  

They have quite the selection of liquor and what looks like an interesting cocktail list.  I haven't tried any of their cocktails yet, but it looks like it could be quite promising.  Rather limited beer list, but they have $5 pints from 5-7 PM for happy hour."}
{"text":"Nice brightly lit cafe with white walls and light neon furniture for contrast. Couldn't help but notice the interesting Illuminati tabby kitten wallpaper that had David Bowie's distinct face paint.
 
Had a Cortado priced at around $3.50, and found it quite disappointing. The roast was from Propeller Coffee Co. called \"Ace,\" which had received some notable recognition as per advertised on their website. Despite such, was unable to appreciate it. 

At initial taste it was super sour, which hits the back of your tongue and you start to feel it hurting your parotid glands. By that time, I was feeling the pain in my stomach (high acidity activated an existing small peptic ulcer I've developed whilst on vacation 3 weeks ago) so I had to stop drinking and dispose the rest.

Thinking the unpleasant astringency could be due to inconsistent grounding size which changes how the ground chemical properties are dissolved--too course of a ground will result to under-extraction and produce a sour taste. Adding sugar seemed to have worsened it, but adding milk seemed to have made it taste slightly better, only it completely diluted the flavour of the coffee.

All that to say, I liked the cute ambience of the cafe, but probably wouldn't return again for their coffee."}
{"text":"Wow. This place blew me away. I'm visiting from NYC and I stumbled upon this little place. It's a perfect place with an extensive menu and a super cool history. I've recommended this place to all my friends, it's the best."}
{"text":"My first time here but I already want to go back again. This is deliciously innovative vegan food and a very extensive drink list of craft beers, bourbons, and cocktails. Owners are super friendly and knowledgeable.  

Also they made their own amazing wallpaper of a cat shooting lightning out of its eyes, love everything about this place!"}
{"text":"I've been meaning to check out Grey Tiger since they opened as I'm always interested in new vegan spots. This wasn't ideal timing because we just ate some snacks at Bunners, but I just wanted a coffee and to check the place out. Unfortunately this plan didn't jibe well with the person taking my order. Since I was with someone else we were informed that my partner should order something too. Well, she didn't want anything.

The place was completely empty, we were literally the only patrons in the place so I'm not sure what the problem was. And we were at an engagement party earlier so we definitely didn't look like a couple of scumbags looking to take a nap at a table.
I was so shocked by their behavior I actually asked if I should change my order to \"to go\" and they passive-aggressively let me know that we were allowed to stay and drink the coffee. It was the most awkward coffee I've had in Toronto. I basically pounded it, then we got out of there and I'm not planning on returning.

The americano was ok, the mug was covered in fresh espresso splatters so they might want to check out the machine.

tl;dr If you go with anyone else make sure you are all ordering something. Which shouldn't be a problem most of the time, but hey, maybe someone you're with isn't hungry?"}
{"text":"::sigh:: I'm conflicted with the strong desire for Grey Tiger to succeed and my own selfish want for a secret watering hole. Alas, I can't hold back. GT is nauseatingly charming. The owners are beyond pleasant, and gracious and polite. I've never been so immediately welcomed and accommodated. Oh and did I mention their whiskey selection is sick??? Ryan knows his shit. And I could sit there and taste every exotic and new whiskey if  alcohol poisoning wasn't a real threat. Not to mention the 'Priscilla' (a cheeky vegan play on the Elvis) is delicious. Congratulations GT your passion and knowledge is very evident.   

P.S the prices are so reasonable that I felt guilty paying $8 for a whiskey so good I giggled to myself"}
