{"text":"I'm so happy to have found this spot! Walked in, greeted with a smile, seated within minutes.  We had our water and warm bread quickly, service was super fast, friendly and delightful.  The food was delicious.  Pasta, chicken, veal was all great.  The meat sauce for the pasta is outstanding.  It's is BYOB.  Don't forget your wine!!  We will definitely be back and will recommend this place to friends."}
{"text":"Be prepared - it's strictly BYO alcohol.  Even without a glass of wine, the service was fun & friendly. Calamari is PERFECT.  It's a large open restaurant with great atmosphere."}
{"text":"Service incroyablement lent malgré le peu de clients, pâtes immangeables. Par contre, les desserts que nous avions commandés étaient bons."}
{"text":"Had supper at Grigio last night for the first time! I am surprised no one reviewed this! It must be a new restaurant!   Very nice restaurant, trendy, bring your own wine. Our waitress Melissa G dis a wonderful job. The restaurant was full, it was a Saturday night at 7pm...she had many tables to serve but she managed to get our entrees and main courses out within 30 mins!  Food is great! No complains at all. Generous portions. We had a dish of fried calamari and garlic snails as an entree. Everything was delicious! I had the lasagna, my husband had the scaloppini and my sister ordered rigatoni with chicken. Everything was delicious.  We will definitely be back for some more! The parking is spacious! The only down side of the restaurant is they don't take reservations if you're less than 5 people! Go early and get a table! Don't forget to bring your own wine! Nothing is better than awesome italian food & good wine!"}
{"text":"I did my bf's surprise party here, we were a group of 25 people and everything was perfect!   #1: its a  BYOW, a + that everyone enjoys!   #2: Our waiter was super nice and efficient. Every one had their food, at the same time, promptly, which surprised me considering we were 25. She often came to ask if everything was to our liking and she came to see me (the organizer) several time to make sure everything was to my liking and going as i wanted. I really appreciated the fact that she cared for this night to be a success for us.   And  most importantly, the food was delicious!   The only \"downside\" is that they charge 10$ to cut a cake, oh well, i didnt mind as long as everything went smoothly and everyone was happy! Will def go again!"}
{"text":"I like this place a lot recommend just try it I don't write a lot so if I take the time to reviews it's really bad or good I give 4 stars"}
{"text":"This is a bring your own wine resto. Very nice menu. Service is excellent and fast. Warm bread is good. Room is big and a bit loud but if your not looking for intimacy it's ok. Veal marsala is very good. Brought a group there and had rave reviews. Would go again in a flash."}
{"text":"It's rare that I give a place 5 stars but in my book this place deserves it. At lunch in any case since I've never been there for dinner. They have some top notch lunch specials at a ridiculously low price. All entrees include soup or salad and desert and coffee. Most people end up bringing home half their meal for dinner. Unless you're a glutton like me and finish it off. I think I impressed our waiter.   So bottom line: if your looking for a great place to go for lunch check this place out!"}
{"text":"J avais le goût de me faire servir ce n'est pas la première fois que je choisis ce restaurant belle ambiance serveur stéph super souriant, j ai pris escalope toscane ,très tendres sauce onctueuse à la crème champignon avec tomate séchée garnie de pâte demandez pour changer de sorte et avec ça grande salade maison et aussi rigatoni con pollo gratinée nous avons adoré bon choix dans les pâtes ,viandes et salade et les entrées pour les déserts aussi vous ne serez pas déçu c'est mieux une réservation faites vous plaisir je pourrais vous en dire plus vous m'en direz plus"}
{"text":"I've eaten here about 5 times now and only been to Montreal twice. There's something about this place that's just so good. I've tried several dishes from the pastas, soups, salads and veal. My favorite is a pasta dish, fettuccine Gamberoni followed by Linguine Portofino. For appetizer the escargot and mussels are favorites. It's a BYOB(W) and the whine store next door has closed down, but there is a Saq 2km down the street."}
{"text":"Really like this Italian restaurant. The menu is extensive and reasonably priced. It's a BYOW place.    Service is very efficient and friendly.  The pasta dishes were good.  Appetizers came out really quick.  This place caters to small or large groups. Large parking area. I don't need to travel to Montreal when I want Italian food. We'll be back!"}
{"text":"J'y ai été pour trois souper de Noël de compagnie. Nous avions le menu normal (s'il existe un menu pour événement). Portions correcte, nourriture bonne mais le service est toujours pas super.  Il s'agit d'un apporter votre vin donc si vous voulez voir, ne les oublier pas."}
