{"text":"Fake beer. Avoid at all costs.
Came with my girlfriend for some late night eats, we were hungry and are not Chinese so we had no idea what we were doing.  Asked the server for beer.  He asks if I want regular beer or dark beer.  ??? I ask for \"regular\" and assume he would list some selections, he returns with a pitcher of beer, when I never asked for it.  I assumed it would be a bottle or pint.  I tell him that, my girlfriend says it's fine we'll take it... Okay fine I like beer anyway.  I taste it, it's watered down to hell.  I tell the waiter, he said it tastes fine to him.  He says it's Canadian, so I ordered a bottle of Canadian.  The pitcher was positively watered down.  I asked him how much the pitcher was, $5.99.  No wonder... Suffice to say that ruined my whole meal and will never return again."}
{"text":"DO NOT EAT AT THIS RESTAURANT!

I ordered noodles and when they arrived, I found a short, thick, curly black hair in the food. I called the waitress over and showed it to her. She literally looked at the food with a blank expression for a while, then said \"I'll get you another one\". She left the food at the table next to me, and it took five minutes for somebody to come get it and take it away. After they finally took it back to the kitchen, it took over fifteen minutes for them to bring me a replacement. When the new dish came, all the food looked like it was just thrown in; the whole thing was messy - the meat and vegetables were thrown under the noodles and the noodles themselves were sloppy. I definitely will not be coming back.

I understand that they are the \"Grilled Fish Chalet\" and not a specialty noodle house, but I still don't think that warrants poor service and pubic hair in my food."}
{"text":"I came in after lunch so the place wasn't busy, however that didn't stop the wait staff from not getting us a table? After 5 or so minutes we finally got our own table and that's when we got the wait staff's attention to order....which they never came?  We waited for over 15 mins, and finally we left!  Horrible service!!! Won't be stepping foot in there ever!"}
{"text":"I like their main course, the spicy fish tray. Rich flavour, really good taste. Serve quick. Their is three different levers of spiciness. You can also add different kinds of vegetables. Kind of like a hot pot fish combo. I like it very much. But the bad thing is that they have very limited parking space at the back, and the location is kind of isolated from lots of restaurant filled plaza. The two dishes I don't quite like are the chicken cartilage and the fried corn, they are very very salty, I have no idea why they cook them in a salty flavour, weird taste. I would definitely going back to have the fish hot pot, but will be very careful to choose the side dishes."}
{"text":"Visiting from Vancouver, this is a unique restaurant and their menu is a little hard to understand. Luckily, the waiters were super helpful! The food we ordered was reeeally yummy and the service was great! Would definitely come back once I'm back in Toronto"}
{"text":"went there last night the food was rly good the fish was fresh and tasty :)) and the price is fair compare to the one i had in hamilton !!! i will come back for sure"}
{"text":"This place is for large platters of grilled fish. I didn't have enough stomachs at the time so I tried out some of the smaller options. It was interesting to try the skewers because I noticed that they were deep fried instead of barbecued. Can't say which way of cooking is better, but definitely different. The place is very clean and not smoggy compared to other bbq skewer places. English service seems to be a difficulty here and may forget orders some times. I would recommend trying this place and would like to come back for the fish."}
{"text":"This is a 3 1/2 star restaurant. This is a clean place. To get service there is a ringer on your table. The service here is quick. We order the fish and skewer with ma PO tofu. It's very average in taste. It has so many different kind of dishes here. It's worth trying again. I don't find this place expensive at all."}
{"text":"Sometimes karma has a strange way to tell you that you should take a risk, such as your desired restaurant is full, or there is no parking spot, hence you must venture out of your comfort zone.  So the story goes.  Mom and I drove to Silver Star Blvd in Scarborough for dinner.  Total parking chaos, plus the greeter of the restaurant told us there was a 20-minute wait for a table.  I did a visual sweep and could tell it was not gonna to happen.  We skipped and drove aimlessly along Steeles Avenue.  In darkness came a neon light saying grand opening 15% off discount.  The owner of the neon light was a divey Chinese restaurant in a divey strip mall.  We concluded that the worst harm would be lousy food on the cheap in an unknown restaurant, meaning no big deal.  So we started our adventure.

The English name of the restaurant is Grill Fish Cool.  But the English name is not easy to spot, because the Chinese name is like 10 times the size of the English name.  The direct word to word translation of the Chinese name is \"Fish Cool\".  This tells me 1) that this is an authentic Chinese restaurant and 2) to order a fish dish.  We complied.  We ordered one fish dish (Fish with Pickled Vegetables $12), one meat dish (Spicy Stir Fry beef $11) and one vegetable dish (Pea Tips with Garlic $10).  There was too much food for two people, but we wanted to sample a variety, plus the prices were pretty low even without the grand opening discount.

My favourite dish was the fish dish.  The portion was huge.  I thought it would take at least 3 people to consume it.  There were many pieces of Basa fish fillets.  Basa was not the best quality frozen fish, but it was fresh nevertheless.  The pickled broth was the star of this dish.  The flavour was a balanced layering of sourness and savoury, with the right amount of oiliness to create depth and richness.  It wasn't meant to be a soup, but I drank it anyway.  At $12, I wondered if they made a sensible profit.  5 stars dish.

Being this is primarily a Northern Chinese restaurant, the Spicy Stir Fry beef wasn't too spicy.  It was noted as 1 chilli spiciness, and it was the right level for us Southern Chinese.  I liked the flavour but the meat could be more tender.  I would switch to stir fry lamb next time. For people who love spicy food, there are some 2-chilli dishes on menu.  3.5 stars dish.

The Pea Tips with Garlic was the smallest dish among the three.  It tasted all right, or may I say boring.  Unfortunately, it also reinforced my belief that I should avoid ordering a Southern dish in a Northern Chinese restaurant.  3 stars dish.

Services was friendly and effective.  Food arrived in reasonable time.  

Last note that, despite the restaurant exterior AND the mall look divey, the restaurant interior has been newly renovated, is modern looking and comfortable.  The entrance is brightly lighted.  There is a pretty picture saying their grill seafood was good.

The headlined dishes here are the grill fish and seafood dishes, and skewers.  We didn't order any, so this review does not reflect the quality of the featured dishes.  Whatever we ordered were delicious and good valued.  We will order the grill seafood next time, when we have a bigger group."}
{"text":"Food is okay but horrible service. The waitress, I'm pretty sure she is the same waitress that everyone is referring to, was angry, impatient and full of attitude. They also had the orders wrong twice and forgot one of our dishes. We will not return or recommend this place."}
{"text":"2 star for service 3 star for food

Grilled Fish Chalet is more like a 2.5 star experience. 

??????($22.95)
The Grilled Fish hot pot has so many different soup based to choose from which is quite interesting. And there are non spicy version if you are not into crazy spiciness! The fish itself is quite tasty and you can pay extra for additional items to cook in the broth. I love potato noodle!

????? ($18.95) Rooster Hot Pot
The Spicy Rooster hot pot was disappointing. There were hardly any good pieces in the hot pot. You sure it is was a rooster? Not a tiny pigeon?? Everything was so bony.

The other dishes we ordered were so so... nothing I would recommend or come back for aside from the fish.

Service was lacking and it was hard to get anything or even attention from the wait staff. When the waitress was setting up our table, she was practically throwing everything on the table and ended up one of the spoons just dropped on the floor and  broke into pieces right by my feet.... Why was she so angry?!"}
