{"text":"Good happy hour pricing of expensive menu offerings.  Their grilled wedge salad is exquisite; the small pizzas were both excellent.  Great ambiance and our server Adam was superior.  We sat before a roaring fire on a cold January night, so 'twas tres atmospheric.  You figure they'll have an amazing wine list, and Grotto doesn't disappoint."}
{"text":"Went here for a friend's birthday!    Really fab selection of wines.  Amazing.   I'm sorry Cave Du Vin.  It's over.  The wine would have been a satisfying find itself, but the food was quite good as well.  If you are feeling decadent, I highly recommend the very rich, creamy lobster gnocchi.  Scallop bruschetta & Fennel/Orange Salad = Excellent.  Penne with rapini = good  Loved the dark wood atmosphere, which felt a bit like a cigar bar.  Could do without the sports and tv., which was completely weird and out of place."}
{"text":"Was there this weekend, we go quite often, but this trip seemed different than the others. We ordered the antipasti, tagliatelle and linguine with clams. We both ordered wine. Have always thought the portion sizes are perfect, but for some reason, it seems as though the prices have gone up. $16 for antipasti with meats and cheeses that were quite common does not add up. The pasta dishes were overpriced as well. Our server was nice and attentive, but towards the end of our meal he rushed us by putting our check on the table, we had planned on staying to enjoy more wine. When he came back to get the check he seemed annoyed when we asked for more.  We spent over $100, you would think he would be nice til the end to get his tip, but he was seen at the bar doing shots with the bartender and other employees, no longer concerned with us.  Hopefully we won't get such a JV server next time."}
{"text":"I went back. I still love it.  I had Carpaccio and Veal Tagliatelli, and a Barbersco Piemonte.  Me and my journal, and a little baroque music.  The only issue?  Well, the Cleveland Cavaliers were playing -- and some patrons were louder than I would have liked.  I wish they'd get rid of the TV.  This would rapidly become the place I chill after work...  Actually, I still prefer my flat...  :)"}
{"text":"Like Ferdinand, I really enjoyed Grotto! Great atmosphere & good service. This is a great addition to the Shaker Square neighborhood!  I don't know much about wine, but the flight that I tried was terrific. I also enjoyed the Gnocchi and calamari. I hope to go back soon!"}
{"text":"I used to be impressed with Grotto.  Now it's one of those places that I discourage people from going to because it's just so damn dull.  Is it just me or has the menu not changed in like 2 years?  The dishes are all of the \"safe\" Italian variety and aren't imaginative or interesting at all.  Harsh, but everything just tastes like someone took some Prego, threw some dried basil in an called it a day.  Also, I think they should just shorten their name to Grotto and drop the \"Wine Bar\" because half the wines I wanted weren't even available.  I think a lot of Grotto's allure comes from being in Shaker Square and having a nice patio but the area offers much better options with better food and stocked wine fridges."}
{"text":"Delicioussss!!! Significant other and I started off with the scallops, a chard and a Pinot grigio, the waiter was Absolutely wonderful. Then we moved on to the ribeye entreé. 16 oz. of medium steak oh my goodness just scrumptious, my bf preferred slightly medium well and myself medium rare and surprisingly the steak was prepared so! The waiter really listened to our preferences, it was quite astounding. Anyway, we paired that with a Pinot noir which was the grotto's wine buyer's choice of the red that would pair with the steak. It was quite well matched. For dessert, we chose the mocha chocolate mousse which was great with their reisling, it really cleaned the palate after the steak and finished the dinner with 5 stars. I highly recommend this restaurant, particularly for people who are wine connoisseurs or completely new to wine, the waiter, Fred, was entirely Helpful and really pleasant throughout. =) Enjoy!"}
{"text":"A fantastic small-plate place! Wonderful atmosphere (live music on weekends), friendly staff, delicious food - I recommend the antipasto, the carpaccio, the tortellini, and the lamb chops. And the wine..., well there is plenty to choose from at Grotto, but they don't hold back their expert recommendations either, so you are safe either way :-)"}
{"text":"Service has always been great and the meatballs are absolutely amazing. The only flaw I can think of is that the sauce is a little watery. but other than that i think its a great adition to shaker square"}
{"text":"Grotto happened last night quite by accident due to a busy exit on I-90 downtown.  So, my plans to try something there changed and I asked TeleNav to take me to Shaker Square.  First, a compliment to Liana, the bartender.  She was handling the bar and a number of tables but was attentive to my needs throughout.  Don't ask for Gin cocktails from her though, as she'll admit!  That said, she recommended the 7 Artisan Petite Syrah, combined with a couple of appetizers:  duck and carpaccio.  Yes...I ate meat.  The blackberry fragelico glaze on the duck with the candied walnuts and goat cheese was unbelievable!  Yummm!  I can't say enough good about it, truly.  The carpaccio was good, fine, okay, and satisfying.  Her recommendations were well received.  That said, this is one of those restaurants that prints the FULL DETAIL on the customer copy of the receipt.  So, if you work for one of those companies that doesn't like to reimburse the alcohol portion of your expense report, you won't be able to squeeze by on this one folks.  I made a comment to the shift manager and she understood the perspective and had heard the complaint a few times before.  Apparently, someone at the top doesn't get it or doesn't care or has never been in such a position.  In any case, I'll be back.  But I'll have less to drink and therefore, they'll lower their revenues a tad.  Do Da Duck!  You'll be glad you did."}
{"text":"Valentines Day dinner...  Cozy and warm, sat at the bar for drinks before dinner. They were out of Dewars; apparently a casualty of eating in a WINE bar.  We had an antipasto plate at the bar that was wonderful...  The best part was the port wine cheddar.  Not much to look at but very creamy.  My wife and I shared a grilled salad and pizza for dinner.  Both were super.  We will definately be back."}
{"text":"Atmosphere: this place is nice for a small gathering. i came here with a friend just to catch up. the restaurant has a dim lighting and is a small restaurant with a really romantic atmosphere. i would definitely come back with a couple of friends for some nice dining experience.  Service: the waiters/waitresses are so friendly. once we came into the restaurant, they were really attentive and asked if we preferred tall stools or lower table seating. then they even asked if there was a corner or table that we'd want to be seated it. the entire service was awesome and speedy.   Foods Ordered: Duck Confit Sliders, Linguine with Clams, Gnocchi with Lobster Sauce  Food Quality: the duck confit sliders came with these chips dripped in truffle oil and probably the BEST chips i've ever had. my friend ordered the gnocchi with lobster sauce and even though i'm usually not a gnocchi fan, i must admit they have pretty tasty gnocchi, not to mention that the lobster sauce made the entire dish fabulous! the lobster sauce is probably one of the better ones i've ever had. however, i wasn't too big of a fan of the linguine with clam. I felt like the wine was a bit overpowering for the dish and didn't really bring out the flavors of the clam.  Overall, would I go back again? YES! I would be up for trying the other dishes they have there. I do wish they gave bigger portions for what I was paying though but still, a worthwhile place to try. I'm definitely becoming a shaker restaurant foodie fan."}
{"text":"This is really just 2.5 stars. I must have gone to a different Grotto than the rest of you. While it was just fine it was certainly nothing special. The food was ok: overcooked salmon, good burger, fair meatballs. Our service, however, was actually comical. It was not our servers fault. He had clearly never been trained (at all). He knew nothing about the menu, nothing about the bar. He was nice as could be but had to leave to ask for answers to any questions that were asked. The manager came by to ask how things were and we told him but it didn't really seem to have much impact. Also, they should really lose that tv in the dining room. This is not some sports bar. If someone that we are going out with wanted to go there that would be ok but otherwise I don't see us returning."}
{"text":"calamari = very good gnocchi = very very good! (i don't like gnocchi normally) risotto = too soft, mushy, no real flavor (i'm very picky about my risotto) polenta = meh. don't know that i would like polenta anywhere. servers = nice atmosphere = high chairs like bar stools, wood floors, somewhat small tables"}
{"text":"Came for the special Mother's Day brunch buffet created by Chef Fabio Salerno and what an experience!  Would've been a five-star, but a star off for the sort of awkward, almost absent-minded demeanor of the service.  But aside from that, it was almost too good to be true.  Pricing wasn't unreasonable, totaling $150 for 3 adults, 3 drinks ($8 mimosas and bloody marys), including 20% tip and 10% Yelp check-in discount (hooray!).  More lunch than breakfast, this buffet featured some of the best quality food--especially seafood and meat--I have come across in any restaurant, buffet-style or not.  Enormous bluepoint oysters on the half, succulent, perfectly-done prime rib carved in 1-inch slabs, juicy, thick-bodied shrimp cocktail served with a spicy cocktail sauce, a crepe station where crepes were cast before your eyes and onto your plate, topped with heavenly-rich whipped mascarpone and berries--just to name a few of my favorite selections.  And mind you, all of this was NEVERENDING.  It was hard not to feel as if I'd been thrown back in time to join some Greco-Roman bacchanal of epic proportions--if only the backed bar stools on which we were perched were velvet divans!  Going on my tenth oyster, under the disgusted gaze of my engorged fellow-diners, I moved a few centuries ahead to wonder if this was what lunch felt like to the average Madison Ave. executive on a work day...  The only hitch was the wait staff seemed somewhat at a loss, constantly rushing about yet hard to flag for basic requests like new glasses and restocking plates, despite the mere handful of customers present--there couldn't have been more than 6-7 tables occupied total.  We had the sense they weren't accustomed to the buffet set-up, but they were cheerful and obliging and seemed to try their best to attend to us.  Namecards for each dish would've been helpful at the buffet as well as no menu was provided, but we could always ask servers if we couldn't do a visual ID on a dish so that wasn't a huge issue.  If the Mother's Day buffet is any representation of Grotto's daily fare, I'll certainly be back.  The decor's a little cheesy--think Tuscan on a Target/Lowe's budget--but there's plenty of natural lighting and intimate nooks for any respectable lunch date/date night."}
{"text":"Got a flight of the Alsace wines on recommendation from our waiter.  Was ok, but I probably wouldn't get this flight again.   Also had some arancini and gnocchi.  The arancini (deep fried risotto balls stuffed with shrimp) tasted alright, but I also probably wouldn't get this again because it seemed to be missing some crucial flavor for me to feel like it was worth getting a second time.  The gnocchi had a good amount of lobster, and the sauce was great, but I thought the gnocchi itself to be a little too sticky for my tastes.   If you go with a large group, be aware that they don't allow separate checks, and they will charge you 20% tip."}
{"text":"I'm only commenting on the food since I don't know much about wine. I came for a friend's birthday.  When I sat down to read the menu, I was pleasantly surprised by the affordable prices, but in order to keep their prices decent, they skimped on portion size. The pasta dishes are Italian-sized portions (read: small). They were enough for my dinner (I'm a small Asian girl), but I had to supplement with bread and ice cream cake. So in the end, the small portion size allowed me to save room for cake. My male friends unfortunately were still hungry at the end of the meal.  I had the veal ravioli, which was recommended by our waiter. The dish was good for the most part, but the pancetta was waaaay too salty. I had to dampen the excess salt with more bread.   I tried some lobster gnocchi from a friend's dish, and that was much better. Still a little on the salty side, but edible and tasty.  Overall, be prepared for the small portions or don't come for dinner."}
{"text":"After finishing our shopping much earlier than we had anticipated, we ended up an hour early for our reservation at Grotto.  They were very happy to accommodate us, even though they were quite busy, which we really appreciated!  The interior is small, rustic and cozy - perfect for a wine bar!  Our food was really spectacular - we had a meatball appetizer that we both agreed were the best meatballs we had ever tasted!    What disappoints me slightly about this place, is that the menu isn't that large and they were out of the two items I was really interested in.  That's ok, it happens. It's hard to predict how many people are going to order something in a given night.  But, for a wine bar, the wine list was ALSO really small.  We were given a list of maybe 8 whites and 5 reds - no mention of half bottles, full bottles, flights.  Then, they were out of one of those selections! Come on! Most restaurants around town have more impressive wine lists and they don't call themselves wine bars!  The two wines that I had were good - but nothing out of the ordinary that I couldn't pick up at the grocery store.  Go here because it's charming and romantic, the service is great and the food is very tasty. Don't go here for the wine - unless you like paying the same price for a single glass as you could for an entire bottle."}
{"text":"I'm a fan of chill places like this. I had a great 2 hour conversation with my friend just chilling here, having some wine and appetisers (muscles and meatballs - really good and big portion of muscles!). There was really good live music - just one guy singing and playing on the acoustic guitar and keyboard. The real fire place in the back of the room gave the space a warm glow (and feeling!). The dark wood panelling and stone bar just added to the cool atmosphere. I will definitely keep this place in mind as somewhere to hang out. The wine I wanted even ended up being in stock which was a nice surprise because it was marked (by a dot sticker) as being out of stock on the menu. The waitress explained that the dot system had not been kept up to date lately since they were working without a hostess. Lack of a hostess, might explain why the OpenTable app would not connect to this place..."}
