{"text":"Food was okay, but sloppy practices ruin the experience. Usually Indian hakka caters to vegetarians and guddus even puts vegetarian dishes in green on the menu. Unfortunately when I got my Manchurian tofu home there was a giant piece of chicken in the mix. Gross. Luckily there was meat eaters around (who confirmed the obvious chicken) but come on! 

Hakka veggie noodles were average, pineapple veg fried rice was interesting, good quantity and not bad but more pineapple please. Manchurian tofu sauce was good but don't bread tofu, just deep fry it otherwise you end up with tofu with a slimy paste on it by the time you get home. Also there should not be chicken in this dish."}
{"text":"The food is great, however it feels like they are using the same spices for every dishes, the best thing is that it comes in big quantities, the price is fair, and their guest service is good, try their manchurians it's tasty. However, it's not a great place to eat, but you can order and eat at home or whatever. you must try it."}
{"text":"Amazing taste.. the quality is worth it.. Loved the noodles there.. thought have tried only Veg till now.. but loved it... will try non-veg stuff too..Heard a lot about chilli chicken here..."}
{"text":"Great food and awesome portions. On top of that, the prices are great too (very reasonable). 

It's not a place you would probably dine in, but given the quality of food, you can easily overlook that.  

We've been going here for ages now, and are never disappointed. I hope the quality keeps up, because we will keep coming back!"}
{"text":"We've eaten here many times. The prices and portions are very good. Certain dishes are great and others are just ok. The chilli chicken has too much gravy but there's a pineapple chicken dish that is delicious. The service is always friendly and restaurant always clean. It's definitely worth return visits if you're in the mood for Hakka."}
{"text":"Bad food quality and taste though potions are ok but not recommended... we ordered the food thrice the taste was deteriorating every time...Had a bad stomach after that..."}
{"text":"Love the Chicken Hakka Noodles, 1.00 drinks and lovely menu with various choices. I especially loved their vegetable spring rolls. The portion sizes and prices are reasonable in my opinion. One order of the noodles is enough to last me about 3 meals. However, the first time I stepped in there to order some food I was told they did not have any chicken spring rolls so that made me a little disappointed because I like chicken better then veggie when it comes to spring rolls. The first time I stepped in the man working there was very polite and even brought me out a big sample of chicken (I do not remember what kind). Friendly people working there. I have yet to try other choices on their menu because I am a new customer. Also love the free fortune cookies :). I will definitely be back to try more foods and definitely order the Chicken Hakka Noodles again. I also have yet to drop in for the lunch specials. Overall, so far I'm liking this place."}
{"text":"Love this place the food is alway fresh &  what I ordered & the flavors are amazing in everything that I've ever ordered"}
{"text":"This isn't authentic Hakka...the owners are Indian and the flavours don't sync up with what I'm generally used to. The food was more indian fused and it didn't have the kick you yearn for in Hakka.

Ordered Manchurian shrimp fried rice (they use basmati rice, the colour was not red as the usual), chili chicken (watery), Manchurian chicken (dry, not bad), and the Hakka special noodle with chicken and shrimp (not so special, noodles sucked, meat was cubed up and dry).

Overall, this was a womp womp womp story.  Giving it 3 stars because the food was edible and I didn't get the runs ...but definitely not worth it. Having explored authentic hakka restaurants such as Lin Garden and Fredericks in Scarborough, which easily put this place to shame, I will not be returning."}
{"text":"I recently moved to the Brampton North West area after living in the Brampton South East area. My usual Hakka spot was Hakka Flavours on Queen st. I was craving chili chicken one day and the drive to Hakka flavours was way too far. I opted to go to Guddu's and order their dry chili chicken. First of all, there was no rice included so you had to pay extra for that. I took mine as take out and when I got home, the chili chicken was very red in color (looked like sweet and sour chicken). I'm accustomed to chili chicken dishes looking more brown than red. I would have to say they use a lot of breading in their chicken which makes it VERY soggy and gross. I did not end up eating most of it. Costed almost $15 for a chili chicken and side of white rice. 

Will never return."}
{"text":"We wanted to eat Hakka in Brampton so we thought we would check this place out. The food was very food and the prices are reasonable. We were able to feed 5 ppl for less than 50 bucks!"}
{"text":"This place never disappoints. The best haka Chinese I have had in Canada. Keep it up guys!!"}
{"text":"This is very embarrassing to write. Could have met a near death experience. Ordered takeout on October 30th and to my shock, found a iron nail in my food. Adding to the horror was the situation that it was in my mouth. Could have choked on it but spit it out on time. Very shocking. Never will order again."}
{"text":"I've had Indian Chinese before, it's awesome. But this place is average nothing to write home about. 

I got noodles, fried rice, Manchurian, everything was o average, kinda same taste. 

I've had better Indian Chinese before. Won't go there again."}
{"text":"Great food,  huge portions and reasonably priced. 

Delicious, hot and spicy hakka Chinese.  I usually do take out as the seating capacity is limited."}
{"text":"Best lunch special deals 
Huge portions and yummy chicken 

But no soup they give you pop
And no beef at all
Great food
Owners are great
Staff need some work"}
{"text":"First time here today. It's a very small place. If every seat were to be taken, there's room for 14 guests. The place seems popular for takeout. A few folks came and gone during my time here. 
I love Hakka and found this place by accident driving by. I don't live too far, but never heard of the place and some of the reviews on here cautioned me. 
Now to my experience...being a big Fish Pakora ($10.75) fan, this is what I started with. I had the option of spicy and very spicy and ordered the very spicy version. I enjoyed it. The batter is very thin and doesn't take away from the flavor of the fish. 

Another of my favorite is the hot and sour soup, so I ordered their small Hot and Sour Chicken Soup ($4.75). It's not my most favorite I've ever had, but not far from the top either. I'd have this soup or recommend it to anyone. 

While I wasn't at all hungry anymore, I had to try their Chilli Chicken with fried rice ($8.75 including a 1$ Upgrade from steamed rice). Could not leave here without trying it. 
I wasn't overly thrilled by it, but it wasn't terrible either. The rice could have had a little more flavor to it and so could the Chilli sauce. 

Overall, id say I was pleased and will come back again."}
{"text":"I enjoy this place. More indian style chinese vs chinese style indian which is what I'm used to in hakka style food. 

The rice portions are large. The meat and fish portions are small.

Call ahead to order so that you don't have to wait."}
{"text":"Good take-out place. Dry Chili chicken is nice. Crispy shrimp was good too! Will definitely be back to try other menu items. I liked the chicken noodles the most. Fair price for the serving size."}
{"text":"Lunch specials are The Deal in the town...!!!

Call ahead atleast 15-20 mins depending upon the size and portion(s) of your order, and your order will be ready when you walk in to pick it up...

Ask for Mr. or Mrs. Guddu when ordering the next time, they're the nicest couple in the galaxy...!!!"}
{"text":"Chilli chicken wasn't too bad. Price wasn't too bad. In my opinion the fish/shrimp was the best."}
{"text":"Tried them during lunch special on a weekday. Their chilli shrimp with fried rice (upgrade for $1) was not something I would recommend. The rice was okay but the shrimp was not tasty at all. It was deep fried with gravy that was watery and had no taste of Chinese Hakka in it at all. It's usually nice and spicy too, but even the spice level was low and I am not sure why it was chilli shrimp to begin with. 

Try another Hakka place in the area and avoid this one!"}
{"text":"Checked Guddu's menu and was pleasantly surprised. Food was very good, the service was friendly and helpful. Definitely will be back."}
{"text":"Definitely one of my new go-to Hakka places in Brampton.

I had been told many a time to come check this place out. I was not disappointed.

I ordered some Chicken Pakoras and Dry Chilli Chicken. 

The Pakoras were some of my favourite. They were perfectly seasoned, and has just enough crunch to them. You won't break your jaws over them, and the chicken is tender. Some places I've been to, you really have to chew to get it down, but this place does it great. 

The Dry Chilli Chicken was great as well. I was a little overwhelmed by the amount of onions I got in my dish though. The chicken itself has been marinated and it boasts a lot of flavour. Pairs well with either rice (fried or steamed) or noodles.

I've heard their Chicken Biryani is some of the best. So I will definitely be back to try it.

Giving this place a 4/5 because for the price you pay, you're getting most of your money's worth. I think it's a little on the pricier side?  And as far as ambiance, there was none. It's a small place on Van Kirk, but there's no decor, there's a TV that is on CP24 the whole time. Considering it's catered to more of a South Asian crowd, I would have liked to have seen some sort of decor."}
{"text":"Best Hakka places in Brampton. I love their noodles especially their schezwan noodles. 
I prefer takeout as the ambience is that great."}
{"text":"Although the City of Brampton and Mississauga may have its share of Indian-Chinese ( Hakka) type places. There is something about Guddu's taste and flavour that can't be denied.

This place is very unassuming, your not staying here for dinner. In fact, initial impressions I got were that they weren't finished \" doing up\" the place. Regardless, I didn't come here for the decor. I came for the food.

The lunch specials are quite good, and during the lunch hour you will find people getting take-out, with the odd few sitting at what tables they do have.

My favorite food at this place bar none, is the Manchuarian Veggie. I have eaten at many Indian-chinese restaurants across the city, and let me tell you this item on the menu caught my by surprise. It was very fresh. They also have other excellent items such as the noodles, and of course chilli chicken.

I was told by a friend that this place serves indian-chinese the \" delhi\" way, coupled with the delhi flavour and taste. I must admit, I did taste a difference from other Indo-chinese places.

Nevertheless. The food here is very good. Again, don't plan an evening out with family to this place, but do get take-out."}
{"text":"Good all round Hakka Chinese cuisine.Have been here a couple of times and like the previous review mentioned, the decor and ambience aren't very appealing (Although, the TV keeps playing bollywood songs, if that will keep you entertained). That shows in their clientele (mostly take out than dine in). The food though is quite good. Can recommend the House special noodles & Chop suey (chow mein). Place gets busy. So, if you're ordering out, its best to call in advance and pick up."}
