{"text":"Paid 20 bucks for 10 small breaded mushrooms and 20 boneless wing nuggets. Really? Does that come with a reach around too?"}
{"text":"The food is good at best however they recently increased their prices and made the portions smaller, I used be able to leave there paying 5 dollars for a big salad, pizza that covered the plate and a pop. Now you get a very small bowl of lettuce, small slice of pizza and a pop for 6 dollars. I like the food but probably will not return due to the prices, not a good value."}
{"text":"I had the chicken parm with spaghetti and some meatballs. It smelled and tasted like a wet sock!  This was last chance I will give them. Heck I even went to pick up my food and the people working there were dirty then the food!  2 thumbs down"}
{"text":"Was hoping for a good slice and was majorly disappointed. Too thick, too soggy and flavor  BIG DISAPPOINTMENT"}
{"text":"Stopped in for dinner before catching a movie. Started with a salad with house Italian dressing and some monkey bread. The dipping sauce that came with the bread was delicious  as was the bread. I was dining with my boyfriend so we shared a supreme calzone and small chicken and broccoli white pizza. The pizza crust was excellent, not to thin or to thick. The calzone was phenomenal. There was food leftover to take home and enjoy later.  I'm sure we will be back here again."}
{"text":"I can't understand for the life of me why this place is rated so highly. I had an awful meal from here.  I got an italian sub with a side salad. Since I was getting delivery I also had to order boneless wings to meet the minimum. The sub was decent but it was mostly ham with hardly any pepperoni. My salad was wilted and brown and translucent towards the middle. The wings we disgusting. Absolutely grotesque. I paid 8 dollars for a puddle of oil and fat. No exaggeration when I opened the container there was like 6 pieces of gelatinous meat in an inch of oil. They had virtually no flavor. No garlic... no parm... just oil and fat.   Yet I paid $16 bucks for lunch. An inedible lunch of rotten lettuce and the exxon valdez of wings. So I called the manager to tell him how poor my meal was. He said \"yeah they are the greasiest thing you can order.\" Surely I know I wasn't ordering a lean cuisine but for them to be flavorless and fatty... yet costly. WTF. He apologized and said he has never had a complaint before. Offered no solution."}
{"text":"Great Pizza...Very good dough...home made on premises not your typical \"Shell\" Crust. Fresh toppings and friendly staff. Will go back here again in a heart beat."}
{"text":"Oh. Yum! We got the pizza roll and a brocolli, cheddar and chicken pizza and it was soooo good! The dough is obviously homemade, the sauce is fabulous, the pizza was just-mm! C'est magnifique! Very casual dining room and friendly prompt service, will definitely come again if we come to Cleveland again!"}
{"text":"I thought the prices were totally reasonable and the portions totally reasonable also. Had an Italian Sausage sub -my only complaint was that the bread fell apart at the bottom so I had to use a fork to eat it, otherwise, pretty good.  Everything was definitely delicious, though the boys I went with ordered a sandwich called the Big Volt - aka heart attack on a plate. I'll try and upload a photo of it. They both said it was good.. I have a hard time believing that.  They tried the pizza, on their sandwiches, but I'm not entirely able to comment on that. Service was also friendly."}
{"text":"Way, way, way, WAYYYYyy too expensive! $15 for a large cheese pizza? Out of control prices.  $1.75 - $2.00 for each additional pizza item! Really? This is a new high.    With 4,000 other pizza shops in the area, you had better get more competitive."}
{"text":"The pizza here is sometimes hit-or-miss. Over the last two times I've ordered pizza from this place it's been a Miss. The reason it's been a mess is not only when you get the pizza home the crust is soggy and oil drenched but it literally I've never had a pizza that I just simply couldn't eat reheated because of the sloppy mess it turned into. No I'm not sure if they made a change to their sauce in fact our pizza was a cheese only Pizza and thereby should have had no or little grease from any sort of meat like pepperoni or sausage. But the crust was exceptionally thin and floppy and it may have been a doe issue after all because it seems like the dough was allowed to rise properly. I enjoy a nice slice unfortunately the last couple pizzas I bought there really didn't seem worth the trip or the trouble to go out and pick one up."}
{"text":"Delicious!  If you haven't tried Guilin bonanzas pizzeria and you live near by then you are really missing out. It may not be a famous *insert style* pizza that you have had elsewhere but it's definitely better than the cheapo $5 large from the other guys."}
{"text":"Amazing service and great pizza I got 2 slices of pepperoni and as I am almost done she asked if I would be interested in another slice they were 2.50 each or 3 for 6 so I got It I spent 8.50 for lunch with a drink. preparation is simple the pizza spoke for itself oil and parmesan  sprinkled on the crust if you are in mentor OH it's with it"}
{"text":"I love their pizza! But last time I was there  the pizza had a different taste. Not sure if it was just an off night for them or their experimenting with new stuff. Hope next time is better."}
{"text":"Great food! Prices are very reasonable especially for the large portions they give you. Very quick delivery. My only complaint is the chunky sauce only because i am a picky eater."}
{"text":"Pretty good pizza and nice people! Docked one star because they have a special on Friday's where you're are supposed to get free cinnamon bites from 4pm to close with a $10 purchase. Got a medium Greek pizza for $12.99 and the time was 4:15. I even dined in too! Not disappointed but without getting the cinnamon bites that's basically offering false advertisement. Oh well. I'd probably go again! Will I actually? We shall see!"}
{"text":"Very good pizza - EXCELLENT SERVICE - Friendly and attentive staff.  Large meat's pizza (8 slices) was $21.00 - good but expensive.  Papa John's is around $11.00 for the exact same thing.  For me, it's great for date night - but not to feed my 18, 20 and 22 year old sons."}
{"text":"A quality pizza that is almost as good as their name sounds. The sauce is better than average and crust lovers are in for a treat as this pizza features a large well-done crust dusted with cheese and/or spices."}
{"text":"My girlfriend ordered a calzone and it was not fully cooked. The dough on the outside was golden brown but the inside was not cooked at all. She took it back and they would not give her money back only offered a store credit."}
{"text":"Sorry, but the pizza was mushy and doughy with a too thick crust.  It was tasteless as well.  Nice people work there ... very accommodating."}
{"text":"Great service and appearance was clean. My pizza came out in a timely manner however I only give it two stars. When I try a pizza place for the first time I always base it on my \"go to\" of pepperoni and sausage.   The pizza appearance was as expected however the taste was not. The dough was a little puffy and the sausage seemed much like the sauce, generic. A little zing of flavor in both could have made this a good pizza.   I've been up here for the last 8 Monday evenings and wanting to try this place. I was not impressed by the flavor."}
{"text":"This is a nice spot for take out or delivery. The pizza is excellent and the chicken and sandwiches are good. Nothing fancy just quality food. The only draw back is their pastas. Bland by our taste, we had to doctor ours up when we got home and started thinking, maybe we should've just made our own to begin with. I just got the volt. Nice way to sample a couple different items. Chicken tenders, mozz sticks between two pieces of pepperoni pizza, my wife was concerned I might have a heart attack but it was good."}
{"text":"My coworkers  turned me on to this place a couple wks ago...been addicted ever since!!!    Top notch pizza! Got the New Yorker w extra cheese, pepperoni & sausage....excellent excellent Excellent!! Did i say EXCELLENT?? Lol. Thanks guys, once again u totally rocked it out!!!"}
{"text":"Dinner with my girlfriend before catching a movie. There are a few tables and booths. As usual, we shared everything we ordered. We both started with a side salad with house dressing. Both were excellent. We had a supreme calzone and small chicken and broccoli white pizza. The food was great and there was plenty to share and take home for later."}
{"text":"Love the pizza and the monkey bread here! It's different from the normal pizzeria pizza"}
{"text":"Freakin' delicious. Had a coupon, got a large pepperoni and some hot garlic wings.  Wow. Big chunks of garlic, an amazing sauce, that soft NY style crust..good luck trying to eat 7.99 chain pizza after here."}
{"text":"Its a great little mom and pop shop alot better than a chain restaurant food was good I love there wings tasty pizza too"}
