{"text":"The name on yelp is wrong it called Shigatsu Fusion Japanese Sushi Lounge  Great fresh sushi & service!"}
{"text":"A great place for sushi-o-philes! I think that Gunkan is one of Calgary's best-kept secrets -   First and foremost the sushi is nicely presented and delicious. They have a wide variety of dishes that I haven't found other places including the yellow dragon roll that features scrumptious tempura shrimp, avocado, wrapped in mango...yum! I also recommend the gunkan roll, which is crab, avocado, roe, cucumber, and asparagus wrapped in salmon-- these people know what they're doing.  The only criticism I have is that the floor plan is completely open so it does get a little noisy if it's full. It's not exactly a place for an intimate dinner. Also the chairs aren't too comfy, however I have found the service to be friendly, consistent and fast. As far as price goes I usually go with a friend, order 3-4 rolls, and my average bill comes to 22 bucks give or take. Usually I leave Gunkan with that \"I wish I could eat more but I can't/ can somebody bring me some sweatpants please!!\" feeling."}
{"text":"What a great find!  My whole family loves Gunkan Sushi House!  We went a little early at about 11:10 a.m. and the staff just got into the restaurant.  They let us in eventhough they were supposed to open at 11:30 a.m.  What service!    The restaurant was fairly empty and 3 others came in after we did.    The restaurant and the restroom area was so clean.    We ordered the following:  Edamame - always gotta have my endamame!    BBQ Eel Pizza - Wonderful!  The crust is made of pan-fried sushi rice, then comes the sauce which is a spicy mayo with roe, shredded lettuce, diced red & yellow peppers and big pieces of BBQ Eel sitting ever so deliciously on all of the above-mentioned.  Lovely crunch of the rice \"crust\" and goes so well with all the toppings.  Salmon Sashimi - 3 orders of 5 pcs each = 15 pieces of pure salmon heaven!  Need I say more!  French Kiss Roll - The roll has avocado, cream cheese, crab, tempura shrimp, cucumber, roe.  Simply delicious.  Grilled Salmon Head - We had to order 2 of these.  The salmon head was split into two and grilled to perfection.  Part 2 of Salmon Heaven!  It was served with 2 slices of lemon and a little sauce dish of ponzu sauce.  Perfect accompaniment to our Salmon Heaven.   No fishiness at all.    The rest of the family ordered 3 bowls of Beef with Pork Bone Soup and Ramen.  The bowls were a fair size.  It's $2 more than the normal price of the udon/soba noodle soup.  The beef was so tender and nicely complimented the unique soup and ramen.    YES!  We will be back!  Exceptional customer service.  Free parking in front of the restaurant to boot!  Note:  Special Lunch - Tues to Thurs - Cash only  - Bento box with different selections  Happy Hour - Tues to Thurs 2 p.m. to 5 p.m. - Cash only - 10% off Sushi List  Happy Hour - Tues to Thurs 8 to 9:30 p.m. - Cash only - 20% off Sushi List"}
