{"text":"I'm really surprised at the poor reviews for this place. A few of them are so far off base it makes me question the reviewers motivations. I work in Charlotte and when I'm in the area I always try to grab lunch here.  If you like country cooking you'll love this place and the food is consistently good. When I commented to my waitress about the consistency she informed me then owner is the cook.  That explains it.  I've never been impressed with beef tips and thus rarely order them. With the overall quality of their food being so good I ventured out and tried the tips, the house special. Now it's my favorite!  Not sure where reviewer karby is coming from but her cherished \"13, 6 and 11\" is not only on par with but exceeds any other restaurant I've ever eaten at, specifically the tips and the fried squash. Their portions are large and the staff has always been friendly and efficient.  On the lighter side the chef salad was very good and almost more than I could finish. Keep in mind I'm a big guy with an equally big appetite.  As another reviewer mentioned, the owner comes out of the kitchen and talks to his patrons.  I like that he puts forth the effort and found him an interesting and intelligent fellow.  This review may sound too good to be legitimate but it is. I rarely review any establishment. My experience has to be extreme, good or bad, for me to put forth the effort. Judging from the number of regulars that frequent this place I know my experience is not the exception but rather the norm."}
{"text":"Used to be a regular for years, recently revisited after a 5 year absence. Glad to report that nothing had changed. The food is still outstanding, good old southern cooking, large portions, accompanied by good service and a large helping of Southern Hospitality, all at a reasonable price. If you want big screen tv's and sports bar atmosphere then go to Appleby's. if you want good food at a reasonable price then this is your place."}
{"text":"I love going here as I know each and every time what it is I like and want. They do not use pork in there vegetables nor lard in the making of the cornbread so that is a big plus for us. We usually get the ground sirloin steak with the pinto beans and collard greens. The steak comes smothered in mushroom gravy and I usually get diced onions in the pintos. They also offer dinner roll's but we always say \"nothing but cornbread\" as we love to crumble the hot fresh cornbread up in our pintos as well as the collard greens. We also like the idea that they have soft butter on the tables so it spreads easily and melts quickly in the cornbread which is also a great treat. The collard greens are fresh and cooked to perfection. I like mine with a little vinegar as well. Hope others will go and try this as well as other items. We like their fish, fried chicken and their Greek stuffed chicken is also a winner."}
{"text":"Started going here about two months ago and absolutely loved it! Its been good quality southern food, staff is very friendly. The owner even comes out of the kitchen to chat with yah. I hope everyone that left unhappy tries it again."}
{"text":"A friend of mine and I meet every week or two for lunch, and this is where we always go.  If you like good home-style southern food at very reasonable prices, this is the place.  If they served nothing else but the fried squash, I would come just for that.  All the veggies are great!"}
{"text":"Gus...oh, Gus. I've driven by you for years and always wondered...\"what-if\"? What-if I had extra time for lunch; what-if I drove by and it was actually open? Well, all these \"ifs\" were answered in a recent visit. Some places, the outside can be deceiving. Hmm...not this place, the outside matches the inside unfortunately. Sticky menu's, dirty tables, salty blah food, EEK! The waitress was REALLY NICE though and looked like a veteran of the place. The food (beef & rice w/potato side) was not worth finishing, and the initial order almost didn't occur."}
{"text":"Don't let the building fool you.  The best fried squash in Charlotte.  The fried chicken is made to order and is well worth the wait.  The kitchen is as clean or cleaner than most fancy places.  I've been going there for over 30 years."}
{"text":"It was so long ago, but I vividly remember how delicious their steak tips were. Fried squash and fried okra are also my favorite. And most of all, very reasonable price."}
{"text":"A cab driver recommended this place for burgers, I was surprised to see pizza on the menu, but unfortunately they recently discontinued making them.  The burger was very homemade, and they cook to temp.  It was very good quality, but not enough fat, or char on the outside to make it a favorite.  Still it's a great local spot with fast and friendly service."}
{"text":"Good southern home style cooking with an \"at home\" feel. The service is excellent and this place has been around for a very long time. My favorite is the vegetable plate with a side of corn bread it's very filling and priced very reasonable! The fried squash is an absolute must to try. This place isn't super fancy but worth a lunch visit!!"}
{"text":"I'm a little biased on this one being raised in a southern family who cooks food like this routinely. However, the food was good. I had beef tips which are served with peppers, onions, and rice. Lots of flavor. I got mac and cheese as my side and it was mediocre, typical southern baked mac and cheese. The cornbread was a little dry but the flavor was good. Apparently this place is owned by local farmers and most of the food served here is their produce. I will continue to eat here to support their cause and perhaps increase their number of stars depending on how my next meal goes there."}
{"text":"I'm from Charlotte and know the reason it has been in Charlotte for about 30 years - it's damn good comfort food at very good prices. I enjoyed  Gus's! Fantastic meatloaf with Great mac 'n cheese, GB's. My son loved the chicken steak with gravy. Service was good for the single waitress available. She was nice, and the owner was friendly as well. This is going to be my weekly go-to!"}
{"text":"Walked in and did not stay.  Very marginal sanitation score and every seat had torn leather.  I kept looking for a booth that had seats that were decent and not torn. There were NONE.  This place was just too gross to stay. The exterior is run down. The interior is worse. Could have had good food, but based on the appearances of everything else, I was not about to take a chance.  This is all too bad because I know this restaurant has been a Charlotte staple for a lot of decades.  The simple reality is that if the owners want to keep it open, they need to invest some money in some updates. And they need to get their sanitation score better.  Two thumbs DOWN.   Yuck."}
{"text":"had the misfortune to eat there last saturday.the restaurant was very dirty.we had to wipe off our own table.there was trash and food all over the floor.the menus were crusted with old food. there were two servers on duty but service was very slow.the servers spent most of their time complaining about the lack of work from other employees.will NOT waste my time going back."}
{"text":"I was staying over night in Charlotte about 2005. I was overwhelmed by how good the fried chicken was. Also love the fresh veggies. The sweet old lady asked me if it was OK that the greens were picked the day before. Lol are you kidding me. That was so fresh. Also had another fried veggie that was amazing. Watching the panthers made me think of the only time I was in Charlotte, and thanks to great food I did remember."}
{"text":"Dont visit for lunch! Sat for 20 minutes without menus and drink order taken. Tables were dirty and sticky"}
{"text":"It's a dump, no getting around that but I keep coming back because of food and service. Fried chicken is to die for and can't forget squash and banana pudding. Jess is the best and will always take care of you with the most awesome smile. I would give 5 stars if building was fixed up."}
{"text":"I can remember being in Gus's when I was too young to go to the restroom by myself.  It was a regular in my life as we lived on Commonwealth, so we'd eat at Gus's all the time and I'd get 13, 6 and 11 as those numbers meant beef tips, mashed potatoes and AMAZING fried squash.    I'm now 38 and still live very close by, but Gus's is SO not the same place that it once was.  The building is filthy, outside and inside.  The servers are sub-par and the food simply isn't worth eating...  I ride by twice a day and miss my beloved 13, 6 & 11.  HEY! - OWNER OF GUS'S!!!  PLEASE CALL GORDON RAMSEY TO COME GET GUS'S BACK ON IT'S FEET!!!  even if you don't give a damn about it anymore- we local's out here do still care and want to give you our money!  Please ask for the help you so clearly need."}
{"text":"It breaks my little heart to rate Gus's Sir Beef two stars - especially since the staff are very sweet and down to earth. But alas, my meal and overall impression of the place was sub par at best.  The place: It's an establishment. Gus's has been around for some time and it shows. It's an old school Southern diner esque, classic meat & three, etc. And that's completely fine by me, but the building is showing some major wear and the menus are a bit crusty and food laden. You only get one chance to make a first impression...  The staff: As mentioned, everyone here is kind and sweet. The kind of place where the server calls you \"hun\" and probably has for 30 years.   The food: Just not bueno for me. On Gus's menu, he purports that he uses only farm fresh veggies from his actual farm. Well, it didn't look like it in my \"crisp\" salad. My bowl of greens looked, and tasted, straight out of a mixed greens bag. And the lettuce was swimming in cool water with a touch of dressing. For my main lunch course I chose the cheese ravioli which came out crusted and baked with oodles of plastic-y cheese. The sauce tasted canned and the ravioli were essentially tasteless.   Needless to say, I left Gus's Sir Beef hungry and disappointed. I really wanted to like this classic lunch spot, but it fell very short of a winner for me."}
{"text":"This place has great food.  I love the chicken & dumplings.  I get white rice & northern beans with onions.  Too bad you can only get this only on Wednesdays."}
{"text":"Today was my first visit to Gus' SIR Beef. I've always driven by and noticed the awesome smells coming from there but never got the opportunity to drop in.   I'm going to start by saying that yes... yes the decor could use a little updating.  Ok now that this is out of the way, let me get to the food. Oh man... I had the shrimp, collards, and potato wedges, the shrimp were cooked to perfection, the collards tasted like they were cooked by my mother, and the potato wedges were crispy like i like them. Oh and I loved the biscuits, too. Needless, to say, it was top notch.   My waitress was sweet and very helpful. She made sure that our visit was positive. The only reason I am giving a 4 rather than a 5 is the decor. If you can look past this, you're in for a great meal."}
{"text":"I personally know the owner's of Gus'... I recently visited after hearing good thing about it. What I realized was that once Gus passed away and stopped growing and serving all of his own vegetables including the famous fried squash, it probably hasn't been the same. VERY SWEET people, genuine, and there is a desire to keep the family thing going. But in all reality the food was just not what it probably once was. If this was a local place in my city I would only go because I know and love the owners. Not for the food. I could see this place being a local legend while Gus was running the show. But for those looking for that legend, they will be pretty disappointed after visiting. Love the people, not so much the food."}
{"text":"Since Gus passed away, his son (or sons?) took over running this Charlotte landmark. It's the kind of place with regulars who have been going there for decades.   Other reviews mention old menus, but those were replaced some time in fall 2011. It's your basic, unpretentious diner with inexpensive food.  They've had a few problems with poor service, but the food has always been solid. It's home-style cooking with Greek and Italian dishes as well as classic American dishes. I particularly love the chicken tips, fried squash, field peas, sweet potatoes, Northern beans, collard greens, and the biscuits and cornbread."}
{"text":"The place looks very run down. In fact I would have never come in if it wasn't for the fact someone else brought me. As a matter of fact I have been by this place 100's of time and never looked twice. Speaking of I bet they loose a lot of business from folks like me who pass by and don't look twice. Once you are in the inside looks just as bad as outside. However, prices are reasonable, service is always friendly and food is fresh. I have been back several times since my first time and I am sure I will be back some more in the future. You might want to check your glass though as mines had lipstick on it once! Ewwww"}
{"text":"Great home cooking.  Prices are very reasonable.  The interior could use some love but who cares when the food is so great!?  Their fried squash is the best ever.  The chicken and dumplings on Wednesdays are amazing.  Service is friendly and efficient.  Love this place!"}
{"text":"Ate lunch here yesterday.       Pretty good food.   Would definitely eat here again.   Quick service.   Definitely could use an upgrade on decor."}
