{"text":"I went with work buddies and found the food to be great, and the service excellent! I even ended up with a free lunch because a small mess up on my order.  Here is the story: --------------------  I ordered the Original Combo because it all looked good. The Original Combo has the chicken, potato croquette, and octopus ball. Sounds like a lot, and it was, but it was a long walk to get there for us and so I figured I'd just try it all. No regrets! In any case, it was all delicious. But now I know I prefer the chicken for next time :)  This is how these guys shinned. I have a low salt diet, so asked to have all the sauces on the side. There was 5 of us and I was the only one to order a combo, while everyone else got the chicken. That meant my order was taking longer to get ready... like 5-10 minutes extra, I wasn't really keeping track. The cashier kept apologizing for how long it was taking. They had a few big order before mine he explained. I didn't mind as much because that meant my order would be fresh.  Anyways, 5 minutes after the other guys get their order, I get called over as my order was being assembled. I walk to the window and the cook suddenly yells: \"Oh no! I messed up!... You wanted the sauce on the side! I'm so sorry.\" Immediately, the other cook says to refund my money and redo the order! While the cashier refunded my money, the first cook got me the rice and chicken since it was ready with no sauce and said the rest will follow. But at least i could start eating. When I eventually got the rest, the cook apologized again for the mess up.   I think he was far more upset about it than I was. Now that's service!  And that's how I got a free lunch and found a nice place to eat on the same day."}
{"text":"Delicious! I tried this for the first time after hearing a lot of rave about it during the 5 year week special. Having high expectations, it definitely did not disappoint. For one whole week, they had a 5$ box special which was my go-to.  The monday I had the Mini Everything box. Mini Everything came with Takoyaki, Croquette and Chicken (one of everything). This is regularly $12. The Takoyaki was very delicious and came with more squid than other Takoyaki's that I've had. The Chicken (Karaage) was very good and the breading with the sauce really put it together for me. All of the boxes come with purple rice, shredded pickled ginger, and the sauce! I hope the portions are much larger for the regular price as I would not pay that much for the same portion that I got.   The Tuesday I had the Nan Ban Chicken box. This comes with 3 pieces of chicken and their Nan Ban sauce which was a lime-y mayo like sauce. Very good but can be too saucy for most people.   Personally, I would definitely just get the original chicken box as it's the most worth and you can definitely taste the flavour a lot more. Just watch out for lunch hour, the line could get pretty long."}
{"text":"Expensive, but taste very good, amazing taste, some MSG but is the quality one so it doesn't make you thirsty, we tried the combo with chicken and squid balls, potatoes, pretty much everything without the curry sauce. We also tried the green tea cheesecake, hands down 100% came from japan, it is a western style cheesecake with green tea (matcha) strongly infused. 5 stars as you can see."}
{"text":"Don't usually take to Yelp but visited Gushi at Union summer market today and had a terrible experience. I had previously tried the Gushi original chicken meal at the permanent Gushi outpost and enjoyed it immensely (it was piping hot and great value). What I got today was smaller, more expensive ($11 for 3 pieces) and came from a HEAT LAMP. How can a place that specializes in deep fried food not fry their items fresh?? Ridiculous. Not surprisingly, the chicken was limp, greasy and cold. Extremely disappointed as I had raved to my fiancé about Gushi before giving this joke of a meal to him for dinner today. Will not be returning as a customer."}
{"text":"The gushi chicken taste so yummy, juicy and crispy!"}
{"text":"Great, juicy Japanese fried chicken. Like other reviewers: the prices vary slightly than what is listed, but the original is fantastic and I'm waiting to try the others.  The only downsides were the rice we had was kind of cold and chunky; they were out of fries and the rice they gave us was not great. They also have odd hours and aren't open too regularly... but definitely a treat if you catch them when they're open! The chicken is perfectly crisped, juice, and literally feels like it just came out of the fryer."}
{"text":"I tried the Gushi Original Rice Meal with the chicken. I made it into a large for an extra $4.50 to share with a friend. It was enough for the both of us. The chicken was tasty as it was crispy and flavourful. The sauce was great too- complemented the chicken very well. They served it with pickled ginger too which helped cut through the richness of the sauce. However, I thought it wasn't worth the price- there was too much purple rice and not enough of the sauce and chicken."}
{"text":"Gushi is an amazing example of public space reclaimed for the right reasons. It operates out of a shipping container placed on the otherwise empty side of the Scadding Court community center. For only $3 you can get a delicious hotdog on rice, really flavourful. Definitely stop by here if you're nearby, it's worth trying and it's only $3!"}
{"text":"Great food! The Gushi chicken was crispy and delicious, and the accompanying rice, sekihan, very good -  almost as good as my mom's. The chicken seasoning and the sauce is to die for. Their menu includes nato - fermented soybeans, which is wonderful."}
{"text":"I ilke this place. They give out large portions and they're really friendly. Fried chicken plus poutine? Yes please. Hates when it's -15 out waiting for the food though."}
{"text":"I stopped by the 707 marketplace the other day for some snacks. I was intrigued with Gushi's deep fried hot dog on a stick, and it turned out to be a reasonable small meal for under $5. I was presented with a crispy battered, deep fried hot dog on a stick, a top a bed of rice, and drizzled with that winning soy/mayo combo that is traditionally used for okonomiyaki and takoyaki dishes. I had to fight to keep my partner from eating it all. I'll go back just for that dish.  The crepe place a few stalls down (Nomnomnom) served up a tasty and reasonably priced dessert."}
{"text":"EDIT:  They updated the amount of sauce and the sauce/veg/rice ratio - it is DIVINE. Like having heaven for dinner. Trying to stop myself from going back every day! (My pocketbook! Aaah!)  SO delicious!!  //  Love this place!  The one thing I can eat as a vegan is the veggie curry. They recently updated their menu so it's one size, but they used to have small for $5 and large for $7 or $8, can't remember. Now they just have one size which is kind of medium-ish for $7 and it's not the same! Way too much rice and not enough of the curry (which is super delish), at the end I was eating just rice by itself, which should never happen. More curry please! It is also garnished with obscure veggies, which are also amazingly yummy.  Friendly staff and I appreciate that they use cards (some of the stuff in market 707 only accepts cash). They recently updated their take-out containers to eco-friendly stuff and are no longer plastic.  It's an every now-and-then stop for me because I do sometimes crave that yummy curry!"}
{"text":"OMG, I'm so glad I discovered this hidden gem! I always order the Gushi original and it tastes better every time! They prepare to order and the chicken is always hot and moist and the purple rice is cooked perfectly! The spicy mayo is to die for so I always get extra! I definitely recommend this place to everyone!"}
{"text":"Nice people that make good food! Great octopus balls ...verrrrrrry good chicken and nice sweet rice. Enjoyed it big time and was worth the one hour walk."}
{"text":"I had the Gushi Chicken skewer and it was tender, moist, delicious dark meat. My only complaint is that $7 is too steep for 3 pieces of chicken on a stick."}
{"text":"Came here for lunch last week. No line, maybe just a few people who were waiting for their food ahead of me.   I got the original gushi chicken. It came with a bed of purple rice, some pickled vegetables and an aioli sauce. The chicken itself is not that good. Not what I had in mind for \"fried chicken\" since I like them very crispy and this wasn't crispy. But with the flavours of the rice and vegetables, they work very well together."}
{"text":"We came to Gushi as part of a Market 707 and Kensington eating spree - so we only got to try their takoyaki. The takoyaki had 6 pieces in an order.  It was pretty solid - a nice and crispy exterior with a warm and soft interior without being too mushy or gooey.   I am excited to try their other dishes the next time I visit Market 707!"}
{"text":"Gushi is excellent, on all counts. - as noted, karage is spot on delicious - the box with takoyaki, croquette and purple rice is filling and priced reasonably for a meal. The purple rice I was skeptical about - now no more. - Service is quick and friendly - when out of takoyaki one day, they gave me extra chicken.  In short, fast, relatively inexpensive, friendly and tasty. Gushi has become a regular habit of mine."}
{"text":"Ah-mazing. Ordered through Uber Eats and it was spectacular. Juicy chicken with spicy mayo with delicious purple rice. Thoroughly worth it, excited to try the rest of the menu!"}
{"text":"Typically the place I'd always go to for a quick Karaage fix! I tried it by chance when I was wandering around Kensington with some friends, we walked to the interesting shopping containers and the smell drew us in. I've tried each of the Karaage options they have available and I can't choose between which one I like! I would definitely recommend this place to anyone! It's a shame their Queen St location closed down (so much closer)!!"}
{"text":"I almost cried out tear of joy when I got the Gushi supreme lunch box at work. It was exactly how I pictured it in my head and more than what I expected.   As I walk in the elevator with my Gushi lunch, I could feel the envious glance from people, they were fantasizing what I am having for lunch. One of them couldn't contain it: that smells reeeeaaally good. I smiled back humbly. After I step out of the elevator I ran back to my desk. Yesssh, lunch time! Instantly, my cubicle was filled with this enticing aroma. I was gonna order their takoyaki and fried chicken, then I saw this great combo with everything I wanted in it:  potato croquette, fried chicken, purple rice and takoyaki! It was beautiful. The chicken were unbelievable juicy and well seasoned, tho the outside is not as crispy as most of other fried chicken. Did not taste that greasy which I like a lot(maybe the grease were absorbed by the rice already). The chicken taste pretty good even after 15min in delivery, the steam did not affect the taste much. The croquette and takoyaki were decent, but the takoyaki weren't garnished with bonito flakes which is no big deal to me. The rice tho! These purple rice were so soft and tender, they were probably my favorite thing in the meal, just because I love purple rice. Soft bed of rice cooked with the right amount of water and time is just so comforting(I suck at making purple rice btw). Pretty sure there's nothing special about the rice cooking, but the sauce and grease from the food made the rice tasted awesome. The only flaw of this meal was not enough spicy mayo, I will make sure to ask for extra next time. The portion was a lot for lunch, I might get the other smaller meal box instead.  I will definitely recommend Gushi to anyone who's interested in Japanese street food. For $11.5(excluding delivery) that was a very satisfying meal. I am already thinking about ordering again soon.     *Fyi, there are barely any restaurants or foodcourt near my workplace, ubereats is fancy."}
{"text":"Looking for Japanese street vendor food? Then look no further! Four words: This place is awesome! I had the liberty of trying this place during my lunch break; courtesy of my boss. Since then, I've been here twice! Gushi is one of those street vendors you would see at those Asian night markets. Out of all the street vendor foods I have tried in my life so far, this one is by far the best one ever! They also have bench tables for you to sit if you decide to eat there (outside). Let's talk about the food!  There are three categories of food: Meals, Snacks, and Sides/Dessert. The meals come in a portable box container. My top two favourite meals are the Gushi Original Meal for $6.86+tax and the Nanban Tetsuya Meal for $7.30+tax! If you're a first-time Gushi eater, I recommend the Gushi Original Meal. It comes with Gushi chicken, purple rice, sesame dressing, spicy mayo, pickled ginger, green onions, and nanami pepper. The Nanban Tetsuya Meal is recommended by the cook! It comes with Gushi chicken, purple rice, citrus vinegar sauce, aioli mayo, pickled onions, green onions, and nanami pepper. Other meals include the Japanese Curry Meal for $8.40+tax, Japanese Vegetable Curry Meal for $6.86+tax, Okonomiyaki Style Meal for $7.30+tax, Gushi Supreme Combo for $10.18+tax, and Gushi Curry Combo for $11.73+tax. All Meals have the option of Extras and Add-Ons such as ordering Extra Rice or Extra Chicken (2pcs) and adding a side/dessert such as Edamame, Green Tea Cheesecake or Mango Cheesecake. Extra Rice is $0.75, Extra Chicken (2pcs) is $2.50, and the Add-Ons are all $2.65.  I haven't tried the Snacks yet but based on the menu you can order Takoyaki (octopus balls, 6pcs) for $5.30+tax, Hotdog on Rice for $4.86+tax, and Gushi Chicken ($9+tax for 5pcs, $17+tax for 10pcs, or $30+tax for 17pcs). For the Sides/Dessert, you can get Edamame for $2.88+tax, Cheesecake for $2.88+tax, and Seaweed Salad for $2.65+tax.  I'm a huge fan of Gushi and I hope they expand all over Toronto! It's a bit far from my workplace considering I have to take the streetcar but definitely worth it!  Gushi is also in collaboration with Grabb so if you ever want to order take-out from your phone, don't hesitate to use the Grabb App!"}
{"text":"I discovered Gushi Japanese Street Food in 2016 at Union Summer located at Union Station. I was very happy to read that they were opening a food stall on Queen St. W. across the street ftom the CP24 building.  Today, I ordered the Nanban Everything Combo Meal for $14.50. The combo comes with 2 pieces of Gushi chicken, 3 pieces of takoyaki (octopus), 1 vegetable croquette on a bed of purple rice. Added was pickled onions, green onions, Japanese pepper and lettuce. Dressing added was garlic aioli, citrus vinaigrette.  If this is your first time at Gushi or first time eating Japanese street food, try or share one of the combo meals as you get to sample a little bit of everything Gushi makes. Of course, Gushi is best known for karaage, Japanese fried chicken.   I consider Gushi chicken my comfort food. Their chicken is fried made to order and does not have that greasy taste. Good for me because I can eat more Gushi chicken without my stomach regreting :-) The chicken is crispy with juicy meat. The purple rice is something I could see myself eating every day. Nice dressing for the salad.  Get the Gushi stamp card. Earn one stamp for every $10 spent. Ten stamps earns a free one."}
{"text":"Had the original gushi chicken at the regular stand. The service was good, they were super friendly and the wait was probably less than 10 minutes. The portions were pretty good, and even though I ate some of it later on the chicken was still crunchy, and the rice and sauce were on point. Would definitely come here again!"}
{"text":"I love this place.  Their Japanese fried chicken is extremely delicious. I ordered the original gushi with traditional purple rice and salad. The chicken was delicious, juicy on the inside and crisp on the outside. The salad really helped to balance out the fried quality of the meal. The only downside is they close fairly early (7PM) so it's a great place to grab lunch but is a little early for a dinner bite."}
{"text":"These are the same people who graced Market 707 up at Dunbat Community Centre (and they better return to Alex Park Pool). Nice people sincerely cooking up fantastic Japanese street food. Nothing overly fancy but you can almost taste the commitment to quality in their food. Served in a tidy takeout container, coated cardboard so the soy sauce floats around on the bottom. I've had the chicken a couple times and it is so good I can't seem to get myself to go back to their special featuring the purple rice. A five piece box of juicy morsels coated in a crunchy layer for 12 bucks? Truly a jewel of a stop on busy Queen Street.  They coat the chicken in a squirt of mayo when you order, which adds to the juiciness, but feel free to ask them to leave it off. The soy sauce goes great on it! I haven't asked for any other garnishes but I imagine they might have other goodies behind the counter. I call the place it's in, a loser mall, because everyone knows what I mean. Especially OCAD students as it's in their backyard. A little bit of heaven of a jerk spot is in the very back of the long empty dark and very dingy aisle, and before the smells of the Caribbean awaken your senses, is where the great Japanese god Gushi resides. There is a lot of nothingness going on here.. and with only the ding of uber eats going on in the din. That's when Gushi takes over! Remember to get a loyalty card, you're gonna use !!"}
{"text":"Authentic street vendor right outside Toronto Western Hospital on the southwest corner of Bathurst and Dundas. The Japanese staff are very courteous, and their fried chicken is most crispy and delicious. Try their Nanban Tetsuya bento for a great karaage experience on Toronto West streets. They also do deliveries for orders greater than 30$! If you work in an office (or in the hospital like I do), it's a great food to order for luncheons."}
{"text":"The Gushi chicken is undeniably a fantastic snack food, made to order and good flavour. Not the best fried chicken I've had but still delicious. They use dark meat so each bite is tender with a bit of melted fat.  There are two picnic tables out front.  Feeling lazy? Gushi is on JustEat and they do not charge any delivery fees, just have a minimum order of $15. Woot."}
{"text":"Great idea, street food from Japan, just outside the awesome gigantic pool at Scadding Court Community Center near Dundas and Bathurst. There's nothing like a swim in the sunshine to give you an appetite and Gushi is right there for an impulse snack on your way back out onto the streetcar. Served up in a cool portable package, just like in Japan, a craft paper box with printed logo along with good quality Japanese disposable chopsticks, and the chicken is crunchy good, smothered in some tasty toppings like shredded ginger, ymmmy! It's all on top of a bed of red rice which is tasty as well.. so go for a swim and grab a box of Gushi chicken to eat while you watch the world go by sitting on Dundas at a picnic table. $7."}
{"text":"- great karaage (japanese fried chicken) in a city that is ramen overloaded and obsessed. - have had the original many times, and just tried the poutine style today. amazing. - gushi is a great place to stop by if you're in the area, or better yet, see if you can catch them at the many food events they cater at. (https://www.facebook.com/gushitoronto) - only downside to the 707 market is that there isn't really a spot to stop and pull over if you want to grab a bite."}
{"text":"Juicy, Crispy, Succulent Japanese Fried Chicken at it's finest.  My mouth was dripping with chicken juices after a single bite WOW! I would never expected such a hidden gem. The only reason why I knocked off a star was because it was too tiring for me to eat.  I ordered the Large Nanban Rice.   Gushi Chicken (Karaage) 6/5* Redirect to first line.  Nanban Sauce 2/5* There just was not enough sauce :/ I picked Nanban for a reason because of it's refreshing taste to help relieve the grease from the chicken and there was only a little poured onto 1 karaage  Nanban Mayo 3.5/5* It was really good actually I loved the mayo but there was just so much of it and plus it didnt come in a seperate container so it was just all over 1 Fried Chicken piece and 1/3 of my rice which made it really hard to finish my rice.  Rice 3/5* I wanted to like the rice but it was mixed with sushi vinegar I believe and so the rice puffed up and sticky so it was harder to continue eating such filling and dense textures ontop of the grease and fat. I like the idea that they put black and brown korean rice in it but the way the rice was thicker because of additional seasoning made me kinda grossed out by the end of the meal.  Overall I will definately come back to try their other options because I just simply love how they do their chicken. Top quality Karaage here guys!"}
{"text":"The new chicken here is AMAZING!!!   The staff are super friendly and the market itself is a fun concept. I hope to see more of this here in Toronto. I will defiantly be visiting when the weather gets better, as this place is great place to drop by for lunch or an evening snack."}
{"text":"They seem to use prefried chicken now, much less juicy than the original shop, quite disappointed. It used to be fresh fried and it was alway good. Now it is a lot drier and kinda overlooked."}
{"text":"Dropped by Gushi at the Queen street market for their $5 anniversary special.  Compared to the one on dundas, this one's indoors, which is a plus because I would much rather have a nice meal inside an air-conditioned building than standing out in the elements.  They accept credit card, so they punched in the number on the machine and handed it to me, then went back to the kitchen to prepare food. I stood there for a few seconds looking at the machine thinking it would automatically progress to the next screen as there were no on-screen instructions, but eventually I decided to try pressing OK and it moved on. They offer tip for 15%, 20%, and 25%, and then manual input. So if you're looking to not tip, you'll have to work for it.  I ordered the regular original chicken meal, and it was filled quite slowly. There was someone else ahead of me, that got impatient and had asked whether his meal will be ready soon. It took about 10 minutes before the box came out! Mostly waiting for the chicken. Well, it's a nice AC'd building with workbenches in the middle so you have something to lean against while you're staring at your phone or talking to a buddy who's also waiting for food.  It was definitely worth the wait though. All the pieces were nice and hot. The batter was very thin and slightly crisped. The chicken was very tender and juicy. The purple rice goes well with the chicken, and the pickles were alright.  While the meal itself was somewhat filling, I did pay half-price for it. At regular price, it's not that much chicken! Only 3 pieces, not particularly large either. It looks like the amount of chicken has also gone down from before based on reviews. Regular price you're looking at $9 for a regular, and $4.50 to upgrade to a large (which comes with another 2 pieces).  Their 5-year anniversary special meals also come with less meat. Is it because you're paying less than half-price? For example, the everything box only came with one of each item. If one were to expect to get a \"regular\" item during the special, they might leave with a poor impression."}
{"text":"I ordered the takoyaki and chicken karaage they are both really tasty. I especially love he chicken very crispy and juicy. However it is a bit pricy for the amount they give you."}
{"text":"Avoid new location. Unless you really like waiting, and then waiting, and more waiting. Oh but I know what some of you are thinking: \"This dumb dumb didn't use ritual to 'Skip the line'.\" Oooh I did use the mighty Ritual on several occasions with this place and ffs how is the waiting that bad when I order at non peak hours?! No acknowledgements or status updates from staff. I've gotten better service from understaffed McDonalds. Even when a line starts piling up, the staff simply ignore you.   The sad thing for me is, its not just the wait.   With this great new staff, I have also had three instances where I have had missing items from my order. The chicken itself is still good, when they don't rush the preparation.   DON'T go to the Queen Street location, it is really really poorly managed and even if you order ahead through an app you might have a headache in the waiting line. Get Jerk chicken next to them instead. Or at least try not to go during peak hours."}
{"text":"its going downhill....... order 3 large gushi originals. they have since raised the prices. the rice is still starchy AF and the service and charm are no longer there. Good bye gushi. you will be missed"}
{"text":"When I first went here, I had zero expectations. I was pretty hungry and needed to get to work, thought I should try this place as I have passed by their A frame sign at least twice a day as this is between work and my parking spot.   I was totally impressed with the flavour explosion! I don't like spicy so the guy recommended for me to try the Nanban. It was delicious! I do believe that purple rice is Korean, but hey, we won't get into the strife between Korea and Japan... the Nanban was soooooo flavourful! Great balance of garlic and that pickled stuff, loved the creamy mayo and the warmth the dish just adds to your tummy on a cold winter day! What great comfort food! I've bought lunch for my staff and they have gotten hooked as well!  Sorry, no pic as I keep on forgetting to take one because I eat it all by the time I remember that I need to take a pic... I'll try again next time!"}
{"text":"Umai! I think this is amazing, and worth a walk to get to. Its unusually good, you've never had this before - its really worth it.  I recommend the original chicken, but nanban is also good. I thought the curry was unappealing and I've never had their takoyaki. I think this is a real gem of a find!"}
{"text":"Tried this place for the first time yesterday. My better half and I ordered the original, japanese curry, and the deep fried hot dogs. I loved the original the best because you can really taste the gushi chicken that way. The japanese curry was also good, but the curry hides the taste of the gushi chicken. As for the hot dogs, I think it tastes like corn dogs. The breading was sweet so it reminded me a lot of corn dogs.  Our problem was that there were really no parking spots, but I'm sure I will still be back!"}
{"text":"Unfortunately, I'm not on the Gushi bandwagon.  I recently moved offices near this kiosk and decided to give it a try since the $5 anniversary promotion was occurring.    It is located in the food market next to Jerk Joint, so with a roof over your head, you're eating in a cleaner and shaded place compared to the Dundas branch, which only has outdoor benches on a rundown path.    The service is quite quick for freshly made chicken: you wait about 5 minutes.  I ordered the original and the nanban boxes here.  Both boxes came with purple rice, radishes, and three pieces of fried chicken (regular sized box). What makes the nanban box different are the pan-fried onion slices and the white sauce (I forgot the name, but it tasted like ranch and tartar sauce).  The rice sometimes had harder chunks, so it suggested that it wasn't freshly made rice.  Also, the box was mainly stuffed with rice and there are no rice substitutions here like a salad. I would call it quits for the carb-conscious. The chicken was another problem.  My bf found the chicken to be of low quality and I found the breading to be too thick, though smothering it in sauce did help to make the chicken skin more palatable.  The nanban sauce, with its strongly flavoured sauce and soft onion slices, was the best box out of the three I tried in total from Gushi (I tried the Japanese curry box at the Dundas branch). However, at five dollars a pop, I still don't think I will be returning because of the non-existence of substitutions for the rice, the lack of vegetables, and the thicker breading."}
{"text":"My friend found this place on yelp, a street vendor that sold karage chicken, the Japanese style of fried chicken. When we found the place it was 3 minutes after it was suppose to close. The one staff running the vendor at late hours decided to let us purchase some chicken, extremely glad that she did.   The crispy declicious chicken was one of the best fried chicken I ever had. The outside was fried to perfection. The seasoning and taste was on point. Will do definitely get this again next time I visit Toronto."}
{"text":"This place has probably the best karaage I've ever tasted. We got the large gushi rice with karaage for around $15. Albeit quite expensive, it's street food so it's always more pricy. The karaage is crispy, tender and tastes even better with the mayo. The purple rice was unique and a bit more on the mushy side.   The service was nice and if you spend more than $10 at a time, you get a stamp and 10 stamps = 1 free regular size dish. Overall, I'm glad I tried this place and I'd love to try their other menu items."}
{"text":"A great selection of traditional Japanese dishes with a bit of a fusion twist.  Gushi is one of those places you head to when you want to shake up your routine.  That said, the quality of the food can be dodgy, touching on what Zao and Joanne mentioned, there is an underlying issue of consistency with this place.  Gushi has a lot of potential, especially within the Japanese cuisine spectrum that is terribly saturated with izakayas and ramen spots, to come out as one of the top dogs; It's honestly just a matter of quality control."}
{"text":"The Gushi Chicken is their way of bringing light to a dark fried chicken world. During a time when restaurants corn meal coat chicken legs and request $14, places like Gushi offer a more affordable and deboned version.  Karaage on rice, simple and sweet. Crispy, tasty and great with a Wasabi Caesar salad and matcha green tea cheesecake for afterwards. $12 later, you leave feeling full and satisfied with some change left for later. Not bad for a full meal, especially in the summer when you're able enjoy the weather and eat street side.     The menu is seasonal and ever changing, so visit ever so often to see whats new."}
{"text":"Very consistent and generous portions. It's very heavy so I usually just eat half and snack on the rest later on. Love the croquettes."}
{"text":"Fun fact: I walked 20 minutes in the cold for the Gushi original box. And it was totally worth it.  Gushi is located on Dundas next to a bunch of other street vendors. There are a few tables, but it mostly seems like the kind of place where you grab your food and go. The set up seems perfect for a summer afternoon with friends. Not quite ideal for winter and snow, but I won't let that stop me! I definitely plan on going back and trying out more items on the menu.   Although I might order for delivery next time instead of walking in the snow ;)"}
{"text":"Tried Gushi at a vendor booth at the Japanese Cultural Festival and it was really yummy! The purple rice was super sticky and the karage was ON POINT and super flavourful. However it was overpriced for what it was... $10 for a small box of chicken and rice?! However, not sure if their normal prices at their store are like that."}
{"text":"??????, ????? - Pre-coated Kaarage - Crispy Juicy Flavourful - Deep Fried upon Order - Gushi Street Vendor - Next to Try: Teriyaki"}
{"text":"I got the 3 pieces of Gushi original with rice.  A little spicy but not over powering.  The Japanese pickles is a nice touch and the purple rice has a special flavor which goes well with the chicken.  I would definitely go back for more.  It's absolutely delicious."}
{"text":"Absolutely love the Japanese fried chicken! Juicy, savory, and delicious on top of purple rice. Does not disappoint. A must have!"}
{"text":"I was part of a friend's birthday food tour and this was stop 3 of 6.  First time trying Japanese style street food and I always liked karaage.  Never been to the mini-stalls by Bathurst and Dundas before so I was surprized by the diversity of choice offered.  I eventually settled for the original Gushi chicken meal with the spicy mayo and sesame vinaigrette.  The karaage was fried nicely with the batter a golden brown on the outside (although I wish it was a wee bit crispier) while the chicken nugget inside was kept juicy and moist.  It went well with the spicy mayo that was drizzled on top to give it some kick.  My only niggle with this meal was the purple rice.  It was warm but kinda packed down into the box but lacked any seasoning."}
{"text":"Ordered their original chicken with rice as well as their Nanban chicken with rice.  Decided later to also add in takoyaki to the order.  The girl who was working there however, (not sure if it is part of worker training) I tend to watch those preparing my food with a certain attention. Throughout the whole time she was preparing our food she did not wear any gloves. I also noticed that she moved a dirty garbage bin and a dirty bin underneath it after to grab paper but did not wash her hands (nor did she wash her hands before preparing our food prior either). She used her hands to grab scallions/takoyaki toppings etc (at least could have used chopsticks or tongs). It kind of did not sit well with me, it was just not proper hygienic food handling. I am not trying to discourage anyone from trying their food however just noting what I saw. I'm just going to assume that her hands were clean to keep myself from over thinking.    Their food took a bit to prepare but the girl was very nice and we got it to go. The Nanban was the best in my opinion. It had the most flavour as well as the rice was a nice change (purple/red grain rice). The Takoyaki was taken out from the freezer and clearly bought from the asian grocery store due to the packaging. It wasn't worth the price, have had better. I would definitely come back for their chicken & rice but walk away when they prepare it (not hating)."}
{"text":"Here's the thing. The chicken was quite tasty. However, I cannot figure out how to justify the price. At all. This was stop 2 on our downtown food trip, and the three of us (one of my friends left after Old School) decided to order a chicken skewer ($6.50) to share. Yes, we could have ordered a lunch box, but we were trying to hit up as many restaurants as possible, so we opted to skip the unnecessary carbs. In hindsight, that was probably a mistake. Our chicken skewer (yes, that's one chicken skewer for $6.50) had two pieces of chicken slightly larger than golf balls, and two pieces that made up about the same amount of meat as one of the two others. Essentially, that meant it was $2 and a bit for each golf-ball sized chicken chunk. While the chicken was juicy on the inside and crispy on the outside, and while it was made fresh to order, this was still street food. Street food is supposed to be cheap. I have had chicken karaage at sit down restaurants that was cheaper than Gushi. At least those are sit down places that serve to my table and clean up after me. Here, I have to pick up my order, sit at a picnic table if I want to eat nearby (or I can stand), and I clean up after myself.   Most of my reviews focus on how much value I believe I am receiving for my money, and Gushi just wasn't up to snuff."}
{"text":"The fried chicken is to die for.  One of the best things I've ever eaten.  It was tender and delicious, but not greasy at all. And it was gluten-free and not cross contaminated with the non-gluten free items on the menu!"}
{"text":"I went to Union Summer Market and saw this Japanese food stand. There were 3 categories on their menu. The first two both had purple rice. I wanted to get the one with the purple rice and I was told there was no purple rice, I could only order the snack sized food. You were not even prepared, which means you didn't care! I think I was correct, because all your employees were on the phones and a white guy who is also your employee just walked around all over the place. Don't you get work to do?! Anyways I still got the chicken skewer thing and it was so overpriced. The chicken was cold and not crispy at all. Overall it was a huge disappointment, and mostly it was just their \"I don't give a shit\" attitude!"}
{"text":"Went here for lunch and enjoyed it.  I got the gushi chicken bowl. I might return to try the croquette next time.  It's not amazing but worth a try.  Food: 3/5, it is four deep fried pieces of dark meat chicken on a bed of wild rice. It was a bit greasy but relatively tasty.  Service: 2/5, a little slow for what it is.  The server was courteous but I'd say the wait was 10+ minutes.  Ambience: 2/5, not much as the food court aisle is really decrepit with only three vendors left. Hopefully , this places livens up more soon.  Price: $9 for the meal, I'd say it is a bit on the high end for what you get which is a simple chicken and rice dish."}
{"text":"I've tried the street food here on various occasions and simply loved their chicken!! This time I ordered through Foodora. I ordered the nanban meal which has purple rice, some veggies and 3 pieces of their gushi chicken with mayo for $10. I definitely loved their chicken as usual as it was delicious, crispy and quite flavorful. I also ordered the takoyaki balls for $7 in which you get about 5 balls. It was delicious but a tad pricey at that price. I ordered the cheesecake for $3 and it's like a bite size but was quite good. Anything with their Gushi chicken in their meal is totally worth ordering. I've been to their street food vendor along Dundas before and the staff are always smiling and super friendly. I loved their positivity and happiness in making good food for their customers. I highly recommend you try this place."}
{"text":"I had Gushi's infamous karaage at the Christmas Market last holiday and have been longing to visit since then. Incredibly tender and juicy yet crispy fried chicken with creamy spicy mayo. I haven't had anything like it and proclaimed it the best karaage (or fried chicken for that matter) I have ever had. It was straight out of the fryer and couldn't be any better. I wish I had the same experience this time but that's partly on me.  We went with the takoyaki and karaage meal boxes ($8.50 for each), which came with 6 takoyaki and just 3 pieces of karaage :( on a bed of purple rice and pickled vegetables drizzled with spicy mayo and dressing.   The biggest problem with gushi is the value I suppose, the boxes were fairly small and I felt they could have given more. 6 takoyaki balls is fine, but perhaps more rice and and more karaage. There was only one chef preparing the food and I felt it could have been a bit faster as well. We had to wait 15-20 mins which is quite long for some street food. Because of that, we couldn't enjoy the meals on site and had to take it to the ball game and eat it there. The foodie in me was thinking about the poor food the entire time walking to the Rogers Centre. We ate the meals 45 minutes after preparation and as expected, it was sort of soggy. I am sure you can see the condensation on the side of the box in my photos. But regardless, I still really enjoyed my chicken and takoyaki. I just wish I had them when they were fresh.   The purple rice was fantastic and nutty, it complimented the takoyaki and karaage far better than normal plain white rice would have. The winner is in the spicy mayo and sesame dressing. Everything worked so well together; sweet, creamy, with a hint of spicy and freshness from the green onions. I won't comment on how the takoyaki and karaage tasted as it's not intended to be consumed in the same manner how I ate it. The karaage was definitely better than the takoyaki however. All I can say, is that enjoyed it and will certainly be back to have some more of this great fried chicken."}
{"text":"Not sure which location we catered from but i unfortunately picked the Takoyaki box from a whole bunch.   Takoyaki was really doughy to the point of almost like a bread and needs a more tangy sauce.   Not sure what the concept is as a boxed lunch...it's served with rice...that's 97% dough, 3% imperceptible octopus bits to be served with rice.  That like making a kaiser sandwhich with french bread in the middle.   I never tried their food fresh, but integrity of the fare should be considered for delivery.  Perhaps the other menu items are better, but just judging based on what I had....sorry, 2 thumbs down."}
{"text":"On a summer day its great to sit outside on the communal picnic tables, it has a really great community feeling to it. The staff usually 2 girls are nice the few times I went.  Their deep fried hot dog is junk food goodness. Panko crusted, with spicy mayo and scallions on top - Cant really go wrong with that. Their fried chicken skewers are the best though, large meaty chunks that come our really crispy and hot, its a must get!  I also tried their curry with fried chicken - the cripsyness is completely gone and drowned by the curry. The curry did have good flavour but felt a bit box like. It came with little diced vegetables and purple rice. A large box is $12 with 6 pcs of chicken, its not bad but not great either."}
{"text":"Of the two locations this one on Queen Street seems to be more consistent in quantity, quality and presentation.  Chicken is still tasty, rice has the right amount of bite.  Service fast and friendly."}
{"text":"Dropped by for an early weekend lunch. We had the Nanban Tetsuya. Nice presentation, good range of flavours and textures.  Decided to go with the 'octopus' balls rather than the chicken. It was ok but didn't blow me over - shoulda gone with the traditional chicken. Next time!  Friendly and helpful service. Will definitely try it again   3 1/2 stars for now but I bet when I get around to having the chicken it'll be an easy four stars.   Update 7/30  Gushi has a booth at the summer Union food market.  Finally got around to having the Gushi Chicken. It was delicious!  I REALLY love the purple rice that accompanies the 'gushi'.  Overall great flavours and textures make for a satisfying street food.   Update 10/14  Lately there is an inconsistency in food and presentation. On one visit the portion of chicken was less than usual, on another visit the purple rice was barely purple yet other times it was much more colourful.  Yet another visit the rice was was definitely underdone/reheated making for a hard brick of starch at the bottom of the container. Sometimes the chicken coating is overly thick, other times thin. It's a shame things have gotten sloppy because I do love my karaage chicken!  2 1/2 stars for now."}
{"text":"I love Gushi's karaage chicken. The owner Shinji is a super nice guy. It's a go-to place if you are a little hungry and don't want to spend a lot of money.  Overall, I love this place!!"}
{"text":"Finally decided to try this place by work.  I've read some reviews and it seemed quite promising.  This place is located at the Scaddington Court Street Food Court. I was really craving some Japanese fast food.   I really wanted to love it.  So here it is:    Service:  5 star.  The order taker was excellent.    Right away he asked if this was my first time there and it was.  He then gave me a run down of what he thought is best for me to try.  He explained it in detail and it really sounded good.  They took debit and that was even better.  He then told me it'll take 5-10min as they make everything fresh.  you can see them making it and they were efficient and clean and looked liked they really enjoyed what they were doing.  Food:  I ordered The Japanese fried chicken with purple rice and a side order of snack size takoyaki.  It came to just over $16w/tax.  As I said, I really wanted to love it.  it was fresh yes this is true but it was all bland.  It needed salt and a bit of it.  Everything was so rich.  The fried chicken was moist but bland and frankly got a bit soggy add the Japanese mayo also rich.  The purple rice was rich then Japanese style slaw was also mayo based.  Everything was so rich.  I think it just needed an acid to cut thru some of the richness/grease and of course needed salt.  I honestly didn't feel good after the meal.  Ironically, not because the portion was so big because it was considerably small for the price I paid but because it just felt really heavy due to the richness.  Outside of the great service, I say I really wanted to like it because the presentation was quite nice.  It looked appetizing until you actually have it.  I'm sure I'll give it another chance but maybe I'll ask them for some salt or soy sauce.  Although, for the price that I paid, for lunch of all times I would say I was rather disappointed."}
{"text":"See our full video review and how it's made here: https://youtu.be/3-lb-IULZwg Their Nanban everything is a good place to start. It gives you fish, chicken croquettes and purple (black) rice. Their chicken is tender and juicy, the croquettes are crispy outside and soft inside. In short it's delicious. Split one for a snack or take a full one on for a meal. The owner is also awesome. Enjoy your food."}
{"text":"Definitely Fei Jai Approved! Had the Original Chicken and Japanese Curry on Purple rice and it was definitely a delight! Will order again!"}
{"text":"I heard about this place from a friend, honestly one of the best dishes I've had in a long time, and I'm really picky, I don't use the word \"best\" that often, but it is earned. The dish was called Nanban, every bit just burst with flavor and taste, definitely a must try. My goal is to try every dish on the menu this week and I recommend you do the same! Prices are also fare and affordable."}
{"text":"It's nice and I like the idea of purple rice.  But you need to know a few things...  The chicken is not fried fresh when you get there.  They have pre-cooked pieces and they just re-heat them in the oil when you order.  Taxes are included from what is shown.  Portion is a bit small considering the price.  It'd be nice if you got more rice.  It's really good though, I will say that.  Big bonus: They have a stamp card!  Buy 10 and get one free!"}
{"text":"Came here for their 5 year anniversary special.  They had a different $5 dish for 5 days.  Was able to try the everything dish,  Japanese gushi chicken dish and original gushi dish.  Favourite was the original dish which included 3 pieces of chicken, house sauce and rice.  The chicken was very crispy, well spiced and meat was moist.  Was able to try the takoyaki and they were the best I've had.  It had a nice squid flavour to them and texture was good."}
{"text":"Saw the highly-rated reviews so went to try it out. Ordered the Gushi Chicken Box 5 pieces for $9.  Order comes with spicy mayo and soy sauce. Chicken was juicy and flavourful.  The sauces did nothing to improve it.  There's nothing spectacular about it and not worth the hype.  Pretty hard to mess up fried chicken using dark meat.  Came to check out the hype. But honestly I would not come back.  $9 for 5 small pieces of average chicken? It was a bit too much.  Overpriced basic fried chicken. Hence the two stars."}
{"text":"This place is amazing!!!! Their fried chicken is soo good. The other day I got the rice combo which came with 3 pieces of chicken and purple rice. DELICIOUS!!! I can't describe it. It's super crispy but also super juicy. They drizzle the chicken with all these sauces (like mayonnaise) and it BLOWS MY MIND.   I was so excited to eat it I forgot to take a picture but fear not, I'll be back for sure!!!!!!!!!!!"}
{"text":"Very overpriced for a food court and the quality of the food you are getting.  They also ask for tips in a take out only place. Ridiculous."}
{"text":"Food was edible...but that's about it. I had very high hopes for this food stand based on Yelp reviews, and I ordered the fried chicken as well as the fried hot dog. The hot dog was okay...could have used some more mayonnaise and had a bit of an odd aftertaste, but it was fine. The rice, however, was bitter, slightly crunchy, and had a very unpleasant aftertaste. The chicken was also very tough, and some parts were nearly impossible to chew. Overall this was a very disappointing experience and I wouldn't return."}
{"text":"The good: imo they have the best karaage in Toronto. They have many different flavours, but I usually go for their Gushi original. It's very juicy and full of flavour, but...  The bad: I guess the only downside is that you really have to eat it fast (even though they are more known to be a takeout food). The chicken does get soggy fast and I feel it affects the taste and the crunchiness that a karaage should have.  The ugly: none that I know of.  Neutral: I know they recently opened up a new location in the queen west area (which is easier for me to get to). The original location has outdoor seating, but extremely limited."}
{"text":"Stumbled upon some photos of juicy fried chicken on Instagram; it was love at first sight. I logged into Yelp to find out where Gushi was exactly located and decided to go a few days later. It's a food stand so don't expect a sit-down restaurant; there are some picnic benches along Dundas though. I have been twice so far and each time there has been one person working the stand. This results in waiting times to be usually a minimum of ten minutes. The fried chicken is quite good so it's worth the wait. For a box of chicken over purple rice, it'll cost you eight dollars and something cents. You can add a few dollars for a larger box; I opted for this option the second time I went as I found the regular sized box to be a little small for me. Worth checking out for unique dishes that use Japanese fries chicken (karaage). Both the Original and Nanban Tetsuya are delicious.  Good for: street meat, Japanese fried chicken"}
{"text":"I heard about this place from a  fellow elite so I had to try this place. I had the gushi fried with purple rice and fried croquettes thus is one of the nest Japanese street food I have ever had in my life and the taoyaki balls phenomenal I could come back here for a really long time"}
{"text":"Double hot dog on a bed of rice - Oishii! Japanese sausage on a bed of rice - Oishii! TWO Japanese sausages (different flavours) on a bed of rice - Oishii! Kushikatsu pork - Still haven't tried it yet.  Sold out!  Shinji is super-friendly!  My fiancé and I just kept ordering one thing after another because the food was so tasty and cheap!  I think he recognizes us now.  We'll definitely be back!  :)  I was browsing their website and noticed they do catering and cook on-site too!  That's a great idea!  Maybe we'll hire them to do catering for our future engagement party or wedding!  lol~~  YUM!"}
{"text":"I did not know such a place existed until I looked on yelp. Always wanted to go to a street stand like this. The employees are friendly and the fried chicken was great. The purple rice went so well with the chicken too. Definitely would come back for this. If you're looking for a big meal you should get the large. The regular size wasn't enough for me."}
{"text":"Mmm Japanese street food goodness! The takoyaki balls and the original gushi chicken on purple rice were smothered in a creamy sauce and spicy mayo, which was delicious and filling for 2 people! The chicken was juicy and the purple rice was hearty. Prices were reasonable. We'll be back!"}
{"text":"If I can have this for lunch every day, I would! Excellent chicken, juicy takoyaki, and super crunchy croquettes (I got the everything nanban combo). Excellent stuff!  THE GOOD - Food is served hot - Chicken is juicy and crunchy at the same time! - The garlic mayo was amazing - Quick service  COULD BE BETTER - Portions. The regular portion is a bit small for something greater than $10. - Too much rice for the meat you get"}
{"text":"Sad I did not get to try this place on my visit to Toronto, because the owner recently went back to Japan. I came to see if it was open on Saturday ad Monday. It was still not open. I just have bad timing with Toronto. It is a stand located right in front of the hospital. Hopefully on my next visit to Toronto, I will get to try this place."}
{"text":"Gushi original is a tasty treat but mind your belly afterwards!  I love their sauce, pickled ginger and purple rice combination, though my partner prefers a firmer texture of rice. But I guess everyone has a different preference.  Overall, it is tasty and delicious treat to have for lunch."}
{"text":"I first has Gushi seven years ago at J-Town. I then visited their location on Dundas West. They are now over here, which makes this marketplace of 4 businesses where everyone soon goes broke worthy because of Gushi and The Jerk Joint!  Gushi, which is a play on words for 'kushi' which is Japanese for skewers, is actually named after the owner. The emphasis here is on 'Japanese street food' but which street in Japan has these food items? Seriously? OK, if you mean cheap Japanese fast food sold in certain stores or restaurants then that's another thing. I had nanban, which is southern style karage (chicken nuggets), purple rice, citrus juice and Japanese style mayonnaise and the chicken was juicy, the sauce was heavy and I am still unimpressed with Japanese purple rice. The caramalized onions were tasty. They come in 2 sizes and the 'regular' is filling enough. It is $10. They serve other Japanese food items too, but their bread and butter is their chicken of course.  Gushi is essentially a small kiosk with no seating available. There are several standing only tables in the rundown and dirty corridor.   What makes them lose a point and go down to 3/5 from 4/5 is the demand for tips. The machine prompts you to tip 15, 20 or 25%!!   1- There is no tipping in Japan. That is the civilized way. The price is the price. Good service brings the customer back and buys loyalty. 2- There is no service. This is a take-out counter. Why does one need to tip? Also, do I need to tip at McDonalds too? How about the Post Office? What about at the supermarket? If no, why would I tip here? Pay your employees enough and if you need to raise your prices and I can budget accordingly and decide to buy or not! Thankfully the government of Ontario has already legislated an increase in minimum wage to $15 beginning next year. With that said, I object to tipping as a concept even where there is waiter service. The price is false advertising then otherwise. 3- What is with the options being up to 25%? Why not just add 200%? The lame silliness has to stop. We already have had the government legislate to force businesses like airlines, travel agencies, car dealers, etc. have to by force of law advertise actual pricing. I hope restaurants are next. I of course chose 'amount' and picked 0.  By the way, the word 'nanban' means 'south' in Japanese."}
{"text":"A little disappointed even though it was delicious The purple rice and chicken was good, but the quantity was lacking. You also had to pay $10 for it. Use an app and you would get a free lemonade (odd). The staff were not Japanese and there seemed to be no cooking going on at the food market at Union Station. They were reheating food. Too bad because my previous encounter with those guys was when they cooked the real thing. It seemed to be a passionless business venture now. Non-Japanese part-time employees, reheating food they don't understand and selling it at expensive prices. The chicken and rice are still good."}
{"text":"Gushi specializes in karaage chicken, which is a Japanese style fried chicken so most of their dishes will contain their specialty. I have tried their Gushi original and skewer, my next choice would probably be takoyaki as the ones I have in Toronto so far have been quite disappointing.  *Gushi Original - $7.25:  to be honest I'm not a fan of deep fried chicken, but I will always have a soft spot for chicken karaage. Unlike other versions of deep fried chicken, karaage is not greasy and will not make you feel gross or drowned in oil afterwards. The chicken karaage at gushi achieved just that, it was juicy with a crispy-light surface, while still remained succulent when cold.  The purple rice was alright, I found it to be cold and hard to eat :(. The rice can be bland for some people, however the karaage had a right amount of salt in the seasonings, with a hint of spiciness from the mayo sauce, when eaten in one bite it was a delicious combination! Although they didn't give me any lemon wedges, there was some ginger to refresh your palate so I can forgive that! :p  *Gushi Chicken Skewer - $6:  The skewer was longer than an iPhone 6 Plus! (Yes sorry for the weird comparison, but I can't think of any other object to compare to lol).  Again, the skewer was juicy and delicious! I wished they served this with some lemon because I loveeee squeezing a liberal amount of lemon before eating karaage ;). It really helps to lighten the dish and kill any kind of gaminess of the chicken."}
{"text":"Food is decent however for the price u r paying doesn't really worth it. For the regular size, the portion is little and you pay the same price for mivami next door , which they really gives a lot of food. I feel $7 would be more appropriate considering it is a takeout place there is really no sit down even as a food court standard."}
{"text":"Had the gushi chicken rice box. Fairly good value at $9 as it was quite filling and tasty. However, two of the four pieces of karaage were cold and two were hot, fresh out of the fryer.  Doesn't seem like its fresh made to order, which ruined the whole experience for me and gave me a stomach ache. I'll pass."}
{"text":"I'm not sure what to think about this place.   I wasn't a fan of the purple rice + pickled ginger + fried chicken combination. The textures and flavours just didn't seem to go well. However the sauces and chicken alone were great, though I can't justify paying that much for just that. Maybe I just ordered the wrong thing?  Also, the Takoyashi balls were very disappointing. Mostly dough and just 1 small strand of octopus.  Excellent presentation though, everyone at the lunch table was asking me what I was eating!"}
{"text":"Perfect snack for winter. A bit spicy and sweet. Did I mention there was fried chicken?! The purple rice was the perfect vehicle for this."}
{"text":"Tasty karaage chicken. I got the rice meal in original flavour with chicken in regular size. It was 9 bucks flat. I paid in cash and liked that I didn't have to search for change for tax; the price is tax inclusive. The purple rice could have been hotter, felt it was a bit close to room temperature. 4 large chicken balls in my box. Also it was a very filling meal. Can't imagine anyone finishing an everything meal on their own in one sitting. I personally think this is a better deal than getting the everything meal as it is more meat to filler/sides. Not bad, I will be back to try some of their snacks. Great service, fast."}
{"text":"Simply a winner! Not that healthy since it's fried, but reward yourself once in a while and burn it off after. What can I say about gushi chicken, it is always full of flavour and colours. The aroma of the freshly fried chicken mixed with the purple rice and pickled onions and red ginger really add a nice tangy taste, granted this dish is perfect for cheat days or if you plan to reward yourself. I usually order the nanban and the original chicken, have to try the other protein (takoyaki). But my my love for chicken is still really strong . If you craving something other than the standard fast food and you in the area of Bathurst and Dundas, check them out and you'll fill your tummy up with some amazing  Japanese chicken."}
{"text":"Gushi is one of those standout names that have pop up stands at every Japanese event across the city. Doing traditional street fare like katsu and takoyaki they also have a few other interesting bits like deep fried hot dogs and curries. There's not much here aside from great food and friendly staff, and you'll find not much in terms of seating unless it's summer and the community center puts out extra chairs and benches. Sometimes you'll find that the meat is really fatty, I've had one occasion where the chicken katsu here was easily 30% cartilage and fat at one point. Aside from that it's  usually a great time. Decent quick bare-bones food that is bound to please most."}
{"text":"This place has hands down the best karaage I've ever had. I got their combo and everything was amazing! From the perfectly crunchy chicken to the delicious vegetable croquette and takoyaki... All drizzle with that amazing garlic mayo. I'm drooling just thinking about it. I'll have to make another trip here this weekend.  Tips: - Their regular sized portions are really small... You'd have to order two servings of the chicken rice or the curry rice to be full for dinner.  - This place is inside of a food court with standing tables. If you want to sit you might have to bring your food back to the office."}
{"text":"had their hot dog meal and gushi chicken meal. each entree came with bed of purple rice and spicy mayo drizzle , green onion sprinkles and ginger. Great, crispy and juicy chicken with it's special flavoring. hot dog meal was OK. my bf loved it. but we both gave 10/10 for gushi chicken."}
{"text":"Had the Gushi chicken box. Generous portions. Juicy flavourful chicken. All the flavours worked together."}
{"text":"Tried their chicken a couple times at various Night Markets. They got some serious chicken game! It was moist and perfectly cooked, and served piping hot. A bit of Sriracha mayo and some pickled goodness made this a perfect snack between vendors. Haven't been to their small outpost on Dundas yet but I am sure we will meet again."}
{"text":"Same people from 707 Dundas West running this location.   The best Japanese Fried Chicken Karaage in Toronto - crispy, juicy, tasty, fresh fried chicken.   They offer new flavours in this location too.   This location is indoor and there are few benches for standup spots to enjoy the food."}
{"text":"Gushi recently has renewed the menu and focuses on its popular Gushi Karaage chicken.   The package is changed and size is upgraded. It is a good value for same price but bigger size!  Gushi also now offers pre- deep fried frozen Gushi chicken to go. I heat up the chicken in oven with 350F for 10 minutes. Still Juicy and not greasy! They become my great night snacks with pop/beer!   today we tried:  Nanban Tetsuya Chicken - Gushi chicken, Citrus vinaigrette, garlic sauce and green onion. The citrus vinaigrette help you to increase your appetite.   Japanese Curry Chicken - Japanese curry is tend to the savory side and not spicy, so it is flavourful and has good aroma.   Hot dog on rice - all time favourite of my kids."}
{"text":"Wow.  For $10 you get a generous serving of marinated and flavourful Japanese style fried chicken, a side order of purple rice, onions, ginger, and spiced mayo. Hands down the 'best' karage in the city.  It's made fresh to order, and the location is just a couple of blocks east of Spadina on Bloor. This is crack and porn for food lovers, and just writing this review makes me want to go back to this shipping container street food joint. Yes, it's that good. Even better? You can pay by cash, credit card or debit, and their prices include taxes. They have 2 sizes, a $10 portion, and a $14 dollar portion, which could easily serve two :)"}
{"text":"A very tasty and unique treat. I have to say that even though it is deep fried it is not super greasy. Also the sauce, pickled ginger and purple rice go together to make this into a exceptionally flavor and texture balanced treat, you get a little crunchy vs soft, and little salty playing off a vague sweetness.   So far every one I have introduced this to has loved this place."}
{"text":"This place is amazing! I come here several times a month. Their chicken is so tender but chrispy and the purple rice just compliments the chicken :) the person who usually works there is also very friendly. The service is consistent and the food is always good. The price is fair. Always a gushi fan!"}
{"text":"We ordered the Japan Curry and Nanban Tetsuya.   First off the bat, I realised the prices listed are not accurate. We were charged a dollar extra for each box we ordered.   While the rice in my box wasn't fully cooked, my fiance's was cooked fine. The crispyness of the chicken was completely lost in the Japan curry which was unfortunate. The Nanban Tetsuya is definitely the best of the two. I love Japanese curry but it's not really the best to compliment the chicken karaage.  Absolutely love the pickled vegetables. I could eat just that and the fried chicken all day.  I will definitely be back and try the other options. Maybe I'll ask them to sub in a hot dog instead of chicken for the Japan Curry!"}
{"text":"Event: DT Food Date. Bf @ I travelled all over downtown on a hot summer day to try out different restaurants & food.   Location: Wasn't too hard to find. It's by the streets with a few other carts.  Food: YUM! Japanese street food. Ordered a Gushi Chicken Skewer ($6). It was fairly big (definitely worth $6). The chicken was crispy and juicy. The sauce made it even better -drools- is it just me or does it taste better here than at Night Market!?"}
{"text":"Full disclosure: I'm a regular here. Gushi's nanban tetsuya is one of the very few things I could eat everyday. The karaage is on point on all counts; succulent and crispy textures, seasoning, flavour, the whole package. Add that to box of hearty purple rice, topped with green onions, side of pickled ginger, drizzle of a sweet soy/mirin type sauce, kewpie mayo, and the most excellent nanban sauce (some sort of caramelized citrus/yuzu type that is zesty, tangy, bitter and sweet in the most pleasant way), and you have what I would order if it were my last meal. Drinks include ramune, ice-cold (or hot depending on season) canned tea (green or oolong), among others. Their croquette, takoyaki, and pogos are very good as well. Shinji (aka Mr. Gushi) is a very energetic, positive, and friendly and makes sure your order is perfect before it's in your hands. Being quite reasonably priced and just steps from where I work, I can only say that this place comes highly recommended."}
{"text":"Was in the neighbourhood and I was craving some karaage and decided to try this spot. Original karaage was delicious and employees are welcomely. Hot juicy chicken on a cold day perfect combo for my liking"}
{"text":"I went here with my friend and it did not disappoint. I ordered the chicken original in regular sized and it cost less then $10! The wait took awhile because they make the chicken to order so it's worth it. The chicken itself was so tender and crispy, very juicy. I like the rice and additional toppings they gave me even though I had no clue whay some of them were and had to look at the picture which helped. My friend also enjoyed her meal, it was a takoyaki Nanban Tetsuya but then a bug flew into it and she had to throw out half of it unfortunately."}
{"text":"in the mood for street food ? driving along dundas around the bend before Bathurst you will come across some small tent size units serving up some great street food snacks. Gushi serves up a few of the delicious snack including katsu, karage, and teriyaki. great portions for under $10. and if that doesnt fill your appetite grab one of the deep fried skewers. my personal favorite are the quail eggs. plenty of street parking and the food comes out very fast"}
{"text":"We got a large order of Original Gushi Chicken on Rice.  We probably shouldn't have ordered the large, but the hubby always has an issue with thinking we can eat more than our stomachs can handle.  So in the end, he stuffed his stomach.  I loved how the rice was a purple rice rather than a white rice.  Just something different, and I think purple rice is supposed to be healthier right?  The kaarage was good, a piece or two was a little fatty for me, but the hubby didn't notice, i'm probably just pickier about food having hunks of fat on it.  I have to say that there quite a few pieces of kaarage in the order.  Worth the price paid for sure."}
{"text":"3.5 stars**  Two months of buzzing past the same row of Market 707 Cargo Street Vendors on the 505 streetcar since June 2013, I've finally made my way up here upon a mate's craving for mayo and rice (and you better bet he went for an extra drizzle of mayo).  Good ol' Gushi. Their menu is mainly focused around their all-time popular Deep-fried to order, Gushi Chicken on either rice or fries ($8~9). Their Deep-fried Chicken uses NO eggs or dairy in the process; they are dusted lightly in a potato starch for minimum oil-absorption and the ultimate crisp!  **A box of the deep-fried chicken goods alone runs for $9, and a party pack runs for $25.   LIFE'S BIGGEST PICKLE: one hotdog (on rice) for $3 or two hotdogs on rice for $5???! I went for the less greedier option, and had one (sheesh, who was I trying to impress?) - but, no regrets, it was just enough! The boil-and-go type of hotdog was served up, battered and fried-to-order, on a bed of mixed rice and garnishes.   CONCLUSION: Get ready to become well-fed for well under $10! ...But, sad to say, both definitely needed more sauce (and exra sauce is extra $$ whhaat). I AM THE DANG KEWPIE MAYO QUEEN. Didn't you know? I would like to come back to try another one of their more flavoursome Gushi Chicken. I have my eye on the Nanban Tetsuya.  ** Tip for the penny-pincher folks: The prices on the billboard in-store do not reflect the correct price, the online menu does!"}
{"text":"Hands down one of my favorite places to stop by in Toronto. I have to come here at least once every time I'm in Toronto. Found this place through Yelp while having a street food craving and convinced a friend to search around for this place. We found it right pretty quickly and right before they wrapped up for closing. They still made some for us, and it was absolutely amazing."}
{"text":"Karage Chicken! Oishii!  Anything that breaded and deep fried tastes good?! Maybe.  But eating all these deep fried goodness from a food stall right on Dundas West?! I just love that experience!  At first we ordered a Gushi Chicken Rice Bowl ($5) and I ate that so fast! Then we ordered Just Gushi Chicken ($5) with 5 pieces and a Deep Fried Hot Dog! And I ate those really fast too...  They were just so good!!   I wish there are more food cart/stall in Toronto and of course they have to be as good as Gushi!"}
{"text":"God's Plan.  I fell in love. The chicken is by far the best fried chicken ive ever had in Toronto... The curry is bomb too!..."}
{"text":"Very tasty for the most part. The portions were very decently sized and the chicken was juicy and flavourful. There was, however, a certain lack of care - the pieces of chicken were completely different sizes; some were tiny and others huge, and two pieces hadn't been completely cut apart. The rice was a bit too mushy and I didn't care for one of the sauces everything was topped with."}
{"text":"Gushi is awesome! A great place to stop and grab some food on the go. I watched a great street performance while hanging out. Toronto is such a cool city. I love walking down random streets and seeing amazing things while eating great food."}
{"text":"If you like chicken, you have to go here! The sauces are a great addition. This is by far one of the best chicken karaage in downtown. This is exactly how karaage should be, not like the sad imposters at most \"Japanese\" places here. I am so glad that real Japanese food is slowly seeping into Toronto, and for anyone looking to try uncomplicated, fast, cooked Japanese food, try these guys!"}
{"text":"Been here a dozen times but today was a let down. I ordered on Grabb, came down just to have my order cancelled infront of me. No apologies were given, basically an explanation that they should not have turned on the App and I would be refunded. I would have to wait 25 minutes after they finished catering to get my food.   Good food and bad service."}
{"text":"I'm always on the hunt for some Takoyaki and this place hits the spot and then some. I ordered The Nanban Tetsuya with Takoyaki which was the first I've ever seen takoyaki ever presented in such a way. It's on a bed of purple rice and it's topped with aoili, spring onion and pickled ginger. Ever component only enhanced each individual flavor melding into a sweet and savory flavor. My only regret was not ordering all of their other foods! The food is made fresh to order and it shows. If you're an adventurous food seeker and don't mind the little walk from the main Kensington Market area please check out this vendor!"}
{"text":"Gushi never disappoints when I want Japanese style fried chicken. The pieces are large and tender, with the perfect amount of crispiness. The purple rice is really pretty too, but often stuffs me up faster than norma white rice does. It can be a bit on the saltier side, so you'll have to have more bites of rice.  Sad this place is moving due to the entire food court place closing but there's always the food cart across from Toronto Western Hospital for this!  I hope to come back and try out their other stuff in the future"}
{"text":"GOOD: the price and the friendliness.  You can't go wrong for a nice filling meal for $8 at Gushi. The portion sizes are larger than you'd expect.  LACKING: Flavour.  The chicken isn't marinated fully, and the batter is less salty than most fried chicken. So it's a little bland."}
{"text":"Gushi Japanese Street Food is celebrating their 5 year anniversary with their daily special at $5 for 5 days until Thursday.   I tried the original gushi that came with 3 pieces of chicken, preserved veggies on purple rice.  The fried chicken pieces (with sake marinated into them) were light, crispy and juicy.  The purple rice was actually surprisingly good.  I am thoroughly taking advantage of this deal everyday!!!!"}
{"text":"We ordered from Uber Eats. Got the original with takoyaki add on and one original with croquet.  The chicken is delicious and crispy Croquet was very tasty, soft inside and crisp outside and super duper tasty, I think it's potatoes carrots and peas inside Takoyaki was ok, my least favourite part of the meal. It wasn't crispy, there were no bonito flakes and it had become soggy. I was also expecting a tiny whole octopus inside but it was little pieces. I guess it might be better if you're eating in. The food became kinda soggy in the takeout containers.  Purple rice was good, plain taste but good bite to it.  Green tea cheesecake was great, tasted like it was made with quality ingredients.  Overall good experience, I would come back for it."}
{"text":"Went to the Union Market location and was blown away. Had the vegetarian option and was very happy. Good quality food. delicious and easy to eat.   A bit hard to eat standing on the street (rice while walking with chopsticks is still a skill i need to master) but high quality. not to be missed!"}
