{"text":"They have a great lunch special here. For $10 you can get a half panini or pasta with a half salad or soup. My family and I have been here several times and we have enjoyed the food. The service has been good too!"}
{"text":"Very nice decor and clean inside. I went for lunch with a few other people. The service was good but what I ordered was OK. My Cesar salad was room temp. I was expecting it to be cold and the flavor was nothing special. I had a veggie sandwich too and it lacked filing. I will give this place another try because many ppl seem to enjoy the food."}
{"text":"The pasta was fresh and well prepared.  I'd give it more stars but the service was dreadful.  The server never gave us his name, and we had to ask for refills on water.  We had to ask for our waiter after being finished for nearly 20 minutes.  Our waiter never even checked on us the entire meal.  A quick family meal, with only an entree, was nearly 2 hours long."}
{"text":"Had a great lunch, served quickly and had a perfect martini (rough day).
The salad was excellent and the soup was thick and hot. Waitress had a pleasant attitude and was very efficient."}
{"text":"Amazing catering! We had a surprise 70th birthday party for my mother here and the staff was very attentive. The food was delicious and all 60 of us had a great time! The food selection was exactly what we wanted and the Salmon tasted very fresh. Others had Lasagna and eggplant parm.  Whether it is a party of 60, 10 or a nice dinner out as a couple, Gusto is a great Italian local restaurant! The calamari was great as well!"}
{"text":"We dined here on a Sunday and everyone's meals and the service was perfection!  One gentleman that dined with us has traveled all throughout the U.S. and has dined at many \"authentic\" Italian restaurants and he shared with our waiter that this one of the best pasta dishes he had ever had.  It is freshly made pasta people, very different from boxed pasta!   If you want a REAL pasta experience, come here.  It is delicious and our service was exceptional!"}
{"text":"Food was pretty good but our waitress Sydney was the best. Brought the grandparents in for a nice supper, had a nice meal with desserts. Ask for Sydney next time for sure."}
{"text":"I used to really enjoy eating here; creative menu and good prices, along with sharp service. Tonight however, was dismal. The menu has changed and is smaller, but that's ok, there's still something for everyone. For appetizers we ordered a quinoa salad and a beet salad to share between 3 of us. The beet salad used to be chopped beets with goat cheese, delicious, I've had it many times before. This time it was a plate of greens with 2 slices of beets (this was the large portion at $10) I told our waiter I was surprised our salad only had 2 slices of beets so he took it away and brought another one..this time with two even smaller slices of beets. Also at this time our drink glasses had been empty for about 15 minutes. I asked for the manager and it took another 15 minutes for him to get to our table. I know they were busy with a large party but that should not impede on the other patrons. Although our intentions were to eat dinner there, we got the check and left; went somewhere else for dinner. I hate to be whiny about restaurants because we love to eat out and we respect the talent that's out there. But I'm sorry, Gusto, your management leaves a lot to be desired."}
{"text":"Went for dinner on a Sat night, we were a party of 4. Was nervous about all the negative reviews but needed to see for myself. Well, they were right.

Waitress was nice, but totally inexperienced as a waitress. Appetizers were ok, but they never cleared the dishes, never refilled waters, didn't have proper place setups. Incorrectly brought an extra tapa that we didn't order, waitress acknowledged the error, and ultimately charged us for it. That annoys me. Main courses arrived while appetizer dishes (empty ones) were still in table, staff looked at us like \"so can you move those??\" Type of look when they needed space to put everything down. One of those staff members turned out to be the manager. 

The menu doesn't explain the dishes well. my ravioli was totally different than explained on menu. Chicken marsala is not chicken marsala. My ravioli looked like pasta and chicken from a slow cooker. So gross I sent it back. 2nd dish (a different dish entirely) wasn't much better. My friend's fish was really undercooked and dry. 3 of the 4 of us didn't like our meals. After so much dissatisfaction and disappointment the manager came over. She gave us some desserts on the house. Well, that didn't save you Gusto. You shouldn't have charged us for several items you messed up on. Why did I need to ask you for water 15 times? You need to train the wait staff better. Swift and effective service. I can see that the staff didn't really understand the severity of these complaints. Hopefully someone there high up enough can address the service issues and food issues or they won't survive. 

Clearly, we won't be back! The reviews don't lie."}
{"text":"Went for girls night out and everything was great. The waitstaff was friendly, the food was great, the sangrias were even better, and best of all... the tres Leche! Will definitely revisit."}
{"text":"We went for drinks and tapas on New Year's Eve and although they were super busy, we had a phenomenal service. Our server was attentive and able to answer all our questions and give great recommendations. The food was amazing!! We have been raving about our experience ever since, we will definitely be going back! Can't wait to try this place for lunch"}
{"text":"Gusto was so good last weekend for lunch!  The service was some of the best we have ever had and the homemade pasta was delicious!  We even bought some \"to go\".  Prices were very reasonable as well.  We will absolutely go there again soon!"}
{"text":"Came in for outdoor seating after sitting outside at mellow mushroom for 15 minutes without a server. 

Gusto immediately greeted and seated us, and our waiter came quickly. The food was absolutely delicious, but it was pricier than we expected based on the outside decor (thought it was a sandwich shop)

This place is more like fine dining. It ended up costing about $82 for the two of us, but we actually didn't mind because the service and food were well worth it. 

We will be back"}
{"text":"The first time I went to Gusto was for a work Christmas party.  The food and service was really nice, so I decided to have my husband's retirement dinner there.  We got one of the party rooms that sat 50.  The planner at Gusto helped me get a personalized buffet menu and wine/beer list together.  She really did all of the hard work for me.  Also, the owners personally made sure we had everything we needed and that everything was to our satisfaction.  The night was absolutely the best and I got multiple complements from our guests regarding the food and service.  We have been back for dinner and will surely go back many more times!"}
{"text":"Good, creative tapas, entrees, and salads. Service is strong. Look forward to having a drink at the bar soon."}
{"text":"Service is awful.  The waiter was rude.  The restaurant wasn't that busy and he seemed rushed and very curt.  The entrees are small portions for the price.  Food was ok."}
{"text":"Nice to have a Spanish tapas restaurant in the neighborhood. Tapas price is reasonable and taste pretty good. We like the garlic shrimp and seafood Paella. The meat board is lacking, not enough quantity and variety. Environment is pleasant and people are friendly."}
{"text":"Very rarely do I give 1 or 2 stars. In this particular case, let me explain. 

When I arrived, it was about 5 minutes before I was noticed (not a huge deal being at the bar, regardless of the 3 other people out of 20 seats that were currently sitting there.) my drink was finally poured, and was fine. Herein begins the maelstrom of sadness. 

We ordered (calamari, meatballs, Caesar salad, and the vegetarian orecchiette). 

1) the Caesar salad was by far the second worst I think I've ever had (rotten lettuce was the first). Think crisp chopped romaine and croutons (by itself, fantastic), with a squeamish dose of mayo. The meager portion of Caesar dressing could be equated to making a salad for ten people, and adding approximately 1 tablespoon of dressing to cover. Unfortunately, the tablespoon of dressing I received must have been the part that wasn't fully mixed. It was pretty much straight mayonnaise. Couldn't taste anything remotely Caesar. I tried. Believe me....

2) Calamari looked great presentation wise. The three complimenting sauces were as follows: first) raw garlic tomato water, second) sweet chili (which was basically Mae ploy straight from the bottle), and tartar sauce (basically more of the pre-mentioned Caesar dressing mayo situation). If a restaurant says they have an executive chef, I don't want to see Mae ploy. This is a personal preference of course, but throwing a bottled sauce (which sadly outshone the other two) on a plate is a cop out for me. On a side note, calamari was cooked very well.

3) meatballs. 4 over cooked, dry ping pong balls with literally zero flavor....I tried to find something nice to say about these and after the 4th meatball, still came up short. Luckily, the raw garlic tomato water present in the calamari was there to lend some kind of flavor. 

4) the crowning achievement of the evening. The vegetarian orecchiette (tomato basil, or something of the like). Overall, I think this was the most edible, despite the chefs version of al dente....which was about 2 minutes prior to actual al dente. Flavors worked....and after the first 3 dishes really seemed pleasant........although as a standalone vs other Italian restaurants in the area would have easily had the honorable mention green ribbon placement. 

To sum up: after being there and given multiple chances, this will alas be the last time I frequent the restaurant. In my humble opinion, a restaurant is only as good as the food (I'm one of those people that can be treated like crap, and if the food is amazing....I'll absolutely be back....service doesn't make or break a restaurant for me) and although the menu is slightly pedestrian (and has a bit of an identity crisis), the food aims and delivers slightly lower than mediocrity every single time. 

2 stars for not ending up in the garbage."}
{"text":"Finally a decent place to go in Ballantyne! I have been a few times after work so I usually sit at the bar to eat. Kelly and the other staff are super friendly and  attentive. For starters, the hummus is one of my favorites and always gives you enough to take home. The goat cheese is also great, tho I do wish there were more cheese and less marinara. The flatbreads and pasta have all been delicious as well. 

The only reason I am not giving 5 stars is the meat and cheese plates. The first time we went, the portions were generous and served on an appropriate charcuterie platter. I was incredibly disappointed the second time we ordered it - it came on a dinner plate and had 2-3 small slices of what appeared to be  different deli meats. At $1+ per small slice of meat, it was a complete rip off and unappetizing. 

Great place - just would encourage them to focus on maintaining the quality/quantity of the food."}
{"text":"Hostess was not knowledgable enough about her job or hospitality industry. Asked if we had reservations and Resturant was empty with only one table of 6 with a reservation table flag on it. When asked to sit at a booth and not a table by the open doorway I was repeatedly given an excuse of why the one working waiter couldn't be reassigned to a booth to accommodate me the customer. Not cool. 
Food was good and server Derek was excellent."}
{"text":"The tapas are amazing, as are the pasta dishes. Haven't tried the pizza yet, but it looks great!  Great atmosphere, friendly and knowledgeable staff, jazz on Friday nights, who could ask for more???  New favorite place to go!"}
{"text":"Nice manager.  Food was weak.  $58 for a $15 bottle of Malbec.  Good Malbec, weak value.  Nice manager.    They need to work on a few things."}
{"text":"First time, party of three, dining between busy times on Easter Sunday. Nice looking place, smelled great walking in. Waitress was very attentive and friendly, had three small plates, meatballs, goat cheese sauce and toast points, and beets. All were very good, then entrees of lasagna, bolognese pasta, and pizza. Again, very flavorful all around, large portions. The crust on the pizza could have been less doughy, more crisp. We will be back, there is sufficient variety on the menu to satisfy anyone, and this place is a very nice addition to the Ballantyne scene. Music was old style Dixieland, which for us was yet another plus. A very positive experience."}
{"text":"Very fresh pasta, wonderful carpaccio, great service, neat atmosphere. We got royal treatment and thoroughly enjoyed our meal. We hope to be back."}
{"text":"Being a former NYer, I am particular about my Italian food.  The service and meal were both excellent.  I had the shrimp tortellini and my daughter had the lasagna.  The latter was large enough to take home for lunch the next day.  

I have also sat at the bar with a glass of wine while enjoying the thin crust pie they make right in front of you.  Nice wine bar type atmosphere.  For more of a family experience, you can get a table in the back room. 

Recommend highly."}
{"text":"Great first time in! Few weeks ago we celebrated a friends birthday party at Gusto for drinks and apps/meals. We had a large party and all staff was kind and accommodating! Food and drinks were delicious!"}
{"text":"Excellent!!!  

The ambiance is really nice here. I really enjoyed having some wine with a good friend of mine. My favorite was a Riesling. 

I got the Rigatoni ala vodka to-go! It was delicious!!!

I'm sure I'll be back to try out some more of there incredible food!!!"}
{"text":"I've gotten take out/delivery from Gusto through an online lunch order service called Foodsby three times and I can't get enough. I get so excited to see they are on the menu for the day! I get the Quinoa Tabbouleh with  Salmon. I can honestly say that it's the best salmon I've ever had. It was cooked perfectly...not too much and not too raw. I'm sure it's as yummy in house as it is delivered. The tabbouleh is great. I've had it where there was a sprinkling of quinoa, but this was a majority of Quinoa and the perfect amount of everything else! I look forward to my next lunch!"}
{"text":"Went here for my birthday dinner on Christmas eve, place was closing at 7 but they made us reservations at 6:45 which was very nice of them. We had a party of 8 and were all seated comfortably! The service was pretty fast the prices were perfect and the portions were big and filling! We tried the quinoa salad and of course calamari (highly recommend the quinoa salad) they also bring you out a bread basket which held a garlicky warm bread, it was very good. For the main course I got the chicken parmigiano and spaghetti which is made fresh. The chicken was juicy and cooked just right and the spaghetti  just melted in your mouth. I highly highly recommend this place. I was very pleased and satisfied. I will definitely come again!"}
{"text":"So. Going to leave a 3 star review because of the following.

A) we walked in. The hostess asked us if we had reservations and the place was practically empty. I looked at her like \"huh, you kidding?\"

B) they don't seem to much a restaurant, seem to be more a bar perhaps? Or maybe just confused on what they want to be? No idea here 

C) they sat us at the booths by the bar area which seems to be the only booth area. We are sitting there for a good 20 minutes scratching our heads - \"do we have a server\" finally the bar guy comes over puts some water in front of us in a bottle ( 100% tap water too) ( simply trying to fit into the area yet failing hard) than he mumbles some random steak off ( possibly a special? Sorry no idea guy can't speak English and in a rush)

D) finally rushes over again and takes our drink order. We simply say two cokes with no ice. What comes? Two cokes ice! Finally I get pissed and say no ice! He pushes one glad towards me and brings my other guest a coke with no ice. Finally I am just saying the hell with this. I give up! Again the place was practically empty! So zero excuses!

E) the food comes. We both got eggplant parmigiano and honestly it was not bad. Not big. Not small. Nothing special either. Never was asked if it was good bad or whatever. 

Again this guy seems to be rushing around - I hate this, I go out to eat to relax, not to be more annoyed. Finally we just pay and get out. Normally id tell some manager or something but I don't think anyone would care. It just doesn't seem like the kind of place who does.

I hope this helps someone out there. Point blank if you are lazy to read this and end here. The service is terrible!"}
{"text":"A dissaster! That is no homade pasta. Too expensive, for the food they served. In about 40' ..."}
{"text":"I visited Gusto during Happy Hour on Friday.  The restaurant was practically empty but it still took forever for someone to greet me. Although the seat I chose was right behind the bar it was not considered the bar so I had to move to take advantage of the Happy Hour specials.  

Service: Needs improvement.  I seemed to be a distraction to the server. But he took my order very quickly.  However; several minutes passed and no food. I then noticed the table of young, attractive girls seated after me and to whom my server was very attentive to received their order - that looked a lot like the two apps I ordered. Once I was able to get my server's attention I inquired. He was not pleased. And basically told me I was free to leave the restaurant.  He never offered an apology.  So I asked to speak to a manager.  Luckily he was very apologetic and explained that my food was mistakenly served to the incorrect table. 

Food: slightly above average. The calamari was crispy but lacked flavor. The serving size was very small. The baked goat cheese was yummy but was more roasted tomatoes and parmigiano than goat cheese.

Drink: decent. The wild berry sangria was just ok. It lacked the depth of flavor most authentic sangrias have.

I live across the street but I am not sure if I will be taking the walk to eat or drink here that often."}
{"text":"Went for lunch.. it was really good! The meatballs are awesome, and my husband got the \"Alfredo burger\" and it tasted as good as it looked! I got chicken Parmesan and it was awesome. They make their pasta fresh, and it makes a big difference. Our waiter was very friendly and we will definitely be going back!"}
{"text":"We reserved this restaurant for brunch on Easter morning, and ultimately had poor service. Food was okay. Would not recommend to a friend."}
{"text":"Not s home run
Pressed chicken sounded great
Very small portion and dried out
My wife had the tortellini and enjoyed it
Manager or owner sympathetic and offered 
Desert
Looked good but we passed
Not sure that we will return"}
{"text":"Gusto is a diamond in the rough. Directly across from Terrace Cafe, so if you have a 45 min wait just walk across the parking lot to Gusto! Steak is amazing! French Toast! Rum based Sangria, no wait. Great atmosphere"}
{"text":"Always great- from sangria () to the amazing brunch- one of my favorite places in Ballantyne and always great service!"}
{"text":"I'm definitely not sure I understand why the rating isn't higher for this place...?  It is a newer place, so maybe the reviews are from early on, while they still had some glitches to iron out. I had a very good experience at lunch here the other day. The goat cheese appetizer was phenomenal, and the pasta dish was absolutely delicious. The service was excellent, and the location and ambiance are wonderful. I would definitely recommend this place for lunch or dinner, for sure!"}
{"text":"Organized a big group company dinner here on a Tuesday evening, and the Gusto team provided all that we needed. They had private rooms for big parties that had the space I was looking for. They even set up bar tables so that we could mingle and talk in the room; exactly the set up I was looking for.

Server was friendly and got almost all the orders (especially with us spewing out drinks, food, and other requests every other minute, I'm impressed!). 

Food was great, came out on time, and all the guests loved them. Special shout out to the calamari and truffle fries. Those were the dishes I had to reorder several times because they were disappearing at a rapid rate. 

The dessert selection was great. We tried every single one, and the banana foster (which was just bread pudding) was hands down our favorite."}
{"text":"The mussels were great & the bucatini made me remember my meals in Italy - perfect al dente!  The staff couldn't do enough for us - pleasant & attentive. Will definitely be going back."}
{"text":"Had a rehearsal dinner booked here for July 14th. Paid our deposit months in advanced. We were emailed 2 weeks before the date that Gusto would be closed for a couple weeks for renovations. They offered to transfer our deposit to their 'sister' restaurant. We were out of the country and planning our dinner and wedding from abroad so, what else could we do less than  2 weeks out? We agreed out of good faith. We were behind the 8ball with time anyways. 
We arrived with family to our dinner at Vine American Kitchen, transfer was NEVER MADE! Vine contacted them several times...no response. Our experience at Vine was sub-par and totally wrecked our rehearsal dinner experience. I have since reached out to Gusto, NO RESPONSE...now pursuing legal action...not sure how though, being they seem to be closed for good. SHADY! UNPROFESSIONAL...advice on how to proceed with legal action against them is welcomed"}
{"text":"First visited last week for a birthday lunch. They put us in a small private room with a server who was very knowledgeable on the menu. We sampled 3 tapas. We had the skewered chicken naan, a tomato spread with naan and a ceviche . All were very flavorful. For lunch I split a salad and a pasta dish. They make their own pasta so pasta is a specialty. The salad was great with fresh flavors. The pasta was chicken, tomato, buffalo mozzarella and spinach. Loved it! Went to Gusto yesterday and the menu for lunch was completely different. The menu had been streamlined.  Got the skewered chicken again and the portion went from 3 down to 2. I got the beet salad with the crispy bacon panini. The salad was different so will get it again for sure. The panini was average. It's close to my house so will visit again. The decor is cool and comfy."}
{"text":"This place is a hidden jewel!  Every time I come here the staff is so friendly and the atmosphere is upbeat. I like the rustic meets contemporary look of the space.  Food is fantastic!  Best Tapas in town!"}
{"text":"Great place with a wonderful atmosphere! I visited on a Thursday night with a few girlfriends and we had a great time. It ended up getting very busy as the night went on. The staff was extremely friendly. The gentleman that greeted me at the door and sat me saw I was interested in the Sangria, so he offered me samples. Highly recommend the Red Sangria!! Our waiter was Spencer and he was fantastic. Will definitely be visiting again very soon!"}
{"text":"This place definitely was good! We didn't know what to expect when we arrived seeing it was a tapas style Italian eatery. My husband and I split the grilled shrimp tapa for an appetizer. It was good but the shrimp was pretty small and a little dry. The sauce that it came in was delicious though. I ordered the gnocchi and it was very good! Gnocchi is hard to make and they did it perfect! My husband got the seafood paella which was really delicious! I was impressed with the kitchen as there was a wedding rehearsal party of 60 going on and our food was still out in a decent time. Took a little while to get our check as we had to ask three times. But if that is my only complaint then please! With a party of 60 that is to be expected. We will be back soon!"}
{"text":"Am beginning to warm to Gusto, located in the Ballantyne Shopping Center at the intersection of Ballantyne Commons and Hwy 521.  Have had a couple of not so good visits, but lately the visits are A-OK.

Menu is simple but different.  A blend of Italian and Spanish offering lots of tapas and pastas.  Lunch menu is different than dinner as dinner offers tapas which are not for lunch.  A very good bar that has an active happy hour and lots of drink specials most every day.

There is another room off to the side where we have had dinner with our son's family of 5 so with us the 7 of us had a larger table and excellent service.  So if you have a large party, ask for this separate room.

They make a Bolognese sauce that really makes the lasagna and other pasta dishes sing.  Rich and meaty it is a treat.  Wife loves Bolognese and with their beet and goat cheese salad she sings.  I love the braised short ribs that are so tender and rich that you are challenged to get it all down.  Not that you don't want to, but the decadence of the dish overwhelmed me.

They do a good job here, so give it a shot."}
{"text":"We were excited about trying a new restaurant in Ballantyne and found two seats at the bar last night. We were seated by the guy making the pizza's and saw what looked like delicious pizza's coming out the oven. This is why we didn't order one: the guy making the pizza's didn't have gloves on - and at first I thought, well okay, all bacteria will be killed in the hot oven (he was actually scraping the cheese off his fingers - gross) - HOWEVER - when the pizza's came out he added toppings (looked like basil) with his bare hands. The people making the fresh pasta also didn't have gloves on. Sorry - that killed my appetite  - we ordered a cheese plate which was very good and had a good bottle of red wine. I was glad I caught the bartender before she opened the wrong bottle for us.

PLEASE have the cooks start wearing gloves and I'll be happy to come back."}
{"text":"Always great food and very little wait.
Never had a bad meal and have tried many different items.  Kids are welcomed there too.
Great place for Sunday brunch"}
{"text":"Awesome! 
I have visited for lunch and dinner. All my experiences have been great. 
Great food 
Great service
And they accommodated my picky eater son. Thank you! 
I love watching the fresh pasta being prepared."}
{"text":"Terrible 
Horrible 
Don't go even if you had reservation 
Manager came out and did not care!!!!
Pass
Pass 
Idc what the food is but the up front things sucked!!!
If it goes to the manager and he don't care or take care of things. 
Don't bother!!!"}
{"text":"I had very high hopes for this place but was pretty disappointed. First, it took the waitress 15 minutes to bring us water, and we had to ask twice. Once the water was finally brought, it was watered down flat mineral water that tasted horrible. When we asked the waitress about it, she assured us it was regular water, they just keep it in rinsed out mineral water bottles. The food was just okay, I got one of the flatbreads. It was good but not great. Service was poor."}
{"text":"We had such a lovely time at Gusto greeted so warmly at the bar by the managers. We came for wine and appetizers. The calamari was the best I've ever had, I couldn't believed I ate the calamari that actually is little octopus whole, but let me tell you it was fabulous. Their marinara sauce is so fantastic I wanted a bowl so I could eat it pain with a fork, but the garlic bread did a great job of transporting the sauce. The wine that was recommended was just perfect for me, sweet, not too sweet.. and the owners and staff were just enjoyable and hospitable. Can't wait to try their meals."}
{"text":"This is an atypical tapas bar. First, there seems to be a crisis of identity. Is it a tapas bar or an Italian pasta place? Fresh pasta is wonderful, of course, but the fare is supposed to be Spanish. The execution of the pasta (we had the carbonara) was mediocre and bland. The pancetta seemed to have been thrown in and was not properly incorporated into the sauce. For a more authentic experience, it would've been better with guanciale, but beggars can't be choosers.

We started with the cheese plate and, while it was delicious, it exemplified one of the problems with the restaurant: it was huge. We had been looking forward to lots of different flavors and bites, but wound up only ordering a few things because they were too large. The cheese plate special was also $15, which might have been a hint had were known that.

There was a ceviche on the menu, thankfully, to remind us we were, in fact, supposed to be in a tapas bar. Unfortunately, it was also a bit bland, lacking both the spice and acidity that makes them so great.

All in all, it's a skip. Charlotte does not appear to be a tapas town."}
{"text":"I literally love Gusto so much. It's a great place to get pretty delicious fresh pasta at a reasonable price. I've only been here for lunch, but all three times it has been pretty great. Right now, they're running an amazing lunch special where you can get a half soup or salad with a half panini or lunch pasta for $10. So far, I've had the caprese with bucatini and meatballs twice. Both times, it was so so good. Their pasta can be somewhat mushy, but that's what I've come to expect from fresh pasta in restaurants. Also, with half price tapas from 3-5 (I think??) this place can be a STEAL!!!"}
{"text":"Wonderful place, great out doors, good food but please note that the tapas are not like those at Miros. The stuffed avocado/shrimp ceviche/chips are ONE mix and plate. Still, the food is very good. Wish the entrees were not so pricey but quality and appearance are spot on. Oooh and zeppoles are not NJ Sicilian style BUT excellent!!"}
{"text":"Had a work dinner here with about a dozen colleagues.  We ordered lots of tapas as appetizers as well as some entrees.  I had the NC Mountain Trout and found it to be quite tasty and an appropriate portion.  However, I felt like the appetizers (tapas dishes) were a bit overpriced for what they were.  The calamari did not have much taste.  The patatas bravas were basically potatoes covered in a cream sauce - again, not much flavor.  We also had some type of meatball in red sauce which was A-Ok and mussels in a red sauce.  Service was reasonable for a group of twelve.  Just sort of underwhelming.  Would probably go back, but with lowered expectations."}
{"text":"My husband and I were looking forward to our Friday date night / Restaurant Week dinner. However, like others who have posted here, we both ended up with mild food poisoning and spent the weekend sick from the dinner we at at Gusto.
That seemed to add insult to injury that after we had been told by the owner's of Villa Antonio that our gift cards would be honored at Gusto, we were told they were not any good there. I understand that the \"partnership\" fell through and the owners of Gusto are no affiliated with the former owners of Villa. BUT, a little bending would have gone a long way toward keeping us as customers. My husband was the very first customer at Gusto when they opened. We've had several large business dinner's there plus all the folks we have referred to Gusto. A compromise would have gone a long way toward keeping good customers. #BadCustomerExperience

I also posted a bad review on their Facebook page, and they blocked me from their page. Seriously?"}
{"text":"Wow is all I can say, and not in a good way. We had some of our party come late so we ordered  they're food ahead of time. When the rest of our party arrived they waited for their meal for about 20 minutes which never came. The server came to the table saying that they needed the table for they're new reservation coming soon and that they boxed up the food for us to go which was unacceptable ( basically kicking us out)! I've worked in the service industry for a few years and in high end restaurants in South Park, this is not the way to treat your customers, the server should have asked if she could move us to a new table or the bar and bring the food out there! This was our first and last time we will set foot in your establishment. And from the the way the management replies to negative reviews ( he has a poor excuse for everything ) nothing is going to change."}
{"text":"The hostess was incredibly rude. We had a reservation and were seated at the table closest to the door. We were a party of two. Another party of two came in after us without a reservation and were seated in a very nice, more private, booth. Our waiter came to check on us and before he could speak, the hostess came to him at our table and said, \"that other table has been waving you down...when you're done here.\" Like we didn't matter at all! The food was ok. The service was ok. For the price it was beyond sub-par. We won't be going back."}
{"text":"The food is insanely amateur. It makes you mad as they advertise to be this gourmet destination , but produce food that is mediocre. That's 50 bucks down the drain. 

The salad leaves were old and the feta was cheap feta cheese you buy at the grocery store. The bruschetta was bland. Eggplant croquettes were somewhat ok.. And the crab cakes should cost 6 bucks for their quality and not 13. 

Wish I went to mellow mushroom next door instead."}
{"text":"Nice atmosphere. Very pricey for quantity. Red sauce very bland. Staff was slow ,but new so hopefully they get better organized."}
{"text":"The fella and I made Open Table reservations for a Wednesday night, and we were warmly greeted and seated at a table facing the kitchen - super fun. That was the best part of the whole evening.

Our waiter was pretty subpar. When I told him we were going to put together some tapas, stated that we're hearty meat eaters, and asked his opinion on the best ones, he grabbed a menu to look at it and named four tapas with no meat. All righty. So, we struck out on our own, and here's how they shook out:

- Cilantro skewered chicken ($8 for 2): three pieces of chicken on a skewer came in a naan taco, so that's how I ate it. There wasn't much taste and the chicken was dry.
- Calamari ($8): Calamari can be tricky, and theirs was chewy and bland. Thank goodness for the chili sauce because it helped soften it up and add some flavor.
- Shrimp ($10): The shrimp were tasty, but I was in it for the sauce, which was garlic, olive oil, parsley, and sherry vinegar. I was hoping it would be delicious enough to soak it up with the one piece of bread that came with it. It wasn't. It was really... thin.
- Meatballs ($7): The cheapest option and the best! Too bad there were only three because I was still hungry by this point and the fella wouldn't let me eat all three.

Since we had a table facing the kitchen, I could tell that it was a cluster back there, too. Dishes were coming out and sitting for long periods of time under the heat lamps before they were taken away; all the while, staff were hanging around chatting.

The atmosphere was cozy and there seems to be a ton of seating (booths, tables, high tops, etc.), and that's about the best thing I can say about Gusto."}
{"text":"First time there; sat at bar near kitchen at 2:00.  Very pleasant and quiet time to be there; excellent homemade pasta and meatballs.  Wife had eggplant which was overly salted - as we find much food here in Charlotte - but well prepared and served with excellent/colorful quinoa.  Bloody Mary well done!  House Chianti also high quality.  Would go back for sure!"}
{"text":"I love this place! Service is magnificent, tapas/appetizers are wonderful, and the food and wine is superb. This is my new fav place!!"}
{"text":"This place is a breath of fresh air in ballantyne. Food is real good. Enjoy the diversity of the tapas. Staff is friendly. The special cocktails they serve can quench anyone's thirst. Place is not too busy and great place for a lunch date. Parking can be hard."}
{"text":"Maybe it was because we came near opening time but I don't know if I'd come back. The two stars came from my sangria, which was excellent. The parpadelle carbonara was very salty and bland. The two guys talking behind the grill have been talking about \"shitting\". No kidding. All I hear is \"I was on the shitter for hours\". I understand wanting to tell your coworker that but maybe be a little more quiet about shitting while I eat."}
{"text":"My husband and I love Gusto's! It is our go to place in Ballantyne! We have tried everything from the tapas, pasta, and brick oven pizza and never had a bad meal! Their brunch is also very good! Would recommend to anyone!"}
{"text":"Gusto restaurant is very good

Had dinner there last night food and service was excellent
Our waiter Rubio and the manger were both excellent 
Will go back soon
Ed
Had dinner here on Friday with my daughter and 
son in law excellent again!!
Rubio our waiter was very very good and the manger as always made sure all was OK
Tried the ribeye as did my son-in-law excellent
My daughter has Shrimp and grits very good

For a Italian themed restaurant these choices were 
Surprisingly very good
Will go back"}
{"text":"Service was horrible, food was worse. We were drawn to this place because of the 'fresh pasta' they advertised. Pasta was gummy and tasteless, and the sauces were equally flavorless. Save your money and pass on this place."}
{"text":"We had our son's rehearsal dinner at Gusto recently. The food and the service was excellent!! Their event planner, Charlene, was very helpful and the wait staff did a fabulous job for our large party in their private room. We were able to decorate the room and our guests were all very impressed with the venue, food and their service. I would highly recommend Gusto for any event!!"}
{"text":"There is a diverse selection of tapas and wine. This is a nice place to go with a significant other or a small group."}
{"text":"We had our company christmas here for 44 people.  The food was amazing and came out hot . The service was 4 star, everyone felt they had personal attention.  Truely top notch."}
{"text":"Went here the first weekend they open, amazing service talked to the owner Anthony and made my mothers Birthday dinner a good one. Great salmon , and chicken Parmesan. Will be going more ofter . Pricy though but great quality."}
{"text":"Delicious sangria (try the wild berry!) and the tapas were yummy. Not sure why they didn't pick a style of food and commit (Italian, Middle Eastern and nothing \"Spanish\" outside of Sangria) but still fun and delicious. Service was great. If I lived in Charlotte this might be a regular spot to eat at w my girlfriends."}
{"text":"We went in to celebrate my husband's birthday. Had tough time ordering. They do not have one single entrée without eggplant in it. As if that's the only vegetable that exists. Good quality wasn't bad. But waitress was terrible. We asked for water, she brought us left over water from other table and asked if that'll be enough for us. Seriously?! 
My husband was so mad he didn't eat anything at all. I had to order something else from another restaurant. 
So that was our experience. Hope you have better than that."}
{"text":"Service too slow. Party of 5 and a few dishes ok but others disappointing. Bisque barely warm. Salmon over flat pasta good and sauce excellent. Do not plan a return visit."}
{"text":"Went on a Saturday evening with two friends and had a great time.  We shared several a pitcher of Sangria and several tapas, each one better than the last.  Service was great.  The only thing I didn't love (and this is personal preference) was the atmosphere.  While it is clean and has a nice, modern décor, the seating is very open and not private.  Fortunately, there weren't many people there that might, so we had privacy anyway."}
{"text":"I had high expectations for this place because I absolutely love Ballantyne Village's restaurants, but Gusto is a no to me. The food ended up being cold and plus the food tasted okay, but not the best. I went there around 2, so the place wasn't crowded. Tomato basil was to liquidity and there was a weird huge oil spot in the middle of the soup. Calamari was alright, I had better. Chicken Parmigiano was cold. Sangria was decent."}
{"text":"It may just be that I had too high of an expectation for this place. My sister has raved about it since her first visit there many months ago. We decided to meet there for dinner one night because winter weather perfectly complements pasta. 

I am a foodie so when trying out a new place I like to look at the Yelp photos and review the menu before I go. The first thing I noticed is that basically every carnivore entrée was $18-$20. For pasta. So rave review from sister + touch pricey = high expectations. 

There was plenty of seating on Sunday night so we were able to snag a booth. The host left us with the menus and then we waited - and waited - closed our menus and waited some more. The waitress stopped by to bring a glass bottle of water (yay! I much prefer self-serve water at restaurants) and took our drink orders and was gone in a flash before we could put our appetizer order in.

When she did come back to us, with a generous pour of wine, we ordered the seared tuna to start and each had the bucatini and meatballs. If there were specials that night they weren't mentioned. 

The tuna came out promptly and was delicious. The two sauces down the side of the plate were delicious and I would have liked a bit more of them. My main came with a pasta I had never had before - bucatini. It basically spaghetti with a hole down the middle. The pasta here tasted fresh and the sauced paired with it was light and flavorful. The meatballs were decent.

All said service was a little slow and the food was respectable but not particularly memorable."}
{"text":"Amazing food! Great atmosphere! You have to try their amazing food. Mushroom bolognese is phenomenal. Even vegan!!"}
{"text":"My wife and I wandered in by accident last night to this new Italian/tapas place. We were greeted by enthusiastic and knowledgeable servers. My wife ordered the osso bucco, which was phenomenal. I had the chicken parm, also excellent. Happy to have a new restaurant in the neighborhood that cares about its food and customers. Will be back for sure."}
{"text":"Not that it matters anymore I guess, but we had a rehearsal dinner booked here and the restaurant closed without notifying us. They kept our deposit and we have been unable to get in contact with anyone regarding a refund."}
{"text":"Went for first time and absolutely love the food! I got the tortellini and it was the best I have ever tried. 
Will be going again. Staff very friendly as well."}
{"text":"I was very impressed. We had an excellent server (wish I could remember his name), and our food was fantastic. I highly recommend the meatball tapas dish. They were tiny but mighty in flavor!  We took advantage of their homemade pasta selections. My Mom loved her Spinach Torchio with Shrimp, and my pasta dish was a ravioli with lobster cream sauce..decadent but tasty. 

If you're looking for lighter options they have great looking salads, and even a \"pick two option\" where you get a half pasta and half salad selection. Another must is the sangria. The classic red was not overly sweet and was refreshing. 

We will definitely be back!"}
{"text":"I visited Gusto for the first time last month to get drinks with a friend. The service was slow but the sangria was amazing. My friend chose to give it another chance by hosting her birthday dinner at Gusto a couple of days ago. Horrible service! We arrived there early to set up only to find out they made an error with our reservations (reservation for 24 was marked down as a table for 6). We waited an additional 30 mins to be seated with no apology. One of our friends lost her ID and had been using her passport as identification while waiting for her new license to come in the mail. The server kept questioning if her passport was a legitimate form of identification. Despite the slow service the food was average. No special treat for the birthday girl. The server lacked social skills and did not personally hand out our checks. I don't think this place has given me much of a reason to return."}
{"text":"We live very close to Gusto and loved it after its long awaited opening.  We went multiple times a week to sit on the patio with our dogs or do takeout.  Over the past couple months Gusto has really taken a nose dive.  Paninis got dry and way over done, minimal sauce when it was supposed to be added to them.  Chips were put in the same container as a hot panini and became soggy and basically inedible. Extra sauce, when requested, was provided in a very small fast food burger joint size condiment container and rarely was enough to add to both halves of the panini.The absolute best dish on the menu was the chicken manettone, half a breast winglet drum stick on, skin on, cubed potatoes and asparagus all very nicely done in a delicious lemon citrus sauce. You could ask for extra sauce and they would cook it right in with the dish. No Problem.  Could not find anything like it anywhere else in town and it was worth the visit by itself. Well, after getting a few overdone, not sauced paninis we decided to give Gusto a rest.  Earlier this week, after a month or so of not going, we thought we'd give them a second chance.  So we ordered one of our favorite paninis for takeout and I specifically ordered extra aioli sauce on the side and asked the hostess to PLEASE make sure the chips were in  a separate container.  She assured me that that was the only way the kitchen was doing chips now.  While the panini itself was actually done quite nicely, the owner had put the chips  in the same container as the panini (you guessed it - soggy, soggy, soggy from the heat of the panini) and the side of aioli sauce we got was in a container the exact size of the aforementioned fast food condiment containers.  Hardly enough to cover both halves of the panini.  Luckily, I looked inside the bag after only going a few yards and saw no separate container of chips so I went back in and asked the lovely hostess - \"Where are the chips??\"  So the she very nicely went and got a separate container of chips and put them in the bag. By the way, we are quite well known customers so I was not surprised the hostess went to get the chips with a big genuine smile.  We have always been very respectful and nice to the staff. So the beautiful Tuesday night we had this week led us to take our dog and sit on the patio for a wine and beer and order to go.  We ordered our favorite chicken manettone and the meatball tapas.  When we got home and opened the chicken,  I first noticed that there were now two chicken breast cutlets (not the previous delicious half breast with skin on.)  The potatoes, which used to be cooked in with the chicken and asparagus in the sauce, were in a separate plastic container and were dry as a bone - ZERO SAUCE on the potatoes.  There was also hardly enough sauce in with the chicken to even dampen it.  We had asked for our usual extra sauce.  Although it used to be cooked right in with the chicken, potatoes and asparagus, it was on the side, again in a the fast food condiment  size container and in no way was enough to flavor.the dish. The chicken cutlets were mealy and very thin - NOT EVEN close to what was stated on the menu.  On a positive note, the meatball tapas were as good as before.  We called the owner the next night she informed us that she had changed the chicken as it was \"too labor intensive and expensive\" to prepare.  She also said that it was she who had put the chips in with the panini without the separate container. I note that we paid the same as for the previous chicken manettone.  She also told us she has removed the center cut sirloin steak from the menu in favor of a butcher steak!!  WHAT??  Is there any comparison between center cut sirloin and shoe leather tough butcher steak?? M'thinks not!! By the way, I just brought the latest issue of Ballantyne Magazine in from the mail.  What propitious timing!! Right there on page 49 in the article praising Gusto is a picture of the chicken manettone that we so dearly loved to cross our palates. Note the very nice portion of delicious citrus sauce in which the dish is swimming. Oh no!! It is the original dish, not the second rate chicken cutlet version that you can get almost anywhere in town under such intriguing names as chicken francaise, breaded chicken cutlets, Burger King or McD's crispy fried sandwiches (except the Gusto version is not crispy),, etc.  Need I go on?  SORRY to all the great staff, but we are done with Gusto.  Too many other truly good places in Ballantyne. Save yourself the time, money and disappointment - go somewhere else."}
{"text":"My husband and I went there for the first time and realized that it had only been open for a couple of days. Everything was wonderful. Looking forward to coming back again and try new items."}
{"text":"The restaurant is larger than I thought. They take reservations on weekends which is awesome!! Our server was awesome. I forgot his name, oops! 

We started off with the wild berry sangria. It was refreshing and not too sweet and not too bitter. It had fresh fruit in it which I loved. Everyone at the table really enjoyed it. 

We got all tapas. I got the shrimp scampi and it was delicious. Came with a few pieces of bread with large shrimp in a delicious sauce. It wasn't too heavy. My husband got the potatoes and they were awesome. Just the right amount of crisp to it and the sauce was good and spicy!! My friend got the goat cheese dip. We all loved it. We also got the calamari. It came with sweet chili sauce and lemon sauce. I liked it better with the chili sauce. We also got the chicken naan and they were delicious as well. 

The service was excellent. The food was delicious and the atmosphere is just very welcoming. They had a interesting choice of music. I heard Iggy Azalea, Justin Bieber and a few techno like music. The manager possibly owner was there. I saw him before at Villa Antonio. He greeted us when we got there and told us bye. I noticed he was working hard too like everyone else. He was getting stuff for people and being attentive. To me that shows he cares about his restaurant. I've seen so many owners/managers just stand around and not do anything so it's a nice change to see this. 

We will definitely go back!"}
{"text":"Went for lunch on a Saturday and was seated right away (party of 2). Plenty of other seating with other parties of various sizes. 
Atmosphere was elegant yet not uptight. Staff was friendly and welcoming and took the time to express appreciation of our stopping in. There was a brunch menu or regular menu. Tons of options for tapas, sandwiches, salads. It was hard to choose. I did the half salad half pasta combo. Salad was baby greens with a sundried vinaigrette and the pasta carbonara. The salad was fresh and the ingredients and portion were perfect. The pasta was a little on the salty side but the noodles were definitely freshly made. Husband had the combo as well. The grilled Caesar salad was still crispy and the dressing tasty.The chicken Panini had fresh tomato, buffalo cheese, avocado and the bread was the perfect was the perfect texture. We look forward to going back to sample all the tapas options. They even offer curbside pick up."}
{"text":"I went for lunch with some coworkers I'd been wanting to try this place. It's a great Italian place love it I'll be back. The dish I ordered I saw it had buffalo mozzarella cheese. I literally took to my phone an it's a cheese made from the milk of the water buffalo . They also make their own pasta . I had a pasta dish with grilled chicken with spinach an buffalo cheese which is mouth watering. It's like a goat cheese almost yum. They have their own bread which we asked for very good. Great lunch specials an responsible . I will be back my whole table loved their dishes."}
{"text":"While I grew up in Charlotte and my family still lives there, my now husband and I were on the hunt for a rehearsal dinner restaurant for our Charlotte wedding while planning from our current Boston home. Many of my parents' favorite restaurants were not large enough to host the number of guests we anticipated, so we took to the internet and word of mouth for restaurants that might fit the bill. After contacting numerous places, we settled on Gusto! - a restaurant my family was completely unfamiliar with, but had a fabulous menu at just the right price as well as a room to fit our guests.
      From our initial contact, the staff at Gusto! could not have been more friendly and accommodating. They ended up not only hosting my local parents for a complete tasting meal a month before the event, but also my picky out-of-state in-laws just a day prior to the rehearsal dinner. Charlene Teiro, the special events manager, went above and beyond to make sure everything was perfect for our day- so much so, we wish we had her as our wedding planner! She would respond to emails at all times of the day- her enthusiasm and complimentary demeanor made a stressful time so much easier. (Not to mention at our event, she was so friendly and sweet that our guests assumed she was a family member of mine!) 
     The night of the rehearsal dinner came and their private room was the perfect space-large and private enough to make it seclusive, but just close enough to the restaurant to still make it feel lively. The room accommodated all of our guests and even had two TV displays to play a slideshow of pictures throughout the dinner. Beyond this, our waiters for the evening- Rubio, Derek, and Daniel- were magnificent, tailoring to our every need. The three course meal was outstanding (my favorites were the salmon, homemade gnocchi, and tiramisu!) and their generous pours for my new Russian in-laws made for a very merry evening. Anthony Garcia, the sommelier who also largely helped with our event, was beyond welcoming and gifted us with many bottles of wine before our evening was over. 
     We left feeling as though we had just celebrated at a family member's house. Everyone was so beyond welcoming, warm, and inviting. Many of our guests enjoyed the evening so much that they went back to Gusto! the next day for lunch before our wedding and my local parents are surely adding Gusto! to their rotation of favorite restaurants.
    My husband and I can't thank Charlene, Anthony, Rubio, Derek, and Daniel enough for such a special evening. Everything was so perfect and wonderful that I was worried it would upstage our wedding the following evening at a local country club. We can't wait to visit again as a newlywed couple next time we're in town and to celebrate our anniversary! So if you're looking for a dinner event space or just a place to get some great food and drinks, do not hesitate to stop at Gusto! They'll treat you like family."}
{"text":"This place was sooooo good my husband and I had to come two nights in a row, We'd just came from vacationing in Italy and the pasta at Gusto's was EVEN better!! P.S. Order a pitcher (or two) of the tropical sangria.. You'll thank me :)"}
{"text":"The food and service were both wonderful, but you feel like second class citizens if you don't have a reservation. Even though 50% of the tables were open, we were put in the back room, corner table. I thought perhaps more reservations were coming. However, there were more open tables when we left than when we arrived. We asked to be moved up near the bar, but were told those were just for reservations. The atmosphere was a big negative as a result."}
{"text":"After rejecting an hour long wait for Easter Sunday brunch at Terrace Cafe we walked across the street to Gusto. Pleasantly satisfied with the food and service. I've eaten here for dinner and didn't know what to expect for brunch with a place that features its homemade pastas and wood fired pizzas. My mom and I enjoyed over easy eggs sitting on a bed of asparagus with home fries and bacon. Everything was cooked just right. And the service was very attentive. We were a bit early to enjoy the $5 bloody Mary bar but I'll be back for that."}
{"text":"Very good tapas.  They've recently updated / reduced their menu.  Never tried the old menu, but there's plenty of great things to eat.  The Shrimp Ceviche is incredibly fresh.  Try the lobster and shrimp bisque.  The crab cakes, bacon wrapped dates, and mussels in white wine sauce were among our favorites.  Soon to become one of our local favorites."}
{"text":"Great place. Great friendly service. Try the ceviche. Needs more local beer. I came late at night. I want to come back for main courses."}
{"text":"Loved the Greek tacos, service was fabulous. Prices were reasonable, great atmosphere for a date night"}
{"text":"This place is owned and operated by those who owned \"Villa Antonio's.\" They basically created a less upscale Italian restaurant.

The place looks nice, a little too bright but it's much cozier than Villa. The hostess seemed annoyed when we asked for a booth. 

However, the service is terrible. We ordered to carpaccio & the shrimp and avocado ceviche. After 30 mins of waiting we got our carpaccio. The portion size was just sad, and we never got the ceviche.
They brought our meal out as we were munching on the app. 
I had the spaghetti & meatballs, the pasta was lacking sauce and over cooked. 

Mind you we had to ask for bread, parmigiana, and struggled to alert the server for drink refills.

I don't know if I'll ever be back. It was pretty painful."}
{"text":"Disappointed when I went in for lunch a month or so ago the guy gave me a Harris Teeter teabag and charged me $2.25 for it! I wrote a note to management and felt completely brushed off - simply getting an excuse and not so much as an \"I'm sorry\" simply \"that shouldn't have been what you received\" - no further attempt to credit me $2.25 - or even offer to fix it on my next visit. Therefore, there will be no more visits. I really want to like this place"}
{"text":"You have to come eat the best scratch made food from local farms. I came for lunch with friends and had a blast. Great service and grab the fresh bread on the table to begin a sublime experience with food."}
{"text":"Gave the place another try. It's okay. It's not great. Still lots of water from the pasta. The price is right. It's an easy in and out for lunch. Will return."}
{"text":"Restaurant staff very friendly. Pricey for what I got - but authentic to Tuscan food. House Salad with olives and grilled chicken large size was the size of a typical side salad at other restaurants with 3 oz of grilled (crusty) chicken --$15 --  wife ordered Lasagna and LOVED it. Bread was very tasty. Salad was good but too pricey for what was received. Combined bill was $41 for one lasagna and one salad (side size was considered large) -- addition our bill did include a glass of house wine."}
{"text":"If you are looking for FRESH Italian then this is your spot!  I got the shrimp pappardelle for lunch and it was delectable.  The Caesar salad is a must to try with their dressing that is made in-house.  I also got a taste of their lobster & shrimp bisque...my husband loved it!  They also provide their bread & olive oil with the meal, and I have to say their warm sun-dried tomato bread was everything!"}
{"text":"Gusto! No, thanks. Today marked my first and last visit to Gusto. The food was bland and the service was non existent. I get better service at Vapiano where they do not have wait staff. Angel was our waiter but did not wait on us after taking our order. I had to waive him down as he gingerly passed by our table to request salt for my tortellini and drinks for our table. Drinks finally showed up when we got our check. My wife ordered the gnocchi. It was over salted and bland. Worst gnocchi she has had in a restaurant.  I ordered tortellini with pesto cream sauce. Honestly, I think buitoni tortellini tastes much better than Gusto's attempt. What a horrible experience."}
{"text":"ok, Went this past Saturday and arrived around 7:30. We ordered drinks which took long. They were already out the Calamari Appetizer!! Who's doing the buying here that calamari runs out at 7:30 on a Saturday night??? Our server was sweet, but our service was slow. The place wasn't crowded at that time, so I'm not sure what happened. We only ordered apps. The shrimp app was delicious with a nice piece of grilled bread(that we asked for more of) for dipping. It was in a sauce of sherry, garlic, and herbs. Really good. We also ordered the stuffed avocado. We expected an actual \"avocado\" stuffed with a shrimp ceviche, but what we got was an avocado TOWER. It was a tower of diced avocado, shrimp, peppers, etc. It was beautiful and very good, just didn't expect it, that's all. We also ordered Potatoes Brava, which were red potatoes that were supposed to be crispy which they weren't and I asked for more sauce and the server brought out Palmorodo (tomato)sauce that looked nothing like what was on the potatoes. They were ok. Miro's beats this place hands down for those potatoes. We then ordered dessert and I got the Tres Leches which should be drenched in the three milks and it was very dry. My friend ordered the bread pudding, was brought Ricotta cheesecake, and then her Bread pudding came out and it was very dry as well. I ordered a cappuccino and it took so long and we had finished our desserts by the time it came out and the explanation I got was that they misplaced the frother. Really?? I know they just opened like a week ago, but cmon!!  Anyway, Id give it a second try, but if youre looking for authentic \"Spanish\" food, not that Gusto claims to be Spanish, but go to Miro's. I was supposed to go there but wanted to try the new place. I wish these guys luck."}
{"text":"Yesterday Sunday 02/28/2016 my Mother and I had a late lunch / early dinner around 3:45pm, the service was sub-par, the food was not cooked well, and the time to deliver the meal was over 45 minutes, smaller plates I understand, but waiting between 15-20 minutes between versions of tapas was disappointing, the server forgot the wine which was delivered 3/4 into the meal, and the menu although did list some of the ingredients in the dishes, did not list the majority..nor the level of spice..  We were left unsatisfied with the experience, the kitchen seemed to be poorly run as another reviewer said, and the manager when confronted did apologize, the wine was removed from the tab, after the fact they attempted to make the best of the situation, but being upfront about menu wait times, having knowledgeable staff, and the showcasing all the ingredients in dishes would assist in the future."}
{"text":"Wow wow wow!!! We finally made it in to try this restaurant and sooo glad we did! We had the Caprese salad, Grilled Salmon and tortellini with shrimp... Amazing! Great atmosphere...tonight there was a jazz trio playing.  They had some computer malfunctions which should have been chaotic (I guess to the staff it was) but we didn't notice a thing...they handled it with ease! Will definitely be back.  The owner, Carolyn is so cool and personable...loved how everyone (from the owner, the hostess, to our waiter and even waiters that didn't have our table) made us feel welcome! We will definitely be back."}
{"text":"Went for anniversary dinner, but experience was underwhelming. Our waiter's accent was so thick that we struggled to understand him. He stepped away in the middle of us ordering and 10 minutes after we ordered sangria, he came back to ask what we had ordered. 

The shrimp ceviche was very good. The eggplant croquettes were just mushy and burnt. My husband ordered paella, but what they brought him was obviously risotto. We decided not to say anything. My chicken parm was mediocre...too thick and tough. Pasta sauce was not very flavorful. 

Eventually a manager type came over and asked, \"How is the paella without the saffron?\" We told her that it wasn't paella, and she told us that they ran out of saffron, so they made it without. When I said it was risotto, she admitted that they used risotto. After a bunch of excuses, she and the waiter walked away. 

She eventually came back and offered a dessert, which we accepted. It was a flan-like custard. It was very thick, not silky like the flan we are used to. That just might be the Italian version. 

They may get one more chance, but not likely. There are too many good places to go to without spending money on mediocrity.

Oh, and if you're wondering about attire...business casual is appropriate. We saw some people in shorts and flip flops, but they looked out of place. 

Small outdoor seating area is probably good for people watching."}
{"text":"If you've never been to a tapas restaurant, do not go on an empty stomach unkess you're ready to soend money on more than one plate. Tapas are not large platters of food. That being said, i had parpadelle carbonara. It was good. Not the best, but good. Needed more sauce or something, i felt like I was eating only noodles. My husband and I weren't impressed by the food, but I guess we're neither tapas kinda people not pretentious enough for the area. Who knows. However, we did have family in town with a toddler and the staff, although somewhat ignoring us the first 30 minutes, did bring her crayons and stuff. So they are somewhat kid friendly."}
{"text":"Went for dinner and made a reservation for 6pm.  My wife and I arrived at 530 and since it was beautiful out we asked if we could have a few drinks and tapas on the patio before having dinner inside... We were told \"no problem when you are ready let us know\" and we were seated outside.  We had a few drinks and a couple of tapas.  The drinks were great and so was the food. At about 6:30 we asked if we could be seated inside for dinner.  I was told \"no all the tables are reserved\". I was perplexed and explained the situation and what we were told (not to mention the place was empty and I already spent $60 on drinks and apps). They stated they would give me a high top facing the kitchen.  I guess I didn't have much of a choice.  So we were seated and now we are told they can't add my dinner to the tab I was running so I had to pay that tab and  then pay for dinner afterwards. We then ordered dinner and the food was excellent.  The lasagna was flavorful and fresh.  My wife had the salmon and orzo and it was perfectly cooked.  After dinner, I was still a bit annoyed about the table situation and brought it to the attention of the manager.  I explained what happened and he didn't really say much the than sorry.  When we left there were still empty tables that no one ever sat at.  Overall the food was great , drinks were great, waitstaff was great. Front desk and customer service could use some work"}
{"text":"Tough call on this one but might try it again. 

Ceviche was very good. Paella and shrimp risotto was terrible. Tre leches was wonderful. Generous wine pours. Very nice service and atmosphere. $120 for drinks and dinner for two. 

Will try pasta next time. Menu is not logical at all."}
{"text":"This is a sad story of a place with good food and just miserable service.  It is Saturday night and the restaurant is barely 60% full.  We called them twice the first time they said they could not accommodate our party, 10 minutes later they said they would. We walk in and the first thing they tell us is they may not have enough menus, keep in mind at this point they are barely 60% full.  

I had to ask for bread, they never filled up our waters or drinks again.  They forgot our quinoa salad and when they brought it was overly salty and disgusting.  The pastas were tasty and the appetizers were good as well.  I just don not understand how you run such an inefficient business. 

Lots of options when I come to Ballantyne, this will not be one of them."}
{"text":"Just got done celebrating Mother's Day here - save your money and go somewhere else. Server was not engaged or hospitable, and you could sense a general malaise from the staff. Nobody was smiling on the staff which tells you a lot. Manager came to deliver appetizers and just slammed plates down, didn't say anything. Expect more out of a place that charges so much. When I addressed my disappointment the manager responded by telling me they generally have good reviews. Won't be getting my business again and I'll be sure to share this experience with others."}
{"text":"I made reservations for two. We were seated promptly at a high top next to the kitchen. We're short and we don't like our feet dangling. We wanted to eat here because every time we walked by people looked like they were having fun. We did not have fun. Food was cheap quality. Drinks did not have enough alcohol. The tapas were way too large. This is a place where the food the owner likes was slapped on a menu that he decided it was called northern Spain influence. Ha no. We've experienced fine dining at its best. I would place Gusto in there middle. Calamari was overcooked thus making it rubbery. The pasta was tough. Music was loud. The staff was obnoxious and not in a good way. They talked too way much. We wanted an intimate date and we had a finish your dinner then let's go to The Gallery for real drinks and atmosphere. Sadly, we will not be back."}
{"text":"Wonderful lunch special.  Enjoyed the caprese salad.  Friend had pasta, fresh made...looked excellent"}
{"text":"Went here for brunch, pretty good place!

The food was good and the service was attentive.

Best tip about this place: they have a Bloody Mary & Mimiosa bar you just walk up and tell them you want one (it's $5 total!)."}
{"text":"Second time here, both times the food has been ok...but service has been horrible. After an 1 hour and 15 mins we had to ask for our entrees. My scallop noodle dish had 1 only one scallop. I had to wait again to get scallops. Food doesn't trump bad service...probably won't be back."}
{"text":"Ate here to avoid 485 traffic before driving back to uptown. The restaurant was almost empty which is unfortunate because the food was AMAZING. I had the braised short rib with gnocchi. I love gnocchi and use any excuse to order them. They did not disappoint. Since the restaurant was empty and their was no less than 15 employees, I would have expected a bit more service and checking in while I was eating. Great little option in Ballantyne, will definitely be back when back in town."}
