{"text":"I wanted to like this place but I can't. Mostly because the service isn't good and I don't like being in a negative atmosphere. The lady who served me frowned the whole time and looked like I was troubling her even though I was smiling and nice. My sister says she went there once a few years ago and they weren't using gloves to handle food after using cash register. She pointed it out to them and left. They must have renovated since then because you can't see behind the counter where they are cooking now. What turned me off the service was that the lady was overly nice to another customer but treated me less than average. The pizza itself was totally ok but could do with more sauce. We ordered for a children's party. My neighbours also ordered from them and complained about lack of sauce but it doesn't make the pizza bad or anything. It just wasn't good enough to go back for more unless it was my only option."}
{"text":"UPDATE!!!!! 
It is now 1:56pm and the delivery guy just left with his 2 hr old, congealed, cold pizza with him! large 4 topping  (extra sauce, sliced tomatoes, porchetta, and bococcini) total was 27$ and some change. he offered to take a toonie off for the trouble. I COULDN'T MAKE THIS UP!!!!! THIS IS HOW THEY RUN THEY'RE BUSINESS??? WHAT'S HAPPENING BEHIND THE SCENES... IN THE KITCHEN!!!!!! MY BOYCOTT OF THIS PLACE BEGINS NOW!!!!!!!!!

Don't know how their pizza is I ordered it at 11:59am and it's now 1:50pm and it's not here yet!"}
{"text":"Enjoy a slice of greasy pizza while the lady with a dirty apron yells in a foreign language. Gross."}
{"text":"I've passed by this pizza place (on the edge of downtown B-town) about a million times, and finally decided to give them a whirl.

Standard pizza place fare: Pies, pasta, garlic bread, sandwiches, and salads. Good prices too (scored an extra large 2-topping for $15).  The lady who served me was also very nice.

As for the pizza itself, it was one of the better tasting ones I've had lately. Nothing spectacular, but more than worth the cost."}
{"text":"Gusto is practically next door, so we end up there a lot. I like everything there fairly well, and the prices are good. The toppings available are pedestrian, but of decent quality.

The service is acceptable most or the time, but sometimes it's really quite bad. One time, for example, they never started making our pizza and so it wasn't even started when we arrived to pick up. No apology, no discount, no nothing. In fact, they were pretty surly about it. 

Anyway, they're reliable, inexpensive, and local. Local is the key: if they were further away, I would order from there a lot less often."}
{"text":"My go-to pizza place, so it can't really remain a '3' can it? Italian-run, and though it may be North Americanized a bit, the toppings are still really good quality and a sauce that has the genuine tomato taste and not overly sweet like most other places. Crust is better than most too, and the meat is also much more authentic and higher quality.

I haven't experienced issues with quality or consistency in ages, so it fully merits an improved rating. Make sure you order ahead, they can take twice as long compared to chain places."}
{"text":"the place is ok, located in downtown Brampton, its an independent with its own unique flavor but, its just ok...."}
{"text":"I dont get why people didn't give a good review for this place. And who gave this joint a $$$ price, it's actually only $, ok? It's not that pricey, same like pizza pizza. 

I went there for the first time yesterday, and my first impression was, wow this place has so many orders going even though only another person was ahead of us ordering pizza. People were calling nonstop to put down orders for pick up. 

I ordered their large pasta with garlic bread for $6.99 and I was impressed. The pasta portion was humongous for the price, I have enough leftovers for lunch the next day. 

We also got a large pepperoni pizza for a decent price, and it was pretty good also. 

They do have plenty of ready sliced pizza if people would want a single slice only instead of ordering an entire pizza. 
The staffs at friendly as well. I am definitely coming back for their pasta it was amazing!"}
{"text":"Pretty good pizza but poor customer service.  By customer service I don't mean the people serving you do a poor job because the servers are usually pretty good.  What I mean is the owners don't care about pleasing their customers.  They do things like charge you double for toppings if you only want the topping on half the pizza or charge you for a topping if you want extra sauce.  I've never been charged for either of things at any other pizza place in my entire life.  It's too bad because their pizza is actually pretty good."}
{"text":"What a joke. Pepperoni pizza was greasy to the point where I had to keep it a way from me while eating so it wouldn't drip on my clothes. Not to mention being burnt and having little black specks on the bottom from their dirty oven. Just like other reviewers experienced, the skin and bones chicken behind the counter acted like I was bothersome and gave me screw face when I said \"thank you very much\" while accepting my mediocre pizza. 

GARBAGE!"}
{"text":"Gusto pizza was our go-to pizza place for a while then it lost its lustre with us. With so many options I think we just found something better, but when we were ordering from Gusto we did seem to enjoy it."}
{"text":"I like their pizza and veal sandwiches! Price is fair and i can't find one bad thing aboit this pizza joint"}
{"text":"Review update Aug 2015, after Jon W reminded me of my original low score

Plenty of slices to be had, specials now posted at the doors, they changed my opinion from 1 to 4 stars.  2 slices for $6 and they are delicious

One of the few independent places left in Brampton too.

Still took a point away for not allowing split toppings"}
{"text":"One of Brampton's best pizzas. More of an authentic Italian style pizza. Have specialty slices & ingredients to choose from. The wings are great too. Not a fan of their garlic bread or caesar salad but definitely worth the trip."}
{"text":"Good pizza and good prices.  My wife grew up on this pizza, living in the area, and she loves it.  I think its better than most chain places, but not the best pizza i've ever had.  The dough is rather good, but the rest (Sauce, cheese and meat toppings) is just average.  You can get a large pizza with a few toppings for a better price than the commercial chains and it tastes better and is better quality as well."}
{"text":"Wow.. wow.. wow.. How could I have missed this place? For pizza in the Brampton area, I swear on Venezia or Popular Pizza. Hands down best pizza delivery I've ever had! Toppings:

Pepperoni 
Anchovies, lol
Tomatoes 
Onions
Mushrooms 
Pineapples

The pizza is DELICIOUS. From now on if I am in the Brampton area, I am Strictly ordering from here! I got the meat ball sandwich as well and omg 5 out of 5 easy. Pizza 4 or 5 out of 5 easy. My goodness this is so delicious, I don't get the bad reviews? And the customer service was great as well, he was commutative and kind. Definitely recommend."}
{"text":"The pizza itself is pretty good, but delivery is super slow, took over an hour and I'm very close by! Also the toppings seem to be thrown on haphazardly, clumps of one topping on one slice and barely any on another. Slice sizes were also drastically varying. They need some quality control, but overall I was happy with the pizza"}
