{"text":"Placed an order, in person, on a Tuesday and paid for it.
Delivery was to be on a Thursday at 2:15.
At 2, I get a call that the sheet pizza is sausage and I ordered a plain. Since I had a group of students waiting, I could not wait for correction to be made. First error!
I had ordered a specialty salad minus the olives....It came with a ton of olives. On the receipt the - olives was inked off. Would I forget what I ordered? Totally disappointed with this local business."}
{"text":"Nasty food, nasty service.

Ordered delivery, was told it would take about45 minutes. At 1 hour and 15 min I called, was told that the food was enroute, was given the run around. Another 45 minutes pass when I call back this time I was told 3 different stories, along with my food was on its way, I asked where was it coming from? I mean had I wanted to wait almost 4 hours to eat I would have cooked at home. 

The manager was extremely rude, not willing to offer help or resolution. I called the next day still no answers and emails went unanswered. 

I will never order from this place again!!"}
{"text":"Got chicken here. It wasn't to bad but got an order of onion rings that were so bad I couldn't even eat one. Jo jos were so so. I wouldn't recommend this place to anyone."}
{"text":"Amazing pizza place. 
The ladies and gentlemen of Guys Pizza are so nice and they make an outstanding pizza. The owner clearly takes pride in making great pizza and every style of specialty pizza I've tried has been delicious. \"GUY on a Buffalo\" is hot and tasty as hell, and the \"Popeye's Pie\" is a garlicky God. I have a gluten allergy and haven't had any issues with their GF crust. My normal friends think it tastes damn good too, which is a shame because I have to share these delicious pies.
Thank you for making great pizza and being awesome people."}
{"text":"Cheesy bread was good. The same was brown and smelled old. They brought another one and that was also brown and old. The wrap was soaked in grease. They didn't replace it they just said it's a pizza shop it will be greasy. I threw it away. Complete waist of money. I should of decided on Chinese!"}
{"text":"Don't waste your time! The only reason I even considered this place was the 24 inch  \"New Yorker\" pizza. The pizza was the biggest I had ever seen however was terrible.The crust was like rubber, the sauce was very bland and the cheese was slightly Burt on top. The pizza tasted just like a cheap microwave pizza! To top it off, the employees were discussing. One employee was just eating pizza In front of the host stand and the other employee, who took my order, took the money then left and made the pizza with out washing her hands or using gloves. None of the employees had a uniform and looked very unprofessional."}
{"text":"the pizza is too expensive. i know it's a local place, but pizzas cost $2 at most to make, they wanted $17 for a large deluxe.
poor customer service as well. 
i suggest looking elsewhere for pizza."}
{"text":"Worst service in the falls.they dont even know what they sell.when u finally get what u order u way over pay for something that coulda been made from garbage scraps."}
{"text":"Poor service... Don't try to drop in here and wait for your order... They will make you wait for way more than half hour... Staff was not friendly as well. I will never visit this place again..."}
{"text":"Pretty good pizza at a decent price. Much better than papa johns or pizza hut. Great options other than the pizza, too. 

They have some tasty specialty pies, and a couple choices for sauce, regular or zesty (spicy).  I've had the Guyro Jr., too. I guess it's about a half pound of gyro meat. It's a huge portion and their fries and chips are original.

These guys are always pros on the phone and in person. I keep going back."}
{"text":"Sauce could have been a lot better. I would rather eat lil' Ceasers. Nothing to write home about."}
{"text":"Have ordered one other time from this guys pizza and it wasn't nearly as good as the food at the Lakewood guys pizza. Ordered 3 different kinds of wings and not only did they seem like they were cooked the day before but could barely taste a difference between the 3 flavors. Called them after being on hold for 10min I hung up and called again.  Told the manager and he gave me a $25 credit. Hopefully I can use it for the Lakewood one! Why would I want more bad food? Not one to normally complain but something is just not right there."}
{"text":"I will never order from this location again. I've ordered pizza from here 3 times and all 3 times there has been a problem. I'm not talking a small problem, I'm talking about problems like when I ordered a spinach and artichoke pizza and there weren't any artichokes on the pizza but there were mushrooms and other toppings that weren't listed on the menu. Or another time when I wanted to place an order for pick up and no one answered the phone at all. Or how about the time I ordered deep dish and received a regular pan pizza. Do NOT waste your time and money on this place."}
{"text":"Food is the same as the one in Kent, but the staff kinda sucks. They're just really unorganized and unconcerned, maybe a little rude."}
{"text":"I'd recommend possibly training your Cuyahoga Falls store to have better customer service. We placed our order and called back not even a minute later to cancel (which we hated to do but had to). The employee said, \"it's really annoying when people do that, we already started it\" and then followed up with, \"you gotta do what you gotta do bro\". We're sorry that we had to cancel but it really was not even a minute later. Very poor customer service to tell a customer something is annoying and say, \"bro\" to them."}
{"text":"Third time order from there. The other 2 times pretty  good . Sunday for the football game we ordered  boneless wings 12 hot 6 chile 6 bbq. They were cold and the 12 hot wings were some of the smallest pieces of chicken that I have ever seen. 3  or 4 good ones the rest were like crumbs. Never again"}
{"text":"Amazing Pizza!!! Sauce is sweet and you can actually see the tomatoes in the sauce. Wings are crispy and hot!!! Delivery was fast and on time and using the app was quick and easy:)"}
{"text":"I get pizza here all the time I always get the same thing the New York style pizza it is literally so big you have to turn it sideways to  get it in  your door and it very delicious the people are always kind courteous and knowledgeable about the product delivery takes usually about 40 minutes but we'll worth the wait"}
{"text":"As someone who grew up in the NYC area pizza outside of this region never compares but I tend to be subjective when trying this food elsewhere.

The sauce was a bit too sweet and the crust was somewhat doughy but all in all it was decent considering the locale. 

It was prepared quickly and the small pizza was more than enough for one person. There is only one table so this is take out/delivery only. They do take CC."}
{"text":"Geeze!  I'm surprised by the vitriol of the reviews for Guy's.  We live 2 blocks away and have ordered pizzas and \"Guyzones\" (calzones) here for a few years now.  We always pick up our order because the pizza shop is so close to home.

This week we ordered a Guyzone with extra cheese and extra nushrooms, and a Meatzza-pizza with double cheese and double banana peppers.  HOLY CRAP!!!  The pizza must have weighed 3 pounds and was one of the most exquisite pizzas we've EVER had!  My guyzone was surrounded by crispy, buttery crust dotted with parmesan cheese and filled with a stringy, gooey love potion of mushrooms and mozzarella.  OMG - we feel so lucky to live so close to Guy's!

When my husband went to pick up our order the chef told him that our Meatzza Pizza with banana peppers was one of the best he's ever baked!!  We are inclined to agree... it was EXCELLENT!"}
{"text":"Took two hours during lunch time to deliver our food. The driver was rude and said pretty much oh well we are short staffed ! 
We will never order again from here !"}
{"text":"Back in the day, I went to Guys in Kent.  To be honest, it was decent pizza - not great, not bad.  Having read fantastic reviews of Guy's Chicago deep dish, I decided to splurge and get one.  Huge mistake.  Here are a few \"highlights\" of this colossal waste of money:

Dough:  it was chewy, regular pizza dough, not high, and not crispy
Toppings: AWFUL.  There were handfulls pepperoni.  I counted - seriously, gobs stacked 5-8 pepperoni high.  I wanted a pizza, not a meat pocket.  Some sections had spinach, other sections had none.  Same with other toppings.  
Cheese:  Lacking.  The picture on their menu shows a chicago pizza.  there wasnt a consistent layer of ANYTHING on the top of the pizza.  not sauce, not cheese.  Honestly, there wasnt much cheese on the thing at all.

For regular pizza, guys is ok.  But they ripped me off on my order for a Chicago Deep Dish."}
{"text":"I'll keep this one short and sweet...well, not that sweet if you base it upon our experience. 

Let me save you some time; If you've ever had really good pizza, don't bother with this. Hell, if you've ever had mediocre pizza don't bother either. Chewy crust, unevenly distributed toppings, burnt bread sticks, a container of bland marinara sauce that was spilled over and macaroni salad that's actually pasta salad (bowtie pasta and vinaigrette dressing?). The pizza from Little Caesar's is actually better and half the price. And just so you don't think it's all bad, they did manage to get it delivered to our doorstep in about 35 minutes."}
{"text":"Like eating a pile of slop... and this is coming from a girl who likes all pizza, even Little Caesar's $5 Hot & Ready.  We ordered the Chicago style and the entire bottom of the box was wet from running sauce.  Hardly any toppings and sauce was so runny, they all slide off.  The sauce also tastes like tomato soup.  We were so hungry, we sucked it up, doused the pizza with ranch and ate.  So bad.  Please don't waste your money."}
{"text":"Like this location a little bit better than the Kent location. Possibly the best lunch deal out there...3 slices of pie and a can of pop for $3.00. They have Sat/Sunday gameday deals that vary each week, and always good things to try.

Try the big easy sauce on your wings...you wont go wrong...

And for dessert...deep fried s'mores!!!"}
{"text":"Yeah now I know why they put this place between all the west park bars, you have to be drunk to tolerate this pizza. It was terrible, first it was a sultry hot night, the place had zero air and literally heat from the ovens were emitting from the place. 

Second, the grungy, sweating man who took our order should have been another red flag. Not that cheap either, esp when there are so many other choices of pizza around Cleveland. 

The pizza itself was greasy and bland. Don't waste your time. There's a steak and shake right across the street, go there if you're looking for a late night fix."}
{"text":"Food was good, but it was soggy. Also, they took a very long time to deliver when it was just down the street! Seemed odd!"}
{"text":"Guys Pizza is new to Kamm's Corners and we were lured to try it by coupons stuck on our front door. We ordered on a recent Friday night. The man who picked up the phone to take our order was rude and rushed. We ordered a pepperoni pizza and wings combo for under 20 bucks with coupon. When we arrived to pick up, we realized that the location is right on busy Lorain Ave between two bars- parking was very limited and we had to circle several times to find a parking spot, then walk to pick up the pizza. When I walked in there were 4 people behind the counter boxing orders, yet no one greeted me. I stood there for some time and was grossed out to notice that one women who was boxing food was continually licking her fingers- lick finger, grab plastic bag, lick finger, grab styrofoam container, lick finger, pull a piece of parchment paper for the bottom of the boxes, REPEAT. I get it, plastic bags can be hard to separate, but this is just beyond unsanitary. Finally someone approached the counter and took my card, but they couldn't figure out how to run the card, so another women came over to help. Again, I get it, it's a new location. At the end of the day though, this is not a one star review because of the rude incompetent service or difficult to access location. It is because of the food. This was the worst pizza I've ever tasted. The crust was flat and dry, the sauce was overly sweet and chalky, the cheese was dry and transparent over the pizza.The crust did not appear to be made in house, but frozen. The wings were very small and slimy. We ended up throwing the pizza out. This visit was a big disappointment."}
{"text":"Amazing wings. The Cajon is some of the best I've ever had. The spicy garlic was really good (even if it lacks something to these Southern tastebuds). The guyzone was incredible. 

All in all an experience we will definitely repeat .. from home. No seating here makes \"going for a bite to eat\" a bit more difficult. But this is definitely a winner."}
{"text":"Terrible customer service. Who ever made my food under cooked it. Then they accused me of lying about not using an online coupon when I did. It wasn't even the manager who called to try and pick a fight! It was one of the guys who takes orders!   This place really needs to have someone come in and clean house! I wouldn't recommend this place to anyone. It's such a shame too since I love Guys Pizza places, but the one by my house stinks."}
{"text":"Pizza with a side of salt... never really had a fantastic pizza from this place usually only ordered it due to it being the only places open late and located close bye. Pizza and cheese are extremely salty and the side are nothing to write home about. If your looking for an ok slice of pizza this might be for you."}
{"text":"Love the pizza and wings, but the owner Scott is only around on the weekends and the staff and manager have proven to be RUDE. 

We ordered multiple pizzas for a grad party and they made the first one an hour early and it went to waste because it tasted old. The manager argued with my husband about the time and even had the disrespect to call my husband a liar about what he agreed to. There was no mistake, except on their part. 

They have messed up orders (leaving chips out of sandwiches) and the staff NEVER apologizes. Their first reaction is to ALWAYS MAKE AN EXCUSE!! 

If it were not my son's favorite pizza they would never get my business again. It pains me to go there with all the disrespect we have received. I even left message for Scott (the owner) and never got a call back. 

Take your chances if you wish. I'm still waiting for the next time I see the owner!!"}
{"text":"I placed my order and was told to arrive in 30 minutes, upon arriving to pick up my order, I was told it would be another 20 minutes. This was after I came from across the city to pick it up. So I went across to Rite Aid to kill the 20 minutes and while I was waiting they called me and told me they were out of an item I ordered. Then I came back after 25 minutes and they tell me it'll be at least another 5. So an hour later and I got pretty sloppy pizza and a lot of disappointment."}
{"text":"We ordered from here a few weeks ago. I was really happy with our pizza and calzone. The sauce wasn't too acidic and you can tell they use a good quality cheese. Service was good and the delivery came sooner than they confirmed it would. I'd recommend it!"}
{"text":"This pizza tastes just as good as it does at the guys in Euclid. I know it's the same company, but the other guys I've tried taste different. Not as good is the only way I can describe it. I am so excited this is down the street I will be here all the time. The staff is friendly also."}
{"text":"Best of the Aurora pizza places.  (I don't count 1815 as a pizza place).  Good, crispy finish to the crust and plentiful toppings.  Fast delivery."}
