{"text":"Tasty gyro wrap with crunchy fries inside! Best I've ever had. Good price, generous portion and friendly staff."}
{"text":"On one occasion ordered off UberEATS and it was fantastic. Same as the picture (exactly kinda amazing) also everything was fresh and delicious!!!! Yup they actually put fries in the Gyro! 2nd occasion wanted to drop in and make sure was clean the establishment is brand new! Food again was terrific! Ordered chicken Gyro and plates came with rice and garden salade. Honestly this place is a hidden gem. Thanks for the great service and wonderful food. I'm a very picky eater and I couldn't even find one bad thing to say, quality beats marathon,Arahova and portion size is insane. Great re"}
{"text":"Jason M., my biggest influencer here at Yelp with his distinguishable, convincing and really fun to read reviews, made me come over here to find out for myself. I had to, bcs after all this Jason guy, hasn't left any restaurant in and around the island undiscovered and his reviews usually won't disappoint. Did I say he's an influencer and not just another writer? Yep, he is IMO.   I'm not going to add much on top of Jason's review bcs once again, he said most of the important stuff pertaining to this place. So just to repeat and add a few of the things:   - The place is very nice, modern yet cozy - Got to say this: Cleanliness level is above average, that alone should tempt you to try the food here at least once.  - I arrived at 3pm and when asked if they had the chicken gyro, the nice and friendly guy said they're preparing a new one for the dinner rush bcs they'd sold them all at lunch hour. That's a clue for you to know that this spot is rolling well. I had the pork gyro sandwich. High quality indeed Jason.  - Pita is smothered in margarine, warm and fluffy, you can't find pita like this elsewhere easily - However, it loses one star for the meat being just a tad under spiced for my taste and the tzatziki sauce on the milder side. I personally am a fan of Arahova tzatziki which is a bit stronger than the rest. Lots of Greeks like it mild so really it's a matter of personal opinion and taste. So don't pay much attention to that one knocked down star.  Overall, I liked this place and the service I received and planning to come back for a full course, not just a sandwich.  Thanks Jason, good find. Cheerio"}
{"text":"Food is really really good and fresh! The gyros are always so tasty and really stuffed! When we order the platter, which comes with 2 gyros of your choice, I'm usually stuffed and will eat the second gyro the next day. Great food!  Delivery people from Uber Eats are just awesome! Food arrives quickly and our order is always complete.   Why 3 Stars? Let's just say the last time I ordered directly from the restaurant, the little girl taking my order was super rude and arrogant. I guess we will have to find another good gyro place near my home."}
{"text":"I love this place. I really enjoy their Gyro sandwiches. They're well prepared, stuffed with meat and tzatziki. They even stuff fries inside them. High quality. I also got to enjoy their Gyro submarines as well.  The people who work here are super nice and love what they do. The resto is clean with plenty of seating for a dine-in experience. Price tag is good.  Highly recommended."}
