{"text":"Excellent sandwiches, always fresh and made-to-order.  The owners are usually around and are very personable.  There is no better deli in the area."}
{"text":"Stopped in for my weekly visit today....\"Try the Carmine!\". Yum!"}
{"text":"Hans & Megan are always hard at work making sure that the food, service and atmosphere are perfect.  Where else can you get absolutely great food and service for $6 to $10 a plate?  Great beer and wine variety as well."}
{"text":"I would be willing to bet this is probably the best deli in the state. Our absolute fav. place to eat in the area. They also have a great selection of beers and wine and always have a unique pasta to try.  Can't get enough!"}
{"text":"We come here all the time, a little pricey but the food is quality and the staff couldn't be nicer!  
I usually get the Carrie or one of their tasty featured specials.  It's a must try if you're in Cramerton and looking for a place to eat!"}
{"text":"Great local deli!  Fresh top quality ingredients & friendly staff."}
{"text":"No doubt....the best deli in this area including Charlotte.  My wife and I read an article about their opening and decided to give it a try.  We have become regulars and the owners know us by name.  Always friendly service and the deli food far surpasses any chain you may choose to visit.  They are always inventing new sandwiches, salads, and soups while they retain favorites on their menu.  Breakfast is served as an entirely new experience here made of unique \"breakfast\" sandwiches.  Oh yes...and please try their unique and yummy version of carrot cake.  One of the best in catering as well!  I have never been disappointed at H & M and anyone I recommend  feels the same way.  I enjoy giving Christmas gift certificates to this place!  5 Stars for being the best at what they do!"}
{"text":"I love this place!  They have a large selection of sandwiches, wraps, soups, and salads.  I've tried a different sandwich every time and the ingredients are always high quality.  I like that I can find some decent healthy options along with the over the top sandwiches (i.e. loaded with bacon, sauces, and pimento cheese) that I'm normally drawn to.

We usually get a side of potato salad (traditional or bbq) or a cup of chili with our sandwiches and both are delicious.  They always have a basket of fresh baked goodies on the counter next to the register that's hard for me to resist.  I only caved once for a piece of coca cola cake and it was incredibly moist and tasty.

Finally, the part my husband most enjoys is their beer selection.  There are several coolers full of individual beer bottles as well as different types of sodas.  Plus they have a good amount of craft beer for sale in six packs.  So while I spend my time drooling over the menu and dessert options, my husband usually spends a good 5 minutes browsing through all the beers.  Perfect enjoyment for us both!"}
{"text":"This is a great place for sandwiches. Unfortunately I have heard they had to close there doors due to the bridge in Cramerton being closed and it depreciated their business.  Call before you go to be sure they are still open"}
{"text":"Ate here a while back when visiting from Seattle and it was top notch sandwich artistry.  We have moved back to the area and this place is very high on my list to eat at.  Good Stuff!"}
{"text":"This is our new favorite spot for lunch. One of my favorite things so far is Bill, which is a roast beef sandwich with sauteed onions, red pepper, lettuce chipotle mayo?, jack cheese. Roast beef doesn't seem all that flavorful, but those toppings are awesome. The chili was great also. BBQ potato salad was some of my favorite potato salad i've eaten in ever.

Overall it's a cool place with a solid beer selection. Not a huge selection, but good choices. i still prefer String Bean in Belmont for beer buying, but prefer H&M for lunch. You can buy a bottled beer to enjoy with lunch which is nice.

Two outdoor tables are a nice touch."}
{"text":"Have been here a few times now. I had the Bill the first time and it was one of the best sandwiches that I've had in a while. The staff is really friendly and helpful. This is my favorite deli that I've found in gaston county. I would recommend it to everyone!"}
{"text":"This place and Center Street Tavern are two great finds along Cramerton's main (albeit short) drag.

I first visited H & M upon a local's referral and have returned several times.  I've done takeout, dined in and have shopped the market, and in all cases have walked away happy.  The staff always is friendly and eager to help, whether it be recommending a lunch plate or a craft beer to take home.

While I have much left to try on their menu, the pesto focaccia is a veggie-lover's delight and the chicken salad is one of the smoothest, tastiest I've ever tried.  In the cooler you'll find yummy grab-and-go sides like hummus, tabbouleh and chicken salad (score!), as well as a wide variety of non-alcoholic drinks and spirits.  

The wine and beer selection, either from the cooler or in the market, is an impressive mix.  Can't decide on a craft brew?  Mix it up with their pick-six deal.  Based on their website it looks like H & M hosts the occasional wine and beer tastings for which I'll be on the lookout."}
