{"text":"Fresh. Authentic. Flavourful. Delicious vegetarian options. Definitely the best Ethiopian restaurant in Ottawa. The spices are unique and the portions are generous."}
{"text":"For a relatively small city it's surprising that Ottawa has so many Ethiopian restaurants to choose from. I've eaten at three others and I can say with complete confident that Habesha is by far the best. The decor leaves a lot to be desired but the staff is great and the food is exponentially more flavorful than Ottawa's other Ethiopian offerings."}
{"text":"I went here with two of my friends, one who happens to be of Ethiopian decent. I asked them if it passed their standards, and I quote \"Ya, its bomb\". What more can i say? Tasted fresh and the guy serving us was mad polite."}
{"text":"I checked in last night and complained about the delay in waiting for take away food but wanted to add a brief update.

The food was delicious. Simple, flavourful, and so fresh.  The woman at the restaurant was apologetic when we paid for our meals on a busy evening (it was Valentine's). 

I still feel that they could improve their service: I wish someone had been able to answer my questions over the phone more clearly (is a platter intended for sharing or is it an individual meal?) and I wish that it hadn't taken nearly 2-hours to prepare our meals. 

Though I'd still go back because the food was great and the people were lovely, in the end."}
{"text":"My girlfriend and I ate at Habesha for the first time, and it was a pure delight. Although I was accustomed to Ethiopian dishes, she wasn't, and our host took the time to guide through the menu. I didn't find the decor to be as drab as the outside suggested, and the service didn't take particularly long for such a small establishment. The portions were generous, our host attentive, and the food as very tasty and inexpensive.

We will definitely return."}
{"text":"I love this place!  It's a small, family owner restaurant with simple decor but what really sets it apart is the food.  Amazing Ethiopian food - by far the best in the city.  

The server we had was the husband (the wife is in the back cooking) and he was very friendly and explained all the dishes in detail.  

We ended up getting the combination platter so we could try everything and it was great!"}
{"text":"I have tried several different Ethiopian restaurants in Ottawa and this is the only one I keep coming back to! 

I tend to get the Habesha platter and share it with friends. The platter comes with a little bit of everything so you get to sample almost every dish they make. The only thing missing from the platter is the lamb dish which I would highly recommend ordering on the side. The injera is always fresh and fluffy and meats and veggies are well spiced. 

I would highly recommend getting their coffee- some of the best coffee I have ever had! 

The staff is always friendly and food is great! If you are looking for the best Ethiopian food in Ottawa- go to Habesha!"}
{"text":"We were looking forward to going to an Ethiopian restaurant the next time we were in Ottawa and Habesha was an excellent choice! This is a small family owned Ethiopian restaurant. There is a small seating area that faces Rideau Street and another small seating area beyond the kitchen. While the restaurant it self is nothing to look at in terms of decor, in fact it's easy to miss, the atmosphere is friendly and welcoming. More importantly, the food is very, very good. Each dish had the right balance of flavors, generous portions and was affordable. Money well spent. Will definitely go back!"}
{"text":"Nice small family run restaurant. Authentic tasty cuisines generously seasoned. Love it!"}
{"text":"Easily the best Ethiopian restaurant in Ottawa, even better in its new location.  It's family run and comes with smiles every time. 

They're now in their new location on Montreal Road, very close to the old one but bigger and better, so it's date-night and large family compatible. 

The food is great and the portions are large.  I'm vegan so I have the veggie platter that's vegan too.  Their injera is also very good.  I wish I'd taken a picture but I was hungry.  

I'm in Ottawa much longer than usual and I've really been there a lot.  

I'll see you there."}
{"text":"We had dinner tonight, the food was very good maybe we would like to have it a little bit more spicy, service was good, decor very simple no fantasy, my only comment is on cleanliness of the bathroom,  did not want to use them sink full of water toilet not cleaned.  Interesting dish of kale"}
{"text":"Really good food that arrives quickly, helpful, welcoming and knowledgeable staff, will definitely be returning and recommending to others."}
{"text":"Simple review follows: food was super tasty, everything was delicious, and the price is fantastic. If you like Ethiopian, you will love this place. You aren't coming here for the decor or the ambiance. Come for great food at a great price."}
{"text":"This restaurant was such a sweet surprise. They are rebuilding the road in the front of the restaurant so at first, we were not sure if they were closed or not.  The inside is very modest but clean and the waitress was absolutely delightful. Sweet and helpful.  Eating Ethiopian food is quite the experience. The food is served on these large crepe like pancakes made of some sort of buckwheat like grain, you do not use cutlery , but eat everything with hands unless you request a fork. 
We had the regular and vegetarian lunch platters and both of them very tasty and very interesting.  
If you are ready to eat something delicious and exotic, this is the place to go! Thank you again Habesha!"}
{"text":"This place was awesome, I went there during my trip to Ottawa since my AirBnB was close by. The owner was super nice and taught me how to eat the vegetarian plate. It was a little quiet since it was a weekday night, and the atmosphere was great. It was my first time having Ethiopian food, and I know it won't be my last. It reminded me a lot of Indian food which is very available in my home country. It was a great, somewhat nostalgic experience. I'll definitely recommend going there! It was a lot of food for one person, so you could try sharing if you don't eat a lot!"}
{"text":"Loved the vegetarian platter!! I love the different kinds of lentils with the injera bread. The food was amazing. 

I just wish they would serve everyone individually. I went with 5 others and we all got our food in one platter.  Nice if it was just a Party of 2 not so nice to share with 5  others. If I had known of it before I would have ordered separately. They don't let you know before hand. I didn't think the platter we got was worth $70."}
{"text":"If your vegetarian or not this is one of the best places you can have delicious Ethiopian meal in Ottawa. I had Habesha platter it kinda of mixed beef and chicken with some vegetables! the price is perfect just 13$ for a big amount of food."}
{"text":"Habesha is a must have if you find yourself in Ottawa! Walking distance (15 minutes) from but off the path from the Byward Market. I had the vegetarian platter. Living in Toronto, there are quite a few options for Ethiopian food. Habesha beats any I have been to for taste. Best 12 bucks I've spent in awhile. If you are ever bored of the endless supply of generic bar food and overpriced creations of Milestones and company, Habesha offers an alternative close by - delicious, homey and a friendly meal in a laid back, no frills environment not too far from the downtown core strip. The night before I spent $70 bucks in the Market for a generic, small portioned restaurant meal and glass of wine. Wish I would have gone to Habesha's instead..."}
{"text":"Had a great lunch here yesterday.  I ordered the vegetarian sampler and my friend ordered the doro wat.  Both are served with a good amount of injera bread- both the traditional sort as well as a darker version that contains some quinoa, according to the owner.  We ate our meal traditional-style, without cutlery, the injera serving as the vehicle for the rest of the food.  

The food was outstanding and affordable, ingredients were fresh, bread well-fermented and cooked and properly textured, etc.  It was very flavorful and filling, without being too heavy. 

Bathrooms are bare-bones but clean.  Decor is simple as is the furniture. You come here for the food, not the ambiance.  

I'll be back soon"}
{"text":"Excellent Ethiopian food. One of my favourite places to eat in Ottawa! The spices used are coordinated so well and taste amazing."}
{"text":"Great place, nice host, amazing food. Highly recommend this place to anyone who has or has not experienced Ethiopian before."}
{"text":"An Ethiopian friend invited me here for lunch today. The flavours were simply out of this world. I've been daydreaming about the food ever since. 

I will definitely be back again."}
{"text":"Off the beaten path and easy to miss, but so worth it ! We arrived at 6 on a Monday night, and we were the only patrons in the place. Server was immediately available to help with ordering as we had never eaten Ethiopian cuisine before. We settled on the Habesha platter and an order of the lamb cha cha tibs. I had water and Dan  had a Corona. Bit of a wait for the food but nothing crazy. Lots of choices on the platter, lentils were so good, and the lamb was served with peppers.  Food all had tons of yummy flavour.The bread was light but easy to rip and was fun to eat with ! Great value for the money.
The only thing reducing my rating from a 5 to a 4 was the place could be a bit cleaner. However, the server did clean the table when we arrived and we both washed up in the washroom and it was old but not dirty.
Good if you want an adventurous meal !"}
{"text":"Good: Small, plain and clean. Tea is fragrant and comforting. 

Better: Service was a little awkward but friendly. I believe it's all family members running the kitchen and front of house.  

Best: The food is excellent. We were famished so devoured both a vegetarian and mixed platter. Great lentil and vegetable preparations for vegetarians. Meat dishes were pleasantly spicy and tender, evoking those lazy summers on the Barbary coast that we all love. 

The meal took a while coming out, but it was hot and tasted fresh. You could also get takeout, as they do serve injera on the side (so it won't get soggy). 
Reasonably priced. 

Dollars: $35 including tax for more food than we could eat."}
{"text":"I had never had Ethiopian before and really enjoyed this place. As a vegetarian, I especially appreciated the vegetarian platter. My friend had had lots of Ethiopian before, and said this is the second best she has ever had."}
{"text":"I ate Ethiopian food about once a week from the many restaurants available in Kampala, Uganda, when I worked there. Naturally I crave it since I've moved back to Canada. 

Of the ones I have tried in Ottawa, this one comes the closest to authentic taste and flavour. The service is excellent and the decor was pleasantly familiar. 

I recommend the Habesha platter, pictured, for beginners."}
{"text":"Drove from montreal to this specific place 
The food is amazing, authentic, good quality 
The people are really friendly as well 

Will def drive back again"}
{"text":"I've eaten at both Habesha and Horn of Africa. Habesha wins hands down. Their food is freshly prepared and incredibly flavourful. 

I was definitely intimidated the first time I went, I had no clue what I was ordering or how to eat it. The staff does a great job at explaining the menu. However, I find some thrill in ordering blind and being surprised by what I'm eventually served. The vegetarian plate is always a good go-to. The meat plates are also very very good. You will be surprised how much food you get for the price !! 

This is a great place for a date, it's small, cozy and definitely a unique dining experience."}
