{"text":"I ate here for the first time, and was surprised at how good the food was. Yes, it's basically 'fast' food, served cafeteria style, and the inside of the restaurant feels a little bit like being in the food court at the mall, but the food was fresh, delicious, fast inexpensive and very satisfying. This is not the place to go for a leisurely dining experience, but for a quick, delicious lunch or dinner, it's great. I'll be back."}
{"text":"I must have gone to a different restaraunt than others that have said this was good food. In all of my years of living in Madison, I have never experienced more disgusting food than you will find at Habeneros. Tiny hole in the wall, non chain fast food service, not very clean, and very limited offering. Chips were stale and meat did not even taste like meat. Take my word on this, avoid this place if you have any tastebuds as they will be very disappointed.  No decor, no waiters, you take your food to your table on a fast food tray and then clean up and bus the table when done. Most of my food was bused to the garbage where it belonged. My wife could not eat her quesadilla after the first bite, the meat was a weird color and hsd the consistency of horribly overcooked chicken.We had to stop and get take out from another restaraunt on the way home. Never again."}
{"text":"Today I went to the NEW Habeneros located in the same parking lot as the old stand-alone restaurant I wrote a terrible review of awhile back. I ordered a spicy pork burrito with an assortment of items inside to round it out. (Black and refried beans, cilantro, corn, salsa, cheese) and it was STELLAR!!!! 
Price was around $7-8 I think plus a iced tea. The veg was fresh and crisp tasting and the spicy pork was perfectly tender, beans seasoned nicely. I am looking forward to returning perhaps even tomorrow since I will be in the area again. Glad I returned. I don't know if there was an ownership change or whatnot, but moving forward I won't be telling people that Habeneros serves cigarette flavored burritos anymore!"}
{"text":"fast service, friendly staff, simple but fresh menu, casual sit down restaurant in a stip mall....very good tacos, kitchen and seating areas both looked clean..."}
{"text":"Man I love this place! I've never had a bad burrito always clean everybody's very nice great place for the northside of madison."}
{"text":"This is your basic in and out Mexican style grill with build your own burrito, tacos, salads etc. Inside it is not anything fancy but the food is fresh and service is fast. 

I work on the north side of Madison so this has become one of my favorite lunch spots. It is nice because you can get in and get out while ordering something customized to your own preferences and tastes."}
{"text":"This place is the North side's best kept secret. The building is nothing special but the food is fantastic. Everything is fresh and homemade for crazy low prices. My favorite is the barbacoa on corn tortillas with guacamole. They also offer burritos, burrito bowls, salad, and many sides. I've been here many times and have never been disappointed. To top it off the staff is friendly and service is fast. For an authentic Mexican lunch, this is the place to go."}
{"text":"Great food, affordable, awful customer service and at times, poor quality control.
Last two times I was here, one employee opening laughing at me for no obvious reason, the second time I asked what was funny. Apparently he didn't approve of the way that I ordered my burrito. It made me very uncomfortable.
On other visits I've had stem pieces in the guacamole."}
{"text":"Think QDoba, but more authentic, more genuine, and way less mainstream. That's what Habeneros is. It's a build your own burrito/quesadilla/TACOS joint. I emphasize the tacos because they are what I always get and undoubtedly my favorite. 

The meats - there are several to choose from. Pulled pork, spicy pork, steak beef, shredded beef, chicken, whatever you want. I usually go with the pulled pork. It is flavored so well. It's never dry. It's just - YUM. When you order the 3 tacos meal, you can get each taco a different meat, if you'd like. I always just get all 3 the same. Boring? Maybe. Do I care? Nope!

Then you get to chose from a plethora of toppings and things to add. Sauces, veggies, etc. 

Finish it off with some Jaritos soda, if you like, and you're good to go. 

Oh, and let's talk about price real quick... it's super cheap - AWESOME DEAL! My good friend and I got dinner just last night and for each of to get a meal and a soda, it was $16 and change, plus tip. Not bad at all!"}
