{"text":"First time a new place. Service was excellent. Five of us had different selections. All were great. Do not go by the negative reviews."}
{"text":"The waitress we had was a school teacher working during her vacation to supplement her school salary. She was the best part of the experience.. The cheese crisp was so so, the beef chimi's were not the best or worst we ever ate.The buss service was terrible, no setups on the table . We finished our cheese crisp and the buss person brought our chimi's, never took the empty plates. I asked for additional verde salsa it never came.. To be honest with usually go to Nando's on Mcdowell but they were closed for the holiday.Rosa'a can't hold a candle to Nando's."}
{"text":"The service we received and the manager were both very nice. However we will not return. I ordered steak tacos and my boyfriend ordered the carnitas chimi special. Immediately when the food was set down I smelled something nasty. I touched my steak and it was completely cold. Sent it back but the smell did not go away. The \"carnitas\" in the chimi smelled rancid and were pink and slimy. Was the special meant to try to push out spoiled meat?? Luckily it was all removed from the bill. Left feeling sick to our stomachs and with no appetite."}
{"text":"It's still great! The service is better than ever and the free chips are nice. Salsa Verde is the way to go. Always eat at the taqueria!"}
{"text":"We'd been going here for dinner with our out of town guests for a few years now. Made the mistake of going again this year.  I called Tuesday for Friday reservation for a party of 5. Arrived right on time for the reservation to be greeted with a young lady flipping through a tiny spiral notepad only to tell us we didn't have a reservation and it would be a 25 min wait. No apology and even went so far as to suggest we called the wrong location.   So we went into the bar to grab a beverage and then headed outside to begin our wait. I got to thinking about the wrong location comment and went into my phone to check the call history. Confirmed I called the right location and let the gal know only to be met with \"I wasn't working\" that night. I don't care if you were working on Tuesday night, your staff failed. (Mind you, there were many empty table inside the dining room as well as outside in the patio.) Fortunately, showing the call history actually moved her a little bit as we ended up with a table a few minutes later.   We then proceeded to be greeted by our pleasant server followed by chips and salsa, etc. Placed our order and sat around chatting, really in no hurry. Chips and salsa were refilled as our wait time became longer than it really should take. Finally our food arrived but the expo held the plate with their bare hand - not a good sign for food temperature.  My chimi had sat for so long, there was absolutely no crispiness to it and the meat temp was cool. Never received my sour cream and guac.The quesadilla was more like a soft tortilla with luke-warm ingredients. Well the fajitas were hot! We'd ordered an additional side of tortillas since the fajitas were being split. They didn't come out initially so we asked for them again. They ran out a foil package containing some sort of unidentifiable seafood.   Our server came around and asked how everything was so I let her know my concern with the food temps. She went looking for the manager and came back after a few mins and let me know she couldn't find the manager. She came back after a few more minutes with the check and let me know the manager took 25% off of our bill.   She apologized and said the manager said the reason the food was cold was because they were busy. Because they were busy, I get cold food? Unbelieveable. The reason I got cold food was you are understaffed, have poorly trained and downright rude staff (except for our server) or you just plainly can't manage. Any other restaurant where I have had any issues, the manager actually comes to discuss the issue with the customer and not hide behind the server.  Very disappointed and will not be back. There are plenty of other Mexican restaurants in Mesa serving hot food with great service and appreciation for their customers."}
{"text":"Wonderful food and atmosphere. I had dinner last night on the front patio with a group of my friends and we had a great time. I had their yummy green corn tamale with green sauce on top. Absolutely the best green corn tamale I have had! I haven't had a meal there that I haven't liked."}
{"text":"I don't know why all the bad reviews. We find this location and their other location to have the best cheese enchiladas with the green sauce . I also recommend the Beef fajitas. ( meat marinated ) The beans are smokey and the best we have had next to our homemade. The green corn tamales are amazing lots of cheese and corn pieces inside. They are unique tamales. We are used to really good Sonoran style Tucson food and we have searched hard to find anything comparable up in Phoenix and believe me we tried a lot. We love this place after it was recommended we visit the other location. We were excited to see they also opened a 2nd location near our home. We never hardly ever have an issue here and we are almost weekly customers and we have children that come along. The staff is also very accommodating always warm and friendly when we come in. I love this place and never usually have to  wait ever."}
{"text":"I came here recently, hoping the experience would be similar to previous dinners when the space was owned by Tia Rosas, however I left extremely disappointed. The service was terrible, waiting over 30 minutes for water or any type of acknowledgement from a waiter, the food was of average quality when it finally arrived, and then when attempting to pay we were told it was impossible to split the check in half on our bill. We attempted to straighten out these issues but our waitress had the worst attitude and the manager was not very accommodating. We definitely won't be returning."}
{"text":"Enjoyed happy hour in the bar! (was never a big fan of the old Tia Rosa's) Our waiter was super friendly, and served great margaritas and appetizers. Was here about a month ago (also for happy hour) the waitress was wonderful then as well!"}
{"text":"We haven't been here since it was Rancho de Tia Rosa's, but we are so happy we finally returned.  The atmosphere is very similar and fun.  I got two seafood tacos.  The cod was very good but the shrimp with pineapple salsa was killer.  I will definitely get two shrimp tacos next time.  The rice was moist, which was a nice change from the old Rosas rice.  The refried beans have a smokey flavor that I loved.  Sometimes beans are just a filler and I don't end up eating them, but these stand on their own.  My wife got the Flying Saucer, her longtime favorite.  It was different from the old recipe but she she really liked it.  It was huge too and she brought half home for leftovers.    My daughter got their carne asada chimichanga.  It was fantastic and she loved it.  I was fortunate to have a few bites of her leftovers for lunch today. It is loaded with meat.    We had chips and salsa beforehand and the chips were perfect.  The tomatillo salsa was spot on.  The red salsa was different from the old Rosas salsa but very good.  We didn't leave any on the table.  I liked the large glasses of soda.  I didn't think I would even need a refill but I ended up getting another Diet Coke with lime.    Our waiter was friendly, helpful and attentive.  He deserved and received a 20% tip.   It's wonderful to know we have great Mexican food again in east Mesa.  We will definitely be going back!"}
{"text":"We came in for lunch today. As new residents to Mesa we are trying everything near our home. This place was amazing!  The refried beans were by far the best I've ever had. The salsa was great and you could tell this was fresh food not reheated commercially prepared. The patio was charming and everything is priced well. I'm excited to go back!  100% recommend."}
{"text":"Friendly service, good food and a lot of heart put into the design and decor.  Relaxing place."}
{"text":"Loved the place. The decor is incredible and looks very Mexican. The green salsa with chips is fantastic. To sit in the inner outside court is perfect. Our food was amazing. I had the 3 meat fajitas which is wonderful. We will be back especially with visiting guests."}
{"text":"I used to love this place. Not now. Bf had a dried out taco. My chicken enchiladas were good. Service sucked. Beverages were empty. Server was unfriendly and slow. Adios Tia Rosas"}
{"text":"I been to both the takeout and the restaurant and I am a big fan of chimichangas. But they let me down on this one... When it came out it was very crunch which they should be soft in the first place and also the beef was not shredded and it tasted horrible."}
{"text":"Food wasn't good enough to get me to go back.    Love the ambiance!  Waitress was really just okay. :("}
{"text":"This place really sucks now it used to be Tia rosa which are different owners and different recipes these new people came in and raised the prices (they were already expensive with there old owners but the food was worth it ) now it' was over 40 dollars for 2 people and that was in the taqueria not even the main restaurant"}
{"text":"We used to love this place, but when we went there tonight, it was so bad we will never go back. Our food was cold when it came and my boyfriend's Chimichanga was not even cooked all the way. When we told the waitress about it, she asked if we wanted another one. He said yes. The cooks kept giving us dirty looks and talking about us. They never apologized, adjusted the bill or anything. The food did not taste the same as what we were used to at all."}
{"text":"Had a great lunch in a beautiful setting.  The best outdoor dining in the East Mesa area.   Enjoyed an excellent  Margarita and delicious shrimp taco, loaded with shrimp, cooked perfectly, served with a tasty pineapple salsa."}
{"text":"Excellent atmosphere, excellent food. I have been very impressed with the high level of service by the waiters the three times my wife and I have eaten here. The shrimp tacos are excellent. On our most recent trip my wife got the Veracruz shrimp plate which was very delicious. Also, the green salsa that comes with the chips is excellent."}
{"text":"So disappointed i read the other reviews and expected good food and service, our service, was so poor, the entire staff seemed confused, we were told they would have to see if they could even find silverware for our party after 10 minutes with our food sitting in front of us cold we found our own, we also cleaned our own table the chimichanga had no flavor and the meat was dry. Also expect to wait a long time for your food. We Waited For An hour After ordering. Will not be going back."}
{"text":"My in-laws recommended that we try this place. If you've read some of of my other reviews, you may know that my wife is pregnant and is craving authentic Mexican food. We went there with our son and ordered a cheese crisp and bean dip as appetizers. The beans tasted different to me so I didn't eat it. We finished our food and ordered sopapillas for dessert. As soon as the dessert arrived, my kid began to vomit. Being that my wife is pregnant, she threw up as well . The waitres ran to get some napkins for us and was amazing in making sure my kid was ok. While my wife and the kid were in the bathroom cleaning up, the manager approached me and stated that there was a lot of food today as there was a wedding party tonight and that he wasn't the first person to throw up. The waitress brought over a cup of water to go and a different waitress brought me our check. I left a 30% tip for the waitress as her service was great. I couldn't have asked for more from her. I am giving this place a 1 star rating because I found it unprofessional for the manager to tell me that he wasn't the first person to throw up and that it could have been because they prepped a lot of food for a wedding party. Overall, I didn't see myself coming back."}
{"text":"I really like the taqueria. The service is good. Their vegetable burro or flying saucer is excellent. It is a step up above regular Arizona Mexican food. Their green salsa is the best in town and they give free chips!"}
{"text":"We ate at the main restaurant last night (first time since the fire).  The venue is beautiful.  We love to eat on the patio this time of year.  The  giant tree shades the seating area from the late sun plus the parking lot/road is nowhere to be seen or heard.  As the sun goes down, the decorative lighting comes on and this is a fun place to relax.   The chips and salsa are delicious.  Our server brought us a red and green salsa with an endless supply of hot white corn tortilla chips.  These were freshly cooked and not just from a bag.  I always eat too many before my meal!  The difference tonight is that my wife loved the salsa and chips.  We both gave the salsas a huge thumbs up. We ordered the Enchiladas Monterey and a beef taco.  Both were fantastic.  My kids ordered Chicken Fingers from the kids menu and to my surprise, they were fresh chicken, not the frozen breaded chicken at all the other places.  That made me happy, and my kids loved them.   Our server was very attentive and accomodating.  We could tell that with the new ownership, they are figuring things out.  While we were waiting for our food, she brought us an appetizer because she felt we were waiting too long (we didn't ask).  I was just relaxing on the patio watching the night sky change.  I was happy to be patient and enjoy the time with my wife and children. This is a great new restaurant.  Embrace the change and enjoy the experience.  We'll be back."}
{"text":"We were very pleased with the food and the service!  We had been to Tia Rosa's in the past a few years ago and were not impressed.  The food at Tia Rosa's had a very \"smokey\" taste that we didn't care for.  The food at Hacienda de Rosa's was very good and our waitress (Renee) was very friendly and accommodating.  We will definitely be back!"}
{"text":"Fantastic Mexican atmosphere and food! Sweet green salsa and amazing stuffed chicken quesadilla! Service wonderful too!!"}
{"text":"The food was salty and the service was terrible. Our chip guys were or servers. Seems like everyone but our waiter assisted us."}
{"text":"Food was good and offered at a reasonable price. Service was painfully slow and staff was inattentive. Waitress basically appeared once at our table after dinner came out, we were out of drinks, salsas for most of the meal.  Noticed people waiting quite a while to get a table, and there were many tables empty, not sure what was happening."}
{"text":"(This review is for the Taqueria.) I had not been there for a while because I have been going to the original owner's restaurant which is at Greenfield & Brown in Mesa. Going to the Taqueria was an altogether BAD experience and I will not go back. They changed their menu, so now they have \"fiesta\" and \"grande\" sizes for tacos and burritos It is a choice, but the person taking my order decided (without asking) that I wanted the smaller (fiesta) size and although they offer 4 types of beans, he also decided that for me (again without asking). Once I got the food home it was so disappointing!!! The old Rosas' salmon tacos have  a nice piece if fish (small filet) on their salmon tacos, but this was not good at all. Little pieces of fish, like what would be in a can.  To make matters worse, the guy at the register tried to short me $5. I don't think this was intentional, but just more to show that he shouldn't be taking orders or be at the register! Save your money and go elsewhere!!!"}
{"text":"The food is very expensive and tastes very bland.  The carnitas had no flavor, dousing it with salsa didn't help either.  Their beans, a hallmark of good Mexican food, are smokey flavored.  Maybe as an option this would be okay, but most people do not want or expect smoke flavored refried beans.  The shrimp in the fajitas was good, but not worth me going back for.  The place is beautiful, and in my neighborhood, too bad I won't be returning.  When I left I was jonesing for good old Filibertos, just down the street."}
{"text":"Don't just walk away... RUN!  Tried it two years ago when it was under different ownership and called Tia Rosas.  It was horrible then, and nothing has changed.  My wife convinced me it was time to try it again, especially with new owners, so what the hell.  We were greeted and seated promptly and our server was very nice.  Chips were tasty, but the salsa left something to be desired.  We didn't have drinks as it was a Tuesday night and, well, we're trying to be good.  I ordered the pork tamale plate and my wife ordered the flying saucer with carne asada.  The food came out quickly, and the first thing that told me it wasn't going to be good is there was no smell.  Nothing.  Absolutely none of that delicious smell that precedes a plate of hot, tasty, well prepared food.  And the plates were cold.  No hot pads on the server's hands with warnings about the plate being hot.  There were two tamales on my plate, and both had obviously been previously frozen and microwaved and just tossed on top of some wilted lettuce.  Now if I wanted a frozen, nuked tamale I could have gotten that at home.  But at least I wouldn't have cooked them so long that the masa was as dry as sawdust.  And... wait for it... despite being overcooked they were not even as warm as room temperature.  The Spanish rice on the plate was cold to the touch and dry as a bone.  The refried beans were passable at best.  My wife's plate was smothered in about a pound of shredded lettuce that looked like it should have been tossed the previous day.  Once she scraped it off into an amazingly large heap, she dug into the carne asada.  I didn't sample it, but she reported it as tough, stringy and tasteless.  I wasn't surprised as I'd already tasted the sponge bob tamale I had been served.    I really hope the owners read this and understand this is an honest report of our experience.  I really wanted to find good Mexican food close to home, but I'll drive 30 miles out of my way before I'll take a chance on this restaurant again.  Seriously, a frozen microwave Mexican dinner from Bashas would have been more satisfying."}
{"text":"My review is based on what we had for dinner not the previous owners restaurant. We were greeted very nicely by the staff when we entered the restaurant and our waitress Rochelle was extremely polite and answered any of our questions . We ordered the house margaritas that were excellent and presented in a very cute margarita glass. Chips were warm and fresh and the salsas were excellent as well. My hubby ordered the chicken and beef fajitas that were season and marinated perfectly with soft warm tortilla wraps and freshly grilled peppers and onions. I love fish so I ordered the Baja tacos , one salmon and one cod. The salmon was very fishy tasting (maybe farm raise or very inexpensive  salmon) topped with mango salsa but no real flavor, the cod was topped with red cabbage and no sauce---very tasteless. The rice  was also very bland. Our waitress asked for our opinion and we mentioned the good and the not so good, she was concerned and offered a refund on my dish, I said no to that as everything else was very good. She did offer us free dessert which we accepted, the fried ice cream , good but corn flakes around it were very chewy.   Now the question will we go back?? I think we will, maybe the fish tacos will improve and they will take my advice and add a chipotle aioli to the cod and purchase a better grade of salmon, as well and season the rice. The decor has changed, walls a little lost without something on them, but the place is still unique and new owners are trying!!! Rochelle was wonderful and we hope to see her again!"}
{"text":"Every once in a while you go to a restaurant and your  server makes the experience great!  Well Wendy did it, happy, upbeat and very good, also made us smile a bunch.  Of course the food was great as well.  But the experience was great because of Wendy.  Thank you"}
{"text":"The Mexican food here rocks  Atmosphere on the back patio is great They need a little work in service  Timing come out the kitchen was off But all in all a wonderful experience"}
{"text":"FINALLY--AN UNBIASED REVIEW!  Y'all know Arizona has the best Mexican food in the world, but somehow, despite our affinity for it, we never ate at Tia Rosa's before the fire. It was too far from home. SO--this is NOT a comparison between 2 businesses at the same location. Buildings change hands--get over it, people! I once worked at a flower shop that is now a dry cleaners. Hacienda de Rosa's, while enjoyed by many, has been unfairly condemned by others who would likely walk into that dry cleaners and get mad because they don't sell flowers. It's a different business with different owners!  We read the yelp* reviews. We found the bad ones unrealistically harsh and the good ones over-the-top in the other direction. We used nine specific criteria to rate this establishment according to our expectations of any restaurant in the world.  Service--the most important factor in dining out. We can eat anywhere in town, but if we're not treated right, we won't go back, no matter how good the food is. This new Rosa's earns 5 stars for service. We were greeted & seated immediately. The friendly waitress got our order right. The food courier was adept, the bus staff, awesome. Our refill of chips & salsa included a small bowl of the red salsa for EACH of us. The busboy was singing. He enjoys his job. That's good to see. He checked on us every time he walked by, offering refills of water or chips & salsa. We appreciated his attentiveness.  The FOOD--3 1/2 stars. The food is good. Tortillas, cheese, rice, beans, various kinds of meat. It's authentic and good, although not exceptional. My letdown was the lack of crunchy tacos. BUT the next morning, my face, fingers and toes were not swollen. Many restaurants add MSG or other inflammatory ingredients. I think this is why several reviewers said the food was bland. It is not bland. It has plenty of real, honest-to-goodness flavor. I appreciate the lack of artificial enhancers in my meal. Now for the beans--that smoky taste is shocking, even after the heads-up. Apparently, they won some bean award and assumed everyone would like them, so they make them like that on purpose. I would award them for the creamy texture, but not so much for the out-of-place taste.  Authenticity--5 stars. We've had Baja food IN BAJA and Rosa's can hold its own with any of it. In fact, it's better than most.  Portions--5 stars. The portions are great. I was able to keep half my food for leftovers, which is one of my favorite parts of going out to dinner on Friday nights. Still, good-sized portions aside, the ingredients of Mexican fare are among the cheapest on the planet and the prices really ought to reflect that.  Chips and Salsa--4 stars. The chips are plentiful, delicate & hot. The chunky red salsa is flavorful, but not spectacular. It's tasty--don't get me wrong--but it is super mild. That mild salsa is why this place is good for tourists. The green salsa, does have a nice flavor, but is way, way, too sweet, and is why they only get 4 stars for salsa. It was a whole star too sweet.  Location--3 1/2 stars. Location is both their biggest asset and their worst drawback. The building itself is gorgeous, but moving into THAT building and keeping the Rosa's name has clearly backfired, garnering a deluge of negative comparisons. The location in northeast Mesa benefits tourists and snowbirds, but is an obstacle for me. I pass good Mexican restaurants to get there, and for 3 1/2 star food, that's not as likely to happen on a regular basis as they might hope.  Atmosphere--Beautiful! 5 stars. We went on a rainy-ish evening. It never rained, but smelled like vacation outside, and felt like it inside. It's a pretty place to bring out-of-town visitors. Like I said before. The food is good. People from the midwest should fall in love with it, and it's served inside a Hacienda that looks almost as authentic as the meal will taste. The lighting is light. Not diner-bright, but not romantic, either.  Seating--4 stars. I would not call it cozy. That's good for not being squished so close to other diners that you could join their conversations. Almost all of the seating is on hard wooden chairs at square wooden tables. There are only a few booths around the edge of the dining room, so it's not a place where you can sit close and have a quiet conversation. To me, that's the downside. I get date night once a week and prefer to sit in a booth, but whatever; it was fine.  Now... the main reason we give this restaurant 4 stars instead of 5. The PRICES are way too high. Way. Too. High. We may return to Hacienda de Rosa's, but if we don't, it will be because they charge $11.29 for an $8.99 dinner of 2 items with rice & beans. We felt gouged, even with the generous portions. I can also leave Mi Amigos or Chalo's or Mi Pátio with half my food and keep a lot more of my money! Only 1 star for prices.  We arrived at our 4 star Overall rating through sincere and conscientious deliberation. ~ M&M, Mesa"}
{"text":"Best flying saucer!!!  I love the atmosphere of the taqueria. Love this place.  We come here all the time and they never let us down. Thanks for the free bag of chips!"}
{"text":"I was there waiting for 25 minutes for 2 tacos and they sent every order out and forgot about mine and then Before I left I asked for a refund because they hadn't even started my order yet. they refused And Said there's nothing they can do about it. Great staff and very efficient..."}
{"text":"We've been coming here forever and I just can't do it anymore. Tia Rosa was one of our favorite places- there were definitely some quality changes when it became Rosas. But both the taqueria and restaurant are awful now. I have a dairy allergy and no matter how many times we go over it they can't seem to just not put sour cream or cheese on my stuff. I most recently went here with my best friend and our kids and I ordered something that I know is easy for them to just not add the cheese I reminded them I have an allergy and to Not put any dairy on it- still came with dairy. Sent it back- the gentleman in the back of the taqueria had the balls to tell me just to push it off to the side (because that's how food allergies work). I had a bad feeling asked them to make sure they handled it properly and would remake the entire dish and not scrape it off- and guess what... They scraped it off. I can't count how many times this place has failed to just comply with my simple allergy request and we sadly always went back because it was a special family place for us and we had favorite entree there. But I just can't do it anymore. I hate arguing that my food is incorrect, being treated like crap for their mistake, and then being the last one in my party to eat my meal when it finally comes when my toddler is done and sick of sitting at the table for so long. This is one of many incidents that proves this place just can't handle simple menu requests and it's very disappointing to be treated in such a way when their laziness and negligence to such a simple thing will make you sick. I did write the owner and mangers after this last horrible experience because it was my final straw and she handled the situation well and apologized and said she would be training her staff but for other people with true food allergies please be ware. Food is good, we always loved the chips and salsas, servers are awful, but sadly find to find a new favorite Mexican joint."}
{"text":"Just tried to eat here for the first time (it's one of those places we keep driving past and say \"hey we should go there sometime, it looks cool\" but never actually go). Waited a couple minutes for a hostess, ok cool maybe she's busy nbd. A man greets us says it'll be about 15-20 minutes for a table, I ask if we can just sit at the bar which is completely empty. He responds \"no there's a wait for the bar too\" we say ok no worries and give our name. About 10-15 minutes pass and we peer around, the restaurant appears to be at least half empty but there are several people waiting for a table. Now a new girl is at the hostess stand so I go up and ask again \"excuse me can we just sit at the bar\" and she says \"sure, you can sit at the bar top\" \"ok great thank you!\" We proceed to sit at the bar top. I look down and the bar really looks like it hasn't been wiped down all day. The same gentleman who told us we couldn't sit at the bar is making margaritas in the corner. He looks directly at us and then immediately away without acknowledging us and then walks away. We sit at the dirty bar another 5 minutes, no one appears to work the bar and we gave up and left. SUPER disappointed. It looked so cool."}
{"text":"When we decided to go here I was excited about the Baja style food I've had that in Southern California and really enjoyed it. I  don't believe this was up to that standard that I've had before. Although the food has good flavor it was lacking in spice. The high point was the refried beans which had a very smoky interesting flavor that we all like."}
{"text":"We used to come here a long time ago. Really loved it.  They had a fire several years ago and they shut down. To be honest, I didn't realize they have reopened, until we were out there last week .  We came in and requested a table for two.  They had one available immediately.  We wanted a booth though.  They were very nice about it and said it would just be a little bit of a wait. It was about a 20 minute wait but we didn't mind because you're like a booth. They kept checking on us and letting us know the status. I found that was very nice .   Anyway, the chips and salsa are absolutely incredible there. Chips are light and fresh. Salsa is absolutely delicious. The Green Salsa is incredible with mango in it .  I got the chicken Malay. It was fantastic. They were out of rice,  they close at eight and it was already 7:35. So I took just the black beans everything was really good.  My dining partner got the fish tacos. Also excellent!   Even though we had to wait a while for our orders to come through, it was well worth it. Our server gave us 10% off since we waited so long. The food was excellent and I would go back anytime . I really  Like this place. The Decour is beautiful as well."}
{"text":"Before this establishment switched owners, everything was phenomenal and I have been coming here for years. Since then it has been slowly getting worse. First of all the menu has changed for the Taqueria. They don't even offer nachos anymore, which how hard is it to throw some chicken on a pile of chips? The items they do offer have increased in price and decreased in quality. Burritos have nothing to them and are very thin. The tacos are nothing but scant amounts of meat and a tortilla. They have also changed the salsa- not as good in my opinion. The customer service has also taken a turn for the worse. Today specifically I waited over ten minutes for someone to even come in from the back to take my order. It's like they don't care if they have business or not. Not only will I not be returning to the taqueria, I don't even know if I will ever dine inside the restaurant again. My advice, take your money and go to the Tia Rosas location that is still open for business. You know you will get quality food and service there."}
{"text":"We were in the neighborhood and decided to stop by here. I'll agree that the green salsa is sweet. I didn't find the red salsa to be spicy, but my husband did find it to be a little. We were both pretty happy with what we ordered. The waiter actually asked me if I was ok with spicy, since the dish I picked was spicy. I actually didn't find it that spicy, so I'm thinking that maybe they toned it down?  In any case, it was decent enough that we are willing to stop by again when we are in the area."}
{"text":"We had my sister's surprise 30th birthday there last night and I can say that the staff including Sergio the manager, the food and the whole atmosphere was top-notch totally deserving of five stars! We used the little room in the back of the restaurant, attached to the patio as well as the grass area for lawn games. We were there from 6 to 10 and everybody had a blast everyone loved the food and it was the cutest little space everybody was really impressed!"}
{"text":"Service was soooooo slow. Food was ok if you like sweet and smokey. We were never offered refills on our drinks or chips and salsa. We have been done with our food for 10 mins and yet no check or clearing of our now stacked up on the corner of the table dishes."}
{"text":"The Atmosphere of the restaurant was very cool. Very warm welcome. Unfortunately I give the 2 star Review because for the price of an Enchilada plate you get 2 small enchiladas with Red and Green Sauce that are  very good, they taste very farty. Also they don't have very good salsa it's either sweet, mild, or Habanero that burns your mouth there is no happy Medium. 2 Stars, probably won't try again."}
{"text":"I love Rosa's! My husband and i have been four times in the past three months. Great atmosphere which has not changed with new ownership and every plate i have tried has been delicious."}
{"text":"My husband and I stopped in on Valentine's Day because another restaurant had a 45 minute wait. No waiting here...we got right in without a reservation, though later on we saw people waiting to be seated. We've been to Rosa's several times over the years. Let me begin by saying that the hacienda-style building this restaurant is housed in is so beautiful and charming, it makes any dinner special. I could eat a Big Mac here and be perfectly happy. However, I noticed yesterday that unlike in the past, the place is looking a bit rundown and raggedy. Handles missing from toilet stalls, sections of string lights outside burned out here and there, the patio seating area looking a bit rough, and a cheap 8' folding table set up in the beautiful pink room next to the entrance. Not good and sad to see. They've printed new menus since we dined last summer and prices seem to have increased significantly. We still like the chips and salsas and they'll happily bring you more if you want them. We both had the chimichanga, which was good. The beans and rice were average. Our waiter was nice, but busy. Still, he managed to refill our drinks and chip basket. The food's okay, service has always been friendly, and I just love the rustic beauty of this place. Unfortunately, it doesn't seem all that busy and the shabbiness of it makes me think it might not be open much longer. I hope I'm wrong."}
{"text":"Being new to Mesa from Chicago, where the Mexican food is better than in it is Mexico, we figured we'd give this place a try.   The exterior decor, lighting and architecture was extremely inviting, and the interior equally impressive creating quite the excellent vibe. With this, a great expectation developed while browsing the menu. When we got our chips and salsa, an uncharacteristic sweetness was prevalent. Moving on still being dazzled with the vibe, we ordered.  The unsavory sweetness seemed to be Rosa's thing.  Everything we ordered (burritos quesadilla and tacos) had the completely un-Mexican sweetness. The fact is Mexicans do not add sugar to camouflage a lack of authentic culinary aptitude.  What a let down!  I could understand if it were chili powder or cumin... but sugar?!?  Perhaps we are spoiled by excellent cuisine, but this was more like an Americanized fusion food, in a really cool setting. Rosa's needs to re-evaluate their recipes.  So far, Senior Taco is hands down the winner, and we're 7 months in."}
{"text":"It's ruined very sad no customers at lunch time ...menu changed poor customer service"}
{"text":"July 2016 we moved to the area and we've eaten at Rosa's about 10 times or more. We have never had a bad experience.  Rosa's is one of the best!!!  To be fair the worst thing I experienced was waiting for a table for 30 min on the Saturday before Easter.  I highly recommend the Chicken Mole Enchiladas; they are the reason I love Rosa's. They are not for everyone, only us Chicken Mole fans.  Other items I would recommend are there Beef Mini-Chimi's, and Beef Chimichanga.  We love their slightly sweet tomatillo salsa, smoky chipotle salsa on just about everything!  As for adult drinks we favor their Negra Modelo on draft and their raspberry margaritas.  Don't forget dessert!  The sopapillas are amazing!!!"}
{"text":"The food is good (especially the green salsa with the chips) and the margaritas are awesome. Atmosphere is great also. A welcome surprise in an area otherwise full of chain restaurants.   Would be 5 stars BUT the service every time has been extremely slow and slightly less than courteous at times. It's also a little on the pricy side."}
{"text":"The food is great, the service could use a little adjustment on timing but still worth the wait!"}
{"text":"Our second weekend in a row at this unbelievable restaurant! Service is beyond exceptional. Food is incredible! Ambience is A 20 out of ten!  My husband is one of the pickiest eaters I know and he absolutely loves this place and I like to eat healthy and love it too! Bottomless chips and salsa, three kinds of salsa!  If you are going to dinner with friends or have friends coming into town this is the place to bring them! Tonight we sat in a little outdoor room with a private fireplace! Oh, and by the way much less expensive eating here than in the Taqueria on the same property.  You get much more food! Perfect! Oh and they brought our food out so fast both times we have been here!"}
{"text":"Good happy hour! Half off margaritas... The stuffed quesadilla was great! Outside seating was very cute and shaded."}
{"text":"Not worth my money.. the food had no authentic Mexican flavor tasted more like barbecue and our beans were cold and service was very poor.. first time here will not be returning"}
{"text":"This place grabbed my attention as I was passing by so I decided to give Tia Rosas Taqueria a try. This was my first time being there and unfortunately I will not be going back. If you're like me and you like the taste of Real authentic Mexican food then this is not the place to go. Not only was the place lonely when I walked in but their food was not the best. They had to make a batch of horchata since they were out and then they forgot to take it to me at the table. The horchata was definitely watered down and so were their salsas. Both the red and green salsas tasted semi sweet and I also had to get up and ask for it since they hadn't provided me with any salsa and chips even after serving our food. The only two things I liked about this place was the ambiance and decor which made it feel like an authentic mexican restaurant & their chips were also very good. Overall though this isn't your ideal mexican restaurant."}
{"text":"I was excited to try this place with the new owners.  The building and decor is just SO awesome, but with the old owners I felt the food was just okay and the margaritas were not great at all, so I rarely went.  Unfortunately, based on my experience with Hacienda de Rosa, it will not become my new favorite Mexican place.  This is a long one, so TL;DR decor is awesome, service and kitchen can't keep up if they're busy, and food is average although priced well.  I will preface the review by mentioning that we came at 6pm on a Saturday night and with two small children.  So it should be expected that they are busier than usual, and that I am less tolerant of long wait times than people not pacifying two tiny humans.  So we were initially told 15-20 min wait.  It was moderately busy when we arrived, but started picking up a lot as we were there.  It ended up being around 30 min.  Now, a 30 min wait is not bad for a Saturday night, but it felt longer because we had been anticipating about 15 (and it wasn't crazy busy when we first arrived) and I spent 90% of it herding my kids or chasing them around the courtyard.  Side note: they had a fire going on the patio and it was totally adorable and cozy!  Finally seated and we were greeted by our harried server right away, but it seemed pretty obvious they were understaffed.  As others have mentioned, the green salsa is sweet, but I liked it.  The red salsa was just okay in my opinion.  I wanted to order the queso dip, but they were out... at 630 on a Sat night?  We ordered right away when our server came back with our drinks.  And then we waited.... and waited.... and waited.  It was 40 or more minutes later before they finally delivered the two kids meals (they did have the foresight to at least bring the littles' food as soon as it was ready) and another 5 or 10 before our two adult meals came out.  We didn't see our server much this whole time, but I really don't blame her.  She was in the weeds big time.  Thankfully, we didn't need anything.  They did offer us more chips at about the 30 minute mark.  I ordered the spinach enchiladas for me, a cheese crisp and bean and cheese burrito for the kids.  My brother ordered the enchilada combo with beef and cheese.  What I liked about my enchiladas was that they were cheesy (my brother said his were as well) and topped with some fresh avocado, plus the sides of corn and black beans were great.  We didn't order any alcohol so I can't really comment on drinks.  Overall, the food was good, but it didn't \"wow\" me.  But the long wait for it was very dissapointing.  I've noticed other reviewers complain the same about kitchen wait times, so at the very least they need some improvement during busy times.  I noticed other tables around us going through the same wait times, so it wasn't just us.  Our server came back once to check on the food, then we didn't see her again for a while.  Well, we saw her but she was running around like crazy managing all her tables.  I can't imagine if we had ordered drinks that we wanted regular refills on!  Had to wait a bit to finally flag her down for the check.  We had been there for close to 2 hours, between the wait in the lobby and for our food.  The natives  (kids) were getting restless and we had to go!  One thing I did like was the price.  It was only $35 dollars for the 2 adult and 2 kids meals.  Of course, we didn't get any drinks or apps, but that seemed really reasonable.  Just overall it seems like they need a little management help.  Better staffing during busy times  (there were lots of unfilled tables for the long lobby wait, and all the servers seemed overwhelmed, not just ours), and better kitchen staffing and stocking (45 min wait? Out of queso to start a Sat night?)  But for the price the food was fine and I would go again for the decor/atmosphere.  Hope they can find their groove."}
{"text":"Quality went down from Ranchi de Tia Rosa. Service is average. Servers dressed unprofessionally; some with black legging and Nikes and other in nice clothing. Food was poor. Beans tasted like they were burnt. Husband ordered a Chimichanga with Green sauce and got Red. Wait time was 25mins but we noticed many tables empty and it took longer than 25mins. Sorry won't be back again."}
{"text":"This is my first time to eat here and what a pleasant experience. The atmosphere is relaxing and warm, a true hacienda :)  we ordered the beef fajitas and Veracruz plate with shrimp. I loved that the pieces of meat in the fajitas were bite size! And plenty of flavor and tenderness. The Veracruz plate was too large to finish! The side of corn was a bit bland, but other than that it was great. The staff was friendly and accommodating, bringing 2 additional salsas when we said the first one wasn't very hot. The place is very clean (including the restrooms) too. This place is a thumbs up for sure."}
{"text":"While I admit comparing the old Tia Rosa to the new Rosa isn't fair, it is the comparison black cloud that will always hang over this place from all the customers in the area. Tia Rosa set the bar and the value of this new version falls way short.  I have been back a few times thinking it is me being too critical, but each time it seems that there are fewer and fewer cars in the parking lot telling me my thoughts are probably confirmed.  Some have voiced their opinions like me here on yelp, but my guess is others have simply gone away.  The issue is it needs to be better than the old tia rosas to maintain business... it isn't.  My biggest complaint is the value.  Paying $4.50 for a bean and cheese burrito and then having to spend another $2.00 for the \"grande\" one... or should I say one that would actually be considered average is a bit crazy to me.  Truly 6.50 for a bean burrito in a takeout restaurant?  Another $5 for 2 drinks.  Mix it in with 2 small shrimp tacos for $14.00. $25.00 for lunch for 2... no chips = crazy.  I can go down the street to Serrano's, sit down, chips and salsa with the same food and it is $7.00 less.  Today both of us left hungry and unsatisfied. Would I ever come back?  Why should I? Too many other choices. Our new place to go is backyard taco in Mesa.  There you will find a similar idea, better prices, better food, and filling portions.  Of course they have it figured out there and people have responded so you will wait in line to get your food.  Back to Rosa's.... No longer a crowd there and while I'm sure the new owner is please to be getting a few extra \"bonus\" bucks for smaller portion meals, when the people keep feeling ripped off and stop coming (like me) getting those few extra bucks will go away and we will see the building empty again within a year.  Goal achieved!"}
{"text":"A big disappointment.  Dined at Hacienda de Rosa's for the first time since it opened 5 weeks ago. My rating is more due to a comparison with the original Tia Rosa's Taqueria at the same location - where I dined regularly - than a true reflection of Hacienda de Rosa's food.  I ordered an enchilada with red sauce and, strike one - Hacienda de Rosa's is more expensive than Tia Rosa's (which wasn't particularly inexpensive); strike two - the food wasn't nearly as tasty as Tia Rosa's; strike three - they messed up my order, giving me green sauce instead or red sauce.   While returning my order (which was graciously corrected, kudos), I noticed another customer also had a problem with his order. But my replacement enchilada had so little sauce - perhaps a tablespoonful - that I could barely tell there was any sauce on it under the melted cheese, so my enchilada tasted very dry - strike four.   One of the many great things about Tia Rosa's food was their delicious enchilada sauce - it had a unique flavor, different from the typical \"canned\" enchilada sauce served at most Mexican restaurants. So while the food at Hacienda de Rosa's wasn't bad, per se, it just didn't live up to my expectations, and I don't plan on returning."}
{"text":"Restaurant is nice and clean, and the service was good. Only seeing a few people in the restaurant should have tipped us off on how bad the food would be. The beans tasted like they had BBQ sauce in them, turns out it's liquid smoke?Disgusting, and amazingly overpriced. Rice tasted like they mixed it with tomato paste. Would never recommend to anyone."}
{"text":"We ate in the main restaurant on Saturday, April 11, 2015. Wanted to try the new place out. So disappointed! Waited in the bar while waiting for our table for three. No one waited on us. Went to bar myself and grabbed three margs: frozen mango, peach on the rocks, and regular frozen lime. All sucked...all mix, little liquor, and way too sweet!  Couldn't finish them. Went to receptionist and asked for chips and salsa, since no one was waiting on us, or the other patrons in the bar. She said she'd have someone bring them right over; never happened and we waited 40 minutes.   Now to the dining room. Confusion by our male waiter from the beginning. Service was not good. Prices definitely increased from prior restaurant at same location. Food was not good. All three meals were served at different times; awkward!  We finally got our chips and salsa; chips weren't  bad...salsa (red and green) wasn't good.   I realize they're still in their soft opening period working out the kinks, but this experience was simply awful and the food not that good, especially for the price. Probably won't return...bummer."}
{"text":"I've struggled finding Mexican food that I like since moving to Arizona. I think I found it! We went on a Saturday night and we had fast service. Fajitas are good. Beans and rice were good. Guacamole was good. Chips are good. Margarita was good. Salsa was not so good. We will definitely return."}
{"text":"First of all the atmosphere is fun and so cute! We had visited the place previously as Tia Rosas and had anxiously awaited the reopening . We, my boyfriend and I ,  visited on a Saturday early evening and it was fairly busy.    The complimentary chips and salsa were very good and we liked the giant glasses they had for water , less waiting for refills!  We also had a friendly waiter.  But those were the high points.  We had a simple order. One chicken chimichanga , ala carte, no guac and no sour cream and a pork burrito plate , enchilada style with green sauce.  We waited quite awhile and when they brought the order, both were wrong. The chimi was piled high with guac and sour cream and the burrito plate was covered with red sauce.  They took it away and apologized and we waited quite awhile longer. They did eventually bring the correct order and the food was ok but overpriced for what it was.  We have been out to eat a lot and usually if there is an error that big, there is an attempt to make up for it.  Maybe comp one of the meals, an offer of free soda or drinks of some sort or dessert or something.  Nothing here.  It was overall a disappointing experience."}
{"text":"I love Rosas! I was worried about the changes but I'm satisfied. The red salsa seems better then before and there chips are the best around. I really like the 3 meat fajita meal!!!!"}
{"text":"It's so frustrating eating here. The food was pretty good but everything else is a mess. Our server constantly came back to our table to clarify our order. They were out of everything, even salsa. She seemed pissed every time we asked for something yet she kept interrupting us to clarify orders and tell us they were out of something. When it came to separating our checks, she put  put all of the drinks on one check and put the wrong dish on other checks. It got so messy that we just gave up. Our serve looked like she did not want to be there, and it showed in her lack of effort at her job. I definitely don't want to be there either.  Like I said, the food is ok but not worth the pain of the awful service. Good Mexican places are a dime a dozen here  so just take your time and money elsewhere.  P.S. I am writing this review after visiting this place twice. Both experiences are similar."}
{"text":"Tried once a long time ago and came again today to give it another shot after seeing they may have change owners. Came for lunch and the large restaurant was pretty quiet.  The place is a beautiful establishment with plants and fountains in the courtyard and patio and inside is covered in pretty floral tiles.   The food from chips and salsa down to dessert were all exactly 3 stars.  They were very basic. Chips were the thin oily kind that I like.  The red salsa was decent and garlicky but the green salsa was unexpectedly very sweet (not my style).  I ordered a beef burrito lunch plate for $9.95 and I felt it was overpriced for the small burrito.  Burrito was nothing special and tasted like something I could make at home.  Rice and beans were okay.  The churro and ice cream was...you guessed it - just okay.  Churro was ordinary and even a little too hard.    Was really hoping to give this place a second chance since it's so beautiful, but unfortunately there are better Mexican restaurants around."}
{"text":"12 ladies for lunch. 3 of us ordered the mango chicken lunch salad with cornbread muffin and honey butter. Chicken was so spicy I couldn't eat it and nowhere did it mention spicy on the menu. When we asked about the cornbread muffins the waitress said they were all out and this was at noon. No substitution was offered. General consensus was we won't go back and won't recommend"}
{"text":"I came here with four people. I didn't have silverware. I asked 3 different people for a fork. We went the whole meal with no silverware. I finally ended up eating alone after an hour with no fork because my 2 year old wouldn't sit still while we waited for a fork. I spoke to the manager and he didn't really care but gave me a fork. Still charged us full price for everything. Nice. Real nice.i can't believe this place is still open. I'll never come back."}
{"text":"I drove many times by this placed and often wondered how is it the food. I have checked the reviews at all and decided to give this place a try. We had intentions to see check out the happy hour. The patio, decor both inside and outside was amazing. We had ordered margaritas and who wouldn't at half price during a happy hour. Our waiter Danny was out this world amazing. After reading some reviews here, I'm surprised. Everyone was friendly and prompt.  We had bean dip and fajitas. Their beans are different then other palaces, a bit smokey with full flavor. If you are looking for a place to hang out for a happy hour, this is it. They even have a cozy fireplace on the outside. We will definitely visit here again soon."}
{"text":"Delicious food! I love the beans, they have a smoky flavor to them. The Tomatillo salsa is drinkable. This isn't the old Tia Rosa's, it's better. Service was very friendly, food came out quickly and was hot."}
{"text":"Good stuff. I've eaten at Rosa's on University for a couple of decades and the \"old\" Tia Rosa's as well. I'm quite happy with this change to new ownership - same great food (fish tacos! hooray!) and the best beans I've ever had. Seriously. Perfect. Beans. OMG.  We went there mid-week and did have to wait about 15 minutes to be seated - but the hostess was super polite (BIG change from the previous ownership - so rude we stopped going to this location) and explained that it was because they didn't want to slam the wait staff so that they wouldn't provide good service. Fair enough. The hostess also offered us beverages as we waited.   Once we were seated the service was fine. Food took a little bit long - seems the kitchen was a bit overwhelmed - but we were more than happy to kill the time with chips & salsa & the best bean dip ever. No biggie.  So, are they working out the kinks? Sure. Hopefully they'll get totally up to speed by the time snowbird season rolls around. Is the food delicious? Absolutely. Tastes just like the deliciousness of Rosa's on University and it's closer to me. Are drinks yummy? Yes they are. They have Margarita and sangria by the pitcher too. Does the food cost a bit more than I'd like to pay? Well, yeah - but so is every other restaurant too - inflation sucks.  Is the dining room loud? Yep. Especially when so many of the tables have 5 little kids making noise and *not staying seated* (pet peeve.) Because East Mesa demographics. Not the fault of the owners.   They could use better seating in the waiting area though. Hopefully they'll add that on by the time snowbird season rolls around."}
{"text":"This is literally one of the best Mexican restaurants in Mesa. The sweet and spicy pork salad bowl is AMAZING as is their stuffed quesadilla and margaritas. Literally why is this only 3 stars?!?!? Amazing service, amazing food, and incredible live music. Don't miss out!"}
{"text":"We do miss the old Tia Rosa. That being said we thought we would try the Hacienda Rosa, just to compare.   Same: ambiance, just as charming. We ate on the patio and felt transported to a Mexican village. Parking good. A fun place to go.   Cons: even though the transition was some time ago, the waitstaff seemed inexperienced and uncoordinated.  We were seated promptly but then ignored like we did not exist. That was a little frustrating to sit for 15 minutes so we can pay and go home,"}
{"text":"Loved my taquitos, didn't love throwing them up 5 hours later from food poisoning. But seriously so good love the green sweet salsa lol. Also they have red cream soda which is 10/10"}
{"text":"Seriously great food. Flavorful without the enhancers. Fresh. I haven't been this pleased with a dinner out in...well...forever. Cute decor. We would make a trip back for the strawberry margs alone."}
{"text":"I'm in love with their nachos loaded with 3 different meats and the rolled tacos! The decor is lacking in the main restaurant and typically service is a little slow. The taqueria is a much quicker way to eat and they are typically more friendly."}
{"text":"Beautiful patio and decor, but ambience indoors feels kind of cafeteria-y. Some happy hour specials. Yummy house margaritas. Food was lackluster."}
{"text":"The only thing enjoyable was the ambiance on the patio. We wanted this place to be great because the atmosphere was so nice and it's close by for us, but, the service was brutally slow and the food was way below expectations. This place could have been in Toledo, Ohio and it still would have been disappointing Mexican food, let alone by comparison to Arizona standards. Decent place to go for chips and a drink and enjoy the patio, but don't bother with dinner."}
{"text":"Disappointed. Was here with a large group and the beef and shrimp fajitas were bland, street tacos were unpleasant.   Service was very good, queso dip was amazing."}
{"text":"We used to go here multiple times a week and then they Totally switched the menu and raised their prices.  We will not go back:("}
{"text":"We are here on a Saturday night and they told us 15 minutes for 2 people and it's been 35! Not one server in the bar area so that's not even an option! Based on this type of service we will not return even though it's across the street from our house!"}
{"text":"We walked out of this place. We have never done that but the little things that seemed odd did make us feel uncomfortable eating here.   - place was half empty & still waited 20min to be seated - sat at bar while waiting for our table & the bar didn't look like it had been wiped down all night - seated at an oddly large table with just us 2, next to the server station - dinning room is awkwardly bright & makes for a tense environment"}
{"text":"The taqueria has really great deals with their $1 items each day. I also tried the ranchero taco and it was full of flavor and a bit of a kick to it. Highly recommend it!"}
{"text":"Had a wonderful meal today. Actually always have a wonderful meal at the Hacienda! Consistent food and great service. Have been coming here periodically for 25 years whenever we are in the neighborhood. Guacamole tostada and fish tacos are both ALWAYS fantastic."}
{"text":"BF and I ate her last night. GREAT service. Good food, but not outstanding. Loved the ambience! I had the chicken mole enchiladas. Not spicy enough for me. The mole was pretty bland. BF had a beef chimi. He said it was good. I'd go back again and try something else."}
{"text":"Seriously disappointed. Nothing like what it used to be. Huge group, we ordered everything from fajitas to tacos to chimichangas. Beef is really poor quality. Shrimp was bland.   Server was excellent and the queso dip is amazing."}
{"text":"I'm not playing this place is trash my food was cold their service was rude they were talking back and they don't speak Spanish's."}
{"text":"The restaurant is beautiful with a gorgeous outside seating area with live music. The staff is great. Friendly fast and efficient. The food is okay. No different than what you'd get from Filibertos."}
{"text":"The food is not Authentic Mexican. Salsas are too sweet. Beans have a smokey taste. Beef in the enchiladas was smoked beef, servings were huge but bland, bland, bland. Rice and coffee was the best part of my meal. The place is beautiful but food was so disappointing"}
{"text":"I just went for a second time since they've been under new management. It makes me sad to go in there now because I feel like the spirit has been sucked out of the space. We loved Tia Rosas so much and would go there at least a couple times a month. Regarding the new Taqueria, I can say the food is good with fresh ingredients but the price is way too expensive for what you get. Will probably not be going back. :("}
{"text":"Last week when I ordered dinner to go at the taqueria I ordered a chimichanga. My order was done and I drove home to sit down to eat and it was just a burrito. So I had to drive back down there to have them make me a chimichanga. This isn't the first time one of my orders was wrong.  Today I went there for lunch with my daughter.  I knew it was taco Tuesday and National Taco Day so I expected a wait. My daughter and I sat on the patio outside. 30 min in I went to check on our food. The lady at the counter gave me  an attitude when I walked up and stood there.  I said I was checking on my order. She asked what I ordered. When I told her she said \"oh,  I looked for you. I thought you left. I told her we were sitting outside on their patio seating. She said \"well, I looked for you.  I again stated we were sitting outside. She says \"well maybe I didn't check out there for you\" Not 5 minutes later she brings food out to someone on the patio. So just wondering why it wasn't important to actually look for me.  Got my food cold. Not happy. Done dealing with their poor customer service and poor attention to detail. I will not be going back there anymore."}
{"text":"We have been there a few times the first time they mixed up some orders but they were good about fixing it. And food was great! Second time it was spot on. Flavorful and everything you expect from Rosa's."}
{"text":"Overall, I thought this place was very good  I'm a Mexican food snob from San Diego. This is not humble street food, which is awesome in its own right.  This is good Mexican food for Americans.  My server was awesome.  I wish I could remember her name to give her a shout out.  My overall impression is all the servers were great, which is contrary to some of the negative reviews.  The food was very good.  My only complaint is I ordered the shrimp tacos a la cart, and I was expecting standard chili shrimp / shrimp diablo tacos, but they were sweet, with pineapple.  I wasn't expecting that, and would have ordered something different.  I think they should explain the item on their menu, and maybe offer a couple types of shrimp tacos, to include the Baja standard chili shrimp tacos.  But I sampled food from my family's plates, and it was all great.  We will be back."}
{"text":"Wanted to try the new place after Tia Rosas closed. Our service was actually really good especially with the previous comments/posts stating that many had very poor service. Everyone was friendly and welcoming and our server was very bubbly.  The decor has changed, the knick knacks are gone from the wall, fountains aren't on and paint needs to be added to outside walls. Main room is big and gets very loud when busy. Next to the food, we had a group of 5 and everyone enjoyed their meals. Good taste and served hot not warm. Salsa and chips are free with the red salsa being my favorite.  Drinks, we had no problem with either margarita that was ordered. They mixed a blend for us with no problems, believe it was a raspberry/mango mix. Good flavor too. I would return here on my next visit to the Mesa/Phoenix area."}
{"text":"Went in for lunch for the first time in months and the refried beans tasted bad I told the waiter and he said they put liquid smoke in the beans. I have never eaten refried beans with liquid smoke in them. I think he was blowing smoke. The rice was all wrong it tasted like rice in tomato paste. I have had better and I will go elsewhere very dissatisfied.."}
{"text":"Let me start by informing the owners that if you're only going to be concerned with the filming and photo shoot for your web page, close up to the public and invite some customers in for free dinner and film to your hearts content. That way you won't ignore the customers who weren't near the cameras.  As far as my review of the food...average at best. The margaritas were AWFUL.  Our waitress was helpful. I remember the original Rosa's. Too bad as the Rosa's imitators increase in numbers the food decreases in quality.  Can't say I'll be back"}
{"text":"Came for happy hour.  Website says 1/2 off margaritas.  But it's really only HOUSE margaritas.. Please clarify this on your website.  And please offer better happy hour apps, like everyone else does, not just 2-3 selections.   If you want to be competitive, make your happy hour worthwhile..  Probably won't be back."}
{"text":"Today was our first visit to Rosas but it won't be our last. Mexican food is one of our favorite meals  and we have tried many different restaurants around the valley. We were very surprised and pleased with the quality of the food here. I  must have told my husband at least 5 times that the refried beans are the best I have ever tasted. They have an amazing smoky flavor and I kept eating them even after I was full. The salsas were also amazing and had very unique flavors. The atmosphere of the restaurant is very beautiful and comfortable. We highly recommend Rosas to anyone looking for a great Mexican meal."}
{"text":"My first time trying this hidden little gem. Yes, I said hidden cause if you don't pay attention you'll miss it even though it's on a huge lot.   The atmosphere in this place was rustic and very inviting. From the music, tables and chairs to the walls and ceilings. Everything about this place screamed mexican restaurant.   The food was plentiful and delicious. I had thier mole enchiladas (I call them enmoladas) they were very filling. Stuffed with tender white chicken and cheese smothered in their delicious mole sauce served with a side of beans and rice. Our server was very friendly and knowledgeable of the items on the menu.  The staff was friendly as well.   This place is on a huge lot with a sister resturant in front that's just for take out orders. If you're in the mood for some authentic mexican food give this place a try."}
{"text":"We celebrated our parents 50th anniversary.  The location was perfect.  Service was excellent.  The food was yummy and the mariachi was incredible.  Perfect day."}
{"text":"Hostess, was rude. Didn't even greet us when we walked in.  Server was great, food was great... we were a party of nine when we got up 6 of the 9 of us were covered in bites... we believe they were bed bugs. When we called the manager to let her know she was rude, unsympathetic and said it was impossible because they were new cushions and that they had to be mosquito bites I'm sure we've all had a mosquito bite before we know what they look like. These definitely were not mosquitos."}
{"text":"Took my son who is visiting from Fall River Ma and he loves a true Mexican resturant so I heard about Rosa so I thought I would give it a try  this is the real deal. It was great The food and drinks were great you have to try it for yourself"}
{"text":"No bueno.   Here's an Animal House paraphrase for ya: A crappy attitude and poor quality are no way to go through life young miss.  I would not return to Rosa's if I was paid $100 to do so.  We went on a Monday. Sadly, lack luster, impersonal service, sub par food, and phantom stomach pains are the memories we have of our visit.   For at least the first 20 minutes of our visit we were the only customers... and still the service was void of any friendliness and seemed resented.   \"How bad could the food have been,\" you ask? When a $1.19 Jack in the Box taco blows away an \"authentic Mexican\" shredded beef taco, astonishment follows... the wrong kind the astonishment. My $12 Rosa's tacos were small, dry, anemic, disappointments. Truly, these tacos were a sad polar opposite of the quality fare I use to get from Rosa's in central Mesa.   My wife said her beef enchiladas were bland and dry. Typically my wife doesn't encourage my Yelping, but on the ride home she said: \"One of two things needs to happen, they either improve their quality & service or people need to be warned off from what just happend to us. You need write a Yelp review... maybe a shorter on this time.\"  But hey, both my Pacifico as well as my wife's chardonnay were cold... so I'm assuming Rosa's has a refridgerator. I'll give them an EXTRA star for evidence of potential safe food handling.  We left shaking our heads. I was on the bonus plan with stomach pain as we made our exit.  I'm not spending any time on the other survey questions. These guys are not worth it. Beware.  Man, I hate when I have to write something like this."}
{"text":"First. I like the place. I like the cheesy lights outside and I like all the potted flowers.  I like the decorating and the care it took to build this place.  I don't like the sound the wooden leg chairs make when being scraped across the floor. That annoys me.    The drinks are good, not great and too expensive.   The food?  Ok, I know my beans. For me, it's all about the beans. If the beans are good, the rest of the food follows. Their beans are delicious! Homemade for sure and really yummy.  I love the green salsa and find the extra cheesy food to be be very good.  Outstanding? Probably not. But it's good food and really consistent.  I tend to stick with the combos, an enchilada and taco with rice and beans. Nothing fancy but it's always good.   I can't say this is a 5 star restaurant. But if you visit, enjoy the outstanding ambiance, the cool patio (they even had live music tonight) And the loud and fun conversations in the dining room.  For me it's always a fun experience.   To earn 5 stars, Rosas has to up their game on service. Greet people enthusiastically, be friendly and prompt at the tables.  They are lacking in both.   Improve your happy hour offerings and I promise you will get a following. Neat places like this one are few and far between in NE Mesa."}
{"text":"My hudand and I hosted our son's wedding dinner at Rosa's tonight and I can't say enough about how amazing it was.  Sergio, the manager was a dream to work with.  He kept us on budget and made sure there was always plenty of food.  The staff was incredible.  We had some inpatient and even rude guests at our dinner and the staff handled those guests professionally and with kindness.   We had over 90 guests and the food was served fast, hot and delicious.  The back garden was a perfect setting for our dinner and we would defiantly book another priviate party with Sergio and Rosa's.  Thank you Rosa's for making our dinner perfect (& stress free)!"}
{"text":"Great food and yummy Margaritas, fantastic service, beautiful place!"}
{"text":"I will keep it short. This was the absolute worst restaurant experience I have ever had. The server(Heather) and the rest of the staff were completely unfriendly and inattentive. My wife had been here before and said she would never go back, but I made her go because I wanted to try it. Now I see why she would never go back. This place is absolutely beautiful but is sullied by the service and staff. It's too bad."}
{"text":"I miss the old Tia Rosa. Now I know they are completely separate, and while I miss the old, I wanted to try the new. The decor is almost the same, with a few generic changes.  The outdoor patio is still nice. They may have not done themselves any favors by taking a similar name. I found that this leaves pretty much everyone to compare them - even if they don't mean to. I guess myself included. The gal at the hostess station ignored me for several minutes until another server guided me to the patio where I had a friend waiting. The server was awkward (not the aforementioned one). She asked if anyone had helped us and gotten drinks. We said no, but then she started to walk away until we were like \"but we want some drinks\"! The Pina colada and daiquiri were huge. Not fantastic though. Their bar menu is lacking. The chips were ok, though cold and not salted. The tomatillo salsa was so sweet. I don't know what they were thinking...just too sweet. The other red salsa was ok. Nothing with heat nor chunks...more like picante. But the flavor was pretty good. Like a mild roasted chipotle. Dinner took a long time to come out. Like 2 chip baskets long. Our server was fairly inattentive.  Dinner finally arrives. I had Shrimp Mazatlan. I'm pretty sure even in Mexico, they would devein my shrimp before service.  And yes, I have spent considerable time in Mexico, so I have a basis of comparison. Baja this was not. The rice was well cooked and flavored, and the grilled pineapple tasty. My friend had the chicken fajitas. There were a ton of vegetables but not a lot of meat. Small tortillas and no cheese. The pricing on the menu seemed alarmingly high to me. The server told us that we could not split the bill, which was weird, especially since there were only two of us. I don't think that this place really cares about customer service, or at least don't either adequately train staff, or don't pay them well enough to care.  Sad. This used to be a great place when the Sirrine's owned it. Just saying."}
{"text":"Very good food. The chips were not greasy. The green salsa had a little sweetness to it.  The red salsa was a little smokey.  Cheese crisp was good, lots of cheese and actually crispy. I enjoyed the Monterey Enchiladas. The meat inside was very tender and juicy. My wife had the fish tacos. There were good size pieces of fish. The beans and rice were good too.  The beans also had a smokey flavor to them. Our server was very nice. Would recommend this place."}
{"text":"Food was good but service terrible. Used to love this place. Waited 45 minutes to order. Had to ask for anything we needed several times. Spent 35 minutes trying to fix the bill because they charged too much and then charged our meal to another card. If it had been a busy night I might understand, but it wasn't.  Held prisoner for 2 hours. Kept wondering if we were being punked. Not going back."}
{"text":"This is my first time back since ownership changed. Lunch on a Tuesday with four of my friends around noon. Quickly seated and chips and salsa right out. Took 5 min to get water. While we waited you still have the nice old world southwest ambience. I really like the building. The wait staff is friendly. Menus are relatively the same. We ordered food and waited quite awhile. You know you've waited too long when you eat two bowls of chips and drink 32 oz of refreshments. Once the food finally arrived it was hot and fresh. Unfortunately we ate so many chips waiting we could not eat all of our lunch specials. I will say the tacos are legit. Salsa is good and overall experience was fair. I think a faster lunch turn around will be required to get return lunch break customers."}
{"text":"Wow ...so disappointing. We used to love the previous place and were so excited to try the new Hacienda de Rosa's out despite the numerous iffy reviews already posted.   We showed up for a late Saturday lunch and the place was empty. We still ended up waiting 10 mins to be seated and 15 mins after that to place a drink order.   In addition to being unbelievably slow, our experience with the food was challenging enough to make it hard to find a high point to call out.   Love the location and potential of the place, but it'll be a while before we try again"}
{"text":"Long wait. Poorly organized, pissed off employees with serious lack of customer service interest. This place has gone way downhill. No management onsite.  Save yourself the frustration of visiting this place."}
{"text":"I don't live in AZ but anytime I'm in town I used to stop at Rosa's for a few tacos. While the food is still decent the notion of customer service and friendliness of staff has gone out the window. Huge disappointment. The lady behind the counter almost seemed annoyed that I was ordering food. Wow!!"}
{"text":"The ambiance speaks to your soul...and the food speaks to your stomach! Our experience was phenomenal, we sat in the back patio the fountains were soothing the lighting was perfect. Our service was nothing less then professional and steady. We had three entrees, The shrimp mazatlan ( 7 large jumbo shrimp) would order again 10 out of 10. Then Plato de chimichanga with shredded beef (plated beautifully and tasted as good) . Thirds but not least the combination plate #uno (very cheezzzy enchilada.) We will definitely be back and we are already discussing out next visit! We fell in love with Rosas House!"}
{"text":"Despite the afternoon consideration of eating a salad for dinner, as dinner time approached, that thought simply became unbearable. The temptation of a Mexican carne asada overwhelmed my senses and a recommendation of a friend solidified the venue.   Pulling in to the establishment, the design is pretty spectacular. The interior tile work, the beautiful entrance, the pleasant hostess were all building up a pretty positive picture. The server was very kind as well and provided a few solid recommendations.   At times, I wish I could hide my yelp rating until after a person reads the review. With that considered, the moment when salsa came out is when I started getting odd hints that something may not be as ideal as I thought just a few minutes ago. The red salsa was a very unusual preparation, tasted like an Italian pasta sauce just married a chile pepper.  I am not saying it was bad, but not to my personal taste preference. This is not the reason for the poor rating. The reason is the main course, which was carne asada and was simply the worst carne asada I've ever had. Completely dry, I had to drench it in sauce to make it bearable. The meat tasted like it was frozen and quickly defrosted, with no natural taste of the meat and only some marinade. Portion was huge, but unfortunately there was just no way to finish it once the salsa was gone. The pico was pretty disappointing, tomatoes were not ripe at all, and proportions off. The rice and beans were pretty average. Others at the table were not too impressed with their meals either for various reasons.   With that said, thus was my first and last time to visit, if they cannot make an edible carne asada in a Mexican spot, they should be labeled a fusion restaurant instead."}
{"text":"dissapointed!!! since i have been in the restaurant management side of it for over 30+ years!!! i do not like to give bad reviews!!! well, i knew that the sirrine family had sold the mckellips location, and i forgot about the fire that they had there! ate and mesa dr. and university years ago right after the \"new\" owners took over, and it was wonderful! well, went to baseline before it shut down and wonderful again! well, went to the \"hacienda\", and i can tell some things - canned chicken was in use! the \"roasted corn\", was the herdez frozen mix, and just plain dissapointed!!! son ordered dos xx beer on tap, and came out warm!!!  on the wonderful side - green salsa at the table with wonderful chips were awesome!!! the male server was only back to check on us twice!!!! not good!!! - the manager(s) did not even \"table touch\" to see if something was wrong!!!! for being \"prime time dinner time\" at 6:30 pm, there was one table being used outside, and about six tables in use!!! - was it the democratic debate on cnn??? - my guess not! i could list more, but that is not my style! i like to be happy about where i go, and it will never be hacienda de rosa's again!!!"}
{"text":"I honestly really enjoyed my meal here, very fresh ingredients and large portions.  The Margaritas were very good.  Service was great, the place was very busy, but I still was able to get my food promptly.    Their salsa's are awesome especially the verde salsa!  The atmosphere of course is top notch as well, you really feel like you are on vacation while dining here.  I will be a regular here, very happy, thanks so much!"}
{"text":"Definitely did not realize the restaurant had changed hands until we sat down and noticed there was no margarita menu. Shrimp in the enchiladas was overcooked, shredded beef under seasoned, and the fajita meat on my salad was grey, rubbery and poor quality. Customer service was good, but will probably make the trek down to Gilbert to the actual Rancho de Tia Rosa next time."}
{"text":"Love that they revived the old Tia Tosas!! The menu is almost the same & the dollar menu is awesome! You can't beat the price. The food is great & location perfect!"}
{"text":"This review is for the Taqueria. Food is decent but my order took a long time to receive. This is not the first time. Almost empty not busy...not a place for a quick stop.."}
{"text":"Taqueria Review. I thought I was being treated like a god because the beef was a burnt offering on the nachos grande and flying saucer. Not char broiled but actually burnt. The chicken mole enchilada was a pathetic little thing sitting in the pan. Definitely not worth the $6.79 paid. Not even close to the old Rancho de Tia Rosa quality. Wife and I say never again."}
{"text":"Loved the previous place. The building is so pretty. But now the food is very very bland. Such a disappointment. As a party of three we all got different meals and we were all three not impressed."}
{"text":"Why Tia Rosa's closed is the Big Question. The new restaurant is less than adequate. Don't ask what kind of margaritas they have or the type of tequila used because you will be told \"Wells\" not a typo. Food is sub par. Don't waste your time or money."}
{"text":"My first thoughts were that I liked the decor and ambiance.  The menu offers a good range of selection. I had the combo fajitas (chicken, shrimp, and steak).   The fajitas arrived sizzing. But it was obvious at first sight that the majority of food on the plate was onions and peppers (deceptively arranged as if those eating wouldn't know the difference). They were tasty with the exception of the small, hard, barely warm tortillas (think flour, water, heat, then left to cool and dry out).  I asked for more tortillas (without mention of the previous tortillas condition), and three more tortillas were brought out (at .50 each) after a 12 minute wait (once food was cold).   It was a Monday evening and not busy.  There were several employees walking around and talking amongst themselves.  My review withholds one star for the sub-par tortillas and one star for non-attentive service.   There are so many variables that can change at a restaurant at any moment including but not limited to current employee mood and a good cook's work schedule.  So, I would recommend that you try it for yourself. You might hit it on a better night."}
{"text":"From the service to the food to the overall management, can't really recommend this place at all as anything worth writing home about.  Let's just get the good part out of the way: the design and ambience of the restaurant was perfectly, authentically Mexican cantina with beautiful courtyard entrance, high vaulted ceilings and great decor.  Service issues: no water or greeting for at least 10 minutes. We were on our second basket of free chips and salsa when we had to ask the busser for water. By the time our server came over, she was so rushed it was just \"You know what you want?\" and we did, so we ordered all at once.  The food took longer than expected and arrived warm at best, but of our party had to ask them to heat up his plate again.  When we finished, they didn't clear our plates for a while either.  Overall poor experience and mediocre food.  I believe the hosts sat the tables for dinner all at once so our server and the kitchen got overwhelmed.  Oh well. Hope they get better because when you walk in it really looks like you're going to get a really authentic Mexican experience."}
{"text":"What a great place to eat. Came here to celebrate my husband's birthday and they gave him a free dessert and the server made sure there was enough for all of us. Food came out hot and delicious. The atmosphere was awesome but my only issue was the bathroom. It smells really really horrible and needs to be cleaned more. We will still come back to try other items on the menu."}
{"text":"This place was amazingly good! The staff is a little unorganized and frantic but the food is definitely worth it! One of the best Mexicans places I have been to in Mesa."}
{"text":"We were drawn in by all the bright lights and the fun looking environment! Always appreciate the extra effort to make the place look fun. While waiting for a table we enjoyed some great margaritas and loved the green salsa! Got seated and had a great server, had the mole enchiladas which were Amazing! Definitely will be back!"}
{"text":"$4.59 for a single taco!  And its just a normal taco that tastes like normal tacos. Waaaayyyy overpriced... Snd they gaurd their salsa like it was gold, heavens Im sorry for asking for a salsa!"}
{"text":"Looked so promising... one positive the free chips and dip were pretty tasty.  We walked in and had a male server say he'd be taking care of us. We placed our orders and I asked for a classic lime margarita. Apparently the only type of margaritas this place makes are from mixes and no one had the heart to tell me... So after waiting 15 minutes with no drink in site, I just canceled it and ordered a water.  We got our meal and the one positive is it was pretty easy to eat fast because all I could think about was getting the check and black listing this place. We asked a passer by to get our check and she inquired as to who our server was we said the gentleman's name so we thought she went off to find him. Low and behold she comes back and informs us that our server is actually a lady.  Horrible service, beautiful venue, and apparently no limes to make a margarita with...  Beware."}
{"text":"Me and the wife love this place. Fish tacos are great, sauces are good, cheese crisp is a must have. Haven't been disappointed yet."}
{"text":"This was my first time having dinner at Hacienda de Rosa's, I recently relocated to the Mesa area from the Bay area (Northern California).  My experience here was less than stellar.  It took about 30 minutes for our party of 7 to be seated, not a big deal.  When we were seated we were greeted fairly quickly by our server, who introduced himself and quickly filled our drink orders.  After a few minutes he returned and took our order, seemingly with no issues.  He returned several times to make sure he had a couple of people in our party's order correctly.  It appeared that he was having difficulty entering our orders into the point of sale system.    The first time the food runner came out with our meals he had three of them, one was incorrect.  He left and returned with the correct one.  After a few minutes he returned with two more of our orders (that makes 5 of 7).  After a few more minutes he returned with one more order. ( 6 of 7)  The food runner asked me what I ordered, I told him and he went to the window and was there for several minutes.  He then took the order ticket to our server and they talked for several minutes.  The server then came to our table and confirmed what I had ordered, he then left and I continued to wait for 10 more minutes before our server came back with my fish tacos.  My fish tacos were lukewarm.  the cod fish taco was all cabbage and little cod.  The salmon taco was quite tasty, but wasn't hot.  The beans had a nice flavor, but again were cold.  The majority of our party commented that it wasn't the same as before, I learned that they had had a fire and had just recently reopened.  That might explain the general disorganization.  It was overall a very lackluster experience and I would be hard pressed to return again."}
{"text":"This is NOT the same restaurant before the fire. Food was mediocre at best. We used to frequent this location all the time. The old neighborhood gem is gone."}
{"text":"Three of us decided to try the new restaurant for lunch today. We started with the Queso dip, which is always a favorite of our family. None of us liked it as there seemed to be too much chili spice in it. We all ordered something different although all came with rice and beans. We all liked the rice, 2 out of 3 liked the refried beans. The chicken enchilada with green chili sauce was probably the best out of the items ordered. The guacomole was a little on the bland side as well. The food just was not to our taste. The portions are plentiful although a little pricey. The service was acceptable although not over friendly. One of our party was eaten alive by mosquitos although we were inside. Will not be going back which is too bad since Tia Rosa's used to be one of our favorite places."}
{"text":"Love this place! Chips and salsa are excellent and plentiful (they'll bring seconds or even thirds, with a smile), every entree we've ordered has been delicious and so big we've had leftovers to take home. Service is always warm and friendly. This is a beautiful restaurant with plenty of authentic Mexican decor and atmosphere. One of our favorite places, even after the change in ownership."}
{"text":"You know it's not a great sign when the chips and salsa aren't very good at a Mexican restaurant. We read the reviews and ratings beforehand and saw mixed reviews from people. I thought people were just complaining! However, my boyfriend and I ordered the fajitas (which we were told by the waitress is popular) and were disappointed. The chicken was chewy and tasted like it came out of a frozen bag and the beans were refried pork beans you'd have at a bbq...I wanted to send my meal back, but I didn't want to be rude. We paid and left hungry. The restaurant is cute and charming and nice looking and I was expecting authentic but got what tasted like a terrible \"just add water\" meal."}
{"text":"This is my second time here since the reopening under new ownership & new name. Both times I've eaten out in the Taqueria (take out shack by the street). Today I got a Grande Shrimp Taco and a side of rice. I'm glad I got the large (4oz of shrimp) taco, its close to the size the old owner served. At $5.49 its priced about the same as before.  The young man behind the counter brought me chips N salsa before my taco came up, which was a pleasant surprise both because I got two sides, not a meal, and because I expected them to call #12 back to the counter since it so large on my receipt. Maybe they do that when its busier. I thought the green salsa vwrde was delicious and the chips were very thin like I like them.  The shrimp taco looked just like before, with big ol shrimp N pineapple on a double corn tortilla. Unfortunately this isn't quite the old owners taco. It was cooked properly and the quality was g9d (tender & juicy) but the flavor was pretty bland. Not at all bad, but not where the bar was set. The rice was very ordinary too.  All in all, this was a 4 star meal to me, as long as u don't keep measuring them to the old place."}
{"text":"We've been here 4 or 5 times now each time is great. The chips and salsa at the table are wonderful not to mention a layed back atmosphere."}
{"text":"After looking at this very interesting Southwestern Architectured Building and telling my Husband every time we drove by -let's eat there! I finally got my wish today;) we were NOT Disappointed;)Building very  unique  inside and out! Servers were very Friendly and efficient;)Drinks and Food -very good! If not a little to much! There were 8 of us and did not have to wait to long! So Thank You for a pleasant ExperienceWe will come back next year"}
{"text":"Lost our order and we waited over an hour for our food  I had fish tacos; bad choice; the cheese had a funky smell could not eat them They offered a free desert we opted for a free cocktail  Was not feeling well at all the next morning  Will not return"}
{"text":"We have been driving by for awhile and finally decided to try it (should have yelped it first) it is a very nicely decorated restaurant with a great decor.... not too many people there.  We walked in and saw the specials prices they were very high        I told my husband that we should leave but we stayed .... received our chips and salsa the red was ok the green was so sweet and disgusting the red was even sweet.   Took awhile for the waitress to show up  We ordered but the prices were very high and no lunch prices.  Our food came up in the window but our waitress was no where to be found so the chip guy brought it to us.  The food was disgusting.   beans tasted like bbq sauce was in it .... rice was gooey and very tomato based.. I got three chicken rolled tacos they were very small and had to buy guacamole extra even after the price was high.  My husband ordered carne asada crispy tacos, they were horrible .... whoever cooks the food should be fired.   The waitress never checked on us and the other waitress was at the next table talking to some regulars the whole time even when our food was in the window ....no teamwork,  we should have tipped the chip guy!!!  When we told our waitress the food was the worst we have eaten in AZ she said \"oh our manager isn't here so I can't take it off the bill\".  Outrageous!!!! Don't eat here   Taco bell is better! Ambiance is good but who cares!!! Please please please dont waste your money!"}
{"text":"Just took friend from Montana there  for dinner.  We sat there for 30 minutes  with no recognition or service even after brought to hostess attention..  We walked out.. Very sad.."}
{"text":"Authentic Mexican Food dine in or take away! This lovely restaurant not only serves amazing traditional Mexican dishes ,you feel like you're in a beautiful Mexican hacienda . The wait staff was friendly , the parking was a large parking lot. No need to ask for more chips & salsa they just appear half way through the bowl."}
{"text":"The restaurant looks really good but thats about all it has going for it. We sat inside and when we got to our booth the dining room was filled with smoke from the kitchen. We sat down and waited a little longer than we would have liked for a server to grab us drinks. The food wasn't good enough for the price we paid for it and our server didn't check on us until well after we were done with our food. And then we waited way too long for her to drop/pick up the bill. We were fishing through our wallets to see if we could just pay cash and leave but neither of us had enough.   Whenever we were looking around for a server, all the associates we herded near the bar on the other side of the room. Our server wasn't even among them so I'm assuming she was in the back.   Im a server I usually get it if theres a couple things wrong, but I'm never coming back to this restaurant. If it was a busier night i would be slightly more understanding but the dining room was half full."}
{"text":"I'll continue the sentiment with a Whopping 3 stars  The green salsa is sweet. The hot is hot.  They love jalapeños for sure. With that being said.  The pictures on the menu have no identifying names so getting a new server with an inability to properly select said menu items is a far cry from fun. The special quesadilla with all the garbage on it was a bit much, also directly under another nameless image didn't expect my quesadilla to come with 2 pounds of jalapeños or pineapple.  Everything was sweet.  Everything! The green enchilada was sweet, no surprise. The green tamale was 98% corn and 200% flavorless.  I did get to try the new corona Premiere, that was redeeming, the fact I had a beer.  Oh and one pube, or some unidentified bodily hair in my tamale.  The service was slow AF, even had to ask a bus boy for water upon arrival, sadly it looks so grand and amazing from the road, I've always wanted to try this place but now I wish I would have waited.  I can't say we'll be back. Ever."}
