{"text":"Great first experience ordering delivery from Hai Feng. My food came in under 40 min. and was very flavourful! The Pork Dumplings were delicious, my fried rice was a perfect texture and the Crispy Beef was nice and sweet. Even a few days later the reheated leftovers tasted great, when does THAT ever happen with Chinese food?"}
{"text":"Just ordered it. Price was good. Food was just okay.  Kind of disappointing after I read some of the reviews.  Specifically, the chicken balls had very little meat in them and the vegetable lo mein had chicken it but  it was the best dish we ordered-good thing we aren't vegetarians."}
{"text":"Never been or thought of getting food from this spot but tonight we did because we wanted Chinese. I thought the price was pretty expensive! Battered sweet and sour shrimp was $12! They were nothing special and should have cost $8.00 the most!   It was my bad but I didn't know that I was charged delivery fees so I ended up double tipping! 3 items (one being veg fried rice) and 2 drinks, we ended up paying $41! Minus my tip it came up $37 with delivery charge, still too much for the small portion and 3 items!!"}
{"text":"Meh, Not so good,  the food was delivered fast but was barely warm at best.  The hot and sour soup tasted burnt and funky.  General tao chicken was mushy not crispy, was lacking flavour and not spicy.   Vegetable rice also was mushy and lacking flavour. Vegetable spring roll was cold and flavourless.  Will never order from here again,  it wasnt that one dish was bad or not to my taste, they all were straight up absolutely horrible."}
{"text":"Food was meh. Kung pao chicken  was somewhat  tasty but the  chicken  was off. The chicken chow mein-vegetables didn't  tatse good. The  hot and  sour soup, was HORRIBLE. We had one taste and  tossed  it. It smelled like sweaty feet. Will not order  from here again. Best in the city is still Szechuan Gourmet  near Bath and Steeles!"}
{"text":"From the moment we phoned and got a cheery helpful lady on the line, we started hoping and the proved well-founded.  The steamed pork dumplings were great.  BBQ pork lomein was delicious with a generous mix of meat and veg.  Orange chicken and tofu veg with black bean were also just right--peppy and flavorful without too much salt.  PLUS the price was reasonable and delivery fast and pleasant.  This is good old-fashioned homestyle Chinese food, just the ticket for when you're too tired to cook and want something nice but you don't want to blow your entire savings account."}
{"text":"Really not impressed. The chicken creamed corn soup was eggy and slimy, both the chicken and beef dishes had an aftertaste which suggests poor quality...  The seafood dish was edible and I have lost my appetite to try the last dish.  Yuck."}
{"text":"Just ordered delivery and I had to yelp it out!  Tried this place out based on the one review posted on here, and it was totally worth it. The prices are really good compared to Mandarin and C'est Bon and it tastes very fresh. New favorite chinese delivery for sure! I ordered pork dumplings, sweet and sour chicken, fried rice and a soup and it is all so tasty, very impressed!  The delivery guy was so nice too!"}
{"text":"Low quality chinese food.  I could barely eat the sesame chicken and shanghai noodles. The dumplings were okay.  The sauces were too strong and tasted funny.   Perhaps people are attracted to the low price, but I should have eaten cereal for dinner (and for less money) instead and it would have tasted better."}
{"text":"I ordered on-line, and the delivery just took 25 min.  This is a place with cheap prices, fast food, and average-medium quality... I wouldn't go to eat there.   I ordered from here because I was sick, tired, and I had the craving for a soup. Besides, the place is located in my neighborhood, so, I decided to give it a chance.  I asked for a special wonton, chicken, noodle soup, spring rolls, dumplings, and a seafood chow main.  The soup was too oily, and didn't taste like chicken at all, just like sesame oil. The spring rolls were crunchy and tasty, so as the dumplings.  I didn't taste the chow main, but my husband ate it, and said it wasn't too bad...  So, if you go, or order from this place, without taking into consideration previous reviews (like I did), don't complain..."}
{"text":"Okay, this was game-changing chinese food omg.  I originally ordered it to-go but when I saw the food, i had to eat it right away. I dunno why every Chinese food place is stingey on the hot sauce packets.  If I ask for more than two they  act like they're doing me this huge favor. Do they actually think it's possible to distribute THAT tiny packet to ALL that rice?  I love chinese food, cuz they always give you the right portion size: too much. The General Tao was so yummy and so was the rice.  I have no constructive criticisms. Five stars!"}
{"text":"I think all these other reviewers must be smoking cracking, as I just ordered delivery from Hai Feng and what showed up at my door is not even what I would define as food.  I basically paid $35 for several plates of crap.  The sweet and sour chicken doesn't look anything like it should.  The meat was soggy and tasted like dried up pieces of rocks.    The cantonese chow mein was equally gross.  Pieces of shrimp floated around in the dish looking nothing like shrimp, but chewed up pieces of crap.  Plus there was a fat piece of pork skin flloating around in the middle of it and the rest was equally soggy.  The mixed vegetables were also subpar and soggy.  The egg rolls did not look well cooked.  Everything was just disgusting and I'm still hungry because it all went in the garbage after a few bites during which I was cringing the whole time.  EUCK!"}
{"text":"Just ordered for the first time. Really good Chinese and it came within a quick 20mins  What we ordered:    chicken fried rice (yum) 2 chicken spring rolls (okay) boyfriend liked it more than me Black pepper beef (really good) not spicy enough but so much flavor and tender beef BBQ pork lo mein (good) wish there was more pork but lots of veggies and very tasty General tso chicken ( AMAZING) still very crunchy and saucy by far our favorite   I wanted to order just BBQ pork slices but she said they didn't have any maybe in 2 days, which I didn't understand cause I had BBQ pork lo mein, but whatever the food was really good  Try it."}
{"text":"Love this place!  I have to say I totally misjudged this place. I walked by the place many times thinking I would NEVER eat here.  It looks like a bit of a run down take out place.  I never even bothered to look at their menu. Today I stopped and was looking at their menu and a passing gentleman said to me, \"go in the food is good\". So I did. They have a very healthy vegetarian selection and an awesome veggie dinner combo. The lunch deals look pretty sweet too. Super cheap!  This is definitely more of a take out place as there are only 2 tables that can seat people."}
{"text":"I hate to be the voice of dissent on Yelp, but my experience with Hai Feng rated far fewer than five stars.   As new parents hoping to keep the magic alive, my wife and I have decided to keep Saturday as our \"date night\". of course, our reach is limited by our new arrival but there's no reason we can't enjoy Chinese delivery (so neither Mommy nor Daddy need to cook) and pop a movie in the ol' DVD player. What could go wrong?   Plenty.   First off, never underestimate the power of a few-weeks old baby. We are healthy, fit adults who were reduced to tears of exhaustion by the time dinner rolled around. By 5 pm we pretty much agreed that neither of us had the energy to follow the plot. Of a movie that we had seen before. And lest you think this was some great intellectual film, it was \"Step-brothers\". That's how tired we were.   At least we could find comfort in familiar Chinese favourites. While we lamented the loss of our favourite local delivery joint (Tasty, we hardly new ye), we were confident that our gwai-lo tastes, combined with the helpful yelpful ratings Hai Feng had received, would yield happy palates and full bellies.   How wrong we were.   Tastes and textures were uniformly weird; the kind of weird you get when it seems like they're cooking waaay outside their comfort zone (think going to a japanese place and ordering the token \"chinese\" dish they sometimes keep on hand for people who don't know better). We wanted good, greasy hole-in-the-wall Chinese. What we got was something altogether different.   Vegetarian hot and sour soup arrived with unexpected veg, an unpleasant murky flavour and the texture of a colloidal ball of corn starch. Chicken corn soup had similar textural issues; it was like drinking a sneeze.   My fellow yelpers praised Hai Feng's General Tao. Why, I don't know. It arrived cool; gnarly bits of tough and sinewy chicken in dessicated breading, with a sauce that tasted solely of ketchup (not my favourite condiment under any circumstance). I respectfully suggest that Hai Feng rename their version \"General Heinz\".   Kung Pao chicken was similarly off: the poultry was similarly poor, and breaded, and swimming in a sauce that offered negligible heat but a whole lotta peanut butter. I'd rename it Skippy Chicken, but i think that joke's played out.   We recently discovered the joys of Beef Ho Fun at places like Congee Wong uptown. Beef with rice noodles promised similar joy, but arrived as a singular clump of noodles and rubber-band beef in anonymous brown sauce.   $40 worth of chinese food, straight into the bin. Date night fail.   No wonder Hai Feng gets low marks from me."}
{"text":"I was very excited when I got the flyer in the mail. As a vegetarian I do not get Chinese food often and this place had carefully labelled what was, and was not vegetarian. My boyfriend and I ordered 2 spring rolls, chicken low mein, tofu and vegetables in garlic sauce and spicy Szechuan eggplant and tofu.   It was very hard to get a hold of them. When we called we got a busy number and fax numbers, but then we persevered. The woman said 40-60 minutes. It came more than 70 minutes later. When it arrived the driver did not have change and was yelling as he ran around my building back to his car to see if he had anything. He ended up getting a very small tip because we only had a bit of change.  The bag was dripping in oil. That was our first clue that it may not go well.   my boyfriend ate his chicken and He said his was \"okay\". I ate mine and it was pretty bad. Very greasy and unflavourful.  I ate a bit and then gave up. We promised we would not order from it again.   I woke up at 1am horribly sick. I spent the next 4 hours in the washroom. I would never ever eat it again or recommend it to anyone.    disgusting."}
