{"text":"It was chilly in there, could not take my coat off and that's just a minor pet peeve. It was a cold rainy day outside and I could not shake my chill in the cold house like building. We ordered wings, pimento spread , mozzarella sticks and salad.  Boneless wings were tasty but very small, I hate having to pay extra for a few celery sticks and blue cheese... this should be standard. Italian salad was really good with a zingy homemade dressing. Pimento spread was dry and did nothing for me, the pita crackers were tasty. The menu is somewhat limited as is the seating. I will go again in the summer and try the patio and pizza. Server was attentive. No salt and pepper on tables and then the server began to get busy to obtain some."}
{"text":"This bar is amazing! Not only is the atmosphere warm and welcoming, but the food is delicious. The brussel sprouts are to die for and the pizza is made to order. They specialize in pizza, wings and fried chicken and it's perfect! Not typical bar food that can be found at any bar.  A Cozy and comfortable Cheers type bar where everyone knows your name! Sure to be a crazy success!!   The owners Julie, Wil and Eric are so welcoming! Here's to many years of friendly neighborhood love and friendship!!"}
{"text":"Awesome bar.  Food was out of the world.  Menu is perfect for a bar.   Pizza, wings and southern fried chicken is to die for.  Simple but phenomenal.   Service is great as is the ambiance.    A great new local favorite.   Crazy if you don't try it."}
{"text":"We enjoyed a terrific Za on the intimate patio this evening. Such a friendly atmosphere! Madison, our server was attentive and so friendly. Julie the owner came table to table on the patio to greet us. Casual and relaxing here. Make sure that you stop in! Lots of great Za combos, all made to order!"}
{"text":"My husband and i were excited to try a new local bar and grill. We were disapointed with the limited menu and high prices for food and beverage options. This restaurant offerred grocery store quality food at high end restaurant prices. And you eat off the paper plates that are already stacked on your table, like you are attending a picnic instead of a sit down restaurant experience.  Underwhelming and disappointed."}
{"text":"New favorite neighborhood spot. Its a wicked nice place, but its a sports bar...so don't expect fancy cutlery and handkerchiefs like the \"disappointed\" folks below. Its a cozy little spot, but a great friendly vibe.   Some of the prices might be a bit more than an average sports bar, but when you taste the food, you know why. This chef has made it a point to use fresh ingredients, and everything is made to order. I'll gladly pay the premium for this.  You gotta start off with the brussel sprouts. I could polish off a basket on my own, even though the portion is plenty for 4 people sharing an app. The pizza's are all great, with a thinner crust. I always ask for a little extra in the oven - crispy! But the end all, be all....Spicy Apricot Wings. New favorite wing sauce anywhere, and I have turned several folks onto them already.  And, every Tuesday this summer from 6-9, live Latin Jazz guitar on the patio! We go every week and everyone is having a great time together!"}
{"text":"Apricot wings are bomb  Cool patio  Friendly staff  Prime location   Good for games  Hot tots"}
{"text":"First time visiting here good little place to eat and drink a little small but it was nice live music on Tuesday's and people were up dancing it was a great evening pizza and wings were good parking is limited their lot is very small"}
{"text":"3.5 stars (Yelp, please give us half-stars)...  Hail Mary's is a little sports bar in Westlake on Center Ridge Road in the old Frankie's (Fountain Grill).   I checked in on a Saturday afternoon for some playoff hockey and day-drinking, and I had a really good time. It has a really nice \"neighborhood\" feel to it.   I ordered some wings (just the standard mild Buffalo sauce) and they were terrific. I dare say they were the best wings I've had in some time.   The decor is sort of a 1950's style diner meets trendy bar, with bar stools and seating finished in chrome with black cushions (1950's style diner) with a bourbon barrel backslash behind the bar (trendy bar feel).   You may recall I said \"...a little sports bar...) It's really small in there. The bar only seats 10 and there are a few tables that can maybe take another 20-25 more, but it would be pretty crowded in there at that point. Not a knock on the place, it is what it is, and they've made good use of the space. It's just lacking \"polish\" in my opinion to really give you that comfortable feeling. Maybe that will come in time as the place matures and finds its identity.   If you're a local looking for a place to just hang out, Hail Mary's will probably be just fine. Good wings, friendly crowd and good service. If you're looking for an \"experience,\" maybe you should keep looking."}
{"text":"Its true to what its purpose is. A small local bar and grub place. The space is tight but they certainly made use of every inch. The pizza and wings are great."}
{"text":"This is a cute small bar with nice beer on tap, pizza wings apps. We had the loaded tater tots and they were tasty. The apricot wings are a big seller. There is a patio and the inside was done so cute. Cut barrels form the paneling in the main wall with four TVs. Enjoyable stop and a great new place."}
{"text":"Julie the owner is hands on, place looks fabulous and food was good. Though pizza crust,  was darker than i like and took away from toppings. Every table is inches from other so you are quite familiar with others . Pizza on thin paper plates was a surprise, but hey waitress said the younger drinkers don't mind. So her unconscious slam on us late 40's/50's people should suck it up?  She asked what we thought"}
{"text":"I couldn't wait to try this place as I've seen them working hard to get it open. This is in my neighborhood and it seems nothing lasts in this building.   I think a neighborhood bar rather than restaurant might be the answer so I'm wishing them nothing but good mojo.   Walking in, I loved what they did to transform it into more of a bar that serves food than the former restaurants. Very friendly welcome and you feel at home immediately. It definitely has that \"Cheers\" kind of feel.   The menu seems adequate for the type of place:  pizza, wings, fried chicken and several appetizers.  We tried the pimento cheese dip, mini meatballs and macaroni salad. I loved the meatballs, they had great spice to them and I believe they were made with sausage and not ground meat.  At any rate, they were a home run in my book. The pimento cheese spread was good, but didn't have enough kick for me. Definitely homemade.  The macaroni salad reminded me of my Aunt's back in the day. It was too sweet for me but my husband enjoyed it. I would not order again because of the overly sweet taste. The pizza looked good so will try next time. Thin crust.   I am not a fan of paper plates at any time, but definitely not in a restaurant so this was a con for me.   All in all,I liked the vibe and friendliness and food was certainly adequate. Hope they use regular dishes sometime soon instead of paper ware.   I will return and hope it is a neighborhood hit as This area could use a nice, friendly bar with decent eats."}
