{"text":"Our favorite local place.  Food is always excellent, great beer selection and great service.  Hal himself is usually there. My dad called it the best burger ever. My personal favorite is the mushroom brie bisque. To die for."}
{"text":"Stopped in while on the road traveling for work. Great selection of beer and good chicken wings. Had the steak sandwich with sweet potato fries and it was pretty dang good. The best part about my visit was the fact that apparently I unknowingly was sitting in the seat of a regular and Pittsburg Pirate great Manny Sanguillén. Manny was great and pulled up a seat next to me and was as nice as could be. This will definitely be on my places to stop in to next time in town."}
{"text":"First the good--The food at Hal's is outstanding--love love love the food!  It's delicious and they give you really nice portions.  The pepperoni rolls are soooo good and the Italian hoagie, meatloaf cupcakes and strawberry chicken salad are all amazing!  It's a cool atmosphere and the outdoor seating area is lovely!  The servers are all young and sweet.      However, the service leaves a lot to be desired.   I should say, I have been there with just my husband and we were served quickly, got our food and drinks in a reasonable amount of time but every single time I have gone with a group (or 6 or larger), the service is seriously lacking.   It takes forever to get refills or more beers/drinks, etc. and our food took so long to come out. In fact, our waitress was MIA so long that we wrote our orders down and handed it to her once we finally caught sight of her again.   She was running around like crazy so maybe someone called off or they were short handed so not her fault but I think the management should step up and help out or DO SOMETHING!  Or even if she explained what was going on, that would have been appreciated.  The saving grace is that the food is fantastic but I'm not so sure it's worth the wait any longer.   I may be back for drinks or if I go with a group, maybe we should ask to be seated in groups of four to up our chances of getting out of there in less than 2 hours! And I would never chance going there for dinner if we had plans after (like a movie or concert because chances are we would miss most of it!) I think I may just go to Rum Runners or Seibs in the meantime if I have the choice again.  Or until the service has improved.  Unfortunately, many of my friends have had the same experience as well."}
{"text":"Everyone before me has basically nailed it. As an out-of-towner on a business trip in the North Hills, I wanted to stop in a nice local bar, grab an appetizer and a drink. 

Hal's was perfect. Great menu and great bar food, at an affordable price. Definitely a sports bar atmosphere, lots of TV's with different games on. The beer selection was outstanding as well. 

A+!"}
{"text":"My BF and I stopped here for dinner on a Saturday evening.  We arrived around 5:30 and were seated right away.  The dining area isn't very large and within 15 minutes, there was a wait to be seated. (Warning: The entire place is very dark and it is difficult to read the menu without glasses and/or a flashlight.)  

The menu has a lot of great options:  sandwiches, salads, entrees, pizza and a BYOB (build your own burger) option.  I went with the half chicken entree and BF went with the Pierogie appetizer, Wings and a house salad.  My chicken entree was delicious. The portion was large and the rub on the chicken was just spicy enough. The chicken was moist and tender.  The side of broccoli was steamed perfectly.  My only complaint is that the entrees do not come with a salad.  It's $1 extra if you want a salad.

My BF really enjoyed the house salad, since all ingredients were chopped.  The wings were a nice size and the BBQ sauce was sweet, not at all spicy.  The pierogie appetizer was a little disappointing.  They were hard, chewy and smothered in a congealed cheese.  We were hoping for some butter and onion.  We would not order them  again.  

The prices are pretty reasonable ($8-10 for sandwiches and $14-$20 for entrees). The place does get rather loud since there isn't any separation between the dining area and the bar.  

Overall, we enjoyed our dinner and would definitely stop in again."}
{"text":"Delicious. The wings were good and fairly priced. Perfect sauce and crispness ratio. My wife got a chipotle turkey sandwich which she loved and it had tender roast turkey on it, not the lunch meat you find in other places. The beer was reasonably priced as well. I definitely recommend if you like a little better than ordinary bar food at a reasonable price."}
{"text":"Visited here from out of town; when I looked up bars in the area I found Hal's.  What a gem.  Great sports bar, great beer, great food (had the grilled pastrami & Oberon/Sam Adam's summer - excellent).  Only thing was it was, it was crazy crowded ... So I decided to check out a few other spots from my google search - struck out 3 times before realizing I was in the right place to begin with!  (Apparently many bars in the area can still allow smoking Hal's does not!) ... So I went back, and had a great night.  The staff were very friendly and personable, especially once the crowd died down (and quite attractive as well!). I would recommend to anyone and will definitely return whenever in the area again ..."}
{"text":"This place is absolutely wonderful! Everyone who works there are always a joy to talk to and make your trip here worth while. The food is excellent and greatly priced. Be sure to check out the bottle shop next door, they have a huge selection of beers! You will not be disappointed!"}
{"text":"Good food, wide selection of craft beer and a full bar, they recently added a bottle shop. In the summer there are corn hole games setup outside for anyone to use. It's a great place to stop but can lead to an expensive night out if you linger for too long. Also my friends and I have coined a term \"Hal's Roulette\" because it seems that every time we go there our tab either has more on it than we actually drank our it is missing beer we did have. Even with that Hal's is a good time and great spot to hang out at."}
{"text":"Great bottle selection and bottle shop next door. Vegetarian options too, which isn't common at sports bars. Lots of TVs with pretty good sight lines. There's also a very large TV at center of bar which is great for the game. I've had their crispy seitan and garden burger, both of which I recommend. The only thing I don't like is that it's too dark inside. This is okay for watching the game but it's hard to see other people and it makes the window light way too bright at the front. The wait staff are very nice and attentive."}
{"text":"Food is decent for bar food. And that's all it is...bar food. Few attempts at something 'fancy' are kinda funny. You're a bar.....be good at bar food. Be excellent at bar food. 
The beer list here is FANTASTIC. Seriously. Only place in the north hills that has Kasteel Cuvée. If know what Kasteel Cuvée is, you know the beer list is worth stopping here for. 
We like it, come often....for the beer. As long as you stick to wings and other simple fare, you're golden."}
{"text":"Love it here, so much that I almost regret telling people about it-- its so busy all the time! The only down side is the super young wait staff."}
{"text":"Incredibly good food, friendly staff and fantastic management make Hals Bar and Grill my weekly go-to for beer and dinner!"}
{"text":"Atmosphere is way better than the food. Great place to watch a game (does get very crowded and loud). Outdoor seating is the best in the north hills. Service is average, but the food is way to overpriced for what they serve, its bar food executed ok but they charge like its top notch."}
{"text":"I come to Hals every chance I get. The beer selection is great and the wings may even be better. The service is fantastic for a sports bar which makes it one of the best places in north hills to go relax and watch a game"}
{"text":"I had higher expectations of Hal's. Everything I had heard from my friends was all good stuff.   
The wait staff was horrible. Not experienced. I had to ask for water refills. I ordered steamed broccoli and the first time it came out with my entree it was swimming in butter. I kid you not, it looked like they melted a whole stick of butter in a bowl and stuck some broccoli in there. By the time I got my corrected order everyone was about done with their food. I got the fish tacos as the main dish, poor decision. Hardest fish I've ever has. I questioned if it was chicken because it was so tough and overdone. Lastly, my friend stopped me from eating my last taco because their was a crawling bug underneath it. 

So unappetizing, what a bummer."}
{"text":"Pros-  Nice outdoor patio. Decent sandwiches and beer selection.  Nice bar. 

Cons- Prices weren't great for the quality of the food. The dining area was lacking. Service was mediocre."}
{"text":"What a great beer selection for on tap and en even better bottle selection at the bottle shop next door! Great menu to pair with the beer too. My family has everything for meat eaters to vegetarians and we all found something that we could and and was delicious. When the place isn't busy, it's good for families with small children too."}
{"text":"Hal's is a great place to go in the north hills on any given night.   I recommend Wednesday's for wing night but it can get really crowded of course so be prepared to wait for a seat.  Wings are fantastic and worth the wait.  They are always fresh and never the frozen kind.  Thursday is another great night because next door they have a bottle shop with beer tastings of various craft breweries.....some you know of and others that are new or never heard.  Plus on that same night is $3 drafts in the bottle shop too.  Dan the bottle shop manager is very attentive and will recommend beers for you if unsure of what to get.  During the summer they have an outdoor seating area too.  Hal's overall is a great place to go for food and friends."}
{"text":"First visit to Hal's tonight. Started with 6 garlic parmesan style wings. The wings were excellent - the sauce had some bite, the parm was freshly grated over top and there was enough garlic to clear your sinuses, which is how I like them. They were served with ranch dressing and some celery sticks. Very tasty.

My entree was a half-rack of St. Louis style ribs, and I selected mac-n-cheese for my side. It also came with broccoli. The broccoli was very nice - only the florets, no stems, done perfectly.  The mac-n-cheese was pretty good. The elbow mac might have been a little overcooked but the sauce was creamy and thick. 

Now to the ribs. The serving was large for a half-rack but the only word I can think of to describe them was \"soggy\". The meat tasted fine, the BBQ sauce was nice, thick and tangy but the ribs had no crust and the texture of the meat was like a pot roast..  I will be the first to admit that might be exactly how they were meant to be, and maybe that's what their clientele likes - it just wasn't what I was used to. I like a little bark on ribs.

For dessert I tried Fried Oreos with ice cream and whipped cream. The ice cream might have been a second-tier brand.  Texture was OK but the flavor was too faint.

The service was good, we had our glasses refilled promptly without asking and our server was friendly and attentive. I would describe the atmosphere as LOUD. One of the loudest restaurants I have ever been in. The layout is one large room, with metal ceilings, brick walls and a hard floor so there is nothing to absorb any sound. 

My experience merits another visit as there were a large number of menu items I was interested in - fresh spinach salad with bacon dressing, ribeye, quesadillas, Cuban style pulled pork sandwich and others. I might try a slower night like a Monday or Tuesday to see if it's not as loud."}
{"text":"I tend to come to Hal's often. Its off of McKnight road, one of the better bars in the North Hills-ish area in my opinion, better than the Fox and Hound at least in my opinion. Its a small place, dark in atmosphere, mostly a sports bar but also a place where you can make reservations to sit down and eat. I usually come here to start the night and watch the Pens or Pitt games before heading out for the night. Its a good place to watch a game, has lots of nice flat screen TV's.

Their food menu is pretty bar generic with good wings, a hefty build your own burger, pizza, and they do have some steaks, calamari, and roast beef type stuff on their dinner menu if you want a heartier meal. I really come here though to suck down the Garlic Parmesan wings. Probably the 2nd best wing I have had in my many wing travels. I usually prefer hot wings but their hot wings just consist of Franks Red Hot Sauce which is kind of generic for me, but the Garlic Parmesan are out of this world. Trust me, you'll want to lick the drippings out of your dish after eating them.

There are about 8 beers on draft, mostly the basics, but they have a wide range of bottles to choose from. Also they have a ton of liquor if that's your thing. I've had some really strong drinks made here, mostly around 5$ for a mix drink and I wasn't complaining due to how nicely made they were. 

I was here last Saturday with a group of about 8 people who made reservations for 7:30 and the place was still pretty packed around midnight when we all left. I've never really had bad service here at all, and especially this night when it was pretty crowded and with such a big party we were all satisfied with how fast our drinks were filled and how good the food tasted. 

Hal is usually the big tall guy standing at the end of the bar kinda watching over things. He's a good guy."}
{"text":"Hal's is definitely one of the better wing joints in the area although I don't make it here too often. Biggest downside in my opinion is how dark and how loud it is inside. I always find the waitstaff to be pleasant and the food fine, it's just not my top choice of sports bars in the area.

The outdoor seating is nice and the fact they have their bottle shop next door is a plus if you wanna grab a six pack on your way out."}
{"text":"It is LOUD.  We couldn't hold a conversation.

I had a HUGE house salad and the lobster Mac & cheese.  Big chunks of lobster ... a new level of comfort food.

I would recommend perhaps dining early when the noise might be less."}
{"text":"My husband and I like it here. The food is good and the atmosphere is fun, perfect for watching sports. They have a great beer selection which we enjoy. I particularly like their pulled pork. They always have seasonal beers, like pumpkin in the fall. Beware, there is no cell service, at least for att."}
{"text":"Love their food and venue! The outdoor seating is great in the summer and the Christmas tree is amazing in the winter! Their drinks are a little pricey, wish they had more drink specials."}
{"text":"Beer, Good. Wings, Good. What more do you need? They have a nice ambiance - currently nicely decorated for the holidays. They have a lot of TVs so it's great for game day.  crowd and a huge beer selection. Only had appetizers but they were good. Wait staff was great. Definitely recommend it!"}
{"text":"My husband and my fave bar to visit
..great waiters and waitresses  good service and food"}
{"text":"For a Tuesday night, the bar was extremely busy!  The food was awesome but the service was AWEFUL!!   They need more friendly staff willing to work hard and do their job right.  We waited 45 minutes for our food.  (Which was great.)  However, the server never stopped over during our wait time or after we got our food."}
{"text":"Excellent service, very good wings, very good beer selection, bottle shop next door to the bar, good specials for food on Tuesday Wednesday and Thursday, very clean and modern appearance to the interior. Really no complaints. Only gave 4 instead of 5 stars because not a lot of options for entrees that interest me, especially considering I come here a ton. The wings are very very good, on par with sidelines if not better, but I'd love more entree options. Still, it's the best bar in the neighborhood to me."}
{"text":"Food was good. The sliders are delicious and the sauce on them is great. Large beer assortment. Good service. They have a big parking lot, but during happy hour it can be difficult to get a parking spot. Definately worth a visit!"}
{"text":"Although the food is pretty good, the service in the bar area absolutely stinks.  I come into the Pittsburgh area 3-4 times per month and occasionally stop in this establishment for a few beers and get take out.  It's a good idea to ask for another beer when your current one is half full for if you wait till its empty you will wait forever.  I regards to takeout, my food sat in my line of sight of over 20 minutes until someone came over and asked if I needed another beer.  I declined and said I was waiting on my order...then they went to where it was sitting and brought it over.  I asked for it to be remade since it was already going to be cold and the barmaid gave me attitude.  I am done with this place.  Good luck Hal."}
{"text":"Food was the typical bar food with some twists, however the atmosphere in the restaurant was a little confusing. Candle lit tables with large sports-bar style tv screens. Over all not a bad experience on the grill side. Mushroom brie soup is worth a shot if you're into mushrooms.

The real gem is the bottle shop next door. Definitely stop in here if you are a beer snob, or if you are just looking to try something different. I was very pleased with their selection and the fact that you can sit down and have a drink in there as well after making your own 6-pack. They have a rare beer club as well which you can gain points depending on what you purchase. A great selection of sour beers and quite a few ciders too, if you're into that."}
{"text":"Hal's is a hidden gem in the North Hills. I love going there and my family enjoyed it too.

As a starter, we had the fried pickles. I'm obsessed with fried pickles & it's hard to find a place that serves good fried pickles. Theirs are the best.

My favorite thing on the menu is the cheesesteak. It is melt in your mouth delicious. I also love their French fries.

My husband (who always has to get it anytime it's on the menu) absolutely loved their potato soup and French dip. He is super picky about both.

The staff is always very friendly & attentive.

Next door they have a well stocked beer selection and a nice bar where you can watch games & hang out.-

A few years ago I went there for New Year's Eve & had a ton of fun."}
{"text":"Always great food & drinks at great prices (especially for the North Hills). 
Expect a bit of noise because it is a sports bar."}
{"text":"Great bar tending staff and craft beer selection. Perfect place to watch a game, get top quality food and have a few beers. They have the best 6 pack shop in the North Hills, wonderful addition to their business."}
{"text":"I've eaten at Hal's at least 10 times and I either have wings or lamb chops or both. The waitresses are both beautiful and attentive. And back to the food... the lamb chops are f*cking amazing. Make sure to get mash potatoes instead of rice pilaf... and I always order one and a half of the lamb chops which gives you six chops. It's to die for... if you don't like it... kill yourself it's the best!!!"}
{"text":"Didn't know what to expect the first time I went to Hal's but I was pleasantly surprised. Its kinda tucked in the middle of nowhere in the North Hills of Pittsburgh, in a place where you would not expect such a large selection craft beers on tap and in bottles. So when I sat down and saw the beer menu, I was pretty happy.

I usually don't care for bar food unless its chicken wings and this place does it right. The wings might take a little while to come but they're pretty bomb. Well worth the wait when your chugging down a few beers. Oh yea, Wednesday is happy hour for wings too, which is nice."}
{"text":"Amazing selection of beers from around the world. Great variety of food and huge portions. The fish tacos were delish. Nice location not too far from downtown Pittsburgh with a country feel."}
{"text":"Beer is good, food is great, atmosphere is excellent. I've been here twice, the drafts have changed up a few times, but are solid. The last time I was in they had Deschutes Fresh Squeezed, Sweetwater 420, Dogfish 60 minute, Stone IPA and Founders porter all on draft. Pretty awesome, but they were only $5 a pint! Which is impressive for the quality beer. 

They are well known for their wings, but I got the Cuban Reuben sandwich. Combining two of my favorites, and it didn't disappoint. Piled high with pork and pastrami, topped with swiss and a mustard slaw that gave it just enough sauce. The service was great, too. Whenever I would finish or get close on a beer Emily or Alex would ask if I wanted another one. Great place, fairly priced with an above average selection."}
{"text":"Still five stars! Went back tonight and everyone really liked their food. I don't know if they normally do reservations but I called ahead yesterday for a large party and they were super accommodating and even called me this afternoon to confirm that everything was all set. As always, everyone really liked their food. I'm not a mushroom fan, but everyone who had the mushroom soup though it was excellent."}
{"text":"Solid menu, great draft choices, and excellent service. Sports bar theme but very family friendly atmosphere. We were able to enjoy dinner with our two small children with no problems. Wait staff was awesome and the food was right on. One of the best kids menus I have ever seen, our kids actually ate their food!  5 stars and an A+ for  Hal's."}
{"text":"Watched the playoff game here last night. Our waitress Alex was excellent.. Good craft beer and decent food. The meatloaf cupcakes were delicious. I loved that you quadruple your craft beer selections by being able to choose from ones at Hal's bottle shop next door!"}
{"text":"Are you searching for the classic American burger in a sports bar setting? You may want to check out Hal's, the home of the Fried Pickle.

Brittany was my trusted server, although she confided she was new. But she welcomed me and explained some cool things about the menu, and she was attentive and helpful. 

The food is very good. I was curious about the onion rings, which were quite brown, however they turned out crispy and delicious, not the least bit soggy. 

There was a list of about 10 beers on tap, including a marvelous Pizza Boy IPA.  Lots of bottles to choose from, too. 

Although I turned down the Fried Pickle, I'll be back to try it, soon."}
{"text":"Every time I take someone to Hal's their first response upon pulling into the parking lot is \"I thought you said this was a nice/cool bar?\" All of their worries are quickly squelched once we walk through the front doors. The interior is well designed and showcases a fantastic bar fully stocked with 8 craft beers on tap and a huge selection of bottles. 

Everything that I have eaten at Hal's has been fantastic (BBQ Pork Quesadilla, Fish Sandwich, Soft Pretzels, Fried Pickles, Wings, etc.) The menu is comprised of your standard bar fare, however, its all prepared with a moderate twist which makes it unique. All of the food is very reasonably priced ($8-11) and they have a daily special most days of the week. $1 Taco Tuesdays, $.45 Wing Wednesday, $2 Slider Thursdays. 

My only beef with Hal's is that it is too damn dark in there! Turn the lights up a bit, no one likes to use their phone to read the menu."}
{"text":"Great food. Excellent drink selection! Lots of craft beers. Plan on it being busy when you go most nights they will have a wait to be seated."}
{"text":"I can't help but love Hal's, they have awesome vegatarian options and their Crispy Seitan is to  die for. I always get it with the Sweet Chili Sauce which isn't too spicy and it's so big I always have leftovers.  The only things I don't like is the parking, takes forever to get a table and the services is never great.  They have a great draft list and I'm in love with the food though."}
{"text":"Aside from being disappointed when we try to come here and they aren't open, our experiences have been positive. Good beer selection. Good specialty drink options and the food is usually plentiful and good. Really loved the Jalepeno Ranch Chips.  Addictive and a lot for your order. Homemade dressings are good quality. I got the steak salad and asked for blue cheese over cheddar and boy did I get it. Actually removed some because it was so plentiful. Hubby's ribs were very tender and meaty. The broccoli was a little over done. But worth the trip back to try more items."}
{"text":"Incredible food! Comfortable atmosphere! Friendly and attentive service!  What else can you ask for? 

The food is A++, and always consistent.  Every item is fresh, full, colorful and delicious! I am here at least one time each week for dine in, take out, or just drinks, and have always had or seen a perfect presentation and a flavorful assortment.

The staff, including Hal himself, are friendly, personable and professional. Each always has a smile on their face, and it's genuine. Happy staff, happy customers. Hal has been great selecting people to support his vision for excellent service.

The atmosphere is perfect. TV's around the bar and seating to watch the big game, but not played so loud that you cannot talk. A bar area separate from a dining area, separate from an event room, separate from a bottle shop (with an excellent selection, by the way). Hal's meets your needs regardless of what your needs may be for the day."}
{"text":"Above average bar fare. Nice beer and booze selection."}
{"text":"We came here for the first time earlier this week and we are back again. Consistently yummy and cool."}
{"text":"Great place Salad's are awesome definitely coming back. Husband had the Wings they were very good !!! Met the brother who owns the place came on a recommendation great choice!! The pierogis   I
I would pass on next time not that good Otherwise everything was awesome"}
{"text":"Who am I to think this place would be open at 12:30 during lunch hour on a Monday in such a low populated place as McKnight Road area in the North Hills?  Silly me. 

Went here because of the good ratings and I was in the area that day. The family and I pulled up and sure enough, CLOSED! It opened  at 4:00 PM. Probably shouldn't have assumed an eating establishment would be open for lunch so that's on me. 

Okay so I'm not rating the food or service because unfortunately we didn't get the chance to try it so I wanted to be clear on that but seriously, what bar/restaurant is closed during the lunch rush?

So the one star rating is strictly for their silly hours."}
{"text":"Hals is really a great bar. The cocktails are solid, great size and they don't skimp on the alcohol like some bars. 

The food is also good for bar food. I'm particularly fond of the mushroom brie soup. Tonight I had the wedge salad and requested they grill my romaine a but before making the salad. It was good, but the toppings seemed forced and half-assed. Even worse, the bacon appeared to be mere bacon bits rather than actual crumbled bacon. That was not cool. 

I've also had the Seiten and it's delicious, as is the tuna appetizer, though more was a bit would rock.

One thing I'm not a fan of is the acoustics. When it's busy, it's extremely loud, especially in the dining area. I also find that no matter which shoes I wear, I slip on the floor to the ladies room, regardless if I've had drinks or not.

I will always come back to Hals. It feels good, and the drinks are great. It's a quality local bar"}
{"text":"I just placed an order for wings by phone.  I am not happy because I ordered 3 dozen wings for what I expected to be $10 per dozen, which would be $30 for 3 dozen.  When I finished placing the order for 3 dozen wings, she told me the order totaled more than $40.  I mentioned the price difference and she said that was the \"old menu\".  I pointed out that this pricing was on the website, and that she should honor it. 

I was shocked that she refused to honor the pricing on the website even though it doesn't take much to update a few numbers on the webpage that's already online.  She forced me to decide to cancel the order or accept the significant price difference.  Stuck between a rock and hard place, embarrassed and unhappy - I accepted the increase, and promptly posted online.  I emailed the restaurant to let them know my dissatisfaction, and will update this review based on their response. 

TL/DR: I was forced to pay 30% more than their website advertised for wings because they raised prices and never bothered updating."}
{"text":"Fun place to go!  Great apps and fantastic burgers. Wish it was bigger!  Quite the wait on a Fri/Sat, to tell you the truth, I wouldn't eat at a place that doesn't have a wait on Fri/Sat!  That means it's no good!"}
{"text":"Not sure why someone thought it fit 10 people, they have outdoor seating which holds probably 15-20, about 12-15 at the bar and probably another 30 around the room. Sat at the bar for Monday Night Football, some good draft choices, huge variety in the bottle list, had the fish tacos which were good and then some wings, sweet chili and black & gold, which were also good. Nice play, didn't feel rushed even when it was nearing closing time."}
{"text":"The worst bar foods we ever had. Never get sliders they have as a special - cardboard taste better. I hope they removed it from the menu by now.

Only redeeming factors (if any) is the atomosphere is nice and the drinks are not overpriced."}
{"text":"I always love to check out places that offer the promise of great bar food and a huge beer selection. And so when we were in the area I knew I had to stop and give Hal's a try. Reading many of the Yelp reviews I knew I'd find some things I'd like. And I did!  To be honest, we went there for a late lunch on a Saturday and to have some beer. So my first priority was food. While the menu is limited it does have a few interesting items. I wasn't interested in the dinner entree portion and the sandwich options aren't overly plentiful, we were both able to choose something we liked. The build your own burger was really good and cooked to perfection. The accompanying onion rings were just ok - typical of any frozen rings you'd get in most bars. Not like James Street Gastropub which has outrageous onion rings - just saying. My wife's pulled pork was tasty and is something I'd recommend.

The beer selection is huge (I estimated about 70 different kinds!) but regrettably, the draft selection is limited. I love craft beer but want to drink it on tap not out of a bottle. I can do that at home. Only one IPA on tap (not acceptable) but they did have a few Belgians available. I would love to see more support for some of the local craft brewers here. How about some Helltown or East End or even Penn Brewing? But the Stone IPA is always acceptable.

Atmosphere is typical sports bar motif - about 15 flat screens around the bar all with sports on - it WAS a Saturday after all. We sat at the bar and the first thing that struck us was how DARK it was. We're talking dungeon here folks. I mean dark! Black walls, black ceiling, black bar back....Black. If you're in that familiar physical condition where the very presence of any light causes your head to resume that painful throbbing then this place is just for you. You'll love it here. But me? I wanted to read the menu. And couldn't. Had to use my iPhone light to even make out that there was writing on that menu!

Service was ok - usually I sit at the bar to improve my chances of getting better service and to keep my beer refilled more easily. This wasn't the best but it wasn't anything I could fault them on.

I won't go out of my way to go back here but I will consider a return visit when I'm in the area."}
{"text":"Party of three and we tried the recommended chicken wings that were perfectly cooked the way I like'em (crispy).  I tried a pumpkin type ale which was very good and cold.  I tried the Apple salad which was really good.  My pals tried the Chicken Tortilla soup which he thought was really good.  They split the Pastrami sandwich that looked really good but just gave it an OK.  Over all very pleased & would not hesitate to return if in area."}
{"text":"Understated little neighborhood bar/restaurant but we were impressed.  Lamb with pilaf on the appetizers was beautifully seasoned, and a generous portion.  The seitan is also great.  Hubster said the chili cheesesteak was v. Good.  Good selections for every taste.  Friendly people, good service.  Will definitely go back."}
{"text":"This place hit on all cylinders. Comfortable sports bar decor/feel, fun vibe, indoor and outdoor seating and most importantly, excellent food and a tremendous selection of beers make this a must return for me and my golfing buddies. Well worth a visit."}
{"text":"GREAT suburban bar. Setup is a tad confusing but the confusion is worth the food and beer selection. Rather impressive menu with great tastes in everything. Can pull beers from their bottle shop, which really makes the experience great. Only knock from a 5-star is when a friend of mine asked if there was a brown ale on tap, the bartender (a server would be excusable, but a bartender!) had no idea what a brown ale was. Manny Sanguillen is often there too, so that's pretty cool."}
{"text":"I have been here on a couple of locations.  Food is always ok and hits the spot.  Plenty of beers on tap to choose from.  Does get crowded and is very loud.  Not a place to go to enjoy a conversation.  Nice atmosphere and bar is nice to sit at as well.  I like that it is a local establishment.  Service is average. 

There is an outdoor area in front but I have never been there at a time/season where I could use it."}
{"text":"North Hills Secret!

I went here after a Pirates game with some friends.  There was also a penguin game that night as well.  The parking lot made it look like the place was elbow to elbow.  Once inside we realized everyone must have driven their own car.  There was plenty of room.  

We got a table and there were even seats at the bar.  We were greated by a very friendly waitress who got us drinks and menus.  We ordered your typical bar food, wings, fried pickles, and french fries.  The food was great.  We got these garlic parmesan wings that were fantastic!  I would have to say that some might find the french fries a little salty but I thought they were delicious.

They also have a very large selection of bottled beers.  If they don't have a beer that you like then you need to stay home to drink!

The owner even came over and introduced himself since he didn't know us and asked about our food.

I gave the place 4 stars because the bathroom was a little stinky!  it was probably because the place was crowded during the penguin game but it could have used a little refresher!

I will go back to Hal's more often.  I think it is a little gem in the North Hills!"}
{"text":"On a stretch of dead space on Babcock Blvd, Hal's definitely delivers. My Girlfriend and I met some friends here for an NCAA basketball game on a Thursday night. Immediately you are welcomed by a friendly and inviting open space, the bar to restaurant ratio is about 50/50 with no wall separating the two. Neither one over powers the other and I wouldn't feel weird bringing children here at all. 

   The beer selection is very good, as you would expect with a 6 pack shop attached to the other side of the restaurant, liquor is pretty typical of what you would find at most chain restaurants that have full bars. The service was very friendly and helpful. 

   The only average part of the experience was the food. It's definitely not bad, just nothing to write home about. We had the Salt and Pepper Calamari, which was a tad rubbery but not so much that it ruined the dish, I found it to be a little salty also, but my GF didn't seem to mind. The chicken wings were very good. We mixed dry rub and wet sauces and they were the stars of the show, crispy and juicy. The meatloaf cupcakes were just ok. They had good flavor, but very dense and the mash potatoes were kind of pasty, possibly from not adding enough cream or butter. I absolutely Loved the Sweet Potato fries, some of the best that I've had.

   After we ate our dinner the staff noticed that our group was concentrating intently on our Basketball game and offered us a private room with 3 TVs and couches which was very cool.

   Overall, I would recommend Hal's. It seemed to attract a large happy hour crowd, which I assume is contributed to the lack of competition in the area. The food is about what you would expect at an Applebee's or TGIF. It won't disappoint, but won't blow you away either."}
{"text":"i give it 5 stars for the sour beer varieties alone, great bottle shop, always clean and friendly service; all the servers are super models; hals the man; awesome outside fires at nite"}
{"text":"Never got seated. We stood first in line for 15 minutes as waitresses and hostesses zipped passed us as though we were invisible. We left for a second and when we came back another couple was first in line. They waived to a waitress and got seated immediately. We waited longer and there were tables available but not cleaned off. When the hostess finally came to us she took our name and said we would have to wait as there were several people ahead of us. That is ironic since the couple that was seated immediately before us did not have to wait for a table and did not have reservations. They were making no attempt to clean off the other tables available and seat anyone which we could not understand. When asked if we called ahead they said, \"Oh there is only one couple in front of you.\" So why were the tables not cleaned off and that waiting couple who supposedly called ahead seated by now? We left this restaurant totally annoyed and irritated by their lack of common decency.
  We went to Kretzers down the street from Hals and had a wonderful dinner. The hostess was gracious, the waitresses were extremely efficient and friendly, and the dinner was delicious.
So, unless you know someone at Hals do not expect to be seated, as it is obvious they only cater to the ones who come there regularly. We often go out for dinner and thought it would be nice to try Hals for a change. 
  We will never go back there."}
{"text":"This is a great place to drink beer, watch sports, and eat wings.  It is one of the nicest bars in the North Hills."}
{"text":"Huge restaurant and bar that packs in a crowd on a nightly basis.  Especially on wing night.
Outdoor seating is the way to go when weather permits.

Everything I have ever ordered here was satisfying , and worth a repeat.  The menu is a  hodgepodge of food selections.  I noticed everything from lamb chops to burritos to basic bar food.

Prices and portions are in line with expectations.   Servers are friendly, and certainly manage to keep up with their lively patrons."}
{"text":"This place is your typical American bar and restaurant. The place has tons of different types of beer. The music is too loud inside and the food sounds better than it looks. It is a glorified dive bar."}
{"text":"This is the best bar food I've ever had. My only issue is the service. 
        I went in on Super Bowl Sunday and sat at the bar.  The bar had about 15 people there, plus more at adjacent tables.  I sat down and it took a good 10 minutes for someone to take my drink order.  I ordered a Yuengling draft which tasted great.  You can tell they clean their lines which is a huge plus in my book. 
        I then proceeded to order a to go order of wings and a chicken salad.  The salad order was for my wife who was going to work that night. I specifically requested the chicken on the side so she could heat it up later. 
         The wait for the food is my only complaint.  I ordered another beer and waited for my food.  I saw a food runner putting multiple to-go orders in bags and placing them at the bar to await pick up.  I watched this individual place multiple to-go bags on the bar.  My order was placed on the bar (without my knowledge).  I sat at the bar for about 25 minutes until a bartender noticed my to-go order and brought it to me. I paid my tab and left the establishment. 
         When I got home my wings were cold and I had to heat them in the oven before eating them.  The chicken salad also had the chicken on the salad and not on the side as I had requested. 
         This is a great bar with a great atmosphere, but the service definitely needs improvement."}
{"text":"Love this bar/ restaurant! Staff is always friendly, they are knowledgable and always quick. There are great drinks with good deals. The menu is really good from the wedge salad, wings, pulled pork, to French dip. Also the taco Tuesday's and wing Wednesday's are great!"}
{"text":"We've been going to Hal's the 3 years we've lived here.  Honestly, never had a bad meal. Not even when they are packed because there's a game on.  The parking lot can get a little interesting but only because there are next door to a billiard room.  

They have a well rounded menu from chicken wings to risotto!  Truly my 1 and only dislike is the sausage they use on their pizza.  I'm from Chicago and it's not what I consider a pizza sausage, it's more like kielbasa (which might be ok for a Yinzer, but I didn't like it) - other than that their pizza is good and HUGE and in-expensive.  

I've met Hal several times as he often delivers the food himself.  Great guy and family man.  Wide array of liquor to chose from and usually a sports game on TV if you are into that.

Give it a try, I think it will be worth the trip.

Whenever someone new moves to town we take them to Hal's and we haven't heard one complaint yet!"}
{"text":"In on a business trip and stopped at Hal's.  Cool local place, lots of options to drink both beer and liqueur!  I had the wedge salad and the pierogie flatbread.  Salad was good and flatbread was tasty but a little bland.  For a Monday night it was pretty busy. I would definitely go again."}
{"text":"We love Hal's. Me and my friends go here every Wednesday for wing night. We love the wings here. Parking is getting better as Hal is expanding his lot. The people that go to Hal's is great... there's hardly ever riff raff that drifts in. There is no smoking, which is great. The owner is a great guy, he actually cares about his customers and goes above and beyond to make people happy. He is actually ordering a beer to put on tap because a friend of mine has asked him about it a couple times. The waitresses/bartenders are both good looking and are actually good at what they do, which is a rare package anymore. I highly recommend Hal's, it has a great ambiance and most people love the atmosphere. Family friendly as well."}
{"text":"Very nice bar!  I've been here a few times.  Great place to eat and watch some sports.  They have a great beer selection and their food has been good too!   Would give 4.5 stars if I could."}
{"text":"Ok, so Hal's has decent bar food, decent atmosphere and a decent beer selection. That's where it ends. First, the service is abysmal. We walked in at 7 P.M. on Wednesday night and stood at the front for 15 minutes before anyone came and got our name for a table. The girl walked up and said \"have you been helped?\", I said \"no\", She said What's your name and how many?\", I said \"Greg, 2\" and she says \"ok, thanks\" and walks away, not to be seen again. No time frame, no nothing. Second, we went to grab a drink at the bar while we were waiting, stood at the bar for 10 minutes before anyone appeared, stood there another 10 minutes before that person found the time to take our order, and was just all around rude. Finally, after an hour wait, we got seated. After the waitress saw we already had drinks, she continued on about her business as if we were good without even asking. We saw her a total of 4 times, once when we were seated, once after we got our food to see how it was and finally to drop off and pick up the check. Management needs to do some serious training on their waitstaff. I was a server for many years and the most important rule is to never blame your bad service on being busy. There are no excuses for this level of bad. By the way, this is the 2nd bad experience I've had with the service here, so its not just a fluke. Train your servers and you have a great little place, continue to allow it and you'll rapidly lose customers."}
{"text":"I have visited Hal's Bottle Shop twice with friends who come here probably bi-weekly. The first time, I had unfortunately done a good bit of drinking already at Grist House, so the experience was slightly blurry. :) We ordered Fried Pretzels, Wings (Bourbon Sriracha, I believe), and a BYOP (Build Your Own Pizza). The food was all really tasty, and I enjoyed finally trying my friend's favorite beer (Sofie). Thankfully, I was completely sober for my second Hal's visit. We came on Taco Tuesday, so I got to enjoy $1 hard tacos. These tacos are almost a comfort food as they reminded me of eating homemade hard tacos that my mom would make as an easy dinner in the early '90s. These tacos are about as basic as they come but oh-so-good at the same time. Danny was working in the Bottle Shop both times that I've been here and made great recommendations for beer for my friend (who happens to have an almost identical beer palette to my own). Though Hal's is not necessarily a place I'd hunt out and return to on my own, I'd definitely enjoy coming back with my friends."}
{"text":"This place is very unassuming. Had a bottle of hard cider and it was $5.00! I don't order drinks out very often, now I know the reason why. I ordered the chicken sandwich with fries because it was the same price as the chicken strip appetizer! It was very good. Crispy and the chicken was moist. The fries were warm when I received my order too. The place was a little chilly, bring a sweater. Great place to meet up with friends."}
{"text":"Looking for a local place to grab some good food?  Try Hal's.  Only 10 minutes from the mall, so avoid the crappy chains and support the locals!
The bar is very tastefully decorated, modern and is clean.  There is a separate area for eating.  The food is prepared very well  and is very good quality.  The staff is pleasant .  Everything a local \"pub\" should be.

Oh, did I mention they have Pirat?  Woot!"}
{"text":"Out exploring on a Saturday night with a friend and we decided to stop at Hal's around 10pm. They had a lot of outdoor seating but we went inside to start. It was a seat yourself atmosphere and a waitress showed up quickly. We each ordered a beer from their decent selection and the Guacamole and Bruschetta appetizer. Everything was brought out quickly and the appetizer was very good! We asked the waitress if we could switch our bill to outside and it was no problem at all. We ordered another beer and ventured outside to the fire pit for a bit. The crowd was very relaxed and laid back. We decided to checkout the attached 6-pack shop and I was impressed with their selection of single bottles. They even had some of my hometown favorite Hoppin' Frog beer which I haven't been able to find anywhere else in PA. There is a Rare Beer Club that I got some info on too. The staff was very helpful and attentive to our needs. I will definitely be back for more!"}
{"text":"Good food and great service. Any beer you can think of, they have it. They also have 6 pack shop next door where you can mix and match.

It was a little too dark inside for me during the day but most wouldn't have any issues with that. I just had a hard time reading the menu. Overall, a great place to go with friends and I plan on going back."}
{"text":"Great food and prices. Excellent atmosphere. I tend to drink here once or twice a week. The bartenders and owner are nice people. It's great for sports games as well and plenty of parking."}
{"text":"Love Hal's.

I don't frequent here as often as I used to since I moved, but this is one of my favorite bars near home. They have a great wine and beer list and much better food than any other sports bar around. I'm pretty sure it's the only bar you can order tofu at in the North Hills. It's delish! They also have a nice selection of sandwiches, salads and entrees. The staff has always been super friendly and the service is good. Chill atmosphere; they always have the games on and pretty good music. Touchtunes: check. Non smoking is another plus in my book."}
{"text":"I wanted to like Hal's, but unfortunately, my last two experiences were disappointing.  I have to say the bar food is not good.  We ordered nachos that were cold and soggy, and the pepperoni rolls were made of that store bought dough, which was given to us raw inside. At first we thought it was the mozzarella so we ate it but it was raw dough - very raw.  Some of the service is also unprofessional at Hal's and they seem to run the show there.  We sat in the back once and watched as they locked a girl out while she was banging on the door to get back in.  It was really distracting because of our seat in the back.  Then, recently, our waitress sat with friends chatting during her shift.  The place reminds me of a college bar instead of a nicer gastropub."}
{"text":"Complete hit or miss with food and service. Our first time food was great and could not wait to go again. We return and got a waitress who truly lacked customer service training. When we asked  her a question about specials it was like pulling teeth for her to spit the information out. From that moment we should have left but we decided to ride it out. Every time we order something she had to remind us of the \"extra\" charges. Tonight was the first time in 10+ years we have never tipped  20+% to our wait staff. Since we were pre judge and treated less I have a more important tip to leave now. First impressions is everything and you never know if we will be the ones to give  or deny you your next opportunity! We official have a bad taste in our mouths and will not be back!"}
{"text":"I definitely enjoyed Hals. The food is so good. I really love the chicken salad and salt an pepper calamari. The waitress was so friendly and did a wonderful job, We had a large party and was in the reversed room."}
{"text":"Hal's was on my Bookmarked list. I had heard great things about the food. I was in the area and decided to give it a try. When we pulled in the place looked fun and happy. The outdoor seating area had lights all around and gave Hal's a welcoming look. I wish it had been warm enough to sit outdoors. The inside was just as welcoming. It was painted with warm colors and the lights were low. We were seated quickly. They have an extensive beer list. They also have a bottle shop next door. If you are a beer connoisseur, this is a great place to try. 
We ordered the Cuban Rueben with onion rings and a pizza with bacon, onions, and black olives. It didn't take long for our food to come which was nice since we were starving. Hands down the Cuban Reuben is one of the best sandwiches I have ever eaten. It is a Reuben but has pulled pork on it. The pork enhances the other flavors of a Reuben-especially the brown mustard. The portions of items on the sandwich were perfect. Sometimes places get heavy handed with sauerkraut and it is the only flavor you get. That is definitely not the case here. The onion rings were large and crunchy. They give you a hearty portion of them. 
The pizza was a lot bigger than we expected. It was literally covered with toppings. They are very generous with them. The crust is not a thin crust but leans toward a crunch. The bacon was actually a light flavor and married well with their pizza sauce. 
The restaurant was clean and our server was very nice. We will definitely be going back."}
{"text":"Service was excellent! We came in (a group of 7) after we finished work. They had been closed already for 15 minutes, but still got us in for a round of drinks. REALLY GREAT SERVICE! Bartender clearly had a long day, but was great with us."}
{"text":"Wings: the bomb. Crispy on the outside with a lot of sauce. Amazingly, not soggy given the amount of sauce.

Drinks: tons of beer. But for the hard liquor drinker, their drinks are extremely well made!  I got an extra dirty martini and loved it!

Atmosphere: not a quiet date night spot but very upbeat. Maybe because it was a weekend? Weekdays may be different.

Cleanliness: bathrooms are spotless and clean.

Parking: easy! Huge lot!

Service: there are only girl waitresses who are also all extremely gorgeous. Oh, and service is good too to boot! Mans paradise. 

Suggestion for management: perhaps some good looking male wait staff as well for the lady patrons? Just a mere suggestion..."}
{"text":"Really good pepperoni rolls, and wing night on Wednesdays is such a steal, I paid like $2.00 for 6 wings, usually a really long wait on Wednesday nights though, 100% worth the wait"}
{"text":"We really like Hal's!  We can always find a good meal for ourselves and our kids.  The pulled pork is outstanding as is the beer list!  

There are tons of TVs if you like to watch sports but it is usually pretty loud so quiet conversation is not really possible.

The staff is usually very good.  We have only ever had one bad server but I have not seen her there lately so maybe someone figured out that she needed to find a new career. 

All in all it's a really good local place!"}
{"text":"The food was great!!! I got a NY strip steak salad and it was so good and filling!!! The service was a little slow but overall was great! Fried pickles were amazing too! Definitely will be back!!!"}
{"text":"I can't review any food here other than the wings because that's all I get. I love the wings. Much better than BWW and Quaker Steak. My favorite is the Black and Gold. They have some unique flavors like fiery raspberry and Asian ginger. Usually pretty busy place, but the parking lot is huge and the wait staff are top notch. Wish I discovered this place a lot sooner than I did."}
{"text":"Always great.  Service is good if you're willing to make yourself seen.  If you stand there motionless three feet from the bar, the tenders think you are watching TV."}
{"text":"We've been to Hal's a few times now, and like it. The food is good, beer is great, and atmosphere is nice for a night out with friends. On our most recent visit, we made the mistake of coming on a cornhole tournament night, so our service was... slow, to put it mildly. However the owner and our server apologized for the wait and gave us a free drink or dessert, which made up for it. They also have an awesome bottle shop next door."}
{"text":"I'm always excited when my guy suggests a new place for us to go that's completely off my radar. He suggested Hal's today for us while we were running North Hills errands & I was game especially after reading Yelp reviews raving about their great beer and bar food selections.

Our bartender gave us a warm greeting & we discovered Stone was their only IPA on tap. Only a few taps here, so the great beer selection clearly comes mainly in bottles. The bar is nicely appointed & also a bit dark - black ceilings & walls - I needed the light on my phone to read the menu in the afternoon. 

Menu is bar food basic & not super extensive. I ordered the pulled pork with onion rings & hubby got a build your own burger (which excited him) & onion rings. And these sandwiches were really good! The burger was gigantic & I heard happy noises next to me. My pulled pork was delicious with a perfect amount of barbecue sauce. My ciabatta roll was good but a bit too much bread, so after eating 1/4 of it as a sandwich, I forked the remainder. Onion rings were good, not amazing. 

Service impressed when we said we'd split 1 last beer & our bartender drew 2 glasses she filled 3/4 full! Pleasant surprise on the bill that the Stone IPAs were $5 when it's pretty pricey by the case to buy. 

Overall this is a nice bar to grab some bar food & a beer."}
{"text":"Great beer and wine selection and a really nice, outgoing staff. Really great place to watch a game, especially if you have a crowd of folks who want to meet up. The place is big. I enjoyed the Parmesan wings and the Italian Hoagie. I'll definitely go back."}
{"text":"Love this place!!! Food is amazing. Only thing I hate is:

1) Parking. Sucks on a busy night. Can't find a place to park and I feel weird parking next to the other businesses.
2) Too many people on busy nights that you can't get a drink. Not a bad thing, it's just would be nice not have to wait a while to get a refill. I don't mind waiting; it's just a pain sometimes. Too thirsty!!!"}
{"text":"The atmosphere and bar itself is really clean and nice. We ordered the pretzels as an appetizer (a little too salty). Their buffalo chicken flatbread is more of a pizza crust rather than a flatbread but it was still good. Great onion rings and sweet potato fries! The friend chicken sandwich is just chicken tenders on a bun, literally. I would go back again, just might try some more of their food to see what it's like. The hostess was less than charming and had an attitude, but our waitress was so nice and helpful! They have outside seating and a fire pit too! Lots of beer selection and a beer house next door."}
{"text":"I like Hal's.  The food is decent, the service has always been spot on and there's a great variety of drinks to choose from.  The \"good\" beer such as the Belgian is obviously a little pricey, but if you're looking for Miller Light or something of that sort, there's always some kind of special going on.

The downsides are that the parking sucks on Friday and Saturday nights and the bar can get a bit crowded as there is limited seating.

My friends and I absolutely LOVE the private room and try to get it as much as possible when we're making plans to hang out.  All you have to do is call ahead and see if it's available.  There are no minimums or requirements to use the room, but I know my friends and I always make it worthwile for them to put us in there.  It fits about 10 people comfortably at most, but it has a TV, couches and chairs.  It used to even have a Wii, but I'm guessing that some jerk broke it because they don't have one anymore.  It's like having a small party in your living room except you don't have to clean up after the party's over.  Hal himself is a nice guy who is almost always there and will go out of his way to accomodate you."}
{"text":"Completely redone review.

The first time we went to Hal's we found the food generic and the waitress was pretty lame.  We said we'd give it another go and we did.  Hal's is expanding and because of this I think they've stepped up their game.  The first time we went we got the fish tacos and the spinach artichoke dip.  We again got the fish tacos, but this time shared a steak salad as well.  
The fish tacos were much much better and I will now be craving them.  Big fresh chunks of fish, fresh veggies, warm tortilla, and a spicy mayo.  
The waitress was better and the beer selection is still the best in the North Hills.  
The food could still be stepped up and a little more creative and the noise could be addressed during dinner hours, but Hal's is a good option."}
{"text":"Fantastic beer selection.  The ahi tuna is fab.  The crispy tofu is unbelievably good...funny because I'm not a big tofu guy.  Service has been impeccable every time."}
{"text":"Really great food & amazing service! Everything from tofu to filet mignon - and everything is delicious :)"}
{"text":"Hal's has great food and a friendly staff. My favorite menu items are the buffalo chicken meatballs and the caprese panini. They have a great rotating draft list and good mixed drinks. The only negative is that the restaurant is typically crowded so you have to wait for a table or spot at the bar."}
{"text":"Great find in the North Hills.  The bf found it while on a recent work assignment.  We decided to stop by on a Sunday afternoon.  The bar area is large and the dining side is even bigger with plenty of space between the tables.  Even though we were there on a very sunny day, the interior is dimly lit.

We were greeted right away by our wonderful server, Melanie.  BJ got the Clown shoes beer.  They have a lot of appetizer and sandwich choices.  I got a garden burger on a ciabatta multigrain bun.  It was really good.  Sandwiches are served with your choice of fries, sweet potato fries or onion rings.  I got the sweet potato fries.  They were so good, the bf bet me $100 bucks that they were fresh cut.  Too bad for him, they are not.  He got a pastrami sandwich on rye with onion rings.  His sandwich was great and so were the rings.  This place is really great!"}
{"text":"I was very impressed with this place, it really exceeded my expectations for a bar. The menu seems fairly simple with some different wing options. 

People rave about the wings so I had to try them, I opted for the garlic Parmesan wings that were in a buffalo sauce. The wings were crisp and saucy with shredded cheese covering them. I was really blown away by my cheesesteak sandwich and sweet potato fries! I shared the sandwich with my hubby and it was a perfect portion.

The place itself was very clean and new feeling. They have a ton of beer and liquor options. The staff was all very friendly and attentive!"}
{"text":"Bar food. 3 stars for the beer selection. Service sucked but to Hal's credit, I saw other waitresses working their butts off. Not ours. 
I had an Italian sub. Below average. Saw the wings, should have gone that route.
Beer menu doesn't list prices. Drank a couple Chimays. Figured it would be pricey, but it is just nice to know when you are on a budget."}
{"text":"I've been here twice now.  The first time was on a Wednesday evening for their wing special.  It was packed and we had to wait to be seated, but that's to be expected on a wing night.  Once we were seated, the service was very good and didn't seem slowed down by the amount of guests in the restaurant.  The wings were very tasty, and they have a lot of interesting and unique flavors - like Fiery raspberry and chipotle Cinnamon - both of which were surprisingly good.  
The second time I was there was on a Sunday -late afternoon- and it was pretty empty when we got there.  Our waitress was very attentive, but not in an annoying way, and extremely friendly.  It did seem to take awhile for a waitress to notice when new people arrived and needed to be seated.  The sweet potato fries were excellent, and I enjoyed their pulled pork sandwich.  The prices are fair and you get a decent amount of food.  The beer selection is excellent."}
{"text":"Generally I love Hal's so I'm giving it a good review based on past experiences. My gripe today is that they have a bunch of TVs but don't have the NFL package to show all the games. I'd like to watch my team here but unfortunately can't. Besides that, they have a great beer selection and great food. The happy hour deals are fantastic and they pour a great mixed drink. It's tough to get a seat at the bar on a Friday night but probably because it's one of the few very good places in the area. I'll be back just not on a Sunday :)"}
{"text":"We've been trying to get to Hal's for quite some time, but it's usually met with a long wait. We finally made it after technical difficulties at two other restaurants forced us into Plan C! Luckily, on this trip, we had no wait.

Mr. J described the interior atmosphere as \"cavernous\". Which is pretty spot on since it's very dark and very loud. Hal's could definitely benefit from some acoustical tiles on the ceiling to buffer some of the noise. I would have preferred to sit on the patio with the fire pits and heat lamps, but it was another rainy evening in Pittsburgh.

The beer selection is vast and there is something to suit every taste from imports to craft brews. There are also about 6-8 beers on tap. Equally nice is the bottleshop next door so that you can grab a 6-pack to go.

Mr. J was craving a hamburger and had a hard time finding the one and only burger on the menu (BYOB (build your own burger) - under sandwiches). I chose the ribs,  but had hopes dashed when the server said they were out of ribs. (Seriously?!) I had to make a quick decision and went with the BYOB, sweet potato fries, and fried pickles.

The fried pickles were good - spears served with a mild horseradish sauce. This was probably the best thing I ate. The burger was your standard frozen patty on a dry-as-a-week-old Kaiser bun. I think the bun may have been toasted, but was so pale in color, I could only speculate. The top bun was also broken in half due to the dryness. Ketchup and mustard were served on the side (annoying) and the pickles were chopped up dill pickle spears. My sweet potato fries were typical Sysco/US Foods frozen/coated fries.

Perhaps their dinner entrees are more house-made, but I wasn't able to find out. Hal's is another place where the 5-star reviews threw me off my game. I wasn't as impressed as most; but for two beers, an appetizer, and burgers under $40, I can't complain too much.

Additionally, I realize this may be a sports bar, but it's rather awkward when the servers are wearing yoga pants and tank tops like they've just come from the gym."}
{"text":"Hal's is a go-to for my friends and I. They have a nice sized menu with tasty food. The servers are super sweet and accommodating. The only problem is the fact that it's such a small place and it gets jammed packed, you really have to be careful about what time you come here. It almost always appears that there's never a spot open in the parking lot. The outside section adds some extra space in the summer time and the bottle shop next door has many unique beers I've never even heard of! Be sure to check it out if you decide to make the great choice of eating at Hal's!"}
{"text":"I really enjoyed this place! Although the drinks are a bit pricey (the infamous 'no price on the drink menu' game. hated it), the food is not. I ordered the Seiten wing appetizer ($7.00) and must admit that it is the absolute best. I've gone to a many, many restaurants sampling their seiten wings and by far this place nailed it. All of my meat loving friends decided to try a bite and couldn't even tell that it was a vegetarian dish. Honey Sriracha was a little hot, but otherwise complimented the 'wings' perfectly. 
Will be back and will order one for there and one to go!"}
{"text":"I love the RIBS ! they are constantly the same but delirious. I order them 90% of my visits. Wings are great but not consistent. One week we had nice bulk sized wing pieces, then a following week the wing where busted up knar scrap pieces with broken bones and  scrappy Gwar.
Dirty Martini : \"Girl reached her hand into the jar to scoop out a few olives \"
Sounds gross after she might have touched 10 dirty plates, refilled 10 pint beers and felt the urge  & tinkled a bit and she has a STD. Then reach by hand into a jar for a Dirty Martini.
I will as  do stick with the bottled beer"}
{"text":"Great atmosphere- strawberry chicken salad was excellent! Sangria was very tasty! Also nice to sit outside."}
