{"text":"Ordered from this place for lunch off skip the dishes. It was a new name on the list so I decided to check it out.

I didn't really know what to expect, while I eat an assortment of different Asian foods Filipino food is not something I've had to pleasure of eating before. The menu is varied and very reasonably priced.

I got the Adobo burger, which is there chicken burger, the fish and chips, and 2 beef empanadas. It was adorable, the bags came signed with a little thank you note with my name (probably the reason I'm reviewing right now. These people care about their business and customers it seems) 

The burger was amazing. I didn't know what flavours to expect based on the description but I loved it. It was a very sweet and savoury burger. I loved the bread they used. It was a good size burger too, lots of meat.

Fish and chips, not sure what I was expecting of a Filipino place to sell but it was pretty decent. Nothing special like the burger but it holds its own, especially for the price. Two pieces of fish with a nice amount of batter on a bed of fries.

Empanadas were delicious, very flavourful. And the spicy mayo that comes with it is also very tasty. Unfortunately one of mine was just dripping with oil. It's understandable considering they're deep fried but wow, I had to press it with a paper towel and then I bit into it and it was just dripping. Oddly enough it was just the one? The other one was fine, I pat it a little but there was not nearly as much oil as the other one.

The burger and the fish and chips both come with fries, the burger you can upgrade to ube fries (they were sold out unfortunately so I did not get a chance to try them). Because they delivered they got soggy, they also lacked salt. They were good overall tho, despite being soggy.

Overall the food was great. I want to visit in person to try the halo halo (doesn't seem like something you'd want delivered but it is an option) the traditional breakfasts and the sisig burger. Already made plans to try this place with my friends. Solid 4.5/5."}
{"text":"First time trying this place, and I'm glad I did! This place is a gem! I got a sweet handwritten thank you note from the owner with my order (had it delivered through ubereats) and everything looked great! The food was delicious and very well priced, everything needed for a successful startup!"}
{"text":"This place is a hidden gem!! My boyfriend and I stumbled upon this place on UberEats and we were sold as soon as we saw the sisig burger. What really stood out to us was the crunch of the sisig in the burger, it's not the typical texture ya know? The adobo mayo was amazing! The ube fries were really good too. Love this lil mom and pop place. We'll definitely be back to try the rest of the menu :)"}
{"text":"Food was delicious and the staff/cook were super friendly! Felt like I was coming home to a home-cooked meal. I would recommend anyone in the area to stop by and enjoy Filipino food at this cute little place."}
{"text":"The best Omelette in a sandwich \" Pinoy\" I've ever had!!! My Bf and I went to Halo Halo right after getting to Toronto after an overnight flight and we found a delicious breakfast awaiting! My bf ordered the milkfish Breakfast and it was super tasty as well!! We enjoyed the kind hospitality of the owner and we hope to be back soon!
Thank you!"}
{"text":"Food is great;;;the owner is very friendly ;;;the best halohalo ever,try it and you won't regret it;;;"}
