{"text":"I have only gone once and it was for lunch. It wasn't bad, it wasn't great, it wasn't special. Why would I go here to get a burger when one of the best burger places is around the corner (Farren's). This would be a good place for a business lunch as the atmosphere is very classy. The biggest issue I had was that the seasoning was just there, I had to salt and pepper everything. The best part of lunch was the coleslaw side."}
{"text":"Wanted this to work, was looking forward to eating here. First off, I know ordering a Prime Rib can be a crapshoot, and I lost out.Ordered a 10oz of which at least 4oz was grizzle.The au jus looked like chicken broth. Since half of it was inedible, at the price I didn't want it to go to complete waste, I took home a doggy bag. Now I don't normally give my dog \"people food\" but this had no real flavor so I'm sure she'll be fine. One would hope after spending over $30 you wouldn't have to go home and cook yourself dinner right afterwards, but that's what happened for me. Didnt want to leave a negative review, but after talking to others about their experience here the consensus seems to be that it's a bit of a money grab for those in big cities staying at the hotel next door and looking for food in a walking distance. They spent some coin renovating and seems like their trying to make up with their prices. Not a place to satisfy hunger but if you're into overpriced snacks, appetizers or foo foo drinks this is the place. Now if you do want a good prime rib there's a place in Fisher that even with a Uber you'd still come out on top. It's the complete opposite of the place, looks like a sh!thole but quality food.  I will say Hamilton's warm bacon dressing is pretty good, looks gross, but is really good."}
{"text":"Very pricey for the quantity/quality. My scallops were over cooked and quite expensive since this restaurant is a la carte. Appetizers were delicious as well as sides. Wish entrees and dessert had been better."}
{"text":"I decided to log onto Yelp just to write about my dining experience tonight (4/9/17). Unlike others, I like to use Yelp to praise businesses, and I tend to shy away from negative reviews. I'm the kind of person that doesn't complain to the wait staff that there was a hair in my food. I simply just don't eat it.   My husband and I had a gift certificate to HW and decided to finally use it. We easily booked a reservation online for 6 PM and were anxiously awaiting to try HW for the first time.   We sat down at a table, which we weren't asked for our preference, so that was a little odd. We felt like we were \"in the way\" most of the night. The table had NO centerpiece. It felt strangely empty and uncomfortable. No focal point.   It took awhile for our waitress to come take our drink order. She was very mild. I don't know if she was just shy or hungover. Anyways, they give you drinks in these small glasses. I half expected to get charged for refills.   We ordered two of the 6 oz filets which only come with soup OR salad. No typical side! I mean Texas Road House does that, because it's the correct way to serve entrees. HW should really change their setup with that! We added a twice baked potatoe to share despite the added cost. We both opted for the house salad. My husband picked what he thought was \"French\" dressing and I was told they don't have \"Ranch\" but they have \"Greek Goddess\"...umm lol ok.   Salad was very odd. You know one thing that really spoiled it is the silverware! No joke, I couldn't stab a piece of lettuce if my life depended on it! My husband had the same problem. There were SO MANY onions on our salad. Good god, I'm glad I'm married and not on a date, because no gum in the world would mask that smell.   Our steaks came out, and the server gave us the wrong plates. You would think by them ordering from a tablet (which is so tacky), they would have a system that allows them to track whose seat ordered what. Anyways, we switched our steaks. I ordered Medium Well and my husband ordered Well Done. My \"Medium Well\" was a bloody cess pool. I tried to suffer through my first bite. It was awful, and I left my meat-shaped blood pocket for good. My husband's steak wasn't well done either...his would have passed for my \"Medium Well\", but HALF of the 6 oz filet was all FAT!   We tried the twice baked potatoe and it was so off point. No taste, no homemade feeling, nothingness. No portion of our meal was enjoyable. The bread? Meh! Our bill ended up being $90+ including a 20% tip. So, we basically paid $90 for bread, water, and a lemonade. HW, you are WAAAAY off base with your pricing. There was nothing that said \"Hello, why yes indeed I am a $30 Steak\".   We couldn't wait to get out of there and go buy some real food! It was awkward not knowing how to pay for the bill. Our waitress disappeared quite often, while we sat there endlessly searching for eye contact with another serve to save us. All the while, a man who looked just like the Monopoly guy walked around from table to table being chummy and asking how the food was. Luckily, we were able to get out of jail free and escape (paying, of course!)  We noticed the mirrors and decor around the place were very dirty. I'm so sorry to leave a bad review, but HW is not a place that we will consider coming back to. It was memorable for all the wrong reasons, and I really hope that one bite of bloody steak I had stays down the rest of the night.   Save your money, folks. Really..."}
{"text":"Celebrated a birthday here this afternoon on an OpenTable reservation for four.  The service was top notch.  Our waiter was amazing, took great care of us, made suggestions, and answered all of our questions.  The house manager welcomed us and thanked us for coming.  The chef came out and introduced himself and asked us what brought us there.  We told him we were celebrating a birthday.  They provided a free 1/2 sized Baked Alaska dessert with a candle for that.  Very nice.  The art deco ambiance and decorations of this place are great.  The music was awesome.  I don't know what everyone's issue is with that.  This place is clearly unique in that regard and serves as no reason to rip a restaurant to shreds on yelp over.  We appreciated the uniqueness and honestly didn't even want to leave after the meal.  Go to TGI Friday's if you want \"normal.\"  We ordered two prime ribs, two fillets, giant baked potato, green beans, mushrooms, and mac and cheese.  The house salad that came with the entrees were delicious.  The dressings were all homemade and delicious.  I had the warm bacon dressing and it was great.  It had a slight sweetness to it.  I got a little bit of maple syrup from it.  The soup was prime rib and cabbage.  I did not have it but the birthday boy did and commented it might've been the best soup he has ever had.  The sides are huge and meant to share with at least two.  So that alone justifies the price and need to purchase ala carte.  We ordered way too much food but will know better now for next time.  The prime rib was absolutely mouth watering.  The two fillets came out over cooked.  We reluctantly sent them back.  The waiter, the head chef, and the house manager came to our table and apologized profusely.  The head chef promised to personally make new steaks.  The new steaks were quickly brought out, were cooked perfectly, and were delicious.  They took the high road and made it right.  Thank you.  The mushrooms tasted great and had a red wine marinated flavor.  The mac and cheese was RICH and tasty.  The green beans with garlic were perfectly flavored.  The potato was HUGE.  The quality of the beef was impeccable.  The unusually high price you are paying for a steak here is the result of HW sourcing the best possible quality of beef and it's obvious when you take a bite.  You get what you pay for.  We ordered a second 1/2 portion of the Baked Alaska dessert to share and two cups of coffee.  The coffee was delicious.  The Baked Alaska when spot on and phenomenal.    This place has a Natura water filtration system.  They bring the water out in a labeled carafe type jug and fill your water glasses.  It tastes great and is served at just the perfect temperature.  I want one for my house now.  We had a great overall experience here and can't wait to try the blue plate lunch specials."}
{"text":"Beautiful. I'm glad they saved and improved a Champaign landmark. Classy all the way. A bit pricy but worth it for the 30+ crowd. Not a hipster haven! Thank goodness. Plenty of staff, great service and well lit. Good background music...  Also a good place to pick up women looking for their next ex-husband and his pension."}
{"text":"We had reservations but it still took two hours before they served our entrees.  It took over 20 minutes before anyone came to our table after we were seated.  Looking around the restaurant, it seemed like most people had been waiting a long time also.  One person from another table even came over to ours to say that they had also been waiting two hours and they just were going to give up and leave.  The waiter was very apologetic but he didn't offer to take anything off the bill, and he said that it would be better in a couple of weeks.  The food was okay but not worth risking that kind of negative experience again.    If you do try it, the sides are very big portions--easily split between 2-3 people."}
{"text":"my goodness, what a disappointment our dinner was!  i came in with a group, not ravenously hungry and looking for something light, so i can't rate the signature steak dishes.  it being summer, i thought the tomatoes florentine salad was a no brainer.  for a dish that has \"tomatoes\" as it's first name, at the risk of sounding too political, i'd call this salad a \"disaster.\"  How I was looking forward to the fresh from the garden flavor of ripe summer tomatoes!  Sadly, the sliced \"heirloom\" tomatoes were the same hard, cold, flavorless, strip-mined variety you might buy in the dead of winter.  My sister had ordered the wedge salad, and immediately offered me her tomatoes, knowing i was a tomato eating machine that night, and strangely enough, her little wedges of tomatoes were the opposite end of the flavorless tomato spectrum, mushy and ice cold.  i also tried the lobster-crab bisque, which was also a disappointment, too sweet, a little overly fishy flavor, and if there was lobster in there, i'd be hard pressed to pick it out on a blind taste test. The last dish i can report on is the summer vegetable side dish - again, where is the flavor?  very sparse seasoning which i assume was just salt and pepper, not quite cooked zucchini and yellow squash.  another table-mate asked if i could pick out the seasoning,   I have no idea what the little dark flecks were, I tried to get a hint of basil or other summer herb, but there was nothing.   On the \"pro\" side, the service was good, our server dealt well with the challenge of separate tickets and our large group.  My cocktail was well made and tasty."}
{"text":"It hurts me to write this review, because Hamilton Walker's was something I was really looking forward to. Loved the idea of a new local steak and seafood house. Yet it missed on almost every mark I can think of.  Walking through the restaurant everything looks great, truly an eye-catching establishment. Which other than the friendly staff, is all it has going for it. However, when I say friendly I do not mean well-trained. It took our server 10 minutes to take our drink order, another 5 to bring back a singular Diet Coke, and another 10 minutes after that to come back for our entree order. Very nice individual, probably needs at least another 2 weeks of training under a more seasoned veteran server. With all the opening push backs you would think that they would have the service locked down.  It was lunchtime on a Wednesday, right around 12:30. Plenty of open tables in the restaurant and nobody seemed too stressed. We ordered two 6oz Filets and one order of the Jumbo Grilled Shrimp, one steak medium well, the other steak medium rare. Salads came out at about the 20 minute mark, they were okay, but nothing to brag about. After 40 minutes had passed since time of order our server came to the table, followed by a manager, saying that they had overcooked the medium well steak, and they were working on a new one for us. (Note: we had been in the restaurant for 55 minutes.) The manager graciously offered to go throw a few coins in our meter, and we decided to wait it out. At that very moment however, I knew that the medium rare steak was sitting under a heating lamp, along with the shrimp. Sure enough the medium rare steak had been cooking while the medium well was being replaced and was now a perfect medium well itself. It was taken back to the kitchen, I was left to snack on the Jumbo shrimp which not only managed to be rubbery, but also filled my mouth with a charred, almost plastic taste. A properly medium rare was brought out 10 minutes later, I've eaten a lot of steaks, good ones, bad ones, rare to well done. I have never in my life had a piece of steak with such little taste. I don't know how the Chef managed it, but all I could do was laugh. We had been in the restaurant for nearly two hours, had both our steaks overcooked, and had never been more ready for the check. I served tables for 4 years, usually when things go that drastically wrong a manager comes to the table and sincerely apologizes, maybe even adjusts the bill accordingly. No such thing was done, paid twice as much as any of the local competition just so I could add a new champion to my \"Worst Places To Get A Steak\" list.   It was so hard to get angry, because everyone we encountered genuinely seemed nice. However, the chances of me coming back are slim to none. There are a number of better options in Champaign, and the list is only getting bigger. Would be very surprised to see this restaurant become a long lasting establishment if things keep going on like this."}
{"text":"This is one of the finest restaurants in Champaign. The service was as good as anywhere I've been. The entire staff was attentive and friendly. My wife and I each ordered the 6 ounce fillet and both were perfect. The 5 stars are because there was nothing that could have been done better"}
{"text":"Hamilton Walker's is a bit pricey for the quality. We went in early January, and sat at the bar. It was certainly a lively atmosphere and the bartenders provided great service. The food was good (I had prime rib, my husband had filet, we shared the twice baked potato, asparagus, and chocolate cake), but for the price, it simply didn't wow me.   The steaks were good. The twice baked potato was recommended as one of the best sides, but it was relatively boring. The chocolate cake was enormous, but it was served very cold, so it tasted dry and the frosting hard. (It was delicious at home the next day when eaten at the appropriate temperature; just wish it was served that way.   We'll be back to enjoy the downtown atmosphere for cocktails and snacks, but Baxter's is our preferred steakhouse in town."}
{"text":"I should have listened to the skeptical reviews. They are rather kind, actually. Going here was a waste of time and money.  The food is \"meh\" - some things decent at best, some truly poorly cooked by a half-competent chef. The fish is SO overcooked and dry. The steak awfully overpriced, OK-ish, nothing better than what you'd cook at home, likely worse.  Yes, the ambiance is nice (hence two stars, rather than one star). Everything else is woefully lacking. The waiters, after DOZENS of reviews complaining about THE SAME FAULTS, continue to make THE SAME MISTAKES. Handsome and polite guys, but rather than a good-looking, fake, verbose, forgetful Mr. Clumsy, do yourselves a favor and hire some COMPETENT waiters, of the kind that work at Courier Café and many other places for 1/4 of the prices and of the tips, offering food tthree times as good.   How really difficult is to bring a veggie side dish (very poorly cooked by the way) at the same time as the main dish, rather than \"forget\", then \"apologize\" but literally compel the customer to eat the dried-out, poorly cooked meat on its own?  Apologies are nice and all that but if the restaurant person who keeps replying to reviews here would use the time to TRAIN THE WAITERS and make sure they run a functional restaurant, that time would be put at much better use! You'd need to apologize less frequently. Also this type of phony, canned responses - you know, \"thank you for your feedback, we keep trying to improve, we invite you back again\" - are quite offensive in a way, it's almost as if you take your customers for fools. I will NOT be back, thank you.     You cannot have a pretentious, expensive restaurant based on absurdly high prices, lots of empty talk, bad cooking, and amateur-at-best service. I give this place one more year at most, before it inevitably closes down."}
{"text":"My experience wasn't horrible at HW but when you factor in the price of the meal I was dissatisfied. The service was slow and not good, it took five minutes for my wife to get her Coke, and her refill never came. But to be fair, it appeared the other waiters/waitresses were good. It was a good atmosphere for a classy steak joint. Bathrooms were excellent. But that may have been the high point. My NY Strip was good. Ordered medium, came out a little on the medium rare side but not a big issue. I was not a fan at how the pricey steaks did not include a potato or side, only a soup or salad. My soup came out lukewarm, and it was a shrimp/scallops soup but there was hardly any shrimp/scallops in it, just veggies. Double baked potato was great.  My wife ordered off the appetizer menu. Her scallops and mussels also came out warm, not hot, and that is very concerning for seafood. Her lobster bisque came out hot, but that was because they forgot it. And it was in my opinion too sweet to be a bisque.  I don't mind shelling out big $ for a steak meal, but this meal was not worth it. Go to Ribeye if you want a quality steak dinner."}
{"text":"Loved the decor and the bathroom!!! Lol the staff was nice and the service was good. Had dinner with my ladies there and we went home with happy tummy :)"}
{"text":"Brunch was good and not super expensive. Service good. Had to send eggs ben back because one egg was hard boiled and food was served cold. There too frozen, dead Norfolk Pines out front. This is a tropical plant. Will die outside in winter. Looks bad to have dead plants at the entrance."}
{"text":"We loved the atmosphere and decor of the resturant and bar. The waitress was very friendly and offered up a great cocktail recommendation.   We were really looking forward to eating here considering there are billboards all over town. Sadly our food was really bland and mediocre. We had the burger and prime rib sandwich and were rather unsatisfied. It was nothing special and nothing to brag about.   We might come back to sit at the bar, take in the atmosphere, and enjoy a fancy drink. But definitly not for the food."}
{"text":"I've never had a prime rib that was so tender that you could cut it with a fork.  Flavorful and delicious but unbelievably tender.  My wife got a ribeye and that was good as well. First time there but definitely not our last.  Not inexpensive but still a great value for the quality, service and atmosphere."}
{"text":"Of all the epic anticipation around this place, all the ads, the billboards, the beautiful website, and I wish I could look you in the eyes while you read this and make the *disappointing explosion motions and sounds*. Because that's what Hamilton Walker's was.... TWICE.   Ok. A new place opens. And in my opinion, NEVER go for the first few month if you want to really experience the food. Give everyone time to adjust and get good at... whatever. So we waited for 3 months until going the first time.   You walk in expecting this \"classic 1940's Hollywood ambiance\" but I'm very confused about who the historian is that helped out here... Because you can watch PEARL HARBOR, The Notebook, Atonement, or Big Fish to find a better vibe of the 1940's. Couldn't the staff at least sort of dress the part? or have music from that time playing? Something? Anything?   But really. This was advertised as \"a memorable dining experience\". So, I was assuming \"fancy steak place\" + \"cool classy vintage theme\".... but no table clothes? Listen... Guys... Just no. Please get nice white table clothes. It will really just bump up the class.   Now *dun dun dun* THE FOOD!   The Ceaser Salad Dressing. ORDER THIS!!! This is the reason this isn't a 1-star review. It is amazing. Take the leftover home. You will be glad you did.   It's cool... another $5.00-$8.00 you can have a little side plate of the rice with a little parsley, green beans, mushrooms, and garlic potatoes.   So the Green Beans are literally the best side dish I have ever had! Bright, rich, salty, garlic punched and lightly coated in olive oil. I wish I could just have those.   The Rice. Really good as well. I don't think it would win master chef or anything, but Gordon wouldn't yell at you for it. This I would also eat this again.  The steak- I have nothing to say. Because I could taste nothing. Blagh. A Steak. On a plate. .... ... ... yeah... on a plate. a plain white plate.   The Salmon. Good! But.... Not better than any other steakhouse in town. (I might include my own backyard grill)    The Mushrooms. I think that's what they were... they may have also been rehydrated charcoal based on the color. You try them and tell me. #yikes     OK   You get the point. Food is plain and not worth the hype or money. But the real reason I am writing this is to hopefully make a few major points.   1) Our server was new. So nice. She was really sweet to my son and went out of her way to get him activities. She was doing such a great job. We left her a large tip! But the managers stood around the kitchen doors like mobsters (wait... is this part of the 1940's theme?) watching her and the other staff, then talking all secretively. Listen, I know she is new... but this looks bad! Like it was distracting to us and obvious. Customer service tip: Walk around and Talk To Your Customers! Ask us how the meal is, how we like the new restaurant, where we are from, how our service is.... you see my point? Because then I could tell you #2   2) WHY DON'T YOU HAVE A CHANGING TABLE?! Like... Men around the world. I hear your cry. Because they have no changing table in either bathroom. What?! Yes. :( For a mom like me... I don't stop living just because I have a baby. So when we have our CEO come to town and wants to go out with my husband and I for dinner but I have to take the baby(I am breastfeeding... and she won't take a bottle). We wanted to take them someplace nice! But it wasn't nice changing a diaper on the floor :( or on the counter :( Come on. Just get a changing table.   This was just really sad to see.    Dull menu. Odd plating. Overbearing management. Hit and miss food.   Just sadness. I was really hoping this would be a place to come often... but I don't know if I'll go back."}
{"text":"I've always had outstanding experiences at Hamilton Walkers and this time was no exception! The service was top notch! Our server Brian was very knowledgeable about the menu and provided great drink recommendations.  The filet was perfect and all of our sides were delicious, as well! The general manager, Nathan, checked in on us to ensure we were having a great experience--not in the intrusive, annoying way some restaurant managers do either.  He was very professional, yet friendly.  This time we sat in the lounge area by the bar which is a really fun and laid back environment, but I've also sat in the dining room for a more intimate ambiance! Overall, Hamilton Walkers is a great place for any meal and any occasion! Will definitely be back and recommend everyone try it out!!!"}
{"text":"Had dinner at Hamilton Walker's when we drove our son to UIUC.  It was a combination bon voyage and birthday celebration.  Haley was our server and guide.  She was charming and knowledgeable.  We started with spinach salad with warm bacon dressing and sweet and sour soup.  Both were excellent.  Three types of bread were served and relished.  Main dishes were rack of lamb and a 16 oz prime rib.  Both were exceptionally tender and flavorful. You know you have an excellent cut of meat when it is only mildly seasoned, letting the meat speak for itself.  It really allows you to enjoy the subtle flavors. One can always add seasoning to your personal preference.  Sides included a very large sweet potato, garlic mashed potato, creamed spinach and grilled asparagus.  The potatoes were very good. The creamed spinach was a success.  The asparagus was fresh and firm without being tough.  Baked Alaska was for desert and it was grand.  The food is all high quality and cooked to perfection.  Service is top drawer.  A gentleman named Eric is a font of information about the restaurant and the food.  I highly recommend the food and employees of Hamilton Walker's. Marvelous food, wonderful service and good value.  Enjoy!"}
{"text":"I dined here with two friends for dinner on 2/19/2017. We ordered different main dishes and shared them, so I actually tasted three main dishes, a side soup, the pre-meal bread, and the after-meal dessert Baked Alaska.  Some of the dishes are really good while some others are mediocre, given the rather high price in Chambana area. I ordered a medium-well rack of lamb. The meat were great, while the flavor could be made more impressive. My friend ordered a rib. It tasted perfect, while the amount of meat looked not enough for me if that were my only main dish. My another friend ordered a steak. Again the meat was good but the flavor was just so so. The side soup for that day was a mushroom soup, which was actually more like a mushroom mash and did not have an impressive flavor either. The pre-meal bread is OK, but the butter was so cold and thus solid that it was a little bit difficult to smear with it. The highlight of that meal was absolutely the dessert Baked Alaska. I liked it. Yelp actually has a picture of that (thanks to James).  The service and atmosphere were great. I would like this place more (maybe 1 star up) if the price were reduced by 1/3 or so."}
{"text":"BEST BRUNCH IN TOWN!  My friends and I are big brunch eaters and had an opportunity to preview the menu today.  In addition to being \"blown away\" by the ambience of the room where brunch was being served, the menu has to be the most extensive brunch menu that I've seen.  The choices will meet any and all tastes, from pancakes and French toast to Prime rib and eggs, it was difficult to make a decision.  I tried the signature HW potato pancake and my husband had the prime rib and eggs which he described as one of the best prime ribs that he's had!  My potato pancake was topped with sausage and a poached egg, as well as sprinkled with green onions.  The portion size was definitely enough for two, but being able to take home and have it reheat and taste even better was an added bonus!  We also ordered appetizers--baked goat cheese and toasted baguettes as well as heirloom potatoes was an absolutely delicious combination even though that was not our original intent.  We completed our meal with their bread pudding which was delicious and similar to other bread puddings at fine dining establishments.  Other orders at our table included French toast and something called a Napoleon which contained French toast and sausage presented in a very unique way.  There are lots of things to like about this place and I agree with another reviewer who described this as a destination stop.  I also liked the friendliness of the staff and the owners and their attention to detail.  It is obvious that customer service is of utmost importance as our servers, Jennifer, Jakob, and Kelsey in addition to all being very good looking had personalities to match!! I highly recommend the Brunch!  We can return week after week and still take months to try out their extensive menu.  And guess what?  We will return, again, for brunch and bring our friends.  We like to get dressed up for brunch and this is a destination worth getting dressed for! As with any new place, there are things to be worked out including food temperature as I like bread pudding warm.  But, if there is something you don't like, let management know because they want to get it right and when they do, this will definitely be a premier destination place and a spot for special occasions.  It's beautiful!!!"}
{"text":"We went to Hamilton Walkers to celebrate our anniversary. Service was exemplary and the food outstanding. I had the filet and my husband the rack of lamb. A bit pricey but worth it for a special occasion."}
{"text":"Facility is nice enough as you would expect for a new building. Sat in the bar for a more casual experience. Server was friendly, but not terribly attentive. We each ordered a spinach salad and steak (filet medium/NY strip medium rare). Salad was good (dressing is very, very sweet). Steaks were a flop. Filet was prepared fine, but it NY strip had to be sent back twice (overdone first, underdone second). We each ate our dinners separately while they tried again and again. They did not offer anything more than an apology and charged us full price for what was a very subpar dining experience. We would not go back again."}
{"text":"It was pretty great but the price is a little high and my stake was overlooked. However, it is pretty new and try to go! Look like a old American cousin."}
{"text":"I was a bit underwhelmed with my experience at Hamilton Walker's. My husband and I were staying at the Hyatt Place and decided to restaurant hop. We started off here for a drink and an appetizer.  We sat at the bar and were the only people seated at that time. We were able to order a beer pretty quickly. We immediately knew we wanted to try the mussels for an appetizer. However, we didn't get to order for about fifteen minutes. There were probably 5-7 people working behind the bar but it seemed as if people were training or doing tasks (i.e. cleaning glasses, stocking the bar) rather than focusing on customers. Not sure what was going on there.   The mussels were served in a white wine sauce with tomato and little pieces of grilled baguette. They were okay. Could've been warmer!  We caught someone's attention to get our check and had to wait awhile again. I hope that service issues will get worked out. At Hamilton Walker's price point the service needs to change to be worth it. I'd considering going for a meal in a few months after kinks are worked out."}
{"text":"Not impressed. Overpriced steak had better steaks at other places in town. Service was also slow. Will not  Go back"}
{"text":"Fantastic from start to finish!  I cannot say enough about how good the service and food are here.  There were four of us in our party and we were seated within 10 minutes on a very busy Friday night of restaurant week.  Great choices for apps, entrees, drinks and desserts.  And they make their mixed drinks the proper way, not with watered down mixes.  I had the prime rib with au gratin potatoes, the Palmer Fizz and the cheesecake to finish with.  All were excellent.  Cannot wait to go back!!  Great addition to the Champaign food scene!"}
{"text":"I am so impressed by their lunch! I got their Prime Cut Hamburger on the House bun and added Age Cheddar and boy I was not disappointed. There was a hearty amount of meat and it tasted great! They even gave little mints as well. My coworker suggested the Prime Rib sandwich but since this was my first time eating their food I stuck with something a bit more traditional. Next time I'll definitely try it though. I was barely able to finish my burger without feeling full. I was only able to eat a few of the house fries because It was just so much. You get your bucks worth here for sure."}
{"text":"The atmosphere saved this from being a 2 star review. I went on what they said was there \"opening night\" (Wed. 12/14), but I know they were open the 2 days before that as they posted that they were \"opening early due to demand.\" They also had soft openings before that as I walked by numerous times and saw people walking out with food. So.... I was prepared for opening day jitters but I was assuming most should have already passed. I was wrong.   The server kept telling us how bad their iPad ordering system was. I ordered the steak medium rare and there was NO PINK in the middle. They brought another one that was completely bloody to be sure they didn't over cook that one. I ate it anyway and it was alright. No real seasoning or even salt/pepper on it. The lobster bisque was good. The mashed potatoes were OK. (Note on the steak- I talked to 2 others that dined on different occasions and their biggest complaint was that they couldn't cook a steak to order..FYI).  Bottom line, it was \"OK\". But, my bill was $125 after tip. For $125 in Champaign I want perfection. I want a steak that I can't make myself. I want mashed potatoes that are AMAZING. The steak from the old Hometown Buffet was better than the one I got. They couldn't even cook it correctly. I won't be going back for awhile."}
{"text":"This is some of the best service I have gotten in a restaurant including ones much more expensive.  I had the steelhead trout and it was excellent.  the waiter, Nathanial, was knowledgeable and attentive.  The head chef even came out and chatted with us which is always classy.  Definitely a new favorite."}
{"text":"This review is for their group seating. We needed a spot big enough to hold 30 persons for a family brunch. Once I was in contact, the manager put me in touch with their Chef. Chef Zack helped me put together a menu that had a little something for both kids and adults. We then agreed on a price per plate and we emailed about the proposed menu. They took care of the rest. The three cheese eggs were a hit, sausage patties, veggie skewers, kids' loved the french toast with maple syrup, parfaits with granola, greek yogurt, and fresh fruit was refreshing. The wait staff was welcoming, professional and made sure coffee and refreshments were handy. I would recommend trying them for your event. Talk to the Chef they will collaborate. Because of their care our event was stress free and our time was well spent having fun with the kids and talking to family."}
{"text":"First thing you have to have a reservation. They don't do walk-ins! When you walk in they push for a time slot. We showed up at 615 and told us we wouldn't be seated until 830! The bar area had cheap paper printed old fashion drinks and like 3 beers on tab. The tables at the bar area was like a cheap old diner that was packed with people waiting on \"reservations\". Menu was old school seafood dishes. It really wasn't worth the wait or hype."}
{"text":"My fave restaurant in the Chambana area by far! Always high quality food, fantastic service and just a great ambiance! It's a classy joint! Big city style right here in Champaign!"}
{"text":"Hamilton Walker's might go down in history as the worst attempt at big city dining ever here in Champaign.  It is obvious to me that they spent quite a lot of money building this restaurant.  Unfortunately they didn't spend much on design, from the obnoxious sign that looms over the front door to the blandly designed bar. The lighting in the place was like a cafeteria. The seating was cheap and uncomfortable, the booths were too small to accommodate our family of four.  After waiting to be served for almost 10 minutes just to get water we finally were able to put in the drink order.  I have to say that when the cocktails game we were very disappointed, there are plenty of other places downtown to get more balanced drinks at cheaper price.  Although our server was friendly, he seem to have very little knowledge of the menu. We each ordered a steak and an appetizer. Between the clams, crabcakes, lamb lollipops, and wedge salad, nothing was very impressive. The wedge salad was deemed by the table to be an inedible as it was covered with carrot shredding's and french dressing, not sure how you can screw that simple salad up. The steaks finally arrived and were overcooked and underseasoned.  Overall our experience at Hamilton Walker's was very disappointing.  Not sure if they'll be able to turn things around but at this point I would say it's unlikely."}
{"text":"Easter Day buffet is outstanding!!! Carving station, beef tips, cod, salmon, chicken, corned beef, quiche - roasted vegs, scallop potatoes, more! Breakfast foods, salads, prime rib hash, bacon, egg casserole - more! Breads cookies cakes and omg a chocolate fountain!  Mimosas, bloody Marys, more! Very reasonably priced. Great moment."}
{"text":"Great food, great ambience, and even greater service. We stopped in here after Christmas Eve church and had a wonderful brunch. A member of our group has a gluten allergy and our waiter Nathaniel was so accommodating. The food was wonderful and our group enjoyed breakfast sandwich, fish sandwich, burger, prime rib hash, pancakes, shrimp cocktail, creme brûlée, chocolate mousse, and bread pudding. The pancakes are HUGE and we recommend getting an order for the group and splitting them. The manager, Nathan, stopped by multiple times to ask us how we were doing and made our experience all the more enjoyable. We are excited to come back again and try dinner!"}
{"text":"Good service, mediocre and overpriced food.  Don't plan on anything special if you are there for a birthday celebration."}
{"text":"I'm not sure what the negative reviews are about but I loved going here last night.  The service was outstanding and the food was amazing.  The chef even came to our table and chatted with us for a few minutes.  Very classy and it really added to the experience. While I thought $12 for a glass of champagne was a bit pricey, the rest of the food and drink were priced fairly for what we got and the quality of the product.  I had the New York strip and my partner had the fillet minion and they were both amazing.  The kitchen did a great job with the seasoning.  The red potatoes were great as well.  They gave us a sample of 3 different kinds of butter to go along with our bread and they were al very tasty.  I'll be back for Friday night entertainment even if I don't get a full meal too often because of the cost.  If I had to find something to complain about, I would say that they should put the cigar lounge on the roof in order to improve the ambience of it.   Having outback in the parking lot took away from the experience in my opinion and i think they should require nice dress from the people coming in.  Its a classy place. Don't be afraid to go all out with it.  Aside from those two items, everything else was great!"}
{"text":"Disappointing, bland, slow service, bad menu set up.   Came in for my dad's birthday dinner. Had to ask the guy who got our waters to get us a server after waiting over 10 minutes. By the time he got there (5 to 7 min after asking for him) we put in drinks, apps, and entree orders in at once for great of not getting his attention again. After that he was much more attentive, but a little unsure of things... definitely under trained, but overall a nice friendly guy.   As for the food, the lobster bisque has a pumpkin/nutmeg taste to it... Something I am personally not a fan of. This is $11 per bowl and a cup is not an option. The crab cakes we're alright, but somewhat bland compared to other restaurants. About$13 for one crab cake. All entrees come with either a side salad or a cup of soup. All other sides are a la carte (potatoes, asperagus, green beans, etc.) And are $5. We didn't get any sides, but 3 of us had the spinach salad (spinach, house, and Cesar are the options). The salad has spinach, mushrooms, hard boiled egg, croutons, and radishes. I got the Russian dressing on the side and it was great. It tasted just like thousand island. My parents got the hot bacon dressing and it came out cold. My brother got the soup of the day which was a vegetable broth based soup. It was decent.   For entrees, it's very strange. You pick a side to go along with any seafood option out of like 6 options. Sauce is served on the side and the fish is served pretty blandly. 2 of us got the swordfish ($30 per). I got the creamy red pepper sauce and my brother got the champagne sauce (per chef's decision). The fish was very bland and I almost sent it back, but instead my brother took it home for leftovers. He ended up using my red pepper sauce.   My dad got the prime rib but didn't share an opinion. My mom got the steel head trout. This was probably the best out of everything we ordered. She originally said chef's choice for the sauce, but somehow ended up with the Russian dressing, which she was very glad she tasted before covering her fish (sauce is all served on the side, so fish is not even cooked with the flavors). She then asked for the lemon butter sauce which was a good pairing for her fish. I ended up just splitting her entree since mine was so bad.   Overall, there are many better options in Champaign. Without proper staff training, better chef's and a better menu, it would be very surprising to see this place stay in business."}
{"text":"Come for the drinks!  Really excellent bar tenders here. They can make you a custom drink, just about anything you can think of. The cocktail list is also great.  I've yet to try the food but can guarantee the bar will be excellent. Ask for Josh."}
{"text":"This is my first review of a restaurant. Nothing was spectacular about that place. The server keep calling me bro. Totally wasn't professional saying that to me. Salad dressing was bland. Your meal doesn't come with a side dish.  I will they the place is classy and most of the staff is friendly."}
{"text":"Great hosts and cocktails! But the wait staff and food leave much to be desired, especially for the price."}
{"text":"I was there this past weekend. Very busy.  But the prime rib was a little flat. Needed more flavor and  not a fan of horse radish.  Asked for A1.  They have none!! Wth?  Crab cake was good.  Green Goddess dressing for salad had too much dill  for my taste.  Lovely place though.  Good atmosphere and service.  My daughter had the filet and that was delicious."}
{"text":"Some of the food was very good (steaks), some of the food was not (seafood, salads, and sides), so it was hit or miss. However, the service was lacking (the service staff were very friendly, but did not have proper training) and the kitchen was very, very slow. We spent almost 4 hours for dinner because the food was delayed and orders were wrong (multiple orders were wrong for a party of 12). Each time our food arrived, the service staff asked us who ordered what and we had to pass some of the food (and drinks) along the tables ourselves. The manager (who did not seem very friendly and was quite defensive, bordering on rude) was at the table behind us because the orders had been wrong for them, as well, and they had also been seated for several hours. He offered their table free dinners because they were becoming quite vocal and loud about the poor service. We felt sorry for the servers who were clearly trying hard, so we did not complain (except among ourselves) and paid our $900 bill and left. By the way, they charged us for several items that were incorrect (we had sent these items back to the kitchen), but it was not worth it to make a scene. This place will probably be great once they work out the details."}
{"text":"Food is good, but overpriced. Service is friendly, but slow.  I probably won't eat here again."}
{"text":"My last experience at Hamilton Walkers was extremely enjoyable. I found the staff to be very helpful and on the ball. I had a steak cooked to perfection. The asparagus was perfect. I also had an old fashioned and found it was made perfectly. I have gone back several times since for old fashioned and steak tartar. This is the best steak tartar and probably my favorite dish they have."}
{"text":"One star is rare from me. I like to talk about positives and I am not hard to please if you read many of my other reviews. There is nothing positive I can say about this establishment. Service was horrible, food was not even average, prices are way too high for what you get.  A group of 4 of us went at 4:00 pm on a Thursday with reservations. To keep this short, service was horrible. All of the food came out at the same time 45 minutes after we ordered. Salads, soup, entrees - all at once. I had to go up to the bar twice to get a refill on my guest's drinks. The bartender made me pay for them individually instead of getting them added to our bill. Food was boring and inadequate. Steak was cooked way wrong and our waiter never came back to check. I've had a better cut of steak at Ponderosa (remember them!?!?!) for 1/4 of the price. Shrimp cocktail was not deveined and was super tough - way over cooked and not fresh. Another guest had \"Fish and Chips\" - it looked like a child's plate or something you would get in jail - 1 small piece of fried whitefish and 9 cold steak fries. Salads were made with wilted and browned lettuce. It was completely nasty. I could keep going.  The worst part was that the management team was 3 tables away from us and never tried to help. They were busy acting up-ity sampling wine from a vendor. There were only 2 tables active - us and a 6 top - and the 6 top got ALL of the service.  I could go on more about the lack of cleanliness and other items, but no reason to. The food is lousy and way over priced and service was pathetic. Texas Roadhouse, Longhorn Steakhouse and Outback would have been better."}
{"text":"Yesterday, I took my Mom (Mother's Day) to Hamilton Walkers for a late lunch. I will give you a recipe for disaster which they are cooking up on a daily basis at Hamilton Walkers. How to mess up an old fashioned Champagne cocktail? Serve it with stale watered down champagne, oh and make the customer wait a really long time to get it. In fact make the customer wait a really long time to order, get their food, get their tables bussed, in fact just ignore them. Have your wait staff walk through the restaurant all the time doing nothing, carrying nothing, talking to each other, but frankly not working. Serve a house salad that had obviously been sitting near a warming table so it was limp and had a tomato in it that was at least a week old and tons of onion. Serve prime rib that was overheated and well done because it had been sitting under a heat lamp, scalloped potatoes the same, jumbo grilled shrimp that were tough because they had the same treatment and scallops that were barely cooked and cold parsnip whatever in the middle of the plate. Have the chef come out to hover, when you finally get your food asking if it is alright, just when you are about to take a bite, after you have been waiting for an hour to eat. He had gotten the message that we were a little miffed, so I guess he thought schmoozing with us was a better idea than just standing around in the restaurant instead of running the kitchen. Here is the sad part. I just came back from Santa Barbara, California, ate in the best restaurants in town, (SAME PRICES FOLKS) and got great service and food that was excellent. How can long this pretentious place can stay in business? As long as the folks in this town put up with it and keep coming back for the same awful service, same awful food. I am never coming back after two really bad experiences. Oh, yes, they did take 50% off my bill, but even that wasn't enough. The meal was supposed to be a treat for my parents. The only reason I booked it, everyone one else was full."}
{"text":"I was so excited for this place, and was disappointed. We decided to make a reservation for date night here, and were immediately seated when we arrived. The dining room is very open, well lit, and a bit loud- not the best place for a quiet date. We had dressed nicely, but many diners were wearing ball caps and jeans. It was definitely not the atmosphere I expected.  We ordered an wine (on tap), appetizer (oysters), each ordered an entree (steak with shrimp and salmon), side dishes, and a dessert (chocolate cake). Nothing blew me away. The oysters and salmon were good, but they had run out of sauce for the salmon so brought it unseasoned which left something to be desired. The steak was cooked properly (med rare), but was very tough and lacked flavor. The cake was not good at all, it seemed as if had been frozen or left uncovered in the refrigerator which had dried it out. Our total bill after tax landed just shy of $200.   Overall, I would say this place is not worth the price."}
{"text":"My first time here and out of everything I've tasted, noting was great! Most things were bland!  We had the ribeye, pancakes, chicken, asparagus. Ribs, chicken.  None of my party finished anything except the mussels and the oysters! We wasted soo much food...I wouldn't recommend this place!"}
{"text":"There were about four bartenders, and they all seemed to be drying dishes instead of waiting on any one. Two of them finally brought us menus, but weren't communicating because each asked us our drink and meal order separately. The prime rib is cooked to order. What?? The bartender said they have a special machine that cooks in fast (Sounds like a microwave to me, but I'm sure it's not). Texas road house has a better prime rib and it's cheaper. The med rare  prime rib we got was well done. The fries are frozen and the cheesecake was somehow over cooked on the edge, and a pudding like uncooked mess in the center. They have quite a bit to work out, but the atmosphere is good, and we enjoyed our drinks. I'll try again in about 6 months."}
{"text":"I have to concur with other reviews: it's a mediocre experience for the price. My wife and I shared a date night at HW's on 1/28/2017.  Pros: Atmosphere is fantastic. It has a unique look, feel, and sound that I could only imagine is reminiscent mid-twentieth century America. It's a generally feel-good kind of place. Seating seemed adequate, despite an event.  Service is strong as well. We had an excellent server who, despite being constantly engaged in our well-being, never seemed obtrusive or overbearing. My wife and I were never in need because he was always one step ahead of us.  Cons (or general meh aspects): Food: No one will complain about quantity. Whatever you order, you will get a lot of, speaking specifically of the sides. Where they will complain is about taste. My wife had a whole bowl of garlic mashed potatoes that I'm fairly certain contained no garlic and was made from instant mashed potatoes. She had grilled asparagus as well that she enjoyed (but I did not sample). My sides were creamed spinach and the red potatoes au gratin. The creamed spinach was on the soupy side, but the potatoes were really quite tasty.  Our mains: Wife had a six ounce filet while I had ten ounces of prime rib. My wife's filet was ok (overcooked), and served on a plate that allowed it to cool too quickly. Only about five ounces of my prime rib were edible, as the thickest, most significant portion of the meat was fat through and through (the waiter actually suggested we bring it home for the dog. I was obviously a little frustrated by this. Gristle is to be expected, but not accounting for half the cut of meat).  Flavors all bland.  The problem with HW's is simple: the cost/quality ratio isn't even in the ball park. It is fairly typical in this kind of restaurant for meals to be constructed with sides included that help balance and contrast flavors. Each side is five dollars or more, adding to meat prices in the thirties. For that price, every single thing in the meal ought to be edible and delicious, and the quality must be consistent throughout. It's simply not there.  If you're going there to drink and snack, you'll probably do ok. Those prices are fairly standard compared to other similar locations in Chambana. I'm not sure we'll be back for dinner unfortunately."}
{"text":"My wife and I drove from Chicago to visit our daughter at U of I.  We were looking forward to taking our daughter to a high end place for lunch. What a total disappointment!!! My 14$ dollar burger was not only made from a low quality meat (probably frozen patty), it was also cooked on a surface which was not hot enough as the burger was more steamed than grilled! Horrible! The place was completely empty at 3:30 in the afternoon  and this may explain such a low quality of food. Nevertheless, I definitely will not give this tourist trap a second chance."}
{"text":"We went to HW for the second time and all of us really enjoyed the cocktails and the food.  Made our reservation last minute thru OpenTable, arrived during a busy time but were greeted warmly upon arrival and seated quickly.  I had a dirty martini, Beet Salad with Goat Cheese, 10 oz Filet and Mushroom side.  Everything I had tasted great and the steak was cooked perfectly.  Only mistake was my first martini came dry, the server realized the mistake before I said anything, and replaced it free of charge.  My wife and Mom shared the Shrimp cocktail, and both said it was the best shrimp they had ever tasted!  Reading some of the reviews really surprises me.  Our experience was great service and great food, and the price point was fine.  We will be going again next time we visit Champaign."}
{"text":"Okay so let's start with service.  Average, got seated, took our drinks, took our lunch menu, and then a screw up.  Ordered Fish and Chips but got Fish sandwich.  Told the waiter I ordered the Fish and Chips, he answered just don't eat the bun.  Really???? I would do that at McD's but this being Hamilton and Walkers I expected more.  I think I saw the owners or managers hanging by.  Why don't you fuckn lazy ass guys walk around and ask if things are fine.  I'm pretty pissed as you can read.  If you can't the lunch menu right how are you gonna get the dinner menu right?"}
{"text":"Great spot for brunch! Bottomless mimosas would add a nice touch but also attract a lot of drunk students... so I understand why it's not available!"}
{"text":"Are you a boozy, depression era gangster who craves art deco? If so, Hamilton Walker's might be the perfect restaurant for you. For everyone else, it might be worth a wait to see if the place can sort itself out.   Firstly, the decor is amazing. You really do feel like you have taken a step back into the 1930s with the extensive art deco trimmings and impeccably maintained dining room.   However, food quality is quite inconsistent. For example, I ordered a prime rib sandwich with au jus. Although the prime rib came out tender and well seasoned, I did ask for it to be medium. It was closer to medium well, with large parts of the slice grey from overcooking. Fortunately it was prime rib so the result wasn't an inedible mess.  The horseradish sauce it was served with was also underwhelming, tasting more like mayo than the astringent nasally bite of horseradish. Their steak fries however are delicious and a high point of the meal.  Hamilton Walker's is a relatively new restaurant with plenty of promise as well as room to grow."}
{"text":"Overpriced and underwhelming. The entrees do not come with sides, you have to pay $6 if you want a vegetable. My husband's ribs were overcooked, our waiter never brought us bread, and we needed water refills for most of our meal. Chicken and salmon were good but not good enough to save our experience. We will not be back."}
{"text":"The appetizer, entree and drinks were amazing. However the service was horrible. We made reservations and had to wait 30 minutes to be seated at our table, then another 20 minutes to be greeted by our waitress Jamie. When we asked about menu recommendations she stated she didn't know because she hadn't ate any of the food. One of the bussers finally brought us water and bread. In the bread was a very long black hair that my husband pulled out of his mouth. He spoke to the manager and he apologized brought new bread and got another drink at the bar for us but it took 15 minutes to get to the table. During this time we still had not been checked on by our waitress Jamie. Our appetizer, salads and entrees arrived and no check in from our waitress. We finished our meal and had to get Jamie's attention to get the boxes and the bill. She then couldn't figure out how to swipe our credit card on her tablet after 5 minutes she realized she had the card upside down. The atmosphere, food and drinks were amazing but if you like quality service it is lacking especially if you have Jamie for a waitress. I was hoping for high quality service from Hamilton Walkers especially when your bill is $130+. My husband, Jake was so upset with the lack of service that he didn't leave a tip, and we are great tippers we tip 20+% based on service."}
{"text":"Service was horrible. Waited two hours for food and it wasn't cooked right. The manager was rude. I was with a party of 10. No one liked the food or service. If I could rate it a zero that's what it would be. I would never eat there again."}
{"text":"I came in with high hopes and a little bit of caution(read the other yelp reviews).  I made a reservation on a Sunday night, didn't know if would be necessary on Sunday, but better safe than sorry.  Not sure if I needed them or not, but they did not appear to be on a wait.  Ambiance is fantastic.  The front end bar is beautiful and looks like it could be great for cocktails.  Seated and our server was with us immediately.  Took drink orders, they were out quickly.  Also placed an order for appetizers, crab cake and Oysters Rockefeller.  They came out quickly.  I am not an oyster guy, but these seemed decent but I don't have much of a comparison.  The crab cake was tasty and the sauce was even better.  Around 10 minutes after that, our entrees came out.  3 filets, 2 lobster tails and a bone in ribeye, garlic green beans and au gratin potatoes.  All the filets were ordered medium and the bone in was ordered medium rare.  Filets came out Mid Well and the bone in was medium to mid well depending on the bite.  They were under seasoned (not sure if they had anything on them) and unspectacular.  It was late enough that I didn't feel like sending the ribeye back, So I guess I can't complain too much about that, but just be aware that they struggled with steak temperature at our table.  The sides were unremarkable and didn't add or detract from the meal.    For dessert we had the cookie pyramid and a chocolate cake.  The portions were huge and we only ate the cookie pyramid.  We each had a bite of the cake, the frosting was good but the cake was quite dry.    Overall there is so much potential in the space and concept and the service was good, but for the prices, I expect a whole lot more flavor."}
{"text":"I'm glad I read the previous reviews but I disagree with them. Because of them my expectations were lowered though.   Drinks - 5 stars. By far the most attention to detail I've seen from bartenders in c/u  Food - 4 stars. Crab cake app was the best I've ever had. Not crispy or firm like I expected but great. Steak burger I got for my meal was just alright. Filler food. Farrens still has the best burger.   Atmosphere - 3 stars. Everyone ranted and raved about the ambiance but I'm pretty sure I was the only guy in that bar that voted for Trump so I'm going with a 3.   Overall - 4 stars. Don't go when you're in a hurry. Go for the drinks. The desserts looked great but didn't try. Next time I'll stick to the seafood for my meal."}
{"text":"Went there for lunch and had the Filet with peppercorn. It was the best I've ever had. It came with 3 different kinds of bread and a large tasty salad. Service and atmosphere were great."}
{"text":"Don't be misled by the great website advertising. The place is ... (you know what) It closes not at 2 am as advertised but it was closed when we got there at 11 pm. The bar manager Josh admitted the misleading advertising by the place very honestly."}
{"text":"I am willing to bet this place will eventually get its act together but it isn't there yet. The cocktail list is super boring. The bartender was opening a bottle of wine at our table and knocked over a water glass.  No one got wet. He must have been nervous. Service needs work. I ordered a Caesar salad with my meal and the server asked me if Caesar dressing is ok with that....um...yes, isn't that why people order Caesar salads? She also must have entered our table number incorrectly as we had to flag down everyone who was carrying each of our courses as they wandered aimlessly around the dining room trying to figure out where they went.  I had the beef tenderloin quartet. I ordered it medium rare. Came out well done. I had to flag down a manager to ask which pieces had which crusts and what the sauces were. He knew all of them except one sauce. Then told me which sauce was recommended to pair with which crust, which is not how it was plated. My friend had the burger. It was fine. The coleslaw was bad, it had zero flavor. It was overlooked as well. Dessert was the 2nd worst part. Canned peaches and a scoop of ice cream.  Worst part was the awkward moment when the server shows you your total on their little tablet then you have to write in the gratuity as they stand there staring at you. Overall it wasn't a great experience. I'm not mad but I will not be excited to return."}
{"text":"My hopes---they were high!  Our community so needs a restaurant like this!  I wanted it to better than it turned out to be.  Here's my perspective:  Dinner for a group of 4 on 1/21/2017:  Appetizers-  the lobster and crab bisque was definitely NOT a bisque...we thought it was more of a jumbalaya without the okra-score 3/10.  The goat cheese, however was a hit-score 10/10.  Main courses:  Lollichops-score 9/10 and the crabcakes  were an 8/10-very large.  The bar staff were excellent in contrast to the wait staff.  Our waiter and the gentleman who served our food were not friendly and had trouble serving our food to the right people at our table.  That's what you would expect from Applebee's, not Hamilton Walkers.  I do realize that trying to hire wait staff in a college town with low unemployment is a challenge, but there should be competency training on how to interact with customers and how to implement a system where the servers always know which patron ordered which dish.  The building and décor get a two thumbs up.  I will wait for a time to give it another try hoping that the chef gets some of the recipes worked out and the staff get more training."}
{"text":"Great atmosphere, excellent service, good wines, but sadly, very forgettable food.  The best food was the complimentary bread plate. The leek soup tasted muddled, the salads were mediocre, and the main courses had no sense of presentation and were poorly seasoned. When we commented that the scallops were overly salty, we were amazed that the staff said, \"Yes, we've heard that from others.\"  I guess they didn't realize feedback should lead to action. An a la carte menu is no excuse to just put a piece of meat on a plain (and way too small of a plate).  The place has very good potential, but only if the rethink their approach to food (or change their chef). Definitely not the level of dining experience we were expecting."}
{"text":"So its taken a while to get up the energy to actually visit this place since the reviews have been, more or less, bad for a long time.  Lets start...The bread, waiter, soup, salad were all Very good!  No complaints at all there.  The mashed potatoes were excellent!  First sign of trouble, the look of the $32 ribeye my wife had, literally something you would expect to see at Dennys, not as a place that purports to be \"high end\".  It was good enough flavor, but not worth the price  I had the 14 oz prime rib, and it was very underwhelming.  just about anywhere else in Champaign that serves prime rib does it better for half the price.  That is the issue here...the price is just WAY out of synch for what you are getting. Also....Friday night, 7 PM and the place was basically empty, that is not a good sign.  All in all i feel bad for the place, they tried SO hard with the renovations done to the building, making something out of nothing.  But the star of the show is utterly disappointing.  Sad"}
{"text":"My wife an I just had one of the best meals of our lives. The whole experience, food, atmosphere, customer service, wait staff was just outstanding. We loved the Sautéed Brussel Sprouts. We decided to try your restaurant before the Pat Benetar concert at the Virginia Theater. That for a great start to the evening."}
{"text":"We decided to dine at Hamilton Walkers this evening to celebrate a birthday.  I'll admit, I was a bit concerned because of previous reviews.  Both my husband and I were very pleasantly surprised.  Our waiter, Teven, was cordial, attentive and professional.  Our meals were very tasty.  We both had the 6 ounce filet and split the asparagus and garlic mashed.  We also ordered desserts to share, the chocolate cake and chocolate pyramid.  The desserts are huge, one would have been enough for four to share, but we couldn't decide.  We will dine at Hamilton Walkers again."}
{"text":"Came in to an empty restaurant on a Friday night for dessert. We ordered Baked Alaska, cheesecake and the apple pie. All three desserts failed in a major way.   The Baked Alaska is traditionally served flambé tableside or at least a caramelized meringue, but ours was neither. For $16, this better be a dessert to show-off. We asked the waitress to check and see if it was put back in the fridge and fired earlier and she insisted that it is just been fired. It was cold as hell to the touch and the meringue had a browned skin that you could peel off that would only happen if it was rechilled after being torched. It was abundantly clear that we were being lied to.  The cheesecake was chunky and the berries did not look the least bit fresh. It also tasted like lemon even though we were told it had a mere zest.   The Apple pie was undercooked severely and the shell was mush.  Needless to say, I wouldn't invest more money in attempting to dine here again if dessert was this weak."}
{"text":"After eating here 6-7 times, the brunch menu is the best. The hamburger was tasteless, the ribs mediocre, the bar manager off-putting, and a vegetarian appetizer that smelled like fish. That said, I like the environs for late night cocktails!"}
{"text":"Over priced and the food is generally just ok.  The servies is fine, but the atmosphere makes you realize that this restaurant thinks really highly of itself. You can get better food cheaper. The only reason to go here is if you're wanting to show off that you're eating an upscale restaurant in the middle of downtown Champaign."}
{"text":"The service tonight has been bad. It took over 20 minutes to get water and a waiter to our table even after going to the hostess 2 times to state we hadn't received any service. The table next to us of about 8 people left because they didn't get service. They were here when we got to the restaurant. It took awhile for our drinks to come and then the orders were incorrect. I also took over a half hour for an order of French fries which were put in before our drink order was taken.   Update: drinks were not good . If it was possible to give no stars I would"}
{"text":"The poor service made it hard to enjoy the food.    The service staff was friendly, but clearly lacked proper training.  This restaurant should have focused on training their staff before opening their doors.  Basic services such as water by the glass, silverware (soup spoons, steak knives, etc.), bussing dirty dishes were ignored throughout our dining experience.  Just because the design of a restaurant is complete, doesn't mean you're ready to open (the inside of the restaurant was wonderful) the doors."}
{"text":"This was one of the worst meals of my life.  I went out on a limb and tried the steak tartar for an app before the entrée.  Tartar is meant to use the freshest of meat and to be done to order.  What I had tasted as if it were made days in advanced and was on the verge of spoilage.  By no means was it classic as the menu described either.  The server actually argued with me on this point as I was describing my disappointment.  Being a classically trained chef that has worked in the restaurant industry for over 20 years, I think I know what this dish is supposed to look and taste like...as it is one of my favorites!  The rest of my meal was mediocre at best and the service was not good.  As one of the other reviewers stated, I have never filled out a review in my life.  This experience was that awful.  My last thought is, if you are going to write a menu, be able to execute the items properly...a chef should be a technician that is an expert in the items that are on his/her menu."}
{"text":"This place missed the mark from the beginning. I'm giving a generous two stars due to the GM's response to our horrible experience. It all started when I made a reservation via their website for 7:30 and received an email confirming all was good. Perfect. About 20 minutes later, HW called me to say that there was a glitch in their system and 7:30 was not available. We switched the reservation via phone. An hour or so later, I got an email from HW with a subject line of \"Oh No! No Spot For You\" that essentially said \"sorry, we can't fit you in. Please try again.\" WTF. I called back and was reassured that our reservation was fine and not to worry. When we arrived, we had to wait for 20 minutes past our already rescheduled reservation time. We were then seated and greeted briefly by our waitress who took about ten minutes to return to take our drink order. Soup and salad was all fine. However, I needed another glass of wine as our waitress avoided eye contact for about 20 minutes while taking care of what appeared to be her only other table. Not good. After the silent treatment, another waiter asked us if we were waiting for something and said he'd tell our waitress I needed another glass of wine and cleared our bread plates. What a guy. Must've been the annoyed look on our faces. Shortly after, our waitress offered to bring me another glass of wine and then asked how everything was and started to clear my silverware as if we were all done. Wait a minute, we haven't even gotten our food yet. She apologized and said she got us confused with another table. At this point, we've been at this place for over an hour with no entree. Is this real life? How do you, our waitress, not even know if we've eaten yet? I suppose maybe she was confused by the fact that we had now been there an hour and a half so we probably should have gotten our entrees. When our food finally came out, my fiancée's prime rib came out dry and way over done without the side of au jou. This was the last straw. At this point, we've been there for over two hours. Not paying high end prices for a stressful, low-end experience. The light at the end of this tunnel was the GM, Nathan Escue. He patiently listened to our complaints and comped our bill. I honesty felt bad for him because I know we were not the only bill he comped that night due to terrible service/ food. If we try this place again, it will be because of him."}
{"text":"After seeing some less than flattering reviews, we were a bit wary, but we already made reservations for New Year's Eve.  Service was good and prompt.  Only one person in our group complained that he didn't get his water refilled enough, but he drinks water like a tuna.  My steak was cooked to perfection.  Only complaint was that my wife's prime rib was a little fatty.  Our party of six all agreed that we would come back again."}
{"text":"We were really excited to try this place but it was definitely a disappointment. There was a hair in my salad - it happens so I kept it to myself and didn't complain. They cooked several steaks wrong, and half of the other food was over cooked/ hard. They did recook the steaks, which took a while, so half of our table had to wait to eat. Nothing was offered to remedy the situation. We were celebrating a birthday, so the waitress offered to comp a dessert for us. The bill is done electronically, so I got an emailed receipt which I looked over the next day - they had charged me for the dessert. Our drinks were good & there is a nice atmosphere but this place needs a lot of work before I would go back."}
{"text":"Here are the things I loved: music, decor, ambience, and the brunch. My daughter loved the Breakfast Napolean. The kids menu is great!  It had steak, burger, whitefish, roasted chicken, ribs, and mac and cheese. I love that it wasn't just the typical \"kid fare\" that you get at most places. I had the salmon and caviar and it was excellent. The prices are pretty high, but the food was excellent and the experience was fabulously fancy."}
{"text":"Mom's weekend in Champaign. The wait at Watsons was 40 minutes so we came next door to Hamilton's. Fantastic Sunday brunch. We had prime rib hash with 2 eggs over easy on top and it was as good as I could have hoped for. We also sampled a chicken sandwich and a white bean soup which was hearty and tasty. A wee bit expensive for campus town but 3 of us ate for under $50. If you come to see your student and need a break from Papa Del's, try this place. Our server Kari was attentive and a real treat."}
{"text":"I've waited a while to post a review as I wanted to visit HW several times for an honest review. I have to say that HW has quickly become a favorite. I am quite the grilled and BBQ'er, and am a foodie beyond all regards. I ordered an aged bone-in Ribeye steak tonight that was absolutely phenomenal!  I didn't even need a knife! The steak came apart like butter and was an absolute masterpiece; better than any Ribeye I've made myself and I'm not ashamed to say that. My wife had sea scallops and they were as perfect as they come. When you add to the dinner a perfect selection of bourbons and wine, it makes for the best evening. I highly recommend HW! The staff is also more than accommodating. A great dinning experience. Can't wait to return!"}
{"text":"Wow! This place is awesome! Each of the 4 of us had a different entree, and we all were raving about how good it tasted! The staff is very friendly and knowledgeable. We have a new favorite dinner spot in Champaign!"}
{"text":"This was ok.  The ambiance is fantastic, and the friendliness of staff is superb.  My mom ordered a steak that came with soup or salad, so she got the lobster bisque.  When the bill came there was an upcharge for the bisque that wasn't made clear when ordering.  There was also an extra charge for Bernaise sauce, which I'm sorry but if your paying close to $30 for a piece of meat, charging extra for the sauce is just cheap.  So for a fancier steakhouse in downtown Champaign, don't nickle and dime customers.  Have a flat rate price for the dinner regardless of what side or sauce is ordered.  The up charge for the soup was $5!!  And it's suppose to come with soup or salad!  The veggie burger was ok, the portions were generous. Helpful tip, of the tomatoes are not red, don't serve them.  The green beans and asparagus were fantastic!  Lastly, although staff was very friendly, our table wasn't cleared and cleaned until way after we paid.    So, there's potential here, menu items are nice, but details need attending to."}
{"text":"Extra training is needs for servers but I still feel that a 5 star should be given this is a new places it will take time to work out everything out keep up the good work"}
{"text":"Went here for the first time for the restaurant week, tried the salmon, twin petites, house salad and triple chocolate cake for dessert. Left with happy taste buds and a borderline food coma. The interior is gorgeous, very 1940s chic. The service was kinda slow but they were extremely busy. Our server was good and knowledgeable. I actually contacted them on fb before going. They responded very quickly and Nathan the GM answered all my queries in more detail than I'd expected. They source their beef from Iowa Premium which is probably another reason why it tasted so good! Such hospitality combined with a great Champaign downtown location is enough to make me want to go back and try more off their menu soon!"}
{"text":"Had a key business dinner that required a quiet space.   Although they didn't have a small private room, the GM found a spot for us at no additional charge.  Thank you!"}
{"text":"Very simple - don't go...  Watson's next door is so much better. Food, service atmosphere so much better. Watson's gets it. I eat out 4+ days a week and the food here was outstanding."}
{"text":"This is the best steakhouse in Central Illinois! Shrimp cocktail is a must! Aged steaks are as good as any place in Midwest!"}
{"text":"Wow!  What a great experience.  We ate there for our first time last night and although we had heard some mixed reviews from reputable people, they have gotten their act together now.  Steaks were cooked and seasoned to perfection(we heard they didn't salt and pepper their meats, totally false).  The service was top notch and far better than what I typically expect out of champaign.  Byron was our waiter and he was professional and timely with everything, not a step missed.  I ordered a beer to come with my steak and 1 minute before the steak arrived he had my beer on the table.  Can't expect more than that. The prices I think I extremely reasonable for a steak house and we will definitely be back.  The atmosphere, food, service and overall experience is top notch.  Thanks for a wonderful evening!!"}
{"text":"This review is only pertinent to brunch, as I have never been here for dinner. Based on my experience at brunch, I have to give it 5 stars because my party and I were all quite satisfied.   To start with, the option to use the Bloody Mary bar is pretty cool and they do have some nice garnish choices, including bacon, shrimp, and cuts of cheese. The food portions are huge. My omelet (which I got with everything) was awesome. My girlfriend's chocolate chip pancakes were enormous and good as well. We had no complaints about the service either.   One thing I will say, they should seriously consider having hot sauce that isn't tabasco. Anything - Louisiana (preferably), Frank's, Cholula, anything would suffice."}
{"text":"Just finished a \"chef's table\" dinner experience at Hamilton Walkers.  My husband and I met with our chef a week or so prior to the dinner where he went over our preferences and developed a wonderful 6-course dinner just for us.  The evening was magnificent, from the table setting to the fabulous food, I could not have been more pleased.  Zach is a wonderful chef who took all the extra steps to \"layer\" our dining experience with one flavorful treat after another.    The entire staff at Hamilton Walkers always treats us well and go out of their way to make our visits special.  What a great night!"}
{"text":"Mediocre. I went for lunch and was not impressed. Nothing was terribly wrong with the food but I was left unimpressed and underwhelmed. With the fancy marketing, I was looking for a wow factor that was completely lacking.  The atmospheres left me feeling like I was eating at a hotel restaurant. For the price it doesn't seem worth it.  Don't think I will eat here again, doesn't compare to the rest of the downtown spots..."}
{"text":"This is a sports bar pretending to be a chop house.  They even have video gaming in it.  It's clear that the owner's have never been in an actual chop house based on the decor (too open and cold) and the TVs.  They also don't understand that if you are selling good steaks (considering for the price they charge), you do not put sauces on them.  Sauces are an indication of low quality meat and you're better off going to the chain steak places.    Save your money (and some disappointment) and go somewhere else."}
{"text":"Give it another try!!    I will admit that our first two attempts to eat at HW were not great. We were lured back in with promises of a new chef, better menu, and properly trained staff and management.  We are very glad that we went back.  The food and our experience were both fantastic!"}
{"text":"The experience at this restaurant really makes you feel so special.  The bartender hand makes every drink and is intuitive to customers tastes.  Great interaction and customer service.  The food...delish!!! The shrimp, wonderful.  The lamb, so delicate and decadent. You have to come!"}
{"text":"Excellent service, friendly staff, and great atmosphere.  We ordered one of every dessert and they were all fantastic!"}
{"text":"Bartender, Brandon, was very nice, knowledgeable and attentive. We ordered drinks and appetizers, which were made well and arrived promptly. Good hire with Brandon - he was really friendly and professional.  There was a drunk regular at the bar that proceeded to curse and taunt the bartenders non-stop. It was pretty annoying, but we tried to ignore it.   The bartenders' solution was to fill up a plastic water bottle with liquid that looked like wine / sangria. I received feedback on this review that no sangria is served there, and it was likely iced tea (which makes me feel better than my initial impression of a to go cup being given to someone with booze).   Had higher hopes as a first time visitor. Will give this spot another shot."}
{"text":"One of the best meals of my entire life. Every. Single. Aspect was perfect. The appetizers we ordered were very thoughtfully designed and tasted fantastic. We ordered oysters (in central Illinois) and they were some of the best, freshest tasting oysters I've ever had. My steak was cooked perfectly, and the sides that our table split were extremely uniquely crafted and were so flavorful- I strongly recommend the garlic green beans. My stake was cooked to perfection, and our craft cocktails were great. My ONLY complaint- and it is very minor and changeable-- the dining room was slightly too bright when we were there. Everything else was perfect. I've heard others complain about the prices- but to me they were extremely reasonable- especially considering the quality of food. Best steak house in Central Illinois- and a very top contender to the best steak house in the Midwest."}
{"text":"Dinner with friends: We had a wonderful experience this week at HW's.  The food was delicious and perfectly prepared. 3 of us had stakes the petite and full portion filets. You could almost cut them with a fork.  Delicious cocktails with an old school flare. I had the crab cake and lollichops appetizer.  Both were amazing. Our waiter Keith took excellent care of us. He was funny, engaging and really added to our wonderful evening with his suggestions.  We wrapped the evening with a wonderful execution of baked Alaskan shared by the table.  We can't wait to return and explore more of the menu."}
{"text":"Most of the food was not bad...except for the oily \"creamed spinach\" and the horseradish crust on the steak which appeared to be just very salty bread. However the service was a disaster. Wrong app sent out, then after about 20 minutes we were told the correct dish was not available, inaccurate food descriptions given by waiter, had to ask for steak knives and forks in order to eat entrees, side sauces not delivered with entrees, one entree delivered 10 minutes after the rest, final bill awkwardly not presented for review before payment was asked for, after payment on a $240 bill, the final receipt was dropped off with a \"here you go buddy\".  One thing after another Just led to a painful experience had by all. Hopefully the GM's are aware of the kinks to get worked out...the place definitely has great potential."}
{"text":"Made same day brunch reservations on New year's day for 4 people.   The diy brunch bloody Mary bar was on point with shrimp, Bacon, peppers, mushrooms, etc...  I ordered a coffee with Bailey's, but they did not have Bailey's so I got Kahlua instead. I think I'm now changing my brunch drink of choice to that, so thank you for being out of Bailey's!   I ordered the potato pancakes with poached eggs substituting Bacon for the sausage. It looked like a play on a bird's nest with the eggs. The dish was expectantly very greasy, but I did feel like the potatoes were slightly overdone. Also the sour cream was in one spot for decor, I assume, but it would have been better evenly allocated or on the side.   The bathrooms were impeccable.  The service was excellent, constantly refilling waters and checking to see how we were doing. The prices of the brunch menu were an excellent value, and I would love to come back for dinner."}
{"text":"Absolutely like the dinning area. Good service. A little pricy. I had a sandwich. The bread was great. And you have choices of your bread for your sandwich. It came with a side of fries and ketchup. Fires were kinda soggy. The beef patty was well cooked but lack of flavor. And the sandwich had no sauce at all, which made it so dry that I couldn't eat it without dipping my bread in ketchup."}
{"text":"Extremely unsure why this has such bad reviews. Our food was fantastic, the wait staff was very well mannered and attentive while not being intrusive and the decor is very nice. The steaks looked good as well as the seafood but we had sandwiches tonight. I had a beautifully cooked cheeseburger with Gruyere cheese on what is essentially a homemade brioche bun. This was fantastic, the meat had incredible flavor, the gruyere was very soft on the pallet but kept its identity well and no additional condiments were needed!! The other dish was a chicken sandwich, not my favorite but it was freshly pulled and all white meat. We ended our meal with the Pyramid dessert. (Pictured below) It was decadent and definitely rich, but not so overpowering that you couldn't eat it. It's a desert that is needing at least 2 people and could probably support 3-4. All in all Hamilton Walker's gets an \"A\" from me and I recommend it for anyone wanting fine dining in Champaign!"}
{"text":"Beautiful space. Okay wait staff. Food simply not good. Plus, very overpriced compared to local competitors serving much better meals."}
{"text":"A steakhouse that doesn't know how to properly cook a steak. I've been here twice, hoping the first time was just a fluke. The first time the appetizers took an hour and a half to get. The second time we ordered the special of the night, as did the table next to us, all FIVE steak were cooked well done when everyone ordered rare to medium rare. I also heard someone in a large group behind me mention something similar. None of the non-steak items have been memorable or worth mention either. I'm sincerely disappointed, as I had great hopes for this place. It just doesn't cut it. I gave it two stars for decent cocktails."}
{"text":"This is my first Yelp review ever and I decided to go thru the hassle of downloading the app and signing up because my experience was so BAD!    Like many I had such high expectations for my dining experience and couldn't wait to try out this new restaurant so my husband and I went for date night .  We both ordered the bone-in ribeye steak, creamy spinach, twice baked potato, and the seafood soup.    Our bread came out with hair on it. We asked the waiter what was in the soup, he has no clue.  His response was are you allergic to anything.  Then he asked another waiter what ingredients he \"thought\" were in the soup and the other waiter cut him off saying this isnt the restaurant across the street we don't serve that.  Needless to say...the soup tasted like unflavored beef stew.  Our sides were okay, lacked seasoning.   Steaks arrived and looked delicious. I ordered medium and my husband ordered medium well.  Mine was well done and both steaks had ABSOLUTELY NO SEASONING.  Worst steak I have ever eating.  I sent mine back for them to remake it (note: not only was it cooked wrong it was burnt).  The new steak was rare. SMH! I boxed it up and took it home to season and cook myself.  The owner (I assume) stopped at our table asking how service was and even after telling him I had to send my steak back he didn't make any efforts to improving my experience.    We left and went to desthil for dessert and ate popcorn at the movies because I was still hungry. Oh and my husband asked for lemon wedges for his water and that didn't arrive until we got the check.  I'm sure I'm leaving out something or maybe I've subconsciously blocked it out.  . .Needless to say we won't go back."}
{"text":"I have heard decidedly mixed reviews about this newish spot in downtown Champaign.  Which has a lot of interesting spots for such a small downtown.  I stopped in for a late lunch, and after a relatively large group of over six people left, I was the only one here.  So, during Christmas Break time in a sleepy college town, they are able to get some customers.  If not particularly jumping, though what would you expect?  Anyway, a great cozy vibe.  A long wood bar that can hold a lot of people comfortably, with high and low top tables scattered.  Big windows around the exterior so you can take in the downtown area.  A pretty simple layout, but really welcoming.  I was seated right away at the bar, and was taken care of immediately.  Ordered a Rigg's Hefe (they have a small but well thought out beer selection with locals and good regional's), and a Prime Rib Sandwich.  Food took about 20 minutes to come out.  The sandwich wasn't put together very well.  As the bun feel apart immediately, and the Prime Rib just one big hunk of meat.  I ended up just eating everything separately.  It would have been better to slice the rib up or not serve this as a sandwich.  Not complaining, but didn't seem necessary.  I would just serve this with the same cut without the sandwich, and maybe some fresh bread/rolls on the side.  Anyway, I didn't think the Prime Rib was anything special, it came out juicy but a little to done (I order medium rare, thought it was over medium IMO, but not a big enough issue to make a fuss about it).  Though overall, just lacked flavor.  For something that is $17 in this town, would except a little better.  The rest of the lunch menu seemed more along the lines of simple pub grub, which can be great as many places in the immediate area do, but up charged.  Looking at the dinner menu, it is certainly high end prices.  Overall, this is an A-OK spot.  I will give them another try when I can make it up to this town as it is certainly not as bad as some of the negative reviews.  It is a pretty good bar to have a drink at.  Though not yet at the level of some of my other favorites downtown."}
{"text":"A++ I held an event in the private dining room this evening. The service was excellent all around- best I've had in hosting these events. Food was served promptly at the same time - delicious steaks, cooked to perfection, and outstanding desserts! I definitely recommend and we will be back!"}
{"text":"Barely a 2 star.  Only because the burger was very good, but even that was overpriced. Everything there is overpriced for the quality and quantity and the service, at least in the bar area was terrible.  They are trying to be something they aren't. Just not worth it."}
{"text":"Excellent service! Excellent food! Prime Rib you can cut with a fork. Ambience is an understated elegance."}
{"text":"Went here for lunch and got their pulled pork special of the day! It was deeelicious! Their portions are really big and put me in a post lunch food coma. Will definitely come again to try out their other lunch specials!"}
{"text":"We visited for our second try yesterday, making a combined Mardi Gras/Valentine's Eve date night, with the idea that a good steak prior to forty days meatless would be a good idea, and that a festive Valentine's dinner would be better celebrated on a non-fasting day.  With that in mind, we decided to give Hamilton Walker's another try.  Our first experience with the restaurant was back in the first week of their opening, and it was not pleasant.  They were trying to fit too many people in given the new place, and their staff was not up to the task.  At the time, I began a review, but decided to wait since it would have been nothing but negative.  I have to admit up front that the overall vibe of this place bothers me.  I'm not quite sure what they're trying to pretend to be - gangster speakeasy?  40s elite club?  some Chicago thing I know nothing about? - but it doesn't feel like anybody else is sure either.  It comes across as pretentious and unnecessary, and I don't come to a restaurant for a theme park anyway.  Our server seemed to approach his task like it was a sacred duty - his tone was very, very subdued (we had to ask him to speak up) and loaded with awed superlatives about food and drinks he could only describe vaguely.  We settled quickly on their five-course menu for two, since it seemed to give us a good general selection of the types of foods we were hoping for.  I did ask that the menu dessert of baked Alaska (really?) be replaced with the special dessert on offer, a chocolate creme brûlée with raspberries.  After some hasty consultation this was agreed to.  Overall, the food was fine if uninspired.  A small cup of lobster bisque (very light on the cream, with some seafood that might have been lobster in it), a crab cake, heavy on the potatoes, remoulade sauce that was too sweet and heavy on the ketchup, and a substantial spinach salad (again, a bit too sweet, but it was a nice throw-back to 70s-style spinach salads when they were first popular).  Then a couple of little filets with mashed potatoes, grilled asparagus, and a port reduction sauce.  Average - nothing that stood out above any chain steak place.  My wife's first impression of the potatoes, in fact, was that they might have been instant, since they clearly had no dairy component (milk, cream, sour cream) which we pretty much take for granted in potatoes.  And finally the dessert - a small dish (one for the two of us) of a very average chocolate mousse-type pudding with a brûlée shell on it and several fresh raspberries.  We certainly didn't need one each at this point, but had rather expected it.    So overall - nothing was overtly bad, nothing was overtly wrong with the place.  But nothing was good enough, interesting enough, or comfortable enough to warrant the very high prices for the Champaign market, and we will certainly not be going back.  I'm much happier paying less for more creative, more interesting food in a much less self-consciously fancy place."}
{"text":"Honestly I was worried about dining here after reading all the reviews, but had a pleasant experience and can't wait to dine here again.   My family and I chose to come during the week and at lunch for our first visit because eating out with 2 toddlers can be unpredictable. We were not alone as there were several other guests with their young children dining too.   Service: Carlos was great; attentive and professional. We ordered in a timely manner and he refilled our drinks without having to be asked and checked on us often. Food came out without any issues.   Food: Being lunch I had a burger which was very juicy and cooked well. I loved the bread but felt that the juiciness of the burger made the bottom piece completely soggy and unmanageable to eat. The children's menu had a good selection of protein options (ribs, chicken, burger, fish plus a side); my daughter chose the 1/4 chicken (baked and so moist) and green beans (which were fresh and sautéed with garlic) plus she got to pick a dessert. I also had a bowl of the lobster and crab bisque which was very good, honestly I only got a couple bites because I shared with my husband and he devoured most of it.   Overall: I enjoyed the dining experience at Hamilton Walker's. I hope that people will give them a chance because it's just opened and working out their issues during a busy holiday season."}
{"text":"We made reservations for New Year's Eve about a month in advance. Our reservation was late - 9:30 - after a concert at the Virginia. The ambiance is nice, although the dining room was a bit noisy. We expected that on NYE. The wine list is extensive, and the menu has a number of diverse choices. In our party of four, two of us ordered fish entrees, and two ordered steaks. They were out of one of the entrees. I had a sidecar for a cocktail; It was excellent, and I recommend it. We had a young waiter; she was very friendly, but struggled a bit with the iPad or whatever HW's uses for conveying the order to the chef. First out was an appetizer for the table - cheddar cheese spread with baguette - it was a cold dish - I expected something warm. My bad for not asking. It was OK, not great. I ordered a small filet, medium rare. It was overdone but good. They do not have A-1 steak sauce, but have house made sauces that are good (I still missed A-1). I had a small wedge salad, which was delicious, but should have been served on a larger plate to allow for cutting. We split a chocolatey dessert (called something with the word \"pyramid\" in it). It was just OK. One of our party ordered coffee with dessert; it never came. Things I liked most: sidecar cocktail and small wedge salad - actually half salad with an upcharge to accompany my entree. Things that I'd like to see changed: 1) service staff should pay more attention to detail; 2) steak was overdone; 3) not good to EVER run out of entrees, especially at a place this pricey. If you DO run out of an item, tell people BEFORE they decide on their order to avoid disappointment. We will try again sometime."}
{"text":"My boyfriend and I came here for dinner tonight! We had a great experience. His crab cakes and my scallops were perfectly seared. The atmosphere, the service, and the food were amazing! We see many meals and memories to be had here. Thank you to our server, Thaddeus for such a fun dinner service! When you go, ask for him!"}
{"text":"Once again had a great experience at Hamilton walkers. We tried every dessert at our table and they are all awesome!  Outstanding moist chocolate cake! Great service too--they made us feel special and had no reason to. Must try the chocolate moose"}
{"text":"I'll start with the good: the service is wonderful. And now, I'll tell you the rest: lots of money went into this place but it confuses me. It's clearly Art Deco but then some numbskull who knows nothing about art or decorating screwed up and bought art nouveau accent pieces and even arts and crafts trim bits. (How gauche for a too large place that is terribly pretentious!)   The prices and menu are overly ambitious and clash dreadfully with the clientele who arrive in shorts and sandals.  Then there are the off-the-truck breads. So tacky. So disappointing. I'm surprised they don't use paper napkins, too. You can't have white table cloth prices then deliver placemat quality. It just doesn't work.   Like every other restaurant in CU, this place will do okay for a while, But don't expect a long life."}
{"text":"I'm giving this place 5 stars for a couple reasons but I want to note it sometimes only deserves 3 stars.  Who deserves 5 stars?    1.  The bartenders.  I have severe allergies and they not only stocked a potato vodka I can have, they gave me variety in town by stocking other than what Big Grove and Kofusion have.  These guys are personable and super friendly.  2. Whoever picks out the music whether during kitchen hours or after hours.  3. Whoever designed the bathrooms.  They are gorgeous and any girl loves lotion, tampons, and cotton balls.  Who doesn't deserve all 5?  1. The tablets.  I really hate ordering food in this place because of the tablets.  2.  The big open space in the dining room.  Stick a piano or some musical guest there because it's too big and my eyes don't know where to focus.  3.  The transition from ordering to receiving the food.  This needs some work or preface that you want patrons to have a longer experience as opposed to the usual wait time for food.    4.  The menu.  More fish and veggie options please!  5.  Lastly, thank you for being open until 2 on weekends but give us some mood lighting or something.  Have some sort of shift to remind me that I'm choosing to be there until 2am more than just the music genre.  Xo"}
{"text":"Not worth your money. I could not believe how under seasoned and poorly cooked the food was. I ordered the prime rib (which comes with a salad and bread for about $30). I got the salad first and I chose the spinach salad. It was very good. I can't comment on the bread Bc it was never brought out. The steak came out with \"jumbo\" shrimp I added and also some a la cart sides. So the shrimp looked like they were cooked without any oil or butter Bc they were DRY and had a shriveled up skin and I'm going to guess that maybe they were jumbo until they got shriveled down. The steak had zero flavor. The horseradish cream it got served with was nice but I'm sad I needed it so badly. The sides picked were mac and cheese and asparagus. The asparagus, like the shrimp, was not cooked with any oil or butter. Those stalks were literally thrown on the grill raw and then brought out. Awful. The Mac and cheese wasn't bad, but literally had no flavor. When the bartender came over to check I told him the asparagus and shrimp are dry can I have some butter for them? He offered a lemon butter sauce for them and it was delicious but I got charged for it which sucked Bc the shrimp and asparagus were already expensive enough without adding that. Same for the steak. My boyfriend and I were sharing everything and he doesn't like horseradish so he asked for steak sauce which they didn't have. So he said bbq was fine. We got charged for that too. We went to celebrate my birthday so we also wanted dessert. I got the ice cream cookie pyramid. This was the worst thing we ordered. The entire thing was frozen. Like it was prepped at noon and we got it after it was in the freezer for 9 hours. I asked if everything was meant to be hard and cold and they told me yes Bc otherwise it wouldn't stay a \"pyramid\". I ate the ice cream out of the center. They came back later to clear the plate and asked how it was. I told them the cookie was frozen solid and very hard. They did not offer a different dessert or even a couple dollars off. That scoop of ice cream was $11. Smh.   I will never suggest this place to anyone. I'm very sad I wasted my money and a special night."}
{"text":"The bartender Josh kills the game. Sick double strain for shots. Food is good but expensive. It's got the whole roaring '20s vibe. And that server Nate has the hair of an angel despite what anyone says"}
{"text":"We ate  lunch, mileu is very nice, prices are to high for Certain items ! 5 shrimp for 18.00$?? Yup! French fries ! I had beet salad which looked nice, however the salad itself wasn't fresh, sorry peeps always, always wash your salad put in fridge so it stays crisp! The BBQ pork rips had been warmed up slapped with sauce on top which had been to much of a good thing! The side of creamed spinach had been lots of onions and spinach with white liquid , there wasn't nothing about creamy here ! Sorry!  Now to a more personal note: the waitstaff was very nice, manager came over personally , chitchat! They knew it was our anniversary yet there wasn't any special cake or anything, which other restaurants always do for people!  Restaurant looks good, menu is nothing special, items need to be revamped and prices need to be changed on some items! At this point I'm not going back"}
{"text":"I keep wanting to like this place. From my time in Detroit and Chicago, I really crave that downtown steakhouse where I can sit at the bar, have a drink or two and enjoy a fine meal. Well, I must tell you, The crab cakes at Hamilton Walker's are the finest I've ever tasted...if you don't mind a 25-minute wait for an appetizer. Ultimately I think the agonizingly slow pace of their kitchen will doom this place; after our first full dinner there shortly after its opening, my wife vowed she would never return. I'm still willing to stop in for the occasional meal, but on my last visit the chill I got from the front door while seated at the bar was equaled by the cold shoulder I received from the bar staff. I get the feeling that the regulars at HW have formed a chummy little club with the bartenders, and we infrequent guests are not welcome. That's probably not a good attitude to project if repeat business is your goal. Bottom line: food great...endless wait...sit at the bar and they give you the gate."}
{"text":"I went in with very high expectations. There's signs around town everywhere. There's a massive social media push. They've hired some of the best people to work there.  We walked in, with no reservations because the place looked relatively empty. Apparently the bar area is not the main dining area, and you can't even see the main dining from the bar, so that's interesting. There is lights for where the future gaming area will be, because, if you aren't offering gaming, you are just refusing to take a simple source of income.  Interestingly, at the host stand, there are cigarettes for sale, however, there is no cigarette butt receptacles in front of the building. I think the cigarettes for sale is trying to add to the 1940's charm. (Not even sure if they are really for sale, but there are cigar cutters as well, so, come patio season, I'd assume they will be going for the sitting out front, smoking a big ole stogie feel).  We got seated at a table by the bar, would have preferred the bar itself, as we are bar folk, but that was all taken by people waiting for their tables in the main dining. The bar was staffed with some great people. Josh, Matt, Mike, another Mike; Josh's touch on the cocktail list was obvious.  I ordered the bone in rib eye, kridz went with the salmon. I got the spinach salad with it, kridz subbed garlic mashed potatoes instead of soup or salad. Bread was provided to the table. (There seemed to be lots of apologizing to other tables about not getting bread sent out).  The spinach salad was awesome. There was croutons, and then what appeared to be croutons, but it was large pieces of bacon, which was very nice. The menu lists the dressing as warm bacon dressing, and I can live with that. The salad was amazing.  It took a while for the food to show up, and the waiter apologized twice for that. I don't think we looked impatient.  Food came out, looked amazing. Large portion of the steak, and the fish looked really good too. The salmon had a nice crust and was a pretty shade of pink (medium). There may have been a little too much (raw) pink in it for kridz in the very middle, but the rest was cooked enough for her. The lemon butter wasn't that great. There were flavors of lemon in it, but it just didn't seem right, felt more like a seasoned olive oil, and that provided a sort of slimy feel to the salmon.  The steak seriously looked awesome. There was a nice char to it, and covered the plate. Sadly, it seemed to be overcooked. I ordered rare, it was medium at least. The flavors had almost all been cooked out. They list being lightly seasoned, and it was very lightly seasoned. I didn't get one of the crusts on it, because I wanted the straight meat without anything to hide it.  The service was great. The people are great. It's something that downtown Champaign needs. But, opening night, packed house, so I'll forgive and try it again. (who the hell am I and why should anyone care about what I think). I would love to go back again and change my rating."}
{"text":"For so long, Champaign residents recognized the need for a classic steakhouse and the arrival of HW was filled with a great deal of anticipation and excitement. We visited HW for the second time last night and I have a mixed review of the experience. First, the cocktails were very good. My wife ordered the Hemingway and I had the Old-Fashion. We waited on the appetizers, Lollichops (lamb) and the Baked Goat Cheese, a bit longer than we should have. We had made it clear to our server that we had an hour and a half before a show and believed that would be sufficient time for our dining experience. By the end we were rushing through our main course to make our show. I ordered a Bordeaux from the wine list and 15 mins later, the waitress came back to tell me they were out of that wine. The alternative was a weak substitute. The apps were very good. The goat cheese is one of my all time favorite apps. The chops were decent. The main course was a filet and a strip. Both requested to be prepared med rare but were medium when they arrived 15 mins before our show. Not only were they over cooked, but the quality of the cuts were average at best. We had the garlic mashed pots and creamed spinach as sides. Both were fantastic but we had to rush out the door and did not have the time we needed to truly appreciate the meal in its entirety. My first experience was better but both visits left me happy with everything but the steaks. Pretty sure a steakhouse should build around a spectacular steak, not the other way around. I have lived in New York and Chicago for a number of years in each location. I know a good steak (Peter Luger's, Erie Cafe, The Palm, Gene and Georgetti, Smith and Wolenski's, etc) so when I tell you this was a disappointment, you can take that to the bank. I am happy to spend 200+ on a meal for two if it fulfills even the basic expectations of what is advertised, but HW failed overall because they have an inferior primary product. The $40 steaks, are worth about $10 and the slow service despite repeated requests drops this to an average, overpriced restaurant in Champaign."}
{"text":"I had been holding off having dinner here for awhile, but today (2/22/2017) I decided to go in and have dinner for two. Drink selection and taste are amazing! Service was above and beyond outstanding! Ambiance was very impressive. However, the food and price are the let down.  I will be back to order an actual steak from a steak house after they have time to find their footing. I will continue to go in all the time regardless for the bar.  Price: Approx $89 before tip. *For what we got it was not over priced but I feel like 60% of the menu is over priced.  Drinks: Gin Martini (Asked the bartender for something with Gin and Pomegranate) *Amazing Bartender Sweet White Wine (Do not remember the name, was not my drink)  Appetizer: Complementary Bread Basket *Decent, but the butter tasted odd and had clearly been left out it was almost just liquid. Mussels in White Wine *Best I have ever had, I will defiantly get this again.   Entrees: Half Roasted Chicken *Good for the price and well cooked, but tons of just canola oil still on the chicken. Half Pork Loan Back Ribs *Meat was overcooked and seemed reheated, but the sauce was very delicious.  Sides: 4 Cheese Baked Macaroni *Overcooked pasta like it had been in a warmer all day and way too much cheese. Garlic Roasted Mashed Potatoes *Seasoned very well, but texture was that of powder instant potatoes. House Salad *Came with no croutons, no cucumber and onion when the menu did not state onion. Lobster Bisque *Burnt, like I got the bottom of the pot."}
{"text":"Terribly disappointed. Had really high expectations for this place, but almost any other joint downtown will give you a better experience......"}
{"text":"Hamilton's seemed like a perfect date spot. My partner and I came here for lunch about a month after it opened. We were seated at a comfortable booth against the wall. The place was empty except for the handful of people spread across the dining room. The interior remains true to its throwback, vintage vibe with lots of earthen colors. I imagined that when the place was packed, it would look similar to something out of the Great Gatsby. Our waitress briefed us on the history of HM and the future plans for the restaurant. The bar seems to be popular.  We ordered sandwiches and the portions were huge. The bread tasted fresh and gave you just the right feeling of crunchy and soft when you bit into it. However, our meat was not evenly cooked and my portion consisted mostly of fat. If trimmed, the actual sandwich size would probably be cut by half. We have not returned to Hamilton's again, not due to its service (which was attentive and friendly) or interior, but its not-so-vintage prices and lackluster menu items."}
