{"text":"This place is amazing! Highly recommend the mixed grilled mushroom salad with yuzu dressing! I went twice with a big group so I was able to try a lot of the menu. All was delicious. The service was quick and friendly- all family run and the Chef also trained at the Culinary Institute of America! They also have a liquor license now so you can get sake and Korean beer with your food. Dolsot bi-bim bap was awesome, as was the bulgogi, they have a seafood pancake but since we were with vegetarians we requested it veg and they were so accomodating! It was delicious. We also tried the tofu kimchi stew which was yummy and we recommend getting a side of kimchi -its a littel extra but totally worth it. Also had the yuzu creme brulee for dessert! Oh and ask for the Corn tea water when you come in - it's free but otherwise they give you the plain water and the cold corn tea is really refreshing and yummy."}
{"text":"I have had Korean in a few different places, but wouldn't say I am an expert. I've had a number of dishes here and each time found them very good. What set this restaurant apart, however was the atmosphere and dedicated sincerity of the staff.  I will continue to enjoy coming here and being a regular."}
{"text":"Run, don't walk to this place. Delicious, authentic and reasonably priced food,
friendly service, bright and clean. So happy this opened up in my neighborhood!"}
{"text":"Wonderful food, fair prices for the portion sizes, and beautiful presentation. Would definitely return. The location is beautiful and clean, still small and intimate. They have decent wines and beer options. Lunch specials are a great deal."}
{"text":"The dishes I tried here so far were definitely above average and not one-note in flavor. However, most prices of the main dishes are also above average but at least the quality is present in the ingredients and cooking. I had a seoulleong tang (ox bone soup) for $16. It was light, slightly milky white with a subtle but noticeably clean taste. It requires many hours or even a day to extract the flavor from the beef bones and patiently emptying and refilling the pot of water in stages to get that milky white color. I've tried this soup at a couple of other places and was never impressed (usually just tasted watery) but the one here was quite good. It contained slices of tasty beef shank, translucent noodles and green onions. It came with a bowl of white rice (wish they provided the purple rice but oh well) and a bit of gochujang paste on the side. The paste wasn't very spicy.

I also ordered the smaller haemul pajeon (seafood green onion pancake) for $10. A larger one can be ordered for $12. This was also quite good. I found it to be a bit different than most of the ones I've had in the past. It was very crispy, not oily and surprisingly light. It had shrimps, squid, (maybe a few mussels), slices of bell peppers, zucchini and green onions, of course. It was topped with bonito flakes, which is unusual but a nice complement nonetheless. The extra vegetable ingredients made this pajeon more interesting than other ones taste-wise. The accompanying dipping sauce was good, a bit tangy and not too salty. Be sure not to touch the hot iron plate because it will be super hot when they serve it to you.

The banchan was also pretty good and nicely pickled. The portions given are very small but you can ask for more. Could've been more spicy but that's just my own personal preference. The flavors were definitely bold enough. There are some stairs to walk up before you get to the entrance. The decor is nice and there is a good amount of seating.

https://www.facebook.com/hansangmtl/"}
{"text":"This restaurant was surely one of the best places I've ever been in Montreal. For the service they were definitely number one! I was astonished with the corn tea because it was the first time I was served with it since I came to Montreal. The place was really clean and cozy with a very warm waiter. We ordered Bibimbap and Korean Ramen which were both delicious! And the Kimchi was amazing too. We'll come back again for sure!"}
{"text":"During my short trip to Quebec and Montreal, Canada I was craving Korean food so i was super excited to find this spot and was excited that the reviews were great! When I got to the restaurant there was a very strong odor of soju or sake. It was kinda weird but did not bother me. The restaurant is decorated so beautifully and i have to say this is the most fanciest Korean restaurant i have ever been to. The place was so clean and so classy but 
I was not too pleased about the food. I guess because I am from New York and me being Korean, my standard for Korean food is pretty high. I felt the food was too bland and had no flavor. Maybe this is what Korean food is in Canada but it is not something I am used to."}
{"text":"Absolutely fantastic. Wish there were more restaurants of this sort in town offering honest, friendly, and fresh home-cooked meals. 

We tried the Gamja-Tang and the Bibimbap. They were both incredibly flavorful. Unlike many other restaurants, we did not leave with a bloated feeling, only with the sweet scent of our dishes. The prices were incredibly reasonable as well. A bonus for the complimentary corn tea."}
{"text":"I've come here many times since it opened and I will say it is one of the most authentic Korean restaurants in Montreal, especially in the Plateau/Mile End area. 

I mostly get their pork bone soup (Gamjatang) when I'm here because it is honestly one of the best ones I've had (and I am Korean/from Toronto). Otherwise I have had many of their stews and they've all been great. As an appetizer, I always get their seafood pancake. It's super crispy and delicious!

The service here is awesome and the food is prepared with care. I have also had a birthday party here with 20 people and everything went super smoothly. They are very accommodating! 

I will say that the prices are not cheap. For one stew + rice meal, the average price is $16 which is considered really high for Korean stew meals. However, taking into account its location and the quality of the food, it's worth it! This place is as authentic as it gets - I highly recommend this restaurant!"}
{"text":"Waiter was very kind to us. The food was tasty but kind of over priced. The banchan was limited and you have to pay if you want to get more. The menu is kind of expensive for what you get and the place overall isn't bad, it's just that you can find better korean food at a lower price. However, if you're in the neighborhood and are craving korean food, not a bad spot to pick."}
{"text":"We got there unexpectedly after an activity around the corner and I'm so glad we did! Great food and excellent service! Thumbs up!"}
{"text":"Went there for dinner with the family and everyone was very pleased with the food. Very authentic, delicious, good portions and very reasonably priced. I would definitely go back and highly recommend it. Great service too!"}
{"text":"Yay! I am so happy! This place has just opened - right around the corner from my place - and it's fantastic! A family run business where the husband is front of house and the wife and another chef do the cooking. The food is prepared with pride and love and was delicious. For a newly opened restaurant the service was seamless - and even more than that - friendly and generous as we were given an additional appetiser dish on the house. It was a mushroom salad with yuzu dressing that wasn't on the menu but the chef wanted us to try it - and it should be! 
We ordered the Korean pancake (vegetarian), the beef bulgogi, 2x bibimbaps, the tofu and kimchi stew (a fave), and the sweet potato glass noodles (another fave!) and there was plenty of food! Along with the complimentary mushroom salad, we were given kimchi, and some pickles to start and also had cold roasted corn tea (delicious!) so I would say this was a very well priced meal around $25 per person. The food was all very tasty and the portions were generous - we were 5 and we had plenty to try from each dish. 
They are yet to obtain a liquor license so we did not drink. 
I am very happy this restaurant has opened and I wish them every success! Go try it!! Let's keep this neighbourhood full of local, independent and family run businesses like this one! I look forward to returning. 

3rd time here!
Love it so much!!!!!"}
{"text":"Friendly staff with amazing authentic Korean food. Not that Ganadara BS. The mom is working that kitchen like a God Church. Get it going son!!! Get that porc bone soup if you can it often get sold out!!!"}
{"text":"Simple and delicious Korean staples.  Excellent bibimbap, excellent kimchi jigae. Can't wait to go back and try the rest of the menu."}
{"text":"Bibimbap au boeuf: traditionnel, mais l'oeuf était cuit...j'aurais préféré coulant! 
Sauce ordinaire. 
Une fois mélangé tout se mariait parfaitement...mais ce n'est pas le meilleur de Mtl.

Sundubu végé avec tofu: goût parfait. Ils ont utilisé du tofu soyeux...pas besoin de dire que ça n'a pas tenu très longtemps dans la soupe. 
Manque de diversité de légumes...

Belle place. Service impeccable."}
{"text":"A group of buddies and I were in Montreal for the weekend and we were getting pretty sick of poutine and bagels by the 3rd day. We checked out a couple other Korean places near our place but nothing met our standards. I found Hansang was relatively close and funny enough, right across the street from the poutine place we were getting tired of. 

First impressions are highly important for me, and trust me when I say this place did not disappoint. Very elegant and modern furnishing with a bit of traditional Korean artwork and other decor splashed in to remind you that you aren't here for a steak and wine dinner but some hearty Korean goodness. We came around a short while before they closed so the restaurant was more or less empty and came back the very next day for lunch before catching our trains back home. Both times were not busy at all. 

The service was great (except one friend who had a couple hiccups in service both times), the food was more or less exactly what you'd expect. They also informed us they had a 10% discount for students which is nice. The only real downside I'd say would be the prices are a tad high from what I'm used to, but probably what you'd normally expect if you live in Montreal. Also their banchan game is weak lol

Also: It looked like they have public wifi but I couldn't be bothered to ask them for the password."}
{"text":"We stopped by here for late lunch with our toddler. We started with miso, fried vegetable dumplings, and a fried octopus. I had a bento box with pork, avocado and cucumber sushi, salad, fried dumplings and spring roll, and rice. My husband had the bibimbap, which arrived in a sizzling stone bowl. Both dishes were filling and flavorful. The service was excellent as they accommodated our daughter who was hungry and tired. A wonderful place to stop in on a cold spring day."}
{"text":"The staff were so friendly and attentive. The food was delicious! I ordered the kimchi jigae with pork which was on the sweeter side but it sure cured a queens girls craving for Korean food. The pajeon was also delicious! Would come back again."}
{"text":"Decent Korean food. Nice portions but perhaps the price is a bit high for what it was. Long wait time for food. Very nice staff"}
{"text":"What a meal. 

-Very good presentation
-Great taste. 
-Kimchi is fresh as ever
-Modern interior design
-waitress is nice
-Generous portions of meat!

Good experience (alone or with friends) 

We took Jayuk (marinated pork) and a delicious soup (soondobu?)"}
{"text":"This Korean loved her Korean food experience. The food was exactly the way it should taste and the service extended my expectations by far. My friend convinced me to order the octopus balls after mentioning I wasn't exactly a fan and I certainly have no regrets. We then followed with the seafood soup, which I feared would be volcano spicy. Don't be fooled by its colour. The level of hotness was perfectly mild. On to the beef bulgogi, I must underline how I appreciated the fact that they didn't use cheap quality meat like most Korean restaurants in Montreal. To finish off, we tried the red bean and green tea ice cream, which usually never fails to satisfy. Forgot to mention we had a very much affordable bottle of white wine. Voilà! You must try this place. It kicks the butt all the other Korean joints in town. :))"}
{"text":"Chose this place for my birthday celebration due to 2 criteria 1. its proximity to our place in Plateau (an absolutely bone chilling night called for short distance traveled) 2. Craving Korean 

My boyfriend and I arrived around 7 on a Wednesday night to an empty crowd - a large table was leaving as we were arriving so we had the entire place to ourselves the entire evening!

We were given some warm green tea to heat us up right away which helped to cure the biting cold. Our server was incredibly friendly & made suggestions to us on her recommendations. 

We ended up starting with some steamed dumplings which were superrrbbb!! It came with 4 decent sized dumplings & I do wish we got 2 plates. 

I ordered the bibimbap and my boyfriend ordered the pork bone soup (can't remember the name) - which came highly recommend from our server. 

Both dishes were DELISH. Heaping sizes, incredibly fresh. I'm so grateful we decided to pop in here - what a wonderful birthday dinner!"}
{"text":"I came here for my friend's birthday on a Thursday and we were a party of 9. 

We called 2 days ahead to make the reservation and when we got there, everything went smoothly. We were seated and offered a kind of cold Korean tea that I loved! 

The menu has lots of pictures, so no worries if you've never had Korean food before (like me!) They have a lunch menu and a supper menu. They looked pretty similar, but supper is just slightly more expensive.

They have two TVs (one playing Korean music videos and one playing Korean cooking shows ans such) which is nice to watch while waiting for the food... not that it's needed, because the food came SUPER quickly! 

The portions are very big! I was more than full and I could barely finish my meal! 

We had to pay at the counter, but that's not a big problem in my eyes. 

This is a family run restaurant. The parents are in the kitchen and the kids (daughter and son) are waiters. My friend actually knows the owners of the restaurant, so after her meal, they actually gave her a little birthday cheesecake! (You can't even buy it! They made it specifically for her!) 

Overall, it was a really good experience and I can't wait to go back and discover other Korean dishes!"}
{"text":"Très bon restaurant.  Le service est très accueillant et chaleureux. La bouffe est délicieuse"}
