{"text":"If you are looking for an all-day breakfast restaurant, this is the best stop. Few of my favourites are longsilog (sausage, fried rice and egg), chicken bbq and halo halo, the best!  They also have different filipino dishes and desserts such as cupcakes, rice cakes, cakes (home baked, goldilocks and red ribbon), milk tea, sago't gulaman etc at a reasonable price. Also, they have other products like cup noodles, chicharon, condiments etc. Their washroom is always clean."}
{"text":"Great family restaurant! Love the variety of food offered...they have lots of cake and desserts as well... Awesome decoration for the holidays... Lots of options even for the picky eater..."}
{"text":"Thought I'd try this Filipino restaurant I saw in Yelp. I dont cook much so when I crave Filipino foods, I would typically go and find a place with good reviews.   It was a nice, clean, small place. I think the place can seat a little over 20 people.  Lots of cakes on display.  Dead at that time, no one ever in there but me at 2:30pm on a Saturday. I tried Diniguan and barbeque with rice combo.   Turned out the food aren't as tasty and close to what other Filipino restaurants I have been so far (FV locations and other similar Filipino places around Scarborough and North York)."}
{"text":"I am glad this place exists! I really wanted to find a Filipino restaurant in Canada especially that I have been craving filipino food for such a long time now. I never knew the restaurant not until I walked past by it by accident which was right across the street. They have the best pork bbq stick that is easily comparable to bbq sticks I've ever had that my family used to buy back in the Philippines. Their Krispy pata is also so good that they just cook the meat right and not like other Filipino restaurants that I have experienced where the meat has been fried for too long that it is already too hard to chew. I can go on more but overall their food is really delicious and I have no complains about it.  Their price range is really cheap and they are usually worth your money. They also have different deserts like Halo-Halo, Buko pandan and all sorts of Filipino sweets. What's also great is that they also do sell Goldilocks and Red Ribbon cakes. The cakes might be a little pricier but it is really worth it!  This place is really great to just go and dine in since the place is really neat and organized.  The only thing I do hope they do is to do deliveries to an office and such so I can have these food for lunch always and have my Filipino friends order some as well!"}
{"text":"first off, the people working there a friendly, at least when i have been there.....but we're mostly here for food.   to me, not much selection and kind of expensive to me for how much you get. the food is okay but i'm not wetting myself when eating.   what i do think is really excellent are those small colorful puto that i think they make themselves. it's really good and my niece eats it like her life depends on it.   i live around the area so it's very convenient if one just wants to walk over somewhere for filipino food without cooking yourself but as 2 star means, meh i've had better.   the puto does make me wet myself, at least those small colorful ones and the people there seem genuinely friendly and easy going."}
{"text":"because there is not a lot of business, most of the food there is cold. the flavours and taste is good and price is good, a lot of pork choices. skip the cakes they are not homemade and kind of stale."}
{"text":"I found this place through a fellow Yelper who left a review regarding this newly opened Filipino restaurant, and I was excited to check it out!  I was suprised at how cheap their food is by checking their FB page, but I was mostly impressed that they offer all-day breakfast meals for only $5.49 with a free drink!  For Filipino breakfast, I have always been going to Chef George, but I thought I would try this place, as the price is appealing and the restaurant is closer to home.  On our first visit, I tried their lumpia with rice, and my BF got their Tapsilog. For those two meals, the total was only around $12.  Lumpia with rice comes with 6 small pcs of lumpia, which I find really tasty and fresh! I wanted more! The Tapsilog was also very good! Definitely beats Chef George's Tapsilog!  On our second visit, I tried their 'small-sized' Filipino spaghetti, for only $3.49. The small size is still a good portion. I also tried their BBQ pork, which tastes better than the one they have at Jolly's Grill-In. This has got to be the best BBQ pork I have ever tried.  They have a big selection of desserts / cakes / baked goods as well.  I suggest trying out this place, it's cheap, offers great service, and food is served fast as well. Definitely a 5-star!"}
{"text":"Summary: seems people either REALLY like (5 stars) or really don't like (2) this little spot that is more 'takeout spot' than family restaurant (you go to the front to make your order). My experience with dinner was that it's closer to the latter, but the carbs are solid even if the protein isn't.  Top Get: garlic rice! (comes with most breakfasts) Top Regret: timing, dishes sitting in the warming trays (especially the bbq pork) What I'd Try Next: all day breakfast  I'm a BIG fan of homemade Filipino spaghetti so when I saw this place, I was like MUST TRY!!! I came here for dinner with some friends at 7:15 pm, understanding they close at 8. It's not a big area but I appreciate the 'homeliness' of the place. Service wasn't the most dazzling (see below) but we still came away with a few orders of things:  FOOD: Spaghetti - I guess each family makes it differently and the ones I know definitely use a sauce with more ooomph! This was pretty fair portion sized though, and the taste was good, and best of all it has a LOT of meat (ground beef or pork sprinkled in).  Tapsilog - awesome bang for buck at $5.49 with tea. I tried my friend's dish and really appreciated the garlic rice that it comes with.  Barbeque Pork - against my better judgment, I got two of these. They are kind of left sitting, along with the rest of the meat trays, in a warming tray at the main counter. They tasted okay, but were a little tough, and ultimately NOT worth $2.80+ a stick.  'Chicken Dish' - it was okay. Portion size was lacking, flavour was decent.  SERVICE I might have caught them on a bad day, less than an hour away from close - but we weren't getting much help in terms of what to order, what the pricing consisted of, didn't catch that some of the meals (all day breakfast) came with a tea until we prompted them, and there was an overall general slowness. I ended up just pointing at what I wanted since they weren't very clear on what was what (hence the 'chicken dish???' above)  I think it might be better to come during lunch - I expect the pace is quicker there. (On the other hand, it might be that they focus on their 'regulars' who already know their menu inside out)."}
{"text":"Not impressed by the amount of food I was given for Combo 1 (rice + 1 hot plate item + 1 can of pop) for $6.75 + tax. I got the pork skewers, and they gave me 2 decent sized skewers in a rectangular takeout box half filled with rice. I mean, I don't eat much rice, and I easily ate all of it after having two bowls of soup at home. I can see many guys would need 2 boxes this size to be full.   That being said, their pork skewers are easily among the best I've ever had. They're the perfect balance of meat to fat and the fat is crispy, not just oily. The meat has a smokey, sweet flavor and while it is not ridiculously tender, it definitely isn't dry. The sauce is incredibly addictive and now I'm frantically searching up recipes so I can try to make my own. As @Nerissa W said, the skewers are now $2.35 each. Next time, I'll come for the skewers and skip the combo."}
{"text":"Food here is great. I'm glad I accidentally found it on the way to a Chinese BBQ place. Their portions are generous unlike other Filipino \"turo turo\" places. I really liked that they packaged the rice and the \"ulam\" separately so that it wouldn't spill in my take out bag :) will definitely stop by here again. Totally hit the spot for dinner tonight :)"}
{"text":"For some authentic Filipino food, go to this place. It's a tad hard to find but it's at the end of the complex it's in. The service was great even though we went about an hour before close. Food was tasty too. I ordered the Tocilong, which is a part of their all day breakfast menu. I also tried this odd sparkling tea drink they had, definitely would recommend it."}
{"text":"When in Rome do as the Romans do.  This place was in walking distance to where I'm staying so it seemed like the perfect opportunity to meet a close family friend for dinner and as she's from the Filipino, I thought I would broaden my cultural experiences.  Happy Tummy serves food servery style as has been my experience in the past. It makes it easy for me to just point to stuff and say I'll have this and that (having no clue what I'm eating).  Atmosphere is very casual with many tables for two and a. Couple for 4 but no doubt they could accommodate bigger groups.  My friend ordered a couple of items before we arrived. One was a fish and the other a noodle dish. The fish was lightly salted and very mild. Delicious! The pasta was the only thing that was bordering on my spice limit.  Otherwise, we all had rice and Filipino vegetables and a meat fish. Our  Filipino friend taught us how they commonly eat without a knife using a fork to break food apart and then using the spoon to scoop a mixture of meat, vegetables and rice up. Everything we tried was delicious and mild.  For dessert we had a slice of purple cake. Which was definitely my favourite part of the meal (aside from the company). They also have a limited selection of Filipino food for purchase.  Definitely a mudg"}
{"text":"New 2018 prices!!!  Bbq skewers at $2.35 per stick; Still very good.  Breakfast silog-dishes start at $6.99.  They have a few short-order dishes starting at $5.99 and up."}
{"text":"Great and delicious Filipino foods. The interior was very nice and clean. The people there are very welcoming to the guests. I personally love their Sinigang and Kare Kare specials. Definitely going to come by from time to time. Love it!!"}
{"text":"A lot of msg, pricing for the food was not worth it, and I usually don't suggest going to places that sell food and dish detergent on the same shelf.   Edit: dish instead of laundry"}
{"text":"Take out experience for this nice little restaurant that's three months old.  Nice small location with seating for about 10 or so.  I bought a selection of chicken and bbq pork skewers, garlic rice and desserts.  Heated it up when I got home later and I tell yah, it tasted pretty awesome.  The garlic rice and bbq pork skewer especially!    After that, I went straight to the ube dessert and that was good but the cheese polvoron things - those were really good - I had to stop myself from eating the whole container.    Now I know why they call it happy tummy."}
{"text":"Hard for me to believe several of the reviews below, especially when the first 3 reviewers only have 1 review (this restaurant).  i tend to not give 5 stars and 1 stars unless it really is flawless.  Litterally \"As good as it gets\" as YELP's intended description is.  I find many reviewers abuse this and anything that taste edible can get a 5 star.    I trusted Hazel's review and went to try this place.  First, i noticed that there was no real menu.  i had to ask for what combos were available .   The employee working there explained very quickly and briefly (no prices mentioned).    I told them i wanted 2 Skewers, and 4 lumpia.. she said one combo? (i was only one person so yes.... as she looked over her ipad looking confused and not knowing what to charge me...  the bill came to 15 dollars.  I had no idea why.. but i did not want to complain since i did not know what the prices were since there was no menu.(for some reason i was charged for 2 combos.  1 for 5.99, other for 6.99... makes no sense.    15 dollars for 2 skewers, 4 tiny springrolls size of my index finger and white rice. The receipt mentions dessert but NOPE never got it..  i litterally left the place hungry... 2 skewers and 4 mini springrolls for 15 dollars is just ridiculous.  The staff should have a menu with prices.. and also trained on how to use the system.  I dont think i have ever felt so ripped off ..  the only reason i am not giving 1 star and the restaurants redeeming factor was that the skewer (Pre-made and grilled) did actually taste good.    In my honest opinion, it would still only be a 3 star even if i wasn't ripped off."}
