{"text":"I cannot believe how good other people rate this restaurant. I don't know about late night, but dim sum was absolute garbage.

I'm a Chinese, we go for dim sum almost once a week, trust me, I know what dim sum should taste like, and that WORMS don't belong on the plate.

The steam pork ribs were very poor, super fatty and oily, the deep-fried twisted dough wrapped in vermicilli roll was half the size as other restaurant's, and it looked and tasted like it's been sitting out for an hour. The dipping sauce that's supposed to come with it was also gone. The tofu dessert on the cart was uncovered and they were travelling around the restaurant since the begining of time and probably the rest of eternity. (tip: Never order dessert from a cart. If it's covered, maybe) 

We then ordered a plate of noodles with mushrooms and veggies on top. Mushrooms were undercooked and tasted bitter, veggies tasted stale, and I found a FRIGGIN WORM on the vegetable. We looked very closely and the 4 of us came to a conclusion that it was a worm, so we had the waitress came to take the plate away. She came, took the plate (without appologizing), went to the kitchen for a minute, then came back out, told us it wasn't a worm, but 2 strands of hair moss (an ingredient that looks like hair) got stuck together. Do we look like friggin idiots? Of coz, I took couple pictures of that \"hair moss\" and I will post it here and you can see for yourself.

They did not apologize or give us any compansation for the gross experience. The meal ended up being $31.57, I paid $31.57. I will never ever go back, and I won't recommend this place to anyone. It's over priced, bad food, bad attitude. Go to Silver dragon / Happy Hill / Forbidden City / Prince / Cultural Centre / New Asia. Much better (& clean) food, service with better price!"}
{"text":"My fiance and I were new to this city.  We asked a Chinese woman we ran across  to recommend a good Dim Sum restaurant.  She suggested that we try the Harbour City Restaurant.  The atmosphere inside was just okay.  It was a little bit dark and dingy, but not all that bad.  

The food turned out to be pretty tasty and the variety of food was decent.  In addition to their tasty food, the service was pretty darn good.  The manager was friendly, helpful, and very service oriented.  He kept coming back to our table to make sure we had enough tea, water, napkins, and etc.  I would recommend this restaurant because of the tasty food and good service."}
{"text":"Located in the heart of China Town, Harbour City is one of the top late-night chinese food spots to go to.

Whenever I visit I am usually with a group of friends, and let them hack at the menu. But our staple dishes are the ginger beef and satay beef, and we always start with dumplings. (RE: Andrew D and Kenny M reviews for full breakdown, LOL).

One thing that I like about Harbour City is that their dishes are no-nonsense. If I order satay beef or ginger beef, I get satay beef and ginger beef. Most chinese restaurants out there try to convey the illusion that you ordered a large dish by beefing it up with thick veggies like brocolli, peppers, and onions, making that actual dish 50-75% proportion of what you actually ordered. If I wanted veggies, I will order that S#$T!

This place is not for hardcore animal activists, there are shark fin displays right at the entrance. Now that is some kung-fu badassery!"}
{"text":"Hello best Dim Sum in Calgary. Now this is obviously just personal opinion, but this is some of the best Chinese I've had outside of Guangdong province. This is where I always drag people when I get to choose a lunch restaurant.

My favourites + those of my esteemed lunch partners:
The Ha Gao (steamed shrimp dumplings) are delicious, flavourful and not overly large. The Chicken Feet are decent (my friend says delicious, but I'm not a chicken feet kinda girl. I've tried them and they were palatable. which is more than I thought chicken feet could be.). The salt and pepper squid is bar none the crispiest, most flavourful and properly cooked squid in the city. 

Anyways, this place has excellent value for delicious fare."}
{"text":"The reviews for this restaurant are really good to great, but I thought it was just okay. By no means terrible, but the food is not remarkable.

I ordered delivery and got the ginger beef and lemon chicken, with mixed vegetable fried rice. The ginger beef was tasty and I appreciated that the dish came with red peppers and onions. The lemon chicken was pretty standard. I felt that they dropped the ball with the rice. It was sort of bland and the vegetables tasted too frozen food-ish.

While I liked the food, I think I may be continuing my hunt for a good Chinese delivery place."}
{"text":"This was a go to place for me and my grandparents when I was young, I like the food over there. So every time I visited back in Calgary, I go back to Harbour City and just take a trip back to memory lane. Its a great place to go if you want some decent dim sum. I think if you haven't been here yet, just give this place a go. You may find yourself another spot to go to for dim sum."}
{"text":"This place gets my vote as one of the best chinese places in calgary! Now i dont just throw out 5 stars to any old place, only to the places that deliver all the goods, stand out from the crowd and stay clear of producing mediocre food. I have been to at least 20 different chinese places (in calgary) over the years and I tell you this place is in my top 3 of all the chinese restaurants I have been to. Harbour city has some exceptional food and quite frankly I just can't think of any other chinese place in Calgary (other than Bills peking house! review coming soon!) that is as consistent and that has as many home run dishes that are always fresh, well prepared and downright delicious. 

The Ginger beef stands out from the crowd, also the sate beef is excellent! many other great dishes to! too many to talk about here! This is one of my go to chinese joints in Calgary and if you are a fan of typical western chinese food you will LOVE it! 

The service is great! right on par, it is usually very busy ( because its so good!) so sometimes the waiters can appear flustered and be a bit overwhelmed by the rowdy downtown crowds that turnover all night( it stays open rather late!) but on these occasions any minor defects in service are quickly erased from your mind once the food arrives!

 It may be a little rundown, but in this paticular case that is part of its charm. The prices here are also very reasonable, and they don't chince out on portions either! in fact I would say they are more generous than most places. Highly recommended joint to check out!"}
{"text":"There is no better place to go for late night eats than Harbour City!  Home to possibly the best Chinese food in Calgary, I have been to this place many a time and never been disappointed.  Oh do I ever love consistency.

Stand out dishes include ginger chicken, satay beef, Shanghi noodles, special fried rice and cream corn soup.  Added together and you get a night long steady assault on your taste buds.  

The service is right down to business, in and out, with the dishes all of a sudden layed out before you.  And thats to say the same thing for the decor...nothing fancy but who cares when your given a quality meal.

Also a great place to have large gatherings.  

I'm pretty sure if someone asks me where to go for Chinese I would say Harbour City without even thinking about it!  Cheers!"}
{"text":"Visiting Calgary for business. Read some online reviews for this place for dim sum. The dim sum in Houston is acceptable at best and shameful at most. I ordered some siu mai, some har gow, and sesame balls to go. When I got back to my office, I didn't have my balls in the sack! That's the last time I ever leave a restaurant without my sesame balls! Anyways, the siu mai was excellent, even after walking through the snowy afternoon to the train and back to my office. The har gow was excellent was well. I am definitely going back for more. The restaurant seems a bit run down and dreary interior. But it is perfectly suited for large groups and family for fun."}
