{"text":"Legit place for good cocktails and conversation. I met Chuck ( I think that was his name) the other night and he was WAY passionate about cocktails. He knew history, geographical info etc. What a stud! Nice bourbons and whiskeys."}
{"text":"I want to bring everyone i know here forever in my life!Ilove it here,the food is amazing!!!!This place is awsome! I love the cheeseburger,thanks..."}
{"text":"We just randomly decided to have lunch here. To be honest I was not expecting anything spectacular, it is in a hotel in Tempe. We walked in and were the only people there around 12:30pm. I thought \"Uh-Oh\" bad sign. We sat on the lush patio and the service was prompt. The employees were extremely friendly and offered their opinions on what was best to order. We started with the baked brie. It was good and served with a bunch of fruit. For our main course we had the roast beef sandwich. It was FANTASTIC. Everything was fresh and delicious. The frys it comes with are completely addictive covered in Parmesan and parsley. It was a great getaway from the noise and crowds of Mill Ave. I will be back soon for lunch and would love to try the dinner."}
{"text":"My wife and I ate here recently and really enjoyed the experience, service and food. I recommend the flat iron steak with stuffed chilli"}
{"text":"A word to the wise: skip this place.  You are in downtown Tempe with so many good restaurants. We found the service slow even though it was not crowded. (hint: a restaurant with no patronage when you visit is a tip to keep moving.)"}
{"text":"I was tired and hungry, without a car, and staying at the Tempe Mission Palms. Had a Caesar salad, the New York strip, and garlic mashed potatoes. The salad had no detectable Caesar-like taste. The NY strip was maybe half an inch thick, topped with a brown gravy, but at least was cooked med-rare. The potatoes had no detectable garlic taste, and though I was a party of one, they still gave me enough for four.   Next time I stay here, I will be well-rested and have a car. Or I'll get a cab or Uber. Or I'll walk somewhere. Or I'll just get something from the vending machine.   But I do have to say that service was good. Nice staff."}
{"text":"I enjoyed eating here. It was my first night of training and it was inside the hotel Tempe Mission Palms. The service was good. Food was delicious. They were out of several items but I had the Ancho Chile Salmon w/ polenta and asparagus and I loved it. Great flavor! I also enjoyed the Mango Avocado Salad which was refeshing and delicious. The desserts weren't great plus they were out of the two desserts our table mainly wanted. Not to big of a deal but never good to run out of food. I would reccommend anyone staying here try it out."}
{"text":"My husband and another couple from Tempe ate at this restaurant tonight.  We were absolutely delighted.  First of all the service was superb.  Two of us ordered their 10 oz. filets which were fork tender and came in a delicious dark colored peppercorn sauce accompanied by asparagus and potatoes/or carrots.  We all had a dinner salad which was plentiful and very tasty.  The balsamic dressing was delightful.  One of our friends ordered the blackened salmon and the other ordered the ribeye steak.  They were both very pleased with the food and the way it was prepared.  We did not get dessert.   We have already discussed going back soon.  We were very pleasantly surprised.  If you park on the sides or the back you don't have to valet park.    Give it a try, you won't be disappointed.  Oh, one more thing is that this restaurant  is very close to the light rail line."}
{"text":"Hidden on the west end of the lobby floor of Tempe Mission Palms, Harry's is a very open and bright hotel bar. There's plenty of tables, both high-top and regular. There are also a few couches and tables right outside the lounge that you can meander to w/ your drink. There are also plenty of TVs for your enjoyment inside, and just outside of the bar area.  Their basic menu is available, as well as a decent selection of spirits. A few taps, including some local brews. We went right before closing (midnight) and were served promptly. And ill warn ya, that closing bartender pours a st-rong drink.   The service was good, and the price is right, for a hotel bar."}
{"text":"I've been coming and staying at this Tempe Mission Palms hotel for years. The restaurant Harry's, was less than stellar service tonight. The food was fair. Prosciutto wrapped chicken - DRY. Two on the waiters staff, smaller crowd with other 4 person groups and I was essentially ignored as a SOLO diner. This was annoying. I waited almost 40 mins. to get my food. And, getting a simple glass of ice water wasn't anywhere offered or insight. The only saving grace was the manager complimented me a cocktail drink and apologized for my expressed justified dismay of being ignored. Disappointed tonight. I'll give them another chance in the future. Service in this country has taken a back seat though. Hardly, no one wants to give it!"}
{"text":"I was in town for the Triathlon Business International Conference and Scott and his team went above and beyond the call of duty. They took care of me with prompt service and made me feel right at home."}
{"text":"Harry's is a NO.  I am often leery of restaurants in hotels but I thought in the Mission Palms it should be safe.    I stand corrected.  Giving credit where credit is due, the service was friendly and attentive throughout the meal although at this point I am wondering if there was some duplicity going on here.  I'll return to that.  I had the fish & chips.  It was both soggy and overdone.  To accomplish this you first have to cook it too long.  Then to get rid of the crispiness you have to cover it with something and let it sit a few minutes so that the food gets moist from condensation.  The fries were lukewarm and soggy.  After I ate I excused myself and went to the restroom to use some floss because the overdone fish had stuck between my teeth quite generously.  Uck.    But here's the real rub:  They added an 18% gratuity without saying anything.  In the semidarkness of the outdoor seating area I did not catch this and added in another roughly 18% tip.  Later as we were heading home and talking about dinner we realized it seemed kind of high.    We'll be addressing the bill with the restaurant and contesting the charges on the credit card.  In the meantime, be warned.  Seriously, wtf?  Oh and parking is valet only and they were pretty disorganized.  Update:  they refunded the charges."}
{"text":"The place is alright. Medium sized. There are a couple tv screens that show sports games and a bar towards the back.  I came here with a bunch of people so we shared a few dishes - the ravioli, chicken tenders and fries and quesadilla. Not impressed with the food; it was all dry and average quality.   Service was pretty good though. The waitress and manager made sure we were comfortable and had everything we wanted. Convenient location I guess? But other than that, ehhh.."}
{"text":"The food was good, Service was a little slow. Reasonable priced, and pleasant personnel.  Nice for a leisurely visit or meal, but don't go there if you are in a rush."}
