{"text":"Wondered in here after a nice lunch nearby. Even before walking into the store we saw rotten watermelons in boxes sitting outside the entrance. It didn't get any better when we walked past the fruit section - check out my pics for their cantaloupe and apple offerings. Moldy bread in the next aisle, and the staff didn't seem to care either. 

At the prices they charge, I'm surprised that some of their stores in such conditions can still stay in business. Or maybe I've gotten the cause and effect the other way round"}
{"text":"The production selection of Harris Teeter is 5 stars, but the services of this specific store is horrible. Most of the employee here are lack of basic human interaction skills not to mention good customer services skill."}
{"text":"I recently relocated to Charlotte from Columbia, SC. Harris Teeter is okay, but I  have to say I am really missing shopping in Publix.  Every time I went there I felt welcomed and appreciated.  The employees not only go out of their way to greet shoppers, but personally take you to any item you may be struggling to find. AND, you normally don't even have to ask for help... they seem to have sonar!
I live in Uptown and walk to the 6th Street Harris Teeter location most often; but since their selection is limited, I go to the East Blvd location when I need to do a bigger shopping trip. I have been disappointed that every trip i have made there, three or four items on my list have been unavailable; either out of stock, or not carried.  Getting assistance seems to be difficult as well.  Last visit, with two different items, at two different areas of the store, I was passed off to several different people when I asked for help.  
I had to go back to Columbia for an event recently  and was elated to have the opportunity to go back to Publix."}
{"text":"Fantastic! Quick morning grocery run on the way to work uptown. No hassle and the parking deck ROCKS when it's raining. Great salad bar and fruit is so satisfying every time."}
{"text":"Not your typcial Harris Teeter- It is very small and has limited items. It is good if you need a quick fix on milk, butter, eggs. But if your looking to do some serious shopping I would recommend going to another the Teeter on East Blvd. They have fresher produce and meat/fish"}
{"text":"Decent. Since it's smaller, it doesn't have a great meat/seafood selection. But it's great if you have to grab something quick. I'm giving 4 stars because my service is always great!!"}
{"text":"This Harris Teeter is great.  First off the location is convenient, tons of other shopping and restaurants around.  I like how it is tucked away in an unassuming shopping center.  Definitely bigger on the inside than it looks from the outside.  The selection is also impressive.  I can always find what I need for recipes and can get in and out quickly.  I find myself coming to HT often, even though I am a huge Trader Joe's fan and also love Walmart's prices.  The staff has always been upbeat and friendly.  The atmosphere here is just so much better than what you'd get other place.  The main downside is the prices, but sometimes it's worth it for me!"}
{"text":"I'm not sure about why people complain about the prices
At HT?  Publix subs are a dollar more and not as good. If you are a VIP member you get all kinds of great weekly deals like 1.77 eggs!  This is a great little store in uptown with free garage parking (up to 90 minutes) and a giant amount of wine for the space.  The only issue I have is because of the multiple entrances, there are multiple register areas creating flow issues and confusion.  If you live West of 77 I recommend this HT over the BiLo off Freedom."}
{"text":"I don't live uptown but go to this Teet about once a week since it's so convenient to work. It's the perfect place to go when I have no idea what I want for lunch since you can get subs, soups, sushi and snacks. (yes, I like alliteration) Plus their sushi is as gourmet as you can get for supermarket sushi-whoever the new sushi prepper is is awesome, its so pretty and quite tasty and fresh. 

They also seem to have a cart in the back of the produce area of produce that is soon going to meet their demise for super cheap so if you are looking for last minute veggies to add to your dinner-check it out. The sub line gets a little long during the work week, especially on Tuesdays when they have $2.99 any six inch sub so I try to go before noon or after 1:30. All in all, a solid HT choice for the Uptown area!"}
{"text":"Uptown grocery store.  Translation: sort of like a regular grocery store, but a little more wine and cheesy, and a bit of a mark-up.  I am a Trader Joe's regular, so I see myself coming here only when I need a particular brand or have to pick up party food ASAP. Deli selection was pleasing.  Blackberries looked promising, but were sour.  Eh, it could happen anywhere."}
{"text":"Good place for wine and beer. Otherwise, place is expensive. I rather go out of my way to Trader Joes or Target. Not complaining about the quality of their stuff (produce and bakery are usually pretty good), just pricey. Oh, and their front staff act like they really love their job (sarcasm)!"}
{"text":"On Saturdays, during my lunch break, I often stop by this Harris Teeter's deli counter to grab a fresh-made sub. Every day, HT offers a different 1/2 sub (read: 6\") for only $2.49. They offer one cold and one hot per day at this price. Foregoing the bread, I often get the wrap (either white or wheat). For that same $2.49, I can get a whole wrap filled with meat, cheese, and toppings like lettuce, tomato, olives, and banana peppers. It's an awesome, delicious deal that always fills me up 'til dinnertime and, with a wrap, the filling isn't spilling out the sides and into my lap. 

I usually get the cold sub vs. the hot, despite how delicious the hot sounds. Why? I got the Italian sausage and peppers hot sub once. It smelled and tasted SO good...but it was SO messy. Being that I was eating it on the go, it wasn't conducive to driving and the red sauce didn't match the upholstery in my car very well. 

BONUS: if I use my VIC card each time I buy a 1/2 sub, once I've purchased 15 at that special $2.49 price, I get a free WHOLE sub. That's right, my friends. For purchasing 15 half subs, I can get a free WHOLE sub (that's TWO lunches)...and it can be any kind I want; I don't have to stick to whatever their special of the day is. Woo hoo!"}
{"text":"There are major renovations underway. Stage 1 was clearing space by decimating their wine department. This hurt me deeply, but the weeks of 60-70% off was nice. Stage 2 (that's where we are now) has seen the aisles compressed into dark, narrow tunnels and a large space opened up in front of the deli counter. Apparently this has necessitated rearranging all of their products so you can't find anything. All of the customers are wandering around confused, and the staff can't help because they don't know the new layout either. Presumably this is a temporary arrangement while the construction is performed, because it is poorly conceived. For example, there are now 4 drinks sections. Juices in one aisle, sodas in another, cold beverages at the back, and mixers near the wine. Not the wine racks upstairs, I mean the wine racks downstairs. Oh, and some of the mixers are with the party supplies. Seltzer and Tonic are in two different aisles. Srsly.

I suspect that the managers are watching us on security cameras and having a good laugh.

I have no idea what they are building (neither did the guy at the checkout) but my fingers are crossed that it is good."}
{"text":"After shopping at Whole Foods stores in Chicago I was very comfortable walking into a Harris Teeter.  It's quite possibly the cleanest grocery store I've ever been in.  The produce could be better but all in all a great selection of everything.  My only complaint is that it usually doesn't have enough junk food, no Lender's Bagels, and no baked salt and vinegar chips...  Can someone help a brother out?!  :)

HT has a pretty big selection of wine and beer.  For liquor you must visit one of several ABC stores in town.  I know I keep repeating this over and over again.  But it was a traumatic experience discovering you can't pick up the ingredients for some quick Purple Hooters in the same shop."}
{"text":"First, the parking garage smells terrible. Second, the entire store smells terrible. The floor is dirty, the selection is minimal. I walked in and walked out with out buying anything because I felt like I was buying dirty food. Bottom line: sure, this place is great for running in for an ingredient or two for dinner. But if you have a long grocery list, forget it and move on."}
{"text":"This Harris Teeter is convenient, after I leave my shift at the hospital.  Lucky for me it has the salad bar option.

While this one isn't as bright and inviting as other Teeter's in Charlotte or the surrounding areas, it still features the same brands, quality & demeanor of employees.

I haven't been in a while, until today & saw that they're doing some major renovations & remodel.  

While's there's a decent sized parking lot, they share it with other businesses in the shopping area.

Oh, if only I could afford to shop HT regularly for groceries! Right now I just have to settle for picking up a few things, or items that on sale via VIC."}
{"text":"I'm a fan, but only moderately. I can't really say that I see this is \"my HT\" just yet. It works and has everything, per usual. The layout is a bit odd, and I do feel a bit congested near the entrance/exit. Still enjoy the produce section of HT and find this one to be on par with others around town. 

Big plus for having a bike rack outside. Living less than a mile away, I'm prone to get around more on my bike. Working out at the Dowd and then utilizing the bike lanes on East to get home makes this an easy destination for small necessities or singular items for dinner(s). 

I can see this location becoming our regular spot in due time."}
{"text":"This Harris Teeter is tiny and not the best as far as prices and selection, but they have by far the best deli of any of the Harris Teeters I've been to in the area.  I'd eat a Harris Teeter sub over Subway any day of the week, and especially from this location.  Instead of squirting mayo and mustard from a bottle, one on each side, they lather it on with a knife, creating this unbelievably magical sauce that I would eat on their fresh white bread alone.  Add to it great cuts of meat and fresh veggies, and you have sandwich perfection.  However, don't come here if you're looking for a deal because its one of the more overpriced Teet's I've visited. (Which is why it lost one crucial star from me.)   But if you're in uptown and craving a good sub, this is the place to go!  Not to mention it's in fourth ward, one of the most beautiful areas of Charlotte."}
{"text":"I am in love with Harris Teeter! Whenever I am in town I make it a point to visit this location. I like their bar where I can choose fresh sushi. I am patiently waiting until we get a Harris Teether here in Atlanta!"}
{"text":"I love this Harris Teeter. It might be a small one, but it's clean and really nice to walk around in. There's always a friendly cop at the door. Walking here from my apartment on 5th was really convenient. Definitely overpriced, but when you're picking up a few things for dinner, oh well. Their microwave meals section rocks! I always got chicken tikka masala from here for nights when I didn't want to cook dinner. Fab. Garage parking area is small but luckily I never had problems parking. I miss having a nice grocery store so close!"}
{"text":"I don't want to be objective and levelheaded in this review. I don't want to look at the store in its totality and review fairly. I'm so tired of intelligence-insulting prices, particularly for produce ($3 FOR A NON-ORGANIC TOMATO?!?!) I want to rouse the proletariat and storm the place like the damn Bastille, pitchforks, torches and all. I wonder if IKEA sells guillotines.

But no, if I'm to be fair I must recognize that without this Harris-Teeter, I'd be pretty screwed. Since I live uptown and don't drive I'd have to catch a bus or the LYNX for even basic groceries. (Obligatory: Ain't nobody got time for that!) And like all H-T locations, their VIC specials are numerous enough that much of your shopping list will likely be on sale. The trick is this: Abandon all brand loyalty, ye who enter here. You may notice that these VIC specials aren't really deals at all. They just bring the prices down to what they normally are elsewhere. This trickery will probably infuriate you. Take a deep breath and push that rage-ball deep down inside. After all, that eggplant cost you $2.79 instead of $3. How generous of them!

It's strange. There are some deals that lead me to believe they occasionally feel a pang of guilt for their usual greed. Once in a while they'll do a buy 2 get 3 free deal that's fantastic. Sometimes it's obviously to shift nearly expired stuff, but not always. And they do sell shoulder lamb chops cheaper than you'll find anywhere. Credit where credit's due. Finally, if you can resign yourself to sacrifice freshness for savings the H-T brand of frozen vegetables are decent and a good value. But frozen is never as good as fresh. 

\"What about 7th Street Public Market\", you say? Please! Given their meager hours of operation, I'm convinced they run that place more as a trendy hobby than to actually provide goods in exchange for profit. So Harris-Teeter remains a lifesaver for car-free uptown residents. Still, I don't appreciate that H-T has uptown by the balls and seems all too happy to take full advantage of it."}
{"text":"Happy for this Harris Teeter at Uptown. It has everything one can ask for, and it's like a mini Harris Teeter for it small space.

Have to look at circulars for the sale items which are right by the entrance when you walk in the automated doors. 

Right in front are the wine. Great to grab and go with all the house parties and celebrations that I have been recently invited to.

They have good selection of prepared meals and boy do they go fast. 

The aisles are clean and well maintained. Like the samples they have out for you to try out.

Finding parking can be a bit tough. Sometimes driving in circles to find a spot. There are spots near the park or across the street."}
{"text":"I really like this Harris Teeter. Yes, it is always a bit busy and the parking isn't the best, but the folks that work there make the visit worth the fuss! The meat counter guys are always nice and give very detailed suggestions on how to cut and cook your meat (if you ask) and there are always store \"roamers\" making sure the shoppers are finding everything they need."}
{"text":"This is the best HT in the area.  Staff are extremely friendly, they have great selections in all areas of the store.  It is very clean and they have carts readily available up front as you walk in.  I travel an extra  5 miles out of my way out to go to this location.  I find that this store has plenty of up front check staff to speed along the shoppers experience and this is a big plus for me."}
{"text":"This HT is the odd one of the bunch, by no fault of its own. Uptown just doesn't have all the space for the full-fledged HT experience. What it does offer is a very good selection for the fine people of Forth Ward.

Full Deli, Meat/Seafood Counter, all the produce you'd normally find, and even a Hot Bar & Pizza for lunch. These are good, fresh highlights of convenience for such a small store. The dry, non-perishable grocery section is where it starts to get a bit limited. Don't expect to find a ton of speciality items, but its still adequate for your everyday needs.

Parking is... Well it's something. Limited is an understatement and they share the lot with businesses in the same block. I would guess there are less than 50 spaces. Take my advice and do not park anywhere marked no-parking. Even if you're only going to be 'just a minute' you stand a good chance of getting towed. This isn't Harris Teeter's fault, the underground lot has strict fire codes and the property manager is covering his ass!

Great for stuff in a pinch, I would go to the store on East Blvd if you have the time though."}
{"text":"Nice, clean store with a good selection. One of the better Harris Teeter's in the area. The parking area can get very full and they don't have a Starbucks inside this location."}
{"text":"I was in Charlotte for the weekend and wanted a grocery store specifically so I could buy a can of Cafe Du Monde (which I've never seen sold in LA).  I stopped at two grocery stores that did not carry it before I came to this Harris Teeter.  

The parking lot was easy to get in and out of and I had not problems getting a good spot.  The young lady that checked me out was very friendly."}
{"text":"Hopefully with the recent improvements there will be more options. If you need deli meat practice your patience!!!! Slow slow slow"}
{"text":"Great selection of meats, fresh fruits and veggies and it is conveniently located in the heart of Dilworth. HT knows grocery stores!"}
{"text":"If it was all about  location, I'd give this Teeter 5 stars.  There isn't a supermarket even close to this location!  That being said, I find their items to be overpriced and it is much, much smaller than any other Harris Teeter I've been to.  If you want to grab a sub during lunch hours - good luck!  All the uptown businesses in the vicinity are out on lunch at roughly the same hour and the last time I visited at 12:30, there were literally 14 people on line with 2 sandwich makers. 

They are currently renovating.  I do appreciate that there is a lot more room when you walk in.  I hated that everything was so close together in the produce isle!  I am also grateful that there is a parking lot that is totally free!   

This Teeter serves its purpose, but I'd rather drive a bit further to a supermarket with better prices and a bigger selection.  In a crunch, I couldn't live without it!"}
{"text":"The great store in a great location. Great selection on all products. Definitely clean, all of the fruits and vegetables are fresh. I've been using this store for around two years and have never had a bad experience. The staff is always helpful and I've never left the store without something that I came for (most of the time with more than I planned).

Recently I had a great experience, not even grocery related. My fiance and I moved this past weekend and were looking for boxes in which to pack. We called this HT and the manager on duty, Doug, said he would set some boxes aside for us on Tuesday night when they had a delivery truck. I showed up on Wednesday morning and there were THREE SHOPPING CARTS FULL of broken down boxes for me. I was flabbergasted. Not only that, but every employee that was not engaged with a customer came over and offered to help me move the boxes out and load them into my car. I struggle to think of anywhere that I have had better customer service. Five stars all day, every day."}
{"text":"OK, I really like this Harris teeter and everyone is always helpful and polite when I go but this review is mainly for the bakery department. I've assigned myself as the one in charge of cakes for Birthdays and special occasions. Pretty cakes, that taste good, and are affordable; not really easy to find but I managed to find them =) Itzell, the girl that works at the bakery department at Harris Teeter is the most talented and patient girl ever. She is always super, super nice, answers all my questions and accommodates my unusual requests. Everything I have ordered has exceeded my expectations. So I happy I found you. See you soon."}
{"text":"It's a Harris Teeter, so it's pretty awesome, but it's in Uptown, so parking stinks."}
{"text":"After consulting Yelp before visiting, I expected the prices at this Harris Teeter to be much higher than the other locations.  I was quite surprised to find that all the specials and daily low priced items like eggs and peanuts and HT brand cereal are no different than any of the other locations.  HT is not a cheap grocery store, but if you look for sale items you can find plenty of good deals.  I never buy the regularly priced items anyways so I haven't noticed any difference at least.

The location is superb, I can get my groceries via walking or bike, which is something that is certainly rare in Charlotte.  I wish it was open later than 11pm since I don't get out of work until 10pm though.

One problem is that because this store occupies a smaller footprint, there are some items that are conspicuously missing.  I just wish they had the knock-off HT brand of Kashi cereals here!"}
{"text":"Harri$ Teeter is showing some kinks in the armor.....

HT is still a great grocery chain. This location is wonderful and close to the bat cave. The store layout is a bit cramp and the dark decor makes it look even smaller. The selection is still great but the prices are a bit steep for the everyday items.....the cost of Tabasco sauce is an outrage! Tabasco is a staple in my house not a luxury item!

HT I have moved on......but we will always have are special memories!"}
{"text":"Just want to say- if you need a cake or some type of baked goods Gina is the person to go to here! So, I went to a few places and received quotes and feedback for and Engagement ring pull apart cupcake cake. Some places wanted a ridiculous amount of money, others were very uncertain about the gold frosting. When I walk into HT and showed Gina what I wanted she had the confidence and was like, \"I've been making cakes for years I can definitely make this for you!\" Then the price quote was soooo affordable. Loved it so much!"}
{"text":"I really prefer this Harris Teeter to the Central Avenue location. This location is spacious and has a much better selection of produce and already-made food, including a deli counter where they make sandwiches to order. 

They have a variety of wine and beer, plenty of it cold too.  Unfortunately, it closes at 10 pm, like most Teeters. If you're in need of late-night snacks or on a beer run, I'd suggest the 24-hour Harris Teeter at Morrocroft Village on Morrison Boulevard. 

One big plus of Harris Teeters - self-checkout. If I'm just buying a few items, I always prefer the self-checkout to waiting in line for a cashier."}
{"text":"Kind a pricey compared to the near by food lion but way better produce, beer, meat selection, and quality."}
{"text":"Highway robbery! Goodness this place is expensive! 

I'm used to plenty of grocery store options in Downtown Chicago and prices not much different away from Downtown. What's up with this place?

I had to walk here to buy an array of fruits for an office I was contracting at. Almost $3 per apple! Not even organic. That's just bad business."}
{"text":"Super convenient location for me since I live across the street. But just like other reviewers have noted, the staff seems overworked and is always disgruntled, the managers don't seem like they really care how things run, and a lot of times the produce and meats they have are clearly going bad. Most customers seem to mainly go for the subs, pizza etc. I got a slice of pizza recently, the person serving me was literally staring down at the slice packing it up and saw a fly that had been sitting IN my slice the whole time, shrugged, and then tried to give me the box anyways. This is a fairly busy location in the evenings, the parking lot is always packed, and yet it's managed so poorly! I wish HT would have more oversight and get it up to par with their other larger suburban locations."}
{"text":"I'm very loyal to the stores I shop at so even though I was switching simply from one Harris teeter to another when I moved from pineville to south end I was hesitant about leaving my old primary grocery store. However I have to say this Harris teeter has gone above and beyond. I had an incident when I first moved to the area when I was on my way home I had forgotten to get something I needed, long story short I was given bad information but management went above and beyond to fix the issue I had.  The biggest thing that stood out to me is that I didn't ask for anything to be resolved however they made it clear the level of responsibility they were taking for it which was much more than I expected or even needed. The manager made it very clear that she wanted to make sure I was well taken care of and that all my needs were met. I wish I had caught her name as it was honestly one of the best customer service experiences I have ever had.

Since then I have had multiple stellar moments with the staff in this store. Everyone is friendly and seems to enjoy working there. 

They have an amazing selection of items I would only ask for a little broader range of vegetarian/vegan options although they do ok. Parking is a BEAST of an issue! Take your time when trying to come here because the lot is shared with more stores than some small malls have space for."}
{"text":"I also love this Harris Teeter. It's small, but the salad bar is fresh and exciting, and their soup/deli/bistro selection is top-knotch. It's a great way to break up the lunch routine, and it reminds me of grocery shopping in New York City with the little grocery stores and the parking deck. The staff is friendly and helpful, and it's always been a clean, quick, pleasant experience for me in this store. Like all the Harry Peters, it's a little overpriced,but you do get what you pay for in many ways."}
{"text":"HT prices suck overall and I have seen better produce on the sidewalk next to a late night taco truck.  But this location is fabulous being right uptown and super convenient for us city folks.  It was just renovated a little to cram more stuff in which is good because if you cook a lot like me, you need variety!

You can park in the lot outside for free but there are only 3 or so spaces.  It is easier to park in the parking garage on Pine under the building.  Be careful of the spots there tho since only some are marked for the HT.  

 The beautiful people shop here that live in Fifth and Poplar so dont forget to wear makeup and leave the curlers at home!!!"}
{"text":"There are a few reasons why I totally love this Harris Teeter.  First off, it hits all the basics:  The food is fresh.  The place is clean.  The selection is good.  The store is organized and easy to navigate.

But let's look beyond the basics.  These are simple exceptions for ANY grocery store.  Here's what sets this location apart:
1. Everyone is really friendly.  I can't walk down an aisle without someone saying hello or asking me if I need help finding something.
2. The salad bar is always fresh and stocked.  This isn't your typical grocery store where half the toppings are either gone or look like they have been sitting there for a week.
3. The guys who shop there are HOT!  Ladies, if you're looking to meet someone, I highly suggest you drop a can of soup (or something not breakable) on the floor when a guy is nearby.  It's an easy introduction.  Have I tried it?  No...so let me know if it works.

Downside is that if you show up late, they can be out of rotisserie chicken and the parking can be difficult.  Lesson learned."}
{"text":"This is the closest grocery store in uptown that I know of near lots parking lots. I have been here couple of time and its little smaller than the regular HT but it works. The first time I was here, I had to bring some items for my co-worker's B'day but I forgot and that's when I remembered that there is a HT near my parking lot so I ran. I was in store with in few mins. I asked the casher to locate items and I was out in no time. HT saved my day. 

One time I had was running late from office to home but I knew I had to get some groceries for dinner so I stopped by here again. They didn't have everything I was looking for but enough to save the day again to prepare dinner. 

I also started stoping by here specially whenever I was feeling lucky to get my powerball :) 

Overall, my experience has been great in finding what I am looking for as well as customer service."}
{"text":"First off I'll have to say that I worked at Kroger for 6 years & customer service was always the number one rule that was stressed at every single Monday meeting. HT is owned by Kroger & I'm shocked at the customer service I have received since shopping at this location since back in April. Both problems are with the Deli. Months ago I came in & ordered a philly sub. I just should have rejected the sub before she even started because she didn't clean the area after removing a box & just started preparing my food right where the box once sit. Then my sub was falling apart because the meat was soaking wet. Now today took the cake. I was the only person standing in line to get a sub once again. 4 workers standing behind the counter never even talked to me. They made eye contact & continued with their laughing & conversations. Along with taking out trash. So after a good 5 mins I walked to the pizza area & asked if she was able to make subs. She yelled across the store asking one of the 4 to help me & she was ignored. I literally had to thank her & just walk off. I deal with customers daily at my job. I would have gotten a write up with that type of customer service! I will take my $ to Food Lion or Target for now on."}
{"text":"Much like all other Teeters you will find that the stores are very clean and the cashiers and people working here are much better at customer service than other grocery stores in general.  

I like Teeter for the way they do their wine aisles and the amount of craft beer they normally carry too.  

The biggest drawback to this location is exactly that, it's location.  It's always busy because it shares a parking lot with several other businesses so finding a spot can be a challenge!"}
{"text":"Convienence.  Living uptown, this is what this HT location is all about.  Especially if you are within walking distance.  I will add also that the parking isn't horrible but it's pretty tight spacing and our SUV is a little hard to maneuver in there if it's slightly crowded.  

The offer kind of an express store here, although I've never not found what I needed I know that it isn't stocked like the bigger locations.  It has a deli and a hot buffet with pizza, etc. if you were to pop in for a quick lunch.  

Everything in here is compact so it can feel pretty cramped during your shopping and also during checkout.  While it's an efficient design you can't avoid the smaller feel of the place."}
{"text":"I've always known this was here, but since I don't live uptown I haven't had much cause to go inside. However the other day I got sent on a mission from work to pick up a cake and, I must say, I'm impressed. 

I've heard from my city-dwelling friends that it was small and didn't carry everything they needed, which I suppose if you compare it to a regular HT is true. But mainly, I just see it as an elaborate drugstore, for people who just need to run out really quick and get one or two things. I mean, the whole front third of the store is wine, candy, cigarettes, and cold medicine. I think that tells you what to expect right there. 

For all intents and purposes, you're A-OK, uptown Harris Teeter. Glad to know you're around."}
{"text":"Good wine and beer selection, but crappy hours. HOW DO YOU CLOSE @ 10PM? You force me everytime to go to Bloom (which I don't love, don't hate), but it just rubs me wrong - one of the hippest, safest neighborhoods in Charlotte and you don't stay open till 11 or 12? THAT my friends, is my beef with this HT.

But as always, food is fresh, sales are good, and employees are nice. Store is pretty clean, though the parking lot gets crazy between noon-2pm, 4pm-6pm."}
{"text":"Highly unimpressed with HT, this store in particular.  Unfortunately it's the closest grocer to where I live, hence my go-to for any immediate needs.

Customer service is slow and indifferent, all staff of the automaton ilk.  I view the HT employee culture a throwback to the Winn Dixies and Piggly Wigglys of the 20th century South.  At checkout the same routinized questions conveyed with indifference, no eye contact and most surely, only with management's prodding.  HT competitors like Whole Foods or Trader Joes or Earth Fare seemingly encourage their employees to engage in much more personal (and real) interactions.

Don't buy anything from the deli.  It's not airplane food but it's not quality either.  And you don't even want to know the potentially death-inducing sodium level.

HT downtown should be viewed only as a 7-11, a convenience outlet for beer and other immediate needs."}
{"text":"I went last week and there was not one bag of frozen organic vegetables. I even asked customer service and they insisted there was....so I looked several times and found none. Boohoo.  Not too much organic produce, either.  I used to love HT but I don't care for it much these days. I wish they would encourage reusable bags. Maybe give a few cents back for each bag brought....I think that what Whole Foods does. Why is our beautiful city of Charlotte so behind on this? I have seen HT checkers use a whole plastic bag for about every item!  Argh. All of us need to BYOB!! Bring your own bag!"}
{"text":"Good variety of organic fruits and vegetables and a decent amount of vegan options (soy yogurt, tofurky, etc.)...and wine! A bit on the pricey side though."}
{"text":"Very clean, large selection of foods, mini-carts available, abundant amount of express check-out registers and virtually empty in the mornings. They also have a huge organic produce selection. 

Note* - if you are driving east bound on East Blvd (making a left into HT Parking Lot), be prepared to wait a little while during rush hour. It can be a nightmare trying to turn in. You might be better taking a different way so that you can make a right into the parking lot."}
{"text":"I need to start this by saying I really haven't met a sandwich I didn't like; HOWEVER, nothing compares to the $5 sub Footlong Fridays we all get to enjoy from Harris Teeter. Yes - ALL footlong subs are $5!

They use delicious Boar's Head meat and the three cheese sub roll is on point. Each time I make it to Harris Teeter on a Friday and grab a sub is automatically a better Friday. Avoid the lunch rush and go in the morning or late afternoon - more often than not, I'll get 2 subs that I can enjoy for the next few days. They are really THAT good."}
{"text":"So for Thanksgiving 2011, the standard food items were needed and Harris Teeter came through with flying colors.  

I even needed a pan for the turkey as it seems the one we had didn't make it in the move.

They had it all and at a good price too."}
{"text":"So another week and another shopping for food...it is great to have a grocery store in the city and one that I can walk to like this location.  Plus, of all the stores (baseline grocery stores...not specialty like Whole Foods, Fresh Market, or Trader Joes) this is my favorite."}
{"text":"If you live or work uptown, it's super-convenient- a short walk from any of the main office buildings along Trade or Tryon and just steps from your front door, especially in Fourth Ward.  It's smaller than regular Harris Teeters, but re: the post above about this store being similar to shopping in New York City- come on, this is way way nicer than any grocery store in NYC except maybe Whole Foods, and much larger than nearly every grocery store in NYC.

ETA: The store has free Wi-Fi and places to sit (upstairs), with tables."}
{"text":"I love this Harris Teeter! 
They have a salad bar, Asian bar, pizza bar , and the usual hot/cold subs and sushi! I have only tried the Asian , Salad, and Sushi so far. The Pizza bar is next on my list. The parking lot is annoying though, it seems way too small for all of the businesses they have over in that area. They also have a I guess a convenience checkout line somewhat near the door for if you just have a few things and want to run in and out."}
{"text":"This place is small but the service is pretty great. 
They'll run out pretty quickly but get the rain check and move on. 
Free parking garage with a marked time limit of 90 minutes or so. 

Close enough to the nail salon and the Vue. 
I wonder how things will go when Whole Foods makes it near South & Caldwell. I suspect they'll have an impact but not much since this is the closest thing to saving money when you don't want to buy restaurant lunches or simply forget."}
{"text":"A little story... there are two self checkout kiosks by the 6th street exit and one was out of commission.  There's a checker that is standing around to supervise and help customers that need assistance with self checkout.  And by the way... no checkers are manning the regular checkout desk.  Wouldn't a competent manager... you know... move that person to man regular checkout because professional checkers are inherently faster than customers at self checkout?  

I get that there are tradeoffs at this location (namely price and limited selections) for the convenience of being in uptown, but there have been far too many long checkout queues because of management incompetence that can easily be fixed.  The only saving grace to this location is their chefs put out some decent sushi and the staff are generally friendly.  Aside from that, this isn't a great store."}
{"text":"This is my go-to Harris Teeter when I have lots of shopping to do, because it's like triple the size of the HT near my place in Gateway. This is a great supermarket with friendly, helpful employees and pretty much anything you'd ever want at a store. I go here all the time, and if you're near Dilworth at all, you should too. 

What I especially love about this Teeter, aside from their selection (which is top-notch; you literally can get any food item you'd ever need here), is that it has other products you might not expect--namely, a Coinstar machine (yes, I use Coinstar...it's great for that spare change collecting in your car/kitchen) and a selection of carpet steam cleaners, and that sort of things. I come here for all sorts of random appliances."}
{"text":"For those of us who live in the Uptown Area, this is THE place to head to pick up foods and supplies. It's a pretty standard grocery store, but it's great. They've got everything you need, which isn't all that surprising--what else would you expect from a huge store like this? 

Great selection of fresh produce, some of it locally grown. Incredible selection of beer and wine--usually with some great deals on both. This Harris Teeter also has a popular sandwich bar, with sandwiches made to order, that gets really crowded during lunch time (probably because it's cheap and quick, and pretty high-quality). Pretty decent grocery store sushi area, and a really good selection of meats and fish--especially the fish. Super friendly staff, too--always very helpful."}
{"text":"Though there are plenty of larger HTs in the area, this one is pretty convenient and clean.  Haven't really gone in this one much, but the times I have - I've found what I was looking for pretty quickly and was out of there in no time.  The one thing I hate about grocery shopping is waiting in line if there aren't enough registers open - this one doesn't really have that problem - either that or I tend to go at the right times of day."}
{"text":"This store used to be my go-to store but since changing my diet, I've strayed a bit to the natural foods stores. For convenience items I found myself in the other grocery store in Dilworth but after many visits there of being unsatisfied with selection, self-checkouts and being bribed with coupons to return, I find myself returning to this store for some items.

HT might be a little more expensive but you know you are getting quality. Your produce lasts more that a day or two. Customer service is much better here and self-checkouts work every time! Someone is always watching them so if there's an error, it is corrected immediately.

When I go to the normal registers I usually bag my own groceries. Did you know that if you lean up against the vinyl bumper at the bagging area that it makes the wheel spin?  Kind of a neat feature so you do not have to reach across all the time. You item comes to you. What will they think of next?

Other great things about this store, the pizza bar (it's buy 1 get 1 after 7pm), the olive bar, salad bar, hot food bar... They also make sandwiches here.  The meat looks fresh. The aisles are wide enough for 2 carts to be side by side. Aisles and ends are not cluttered. 

The only improvements this store needs is better placement of the local craft beers and better parking."}
{"text":"If you're in a hurry or like decent (decent, not even \"good\") customer service, don't go here. The cashiers are slow, using the self check out is even slower, and the people who make the subs either don't speak to you, don't make the subs how you ask, or take ten minutes to make one sub. This location should be great for those of us who live uptown, but my boyfriend and I have been driving to the East Blvd or Plaza Midwood HT's lately for better service. Also, since seeing a fly crawl INTO one of the rotisserie chicken boxes in the open air heating area, I've been turned off by this location. Gross. Do better, uptown Teeter."}
{"text":"I use to go to this Harris Teeter a long time before they remodled it, before the bank of america came about.  I went in there today because my grandma wanted something.  I was absolutely impressed by the view.  I'm not sure when the remodling was done, but this was my first time seeing this.  It took me by shock to see that the two stores beside it were no longer there.  Any who when I went inside I was like wow this is beautiful.  I was really impressed by the pizza shop, I can't say that my normal harris teeter has this to offer so it was nice to see this shop and the others as well.  I enjoyed the pizza very much and very cheap also.  Point is, I enjoyed seeing the beautiful new and improved harris teeter that's probably been this way for some time....lol"}
{"text":"Worst supermarket I have ever been to. Bought a gallon of milk that was spoiled. They never have any fruits like strawberries and bananas. And everything is way over priced. Publix and/or Walmart are 100 times better. I wouldn't step a foot into this supermarket if I didn't have to. Unfortunately for me it's the only supermarket I have less than a minute away."}
{"text":"Convenient if you live Uptown, but expensive.

I've lived Uptown for almost three years now and have been shopping at this Harris Teeter because it's so convenient to walk down the block and pick up just enough groceries for a couple days. It's also open until 11pm - the HT in Plaza Midwood is only open until 9-ish I think - so it's good for last minute drinks or desserts. This location can get overcrowded, but I'm starting to think that's Harris Teeter's corporate strategy (not quite enough retail locations for the customer base).

While most of the cashiers are friendly and the on-duty police officer is friendly, I wish it were easier to get a little customer service on the grocery floor or at the deli counter (basically anywhere outside of the checkout lane!). I really think the quality of employee at this store has suffered over the past 1 - 2 years. There are rarely employees roaming the aisles offering to help and it's near impossible to get the employees behind the deli to help you with fresh meat, cheese, or a cannoli. They'd much rather chit-chat behind the racks of bread or roast chickens. Perhaps they only like to deal with customers during the lunch sub rush? I did try to bring this concern to a manager's attention once, but he didn't offer anything to correct the situation other than an apology. He didn't even offer to go get the product I wanted but was unable to pick up (behind the deli case). Interesting, huh?

I give it three stars because it IS the only grocery store Uptown within walking distance (monopoly!), so I've been unable to break free of it's clutches. Looking forward to the remodel - maybe they'll remodel their customer service expectations."}
{"text":"Nice, convenient location in uptown. I went in just to see what the deals were and what was in the pre-made entrees section of the store. There was a pretty good selection but nothing that really grabbed my attention so I walked out and went to a more appetite appeasing restaurant."}
{"text":"I really like Harris Teeter.  Since this one isn't the closest to where we live, I felt that I could provide an unbiased review.  You definitely still find your great VIC specials here, which was the best way to shop.  Overall, their prices run a bit higher but their produce and deli selections are much better than Wal-Mart, Food Lion, etc.  As usual get your non-perishables at those cheaper stores but your specialty meats, cheeses, and produce at a Harris Teeter.  Also, if you have the luxury of having multiple ones nearby, you can actually find they have different items at different HT locations.

The only knock here was the parking as they share it with multiple shops.  Situated in Dilworth, it was packed and I don't imagine it to never be due to the \"fresh food\" vibrancy of this area of town."}
{"text":"A friend of mine astutely pointed out that it seems as if there are Harris Teeters on *almost* every corner in Charlotte. Well, maybe. But this HT falls squarely in the A-OK category for me. 

The good: A diverse selection of produce, meats, cheeses, seafood, cooking/baking needs in a clean, easy to shop environment. They also carry the requisite amount of cleaning and paper products, too. Your VIC card can score some pretty sweet deals if you shop prudently. Plus, the staff & cashiers are typically helpful & friendly when you're searching for a random ingredient and walking around the store like a lost puppy. (me) 

The meh: Prices, especially for comparable produce, cheese and nuts and specialty products, are (IMO) significantly higher than Trader Joe's. Also, this place can be a total cluster-eff during the weekend or around the holiday. And lastly, the toiletry & bath products aisle is kinda sad. Just go to CVS - you'll save money & end up with a better array of choices. 

I'll continue to shop at this Teeter due to its location, but only for products that I can't find at the local farmer's market and TJ's."}
{"text":"In the world of Harris Teeters this one is by far the most expensive. I know this first hand as I used to live just a few blocks away in the 4th ward. And I'm sure that during my first few trips here when I loaded up the (mini) cart full of groceries that locals were probably laughing at me. Oh, silly girl, she doesn't know that this Teeter sports jacked up prices because it's the only grocery store in Uptown. Hardy har har. 

My grocery bills were always astronomical in comparison with similar products at other Teeters...and all other grocery stores for that matter. But, you pay for convenience at this Uptown location. Free parking, too - so that's a nice option. Well, during the past 3.5 years I've learned a few things and now when I'm Uptown and in need of a grocery item I will go here but only for a handful of items. Save money. 

The selection here is a bit limited (as the small is smaller), but the lunch bar isn't too shabby and the staff are pretty friendly. That goes for the rent-a-cop who usually appears near the door, too. If you're scrambling around Uptown and need a bottle of wine, a handful of apples or a frozen pizza - this Teeter fits the bill. Just don't load up your cart and snag your groceries for two weeks like I used to do!"}
{"text":"Uptown's sole grocery store. Convenient if you just need a couple things, but don't fill up your buggy. It's pricey (even for the Teeter world) and the selection is a bit limited.

If you're in hurry, it's a great place to grab a quick meal. Salad bar, Chinese buffet, sub and pizza station. A lot of options for pre-made meals.

There's also a \"cop\" who stands at the stairs near the door to watch you shop.

One big bonus: I swear, there are more beautiful people who frequent this store than any other bar/restaurant/venue in this city. I've told Rich at Rockhouse Events several times he should figure out how to throw an event here. Every trip I make to this store I curse myself for not wearing make up... and for wearing pajamas.

Also, the guys who work the meat/seafood counter are all really nice and helpful. 

Overall, a great place if you're hurrying and need something. But if you're looking to stock your pantry and fridge... I recommend leaving the 277 loop."}
{"text":"Maybe I'm excited by this location because I frequent it often for junk food and other odd assortments, but I have no complaints about it at all. I don't use it as my primary grocery store, so maybe that's why some people aren't as happy about it, but between my breakfast and lunch binges I enjoy this location immensely. 
They have free samples daily and I realized that Jarlsberg cheese is freakin amazing, so that in itself is worth it for me!! But on a serious note, this spot is fantastic for lunch because of the salad bar, Chinese bar and the soup. I order stuff from here pretty often and then I take it upstairs.
What? Upstairs?? you ask... WHY YES!!! When you come in the front of the store, you will see a set of stairs to your left. It takes you up to the wine section. Well in that little wine section is a set of tables and some bar seating that overlooks the store. (Not bar as in alcohol...) It's actually interesting to sit up here for an hour just to people watch and listen to the music that they play. 
They have everything and more that I could possibly want and they probably get a pretty hefty portion of my pay check... 
If you don't want the hustle and bustle of the restaurants, go upstairs to eat your lunch at HT. You'll feel more relaxed and ready to return to the office!"}
{"text":"This location is super convenient for me as I live right down the street and can walk to it.  It's a great location for your basic staples, but if you're looking for anything else, you'll most likely have to go to a larger store.  I've found myself having to do this more often than not lately.  They do run out of stuff a lot quicker, just because, being a store with a smaller footprint, they generally don't have as much stock on the shelves.  Some employees seem like they really don't want to be there, but most are friendly."}
{"text":"Great store,  buffet is bad old food, but the sandwichs and pizza and selection is great"}
{"text":"Great place to pop in for an easy lunch. This is a smaller-sized HT and I typically only use it for a convenient lunch. 

Starting at 11am there is a salad bar and Asian hot bar where you just grab a container and fill it up. $5.99 a pound for the salad, $7.99 a pound for the hot bar - good prices for a Harris Teeter, that's for sure. There is also fruit and dessert squares at the end of the bar as well if you are looking for a nice finish to your meal. 

You can also grab a sub for lunch and choose your toppings - be sure to check out the daily special to grab a 6 inch on the cheap. They can also do full pizzas or single slices. I've never tried the pizza here so not sure of the quality but know they have good pizza specials on Mondays. 

Both the Asian bar and salad bar are great though and was surprised at how delicious the hot bar was - the items switch up throughout the week as well so you can typically always find something new to try if you go more than once a week. 

I sometimes swing over to the cold case as well and grab a side dish or maybe even a sushi roll... love that sushi chefs are creating the rolls on sight and you can peek over and watch them. And hey, it's no Cowfish or Ru Sans but never expected it to be and give the sushi top notches here. 

I typically don't do my shopping at HT due to the higher prices but love that I can find flavors of brands at HT that I can't find elsewhere and applaud this location for the tasty lunch options!"}
{"text":"The first store I went to when I first landed in North Carolina was a Harris Teeter in Jetton Village. I've been a fan ever since. The lady at checkout was super nice. And it's basically everywhere. I'm really happy that Harris and Teeter built a fantastic franchise.

The one at 6th is a bit different. It's smaller, and not as friendly as the ones in the suburbs. But hey, it's got almost everything. Almost... The aisles are narrower and they don't have everything that a large one would have but hey, it's in downtown and I live in downtown so I understand the real estate numbers. The weird thing is that this is the only real grocery store in the entire downtown area. Sure, there's a CVS in Epicentre and a Walgreens in the Founders Hall but they're not really grocery stores.

They do have all the wines you'd need for dinner at home though. And they also have ice cream so there you go. If only they'd have kimchi and Korean ramen like the bigger ones... One thing I notice every time is that there's a police officer some where near the entrance. One, does it mean stuff goes down in the store often? Two, regardless, it's good to know that they're there just in case."}
{"text":"This store location is much improved from what it was a few years ago but it still lacks many of the items found in a full sized HT. But, (YEAH!!!) they will be expanding soon which means there will be lots of construction and an even tougher time finding a parking spot but it will be worth it in the end. I too was someone who tried out Bloom only to be disappointed in their prices but this is about HT.

I like the selection of fruit & veggies and found many organic options which I loved. The meat aisle offers little more then the expensive Angus Beef options but if you look around you can pretty much find what you want. I have never special ordered meat there but I'm sure they are more than willing to take care of your needs.

The deli section has a great variety of lunchmeats and cooked meal options and even have a smaller sized make your own salad bar. I would love to grab more lunches there freshly made but the parking almost makes it impossible to get in and out and back to work in a reasonable amount of time. 

Their frozen food section is getting much better. I spoke with the Mgr. about 2 weeks ago asking about a new item I wanted to try and yesterday when I went it was there along with another item I had told him I liked but never found in the store. 

If you coupon clip and get the e-Vic card then you can definitely find some great deals. I really like this store and the weekly deals and specials, if scheduled by me right, fit well within my budget. With coupons I saved quite a bit of money on their weekly specials. 

The store is always clean and the service is pretty good and can be really good if you go during odd hours otherwise it can be busy, packed and tough to park. I highly recommend trying this store."}
{"text":"Grey meat and rotten vegetables.  This teeter is a Sub Shop disguised as a grocery store.  The subs are great.  The store on the other hand is awful.  The salad bar looks picked over.  The meat and seafood department is poorly lit, poorly stocked, and poorly staffed.  The store has no life and no flow. God bless the staff who are clearly over worked yet try to make the best of the place with a clear lack of support.  Instead of opening fancy retro teeters, try taking care of the ones you operate.

Btw I love waiting on a twenty minute line for food service.  Then spending another twenty minutes to check out during peak times."}
{"text":"Ok.. I just moved to Charlotte, NC yesterday and I am super pumped.  I am going to Yelp about everything to help out my peoples.  

First, this is a grocery store.. What are you expecting??  Groceries!!??  Oh yeah, they got that.  The price is a little high, but what do you really expect living in a semi major city?  It does have everything though.  Deli, salad bar, BEER, wine, and many many meats.  The staff was very helpful with setting me up with a VIC card.  

I fully endorse this spot.. Use it!

-Ian M."}
{"text":"This is my go to place since it's so close by to my apartment. I wish they would supply more .. just went there the other day and they were out of cilantro and never have short ribs!"}
{"text":"You will notice that...  
This location is more compact than many of the Harris Teeters, and the wine section is noticeably smaller than most of the other HT's.  

I like the way this place is set up.  
You can whiz through grab a few things to complete a meal but I would refrain from picking up things that may not turn over as quickly as other stuff, which leads to my next point.

Do NOT end up making an unfortunate purchase like I did!  
Take no chances on anything that you can't see clearly and are certain is rotated quickly.  I purchased two containers of Gelato that ended up being freezer burnt or either defrosted and refrozen -- not sure.  Ended up being high end trash.   

Service is... 
Quick and the staff is super friendly and courteous.  
I went during off peak hours and parking was plentiful.

Final Note:  Why pay top dollar for items that aren't optimal offerings?  
Be careful what you purchase here."}
{"text":"my heart will always belong to publix, but harris teeter wins my vote here in charlotte.

This location is a good size, organized nicely (though their reorganizing a few months back threw me off for a couple trips), and the woman who is always at the quick checkout on the produce side is honestly the friendliest woman in the whole entire store. The meat/seafood counter is compact and it has become apparent some of the staff is more qualified to answer your question than others, but they always try to be as helpful as possible.

They have a great selection throughout the store (always an unexpected 6pack or bottle of wine), but sometimes their prices on everyday items are just a little outrageous. Plus, with the Target at metropolitan bulking up it's grocery section and charging less for the same brands- I believe I'll be buying less of my food staples at HT in the future. The VIC card specials can be nice, and I have gone and pretty much shaved 50% off my total, but a lot of times the prices are still more expensive than a supercenter. 

However, there are some items I just can't get elsewhere and I'm glad HT makes them available to me... and no one at walmart is going to go out of their way to make sure I'm finding what I need and if I could use any help. So thank you, HT."}
{"text":"Love, love, love this location. It's close to my job so if I need something at home that evening, I can run in early in the morning to make my afternoon commute stop-free. Staff is always super friendly. This morning, they were stocking shelves and were so apologetic for the \"clutter\". One gave me THE nicest compliment that started my day with a huge smile. Easy in, easy out!"}
{"text":"This is my go-to Harris Teeter, but only for the essentials, as I choose other spots for meat & seafood. The selection is good and the service is hit or miss. Overall everything is okay, but I do wish the meat & seafood department was a little nicer, fresher."}
{"text":"Knowing I would be having a late day in the office I decided to take care of a few grocery items during my lunch break. So, with the weather being nice out I headed on my 1st adventure to the uptown Harris Teeter.  Upon my arrival I was impressed that it was fully stocked with employees ready to serve you.  Being a different location than my usual, and also on a hunt for something I am making for a party, I chose to ask the HT employee for assistance. Not only did she tell me what aisle the product was in, she went with me and explained how she had used it.  I finished my list and was greeted at the register where they double bagged my items and I was off.  Very impressed with the options, cleanliness, and service I received.  I will be sure to remember HT when I don't want to deal with stopping on my way home from work.  Now, the only thing to remember is if you put anything in your office fridge, don't forget it!"}
{"text":"Convenient grocery store for Uptown and friendly staff, but what is up with having expired products on the shelves!!!?!!  

This Harris Teeter always has expired milk on the shelves and expired produce (e.g. Spinach).  Management needs to get a handle on things and make some adjustments!"}
{"text":"Four years ago, this was a pretty good Harris Teeter. Since then, Charlotte has gotten Publix and they've had to up their game. This Teeter has done that. It's still bright and clean and has smiling and friendly faces, asking if you're finding everything or if you need any help. It's a great shopping experience.

I like this store a lot. They have a nice deli, a huge frozen section and the cheese bunker is excellent. Beer and wine? Decent. There's rarely a queue at the checkout.

It's still a teeny parking lot."}
{"text":"Smaller footprint Harris Teeter, but they still have everything you might need for a shop if this is your neighborhood. Meat, bakery, seafood, fresh produce, groceries and frozen. My \"larger\" Harris Teeter did not have naan bread, but they actually had a selection of them here, which was awesome!

No free parking here, you're probably going to be looking for a spot on the street."}
{"text":"I go to this Teeter most frequently.  They had a nice expansion in 2012, and the store is always clean. with friendly staff.  Everything is organized well and easy to find...etc. It's no Taj Mah Teeter, but it's closer to where I live, so it wins by default.


Only real complaint here is the parking situation can get messy at busy times, (Not even close to the daily sh*t show that takes place in the Metropolitan parking garage.), so keep your head on a swivel."}
{"text":"The only reason this Teeter is not five stars is because of the fact that it is the smallest Teeter in Charlotte and does not have the amount of product the others do. However, they have all the products I need and at a great price. The best part about this place is the management. I accidentally bought a really sweet champagne. I brought it back to exchange it for a more expensive bottle and management gave it to me for the same price. All of the self-checkout people are very quick and friendly. I am here every other day and it never disappoints!"}
{"text":"Awesome store with great customer service. Discovered this location because it is convenient to my job and had my first experience earlier this week. It was during a very busy time for them due to it being a Super Doubles coupon week but every time I went, it was always well stocked and the cashiers and managers all seemed super happy to be there and help. That's enough to make me drive back to this store on weekends even though I have a perfectly nice one closer to my house. lol Hope it stays this way!"}
