{"text":"THIS PLACE IS IN FACT OPEN.  Great diner style burgers, delicious flavour, sweet sweet staff, great music, cool vibes.  Definitely a place you could hang out at all night."}
{"text":"The burgers are smashed on the flat top just like everyone else does these days. I wanted an old fashioned charbroiled burger. Apparently they are virtually extinct. The burger here was okay, but no different then the hundred other places that offer the same."}
{"text":"I went to Harry's Thursday, April 27th after months of curiosity about this tucked away, old-school 'Char-broiled' burger joint- it put me in mind of independent burger joints where my Dad would pick up burgers and fries for the family when we were kids.     I was not disappointed. Oh, my God. Chef Nate prepared fresh for me the BEST burger and chip shop fries I have ever had. That is not hyperbole, my Son. A tasty, juicy affair with bacon, cheese, JUST the right amount of hot peppers and a sauce that may just cure wounds. I appreciated the freshness of their offerings, and the good nature of chef Nate and his cast of competent, friendly co-chefs/staff. Attend: it was not cheap. But it was cheaper than McDonald's (I make the comparison ONLY because I bought a Filet-O-Fish® combo the week before for close to 13 bucks and was hungry again an hour later)  ...and I cannot recommend you try these guys out more. The burgers are NOT huge- but they are satisfying beyond measure and you will be supporting a business that gives a s@@@. True craft should cost a bit more than crap. If calories weren't an issue I would go every day. By all means, gibbem a try."}
{"text":"I love this place, it's small, cozy, and cheap. Sure the food is not the healthiest, everything is fried, but it's comforting. I love their club sandwich, and their beer is very refreshing. Don't get the burgers, the fried chicken is good but don't expect something like Popeyes or KFC, it's a lightly breaded home made type of drumstick, and it was good for the price. Their breakfast is great, I especially like anything with their fries and peameal bacon. Overall this is a great place for drink and food with a buddy for a nice chat. I always sit in their hallway with the nonfunctional jukeboxes, it feels like some sort of little boat or some little seafood restaurant. The only seafood they have is fish n chips, and that's nice to have as well! A personal favorite in the area."}
{"text":"This place is so good! Walking in it was definitely not what I expected. Decor makes you think your creepy uncle frequents the place -- and he probably does. Menu is small and pretty straight forward. I got a plain jane burger and my boyfriend got the Big Jane burger. I thought my burger was amazing and my boyfriend was really happy with his as well.   Definitely a new place to consider whenever I'm craving a burger. Will be back for sure!"}
{"text":"I don't know who Grant Van Gameren is but apparently the fact that he took over Harry's is suppose to be a thing. A friend told me about the place and frankly I should have known better than to fall prey to the rattlings of the hipster grapevine. Came here with a friend for a burger, grilled cheese sandwich and fries. Really wish I hadn't.  The old diner aesthetic is indeed still very much in place with the decor, right down to the coin operated table jukeboxes. You can imagine an older generation of blue-collar working class folk coming here for a beer and cheap eats back in the day. If you're looking for that vibe you can find it here or many other diners still alive in the city. As for the food...Now, I've eaten in my fair share of diners all across Canada. Some were surprisingly good, others were barely survivable. Harry's food though not toxic (I suppose that's why everything but the fries were near chard black...Y'know...food safety) is also rather bland and uninspired.   My friend's grilled cheese was toasted till black and my burger, what little there was of it, was like a chewy piece of charcoal. I guess I didn't read the menu well enough but usually a \"Banquet Burger\" has things like lettuce, tomato, pickle, onions...Not so at Harry's, I guess near $15 for a burger a little veg is too much to ask. The fries were most likely the frozen $1 per kilo variety that you can find at any nofrills grocery store (hey whattaya know there's a nofrills right next door to the place).   The service I suppose was competent enough albeit done with a nonchalance. I don't think our waitress ever did a quality check with us the whole time we were there. Perhaps she knows better than to ask \"How is everything?\"   When you can have a burger of far superior taste and quality for less than 1/2 the price at the new A&W Parkdale location I can't imagine the retro diner aesthetics of Harry's being worth the trip. Take it one step further you'd be leagues better off at Burger Priest or the nearby Cardinal Rule or The Rude Boy than at Harry's. Unfortunately Harry's food has only taken the worst aspects of cheap diners and brought it to those who are foolish enough to think nostalgia is everything."}
{"text":"The burgers are great here.  Especially the pineapple burger.  Sounds strange but it actually tastes great!  The fries are thick-cut fries and really tasty.  It's a little tricky to find but well worth it."}
{"text":"I love this place! The service is mostly on point. Some servers are more attentive than others but I've never had poor service. The staff are very friendly people!   I've never had a disappointing meal here and I am a regular. My boyfriend and I often come here to have a drink and share some fries. The brunch menu is delicious and the red burger is my personal fave!  The only downside is it's cash only but they supply at ATM in the restaurant for those who don't normally pay with cash.  Come here for a dive bar vibe with awesome music, tasty eats and friendly service!"}
{"text":"You really cannot disagree when someone gives Harry's high praise. If I've learned anything during my time on Yelp, it's that surprises await you around every corner and today, as I entered the divey, dated and colourfully decorated, (read: vintage sunshine girl calendars abound) doors of Harry's a burgerlicious surprise awaited me.  As I mentioned, it's a dive bar, but a dive bar with really good classic diner eats and strong coffee. What more could you want? I feel like 50 years ago business types would stop in for a pack of cigs, black coffee and a burger and it'd be served with a smile by a lady named Flo.  Nowadays, it's dark and seedy, and your burger is served by a hipster named Finn or Liam. But it still holds up.  I did indeed partake in said black coffee but also was amazed by their burger list. I took the path less travelled and ordered a non-traditional but delicious sounding 'Green Burger' which is a chorizo patty infused with spinach served with a host of delicious cooked toppings. Just excellent... like but for real.   I won't say much more, the poutine wasn't poutine but it didn't matter the burger was a rockstar  Eatcrest Out!  CASH ONLY"}
{"text":"We used to come here a lot before it changed management and were so glad to hear it had reopened. We loved it before, but the renewed Skyline Diner around the corner is one of our favourite places, so we were pretty excited to check the new Harry's out - we knew it was going to be a bit more pricey but figured it was worth it.  So - the burgers were great, and physically the place was about the same, which was nice.  But the service was extremely awkward. We genuinely felt really uncomfortable. It took quite a while for anyone to see to us, and when the server did came by she didn't make eye contact or say anything except a barely audible \"all set\". As we placed our order she wrote it on a pad, said nothing and never looked up. I wasn't sure if she had heard anything but too mortified to check.  The rest of our time was pretty much the same. It would have been really awful if it wasn't also kind of funny.  So, if you liked Harry's 'cause it was a nice and welcoming place to be, that's not the same. On the other hand, if you like feeling like you are a gross inconvenience/huge jerk for wanting to eat (and pay $15 for) a burger in a restaurant, hit Harry's up!"}
{"text":"Love this place for breakfast and lunch. Nice mix of Parkdale folks and good tunes.   My only complaint is that the burger is pretty small for 13 -$16$. Yah might want to throw another patty in there Harry or drop the price. You're in Parkdale!  Great fries and nice smashed burger with lots of flavour."}
{"text":"This is the perfect place for breakfast. Homefry potatoes show how much they care. Classic breakfast done right. Merci beaucoup."}
{"text":"Absolutely fabulous hole in the wall hamburger joint. Food and service were great. Ordered the plain Jane.   A new favorite!"}
{"text":"The first time I went it was really good, last night was spectacular. Yes I'm using the word spectacular to describe a cheeseburger. Okay, banquet burger :D Crispy bun, meat was cooked perfectly, giant slathering of delicious cheese, spicy ketchup (I think??), tangy pickles, fries and gravy...(my mouth is literally watering right now). This place has kept its parkdale feel but now full of hipsters...which is no prob as the food is legit and vibe is chill and beers are cold. Check 'er out.  Oh ya...and cash only!"}
{"text":"Were we trapped in the No Frills due to a sudden rain storm? Yes. Was Harry's the closest port-of-call that offered drinks? Yes. Did the run down the alley in a downpour seem like a small price to pay for our immediate freedom? Yes. All this to say we showed up here out of necessity and we had a drink and then as the clouds parted, so did we. Probably one of the cooler places to take refuge in the city."}
{"text":"Recently raised prices on I think every item, some 50% (gravy), 20%+ burgers, 20%+ cocktails. Pretty steep jump for a menu that was only a year old. Yes, I'm aware minimum wage went up January 1st, but did you're overall costs jump in line with labour increase? Very doubtful."}
{"text":"I made the mistake of ordering the corned beef hash.  While all the other breakfasts around me came piled high and on a huge plate, this was a pathetic amount served on a appetizer plate. It said it as served with peppers and home fries but I only received two of each (my friend was even surprised by the lack of potatoes... seriously two potatoes!) and instead a huge pile of pickled onions, so every bite tasted like vinegar. The corned beef was amazing but at $12 it was a huge rip off. Especially seeing this place is the definition of dive bar.  And the service was meh. Very slow. Wouldnt go back."}
{"text":"This place retained a lot of the good things about the original Harry's when it first opened, and their burgers are great, but the prices have gone up every couple of months, nearly tripling in just over a year. Their old neighborhood customer base can no longer afford to eat there, and now it seems they don't even pick up their phone for takeout orders. There's something quite unsettling, or at least disappointing, about a place that has gone upmarket but kept the shell of the original."}
{"text":"Who doesn't like Harry's? Great place for breakfast, lunch and a late night snack. The decor also brings you somewhere else!   However, I think it should be noted that they don't open late on weekdays now, and they only take cash!   Their greasy juicy burger and fries really hits the spot. The service is pretty good as well - lovely people. They have great grilled cheese as well!  They were at Beer Fest 2017, and you could tell that no one was disappointed."}
{"text":"Had dinner here lastnight with a couple of gf's.  OMG the food is delicious had the beef deep sandwich with a chocolate milkshake and then the best blueberry pie I've ever had for dessert.  I would definitely come back here again! The server was awesome.  Place is very laid back love the kitch decore all in all a great dining experience!!!!!"}
{"text":"Breakfast burger and corn beef hash are a must! The best fries!!! Get the gravy and dunk your burger. Love this little gem. Don't forget to bring your cash."}
{"text":"I have lived in Parkdale for over 30 years and have seen the changes (some good, some bad). I live down the street and frequented Harry's. It was a super friendly and cheap place where you could throw some quarters in the jukebox and listen to some tunes (beer was under $4 and you could have that along with a burger and fries for about $12). I always had enough money to buy the regulars a couple of drinks. This place has transformed into another gentrified burger joint where a beer, simple burger (I'm talking patties and some cheese) and fries will NOW cost you $26.20 (CASH - yes my friends, cash only)! There are other options in the area that truly continue to support the spirit of Parkdale. In my opinion this is NOT one of them!"}
{"text":"My friends and I had been itching to try this place for a while and finally popped in last night for some food and drinks. What a blast! It looks a little suspect from the outside, but Harry's has it all. Super faded artwork, harsh fluorescent lighting, scary looking regulars and 60's old diner booths, each with its very own personal (non functioning) wall-mounted jukebox. The beer was cheap, the staff were great and the food was exactly what you'd expect from and old-school greasy spoon. I had the cheeseburger with the works, and my friends had the grilled cheese with fries 'n' gravy. Everything was damn tasty and reasonably priced. Apparently the fried chicken and milkshakes are fantastic, so I'll have to try them out next time. If I had one complaint it would be that it's a little too quiet, they need to get those jukeboxes working, as well as the sit-down Pac Man (!!) game that now serves as a TV stand.  Just one note to Shyni Y above: there are two entrances. One in the alley by the no frills and the other, main entrance is right on Springhurst, hence the address."}
{"text":"Sad to say. Harry's closed on 29 June. The sign says that the new owners will reopen but not when. Looking for a new place to eat now."}
{"text":"I found the place to be really really dirty. There's diner charm then there is filth.  The French fries were nothing more than beefsteak frozen MaCain fries. Awful. The food prices are very high and the menu selection is small.  I won't be returning. Plenty of great breakfast joints in parkdale to choose from."}
{"text":"I found my favourite diner in Toronto, so life is pretty great right now. Harry's is awesome! My partner and I moved to Toronto from Montreal a little over a year ago, and we have been struggling to find a classic diner that we really enjoy.  I'll try to keep this short but, I mean, let's be realistic here. Harry's is one of my favourite places in the city right now. We have been recommending it to all of our close friends and they are loving the experience just as much as we do. My brother and his wife are going out of their way to visit us and I'm pretty sure it's because we keep sending pictures of Harry's menu.   Their burgers are just SO amazing. Unfortunately, I have only tried their burgers because I know that I would be going through intense FOMO if I see someone next to me eating one and I can't have a bite. Also, their fries are just so yummy. They have the perfect amount of crisp!  The only thing someone could \"complain\" about is the fact that they don't have \"diner\" pricing. However, at the same time, you can't blame them for knowing their value.   If you're looking for a wonderful, relaxed experience (with catchy music), you should try it out!   So much love for Harry's. I already know when I'm going next."}
{"text":"I may be biased, as this is the first greasy spoon I have been to in the area - but I like it. I'm actually not certain if it's on Springhurst - it's actually just by the No Frills , at the back end of the alleyway - but the address very well be correct, as the alleyway has no name to call its own.  I'm not going to give raving review on the service-  she wasn't friendly, nice , patient or talkative but she was certainly prompt, which made everything else endurable - since I am, afterall, there to be fed. Seriously, don't expect her to smile back at you - it AIN'T going to happen.  The decor isn't as amazing as the milkshake here - but if you find antiques fascinating - there is a jukebox in here from I dunno when! It completely occupied my attention, even though it didn't work(when I remember to take a pic of this, I will post it- it seems to always slip my mind).  Good size food - seems to be a hit & miss withe flavours, but non the less, completely filling- and I felt that there was value. Milkshake is pretty awesome - I couldn't share it.   It's almost too bad this place came into my life - I blame my friend - because now I have no motivation to cook AT all."}
{"text":"Was looking for a decent charbroiled burger place that was good value and this seemed to fit the bill. Got the plain jane burger which was $12.50 taxes in.  The burger itself was decent albeit a bit small. I was expecting prob a 6 or 8oz party but it seemed like a 4oz. It was as small as those wonder bread burger buns. Fries were plenty and pretty crispy, which compensated for the small burger in terms of keeping me full.   For the price, if the burger was bigger, I'd would recommend this place. Otherwise, I wouldn't go out of my way to eat here."}
{"text":"So apparently Harry's Char Broil & Dining Lounge was recently bought and transformed by noted Toronto restaurateur Grant van Gameren, and although the food is certainly a cut above your typical old-school diner, I was happy to discover that the interior remains just as eclectic and sketchy as before.  We arrived just before noon on a Saturday and the place was packed, but luckily we were able to grab a table that had just been vacated. I perused the menu and quickly decided to go with one of my favorites: the Corn Beef Hash (\"corned beef, home fries, fried egg, peppers\").  The dish arrived shortly after and was piping hot (yes!) It's a lot of food. You get a thick hunk of corned beef atop the aforementioned home fries and peppers, and it works. The beef is typically salty, but that intense flavor is allayed by the sweet peppers. When combined with the fried egg, the whole thing is a gloriously tasty mess. I enjoyed the heck out of this dish.  The cash-only thing is a bit of a bummer, however."}
{"text":"If you are on the lookout for a good burger to satisfy a greasy craving, then look no further... I had the Plain-Jane Burger (double beef patty, cheese, pickles, onion, ketchup) as recommended by my server. It certainly hit the spot, but i'll admit it was a tad small, I could easily put back two of them if i was really hungry...  Side note; if you are looking for an 80's glam rock fix, this is the place for you... :)"}
{"text":"While burgers are still tasty. There are increasingly more and more homeless people sitting here, and prices have gone up from $10 a burger about a year and a half ago to $14."}
{"text":"Terrible service. I had to walk around looking for a employee to take my order and found one sitting down with customers, but she directed me away to someone else. I finally got to order my burger . It came lumped on top of a handful of lousy fries. I was not given any utensils to eat with.And to top it off , they only take cash! Plus way overpriced for a dive bar."}
{"text":"Came here with friends. Looked up the menu online ahead of time to see if they had veg options. Their eggplant parmesan sandiwch has a vegan option. They didn't know whether their bun was vegan and offered me eggplant with tomato sauce as their vegan option. Came with a caesar salad with white dressing and crouton crumbs, didn't bother with that since the staff seemed unprepared for something they advertise on their website and menu. 13.50 for soggy eggplant tomato much and a not vegan salad for their vegan option. Pretty pathetic. And they only take cash. Their ATM needed to be rebooted to take out money. Won't be back."}
{"text":"One of the best place to grab a burger in downtown TO. The location is very low key and hidden behind some building so you will not find place walking on the Parkdale without looking for it.  Don't get fooled by interior that looks like you're back in late 80s-early 90s and scary looking regulars - the burgers that I like the most is 'Plain Jane' and it's very, very good - with sizzling patty and old-fashioned bun that's toasted to perfection.   Old fashioned thick cut fries are also very fresh and crispy. Love how they put the whole thing in red plastic basket too.  It's very close to where I work so this place has became a regular lunch burger spot."}
{"text":"This isn't really the type of place you come because you feel like being blown away by your breakfast. It's dingy, dark, a little shady, but it's got character and a kickass soundtrack. The breakfast is fine, the coffee is ok and the beer is cold. If I could eat a greasy breakfast here every morning, I would."}
{"text":"Easily one of the best burgers in the city."}
{"text":"Great spot. Vanilla milkshake was great, club sandwich was tight, and they serve OV."}
{"text":"I stopped in for lunch here last weekend after walking/driving past this place for the past two months. There's very little in this immediate area so I felt that a pop-in was required.  The space is small and very dated, but these types of surroundings do not put me off and can add to the charm of certain restaurants if done properly, which Harry's does.  The staff at Harry's were always in motion, whether it be taking orders, refilling water, running dishes or making orders.  Regulars lined the bar at lunch while I was there with my girlfriend and with bottles at around $4 and 12 oz draft at $3 it's not hard to understand why.  I ordered the hot chicken sandwich that came with fries and veggies while my girlfriend ordered a cheeseburger and fries. Both plates came out quickly and were piping hot. After we left, I remarked to my girlfriend that the meal I had, while hot and well prepared, lacked any real lasting flavour impressions. She told me that she felt the exact same way about her cheeseburger.  So, if you're in the area then I would recommend checking it out for the surroundings and maybe you'll happen to pick a better menu item than we did. We'll likely be back for another crack at it."}
{"text":"OH man. Harry's burgers are super juicy.. These guys definitely make one of the best burgers in Toronto, and they have an awesome casual   rocknroll atmosphere. If you're not watching your calories, definitely try one of the burgers. They're not the biggest, but they're perfectly sized for a satisfying meal. I need to head back some time soon. Also, they can get pretty busy."}
{"text":"Hidden gem. Old world joint. Half traditional greasy spoon and half regulars' bar... Harry takes care in his food and whilst not fancy it shows as it tasted amazing. VISIT and support these guys..."}
{"text":"I am hesitant to pen this review because, though it's not hyped on Yelp, enough people know about Harry's that at peak times there are already lines. However, my Yelpiness overcame my hesitation, because here I am, about to tell you that Harry's is the best...  Everyone, listen up. Harry's is the best.   It is my favourite diner hamburger, general brunch atmosphere and friendly dark corner to handle a hangover or feed my kid french fries in Toronto, maybe in the world. Beyond breakfast, they're open to 2am and have wicked deals, including an after 10pm burger, beer and shot deal for $20. Not bad, not bad at all."}
{"text":"Harry's is located near King and Jameson in a plaza beside the No Frills/Dollarama. The place is somewhat hidden as you would have never guessed there was a diner there.  I dropped by for lunch at Harry's on a Thursday and the place was not super busy but there were already a few tables eating. I wasn't sure if I was supposed to find the host so I sat down on one of the empty tables near the entrance. The waiter promptly came by to inquire about my beverage of choice and I ordered a green burger.  When the food came, as indicated by other reviewers, the burger was small but the fries that came on the side definitely would fill you up. The combination of the green chorizo in the burger with the condiments worked well together. The fries were also super fresh and filling. Definitely a heavy, greasy meal!  Overall, burger was somewhat small and the prices are a tad high, but I wouldnt mind coming back for more. I heard it gets super busy on the weekends though so come on a weekday if you can."}
