{"text":"I ate a beef don meal set and a Oden .
Beef is not tender enough, feel like the beef is sit outside for a long period of time and reheat when order. The rice is soaked with sauce, unappetizing. The side dishes are average quality. The salad is not fresh. The soup is tasteless.

Oden soup is average quality. Slightly spicy, filling for two person.

The environment is nice. Nice service."}
{"text":"Went there with a friend as it was the restaurant of his choice. It was on a Saturday evening and while it was fairly busy, we were able to get a seat right away. Prior to coming, I looked this place up on Yelp (as I usually do - thank you, Yelp community!) and noticed from the picture of the menu that things were quite pricy but I wanted to try another Izakaya place in Toronto and assuming that this is another store of the same franchise, I decided to give it a try. The atmosphere was kind of nice and intimate, but it was loud and was hard to hear one another.

We ordered creamy pork belly, oden, and salmon lover (I think that was what it was called - it was basically spicy salmon roll). Had to wait quite a bit and they came in two waves.

Pork belly was sweet and a bit salty, but very tender. It was a bit hard to eat but the meat was soft, and the mashed sweet potato went quite well with it.

Oden came with those portable gas stoves so we were able to have it nice and warm. In terms of taste, it was what I expected it to be - nothing special here.

The roll was quite big and longer than I thought it would be. It wasn't as spicy as I thought it would be, but the taste was good.

Overall, they had good food, but as I've said before, they are quite pricy. Not a place I would come on a regular basis."}
{"text":"This has got to be the best bang for the buck Izakaya in terms of price/quality ratio in the GTA.

Must try:

-Creamy Pork Belly (on a bed of sweet potatoes) -----this is heaven if you like pork belly
-Sawara Shioyaki or Saba Shioyaki ($6!) -------fresh fish grilled to perfection



2 Pork skewers for $3? Cheap!
One Donburi or Noodle dish will fill you up unlike other izakayas.

Very good quality here."}
{"text":"I love this place but they recently changed the menu. I'll have to admit my review is based on the old menu, so I'm going to leave this rating on until I really try out the new menu."}
{"text":"Very dark atmosphere (I had to turn on my flashlight in order to see the menu, saw multiple other tables that did the same). 
Very loud music-- I love loud music but you can't even hear what the person sitting beside you is saying. 

Table is so awkward! Super low table in comparison to the seat. 

Food was NOT worth it even if it was free. 

Will not come back here. Period. 

Gave this place a 2 only because my cousin and BF ate the food."}
{"text":"I think people forget that Hashi is an izakaya, meaning that food portions will be small. This is why I never come here with the intention of eating a full meal. 

Hashi has a wide range of options for sake lovers and the food menu is a mixture of Japanese and Korean fusion. Some of my recommendations include their pork belly and ika butter yaki - both go extremely well with a casual drink. 

The service has always been spectacular and everything we order always gets to the table at a decent time. The lighting is a bit dark, so not great for pictures and it could get pretty loud on weekends, so not the best place for intimate conversations. 

I don't know why, but Hashi has a homely vibe that makes me want to come by once in awhile to catch up with friends. I'll be back!"}
{"text":"Good late night grub! Cool ambiance for night out! Busy, roomy, pumpin music, awesome food. Had the spicy sashimi saldad $11, twas good, hamachi Kama $11 delicious yellowtail neck fish with tamarind sauce, and ton toro-shishito (pork neck), not bad, u have to have a tooth for salty food, then it's good. Im definitely coming back for kicks around here!"}
{"text":"There aren't enough good Izakayas in Toronto but thankfully Hashi exists! Great selection of beer, open late, convenient parking, and the food is delicious. 

The Taro chips are a massive portion and good for sharing/snacking on while thinking about what else you want to order. They have changing daily specials and I've always liked the Soft Shell Crab. The pork belly, grilled mackerel, and karaage are all rich and delicious!"}
{"text":"Best okonomiyaki I've ever had! Really great sashimi salad also, I'm definitely coming back"}
{"text":"Tonight I came by with a friend to order a variety of dishes and when one forgot to come, our waitress said I didn't order it but I even remember pointing to it on the menu and orating it to her (insert the 'bitch, did I stutter?' meme here). Not sure how the translation got lost there, but thankfully the item finally arrived and was super filling in size (black Dragon roll) the only thing I would say is they didn't put enough eel to suffice for the price. They make their rolls slightly larger by filling them up with veggies - not necessarily a bad thing but unagi should be the star of the show. 

Anyway, all in all this place seemed similar to other Izakaya's but I wouldn't say I would come back nor recommend this resto either bc there are better ones in the area."}
{"text":"The food is simply delicious! Waitstaff are friendly too. Even though they jacked up the prices a lot, I may still come back if I'm in the area."}
{"text":"This place can be described as like a cross between a bar and a sort of sushi restaurants with the way they have more hidden away seating off to the side (like booths but not really). 

When the restaurant isn't busy you get fairly attentive servers trying not to hover but also not completely out of sight. When the it got a bit busy the servers seemed to only grace up with their presence as they sat another table next to us. 

The food here is always good they get even recommended some specials not on the menu. The special was this creamy clam and bacon udon. I personally am not a cream person but the table enjoyed the bowl. The saltiness of the seafood and bacon helped me to make it through my bites. We also started with the spicy sashimi salad (courtesy of the birthday girl who we were dining with). We also got the set meal of 9 taster dishes which included two pickled Vegs, karage, sashimi plate, pork belly, small down bowl and some other thing I'm forgetting. All items were quite good. The okonomiyaki was full of squid and shrimp, and had a great balance of the cabbage as well. The final item we got was a Unagi don. Not much to say about it, it was a solid bowl of rice eel and seaweed garnish. 

This was our second time at this restaurant and will continue to occasionally dine here."}
{"text":"Came here for an early dinner with a friend and was greeted with emptiness. The entire restaurant was deserted at 6:00 PM which is usually prime dinner hour and for being the only Izakaya near Finch Station, it was a bit alarming to me. Coupled with the dark atmosphere and loud music, I felt pretty apprehensive sitting down.

My friend ordered the udon (which was not bad and had a huge portion for the price) and I ordered the Hashi Sashimi which was 16 pieces of fresh sashimi. The cuts were not bad and the taste slightly exceeded that of an AYCE restaurant but for $18 I was pretty underwhelmed. I wasn't feeling too hungry so I didn't try anything else, but I don't think I'll be back any time soon to try the rest of the menu."}
{"text":"Food was ok. Ordered the dinner set meal which came with miso soup, salad, and two sides. The miso soup was good, and the two sides were interesting. I think one of them was mixed fermented root vegetables and the other was a slice of beet that had been marinated in something and was packed full of flavour. The unagi was pretty good as was the beef don. The karage chicken was bad. Not crispy at all.

For large groups it is automatic 15% gratuity after tax which makes sense. But it wasn't ideal that they could not do separate bills. They said at most they could split the bill into 4 - meaning only 4 payments. We ended up just paying the whole amount on one credit card and will each have to emt or pay back that one person. Not the most convenient, and not worth the fuss considering all the other good food options in the area."}
{"text":"First time trying Hashi Izakaya - I must have walked past this place for years. It's actually a lot bigger inside than I anticipated and quite cozy! Prices are on the more expensive side, but it is an izakaya after all. Between four friends, we ordered 5 dishes and ended up paying about $20 each after taxes and tip so in the end, it wasn't too bad! Here's one of my favourite dishes I tried: the salmon rice don ($15). A nice blend of fish roe, rice, veggies, beets amongst the salmon sashimi. Very delicious & nutritious - I'd recommend it!"}
{"text":"The first to arrive was the Spicy Sashimi Salad.  This had diced sashimi and greens with a sweet-chili dressing.  While I found the greens to be very fresh in this salad, I didn't think that it was overall that spectacular.  But then again, it's really just sashimi salad so unless there was something really extra about it, it was mediocre.

The Salmon Natto arrived with seaweed on the side.  It came with diced cucumber and a quail egg yolk. This Salmon Natto was a smaller in size in comparison to others I've had in the past but was more flavourful (not as bland).  I remember that there was nothing too special about it either.

The Salmon Hako Sushi from the Teishoku Meal Set was a torched salmon box-sushi.  The set arrived on a tray with miso soup, salad, rice, and two side dishes.

I was really impressed with this Salmon Hako Sushi!  It was pressed sushi which meant it was \"box-shaped\" and was really delicious!  There was something about it that was so tasty, soft, and done really well.  This was the best dish of the night.

Although I didn't initially have a good meal overall, I think that Hashi Izakaya has some really good menu items.  After going there, I realized that I should have tried their \"Creamy Pork Belly\" dish as I heard that one was really good.  I don't think I'll return any time soon though because I thought their prices were a little high and there are just so many restaurants in the neighbourhood of Yonge and Finch that I would want to try something else next time."}
{"text":"Visited Fri Oct 7 for dinner 
My date had visited before, they changed their menu earlier this year. 

Pros
The lighting is actualy quite good, it's not as dark as mentioned in previous reviews. 
The music was not that loud, maybe because it was early in the night.
Karage - about 10 pieces of fried chicken it was crispy and tasty
Hako salmon - Very unique dish that is torched, they raised the price from $15 to now $17
Buta burrito - a sushi burrito for $8 is a great price, try one if you haven't yet. 
Place was half-full, no lineups. 

Cons
Parking is tough in this area. 
The big sign at the front is really bright for customer eyes. 
I figured out why the front entrance doesn't look inviting, it's a big wood door. Most restaurants have a glass door so guests can see inside.
The semi name change in late 2015 didn't really help to improve the restaurant's reputation. Keep the same name so that guests can get to know you guys.

Damage - $32 pre-tip

Pro-tip - There are 2 or 3 private booths for dining"}
{"text":"Went there to meet a friend, great atmosphere. Really good food as well, it could have been a bigger place. Other than getting lost trying to find the place, everything went wel. Would definently come back here again when I visit toronto again! Maybe I can drink by that time too!"}
{"text":"A cozy izakaya which is good for dinner or just for a drink. Has a nice sake list where you can explore & sometimes the special are really good"}
{"text":"I've ordered the Tako wasa, the seafood was a bit blend. The Ebi curry -mayo was flavourful. The aburi hako sushi-salmon, crispy shrimp, spicy mayo is a good combination in terms of flavour. I've always enjoyed the ODEN-bonito base broth with fish cakes, egg, daikon. This is perfect for winter with the spicy soup and different variety of fish balls."}
{"text":"Came with the guys for a night out.

Food quality is excellent. It's a kind of an Asian/Korean Tapas concept. Atmosphere is nice and lively, washrooms are clean.

Tuna Tataki was great! Most other items were also yummy. Price is reasonable at first but it can rack up as you try to get full on small portions.

Overall I liked it and will be going back again when in the area."}
{"text":"Terrible food quality! Especially the Oyster with Cheese, only tiny tiny piece on each oyster shell, and the shell looks like reuse due to the outside didn't keep any original color, even after BBQ, you can still see some black or grey color, but the whole thing is white. Disgusting!"}
{"text":"I enjoyed my time here at Hashi. Servers were really friendly and provided great customer service. We came as a party of 3. Ordered the Hashi Don, Grilled Octopus, daily special of sushi (ebi, ice fish, uni), Torched Salmon Sushi & Hashi Chanpon Ramen. Food presentation was great. Interior was great with good music. Really meant for gatherings and drinking as well. Definitely coming here again!"}
{"text":"Quite a chill place. The ambience is nice and full of beautiful Asian people. The food is good as well but I find it more of a drinking place. Lots of sake selections. 
Highly recommended!"}
{"text":"Prices at this Izakaya are not cheap. If you want a value-for-money item here, I would recommend their SALMON IKURA DON; portion is huge, sashimi is fresh, and it looks pretty.  

If you decide to order both the HASHI CHAPON RAMEN ($18) and SALMON IKURA DON ($14) like we did, which are both decent choices, give this a taste: try dipping the don in the ramen broth (like in the photo). The richness of the broth will enhance the flavour in the sushi rice, though not the best idea if you care about chewing and your digestive system health. Suggest to do this when the ramen broth has been sitting for awhile, not piping hot. 

TAKO WASA - Wasabi marinated octopus ($5) - we prefer this dish from Tsuki Izakaya more because it tastes better and cheaper there at $4. We thought they put way too much wasabi here at Hashi.  

SHO CHIKU BAI CLASSIC - As much as I'd love to say I enjoy hot sake cos it sounds cool, the fact is I don't! We got it as it  was on special (menu: $11, special price: $9)."}
{"text":"good place to drink...affordable pitchers...but food left a lot to be desired

it tries to be  on the higher-end of the food spectrum, but frankly fails miserably...i recall the menu listing expensive wagyu steak? not a smart business decision

washrooms need to be cleaned up as well"}
{"text":"Came here on a Wednesday night after work-- the interior is really dark so you can't really see the food clearly.

Overall experience is good as our waitress was very attentive and friendly. Food arrived pretty fast as well. We ordered a curry pork rice, beef don, Unagi sushi, ramen and an appetizer (fried chicken). 

The food was average but the portions are pretty big. The Unami sushi taste good but the rice was breaking apart. As for the ramen, They have this special ramen which they only make 5 per day because it takes them ten hours to make the soup base (?). It taste very average though.

Overall, it's been a good experience. I would visit again. :)"}
{"text":"This is the place to go to if you're down for some late night pigging out. The kamikaze rolls are perfection! The salmon natu was so-so. It wasn't anything spectacular. The al tang was surprisingly really good despite the surprising amount of cod ovaries that we discovered in it. The creamy pork belly is a must-try. Price-wise, it's not too bad, considering the quality of the food. I am definitely down for coming here again and trying out more items on their menu!"}
{"text":"I remember when this place used to be a korean restaurant. Now it is a fancy looking izakaya. When the door is open, it is inviting but when the door is closed, it looks like the restaurant is closed even though there is a sign saying it's open. The interior has all sorts of rustic wood and the lighting level in general was pretty low. Not good for cell pictures.
I ordered the seasonal special: beef tataki. I did not know what to expect but I was surprised to find raw beef on a salad bed and Sauce. The plate looked quite small for a $12 dish. When I tasted it though...It was actually really good! The meat was refreshing and flavourful from the vinaigarette sauce and did not have a beefy odour or bloody taste that I would expect raw beef to have. As expected I wasn't really full after eating but, it tasted really good so I think it was worth the money.
When my friends and I got seated, the restaurant was pretty empty but by the time we were ready to leave it was bustling. The service likewise was good when it wasn't so busy but by the time we were ready to pay the bill, we had to ask 3 different times because it was taking so long and the waitress forgot. My table was also right in front of the cash as well so there was no reason to forget. In the end, we went up to the cashier to pay."}
{"text":"Came here for dinner on a Friday night around 8pm, and was able to get a seat without a reservation for 2. We sat at the bar which is really fun to watch the chefs make all the food, and the seats were brighter by the kitchen, everywhere else is really dark. The waitresses were nice, service was attentive and quick. 

Got the karrage, fried chicken, not bad exactly what it is, could be a little saltier for personal preference. The ebi mayo shrimp was good, the shrimp were large sized, crispy batter and the sauce wasn't overwhelming. The sushi itself was mediocre, it was good because it had lots of toppings but the rice felt mushy and overpacked. 

The best thing we tried was the creamy pork belly. The pork belly was braised so soft, the potato at the bottom was so creamy that it felt like polenta. The flavours were rich and warm. If I had to go back I'd just order this."}
{"text":"This is an izakaya right at Finch and Yonge. They sell mediocre Japanese bar food and lots of drinks. I think they're overpriced and the Korean places nearby are better for drinking and good food. 

If you're craving Japanese, things you can order: karaage, taco wasa, grilled fish. Look at the photos for portion size and you'll see which ones are worth it. 

Vibe can be quiet or super loud depending on when you go. I've been around 5 on a weekday and it's very quiet. Service was unremarkable, she did the bare minimum. 

It's too expensive for the quality, but has a great location right on top of a major subway line. Rent must be expensive so their prices are high."}
{"text":"Returned here for dinner on a Sunday evening. Their menu changed, some of the dishes we used to love were no longer available. They also don't offer any more sushi rolls. New to their menu were some dinner 'sets' with miso soup and two side dishes. 

We were quite disappointed to say the least. This place used to be a gem for me. I never minded the above-average prices as the food were great and the portions used to be generous. After ordering over $70 of food for two we were baffled by the small portions. We ordered two meal sets, a spicy sashimi salad, and a unagi sushi. We were not full after finishing everything. The food also tasted underwhelming. We had hoped for better dishes. The unagi sushi which costed $18 had only tiny pieces of fish on the rice. The rice also broke apart when we tried to pick them up. We felt cheated afterwards; that meal was definitely not worth $70+. Service was decent, the servers were very courteous and nice. The food killed the experience for us. We will unlikely return anytime soon."}
{"text":"Came early on a Friday night looking for Yuzu Izakaya only to find this in it's place. It was a bit confusing but a quick check of the address helped figure it out for me. The atmosphere is alot of wood, bamboo screens and dim lighting. Thankfully, the music and noise isn't as loud as other izakayas so I could thankfully hear the conversation at the table. 
Great place for a drink (yeah for frozen beer) and some light snacks to have a chat, but not so much for a full meal. Nothing too amazing or special on the menu, almost what you would get a regular japanese restaurant. The seafood udon is big enough to for a bowl or two for 5 people. The sushi rolls were good for sharing and they were really good about keeping the mayo sauce (which seems to find it's way onto all the rolls) on the side. The Tako Wasi came with enough seaweed to enjoy, which I really appreciate. Great service but wish there was more options on the menu to choose from."}
{"text":"I stumbled upon this izakaya by accident. I was searching all over Y/F for something good to eat. Every restaurant was full or had long line ups. I hate lining up to eat and pay! Well Hashi had several tables free and we were seated in a nice table near the back. I liked how they placed us apart from the other tables. Most restos cram you together so its easier to serve you.

Ordered the beef donburi and the seafood udon. Both were tasty and were much better than I had anticipated! I would come back for the beef donburi. Service was actually quick and efficient. Even though it was by accident, I would come back again! Give Hashi a try like I did! 4 stars ****"}
{"text":"This is by far the best izakaya I've tried and one of my favourite restaurants!  Formerly called 'Yuzu', but under the same ownership and same menu and staff as before. 

I have dined here at least 10 times, and each time the service and food has been amazing.  It does get quite lively and busy late at night, but the dishes still come out quickly and are always delicious. 

Everything I've ever ordered is tasty and the presentation and portion sizes are fantastic!  Some of my favourite dishes are salmon lovers sushi, black dragon sushi (dynamite roll topped with unagi), grilled butter calamari, karaage, and salmon natu(salmon with sauce, cucumber, pickled radish, avacado, quail egg- mixed together and then you wrap it up with dried sea weed paper), unagi salad etc."}
{"text":"I was pleasantly surprised for my visit at Hashi Izakaya. I came in with the expectation of some of the finest Izakayas in downtown (Kinka), yet I thoroughly enjoyed the food there. 

We came in with a large group of around 12 people, the staff was quickly to adjust to increasing activities, and were always attentive with our table. The food also arrived extremely quickly after we ordered, allowing us to sample the dishes in succession without much waiting time in between.

The food was both inventive and delicious. We practically sampled the whole menu, ranging from Udon, to sushi rolls, to karaage. The food's simplicity spoke for itself, allowing it to taste very fresh and refined. Many of the dishes are simply sauced, which is pleasantly welcome, considering some restaurant hiding the true flavour of the ingredients behind their sauces. Some of the best ones of the night were the dragon roll, the udon, and grilled unagi.

A fantastic izakaya for any occasion that set the standard of what a well rounded izakaya could be. I'd definitely be making a return when I venture uptown."}
{"text":"Love this place! best place to have a drink and celebrate with friends. Food is good with wide variety of finger foods great for sharing and as drinking snacks! There's always some sort of special going on and the price is reasonable.
Location is nice and close to the finch (free parking weeknights and weekends) and also a nice lot right behind it too (paid parking).
Service is always excellent. There are also a bunch of curtains that can come down between tables to provide privacy for groups. 
Open late to suit your partying needs.

Been to a lot of izakayas and this is one of the best!"}
{"text":"Relatively small portions size so do that expect to be full unless you are willing to order a lot. The food itself was okay; the pork belly was mostly fat and the quail so dry we could see the individual fibers. The dish I do recommend is the seafood udon, that was absolutely delicious and I would come back just for it."}
{"text":"Food is good but expensive. Portion is so small that I was still hungry even after paying $100+ for two people and that is without ordering drinks!"}
{"text":"I am quite disappointed at the changes made to this place. I gave it a couple of chances since their recent change, tried their regular menu as well as their set menu, but it just wasn't up to par.  I'm not sure if the owner or chef has changed, but they seem to have \"cheaped out\" on the food quality and quantity.  My previous review indicated that this place was great BECAUSE of their consistency, but even the service was worse this time around!

They no longer have sushi rolls, and have \"torched\" sushi...but these were terrible. Mushy and thin pieces of sushi pieces.  The karage was also substantially smaller in quantity. It was pretty much $6 for six small pieces of fried chicken.  The ebi mayo is no longer as it was.  It's now ebi curry mayo and the shrimp is substantially smaller and no longer comes with the salad underneath like it used to. Terrible presentation as well, since it was just a bunch of fried shrimp in a bowl.  We also ordered the butter squid yaki which was the only thing that seemed to have remained similar to the old menu, but with a price increase.  We ended up paying $60 for the above dishes plus one beer. So disappointing because this was my favourite izakaya in the neighbourhood, and they had to go ahead and ruin it like most restaurants do to save a few bucks.

Sorry Hashi, but you've just lost a couple of customers."}
{"text":"Black dragon, beef teriyaki and salmon love above all its ok just ok. I don't want to try second time."}
{"text":"I came here with my husband around 9pm after putting my kids to sleep. We had a wonderful time (the fact that it was our first date in close to 9months probably helped).

We were able to be seated at the bar in front of the kitchen. The food was fast and delicious and the service was very friendly and attentive. She always came to refill our water before we ran out. 

Now onto the food. We ordered the cheese oysters, ebi mayo shrimp, unagi and avocado and pork belly. The unagi was some of the best unagi I've ever tasted, the meat was buttery soft. The ebi mayo was also spot on, perfect balance of crunchy shrimp with the smoothness of the mayo. I found the cheese oysters to be a little fishy for my taste (I've definitely had better at other restaurants), I think they chopped up the oyster with the other ingredients which I found a little odd. The pork belly was alright, but the sweet potato puree underneath was delicious! 

This place is definitely not cheap, we came here after having had a small dinner already. So the four dishes was enough for us and we spent about 60$ after tax and tip (we also ordered a small frozen beer). However if I haven't had a dinner beforehand I would have wanted to order more food, which means the meal would set you back quite a bit. That being said, I would definitely come back again. It's perfect for a quick date night as it's so close to our place, has good food and good atmosphere, with quick service. I can't wait to try some of their other dishes."}
{"text":"Come here all the time, usually order a bottle of cold sake and a pitcher of beer for table of 2.

The food menu is simple, pretty much have tried everything on the menu over and over again since this was my local water hole for a while..

They do a good with everything on the menu, 

I would recommend the taro chips, hamachi gamma, taco wasa, beef Tataki salad, and fish Maw soup.."}
{"text":"I went there with my Korean boy friend! When I opened the door, the workers said to us \"Irasshaimase\" in Japanese, so I'm so surprised! 
The name of this place is closely associated with Japanese place! 

We ordered Oden and Okonomiyaki! Both of them are familiar menus in Japan. I'm so excited! They were very tasty. However, I imagined Japanese Oden and Okonomiyaki, so actually they were weird for me. Okonomiyaki has onion and Oden is spicy for me. I shouldn't had imagined Japanese taste. 

On the other hand, he loved them, specially Oden! Yesterday was cold, so it was really good. He likes drinking and he said it's good for drinking! 

Anyway, service was very politeness and good! If the music were not too loud, this restaurant could be better to meet with friends."}
{"text":"Great addition to the area - would highly recommend!! We decided to give this place a try after trying nome only to find they were full. We went for dinner and ended up being the first table for the night. I hope people catch onto how great Hashi is!

We tried the warm sake special and sampled a handful of the small dishes. I was impressed with all the food and the quality was very consistent! 

Especially worth mentioning is the grilled yellow tail neck - it was so tender and my favourite dish of the night. The ebi mayo (fried shrimp) and the unagi avocado kabayaki were close seconds. The taro chips and oyster cheese mayo were also solid choices. I'm looking forward to coming back and trying the other items on the menu!"}
{"text":"Just get the nine dish platter thing. Don't think. Just do it. So extra. Yas.

If on budget, the star is the creamy pork. So yummy!

But just get the platter. Seriously. Oh, and the sashimi cuts are thick! Nice!

Excellent service too! 10/10 would eat again.

PS. They also serve Jagers!"}
{"text":"Not too much to like here, but the one good dish is the unagi (eel) over rice with avocado etc.  The portions were acceptable.  The service and ambience is okay.  Don't try speaking Japanese to the staff, they're all Korean!"}
{"text":"Looking for a restaurant to replace Tsuki Izakaya, one of my favourite go-to places in the area which has very sadly closed down (RIP!), Hashi Izakaya (previously Yuzu Izakaya) located at YnF beside Shoppers and Twister became my target.

Calling a week in advance, we made a reservation for Saturday evening for our party of ten, scoring a table for an 8pm seating no problem - just make sure you call in advance as the place fills up on the weekends. 

Similar to other Izakayas in the city, it's what you would expect - pretty girls serving you soju, beer and various Japanese dishes. 

Some highlights from the night: spicy seafood udon, fish cake soup, various rolls, and the black miso cod. 

The low: The butter squid doesn't even come close to comparing the one Tsuki used to sell and the karaage was dry and bland. 

Overall, location is great, food was pretty good, drinks are abundant and service is friendly and quick. With us all being full and a few bottles and pitchers later, our bill came to about $50 per person. 

I wouldn't go back for dinner alone, but would definitely be up for ordering some snacks to munch on next time I head back for some drinks!"}
{"text":"More of a authentic Japanese vibe. It's a cute spot to take your girl out on a date. 

The food is also very decent. I would say my favourite is the pork belly with mashed sweet potato . A must try!"}
{"text":"The Space:
Has an authentic Japanese vibe to it. I really love design of the interior space, especially the benches and the private seating area near the main entrance.

Food & Drinks:
Hashi is like a sushi / bar diffusion restaurant. Like I mentioned previously, the seating area hidden near the main entrance is my go to spot if I'm planning on drinking my heart out. The food here is always good, some their things are a tad expensive so we always try to order things that come in big, shareable portions. The quality of their food is always on point and highly recommend trying the okonomiyaki and their meal sets.

Service:
The service is pretty decent. I've only come here during weekend nights when they are busy and have gotten fairly attentive servers who don't hover. I think my favourite part of Hashi is the people you meet there because everyone is super fun and friendly!"}
