{"text":"Three stars exactly.  There is nothing too amazing, and nothing terrible about this place.   The food was all good, with an ample amount of vegetarian options, and the roasted potatoes in particular I found to be quite good.  

They do have a really big screen for sporting events, and a decent selection of beers on tap.    You could do worse than swinging by Hawks and having a couple beers."}
{"text":"Regular burger joint at average prices for a sit down restaurant. $20 for two burgers with fries and sodas. 

The food was well prepared, but the guy who took our order...I dunno.
Service was kind of lame."}
{"text":"My overall conclusion is that it's good for the price. If you're in a group and you're looking for cheap eats, this is a good place to go. I would give it 3.5 stars if I could.

Pros: if you order large salads/appetizers, it can easily turn into a meal for two. Generally, the prices for large sizes are still under 10 bucks so if you find someone to split it with, or want to take some home, then it's a great deal.

It is all self service, which is nice because you don't have to tip a waitress (only the cooks/kitchen staff/bartender.. Definitely still tip!)

The grilled cheese is solid

The quesadilla was pretty good

The Mediterranean salad was mostly good. I'm not a fan of sweet couscous but that's a personal preference.

Cons: limited seating during big games 

The atmosphere is a bit run down and leaves much to be desired"}
{"text":"Lousy and kind of expensive for the quality of the food.  But it's on State Street, so you can sit outside during the summer and experience some semblance of actual life."}
{"text":"Cool name, cool logo.  Bar is average. Is it supposed to casual or upscale?  

Best part is the wall of culture icons.  DO MORE OF THIS!!!"}
{"text":"Meh. Mediocre, expensive food and rude staff. If I ever return, it'll be for beers only."}
{"text":"Do not go to Hawks unless you want to get assaulted by a Hawks employee.

Pros: Good selection of cold beer, hot food

Cons: Terrible service, Hawks kicked out a table of customers on the patio who just tipped them $100 on a 3 pitcher order; then the same Hawk's employee who kicked that table off the patio, grabbed another patrons beer out of his hand, poured the beer on the guy, then sucker punched dude in the head... Not sure how this guy has a job there, the whole evening was honestly one of the most bizarre things I've ever seen; and I've been to Vietnam. Big fan of bars where waiters don't punch patrons."}
{"text":"Hawks at first glance looks like a nice sit down with wait service but to my surprise it was entirely all on you to order, pour your water, grab your silverware and condiments (no theyre not on the table), and grab your food from the window! I saw several mislead people who walked in, sat down and waited at their table for a waitress that never came. They eventually figured it out...

The food was good. Looked great but didn't live up to the presentation as much as I had hoped."}
{"text":"Great food and atmosphere ! I like how they have two seating areas : you can sit by the bar and get the \"sports bar-feel\" with all the TVs and game paraphernalia OR you can in the room with the counter and play board games on the big tables. Their seasoned fries and chilli are to die for ! They are vegetarian friendly and have the two tasty sandwiches along with a soup selection. I haven't tried their drinks as I am mostly there during the lunch hour, but I will be back for those fries !"}
{"text":"Hawks, I used to like you and now I think you're no more than cheap college bar food.

I went in there for a sandwich and soup with some friends and my one friend didn't even get her caesar salad and soup until 15 minutes after our food was up.  It was salad and soup - what takes so long?  I ordered the 'salmon burger' expecting a nice chunk of salmon and instead got a frozen salmon patty grilled with some unappetizing dill sauce on top.  The salmon patty tasted fishy, the onion soup had way too much pepper and overall i left feeling disgusted and still hungry.

I used to enjoy the regular burgers but now I'm not sure I'll ever be back.  Good beer selection and nice outdoor hangout."}
{"text":"So sorry to have to update this review, but the last few visits have been less than wonderful. The last time we were there, which is probably the \"last\" time, my salad was wet/runny, sparse, and overpriced given the quality. It's also taken for-ev-er to have food prepared. I know, it's a small kitchen, so there's that. I'm no longer a fan."}
{"text":"I'm pleasantly surprised at how good the food is at Hawk's.  It's not spectacular per se but it's very well done for what it is and they actually have a decent selection of vegetarian options.  As far as downtown goes they make my favorite veggie burger which has a tasty tomato-basil sauce and their portabella sandwich is really tasty as well.  I've never had their fries as I always opt for their superb roasted red potatoes.  If you are getting take-out call ahead as it will probably take around 10-15 mins."}
{"text":"Expensive food.. It tastes ok but you can get that somewhere else for cheaper. Also the music is not great. They only play outdated top 100 songs. People come here to watch soccer games or other sports which is fine. It's nice during the summer because of the outdoor area but that's about it."}
{"text":"Brief history lesson.  I came to Hawk's with my dad when we visited Madison.  He used to hang out at campus places sometimes with my mom before I was born.  When they had me, they lived in Sun Prairie (nearby).  I never really understood how cool \"Madtown\" was until they took me there as an adult.

I got in here using my fake ID (I was 20 at the time).  They had a pretty decent selection of beers and there were a lot of people.  Although, I have to say if I went back now, I'm pretty sure I wouldn't stop here.  Living in Chicago for a spell will make your bar preferences change."}
{"text":"Solid 3 stars. 

Went to Madison for a wedding this past weekend, and the boy and I needed some quick food before the afternoon wedding. 

Actually went to this place specifically because there used to be a different restaurant there..but we stayed anyway when we realized the switch.

Had the pulled pork sandwich, and the boy had a tuna melt.

He didn't like his, so we switched halfway.
The pulled pork was OK and the curly fries were delish. 
The tuna was a little strange tasting (I can see why he made me switch!).
Not sure what was going on, but it wasn't terrible..just not quite right. 

Anyway, it's very casual and the food was ready quickly. It was nice to sit outside so 3 stars it is.."}
{"text":"Mission #1) Sit outside
Mission #2) Don't get kicked out for having a giant dog not-so-secretly in tow
Mission #3) Feed the carnivore a burger and  the vegetarian a decent salad
Mission... accomplished!

We sat outside for a few minutes before realizing this is a \"order inside and pick it up yourself\" sort of place.  Nooo prob!  Food came quickly and the bacon & cheese burger was good (so I was told) and the curly fries were delish (don't try to order them anywhere near me and not expect me to pick them off your plate).  The counter staff was great, helping me make the all important \"what do I really want on this salad\" decisions.  At $4.95 for a small salad (which was pretty sizable) and limitless toppings, I couldn't go wrong.  I loaded up on all the usual salad bar toppings -peppers, broccoli, carrots, cucumber, walnuts, feta, olives, etc - but I will say they were missing some protein (egg or chick peas, perhaps?) and something crunchy besides nuts (dangit, all I really wanted were some croutons!).  But who am I to complain; for five bucks I got a loaded up plate of fresh veggies and got to enjoy it outside.  Great deal!"}
{"text":"Burgers way over cooked and overpriced. Fries were ok. Maybe expectations were a bit high. Menu is limited. Probably a great place to drink beer though."}
{"text":"I was puzzled by this restaurant/bar concept.  At first look it seems really nice.  Great location, very nice bar and bar area, etc.  Problem is the way they do business.  You have to go up to the counter to order food.  Only food here though.  You have to pay and then go to the other site to buy beer.  Then you will be called on a speaker for food pick up.  Just plain weird.  It is a shame because the food we got was well done and well  presented.  The bartender was also nice.  Overall I have to say we enjoyed our dinner, but I just don't think I want to go through all the aggravation of paying twice, etc.  Too bad since the place has such potential."}
{"text":"I had only been to Hawk's once before, and that was for a single beer to drink outside during the summer months. My friends and I came here to enjoy watching the Badgers get into the Final Four. We decided to order some food before the game started and were pleasantly surprised. I ordered the cheese curds and their Honey Onion soup, and my roommate ordered their baked Brie plate. Everything was very good! I would've preferred my cheese curds to be a little more ooey gooey, but the breading was just right. The soup was also very good, maybe a little too sweet but I guess you should expect sweet when the soup has the word honey in it. The Brie plate was also very good - it came with a lot of bread, some green apples and some sort of herby butter to spread over everything (and a lot of Brie, of course). The burgers and everything else coming out of the kitchen looked so yummy too. Can't wait to come back!"}
{"text":"Had only ever been here for the occasional drink before today. I stopped in for lunch with my sister as we were hungry and it was the first place we saw at the time! (hah!).

The food wasn't amazing, but wasn't bad at all. Nothing special, but tasty bar fare. A bit overpriced, I'd say, for what we got. But pleasant service and the place is clean in the daylight (that can't be said for many bars!)."}
{"text":"I would have given this place 3 stars for okay but not great/good food, but given that I got violent food poisoning after eating here and was up from 1:30am-6:30am vomiting every hour or so, I have no choice but to go with 1 star.

As a dive bar it seemed cool though."}
{"text":"It's not a good sign when your restaurant serves something that is so bad, your customer is still talking about how bad it was literally half of a year later. And that's exactly what happened the last time I ordered a grilled tomato basil veggie sandwich here. Seriously, take that shit off your menu. It was an absolutely foul excuse for cooking that had to have been conjured up by an extremely high, extremely overweight vegetarian.

I don't know what I could even call that thing. Was it some kind of attempt at a new twist on pizza? It certainly was saturated in enough crappy cheese and tomato sauce to seem like it. That floppy piece of tomato-soaked toast on the bottom might have been part of an aborted attempt at a sandwich. And why do all the vegetables have the same taste and texture as tofu? How do you even screw that up, and why on a \"veggie sandwich\"?

Hawk's has a pretty good beer selection in addition to very friendly bartenders. So as a bar they're doing an okay job. This is unfortunately just about all they have going for them. The burgers and fries are unmemorable, there are no waiters, the kitchen staff (from whom you must order and pick up like a cafeteria) is surly, and the bar only takes cash - which doesn't help given that this place is expensive as fuck."}
{"text":"Let me preface this by saying that Hawk's has been, for better and worse, my go-to bar throughout college. 

The food is amazing, slightly overpriced but worth it. I usually go with the reuben, but the med-plate is superb if you're in one of those \"keepin it light/keepin it classy\" moods, not to mention a perfect thing to share with a date. 

Full bar. Bartenders are more than ready to make whatever you ask, and proficient at doing it. 

Extra Credit tip... if you get a chance, take a glance (that rhymed) at a most excellent array of pictures on the wall facing the long portion of the bar. Your mind will be blown by the eclectically enigmatic selection. 

To conclude, here's a little Mighty Ducks video that I think sums Hawks up in a nutshell....http://www.youtube.com/watch?v=jPZ3JX6M7Y4

Keep winning big Hawk's"}
{"text":"I ordered the prime rib sandwich. It had about two ounces of meat and a thin slice of cheese. Very disappointed This is why I very rarely eat out anymore."}
{"text":"My girlfriend's family and I went to Hawk's for lunch during commencement weekend at UW. On the whole, those I was with enjoyed their food. As for myself, I got the veggie burger, which turned out to be just a frozen patty. The tomato basil sauce was also a bit disappointing, as it was too sweet and kind of tasted like lunchables pizza sauce.

Still, the main reason why this is a two-star review is customer service. It took an hour for my group's food to come out, and we were not warned before we ordered that the wait would be so long. The restaurant was decently full when we entered, but there was no line to order, and no other indication that it would take so long to get food. Given this, I was really disappointed that the staff just took our order without saying something about the backed up kitchen."}
{"text":"A lot of people say this place isn't that amazing. I think it has really good food. It is one of my favorite places on State St. to get some quick chow. I usually get a burger there, but I have also gotten other sandwiches. Good fries too (spicy ones are the best). 

The service is the only reason that it isn't five stars. You do have to go get your own food and order it at the counter, but that doesn't bother me that much. You also have to get your own water, which is annoying if you are at the outdoor seating. Overall though, the counter service and bussing service is really good.

The outdoor seating is really nice. There is usually somebody singing or making music outside, which adds the atmosphere. The indoor seating is pretty good too. There is artwork on the walls from local artists and it is usually decent.

Overall, 4 stars for good food and good atmosphere."}
{"text":"I was stunned at how good my honey onion soup was; the sandwich was good.  Others at my table, though, didn't enjoy their hamburgers all that much, though one ordered a salad that was good.  

Mixed review.

We had soft drinks, rather than alcohol, and the selection was interesting."}
{"text":"Pretty good food and solid atmosphere for drinks. But due to one of the employees hitting a fellow patron in the face who was literally just sitting at the table next to us, I'm going to go with a 1-star review here."}
{"text":"I hip place for Happy hour on State Street, with a neo-funk-jazz motif interior that evokes shades of a yesteryear Chicago Loop hangout. The beer was nice and frosty and the \"Special of the Day\" crunchy and fresh fish tacos were simply fantabulous!."}
{"text":"The type of place where the bartenders are too busy checking their phones, talking with their friends, and playing their shitty music too loud to notice you're there. AC/DC sucks brother, especially at top notch on a Wednesday."}
{"text":"The service is awful and the bartenders make you feel like an inconvenience.  They have a great location, but unless there is a management change expect to be disappointed."}
{"text":"The food here is overpriced. We wanted something greasy that was easy to eat. The little plate of fries barely fit the bill. $3, pfff your better of stopping at McDonald's. Drinks seemed pricey as well."}
{"text":"#1 place to watch soccer in southern Wisconsin. Quesadillas are great. Good vegetarian options. Local owner - Madison born and raised. Pays a decent wage and provides health care. Supports unions. A Madison-institution."}
{"text":"Hawk's is a pretty simple, straight-forward place. The food isn't fancy but it gets the job done. The menu isn't robust but it has enough to make most happy. The beer selection that comes from the attached bar is decent to good."}
{"text":"The beef for the burgers was foul and obviously spoiled. When we complained civilly to the owner \"Hawk\", he screamed at us for having bad taste and making his life hard. He then proceeded to get our bill and basically forced us to pay and get out. I can't believe it! The people that were with us are still completely stunned. Obviously, this owner is having some kind of personal crisis. There is no doubt that with service and food like that, this location will close. The owner is completely offensive. Stay away if you don't want to be abused and have your pockets picked in return for rancid food."}
{"text":"Stopped by earlier today and honestly had a great experience. Between the two of us we had honey onion soup, cheese curds, and the southwest quesadilla. although this was too much food (don't get a full size in quesadilla it lasted two for lunch and dinner) the food was of amazing quality and well worth the money spent!! Friendly Great staff!"}
{"text":"Super Slow!  10 minutes in line and then 45 minutes for two burgers and chicken strips.  The place was only half full.  Food was ok, but not worth the wait"}
{"text":"The service outside is terrible!  The two of us ordered beers and waited and waited and waited.  Asked the waitress one more time and she told us she'd be right back with them.  Finally our food was ready and both orders were not even close to correct.  We asked for them to be fixed and we were told there wasn't anything they could do about it?!?!  We ate and left as soon as we could.  Oh yeah...our beers never did show up."}
{"text":"Eh, if you're looking for quick, casual food this is your place. It's really nothing special. It's great if you're with a group of friends and are wandering State Street, but nobody can seem to decide/agree on a place...those are the only times I've stopped here."}
{"text":"I had dinner at Hawk's while visiting Madison during a conference, and I chose it because it had vegetables on the menu, and those seem hard to find behind all the friend cheese curds in this town (believe me- not a complaint). This place is definitely straightforward, no frills, nothing special with the food. My husband and I both got salads, and they were pretty mediocre.   
Also, my main disappointment is that the beer menu doesn't list all the beers! I had the bartender recommend something for me, which turned out to be fine, but a few minutes later I saw  a waitress bring someone else the Leinenkugels Honey Wheat that I had been searching for! I saw it listed nowhere on the menu! Ugh! Sadness. 
Hawk's served its purpose in providing vegetables, but nothing special here!"}
{"text":"Bad food and slow service. Chili was Luke warm. Burgers were raw in middle."}
{"text":"Med plate is great, price is fair. Even the small plate, ordered as a meal (it's listed as an appetizer) is too much for me to finish. The pita pizzas are really good as well, but small. Then again, they are only $5 so you can't complain too much about that."}
{"text":"Gross food.  Even for State Street the food is gross!   Avoid the turkey burger at *all* costs.  In fact, even the salad is not quite worth the price!  In terms of the bar, I've only ordered a beer on tap but the service left much to be desired.  Food with drink will be over $10."}
{"text":"Very good menu for a bar and an excellent selection of beer. The decor is very nice and comfortable to enjoy the company of friends, a sports game, a drink, and a great meal. I had their steak sandwich which was a nice slab of steak marinated in one of 5 marinades that I got to choose when I ordered. The steak was tasty and cooked to a level that allowed me to eat the 0.5\" thick steak like a sandwich instead of eating it open face. The seasoned curly fries were also quite tasty! I'll definitely go enjoy another sandwich and beer the next time I'm in Madison."}
{"text":"Not sure how good the food is going to be but 45 minutes to get it is unacceptable. No apologies at all from the staff either. Finally got our food. Not worth the wait.  Skip it!"}
{"text":"Went to Hawks yesterday for a late lunch with my co-workers. I ordered the Taco Tuesday special -- 3 Fish Tacos  ( in this case it was Cod ) for a great price of $6.50. After placing the order, my friends and I waited close to 25 minutes for two orders of fish tacos and a salad. Keep in mind that we were the only ones at the restaurants ordering food. Once we picked up our orders at the counter and started to dig in; I was pretty disappointed at the lack of flavor and the strange toppings on the tacos. Sometimes cheap food is incorrectly linked with poor quality of ingredients. In this case, I think that's accurate Although I don't want to scrutinize them too severely for one plate of tacos, I likely won't choose to eat there in the future."}
{"text":"When you read the menu, things sound promising, but nothing I tried ever tasted even half as good as it sounded. 

I've tried the veggie burger, the grilled cheese, and the barbecue chicken sandwich (along with maybe one or two specials), and all of them left me feeling mildly queasy. Too much grease? Spices that don't agree with me? I don't know. Even the fries disappointed me. 

In addition to the blah food, I'm still annoyed with their inconsideration as neighbors. I lived above them for a year, and I wanted to smash my head into the wall most nights. Ultra-repetitive music - I swear the only thing their bartenders listened to in 2005/2006 was \"Sweet Caroline\" (ONCE A NIGHT IS ENOUGH, three made me think about coming in and ripping the speakers down) and The Killers' first album. Also, they routinely left the music on full-blast until 5 am. I expected noise until bar time, but pounding bass til sunrise during the week, not so much. 

Ranting aside, they get two stars instead of one because the food is edible (not good, but edible) and they can accommodate large groups."}
{"text":"My family and I took a weekend trip from Chicago to Madison.  We were also lucky to have tickets to watch one of our favorite college basketball teams Ohio State play Wisconsin.  We walked from our hotel near the capital building to the Kohl Center and passed many restaurants.  We decided on Hawk's Bar & Grill, partially because of the signs inside talking about being union proud and talking about how Wisconsin won the super bowl of union organizing.  

Hawk's was pretty busy before the game.  We were able to find seats for six people pretty easily.  We looked at the menu and eventually ordered.  I got the Real Deal with cheddar and the spicy fries.  I mean when in Wisconsin try the cheese.  The Real Deal was perfect for lunch.  The portion was bigger than I would have expected.  It's the perfect size to split.  My sister tried the Grilled Tomato Basil Veggie which was also great.  A few others in the group tried the BLT which they enjoyed.  My brother got a burger and enjoyed it.  Which is a huge completement considering he is a huge burger fan.  

It took a little bit for our food to come.  Waiting is bad enough when you're hungry but when you're in a hurry to get somewhere it is worse.  

Overall, it was  good experience.  I would try it again the next time I'm in Madison."}
{"text":"The food at Hawk's is shockingly mediocre.  Except for the chili, which I really, really like, everything is about as bland and unappetizing as can be.  I would give three stars but they just hiked their prices up, so two it is."}
{"text":"Worst bar. I waited for a half hour for the cretin of a bartender to acknowledge my existence only to be told he wouldn't make a drink for me because he didn't want to. I have nothing more to say about this bar other than that if you're going here, out of all the bars in Madison, you're wasting your time."}
{"text":"OK place to hang out maybe at the beginning of the night. It's true that the bar accepts cash only, but in case you're out of it, there is a ATM machine inside. The drink quality varies a lot depending on the bartender. When you get unlucky, a gin and tonic taste just like 7-up."}
{"text":"So the fish. Frozen, thawed, and frozen again makes for a great dish...not.


Wow hawks who have you been hiring? The food sucks now. And the people working don't care. Last Friday I had the most disgusting fish plate I have ever bought. 
I can't believe the 'cook' actually thought that was ready to be eaten. Soggy 100 percent not Crispy mess. The crap was so undercooked my stomach turned at the first bite.


It was so bad I took some photos I'm just not sure how to upload them here


After going to hawks at least once a week I cannot trust these cooks to actually cook the food or care about your health. That's what happens when you let your employees wear pajamas to work. Gross"}
{"text":"This is Madison's place to watch soccer. They have a large screen that comes down to play those big games. Their drink prices and food prices are affordable. I've had the greek salad and the reuben before. The greek salad comes with a nice variety of crunchy veggies and dressing on the side (great for one person). My reuben was served with the seasoned curly fries. YUM! This is a big portion of food and can easily be shared between two people. I've had the cheese curds. You cannot go wrong with the cheese curds. The portion size is definitely large enough to share with a table of friends during a soccer/football/basketball game. They do have a smaller selection of beers on tap compared to other bars in the area. Do not let this get you down. They have a large list of beers in cans and bottles too. If you are looking for something in particular, just ask the bartender. They offer a full bar for those looking for something on the rocks."}
{"text":"Came on a Tuesday and got a pork, shrimp, and fish taco for $6.95 I believe. All were pretty good tacos especially for the price! Also had the jalapeño poppers which were nothing specialllll but still good!

My roommate has a special place in her heart for the Greek salad and says it's giant and delicious!!

Bartender was friendly and made good fast drinks!"}
{"text":"I had the pleasure of dining at Hawk's during a recent trip to Madison for a work-related conference. The staff was funny and provided honest recommendations from their menu.

We split an order of mozzarella sticks (3.5 stars) -- good consistency, if not a bit messy -- the tomato basil sauce was a nice touch. My friend tried the grilled tomato basil veggie (at the recommendation of one of the workers), and seemed to enjoy it. I had \"the real deal\" grilled cheese with bacon (3.5 stars); it was one of the better restaurant grilled cheeses I have had -- with at least 4 types of cheese to choose from, and the ability to mix if that's your thing! The bartender was friendly, and the beer specials were adequate. I had the Ale Asylum Hopalicious, which provided a nice kick to go with the grilled cheese.

There is nothing bad about Hawk's from this visit, but it was a standard 3-star eatery. I would eat there again, but I am only in Madison once every few months, so I can't say \"OHMYGOODNESSMUSTHAVEHAWKS\" -- there are other places in Madtown I'd like to try first. For what it is worth, this hit the spot on a cold fall evening and was quiet enough to have a conversation in a non-crowded eatery."}
{"text":"Hawks is a nice place to go if you find yourself on State Street and want to avoid the terrible campus bars in the area. However, I wouldn't specifically come here to eat. I had a Thai salad last night. It was definitely over-priced for what I got. The dressing tasted like they just mixed some spices with mayonaise and put it on the greens. Maybe I just ordered the wrong thing, but i wasn't that impressed."}
{"text":"Meh... I'm honestly not sure why I've been here twice. The first time I just had a beer, and the second time beer and food. Both times were disappointing. The atmosphere inside is just kind of blah, and the food is nothing special. I tried cheese curds and nachos, both of which I would usually say \"How can you mess this up?\" I'm ok with bar food, but this is sub-par even for bar food!"}
{"text":"This place is decent. Love the outdoor seating.  But overpriced?  Really?  Noooo, you must have the wrong place, lots of food for cheap, appetizers good too, nothing to rave about. They give you a lot of food and it satifies your greasy food craving.  I'll be back."}
{"text":"I tried the grilled tomato basil veggie sandwich, and it wasn't what I was expecting. I was hoping for something lighter, but it was enormous and not the healthy or smaller alternative I was looking for. I didn't particularly like the flavor and wished I had ordered something different. I liked my Irish potato soup pretty well, but other than that, I probably wouldn't make a point of coming back here."}
{"text":"Didn't go into the bar area so this review is only for the dining room.

Pretty small dining room area but they packed in as many chairs/tables as possible. You order and pick up at the same counter so customer service is really negligible. It seems like a larger scale chipotle.
Since you aren't reserving tables you can fit in a larger group (as long as you grab the seats as they become available). You can also stay as long as you want since you don't have to worry about a waiter rushing you to leave. Also each person can walk up to the counter and order their food so there is no mess with splitting the bill. 

Their turkey burger with the cilantro mess on top was awesome. BF had the steak sandwich and he loved it. Everyone else in the party seemed to be happy with their food as well. 


Downside--wait was FOREVER!! And the chairs were just plain wood. Ouch. 

Although we had a pleasant experience...I'm not dying to go back again."}
{"text":"We had the salad and it was awesome. We came for lunch so we don't know how the service is at night. The kids got burgers and loved them. Overall 5 stars for us."}
{"text":"Hung out here, outside with a friend for HOURS with my dog one Saturday afternoon. It was the first nice day of the year and it was nice sitting out and enjoying the sun. We chose this location because they were on a \"dog friendly\" list I found on-line.

There are three areas to sit, outside, inside eatery, and inside bar. You have to go inside to order and then return when your name is called. 

Prices and food were both decent. 

The most fun was watching the tag team street beggars across the street."}
{"text":"Decent sandwiches and bonus points for spicy fries (more places should have spicy fries).  But unforunately, there's not much to make this place stand out.

Swing by in the summer and grab a table outside for some great people watching on State Street."}
{"text":"Hawk's looked like it had potential, but we were disappointed.  Girl got the salad with turkey - turned out to be cold cuts diced over the lettuce..  

I had the teriyaki tuna sandwich - the fish was good, but the teriyaki was not.  I don't recall which soup I tried, but it was an unbalanced blend of undercooked ingredients - the onions were nearly raw."}
