{"text":"They called it \"HCafe\", so I thought it would be a coffee shop. This is a little shop to get ice cream and sweets. If you like, you can eat them on bench. They did not have table and seats. I tried banana ice cream Mochi and it was very good. I loved it. I am going to try different kinds of sweets."}
{"text":"Very difficult to find location, but very convenient location once you know where it was,

Strawberry mochi is good.
Peach one is so-so.

They also have free tasting (before you commit to buy a full cake)."}
{"text":"Black Seaame Ice Cream (score 4/5)
Light and creamy. It does not have a rich sesame taste but good enough. I have a choice to choose one topping to go with the ice cream. I chose a topping that looks like a biscuit and the server said it's a slice of cheesecake. After I took a bite, it tastes like a biscuit. It tastes nothing like a cheesecake at all. Well, I think the ice cream  itself is good enough.

Peach Flavour of Daifuku
Daifuku is like a sweet dumpling with chunks of peach inside the dumpling. The whole thing to me is way toooooo sweet! The sweetness of the mochi is in combat with the sweetness of the  peach. It doesn't worth $4 at all, may be $1.50. 


Both items are a bit pricey, $4 for ice cream  and $4 for the daifuku ????. I won't come back for daifuku, maybe ice cream or try their muffins."}
{"text":"Walked by this location just now with an intention to take out food in another shop. Noticed the lady was helping 2 other customers and pulled out a plate of array of colourful cheesecake. I saw cake and it drew me in. This shop was previously marketed for daifuku mochi, so I was interested if it's a new product. I asked the girl the question with enthusiasm. Instead of answering , she quickly put away her plate after the 2 customers sampled, and just stared at me. I guess this shop did not want a new customer. 

Didn't buy anything. Wasn't even given a chance."}
{"text":"My husband bought me one of their mochi cakes for my birthday.  It was very nice and refreshing, a nice change.  He also bought mochi and wanted mango and when he came home, he realized they gave him more strawberry and sesame than he asked for.  So fast forward 6 weeks later, I wanted to try the mango.  I went in and asked for two mango and one strawberry and was pretty clear.  I came home and I have two strawberry and one mango in the bag.  I'm not sure if it's a language issue but I wanted two mango.  The one mango I had was nice.  Strawberry is good with a big strawberry inside.  Loss of a star for messing up our orders twice but they're tasty."}
{"text":"Been to Hcafe twice now after passing by it and when to Luv me Sweet instead.  Hcafe have a variety of different unique flavors but it looks like their cheesecakes are smaller.  The last 2 times I got my cheesecake it didn't look that appealing as well. Price is on point with the other Japanese cheesecake places in Toronto.  What I need to try is the fresh fruit mochi which looks very good.  Also saw a sign for day old cheesecake for $5.  Will try that next time and see if it is any good"}
{"text":"Great little cafe! Wasn't sure where it was exactly but just head through the sliding doors into the food court looking area and it will be right there! There is a Impark right across the street in the south west corner of Yonge and Sheppard you can park in as well. 

Staff were super friendly and explained all the different items and made some great recommendations! 

The Sakura cheese cake was something I have never seen before! It was amazing and super refreshing. The matcha cheesecake was good as well and very matcha flavoured which I do like. Also got 2 Sakura Mochi. They were also good but the leaf wrapping it was a little on the salty side but I never tried them before so not sure if that was supposed to be like that.

Highly recommend if you are looking for a really unique dessert. I will be back to try the original cheesecake next time!"}
{"text":"The cake I got from here was so soft and delicious.  I recommend this place because of the care that is taken in the recipe as well as the artful presentation. I have not been able to find a desert this soft anywhere else so far in Toronto."}
{"text":"This location is very convenient as it's located right by Yonge and Sheppard and the building that it's located in has an entrance that links directly to the ttc.

I tried their new tiramisu series which comes in four flavours - original, matcha, black sesame and kinako. All the flavours were pretty delicious as it was not overly sweet but still very flavourful. My favourite ones were matcha and original. 

I also tried their sakura cheesecake and I thought that it's a pretty unique dessert that can't be found anywhere else. Overall I would visit again in the future to try their other desserts such as the taro cheesecake!"}
{"text":"3.5 stars (only based on the mochis we have tried)

This H Cafe location is hidden in an indoor plaza at the bottom of a condo building, connected to the Sheppard East subway station. The location was surprisingly small with no seating available, although there are some benches just outside the shop in the common area. We visited at around 10pm and the only fruit flavoured daifukus left were strawberry and peach ($3.54 each). Other options on the menu include orange, kiwi and banana. Between the ones I tried, I prefer the strawberry version. 

Strawberry - This one had a slight twist to it as the fruit was covered in a red bean paste. The flavours complimented each other. 

Peach - The cubed fresh peach were not fully riped, so it had a nice tart flavour.  However, the combination was not exciting as it was mixed with what seemed like a sweet peach sauce.   

We also tried the matcha and black sesame mochis. These were very different as the glutinous rice was still intact and they were much more filling.

Black sesame - The black sesame paste filling had a rich toasted flavour, however this was slightly on the sweet side and lacked depth. 

Matcha - The flavour profile of the matcha mochi was a bit more complex. The sticky rice was dusted with matcha powder and the subtle bitterness balanced well with the sweet red bean paste inside.

Of the items I tried above, I prefer the fruit mochis even though there isn't too much to rave about in terms of the fillings. However, the texture of the exterior glutinous rice paste alone is enough for me to return. I loved how soft and gooey it was, and the addition of the fruit inside was refreshing."}
{"text":"Tried the new chocolate mix flavoured Japanese cheesecake here with my boyfriend. We both really liked it. I was surprised as I found it was very rich, and heavier than normal Japanese cheesecakes. It was kind of like a marble style cake, so u get richer pockets of chocolate flavour in some bites more than others. Would visit again to try other desserts."}
{"text":"Sakura cheese cake has a special flavor and it's good. I also recommend the original tiramisu, it taste very great and I just love it. They have nice customer service too."}
{"text":"Definitely a good place if you want fresh mochi. It's a small place located where Sheppard subway station is, so it's quite convenient to get to. They have a variety of mochi flavours, some that are more of your typical mochi made with rice flour with fruit inside and some that are traditional made with sticky rice. Another great thing about HCafe is that they also have ice cream in which most of them are your standard Asian flavours (sesame, matcha etc.) During my visit I had the strawberry mochi with red bean paste and also the matcha mochi (the sticky rice mochi). For the strawberry one, to be honest there was nothing very special about it other than the fact that the mochi is made fresh (as opposed to ones that you can buy with ice cream inside at the grocery store). It was nice and soft with a good bouncy/chewy texture. The matcha one on the other hand is quite traditional in the sense where they used a high quality matcha with no sugar added to it so it had that bitter and strong aftertaste. So for those that are used to store bought green tea ice cream and prefer sweeter things, I wouldn't recommend it but for those that like high quality matcha it is definitely a must try. The inside is of the matcha was also just a standard red bean paste. Only reasons why I give HCafe 3 stars is because probably wouldn't travel again to get it but if you're in the area give it a try and also because it's quite expensive (the 2 together cost $7.50)"}
{"text":"I arrived at around 5 on a weekday, there wasn't a line and the ladies there were very nice. I got the original tiramisu and the Sakura cheese cake. Both of them were amazing. The best thing about Japanese desserts is that it's not too sweet and nice and creamy. The whole concoction is very well-balanced. 

However, the prices they are charging for one of the mini cheesecakes and tiramisu is ridiculous. Definitely too expensive to indulge in regularly."}
{"text":"I had heard mixed reviews about HCafe. For Uncle Tetsu lovers, they still tend to enjoy HCafe. For me, who thinks Uncle Tetsu is decent but neither good nor bad, HCafe bombed it. Yes, I understand the cakes are the same, but this HCafe location served an original cheesecake that felt like play dough texture-wise and tasted like artificial cheese. Although I don't eat the cakes from Uncle Tetsu often, the one we got from HCafe was admittedly the worst I had ever tried from the company, and I have tried several cakes from the flagship Uncle Tetsu store downtown as well as from Angle Cafe. For 10 dollars plus tax, it was also very small, almost like a single serving if you're good with sweets.  When you're at Yonge and Sheppard, opt for Love Me Sweet instead, which is opposite to HCafe."}
{"text":"I had the sesame tiramisu and Sakura cheese cake. The sesame powder is so rich and creamy, first bite taste like matcha but very delicious. Sakura is a bit too sweet for me but the texture is very nice and very similar to Japanese Yogan dessert."}
{"text":"YES, mochi ... delicious!
Strawberry, peach, traditional (sakura). Also came back to try green tea mochi. All I can say is, it is similar to the one we ate in Japan. So far the strawberry is my favourite. 
It's pricey ($4/mochi) but it tastes good, guilty pleasure for sure. I would go back maybe once in awhile if I crave mochi."}
{"text":"The ice cream mochi was made in house. You can choose between banana or kiwi flavour. I have chosen the banana flavour, the layer outside was a little thick, but flavour wise was good. 

The swirl cheesecake was very tasty. With a touch of chocolate, it makes it different and gives you a new spin on the original cheese cake flavours."}
{"text":"Their mochi's are really soft and delicious. Definitely get the peach and strawberry ones. As for the ice cream it's $1.00 or $1.50 extra for their waffle cone with sprinkles but their taro ice cream was really good. They do give a generous amount for a scoop. I would suggest skipping on their madelines...we found them a bit dry and we tried the chocolate, blueberry  and the honey flavour. Definitely pass on those."}
{"text":"Lived in the neighbourhood made it easy for me to visit, Sakura mochis are always the must.  Unfortunately I recently moved away from north York, but I made my way back last week, decided to grab their tiramisus and Sakura cheesecake, and of course, along with a Sakura mochi. My bf and I shared these little pretty delights. Tiramisus were very impressive, I couldn't get enough of the macha one. Sakura cheesecake was definitely very unique , made perfect both the taste and texture. My love Sakura mochi made my day end happily.
Highly recommend this place, will go back and bring friends, and hope they can soon open another location downtown."}
{"text":"Dropped by this newly opened desert place for a looksee. 

We tried an assortment of madeleines. These were a bit denser in the centre than what I'm use to. The matcha had the best flavour while the honey, black sesame and blueberry were ok. 

The black sesame ice cream with fruit and biscuit was delicious. Ice cream was light and fluffy with good flavour. A generous portion of fruits was nicely presented on top. 

Lastly the kinako and sakura mochi were both good. 

All of these deserts had just the right amount of sweetnesss.

Service friendly, establishment clean. 

3 1/2 stars"}
{"text":"Whew! Took me quite a while to find this place yesterday as Google maps wasn't very clear  but now I know where it is now. This H cafe is located inside that new green glass LCBO building near Sheppard, where presotea and other restos are.

When I got there, I was shocked by how small this place was. For a place named H Cafe, it wasn't much of a cafe as there are no chairs. If u wanna sit, there are a few benches outside. I was also disappointed that they don't sell original Uncle Tetsu cheesecakes.. bummer. However, they do carry other items such as many types of Madelines, mochis, no bake cheesecake, Sakura cake and ice cream. 

I got myself a strawberry Mochi. At $4, I find it is kind of pricey. I was told it can be kept at room temperature for a few hours. It was just ok. I might go back to buy the Madelines. The ice cream seems to have gone up in prices considerably so I ain't no hurry to try.

Btw it was really stuffy and hot for the few minutes that I was there..lack of ac or ventilation? 

Parking: there isn't much easy and free parking. U got to park on the street and walk for a few minutes or pay for parking in those lots nearby.

Payment: They take debit, cash or Visa but no MasterCard (+_+).

Washrooms are located on the 2nd floor if anyone of u wondering where they were (yes, I was looking for them too).


Verdict: will venture there again."}
{"text":"Originally I wanted the Macha flavour tiramisu but it was sold out ....so I ended up with the sesame. Surprisingly it turned out to be really delicious. Never imagine Sesame dessert can be that awesome. I also got their Sakura cheesecake. It was so pretty. Really love it. Top layer is jelly and bottom cheesecake is really soft and light. Gonna get a bigger size next time for my birthday~"}
{"text":"HCafe is very small and can be tricky to find if you're not familiar with the area. If you're coming by subway, follow the signs to the Poyntz exit from the Yonge Line platform then take the right exit past the fare lines towards Poyntz Ave/Emerald Park and it's in the building at the top of the stairs.

Their no-bake cheesecake is amazing and I know I'll definitely be coming back to try all the different types. Tried some of the madeleines as well but found them to be a little too dry for my liking.

My favourite item of theirs is definitely the HCafe Special which is an ice cream cup piled high with fruits, chocolate, sprinkles and cheesecake wafers. It was a little pricey at $9 but I totally felt it was worth it for all you got. The taro ice cream was the best but I definitely want to try it with either the coconut or matcha ice cream flavours as well.

They always seem to have new samples to try and the staff are always very friendly."}
{"text":"A new Japanese cafe in the Yonge and Sheppard area that offers different selections of mochi, madelaines, angel hat cake, cheese cake and ice cream. They just opened so looks like they're still ironing out the kinks but for now I give them 3 stars. We got:
- Orange daifuku mochi: It was interesting! Basically a whole mandarin orange wrapped in mochi. I prefer the daifuku at Tsujiri, but this was still worth a try. They also offer other interesting ones like kiwi (ice cream filling)
- Banana daifuku (ice cream filling and banana): delicious. I am hooked!!
- Strawberry chocolate daifuku - good
- Sakura no bake cheesecake: It was a bit too sweet and jelly-like for my taste. Though I heard they are affiliated with Uncle Testsu so I may go back and try their \"angel dome\" ones (matcha flavour).
- Mochi- found it sweet. We tried the sakura, sesame and matcha.
- Ice cream: It comes in a cute \"decorated\" cone. Stand out flavours were black sesame and taro (strong taste), while mango and ginger were like ones you get at the ayce places. They also have other flavours like matcha, strawberry, chocolate. Great value - $5 for 2 scoops.
- Original flavour Angel hat cheesecake - ok 

Overall, think this place shows promise. There's lots of competition in the area though so let's see if they can step up their game :) The ice cream is competitively priced but the daifuku and mochi are expensive at  $4 each."}
{"text":"Disclaimer: I love Taro and will go to a lot of trouble for it. 

When I heard there was an Ice-cream place near Sheppard-Yonge selling some of my favourite flavours, I got a friend to meet me there on a Saturday morning and try it out. They are located in the 'Emerald Building'. I actually am in the area quite a bit but I still walked around in the food court wondering where they were. No matter. Have found them and I think this will be my go to place for Ice Cream whenever I am in the neighbourhood.

I had Taro (Nom Nom nomnom - One of the best) and Red Bean Icecream. My friend had Black Sesame and Mango. She said Black Sesame was really rich (and good). I will of course try all flavours slowly but surely. 
It is a tad pricey but the portions are good. Also, there is no seating space. You'd have to find space in the food court."}
{"text":"Its hidden away in the building across from Whole Foods. Its really small. It can literally fit just a few customers STANDING. You have to do take out. There are seats nearby. The angel cake in the box and the madelines were all delicious! YUMMMMMMM. I personally think its better than Uncle Tetsu. I want to come back to try the ice cream! 4 stars for taste ****

EDIT: Apparently if you look at the merchant name on your credit card statement, it says Uncle Tetsu! So its the same owner........"}
{"text":"Saw a video about this place on facebook and I was just happening to visit Toronto. I was so excited...but when I arrived I noticed how small the shop was and most of the flavors were sold out. I tried the strawberry red bean...it was good just not what I expected. I think if it was strawberry chocolate it would taste amazing. The dough was very soft and yummy!
My stepson had the banana ice cream mochi. He loved it!
It was pretty expensive however and out of the way. It was like a 30min ride from the airport."}
{"text":"Update: Aug 2017
after being on the scene almost months, I went in today to get my usual and they raise their prices from 2 scoops/$4 (taxes in) to 1 scoop/$4 (taxes in) or 2 scoops will cost you $7.50+ Boooooooooooo

*****************
Initial review in July 2017:

It's a tiny place but the ice cream is really worth it. It's also cheaper, bigger portions and more flavours to add in 1 single cup!

Definitely authentic! So happy I finally found a place nearby that's better and cheaper than downtown ones."}
{"text":"This small dessert shop does everything well.  So far I have tried the cheesecake, a strawberry cheesecake cup and tiramisu.  All are very good but come at a slightly higher price than their downtown competition.  Good for individual servings.  The Japanese cheesecake comes in two sizes."}
{"text":"This place does not sell the original or matcha Uncle's Tetsu cheesecake. I bought a matcha mochi and found the red bean paste inside being too sweet. I did not like it and will not come back to this place again."}
{"text":"We got a Sakura no baked cheesecake for someone's birthday party! The cake looks absolutely gorgeous. This cake has three layers. The clear jelly layer on top with 4-5 Sakura petals on and a pink cheese layer under it, and finally a crust layer at the bottom. 

I think the cake overall tasted okay, more like 3.5/5, but I'm giving extra points because I'm really falling for the appearance of the cake! The top clear layer just tasted like sweeten jelly, I couldn't say if I tasted any \" Sakura \" fav from it. I am lucky to have a slice that has a petal on, and the petal texture was like a soaked seaweed . 

I think the main sakura fav is from the second pink layer. The cake overall has a light Sakura fav and the sweet balance is good. 

I have to say, this cake is at the more pricy end, it's pretty small for a $35 cake. Thou, I think it's still worth it to try and this cake is super pretty for people who likes to take food porn."}
{"text":"Review solely based on the mochi. 

Small little shop at the Yonge and Shepard station. Staff were very friendly in explaining the menu. They offer a smaller variety of their cakes compared the Angel cafe but this one has their Sakura cheesecakes and daifuku. 
They also have ice cream available on decorated cones and madelines. 

I came here to try their mochis. They were priced at a little $3.54+.  I only got the strawberry one because the other fruit flavours didn't appeal to me. They also had banana, peach, orange and kiwi.

In my opinion the mochis were just alright. Nothing special about them. The flavour of the rice cake was ok, chewiness was there but I still prefer the ones from Hong Kong flavour wise. The ones in Hong Kong have a hint of Coconut to it which make it more flavourful. But I guess they do it a little different because they are Japanese.  As for the fruit inside. It was a little disappointing, the fruit didn't taste fresh and juice. It was more of a mushy strawberry.. and I probably would've preferred it better if there was no red bean. 

Overall, I would not recommend getting the mochi. In my opinion I didn't really like it and it seems overpriced for something so small. I would probably opt for the ice cream, cakes or the Madeline instead."}
{"text":"I've tried a couple of items now at H cafe and I like the idea of it, perhaps more than I actually like the food items themselves. 

So far I've tried a couple of the Mochi treats and the ice cream. The ice cream I found to be not that special, reminded me of ice cream you get at a Japanese buffet, im not sure the novelty is there for me. The Mochi were interesting, not sure how I felt about them! 

The store was really cute when it first opened, I love the bright interior. It seems that they keep posting things on the walls and it's getting a bit cluttered looking. Also it looks like the hype has died down quite a bit, when they first opened there were crazy lineups for a while but you won't find that anymore. 

Overall a nice little place to pick up a treat, there isn't anywhere to sit so you'll either have to find a spot outside or in the nearby food court or take your treat to go!"}
{"text":"Nice addition to the Yonge-Sheppard area. There was only one guy running the shop, so the line moved a bit slowly (fine by me).

I ordered the banana mochi, sakura mochi, and Yuzu no bake cheesecake. Total for all three items came up to about $15.

Banana mochi was surprisingly good. It had a cheese custard flavour with banana in the middle which was very refreshing! I highly recommend this item if you like banana flavoured things and mochi.

Bf and sister agreed with my assessment.

Yuzu no bake cheesecake was okay. I wouldn't order it again, but it was nice to try. I was thrown off by the gelatine texture, but the flavour was there.

The Sakura mochi was the most disappointing of the bunch. I couldn't taste any Sakura. Instead, it just tasted like sticky rice with red bean paste. 

Red bean paste was good, but the Sakura mochi part is questionable. Overall, I would give this place another try and sample some other items if I'm in the area again."}
{"text":"Dont miss out on HCafe's grand opening buy one get one free promotion at their new Yonge and Sheppard location! The promotion only applies for their daifuku fruit mochi ($3.54 for one), offer ends July 30th!
When I got there they only had strawberry and peach flavors left so I tried both. The strawberry one was good, tasted refreshing but wasn't as good as the one I had in Korea. Its a mochi stuffed with a strawberry wrapped in red bean paste. The peach one was disappointing, mostly because the peach fruit was raw and not ripe, tasting hard and not sweet at all.
I would get them cause it's buy one get one free, not sure I'd pay the price for them individually.

Black sesame traditional mochi ($3.10)
This was not what I expected it to be. It wasn't exactly a mochi as it was more like sticky rice as the mochi skin rolled in crushed black sesame, stuffed with black sesame paste. Super rich is black sesame, you can distinctly smell the black sesame. Not that sweet which was good, no artificial flavors. Really filling though, cause of the rice."}
{"text":"Closer to 2.75 stars. Came by here to get Uncle Tetsu Cheesecake but now it is called Hcafe (Whatda...?!) Anyways no line ups on a clear Sunday afternoon a bit unusual. I know that Mr Tetsu opened @ Pacific Mall so maybe this one got affected? Maybe Cheesecake Factory has an impact? Nah! Had to buy something for a party. Middle of tourist area of Unionville in an old two story house.
Ordered the usual Macha cake. The good: They have more variety of desserts. The bad: Never heard of the Hcafe. Got 50/50 reviews by other Yelp and TripAdvisor evaluators under the new company. Paying same $10 for cake but they don't have proven formula yet. They say it is the same but I would think that Uncle Tetsu would get ingredients protected some how under some IP right.The Ugly: Well I opened it - these cakes are good when eaten fresh. Verdict ... drum roll pls...just ok. Most of the guests said the same thing. Tasted better. I felt like I had déjà vu, all the hyped up expectations of a BvS film before watching it and left completely  dumbfounded after watching the film. Was that a BvS like the comic?? Was this cake same as Uncle  Tetsu?? Came in to buy Tetsu got Hcafe. No pix needed here, No kidding :(  ...   $-$$"}
{"text":"Came out to try out the hype of the ice-cream and mochi dessert. The ice-cream was just like any other Asian ice-cream that you can find at other dessert places. But as for the mochi I had the strawberry mochi which was amazing tasty!"}
{"text":"I went here during the period of their opening a few months back when they had the promotion of BOGO, my friend and I both got mochi and ice cream each. I wanted to try the strawberry mochi but didn't eat it till the next day. I refrigerated it and it was still delicious as the red bean paste really complemented the strawberry. For ice cream, I thought it was really good and strong, I got the green tea and taro flavors with sprinkles. I made a mistake of pouring chocolate syrup on it because the sauces were 0.50 extra but the bottles were right there so it was my mistake haha"}
{"text":"I went for a Sunday afternoon pick me up.  I chose the peach, matcha, sakura, and kiwi mochi. All very unique and delicious. The peach one was the exact sticky mochi consistency with large pieces of sweet diced peaches. The matcha one was wrapped in rice and coated with matcha powder that gave it the perfect amount of bitterness. The sakura was red bean wrapped with sweet sticky rice (my second fav). The kiwi one was my favourite because the combo of chewiness from the mochi, smooth vanilla ice cream and sweet fruit centre. Only turn off was that the stem was left on the kiwi that needed to be removed. Thought they were really expensive $3.5 to 4/piece but worth trying."}
{"text":"HCafe is located right at Sheppard-Yonge Station (Poyntz exit). I stopped by a couple of days ago to pick up some Daifuku Fruit Mochi. It's a popular snack in Japan and the ones here are filled with fruit pieces. The mochi had whole pieces of fruit, which I liked. I tried strawberry, kiwi and orange. 

My favourite was the strawberry one, which contained red bean paste as an extra filling. Overall, the mochi had a glutinous soft texture and was a good sweet snack. Do try to eat them within 2 hours (when left at room temperature), or they will become mushy."}
{"text":"This review is for the daifuku:
Daifuku was taken out of the freezer. It was extremely cold and hard to bite into. The fruits in the daifuku were super sour. Would not recommend. Go elsewhere for daifuku !!"}
{"text":"I have only tried the ice cream in this place. Very disappointed, I expected to get something more smooth and different from grocery store, maybe at least made in the store. The ice cream tasted like getting straight from Asian supermarket.  Seriously You are better off getting ice cream from m2m across the street. 

One star for the employee who seemed very friendly, but that doesn't make me going back."}
{"text":"It's called a cafe but it doesn't provide you any seats for resting and chatting. It's more like a small come-buy-and-take-out bakery store. The daifuku and mochi are very sticky but a bit over hard. It was difficult to bite. And the mango is not that delicious. But the madeleines are very nice! They are fluffy and tasty!"}
