{"text":"It was not what we expected, we found it more of a sports bar then a Bistro.  There was one couple when we arrived and they left before our food arrived.  With only two customers there was no need for two TVs to be blasting a hockey game.  The waitress was friendly but not great, my glass of wine didn't arrive until my meal was half eaten.  She kept serving the beverages & food across the table from over my shoulder, I thought for sure I was going to be wearing a drink or some food. Took her quite awhile to bring water, we had to ask twice.
My Butter Chicken (around $18.00) was OK but no better than Vindaloo's Butter Chicken which is less expensive and a larger portion.  The Fish and Chips, were mediocre at best,  the chips were frozen not fresh cut and Fish was over done.  The Korner Pub do a much better job with Fish & Chips. 
Parking was not a problem, the plumbing place and the massage parlour were both closed.
I know they haven't been open too long so hopefully they can iron-out the kinks."}
{"text":"Just opened up and we decided to try it out. They have a mix of different dishes from Hamburgers to Indian food. After speaking with the Chef we found out how much of a  talented individual he is with a lot of experience on his shoulder that shows in his dishes. One thing I will recommend is the Butter Chicken. Now I'm South Asian, and I've been to almost every Indian restaurant from Brampton and throughout the GTA, and this little Bistro has \"THE BEST\" butter chicken I have ever had in Toronto, which was surprising to me since it doesn't specialize in Indian Food. Pricing is reasonable, with the most expensive dish being around $28 and the rest median around $15-16. Totally recommend the joint."}
{"text":"Went this morning for the Brunch.  New restaurant in the area.  Both my husband and I enjoyed our meals.

Chef owned and operated.  Good food and congenial service.

Dinner will next."}
{"text":"Started with calamari. Had the fish and chips, sub the fries for onion rings. Wife had the butter chicken. Good food. Owners a really nice guy, great chef. I will be returning. Recommend this place"}
