{"text":"My experience here was much better than my expectations!    I expected to have a decent lunch in a dive bar. What i had was an incredible lunch in a warm, welcoming, dive bar. The staff were very accommodating, friendly and attentive. The food was much better than expected and the prices were great!  I will gladly come back and bring my friends with me."}
{"text":"Ate here for a casual work outing with several coworkers.  All in all I really like this place!  I have to admit that when I looked at what little information I found online and on Facebook, I wasn't too thrilled at the prospect (essentially I didn't see much overall).  I'm glad I didn't judge a book by its cover.   On the upside, the owner and her staff were incredibly accommodating to our group.  As the lone vegetarian in the group, I was a bit dubious about going to a bar for lunch.  I don't often have the best choices to choose from.  But when we called ahead to notify them of our group, they put together some specialty vegetarian food items they normally don't have in order to give me more choices overall.    And when the food came (breaded mushrooms, Vegetable stuffed peppers with rice, sauce and mashed potatoes), I was pleasantly surprised.  A very good, decently priced filling meal.  Normally I don't expect much in the line of bar food, but this was a step above others that I've had.  Seriously reminded me of the stuffed peppers my mom used to make.    Additionally, my other coworkers who ordered a variety of other foods all loved their meals; from regular stuffed peppers, to wings, chicken sandwiches and burgers.  All good accounts of the food.    In regards to the bar itself, in many ways it's a typical 'dive-bar'.  Dark wooded atmosphere, but not dirty or run down.  Also a lot of space, a dance floor, stage, pool table and separate party room that was being utilized as well.    No major downsides, but the beer selections are rather 'standard' (little to no craft brews).  Also a non-operational pinball machine and ski-ball machine were near the entrance, maybe still waiting for repair.    We talked with the owner and found out that she's working to make a lot of changes to the place.  Gotta say, I like the changes so far, and will be going back!"}
{"text":"Garbage!  Old and creepy & regulars who stare at you.  Food menu looked horrible and not sure if food should be consumed in this dump."}
{"text":"I stopped in here for lunch recently and had a lovely time. It was very quiet, so I got a lot of personal attention from the owner and the bartender. I had the patty melt, and it was fantastic. I ended up hanging out for a while to work and have a coffee after finishing lunch. This place should have more fans!"}
