{"text":"The revamped location has a lot of menu items , we go the charcoal bamboo burger with the 6oz patty. it was ok.  The 4 oz . patty was not on the menu. They have a lot of new items that don't add any burger value I mean I don't think zuchinni on a burger is my top requirement.   Ok to visit I guess but not a great change."}
{"text":"It's a good location and there are tables in the court yard. I would think the food trucks nearby have better tasting burgers but this was a quick bite and we were trying to eliminate getting sick on our vacation so stuck with the \"chain restaurant\". Overpriced and cheap with the drinks."}
{"text":"Hero Certified Burgers are not the best burgers in the GTA but they are pretty good and are ideal for this location.   There are still great (and cheaper) options at the Food Trucks located on the Queen Street stretch of Nathan Philips Square but none offer the range of toppings or vegetarian or piscatarian options that Hero offers.  If you are at Nathan Philips Square for skating and are maybe a bit concerned about bacteria, especially after you've taken off your skates, the packaging of a Hero burger lends itself nicely if you want to talk sanitation.  You only need to hold the wrapper to eat your burger."}
{"text":"Burgers are pricey (cheapest burger  alone is $7.50 plus 13% tax) plus you gotta pay extra to sub a veggie patty in another deal.... c'mon Ok, u r in Eaton centre but u wanna live, don't u?  Tasty, yes the veggie burger on white bun (shiny, crispy like a pretzel) was something I liked & now hv it often. Let's give them another try, shall we"}
{"text":"Ideal location in downtown with reasonably priced food and often very short line up. But beware that their poutine is a little too salty (as it was in my case)"}
{"text":"Great location, decent burger!  Getting a prepared to order burger and then sitting on the square to eat and people watch - this is why Hero at Nathan Phillips Square is perfect.  They do offer gluten free, veggie and other divergent menu options which is greatly appreciated.  The burgers were large and fresh.  A great picnic stop!"}
{"text":"They say they are open until 10pm, but when I go there at 9.10pm they said open only for the drinks.. Total bullshit. While other locations don't  do that, probably you guys should change the timing or be specific that you close for food and not for drinks."}
