{"text":"The beef hero burger patty, spring greens, creole mustard, smoked provolone cheese and tomatoes combo, would have tasted good, if not for the craptastic bun. The bun was dry, somewhat sweet and not very fresh. I was really excited for this to be the best burger place near work, but I think I'm going to stick to the Angus beef burger on the ciabata bun at McDonalds.  The fries were very short, NONE of the fries i got was more than 3 inches long, not so convenient for dipping. I got \"hero sauce\" for dipping my fries in on the side, which was a mild mayo-ranch sauce with some herbs, which was the best part of my meal. The coke was flat. Total waste of calories.  Not going back here again."}
{"text":"Lots of choices in ingredients to build your dream burger.  I appreciate the halal free range meat!  My burger was a little bland, but it did taste fresh.  Many gluten free options and a friendly, knowledgeable staff, great for my wife with Celiac disease.  It was a little pricey and the dining area is nothing to write home about, but I still wish we had a franchise in Michigan."}
{"text":"Not bad of a place to go grab a quick bite to eat. Better than mcdonalds they have a great selection of condiments you can put onto your burger and located right next to King Station."}
{"text":"went there today for lunch - clerk was talking to his girlfriend, who was sitting at nearby table playing on her laptop - very unprofessional  burger was tough - tomatoes were hard and old - probably will not go back again"}
{"text":"This place... kinda sucks.  I was craving fries one day, so before taking my lunch break I decided to look up some restaurants in the area that served fries. I settled on this place because they had neat ketchup packets (yes, something as silly as that can convince me to try a place out).  The price of the fries wasn't outrageous. It's also close to where I work, and I walk by it sometimes on my way to other places in the area. So I decided to give it a try.  The fries were terrible. Potato cut, but all very short in length. All very greasy. I'm glad I grabbed a couple of napkins because I ended up trying to soak as much grease as I could from each individual fry before consuming them. It did not taste good at all.  I can't comment on the burgers, but if they're anything like the fries, I would steer clear of those too."}
{"text":"When Hero burger first opened up ... it seemed to be a breath of fresh air - finally a decent burger joint.  since then - gourmet burger places have become the latest craze. Instead of upping their game to remain part of the mix, hero burger seems to just get worse and worse.   today's lunch highlights: not busy at all ... yet it took 25 minutes for my order to come. my friends who ordered after me got their food first.  when my food finally came - burger was ice cold.   the service was quite unfriendly and as mentioned - slow. though after much hesitation the manager did give me his business card with \"free burger\" written on the back. (not sure i want it?)   the quality of the burgers (even when hot) don't even come close to craft burger - so if you're craving a burger and in this area ... just walk around the corner to craft. your taste buds will thank you."}
{"text":"I don't eat beef, but I enjoy both turkey and chicken burgers.  I had a chicken-burger craving and heard rave reviews about the burgers here so I decided to give it a try.  I noticed the blackened-chicken burger and being the spice-addict that I am, ordered that rather than the \"grilled chicken burger\".  The way of picking up food is not the most ideal.  Even during the lunch-rush the one person taking orders was expected to pick up the food and \"deliver\" it to the end customer.  This is ok in a place like McDonald's where everything is pre-made and must simply be assembled by the cashier, but this place didn't seem very well organized in that sense.  It made the cashier have to allocate her time between taking orders and serving food.  When you can see your food waiting for you and the cashier repeatedly ask for the \"next person in line\", it can be pretty aggravating.  The grilled chicken was not only not spicy, the way blackened chicken should be, it hardly seemed to have any flavor at all and was kind of dry.  I was definitely disappointed by this \"certified\" burger joint, but I decided to go back to try some Poutine.  I'm not a big fan of gravy, but the fries were ok and at a time with no rush, the service was speedy.  Ambiance is much like McD's though, not much like a place that appears to pride itself on the quality of its food."}
{"text":"Restaurant: Hero Certified Burgers Cuisine: Burgers Location: Entertainment District Address: 79 Yonge St Price Range: ~$10  1: Poor 2: OK 3: Good 4: Very Good 5: Excellent  Food: 2 Service: 2 Ambiance: 2 Overall: 2  Extra information:  *Self-service *Fountain drinks refillable *Choose your own toppings  I Ordered: Hero Burger with ketchup/mustard/pickles and Hero sauce with Fries  You pick your own toppings here- and apparently you can't say 'Everything please'. Because when I did, the cashier looked at me funny and said that's a lot of toppings, you need pick each one separately. Ummm...you give me all the toppings if I ask you to! To be honest I just said everything because I couldn't bother to go through each and every topping picking out what I want and don't want. But anyways, I ended up getting it with ketchup, mustard, pickles and red onions on my burger. It took awhile but I am assuming it's because they make it fresh.  My burger was alright- it wasn't smothered in sauce which was a good thing in this case, but it felt a little too dry. The beef patty was very thin and small in size, almost shrunk a little. It kind of looked like those beef patties you get at cheap markets that are used at school BBQs. I went with regular fries and it came in a little folded up bag which was kind of cute. The taste.....was not cute at all. I felt like they almost sprayed it with water after deep frying them. They were soggy and just horrible.  Summary: If I ever wanted a Burger, I would choose Big Smokes or McDonalds."}
{"text":"Pretty good for fast food. I feel their chicken and beef is quality meat compared to other fast food chains. Italian Chicken deluxe is expensive though 10$ for just a sandwich."}
{"text":"I'm a fan of Hero Burgers. The burger I got was good as usual (I had it for breakfast at 11am as the restaurant opened) but what I loved about this location was the Pop machine - it was awesome! You can literally make a mix of any pop you like (bottomless) and there are flavors you wouldn't normally find at a regular pop machine (Cherry Coke, Vanilla Coke, etc.).  I'll be back here for sure - even if it's just for the pop."}
{"text":"Tried the Hero Burger and their Signature Burger it was just okay. You will be paying about 8-9 bucks for a combo. i would rather go elsewhere for my burger and fries like McDonalds or Wendys"}
{"text":"Got this delivered so fries were a bit soggy. Takeaway packaging is super cool for the burgers.. makes it easier to eat. Drink order was messed up. Not too many chicken burger options. But you can customise a lot with the toppings. Great if you're a picky eater. Overall satisfying lunch meal of the Hero Signature combo."}
{"text":"I'm not quite sure why ANYONE would go here when Smoke/Craft Burger is right around the corner and GBK is a couple blocks away"}
{"text":"The Good: -Coke freestyle machine!  It's so fun to make my own drink.  My recent favorite is half Coke and half strawberry Sprite. -Good value:  $11.18 for a veggie burger combo (includes fries, unlimited freestyle soda, and tax) -Clever ketchup packaging allowing the flexibility to squeeze or dip -Clever burger packaging making it easy to eat while using the wrapper to hold the burger -There was seating available during rush hour -Halal certified meat -Add to your burger at no charge: Relish, Sliced Pickles, Jalapeno Peppers,Red Onion, Tomato, Lettuce, Ketchup, Mustard, Zucchini Relish,Hero Hot Sauce. -Variety of sauces to choose from: Creamy Honey Dijon, Hero Certified Sauce,  Mango Sauce, Maple Chipotle BBQ, Real Ancho Chipotle, Real Horseradish Dijon  The Bad: -The veggie burger (Soul Burger) was bland and disappointing.  Even with the Real Ancho Chipolte sauce, I didn't taste much. -The service was kinda slow as they only had one guy taking orders and they get pretty busy during lunch time. -The dining area was dirty and the garbage was overflowing.  All in all, I don't need a hero, at least not a vegetarian one."}
{"text":"In my last trip to Toronto, i decided to give Hero Certified Burger a try, since it was close to our hotel and, most importantly, they have a veggie option for my girlfriend.  I went for the \"Heavy Hitters\" combo. The burgers are above OK and below WOW, compared to main chains (McDo, BK, Harvey's, etc.), they are definitively superior in both quality and -unfortunately- price.  If you are visiting the city on a budget and don't want to spend above $25 in a couple of combos avoid; in the other hand, if you want to eat a better-than-regular-chain burger I certainly recommend you this spot."}
{"text":"Oh Hero, I am a fan of your burgers but not always of your service....  Came here last week, looking for my weekly meat fix. I have developed a small addiction to their burgers - my staple menu choice is the 6ounce hero burger with cheddar cheese combo with fries and drink  ($11 totally worth it).   My issue with this location was two-fold; the speed of service was slow. A few people who ordered after me got their meals (me thinks they forgot my order). The front guy was attentive enough to check up on it, but still, defeats the purpose of coming to  fast-food joint. My other (and much larger concern) is my burger came without hero sauce :(. That sauce is the bomb, how could they deprive me...I had to go back to the counter and hand back my burger for placement of sauce. I dont really like doing that, because now there are additional hands touching my burger after I have unwrapped it. And what if I had gotten take-out, I would never of known until I was alone in my apartment, sniffling over my sans sauce burger...  Overall, this experience will not tarnish my love of the Hero burger. But I will be more selective on locations where I pick it up. I think I'll try liberty village or Esplanade next time...stay tuned :)"}
{"text":"I ordered a Blue Moon combo, it was my first time. I was impressed with the presentation of the burger and fries. The packaging makes it easy to hold while your eating, thus reducing spillage, if any. They have the new coke freestyle machine, where you choose from all sorts of different flavours. I tried the diet lime coke, and it was delicious. The fries were perfectly cooked, and are with skin; I find fries with some skin have more flavour to them. Now back to the burger; it has to be one of the best burgers I have ever tasted. It was perfectly cooked, the texture was excellent (it wasn't too dry, or to moist- just right), the bun and condiments came nicely together. Everything, that was in the Blue Moon burger complimented each other, in terms of flavour, making it a pleasure to eat.   I will be going back, I just wish they offered a student discount- something like 10% off for students."}
{"text":"I'm not sure why all the hate for Hero Burgers...as far as overpriced small to medium sized burger chains go, they are pretty good. I still don't think I'll ever get used to the fact that a burger combo is going to set you back between $11-$13 depending on what you order but it is pretty much the average at all of these more \"premium\" (or whatever) places. What's a veggie burger loving guy gonna do (besides hit up BK or Harvey's)?  The Soul Burger (aka veggie) is perfectly tasty despite what a few people have said. Decent patty and bun, plus the toppings are quite fresh. I do hate the stupid way that they package the burger...it's meant to be sort of like a wrap that you hold while eating the thing but I always have trouble with it. A petty complaint, I know. The fries are also pretty good and I especially like their patented \"Hero Sauce\" for dipping, although I do hate that you have to pay extra. Again, that's pretty standard though...I always had to pay extra for Lick's \"Guk sauce\" and this is no different. Speaking of which, what ever happened to Lick's? Are they pretty much dead?   But I digress.  As for the location itself, I have no complaints. Service is just fine, they have one of those sweet Coca-Cola Freestyle machines (with unlimited refills) and free, albeit spotty, Wi-Fi. Again, I think that $12.50 for a takeout veggie burger combo is a tad high but that's the going rate. It's called \"don't be so lazy / forgetful and bring your bloody lunch to work if you're going to complain\"!"}
{"text":"First time going into a Hero Burger joint and probably my last.   Overpriced burgers with sub-par taste/quality in the beef patty and bun.  Sweet potato fries were thin, short, and didn't taste any different that the onces I bake at home.  Moving on..."}
{"text":"When I mentioned to a friend that I was going to check out Hero Certified Burgers, I was told that it was a fastfood restaurant.  Overall, it is probably the closest comparison, but it feels slightly a notch higher.  The burger wasn't greasy and was quite tasty. I was pleasantly surprised by how clean the restaurant was, as well as the friendliness of the staff."}
{"text":"I feel the quality had really gone downhill with the competition of Craft Burger and Gourmet Burger which are superior"}
{"text":"I can concur with a fellow yelper who had said they had craptastic buns.  Of course, I had to figure this out for myself.   One afternoon, not so long ago I had a terrible craving.  A girl, should know not to pick a place because it's literally right beside all the other places she needs to go - and on top of that, not busy.  I had no idea, this place was a chain.  I should have though it had all the tell tale signs not to mention the cafeteria tray. LOL.  Fun times!  I ordered a burger. A fairly basic one with greems, mustard, mayo, ketchup and onions. Nothing too wild for i wanted to sink my teeth into that meaty patty.  I was bummed. I mean it filled my stomach but didn't feel my craving for a real burger.  The patty just tasted like pressed meat and the bun nothing special.  i left after my meal. Shaking my head.  I'm glad I tried it for now I know where to avoid even when I am in a hurry."}
{"text":"I have to say these burgers were AWESOME. I was in town from Washington and everyone here always raved about Hero burger. I finally tried it and now I know what everyone was talking about."}
{"text":"Can I do negative stars? Blown away with how bad it was. I was expecting beef, not something that was fat and oil with no sense of blood ever having been part of the structure of whatever animal this patty was made of. Let's just say once you see it, and notice it doesn't look like meat, you'll bite into it and confirm that it doesn't taste like meat either. Tastes like the frozen beef patties that you get from a supermarket. Only redeeming quality of the place is that they have free refills with their pop. If you want a better burger, I'm sad to say you can find it at McDonald's of all places."}
{"text":"I came to this Hero Burger to get a fill-up after a game downtown and frankly, will pick somewhere else. First off, for a place that's absolutely and probably predictably packed, I expect to see more than one person at the counter. Second, if there's only one person standing at that counter, they best be crazy good at the job. This guy was not.  The line up to order food moved slowly because the guy at the counter was clueless, and the packed place had to have had at least a half dozen people waiting in line to collect their food, never mind ordering and paying for it, all glaring at the lucky ones who managed to masterfully acquire a table through what must have been some kind of magic.  After a good 20-30 minutes- ridiculous by fast food standards, no?- of waiting to get a grilled chicken burg, this thing was dry. The bun eclipsed the chicken, the topics were nothing to write home about although not terrible, and I was wondering where on earth my money went. It wasn't the onion rings- tiny portion and I'm pretty sure they charged extra to change from fries- nor was it the beverage, a serve-yourself fountain machine that probably costs under a quarter per fill.  It's unfortunate this place found an ideal location; it's a license to print money. I won't return."}
{"text":"I was disappointed with Hero Burger.  I tried their bleu cheese burger back in April and expected it to be juicy and delicious, but the meat was subpar."}
{"text":"Another location with lots of hate. Again I'm not sure why. The burgers are tasty and made fresh to order. I would gladly wait a few minutes to get something better than the typical fast food place. My order has always been right when I've come to this location, or any Hero location for that matter now that I think about it.  Bonus points to the fact that Hero now has the Coke freestyle machines."}
{"text":"Of the three Hero Burger locations I've been to (Yonge Street, First Canadian Place food court & Queen Street West), this is the one that's given me the least trouble. My order is always right and the food is consistently decent. So as far as Hero Burger visits goes, this is the location I reach for most often, and the first addition to My Decemburger list.  I ordered my usual (Soul Burger Combo) today with avocado, goat cheese (essential on a burger - seriously, try it!) and fries, and everything was great. My only suggestion would be to throw some lemon juice into the avocado because at 9pm it was looking kinda grey. There are free, self-serve drink refills.   As is the case with most Hero Burger locations, the washrooms are very, very scary. Hey, at least that's consistent, right?"}
{"text":"What kind of a burger place is out of all kinds of bacon? Come on. Burger was decent. Not the best or worst I've had. Fries were okay."}
