{"text":"Hero Burger is probably the worst burger joint out there. My friends and I decided to come here to get a bite. What really got on my nerves that they had poor management. They only had one person running the place. His position was the chef/cashier. The burger was not cooked good which led me to feel sick. I'm never going back to this place and I will stop eating Hero Burger."}
{"text":"Fries were cold and soggy He dressed the burger before the meet was done so the bun was soggy too...  But this location is never busy cause its no good.. So you wont have to wait"}
{"text":"Not sure why there are so many low ratings as my visit there was pleasant. By reading the reviews, they're pretty old so maybe they changed their management or team? This was my 2nd time at a Hero Burger and it was actually more pleasant than my first time. A group of friends and I came for some food on a Sunday afternoon during our visit to Wonderland.  It was around 4pm, and the restaurant wasn't busy at al. I ordered the Blue Moon combo with a side of fries. It's basically a burger with mushroom and blue cheese. Fries were hot and crispy and the burger was pretty good too. All my friends enjoyed their burgers as well."}
{"text":"I didn't really enjoy my burger. I had a 4 oz hero burger with regular toppings and I had to agree with the review from below. The meat was chewy. The bun didn't even taste fresh. Nothing special about the fries either. Service was great though! I love the guy who helped me. He was really nice."}
{"text":"Dangerous food handling ALLERT: Although Hero Burger is known for its good food, it is also known for its pride in offering Gluten free food, and they offer \"Gluten Intolerance/Celiac Disease Statement\" on their website.    I was severely disappointed, with their lack of knowledge and food safety handling. As i ordered  gluten free meal, and had stated on multiple occasions that everything MUST be gluten free due to a food allergy, i came home to find that my Gluten free burger was in a regular white NOT gluten free bun! had this been my first visit, i would not have known that something was wrong, by simply looking at my food, luckily i hesitate to consume the food, (and after discarding the one bite i initially took) right away i contacted the store directly and they in fact confirmed that the food was not handled properly, and the bun was NOT gluten free! Due to their negligence they had put me a serious risk. And were not willing to accommodate properly, resolve the issue professionally, and the manager would not return my calls! i am currently contacting head office and waiting to hear back. A very disappointing and not to mention seriously dangerous situation! :(  p.s i was also feeling quit ill from consuming a small portion of the poutine which was claimed to be gluten free.  I had to be heavily medicated to get through my evening.  Terrible experience :( thank goodness i opted out for eating the burger!!!"}
{"text":"I've had hero burgers before but the one I had today was weird. The meat had a weird texture, it was kind of gummy, not something that you expect from a place that charges almost $14 for a combo.  I would post a pic but I already started eating before writing this.  The cheese also had a weird plastic like texture.   I don't think I'm loving the burger.  However, the staff is nice and the establishment is both new and clean.  They also have a cool new coke machine with a ton of beverage choices.  Maybe they need more practice making burgers.  I'm with Tasha D ~ I don't know if I'll be back.  This is probably a 2.5 star kind of place...closer to 2 stars and further away from 3 stars.  As a premium priced burger place you expect just a little bit more."}
{"text":"Wouldn't take my order by phone when I was on my way there with no time to wait for it to be made after I arrive. It's a shame that places lose business like this. I decided not to go there but go the other way and find a different place to buy my burger."}
{"text":"Hero Burger is where Lick's used to be, on Jane Street across from Wonderland. To be honest, it didn't thrill me. I'd probably give it a 2.5 *, 50%, a barely passing grade. 5 Guys on Major Mac is way better. The bun here was good and although the burger looked juicy... it didn't taste juicy. Reminded me of Mondo Burger from the movie \"Good Burger\". Also, the cashier was sitting with a friend. Napkins are behind the counter, ketchup wasn't given to us, and there was no spicy mayo for the sweet potato fries. So I had to ask for everything as I needed it. I felt like I was interrupting her personal conversation, it was awkward. But I needed napkins. The high tech Coca Cola machine was good. All the flavours tasted kind of the same. The fries were mehhhhh, the sauce she gave me for them did not taste good and the sweet potato fries just tasted weird with ketchup. I don't think I'll be back unless I'm craving watery cherry coke."}
{"text":"During the summer months, this place an get quite busy due to its proximity to Wonderland. I don't find Hero Burgers to be the best of all the burger joints out there....but that is strictly personal preference, as I know people who love them. I find their burgers rather bland and dense and the buns non-descript. With the huge variety of burger places out there....I chose elsewhere to go. Staff are friendly at this location and there is ample parking."}
{"text":"I can be your hero (burger) baby!   Just went to Hero Certified Burgers for lunch with Tasha D. It was an awesome lunch. I got a 4oz hero burger with goat cheese. It was actually really delicious, especially when the hot sauce combined with the goat cheese to create something out of this world: Hot Goat Cheese (HGC). Highly recommended.   I think what sets Hero burger apart from most other burger joints is their epic burger bun. It was delicious! They also have an amazing amount of cheese options. I combo'd my burger but substituted regular fries with sweet potato fries. They were okay but to be honest I prefer A&Ws sweet potato fries (they're cheaper too). The sweet potato fires didn't come with spicy chipotle mayo for dipping, so we asked for a dipping sauce of their chipotle. I had good expectations but neither me nor my gurl really liked the chipotle. It's very \"different\" from typical chipotle. I thought I would like it but I didn't.   The best part of the meal, next to the HGC, was the drink machine. They have one of those \"Coca-cola Freestyle\" drink machines that literally have over 50 flavours of pop that one can choose from. It's quite wonderful. The inside  of the restaurant was clean and spacious, with surprisingly comfortable seats. There weren't too many people in there for lunch but I imagine the traffic will increase greatly when Wonderland near by opens up again.   Overall, my meal was delicious but quite pricy. So eat at your own risk. You get what you pay for (HGC)."}
