{"text":"Does not live up to the hype!  Got the carte blanche menu for my birthday and was disappointed that the cool dishes like the thing served.on the antlers, the prawn hot dogs in the treasure chest, and more of the tweezer delicate dishes were not served at all.  The menu I was served was uninspiring, bland, salty. Not what I had envisioned, it was lacking inspiration, complexity, components.  The wine pairings were basic at best.   Service was clumsy, our waiter couldn't remember what he brought us, the cutlery tossed on the table. He forgot our wine pairings until AFTER we finished our course.   For the class that this restaurant strives to be they lack in reaching the level of standards 4 and 5 star restaurants have.  The service needs to be meticulous, silent, consistant, present, and always anticipating the next step.    The food needs to live up to the standard guests expect. When they post dainty and delicate dishes on their Instagram, I expect to be served the same type of dishes. The food was so heavily salted it was distasteful. There were no surprising elements to any of the dishes.   The carte blanche is suppose to be 9 courses but we only got served 7 courses.  I dont include amouse bouche or bread as a dish. Also no palette cleansers between courses at any point?? Odd.  Wine pairing included a basic vermouth and rum. None of the pairings brought out anything special to the dish.  Overall Hexagon is good food but not the tasting menu restaurant they depict themselves to be.  If you're expecting the next Michelin star restaurant, it's not here and won't be in the foreseeable future."}
{"text":"Dinner  4 course dinner at 60CAD pp  Food: 4/5 (Good, but not a spectacular meal).  Service: 4/5 (friendly, helpful and unpretentious, but needed some prompting e.g. water, though they did indulge us w/an extra helping of bread)  Value: 4-4.5/5 given we were full (and I can eat a bird in a sitting) and some of the flare associated w/how it was plated. But not cheap.   Tips: make a reso in advance. if you miss your reso you lose 30$ pp deposit. So don't. There is a smaller bar menu than Alo Bar and like Bar Alo reso is not needed for it. Though Bar Alo has a dedicated space for its bar, this place has a few chairs at the bar. Saw their cafe (don't know operational hrs, closed during dinner) that is tucked away. No corkage.  Repeat: Perhaps   Final word, is this the next Alo? Well after eating at Bar Alo (food comes from the same kitchen), I don't think Alo merits any hype, leave alone wondering if it might qualify for a Michelin star (not that star=yummy food always). This place is good, but it's no next anything other than another good resto in the GTA that might merit a drive from TO and more so if you're already in/passing the area."}
{"text":"This is a fantastic new restaurant in Oakville and probably the best restaurant on the west side of town. The octopus was incredible, perfectly smoked and sauces done delicately. Mains of duck and fish were perfect and balanced. I would rate this restaurant at or above Alo in Toronto.   Definitely get a table by the fireplace and the service and servers were great.   Would definitely go again and Thanks for a wonderful night!"}
{"text":"This place moved up quick and with an odd Costco trip in the middle of the week this place was a no brainer.  I rarely come to Oakville and last trip was eons ago to a touristy place. The pics don't do justice to the setup of this establishment as its done very well. Lots of symmetry and Hexagon shapes where it suits, good for people who admire this sort of thing. For moi the amazing part was the open kitchen (two sides wide open) and the place didn't have a hint of food smell. Bravo for achieving this rare exhaust magic where the smells from an open kitchen didn't permeate into the dinning space as we were seated almost next to a prep space. I didn't get the idea of not having a sign outside restaurant though as we had to look for the address to find the place. A personal quirk perhaps? They do require a non refundable deposit for evening service which is fine IMO though one could have walked in on a weekday from the crowd I saw late in the evening.  The service aims to please from the get go and is quite courteous though there are some gaps (more on those later) I had gone through the menu already so had picked out what I wanted. Here is a play by play  Octopus: Top marks here. Hit it out of the park from the start. Gorgeously grilled on charcoal yet perfectly tender and interesting sauces on the side where one senses the heat from the sauce yet no bite. Squid ink tortillas were OK. Foie Torchon: Served with house baked brioche and with cashew and rhubarb compote. I luv my foie gras this was a decent take on this luxurious dish. Brioche was good.  Beef Tenderloin: Cooked rare. Meat was tender and I enjoyed the sauces on the side. Charred artichoke was quite good and even overshadowed the beef which is a pleasant change.  Pinata: Hmm more of a gimmick IMO. I had very high expectations here hence felt a bit of a let down. I guess its really hard to elevate a creme brulee as there is only so much one can do. The white chocolate pinata stood out. I tried the rhubarb & almond dessert which was a better option.  I tried a glass of pinot noir which paired well with the foie and steak.  Now for the service while I understand they were quite courteous from the get go there were some gaps in between including a couple of reminder that gratuity should be on the total and not the amount payable on the bill with the adjustment for the reservation deposit! We did get a freebie dessert to take home which is appreciated.  At this price point I don't think one is allowed to have lapses of any kind. 4 Stars though I am intrigued by their brunch offering so might revisit to try that out."}
{"text":"Ratings: Food: 9.6/10 Drink: 9.5/10 Service: 10/10 Value: 9.5/10 Hygiene: 10/10 Aesthetics: 10/10  From start to finish, this place was a delight.   We started off with the vieux carré and the signature l'hexagone.  The vieux carré is traditional dry cocktail with a smooth finish. The rich flavour of the herbs from the Benedictine and the bitters are what truly stand out. They made sure to leave a large block of ice rather than small cubes to prevent rapid dilution.  The l'hexagone was a very light and refreshing cocktail, the chartreuse serves to really emphasize the pineapple without leaving a heavy dose of sugar on the palate.   We settled on the 4 course meal, and I had the drink pairing to match with it.  When they brought out the bread, it looked like a flaky pastry with the egg wash, but upon cracking into it, it was quite   My first course was the beef tartare paired with the béarnaise cocktail. The wasabi peas in the beef tartare added a hint of the wasabi flavour, while giving the dish the crispy texture.    The foie gras terrine was coated with a crunchy layer of hazelnuts (not 100% sure) that just balanced out the butteriness of the foie gras without compromising any of the richness.   The charred octopus itself was cooked to perfection, not overly chewy from undercooking, yet not crumbly from overcooking. The emulsions added the right amount of flavours to fit right with the texture.   The agnolotti and the pork belly were both amazing from the tastes I got of them.   The duck was amazing, texture and tenderness were perfect. The sauce really sealed the deal for me. Pairing was excellent and really enhanced the flavour.  Of course no meal would be complete without dessert, and we ended up getting the piñata. The idea is really cool, breaking a chocolate piñata over the rest of the dessert. I think the flavours truly made it though. I'm not usually a fan of banana desserts, but I was amazed with how well it turned out.  The portions were decent and I left comfortably full. The cost was also very reasonable. That being said, if you're looking to stuff yourself, you shouldn't bother.  The design and decor of this restaurant is so beautiful, definitely going for a Swedish minimalist. Everything was like art. From the floors to the water containers. It was not over the top, just enough to bring a feel of 'hygge'.   The service here was very attentive and courteous. They have a coat check out front. The staff always kept my table clean and my water full. Gio, our waiter, made sure to check up on our table at least 30 times. It was not intrusive and he even adjusted the pace of our meal so that we would be able to enjoy our conversation.  A great restaurant (easily my favorite in Oakville). Would definitely recommend this place without hesitation."}
{"text":"We went for a late Mother's Day brunch at Hexagon, sampling their 3 course $75 prix fixe menu. The reservation required a deposit of $30 pp, so we were definitely committed to go!   Perhaps it was because we were a late seating, but the service and food were very subpar compared to our expectations, especially because we love 7 Enoteca as well, and they are run by the same owner.   Food: Overall, I was expecting more innovation in their menu items, especially after reading the wonderfully detailed Toronto Life article (https://torontolife.com/food/restaurants/whats-menu-hexagon-chef-sean-macdonalds-fancy-new-french-restaurant-oakville/). However, the dishes we had were not very exciting, quite standard, and the flavours did not balance each other well.   Appetizers: There was the choice between an Asparagus Salad and a Warm Potato Salad. The asparagus salad was essentially charred asparagus doused in bearnaise sauce, with no other texture of taste profile except for the charred bits, a touch of rye bread crumbs, and an overwhelming butter flavor (which usually, is by no means a bad thing).  Main: This was one of the biggest disappointments, but I had the braised beef short rib with a deep fried potato rosti, with egg yolk and morel mushrooms. The egg yolk was interesting, but the morel sauce on the rosti was extremely salty. The braised beef was, to its credit, very tender and flavorful, but coupled with the very salty and flavorful morel/rosti combo, it was just too rich, with nothing to balance it off. Braised beef also generally feels like a cop out on prix fixe menus (I feel like almost 2/3 summerlicious menus will offer some variation of it), so I was disappointed in the selection.  Dessert: Japanese cheesecake with pop rock berries, and a chocolate cake. The Japanese cheesecake dessert was fun and interesting, mainly because of the mix of texture and flavor from the pop rock berries and the cake. The chocolate cake was a disappointment, and I liken it to those wedding cake slices at the very end of the night that nobody wants to eat. It was tasty, but it broke apart in ways that indicated it had been left out for a while.   Service: There was nothing particular to complain about the service, apart from the fact that it just felt generally cool (as opposed to warm and friendly). He said all the right things, the plates were served mostly simultaneously for the 3 parties, and service was prompt, but it felt a little on the robotic side.  The kitchen is very open, so you're able to watch the chefs cooking and plating. Despite it being very interesting and cool to watch, you definitely could smell the butter and everything they were cooking because the restaurant is relatively small (for restaurants with an open concept kitchen like this).  Cocktails:  These were quite delicious! The L'hexagone ($24) with the lavender and basil was strong, tasty, and pretty, and very appropriate for a summer drink. The pine nut old fashioned ($18) was also interesting, but you can find better cocktails in Toronto for the same price.   Tips: - It's hard to find if you're unfamiliar with the area, but it is the corner of the town square, between Ben Thanh and Piazza Bistro. - If you have some time to kill before / after dinner, head to the lake and take a walk around the lake and dock! It's a lovely park by the water, with the occasional rock sculptures, and on a clear day you can see a clear outline of the city of Toronto."}
{"text":"4.5/5. Finally tried out hexagon during the week. The menu is a multi course meal only but good selection in each course. Very unique ingredients in each. The meal took over 3 hours however. I personally didn't mind at all as I hate spending big money on meals and finishing up within 60-80 minutes. The plates are all small however but by the end you should be satisfied. They don't do the individual ice rocks for their old fashioned however which is big importance to me."}
{"text":"A true 'Michelin Star'like experience, starting from greeting to the table, including the creative amazingly delicious food options and wine pairing. A perfect place for special occasions. If you feel like splurging, go for carte blanche tasting menu and pair it with wine and cocktails.   I recommend the octopus entree for dinner, as well as the hot dogs made of prawns. For brunch menu, I enjoyed the frisée salad made with fresh micro greens and poached eggs. My husband loved the meaty hearty eggs Benedict that was served with asparagus and pork belly.   The deserts are delicious. They use a lot of flavored custard and nice and smooth fruity flavors. I recommend the citrusy ones. My favorite coffee is honey butter; it is made with whipped butter and honey, very creamy texture and so much taste to enjoy it!"}
{"text":"Firstly it took us too long on cold blustery day to find Hexagon. It is very well disguised in the town square. We were told by staff that's the way the owner wants it, he doesn't believe in the prevention of a sign or a street number. Huh?  Secondly apparently that same owner instructs his staff to call their customers by their first names because that's what they all do, lifted straight from your reservation. Huh?  The lunch we had was good not great but the Barolo available by the glass was wonderful.  Would we return for a tasting menu diner. Unsure."}
{"text":"Exeptional service and spot on food. Right in the heart of downtown Oakville, hexagon offers a 4course tasting or a 9 course tasting, my girlfriend and i did the 4 course tasting menu and every dish was beautifully plated and the taste A1.  Service was very professional.   The upcoming Alo. Watch it!"}
{"text":"Having been open for 2 months or so, Hexagon is already attracting quite a following with Executive Chef Sean McDonald at the helm and Rafa Covarrubias as sous chef.  The exterior of the restaurant is so plain that you would be forgiven mistaking it for a residential entrance. The dimly lit dining room was modern with a gorgeous hanging fireplace at the back and beautiful hexagon shaped lights on the ceiling.  For this visit, we opted for the 4-course tasting menu ($60), with some cocktails to start our evening. The pine nut old fashioned was of a respectable calibur, but nothing to write home about, as were the other cocktails my companions ordered.  Our server started us off with some pain au lait, which were absolutely delicious. Having had the pain au lait at Alo (considered a course there!), I would say this pain au lait is better. There was a nice denseness to it, and it was a joy to eat with the butter provided.  We all chose the Charred Octopus as our first course - beautifully plated with splashes of \"ink\" salsa negra, sweet teardrop peppers, avocado mousse, fresh coriander and 2 tentacles. This came with 2 squid ink corn tortillas - one to make tacos out of the dish, and the other to clean the sauce off the plate with. I thought the flavours were interesting, especially with the teardrop peppers. The charred octopus on the other hand could have been more tender. A good start nonetheless.  For the second course, I opted for the pork belly, and my companions the Truffle Shallot Agnolotti, and the Foie Gras. Pork belly was tender, jucy and flavourful but I immediately regretted getting it upon tasting the other two dishes. The Agnolotti was little heavenly pillows with delicious truffle mascapone bursting out upon biting. The foie gras was perhaps the best foie gras mousse I have tasted, accompanied by Montreal style mulberry & poppyseed bagels.  Beef Cheeks with salt cured & cold smoked rainbow carrot, accompanied by a beef & carrot juice emulsion was a respectable main course. However it paled in comparison with the dry-aged pan seared Duck Breast, with a cube of duck confit on the side, cabbage and fermented black garlic sauce - absolutely delicious  The highlight of our evening was undoubtely the dessert, The Hexagon Pinata. The presentation was striking - with a white Chocolate pinata (encasing Dulcey chocolate pearls) hanging over a bowl with Swiss-style Meringue and blackened banana icecream. We were asked to break the pinata with a spoon which made a satisfying crack. The taste of the dessert was phenomenal and this dish alone was well worth the visit.  Overall, I would say Hexagon can easily make the top 5 restaurant list in the GTA and I would highly recommend a visit here."}
{"text":"We celebrated our 9th anniversary by trying the 9 course tasting menu. And overall I'd say it was a great night. Food, ambiance and service were all very good and worth the price. I love the open concept of the whole place. But I would strongly recommend asking to sit on the patio. It looked amazing. We were seated near the open concept kitchen. Which was not bad at all. But the patio would be better for people watching I think.   There were minor hiccups. The drink we ordered was not chilled so we had to wait for that. But they offered a complimentary alternative while we waited. So not too bad.   Each course took some time to get to us. But not too long that we felt it. Or that we were starving.   We did not leave hungry. Even if each portion was small and I was left wanting more after each one, just to keep the flavour going. 9 courses is a lot of food. And that does not include the amuse bouche at the start or palate cleanser before dessert and a bonus macaron at the end. They were also very good about catering the menu to our food preferences. I asked that we not receive anything with pork. And they obliged.   At the end all the chefs in the kitchen signed the menu for us to keep and the head chef came over to ask how everything was.   The most memorable is the piñata dessert of course. But also the charred octopus appetizer. And duck main dish. But it really is hard to pick a favourite. All were great.   I think we will go back for brunch just to give that a try. But I do recommend this if you are looking to be pampered and money is no object. You won't be disappointed."}
{"text":"4.5 stars... Food is perfect and normally I'd give Hexagon a 5 star if not for a service blip at the end.   I'll probably return for dinner.  Maybe not as quickly when I first started my brunch but worthwhile for sure.  I can't express my surprise at Hexagon... the calibre of the restaurant is normal for any large metropolitan.  And yet here we are, in the heart of Oakville, with a place that changes every perception of what a 905 restaurant can be.  It's not to say a suburban GTA restaurant can't be refined, excel at gorgeous plating, bring out amazing flavours from ingredients, or have a beautiful atmosphere ... it's just not done.  Till Hexagon.  As mentioned, the restaurant is beautiful.  The lobby area splits off into the dining space and their cafe which has gorgeous pastries and specialty coffees.  The cafe does have a few bar seats by the window so it's not only take out option if you just wish to relax.  The dining space is open to the kitchen and the attention to detail is noticeable immediately.  The statement wall where it has agate slices mounted just draws your eyes immediately.  The amazing gem like minerals just takes all the natural sunlight and brings the wall to life.  The rest of the room is designed with dark azure blue leathers, burnished slate metals, and dark marble table tops... it's one of the nicer restaurants I've stepped into in Toronto and GTA.  Hexagon shaped lighting and hexagon shapes are found in the details everywhere.  The floating fire pit is another interesting room focus.  Service here is subtle and attentive.  It's not stuffy and they do try to make a connection as they help with the menu.  I appreciate how all servers are helpful regardless who is the primary server.  It makes for a flawless experience...till the end (more on this later).  Brunch menu is similar to most upper end Toronto restaurants... except Hexagon quality surpasses.  You can find everything from a regular big brunch (egg Benedict), sweet offerings (french toast), and healthier options (salads).  Though the menu reads like a regular dish, expect the dish to have a wonderful twist to elevate it.  Also, their tea offering is the famed Kusmi tea.  Definitely appreciated as it has a better flavour than most other brands.  Pain Perdu (French Toast) - After trying probably every french toast in Toronto, Hexagon's version is near to the top.  It's so indulgent that it almost feels like dessert.  Instead of a slab of bread dipped in custard, it's torn pieces of bread layered into a bread pudding ... baked, cut into a perfect rectangle, and then seared crisp.  It's the perfect custard and not too sweet.  It's accompanied by sweetened ricotta, berry jam, and bourbon maple syrup.  5+/5  Beef Cheek Hash - Beautifully plated tender beef cheek sits on top of a medley of potatoes, sun dried tomatoes, oyster mushrooms, and the most perfect poached egg.  The tastes just matches the appearance.  The beef is rich and savoury and if you pierce through the egg, the yolk just coats everything in a golden sheen.  The bright & tart sun dried tomato flavour is a nice pairing to the beef.  My only wish for this dish is to have the potato to be crispy... they looked crispy but they were just soft.  It would have been a great contrast to the tender beef.  4.5/5  Almond Croissant - Hexagon also does viennoisorie and wow, do they ever do it well.  This was delicious.  The crispy shell just unleashes shards of buttery croissant pieces as you bite through.  The almond pastry cream (?) was delicious.   It's one of the better almond croissants I've had in a long long time.  5/5  Banana Custard Tart - Hexagon tempts your will by wheeling out the full display of all the amazing desserts on a cart to your table.  How can I say no to amazing desserts?  Vanilla beans flecked in creamy custard, held in buttery shortbread crust, and topped with bruleed bananas. It was very delicious. 5/5  So about this service blip... normally once I'm done with a meal, I like to wrap it up and explore.  With downtown Oakville, it's ... limited.  So we spent time chatting afterwards and aware that the restaurant was about half full.  So we weren't thinking we would be rushed out before their brunch service was closed.   Well, after our coffee was done... the wait staff dropped off the bill without our asking.  Brunch service still had an hour before it closed.  He then returned within a minute with the card payment machine... to emphasize we needed to leave... now.  No prior mention that they needed the table or that they hate to rush us and we had a time limit.  It just felt too pushy... especially when it is a forced abrupt voiceless action from the staff.  Did we need to stay? No... but it could have been handled much better from them.    Overall, incredibly food in an amazing space and tastes that normally is reserved for the very best spots in downtown Toronto.  Definitely worthwhile... just hoping service keeps up with the food."}
