{"text":"????

Chongqing-style noddles with shrimp, ????"}
{"text":"When sour meets hot, it's just the perfect combination of flavours. It's even better with the sweet potato noodle as it soaked up that rich sour broth. You can choose your own level of spiciness and I've medium spicy which is just right for me. The noodles has the right chewy texture but a bit too thick and quite filling. And of course the best is to order it with intestines. 
We also tried their Chongching style noodles with pork belly, again the noodle is chewy and has the right texture to hold the broth. The soup was not too spicy but gave enough tingly feeling on your tongue. We aren't fan of their traditional dry noodles with minced pork as compared to the noodles with soup."}
{"text":"This is probably not for everyone, it tailors to those who like hot and spicy food.  They specialize in Szechuan noodles, and I've never tried it prior to this.  Personally I love it because I like spicy food.  Although you can still choose the spice level, it is still more spicy than many other places, so the suggestion is not to swallow too fast as you will feel strong kick in your throat.  The noodle makes me want to eat more and more.  Pork belly noodle is their significant dish and I personally like beef stewed noodle as well.  The noodle itself is yummy and the pork belly is so tender and delicious.   The service is decent in Chinatown standard.  The only complaint is meat portion tends to be low comparing to noodles, but I will still come back to try other items."}
{"text":"I can't comment on authenticity but taste wise, it wasn't great. 

- noodles are soaked in a thick layer of oil
- felt sick after eating it
- noodles were kinda mushy and weren't chewy like other Chinese styles of noodles or ramen
- beef was salty
- wasn't much flavour except \"numbness\" which might be typical of sichuan cuisine
- side dishes weren't anything special

Wasn't worth the trip and paying parking. Service was alright and food came out quick."}
{"text":"The spicy and sour noodles with beef or pork options are my favourites. I have also tried the noodles with tomatoes as well as the one with Chinese mushrooms and stewed chicken which are also quite tasty. Most dishes come with peanuts sprinkled on top with cilantro and other garnishes. If you can tolerate spicy, I would still recommend their most popular beef noodle dish. Service is mediocre but food is good!"}
{"text":"Hooray! Authentic Sichuanese noodle dishes in downtown TO! 

It was fun coming here as a non-Chinese person who speaks Mandarin - I overheard someone at the next table say, \"look, a foreigner is eating here\" (just as you might hear in China). The waitstaff spoke English & Mandarin, and took careful note of my peanut allergy, which I appreciated. 

The \"Chonqging mixed noodle\" - not sure if I'm getting the name precisely right (?? in Chinese) were lovely - nice and spicy, nice broth, just salty enough, nice mix of toppings from preserved vegetables to an egg. Based on my experience eating in China, I can say the flavours were completely authentic. 

On a return visit, I tried the dumplings (????), which were not as tasty - the dumplings didn't seem as fresh as they could be and overall the dish was a bit bland. Stick with the Chongqing noodles!

ETA - the decor is very basic, but you're there for the noodles, who cares."}
{"text":"I ordered a less spicy Xiaomian($6.5) and a side dish($3.5) , I am disappointed considering price :(
Also, too much seasoning."}
{"text":"We order their special braised port noodle, which is ok. The meat was on the cold side. My wife order their hot and sour noodle and it is surprising good. The booth is very well balanced. They let you choose how spicy you want your noodle. I would recommend less spicy if you are not into hot food. Their plum juice tastes home made."}
{"text":"Me and my friends went in the evening when we were the only ones. The restaurant itself is quite small, only a few tables. The wait staff were all very nice and friendly, and the noodles itself were great (especially for portion sizes and the price, I got the $6.99 special). 

I'm not sure why (maybe family?) but a few members of the wait staff were sitting at the table beside us talking to each other in a not-very-quiet volume. It wasn't too loud though, just a little strange.

I took off one star because one of my friend's order was messed up, she had asked for no chili oil in the soup. Otherwise it was great."}
{"text":"Been looking for good Chongqing noodles for a while now. Had some free time for lunch and gave it a trial. Very similar to the flavors I've had in china. Ordered the spicy and extra numb #11. Bang on flavors. Had extra noodles. Definitely will come back. Recommended if you like authentic chongqing spicy and numb flavors."}
{"text":"I love spicy Szechuan food and this authentic Chong Qing style joint hit the right spot. The restaurant is tiny, just 4 small tables,  8 seats and some bar stools. (Definitely not a good place for a group or kids) but the food is very spicy and authentic. Inside of noodles, we ordered two mini hotpot which came with rice, and a cold chicken in chili oil. All three items were delicious. Can't wait to return."}
{"text":"The staff was friendly and the food was fantastic. I've been searching for a chilli oil noodle spot for the last couple of years and I'm glad I found this place. Really oily, but somehow not sickening. The beef noodles were amazing, the meat extremely tender. The broth was red...I mean, RED, but flavourful. If you are looking for spicy, ask for really spicy."}
{"text":"very authentic sichuanese noodle, really liked the numbness. try the noodle and the skewers, it is very spicy and numb. most of the noodles are from the same base, it is just the meat added in there later is different, we tried a beef one and a plain one, both are very good."}
{"text":"This recently opened place has a great variety choices of Chongqing noodles, side-dishes and rice. The noodles taste amazing, although a little pricy. The side dishes we ordered were a bit of a let down. However, the server was polite and friendly! We'll definitely come back for their noodles!"}
{"text":"Szechuan province style soup noodles, great little local spot for those who have the capacity to handle spicy food well. Not much meat given in the bowl, but hey, free noodles refills all you want."}
{"text":"We ordered one chongqing style noodle and hot and sour potato vermicelli with eggs. They were pretty good, but the potato vermicelli could be more sour. Chongqing style noodle is vegetarian according to the waitress. It comes with just noodle, broth, chillies pepper, cilantro, green onion, peanut, sesame, a piece of lettuce and zhacai(a kind of preserved/pickled Chinese vegetable). The zhacai, chili oil and sesame provided most of the flavour.  The hot & sour vermicelli has similar ingredient with minced pork. Vegetarians can ask to take the pork out. The broth is heavier compare to the chongqing style one.

Seems like peanut, sesame and cilantro are in all the noodles, so if you don't like any of them or have allergy let the waitress know when ordering. There's options for spicy level, and adding extra noodle or vegetables. Not all the noodle dishes come with egg,    I would recommend getting one( if you like eggs) only$1.

Overall, the noodles are good, not stunning, I will come back to try other items.I had to agree the service here has LOTS OF room for improvement. The servers are friendly, it did took a while to order our food, but the food came shortly after."}
{"text":"So after a meeting in the Sheppard & Yonge area I was a bit hungry and looking for options at 9pm. I didn't feel like korean cuisine or any big chains like Boston Pizza or Jack Asters so I found myself stumbling into Hey Noodles tradition Chinese noodle shop. Coming in there I had zero expectations for the quality of the food and service. When I think Chinese cuisine I always think decent food and crappy service. Boy was I wrong. The noodles were done just right and I was so impressed with the polite and patient service! Kudos to the ownership for hiring people that actually give a crap about the clientele. Order number 1 regular spicy!!!"}
{"text":"All I can say is, so far I have been here a few times... tried their menu and I still crave and think about it day and night. 

Although they are on the pricy side for china noodle soup. But... what can I say? You make money to satisfy your stomach right?

There are a few \"Hey noodles\" around the block; however there is a difference if you know how to count Chinese characters or know how to read their Chinese name. I like this restaurant a lot more compared to the other one who has opened 3 different location (North York just down the street from here, Midland and downtown) I heard they are own by 2 different owners. I tried this restaurant and the other hey noodle with 3 location one. I personally prefer this one; their menu, and their flavor.

Their noodle is very chewy and has an egg taste to it. I really love how you can add noodles for free too. Their soup is flavorful no matter if you choose spicy or regular soup. 
Sour and spicy glass noodle is good too compared to other china noodle place. I love how they have a lot of soup so the glass noodle doesn't soak in all the soup by the time I'm half way done. 
Their hot pot noodle is a bit pricy imo, however it is a bigger portion with all the different veggie ingredients. Definitely can pack to go if you can't finish. 

Best thing, you can choose your spice level and if you wish to add or minus any ingredient(s) to your noodle. I haven't try their mao cai (hotpot veggie/meat) because I find it pricy and I can make something more price friendly at home. I haven't try their try their cold skewers either because I like my skewers hot. 

Anyway, definitely crave for their soup, noodles and flavor. 
Make sure you have patience to wait because the restaurant Is very small with 13-15 seat max. I got lucky, I usually go at times before or after dinner rush hour so I didn't really need to wait. At most I waited 15mins or so. 

Would highly recommend."}
{"text":"Not for the faint of stomach, fans of noodle soup can get their dose of numbing spicy flavor at this mainland noodle shop. We ordered the intestine soup with less spice and the beef noodle soup with medium spice. 

The intestine soup base broth was pretty basic and still had quite a bit of spicy kick to it. The intestines were chopped in thick chunks, which I find is inferior to thinly chopped intestines, however weird that might sound.  Bottom line is, it wasn't nearly tasty enough for me to want to see the bottom of that bowl. 

The beef noodle soup with medium spicy was pretty spicy, but in a 'masking all the flavors' kind of way, i.e \"numbing spicy\". If your into that kind of thing, then you should definitely go spicy here. The problem with numbing spicy is that you get all the taste of chili oil, and basically minimal taste in broth, beef and otherwise; erm not sure if I ordered noodles with spice or spice with noodles at that point. 

Though the flavors weren't bombastic, they did give hefty portions of noodles and decent amount of intestines and beef; the noodles were also a good texture and weren't soggy or anything, so that warrants some points.

I wouldn't come back here as there are so many noodle shops on Yonge st alone that offer great flavorful broth."}
{"text":"I gave this restaurant 3 chances. I love Sichuan food so I really wanted to love this place as it's right downtown. Unfortunately, I don't hate it nor do I like it. Would I come back here again? No, unless my friends really want to try this place. All the noodle soups are doused in chilli oil. It felt like 3/4 of the soup was chilli oil. I love spicy food, but the oil was way too heavy. Also, I think they used a lot of MSG. I felt very parched after. The side dishes are one dimensional. I tried their potato side dish, seaweed, and lotus. I'm just very disappointed."}
{"text":"It's hard to rate this place because I love it but there're things I don't like about this place.

Service: 5/5 staff was very quick and polite. Also the food came 5 mins after we ordered

Food: 3.75/5 I liked the noodles but it was too oily for me. It was impossible to drink the soup. Also I wish the noodles were more al dente. It's too soft for my taste. 

Meat portion: 4/5 I thought the meat portion was OK. Not the best but not the worse. It was enough meat to satisfy me... Especially since the noodles were so oily, it would've been difficult for me to devour more meat.

Price: reasonable and affordable. 

Atmosphere: 5/5 I liked the decor and how clean the place is. I like how clean the tables are... some restaurants I've been to still  have food residue on them...

I've been to the Hey Noodles in Spadina. The one here is less spicy... More mild even though I ordered the most spiciest one."}
{"text":"Very yummy!! This is an authentic Sichuan noodle franchise that delivers a centuries old balance of refreshing flavours in a bowl of noodles. Of course Sichuan cuisine is known for their duo flavours of spicy hot and prickly numbness, but they are not just about that. The noodles are soft and chewy, the pickles and peanuts are crispy and aromatic, and the rest of the many flavours strike a zesty (and spicy) combination that will not be found in other Chinatown restaurants. The shop is clean, has free WiFi, the staff are kind, but the noodles are pricey (5.99-8.99) compared to the amount of meat provided, but this is only because their ingredients are shipped from China. (Though I will take this place over pho anyday!!) Must try!!!"}
{"text":"I had high hopes but was disappointed. The service is uninspired and (especially if you don't speak Mandarin) uncommunicative. 

Don't order beef unless you really like tendon and stringy meat. 

The noodles are ok but nothing you can't boil in a pot at home.

They add 10% tip to the bill even for a party of two. Not classy. 

I'm not planning a return trip."}
{"text":"There are actually two Hey Noodles near yonge and finch area, but the one closer to Yonge was apparently \"closed until end of September\". I read the notice in October. Ended up coming to this one instead since it's a 5-minute walk away.

The size of the store is not bad compared to a lot of the other chinese places that have been popping up; they can seat more than 12 people anyways. The entrance is a bit weird because there's a little step going down, but it's just something to watch out for. The restaurant overall looks clean, with nice tables and random artwork hanging on the walls.

Their menu offers bowls of noodles on the front, and a bunch of appetizers on the back.
For the noodles, they are known for their spicy noodles, but you can customize how spicy and numbing you want the broth to be, along with garnishes. You can also add some extra meat or egg for a little $$.

Bowls are prepared quickly after ordering and served up. The size of the bowls are not bad, but you're looking at minimum $10 for a bowl with meat, less if you're ok going meat-free. The broth is quite oily, but that's to be expected since lots of places just use chili oils along with other ingredients. The amount of meat is not bad, and you definitely get a lot of noodles. I had it regular spicy and less numbing, but found that it wasn't that spicy. If you like spice, you might go with extra spice.

But, if you finish all the noodles and you still have a bunch of broth left over, this place offers free noodle re-fills to soak up that broth. Initially, we thought there might be some limit to how much we can ask for, but the waitress asked us if we wanted one or two bowls...and then we asked for 6 in total and we got 6 in total. Then we decided to get more noodles...and they came as well! Lots of noodles overall. Then again, they're just noodles...maybe if they had free veggie re-fills that would be more interesting!"}
{"text":"A quiet noodle joint for a night snack. Ordered Wentons on in bone soup and noodle soup intestines flavor both testy and in rich ingredients,and they could add extra noodles for free. Hearty!
*Asking medium level spicy is already too spicy!"}
{"text":"Finch Korea town is slowly turning into a Chinatown with all these Chinese places opening up. That's not a bad thing because I love a good bowl of noodles. And this place cooks up some solid noodles. 

This is a really different style of noodle vs Magic Noodle which is just a little north and across the street. There are some \"dry\" noodles as well, but I really like the soup ones with numbing spice. 

We both ordered soup based noodles. My partner finds the spice too much for her. To me, it's great. Be warned though, if you are not used to this kind of spice, it can easily upset your stomach. 

The noodle texture is different vs Magic Noodle. It's a more \"bouncy\" kind of noodle. it's interesting that they can give extra noodles for free. I would rather they charge a lower price on smaller portion instead. Speaking of price, everything is more expensive than magic noodle by about 1-2 dollar. Again, it's due to their free upsize which doesn't make sense to me. Oh well...doesn't matter. I'm a beast and always get large anyways. But it would have been nice if my partner can have a regular for maybe $1 cheaper.

I crave this kind of spice once in a while. I would definitely return."}
{"text":"One of my favorite downtown noodle places. I took a friend who had the original xiao mian before with me and he said it is very close. Highly recommend the noodle with minced pork and peas. You can ask for mild or spicy. It is very peppery. If you don't like the peppery and numb kind of feeling. This is probably not your thing."}
{"text":"Fast service and great noodles! Very limited seating within the restaurant. Portions can be a bit increased overall."}
{"text":"What to expect: noodle dishes and some cold Chinese side dishes. Everything here is spicy, but you can ask them to make it mild. I got the spicy wontons, the texture of the wonton wrapper itself was nice, but everything else was lacklustre. The actual chilli oil tasted very peppery, almost unpleasantly so. The pickled vegetables that they put in the sauce/oil was nice though. I also got to try some of my friend's cold chicken dish. I wasn't a fan but if you like cold chicken that tastes like Asian beef jerky then give it a shot. 

Prices were reasonable though, but the portions aren't particularly huge. I wouldn't recommend coming here since there's so many food options nearby. It's also not particularly easy to find. Definitely not worth the trouble of looking specifically for this shop, there's plenty of other noodle options you can try instead. 

FYI, they only accept cash and Interac."}
{"text":"The store is very small and smell very strong so I recommend not taking your winter jacket with you if you are driving.

The menu is doesn't have a lot of options and majority of the food are very spicy. The food is pretty good, very flavorful, and on top of all, they give extra noodle for free! Yayyy (^o^)

The restaurant only takes cash and debit."}
{"text":"Seen this place a while ago while walking up and down yonge street and thought to myself... that's a very long Chinese name for a restaurant. =p. 

The restaurant is narrow, has a couple of tables for 4 along one side, and a bench table on the other. When it's full, you may find yourself waiting 15-20 before getting a seat. 

Menu is pretty easy to navigate. One side has all their side dishes. Other side has all their noodles.  There are pictures to go along. Since it's a Chinese noodle restaurant, the menu is in Chinese, with corresponding English so non Chinese readers should be able to figure out pretty easily. 

I ordered #13 - noodles with house special marinated pork. It comes with your choice of toppings and spicy/numbness level. I decided to go with less spicy and most of the toppings. Extra noodles are free of charge!

Noodle is good. Not too soft and just enough chew. The special marinated pork turns out to be pork belly. The fatty part was cooked through and very soft. The meat part was just a hair overdone, but certainly still very good. 
Unfortunately, I can't comment on the soup. I got less spicy, so I was expecting to taste the flavor of the soup with a bit of a kick. What I ended getting was a lot of kick and a numb tongue and lips. Maybe you need to specify what level of numbness you want... or maybe less numb comes with less spicy.. I don't know, but I certainly could have done without the numbness. If what I had was considered \"less spicy\" and probably \"less numb/regular numb\", I can't imagine what regular or extra spicy/numbness would taste like!  

Service is nothing special. All in all, it's a good place and would consider returning."}
{"text":"Prefer this Hey Noodles location than the other one on Yonge as it's more spacious and the quality of the food here is better. 

For non spicy option, recommend menu #11 item which has chickpeas. The side dishes, such as the squid and beef balls, and pork feet are done fairly well. I like the sauce they put in the chicken feet. 

You can choose the spiciness, numbness and thickness of the noodles. Additional noodles are free!"}
{"text":"My friends and I wanted to try them out at the new location in North York. They moved from 5423 Yonge Street to their bigger location at 5306 Yonge Street replacing Thai Bistro.  It was soft opening weekend with a special offer of their signature soup noodle for $1. The location is somewhat renovated with more table space compared to the old location and Thai Bistro layout. They essentially took out the counter and added a long table in place of it.

We arrived when the restaurant opened and the wait staff were somewhat confused about the menu items and choices. By the time we were ready to order, the owner stepped in and told the staff the rundown.  You can order the degree of spiciness and extra stuff included in the noodles. To our surprise, the noodle bowl for $1 was regular size and it was fairly good.

The place started to fill up as we were finishing up our noodles.  At the end, the bill was under $5 before tip for the 3 of us. I may try the other noodles especially the one with shrimp next time I am in the area."}
{"text":"I tried the pork ribs tomato noodle soup and the soup was AMAZING ... If you like strong tomato taste but not sour, then you should give this a try. They also give free refill on noodles - not the best I've had in terms of noodles quality but the soup makes up for it! Service was really good - quick to serve and staff were nice :)"}
{"text":"Warning:   The heat gradually kicks in!  I ordered spicy with numb and the heat is fine.   It's not spicy to the point where you can't even put it in your mouth:  I actually sipped the soup base BUT once it kicked in, I was dripping (in sweat!).

Second warning:  the soup and the wonton had peanut mixed into the bowl-It's fine for us but careful if you have allergies since this is not the norm.

And the review:   The Service is good and fast.  The food was tasty and noodles were good.  Careful on the spicy level if you cannot handle it.  We loved it and will definelty come back.  We went to the Chinatown location but they actually have locations in North York and Scarborough.

One more thing, they added 10% tip to the bill which is fine but they should have told us....they do have a sign but I did not see it."}
{"text":"Disclaimer: This is my first time eating Chongqing noodles and I'm a medium spice eater at best, so this review is geared towards all you other uncouth noodle newbies out there who stumbled into a place like Hey Noodles in search of ramen lol

First of all, some education for all: Chongqing noodles or \"xiao mian\" are a street food style of noodle dish originating in Chongqing, China. It is made very simply using wheat noodles, Sichuan chili peppers and other aromatic seasonings (e.g. peppercorn), chili oil, and are garnished with peanuts, scallions, meats or veggies. Ver simplistic, very cheap, VERY SPICY. You have been warned.

I ordered the one and only vegetarian noodle bowl ($6.50) today for lunch, which featured a huge serving of ramen-like noodles (I got all excited, yayyy ramen) doused in plenty of chili oil and was garnished with 1 piece of romaine lettuce- omg where is my bok choy- lots of peanuts and salty Chinese preserved pickles. I was disappointed by the austerity of toppings, but perhaps more disappointed by how flavorless the bowl was. I'm not sure if the noodles were made in-house, but seemed like the grocery store variety. I asked for a mild to medium spice level and while it was okay, the numbing sensation of spices originating in this area of China masked all the other flavors of the dish. I think I was expecting something more like Japanese ramen, where the flavor is imbued in the noodles, but here the main flavor is tongue-numbing spice yet the noodles themselves are bland. 1/5 for the noodle bowl.

The appetizer dish was interesting though, For $5.99 you can choose 3 side dishes. I strongly recommend the \"fish tofu\", which is blocks of medium tofu flavored like fish. The lotus root and seaweed were sadly under seasoned and overly dependent on the huge amount of spicy chili oil they sat in.

The service was pretty good. Shoutout to the male waiter with glasses and cool hair - thank you for asking me if I wanted a new bowl of less spicy noodles when I was wincing in pain from the spice level! 

P.S. They do not accept credit cards - only debit or cash.

Next time I think I'll be going for ramen."}
{"text":"Who else have a love-hate relationship with spicy food? 

If you are like me who can only do baby level of spiciness, go for No Spicy when you order your noodles. I learned it the hard way the first time I went. i was struggling so hard to eat because my mouth was just on fire & pretty sure my lips turned into big fat sausages afterwards. It was pretty warm that day as well and the AC was not strong enough so not helping. TBH I hated my life half way through my bowl of noodles  but couple months later I went back again with family because I know they enjoyed spicy food loll This time I got the hot & sour sweet potato vermicelli and even though I got no spicy it still had enough heat for me. The glass noodles were chewy and went very well with the strong flavour soup base. This time I was able to finish the whole bowl and actually enjoyed it. After going the first time with hubby he said he is never going back again, but just last week he said he is craving for it. I bet there is something magical about their noodles."}
{"text":"I've tried the chongqing style noodles as well as the minced meat noodles (both were asked to be less spicy). They amount of heat was still quite elevated despite it being less spicy, but not overbearing. The noodles however, were slightly over cooked for my taste, limp and 

The minced meat noodle was quite delicious, very flavourful tasting a bit similar to zhajiang noodles with a lot of heat and in a soup. 

The chongqing noodles were incredibly bland despite mixing my bowl, I don't know if this is because I reduced the heat of the dish, but it lacked so much salt. As a result of the blandness, I poured in a generous amount of soy sauce that was on the table until I realized that it wasn't soy sauce but rather rice vinegar... It would have been nice to have them labelled.

I don't think I will return"}
{"text":"The portion is really generous for the price, staff are super friendly, place is clean."}
{"text":"I came here to check the location and try their noodle special. Last week and this week tue and thurs they have chongoing-style noodles for $1 (normally $6.5 in their menu), staff told me it was just noodles, for spice level I decided to go medium. Just a few tables of 4 inside, it was almost full but no line-up at 2 pm. For 1 person or 2 people they have a bar chair area with 8 chairs, it was clean and well-maintained inside. My noodles had peanuts, green onion, coriander, it was pretty yummy!!! I appreciate that they didn't cut back on the quality just because it is a dollar promotion, pretty decent food."}
{"text":"These are some of the best noodles to be had in Chinatown, and they are not even Cantonese style. It was my first time having Chongqing noodles, and the experience did not disappoint. First, finding this restaurant from the street was not completely obvious since it's somewhat hidden, but there were enough signs to point us inside to the right place. The space was surprisingly clean and nice, probably because it's so new. The menu is simple and to the point, with a picture for each of their noodles. We had the basic/original Chongqing noodles, which does not come with meat, and the minced meat noodles. The taste and flavor were on point. Surprisingly not too spicy, but lots of the mouth-numbing flavor that you'd expect from the peppercorns used in the sauce. Noodles had a good texture, and the rest of the toppings (cilantro, meat, egg, peanuts) all came together."}
{"text":"Place was small but service was very good and quick. Noodles were good and they have unlimited refills! Can customize the spiciness and \"numbness\" when ordering. Will definitely try again"}
{"text":"The restaurant is clean and bright. However, when I grabbed one of the spoons, there was still some leftover sticked to it, which was very gross. I ordered the beef brisket noodles. Although I asked for non spicy, the soup was still a little bit spicy but it was at a reasonable range. The soup was rich and a little bit greasy for me, but it might be okay for people who prefer strong flavour. You can add more noodles for free."}
{"text":"This has been my fav noodle place in this area since last winter! Always ordered the intestine spicy noodle and braised pork noodle. It's been always tasty! Good service too! It's so hard to find a fav food place around y&f and Sheppard. I'm glad I found one and pls keep up the quality!"}
{"text":"The restaurant front certainly leaves much to be desired, but the food is a must try!  Look past the simple interior and go for a bowl of whatever sounds good to you, it will not disappoint you!  Since having eaten at this place once, we've ordered take out a few times and still love the food!  Must try!"}
{"text":"As the name entails, this place sells noodles - and a few little dishes. Hey Noodles is an authentic Chinese chain that sells Szechuan style street food. If you like spicy, come and check it out."}
{"text":"Great service always, really delicious noodles and broth. Quite spicy, so be forewarned. Can choose thickness of noodle for regular handmade noodle, or the thick yam noodle (my fav that comes with the spicy/sour noodle). My go-to noodle place!"}
{"text":"Terrible place. The noodles are alright, the soup have a weird taste, probably I added too much chili oil, but it almost taste bitter.  Also, I o one pound of chicken, and they end up giving me a little over a half pound."}
{"text":"Great food but heads up it's cash only ! They said there's a sign in the front that says that but it's def not in English lol."}
{"text":"Roughly 8 minutes walk from North York Centre. Small place, air conditioned, simple menu.

The broth (separate bowl) was simple and flavourful and the dish included a generous amount of noodles. Free addition of noodles may be requested!

The service was efficient and quick. The wait in line at the restaurant was about 15 minutes since there were 5 four seat tables on the left and a slightly longer bar table on the right side of the open kitchen restaurant.

Ordered #11 - Classic Noodles with Minced Meat Non Spicy (need to mention, a bit of chili spice in the minced meat sauce). Noodles were chewy and soft and the chickpeas was a nice and unexpected addition! Satisfying and hearty lunch!

Toppings came with peanuts, green onions, cilantro, sesame paste, garlic and sesame seeds."}
{"text":"Not sure why a few reviewers gave this place a less than stellar review because everything I've tried here has been delicious. The noodles are authentic and really reminds me of what my Chinese mother would cook (but its like 100x better, sorry mom). I'm a huge fan of chili oil and I definitely get my fill of spice here!

I like the options of customizing spice levels and they even offer you plain pork broth to add to your noodles if you find the spice too overwhelming! The house special with the pork belly is my absolute favourite bowl of noodles ever and the pork is just unbelievably melt-in-your-mouth. The noodles are also springy and high-quality. Everything comes out quickly and is just as tasty every time. 

The owner is incredibly friendly and truly cares about her customers - including asking us if the spice level was okay and to get it spicier next time. Decor is cute and modern and a nice change from its neighbours. Even though I've been to the location in Scarborough many times as well, I prefer the food and service at this location. We've been here at least 5 times and can't wait to come back."}
{"text":"Closest to authentic tasting spicy chongqing noodle I have tried in Toronto...there is another place down the street with similar name, but the taste is way off.  I have heard the owner taking in Chinese, judging by the accents, this place is the real deal.  The vermicelli soup base is so delicious that I can just eat the vermicelli by itself.  Taking 1 star off for the hit and miss on the meat...sometimes you get very good pieces, sometime not...still my go to place if I need a fix for authentic spicy noodle!"}
{"text":"It's probably better to go to their other newly opened location. It seems that since the new place is opened, this one has slacked a little on the cleaning and general up keeping. There were a few flies when we went in and the table has a sticky spot on it. 

Food was still good though, the noodles were just the right amount of spiciness and portion size was big. They only take debit and cash."}
{"text":"Food was halfway decent for the omnivores in our group, but the staff was rude and unaccomodating to the vegetarian and there was a hair in the soup"}
{"text":"The worst restaurant I've ever tried in Toronto. The food there is unclean and tastes horrible. Don't go unless u want a stomach ache."}
{"text":"Small space, will not recommended for big group, however, is an option for late night eats. I tried the tomato noodle soup with minced pork (i asked for minces instead of beef sirloin like in the menu). Very huge portion and a lot of noodles. The tomato soup is sweet but not too tangy. The toppings came with peanuts, porks, green onions and half of the hard boiled egg, also chickpea is included but i never had chickpeas in my noodle soup before so its pretty confusing. Noodles are cooked perfectly, texture is soft but definitely not soggy. A little oily for tomato soup but i guess thats how Chinese noodle usually is. Space is decorated nicely and clean, has an asian vibe, bright yellow lights are also accommodating well with the interior. One down size is service was a bit shy and didn't speak english well so i skipped asking for recommendations because menu was not as descriptive."}
{"text":"Came here for Late night noodles coz a friend had wanted to try it! Noodles are the prepackaged nasty shit! Soup based are those nasty prepackaged Hotpot soup base that tasted like nothing! I ordered the \"recommended\" beef noodles, and my friend the Hotpot fried chicken vermicelli! They are very stingy on the meat! All I got was tendons barely 2 piece of edible beef when this was suppose to be a beef noodle! Prediction, this place won't make it past winters end! Don't bother! Best go next door at Artisan noodles or even around the corner to Big Beef Bowl or Sansotei! 
Disgusting! What's worst is they charge $13.99 & $10.99 for a bowl of all prepackaged stuff you can throw together at home!"}
{"text":"A plain looking exterior hides a tasty noodle shop!

With ramen and noodle shops popping up like mushrooms, it is becoming tough to stand out. Hey Noodles is a traditional Beijing-style noodle shop. Don't be intimidated by the lack of English as the servers were friendly and there is some English on the menu. The main item here are the various noodle soups. We ordered the Chongqing style noodle which we can add more toppings for 1 to 2 dollars each. to our delight, you get a big bowl of soup and a mound of noodles popping up. The soup base is simple but superb! I chickened out and got mild which was great but you can add some serious spice as well. Noodles were perfectly cooked. In general, a simple but delicious bowl of noodles!

Also, they are running an awesome promo - for Jan - they have a $1 special for the Chongqing noodles. That's right - only a buck for a great meal! It's a must try that can't go wrong!"}
{"text":"Very nice noodle! Spicy and yummy!! We ordered different kinds of Xiao Mian and we love it"}
{"text":"I Had #13 (pork, no spice no numbness) and my friends had #1 (beef sirloin). Soup was nicely well  seasoned and, noodle and the soup together was perfect combination. Not sure if it is egg noodle but it was great. They have 2 different for noodle: soft or hard. 
Beef sirloin was all fat though (1st photo), which I don't think my friend would give four stars but anyways my dish was yum. 
And they refill the noodle. 
Service and price wise- mediocre. 
I hope they put more vegetables in soup."}
{"text":"Noodles is extremely spicy, mouth numbing spicy. If you can't handle spicy they have a variety of different noodles, and all tastes pretty good"}
{"text":"This place has a rather plain looking exterior, but they do serves one of the best Chongqing style noodles in the city. There is some lack of English on the menu and service part but just try to point things out from the pictures if you can't read Chinese. For the Chongqing style noodle, you can add more toppings for 1 to 2 dollars each, and the best part is you can top up the noodles for free! AND UNLIMTED as long as you can eat it! The soup base is simple but superb! And if you can eat SUPER spicy just add some serious spice as well.  Noodles had a good texture, and the rest of the toppings like cilantro, meat, egg, peanuts all came together.

If the Chinatown or Scarborough location is too far I heard they just opened a new one in North York."}
{"text":"the soup v noodles ratios is really off, had way too much noodles (what a first world problem to complain about overabundance of food eh?). The soup was just oil, way too over-powering. However loved the Sichuan tongue-numbing spices as always."}
{"text":"WHAT TO TRY?!

Their many different types of noodle soups. 

I tried the vegetarian soup noodle because they were celebrating their 3rd year anniversary and each bowl was only $1, so why not?!

You can get to choose from a number of different spice levels and numb levels. The vegetarian bowl we had had some radish, peanuts and a piece of lettuce. However what they excelled on was the sauce and the texture of the noodle. I thought the noodle was chewy but not hard and was al denté. 

The best part of this restaurant is the unlimited noodle refills for your order. As long as you have soup, don't forget to ask for some more noodle!

LAST TIP?!

Even if you eat to beyond full, remember that you can still ask for a take out container to take your leftover noodles home! That way, you're not wasting food too!"}
{"text":"This is my go to noodle spot. The owner is great the food is fabulous and consistent. I go for number 13, the house noodles with marinated pork. Awesome!"}
