{"text":"Hibachi is really good.  Place is spotless and fast.  You get a lot for the money.  We get carry out from here regularly."}
{"text":"Food is actually comparable to expensive Hibachi places.  It is always fresh, made to order, fast and easy on the pocketbook!"}
{"text":"It felt like stealing.  Nine California rolls for $4.  A great beef hibachi dish with vegetables and noodles for $7.95 with enough left over for a second meal.  The food is exceptional here and the prices are crazy low.  I'm hooked and I'll drive out of my way from now on to feast at Hibachi One."}
{"text":"I seldom do Japanese so all I can tell you is that their food is delicious to an American taste. Friendly, fast, and sumptuous."}
{"text":"I love good habachi, and my main item I rank habachi in is their yum yum sauce. Yum yum sauce is as good as beni, and the rice, veges and meat is right there too.

The price is great and food and is even better. Will make this a monthly visit. We have sushi and it is wonderful, also the price makes it amazing."}
{"text":"Overall it was a good experience. If you're looking for a good portion size with a reasonable price, this is definitely a good option. Definitely would go again"}
{"text":"Love their sushi!! Really good and the price is unbeatable! I got 4 rolls for 13 dollars and they were delicious!! Definitely recommend"}
{"text":"Better than expected. Sushi, hibachi, yum yum sauce. Great service, plenty of workers. Surprised that it was so busy on a weeknight. Same menu for lunch and dinner, amazing prices. Parking and entrance in the back. Loved it."}
{"text":"You get a lot of food in an order from Hibachi one. I ordered a spring roll which was $1.50 and thought that was a fair price until I realized it was just one roll. I felt that for only one roll that it was a bit steep. The portions of the meals though were quite sizable and reasonably priced. The place was hoping on a early Saturday evening which to me meant it was good food."}
{"text":"Was very satisfied. Lover my chicken hibachi. And the yum yum sauce was very good. The food was fresh."}
{"text":"This was exactly what I thought it was going to be.  How can I say this without being a D. It's pretty bland in general.  I got the chicken and steak combo 11$. I think Chinese would have been better bang for the buck and had better quality veggies. That being said it's not bad and not everyone is into copious amounts of ginger, garlic, and red chillies.  The mayo(yum yum) sauce is pretty good and that makes everything taste better. Oh and they have chili garlic sauce on the side if you ask.

Would I get this again? In a pinch, yes."}
{"text":"I was a little confused by the name when I found it was basically a carry out. But was pleasantly surprised when the food came.  The food was excellent and a good value.  The sushi was reportedly excellent and the pineapple chicken was very tasty.  

As long as you realize this isn't a wasabi but a basic take out with great food at a great price."}
{"text":"This place is the bOMB.COM !!!! They're so friendly and the menu prices include tax so the price that's shown is LITERALLY what you pay. Their tempura shrimp was so crunchy and fresh, their shrimp tempura sushi was also fresh and delicious, and their shrimp + chicken combo was SOOO good!! (i love shrimp) and they give you so much at such an incredible, affordable price - you'll have enough to last you two meals. 

It's just a beautiful place."}
{"text":"Because of reading such great reviews from other yelpers I decided to finally try this place out. I was not disappointed. The hibachi steak and shrimp is in comparison to Benihana's but at a better lower price. Great tasting food and a good portion is given. I will be returning again!"}
{"text":"If you love Hibachi food but don't love having shit thrown at you while they make it, this is the place for you!  Enjoy the delicious hibachi food in great portions and you don't even have to wash saki off your clothes after!"}
{"text":"I've only had the hibachi offerings and each time it was great! I'm looking forward to trying some of the other stuff on the menu but this is definitely an affordable option for a quick meal with great friendly service!"}
{"text":"this place hands down is the best hibachi around. BEYOND affordable and anyone who remembers the yum yum sauce of the old samuri which benihana had for a long time is BACK! The best part is it wont cost you $35 to have a great hibachi experience! chicken and shrip hibachi only $11!!! I was skeptical at first but am so glad i have tried. EVERYTHING ive had is phenomenal. Go!"}
{"text":"The food here is awesome and they're super fast! It tastes just like Wasabi or Benihana but a fourth of the cost and you don't leave with sake all over your face and clothes. I've gotten both the hibachi chicken and shrimp and steak and shrimp, the shrimp was cooked perfectly and everything was great. They give you two sides of yum yum sauce which is the perfect amount, highly recommend if you're looking for hibachi flavor but you want to stay in your sweatpants."}
{"text":"I love love love this place! My husband and I went when they first opened and went again 2 days later, it was that good! We always order the hibachi and sushi and they are both great! Can we also talk about the price of the sushi, it's the cheapest i have ever come across. It's even cheaper than sushi Wednesday at giant eagle. You really can't beat the price and the food at this place, it's truly wonderful."}
