{"text":"I originally wanted to go to the cafe across the street but it was full house there so we came here for a late lunch. 

It's my second time here and it was not a nice experience. We didn't even sit down and eat. We walked in at 2:00pm not knowing they close at 2:30pm. The guy who greeted us (oh and I don't think he was dressed properly if he was working there) said to me they will close at 2:30pm in poker face and flat tone and asked if that's okay. Somehow I heard he said 3:30pm so I thought we have enough time so I said okay no problem then he led us to a booth then walked away. Then my husband turned to me said he heard him said 2:30pm but he wasn't sure. So I went up and asked the guy again... and once again he used his poker face said 2:30pm. I felt so pissed with his tone and manner and said its okay we are not going to eat here and walked out.
 
I worked in restaurant before and i totally understand it would be kinda pissed to have customers walk in before closing but this is a service industry. If you want to close at 2:30pm sharp then just stop taking patrons at 2:00pm. I think that's totally their decision. 

My first time here wasn't impressive too. The food was just okay so with this experience I will not go there again."}
{"text":"I love this place! Since I've discovered it, I definitely feel like I've been here at least once every two weeks. Great food and service! Their lunch specials are also a good value - for about $10, you get a ramen with a side of six maki rolls (tuna, salmon, etc) plus green tea ice cream with red beans. 

Since I know what this restaurant used to look like before it was Hibiki, the decor is also very nice! Urban inspired with Asian influences."}
{"text":"Came here for a lunch. Same owner as inatei so naturally my expectations were quite high. Lunch menu had a larger selection so $10-$15 lunches. Lunch comes with soup, salad and dessert (pudding but inatei tastes much better).

Overall sashimi was just ok (not as fresh as inatei). Spicy salmon make was just as good as inatei (very good). Service was just ok. Not very friendly.

Not sure I'd come back. Probably go back to my fav uptown - Inatei."}
{"text":"Had lunch and dinner here last week! The lunch combos were very good with decent price. It even came with choice of dessert or Japanese coffee. I had the tempura udon lunch combo, i definitely enjoyed the shrimp tempuras as they were lightly battered with lots of meat. Unlike other places, usually shrimp tempura is covered in batter with little bit of meat inside. I came for dinner on another night and had the bento box A combo, with the sirloin beef. The beef tasted tender and cooked to my liking. The sashimi were also fresh and came in large pieces.

Their service was also very good and attentive.  

Parking wise is ok, there are more spots at the back of restaurant.  I will definitely come back here again!"}
{"text":"Lunch combos!  Yum-Os!

Great value combos, good quality, tasty, good portions, nice presentation.   Service seems friendly.

Only thing for me is, gotta get rid of those spider webs/cobwebs by the windows!"}
{"text":"Came here on a Sunday evening the restaurant was not full 

The decor is nice but it was very hot therefore it was uncomfortable and sweaty throughout dinner time.

Service ..HORRIBLE
They have a regular menu and extensive long daily special menu, when we were done putting in our order the waitress asked if we would like any soup or salad, not knowing it is actually PART of our meal I kindly declined, until my boyfriend reminded me that our chirashi is suppose to come with soup and salad like their sister store inatei. I asked another waitress if the soup and salad is complementary and the original lady that took our order was very sneaky listening to our conversation on the side and when I mentioned I never knew and asked for the soup and salad again the lady that took our order interrupted and stated she offered but we refused.
** I personally think if it was complementary then why would you bother to ask? instead you could have advised or just brought us our soup/salad, if I didn't ask what will happen to my soup or salad that comes along with my meal???..i got my soup and salad at the end..

Food..nothing to wow about
We ordered 
The conch sashimi from the daily special menu - It tastes good and fresh but some of our sashimi fell into the pile of salt which was garnish on the plate and made some of the sashimi pcs VERY SALTY !!!!

We ordered a Chirashi.. Nothing special with the sashimi selections no unagi, like the traditional chirashi..unfortunately I like the chirashi from inatei more then this location

We ordered a salmon spider roll 5 pcs..the roll was very thinly cut into 5 pcs and it only uses the legs of the soft shell crab, and not all of the sushi pcs had equal ingredients some had more some had less or missing...not great
**Our sushi roll came last after when we completed the chirashi, which was at least 30-40mins when we asked the waitress she brushed us off by saying it's coming and got another person to check for us, and I noticed the sushi bar chef's reaction which indicated the order was lost...disappointing...wasn't packed..not ayce..why is it missing !!! Even the table behind us where asking where did their sushi go...

When we tried to get service many of the servers just looked over and walked pass us even when they saw us waving them down. There was a server who looked at us when we waved and instead of coming to attend our needs she went and cleaned tables.........

The one star is only towards one of the male server in the restaurant that tried to assist us to the best every time we waved him down, all of the other waitress within the restaurant..i don't want to comment

I definitely would not be coming back, and would rather spend my money on other sushi places that deserve my spending."}
{"text":"The quality is great and prices are very reasonable! 

The service however is so-so and in turn we left a so-so tip. 

However scatter brain me forgot my phone and as i was about to drive off the server came running out knocking on my window with my phone in his hand. 

I appreciate the honesty because my phone is my life and i need it for work. It made me instantly regret my mediocre tip. Ill definitely be back to tip apppropriately."}
{"text":"My hubby and I had the lobster sashimi dinner set course for 2. $89.99 for lobster sashimi, appetizer, sashimi, sushi, lobster udon soup and dessert! Absolutely great deal with great quality! The lobster head is still moving when we are eating the meat. Highly recommend if you haven't tried!"}
{"text":"4 stars because I'm giving them extra marks for their lovely Japanese serving ware and comfortable atmosphere, especially in their 'party room' with the privacy curtains. They have place settings with mats and not paper. 

Had been here for lunch many times and once for dinner. Like other reviewers said, this place is pricier than other Japanese restaurants in this vicinity. However, the quality is consistent. The owners are present on the floor all the time. I wish they could be more cheerful to their customers, at least smile at your customers when they walk in! 

Service is quick and their servers are friendly and helpful. They leave the pot of tea on your table so you can help yourself. 

Comments on their rainbow maki and chasu ramen with pork bone broth: The maki is decent, California roll with assorted sashimi on top. The pieces are not big so it's not quite enough for an entrée. The ramen was better. A big bowl of springy noodles with 3 slices of chasu and half an egg. They use pork belly for their chasu and it's oh so fatty :( 

I would prefer to come at lunch and picking from their lunch menu. There's complimentary coffee or ice-cream after all ;)"}
{"text":"Nicely decorated place. Food is very fresh and the big sashimi boat is awesome! The waiters are very polite and friendly. A bit pricy for this neighbourhood but I think it's worth it."}
{"text":"Definitely a great place for QUALITY Japanese food. Their black cod is amazing. They accommodated a big party wonderfuly and had a nice ambience. I'm sure regular sushi eaters can find new and exciting items to try for their first time with this menu."}
{"text":"Good sashimi but horrible service???? came here for dinner and we had to ask for our side dish which they forgot. Second round they forgot our rice. Then forgot our coffee order. But did not compensate us with anything either for their forgetfulness. Portions of food were small. Much needed improvement... may come back for a second chance later.."}
{"text":"Would feel so funny if you get a lobster sashimi with only one hand as I did. I complaint about it and the waiter told me that they got it like that. Pardon me? I paid for a dish of full price, not by weight, and got discounted with one hand? The worst restaurant and the worst business running I've ever seen!"}
{"text":"We came here for lunch and as usual I ordered my favourite chirashi don but was disappointed with the fish quality today. Last few times I ordered take out and always had the best cut you'd want in a chirashi bowl. The fish quality is not consistent. I hope the restaurant owner could maintain the food quality as they've always done a good job."}
{"text":"Reasonably priced, well made sushi. It's not a crappy all you can eat or a cheap fix sort of place (thank goodness), but it's not as high end as Zen. Great for people who actually enjoy fresh, quality items. Even their take out platters are fantastic!"}
{"text":"We were really hoping this place would be good. Everything we ordered was underwhelming. It wasn't terrible, and it wasn't good. We have had amazing authentic Japanese cuisine, both in Japan and in Toronto, and this doesn't cut it. It's likely Chinese-run. 

The sashimi was mushy and cut too thick. The rice in the sushi and maki was too soft. The yaki ramen tasted like oily chow mein, and the sunomono salad was overpowered by lemon. 

The ambiance is warm and beautifully lit, the service is prompt. But for those who care more about the food and less about anything else, I'd skip Hibiki."}
{"text":"The atmosphere is really quiet and the decor is really nice. The waiters generally don't interact with you much, pulling away plates without asking if you're finished yet and coming over too often. The food itself is fine, we ordered the chirashi and bento boxes. It would've been nice if the chirashi had more fish and less rice though as portion sizes are pretty small."}
{"text":"The ambiance is great and service is very friendly. The food is great too, but it arrives not in order ( main before appetizer). Overall, a pretty solid choice for an uptown Japanese restaurant."}
{"text":"Quality was mediocre, price is on the high side for the class of service and quality of food."}
{"text":"Horrible sushi, horrible robotas with no sauce or any flavor. All the cooked first came out first and waited over 40 minutes for our sashimi and sushi platter. Horrible. Will not come back ever again"}
{"text":"Parking is almost always full.  I called in advance to reserve a table.  Left both the name and phone no.  Ended up having to wait like a walk-in, they have don't have my reservation whatsoever."}
{"text":"Food was good. Sushi was fresh, not a big California roll fan but I ate all of mine because they put a lot of masago roe on top of them. 

We ordered the mochi the last time we were here and it came with three flavors. This time we ordered it and they didn't tell us it changed only to one flavour. Which was slightly annoying as we probably wouldn't have ordered it knowing it's 3 vanilla mochi flavour.

Also they forgot one persons order in our group and we had to ask twice to follow up on the order. So service was not on par today."}
{"text":"What a rubbish restaurant. I ordered the black cod dinner and half way through the dish, there is a piece of burnt plastic stuck to it, so I asked to have it changed. To my surprise, instead of changing it to a new dish for me, they took away my whole leftover dish (1 and a half piece of fish and veggies), and returned with a small plate with one single piece of fish. They did not apologize at all. This must be a usual occurrence to them. If you are a foodie with some quality expected from a meal, I would suggest you go to Zen (the Markham location) or Modern Japanese Restaurant instead. Lousy food and crappy service. Too bad this system requires me to give one star, otherwise I won't even give them zero stars, I will give them negative stars."}
{"text":"Never thought much of this place passing by, BUT thank goodness my brother spotted it and decided to try this place. IT IS YUMMY! The prices are comparable to the competitors along highway 7, but let me tell you that food is YUMMY! The chef(s) know what they are doing! The service was ON POINT and enjoyable *Kenneth you are awesome!

Had the chicken teriyaki dinner, dragon roll, takoyaki, unagi maki, and scallops w/ for gras."}
{"text":"One of three restaurants run by the same owner, Hibiki is the latest addition of Inatei's siblings. 

Like actual sisters, the two establishments share many similar qualities.  Cosmetically, for instance: the light cedarwood, spa-like interior is repeated here with a few updates (check out the wooden beams connecting the booths to the ceiling shaped like trees!). A small handful of the experienced and friendly waitstaff from Inatei have been expedited here too.  The feature-flavour pudding shotglass desserts also greet you here at the end of your meal.  Of course, they also share the same high quality. 

They have a few differences too. Positive ones. The prices are a little less steep than Inatei, which I find a huge step in the right direction.  I really enjoyed Inatei, but their prices just kept getting so high that I feel they were no longer justified.  They have a few menu offerings that are new  - carpaccio, seared scallops with foie gras dollops (why does \"scallop\" and \"dollop\" not rhyme at all? Daal-ips! This is rhyme robbery), spider roll topped with salmon.  The sashimi here is cut soveryslightly thicker here too.  I'm talking by a mm or two, but hey, ~it's something!~

Tucked away in the rather dingy, old plaza rows on Highway 7, Hibiki has been a hidden gem for 5 months.  It's a welcome addition that I hope is here to stay."}
{"text":"Quality is evidently an importance here. The selection is unique and the quality is definitely there. 

We came here as an appetizer meal since we had a late dinner elsewhere. We ordered the cold soba, a small sashimi collection and a couple oysters each. The cold soba was simple and tastefully done. The sashimi collection was fresh, simple and clean. You won't be able to easily find a collection like theirs in Markham area. They included sashimi choices such as toro and large shrimp pieces (I don't know the names of all the fishes). We had the valentine oyster which was fresh, creamy, mild in taste and meaty. 

Compliments to the service as everyone there are courteous m and attentive. 

Needless to say, although it is more on the pricey side, it is worth it. We will definitely be back."}
{"text":"Food is fresh and generous portions. I've been here twice, ordered the Chirashi dinner and both times were amazing. Packed with the freshest fish and sizeable slices. My husband had a bento box both times and the sushi and tempura was well executed. 

Service is also great and attentive. General manager and waiter were kind enough to offer us homemade panna cotta and ice cream on the house both times."}
{"text":"Came here today (Friday) around 6pm with my girlfriend. We were seated right away as the restaurant was not busy. 

The server came around to our table quickly to take our orders. I ordered the \"Uni Sake Ikura Don\" ($22.99) and my girlfriend ordered the \"Chirashi\" ($20.99). The presentation of the food was beautiful and taste was good but wasn't mind blowing. I liked how the meals came with miso soup, salad, and dessert. 

Service was good in the beginning and then it got worse throughout our meal. When our food came, the server dropped it down hard on our table that the food shifted off our bowls. When we were done with our meal, the server came to pick up our finished bowls and dropped something in my teacup. She did not bother to apologize or to get me a new fresh cup. She then asked if we wanted dessert, however when she came with the dessert, she also brought us our bill when we didn't ask for it. That made us feel like we were rushed to leave when there was nobody waiting for seats. We didn't appreciate that they automatically assumed that we were done just because they served us dessert. That was not acceptable service for a restaurant on the pricier side. They also did not offer to refill our tea throughout our meals. 

Overall, this dinner was disappointing as I came here a few times before and did not encounter this situation. Not sure if I will return in the near future as there are many other Japanese restaurants with similar food quality and with better service."}
{"text":"I've been here both dine in and take out.  Quality and quantity is excellent.  Service was great, portions were big and most important of all the quality is outstanding.  What surprised us was their take out tray included some really high end sushi and sashimi.  I would highly recommend both dine in and take out here."}
{"text":"My entire experience here feels a little like Toro Sushi which was right by Highway 7 and McCowan which closed down a few months ago.  The plaza is incredibly small and there isn't much parking available, but it'a much easier to access from the lights at Highway 7 and Main Street Unionville (can easily make a few turns and access the plaza from the rear).

They do have a pretty good lunch menu and I find the prices to be on average a few dollars more expensive than the sushi restaurants in close proximity.  However, I will say that the quality is also a bit better.  I ordered chirashi and was pleasantly surprised by the quality.  

The restaurant is closed between 2:30-5, which is reasonable, I just find myself having late lunches sometimes and this will probably deter me from coming if it's close to their closing time."}
{"text":"Came here for lunch on a friday and the bento boxes looked really good.  Combo set b comes with tempura, salmon and 4 big slices of sashimi.  I've also tried the ramen with spider roll, ramen was good but not amazing.  Overall good value on the lunch menu and like that it comes with coffee or dessert at the end."}
{"text":"Came here with a couple of friends on a weekday for lunch. The restaurant was probably at 75% capacity. We got seated and was given the menus with cups of green tea. 

On weekdays during lunch, they have a lunch menu where the prices were more affordable. Looking at the normal menu, the prices seemed higher than average for a Japanese restaurant in the Markham region. I ordered a bento box with tempura, salmon teriyaki, and sashimi (13$)

The lunch set came with miso soup and salad. The bento box came quickly. The portions were average, and the quality of the food was quite good. My favourite was the salmon sashimi which seemed to be quite fresh. The lunch also came with a coffee or milk pudding. I picked the coffee, which was pretty good, because I needed an afternoon boost!

Overall, the restaurant was quite good. If the prices were better, I would probably come back more often."}
{"text":"My parents really like this place, so we came here for \"finer japanese food\" in the area. IMO, its still chinese made japanese food. The price tag is higher than average for the area and the service is better, but the food itself isnt that special.
The have a few higher end items on the menu like lobster sashimi and torched sushi, but the food itself is ordinary in flavor and presentation for dinner. For 3 of us, fried squid, tempura udon, lobster sashimi, and a miso black cod set us back 110 after tip.
Probably would not come back for dinner, but willing to try lunch since the specials sound good."}
{"text":"came here for the sush craving and wanted a change from gals. It was a bit more pricier than gals and they do it a bit more fancy. They are very generous with the sashimi slices but I didn't like how it was cut into large credit card sizes pieces. It was a decent experience but i would just save a couple bucks and go to gals a couple blocks down 7"}
{"text":"Tried this place for the first time last week for lunch and I liked it. I had the Chirashi and found the fish to be pretty fresh. I liked how they cut the sashimi pieces thickly. I do agree with other reviews that there was a lot of rice, but I really liked how they tried to balance it with the mushroom mixture added to the rice. Nice added touch and really gave the otherwise bland rice extra flavour. I find the lunch to be a pretty good deal as it comes with a light dessert as well, and I quite liked the yogurt I got. My friend however wasn't as lucky with her meal. She ordered an udon and found the texture to be a bit hard, the udon was a tad undercooked. Still, she liked the flavour and did enjoy her roll. All in all, I would definitely come back for lunch!"}
{"text":"Located west of Kennedy on hwy 7. This is my second time and the quality of sashimi is still pretty decent. Nice atmosphere and good service. The price is a bit expensive compare to some other restaurants for the sushi and sashimi, but the cooked food like tokatsu or ramen aren't too expensive. I really like the uni tray and it is enough to share for 2. Sashimi is fresh and I especially like the scallop and salmon. Overall, this is a good place to go for some quality sashimi."}
{"text":"A Japanese restaurant owned and managed by Chinese people. Servers were all Chinese, all spoke to us in Cantonese assuming we spoke that language. There was at least 3 times they would say something in Cantonese and we would tell them we don't speak that language. Ridiculously unprofessional. We had ordered a dinner Bento Box C (the one with black cod, beef enoki, tempura, Cali roll and sashimi), tuna Toro sashimi and scallop maki. Bento Box came very fast, however the rest never came until after having our desert and getting our bill. Obviously we told them it took way too long and we did not want it anymore. We were full and politely told them we would like to cancel the rest of our order because it was taking way too long (waited 20-30 mins). She kept saying kitchen is busy, when the restaurant was not even half full and tried to persuade us to take it home instead (who would eat sushi the next day...?). She storms off angry and gives us the correct bill. 

Funny enough we look at the table next to us which happens to be the owner having dinner with 5 friends. Mind you, we came almost the same time as them and their sushi came WAY faster. We just saw servers serving them more and more dishes when there were barely any other tables being served. They got some extra VIP service when actual customers who are actually giving them business and paying for their food are waiting so much longer. Also saw the table across from us who came just a few minutes after us still waiting for their orders when we were about to leave...

Other than horrendous service, their plates are cute. Nice interiors, clean. Food is somewhat good but I wouldn't say quality. But for that high price point I would expect more. There are a lot of other quality Japanese restaurants with the same price or less with better service and better food in general. Don't get fooled by their décor. This place is not worth the high price point."}
{"text":"Finally decided to try Hibiki as it's easy to drive by without noticing it nestled in the mini-plaza. Parking isn't the greatest, pretty small sized lot. 

Greeted nicely upon entering. Decor was nice. Liked the thin chop sticks as a don't enjoy eating sushi with clunky ones. 

Nice to see they had 2 semi-private areas for larger groups (albeit just curtains as dividers) 

We were seated in the 2 person booth which we found a bit tight. 

Ordered avocado dragon roll to start and requested it not too spicy. We were impressed with the sweetness of the Unagi sauce, however felt could have used more of the spicy mayo. Size portion was good. The best part was it was served while the tempura was still warm, so when you bite into it, you enjoy the tempura as it's supposed to be. 

For the main course, we had a bento box & sushimi dinner. Bento box was more than enough for the wife. California Roll had tons of roe. Sushi was ok. Teriyaki Chicken was good as the skin that was left on was nice & crispy. The sushimi was nice. Scallop & salmon weren't too wet/slimy and better than most places. Octopus had a nice  bit of chew to it (I've had worst). 

Coffee desert was a nice finish to the meal. 

Reasons why I've rated this 4*
Meals did not come at the same time. I would understand if the waitress simply could not handle all the dishes at once, dropped the 1st and went back to get the 2nd, however it was a good 5+ minutes that the bento box arrived after the sushimi dinner. 
Also, they manager/owner and the waitress were so busy saying goodbye to friends that we had to wait quite some time before we could ask for the bill. 

In the end, would definitely try again in the future."}
{"text":"3.5*
Lunch 
good selection ,another choice for non-AYCE Sushi restaurants in Markham."}
{"text":"Good food and fresh fish is all that I can say, but price wise? Meh.

There're plenty of Japanese food around in Markham that you can get for the same quality of fresh ingredients, but larger and more satisfying portion and a much cheaper price. 

Overpricing might be a minor issue for this spot.

Would not consider going back."}
{"text":"Attentive service, tasteful decor (despite the deceiving exterior) and lovely dinner-ware! The menu offers great variety, and I'd have to say the freshness of the fish makes the place a strong competitor."}
{"text":"Wow !! The service was excellent !!  I was greeted right as soon as I walked in on Valentines day around 9pm. The servers were very attentive and well mannered!! Except they forgot to give us the valentines day menu having us to ask for it.. 

But the food is so good that it pays up for their mistake!!

The bento box I ordered was approx.$27.00 and the sashimi tasted fresh and sweet!! The beef was also very tasteful and crispy outside but tender in the middle.  The tofu and tempura tasted average. 

Will definetly be back when craving sashimi ~"}
{"text":"First time coming to this place. 

Great ambience with nice decorations!

Service was a bit slow and there was a bit of a wait. However, given we came on a public holiday (Civic holiday) right at dinner time around 7pm, I could see why this was the case. 

We ordered a sushi/maki platter, chicken don (chicken, onion, and egg), and a california roll. Food quality was not bad! I actually like how the chicken don and miso soup tasted a little mild, as opposed to very salty sometimes in other places. 

Decent sushi/maki platter and sashimi was good.  I would probably come again to try more food items with sashimi."}
{"text":"A pricy place, but it seems quite worth it. The fish is fresh and the meals are a good size. The husband came away hungry because he's an eating machine, but my two cousins and I found ourselves happily full after lunch. We each picked out different combos from their lunch menu, so the variety was nice.

Two hiccups along the way: someone at our table ordered late, and his order never made it in. He sat there waiting while watching us eat :( They made it as quick as they could, but it held us all back. The mochi dessert we ordered were supposed to be three different flavours, but they only had one available (strange that the other two had run out, I would've assumed it would be portioned properly). 

The service is still good - they were really nice and apologetic about the missed order and the mochi option. The fish is delicious, the cooked food is decent, and the place is fresh and clean."}
{"text":"This restaurant looks like a precious jewel from the highway 7 during the night time, this how we got attracted to go in.
It used to be a Vietnamese restaurant, but the place is totally renovated.
The seating arrangement feels cosy and comfortable, feels spacious.

The overall attentive service also impressed us a lot. The server knows all of their dishes and can give good recommendations.
We started with a very special appetizer, yellowtail neck sashimi with garlic rice vinegar sauce, so good...
We ordered the sushi & sashimi tray for $49.00, it was served in two individual dishes, very fresh and generous portion. Sufficient enough for 2 persons. The price looks on its high side, but believe me, it is definitely worth it!

In conclusion, the restaurant's service, food quality and decor speak the same language.
We had a very nice dining experience at Hibiki.
If they can maintain the standard, probably it is the best sushi restaurant in the neighborhood.

The drawback is the restricted parking space. Tips- parking is allowed on the side streets next to the CIBC."}
{"text":"Came here on my dad's recommendation, as he said the lunch was pretty good. He particularly liked the coffee!

First walked in to a pretty busy restaurant at lunchtime, but didn't have to wait too long for a table. Decor was quite beautiful and modern. Almost like a modern twist on traditional Japanese decor. With lots of windows, it was nicely light as well. 

Lunch menu was quite extensive from bento boxes, to meals & noodles, and even donburi! I decided to go for the Chirashi Don, with a coffee for dessert. 

Came with salad and soup first, but the miso soup was a little bland for my liking. The Chirashi Don was quite good though. Nice variety in the bowl and a good amount of fresh sashimi. The bowl was on a little bit of the smaller side though. 

The coffee at the end of the meal was definitely the highlight. With dripped to order coffee, it took a little longer but definitely worth the wait! Rich and full flavour made it delicious!

Definitely a place worth visiting for lunch, but a little on the expensive side. Worth a try for the coffee if you like coffee!"}
{"text":"nice environment, but sushi is so so. Too much rice in each roll. Good display doesn't mean good quality. Staffs are nice but need to work more on authentic sushi dish. Other seafood are fresh and tasty. High end price too..."}
{"text":"After reading most of these reviews, I decided I would give Hibiki a try. Considering that this restaurant is owned by Chinese people, their service was more than I would have ever hoped for. Some staff were not what you would consider \"super friendly\", however they were respectful and did not give off any attitude. 

Maybe I got lucky as every time I've been here for dinner, the food's been super fresh, decently presented and just by looking at the simple kale garnishing.. You can already anticipate that some good quality food is being served. (Note that I have only tried some izakaya/ yakatori plates-- which were generally grilled to perfection and sushi / sashimi / temakis) 

I have been to quite a few sushi places in Markham and this stands out from the rest as once you set foot to the restaurant, you're met with the quiet and relaxed ambience of the dining room. It's relatively quiet unlike a lot of other restaurants in the area. I absolutely loved the decor and how clean everything was.

A lot of reviewers have critisized Hibiki for their prices and portions. Considering that I have grown up working and have continued to work in the restaurant business, I think the food prices are fair. For those who are just coming in to dine, they might forget that in the end, this is still a business. Each dish factors in, how much the owner's got to pay for the rent, water/gas/electricity bills, food costs (which can be erratic), labour and the service they may be providing you, etc. 

I can also fully understand when some people might complain about the service or quality of the food as the owner or manager may not always be around to assure that every plate / the service offered by their staff have met THEIR own standards. Cooks may try to pass off a dish so they don't have to redo it or \"waste\" food. Waiters/ Waitresses may be giving attitude/ not know how to handle a certain situation properly. However, that should be brought up to owner's attention and be left to the them to deal with as they might offer some sort of compensation/ apology. That is to say, mistakes happen and unless it has been a constant / nothing was done, it shouldn't reflect on the business as a whole because of one bad experience. It is always easy to find a bad restaurant but it is just as easy to find shitty customers.

The only criticism I do have to offer is quite minor and geared more towards management. They are definitely overstaffed as some staff are just standing around when there are things to be done. Whether it be something as small as being more friendly in their deliverance of speech, checking up on how people are doing with their food, making sure the tea is filled, wiping down old tea stains around the rim of the teapots before serving/ after refilling it with tea, clearing up tables once people have left, paying attention to customers that are trying hard to wave them down, etc.. As I always say, there's always room for improvement for everyone.

Other than that, you definitely get what you pay for. I left satisfied and will continue to come back from time to time. Would rate it 4.5 / 5 if possible."}
{"text":"Had their beef tongue, wings and pork cheeks in skewers, premium sushi 10pcs, and uni & negi tuna chirashi don. Beef tongue was thick and juicy, wings were cooked just right and pork cheeks were seasoned well. The premium sushi 10pcs selection was a little disappointing... Each piece was good quality but I wouldn't call it premium selection on the menu kept my hopes up. Also, why did they put jam on Ika sushi? They also did not introduce each piece as what kind of fish it was.. feels like it's a bit butchers. The uni negi tuna chirashi don was ok. Uni was not fresh hence brought down the flavour of the whole dish. The tuna part was yums. Over service was good!"}
{"text":"Interior design? Check.
Service? Check.
Amount of food for money's worth? Check.

QUALITY and CONSISTENCY of food? BIG RED X.
Nope nope nope. I really don't understand how my mom and I could order the same side dish (tonkatsu/deep fried pork cutlet) and have both the meat and batter be two totally different colors. Hers tasted much better as the meat for mine was tough and the breaded batter was not crispy at all. 
Ontop of this, my mom and dad both ordered the ramen which, again, seemed like they were two totally different dishes. Although I admire that they served a good tasting half-boiled egg atop the ramen, the moment of happiness quickly fleeted away when I tasted the soup bases. My dad's bowl was fine, though he commented it \"wasn't hot enough\". Meanwhile.. poor mom, her soup base tasted entirely burnt and raw (maybe that's why hers was \"hot\"). Revolting. 

Also, note that the soba noodles are served hot - which was rather surprising to me since I've only had them served cold before. It was decent tasting though a little weird and does not come with a half-boiled egg like the ramen does. The only reviving food from this entire meal were the ice creams. Hard to mess that one up if they buy it pre-made. I liked that they offered a variety of flavors that most other restaurants don't, like ginger and black sesame.

So my review? Walked in thinking, \"wow\" this place seems like it'll be pretty great. Walked out thinking \"yea... nah, don't want to have to gamble on whether I get the good serving or the bad one\"."}
{"text":"Very mediocre japanese restaurant tucked away in a small plaza in markham. Would come here just for a close jap restaurant. Believe they are the same owners as inatei jap restaurant. Clean modern decor."}
{"text":"Came here for lunch on a Saturday and it was surprisingly not that busy. Perhaps everyone comes out for dinner on the weekends. The lunch specials are not bad (comes with salad, miso soup, and dessert) for the price that they are and the portions are extremely filling (even without finishing all the rice).

My friend and I were mildly amused by the description of Lunch Set C and the Chirashi Bowl which seemed to be the same thing (selection of sashimi and rice) and the same price, so we ordered both to see. If I had ordered Lunch Set C perhaps this review would be 4 stars but my Chirashi Bowl was actually a little underwhelming. Though the sashimi tasted fresh, I was disappointed by the sashimi selection. My friend's order came with the same amount of sashimi pieces but his had actual variety and quality. 

We were also intrigued by their foie gras sushi so we each ordered a piece and mmm it was SO delicious. It was rich and like nothing I'd ever had before. The foie gras melted into your mouth and the sushi rice added the perfect texture to the bite. They had more unique selections as well but we were too full to order any more. 

Might be back to sample the various other unique dishes they have!"}
{"text":"Best foie gras sushi in town and the lobster meal for two is so worthy. I always come here for negitoro!! Lots of sake choices and my favorite is Ikezo peach jelly sake. Great ambience and friendly service."}
{"text":"My Bento Box was a delight and so colourful!  It had some segmented oranges too for post-meal.  I liked the quality of the salmon and tuna sashimi.  Yum!  The wasabi was spicy too.

The shrimp tempura was absolutely delicious!  The shrimp itself was large and substantial.  The batter of the tempura wasn't too thick either.  There was also tempura sweet potato, zucchini, and taro; all of which were fresh and tasted good.

I liked the texture of the Japanese rice.  The salmon teriyaki was a little on the dry side and thin.  It was still decent.

The bento box was more than enough for me and so I packed the rest home."}
{"text":"I live down the street from this place and always passed by it. Therefore I just had to try it out finally since we were craving sushi. Upon walking in, we got seated right away since we were only a party of two. The place was filled but not packed. There were still seats available around 7:30pm on a weekend. At first impression, the place looks nice and ambiance is well suited for a family gathering or a date. Then I got the menu, prices were expensive but I couldn't judge this place yet till I tried the food. We ordered a bunch of sushi, the 3 fatty tuna tasting which was called (called something along the lines of Blue Fin somthing-somthing) and also the live lobster sashimi which comes with the head being boiled into soup after. The food was excellent and for uptown prices, it was ok I guess. (See photos I have posted of the food we ordered).

The CONS...
The service was hell'a slow af. They waiters didn't even give us tea or ask us if we wanted anything to drink for a whole 15 minutes. They just kept passing by us without acknowledging our existence till we had to flag one down by turning my head several times and tossing my hand up in the air.  Finally a young man came up to us and asked us what we wanted to drink. A whole 15 minutes later though. Not cool.  When I asked him about the Sake menu and which one is sweeter compared to another, his answer to me was \"I dont knoooooooow!\" in a long tone. So Uuuuhhh, i'm sitting here thinking, you guys specialize in Sake or at least have a pretty extensive sake list plus a extra menu that teaches you how to drink sake or appreciate the different types of Sake but you as the waiter working in this place \"DOESN'T KNOW?\" well get someone who knows!! Don't just stand there and tell me that is your final answer. A well trained staff would normally say \"I don't know, but you know what? Let me get someone who might know to help you with that\" ... for the prices they charge here, this is not the type of answer that is appropriate for your customers. Especially only whose a critical foodie and judges everything from entrance to exit. Common, seriously, your priced like a high-end sushi place and you offer a menu with lots of sake explaining how to drink it but you have waiters that have answers with \"I don't know!\" ... I was a bit turned off with that plus the lack of acknowledgement of your customers. 15 minutes of waiting for someone to take our order or even acknowledge us was a bit ridiculous. Customers want/expect excellent customer service for a restaurant charging such prices. I'd expect to pay something like this downtown Toronto but not what they are asking if their service is lacking. 

Therefore my rating on this place is a 3 star. If I could give it a 2.5 I would but I can't since there are no half star offerings. Improve on your customer service and educate your servers better and you might get a 4-5 star.  That sake menu is great but not so great if your servers are not trained to know what they are serving. Please improve. Thanks."}
{"text":"Very fresh sashimi,  must try the grill sirloin steak, will definitely recommend to our friends."}
{"text":"As fresh as it gets.

Was served super fresh sashimi, which included a variety of fishes. Also tried a raw lobster and geoduck (very interesting texture). Presentation was outstanding.

However where this place lacked was service. Seemed like everyone was in a bad mood. No hello, hi, welcome or how can I help. Not a single word was spoken by the server from entering the door to being seated.

Also the price adds up quickly. ~$300 for 4."}
{"text":"The price is fair for the quality of the food you get. Have been introducing all my friends to this place.

The lunch specials are pretty good and super worth it. I love the quality of the salmon!

MUST TRY: iced macha latte. INSTANT LOVE. It was so smooth and not overly sweet. Kudos to the bartender Alfred. 

The dessert is also made in house, I got the pudding, I think it was milk pudding, smooth and not overpowered flavours.

Manager is on the floor and greets people and helps with cleaning up. A very humble and small restaurant.

Only complaint it's easy to miss driving along hwy 7! Need some better signage. 

New favourite for sure."}
{"text":"I never write updates unless there's a change in rating and I rarely write them in the first place (3 including this one). But Hibiki is shattering my status quo because it's shattering my expectations! Time and time again, I am blown away by the type and quality of food offered at such reasonable prices!!

Came here with my SO and the Lobster Sashimi Set caught my eye. $98.99 for an extravagant 6-course lobster dinner for 2 seemed pretty reasonable to me. And it turned out to be more reasonable than expected, practically a steal!

1) Starter - Blue Fin O-Toro Carpaccio with Seaweed Salad. The flavour of the fatty tuna with a tiny bit of salty scallion was mindblowing. FYI the Tuna Lovers Sushi Set with 2 lean tuna, 2 Chu-Toro, and 2 O-Toro sushi pieces is $24.99. Here you get 6 pieces (3/person) of thick decadent O-Toro sashimi as part of a set that costs $50/person. You do the math. 

2) Sashimi - This was actually two courses. One whole live lobster sashimi (shared) where the lobster was still moving. Doesn't get fresher than that and the meat had the most amazing texture and sweet lobster taste. Then came a plate of striped jack, sea bream, salmon, yellowtail, and sweet shrimp sashimi; thick-cut and tasting like it just jumped out of the sea. 

3) Sushi - Seared salmon belly, fatty tuna with sea urchin, salmon roe with quail egg. Somehow, Hibiki created a sushi platter of literally all of my favourite things without even knowing me. The salmon belly sushi even had a slight sear on the rice. This was where I died. 

4) Soup - Seafood broth in a beautiful earthen teapot. You pour out the broth into a tiny cup and sip it like you're drinking sake. It was so light, so simple, and took on the flavours of the tiny clam, shrimp, and fish meat inside. You can then eat the broth ingredients. 

5) Appetizers - Grilled scallop, lobster roe steamed egg, butter baked clams. The flavour of the char on that giant scallop was unbelievable and the smell of the buttery and garlicky clams made my SO want to bottle it into a cologne. The highlight for me was the steamed egg though. Smooth with generous amounts of lobster roe (which is another one of my favourite things), topped with mushroom and citrus peel. How am I supposed to watch my cholesterol with something like that, Hibiki??

6) Main Course - Matcha Soba with lobster claw. This was alright to me. The broth was a bit too salty and the soba, though green, wasn't noticeably different from regular soba. There was a good sized lobster claw and other seafood in it though. 

7) Dessert - The only other item that was shared. I think it was some sort of tofu pudding cake with almonds. It was creamy, not too sweet, and the perfect light finish to a pretty perfect meal. 

This isn't your stuff-your-face-until-you-die AYCE but there's no denying that every pretty penny is WORTH. IT. And honestly, for this kinda quality, I don't think you have to sacrifice as many pretty pennies as you think you do. Of all the sushi places in Markham, seldom owned by Japanese people, Hibiki is at the top of the list, the cream of the crop, the top tuna. And as promised in my original review, I will continue to return again and again!

(4/100) - 2017"}
{"text":"I was not happy with this place.  First of all, the host made us wait 15-20 minutes for a table that had been available since the time we arrived.  Although the decorations and vibe of the restaurant was nice, the service was subpar. 

I tried to order the sushi appetizer, that came with 3 pieces of sushi and 4 maki.  However I only like to eat raw salmon, so I requested that all of it be changed to salmon instead.  The server completely denied to accommodate this request, even if I wanted to pay more. Usually most sushi restaurants will just charge you an extra fee, but not this place.

Her attitude towards me was just very dry and rude especially when I asked for this accommodation.

As I just opted for Sake Donburi (17.99).  It was so expensive and the sashimi wasn't even that great.  

All in all, this place has high end price without the high end quality and service. 

Will not come again."}
{"text":"First time here since it opened. Very spacious but not cozy. The service was pretty good. That's where it stops. Before coming here this is a $$$ restaurant which is almost there. The food did not match those money signs. We order the curry chicken and rice which the sauce was good but the chicken is no different from any other $ or $$ restaurant. The rainbow roll looks good but doesn't taste good. The rice felt it was left out too long. The sushi rice falls apart very easily. The chef did not make the rice tight and every piece I pick up felt apart. 

I suggest this restaurant to be more of $$ restaurant to keep it standard."}
{"text":"Came for the dinner for 2 dinner set and was not disappointed!

First off, they have free parking right in front of their store. It's super convenient! You might miss the place driving but nothing google map can't solve. 

The food was great! The sashimi tasted fresh, they have a wide range of sakes available in house. Make sure you try some of the options they have to enhance your dining experience ??

Our server was Justin, he was so attentive and worked with our pace (we were hungry). Was nice and outgoing as well. Couldn't have asked for more. 

For dessert we have a green tea red bean cake and strawberry mochi omg it was so good. 

I will be back!"}
{"text":"Located in a mini Plaza.

Nice ambience and a classy atmosphere.  The food was average as there are better options around the GTA (was also a few dollars more on average)

Nevertheless sushi was still fresh 

They brought the wrong dish, but they were apologetic about it.  They also ran out of sea urchin on the Sunday night.  Blah"}
{"text":"Nice decor - I really had high hopes for this place upon walking in. However, food ended up being very average considering the high prices. We tried the fried oysters, skewers, ramen and chef's choice sushi - every dish was lacklustre. Between 2 of us, we paid $80 for dinner and definitely felt we have had better food for that price at other japanese restaurants. Would not recommend and would not return."}
{"text":"Came here a couple times with my friends and family.  Heard that this is a sister company to inatei.  The decoration and outline of the menu is very similar to inatei.  

I find they are a little inconsistent with salad and soup.  It really depends who you order from, sometimes they give you complementary soup and salad and other times they don't.

Got the sushi and sashimi combo for 49.99. It came with a good selection of sashimi, not your regular AYCE sashimi selection.  

The sushi and maki were good too.  Got the salmon egg roe maki and it was pretty flavourful. 
The seating was comfortable and spacious.  

At the end if the meal they offer you complementary dessert which could be a yogurt shot, or other times I have gotten ice cream."}
{"text":"I like hibiki
it has good sushi I like the California role the avacado is some creamy goodness and the fish balls pop in your mouth creating a giant yummy explosion 
also got sides like the Japanese dumpling that were v crispy and juicy but also pretty expensive 
the ramen is good as well with good portions. 
we got a fish for appetizer and my grandma loves it ate every bit of it 
the soft shell tempura was also crispy and tasty 
definitely a good Japanese restaurant in Markham with a good assortment 
also for dinner they gave us free mini desserts miso soup and salad"}
{"text":"Food is just ok, but price is way too steep for the quality and portion they give you. I would much prefer going to Inatei or Qiu where they have better food with much better portion size for a similar price."}
{"text":"My boyfriend and I went on Sunday afternoon for dinner. The sashimi and the salmon roes are really fresh. We also order the geese liver with grilled scallops, it was amazing! And they even provide almond tofu as dessert for us. What a surprise! It does not listed on the menu.

Overall it's a good place if you are craving about Japanese cuisine. The environment is nice and with some Japanese songs as the background. But lack of privacy, the waiters are always really alert and see what is empty on your table and they will come to take it right away. Because of that, I got interrupted few times while I was discussing something with my bf and I could not remember what I was talking about. That is why I only give 4 stars."}
{"text":"3.5 star rating. This Japanese restaurant is located in a small plaza close to Hwy 7 and Unionville Main Street (same plaza as Dominos pizza). I first tried this place over a year ago with my family. They don't do AYCE, but their lunch specials are pretty good value for your money. 

The restaurant has a much nicer ambiance than many Japanese restaurants I've been to in the area, and you can reserve one of two private seating areas for larger parties (but maximum of 10-12 in the larger of those two spaces). 
When we dine out for lunch, we tend to order their Bento Box specials, which include soup and salad. 

Let me just say that of all the Japanese restaurants I've dined at (and perhaps even non-Japanese restaurants I've dined at), their salad dressing has got to be one of my favourites. They prepare it in-house, and the dressing has a fine balance of sweet, sour, salty, and hint of ginger for heat. Last time we dined at Hibiki, hubby and I even asked if we could purchase some dressing - and they agreed! You get about 300mL or so of delicious dressing in a takeout container for $5. Lets just say we will be having a lot of salad over the next little while in order to not waste this delicious dressing (which if my hubby had the choice, he would prefer 2 salads rather than soup and salad).

Back to their food...Unlike some other AYCE Japanese restaurants in the area, they do not fill you up with Korean side dishes of potatoes and glass noodles or dumplings. The Bento box B (which is what my family and I usually order) comes with salmon teriyaki, shrimp and vegetable tempura, and 4 pieces of sashimi with  some maki. I also enjoy their chirashi lunch, with a nice assortment of fresh fish. When we've dined here for dinner, the salmon don was decent value for 8 pieces of salmon sashimi on a bed of sushi rice plus soup and salad for $15.99. I also enjoyed the flavour of their miso-glazed black cod, which comes with 2 pieces of cod, rice, soup and salad for $22.99. What is nice is that they provide complementary dessert, such as choice of ice cream or coffee during lunch, or a cute shot glass of their pudding of the day (such as green tea, Earl grey, or black sesame).

Hibiki offers good quality food for reasonable prices and in an inviting atmosphere, with diverse menu offerings from sushi, sashimi, donburi, hot pot, ramen, and much more. Oh, and they have a liquor license to enjoy sake with your meal.

(13/100)"}
{"text":"First time going here, nothing spectacular about this place... left restaurant hungry and a little broke lol. Would definitely go to mi-ne sushi over this place.... 

Sashimi was cut way too thick... nothing really more to say about this place. 

Atmosphere was nice and quiet though"}
{"text":"Lunch special is best value has soup, salad . Main and dessert from $ 8.99 -13.99.


we tried salmon sashimi  Tempura bento box which is tasty and fresh . Ramen set comes with salmon rolls are so filling. Will definitely come again."}
{"text":"Solid place for japanese food in a modern setting is what I would describe Hibiki. 

Came here for lunch with the family and was impressed with the clean, modern decor of the restaurant and fast service. It wasn't busy at all on a weekend lunch service.

On the food side of things, hibiki's food was good. It's weird; I wasn't blown away but at least can acknowledge that the food in general is of higher quality than your average Japanese restaurant here. But that measure of that quality isn't much. As a result, the prices are also higher than your average place, while giving you less. Quality comes at a price. 

I ordered the Chirashi and found the sashimi decent. The fish was fairly fresh and the variety of items was nice. I tried the rest of my family's items and was greeted with the same experience. Good but not great. My sister remarked that the food was a bit bland and she isn't wrong. The teriyaki salmon was one of those items but at the same time, it was nicely cooked and nice to see it wasn't doused with teriyaki sauce. The tempura was nice and kudos for using jumbo shrimp. The beef udon wasn't anything special though and they easily could have and should have gave more noodles. All lunch specials came with mango yogurt as the 'included dessert' which was a nice little touch. 

The food came out incredibly quick. The salad and soup came within minutes of ordering and the main items few moments later. The service could have been described as too attentive at times though. There are few people standing around looking for things to do and sometimes it was too much. The plates were picked up sooner than I would have liked and we were given the bill without asking for it, it's not like this place has people waiting to go in."}
{"text":"Great sashimi, especially the Amaebi sashimi. Udon is very delicious but I usually eat the Stir Fried Unagi Don. That one is very tasteful and one of a kind!"}
{"text":"I ordered the lunch special set B, which just came with 4 pieces of sashimi, 4 pieces of sushi, and 6 maki for $14.99. Was the the sashimi good? It was average;similar to a lot of Markham sushi places. The maki they served was a poorly rolled red tuna maki. Nothing special. Seaweed was chewy too. It was an average sushi restaurant. I did like that they served mango pudding in the end - that was yummy! For $14.99, i didn't really find it worth it.
They could have made the maki roll to like a tastier roll. Will probably come back to try their bento boxes :)"}
{"text":"One of the better Japanese restaurants in Markham in my opinion. The place has a nice and soothing atmosphere with cool decor. Service met my expectations and the food was good. The free jello dessert topped it all off"}
{"text":"lunch sushi set A 
all 6 nigiri were fresh & had different cuts, but its missing a wow factor 
none of the pieces stood out 
and the maki roll was just average 

not sure if I'll be back since it didnt match the price 
but service was great and i liked the addition of red bean to the green tea ice-cream"}
{"text":"This place came up during my search for sushi places in Markham on yelp.. Most of the reviews were positive so I figured it deserved a try and since it is not too far from where I live. 

Parking lot is indeed small but on a wednesday nite, not that busy.  there were so many nice cars pulling out of the lot LOL

made a reservations for four but only ended up being two persons. not sure why they didn't give a table booth since there were so many empty booth at the back. Instead, the waitress directed us to a table that was in the middle of the restaurant.. for some people, it may be ok but for me, I didn't really like it since I still felt some kind of draft as it was still kind of close to the door but anyhow.

Their combo does not come with dessert but surprise at the end, there were a small shotglass dessert.

My friend thought everything at the restaurant reminded her of her inatei and she even thought one of the waitress there worked at inatei too.. prices wise, it is the same as inatei but I think it is even more expensive.

Customer service & waiters.,there are moment where it can too fake and overdoing it..  one of the male waiter was so impatient and cheeky that he made some kind of lispy noise TWICE while my friend and I were still studying the menu and trying to decide what to order.. it felt like he was ready to pounce.. it reminded me of  waiters in HK .. . .you better know what u want by the time u sit down at the table!

Also, the waiters were discussing about how I made a reservation for four but only ended up with only two people.. not sure why it needed to be mention when I was literally next to them at my table and could hear everything they said.  

Ordered the chirashi..some of the fishes were very fresh though I believe two ofpieces were still tiny bit frozen... 

My friend ordered the special sushi only 6 pieces for $19.99?  food presentation was extremely beautiful.. but overall not filling.

The BBQ pulled pork neck was done to its perfection.. It was very delicious. 

Would I come bacK overall? yes.. despite the overdoing of the fake customer service.. I would definitely come back for the food."}
{"text":"????????????????????????????????????????????????????????????????Lunch?????????????????????????????????????d????????????????????????????????????????????????????????????????????????DT?????????????????"}
{"text":"If I can give this place a 0 star, I would. Should have listened to my friends: when you have a Chinese owner of a Japanese restaurant, that should be a red flag right away...

Why this place deserves 1/5: they serve me black cod with plastic. Yes. Plastic wrapping! If I wasn't paying attention, I would have choked. 

Why this place was a 0/5: The waiter reluctantly took my dish away, but returned only with a plate with a new piece of fish. They threw away all my side dishes in my bento.... It's my first time seeing a black cod coming out on a lonely white plate when it was their fault serving it with non-edible plastic. And... How much am I paying for this? Outrageous!

Im not finished. They not only did not apologize, and thought it was normal. Is that what Markham quality has dropped to now? That I'm supposed to exhibit Stockholm syndrome and feel it's my fault to notice the plastic?

Feel free to do yourself a disservice by paying for an overpriced meal with plastic and such bad service. Enjoy!"}
{"text":"So I gave it a second chance last night to ACTUALLY try the food and more importantly the service...The food is an A-OK..the salmon that I actually got to try is fresh..I think they probably read my review on here and at least 2 servers recognized me cuz they kept on staring at me and were mumbling...I honestly could careless..

I am almost 100% sure that one of the servers was the owner of the place..the guy with the glasses cuz he dresses differently and honestly looks like he cares way less than the servers..thats when you know he is the owner..Lol...the other server guy was being courteous and professional..they all didn't have name tags so I didn't know his name...

The food was fresh and presented in a cosmetically good way...the portions were quite small compared to your average Japanese restaurant place...

Everything arrived in a timely manner...they really don't have enough servers availible during weekend dinner because we tried to ask for ginger and it did take 3 tries before we actually received it...

All in all, not a place that makes me extremely eager to go back..so I should be fair and give them the deserved review.."}
{"text":"Goods: ordered a sashimi and roll platter, they're sashimi is fresh, serving salmon, tuna, octopus, toro. We had a spicy salmon roll which was great, not too spicy but enough kick. Shrimp tempura was also very cripsy with big shrimp pieces. Sesame ice cream tasted great as well as the green tea one.
Service was good and fast and also I like how the restaurant was designed.

Bads: the ramen we ordered was great in terms of toppings and noodles. But the soup was a little salty, it was the pork bone soup. The red bean under the green tea ice cream was a little sweet over powering the green tea by a little.

The price is a little to the pricy side but considering what quality food you are paying for, I say it's worth it."}
{"text":"My first time dinner experience here was very very good.  Thank you Jen K for making my trip here happened!  I can't wait to write a review about it.

I like the restaurant decor.  It is trendy and comfortable.

The place was not very busy on a weekday at night.  The servers were friendly.  They came and cleaned up our plates all the time.  One of the male servers was particularly helpful providing us advice on choosing our food.

We ordered the daily special Seared Sushi Platter (Anago, Foie Gras, Scallop, Hamachi and Kama Toro) for $19.99.  The sushi was not just nicely presented but awesomely fresh and yummy.  The sushi chef certainly did a fantastic job on his sushi.  One particular thing that made me like the sushi here more is because the chef put a bit of wasabi between the rice and the slightly seared piece.  I have always been told that this is the most traditional Japanese way of making good quality and high-end sushi. 

We tried a little bit everything.  The steamed egg with a big piece of lobster meat and a piece of fresh uni is also a very nice daily special.  We also have a grilled shrimp, and pork neck yakitori.  

I was tempting to try the salmon skin chips but this was not a regular dish on menu.  The chef made us a complimentary tartar to try instead (with the honor of Jen K as a regular there).

The dinner began with salad and miso soup and ended with a coffee pudding and a complimentary black sesame ice cream.  So far so excellent.  A solid 4 star dinner.

I will certainly come back for dinner again and try their lunch soon!"}
{"text":"Delicious sushi for a special occasion. Great selection and awesome cooked foods in their robata menu. It is a little bit pricey and not a lot of parking spots available in the vicinity."}
{"text":"Decor: 4/5
Staff: 5/5
Food: 2.5/5

It's always great to enter a restaurant that looks nice, be greeted with smiles and to be served with efficiency and politeness. Actually, the staff were more than just efficient. They were incredibly friendly, respectful, and they even did their best to get us the plum wine deal that was not part of the sushi set. 

Sadly that's where the upside ends. The food was simply not that great...

What we had: 

- Wasabi Tako (Octopus) 
- Chef's Selection of Sushi (10 pcs)
- Spicy Salmon Maki
- Spicy Tuna Maki
- Chashu Ramen 

Overall it was overpriced for the quality. The rice for the sushi was mushy...lack of vinegar flavor, and the fish was definitely missing that WOW factor (mostly flavor). The chashu was pretty good but the ramen itself was not on par. A lot of room for improvement here."}
{"text":"I've been here twice; once for lunch and recently for dinner.  Lunch was pretty good, so my girlfriend and I decided to try dinner.  To be honest, we should've gone somewhere else.  Being a sushi place in Markham, it really needs to be outstanding or else what's the point?  There was a bit of a wait which was understandable so we had time to look through the menu.  I started with the Golden Oyster.  I've never had Oyster before but I thought it was really good; would recommend.  I also had the seafood ramen; very disappointed.  It was so bland and flavorless, I had to put so much hot pepper powder in it just so it had some sort of taste.  Even my girlfriend (ordered some veggie rolls) said the sushi had no flavour.  One thing we did like was they had made custom rolls for her!
So why settle for an average sushi place, when you can go elsewhere where you know it's always amazing (Gal's, Osaka etc.)? Will probably not come back."}
{"text":"This is the best Japanese restaurant that we have been to and is our favourite.  The lunch specials are great value which includes miso soup, salad, appetizer , main and dessert.  We like to order the special dinner items that are different from the regular menu and include special fish or unique items. We had fish collar and it had lots of meat.  Also the steamed clams just done perfectly and tasted great in the wine sauce.  They also have an extensive sake selection.  They serve Japanese beer by the quart. Service is friendly and prompt."}
{"text":"Similar quality, menu, pricing & tableware as Inatei. 

Ordered the Sashimi Set Lunch ($15.99) - 2 pieces each of salmon, tuna, octopus, surf clam, mackerel, and a white fish  (maybe the fish selection varies?) Fresh and decent variety. Miso soup & salad were good too. Comes with a bowl of rice which was a bit off.. kind of dry and unlike usual Japanese rice. 

Dessert: Choice of coffee, icecream, or coffee pudding (or whatever special dessert at the time). The green tea icecream was good, darker in color compared to typical green tea icecream at restaurants, served with red bean which was a nice touch! This may have been my favorite of the meal. Coffee was good too. 

Mackerel was a bit overcooked and underseasoned - could use more grilled flavor & salt. 

Tempura was good, fresh batter."}
{"text":"The food is alright. I had the udon lunch special for $13.99 with a salmon hand roll, miso soup and salad. It wasn't busy so we were able to get a table quick. The only downfall of this place is limited parking. We had to leave quick because most of the people at my table were parking in areas that had a1 hour limit. We were too worried about our cars that we left fast."}
{"text":"I went with a large group of friends and will have to go back another day when I'll have more time to savour each dish. Good food, good service. Very nice presentation on their dishes."}
{"text":"First dining experience here. Services were ok, but we waited a long time for the food to arrive. Portion was good for the don/rice bowl, sashimi was nice and fresh. However sushi rolls were tiny. 
For the price and quality, I'm sure other places have more to offer. I'm not too eager to go back again."}
{"text":"Craving for sushi or Japanese cuisine in general? Go to Hibiki, just go you can't go wrong. 

I was here for lunch a few times, it's very good every time. Everything is very fresh plus the price and portion size is very competitive. I like how they choose to use the belly of salmon for salmon maki (roll), it's more fatty so the flavour is sweeter when it melts in your mouth. Udon is also great, the udon being slightly chewy with just the right texture and the soup base defines the Japanese word \"umami\". Lunch comes with either mini desserts or Japanese drip coffee. The coffee is very nice, the aroma is very pungent but the taste is very smooth. 

There are a lot variety on the menu, so if you want something fancy like toro (fatty tuna), or chu-toro (medium fatty tuna), they have that too. These items are usually expensive everywhere but their prices seems quite reasonable. I haven't try anything fancy here yet other than the normal lunch combos but I will look forward to it when the occasion arise. 

The only reason why I did't give it 5/5 is because I want to reserve that when I try their more high end items on their menu. After all, seems like they lean more towards the high end dinning route. I will definitely update this review once I have the relevant experience here.

Taste ****
Price ****
Portion ****"}
{"text":"I gotta agree with the rest of the reviews so far. Quality of food is excellent, service is great and the price is a bit on the high side but well worth it. 

Baked scallop for $5.99 - you get one single scallop. It tasted very good but for $6 bucks I don't think I would have ordered this if I knew it was just one scallop.

Donburi with uni, salmon sashimi and salmon roe $16.99 - Fantastic presentation of the dish. Everything was fresh and tasted amazing. Its a small meal and a bit pricy but I would order it again in a heart beat. The uni especially is memorable - it was like butter and had no fishy after taste.

Ramen with shrimp/veggie tempura and 6 piece salmon sushi $8.99 - soup tasted good but the most memorable part was the shrimp tempura. It was the largest shrimp tempura I have ever eaten. I almost thought it was a small lobster tail. 

Meals come with complementary miso soup and salad.
At the end of the meal there is also a complementary dessert and you can choose between ice cream or coffee.

Very nicely renovated
Parking lot is a bit small
Very surprised they had no grand opening specials. There was only a total of three tables being served on a Wednesday afternoon. That's pretty sad but hopefully they can pull through."}
{"text":"Hibiki is a restaurant with a nice ambiance and overall welcoming atmosphere, but the same cannot be said for its staff.
The attitude and helpfulness varies and some staff are more likely to provide top notch service if you seem to have the buck to pay for it. (e.g. you may or may not have your sake poured for you).
The food is good quality, they have a wide variety of sashimi seafood and are very fresh.
I would recommend the sushi, sashimi and robata yaki portion of the menu. Ramen was lack luster and was not comparable to the other items on the menu.
Recommendation: if you're not planning to spend $50 on dinner then go somewhere else. Dress nicely if you want to be served like a valued customer."}
{"text":"I keep forgetting about this restaurant because the signage doesn't stand out - and the hibiki lettering is difficult to read unless you are sitting in the rush hour traffic. Fortunately (?) Yelp reminded me of this as I was searching for sushi to fill my craving.  

The decor is nice and inoffensive enough. I love the distressed wood behind the sushi bar and the eclectic plates that they use. And I am glad that it's not an AYCE place. 

I came on a Monday night so it's slow, and ordered a few things that I hope are representative sushi dishes to basically gauge the restaurant. And it's basically \"ok\".  

The tempura looked ok (if shrimp!), but it was oily; clearly the oil it was cooked in wasn't hot enough. The mixed sashimi, nigiri and maki platter wasn't bad - I liked the ratio of fish to rice in the nigiri, and they did an excellent job on spreading the rice in the maki - no thick rice skin! And the sashimi was fine - the knife work seemed decent enough. But there was a pretty obvious bone on the salmon nigiri and another pin bone in the sashimi. Both are firsts in quite a while. Aside from that, the dish was ok. 
The dragon roll ($17) was offered only with salmon or tuna or avocado. Why is there a choice? Anyways, we asked for salmon and tuna and they accommodated us. The roll was huge - too big to eat comfortably. But I guess it was good. I wish the tempura shrimp wasn't so oily.  

I think that at the end of the meal - there was 2 of us and we were decently full - we weren't satisfied. We asked for the menu again to check out desserts but was told there wasn't any desserts. The server brought out a lychee pudding which I think was ok. But I think I still need something acidic to rid myself of the oily feel inside my mouth 40 mins after dinner.

I'm mixed about coming back - I probably would since it's the only decent a la carte sushi shop around and I don't want it to go under like Toro did. But I hope it fixes these small issues - hotter oil for the tempura and a bit of QC for the fish, and something to cleanse the palette at the end of the meal - and then I think I would be a happier customer.  For two was $56.xx, taxes in. Not a bad price, all in all."}
{"text":"First timer at this place. As many people tend to forget this unit since it's right on Hwy 7 and it's often missed since it's facing directly to hwy 7 and there's high traffic and the restaurant isn't located in a large commercial area. It can be easily missed driving since the restaurant isn't very noticeable from the main road. The place is next to the Domino's pizza. 

First off, the service there was very good. All the servers, waiters/waitresses were all very nice and pleasant and helpful  (Also at the time I had gone it wasn't very busy either). The interior is very modern, there is a long /large sushi kitchen counter facing west to all the customers. 

The prices tho, are a bit steep. A lot of their food items there is very expensive compared to alot of other sushi restaurants within the immediate area. Although, after trying here and seeing how everything was, somethings are worth the money but some I believe I could go somewhere else and find something similar for less of the cost. 

I ordered Unagi fried rice, a sashimi mix platter, beef udon, and a chicken katsu. 
The sashimi was very fresh, thick cut slices and presentation was well done. Chicken katsu was crunchy (the way i like it ;) ) and the mushrooms on the sides were very good tasting as well ( probably because they had buttered it lol) The Unagi fried rice was also very tasty as well but I think for the price for it is too expensive for me. 

Overall, good place. Good quality japanese food. This place would be considered more of a high end japanese restaurant which differentiates themselves amongst all the other japanese restaurants in Markham. This place is good to come to once in awhile but not all the time."}
{"text":"I came on a Thursday night with a few other people around 8pm. We got seated right away but there were lots of people still there.  We ordered a small or medium boat of sashimi, rainbow roll, tempura, oyakodon, some baked mushroom dish and hamachi hand rolls between 4 of us. The quality was definitely better than all you can eat but not the best that I've had compared to downtown places. The sashimi was fresh and the cut was a good size. Tempura was delicious and HUGE. Batter wasn't too heavy and crispy. Rainbow roll had lots of fish on top and a good rice to filling ratio. The only thing we didn't like was the oyakodon which is rice topped with teriyaki chicken, egg and a bit of onion. There wasn't enough sauce and very little chicken. The baked mushrooms had king oyster mushrooms, enoki, cremini, shiitake and maybe some others baked in foil with I'm guessing butter, salt, pepper, and maybe some soy sauce. I love mushrooms so I liked it a lot.

Overall good place to eat some quality Japanese and I would come back if I happen to be around the area."}
{"text":"+.5 for service

Toro Sushi's replacement!!! Great sushi returns to Markham!!!

I take the bus to work on weekdays and pass by this strip of Highway 7 all the time. I noticed one morning there was a sushi restaurant that opened, so I decided to try this place with my parents this past weekend for dinner.

Similar with our experience at Big Head Prawn, the parking situation is quite dreadful if you're coming from the west. The entrance to the lot is quite hidden and you can easily miss it. I feel that might be a huge obstacle in the survival of this restaurant.

The first memory of this restaurant was that I almost crashed into the glass wall right when I was entering. The wall glass is transparent to the point you'd think it's not there. Be careful!

The menu is quite diverse on the robata-yaki side. In terms of the sushi bar, they have a lot of sushi/sashimi options but not so much on the rolls side. We ordered a lot of items which totalled to $130 for a party of 3.

Some highlights:
- Baked scallop: One scallop one order! Extremely delicious if you can fork over $5.99.
- Sashimi Moraiwase: The variety was quite good for 18 pieces, and it also included Toro and foie gras sashimi! I've had better foie gras for sure in Quebec, but this one was quite decently made.
- Grilled squid: Decent, though the tentacles were overcooked.
- Grilled lamb chops: Average.
- Baked clams with butter: Must-try at least once. I know it's $16.99, but the clams are the freshest I've ever tasted in the east half of the continent. The butter-alcohol mix was also delicious.
- Bacon asparagus: Quite good. Bacon is fresh and not that crispy.
- Green tea ice cream with red bean: Probably one of the best combinations I've had with ice cream. Definitely something I recommend as dessert.

Service was fantastic from start to finish. The servers kept coming back to us making sure the food was okay, and then asked us how we found this place. They eventually gave us a VIP card for future visits!

The price point is a little higher than most other sushi restaurants; I would put it at around Inatei's level. I personally liked here better than Inatei though!

Again, Toro Sushi's replacement! Now I'm not as disappointed anymore with the loss of Toro Sushi."}
{"text":"Came on Monday late afternoon lunch. The lunch special is so so. Just an average quality / presentation. I like the atmosphere that it is quiet, you can actually have a conversation with your friend during your meal.

But what impressed me most was their service. During my visit, they were not busy and the restaurant was about half full. However, the serving was very slow. It was not an important issue since we were not in a rush anyway. 

However, during the meal, the male server came over and asked us to pay the bill. At first, we thought we were holding up their afternoon closing time, but it wasn't the case as there were at least 3 more tables of people inside the restaurant... The worst part is that the server was rude and he didn't express apologetic feeling.

There are so many other Japanese choices to choose from in Markham area, and their food is not particularly remarkable, I don't need to come in and put up with this bad service."}
{"text":"I took my mother here for mother's day and she was thrilled. The presentation of the food was fabulous, it made everything look fresh and appealing. 

For the Chirashi we found the fish really fresh and sweet. The textures and tastes were all also quite different. We especially loved the fish that was melded with some sort of yellow fish roe (I'm guessing it was herring with herring roe? Since that was the only fish roe on the menu I was unfamiliar with).

The waiters were great, really friendly and happy to answer questions about the menu and dishes."}
{"text":"Quality over quantity.  Love the sashimi quality of this place. I love Uni and this place has it sweet and fresh."}
{"text":"Japanese restaurant run by Chinese people. However don't let that discourage you as the food was quite delicious and the prices are very reasonable. The place is busy but the service is able to keep up. I was impressed by the efficiency. I would definitely come back for Japanese food. This place is good for friends or family."}
{"text":"Hibiki is a higher-end sushi place tucked into a small plaza on the North side of Highway 7. The interior is surprisingly large and spacious. It also gets quite loud inside.

We had a dinner for 5 on a Sunday night and food came out pretty speedily, though there weren't very many people in the restaurant. Service was good, attentive and unobtrusive since there were few diners that night (but there were lots of kids for some reason).

I had the chirashi bowl. The quality and variety of sashimi in the bowl was great. It came with large and super thick slices of sashimi, which covered the entire top of the bowl. The chirashi bowl is generally filling enough for most people, especially if you consider the salad and miso soup also served. The avocado salad we ordered was more of a disappointment, considering its price. I probably shouldn't have expected anything exciting, unlike nearby Mine Sushi's avocado salad.

No wifi! Why bother naming a network 'Hibiki' if you're not going to give out the password?"}
{"text":"If I can give this place 0 star, I would. This is probably the worst Japanese cuisine I've ever been to, and I'll definitely tell you why. I never have been prompted to write a review, because everyone has different tastes and preferences. However, my review is not based on taste, nor preference. This place was so bad that I HAD to write a review. With their cheap service, I don't even think I can get some kind of discount or complimentary anything after I file a consumer complaint. 

Spent 2.5 hours at this place, actual eating was probably only 45 minutes. 

6:30- We booked a table at 6:30 for 9 (7 came all at the same time, the other 2 came about 30 minutes later), and left the restaurant at 9. No, we did not chit chat in between meals. 6:30 is not peak hours yet, and there was a party of 12 at another table but they did not order until maybe 7:15. 

6:45- We ordered within 15 minutes of deciding, and decided to share a mix of sashimi and sushi platter amongst 5 people, and then order our main dish separately. For my main course, I ordered a Sake Don, which is salmon sashimi and salmon roe on rice, and a Spider Crab Salmon hand roll, while our friend ordered the same but in maki form. 

7:00- The platter came first around 10 minutes later, and we finished it and thought, \"is this the whole platter?\" Oh no, it turns out there's a second round that comes 30 minutes later. We thought it would come in a boat, but it came in 4 big plates. As we ate the second platter, we noticed we did not get our miso soup and salad that is complimentary to our meal. We had to ask them and they gave it to us. 

7:30- We finished the second platter and waited for our main course... For an hour. Our friends got their dishes one by one at a 10 minute interval. By the time I got my dish, it was 8:30. 

8:30- I got my Sake Don after an hour of waiting, and it was just salmon sashimi and salmon roe on top of vinegar rice. I could have made that in 5 minutes. Raw salmon sashimi, raw roe, pre-made rice. Absolutely no cooking required and it takes one hour. Really? Worst part is it tastes no different from the sashimi platter I just ate, just more rice. 

8:40- We waited another 10 minutes for the Spider Crab Hand Roll. When asked why they took so long, they said they need time to fry the soft shell crab. Sure, take an hour to fry my crab. 

This spider crab salmon can be in maki form ($10.99) or hand roll form ($9.99). For $1 more, we can get a maki roll (~5 pieces, seen from my friend's plate) or *ONE* hand roll. I emphasize, *ONE* hand roll. For $10, I expect at least two hand rolls (especially compared to the pricing of the maki roll), or some out-of-this-world hand roll. But no, it was a shrunken aired out crab hand roll that tasted worse than what I can get at an all-you-can-eat Japanese restaurant. I gave my hand roll to my friend to eat, I didn't want to eat any of this crap. 

8:50- They gave us our bill at around 8:50 and again, we noticed we have not gotten our desserts, which is also complimentary to our meal. We asked for it AND THEN they gave it to us. Seems like their policy is if the customers don't ask or don't know about it, don't give them. My bill was $38 with everything included, my Sake Don was $15.99 (5 pieces of Salmon sashimi on vinegar rice) and $9.99 for ONE aired out deep fried crab hand roll, and the shared platter $49.99/5 people. 

This has been the most expensive, not worthy hand roll I ate in my life. I left hungry (and even if I ate the hand roll, I would not be full), and utterly dissatisfied with service and food. For the price I pay, I got worse food and service than if I ate at an all-you-can-eat or an Izakaya, and they're more cheaper and filling than this. Either you lower your prices, give the appropriate portion, or improve on the quality. I would have accepted a sincere apology for missing our order, an unreasonable wait time, excluding and not informing us that we had complimentary appetizers and desserts, and lack of portions for the price we paid.

I have blacklisted this place and will not recommend to anyone I know. I will actively tell people not try this place."}
{"text":"Update: Went for dinner on a Friday night and it was only OK. Still leaving the review as 4 stars but was much more of a 3.5 star experience. Out of 4 dishes we ordered, two were wrong and had to be sent back. 

We ordered a sashimi platter which was 18 pieces for $30. Value was not that great as the selection of fish was very standard: salmon, red tuna, shrimp, scallop and surf clam. Don't think I'll be back for another dinner here."}
{"text":"Just as everyone says, good solid Japanese cusine. Sushi/Sashimi done very well, fresh and presented well. Salmon Teriyaki bento box portion was....lacking though. Tasty but cut very thin. 

4 stars because it came with dessert or coffee! The ice cream was served well, unlike other restaurants where all you taste is freezer burn."}
{"text":"Food is very fresh. Quality japanese food. 
Must try foie sushi.
The volcano roll is different cool concept where they top it with warm scallop and crab salad
Their skewers are typical ones. 
No alcohol yet. 
Fresh oysters available 
Very high price point in items. 
Menus really big. Almost too much options to choose 

Store might have a problem staying for a long time when theres alot of ayce restaurants out there in markham.


Worth trying"}
{"text":"The food is just like all the reviews. It's really ok. No surprise. And the price is totally totally NOT worth it. A bento box cost 32???? Really???? A toro rice cost 25 but crash piece of uni, not even a whole piece of uni. Excuse me, 25 dollars I can't even buy a whole piece of uni.
Totally disappointed. Only because they are on highway 7. Their price is ridiculous high and not worth it. Their two person hotspot cost 50, it's almost an all u can eat hot pot price. What your thinking. Just like all the reviews. Food is just ok. Totally not worth it"}
{"text":"Fish was on the verge of going bad. It left a soil-like after taste. Food was overpriced and service was average. If it wasn't on highway 7 and kennedy area, I doubt it would get that much traffic. It is a nice place for a date and by no means for a large group. Depending on your occasion and if food is not your focus, its worth a visit."}
{"text":"We've always wanted to try this place for quite some time and for some reason there was always something that stopped us from pushing through. This particular day I was craving for sashimi and anything Japanese. Hibiki being the closest in proximity finally became the dinner destination. But alas,  disappointment. I guess I had built so much expectations with this one. They have a wide array of Japanese dishes, yet the simplest ones were not as impressive as I had hoped for. We had the Sashimi dinner and Gyu Don and on both dishes we know other places that have better. The place is spacious in decor,Jazz music playing in the background,  service was okay but that was just about it. By the time the bill came, we felt like we were paying more for the ambience rather than the fare."}
{"text":"First time at the hard to find place on Hwy 7.  I just didn't seem to see the signage but once you're inside it looks different (better) than the revitalizing area that is outside!  

Good service and above average quality for sushi and sashimi.  We also ordered the ramen and its was ok with chasu pork belly."}
{"text":"4.5 stars!  Outstanding Japanese food!

I can't believe that I didn't discover this place earlier.  Came here last night for a casual dinner.  The decor was modern with jazzy music playing softly.  It was a nice change from going to our usual Japanese places like Mi-Ne and Gal's in the area.

We were surprised with the wide selection of items on the menu and the prices were reasonable.  They have high quality sushi which is pricey but if you want to just go with your basic dishes, there are definitely lots to choose from.  I like the fact that they had a good selection of small dishes if you want izakaya style or your basics such as Rice bowls (Donburi), Ramen/Udon, Bento boxes and Set courses.  We got the Pork Shogayaki $13.99 Kaki (fried oyster) $14.99 and sashimi dinner 15 pieces $22.99 which were all set course that comes with soup, salad and rice.  Everything was delicious.  This will definitely be our new go to place!"}
{"text":"I want to give this place a better rating... but to be honest for what they offer and the prices they charge, I can go to better places. 

The restaurant itself is pretty big and nicely decorated with wood panels, simple and somewhat calming. Staff are friendly too... but the one we had was a bit too clingy, coming to our table every few minutes asking about our dishes, and 'advising' us to enjoy the sashimis quickly to maximize the freshness! ... ... just a bit too much. You gotta let your customer to actually 'enjoy' their food.

Their sashimis were good... but not great. The only 'special' menu item was the toro sushi special in my opinion, which lets you try 3 different types of the fish; it ranges from normal to the fattiest part. Something you can't find in many places. If you're a toro lover (like myself) you can give this place a try.

All in all, I just found the food quality and pricing not very well balanced. Nothing to really attract me back here."}
{"text":"Food is delicious, love how fresh their sashimi is! Located at a convenient location too!

More pricey compared to other places but quality is definitely much better!

Service is decent and the restaurant also has a nice atmosphere!
I've encountered a few problems here before with things like the food not being cooked throughly enough or not getting correct orders, but it's always handled really well and efficiently. Stars for the well trained staff! 

The only complain I have is their opening hours. They open for lunch until 2:30 and then they close until 5:00 ;-;
Kind of sad because last time I went with my sister at 2:00 and then found out that they're closing. Not a good place for people who sleep in past noon.

Anyways, they have pretty good lunch deals so give this place a try!"}
{"text":"bad customer service. I just ask for another high chair for my toddler and the waitress give me a dirty look. I order the set black cod dinner and the salmon teriyaki set; they are not very great. The rice that comes along with the dinner set is not hot. The black cod was salty and the salmon was over cook. I order the avocado sushi; the sushi rice doesn't even taste good. As the chef who's making it don't have any training at all. Not worth the money!"}
{"text":"I went to Hibiki on a Thursday night with my mom & sister.  The restaurant is located in a tiny plaza just past Unionville Rd.  Parking is somewhat of a struggle as other stores compete for 15 parking spaces.

Walking in - the restaurant was somewhat empty at 6:45 and only slightly filled up as our meal continued.

First off, this restaurant is worked by Chinese employees and doesn't really have the whole authentic Japanese vibe that you'd expect.  That being said - the employees were a hit or miss.  Some would be super attentive and come by every so often to clear plates and smile at you. Others would briefly glance at you and then glare like no tomorrow when you wave them down.

We ordered the:
1. The \"snow\" fish which was honestly something straight out of perfect childhood memories.  Except for the small bones.  
2. The 'small sushi boat' which was honestly so fresh.  The sashimi was firm and didn't taste like it's been left out for 3 years (as AYCE tends to taste like) and the Cali Roll was soo creamy.  I will definitely be back for this.
3. The ramen (I dunno what my sister got) but it was really bland and she didn't want to put in the chili flakes.
4. The nabeyaki udon.  Yes.  Yes.  100%.  The bowl was loaded was ingredients besides only noodles.  The broth was aromatic and the noodles were ... bouncy.
5. But the highlight was definitely dessert for me.  We got the mochi icecream.  HANDS DOWN. The red bean was sweet but not overly so and the mochi texture makes it ... fun to eat.

I'll be back soon!"}
{"text":"The sign attracted me to try this place out so I did. Its a Japanese cuisine, not ayce.

The food quality is great, everything is fresh and good. We got the sushi, sashimi, maki set. The sashimi came fist and I can say its all fresh fish. Then the sushi and maki came. All fresh fish, the rice is good and the cutting skill is great. Everything is awesome.

If you have read my review, you know that this awesome greatness will only earn 3 stars, this restaurant is missing that \"wow. This is something out of this world\" or \" holy, I must come back again\". Also, yes, the material is great and the cut is great. But the difference in price compare to the increase in quality does not match. Its only marginally better compare to gal sushi but the cost went up way higher. Also, gal sushi will serve salad and sides. This place will not. This kept my rating to only 3 star. Lower the price and serve some starter will make it 4. Make a special dish or something special will make it 5. Right now, 3, sorry."}
{"text":"(3.5 stars) First time here. This place doesn't really stand out when you drive along Hwy 7 and can easily be missed. The inside has a nice and quiet environment. Nice decor. Pretty good service. 

I made it just 15 mins before they closed for lunch and they still served us. I originally wanted the order the Uni, salmon and salmon roe don but unfortunately they didn't have any Uni, which was kind of disappointing. I settled for the chirashi instead. The sashimi were really fresh and in thick cuts. It was a very good portion with a good variety of sashimi. The lunch special came with miso soup and a salad. 

I personally think this place is on the pricier side. And will probably only come back to try their other lunch specials. I was looking at their menu and a bento box was price averaged around $25 (expensive in my opinion)."}
{"text":"Great lunch menu, comes with soup,salad and coffee!
Friendly server! and fresh sushi & sashimi! definitely recommend"}
{"text":"Came here today with my family for lunch. We ordered the tempura ramen, a katsu ramen, a katsu soba, and a katsu donburi. Was quite excited about the value of the food - 8.99 to 15.99 for soup, salad, entre, and a choice of ice cream or coffee. 

The food was very hit and miss. The quality of the katsu drastically varied between the 3 orders that we had... It was like they were using three different grades of meat. Of the two ramen that we ordered, the broth of one was completely burnt - not a delicate roast, but full on burnt. The other one was lukewarm at best... The salad that comes with the lunch special was quite fresh, but asides from that everything else was mediocre at best. 

I liked the atmosphere of the restaurant itself and the service was good, but likely won't be back because of the food quality."}
{"text":"Came here on a weeknight and it was quite empty, but we were asked to sit at the sushi bar because we didn't make a reservation. The restaurant was still half empty when we left, so that annoyed me but it was fine because we were just looking for a quick eat. The service and overall ambiance was fine. The sashimi was fresh and cut very thick, so I highly recommend the Chirashi which was good value. The menu actually offers a variety of sashimi including lobster, which I would come back to try."}
{"text":"3.5 Star

Lunch Special, nuff said!

Hibiki is the newest Japanese restaurant in the area. 

Excellent sashimi! I highly recommend the Sashimi Lunch ($15.99). A little expensive? But what you get more than worth the price! 

There are definitely room for improvement. Shari Rice a little off and I wish they serves short-grain round Japanese rice with their sashimi which when cooked perfectly can be the star of the dish.

Pro Tip: Coffee or Ice Cream? 

As a coffee lover I would suggest ordering coffee instead of ice cream. Their coffee is Siphon Coffee made to order. Not some thing you can get in other Japanese restaurants or any of the coffee shops in the area!! 

You will see me enjoying my quiet lunch here quite often at Hibiki and sipping on coffee!"}
{"text":"This review is my comments about a dinner experience; while the previous review that was about a lunch experience.  This review does not replace the first review but complements it.  Together they provide my complete opinions on Hibiki.

 We came for dinner.  We ordered an appetizer, a Sashimi Platter and a Eel Fried Rice.  The sashimi was excellent.  Thick, creamy, soft, supple.  I know, it is $30 for 18 (big) pieces, but I doubt you can get this level of quality much cheaper in a dine-in environment.  Eel fried rice was tasty as well.  We didn't order any beverage.  

Services was attentive as before.

For dinner, we paid $60 before taxes.

Based on the quality of the sashimi, Hibiki is a true 4 starred Japanese restaurant in Markham."}
{"text":"I decided to try Hibiki for a Tuesday lunch. It's located on a strip on Hwy 7, so it's easy to miss. Fortunately, they have many parking spots in front of the restaurant. I walked into a mostly empty restaurant with 2-3 wait staff, yet service was still very slow to start. It improved after I ordered.

The lunch specials were a good deal. All lunch specials come with miso soup, a salad, and a dessert. I decided to order a chirashi ($17). The rice that comes with the chirashi was warm and tasty. It included a few pieces of salmon and tuna, a scallop, a squid, an octopus, a shrimp, 2 imitation crab sticks, tamago, surf clam, and one or two things that I don't readily recognize. Everything was fresh. I really enjoyed the flavor of the salmon, tuna, and scallop. The miso soup was very tasty. The dessert was a taro pudding. It had a very floral taste to it and was very creamy and smooth. I really enjoyed it.

I agree with others, this is a 3.5 star rating. For me, Hibiki is a long drive from where I usually spend time, so I wouldn't come back just to come here. Even if I was in the area, there are better sushi options (Yang's) in the area."}
{"text":"This is one of my go-to restaurants for sushi.  I have been coming here since it first opened 2-3 years ago.  

Pros: 
- delicious chirashi with a variety of fish
- flexible with changes (I request for no tuna and that I would like scallop and it hasn't been a problem)
- good service usually
- flavourful tea (trust me, this isn't something that applies everywhere and I am a tea fanatic)
- comfortable seating
- lunch menu that comes with dessert or coffee at the end of your meal
- many options available on the variety of fish
- great presentation of food

Cons:
- prices have been rising since it opened
- cooked food isn't as special or tasty as raw in my opinion (udon, ramen, etc)

Overall, I would recommend eating here.  The chirashi price has gone up to nearly 20 dollars now but it's a bit cheaper at lunch."}
{"text":"I honestly don't get the hype with this place. I've been here for lunch and I've had a better experience than for dinner. We arrived at about 7:30/8:00ish and there was about a half an hour wait time (it's fine, it's Friday night so I get it). We took a look at the menu and decided what we wanted while waiting so that we could order right away. I didn't see a yam tempura roll on the menu so I asked if they would make it for me, and they accommodated to my request (that was very nice of them). In addition to that roll, I also had the cucumber avocado roll and some edamame to start. M had a golden oyster (?) and the seafood ramen. We were both under whelmed. The food barely had any flavour. And I know some people are thinking but \"you only ordered veggies rolls, what do you you expect?\" But seriously it's like the sushi rice had no flavour whatsoever. M said that the ramen had no flavour either (I think he shook some sort of spicy flavouring on his ramen like 10 times). 
Also you don't get one specific server, random people bring you food:tea/water and it's strange because you don't know who to ask if you need something.
Would I come back? No, especially when Osaka or Gals are just a stone throws away!"}
{"text":"Decent alacarte sushi place. Love the decor. Each table has a different tea cup! 

Has a lunch menu with a wide selection. My friend and I came here around Sunday at 11:30-12. It wasn't too busy. The parking lot is crazy after 12:30 though, so you should go early on weekend. 

I ordered their tonkatsu ramen - lunch special, which includes a choice of maki (six pieces - choice of salmon, tuna, cucumber or avocado). $11.99. 
The ramen was very plain.. it basically had no taste. The katsu was very dry. The maki, which I ordered the salmon, came with a generous amount of salmon, which was nice! 
My friend ordered the teriyaki salmon bento box, it looked appetizing! 
We then ordered a spicy salmon maki, which tasted great. And a surf clam maki, which was okay. 

Overall? It wasn't bad, but there are many more places to try! Will come back if I'm around the area and feeling for sushi - not ramen!"}
{"text":"I am going to steal Wendy L.'s great Yelp taglines (so cool...hope I'm not violating yelp trademarks) - just this once...only!

WHAT TO TRY!   

Uhm...nothing...I didn't have much choice nor did I want to choose.  I'm in cruise mode.  I let JK choose as she is intimately familiar with the staff and their menu.

Hibiki is \"conveniently\" located, next to Platform Espresso Bar, and since we were just their for a morning java jolt!  That still means parking is a mad-zone.  Once you can park your urban form of transportation, you can relax in the tranquil and oddly quiet restaurant.  Isn't it funny when you go to a Sushi joint, you all of a sudden find your moment of ZEN!?!?  Hey!  Someone break out the Taiko Drums - it's just too serene!

Lots of wooden funishing provide warmth to the restaurant with comfortable booths and tables.  Chefs expertly craft delicious sushi and sashimi, from behind their large bar, to appreciative customers.  I wonder if they are doing Omakase?!?  I want!

The lunch was a combo sushi with sake maki.  Some tempura, Udon, and a tuna hand roll as well.  A good meal was had and off we went to have another meal at a Korean run Japanese Katsu place!  Why not, we just had a Chinese run Japanese Sushi meal!  Lord I luv Canada and the confusion of Asian cuisine!  If your reading my reviews, you know where this is going next!

LAST TIP?!
Get their coffee.  Not quite sure what their brew process is but the results are a good body coffee without harsh bitterness.

Cheers!"}
{"text":"The food was great, and service was good.  I don't really have much to complain about this place asides from the couple with their baby at the table behind us constantly being loud.  

The sashimi here is fresh, you get what you pay for pretty much.  We ordered 6 raw oysters ($1.50 each on thurs), grilled Hamachi, and spider roll with salmon wrapped around it.  However for $1 less you can get the normal spider roll, which I think would be better, the salmon didn't really factor into the flavour.

Great place, if you want quality."}
{"text":"My friend and I went here on a weekday night and we were the only ones there. People started to slowly trickle in but still not too busy during dinner time. The sushi here is pretty good so I'm guessing the main reason why it's not that popular is that the price is a bit high. I had the chirashi and I thought it was good. The fish was fresh, but the rice to sashimi ratio was off - there was too much rice at the bottom. The tako wasabi was from the specials menu so not sure if it's a regular item and the gyoza was decent. The interior though was really nice and all the plates were so cute. We did not expect that once we walked in since it was in such a tiny plaza. It's actually an easy restaurant to miss if you're not familiar with the area. Overall this place is great if you're willing to splurge a bit for the Japanese cuisine."}
