{"text":"Horrible. All the other reviews are right on par. I have been here 2 times and both times were terrible. Bar tender was oblivious I was there even though there were only 5 other people in the bar. The last time that I was here there were 2 customers smoking weed out in the open near the back door and the bar staff had no issue with it and did nothing about it. This place is total trash"}
{"text":"Used to be a regular at this bar.  They fired Dawn the bartender who was the best worker this bar had.  Will return when she is rehired."}
{"text":"Kinda like this place..... No cuss, no problems.... Free to play pool ! Wooooo hoooo!!!!  Selection of beer but not wine.... Hope they will start to serve champagne , then I would come more often!"}
{"text":"To sum this whole paragragh up...... \"BAR\" = DUMP, WIFE = SKANKY LESBIAN RUDE BIOTCH, Bands suck, the most sober gets everyone else kicked out...never happens, Cheap for a reason thats the only way they get the money. Spend more get better!  This \"Bar\" is a dump! The owner's wife is an idiot! She's running this bar to the ground! If you want to have a good night forget going to this bar you'll get nothing but a horriable nightmare! It's not even a biker bar.....maybe if your 60 or older but under the age of 35 don't go! This is a warning! We went one about a month ago and the owner's wife drunk as hell and start's yelling at my wife check this out through the cracks of the bathroom stall telling her not to use all her toilet paper. So we decided we wouldn't go there again, then again we decide it's very dirt cheap so lets go back well last night we did what dumb mistake! We start there with an old crappy band, and then decide lets play pool put 75 cents in the machine, one ball is missing, can't play with one ball missing so we decide oh well lets just play take away the other color ball, we start playing and all the balls got stuck, and the pool sticks had no tips we had to share a stick. When we decided to complain that we couldn't play anymore because the table was broken 1st she decides to say it's not broken I just got this fixed.....well we didn't break it so idiot someone did. While she's away one of my friends decided to get the balls off the table and \"punches the balls\" she comes out yelling it costed her $600 to get it fixed and was making a big deal over the balls even though thats the whole point your supposed to hit the balls....with a crappy stick! She yells at my friends then comes to me and my wife even though were no where near her and starts yelling at my wife through me. She says everytime you guys come here theres a problem....and includes when you left last time you left trash...oh I'm sorry forgot this was a prissy bar where the owner is LAZY doesn't want to do her job or pay for it.....but she can \"FIX\" a pool table. I said what? and she keeps going then decides to call me a drunk....when she's the worse person in the whole bar, and I was the D.D. how the hell was I drunk? Then she keeps going when I'm clearly ignoring her so finally I asked why she was still talking to shut up and she said don't tell me to shut up. I told her it's okay you just lost $100+ a night from us so thats fine you'll never see us again so she decides because were leaving to say you guys are 86'ed really? Because your drunk ass can't handle the sitiuation. She ruin's everyone's night even the person that is not saying anything.....She's an old lesbian even though she claimed she's been faithful for 4 years and then asked my wife if she's jealous that she's making out with other woman on the pool tables....that she's mad about I mind you....but she's \"faithful\" my ass! To finish and sum it up I'd rather pay $6 a beer at the expensive bar's then go here ever again!!"}
{"text":"1.  If you are a non smoker, this is not the place to go.  They allow patrons to stand right outside the front door so when you walk in and out, you also walk through the wall of smoke since they allow everyone to stand door side and smoke.  The smoke also trails into the bar so I'd say this is not a non-smoking place to go!  2.  No waitress service to speak of so have to wait on yourself for drinks, etc... then the bar staff seems inconvenienced when you ask for a drink.  They stand off in the back corner of the bar talking and ignoring customers.  HEY - Can a patron get a drink!!!???!!!!???  3.  Beer was not cold.  4.  Staff that is there, not a smile on one of them, very UNfriendly!  5.  The lay-out of the whole place is a disaster, like a open warehouse with tables and chairs thrown in random places.   6.  Nice stage but this place had a reputation for not wanting to pay the bands  (BAR OWNERS WIFE)  after they finish their gig or cut them short of their agreed upon price so if you want to play for free or get side swiped when its time to get paid, then go ahead and get booked.  Her tactic is to book you, agree on a price then when it comes time to pay you, she comes up with a different agreed upon price then wants to throw it in the bands face why THEY didn't bring enough followers.  Even if you bring in 20 - 30 people, that's not enough and somehow she justifies that gives her the right to short change the bands.  READ OITHER REVIEWS ON THIS PLACE THAT SAY THE SAME THING ABOUT THE CURRENT OWNERS.  7.  I agree with one of the other reviews I came across, this place is a DUMP!!!  8.  The 1 descent review on this place - I'm willing to bet the bar owner's wife all of the money she's tried to short change bands for that she wrote that review.  Oh, and there are NO HOTTIES working there, that was fabricated or written by someone REALLY drunk.  ***Too many other good places to go in Surprise with friendly staff, honest owners, good service and smoking areas that are enforced.  This place will never last under the current management...  Bye-Bye  PS - if you own a bar/restaurant with live music, it is your job to make sure the talent of the band is what YOU as the owner of the establishment expects.  It's like hiring an employee, check references, not that hard to do with a few phone calls people.  When you make a deal with a band that takes time out of their life, moves equipment and sets up, performs for 3-4 hours, breaks down and then expects to be paid the agreed upon price, be honest and professional, not to mention a person of your word and pay them, no excuses!  If they were not up to your expectations shame on you and don't bring them back, plain and simple."}
{"text":"I went to Octane when it first opened and have been there a few times since. I have basically watched this bar turn from a pretty cool local bar into a biker bar and now into a somewhat gangster rap bar.. music so loud that you need to see an ear doctor the next day.. hats tilted on heads, mens pants below thier asses with boxers showing. enough jewelry in human holes to create a strobe light, who can give the dirtiest look competitions.. just ridiculous..bring your numchucks because no one is here to have a good time unless your just as gangster as they are trying to be. But hey, if this is you.. this is your bar.  Ive never ever given a one star review, this is my first.    I do like the name of the bar though :)"}
