{"text":"Worst shuttle EVER.  Waited for 20 minutes!!!  At each stop driver after outs the driver got out and wasted 1-2 minutes talking to various random ppl to see what hotel they are going to.    Definitely NOT the experience I want after arriving at Toronto at 10 and finally getting to an airport hotel NEARLY AN HOUR LATER."}
{"text":"It saddens me that yelp does not allow a rating below one star. If I could give negative stars I would. I made a reservation through Orbitz for less than a hundred bucks, thinking I got a great deal. I've paid a lot more for a shabby motel at the last minute on a busy holiday weekend. But then I find out it will cost $12 just for Internet? What? Is this 1998? I can get free Internet at Tim Horton's, for crying out loud.  Then they charge me $18 for parking! This is not some downtown parking garage with armed guards but just a hotel parking lot. So lets add this up. $30 in hidden fees on a room that cost $94. I wanted to leave, but Orbitz told me the manager wouldn't let me cancel and the manager told my wife, Orbitz wouldn't let me cancel.  (I was so steamed I refused to talk to them.) So obviously one of them is lying.  Just to be safe I will never use Orbitz or stay in a Hilton again.  I will sleep in my car in a Walmart parking lot next to a Tim Horton's before I stay in a Hilton again. At least the parking and wifi will be free. The coffee might not be free, but at least they are honest enough to let me know that ahead of time.  What is really sad is that I would probably have paid $124 for the room without thinking twice. It's the dishonesty of sneaking in the fees that cost them a customer."}
{"text":"We had a wonderful experience. The staff was friendly and helpful. We did request a feather free room at booking, for allergy purposes, which they did not do but they sent someone promptly to change the entire bed. Instead of having to call down to the desk every time you need something, you can now just text them! Very convenient! The in-room dining was quick and delicious. Everything was very neat and clean and in working order. We would definitely stay there again."}
{"text":"The bathrooms were disgusting and there were burn holes everywhere. The walls seemed like they had never been wiped down and in the two rooms we stayed in there were greasy finger prints on every light switch and TV remote. We found dried up juice or pop spilled all over a vinyl bench in the room. Very dirty and very disappointing. I was fooled by the rest of the reviews. Don't stay here. For a Hilton I was thoroughly disappointed."}
{"text":"Close to airport...clean...friendly staff. Outdated decor, executive appetizers on 9th floor at 6pm...be sure to get there early if you really want an appetizer.  Much too pricey for accommodations.  Do yourself a favor and go to the Hampton Inn just down the road."}
{"text":"At $209 for a regular room with a king bed, I expected more really.  Clean and functional though.  The wi-fi is sketchy but at least it was free.  Dinner is restaurant is pretty uninspired and obviously pre-heated stuff"}
{"text":"The wifi in the rooms are horrible. Not only is it super slow, but it cuts out often. I guess they do that to prevent you from streaming Netflix or any other streaming service. If you have to pay for the Internet, then don't do it. It's totally not worth it. If you're an HHonors member, you get it for free. But even then, it's not worth it. That's the only gripe I have with this hotel. Everything else is fine. Well, except maybe the shuttle service, but that's a whole other issue."}
{"text":"Yes it is good, but only for its view and equipment. It's definitely not worth the price."}
{"text":"Great service- front desk, restaurant, shuttle bus all super nice and helpful.   helpful staff.  Not too bad on airport noise- barely noticeable in fact.  Food is pretty good.  Bartender ALAN is excellent- very on top of things and so nice.  Will stay next time I'm here."}
{"text":"I found this hotel through an online hotel reservation site. It was one of the most reasonably priced.  The hotel shuttle was easy to find at the airport, and the hotel located less than a mile from the airport. Everyone at the hotel was friendly, the gym was adequate.  I ordered room service which did not arrive after an hour.  I phoned the front desk to complain and went to the restaurant.  Immediately, the manager arrived to apologize and I got a free breakfast buffet!  Wireless is only free in the lobby and breakfast is not included.   The room is clean and quiet. I would definitely stay here again if I am in transit through Toronto."}
{"text":"love this hotel... I checked in about 6am expecting to spend 1 night there and ended up spending 4.  They don't allow  dogs but they allowed me to have my 5lbs pooch stay. The staff is very friendly, the cleaning staff is great not to mention the amazing pool and comfy beds .  There are small restaurants within walking distance along with a tim hortons for a  quick coffee run.  the only downfall is there is no free wifi in the rooms..... but   I would recommend this hotel for anyone staying near the Toronto airport"}
{"text":"The hotel looks to be renovated recently and common areas are warm and inviting.  The quality of the rooms appear to be slipping - even after the recent reno, linens were not clean, much of the room furniture and hardware is worn or broken. In room wifi access was spotty too. I have to think there are better options nearby"}
{"text":"Clean and affordable, very close to the airport and they have frequent shuttles.  Executive lounge had drinks, coffee, and snacks.  I would stay here again for work...  Bathroom in my room was a bit older and could use a remodel but overall not a bad place for work."}
{"text":"Was at this hotel for meetings. Facilities seem nice and food service, while not out of this world, is good."}
{"text":"I was here on a business trip recently.  This Hilton is nice, clean, and conveniently located adjacent to the Toronto Airport.  The staff was friendly and the concierge was very helpful in offering up suggestions as to where to eat, what to visit, etc.  The hotel is modern and appears recently renovated.  When I visited, they were still undergoing constuction in the back of the hotel (which is where guests are supposed to park), so I had to park in the front.  The indoor gym is nice and there was also a raquetball/squash court.  There's free Wi-Fi in the Lobby area.  Other features: outdoor pool, and outdoor parking -- maybe not so great for the winter months.  The (complimentary?)continental breakfast was much better than I expected.  Usually continental breakfasts that are included with hotel stays are nothing but cereal, pastries, and maybe some apples and bananas.  I was very impressed with the continental breakfast buffet the Hilton offers their guests inside the Bliss restaurant.  Some of their offerings include: a variety of cold cuts, lox, yogurt, berries of all kinds, bagels, pastries, cereal, and bircher muesli.  Covered with fresh berries, the bircher muesli is absolutely divine...      I didn't spend a lot of time in my hotel, but overall, I had a pleasant stay at the Toronto Airport Hilton."}
{"text":"We had a fantastic expirience with this hotel. We booked through hotels.com, and only had to pay $109 a night for two queen beds. Breakfast and wifi were not included originally. However, when we got to the hotel (which is about a 20 minute drive from downtown Toronto) they told us they would give us free wifi, as we were dissappointed that it was not included. We stayed here for three nights. On the first night, my mother couldn't sleep as the curtains were not completely dark. This was more our fault than theirs, as 99% of people would not mind this. However, we spoke to the staff, and here is when we knew this was truly a 5 star hotel: They awarded us free breakfast for the next two days, and upgraded our room to an executive suite. Truly great customer service. They even discounted our third night's pay to $99. The pool was cold but beautiful, and the breakfast was probably the best hotel breakfast I have ever expirienced. It was a buffet with many kinds of fresh fruit, homemade jelly, perfect muffins, there was an entire warm section with the best potatoes I've had, etc. All in all this business hotel got the job done for our family and we'd recommend it to you!"}
{"text":"Nice room but then I heard the guy in the joining room next to to me- call for a prostitute. So I went to the front desk to change rooms...& they wouldn't. 2 hours later/ I could hear yelling & it sounded like he was beating her up. Next thing he threw out in the hallway- I could see through the peep hole, she didn't even have her cloths on.  Poor customer service Hilton! Might as well be a Super8!"}
{"text":"Honestly. Debating a 3 or 4.   Staff is a 5 star!  At all levels!  My room was amazing!  Full disclosure I'm Hilton diamond and was upgraded to a suite.  But really I'm about a clean bed, decent onsite eats, and a gym.   And this place meets all my criteria"}
{"text":"A cancelled airline flight left us in Toronto needing a hotel near the airport for the night.  Using my hilton app I quickly identified and booked a room.  The hotel is modern, clean and well managed.  Front desk staff were exemplary.  Check-in swift and a room upgrade.  Local dining recommendations were given.   All in all a highly recommended experience."}
{"text":"This hotel gives a whole new meaning to the phrase \"lipstick on a pig.\" Looks like this place was built in the late 70's/early 80's, and while they may have tried to renovate it, they've fallen completely on their face.  Parking- Guest parking is split into three areas: Pretty close to the door, the back 40, and separating the two, \"the warehouse.\" You do not want to park in the warehouse. I did for two of my four nights and there was so much bird shit on my rental car afterwards you couldn't tell it was black. Also sounds like there's some type of electrical arcing inside, so you might end up with a burned out write off when you go to leave. Seriously, this is the type of building used to film horror movies. Parking was nearly full most nights. You use a key card issued by the front desk to get in and out of the lot. One of the exit card readers had something jammed in it for a couple days of my stay, so that gate was blocked.  Service: This was the lone bright spot. Front desk, restaurant, and housekeeping were all professional and pleasant. No issues here.  Elevators: Elevators are definitely showing their age. Very abrupt movements, doors stay open for about two seconds on each floor (run!), and they might get you to the right floor. In the south tower, avoid the elevator that's closest to the ATM in the lobby. This lift was incapable of letting me off on the sixth floor. Instead it always put me on the seventh. And sometimes (but not always), when trying to go to the lobby, it would let me out on the gym floor. So if you're in your room having a heart attack, the paramedics have a two in three shot of getting on the right elevator and getting to your floor. I guess those are good odds?  Room. You've probably looked at the pictures and thought \"how cool! They put the beds right in the middle of the room.\" Because they are right in the middle of the room, they take up about 90% of the floor space, leaving you with absolutely nothing. The rooms are microscopic to begin with, and then you have to squeeze around the furniture. There are no electrical outlets near the bed if you're like me and use a cell phone for an alarm clock. The desk is tiny as well, and like everything else, is right next to the bed. Wallpaper is scratched/peeling/marked. I could also hear not only everything in the rooms adjacent to me, but people talking in rooms several doors down the hall.  Bathroom: The bathroom is even smaller. The ceiling is only about 6'8\" / 2m high, so if you're on the taller side it's not going to work. They really crammed everything in there, too. They tried the trick where they put the towel rack inside the shower, however the shower (shower/tub combo) is so small that your towels will end up soaked. And I smacked my head on it a couple times. The makeup mirror is conveniently positioned behind the toilet, so it has no possibility of being useful.  Area: The hotel is right next to the airport. There is minimal aircraft noise, and a moderate amount of noise from vehicle traffic. The noise from inside the hotel is far worse than outside. Coming back to the hotel around 10-11pm, I saw a few shady people hanging around the front doors (if you're a guest, you enter the back of the hotel). Not too much around. A few restaurants, several other hotels, the airport, but you're going to need a car to get to just about anything in the GTA.  If I were to put a fair price on this hotel, I would say $65/night. Anything more and you're wasting your money. Don't forget, there's also a charge for parking (self or valet), and for internet ($20 for 3 days, $13? for one day)"}
{"text":"This hotel was quiet, clean, and in a good location.  Fair price for good quality.  They even have a free shuttle to/from the airport which is even convenient if you don't want to pay city hotel prices because you can take the 20 minute train right into Union station.    The rooms felt spacious and the bed was comfortable.  I didn't use the amenities and did not dine here. The staff when I first arrived were not the friendliest but when I went back to ask questions there was one lady working the front desk that was really kind."}
{"text":"I need quiet and darkness to sleep. This hotel has neither!!  bring a sleep mask and ear plugs.... otherwise nothing happens..."}
{"text":"Great hotel.  The only reason I didn't give it 5 stars is because there were some mix-up with our reservation and we had to wait for about 20 minutes till they found a room for us -- and they ended up putting us on a smoking floor without even asking if that's ok.  Luckily, the room didn't have any traces of smoke odor.  I doubt that they were that booked on a Wednesday night with nothing special going on in the vicinity...  Other than that -- it's beautifully appointed all around, stylish decor, very comfortable beds, nice pool and fitness facilities and a very impressive breakfast buffet -- even including items like eggs benedict, lox and a great assortment of fresh fruit and berries."}
{"text":"Let's be real: you aren't here unless you're stuck at the airport. This place works for just that.  This Hilton is neither particularly fancy or not fancy - it's just functional.  The rooms are big, clean, and fit the bill for a tired traveler.  The basic rooms aren't cheap, but they aren't particularly pricey either, and they're certainly cheaper than the competition.  There's late night room service, too.  The only real caveat to this place, particularly as compared to its competition, is that it is not directly connected to the airport.  This can suck if it's cold - you'll either need to wait for the shuttle or hire an (expensive) Taxi/Uber.  Either way, it still nets out cheaper than the (more expensive) hotels connected to the airport."}
{"text":"So I'm in the hotel business center writing this review while awaiting a ride to the terminal.  My husband Rick and I are flying Pittsburgh-Toronto-Hong Kong and thanks to one of those airline fare quircks, it was actually cheaper to stay overnight in Toronto than to make a direct connection.    This is a typical airport hotel.  Lots of meeting rooms and convention space, concierge, laundry and valet, rental office space, car rental, etc.  Kind of impersonal service here too.  Oh not that they're rude or anything.  In fact, quiite the opposite.  It's just that they see a lot of people here.    Ou room though is fantastic.  It is large, bright, and airy.  The beds here are very comfortable and I had no trouble falling asleep.  Our room has a flat screen TV and you usual  iron, ironing board, hair dryer, and coffee maker (always a requirement when traveling with Susan).    Oddly enough, the one amenity this hotel doesn't seem to have is a fitness center.  At least I didn't find one.  You'd think that with all these business people and people making overnight connections, they'd have one.  No matter though, they have a terrific outdoor pool which Rick and I made excellent use of."}
{"text":"Clean rooms, quick check-in at 4am. Staff is efficient, but not particularly friendly. Location to airport is definitely why people come here."}
{"text":"The room was clean until I. Walked into the bathroom someone forgot to clean the pee spots on the toilet seat. Thanks"}
{"text":"This is absolutely the worst hotel I have ever stayed at. Air Canada put us up there for a night because of a flight cancellation. Filthy smelling carpeting, the odor of the hallways was like nothing I have ever experienced. I slept on top of the bed with a sweater under my head because I didn't want to put my head on the pillow. I have noticed all other comments were relatively positive but were written by Canadians. They need to travel more, this would never be acceptable in San Francisco."}
{"text":"Always a great place to stay. The doormen (Carl & Jeff) are the best.   Also, visit Alan at the bar and get some chips. Amazing."}
{"text":"This was our first time staying at a Hilton. We finally got to the hotel after having spent two hours trying to get a rental car (See review for Payless Car Rentals). The inside is so beautiful and feels like you're at a luxury hotel. We got to the counter and the man checking us in was super nice and made sure we felt at home (We found out he used to live a few towns over from us!) and had everything we needed. We ended us signing up for the HHonors membership so we could get free wifi during our stay (Its basically a free membership/points program so why not). Make sure to register your car at the front desk when you check in so you don't have problems going in and out of the parking lots. Our room was clean, aesthetically pleasing, and it was easy to figure out the amenities. Only down side was that you can't really take leftovers back unless you like them cold because there is not a microwave in the room, but there is an empty mini fridge. THE HOUSEKEEPING LADY was super nice and polite. My friend had bought a Canadian flag and had laid it out on her bed and when we came back, the lady had remade the bed with it at the foot and folded her blanket and placed her stuffed moose on top. She was truly the highlight of our stay.  Would DEFINITELY go again."}
{"text":"I had the privilege of going to a math conference over the course of two days at the Hilton hotel. I had a great experience here. Upon arriving I drove around the back of the building to find a huge parking lot (rate $22 for the day). The building was accessible with a ramp and a set of stairs to enter the back of the building. Our conference was being held on the lower level. Each day the Hilton catered the food and it was very fresh and tasty I was highly impressed! The washroom facilities were very clean and well maintained. Everywhere you went within the Hilton for meetings there were note pads and pens available for you to write on. The sound system was very clear with microphones being used to project the presenters voice. There were also projectors in every room allowing for a great presentation. The hotel was very clean and well kept and the employees there were very friendly and eager to direct you. I had a great time at the conference and would highly recommend it to anyone looking for a similar venue. It was located right beside the airport and right beside it was the 427 which was extremely convenient!"}
{"text":"This is by far one of the finest Hilton locations I've stayed at anywhere in the world. Newly renovated room and what must be a Marti Million dollar pool, basket ball, and racket ball court addition. My favorite room on the property is the premium corner suite with fireplace, loungers, and beautiful bathroom. Don't get confused with the standard corner suites as it's a far cry from the premium one. Give yourself enough time for transport to the airport as it's in my opinion one of the more Pooley designed airports in North America. Love staying here"}
{"text":"I've stayed at this hotel before, several times actually, but last week was my first time back in a while - at least four years, I'm informed, because that's how long it's been since the lobby was renovated and the check-in area moved. The renos were quite nice. The room itself was clean, comfortable, and had an interesting layout, including a nice chaise which regrettably had been burned by some clown with an iron.  There's a nice restaurant/bar in the hotel but it's pricy, but a short walk down the street (turn left as you exit the hotel) are a few other options.  Rack rates are high, but I got the room on Hotwire for about $110. They do some neat packages with good rates from time to time, I used to do their \"dinner and a movie\" deal a lot when I was traveling early in the morning."}
{"text":"This is place is a milestone in the decline in the Hilton brand. The place is a dump even by airport hotel standards. When I checked in and got to my room there was a plate of unfinished food waiting for me.  I went to the front desk and told them and they apologized and here it still sits. So they were sorry but not sorry enough to something. The place hasn't been kept up the furniture is well worn and broken. In addition it is incredibly cheap. Like bingo hall cheap. I would suggest staying else where.  Update: the hotel had checked me into someone else's room. They gave me the keys to my room and when I went there they had checked someone other than me into that one. So, anything that person would have charged to the room would have been charged to my credit card. They then moved me to a third room. Presumably this room is actually mine."}
{"text":"Taking the suggestion of the staff. I ordered the spinach and shrimp salad to go. After a short wait, I received my salad and walked back to my hotel. I sat down ready to eat my meal only to discover my salad did not have shrimp. Too disappointed to walk back..."}
{"text":"Hotel is ok.  Wireless is $10/day per device.   Cheaper hotels give you similar rooms with free Internet.  Hotel restaurant over priced for premise reheated \"fine dining\".   Bigger bang for your buck elsewhere.  Any possible difference in service is not worth the additional costs of this place."}
{"text":"I had to take a flight out of Toronto, so I decided to stay at this Hilton for two nights.   I came in and was greeted by the sight of a giant popcorn machine. I couldn't help, but get a couple of bags during my stay.   After that, I checked in. The man at the front desk was very nice and gave me all the information I needed about my room and my stay. They also gave me a complimentary, cool bottle of water!   The room I got was very nice. It had two large Queen beds, a nicely sized TV and a night stand with a clock and a phone charging port.   Unfortunately, wall closest to the door was scratched up a bit and the bathroom sink was a little slow. However, other than that I had no problems.  They also have a fairly large pool, a squash court and a basketball court. Even in my short stay, I couldn't help, but shoot a couple of hoops with their balls and hit the squash ball a couple times.   They have a restaurant here as well with a very nice waiter. The food is solid!   They also have breakfast in the morning with a buffet option or a dining service option.   The gift shop here is nice with a variety of snacks, souvenirs and toiletries. It is also open very late, which is nice.   While the wifi here is not free, the business center is complimentary!   At times, I found the tile setup in the elevators and parts of the hallways a bit odd as they looked scratched, but that was just the style.  The staff here continuously was great during my stay. They were polite and courteous. One of them recommended I check out the Keg for dinner. I ended up doing so and it was very good!   Also, if you are going to or from the airport remember to use their complimentary shuttle!   Altogether, this is a nice Hilton to stay at when you need to be close to the Toronto Airport!"}
{"text":"Room was pretty run down wall paper pealing and it really didn't feel like a clean place.  Not what I'm used to at a hilton considering I spend about 60 nights a year in them.  Probably won't stay here on the next trip since there are so many options"}
{"text":"Very good Hilton. Very clean, efficient staff, excellent rooms. The Bliss restaurant in the hotel has won awards and I got to say for a hotel restaurant, this one is pretty darn good. The bar was great with lots of room, lots of TV's and the best bloody ceaser I've ever had. I'll stay here again next time I go to Toronto."}
{"text":"I booked a convention in this hotel through Conference Direct and was very pleased and happy with the establishment's beautiful appointments in the lobby, business center, meeting rooms and Bliss Restaurant.  Our attendees loved the nightly freshly popped pop corn in the lobby as well as the lovely bar off the lobby.  Not a single issue with North Tower guest rooms, convention meeting rooms, food & beverage/banquet staff, event staff, location in respect to the airport.  We held bus tours that were easily accessible for our attendees through the Mississauga Ballroom Conference entrance.  Check in and out was extremely easy with only a few hiccups for some of our attendees reservations.  These issues got worked out quickly and efficiently.  I can't say enough nice things about Tetyana Lukanyuk our Hilton event manager.  Always kind and so helpful.  She did everything to make our stay exceptional.  She was particularly in tune with the needs and parameters of our newly formed company giving us options to help with our budget.  Banquet Managers Hany Beshay and Arjun Khullar were always on top of every single detail as was their staff for all our food and beverage events.  So professional and handled all requests beautifully.  Chef Yogi did a wonderful job with our special 5 course request dinner event.  All plates had to meet a specific aesthetic along with exacting recipes to fit our theme from the author of the cookbook herself in attendance.  Could not have been better.  In fact all the food events we held were excellent!  Their in-house A/V staff Kris Trinidad and especially Dominic Giovinazzo - Senior Technician were unbelievably gracious, helpful and easy to work with.  WE LOVE DOMINIC...can we just say that now?  No matter what Hilton/PSAV pays him...it's not enough!"}
{"text":"The front desk manager on duty on September 4th at approximately 5am was extremely rude, very uninformative. The manager did not explain amenities, booked us on a room which was not vacant. We went up to Room 1015 and it had guests sleeping which we woke up and inconvenienced. After the fact we were given a room which was not what we wanted we had to settle. We were given no direction to amenities like swimming pool, restaurant, or even treated with respect. The man had a nasty attitude which left a sour taste on our first ever visit to Canada. At the end when we checked out, nobody was kind enough to even ask how our stay was at the hotel. It seems like the employees at this facility do not care about their guests and have the attitude (without exception) of underpaid, micromanaged workers. It will be the last time I voluntarily book a vacation with a Hilton hotel."}
{"text":"My partner and I stayed at this Hilton for one night before early morning flight out of Toronto, and I would say that overall it's a poor excuse for a Hilton with a drab and sterile atmosphere with paltry amenities.  This Hilton is located in a huge hotel megaplex very close to the airport, and it has a very industrial feel. Nothing about the location welcomes me.   Being Diamond on Hilton, we were upgraded to a junior king suite or whatever it was called, and we were just not impressed with the room or the hotel. The main hallways were in a somewhat state of disarray, with cleaning trolleys and vacuums out everywhere even though we were far past the housekeeping time. We walked into this a alleged suite, and we there was a small, barren couch (everything is gray), and then you walk bast the bathroom to get to the bedroom.    The service was somewhat nonexistent.  We needed to mail something while we were stil in Canada, and asked the front desk for an envelope.  Do you believe they said that the front desk didn't have any envelopes?  How about the manager's office?  By that time, I just wanted to leave.  I really don't have much to say about this hotel except it felt like a lonely, transient hotel airport.  I wish I hadn't stayed here."}
{"text":"I'm a little shocked at the bad reviews for this hotel. It was clearly renovated somewhat recently as all of the public spaces and our room were very nice.   Service at the front desk was awesome! When we told them we were just married they gave us a free breakfast voucher and sent champagne and chocolate covered strawberries to our room (both delicious!)   The room was spacious, comfortable and very clean. The bathroom was also clean, and not at all cramped.   Wifi was free and the signal never dropped. It does suck to have to pay for parking -$18 a day is steep (that's where the -1 star is).  Our free breakfast was great! Huge selection in the buffet. Eggs Benedict on English muffins, scrambled eggs, bacon, sausage, homefries, yogurt, fresh fruit (beautiful freshly cut watermelon, pineapple, cantaloupe and honeydew, also apples, oranges and blueberries), cereals, croissants, bagels, toast, fresh juices, etc. It was a great spread and we went 30 mins before it closed and were able to have any options we wanted (usually by that time there isn't any food left and they aren't replenishing).  Overall I thought it was a great hotel! I'd definitely be back!   Oh and it was built in the 70s. It used to have a disco in the basement! My parents met at the disco ;)"}
{"text":"I visited the Hilton on Airport Road for the first time. For years, I drove past it going to work. My workplace is no longer across from the hotel, but it is still in Mississauga. This year, the company had its Christmas lunch at the Hilton.   We had specific instructions about parking. The hotel has cameras that scan your vehicle's front and back plates. You can then proceed to drive in and park. Once you enter the hotel, you need to remember to register your car's licence plate at one of the kiosks, so that you can exit the parking lot.   I had a fun time at the party. The coat check went smoothly. The woman was friendly. We also had appetizers. I loved the vegetarian rice rolls with vermicelli and mint. The chicken skewers were yummy, too. I got a glass of pinot noir. Yum!  Lunch was buffet-style. The food was delicious. I loved the roast beef, green beans (my fav!), and the desserts were decadent. I love lemons that are tart. Both the lemon mousse parfait and lemon bar were perfect! The chocolate and raspberry log cake was perfectly done. Unfortunately, a couple of guys in front of me hacked at it to death, so it wasn't exactly a log by the time I got there.   The servers were amazing. My manager spilled my colleague's water on the table by accident. I felt like I was at Wimbledon. The server came in with a couple of cloth napkins and stopped the water flood. He then got my colleague another glass of water.   The blue LED candle was a beautiful centrepiece. It was a nice touch.   Normally, when you leave the parking lot, each car is scanned and a check is done to determine whether the system finds you as a registered parking guest. Since there were so many of us, a hotel person had the gate raised permanently for us. I waved to him. It helped the mass exodus.   I can't speak about being a hotel guest in a room. If the customer service is this great, I need to give staying her a try should I need to."}
{"text":"Stayed at the Hilton for 2 nights for a wedding. We stayed in a king suite in the north tower. The room was recently renovated and quite nice. Bed was comfortable and the room was nicely appointed. The pressure  in the shower wasn't the best but otherwise I thought it was great. This hotel had one of the nicest exercise rooms and pools I've seen. The gym is open 24/7 and has at least 5 or 6 treadmills and ellipticals. There are also saunas in the locker rooms which was quite nice. I assume the pool is open year round as it's in essentially a giant greenhouse. While I didn't go in it looked awesome. Airport shuttle leave every 15 to 30 minutes and takes less than 10 minutes to the airport. Overall one of the nicest airport hotels I've stayed in and I would definitely stay again."}
{"text":"Airport shuttle drove by. Check-in was terrible. I went to the wrong tower. Hotel room was dirty. There was hair on my pillow."}
{"text":"We stayed here one night before and after a TATL flight on the way home. We met the complimentary shuttle at the airport and in a matter of minutes we arrived at the hotel. Arriving after midnight on the first night, we were exhausted and just wanted to sleep. The room appeared clean and comfortable. In the morning when we could see the room better, the room was not up to cleanliness standards. There was dust on the laminate floor in the sitting room, grim and hair in the bathroom. Toiletries were not up to the usual hilton executive room standards, minus shower gel.  The breakfast in the restaurant was very nice. Plentiful buffet with lots of hot and cold items to select.  On the way back, we managed to somehow get the same room. Exhausted from a long flight, with more travel the next day, we just wanted to relax and get something to eat in the bar. Service was absolutely terrible. Table was never cleared despite ordering another drink post dinner. There the plate sat with some french fries on the table never to be removed. The best part is charging over $4.00 for a club soda with no refill offered.   The executive lounge on the 9th floor was very nice. We didn't eat anything, just went for coffee in the am. The best assets is the complimentary shuttle to and from the airport, and it's close proximity.   Note to management - I wish I had got the female associates name that drives the airport shuttle. She goes above and beyond the call of duty. There is no bag too big or small that she didn't help with. All with a smile on her face.   To echo what another Reviewer said, if I'm entitled to water, just put it in my room. Why do I need to go to the front desk and announce my room number out loud so everyone can hear.  This property served it's purpose, nothing more."}
{"text":"This Hilton could not be anymore located in an airport than if it was actually on the tarmac itself.  It was so convenient for my travel over the weekend that it was the primary reason for me choosing my stay here.  I was quite surprised about some of the negative reviews that this hotel has garnered.  From personal experience I try to check other rating sites to make sure that I get a broader picture of the facilities.  As far as I can see there are more positive reviews than negative so I was confident in booking my stay.  I arrived very early in the morning at the airport and decided to take the shuttle to the Hilton to see if I could drop my bags off before exploring the nearby towns in the rental car.  I was greeted by a very friendly and helpful front desk personnel who told me I could check-in early if I wanted and was going to wave the early check-in fee, provided information on where to get some good breakfast, and would call the car rental company to pick me up after I got settled upstairs.  Lo and behold the rental car company came and picked me up to bring me to their office.  Now that's customer service on both sides!  The room was comfortable and very clean.  There's the usual flat screen, mini refrigerator, and in-room safe to store my valuables while I was away from my room.  The bathroom was nicely furnished and the sliding door to the bathroom was a unique touch.  Inside the cabinet was the ironing board which is always a lifesaver for those last minute touch up on dress shirts and dress suits.  Since I was attending a wedding during my stay this proved invaluable.    Downstairs is the restaurant Bliss which I heard from the concierge serves great food but I didn't try it since I wanted to get a taste of the local scene.  The bar was the place most frequented as my friends and I happened to always stop by a drink whenever there was a downtime.  The mixed drinks are rather weak and disappointing but the Molson Canadian draft served in a 20 oz glass was simply perfect.  There's free WiFi in the lobby only but you have to pay for it when you're in the room.  It's kind of disappointing but hey no hotel can be perfect right? Moving on, the shuttle is convenient and runs 24/7 with service every 30 minutes but increases to every 20 minutes from 4 to 9AM or something along those lines.  Parking for cars is $18 CAD per day charge to your room.  They can also convert U.S. dollars to Canadian dollars for free just as an FYI.  I really enjoyed my stay at this Hilton.  That's why I was compelled to write a detailed review because I think they deserved it.  When I'm back for a visit in the Toronto area I'll seriously consider another stay at this abode."}
