{"text":"Great new hotel with tons of amenities. All rooms updated with new appliances, televisions and soft towels. Great and attentive staff and a great selection at the bar."}
{"text":"Great hotel. I have found my favorite hotel in Pittsburgh!  Now I just have to come back a few times. The rooms are great, the staff is great, the shuttle and shuttle driver is great! And the bartender Fiona is awesome. Great at suggesting dinner and drinks."}
{"text":"A fan so far! The room is large and spacious! King size comfy bed. My original room was 3rd floor in the back. I had a handicap that made it hard to walk and last second the staff was more than willing to help accommodate me. They changed my room to 1st floor, handicap accessible and near the door. They also allowed me to check in early.   The décor is modern and updated. Everything seems very new.  Breakfast is not included but this may be due to my type of reservation.   Only night 1 here but so far, I am enjoying my experience. The staff is great and the living conditions are more than acceptable!"}
{"text":"Beautiful hotel. Looks new or newly renovated. Comfortable bed. Great layout. My bathroom wasn't cleaned from the previous guest. The previous guests soap was still in the shower along with long black hair everywhere. Ordered room service, got charged for bacon on my burger and was never given the item. AC was on the fritz and wasn't working properly. The whole bathroom thing really grossed me out and ruined my stay. Disappointing because it's a beautiful facility."}
{"text":"Very nice hotel and close to the airport.  It was a 5-10 minute ride on their shuttle to the airport on 5AM traffic.  Left the hotel at 5AM, made my 6:15AM flight with time to spare.    Front desk clerk was friendly and efficient.  Room was clean and bed was comfortable.  I did not use the gym and left too early to try their breakfast."}
{"text":"The whole experience, while brief, was exceptional.  Called earlier in week regarding shuttle times and parking for a few days while gone and the service was phenomenal. Check in was simple and quick, not to mention extremely friendly. The hotel was superbly modern and clean.  The atmosphere was quiet as I did not hear anyone on our floor.  I have to say the shuttle service was prompt to get us to the airport and the driver was certainly friendly and informative.  I could not ask for a better stay.    Upon return, our flight landed and we called for pick up.  We were advised where to meet the driver.  We took the tram and went back to passenger pickup and think we waited a few minutes until he arrived.  Very pleasant gentleman who drove us right back to our car.    Service here is phenomenal.  Will not hesitate to utilize them again for our next trip."}
{"text":"Very nice room, clean.  Great location.  Basic room, nothing extra; no microwave, mini fridge or anything like that.   I have to say, the King size bed was one of the most comfortable beds we've ever slept on. We slept great. (I wish I knew the make of the bed so I could buy one.) The a/c worked perfectly and kept the room nice and cool all night.  (The hallways and elevators were as hot as a sauna though!)     I'd recommend this place for anyone looking for a basic room.  It was perfect for what we needed at the time.    The restaurant in this hotel is excellent!! It was late when we got in and were a little hungry so we just had appetizers.  Everything was delicious.  The food was a little pricey but worth it!! All in all, I'd stay here again if I'm ever in Pittsburgh again.  Don't forget the cookies!!  :)"}
{"text":"Last night we checked into this Hilton hotel and was greeted by Page, what a beautiful friendly lady. Up early Christmas morning and had the pleasure meeting the cook James and server Nikio. Very professional and pleasant to meet. We had a wonderful breakfast a great way to start our morning. Thank you everyone at the Hilton Garden Inn."}
{"text":"HGI franchise is quickly approaching perfection: perfect bathroom (barn door shower, no bath, baskets to dry wet clothes, night-light switch), work area (ergonomic desk chair, lamp, LOTS of PLUG-INs, swivel TV), fitness center (TVs work seamlessly with controls on cardio equipment), no curtains: Blackout Shade! Finally!  Restaurant was typical HGI: not much effort to do anything special, but certainly better than average.   Temperature control seemed off: set to 72F should not be too cold. I set it to 77F."}
{"text":"I've stayed at the Hampton Inn in Coraopolis many times before but this time I decided to try out the Hilton Garden Inn. Extremely impressed with the décor, the customer service, the room...well, everything. A very modern design from the lobby to the room and into the bathroom. One more perk is that it is relatively close to the airport. So instead of trying to get out of downtown Pittsburgh traffic early morning, stay here if you need to get to the airport.  It is a bit odd getting to it as you have to turn into the Sheetz or the fast food restaurant in front of the hotel to get to it.   I would certainly stay her again over the Hampton Inn...unless the price jumps up drastically."}
{"text":"Really nice place to stay. The hotel looks relatively new. Nicely appointed and clean. Room was spacious enough and beds were comfortable.   Really close to the airport. Courtesy shuttle to and from airport.   Staff very welcoming and friendly."}
{"text":"Hilton Garden Inn Is arm's throwing distance to PIT International Airport, Robert Morris University and the 911th Airlift base outside of Pittsburgh.   In addition to hotel services, HGI offers event planning and meeting services and they have a decent bar/bistro in the lobby.   The hotel is really new (July 2017) making it attractive for travelers who aren't keen on sleeping in old hotels or beds. Rooms are well appointed with USB charging ports, large tv, fridge, microwave and a (my favorite) a Keurig Coffee machine. Complementary wireless internet and connections to a printer in the business center   The flat screen tv has more channels than I care to count. HBO is included.   Downstairs there are several large banquet rooms and a restaurant serving breakfast and dinner.   The is a pool and workout room too but I forgot to pack sneakers so I plan to do my in room SWORKIT routine tonight.   I like HGI and will be happy to come back to this particular one on my next trip to Pitt."}
