{"text":"Hirut is great.  Delicious food, friendly staff, a down-to-earth feel.  I couldn't ask for more.  It's my favourite Ethiopian place in town... I think partly because it doesn't feel like it is trying hard to be great; it just is.  I haven't been for any live events, but I love the idea that they do this."}
{"text":"I'm a big fan of ethiopian food and I've tried most of the restaurants on the Danforth and this one is top notch. The food is great, good texture and the injera held up beautifully and didn't fall apart. The atmosphere was great, the place was clean and welcoming. I'd definitely come back!"}
{"text":"Hirut is an excellent place to stop in for dinner with a friend or a group.  They serve excellent vegetarian and seasoned mixed meat/lentil platters that are well priced for their size.  The lamb is also very good.  The owner, named Hirut, is a warm and welcoming woman who takes good care of her clients.  Just steps away from Woodbine subway station, this is an easy place to find and a few nights of the week you might just catch local musicians playing at open mic jam sessions!"}
{"text":"A warm and friendly restaurant. The owners are lovely and the food is delicious.

They have a stage and every last Friday of the month is Hirut Hoot, a great comedy show. For $5 it's the best night of entertainment you'll get. 

There's also jazz some nights. It's good to have a restaurant/arts club like this in the neighbourhod."}
{"text":"Stylish interior, platter selections to suit many tastes, attentive service and reasonably priced. A real neighbourhood gem with class. Live Jazz on Saturday's I'm told. Try it now!"}
{"text":"Amazing, amazing, amazing. We love Hirut and her food! We live near by and have a whole host of Ethiopian restaurants to chose from and we've tried almost all of them and we're even bigger fans of Ethiopian food because of Hirut.

The live music and comedy nights are great. The prices are fantastic. The coffee is delicious.

We've brought everyone we know to Hirut and they all love it too."}
{"text":"Hirut is a very nice restaurant at Danforth and Woodbine. Hirut has wonderful Ethiopian fare and live entertainment several nights of the week. I ordered a combo of vegetarian and chicken.  Since it's Ethiopian, you eat with the special bread and your hands. The food is so amazingly delicious! My only criticism would be service. Since it's usually only Hirut, the owner, who is incredibly nice, sometimes I find I have to walk up to the bar to order a drink or something extra. I have found this to be a bit annoying. It may be good to get at least one extra staff member on the floor during busy days. However I still gave Hirut 4 stars because the food is really good, the atmosphere is great and Hirut is a really good person!"}
{"text":"Great place- yummy food, decent prices, good atmosphere. Excited to go back and try out the entertainment!"}
{"text":"This place has kind of a community hub vibe going on. They have jazz nights, open mics, comedy shows, and more. It's a small restaurant with a fairly small menu focused on Ethiopian food. I had a friend playing on a Sunday afternoon so I stopped in for a late lunch. The performers were great. I ordered the vegetarian combo for $11. It was tasty but maybe a little smaller than at other places. Still adequate for one person, though. It was served with quite a bit of injeera. My only two complaints about this place are that there is exposed pink insulation at the front (gross) and the service was a bit slow (I know it's typical for Ethiopian food but I still hate waiting an hour to get a plate in front of me). I'm looking forward to going back."}
{"text":"I've been here 3 times: for dinner, for an event and a private party. Food and service is always exceptional!"}
{"text":"This place is absolute trash. Do not EVER come here, they are scammers. Do not trust them for any pop up event they host or you will be here waiting 1 or 2 hours outside in the sun PAST your reservation time.

There is nothing Sailor Moon about this Cafe. The inside is completely dark, bad lighting, no Sailor Moon ANYTHING! 

After you get seated, you need to constantly be waiting at your table for the next \"course\". They cannot make any sort of dessert what so ever. The parfait they served was all melted, frozen fruit and belongs in the trash. 

It took forever for the drink to come and their excuse was \"because the person making the drink is not here so we cannot serve it\". If you know you will be serving it to over 100 people throughout the day..why do you think it makes sense for whoever making it to NOT be present??!! 

I don't know about their Ethiopian food, since the reviews online were good. After this experience with the pop up event..I would not trust them at all."}
{"text":"Wonderful food and nice staff! Atmosphere was comfortable and prices are good too. Definitely would love to come back!"}
{"text":"still a 4* rating.   Food's good, service is appropriate (steady, not speedy  :) )  

My update is about the shows we've been going to more often - some really top-notch entertainment ! we've hit some comedy as well as some jazz nights.  dang good stuff.   So a little plus on that side.   A tiny minus is that there are no desserts on offer.  My dinner companion likes to have sweet with her after-dinnner tea/coffee, so I've taken to bringing a small package of cookies in my purse when we go.   A bit weird but it works."}
