{"text":"The sushi here is pretty decent.  I've eaten at many sushi restaurants with sushi that is equal to or inferior to this \"airport sushi.\"  The prices are a little bit pricey for the quality, but are pretty good if you consider that they are airport prices.  

If I'm at the airport and I'm hungry, this is my go to spot."}
{"text":"If you are between flights, and want to get a quick bite without resorting to fast food, this is a good choice.
They will make you anything on the menu, and they also have a refrigerated case with premade items.
The sushi I had was ok, nothing to get excited about, about on par with what I could get at my grocery store. However, as an alternative to a Big Mac and fries for someone who is trying to make healthier choices, this fit the bill."}
{"text":"You must think... I must not know anything about sushi to think this place has 5 star sushi quality. But before you judge me, let me share my reasoning. Guys, I'm at an airport, in Charlotte NC and I am sure not looking for the best meal of my life. I just want to not feel hungry, not break the bank and just. go. home! I'm tired of eating greasy and fried food at the airport and also tired of sitting at a food court with dirty chairs and tables. When I saw Hissho Sushi, my heart soared.

They have a twist to traditional rolls. i.e. they added a tangy, spicy mango sauce over the typical rainbow roll (tuna, white fish and salmon on california rolls). I always dip my sushi in the little plate of soy sauce and wasabi, but here, my cute sushi rolls are taking a quick dive in this special sauce. I must say, it is quite different but it tastes so refreshing and good!

The best part is, I feel GREAT after eating there. It doesn't make me feel disgusted like after eating a burger or a plate of fries. It was uplifting and gave me hope that should anything go wrong at the airport, they will be there to comfort me with a fresh plate of sushi. 

Service is awesome. They have 2 hostess and each of them serves 50% of the tables. I wasn't sure how it works but if you see a table, grab it! The hostess will then come to you and take your order. There is no line but a first come first serve basis. The hostess checked on me every so often and made sure my water glass was full. Also, they have the prettiest disposable plates ever! I know, I'm OCD. Although they are disposable plastic plates, they look super elegant and clean in white. They made my dish look extra posh. How awesome was that?! 

This is definitely my place to go to when I'm in, through or stuck in CLT. Great job guys!"}
{"text":"Absolutely terrible. 1 out of 10 is more like it.. Wish I could turn back time and eat anything but this bad bad bad sushi. One piece of yellowfin sashimi looked like a piece of smoked salmon. Sitting out all day probably and forming a thick \"crust\". Gross. Hopefully some of my fellow sushi lovers see this review and save themselves a terrible experience. Saki wasn't bad though."}
{"text":"For airport I thought it was pretty good. Loved the knife tethered to the make line....classy airport...."}
{"text":"Always fresh sushi. I like to get raw salmon and avocado: so goood! I always pick up pre-made sushi and ask for spicy mayo sauce on the side!Welcome to the deliciousness!"}
{"text":"This is probably the only sushi spot in the airport and there is not a ton of variety, but gets the job done if you are in the mood for sushi. I didn't think the fish tasted very fresh (some weird chewy textures going on) and the edamame tasted microwaved.  I know airport food isn't great in general, but I'll pass on the sushi next time and go for a salad elsewhere if I need a healthy fixing."}
{"text":"Food is usually good (probably 4 stars for airport food), I generally stop here when connecting in Charlotte. I felt compelled to write a review today given the rudeness of one of their employees behind the bar, Janice. I ordered their Fish & Chips, and a very nice lady Javasia told me they didn't have the chips ( the dish is spicy tuna and salmon laying on top of tortilla chips).  I nicely asked if they could still make it for me even without the chips, she asked Janice who barked back at me, IF WE DON'T HAVE THE CHIPS WE DON'T MAKE IT ORDER SOMETHING ELSE, tone that even the people behind me were shocked. Javasia then apologized to me, it was that bad. Clearly the concept of customer service escapes Janice."}
{"text":"Had better sushi but for airport food you can't complain. Well-priced combos available, and plenty of beers, many on draught. Service was great and attentive, and the atmosphere was the icing on the cake. Music playing and drink in hand best spot on D terminal to chill pre-flight."}
{"text":"One of my favorite things about flying into Charlotte is the First in Flight Bar. During the hustle and bustle of traveling, it's always a nice feeling when I have a little extra time during a layover in the Queen City so I can relax for a few moments here.

Sushi in Charlotte. This may not be the first type of food that you think about when you are in the Carolinas, but it's here...and there is a lot of great sushi here. I wouldn't put Hissho up in the \"great\" category, but it's decent, and coupled with its \"great\" location...it's one of my regular stops across the country. 

All of the sushi that I've gotten here has been fresh. The specialty rolls are a little heavy, but good. They do have a lot of options with cream cheese or spicy sriracha. I haven't tried any of their sashimi...I just don't think that this is the spot for it. 

I definitely recommend the next time you fly into Charlotte, and have a little extra time during your layover, give it a go. Relax, sit at a table, have a drink and roll or two, and people watch until your departure time arrives. It's the perfect time waster."}
{"text":"I stumbled upon this restaurant during a layover. The bar seating was nice and there was also some hidden outlets underneath it. I took a moment to look over the menu and decided to stay. 

I had the tempura shrimp temaki. It was good, not overly delicious, but good. The temaki is a hand roll. The sushi is rolled almost like a burrito and you just grab it and bite. The thing that made this only good and not great is the shrimp. They use already prepared tempura shrimp, not cool. The tempura isn't crisp and it gives a packaged sushi taste to a fresh roll. 

The waiters are very friendly and attentive. Overall, I would eat here again if I have another layover at this airport."}
{"text":"Sat at the bar. My server Shay was super friendly. Ordered wine to start, then went for edamame. I was killing 2.5 hours between flights. Opted to do the Sushi Lover's Combo (choice of any specialty roll, 2 pcs Sashimi or 2 pcs Nagiri, Choice of miso soup, seaweed salad or edamame) at $24. Food was great, service was friendly, definitely keeping this in my back pocket for future layovers. I recommend sitting at the bar vs a table if you're traveling solo or in a pair, it's more fun. The ambience is pretty good considering it's in an airport. Make sure to look up and check out the motorized airplane mobile above your head!"}
{"text":"One can only expect so much from airport sushi. While Hissho didnt make my mouth water, its a nice alternative to greasy food that seems to be the standard in airport dining in Charlotte. They have a grab and go selection right in front where.....wait for it.....you can grab it and go (pay first before you go of course) or you can sit at their tables and order off the menu. Umm, if you try to take a grab and go sushi and eat it there, they will give you attitude, just sayin'"}
{"text":"I travel through Charlotte 4 to 6 times a month. If I have 20 minutes or 2 hours, I stop by this spot. Great attitudes and service. The tuna pokini is a good starter. The Crown Town is good as well recommend getting the sauce on the side."}
{"text":"Never expect much from airport sushi, but it was edible. The fish had definitely been frozen. Fairly slow service for an airport, with Airport prices."}
{"text":"Nice fresh food option in the Charlotte airport.  A good basic selection in the prepared to go case which does well when you don't have time to dine in. For the freshest option dine in is the way to go."}
{"text":"Pretty good sushi! a little pricey, but it is in an airport.. full bar..  nice waitresses, some of whom are also quite photogenic."}
{"text":"Read about this place in the US Airways magazine and since I had enough time between flights I figured I'd give it a go.  Wow....dang good sushi!  I ordered the CLT Roll. Spicy salmon, jalape単o, cucumber and white fish on top with some spicy sauce drizzled over the roll. It was delicious!  Quite spicy but in my opinion is was perfect. 

While it was a little pricey eating here, it was well worth it!"}
{"text":"Stuck at the airport for a couple of hours. Didn't want to eat anything too heavy. Saw there was a sushi bar in the airport and SCORE! Located between concourses B and C. I sat at the bar. Service was quick. Wanted an appetizer, like a miso soup, edamame, or seaweed salad, but all of those options were $5+. Instead just got the firecracker roll had 8 pieces for $13. It was a lot better than I expected for airport sushi, and the cost is comparable to sushi restaurants. Overall, would eat here again if I'm in the airport."}
{"text":"I stopped here before my flight back home. I noticed there was a sushi option instead of the usual fast food and decided to go with the sushi - BIG MISTAKE! I should have had Burger King and maybe I wouldn't have had an hour and a half of stomach pains all the way from Charlotte to Newark! Don't get me wrong, the service was friendly and attentive. The waitress constantly checked up to see how things were going. But that's not enough for me to come back to this place. The sushi was absolutely HORRENDOUS!

I ordered the edamame and the grand finale specialty roll (Shrimp Tempura, Avocado & Cucumber Topped With Spicy Crab Scallions, Red & Black Tobiko).  The edamame was OK, but not the best I've had. The sushi was horrible! Way too much rice around the roll (felt like rubber while chewing). The shrimp tempura itself was disgusting. It honestly tasted like cardboard. Despite the massive amount of soy sauce and wasabi I put on the rolls, the sushi still didn't taste like anything except for cardboard! That's when you know you have some stale sushi my friends! 

Please avoid at all costs! I know sushi is the healthier option, but if it's going to make me sick on my flight back home, I'd rather stick to fast food!"}
{"text":"Coming from California, this is ok to good. I'm talking about the rolls. I'd have to rate the sashimi 2.5-3 stars. The rolls fill you up for what they are. The sashimi was, I think too thick of slices to really enjoy it. But unfortunately salmon and yellowtail is more prone to \"fishy\" tasting. It's hard to get those fish fresh if you're not by a fish market. The tuna was good, but I've had better. Otherwise if you have time to waste, I'd come here."}
{"text":"I seem to go thru CLT airport as a connecting airport during my air travels quite frequently. When I first discovered the Hissho sushi \"bar\" at the First In Flight bar in the main food area/concourse at CLT in 2010, I was quite amazed, simply at the very fact of finding suchis available at an airport, and particularly at an airport in the Carolinas!

Well, I was even more amazed when I tried their pre-packaged sushi and sashimi from the to-go cooler. I have eaten sushi at sushi restaurants all across the US, and I had to admit that the quality of the take-out sushi and sashimi from Hissho was quite good.

I have, in the intervening 4 or 5 years, eaten their pre-packaged take-out sushi and sashimi from their take-out cooler many times, and I have NEVER been dissapointed with the freshness, quality or flavor. In fact, if my total time to my destination (whether my destination hotel, or my home, if returning home) after I leave CLT will be less than 3 hours, I often purchase two or three extra packages of sushi to bring to my destination and pop in the refrigerator, to be eaten within the next 48 hours.

BTW, I have never tried to sit down at the bar or at a table to order freshly-made sushi here; I have only purchased pre-packaged take-out sushi and sashimi from their take-out cooler!

Pricing is not bad at all for airport food, much less for good-quality airport sushi!"}
{"text":"We stop here during our connection for a quick bite to eat. The service was phenomenal! The food was a little slow to come out, but the server made it up to us by giving us a free miso soup and edamame. We got a CLT roll. It was great if you like spicy! Pokini was great too! The fish was extremely fresh. I'd highly recommend this place, if you're ever in the Charlotte airport."}
{"text":"Excellent sushi choices especially for an airport. The CLT roll was delish!  Made fresh on site. Good beer selection too."}
{"text":"Airport sushi?? YES.  They have 2 reasonable combo.. 1 roll or special roll, 2 pieces of sushi and appetizer (enamami,  miso siup or seaweed salad) for 19 or 24.  Liquor is airport prices, though.  The service was great and comfortable at the bar. Definitely will return."}
{"text":"Pretty bad but I guess I'm happy to have some options.  They have a guy making the sushi fresh, to be put into the little packages, but you can only buy the packages.  He won't make you a fresh batch.  This seems nonsensical.  There's no reason why, if I'm the only person there, that I can't just have the batch he's making, before they refrigerate it into stiff cold rice.  In any case, this is on par with say, sushi from Safeway."}
{"text":"It's a sushi bar in CLT's main concourse.  You WILL get fleeced, however the rolls are decent (Publix grade) and you DO get to sit under the enormous aviation mobile - so there's that.

Had I not had an absurdly long CLT layover - this wouldn't have happened."}
{"text":"I've never spent time in North Carolina, but in the last three months, I've had two layovers in CLT.  Both were very annoying, and both fell during mealtime.  I went to Hissho to eat both times.

The first time, I was rushing to make my connecting flight and stopped off on Hissho to grab a roll.  There was a refrigerated section of to-go food, and the selection was pretty good - standard, sure, but a lot of options.  It took me a minute to pick an eel roll.  I ate it on the plane, and it was good.  It reminded me of the pre-packaged rolls I used to love at the cafeteria in college.  Nothing special, maybe, but satisfying.

So when I passed by Hissho in the same airport on a longer layover just a couple months later, I decided to sit down for some dinner.  I thought about getting another ready-to-go roll, but I made the mistake of opening the menu.  I had just heard Jonathan Gold review a Sinaloan sushi spot on the radio, and he said something like, \"It was good in the way chili fries are good,\" and for some reason that resulted in my ordering something called a Mango Trio.  It was an 8 piece roll with imitation crab, mango, cucumber, and mango-ginger cheese topped with salmon, tuna, and a mango habanero sauce.  I mean what the hell is mango-ginger cheese?  Anyway, the roll was edible but vaguely disgusting, with mediocre fish and an odd, goopy sauce.

My other big mistake was getting a drink.  I'm a sucker for a spicy bloody mary, and when I saw a chipotle bloody on the menu I decided to go for it.  It was the most disgusting bloody mary I've had in recent memory, very strong with a tinge of thin tomato and a bit of spice.  It had a double shot of vodka, so I guess it was at least functional.  When I got the check, though, I was shocked to see that it cost $14.  My shitty airport meal cost over $30.  Incidentally, service was also very slow.  Surprising considering the setting.

I left for my flight feeling foolish.  I would've been happier with a spicy tuna in a plastic container.  I may come back to Hissho when I fly through CLT, but I won't sit down again."}
{"text":"Great little airport bar with Sushi! Electrical outlets that surround the underside of the bar!"}
{"text":"I'm basing this rating totally on the poor attitude of the staff.  I was with a co-worker and we had some time to kill before our flights took off.  We were looking for a place to eat in the airport other than Burger King or some fast food place.  From a distance, this place just looks like a bar.  Liquor bottles lining shelves around a bar inside the airport.  I did not see one cook like the pictures show below.  Anywho, we order a sandwich from Quizno's which is will be a Yelp in itself.  There was no place to sit in this airport.  Because of all the flight delays, the airport was crowded but this place had a bunch of empty tables in the center by their bar and stores.  Now I know why. My co-worker and I set our stuff down and she leaves to use the restroom.

Up walks what appeared to be cleaning staff.  She certainly didn't look like a waitress and asks me if I'm ordering anything off the menu.  I said, you mean liquor? I said, maybe after I eat.  Broomhilda says in crusty tone, \"no, food\".  I laughed and said, honey all I see is liquor and I may need some of that after I eat.  She proceeds to talk to me in her crusty tone and said, I can't sit there unless I order from the menu.  Since I've been gate raped by TSA in the past, I figured I don't want to create a security scene and I take our food and move along.

I really wanted to tell her to stick her attitude up her hoohah and stick to cleaning tables.

Question below: Waiter Service? How about Biatch Service."}
{"text":"It's alright, I was in such a craving for sushi cause everything in North Carolina is fried. Servers were very friendly but the food wasn't the greatest. The wine came in some fancy glasses though which was cool. But I would recommend this place if you are trying to get away from the fried food."}
{"text":"It's all about the expectations.
Seriously.  I mean, look around at your other choices at CTL - you're looking at a slate of stuff like Qizno's, Sbarro's, McDonald's, etc. in short, a veritable plethora of plebian-ness.
In *that* company, this may very well be the very best that you can hope for. 

Anyhow, on to the sushi. It's about as generic as you can get - tuna, salmon, yellowtail, and various combinations thereof formed into rolls.
Speaking of which, get the rolls, they're, at the least, acceptable, and the various stuff they put on top of them at least gives them some form of flavor...

The beer is cold (there is Kirin), so, well, theres that (though, for whatever reason, they're all served in cheesy plastic cups)

Oh, btw, stay away from the eel (unagi) - it's pretty foul..."}
{"text":"It's overpriced airport food, the sushi is ok at best. But compared to other places it's healthier."}
{"text":"I've been back here and the sushi is still the same. Don't try anything crazy. Just stick to the basics and you'll get by just fine. Asked for water and lemon. Just the water showed up. The piano next to the place can make it annoying. Avoid the sushi."}
{"text":"Went past this place a few times in my travels and always was hesitant because what are the chances that you wouldn't die eating sushi from an airport in good'ol Charlotte.  One would think high.  Anyway, seeing that this place was always busy and being in a gambling mood I figured I'd check it out.  Tried the triple mango roll and was pleasantly surprised.  Everything was fresh and tasty.  Certainly not the best sushi I've ever eaten but better and cheaper than some \"finer\" establishments I've eaten at in my coastal home town.  Food is pretty fresh since they crank out the rolls and the atmosphere is nice with an occasional piano playing in the background. Been back a few times since then, and it hasn't disappointed yet so I would recommend it."}
{"text":"Stopped at Hissho Sushi at CLT for dinner.  Ordered a spicy salmon and regulate Tina maki rolls along with the ahi tuna poke with seaweed salad.  For $11, the ahi tuna poke had at least 8 oz of fish which was great.  Would definitely dine at Hissho again!"}
{"text":"I wasn't in a huge rush on my most recent trip through Charlotte, so I decided to grab some room at the bar and experiment with airport sushi.

I found myself quite impressed with the prices. I was expecting to pay sky high prices (clever pun, yes, I know), but instead they were only standard expensive sushi prices.

I never had seaweed salad before trying it at this stand and it was astounding (It's such a proud moment for mom and dad when baby first tries seaweed salad). I was a little slimy, but crunchy and flavorful. I can't wait to get it again so I can compare.

Also had a Grand Finale sushi roll. It was avocado and fried shrimp wrapped in seaweed roll and rice, and topped with crab meat and red + black tobiku (What the hell is tobiku?). It sounds better than it was, but it still hit the spot covering my craving for deep sea delectables... and, uhm, tobiku."}
{"text":"Horrible customer service! Rude, racist, white old lady! Told the man before me that he can order to go and then when I asked her the same she tells me they don't do to go orders..... then why let him? Beware of the old ms.piggy looking hag! And someone please tell her to throw away her make-up bag before it permanently stays engraved in her wrinkles!"}
{"text":"Went to the one in Concourse D nobody's there and once I found someone they were completely not helpful at all. They said they couldn't prepare anything for me I can only buy the pre-packaged selections. but then found another one in the atrium that was really yummy with great customer service"}
{"text":"I was introduced to First Flight by my friend who is based in CLT with Nascar. He had to take me there because he raved over the sushi and the sake. When I was flying out of there not in my uniform I gave it a shot. It's strategically placed in CLT where the main food court is after security. Make no mistake, it looks like a bar. BUT you can get sushi and sashimi to go on the fly at the walk up area and pay at the bar. I just wasn't that impressed. I tried to keep in mind that it is sushi.. in a airport.. and IN Charlotte. Because I grew up near the sea where the sushi is still squealing , or whatever sushi would do if they could yell, I am, without a doubt pretty picky about my sushi. Sake is sake. It's strong..hot.. and can jack you up before flying if your not cautious. Well, I felt that way about the sushi. I don't care how sweet Carolina the staff is, and they all are! I truly hoped I made it through this 5 hour flight home with no sushi remorse."}
{"text":"Sushi was good but be aware of the portions served. We ordered an 8 piece roll but were only served 6 pieces. When i questioned it the server told me she has never seen it any other way, then proceeded to tell me it's always cut in 8pcs and even sometimes 9! Order 8, expect a random number of pieces."}
{"text":"When you travel a lot, sometimes consistency is a great thing.

Is it the best sushi you'll ever have? No. Is it possible to use the words \"airport\" and \"sushi\" in the same sentence without looking like a twit? Absolutely. To digress, the best airport sushi I've ever had is at Detroit Metro, followed closely by the one at Reagan. 

This place isn't perfect by any stretch. Just about any non-fish item is nuked-while-you-wait (like soup or edamame) and served on plastic. However, the fish isn't bad. Stick with the rolls. They're all fairly good and, from a frequent traveler's standpoint, consistent visit after visit. 

I've been eating here for several years now, and it's definitely one of the healthier options at CLT."}
{"text":"Total regret.  That bad expired fish tossed and turned in my stomach and I spent the whole flight in the bathroom.  They destroy even avocado and cucumber rolls.  

Thanks very much for cutting back on your staff and not keeping your fish fresh Hissho!  Next time I pass through i'm going to make the manager eat the crap they put on the shelves."}
{"text":"Sushi was delicious! We shared 3 rolls and all were tasty and well made. It is very obvious that the chef was skilled and attentive to detail with the sushi. Our server was sub par, took awhile to wipe off the table, didn't refill our drinks and was generally pretty slow. We had time and enjoyed the food so it wasn't that bad. There is a full bar but only a few beers on tap. The location is great for people watching and very pleasant with lots of natural sunlight. If you love sushi but the idea of \"airport sushi\" freaks you out - don't hesitate to give this place a shot."}
{"text":"Pretty awesome I grabbed a sushi rolls between flights . It was Johnny on the spot between terminals. They had the to go pack (finger food) in the main food court. Just what I needed when I was in a hurry. I didn't have to wander into the heart of the food court. Just grab, pay and go. Further more it was delicious."}
{"text":"I agree with the 3 star.  Aok.  Healthy choice at airport.  Expensive but filling bento box to go at $14.  Had several little roll pieces, 3 sushis, and some seaweed.

Eh...but better than a burger and fried"}
{"text":"Sushi was out of this world, but the service was awful. Waited 15 minutes to see a waiter, another 25 to get my food (3 people that came after me and had different servers got their orders first), and another 20 to get my check (which I ended up having to ask the hostess for since the waiter was MIA). Once again, the sushi was great - fresh and numerous options. I strongly suggest you get it to go and eat at your gate."}
{"text":"I had a connecting flight that stopped over at CLT, so I got the tuna box for $9 from Hissho because I was looking something healthy. It was absolutely awful. The service was bad, the fish was not fresh. Usually, I get spicy tuna so that the spicy covers up the fishiness of the fish. But the fish here was so bad that I can still taste how fishy it was after ordering the spicy tuna and dunked it in soy sauce."}
{"text":"Laying over in Charlotte, I needed beer and rations.  I saw Barbecue but that was too pricy and would have been too heavy on the stomach.  I spied this sushi place, noticed it was made to order so I bellied up to the bar and gave it a shot.  

Shay was working behind the bar.  She was just the friendly face I needed after a long day.  She's very easy on the eyes too, which also did not hurt. I ordered a simple California roll and a bud light.  Shay brought my beer and continued to engage me in polite chat (and yes, you will download candy crush again) until my sushi was done.  It arrived warm (sign of it being fresh), 8 pieces, ample pickled ginger with wasabi.  It was pretty good for airport food, sushi notwithstanding.  I almost went for the miso soup too but I passed - did not want to be too full.   No complaints about the food whatsoever.  

So why 4 and not 5 stars??  $7.99 for a bud light draft.  That's crazy!  The sushi was $8!  I know airport food can be pricy but really?  Anyway give them a try. Everything I saw the sushi chefs making looked spectacular."}
{"text":"Decent sushi for an airport.  Sushi has been fresh every time I order!   Hits the spot for my long flights!  They have take out, or you can sit at the bar.  Great people watching!!!!"}
{"text":"An extended layover at this airport due to bad weather at my destination brought me in search of food.  The thought of ingesting heavy, fried or BBQ anything while I'm sitting in an airport or on a plane was not a pleasant thought.

Sushi!  At an airport!  What a concept.  Except this is not really good sushi.  In fact, it's not very good sushi at all.

The offerings on the menu to be made fresh for you are quite steep in price.  I opted for the pre-made California roll, which was no bargain at $8.95.  Throw in a 500 mL bottle of Fiji Water for $3.95 and it wasn't an economically priced option, either.  Yeah, I know it's airport food.  But I would have justified the cost if I had eaten the whole thing (which I did not).

I yearned to sit in one of those big white rockers as I was eating, so I took my to-go stuff and started to relax.  Except I was given no napkins or chopsticks.  Walk back and get them.  Chopsticks were actually miniature-sized baseball bats.  Very difficult to work with.  Fingers would have been a better utensil and wished I'd thrown caution to the wind and just used those instead from the beginning as I probably looked pretty clumsy fiddling with the awkwardness of the equipment provided.

Not enough wasabi provided.  The actual sushi was rather tasteless with rice that was part sticky and part soggy.  The rolls didn't hold together and fell apart as I'd try to pick them up (refer to previous comment about the use of fingers).  Grocery store sushi is gourmet compared to this fare. I consumed about half of it before giving up on the taste, texture and struggle of getting it from container to mouth.

My Fiji water was good, though!  For $3.95 it should have been."}
{"text":"Had a layover in the airport and was looking for something quick to eat.

Let me just say... Not worth the price for the quality of the sushi. Sushi rolls were prepared in front of me, but the shrimp tempura tasted soggy and flavorless, which was disappointing. California roll was better, and I like how they used cucumber. Total for two rolls: shrimp tempura and California rolls was ~$18. Whattttt? 

Didn't have a chance to try their other rolls but you may have better luck finding a cheaper eat elsewhere in the food court."}
{"text":"Ok - so yes I know it's airport sushi and I shouldn't be too hard on them. We've all seen the add that says cheap is good and sushi is good, but cheap sushi may not be a wise choice.

My main reason for three stars? Everything was spicy! Spicy mayo on this, spicy sauce on that, super spicy spicy roll with spiciness.

Do I want Sriracha? On sushi? Really? How about Wasabi that isn't brown. 

Guys - we understand you're not flying fish in from japan to your booth - (though god knows why not because you're in a freaking AIRPORT!!!) - but covering up the medium quality fish with spicy everything doesn't help the stomachs of people who have been traveling for days - or weeks.

Give us some simple offerings, talk up the hand rolls more, and either expand you menu to show the full range of what you can offer or select a competent hostess who can make real suggestions on food.

Excellent wine bar for an airport. Thumbs up."}
{"text":"I am so disappointed in this restaurant. I just encountered a woman named Jocelyn. Her response to be ordering from a table 4 feet away from her bar area was a big fat no. After being delayed many times I needed a table with a plug to charge my phone. I asked to order to go and I will sit within arms reach of the bar. Her response, \"It is what it is.\"  Needless to say my friend and I left. Life is too short to deal with rude staff. I am a former server myself and have never spoken to someone like that. Just down the terminal in D there Carolina Beer Company. Immediately greeted with smiles."}
{"text":"Rice is soggy and has no shape.  Bloody Mary is weak and not spicy. Go eat the bbq instead"}
{"text":"In my experience, the sushi here is ok, but nothing out of this world... it is edible and it does enough to satisfy my craving for sushi to keep me coming back. I always grab a ready-made roll (perhaps why it's always a little lacking, the fresh rolls are likely better) from the refrigerator shelf and eat it on the plane. It is definitely a welcome departure from the usual airport and airplane food. 

BOTTOM LINE: Sushi to go, a rare site in any airport."}
{"text":"I was hungry for a yummy snack to hold me over until dinner in three hours but only 20 minutes until boarding. This sushi place really hit the spot. I got the firecracker roll which was excellent - just the right amount of jalape単o mayo. I ordered the roll fresh and it came out in less than five minutes. Bartender Sarah was courteous and professional. Will definitely be hitting this place up on my next layover."}
{"text":"Quick service, convenient location in the center of the airport. I liked my seat because there was a guy on the piano who was rocking it out which made my layover pretty pleasant.

I ordered the Outer Banks roll which has tuna, salmon, and yellowtail, with avocado and spicy sauce. I asked them to put crunchy fried potatoes in it to give it some crunch, which made the rolls really big and difficult to eat- they were not rolled tightly.

In general, it's just regular sushi in a convenient location. Server was nice and quick."}
{"text":"I always come here when I have a layover in Charlotte. Sushi is always good, staff is busy but very nice and make the extra effort to work quickly knowing you're probably pressed for time"}
{"text":"The Outer Banks Roll was awesome. Had sushi is Japan a few years ago and this was pretty comparable. Service was okay but the sushi was solid."}
{"text":"Always a Must Go when I have time at this airport. Any time. I'll even scramble to make it. My favorite sushi roll is Ocean's Delight"}
{"text":"Well just a bit more than 2 stars.  I had one of the pre-packaged Tuna & Avocado Rolls while transiting through the CLT airport.  For the price paid and portion delivered, it wasn't bad.  The flavor was good and the size was ample.  Rice was getting a bit on the \"firm\" side but I didn't expect the freshest at 10:30am from their refrigerator case either.  The area was clean and nicely decorated.  Their sushi staff came in and started to prep for the lunch crowd and seemed nice when asked questions.

Thumb up for:  convenience, price, portion size, atmosphere."}
{"text":"Stopped through here on a layover... Absolutely delicious. Food was brought to my table,  which was unexpected for the type of atmosphere, but did I mention the sushi was freaking amazing?! Freshly made, and delicious."}
{"text":"Located in the beautiful central atrium with the iconic white rockers, this place offers excellent service with the best people-watching. Great if you are flying out of terminal C or B at Charlotte NC airport. 
I had the grand finale roll with Tempura shrimp, avocado, and cucumber. It is topped with spicy crab that almost looks like grated cheddar cheese, scallions and red & black tobiko. I love those crunchy fish eggs, but it was kind of hard to eat them with chopsticks.
Flavor was decent, nothing I wii crave but it was healthier than most  airport options and was a positive experience overall. Spicy crab had a kick but was a minor player in overall taste. 
Hot green tea tasted good, but mine was served in a paper cup. Service quick, efficient and pleasant all the way through."}
{"text":"Forgive me in advance for how bougie this must sound...but their Perrier was colder than their sushi rice. After a really delayed flight situation, I thought I could actually sit down and have lunch. And I like sparking water, hence the comment. The water was colder than it is in most Hudson News locations, which was an unexpected plus on a bummer of a day. I was there today right after the lunch rush, which may have been why the sushi rice was warm. I ordered the Wilbur and Orville roll; I would equate it to a fancier grocery store sushi, where they make it in front of you...however, the rice temp was really distracting. Three stars-as I didn't come for the water, but it made my afternoon."}
{"text":"Great spot to pick up some sushi if you have a layover. Good quality, especially considering it's inside an airport. Attentive service as well. You can also get a takeout which took only a few minutes if you have a quick flight to catch. Overall a nice establishment!"}
{"text":"Sushi is pretty good if you order it from the bar. Service is so-so. Can be pricey."}
{"text":"For airport sushi, I can't complain!  The fish was seemingly fresh, though I did see the chef thawing out one huge piece of salmon in the sink...but hey, you are in a airport--did you expect the captain of the boat to turn up with an ice chest?

The service was great and the wine pours might have actually been bigger than the ones I pour at home (ok, that's probably unlikely but you get my drift).

Next time I'm lingering around Charlotte Douglass International Airport, I'll know where to go for a healthy, yummy meal!"}
{"text":"Food was very good for airport accommodation ...
I had the sushicado roll (yellow tail) it was excellent I also had the eel roll at best average not enough eel then I had the CLT  roll which was excellent ( nice and spicy). Overall great for lunch in between flights."}
{"text":"Worst service I have seen in Charlotte. You ask 3 times for something and nobody brings to you and when you ask for the 4th time the manager ask if you want to leave the restaurant.

First and never more place to come."}
{"text":"The Grand Finale was not great- cold old shrimp tempura not crispy with too much fishy roe.
The Joel Gott wind was well worth the $14 a plastic glass.
The waitress Rachelle was great ran the busy place while some young male never pitched in and pretended to do BS busy work ... Including checking & browsing his cell phone every. 5 minutes.
Because if that my roll sat quite awhile till she was free to serve it.
One roll one wine one tip $36 yikes"}
{"text":"Poor service, and stale fish. I had Yellowfin Nigiri, and I've never seen Yellowfin that color or with a fishy smell. I deserve whatever happens next, but perhaps you can be more wise than I and listen to that little voice in your head that says \"you're seriously going to eat sushi in an airport in North Carolina before getting on an airplane for three hours?!?\""}
{"text":"Great sushi - particularly when considering you're in an airport terminal in Charlotte, NC. Do yourself a favor if you like spicy and go with the CLT Roll but make sure you add some wasabi too if you really like spicy. 

The bar area also provides a full length power strip underneath so you can charge a multitude of devices. Given that CLT isn't the most charge-friendly airport this is a huge bonus. 

Draft beers are reasonably priced for an airport at $8 for a pint, but I'm sure if you wanted to drink cheaper, you could find it elsewhere. 

As my vote goes, I'll come back again when I connect in CLT."}
{"text":"Another trip...and more sushi that well......is not even as good as the stuff you buy at a grocery store.........I mean a \"not that nice of a grocery store\".

I think I need to have them make it for me, vs. buying it to take on the plane as the to go stuff never seems fresh."}
{"text":"Horrible service and with an attitude. First all waiters are talking and don't even notice I wanted to order (it took me 5-10 minutes to get their attention) and when asking a water with lemon I needed to ask three times upon which I asked the manager if they don't like tips. He literally told me that they didn't need my business. I spend time at CLT airport every week and I will never ever stop there to eat again. HORRIBLE client service...."}
{"text":"Great sushi and fast service. I had a 45 min layover in Charlotte and decided to grab a bite. I grabbed a table at the bar. The waitress was busy helping other customers but acknowledged me within few minutes and got to me in less than 5 minutes. I have ordered the Tuna Pokini and he Ivan delight roll. Each item had a big portion of fish. Both tuna and salmon pieces of fish were fresh. My order came out in less than 5 minutes giving me enough time to enjoy my dinner before heading over to my gate. They also have a piano adjacent to the restaurant for anyone to use. While I was there a young man sat and played for good 30-45 minutes which was great. most people seemed to enjoy his music."}
{"text":"Dear future Daniel. 

Remember.   Airport Sushi is not your friend. 

You will forget this later, but then you will recall and remorse.  

Fish were not ever meant to fly."}
{"text":"This is sitting in the middle of Charlotte's Airport and it is the gem in this Queen City's crown. I was so happy to wait for my next flight with such a nice sushi option.  I really dug the ambience here with the piano being played right next to the venue.  The options were amazing but the service was STELLAR from a server named Jamie.  She did not miss a beat and I witnessed various customers openly letting her know how happy they were with her.  I also noticed that there was even one customer offering his business card to come work for his business! 
I am giving this score mostly because the service was so good but also because the sushi itself was good. Go get you some!"}
{"text":"Southern Charm special roll is none too shabby."}
{"text":"If typical, greasy airport food isn't your thing Hissho Sushi is worth stopping in at. While it's mediocre sushi in the grand scheme of restaurants that exist *outside of airports* Hissho presents an alternative to burgers, sandwiches, and assorted fast food that litters CDI. Got the \"first in flight\" with miso soup and sat down to eat at their bar instead of walking away with prepared sushi. It's always nice to watch the chef make your food fresh and if you pause to eat there it ends up being a bit cheaper and you can see where your food is coming from. Would definitely go back if I'm flying out of Charlotte again."}
{"text":"This is for the Hissho Sushi stand in the D terminal.  Sushi was average grocery store quality sushi.  Not good but didn't get me sick.

The problem was I came here on a very slow afternoon during a layover.  Only two people eating here and plenty of workers standing around.  As I approached the register over at the Ciao gourmet place next door. There was nobody at all working the Hissho stand when I took my sushi from the self service cooler in the front, although halfway thru eating, Hissho workers appeared.  I noticed the cashier at Ciao and two other workers were chatting.  I stood behind worker number 2 as she blocked me from approaching the register.  They were talking about some other coworker apparently, glanced at me standing there with my sushi, drink, and bags, rolled her eyes and turned around to finish her conversation.  Not moving an inch, acknowledging, or greeting me.  After a long 20 seconds she decides her conversation was done and decided to allow me to approach and put my stuff down.  The register girl went from laughing with her friends to scowling at me.  F these lazy POS workers.  Better yet fire them."}
{"text":"I had a layover at the Charlotte Airport and a little time before I had to catch my next flight.  I looked at the choices in their food court and chose sushi.   The setup for this place is basically a kiosk.   They have prepackaged sushi and what they call a \"dine in\" menu for fresh sushi but you can't dine in because it's not a restaurant.   It's a kiosk (which seems haphazardly placed in whatever open spot could be found in the middle section of the food court).  There are bar stools placed around the kiosk for the so called \"dine in\" experience.  There was barely enough elbow room between the stools.  If you add to that the fact that most people would have luggage because it's located at the airport, then you are talking even less comfortable space for dining.  

So...for that reason, I decided to get a prepackaged tray of california rolls, because how could you mess up a basic california roll. There were nine rolls in my tray.  it was reasonably priced and it tastes pretty much like any other tray of california rolls.  It was enough to feel me up before my next flight.  So, I was satisfied.  That's it...it was just enough, nothing special.  So for that reason, it gets 3 stars."}
{"text":"Is this place 5 star? No but it is a solid 4 given it's location. Say what you want but I've had much worse than this and they are located in much better situation. 

If you get the to go boxes that they have then plan on lower quality. You have to get it made fresh or don't bother. I've had the to go boxes as well and they are ok if you get them early."}
{"text":"Very mediocre sushi, but it's my favorite place to grab a light bite at CLT since the other food court options all involve frying, gravy, cheese, or BBQ sauce. 

If you're taking out, make sure you grab a little plastic bowl from the bar to mix the wasabi and soy sauce."}
{"text":"I know what you're thinkin ..sushi in an airport- that's dangerous! Well they had a 101 health code ranking so why not ! Well it left a lot to be desired .  Slimy fish ...messy rolls ...gross sweet chili sauce covering every inch . Maybe I just picked the wrong roll but I wouldn't eat here again."}
{"text":"I really don't like writing negative reviews but this is not what you would consider good sushi. Had the international roll. The rice was undercooked and the seaweed was chewy. You can try your luck, but they won't see me again"}
{"text":"Flying through Charlotte frequently, this a regular stop for me as the sushi is fresh and for its location it can't be beat."}
{"text":"Great place for a quick bite while you wait for a flight. Better to place an order and have it made fresh, then go with one of the prepackages containers."}
{"text":"Charlotte's airport has a carnival like feel to it and I suppose because of that I was feeling campy and adventurous. Therefore I decided to go for airport sushi. 

I've never had a good experience before with airport sushi and you gotta imagine on a scale of Jiro Dreams of Sushi down to convenience-store-in-the-middle-of-nowhere sushi, Hissho Sushi ranks like the white fish in a chirashi bowl. You don't really need it but you'll eat it. 

Really this deserves a 3.5 rating as it's located in a modern area of the airport that is borderline chic. You'd imagine sushi would be sold here is what I'm saying. 

Our rolls really weren't bad at all. Actually it was surprisingly good if you're considering where you are in the U.S. The rolls themselves were not even absurdly priced. Ours were about 10-14 dollars. The fish quality was decent too. 

So I'd put Hissho and Bojangles as two places to eat in Charlotte's airport."}
{"text":"Better than anticipated for airport food. The ginger miso salad had a tasty dressing, though the avocado was underripe. The salmon role was good. Service was very fast. I ordered, ate and paid in 20 min. Recommended for a healthier option in terminal D."}
{"text":"Okay, look, it's airport food. I'm not expecting amazing stuff, nor am I expecting reasonable prices. And I avoided the raw fish. Why? Again, it's airport food. I'm sure they have massively strict regulations on what they can bring in, how they bring it in, etc. 

I got stuck at the airport for about 6 hours. It wasn't a long enough time to justify me paying for a cab to go anywhere and then another to come back. I'd be spending $40 for a few hours at home, versus copping out $16 for an overpriced sub-par meal. I chose the meal and wandering around the airport for a few hours. Note: airports are really fascinating and they always have the weirdest, most random art. 

Miso soup, some kind of vegetarian sushi, and a seaweed salad. I think two of these were a combo of some sort. The miso soup was surprisingly good, also nice and hot. The dinky plastic spoon I had to eat it from was sort of lame, though. That can't be helped. The sushi was adequate, about a half-step up from supermarket deli sushi. And the seaweed salad was just fine. 

Would I pay as much as I did outside of an airport for this quality of food? Heck, no! 

Was I completely grateful for a place that didn't just serve heaps of meat, fried stuff, slathered-in-cheese stuff, or some other kind of nasty, unhealthful super processed carby stuff? 

Absolutely."}
{"text":"Good spicy tuna hand rolls.  Friendly service.  Nice option with gluten free soy sauce.   Better than average airport food.  Would stop by again if I had layover in the Charlotte Airport again."}
{"text":"Four stars huh? Well yeah...this place deserves it today. I had a couple rolls they make called the CLT roll and the Captain's Roll which were very tasty indeed. I happen to like spicy...both of these rolls have a common spice in using jalape単o peppers either sliced or diced. In addition, the tuna in both dishes was of good flavor and texture. I should clarify that the Captains Roll wasn't really a roll...it was more of a sashimi with yellowtail tuna in ponzu sauce, with sliced jalape単os on top.

Either way, it was exactly what I was looking for in a lunch. Consider this fact as well that this is a sushi place, IN AN AIRPORT, IN NORTH CAROLINA...not what you are expecting to find down this way.

Prices were reasonable for airport food. The wait staff was both attentive and friendly. Interesting considering that they seemed to be employed by HMS Host and I have had rather unpleasant dealings with that company in the past. Either way, I had a waitress/bartender that did an excellent job of both making recommendations and ensuring I had what I needed to enjoy a great meal..

I have eaten here a couple other times in the past and the food/delivery of service have been consistent experiences.

Would definitely recommend this place to anyone with an hour or longer layover at the Charlotte-Douglas International Airport."}
{"text":"Service was quick and efficient, but the sushi was subpar. I ordered the CLT roll and the combination of salmon and tuna reads well, but the addition of srirachi sauce over powers the dish. I would adjust the roll and take out the hot sauce. Overall, the good service compensated for the pricey roll, which equated for the 3/5 rating."}
{"text":"1.5 stars.  I was excited as I rolled off my flight in the D concourse but the service only seemed to be for the carryout option at 9:30 (disappointing) and the take out was pretty crappy.  I've had average sushi before and this joint, while nestled in a hip and fashionable looking section of the concourse, had pretty below-average sushi.  Avoid, especially considering the price."}
{"text":"Great sushi. Considering it's in the airport the price is reasonable. I have had the salmon lovers roll twice now and both visits the staff were helpful and pleasant. Thank you for a great lunch"}
{"text":"The 9 piece sashimi was amazing.  Wanted good sashimi the entire vacation, finally found it on my layover on my trip home."}
{"text":"I was extremely disappointed. I had such high hopes as it looks like they make the sushi fresh but when I got it it was anything but fresh. The eel was a very poor cut, the shrimp tempura was repulsive and often contained the tail and sometimes it contained no shrimp at all. It was quite expensive. They wanted 13 bucks for shrimp and 6.79 for a beer. It really wasn't even edible. So disgusting. Waitress was nice but I would never go back."}
{"text":"Wasn't sure about airport sushi but fresh and tasty!  Enjoyed the fish and chips (spicy tuna and spicy salmon in multi grain chips) simple yet creative name :) and it was fresh. 

Southern charm was also tasty and adeptly named.  Nice combination without feeling it like it was trying to hard.  

Janice the server gets two thumbs up from me!"}
{"text":"Rachelle at Firt In Flight is a great waitress who has a warm and welcoming attitude. Very charismatic! Food is surprisingly good for an airport sushi place. So much better than typical airprt food. Pleasantly surprised!!!"}
{"text":"My first time at this restaurant was during my observation flight in ground school. My classmate and I were hungry and the rest of the group went out for Salsarita and we chose this place since sushi is my favorite food. The service was impeccable and the workstation in the portions were plentiful and fresh. Every time I walk through the airport I see happy customers and I cannot wait to sit down and have the ahi tunain the beautiful martini glass on top of the bed seaweed salad."}
{"text":"The sushi is okay (4 pieces in and I haven't gotten sick yet), but the rice tastes different from what I am accustomed to. The prices aren't the worst--$9.19 after tax for 12 pieces of spicy salmon--but the last working the register wasn't terribly friendly and had a bit of an attitude. That's the main reason I am rating this place two stars."}
{"text":"Was ok, service was a little bit slow Sushi was just okay but for where I was and in comparison to the other places at the airport but I really did like the location and it really did have a good time there especially when someone started playing the piano."}
{"text":"NOT GOOD, Just ate there before boarding flight back to NY.  Feel very sick right now.  Sushi came from pre-packaged box.  \"Why would you get sushi from an airport in Charlotte\" is what i am asking myself throughout this very painfull flight"}
{"text":"I have stopped here for dinner at least twenty times in the past 18 months...  I usually get the 9-piece sashimi.  While they don't have the variety of fish types a good city place would have, it has always been fresh and very good.  One of my favorite airport options!   The service is great too - you'll find many road warrior regulars like me!"}
{"text":"Ate here after passing by a couple times, decided sushi was a good thing in the airport.  Have waited a couple times to see if it's actually fairly consistent.

It is.  Consistently bad.

Bottom line is this... good for airport food, BAD for sushi.

Rolls are soggy, as is the tempura.  Rice is nearly suffocating - like peanut butter around the roll.  Found a small rock / pebble in my roll today.

Not kidding.

Again - probably decent for airport food, just don't expect much."}
{"text":"Charlotte's got a lot. A lot of choices for food if you're spending time on a layover at this major East Coast hub for American Airlines. Hissho Sushi is an ideal option as it is centrally located in the main atrium and they have a decent selection of premade sushi for eating here or taking to go.

The variety is good and the prices are reasonable. $14 for a higher end roll and as low as $8 or so for something not quite as fancy. I got a rainbow roll today and it was good. Not as good as some, but better than should be expected for airport fresh fish considering that some things are prepared off site and they're also restricted on knives here thanks to the TSA.

Worth it."}
{"text":"I had the Grand Finale roll of 8 pieces while waiting for my flight. Service was great and the sushi wad ready. I usually look for more spiciness but didn't want to go with anything raw. This roll included spicy crab which want spicy enough. Let me add that the water wad delicious. There is nothing like a great tasting glass/cup of water! Overall, it was a great quick meal that left my stomach satisfied."}
{"text":"For a grungy airport sushi joint, this place somehow lowers the bar thanks to a nasty employee / chair police named Shay.

First, Shay prevented me from sitting at one of the many vacant tables (in reach of an elusive airport power outlet) and said it is for customers only.  I apologized and asked for a menu.  

10 minutes go by, no Shay, no menu, so I go up to the bar and order there.  Within seconds, my power outlet chair has been taken by another dude!  Needless to say I tried to stretch out my California roll (tasted more like a New Jersey roll) as long as possible to remain a customer, while keeping a watchful eye on the chair/outlet bandit.. he never ordered food!

Fast forward another 10 minutes: New Jersey roll is done, guy leaves, and I promptly zip back to my outlet seat before it gets hijacked again.

Enter Shay, act 2. She comes back and literally threatens to call security if I don't move, totally unaware that I'd been at the bar eating for the past 10 mins!  She refuses to believe me until I flag down the chef at the bar who prepared my food to vouch for me. Very embarrassing.

I likely was never coming back here at all in the first place - but come on, Shay!  R-e-s-p-e-c-t, find out what I means to me. I understand that the restaurants chairs are your responsibility - but learn which battles to pick and maybe take it down a notch, kthnx!"}
{"text":"I had a couple hour lay over here and needed a place to eat and relax waiting on my flight. At 1pm on a Saturday it was not busy at all. Rolls were hand made and came out fast. The drinks were good and not watered down. The bartender was great and very attentive. I waited just a couple minutes before he asked to help. 

The taste of the Orville & Wilbur's Roll was good. For being in an airport, the quality was decent. Not a top rated sushi restaurant but definitely good for air port quality. The sweet chili sauce on this roll was not overly heavy and let the tuna flavor come through. The spicy crab inside was excellent. 

For seating, there were tons of high top tables or bar options. Because food cane or quite quick, you would not have to wait long even if they were full. 

Overall, I highly recommend this stop if your on a layover and have a need for some sushi."}
{"text":"nice people good service quick it's not Gourmet sushi but it's a quickie in between flights I like that"}
{"text":"I'm definitely giving a little leeway for the fact that this place is in an airport so the bar is set low but honestly I've always been happy with my meal here. I fly through CLT more than any other airport and very often the last thing I want before a long flight is something heavy and greasy that might upset my stomach. No way am I eating a fast food burger and getting on a plane for six hours.

The sushi bar is centrally located in the atrium in the middle of the airport with most of the other food. I usually grab a seat at the bar, listen to whoever is playing the piano and enjoy a sushi roll with some miso soup for lunch. It's just the right amount of food and they hand make the rolls to order. I've never done the grab and go because they're usually pretty quick when made fresh to order."}
{"text":"Overpriced and mediocre quality sushi. They crank the rolls out very fast so that's good...but also bad because they're not put together too well."}
{"text":"I saw the to-go bento box option with a couple rolls, done sashimi and salad for $14 dollars as I passed by. It looked good so I thought that dining there would have better food and cheap options.  Not true. What can I expect though, I'm at an airport. I should've gone to an actually restaurant rather than sushi. 

I ended up getting the CLT Roll. It was okay. It is spicy but that's expected from a roll with jalapenos there was a lot of sauce on it m could've masked the flavor of the sushi. What I didn't like was my yellowtail nigiri. I get yellow tail wherever I go and this was no good.  It was thickly sliced, and I don't know why, but part of it was chewy. So chewy, that I couldn't tear it with my teeth and I ended up not eating that piece. Total, my bill was $19. I should've stuck with the bento box. It would've been more filling and the better price point."}
{"text":"Be careful about eating raw sushi from the front cooler at this location. Fresh sushi shouldn't leave you feeling like you have a rock in your stomach. Disappointing given the lack of other fresh food options in this part of the airport."}
{"text":"Stopped here after I couldn't decide what to eat before my flight out.  I had never really noticed there was a sushi option at Charlotte Douglas, but I was sort of excited instead of having to eat any of the fast food fare.

I ordered a tall beer, edamame, and 2 sushi rolls.  The server was friendly enough and there was a pretty busy Friday crowd going.  I think the best thing that this place had going for it was it's location:  around the flying mobile of various flying machines in the center of the terminal and also next to the grand piano (that someone was playing that night).  The lady was playing up-tempo contemporary pop songs on the piano and was quite good.  It was nice to listen and realize you are listening to Lady Gaga on the piano while having sushi.

The beer was excellent, unfortunately that was the high point of the meal.  The edamame seemed re-heated... not really freshly steamed... and the sushi rolls had a \"not-so-fresh\" feel to them.  I'm sure they rolled them after I ordered, but the ingredients may not have been the best.

I did manage to eat everything... but was left wanting since my bill came up to close to $40 bucks (for one person!).  Now I know eating sushi can get pretty pricey, but I think the concept of sushi + airport location made for a runaway pricing situation......  not to mention $10 for a beer!"}
{"text":"Service: Great. The staff is very nice.

The food is okay but could be better. I ordered the sashimi plate. The pieces were large but it was still slightly frozen.

I'm not sure how well it is known but the majority of sushi places actually freeze their fish. Theirs hadn't fully thawed out. 

Ultimately, I'm on the fence, it would be a three but when you're in an airport you're options are limited."}
{"text":"This bar is located in the Airport in Charlotte. It was better than expected but far from being the best I have had. The man preparing the sushi did an excellent job with the preparation of the food. The fish he was working with had the appearance of being frozen and thawed. This was not his fault. He was working with what he had and his presentation was very good. Oh! I got the poke seasoned and on a bed of sea weed. I enjoyed the poke which would of been much better if the fish was firmer. There was no fishy taste or smell just not as firm as I would of liked. Will I go back? If in the airport on another visit to Charlotte I would probably try them again."}
{"text":"It's easy to miss this newly opened Sushi place inside the airport in the same location as the First In Flight Bar.

Stopped in for dinner on my way back to DC from Vegas."}
{"text":"Actually pretty good sushi for airport food that is.  I guess that my standards or expectations are lower given that it's in North Carolina and in the airport and we're talking sushi not barbeque.  The CLT was spicy, very hot, which is the way I like it."}
