{"text":"Great place, was there on a Sunday afternoon (3-ish) so it was quiet. Service was quick and polite, prices are reasonable special beef Tonkinoise soup $9.50 for a large.  Clean place , most major card s accepted and Interac"}
{"text":"This is one of the Vietnamese restaurant of Montreal! They have great Pho, but what makes it special is that they have Vietnamese specialties I have never seen anywhere else. They are surprising because it's not a taste we are used to, but they are so tasty, well worth a try. Try the La Vong Fish, it's really something special and tasty.  The specialties are a little pricier (~16$ a plate), but they are meant to be shared between persons Vietnamese style. Other than these plates the rest of the prices are in line with other Viets (~9$ Pho, ~12$ grilled meat or crispy noodles).  The staff is always friendly, some of them might struggle with french or english, but we always end up understanding each-other.  They recently added Sushis to their menu, I'm not sure what these have to do with Vietnamese, but while talking to the owner I believe he gave in to market pressure to have them (\"Asian\" restaurant should have sushis??). Tried them one or two times and they were fine,  but I'm not a big sushi guy and the real Vietnamese stuff on their menu is so good I can't justify not to eat that!  PS. This is a \"bring your own wine\" restaurant, but I couldn't find that option on Yelp"}
{"text":"Pretty decent Vietnamese restaurant with better viet food than you'd normally have. Had really good bun bo hue, although it could have been a bit spicier. Pricing wise it's like every other restaurant. Their che ba mau is good, although it could use a bit more coconut flavouring (in my opinion).  Service was pretty good for a viet restaurant, and it has a very relaxed atmosphere.  Parking might be a bit hard to find depending on when you go, so definitely be prepared to walk."}
{"text":"Chicken wings are so flavorful & crispy. I am completely addicted. Also got the che ba mau ... 3 color dessert , it was comparable to what i had in vietnam  & the fried banana omg .. & the grilled chicken on rice. Anyways im obsessed. Ive finally found an authentic vietnamese resto"}
{"text":"Très bonne soupe Pho. Savoureuse et généreuse, c'est de loin l'une de mes préférées dans le cartier. Ingrédients frais et croquant sous la dent.   Au niveau service, il semble être devenu la norme d'offrir un service courtois mais sans saveur. Jusqu'à maintenant, lorsque je choisi d'aller manger dans ce type de resto, je m'attends à demander plutôt qu'à ce que le serveur/euse soit au devant de mes besoins.   Les commandes pour apporter ou la livraison c'est super. La seule chose c'est qu'il y a la même quantité de bouillon pour une large que pour une XL... je recommande de demander une portion supplémentaire. De toute façon c'est tellement délicieux..."}
{"text":"Bon petit resto de quartier! La nourriture y est fraîche et traditionnelle vietnamienne!   Service très sympathique!   Nous y sommes allés deux fois. La première fois nous avons pris la table d'hôte c'est bon et surtout maison, soupe et rouleaux! Ça change des asiatiques ou tout est surgelés. La seconde fois j'ai pris que des entrées, j'ai qu'une petite fin, mais tout avait beaucoup de goût!  Bonne petite adresse!"}
{"text":"Small Vietnamese restaurants that also churns out a lot of pan-Asian dishes to attract a bigger clientele. Stick to the Vietnamese stuff, it's very decent.   Me, and my group ordered the grilled blood sausage and the innards, the blood sausage was solid, albeit it could have been a bit more spiced up.  The blood and pork congee was average, they weren't slowly braised with the soup, but they were added after. It lacked a certain symbiosis between the different elements.  The Bun Cha was good, you take the noodles and some greens and dipped it in the pork and vinegar. It was a solid dish.  BYOB  3.5 stars."}
{"text":"Amazing food ! Very authentic, I'm Vietnamese native so that's what's up , I had the bun thit nguon wit egg rolls!  Service was quick and very attentive. Nice table cloth :) bonus it's a byob !"}
