{"text":"A \"casino\" with only slots is like an nfl game with only extra points but your kicker has a gimp leg and everyone in your huddle are old women in pajamas."}
{"text":"First off, I'd like to give this place less stars but yelp won't let me. The greatest mystery I've experienced in life is how this \"casino\" exists. They only have slots. Zero table games, zero video poker, zero video blackjack, zero video roulette, zero anything remotely resembling anything a real casino would offer. The fact that this \"casino\" stays in business is offensive to me as a gambler.   They don't allow smoking anymore, because if they did, any reasonable person would burn the place down after spending just a few minutes in there. They don't serve any alcohol products so 18 year-olds can \"gamble\" there. I weep for all the 18 year-olds who went here thinking this would be there first casino.   Again, the fact that this \"casino\" only offers slot machines and still stays in business is offensive and depressing, because they're clearly making money by robbing poor people too stupid to realize they'll never win their welfare check back on slots.   Going to a bar with pull tabs is more fun. Putting your money through a fancy paper shredder with flashing lights is not only more fun, but more effective."}
{"text":"I don't generally do casinos, so take this review for what it's worth. My wife and I rarely gamble. In fact, we didn't come here to gamble - we played with house money + I believe a total of $4 of our own dollars. Ho-Chunk does well giving out freeplay dollars at various events around the Madison area.   We came in on two separate times using free play money only, for about 45-60 minutes each time. Each time we left a combined...wait for it... $60 and $20 ahead! We had our fun for an hour, took our money and left. I'm assuming this works in the casino's favor when they bring in regular gamblers, so please continue giving out free play! I probably wouldn't come in and buy your drinks/food otherwise (no offense, I avoid casinos/gambling otherwise).   This place is smoke-free which is a major plus. If they continue to give out freeplay awards around town, they'll definitely see me again. We needed the staff to help us with setting up our players club and freeplay on the machines and the people at the front desk were super accommodating and helped us get set up. It seems they're trained well or they hire well on customer service. Kudos.   I thought the place was very clean and well-maintained. They could probably get 5 stars (and perhaps some of my actual $) if they had table games, but we enjoyed it for what it was."}
{"text":"place is not as bad as others say they do have a non smoking play area and a smoking area more slots no card games mostly everyone plays the slots anyway café is just quick food who has to dress up to play some games lets keep it casual play a little extra cash ho chunk seems to be a little more generous then others"}
{"text":"Why this place has Class II slots I will never figure out, but it's really hurting their reputation. These machines are actually aiding you in the playing of BINGO, and the graphics, bonuses, and theatrics are there for show. Each machine has a BINGO card on it, and when you hit \"spin\" that actually starts a game of BINGO. If you hit a BINGO, you win something (the amount depends on some other factor I'm not familiar with, but it doesn't have clear logic behind it). If not, you don't win. Sometimes 25+ bingo balls are drawn. Sometimes there's less than 10. It's really dumb and I can imagine the house advantage being close to 15% for these machines (normal slots run around 8%, with blackjack running 0.5%!). There is a poker room here (electronic poker) but I haven't done that so I can't comment on it.  The usual HCG free pop policy still holds here, and there are several machines located around the property. Because it's technically BINGO, this casino is open to 18 year olds and up, and thus does NOT serve booze.  Unless there is some great promotion or a good band or something, I wouldn't come here. It's hard to win or even have fun when you see you hit a BINGO on the machine but only get 10% of your original bet back. Drive the extra hour up to the dells and play the tables or the real slots."}
{"text":"I thought Ho-Chunk was bad, this is even worse.   Where do I start? When I walked in the place, I was greeted by a gross stench of smoke and welfare. The clientele here look like depressed, down on their luck dejected humps as the gamble away the months last welfare and social security dimes. I'm no stranger to the gambling hall, but I've never seen so many pajama clad people in one place. Bring back the gambling of old!!! What happened to looking like you could afford to drop a few?   The slots are tight... so tight that I'd have a better chance being seen on the town w/ Mila Kunis before winning anything here.   The staff is useless as a broken compass. When the changer machine broke, I waited for nearly an hour to be helped. When I finally did get service, the employee was as personable as my soiled undershorts. How about a smile? Smiles make us forget how bad we've just been spanked.   If you like good food, don't eat here. The prices are insane, and the taste is even worse. I paid 8 dollars for a piece of fish that resembled a lightly breaded carp, 3 french fries and a salad smaller than my wallet was after 2 hours in this place. \"Free\" soda is available. The Pepsi should be called \"brown water\" since the Ho-Chunk likes to skimp on the syrup.   Comps?? Just like DeJope's big brother.... None.   DeJope \"a little Vegas in Madison\" It would have been cheaper to fly to Vegas where at least I could drink and play more than computerized slots. More like \"a little taste of ghetto gambling in Madison.\""}
{"text":"Slot machines.  That's it.  Maybe when I hit 80 I'll update this review, but for now, a casino contains tables games, so this place doesn't qualify.  Food is below average.    If you like slot machines and that's all you want to do, then check it out, it's not horrible, but don't mistake it for a real casino.  With that being said, avoid their place in Baraboo.    I guess casinos run by the mob are a better choice than casinos run by Indians."}
{"text":"This place is terrible, if you feel like losing- head here to succeed at that. Not sure why it's busy but the slots pay terribly....' it's worth the drive to go anywhere else."}
{"text":"Pros: Easy access, clean open layout, and best of all SMOKE FREE. (Being a non-smoker, and already used to this in Illinois casinos this is a huge plus.)  Cons: probably the biggest thing for me is they don't have table games here, it's slots only.    The lack of table games make this no different than hitting up the slot machines at your local bar.  Drinks and food cheaper too."}
{"text":"We were there only 15 minutes, and felt like our money was stolen. How can you play quarters, 3 credits, which is 75 cents but when you get a credit, you get 3 cents, or 10 cents or 18 cents? Isn't a quarter a quarter? And how can you put in a 5 dollar bill in a quarter machine, hit play 1 credit, and only get to play 3 times and then be told you only have 15 cents left??? When we questioned this, we were told, it's like \"Bingo\" if 2 people have the same card, you don't both get the jackpot, you have to split it. What does Bingo have to do with slot machines? The woman telling us this, thinks we are stupid and we believed that crap, when actually,  what a bunch of bull. We immediately left. We fell extremely ripped off!!!"}
{"text":"This place is kind of ridiculous. I know I was there on a Monday but it was Fourth of July so busier than a normal Monday. They have four cash out machines around the casino. On the day I was there one was out of order and the other three had about ten people in line. You can also cash out at the cashier window but on a busy day they had two windows open with also about ten people in each line. Speaking of out of order machines there is a large amount of slot machines out of order. Good luck if you have a problem with your machines because it will take forever for a slot tech to come by and help you. Another thing is after years of being an eighteen and over casino you apparently now have to be 21 and enter. They now want to eliminate the smokers and the 18-20 year olds. My guess is this place is gearing up to be a full fledged casino. The advertising they have saying that their machines pay out at 95% is ludicrous. I guess you can claim anything you want if you don't have to back it up."}
{"text":"It's a casino...granted you are going to LOSE some, if not all the money that you bring with or take out. However, in contrast with some of the bigger casinos (AKA Potawatomi...) this is one of the better ones to stop by on a \"rainy day,\" or preferably if you have the money to spend. They have quite a wide variety of \"penny\" slots that are available. It's not overly crowded, and it's also smoke-free. Those are the perks. The food isn't bad either, I had a burger w/ complimentary fries. The soda is also free, along with a station to get coffee there w/ creamer, etc. I don't see myself making the drive again anytime soon...the \"rewards\" program isn't very good, and they don't have \"comps\" like some of the more popular casinos, as mentioned above. I.E. I received a measly $5 play, after gambling over $300."}
{"text":"I enjoy casinos and playing blackjack,but this place is very smoky,depressing and degenerate..By the way ,slots are the only games available....Enuf said."}
{"text":"I haven't been to a lot of casinos, but it didn't take much to figure out that this one is nothing special.  If you want penny slots, this is your place.  If you want video poker, any sort of table games, or anything else, keep looking, because you won't find it here.  The ENTIRE place is penny slots, dime slots, quarter slots, etc."}
{"text":"Worst Casino I have seen. Depressing. Food stinks. They have a monopoly and it shows. Just a sad excuse for pathetic way of life. The Dells is only marginally better. Stay away."}
{"text":"Expectation level: I know its all slots, so we'll let that slide  Pro's:   -Free soda is always nice, and I've found the place generally clean.   -Never had any notable issues cashing out.   -Usually easy to find a machine  Con's:   -It's a Casino so naturally some things are going to feel rigged. That said, I've been here several times and it loses it's flavor real quick.   -I really miss table games when I come here.  -I believe it had electronic poker tables briefly but the experience was awful and considered a failure.   Bottom Line: It's better to travel the extra distance to Milwaukee in my opinion or maybe even Baraboo."}
{"text":"I'm never a huge fan of Casino's.  Probably because I don't gamble and find them to be a waste of time.  However, my grandma loves them.  And she was visiting, so I took her to Ho-Chunk.  But I must say, that this was a decent place.  Smoke free.  Although yes, you can still smell the smoke in the carpet.  And not too big that you get lost.  I wouldn't come here on my own, but would take my grandma again."}
{"text":"I have been here a few times and everyone has been very nice. Your review helps others learn about great local businesses.  Please don't review this"}
{"text":"The reviews are right, this is the worst casino in Wisconsin. Win or lose you can have a good time in the Dells or Milwaukee.  Here All the games are old, the payouts are terrible if you manage to actually win and whatsup with the dumb bingo slots? You already know you lost before the reels stop spinning. Takes the fun right out of it. Take a extra 45 mins to dells its much more worth it"}
{"text":"Ho-Chunk: now smoke free! Mostly. While there's no smoking allowed in doors anymore, the smell of smoke has seeped into the carpet, chairs, and whatever else is capable of holding a smell. It's not overwhelming, but it definitely isn't a fresh scent when you walk in the doors.  I had only been to Ho-Chunk once before and we kept to the non-smoking room. It was nice to be able to freely roam all of the slot machines this time and play whatever spoke to my friend - she is the true gambler between us. Unfortunately the machines were whispering \"lose all your money\" that day, but I fared a little better. To mix it up a bit I decided to put $5 in one of their non-video slot machines and ended up coming out ahead $3.81. Whoop whoop! High roller!  I appreciated the free soda and the onion rings the grill was making smelled ridiculously good - since I'd eaten a giant breakfast of potatoes and pancakes, though, I decided to forego the deep fried goodness.   Tip for gambling newbies like me: to cash out, take your slip to the ATMs stationed around the playing floor - it'll cash you out in addition to taking your card if you need cash for the machines when you arrive."}
{"text":"Nice clean place, enjoy the smoke free atmosphere and variety of slots."}
{"text":"The worst casino ever. Games are old, and don't expect any services. I dropped $160 and didn't even get a free drink. The pay outs are terrible."}
{"text":"We have been here several times. Being from the Milwaukee area if you wanted to go somewhere other than Potawatomi you had to travel approximately 2 hours. With Ho-Chunk Madison you have an option about an hour away. The bonus with this casino is it is smoke free. Why the other casinos have not figured out that you can operate without a smoking environment is beyond me. They recently added a bar area for those who want an adult beverage. Also offered is a food court area with great food."}
{"text":"I took my 85-year old Mom to Ho-Chunk. She put $100 bill into a machine. It gave her a $5 credit. She immediately pushed the button for help. People came, but they had every excuse that they couldn't check the machine. It ruined her evening. She so loves her little bit of fun gambling. This experience robbed her of that. I am furious! We will never return. I should have read the reviews for Ho-chunk. Very bleak."}
{"text":"I Stopped by this casino on my way back home from a seminar and was very surprised that every slot machine is a #2 machine . This means they are not regulated or monitored by any independent gaming commission other than the casino. In other words it's a casino money making machine above and beyond the norm. The winnings are not random but controlled and the odds are not  required to be  disclosed by the state. So unless you're  going for lunch or for pure entertainment don't expect to win anything. I preformed my own experiment and played 60 different machines with 4 spins each. This is a total of 240 spins & I had only 8 free bonus spins and won  a total of $10.  Terrible isn't it? . I'd recommend HoChunk in the Dells all there machines are #3 which means they are regulated , monitored and tested for irregularities but again don't expect any casino on an Indian reservation to disclose there odds. They are not required to by law.  You'll always know it's a #2 machine when you see the hidden Bingo game  somewhere on the machine  The lunch special for $7 was a great deal."}
