{"text":"I came her with my husband for an all you can eat lunch. We're big sushi lovers so our expectation level was high. The place was clean, the AC was at an ideal temperature and only two other tables were full (which is perhaps less-than-ideal for business but I loved since crowds NOT my thing). The service was agreeable; not wonderful but good. The food was great and the value for money was outstanding!"}
{"text":"Food was decent, but the service was absolutely terrible. Both servers who served our table were so hostile that I pretty much lost my appetite - which sucks because it's all-you-can-eat here. Would not come back here again."}
{"text":"Last week my boyfriend and I checked out Hokkaido.  I liked this restaurant for quite a few different reasons, good location, quiet, good food and quick service. This place is located at mount pleasant and eglinton which is not far from our house which is a plus, they also have free underground parking Which is another bonus.  We came for a light lunch, and I was surprised to see the price was only 11.99, which was nice because most sushi places run around $12-15 for the same type of selection (plus parking). Aside from us, the place was pretty empty. There was one other family and one other single lady. It seemed strange but it was actually quite refreshing considering how most other AYCE sushi joints in Toronto are usually packed full, even at lunch (akkaido). We ordered dynamite roll, California roll, sweet potato tempura avocado roll, and vegetable tempura. It all came quickly and the presentation was nice. They were smaller rolls with less rice which is exactly what I was looking for. The tempura pieces were also very large.  They staff was very nice and friendly and encouraged us to order more, unlike other places I've been to that give you less and forget your order. I didn't feel rushed at all. 4/5"}
{"text":"When Hokkaido first opened my husband and I were excited to have a new sushi place just around the corner from us.  When we first ate there, the Sushi was always fresh.  The last time few times we at there, the waitress was extremely rude, audibly dropping whatever we ordered on the table.  She did not address us at all.  Her service was like we were a hindrance.  Prior to that, on one of our visits to Hokkaido, I heard the sound of nail clippers.  To my horror, I turned around and saw one of the Sushi Chefs squatting on the floor clipping his finger nails at the Sushi preparation station.  I WILL NEVER EAT THERE AGAIN!"}
{"text":"We have ordered delivery here a few times. We've enjoyed their food for the most part, except for their tempura sweet potato being very starchy.  Tonight, however, we called in our order and was told our total cost only to be called back 2 minutes later saying that they undercharged us and that I would need to have $8 and change in cash to pay extra to the delivery person. This brought our total for 2 people (3 appetizers and 2 main rolls) to over $60! We usually only spend $45. So I called them back to ask them why our order was so expensive than what I had calculated it should have cost from their menu online ($40 + taxes.) They proceeded to tell me that they just changed their prices recently and that their website must not be updated yet. I asked them if they would honour their advertised prices and they refused.  Definitely very poor customer service for repeat customers such as ourselves. They have lost our business. I ended up cancelling our order and calling Sushi Rock instead."}
{"text":"Go here very regularly for the AYCE and it's really pretty good. Service is fast and friendly and their menu is pretty decent. I've always had fresh sushi here. Is it the best sushi place ever? No but the value for money is great!"}
{"text":"Hokkaido had been functional sushi, at best. It's one of two sushi options in this area of town, so I have frequented mostly out of convenience. Never memorable. However, today was entirely horrible. I had the lunch menu with chicken teriyaki. The chicken was quite visibly frost-bitten and taste like leather. There was no sauce. Instead about half-pound of sprouts floated in sizzling oil. I sent the dish back, but waitress insisted I had to pay for the frost-bitten chicken, even though I explained the demonstrable sub-par quality and poor flavor, because I had eaten the *two* broccoli florets on the plate. Nope, not coming back."}
{"text":"Delicious AYCE.  I stick to tradtional rolls and some house specials. Their sushi is top-notch. I have gone back several times.  The meats are not that great, but the seafood is amazing. Plus they have free parking which is awesome.  Nice staff too."}
{"text":"Ordered Take Out from here because it is across from my house.  Sashimi Combo was good for 12.95 and the spicy tuna roll was ok but had a lot of filler.  Found the waitress quite rude when I was picking up my order and paying cash.  Will return in a pinch but have not found a great sushi spot in the area yet."}
{"text":"Salmon sashimi was off. Had a very distinct fishy smell and had a defrosted look. I think I have food poisoning as I am throwing up. Will contact health department for inspection."}
{"text":"Don't bother. There are  many better places close by. Would not go there again. Forgot the wasabi. Called and they really didn't care."}
{"text":"Hokkaido Sushi is a Japanese restaurant that offers a variety of yummy food in their casual and relaxing atmosphere. I've been here plenty of times and the service has always been friendly and efficient.  They have a wide variety of options on their menu, lunch specials, party trays and the all you can eat option for reasonable prices. Every time I've come here I've opted for the lunch AYCE. The lunch AYCE offers a variety of appetizers, tempura, udon, teriyaki, donburi, sushi pizza's, sushi, maki rolls, handrolls, drinks and desserts. The dinner AYCE includes house special rolls, more appetizers and sashimi. The food here is fresh and delicious. My favorites have to be the handrolls, fried scallops, sushi pizza's, chicken teriyaki, calamari, redbean ice cream etc.   Mon-Thurs Lunch AYCE $11.99  Dinner AYCE $17.99  Fri-Sun & Holidays Lunch AYCE $13.99  Dinner AYCE $19.99  Hokkaido Sushi also offers take-out, outdoor patio in the summer, delivery and has free parking for those dining in. This is defiantly a place to check out if you enjoy Japanese cuisine!"}
{"text":"I've been to a lot of sushi places around Toronto but this one was by far the worst. Service was especially terrible and it really was like they didn't want to even be there. A lot of Much better options in the area like Supreme Sushi near Yonge Eglinton."}
{"text":"I rate it 4 stars just because it's not the high-end rice of real Japanese places but they still use a good rice quality nonetheless. And it's not $$$, it's about $25 at dinner all inclusive unless you start drinking. Very affordable lunch menus, too. I've used take-out, dine-in and delivery (super quick!!) My friend and I are quite knowledgeable and picky when it comes to quality sushi, and this restaurant is your affordable/good quality sushi place topped with a smiling staff. Very clean. I spent 6 months in Japan and can't handle any 'fake or modified sushi' or low-quality rice that seem more and more popular these days. This one isn't one of them for sure! They are not Japanese, but kept it traditional with a modern touch. Friendly efficient staff, too. Very good all-you-can-eat selection, fresh, good portions, nicely presented (with daikon!!)! Nice patio, too."}
{"text":"After reading the generally positive reviews and ratings of Hokkaido Sushi, I confidently brought my SO for lunch and we were both eager to experience the deliciousness. However, we were disappointed with our meals and found out by mid-afternoon we were experiencing some food poisoning; she getting hit worse from it than I based on what we ordered and shared.  Restaurant Size: Hokkaido Sushi appeared to be pretty spacious, with an entire empty back area (?).  Plenty of tables available, but that may have just been because it was a Sunday early afternoon. May you be amused at the feet of the sumo wrestlers painted on the wall.  Portion size: The Philadelphia Rolls were adequately sized with the amount of rice, and were well accentuated by the gigantic plate. 6 rolls in a giant plate -- that's how the pro's do it. As for the salmon bento, it was your standard-sized bento.  Service: They're there when you can get their attention..."}
{"text":"The other day I received a flyer for Hokkaido sushi in my door. I'm a huge sushi fan, and since my favourite sushi spot (Sushi Bon on Queen st.) is a bit of a hike I figured I would give Hokkaido a shot.  It's always good to try new things, and at least now I'm not left wondering \"what if that place is good\". It wasn't. The food was - for lack of a better word - \"wet\". The sushi was wet. The beef skewers were wet. The salmon was wet. The rolls were wet. Everything had an odd moisture to it that was very off-putting. The fish was not fresh at all and the salmon had a weird pale colour to it. The yakitori was the gristliest, darkest meat they were able to find on a chicken. Even the avocado was bland.  The service was friendly, however they gave away half our order to the only other table occupying the restaurant and we sat there waiting for it for about 10 minutes before I had to walk up and ask where the rest of our food was. They were apologetic, but then later lost our order again when we wanted desert. They also forgot my boyfriends drink after ordering it twice.   There are many better sushi places in the area, and others in the city worth traveling to. Whether you're a sushi novice or seasoned expert, you're better off going to any other sushi place than this one."}
{"text":"This place is great! Great lunch menu, excellent dinner menu! The lunch menu even has shrimp tempura, which are my favorite. I wish they would add the Philadelphia roll or the green dragon roll to the lunch menu. The only thing, I noticed sometimes their roles are not consistent, sometimes it has too much rice in them."}
{"text":"Actually I am very dissappointed as everything was good overthere but I finally endes up with food poisoning and was really sick. Definitely hv to be careful when eating sushi mainly raw fish. I will not be eating sushi for a while now based on this experience as had to go to see doctor. Hubby though didn't get sick."}
{"text":"Came here because of previous good Yelp reviews. It was SO BAD. One of the worst AYCE places.  Hardly any of the usual rolls options. No green/red dragon, dynamite etc.  Place smelt funny, was empty on a Saturday afternoon, staff useless and a few rice flies around.   Enjoy."}
{"text":"I came here for a lunch with my friend. Price is awesome, but food was bad. Especially my friend just complained a lot I ate most of my friends food lol For my review, service was suck. I won't come here forever:-)"}
{"text":"Hokkaido is great! The weekend and evenings prices are a bit much compared to other sushi places in the area but the selection is great (especially for vegetarian sushi lovers). the services is not amazing, but it is really good food and a cute, casual atmosphere."}
{"text":"Not bad for AYCE. The quality is at least consistent, not the best, but always decent. The price is comparable to other AYCE restaurents. The service, however, leaves much to be desired... The serving staff needs a lesson or two on being friendly and courteous."}
{"text":"This AYCE sushi restaurant on Mount Pleasant Ave and Eglinton Ave is located between the Granite Brewery and Cheese Emporium. It's clean with efficient, friendly staff. At lunch it gets super busy & noisy from Northern SS students, so if you're looking for a quieter lunch come after 1:30pm. And because there are only 2 servers during the lunch break slam, service will be much, much slower. I made the mistake once eating here during the lunch rush.  Everything I ordered came out very slowly and with the boisterous, loud talking from the little shits...er, I mean young budding minds. The sushi & cooked items are nothing to rave about and the quality is questionable at times. There are bento box specials and al a carte options if AYCE is not what you're looking for. Would I recommend, probably not."}
{"text":"The server told us that we could not eat only part of the sushi, just eating the fish part..Otherwise we would have to pay extra. Ruined the whole lunch. Attempted to talk to the manager the next day. His English was so poor that, frankly, I don't think he understood a word I said. Kept saying, \"What do you want?\" Missed some items in the all you can eat..and the quality wasn't great. Worst customer service situation i have ever faced in Toronto."}
{"text":"Tried this new sushi place this week. Overall excellent experience! Enjoyed the all you can eat menu selection, sashimi was fresh and tasty. Maki rolls were great too, there were some unique rolls which I didn't see in other sushi places (e.g. spicy avocado).  Very nice modern atmosphere, free parking underground (validated). Would highly recommend this place to those looking for a great sushi place in the area."}
{"text":"You have the option of ordering All You Can Eat or just ordering whatever you want separately? which I liked. The prices are pretty decent but I've definitely had better sushi. Felt like most of their sushis were a bit tasteless, but the staff is quite good, they even gave me a pair of chopsticks that it's easier to work with without me even asking when they saw me struggling with picking up food!! I would give them 3.5 if I could."}
{"text":"Just terrible. Went for lunch. Place is empty. Staff move...like...they...are...in...slow...motion. Food is terrible. Server asks if we want desert WHILE WE ARE PAYING THE BILL (aka real initiative shown). They do all the classic AYCE tricks (small portions, have to order everything individually, glacial service) combined with terrible quality make this an overpriced mess. There is a reason the place was empty on a business day."}
{"text":"So we came here as we were in the area and wanted to grab some dinner. My husband went to the restroom as soon as we were seated to wash his hands. He shortly returned and announced we were leaving. The chef had been in the restroom with him and then proceeded to leave WITHOUT WASHING HIS HANDS. He then returned to his station to continue making sushi BY HAND. No thank you."}
{"text":"I'm starting to think that I'm the only person in Toronto who doesn't frequent an AYCE sushi joint. For me, sushi is expensive and comes in small quantities. I work in the area so the other day a colleague (an AYCE veteran) invited me to lunch here. He doesn't live in the area, but knew of (and has eaten at) at least ten AYCE sushi places in the city.   My Summary - The selection for AYCE is quite extensive (I compared it to the other places in the area); sushi (both maki and nigiri), donburi's, tempura - Lunch is $12 so the price is great - Free underground parking  - Service can be a little better; having to constantly ask for free tap water was annoying  Hokkaido will be our 'go to' at my workplace. Until next month..."}
{"text":"Really good sushi. I ordered takeout and was scared that I'd have to wait a long time but I was in and out within 5 minutes. I got the California roll and the cucumber roll and enjoyed both. I like that their spicy mayo was actually spicy. Also loved the lunch special (I payed less than $10 for the two rolls).   I'll order from here again and maybe dine-in one day."}
{"text":"Came here for dinner on a Thursday night for 2, there were still plenty of tables available at 7.30pm. The best thing here is that one person can get all you can eat and the other doesn't if they feel like they cant eat that much that day (no sharing of course), which is what we did. The service was nothing to rave about, she waitress didn't smile much.   I decided to get the volcano roll ($9.95) off the regular menu, with tuna, avocado and asparagus on the inside topped with spicy crab salad on top. The fish felt fresh and it was wrapped nicely, though the rice felt a bit too packed.   The all you can eat had paper menus to mark what you wanted, from what I saw the sushi, sashimi, salads and tempura looked good, the other cooked food looks mediocre the short ribs were quite fatty, and the fried fish cake was all batter. However my friend left very full and satisfied for the price ($18.99 on a weekday)  I would come back here just for the location but not the best place for sushi."}
{"text":"Great new sushi place. The staff is attentive and service is quick. The sushi is really good for all you can eat and there's a lot of variety in the menu. Very reasonably priced as well. Free parking is a nice bonus."}
{"text":"I really enjoy their takeout bento  boxes. It comes with so much food it takes me two days to finish."}
{"text":"Decent sushi, great service and nice place. The sushi's quality was consistent. Not the greatest but not bad, which is good. The service was better than most places. The staff was very knowledgable and attentive. They know their stuff.  The place was clean and seems to be good to stay in."}
{"text":"Horrible, hard-to-chew maki sushi (seaweed and rice was very chewy) and it just didn't taste good, I had to load on the ginger. Even the seaweed salad was very chewy This is the first time that I have ever been dispointed with sushi. Veg tempura was okay. Didnt try their cooked stuff though. Service was normal."}
{"text":"Great lunch specials and AYCE. The food from the menu is less worth it IMO for dinner. As well the service can be a little inconsistent/indifferent."}
{"text":"I'm on the fence about Hokkaido. The most accurate way I can describe it is \"fine\". It's just fine. It's not mind-blowing, but it's decent quality.  DECOR: It's a nice and casual place, fits the Mount Pleasant & Eglinton standards. I also like that there is a patio. My only gripe would be that every time I've gone, the tables are sticky.  SERVICE: The staff are more attentive than they are friendly, but it's fine. They're knowledgeable about the items and have made good recommendations. Haven't done delivery, but take-out wasn't too long of a wait which my hungry self always appreciates.  PRICES: Very reasonable and on par with other sushi joints in the city. You'll likely spend $15 upwards depending on how many dishes you order or whether you do AYCE.   FOOD: I've only ordered sushi, but I'm definitely open to ordering some of the warm dishes like their don buri or noodle bowls as the weather gets cooler. The sushi is, again, fine - but it's inconsistent. Sometimes the rice is warm, fresh, and you can taste the rice vinegar (which i love). But other times it's sticky, dry, and sparse. Basically, when it's good it's good, and when it's bad it's just meh. I guess what keeps me coming back is how good the good is, and the variety on the AYCE menu. They are pretty generous on how much fish they'll stuff into the maki rolls and it's always fresh. The veggie rolls are pretty crisp too - it's really just the rice that's the letdown sometimes. I've seen other tables order the hot dishes and the portions looked pretty hefty, so that will be next.  OVERALL: The place is nice, it's convenient to where I live, and there is good variety. The rice is hit or miss, but the fish/veggies are fresh, and I've cleared my plate every time. I wouldn't recommend it for a party or special night out, but if you're jonesing for a sushi dinner that's easy on the wallet, go for it."}
{"text":"Hands down the worst sushi restaurant I have ever been too. To start the server told us they had gluten free soy sauce. Once we already ordered AYCE I asked for the gluten free soy sauce and she told me they don't have it. The food was not edible. Looking back I shouldn't have paid. I didn't even eat a roll it was awful! We paid and left."}
{"text":"I didn't find it to be anything special to be completely honest.  It would be nice for just ONCE to find a sushi place with only Japanese people working there and not other orientals who don't really know how to make sushi."}
{"text":"This place is okay for AYCE on the weekend. The sashimi was fresh and thick. They have this delicious white tuna that's drizzled with this light brown sauce on weekends only. I'm not sure what it is but it's the same sauce that they put on the beef tataki. We got a spider roll that was just alright. They have deep fried ice cream which I was happy about although the batter was a little thick and I would have preferred if they used tempura batter. Deep fried bananas were good. Don't get the beef skewer as it was dry and chewy. Other than that, my experience was okay. I mainly came here for convenience and left satisfied enough."}
{"text":"Your average neighbourhood sushi all-you-can-eat restaurant. Food came pretty fast, considering I came during the weekdays dinner where it's not busy at all. I recommend their sashimi and their special rolls. And maybe stay away with black pepper beef, it's super chewy and I just can't handle that."}
{"text":"Hokkaido Sushi used to be a lot faster, making it possible to have a good all-you-can-eat experience during a business lunch (or a high school lunch period). I speculate that there's been a management change and now things are taking longer to leave the sushi bar/kitchen, resulting in the restaurant possibly saving money from serving less food but also making lunch take way too long.  We found that the rolls were okay, but the rice was not sticky enough to hold together. The salmon rose we had kept toppling, our fell apart when lifted off the serving plate. The rice to fish ratio is good though.  The FREE underground parking (accessible from a garage door entrance on Mt. Pleasant) is very convenient and makes it a very accessible place to eat."}
{"text":"They have Decent prices, quick and efficient service. The Waitresses aren't the most friendliest but they are attentive and refilled our green teas and waters several times. Fresh sushi and sashimi. If I'm in the area again I will be back, the food wasn't bad for the price..."}
{"text":"This is one of the worst sushi places i have been to. Fish quality is rerrible,  its all stringy,  all the dishes are almost unedible,  rolls are dry and all the ingredients are garbage. Service is slow and bad. Soy sauce is weird. Overall this place should be closed down"}
{"text":"Went there a couple of times, but last time convinced me that the price wasn't worth it. We paid $50+tax for 2 on a Sunday night for AYCE. We ordered 3-4 types of rolls, yakitori, sashimi, shrimp tempura, etc. In the end, I was left with an impression that the ratio of quality of food to price is not that great. I was left with a feeling that some ingredients lacked freshness, while their rolls left me underwhelmed with how small they are. If I were to spend the same money in that neighbourhood, I'd rather go to Fin Izakaya or venture all the way to Ninki (133 Richmond West, Suite 101). You'd get a lesser quantity of food at both joints, but I'm sure it would be much taste better than Hokkaido."}
{"text":"I actually thought this place had quite good AYCE! I think it was around $15 at dinner time. The AYCE menu was extensive but I was gutted they didn't offer tuna sashimi (my favourite) on it.  I was really impressed with the rolls we ordered off the AYCE. A mango roll, dynamite roll and a california roll. They all came out BIG and nicely presented on individual plates, not at all like what I'm used to receiving for AYCE places.   I was with my giant 260lbs of muscle brother, so we got to sample a LOT of food. Everything was good! Service was fast and friendly, although we came early (530pm) so there were only a few other patrons.   Nothing special in the decor department, but it was clean and tidy with some basic Japanese decor."}
{"text":"The AYCE here is cheaper than at most other places but as always you get what you pay for. Most of the sashimi tasted fresh but some didn't. Nothing was buttery or high quality but nothing was terrible either. The special rolls weren't too good either. We got one with grilled salmon and avocado, and the salmon was kind of dry so it didn't work well. The Ocean Delight roll with crab meat on top was a mishmash of flavours but I'd say it was fine. They give you way too many pieces though so it's hard to try other rolls. The spicy salmon roll was good. I'm glad they didn't just put spicy sauce on top of a salmon roll like some cheaper sushi restaurants do. The hand rolls have way too much rice in them. The first seaweed salad I got was great, but then the second tasted fishy. The cooked food was mostly good minus the beef enoki roll which was pretty bad. The waitresses are highly disinterested and look sad but were very efficient. It has been a few days since I ate here and I don't feel sick so that's a plus.   Likes: Spicy salmon roll Beef tataki Chicken karaage Deep fried calamari Tempura Ice cream  Dislikes: Tempura Sashimi Special rolls Hand rolls Beef enoki roll Miso soup"}
{"text":"Pedestrian, but reliable. Everything's good, but nothing is memorable, at reasonable prices.  Service is spotty at best."}
