{"text":"BEWARE!!!! I had a table for a party of 14 booked with this place several weeks in advance. TWO DAYS prior to the event they called and told me they could no longer accommodate me!!! Their administrator failed to give me any reasonable explanation. They broke their commitment in the last minute and sent me scrambling for another venue. This is how much they value their customers, so please be careful!"}
{"text":"Fantastic! That's all I want to say about this restaurant. We celebrated my engageent here and at the end of night I realised it couldn't be better. I am a huge complainer but I couldn't find a single thing to complain about this place. Also I want to thank  the National Baquet Hall that canceled our reservation, otherwise we wouldn't be able to enjoy this restaurant's goodies:)) I am giving 10 stars."}
{"text":"Absolutely terrible service - we booked the restaurant two weeks in advance for a party happening two months after the booking. We called the owner and spoke to her personally TWICE on the phone where she confirmed that she has reserved a spot for our group of 20+ people and that all we need to do now is bring a deposit. We inquired whether the spot will be held until the deposit is brought later on that week and she confirmed that yes, the reservation was ours for the Saturday brunch.   We showed up with a deposit as discussed and agreed upon. At this point the owner told us that someone else's name is in the book. There is nothing she can do. The person who took our reservation wanted a dinner party that start at 3pm. Are you serious? Our brunch was meant to be from 12-5. You could have said sorry but dinner doesn't start until 6. Maybe even 7pm. Instead of completely ignoring our needs and accommodating someone who was obviously an acquaintance.  This ruined all of our plans and almost ruined my father's anniversary party. Shame on you and the way you do business. There are hundreds of restaurants like this in Toronto and we made the mistake of trying to go to this place. NEVER. AGAIN.   No accountability. She almost made it sound like it was our fault. We said but we called you twice to confirm that there was a spot for us and to make a reservation....to which she replied well someone else gave a deposit first. Way to go. Total lack of organisation skills, terrible and disappointing."}
