{"text":"Looking for some sort of disease, be it fungal, infectious, flesh eating? Then Hollywood On the Queensway should be your top destination!

I went to Hollywood On the Queensway in the summer of 2011 with two friends who had moved to Etobicoke, and we were looking at places to try, exploring the area, you know? The three of us like to drink, and as we were driving by, we saw this place. They had a huge banner saying \"RICKARD'S RED SERVED HERE\"; I enjoy Rickard's, so we decided to pull in and check it out.

From the outside, it looks identical to the inside; rundown, disgusting, on the verge of collapse. How this place manages to pass the health inspection every time is beyond me, but I'm confident it involves transactions dealing with sex, drugs, or lots of money.

The inside is... ugh, disgusting, terrible. I felt like I would contract something just by sitting in the booth we were seated at. Which, I should mention, took a few minutes; the place was deserted save for one couple, there were three ladies wandering around (plus one bartender), yet they chose to take their sweet time getting to us.

After being seated and waiting for ten minutes before we were even asked if we wanted a drink, I asked for a Rickards and water.

\"Oh, we don't serve Rickards here.\"
\"You have a huge banner advertising otherwise.\"
\"Yeah well it's old I guess, you want something else?\"

We ordered drinks, and they came... eventually. This is when she realized we had no menus. The menu? The menu! What a terrible menu. Typical bar food, as expected, but otherwise, nothing of any substance. I ordered a burger, and it was undercooked and plain. Supposedly comes with lettuce, onions and tomato, it came with no said toppings. I can't remember what my friends had ordered; one said her meal was decent, the other couldn't finish hers.

Another ten minutes or so we waited after asking for the bill... it finally came. With the drinks, it wound up being $40 and change, which is average for a bar.

What percentage of $40 is a five cent tip? Because the one and only nickel in my pocket is what I left.

AVOID. They have live music on weekends, but if the bands are anything like the staff, they're terrible to listen to.

AVOID. Go elsewhere. Nowhere else to go? Hit the nearby Wendy's or McDonald's; heavily processed, heart-attack inducing oil and fat is far superior to the regurgitated food this place serves.

AVOID. Just... avoid. Unless you're the health inspector."}
{"text":"From every pub game you could imagine (Including NTN) to live bands and kick ass, huge, super-crispy wings, this place is a lot of fun.

Although I haven't had anything but the wings here, I will definitely be back. I have been to all of the \"great\" wing places around Toronto (and I do mean ALL of them) and nothing compares to the \"Kevin's Hot\" wings at Hollywood. This hot sauce has an amazingly fruity habanero heat to it with a touch of cinnamon. They're seriously good (but they're also seriously spicy so be warned). If you're not a fan of the heat, go for the sweet chili wings. They're kick-butt too.

It's a shame, with the advent of \"specialty\" wing establishments, that good BAR wings are hard to find. (R.I.P The Office, The Prince Edward, Heads or Tails, etc..)

Thanks Hollywood, for keeping the tradition of really good BAR wings alive."}
{"text":"I just stopped in for a beer while my car was getting fixed at VW down the street.  had a couple of beers, no food. However, someone ordered wings and they smelled and looked awesome.  

This place looks like it rocks out on the weekends. Big dance floor, good size seating area, and it's got a large patio as well.  

I'll definitely go back to check out the food. I don't do the club thing anymore so can't see myself going there on a weekend. It's a relaxed bar, with a good selection of cold beer on tap. Winner in my books :)"}
{"text":"We were there tonight for a birthday party.  There were about 25 of us.

We ordered supper.  I had the Italian Stallion pizza.  It was a big pizza with lots of toppings.  I wasn't crazy about the crust, though.  I ate about half of it.

Gord orderd the Louisiana Style Baked Wings.  He said the wings could have been crispier and the spice was okay, not great.  The veggies were soggy but the onion rings rocked.

Our server took excellent care of us!"}
