{"text":"Save your tummy and your money. Don't even attempt to eat here. The food here is disgusting. I tried to eat but couldn't. And then when I told them the food was awfully they took $8 off my $65 bill for just my self my husband and our two young children. But that was only after they watched the video to see if in fact I had not eaten. Are you kidding me? Absolute ridiculously awful experience."}
{"text":"This place is VERY unfriendly and VERY unclean! Before you even enter the restaurant there is an old dirty wishing well that is really gross looking. It makes my stomach turn just thinking about it.  No one there must understand English at all. I told them my Pepsi tasted funky,possibly because their machine mixed it with too much water (but the soft drinks always tasted a bit 'off' there anyways) so I asked if I could just have a water instead. The waitress never returned! EVER!  The food tasted horrible everything is mushy and cold. I told my wife last time I'd never go there again since everytime I go there it's disgusting. I thought one more try,why not? Nope...I'm done FOREVER!!! To top it all off,our bill was $33!!!! WTF!!! All we had was two buffet and two rotten pepsi we didn't even drink. I guess if you eat at the specified lunch hours on certain days it's half price of that. But it's still a total rip-off if you ask me. No one there will ask you how is your meal or ask if you need anything else. Even when paying, the guy at the cash register just took my money and didn't ask any questions. I wish he did cause I had quite a few complaints. But either way,I AM NEVER GOING THERE EVER AGAIN!!! EVER!!! I guess the people who say this place is good must have never ate any place better than this. Do yourself a big favor and save your money and take you and your family to a nice restaurant. This place is super gross!!!!!!!"}
{"text":"Me and my family found a roach in the ice cream machine after my 2 year old brother ate some then the manager said they would take off 10-20% of the bill that's it terrible experience stay away"}
{"text":"This was my first experience. The workers were polite when seating us and we received our drinks quickly. The buffet had a few different kinds of pork and chicken along with some sushi, fruit, soups and more. The flavor of the food was nice, however, some of the items I chose were not fresh. The pot stickers were cold and the shrimp tempura was quite stale. When it came to dessert I was excited for the tapioca pudding along with some macaroons. The banana cream pie would of been better if the bananas were not brown. Overall this place could be nice if the food was freshly prepared. As far as employees, two of my friends had to ask for a water refill and the girl at one point stood at a table booth with her head down. Also I noticed while grabbing desert, a chef behind the sushi counter was staring at me uncomfortably..."}
{"text":"Great price for Chinese buffet food! All the people working there are super nice. Especially the cute Asian boy who works at the front desk. He does not only do his daily chores, but also take care of his customers. Such as chit chat with some elder citizens.  The lunch is only $6.99! I was so regret that I didn't know about this place sooner, I have ate tons of burgers for lunch. However, Hong kong king buffet has vegetables, meat and seafood for the same price. I heard from friends that dinner has baby lobster and  crab legs, I will definitely go and try it out soon!"}
{"text":"The food is always good and fresh.  My husband loves the sushi and variety of seafood available.  I get a little disappointed that all the meat dishes are deep fried and covered in syrup."}
{"text":"So-so, it seemed to have a good selection, but we ended up only eating the soup and 1 or 2 other things.  ... there are SO many better places to go in Parma...just Yelp.. Hey, go to Gus's.  (I visited last Aug, 2013, just cleaning up my draft reviews, I reckon I had hoped to ad photos)."}
{"text":"It's mostly what you'd expect from a buffet. The food is greasy and lacking in flavor. But there's a lot of it. Too bad there aren't more vegetarian options. I was mostly just able to have string beans, rice and noodles, plus dessert. Not worth $13.99."}
{"text":"Horrible tasting food...vest thing there was was the white rice....the only thing you can't mess up. Sushi that sucks and everything else was just disgusting!"}
{"text":"I must preface this review with a simple statement: I'm not a fan of buffets. There's just something about them that tends to turn my stomach. The dried out food, all those people rifling through the chafing dishes, dirty kids, it just doesn't normally translate into a good dining experience.  But this place, this unassuming place, it managed to play fast and loose with (some of) the rules. Here's the $13.99 rundown.  Hong Kong King Buffet. Where to begin. It was Christmas and we knew our options were limited. Chinese just felt right. The bright red letters, still managing to glow brightly amidst the washed out parking lot lights, looked imposing. The \"G\" was burnt out. Hon Kong King Buffet. The concrete lions guarding the entrance. The empty fountain in the foyer with dirt-encrusted coins lining the bottom. Empty probably because the fish that typically inhabit it wouldn't appreciate the Cleveland winter. Enter here but don't walk straight in - that's the exit. Turn left then right. That's it. No smiley forced greeting. It's a heavily accented \"Merry Christmas\" a grab of the menus and a short trip to the booth.  The large, open dining room is filled with tables, chairs, booths and efficiency of space is the key. There's not a wasted inch. A massive chandelier hangs as the centerpiece guiding you toward the dizzying array of culinary stereotypes that await you. There's not a single Chinese take-out menu item that hasn't been represented here. Row upon row, protected by sneeze guards, brightly lit. It's a Chinese food greatest hits album. Here's a sampling:  General Tso's chicken Sweet and sour chicken Chicken and broccoli Pot stickers Crab Rangoon Sesame chicken Fried chicken wings Spare ribs Beef and broccoli Chinese donuts Pork egg rolls Chicken on a stick White rice Vegetable fried rice  The list goes on from there. If you like to play fast and loose with your gastrointestinal tract there's also a mélange of seafood options with everything from clams to lobster claws and, dare I even mention it, sushi. Brightly colored cubes of white and pink fish, tightly packed rice enrobed in salmon and cod basking in the light of their display like raw fish jewelry. I didn't take a chance on them.  The beer options are like the freedoms afforded the Chinese people in their homeland - limited. Don't worry, there is the ubiquitous Tsing Tao (pronounce it ching-dow if you want to impress your waitress) and the usual light, fizzy yellow macros. They even have wine if you want to kick your buffet experience up a notch.  Finish your dinner (two plate limit on seafood, please) there's a dessert bar, too. It starts, strangely enough, with multi-colored shrimp chips and then hits its stride. Cream puffs, chocolate chip cookies, finger food versions of chocolate, carrot and angel food cake, and sticky coconut macaroons. They are dry, of course, but worth a nibble if for nothing else but to round out your experience.  The food was predictable and, for the most part, tasty. It's exactly what you'd get from most of the Chinese take-out places around the city so there are no surprises. The service is quick, professional and curt. Your empty plates will be cleared nearly as fast as you can say won ton and your waters will never be empty. The meal finishes with fortune cookies and the check. As you're leaving be sure to say hello to the koi swimming around in the big tank next to the claw machine. They'll appreciate the attention.  Hong Kong King Buffet, for what it's worth, you will be forever part of one of our Christmas memories."}
{"text":"A smaller food selection than other Chinese buffets, but everything I desired was there and tasted good. Friendly service. $13.99 for dinner (excluding drink)."}
{"text":"Filthy, Dirty, Rotten is all I can say. This place is disgusting. The food is greasy and the staff was annoying. I would take two sips of my drink and the server would come up and say \" You wan refill?\" Please they could at least teach the staff to speak english properly. The sushi is very bad and fishy, I wouldn't even think about touching the raw oysters they put out. I pass the place on the way to work every day and every morning you see a large van pull up and drop a load of Chinese people off to work, very shady."}
{"text":"It's a great restaurant. Servers there can be friendly when they want to. The food is sometimes great, and who doesn't like all you can eat chinese all you can eat orange chicken. Low price as well I believe last time it was 13.99, a person."}
{"text":"Just Horrible People, they act like they're better than everyone, and have horrible customer service it took them 10 minutes to give a simple refill."}
{"text":"Returned yesterday. Nibbled at everything, had a couple of pieces of mystery sausage as they have some this time. Happy they have a couple of mini cupcakes for me to try, lo mein is what I eat here and just tried to pick at what I could. I think the best bet is the calamari.  It's a lovely place for those who love chinese and fried food but I don't think Chinese food served this way is my thing. An occasional visit sure but too often nada. Super cool choice for winter though :)"}
{"text":"Good food. I don't like how it's kinda dark in there for a buffet place , and they need to change out all the ripped up booths , it makes the place dirty and nasty . Today, while I was getting lo mien, I was shocked to find a piece of hair sticking up in the lo mien as I was putting it on my plate, but that's ok, I didn't complain about it , just asked the waitress nicely to take the plate from me that's all . I'll be back again for the great food"}
{"text":"I've only eaten here once, so I'm no Hong Kong King Buffet aficianado.  However, the food was very good.  Since I'm a huge fan of Double Dragon Buffet, which is just down Pearl Rd in Parma Heights, I must draw a comparison between these two fine Asian establishments.  First, I want to say thank you to the owners who offer me choice and variety in my dining routines in what used to be the most boring area to live in terms of food - good old Parma, Ohio.  You want Polish?  Parma's got it!  Granted, both of these buffets are just across the border - Double Dragon being in Parma Heights and Hong Kong being in Brooklyn next to Lowe's.  The food is traditional American-Chinese and very solid at Hong Kong Buffet, but the seating arrangements are like a typical restaurant and not that of a 'get the hell out of my way, I want food now' buffet.  Hong Kong got this wrong, they're sort of limited on space.  Double Dragon got this right, there is tons of room and you don't feel crowded.  Plus, Double Dragon's food is a trifle better, imo.    Anyway, I do recommend this place.  Eat up.  No website."}
{"text":"First time here. This place was recommended by friends and family. It was my birthday so we came here with the kids. Kids love buffets! We all agreed that it was one of the best buffets we have been to. Very large selection. The buffet was out of crab legs when we were there though. I wish they offered the crab legs separately. I've been to buffets were the crab legs were sold by the pound separately from the buffet. Everything else was really good."}
