{"text":"Lovely coffee shop. Just what we needed in this spot on Queen. Nice people, great treats, excellent third wave coffee. Sparking and still water offered on the cream and sugar bar. Also a great people-watching window facing Queen.   They have plans for a little patio out back. No wifi though."}
{"text":"Good coffee. Great atmosphere and very friendly servers.   Nice vibe to the place. I'm picky about my coffee so I'd say they are solid."}
{"text":"Fantastic drip coffee. Medium roasted, just the right amount of acidity, lots of body and flavour!  Also egg toast was delicious!  Great spot with friendly people!"}
{"text":"This is a coffee shop that is a cut above the rest . A place where the great staff welcome you by name , a place  you take the time to appreciate how seriously they craft  a cup of\" joe\" . Forget about the incredible custom built water filtration system , the house baked bread , sandwiches and breakfast Tartines by co owner  Momi , the best Macha , the  Iced coffee Popsicles ( I would easily pay twice as much for ) . The sweets and treats From some of the best bakers and confectionary's in town and of course the amazing oasis of the  4 season patio out back .  But what truly sets them apart from the typical high end coffee shops is their WIFI !! . Partner and Bon Vivant owner Jimson took me on a tour of the basement tech centre , a lead lined and tesla RF shielded room that housed the Internet conditioning unit and high powered pulse tuned wifi router !! Jimson casually said as he leaned on this massive blinking LED conditioner  \"  Even the CIA or NSA don't have this up to date technology \" he went on to  explain  \"Brad , we take  a Bell fiber feed to  the conditioner this then  strips out corrupted packets from the Internet , then purifies and reconstructs the Internet data packets  from  an asynchronous dithered signal to a fully synchronous and higher bit rate broadband data stream \" \"Wow \" was all I could say , trying not to spill my incredible single sourced plantation  coffee in amazement !  Jimson then gingerly stepped over a shielded solid copper cable  as thick as a tree that was plugged into the  wireless router , as we approached  it he took off his signature black wool cap and handed me  a specially designed helmet to protect us from the high strength wireless signal    \" This Baby takes that signal and transmits it via a tuned dipole antenna to our guests \"  , he said shouting over the powerful hum of the router , We had at that point spent precisely the safe amount  of time allowed in the transmitter room and went back to the upstairs shop .   Slightly stunned by the experience and now fortified with an excellent Iced Macha I marvelled at how everyone around me took for granted using the WIFI ,looking at Cat pictures or posting selfies of themselves  and their  coffee . It's unbelievable the extent that these brilliant Mavericks of coffee at Hot Black Coffee take to insure nothing but the best for their customers . I now know where I will order a small drip coffee  and then spend the next 4 hours on my laptop ...."}
{"text":"Amazing coffee! I'd say some of the best coffee in Toronto, alongside Quantum. The bearded barista in the afternoons makes excellent lattes, cute too :-p"}
{"text":"Such a great coffee spot. Excellent service, friendly staff, beautiful modern design - and there's a lovely private patio out back :) I've become a regular here - really hoping it stays around for the long haul!"}
{"text":"Best coffee house around our hotel. Great coffee and food and staff is very accommodating and friendly. Highly recommended."}
{"text":"The staff at this shop are super friendly and extremely knowledgeable about coffee.  I always get a friendly greeting when I arrive and a goodbye as I'm walking out the door.    The drinks they produce are excellent, the beans and techniques are always right on.  The baked goods I've tried have been great as well.  Hot Black is highly recommended if you want a perfectly made coffee without the \"attitude\" you get in a lot of downtown coffee shops."}
{"text":"Today was my first visit to this great coffee shop. The staff is the friendliest and the shop is very unique. They have a great selection of non dairy milk choices and they also carry gluten and vegan treats. The coffee cups are very cool and the red lids are a great touch!  Yummy coffee and delicious goodies.  I will most definitely be making a return visits!"}
{"text":"This coffee shop is a little oasis on Queen west! The staff is friendly and very quick to answer any questions you have about the menu and where their coffee beans are sourced from. I ordered the Cortado and the gluten free coconut chocolate macaroon. Both of which were delicious! They have the cutest little patio at the back of the shop that gave you a quick escape from busy Queen street. I am looking forward to my next visit here!"}
{"text":"I don't usually go to coffee shops that don't have wifi, but this was an exception. The place I wanted to go to was unexpectedly closed and Hot Black Coffee had good reviews and was nearby so I gave it a shot.  Outside there was a sign claiming their coffee was the Best. Ever. I walked in and fell in love with the black, white, and red decor. I was served immediately and in a friendly manner. I got a latte ($4)as usual, and splurged on a ginger molasses cookie ($2.5). I'm glad I did, because it was absolutely delicious. The coffee was pretty good, nothing to complain about.  I noticed they had more seats at the back and a nice looking patio for more seating. I'm surprised they get so much business with no wifi. After all, with café pricing you're also paying for the Internet connection. I wonder what their reason is. All in all, since I didn't need WiFi I was satisfied. But it will be a while until I return, because I usually need somewhere to do work. So if you just want to relax, especially with a friend, it's a very nice place. But don't come here to get work done."}
{"text":"Hidden gem of a patio alert!  This place is a lovely spot for your daily dose of caffeine! It has a great simple menu and wonderfully strong coffee. I stopped by for a coffee and egg toast. It was delicious. The food they have is really appetizing and I found the staff to be extremely courteous and kind. I would definitely recommend this cafe if you are doing a quick afternoon meeting or just want a lovely place to stop and chat along Queen St West!   The only downside is that there is no wifi here. I suspect it prevents people from lingering too long but the atmosphere is lovely to enjoy nonetheless."}
{"text":"I had not been 5 star coffee shop for a while, but today I did. I really liked HotBlack Coffee. Menus are wonderful. I can find many coffees or teas I can not find in any other coffee shops. I ordered coffee jelly late and it was so good. Their prices are not expensive at all. It is worth of taking subway and going to Queen street W to get a cup of coffee at HotBlack cofee."}
{"text":"This place is great. Nice baristas, light friendly atmosphere, and an espresso with the world's biggest crema."}
{"text":"One of my fav cafes. I travel for a living and work in the coffee industry. As a former cafe owner I am only sliiiiightly jealous of how great the ambiance/menu/staff are. Shops like this make living on the worth a little more bearable :)"}
{"text":"No WiFi. Let's be real. You only read cafe reviews to know this critical fact. The coffee is average. The service is cheery. Free sparkling water to make you feel fancy."}
{"text":"Amazing! Food is delish, loads of GF options and they sell my favourite DETOUR espresso YUMMY super friendly service and a cute backyard patio with eclectic picnic table centrepieces and cosy feel"}
{"text":"Loved this place and the vibe! I got the green eye iced coffee, which is a mint infused coffee. There was a lot of seating and had a lovely outdoor sitting area. They have dairy free alternatives, baked goods, food and coffee popsicles (did not get to try, but looked amazing)! Definitely a place to go while shopping on Queens St."}
{"text":"HotBlack is one of those places that seems to do everything well - great coffee, even better service and awesome food/treats. The owners clearly care a lot about their customers and it shows every time.   My go-to here is their vanilla latte (iced or hot depending on the season) and it's always on point. It's a little on the expensive side but you get what you pay for, and the quality and attention to detail really shows.   Bonus points for the heated outdoor patio and mulled wine during winter.  My one wish is that they would bring back the sugar cookies - so good and sorely missed!"}
{"text":"Mr. H and I weren't ready to go home after our movie night and stepped in for a cup of joe. I right away loved the ambience of this place!  I placed my order and was told the patio was open (excuse me! It's like freezing outside?? Why would I go sit in a patio?) and that the fire pit was still open (Oh! That's why... ). Well hello patio with a fire pit AND BLANKETS!!! Dream come true, I just wished I had ordered a hot chocolate instead of a cappuccino! At least I had the delicious brownie going for me, and I don't mean Mr. H ;)  Must come back! Must have hot chocolate! Must see fire pit again!"}
{"text":"I walk by here all the time and always wanted to try it. To my surprise, there is a very cute nice outdoor patio at the back with plugs! Though there is no wifi, still a very good coffee shop to do work if u can hotspot from your phone. I tried their ginger infused coffee which was surprisingly good. Will come back!"}
{"text":"Really good coffee and treats.. amazing patio at the back.. the only problem it's too small.. and you have to share the table most likely on a busy day.."}
{"text":"Excellent coffee and free sparkling water. Great place to spend some low tech time ( no WiFi so the opportunity to read a book, chat or journal with pen and paper is a highlight)."}
{"text":"I tried the americano and a chocolate beet muffin to stay.  The americano was decent - above average and not bitter - but lacking visible crema.  It is served in a blown double walled glass cup, which had I not been told, I would have assumed was plastic, given that it doesn't transfer heat. The chocolate beet muffin was moist, airy, and not too sweet.  I was enjoying it until I bit into something that tasted chalky and peppery - it was very unexpected and off putting and I had to conceal me spitting it into a napkin while in the restaurant, wondering what I may have ingested.  I hope this was an anomaly but it definitely threw off my first experience."}
{"text":"Great espresso and cold brew, fun atmosphere with outdoor seating, and an accessible and safety-minded bathroom. I also had some sweets which were great and the staff here were really helpful. Probably my favorite all around coffee shop in Toronto."}
{"text":"Great coffee shop located on Queen Street (near University avenue).  Ambiance is nice and service is friendly. The coffee is very good and the cafe's new backyard patio is a great addition.  Hanging around in the patio allows you to really enjoy your coffee without the noise of Queen Street. In the winter, they even have blankets and a bonfire which was fantastic."}
{"text":"Pro: Cool atmosphere, nice patio and free seltzer  Cons: went there 2 times for espresso but they are badly under extracted sink shots."}
{"text":"Cozy coffee shop. They also have a patio in the back. The lit a campfire in the patio back in winter. The coffee is also good. I like the cups and mugs they used for serving. It was hard to get a seat when we went there because it was so crowded."}
{"text":"Amazing place! I only recently discovered this coffee shop and I'm so glad I did! There aren't many cafes like this in Toronto. This one is very clean, the coffee is amazing quality, the pastries are fresh, and the presentation of the coffee is also very nice as they are served in unique coffee glasses. It's a pretty quiet cafe, so it's a nice place to sit and enjoy a cup of coffee; as well as people watch through the CLEAN, large window.  There is also a nice little patio in the back, which they have decorated very nicely and tastefully.  Thanks to the management for keeping this place so clean and enjoyable for their customers. Highly recommend this place!!!"}
{"text":"I came here many times with my husband.  I think my husband came here more than me though.  It takes only 5 minutes for him to walk from his workplace.     Coffee was good.  Snacks were yummy.  Service was excellent.  If I have to rate what is the best for Hot Black Coffee, I will rate 5 stars for their service!  Every time I came here, I experienced only the best service.  I could say they do care about their customers.  End of the story! ^^"}
{"text":"Very nice atmosphere to go and have a coffee. Service is very friendly and pretty fast considering how busy it usually is. They have a variety of snacks and treats to compliment your coffee. Coffee is a little steep in price but they offer a discount for people who bring their own travel mug which is a nice touch. Nice seating area by the window and nice crowd."}
{"text":"Chai tea latte was just ok, basically a chai tea bag that floats in some Almond Breeze brand milk. The real star was the fruit and nut cookie bar. I'd go back but it wasn't amazing (for non coffee drink)."}
{"text":"Great coffee place what is confirmed by many magazines like New York Times and more. People working there are very nice and professional.  My bf got coffee and said it was very good. As I'm not a coffee drinker I got BLUE tea! It was good and very fun to drink. Extra star goes for a decor not only inside is very nice but they have backyard. Unfortunately was raining so we couldn't enjoy our beverages there but you definitely should."}
{"text":"This stretch of Queen W (what I think of as the Eaton Centre mall extension) needed a good coffee shop. HBC checks off a bunch of important boxes:  +phenomenal service +great coffee (Detour) +well priced baked goods +cute design & name  Rejoice!"}
{"text":"Excellent quality coffee with nice strong flavor, nice atmosphere and a cool patio. The food menu looked very appetizing too, something to try on my next visit. A hidden gem on Queen street."}
{"text":"Good coffee, EXCELLENT muffins, nice interior and friendly staff make this one of my favourite coffee shops in the city! The 5 star rating is withheld as I wish their price for tea wasn't so exorbitant (!) and as their sweet array of baked goods could be amped up by offering something cake-based as well."}
{"text":"Came here on a Tuesday afternoon with a friend and the line was very minimal and the service was great! I had asked for a recommendation, and the barista was considerate of the criteria I wanted.  I ended up ordering the Mint Chocolate Latte ($5.50), which was quite good. It wasn't overly sweet and I appreciated that. The guy who made my order was quick but also took care to putting a design on my drink.  Their menu was large, and I'd be excited to come back to try their affogato!!"}
{"text":"Nice and friendly local coffee in the area. The staff is very attentive and welcoming. The selection of beverages and eats are delectable! Something for everyone, not just coffee ;)"}
{"text":"Amazing brewed coffee from Detour in Dundas, ON. Great back patio, very clean, friendly staff."}
{"text":"I pass this place everyday on my way to work and always see the sign outside advertising their outdoor patio, so I thought i'd drop in and try it out. It's very small but has a great vibe! I ordered a chocolate chip cookie and the sun chai latté (because it sounded interesting). When the barista served me my latté, she asked if i've ever had it before and she found out it was my first time there. She gave me a quick run down of the ingredients in the latté (it includes espresso and turmeric to name a few!) and when the other staff overheard it was my first time, they all gave me a warm welcome! I will definitely go back. Their menu looks interesting and there's a few more things I want to try. It's a nice little spot to grab a coffee before work on days when the TTC actually runs smoothly and I have some time to kill before work! Highly recommend!"}
{"text":"Popped in here to try and energize myself for an hour-long TTC ride home and my non-expectations were blown away. I really just picked this place at random for a quick bite and drink and ended up getting a meat sandwich (smoked meat with tomatoes), a walnut butter square, and an iced tea (some kind of Earl Grey with apricot preserves).  About the venue: I was a little confused by the space, especially the bar of sandwiches in front. They're not self-serve although they look like they might be. The seating looked to be mostly stools but they have a patio in the back with 2-3 picnic tables and a fire pit.  About the comestibles: They were amazing. The butter square was nicely chewy and sweet and the walnuts were well-integrated. The smoked meat was very simple - literally bread, meat, and tomato - but so well composed and almost elegantly done. The tea, recommended to me by a friendly staff member, was the star - a little sweetened, very fresh, very flavorful. Not weak in flavor but mellow.  I would definitely come back if I was in the area. As everyone mentioned, they have punch cards."}
{"text":"Hot Black is open! After all that looking through the window, here it is...  Hotblack aims for nothing less than *perfect* coffee an tea. This starts with a high-tech reverse osmosis system that the owner proudly showed me downstairs. This system feeds not only the espresso machine upstairs, but also a 70C tap for tea (100C is too hot for green tea, he explained), and a cold carbonated tap for water (kindof like a soda stream, but better).  The espresso machine is a Marzocco \"beta\" system that has a digitally controlled pressure profile. Manager Momiji Kishi and her dedicated staff are still dial-ing in these many variables, so I'm excited to see how things develop. There are four grinders ready to go, so coffee connaisseurs will have fun with a rotating selection of beans."}
{"text":"Great coffee and friendly service. There is no wifi though for those who like to spend their coffee time online."}
{"text":"I've gotta say, I have tasted better coffee. This wasn't the best coffee I have had, it didn't blow me out of the water, but it was the best service I have received and best environment of any coffee shop I have ever been in. Everyone was genuinely friendly and helpful, which can be a rare commodity in a busy, bustling, (sometimes snobby) city. They have a beautiful set up where you can fix your coffee, complete with silver pitchers for the milk and cream, brown sugar, and a water station with spouts and glasses. Not a trace of paper waste or sugar packets. Wish all coffee shops were like this one. I'll try another roast next time; the one I had was just O.K."}
{"text":"Very nice people behind the counter. Excellent service and great coffee. I am part of a wine club that is in the area and the #WineAngels told me about this place. Excellent place to go if you are in area and want to support small businesses and get a great cup of Joe!"}
{"text":"Their espresso tastes really smooth and I love their cups - awesome aesthetics. They have a really cute hidden patio at the back of the cafe. They also sell fabulous Greek yogurt parfaits - has no added sugars and is really healthy, but doesn't taste like it!  however, on the pricier side."}
{"text":"Good coffee & sweets, friendly staff and reasonable pricing. Check out the patio in the back!"}
{"text":"Very cute cafe with an even cuter patio. This place is conveniently located on Queen W. and has a good selection of biscotti. All great reasons to pop in and check it out."}
{"text":"They are pretty nice. Nice interior, friendly staffs and high quality menu. However, they don't have wifi.. :("}
{"text":"Pretty busy, service moved quickly.  Flat white is excellent.  Great location on queen st w.  Biscotti also good and nice snack size pieces."}
{"text":"First place off the subway and I needed coffee. Glad I stopped in. Very friendly service, cool light fixtures and great coffee. Had an iced Americano and a cappuccino, both were supreme."}
{"text":"Family owned I believe, great coffee, cold brew and iced latte. Best I've had in toronto. Very cute coffee shop with a cute back porch with fake grass and coffee tables Huge array of little treats that looked very delicious but we were both too full from brunch to try any. Offered to pack our iced coffee in a to go cup which was very sweet. Plan to come again soon!"}
{"text":"I usually don't drink cappuccino but got recommended to try it. Was really good. Also the fireplace is awesome. Can't really work here plus they have no wifi."}
{"text":"Fantastic coffee that lives up to their \"Best. Coffee. Ever.\" street-side sandwich board. Super earnest, friendly service. Consistently good coffee. Sure it costs a little more than the Starbucks across the street but the friendly vibe and the fact that baristas actually seem to care goes a long, long way with this guy. Don't forget to get a loyalty card because you *will* return."}
{"text":"Favourite recommendations:  Latte ($3.80 aftertax): It was delicious where the ratio of coffee, milk, and crema are all at optimal consistencies. You know it's a good coffee when there's an absence of sour (under extraction) or bitter (over extraction) aftertaste where only hints of sweetness from the a higher lactose milk steamed at the right temperature. They get their beans from Detour Coffee Roasters located in Burlington.   Besides the pretty overhanging lights, there was also a quaint patio in the back with picnic tables and cute biosphere plants sitting on top. Lovely spot to sit and chat during warm weather.  Note that this café does not offer free wifi. Although customers often complain about the lack of free wifi, one must remember they're a prime real estate. The café wants people in and out as quickly as possible, and it makes sense from a business perspective; I don't blame them."}
{"text":"Very friendly staff, awesome espresso and gluten free treats  Love the back private patio!"}
{"text":"Cute spot on King St! I went while visiting Toronto for a work summit. The service was fantastic :). I asked for a recommendation on muffins (and they recommended me the beet chocolate vegan muffin - which was very rich but also a perfect combo with coffee) and I tried the coffee jelly latte (substituted normal milk for almond milk). The coffee was interesting as I've never tried anything gelatin based. I wish there was more coffee to it than ice (and that they had told me it would be iced coffee as I just ordered the coffee without much thought).  The space isn't very big but I'd say it's a cute spot to hang out or grab munchies and drinks before going off to wherever you're going!"}
{"text":"My favourite coffee shop to visit in the morning before work. Not only is the coffee excellent, but seriously recommend their baked goods as well. Personal favourites are the brownie and banana chocolate muffin... also a fan of the loyalty program for regulars.. 9 drink orders = 10th free."}
{"text":"Solid independent cafe amidst the sea of chain cafes in the area (Starbucks, Second Cup...). It's a little small and crammed inside. There's a communal table and a very narrow ledge with stools at the front, and a ledge at the back (for standing). But in the summer, the back patio is a great little spot to take a break. In the winter though, because the space is so small, beware the constant chill of cold air blowing in from the door. They put a curtain there as a barrier, which helps but doesn't totally block that Canadian winter...   I like their espresso based drinks and they have lots of options for other kinds of specialty coffee drinks or tea lattes. If you want something cold to go, they have Village Juicery juices. They make their own bread! It's great. The baked goods look nice too although I've never tried them. Service is efficient and friendly. They have a loyalty stamp card.   I would say this is a good place to grab a coffee if you need a quick break. But I wouldn't come here for an extended time (e.g. to do work/read, or a long catch up with someone) because the limited seating and high foot traffic makes me guilty if I stay too long."}
{"text":"Great coffee and egg on toast! I stopped by for a quick bite and wasn't disappointed. I'll be coming by again to try their sweets!"}
{"text":"stumbled upon this gem by accident. My hotel & office is next door. I was looking for a coffee and came across Hot Black. Absolutely awesome coffee, best macaroon I've had in a long time. The staff was super friendly. If you're having a dark day and need to cheer up, this is the place to be. I loved the interior."}
{"text":"Hot Black Coffee claims to have the best coffee in the city.. While I can't say for sure if that is true - I can definitely get behind the  idea that they have one of the most flavorful americanos I have ever had. They also have a good variety of baked goods, and fresh pressed juices. I highly recommend stoping in if you haven't already. Their staff are very welcoming and knowledgable. They have a decent amount of seating, mostly bar-style, and one communal table. In the summer they have a nice patio that manages to get some sunshine amongst the buildings. If you think you will be back, don't forget to pick up their punch card!!"}
{"text":"Cool vibe and decent coffee. Just under ~$3 bought me a decently sized medium drip coffee - it was rich and strong, the perfect start to my morning."}
{"text":"They have an accessible entrance and bathroom, although all the tables are at bar height. They will also allow service dogs and seem really friendly.  The coffee is great and it's clear that the owner is very attentive to quality and detail.  No Wi-Fi."}
{"text":"Nice cafe with coffee and drinks in bold flavor. Their hot chocolate was not the sweet ones you drink at bucks or second cup, so keep that in mind.nice place to go if you are around queen west and wanting cup of coffee. I personally like sweets and mild  so wasn't the best for me. Very friendly staff!"}
{"text":"This is one of my favourite coffee shops in Toronto. Convenient if you're shopping on Queen West or during a lunch hour walk. Coffee quality is excellent and the pastries are much better than you find at other shops. There's a central common table and counter seating in the window area and at the back. Staff is friendly and they get your order ready quickly. I go out of my way to have coffee here and I'm never disappointed."}
{"text":"Yuminess galore---very unique items on the menu such as the Russian tea which they sweeten with a house made jam---interesting concept tastes milky, tangy, and citrusy all in one like a Russian ;-P they also have the cutest little baguettes with a sunny side up egg, petite, tasty, hits the spot. Simple, cozy, delicious, just how food should be!"}
{"text":"Update: passive aggressive owners too! Lovely.   I'm a barista who has been working at indie shops for a long time and I work at one now: I don't think my review was \"trashing\" in any regard, and it seems odd to me to receive such a defensive response when I simply stated that I felt we didn't have a good experience and gave a real and concrete reason why. It's not trying to be different, honestly, it comes across as unwelcoming to someone who might want to sit awhile and continue to spend money at your business.  I was honest, and I don't think it's out of line to give an honest review on a platform specifically designed for doing so, especially since two people behind us also didn't notice your oh-so-clearly marked sign. Maybe a sign by the cash would be easier to spot?"}
{"text":"WHAT AN AMAZING FIND!!!! I randomly came into this independent coffee shop because I had to use the washroom, and was pleasantly surprised to stumble on a hidden gem! Not only does this place have the most lovely staff but their products are so different and yummy!!! This is what a real coffee shop is all about - small and quaint with great ingredients used. Their fresh breads are out of this world and a lovely side with any of their creative bevies. The cherry on the top is the fire pit in the back to roast smores!!! They have lovely flannel blankets to snuggle up with if you want as well - this is my new home away from home right in the heart of dt!! Great find!"}
{"text":"The owners are amazing. Literally best egg and cheese on homemade toast I've ever had and I weigh 263 lbs so I know what I'm talking about .... they told me one day they'd give me a free coffee because I came in w a Starbucks cup. It worked. I'm hooked best patio on Queen too"}
{"text":"I was saddened to hear there is no customer wifi. I am traveling from out of town and needed wifi for directions around the city.  I do not recommend visitors come here if they are in similar situations like me. Canada roaming costs are quite expensive. There is a starbucks across the street that has wifi."}
{"text":"Not many reviews on this place but there should be! We dropped by on a hot day. We had the iced latte and it was excellent: creamy, perfect coffee flavor with no bitterness. My husband had the nuts and seeds cookie which was good, I had a gluten-free date square that was to die for...really rich and not at all sweet. Lots of yummy gluten-free options. Perfect! Service is great, friendly but not pushy. The smell in the place was delicious. I am a self professed coffee snob and this place is GOOD. Don't miss it!"}
{"text":"Hot Black Coffee is a cute cafe located near Queen and University. It has a very simple and clean interior with a back patio that is perfect for the warmer weather. There aren't too many seats on the inside (enough for 10 people at most), but plenty in the back patio if you want to gather three or four friends to hang out with.  I didn't end up buying a drink because I was pretty caffeinated the day I dropped by. I saw the coffee popsicle on the menu and thought that was pretty neat. It was warm the day I went so the popsicle was perfect to cool down with. I love how Hot Black Coffee is situated in the midst of a busy fashion and food district. It serves as a sweet escape for those who want to unwind and get away from the city noise."}
{"text":"3.5 stars ... willing to come back to try another time  Not many places are open past 5 pm so when I spotted HotBlack open till 7 pm... AMAZING.  It's hard to find coffee in Toronto that isn't a corporate bland cup later in the evening.  This cafe is quite small and busy ... there's very little spots for anyone to sit down longer than a few moments.  It is SQUISHY tight as most seating is back to back bar stool style (and I mean back to back... it's literally 3 inches from the person behind you).  This place had a lot of drinks to try .. menu is different and quite innovative.   The staff here is super friendly and very patient.  My thanks to them and I really loved how they went to the customers who had a hard time walking (crutches) instead of making them wait in line standing.  Just all around great people.    I would say the staff and vibe here is hipster cool and friendly without any pretentious vibe.  With so many choices, I went with their recommendation of the Russian tea and a Chai Latte.  They also have a lot of assortments of baked goods, bottled smoothies, and also sandwiches so it is more of a true cafe than just a drink spot.  Russian Tea - Earl grey infused with apricots... like actual real fruit.  This was a great tea and it had the nice sweet tangy flavour of the fruit with a touch of light black tea.  Overall really great to enjoy when it's so cold outside.  4/5  Chai Latte with almond milk - They had the tea leaves steeping for a while and then we let it steep for more and .... it still tasted like watery almond milk with a hint of ginger.  Not the best to say the least.  3/5  I would definitely come back because the service here was just all around great and would try an espresso drink. I'll stay away from the teas... they're just alright."}
{"text":"I've been here twice - amazing service both times. I tried a delicious jam cookie and of course, a steaming cup of hot black coffee!   The environment is very trendy, I feel cooler just by sitting in here. The coffee is solid (not the best I've had in the city, but definitely up there!) and the treats are delightful.  The only thing that I personally don't like is how crowded this place gets. That is absolutely not at the fault of the venue itself, but rather the popularity/hype is too great for the space itself! I get very claustrophobic in here and due to that, it isn't my go-to coffee spot in the neighbourhood."}
{"text":"Very small and narrow. Not a whole lot of seating, and no wifi. The lack of wifi makes sense because the seating is so limited, you don't actually want people buying a cup of coffee and hogging a seat for hours on end when there aren't many to go around. They do have a little patio in the back that they open up in the warmer months. Coffee here is pretty good. I'd recommend the Cortado."}
{"text":"Nifty hipster café on Queen St East. This place opened recently in this neighbourhood and has been getting rave reviews. I could see why on my first visit. The espresso is potent and they even have an espresso flight (sampling the three types of espresso they make in house). I came in the evening so the place so quiet and getting a place in the patio was not an issue. Even at this relatively not-so-busy hour, I saw people in all four of its communal tables in the patio. I needed a quick and short pick me up but didn't want to expose my palate to too much bitterness this late in the day. So I got my cortado brèved and it was exactly as I expected it to be (woke me up for sure without taking up too much of my stomach space). Ma got the affogato, which they make with vanilla ice cream made in-house. This ice cream was exceptionally sweet which perfectly paired with the double espresso shot it came with. All in all, amazing caffeine experience. Will come back for the brewed drip coffee for my afternoon fix next time (rather than going for my usual Pike Place roast from Starbucks)."}
{"text":"Sign said best coffee ever. Got a small drip coffee and it was not that. Bitter. Very cute interior, though. Maybe the espresso drinks are better."}
{"text":"Love the back patio at HotBlack Coffee. It just feels like an oasis and hidden secret place in the hood.  Coffee was A-OK.   For the wintery and rainy days, with no access of the back patio, I probably would feel quite clammed with the limited seating options indoors.  I don't need free wifi and with HotBlack Coffee not providing that might give me a better chance to find a place to sit down and enjoy my coffee during busy hours."}
{"text":"There's a reason why this has been named the best coffee by New York Times. On a walk today, I passed by and was lured in by the sign out front noting its many accolades.   The menu was full of interesting sounding concoctions but I stuck to my tried and true almond milk latte. The espresso was a bit strong for my liking, but the bean quality was top notch. Luckily the almond milk tempered the bitterness. Very friendly baristas, unlike some of the other indie coffee shops. And a good selection of baked good (including gluten free). I didn't try any, but it'll give me an excuse to go back!"}
{"text":"Very hip coffee shop. Got the Russian tea which is nice and light. Their expertise seems to be espresso and coffee. Excellent experience."}
{"text":"A delicious taste of coffee on the top of the warm atmosphere. Staff is really accommodating, nice to check=)"}
{"text":"Came here while visiting Toronto. Went here before going shopping on Queens St. They have a wide selection of caffeinated beverages including both your typical Italian beverages and a selection of unique beverages I've only seen at HotBlack; for example they had ginger, mint and other infused coffees. They also serve some pastries. Prices were okay. Would come back if I was in the area.  Service is very friendly. There is a small table and bar to sit at.  Ordered: Ginger coffee - Pretty good, I felt it was an odd combination. Can't tell if I liked it or didn't like it, but it was interesting."}
{"text":"This my place to go for a good coffee when I get a downtown Toronto layover. It is very close to the Hilton and the Sheraton Center. You can sit down for a good read as you're sipping on a so good latte. They serve sandwiches and sweet bites as well. There is also a patio in the back to enjoy the afternoon sun."}
{"text":"Unique and boutique coffee shop..Best coffee ever ! (And very delicious cakes ever ;)"}
{"text":"Huge fan of the \"Green Eye\" mint infused cold brew."}
{"text":"Down to earth people with the CUTEST décoré. They make their own sourdough, have artesian coffee and handmade treats. There's no reason this place deserves any less than 5 stars, their drip coffee cheap and rich af."}
{"text":"Super cute coffee place with a nice outdoor area and nice range of desserts. (and good for dietary restrictions such as gluten free and vegan) They have coffee roasted by Detour which is always awesome to drink. I also adore that they have a sparkling water dispenser. Great place."}
{"text":"This was a neighbourhood staple for me when I was living in the area. Their jam cookie is The Best. It's the best fresh take on a Linzer cookie I've had - and I've had more than my fair share of cookies! I love that it's not dusted with icing sugar, because it makes eating much less messy (and icing sugar does nothing for the flavours anyway). Most of all, I LOVE that it has little bits of what I'm guessing are coffee nibs? Ground coffee beans? Cacao nibs? banked into the cookie. It brings a whole other level of dimension to the flavour and aroma, makes it refreshing, and it goes so beautifully with the tartly sweet jam filling.  I also regularly had their chocolate chip cookie. Not the best I've had, but tasty.  My other favourite is the egg & cheese toasts! The bread tastes really rustic and homey, the cheese they use is super sharp and flavourful, and the egg is always cooked perfectly medium. My favourite Sunday breakfast, along with the cookies.  I don't drink coffee but I've had an iced sencha there before, which was good.  And the people who run the shop are the nicest!"}
{"text":"Hot black is very close to my work so I find myself visiting quite frequently. They actually just celebrated their one year anniversary! Their coffee is great, staff are nice, decor of the store is beautiful, they have almond milk for the lactose folks such as myself, soda water on tap at the milk and sugar station, and their cups are cool looking! Need I say more? Go show them some love! They also have stamp cards so make sure to pick one of those up!"}
{"text":"Ordered a Gibraltor (called Cortado here) and a chocolate biscotti. Both are very good."}
