{"text":"i go to the House of Yang quite often, but I can't say its great. It is close.  Serving size is pretty good, but its a case of quantity over quality.  Everything is gloopy or greasy, and usually smothered in a brown sause.  It seems like all the parts are there, but there was much care in the cooking or assembly.  I often get back to my desk, open the bag, and the bottom is covered with brown sauce.    I'd say their fried rice is very good, but the rest, just fair."}
{"text":"I judge all Chinese joints by their CFR. and today it was good. Very good!  They've been there for about 30 years now and I started going in there in 91. I'm getting older and their grub is getting better."}
{"text":"Always fantastic customer service. The lady who takes tour order in person / via phone is always pleasant regardless of how busy they are. Large lunch portions for the right price. They tend to accommodate 95% our our requests for substitutions/ add ons- (no onions in fried rice is a no go, lol) Great for fast lunch delivery/ takeouts!"}
{"text":"Good food that is consistent, not greasy, and prepared quickly. Delivery is quick and friendly. I prefer the spicier dishes and haven't been disappointed."}
{"text":"Too each it's own. I saw some nice reviews on Yelp and decided to try.  When I walked in and the phone was ringing off the hook with take out order so I figured the food must be spectacular. I ordered lemon chicken combo and my hubby had orange chicken.  The lemon sauce was amazing, however, the chicken was dried out.  The combos come with fried rice, cheese wanton and egg roll.  The rice was bland and the egg roll was greasy and had no flavor though the wontons were light, crispy and quite flavorful.  I might have been willing to give them another try as it was the holiday weekend, however, there weren't any other patrons in the restaurant and the food was so dried out and bland, I just never want to take the chance with it.  Venture to this establishment at your own risk.  I have honestly had better food at a chain such a Panda -- wow."}
{"text":"Best place to go to lunch, and the people who run the place a really polite and friendly."}
{"text":"Have been going here for years! Always  was a five.  This time it was awful. Hope they go back from whatever they changed. The chicken was dry. The fried rice had no flavor.  So very disappointed"}
{"text":"You need to take chance in this restaurant.  First time, it was great.  Second time, just OK.  Third time, awful.  No more try."}
{"text":"Great little Chinese take out! They do have a couple of booths inside, but I'd say it's mainly a take out place. The Teryaki chicken is fabulous! I've had a few other dishes here in the 20 years that I've been going there, and they have been good. But I just love the Teryaki chicken and egg rolls. It's real chicken, freshly cooked and seasoned to perfection, with no msg. It's sooo good!  The customer service is also great. The owners are very friendly and always get my order perfect!"}
{"text":"This place is pretty damn good. The egg rolls and crab puff was amazing. I wasn't sure if this place was any good but we decided to try it out anyway and I'm glad that we did! We will definitely be ordering from here again!"}
{"text":"Ordered delivery for the first and last time. Although delivery was prompt and driver pleasant the food in taste was poor. Although the lady I ordered from told me the egg rolls were hand made fresh in house it didn't impact taste. The egg rolls were extremely doughy and bland. Such thick dough I didn't finish even one. Couldn't put enough sauces to add flavor. I ordered fried rice and although the egg was cooked well in the rice the veggies were so light in color they looked like they were frozen then thawed while cooked in pan. Very disappointed. The rice and veggies were very flavorless also and unfortunately within an hour of eating this take out I was sick. Avoid this place. Too many other Chinese places in area to choose from."}
{"text":"Way overpriced, and underwhelming, the staff is very nice however.   Me and a friend ordered from here twice, and both times, the delivery times took forever (45 mins-90mins!), the food was greasy and underwhelming, also we found gross charred remains in our food (probably fell off from something in the kitchen)!  I don't know how the rest of the menu is, but you couldn't pay me to eat here again!"}
{"text":"House of Yang has been a regular gathering place for my friends whenever we want 'cheap Chinese'.  The food is consistently good, cooked after I order and they are always exceptionally nice.  Super cheap and tons of food.  The volcano beef is my favorite, with spicy flavor and not just heat.  Delivery is free and they will do it for only 2 lunch entrees."}
{"text":"Okay - I am not a foodie, just looking for some decent Chinese food.  Read the yelp review on House of Yang, and decided to try it.    To start with a positive note, the woman who took my order was very cordial.  On a negative note, the food was horrible, in both presentation and more importantly taste.  I do not put many restaurants on my \"never again\" list, but House of Yang is clearly in my top 5.  My wife and I will never return.   The search for good Chinese food in Phoenix continues..."}
{"text":"Upon entering into the House of Yang, I was greeted by someone who I wasn't sure if he worked there or not. I thought that he said something to me, but it was incoherent words and he may have not even known what he was saying. I was craving some Chinese food and this place was close to where I work and had decent reviews on Yelp. The lady who was at the counter didn't really greet me, she just asked what I wanted. I was lagging looking over the menu and decided on the sesame chicken lunch combo. I received my meal and sat down to eat, as I opened my styrofoam container of food and looked over my meal, I was very taken aback. The sauce for the sesame chicken looked like someone had a bad cold, blown their nose and taken the abundance of snot and rolled the fried chicken pieces in it. It even had the consistency of snot. It looked nasty. I was brave though, I tried it, it didn't taste any better. It was a bland taste of who knows what. The only \"sesame\" that was in the sesame chicken was the sesame seeds that were all in the snot consistency sauce. I asked for white rice to accompany my meal, the rice was cold. The \"combo\" came with a wonton and an egg roll. As I bit into the egg roll, the texture of the egg roll was very soggy. The wonton was surprisingly hot, but had a very minute amount of meat in the middle, it also came with no sweet and sour sauce to dip, I guess that was extra. The whole meal set me back almost $8, that's way too much for lunch and I didn't even get a soda! I could have gone have lunch at Benihana for a dollar more. Next time I will. I ended up throwing my meal away and driving to Taco Bell to eat. I would not recommend this place to anyone."}
{"text":"I love House of Yang! Their orange chicken and low mein are fantastic."}
{"text":"NEVER EVER AGAIN!!  An order of vegetable fried rice  Shrimp fried rice Chicken soup and  Crab ragoons was delivered to our hotel around 8:00. The food was so burned we could not eat it. The rice looked like char! It was black rice!! So gross. Even the crab ragoons were smoked! Dark dark brown. And the soup...i didnt know you could burn soup!! We called right away to find no answer. The caller id must have shown it was us. Worst service ever. We tried calling a few minutes later. Still no answer. The food went to waist. We called first thing this afternoon when they opened. Only to have an extremely rude lady say 'Not possible because the soup is made in a big pot' like don't fight with me lady...you can burn a pot of soup. She said nastily 'I will let the cook know. And hung up on me! HOW RUDE. And you know what..I didn't want free food. I just wanted them to know. Or at least refund me somewhat. The order was 26$. For the little bit of food we had. Beware this place has bad food and terrible customer service."}
{"text":"Bought takeout over the phone. Was delicious and was ready upon arrival. About 10-15mins drive so food was hot and ready. Got quite a few things egg Foo young was nice, beef broccoli, wonton soup, some noodle dish. All of it was very delicious. Typical Chinese American takeout!"}
{"text":"I am very glad this place is close by and delivers good Chinese food.  Most of the Asian restaurants in N Scottsdale are chains and they suck so it's nice to have a local.  They even do Singapore Noodles which is one of my favorites and they do it well.  I wish they didn't upcharge for brown rice though.   It's a regular event for me especially if I feel like staying in and just having some comfort Chinese."}
{"text":"In town on business and ordered #9 and house special lo Mein. Awesome very good Chinese delivery."}
{"text":"I moved here from NYC and have had a recent hankering for Chinese food so I just trial run with House of Yang.  The pork lo mein was the blandest I've ever had and I am still unsure that was actually pork I just ate.  I also tried the yui-shan shrimp and chicken which definitely had spice that I appreciate but it too did have much flavor beyond the heat.    They will not substitute brown rice for white rice for dinners--only for lunch.  Huh?  You can pay for a separate container of brown rice but they will not take away the white.  Double huh?  They were nice enough but seemed more focused on their conversation and watching Judge Judy than preparing actually good tasting Chinese food.  I would rather have been watching Judge Judy too but enjoying flavorful food while doing so--which was not the case here.    Qwik Chinese was way better prepared.  I have yet to try more Chinese food places, but I'm crossing this one of the list.  Case dismissed."}
{"text":"I literally made a yelp account to review this restaurant. I have been eating their food since before I remember, for probably about 24 years. I can eat straight habanero pepper sauce now, but my mother tells a story of my first love of spicy food from this restaurant. She ordered the Sichuan Shrimp, I could barely talk, but I kept asking to try some. She had her doubts, but she felt I should learn something and had me taste it. I kept asking for more after my first taste. I love coming to this restaurant or ordering delivery from it. The owners are the most kind people in the world. The food is amazing. The orange chicken is to die for. They changed the recipe slightly about ten years ago to not include cabbage, but it is still my favorite in the valley I think they changed ownership around then. If you like a simple teriyaki chicken, it's also great. I love the house special chicken. The mongolian chicken/beef is amazing, with sauteed green onions and white onion. The honey dipped wings are some of my favorite wings, despite them not being spicy. And the lo-mein is delicious. The puff angels are also great. I usually ask for extra spicy on the dishes, but need to add some ghost chili pepper at home. I have never had a bad experience at this restaurant and have loved everything I've tasted.  The lunch combos are amazingly affordable, and I order them for me, my family, and co-workers fairly frequently.  I have gone to pretty much all the Chinese restaurants in Northern Scottsdale, and House of Yang is the one that keeps me coming back. I highly recommend visiting."}
{"text":"Best Chinese Food in Phoenix!!! Since my husband is from New York, He is really Picky about his Chinese Food, and he said that IT RIVALS THE QUALITY OF CHINESE FOOD IN NEW YORK!!! Also very CHILD FRIENDLY."}
{"text":"I should have written a review long before now as I have  been going here so long I remember the owners before the present ones. I have never, let me repeat, never had a bad meal here. It is very solid Chinese-American food with a few dishes that might surprise you. Hands down they have the best orange chicken; the right balance of heat and sweetness and not over-fried. I especially enjoy their tangerine beef, too (try it with noodles instead of rice). My only disappointment is with something many of the Chinese-American restaurants do here; they use western broccoli instead of gai-lan or broccolini, but that's a matter of taste. It is usually done well, regardless.  I also can't say enough about the staff, patient, polite and considerate. True story: while on my way to pick up an order one evening I was almost struck head on by a truck.  When I arrived the woman behind the counter saw that I was shaken up, made me sit down, and threw in some \"extra\" with the order. Very sweet and decent (I am something of a regular, so she has seen me before). Always a smile, a hello! As far as I am concerned both the food (as long as you understand it is what it is and this is not the place to find winter melon soup, etc.) and the staff are great! I'm an unabashed fan."}
{"text":"I love ordering from House of Yang. Always fresh, always delicious, always so polite. The delivery is usually quick too, a plus when you're ready to eat when ordering!"}
{"text":"Ordered Pork Fried Rice last week and it was SOOOO good!! Looking forward to going back and trying something new."}
{"text":"If you are vegetarian try this place out! You can get anything made with tofu. My favorite is Orange tofu :)"}
{"text":"Wow! Finally GOOD Chinese in AZ! Well...my first good place any how! I ordered the Thai Volcano Beef and it was delicious!!! Taste bud explosion! Small little restaurant with friendly staff, I will be coming back! And they deliver! Must try if you are in the area!"}
{"text":"The lady who served me was so kind. Great customer service here. Got my food fairly quickly. I'm kind of sketchy about Chinese food as it's made me sick before. I ordered the orange chicken and it was bomb!! They use all white mean chicken and everything was so flavorful! I will definitely be eating here again!"}
{"text":"We order from here ALL the time! It's super close to our house and the food is always a hit with guests that stop over for dinner. We just ate there again last night. Totally recommend House of Yang"}
{"text":"My favorite place to get Mongolian Beef for lunch - good egg rolls (make sure to ask for the real mustard (in the little plastic cups, not the stuff in the packet - it's way better), great Mongolian Beef - very affordable.  The lady who works the counter is really nice as well.  Also the family favorite for take-out.   Give 'em a try - get your Yang on!"}
{"text":"Been coming here off and on for a few years. Definitely not our number 1 fave place but the food is very decent-just not super authentic. My husband and I grab food here occasionally for a quick Chinese dinner. Owners are super nice and have been kind enough to do special orders for us several times."}
{"text":"I'm not really too thrilled about this place, but it is conveniently located near the places I work at around Scotsdale.  The thing is, they are consistenly mediocre, and that kinda works to their advantage.  I wish I could give them more stars, its just their food isn't really that good, but it's not bad either.  It's good if you feel like this type of chinese when you're in Scottsdale and you don't feel like spending a fortune.  Joyful house on Hayden is just a little better."}
{"text":"Pretty much always good food. Delivery... Dont get Angel Puffs. They arrive soggy and cold. Service is good but sometimes the person on the line is hard speaking of english. But... Yummy!"}
{"text":"We've been around this area for over a decade and finally visited.  How did we not know about this place?!?!  Big fan of the shrimp and broccoli.  The kids love the teriyaki chicken.  I have to get an egg roll when I order... and we love the puff angels.  This has become a weekly request at the house."}
{"text":"It's hard finding good Chinese food. This place is pretty good.  I had the king pao chicken and it was good but could use more kick to it. The rice and egg rolls are pretty good.   The lady at the counter was very friendly, which is nice.   Overall, good Chinese food at a good price."}
{"text":"My wife and I ordered delivery from here last weekend.  The food came when it was promised and nothing was screwed up.  This place is pretty solid but its your typical Americanized Chinese stuff you find in every strip mall out here.  Nothing fantastic but it does the trick."}
{"text":"I used to live in the delivery area and raised my kids having delivery every other week from House of Yang. I now live about 25 minutes but still pick up orders every few weeks. The food is consistently prepared and there are many great options. I've tried many of the dishes and have never been disappointed. We used to get a variety of orders and eat family style but if you are solo, they have great lunch combos. I highly recommend House of Yang.  The places in my delivery zone are not as good and thus I continue to grab take out. Try it."}
{"text":"Love this place. Small Mom and Pop place that Iv been coming to for 15+ years. Sesame chicken, Combination Low Mein, Kung Pao Beef and their crab puffs are my usual Go To's that have never let me down."}
{"text":"Holy monkeys, I didn't expect this to happen, but my opinion of this place just increased in an explosion of \"YAY\"ness!  I've been going there for some time now... probably nigh on a year. Somehow, in all this time of getting lunches there, I managed to overlook the roasted pork with plum sauce. NO LONGER will I make such a mistake! I feel like I have an orgy of flavor in my mouth right now. Seriously, this is good. I don't know what they did to it. Maybe I'm delusional. Maybe I'm just really really hungry.... whatever it is, I am in love with this food right now.  Mmmmm, back to nomming...."}
{"text":"Another good source for cheap Chinese food in North Scottsdale. I don't think this place is any different from Asian Island however which is just on the opposite side of the Scottsdale airport.  Decent food, reasonable prices. I would come here again for lunch.  As usual, I think its important to emphasize that its good for what you pay for. If you come in expecting fancy pantsy asian food for 5-10 dollars, you're expecting too much."}
{"text":"I came here on my lunch break hoping to discover a new option to add to my rotation. Excluding drive time, I only have about 40 minutes to eat lunch if I go out. I went to House of Yangs and spent 25 minutes waiting and 15 minutes eating. About 6 people got their food before I did. Once I got my food, it was decent but nothing outstanding. Mongolian beef was tasty but the sides did nothing for me. Not a terrible experience but not exactly a good one either. At least it was cheap. Though I may give it a shot again in the future, I am in no rush."}
{"text":"Decent Chinese take-out.  The Lo Mein is good, as are their shrimp and beef dishes.  Did not care for their shrimp and lobster sauce.  Their ribs can be hit or miss, depending on how fatty they are.  Also did not care for their Won ton or egg drop soup.  Their fried rice is good, but then, I've rarely had bad fried rice..."}
{"text":"They are very fast if you are looking to get a lunch order. But I would recommend a different sauce for the vegetarian dish #15 with assorted vegetables. It had a lot of hearts of palm and it overpowered the other flavors. Anywho they were fast friendly and the food was tasty.."}
{"text":"Look, I'm not one to write reviews. I'm not a foodie, but I love me some Chinese food.   House of Yang is right up the street, and the people that work there are what causes the 5 star. They're great people. Pricing is good, food is good, but it's a place you don't feel the pain of spending your money.   Really good food, it's quick, in a great spot that's easy to get to. This is my new go to Chinese joint."}
{"text":"We had the best orange chicken and general Taos chicken! So good! Never had better orange chicken! The hot and sour soup was amazing too! It has shrimp, tofu, and another kinda meat in it and it was so good! Love it!!! My new Asian food place!"}
{"text":"Fried rice looked like polenta, Entree was greasy and I have no idea what was even in the tiny iota of filling in the won ton. Truly underwhelming."}
{"text":"Seriously best Chinese food you'll ever have!! Prices are awesome as well. The orange chicken is my favorite, can't go wrong. You get a lot of food too for your money. Definitely will leave with leftovers which is just as delicious the next day. Anyone wanting really yummy Chinese food, go here!!"}
{"text":"So it was a nice and friendly establishment but as someone that loves Chinese food I actually couldn't eat my food. My brother and I both got an order of general tso and it tasted like straight salt. The sauce was unrecognizable, it didn't taste like anything I've ever had. I don't know if the batch got messed up of if that's their recipe but it was not good. (And generals is one of those entrees that are pretty standard from a take away place, so I figured it'd be normal, but nope). I'm not from here so I don't have to worry about not returning but just heed my PRECAUTIONARY tale, Scottsdale."}
{"text":"Hey house of yang, you keep doing your thing. You're fast, you're cheap and you're easy. Always about a quarter more cashew chicken than I want/need to eat at lunch but I eat it anyways. Start playing 36 chambers during the lunch rush and it'll be a solid 5."}
{"text":"The food was pretty average. We were looking for some standard takeout Chinese and while it was ok, we are still searching for a better option. The service was really friendly and it was clean, so it might be worth checking out if you're looking for a quick meal."}
{"text":"Unflavorful and bland.  It's like there's no seasoning on any of the food.  The service is good, but the food is below par.  So many alternative chinese places, but it's cheap.  You know the saying, you get what you pay for."}
{"text":"I don't do many reviews, but since I found this place using yelp I figured I'd  review it.  I like Asian food, and didn't like the food here, the taste was bland.  Felt like something was missing in the flavor.  I've been twice to this place now, and am just not that impressed, and won't be back."}
{"text":"Not the best in the world, but FAR from the worst.  Chinese food is definitely an individual taste so, to each their own.  I order from here a lot, delivery is usually quick, and they deliver both to my home and office.  Food is always cooked well, nothing questionable, and it's tasty. Crab rangoon (puff angels, they are called here) are deelish."}
{"text":"The owners are very nice, but the food is just ok.  I tried the sweet n sour chicken which was good, not great, very sweet and very deep fried.  I also tried the house chicken... not good at all & way too salty.  I might give them one more shot... but nothing deep fried or salty."}
{"text":"I have been eating at House of Yang for about 10 years.  The quality of their food has improved considerably over the years.  I ordered the pork fried rice yesterday and it was perfect - yummy barbecued pork, no gristle - just wonderful.  I can't eat white onion, and they are happy to make my Mongolian beef with only green onions.  Orange chicken, sweet and sour pork, pot stickers, cream cheese fried wonton - all delicious.   Prices are reasonable and they deliver.  Owners are very nice.  My favorite Chinese restaurant in the Valley."}
{"text":"Surprisingly good Chinese fare for a very reasonable price. Fast delivery for a fee and everything you would expect. The person on the phone made a suggestion and it turned out to be fabulous. I have never had a Chinese place ask what i liked when i was ordering. It was exceptional service."}
{"text":"Fantastic family run restaurant. They work hard, food is consistent, everything is well prepared and well priced. Definitely a winner if you're a local looking for takeout or a quick Chinese meal."}
{"text":"Customer service was great and the food was ready fast. I ordered kung pao beef and vegetable chow mein. Both came with a side of white rice.   Then I got home with my order. The chow mein was tasty, but I have had better. The rice was cooked well, but it's just white rice . . I am just glad I had it because I couldn't eat the kung pao beef. The beef dish did not have any veggies in it and the thin slices of beef were coated in a very thick breading that had become slimy and soggy in the sauce. The sauce tasted like something you can find on your local grocery store shelf, ready-made, just toss and coat. Maybe other menu items taste better, but for the price I paid I am not likely to return in hopes I get something that tastes good."}
{"text":"Their general tso chicken, kung pow triple, house chicken and other items are delicious and no one else in the valley makes it the way House of yang Does. I took another job and its worth the drive up on the weekends. I dump the shiracha sauce on it for added spice. Other eateries around me are opposite of the food with the same names. I think House of yang is unique. Not much in the flavor has changed since they were sold back in mid 2000."}
{"text":"This place wasn't horrible, but it wasn't AMAZING either. The fried rice has a different flavor profile that typical fried rice but it was still good. I ordered the special garlic chicken from the lunch menu. Because the chicken is covered in sauce the breading becomes soggy. I would suggest asking for the sauce on the side. You do receive a large amount of food for a small price.    I was not impressed with the wonton soup and ultimately threw it away. The wontons tasted very doughy and the broth was lacking in flavor and seemed very oily."}
{"text":"Went in for lunch this afternoon and ordered chicken rice. When it was finished cooking they called out 'chicken fried rice' for me to come pick up the bag.  The chef then took the bag and said he put the wrong meat in it. Instead of making a fresh order, he decided to 'fix' the first order. Gross! When I questioned them about it they said it was fine because he put it back in wok. I will never go back!"}
{"text":"Absolutely love the moo shu pork!!!  Great value for the price,  large portions! Finally found a Chinese food place near us that actually has decent noodle dishes. Also,  good egg rolls!"}
{"text":"An average place to get average chinese food; it's not bad, but it's not awesome. My brother and I have tried many different dishes, but we weren't too hyped up about the taste. The first time we went it was good, but I think when it's your first time you tend to think everything is better.  Second time we went to get food, we were naturally a little disappointed. I took a friend out to dinner a little after that and I wasn't too upset but my friend hated her dish. Customer service is ok. The first time we went in it took a while for us to decide on what to get. I could tell that the woman was annoyed. She didn't smile or ask how we were, just straight off the bat asked what we wanted."}
{"text":"Holy Hernandez!  Ordered delivery and it was at my house in 11 minutes!  And yes, it was what I ordered and perfectly cooked."}
{"text":"Worst Chinese food I've ever had . I saw review of how good it was , then opened the app and saw the recent reviews and it said the food was gross and I was like aw hell\" I already ordered though . Hoping it would be good , it was disgusting!!!! Very gooey . So disappointed. I was so excited for Chinese food , 30$ down the drain ."}
{"text":"Great Fast Chinese food. been coming here for many years(since first opened). Always get lunch #19 Spicy."}
{"text":"We went there for dinner yesterday and were not impressed. We had the General TSO, shrimp fried rice, and the Bo Bo appetizer. It was all lacking in flavor for us. The staff were very friendly, but we most likely will keep looking for good Chinese elsewhere."}
{"text":"The absolute worst Chinese place I've ever been to. And I'm from Boston and NYC and have been to Hong Kong. I know real Chinese restaurant take out places.   The chicken wings were inedible. No marinade on them. Just wings fried. So disgusting.  The fried rice was even worse."}
{"text":"Surprisingly fresh and tasty. Was at Natural Grocers with my youngest who suddenly was famished. Walked over and had dinner. Small family take out place. Everything was fresh and well flavored. Will be back."}
{"text":"A coworker of mine recommended this place while I was craving some Chinese food. Made it in time for their lunch specials. I ordered the shrimp stir fry and fried rice. Their fried rice was very different from the usual I wasn't feeling it.   However their shrimp stir fry was pretty good the sauce was the perfect combo of sweet and spicy.   Very friendly and quick customer service."}
{"text":"Oh my....don't try the beef and broccoli it's grayish meat, way too much garlic, bad texture.  Gack."}
{"text":"I went here and ordered some food with my mom.  I had to return the first thing I ordered as it had something I was allergic to in it. My mom returned hers because she didn't like it.  The person who took the order had a bad attitude about the return, but did let us order other food.  I asked for white rice, but when I got it it was fried rice.  I hate fried rice, and so had no rice with my meal.  The chicken itself was good, though the sauce was on the strong side. My mom said her second meal was less good then the first.  I tried a piece from her second meal and the meat was chewy.  Also, the fried wanton was not good it was just a hard noodle with some chewy yet soggy thing in the center. Between the food not being so good, the order coming with the wrong rice and the woman being so unfriendly, I'm not going back."}
{"text":"Their food is amazing! It's always fresh, tasty, and fast. Take out or delivery, it's always great. This is my new go-to place for Chinese for sure. It's just delicious.  We usually get chicken fried rice, it's tasty and full of yummy vegetables and their crab puffs are delicious. I can't remember what they call them here. The sesame chicken is always fresh and tasty, and the staff is very nice."}
{"text":"Just had lunch there(may 7, 15) and I had the teriyaki chicken with a side of fried rice.  It was good.  I always compare any fried rice to Sing High's fried rice in downtown phoenix and to me,  Sing High's is still king.  Yang is a decent place to eat.  The staff is friendly and is Asian.  They are closed from 230 to 4 which is very odd for a place like this.  I confirmed the odd closing with one of the staff guys and he said there's a small sign indicating that but when I left, I couldn't see it.  While I was eating there, a woman came in to order and she was refused service because she came in around 245... There should be a big enough sign stating that.."}
{"text":"I have called in an order and have done take out. Each time the people were friendly, the food was made quickly and the food has so far always been good. I recommend the beef and broccoli and vegetable rolls."}
{"text":"It was definitely time to write an update.  They now serve Chow Fun and it's always fresh, never dry, and packed full of all of the essentials.  Anyone who knows me knows that due to my childhood raised in NYC Chinatown, I base my dining scale on A) if a restaurant has chow fun, and B) how well prepared it is. It checks all the boxes.  The other reason for the bump up of stars is their delivery.  I have literally had delivery reach my office in fifteen minutes.  Granted, that isn't the norm, but I've never had food delivered more than a half hour after I've ordered.    Wonton soup, house chow fun, and singapore noodles.  My favorites on the menu.  Super cheap all around, especially their lunch specials.  If you like a more Americanized Chinese dish - their House Chicken is actually really good.  Not to jinx it, but I order from them probably once a week.  They have yet to mess up my order, and they always deliver in a timely manner.  Also - delivery is only a $12 minimum, which is on the lower end of minimums for delivery."}
{"text":"Someone told my DD about this place so we gave it a try.  She always gets shrimp fried rice. If you don't know anything about people from St. Louis, know this... We are fried rice snobs. So when she says she likes the fried rice from this place and that it's 2nd to home, that is a statement.    I have tried their Kung Pao Tofu. I loved the spice, but the tofu, although firm, was still too mushy for me. I'm just not a tofu fan, so unless it's cooked a certain way, it won't impress me.   What did impress me, however, was the customer service.  The employees (owner?) are always very friendly and kind.  Love the aurora that surrounds them!  I also like that they confirm that they cook with vegetable oil and no MSG.   We'll keep coming back whenever DD is in the mood for fried rice.  I may give one of the vegetable dishes a try next time."}
{"text":"Un-EFFIN-believable General Tso's chicken!  If I could make it like that, I'd never leave home. I don't know what they do, but its consistently awesome every time. Lunch combo comes with egg roll and fried won-ton for like an extra buck something. It looks like a family run biz, so the service is usually the same people every day. If you're friendly, they're friendly, but I have seen it look a little \"stressful\" in there when the lunch line is backing up. If you go around noon, good luck eating there; its usually full, which means they must be doing something right.  Now if I could just get them to deliver to the west side."}
{"text":"This place certainly isn't amazing. Nor is it very fresh. It is greasy 'Chinese' food made for Americans. That being said, for what it is, it's not terrible. My family has been getting food from here for over ten years. It has always been about the same. The place is really for take out, it has tables, but looks like a fast food place. They recently got a new menu board that reminds me of Panda Express... ha. Anyway, on to the food, we got a large take out order from here last night for father's day. It was one of the better tasting endeavors from this place. We ordered mu shu pork, chicken chow fun, mongolian beef, shrimp in lobster sauce, orange chicken, and we got honey wings for free (if you order more than 29$ worth of food they give you a free appetizer from a list... pretty cool). I was glad we tried the chow fun, because I have had their chow mein many times and the noodles are always greasy and limp and the chicken tastes weird.... well the chow fun had white meat chicken and was less greasy, so that was nice. The mu shu was fine and the mongolian beef was pretty good.   Overall this place is very hit and miss, but it's not the worst Chinese food I've ever had....so if you're looking for something convenient, It's worth a try."}
{"text":"I've been enjoying their food since 2004 and it still until this day is my favorite Chinese food place. I'm not really big on Chinese food actually...I'm veeeery skeptical of any place new. With that being said House of Yang more than exceeds my expectations.   First the staff is super friendly. Usually when I go in and pick up a dinner order the same guy is working the counter; I want to say he's the owner or maybe part owner? He's very friendly and engaging (ok he's kind of handsome to boot, I'm just saying) and doesn't mind when we substitute egg rolls for the soup in the dinner combos.  That's an extra plus right there.   Now for the food...what can I say, nothing is bad that I've tried on this menu. The egg rolls are extra crispy, my go to is tangerine beef and man is it good. Volcano beef is also delicious, orange chicken, cashew chicken, sweet and sour pork....I can go on and on here peeps but you get the idea - it's delicious!   They do deliver; unfortunately I'm just outside their delivery range or else I'd eat there way too much. Anytime I'm craving it or I'm close we'll head there to pick up food. You'll be glad you did too! You're welcome!!"}
{"text":"Great lunch options! Combo or no combo-- all great deals and quick.  I like to order my take-out orders steamed rather than fried-- that way I can regulate how much sauce/oil goes into my dish.  I must say, tasting naked veggies and shrimp/chicken can really show the quality of the ingredients.  Subsequently, I've been quite pleased with what I've seen from House of Yang.  Today I ordered Shrimp and Broccoli with the sauce on the side with brown rice.  The portion was more than generous-- it actually feeds two in my opinion and left me with lunch tomorrow ;) The broccoli was steamed to perfection and the shrimp was only slightly overcooked.    I've had much luck for dinner take-out as well.  Again, the portions are more than generous and I've never had to wait long for my meals.   Yay! I'm a fan!"}
{"text":"middle of the road.  I'd give it 2.5 stars.  the shrimp fried rice was very good, the teriyaki chicken good, the orange chicken pretty blech.  Overall, I'd say it was decent.  Not great, not good, but not terrible.  Just average."}
{"text":"Good food, good value.  The people working there are very nice and helpful.  They have delivery as well.  Try the won ton soup."}
{"text":"I had dinner there only one time and it was really good. The person working was very friendly. They didn't rush me and a friend who sat there for a couple hours socialize over dinner. Price is good - competitive. I agree with Bill Z - egg drop soup was only okay. The Kung Pao Chicken was VERY good. My friend had Sweet & Sour Chicken and said it was good. She chose House of Yang for our dining location, so she obviously likes it. They do have a web site with an online menu. Next time I'm in the area and want Chinese food, this is where I'd go (I think it's better than that PF place)."}
{"text":"Food was edible but not worth eating, honestly. This place is less than a mile from me with a 45 minute wait time at 6pm on a Monday. Called in after 15 minutes of when I ordered to make a change and they said the drive was already on their way. They didn't come for another 40 minutes. Highly recommend finding another place to eat."}
{"text":"We've ordered from House of Yang twice now (delivery both times) & we've been very pleased with he quality of the food, how quick the delivery arrives & the overall value.  We didn't have a Chinese food option prior to finding House of Yang & now that we've found them, they're our \"go to\".  We highly recommend!  Particularly their Beef & Broc & Chicken Fried Rice!"}
{"text":"Ordered take out and went to pick up and the place is small and mainly for delivery or pickup. Ordered the following dishes :  Chow Fun   Shrimp and Lobster Sauce   Teriyaki Chicken   Garlic Chicken   House Fried Rice   Chicken Wings  All were okay but nothing really stood out. The fried rice was probably the best, the shrimp and lobster sauce was really disappointing.  If I were to reorder or recommend anything it may be Garlic Chicken and the House Fried Rice but would prefer a few other chinese restaurants in town."}
