{"text":"For a restaurant situated in the heart of the financial district it certainly doesn't deliver in any of the areas you might expect. Well, that's not true, the prices are right in line with what you'd expect to pay at a fine steakhouse. The product though, that's another story.   We stopped by for dinner Saturday night after an active day in the city. The patio looked decent and we were in need of some hearty grub. We walked inside and out the gate it was obvious that something was up, the place was completely empty... on a Saturday night... At that point we mulled a quick exit but felt compelled to stay so that we could cross this place off the list.  Rather than turn this into a novel I'll highlight what came next.  - We started with straight Absolut on the rocks, an old standby. On first sip the drinks had a perfumed taste. Straight vodka with a taste of cough syrup, that can't be right. We sent the drinks back. The second round were the same deal. After talking to the manager it was discovered that the spout pouring the drinks was dirty which transferred the taste over. That was comforting. -  The $40 fillet minion came out... completely sub-par, tough and dry, white in the middle, you'd get a better steak at a dive bar. To top it off, the gorgonzola on top was cheap and a whole different kind of funky than your typical gorgonzola. - The ribs were accompanied with a delicious rotten coleslaw - you could actually smell this, no need to taste, but of course by accident we did.  Yum. Our mash potato sides were watery and bland.  That was it for us...But the fun didn't stop there... on our way out a roach was spotted running up the wall of the LADIES washroom. And not your typical every-restaurant has got 'em baby roach.... this roach had some meat on his ribs, totally repulsive...   The staff have a defeatist aura about them... everyone knows the place is in trouble, but they're going about their business without acknowledging it... maybe they believe that if ignore it enough the problems will solve themselves? Fat chance, but that's the only rationalization I can put forth on that one... If this place has a reputation to maintain they better start investing in it... or just close the place, that's probably a better move.  Finally, if it wasn't at least for the manager's attempt to try and apologize for the series of missteps we encountered this place would get a zero, but it's getting a one as there's a small, glimmer of hope that with the right attention and investment from whatever body owns this place it may have a chance to turn around. Or they can continue to ruin the brand, that's fine too, no one's coming already so it's not like they can do any worse."}
{"text":"Sub par.   Houston's burger was slightly better than average.   Ribs was bland and not grilled. Tender. But clearly boiled with little attention to flavor.   Side caesar was nothing to write hone about. Side sweet potato fries didn't cone with a dipping sauce.   Service was actually good tho.   We came because of a groupon deal. We won't come back again.   On the way out we saw the o&b next door. Much better quality for similar prices."}
{"text":"I've had better steaks.... Nothing really special about this place.... just really OVER-PRICED! The only thing i enjoyed was their Calamari and Fries. The Rib Eye was definetly way to dry for medium well while the Prime Rib was basically a piece of blubber steak with no meat in sight. I felt like i was gonna get a heart attack from eating that. The Mini Burger Appetizer was served burned and hard, it was sooooo dry! horrible horrible! I also forgot to mention that walking into the restaurant, there were no people in sight. The whole restaurant was empty! Now i know why....Though it was empty, service was still pretty slow which really disappointed me! I will never EVER come back here. I can gurantee you this place will soon be closing down. Do not waste your money here! They need to find better chefs and servers!"}
{"text":"I like the round booths. Good steaks"}
{"text":"By there today... Houston is closed for \"remodeling\" but still awesomely taking resovations as though they are open via open table.   A little inconvenient for my party of 5 guests who requested to go here specifically....   The sign says they will reopen end of August as \"Houston Avenue Bar\" hopefully a step up from their past offerings.  I'm sure the updated keg 1 block away added some well deserved competition in the area."}
{"text":"I came to Houston a month ago after a restaurant I wanted to try nearby was closed for lunch. My mistake! I walked in with two friends at 1pm with no greeter at the front. We walked further into the dining room until a waitress spotted us and seated on the center platform near the kitchen.  Our waitress welcomed us and seemed very friendly and nice. We got settled in an ordered and after looking around I fond the ambiance to be wonderful and modern.             Loved the red theme but was very disturbed by what the waitresses we wearing, really had to question what it is they were selling. I do not believe a uniform like that to be any bit appropriate for food service. It wasn't very busy, about 3 other tables were full but still our food took forever to come out of the kitchen. Our waitress came to apologize and said in compensation for the wait time we could have dessert on the house. That was fine - I was in no rush to get anywhere. Our waitress came back to inform us that her shift was over and if we needed anything else the other waitress on the floor would take care of us.        When our food finally came out it looked appetizing ...but I could never eat a burger with the same excitement again. I ate my salad which was good, nothing special but into my third bite into my Huston burger I was repulsed! I pulled the burger away because I thought the cheese in the burger was melted and clinging onto what was in my mouth but as I pulled further back I found a very very long piece of hair one side in my mouth and the other still embedded in my burger patty. I instantly spat it out. We tried to call the waitress over but she had not looked our way since she dropped the food onto the table. Finally she came over after my friend waved to her and as I explained there was a hair in my food that was clearly in the burger patty she replied \"oh\" and took the food away. No apology.        She came back and asked \"would you like another hunny?\" ...I did not know what to say, I had completely lost my appetite ... No, I did not want another burger with a patty that was probably from the same batch my previous burger had come from. I sat there while my friends finished their food, afterall they were hungry after waiting for so long for their food. As I sat there I heard yelling from the kitchen and as I was seated right in front of the kitchen I turned around and looked in. The manager was screaming at the waitress and our previous waitress who was still there even though her shift was over? Very unprofessional and off putting to diners. The manager came out and said \"Hi, I heard there was a problem with the burger, I'll let you know it has been taken off the bill.\" and he left with that. Obviously I would expect it to be taken off the bill; why would I pay for something that had a strand of hair in it?! I felt awful that the waitress was screamed at afterall it wasn't her fault there was a long strand of hair in the food, it wasn't like she had placed it there. We tipped the waitress generously even though the service and food was awful but as you would expect, that free dessert we were told we would receive never found itself to our table.        I don't think I had too high expectations for this place but the fact that they could not live up to the basic standards of a good restaurant I was very disappointed. I would not recommend anyone to Houston regardless of the ambiance and will definitely never return."}
{"text":"Went there for summerlicious. Service was so so, appetizer nothing spectacular, my steak was too underdone for a medium. All in all, probably wont go back again."}
{"text":"Decent food, but the service! Oh the horror! I've had better service at a Tim Horton's drive-thru lane.  For the prices this restaurant charges, the service should be at least moderately attentive.  Not so.  Perhaps it's not the servers' fault - on a moderately busy Friday evening the entire room was staffed by only two harried young women.  Where was the management?  And what's up in the kitchen?  Contrary to health department rules, several chefs weren't wearing the mandatory hair nets.  Makes a person worry about what else is going on, out of patrons' sight."}
{"text":"The steak was cooked to my satisfaction. The atmosphere was lacking any ambience or entertainment. The service was average, we were not dining in the main area so it was hard to get the attention of servers. We dined quickly and then left."}
{"text":"I went for a business lunch. The ambiance was fine, and service was decent. Unfortunately, the food was neither. My lamb burger was overdone -- when I asked for it med-rare the waiter looked at me as if he'd never heard of such a thing, and I'm guessing never told the kitchen -- and the fries were over-seasoned. I would not go back."}
{"text":"No need to go back here, it's lame as far as vibe and atmosphere - but the female staff are wickedly beautiful!"}
{"text":"i really like the atmosphere but if u enter the restaurant from yonge street, servers dont notice you coming in so you have to walk more inside (i didnt noe that wheb i first visited this place so i waited 10min? at the counter waiting for the hostess). although they give you some bread before meal, it takes too long for the food and they didnt have the wine we chose so we had to pick another one. waitresses they are really slow and not attentive at all. maybe they are in heels and dont wanna move much. but she did bother to fill our wine glasses each time when it was empty. food is average. overpriced for its quality. it was my second time visiting this place and i dont think i'll be coming back"}
{"text":"Nice atmosphere and great customer focus! The place is now called Houston Avenue Bar after a renovation in the summer.  It is still primarily a steak house though and they do that very well.  They have a good wine list but the cocktails are a bit wanting.  We ordered a Mojito (mint wasn't mulled) and a Vodka Cranberry martini and neither one was anywhere near what was hoped for.  We switched to wine for the meal which was reasonably priced and quite good.  We ordered the grilled camembert to start which was excellent.  Next was splitting a small rack of ribs and the mixed grill.  The ribs were perfect!  The mixed grill had some chicken on it which was dry, but the chef came out and asked us about the meal so we mentioned the dry chicken.  He immediately apologized and brought us out a southeast asian chicken salad with 2 skewers of perfectly plump juicy chicken on an amazing mound of greens.  The sirloin (excellent), chorizo sausage and crispy ribs on the mixed grill were all very good as well as the baked potato and the fries.  The ribs and sirloin were definitely the stars though, as well as the attention from the chef on the quality of his preparations.  The ribs don't appear on the online menu, but they offer either a full or half rack and they must be tried! Overall very good, will definitely go back but they do need to strengthen their cocktail menu.  If you're after steak and wine though, you won't go wrong."}
{"text":"This place has recently changed their name to Houston Ave Bar. The food was ok (steaks comparable to the keg) but the prices were very expensive for the quality. Also, this the service was not at the level you'd expect for the price (server didn't seem to know the menu, didn't know if they validated parking, took a long time to take our order, etc.) I'd recommend paying less for the same quality and better service a a lower end place or paying a bit more for much better service and food at a high end steakhouse."}
{"text":"We had a get together here last night and I checked out the reviews online...YIKES!  I got off the streetcar, turned the corner and stared at the place until it registered that it was the restaurant I was looking for!  Man I've walked by this place many times and never realized the bright red sign.  I walked into the place and it looks like a modern steakhouse.  I was quickly greeted and walked to my table were my friends were waiting.    I looked off the drink menu and my mind was blown.  Drinks in the downtown district for a decent price...at a steakhouse no less!  They have lots of cocktails for $6.50 or less.  My drink was $5.85!  I decided not to order a steak tonight due to steak overload the last few days and decided to try the ribs.  The ribs were ok and had a good coating of sauce on it.  I think they were parbuild and then grilled.  The fries sucked and corn salsa that came with it wasn't bad.  I must make a note that our server was fantastic!  She was very attentive, checked on us regularly, was funny and absolute first class."}
{"text":"Joined one of my \"downtown friends\" and some of her coworkers for a drink on Thursday. The service was slow, but I had no idea how cheap it would be! 10.11 for two glasses of red wine is alright in my books. The hard liquour us even cheaper! Atmosphere? No. Service? Mediocre. But as somewhere to grab a cheap drink after work? A possibility."}
{"text":"I was doing some downtown shopping and decided to come here for dinner. Entering this place, I was greeted by some great looking girls and they took my shopping bags which was sweet. The inside seems newly renovated and clean having a chic, red and black theme with great seating and a awesome looking bar. There was also a live DJ which was pretty cool. There were many business suits having a drink and kicking it back. Our server was really nice but had a squeaky voice, my friend got annoyed. For my drink I had the peach sangria which was awesome. For appetizers I had the carpaccio and cheese platter since I ended up grabbing a bottle of red wine. The carpaccio was delicious but they happened to forget the cheese platter and apologized for it and immediately brought it out. I have had great cheese platters before but it was strictly appealing for its presentation but tasted too funky for me and did not enjoy. After awhile, I grabbed the filet mignon which was slightly too pink and happened to tell the squeaky server and she happened to justify that it was fine and convinced me thats the way it is. I was unhappy but hungry so I ate it anyways. Also, I just don't enjoy when theres too much peppercorn, which kind of took away from the steak. Along with the filet mignon, I had steamed vegetables and potato purée as my sides and that was great.  I take my steak seriously so I kind of got turned off for dessert. It started off nicely and ended not the way I wanted too. Overall great eye candy and ambience but the food could be better if they listened to their customers needs. You just dont mess around when it comes to steak ;)"}
{"text":"I love steak.  So does my husband.  Therefore it doesn't really come as a surprise that we chose a steak house for my husband's birthday dinner.   We went to Houston on a Monday night. Getting a reservation last minute for 9 pm was not a problem.  Here is the breakdown of our experience:  Service: Great.  Upon arrival, a friendly waitress showed us to our table which was already set up with a high chair for our toddler.  Brownie points for that! We were able to order within minutes and the food arrived quickly.  Throughout the entire dinner our waitress was attentive and made sure we had everything we needed without being intrusive. When it was time to pay, they accepted our Groupon voucher without any issues and we were able to settle the bill right away. All in all, the service was very professional.  Food: My husband and I ordered the same thing: 12 oz Striploin (medium-rare) with sauteed veggies and fries.   It was delicious! The steak was perfectly cooked. The flavor was great. I really enjoyed it. The veggies and fries were nice sized portions and also very good.  Basically, I loved everything on my plate. :)  We had no drinks, so in the end our bill came to $67 plus tip. Totally reasonable for the amount and quality of food.  We will be back for sure."}
{"text":"Service is slow..........Walked in on a Monday night with the coworkers and the place was practically empty. Since some of the coworkers that I was with have been to Houston's in the the States, they recommended it as good place to eat. Apparently, the menu wasn't the same at all. The food was decent. It wasn't bad or amazingly good, overall, sub par as Elvin W. put it."}
{"text":"Went here for a summerlicious dinner, was hoping for a nice casual dinner. This steakhouse was the wrong choice. Firstly the atmosphere was not ideal, the decor was very tacky, and the music was being played too loud for a restaurant at 8 pm.  The appetizer was good, had calamari which was tasty and had a nice tipping sauce that was tangy complementing the seafood dish. Next was the steak. Not good. Firstly there were three of us ordering steaks, and the sizes were vastly different, hard to believe mine was 10 oz, also it was a poor cut of meet with lots of connective tissue. The side potatoes were tasty but I got what must of amounted to 1/4 of a potato, very small portion sizes here. For desert I had had the sticky toffee. It was actually quite delicious but it was served in a an espresso cup, again small portion size.  My girlfriend got the flourless chocolate cake, and I had some as well. Tasted very biter and dry. Overall, not a great a experience for summerlicious, as we all left hungry even thought it was a 3 course meal and a supposedly a 10 oz steak.  If your looking for a nice casual upscale dinner this is not the place."}
{"text":"How do they stay in business?  That's a question I've always had of this place.  I've lived in the neighborhood for a year or two, but never bothered to check it out.  If I react this way, you know that others do the same.  How can it stay in business when it doesn't really draw anyone in?  So finally I decided to go check it out.  I immediately noticed the faux leather (don't remember if it was actually faux, but the place is faux enough so that kind of rubs off on the leather, I'll explain), dark wood and dark environments.  On first glance, seems like a classy place.  Then you take a second glance.  In your second glance, if you notice these sorts of things, you'll note that it's been decorated like someone read a book about what supposedly makes a place \"classy\" and then just threw all that stuff and the kitchen sink in there.  Not to say that it's filled with random stuff, just that the choices they made gives the impression that they were pretending to *class* without really having a sense of *style.*  Not like O&B next door, which has a cool design and is well laid out.  This place's environment just \"doesn't fit.\"  That's actually an appropriate way to say it, since \"doesn't fit\" works for everything there.  So let's talk about the washroom, nice fixtures, like they spent money on it, but, well, they literally \"don't fit.\"  Not sized right for the washroom.  Small details, but they give a clue to the whole.  And those clues are right on the money.  Menu?  Well they have all the right things, for bumped up prices, but just \"doesn't fit.\"  Where's the character?  Where's the attention to detail?  Where, ultimately, was the taste...  Not there.  I sent back the first steak they sent me since they didn't know what medium well closer to medium was.  Appetizers had been ok but not good enough to \"fit\" with the price.  As I sat there, the friends around me shifted nervously, they know I have pretty high standards for places...  \"I haven't counted it out yet,\" I told them, \"but I'm getting there.\"  Then came the service.  Or didn't come the service, as the case may be.  Ouch.  We were sitting in the middle of the floor, and there were very few people there...  And we were ignored.  Just \"doesn't fit\" with the place.  So conclusion...  The price is high, and for that you get...  Ambience?  Doesn't fit.  Food?  Doesn't fit.  Service?  Doesn't fit?  Me?  I'm sorry, I just don't fit there, and it's unlikely you will either."}
{"text":"The sliders were good and the drinks were nice and cold. Good music during Happy Hour too. Loses one star because service was super slow. Took about 15  min to get the bill and to get another round of drinks. So expect waits."}
{"text":"I was in Toronto for work and a few colleagues took me to lunch. This place was right across from the office so it was convenient.   I didn't want anything too heavy for lunch as I had an important 2 hour meeting directly after. I opted for the spinach and strawberry salad and added grilled chicken. I also asked for the dressing on the slide so I could limit myself to the oil and fat.   The salad came and I noticed that it was tossed in olive oil! Who does that?! Let's take this healthy salad and smother it  in oil and fat. I was annoyed, but didn't want to be difficult so I just ate it anyway. The chicken was also very oily. It was all just ok....  My colleagues had the sweet potato fries, I had one, they were actually pretty good.   Even if I was planning on returning to Canada anytime soon, I would not revisit this place.  The decor was pretty neat/trendy and I hear it's a good spot for HH drinks, but the food was just meh."}
{"text":"Two things stand out in my mind about this visit--the staff was great, the sort of mind-reader staff who appear with drinks before you realized you were nearly empty, and the room was *loud*. They need something to absorb all the sound in there. We were eating with the after-work corporate crowd and they know how to shout to one another.  The meal was very good over all. My ribs were falling off the bone, delicious. The calamari was light and not over cooked the way a lot of places manage. The creme brulee was delicious. However, the key lime pie's serving--and yes, I saw it was a \"don't bother sharing\" kind of dessert according to the menu--was still a little small and quite frozen.  Overall, delicious but a little pricey. My waitress--a girl with tattoos you could see in the V of the back of her dress--was brilliant and that may be what sends me back. She let my girlfriend and I have a nice long meal to play catch up, never rushed, was very prompt, brought new utensils and drinks without us asking.  Generally, a great experience."}
{"text":"Great Pountine.  Great service. A bit pricey but overall pretty good. The staff was INCREDIBLE and the atmosphere was was pleasant. It was a bit of the Good Ole USA in downtown Toronto. If you are in Toronto and have a few extra dollars to spend I would recommend this place for sure."}
{"text":"I was here for a friends birthday dinner. It's pretty uninspiring as steak places go. The food was alright, but for the price you could go to Barberians. The place also features a really strange decor. It's dark and sparse, feeling a bit like a poorly thought out club.  I thought the service was fine. Our waitress was friendly and the rest of the staff were all very helpful. All in all, there are much nicer places to go in the Finacial District. For starters, Jump is just down the road."}
{"text":"Went for business lunch on Monday April 15, four people arrived at noon.  Restaurant not too busy.  It took a full hour after ordering to receive our steaks, mine was raw (ordered medium rare), another was cold to touch with congealed gravy/sauce.   Server did not enquire on our food we had to go find her.  Very, very poor service and food."}
{"text":"Bartenders are extremely helpful. Loved the Steaks.. they know how to cook \"RARE\" well seasoned and their horseradish has a kick when you need it"}
{"text":"1/2 star would be more appropriate.  We should have  known there was a problem when a group of seven could walk into a restaurant on lower Yonge St in the Financial District a few minutes after noon in early December and get a table.  Decor looks fine - a bit upscale furniture-shop - but we can't eat the chairs.  They plopped us into a giant booth near the window - we'd sure help it look like the place was busy (it wasn't).  Four steaks were ordered, two Houston burgers and one sweet and sour chicken on noodles dish.  Slow but not annoying service to start.  Sodas arrived.  Craaaaaaaaaaaaaaaaaash.  Three of our steaks hit the floor before they made it to the table.  The two burgers were delivered.   Nothing about the steaks was mentioned.  One steak was served.  Two steaks were served.  The final steak - my blue order - arrived.  Then things started to go badly south.  About 15 minutes after the burgers were served the mmmmmmmm something else was delivered.  Pork. on rice.  Nope.  Not what she ordered.  Server had attitude about it.  We asked to see the menu again.  Oh.  That.  ok.  Server came back.   You know that has bones, right?   A explained she wanted the sweet and sour chicken.  A while later a different server delivered something.  Plopped it down.  Here is your ginger chili chicken máam.  He scurries away.  We all look at it.   It's not sweet and sour - and it's on rice - not noodles.   Call the original server.   \"I ordered sweet and sour\" - well it is sort of sweet and sour - this isn't what I ordered - ok - fine.  craaaaaaaaaaaaaaaaaaaaaaaaaashhhhhhh  In cleaning the table next to us someone has dropped something on the glasses on the tabletop and there is glass flying everywhere.  If we hadn't been on the other side of a divider there would have been glass on the table and us.  As it was, it was on the floor next to our feet.     The table cleaner comes and stands next to our table and announces \"that's now even my job, I was JUST trying to help\".   whatever.  The female servers are dressed hmmmm inappropriately.  Several of the men at our table can't look at them -and later comment that they must have been hired for their ability to fill the dresses rather than their serving skills.   The dresses con't allow them to bend to serve easily - they do show their bras off nicely though.  The sweet and sour chicken on noodles arrives in a take-out box \"with special cutlery\" ... um when is white plastic special cutlery?    The woman who ordered the sweet and sour chicken tastes it - says ok - we all leave.   I get an email later - she threw out the chicken/noodles.  The steaks?  my blue steak was closer to medium rare.  There were a couple of comments that steaks were dry - not well-marbled.   The burgers were apparently all right - the fries were disgusting.  Another odd thing - given how empty it was, the place was bizarrely noisy.   It was supposed to be a celebratory meal - a colleague had received a commendation for service at work.    We would have done better at Hero Burger or Harveys."}
{"text":"I met my pals, Deb, Franca and Liz, for supper tonight at Houston.  Liz and Deb ordered the Seafood Linguini (sautéed shrimp, scallops and lobster meat in rosé sauce topped with arugula and citrus gremolata).  Franca ordered tilapia and rice.  I ordered the Roasted Chicken (1/2 chicken marinated in their mixture of spices and fresh herbs; served with red wine demi-glace sauce and French fries).  We all enjoyed our meals and cleaned our plates. Liz and I split a bottle of red wine.  I hadn't been to Houston before and liked it. The service was good ... Stacy took good care of us. She let us sit for a long time afterwards so we could sit and yak. I'd go back."}
{"text":"Went to check out Houston Steak& Ribs on a quiet evening. My friend,and I had their steak,and prime rib. Both items were ordered as we wanted,my prime rib rare,and the friend's steak medium.Calamari was also good,not over cooked as I feared it might be.Creme brulee,and key lime pie were also good.Forgot to order the caesar,so hope to go back to try it with their ribs next time:)Not the best,but it's not bad for a business meeting spot,3.5 stars."}
{"text":"Nice atmosphere with small booths if you like booths but are only 2 people. I liked that.  Beef sliders were pretty good and came on mini brioche buns with a cute little tomato slice on each of them, and sweet potato fries. No dipping sauce though (even though the waitress said it came with sauce), you have to ask for some. They brought sun-dried tomato mayo. The sliders also come undressed and you need to ask for ketchup, mayo and mustard.  They had 2 of the wines I like to drink on the menu (New Zealand sauvignon blanc), so that's a plus.  Overall, good portion sizes for the appetizers. The food is decent but nothing great. Not too expensive if you get appetizers but it's a steak restaurant; I wish I were hungrier so that I could've ordered a steak.  No complaints but nothing too memorable. A safe choice. In all fairness, I would have to go back and order a steak to form a proper opinion."}
{"text":"I used to work in the building here so I popped in for lunch on day with my girlfriend. We had a little bit of a late lunch so the place was empty. The remodel looks nice. The restaurant is modern looking with a dark interior and low lighting. Our server was awesome, checking in as needed but not being all over us. Our meals came quite quickly and they were delicious. I was quite shocked to read other reviews at how bad the food was as I had completely the opposite experience. Maybe their remodel included a new menu, chef, or manager?"}
