{"text":"Favorite place to eat in Chinatown as a student.

Cheap + Fast + Authentic = Perfect quick meal.

Don't expect amazing service. All they want is to feed you and turn turn tables. I don't mind because I'm only there for the food anyways. If you want a quiet atmosphere, bring earplugs.

If you are in a rush, order the noodles/congee.... Less than $5 for a meal and it'll come out within minutes."}
{"text":"Food is good, but it's VERY busy and loud, so single or double patron will likely need to share a big table with multiple patron.

One of my favorite is their BBQ with rice / BBQ with noodles. I love their congee too!

Reviewed during: Mon - Fri Lunch time, Sat/Fri breakfast
Service Speed: 4.5 / 5
Cooking speed: 4.5 / 5
Food Quality: 5 / 5
Food Quantity: 5 / 5
Price: 5 / 5 (not expensive)
Cleanness: 4 / 5 
Repeat: Yes"}
{"text":"I only started venturing to House of Gourmet after realizing that King's Noodle is not open on Wednesdays. 

The food is decent for the cheap price, and service is relatively fast with about the same kind of standards you would expect from any other Chinatown joint. 

I have found that their congee (lean pork and preserved egg) is not always consistent in terms of taste and texture, which is why I tend to favour their noodle soups.

The beef rice noodle soup is usually my go to, it's generally very tasty, always comes out hot, and they give you a decent amount of beef. Sometimes they throw in bonus lettuce leaves at the bottom of the bowl, and sometimes they don't (I suspect they either run out, or they become sloppy with the prep). Beware that if you are a slow eater, you probably should not order any sort of thick rice noodle soup. The noodles will expand, your broth to noodle ratio will dwindle, and you will struggle."}
{"text":"Food was pretty good but the service not great. I ordered orange beef and asked for mild spice and think I can just feel my mouth again after eating there 3 days ago. Oddly, the plate of food was super small where the tables around us had heaping platefuls of food per There are so many options in Chinatown I think I'd pass on this one"}
{"text":"We usually have family dinners here. The Cantonese fried noodles, deep fried shrimp, sizzling beef, turnip cakes, and lobster are favorites. The only thing I didn't like was the lemon chicken(no taste) and the starter soup(way too salty).  Sometimes there is a bit of a wait for groups of 4+."}
{"text":"This must be the most over-rated restaurant in Chinatown. I decided to give this place a try again after a terrible takeout in the past, and this time it was worse! $14 for a suuper greasy, *tiny* portion, no rice included. Maybe sitting in would be a little better, but DO NOT order takeout from here. I should have known better than to try it again, but hopefully this review can prevent others from feeling scammed."}
{"text":"This is a fairly standard issue Hong Kong style Chinese restaurant right at Dundas and Spadina, complete with roasted meat hanging in the windows, mile-long menus, and no-nonsense service by wait staff with no interest in being friendly.  Food is generously portioned and served piping hot, usually within just a few minutes of ordering.  I like their Cantonese fried noodles  (????). Shovel-sized portions of fried rice are served in a pie plates.  I always leave with a couple of doggy bags.  It's worth a visit, especially if you are pressed for time."}
{"text":"The food at this plain-looking restaurant is decent.  The service, however, is truly atrocious.  I've come here a few times in a few years, and there was never a single time where I wasn't forced to share a large table with two or three other unrelated diners.

But if this used to be just an average, passable place, it dropped to the level of unacceptable two days ago.  I ordered a very simple combination BBQ with rice and got so little BBQ pork that I had to check if they'd brought the small instead of large portion by mistake.  (They had not -- I was charged for a large portion.)  I asked for two glasses of ice water from the waitress because on average, I drink three to four glasses.  A jug of water was brought -- I hadn't asked for it, but usually I find that a convenience.  It turns out I didn't finish the glass, and when the waitress came to pick up the dishes, she actually uttered curses within my earshot because, apparently, I should never have asked for two glasses and it was such an unfair amount of work for her.

Unbelievable.  If somebody else actually thinks asking for water is an unreasonable thing at a restaurant, speak up.  Otherwise, that is the last time I'll be going to this place."}
{"text":"A large variety of foods to choose from ranging from barbeque meats to seafood dishes where the prices are inexpensive and reasonable! This is the place where you get your moneys worth where you can choose from over 100 meal items! The serving sizes here are huge and the food quality is better than expected! House of Gourmet is the best restaurant in Chinatown to find tasty quality BBQ meats! I love it here! I've been going here for awhile now and every time I do, it gets more and more delicious! This place is good for BBQ Duck & Pork (very savoury) and its suckling pig which is VERY crunchy! (very good together with white rice) I also like to order my all time favourite Crab Meat and Fish Maw Soup (with some pepper on the side for a little kick) which is very mouth-watering and can warm you up on a cold day. The veggies here are also good and fresh since the restaurant is so close to the Chinese super market, they buy their vegetables fresh everyday. Just make sure you eat during the lunch hours because that's when the BBQ meats are at their freshest! Otherwise if you eat here during dinner, the meat sometimes turns out to be stale."}
{"text":"I came her for lunch, and ordered a roast duck wonton noodle soup. The duck could have been roasted a bit more, and some of the noodles were still clingy with each other. For the food alone, I would have given the place 2 stars, but the price of my dish was $4.50. For that price, I give it an A-OK."}
{"text":"I feel like I've walked into an episode of MADtv and Miss Swan is our server. 

She barks at us like we are soldiers in training. She waves the menu in our faces, while condescendingly informing us that we will never have things like pure shrimp dumplings or brown sauce on Canadian broccoli. She throws the plate of dumplings like it's a frisbee and disdainfully shouts: \"There, your dumplings\". 

As I look around, I realize that this is par for this establishment, and part of the 'charm'. I call Miss Swan over, tell her she's a little crazy, make friends, and order what we came for.

The menu here is complex, overwhelming and hard to decipher for a first time visitor. It seems there's everything you could desire but apparently, there isn't. The Shrimp Dumplings are delicious and perfect. The General Tao chicken is the best I've had: perfectly breaded, tender and balanced in sweet and spicy. The Sweet & Sour Chicken is equally as good. I'm not going to lie: the food here is delicious and worth it.

I'd highly recommend studying their online menu before your visit. If you've got a tough skin and willing to brave the brutal service standards here, you'll enjoy a great meal."}
{"text":"While in Toronto, I decided to check out the Chinatown for dinner. I decided on House of Gourmet after looking at several places on Yelp.

This place had not 1, but 2 large and extensive menus! To be honest, I was a bit overwhelmed by all the choices, but I decided to go with the \"regular\" menu instead of the \"combination\" menu. The former had cheap, and I mean CHEAP, noodles!

I ordered the roasted duck and dumpling noodles. I got 5 pieces of duck, but unfortunately, there wasn't much meat on each piece. The dumplings, on the other hand, were very good. There were way too noodles in my soup, but I usually find that this is the case for most restaurants I go, too.

My parents ordered an off-the-menu chicken and dumpling soup and a beef noodle soup. The chicken pieces had a lot more meat than the duck, but for the most part, the noodle soup was good but not great. The beef was delightfully more tender.  

To share, we also ordered broccoli dish with curry sauce, which I found a little odd; there was also a little too much curry sauce. I had to scrape off the extra sauce. Overall, the food was good, but not the amazing.

The service was nice, and the decor was much better than usual Chinatown places. The owners actually put in effort into making their restaurant look decent with recessed lighting and some black panel-ed walls."}
{"text":"Not HK, but you're not gonna jet off every time you get a hankering for roast duck or bbq pork.  Mind you, it's getting 4, for what it is, relative to competition in area; compared to hk, i'd give this a 2 - 2.5, but for dtwn Toronto, at these prices, yup, 4 for value, cleanliness, and near-ness to authentic.  I feel safe eating here.  Jodie Foster's safe room for bbq.

PLACE

Sometimes, in C-town, the food's good, but the place's a pit, or it's just located subterranean : ) They did a good reno here, tables spaced out aplenty, doesn't feel like the Asian Legend Confessionals, side by side.  Feels clean, not bad for area.
I go to Asian Legend to catch up on local gossip.

FOOD

Busy, stuff`s fresh, as you may peruse hangings in window.  I find that when you dine in, they tend to pick better cuts.  If you do buy for takeout, remember you can always indicate which slab, which rib of whole pig, so on, so forth, you`d like, and, remember, that whatever you ask for, say, $5 of bbq pork, it`ll always be, is $6 or 7 ok?

Shrimp wonton egg noodle, really, for a pittance, you get 5 big suckers, plus, for me, a double-serving of egg noodles, always reach for the hot sauce in the silver mini-teapot, mix it up with red vinegar and soy sauce to your liking for wonton dipping.  Most folk sprinkle generously white pepper on soup.  Too bad this joint is a bit short on the veg in this dish.  Maybe the house special wonton noodle has got more veg.

Roast Duck.  Not bad.  On par with anything in area.  Add that to the fact I don't mind sitting in this resto for 15 - 20 min, it's a win for me.

SERVICE

Now, now, when it gets busy, as it is across pond left, you get seated at the big rounds, the group tables, also double as communal tables, totally fine, go with it.  You're given a plastic tag with a letter and number, this will correspond with your bill, pay up front, I always do, don't think they have one of those wireless card machines.  

Credit's fine, if bill's over $20, if not, still fine, but you'll be charged .75 fee.

No designated waiter, grab anyone you see, whenever you need someone, plenty circu., pooled tips, surely.

The service is efficient, don't expect to gab, regulars get a bit more banter, but the service can only be quick if you're quick, so, ya know, forego the hemming and hawing, try some kind of bbq meats combo platter, as for the rest, just say, send me a beef or chicken dish, give me a soup, let your server pick for you.  Stay away from the sweet and sour and general tao variety, same goes for chop suey, say give me sth most reg chinese families would order.

Soup, veg, 2 meat dishes, white rice, stew, fish, etc.  Really stir it up, try the rest of the menu.

My lunch of wonton and duck rice bowl came out to 10 bucks.  Could easily feed two of me.

For those of you sold on the lore of Kom Jug Yuen, this is considerably better.  Honestly, KJY grosses me the f out, how do you ppl eat there?  Or eat out from there?  Fraaaaaaack, do you also dumpster-dive?"}
{"text":"My family and I been eating here for over 15 years and its our favorite place in Chinatown. Fresh, lovely service, delicious. 
Be prepare to wait in line during the weekend, and make sure to get the lobster or duck combo: a great offer!"}
{"text":"I didn't order what everyone else ordered so maybe that's why not everything was as good as I thought it was going to be based on the reviews. The baby crispy suckling pig was awesome.  Crispy skin, not too hard, small layer of fat that wasn't chewy or too greasy with great flavor.  The baby bok choy in garlic was solid.  The veggie tofu dish was pretty boring though."}
{"text":"Props to anyone who can actually remember the full name of this place. Not sure it's a house of gourmet, but the selection is vast and the servers are patient. I had a wonton & Bbq duck soup which was good, but the duck was a bit sparse. There are some cheap options on the menu if you just want an inexpensive meal."}
{"text":"Great value for your money. Very fast. Roasted baby pork not worth it, but the BBQ pork was really good. Will return."}
{"text":"My family and I always come here for dinner. It's nice having a noodle & congee shop also serving traditional Chinese course meals.  The servers are friendly, and the food comes out quickly. The only let down is that sometimes when you order the same dish on a different day, it comes out differently, and the quality of the food changes. Not sure if different chef's are cooking the food, but they should all have the same standard when it comes to cooking the dishes. Everything tastes swell, minus the dessert as it it mediocre. But compared to all the other downtown Chinese restaurants, this one is still my fave!"}
{"text":"I used to like this place for take-out BBQ and roast items, but the last two times I visited there was blood splattered in between the bones. Not cooked blood, raw red blood."}
{"text":"My regular go to place for a meal whether it be late night or normal meal times. Tasty, decently priced food with efficient service. 

I regularly order noodle soups, entrees on rice, set course meals with lobster, seafood and fried noodles. Always made quickly with fresh ingredients. You can also request items be made with no salt, less salt and no MSG. 

My favourites are ma po tofu on rice, pan fried rice noodle with beef and bean sprouts, grouper with celery, snow pea leaf with garlic, chicken fried noodle, Chinese broccoli with beef, lobster with ginger and green onion, steamed tilapia, soy chicken and roast pork on rice, shrimp dumpling noodle soup, chicken with black bean sauce on rice and preserved egg and pork congee."}
{"text":"The service was fast.... But the servers didn't even check on us once... We had to constantly wave around... The food had a weird smell to it.... We ordered bbq and roast pork... Honestly wasn't what everyone says it is... It was cold..and smelly...tasted old.... We ordered a vege low mein... Which had no flavor...also smelled... Tasted like it was cooked in old water and that's it.... The crunchy chow mein noodles were okay...their general tso seemed to be the best ...while their beef in some sauce wasn't great cause the sauce was horrible..."}
{"text":"This is my favorite Hong Kong Restaurant in Toronto. They have great breakfast, lunch and tea set with very cheap price. The most expensive set is less than $6. I highly recommended this restaurant to everyone who are interested in HK/Chinese food."}
{"text":"Bad greasy and oily food. Chinese cuisine at its worst. Bad, harsh and unpleasant service on top of everything. The bubble tea was the only \"okay\" thing. At least it wasn't expensive. Never again."}
{"text":"Love Peking duck but live on a budget? Then this restaurant is for YOU!  They have a great deal for dinner - Peking duck 2 ways + soup + 2 dishes from the menu for $42.  Excellent deal.  When I lived in the area, we used to go here all the time.  They have a similar deal for lobster and crab as well.  

You can't go wrong @ House of Gourmet!"}
{"text":"Nice place, the BBQ pork is very tasty! But the waiting for the line is crazy when we came for dinner."}
{"text":"Absolutely love this place. Food is always good and served quickly. Staff are attentive. I've been eating here for years and i will continue to do so."}
{"text":"Good. 
Downtown prices compared to suburbia   
Couple extra bucks. This ain't no congee Wong/queen but overall very decent. 
Agreed: spicy Singapore style turnip a MUST 
LLBO
Open late"}
{"text":"I've been here about 5 to 6 times for lunch, afternoon snacks and for dinner. Each time has been an utter disappointment. I'm completely astounded why this place even has the ratings it has. Here are some of my experiences with the food here: 

\"Soup on the House\": This is the soup they give you for free when you have a dinner combo there. Very very salty and undrinkable. 

\"Baked Seafood Rice\": This is one of the things on their afternoon tea menu. I didn't have high expectations (given that it was a Chinatown restaurant) but it still managed to disappoint me. Too much MSG, cream sauce done poorly, etc...

\"Pork Shank with Noodle\": The worst dish I've had in this place. Pork shank was tasteless and marinated poorly, noodle lacked a bouncy feel to it and soup was complete bowl of MSG.

\"Fried Spareribs\": Again meat lacks texture to it and overfried. 

There's some other dishes that I've had (veggies, seafood, etc.) and they've been almost or equally disappointing. I understand that the prices are cheaper but there are better Chinese places in downtown Toronto."}
{"text":"Best wonton noodle soup around, that's all you need to know, and that's what awards this establishment a 5 star rating. The other dishes are good too, and fairly well priced.. but definitely try the wontons."}
{"text":"If you want peking duck served in two courses at a reasonable price, this is the place.  The first course:  bronzed, juicy, melt-in-your mouth richness elevated by the spicy/sweet hoisin and the greasiness cut with the shreds of green onion and cool sticks of cucumber.  The pancakes are hot, thin, slightly sticky/sweet, and there are plenty of them.

For the second course, you are better off going with the \"boneless\" option.  I have had both, and though the boneless option is greasy, the bone-in option is almost impossible to eat in polite society.  It is hard to get at those miniscule bits of meat hidden in all the bones!

I would also recommend the seafood and vegetables in the taro basket and the fresh steamed fish.  The fish, of course, was super fresh.  They have fish tanks there.  The scallop/shrimp/squid in the vegetable stir fry were resilient and not mushy and seasoned lightly but well.

Avoid the house brisket, though.  I ordered it by mistake, thinking it was the brisket/turnip stew.  What came was thinly sliced grey meat spread out on a plate carpaccio style.  It was just boiled meat, no flavour, no seasoning and just awful.

Service is rushed and rude.  There is no other way to describe it.

But I will keep coming back.  It is fast, it is cheap and it is filling...and depending on what you order...extremely tasty."}
{"text":"My second time and it's great food. The prices are reasonable for the portion and quality of food. I would recommend this to anyone that can appreciate authentic dishes! The service is also very good!"}
{"text":"I have been dining at this restaurant off an on for over 20 years.  just have a take out of 5 dishes.  The food still taste great.  But the portions sizes has greatly reduced.  They used to have take outs in the rectangular or circle size aluminum containers.  Now they are using black plastic with clear covers and the portions are more than 1/3 less.  I can almost eat one container myselft. Guess I will have to buy twice the amount of food.  I really still like the restaurant."}
{"text":"Really happy that we found this place in Chinatown. The food was fresh and tasty. Outside was a little discouraging but the inside was better and no plastic tables clothes! We had to remind the staff a few times about our Coke order and the bill but the food made up for it and the prices were pretty good for the amount served...had leftovers to take home. I don't normally eat leftover chinese but loved the food so much I ate it the next day too. We will definitely be going back."}
{"text":"Very good food experience in Toronto Chinatown.

It is clean, organized, air-conditioned, and pleasantly decorated.

The food was excellent: large portions and delicious. We tried hot and sour soup, barbeque pork fried rice, General Tao chicken, seafood chow mein, and deep fried jumbo shrimp. All were excellent. 

Good prices.

Highly recommended."}
{"text":"I've been frequenting this place for the past 5 years. By frequenting I mean 5-10 visits a month. It's a great casual place for Cantonese cuisine at decent prices. They have the best bbq duck and bbq pork on Spadina plus a large selection of other items."}
{"text":"Terrible service. Server lady got our order wrong, and blamed her mistake on us in a very loud and condescending tone. She refused to apologize or remedy the situation. The restaurant is dirty and the whole seating arrangement is disorganized. As for the food we could not finish it and by the looks of it, the people with whom we shared the table with couldn't finish it either."}
{"text":"In town for Taste of Danforth, and was in the mood for \" real\" Chinese. Outside of NYC , IMHO Toronto has some of the best authentic Chinese food.

I have eaten at King Noodle on Spadina many times and it is my favorite. However at 2 am on a Saturday I took a gamble.  Glad I did. As for the food, very traditional, home cooked very tasty and fair price for the big city.  

Ambiance , well it's a late night Chinese restaurant in a major metro area. It can be loud, plain and a little rustic. However, if you're looking for REAL Chinese food at a great price, I recommend.  

I had stewed noodles with roast pork and BBQ pork, w a side of baby bok choy.  The roast pork, think thick crunchy skin with mild , tender flesh, was very good.  Right on par with King Noodle.  The BBQ pork, while tasty, was not nearly as great as King Noodle, to which there are no equals in Toronto.  The thin yellow egg noodles were cooked al dente and were very delicious, hot from a steam bath. The baby bok choy was a very large portion that really should be shared with 2 or 3 hungry people. They were mild tender and served piping hot.

The waitress was quiet, spoke little English, and was polite and smiled. A gentleman who I assume was the owner also helped take my order. Although he sincerely made every effort, it was clear he spoke NO English. His sincere attempt to do so I found comforting and pleasantly amusing. He was verbose and quit animated. 

So the final verdict? Very good. As long as you go for quality over quantity and don't mind the rustic but clean eating area, I highly recommend.  If you're new to Toronto, I recommend King Noodle as my first choice, this being a contender at number  two. Enjoy!"}
{"text":"This is one of the best places in China Town lots a variety, fast and most important everything taste good"}
{"text":"Quick, tasty and cheap. They have a great selection of congee!"}
{"text":"This restaurant is very good. The food was great in quality, and was at a good price. The service wasn't as decent, sometimes they would forget our drinks. This place is great and I highly recommend this to others."}
{"text":"This place is on the top of my list whenever I need a quick bite that really hits the spot and is on an extremely friendly budget!
Where else can you grab a delicious meal for under $5?
One of my favourites is the Wonton Noodle Soup. You get five HUGE Wontons and a huge portion of noodles in a hearty soup! Dip the wontons into the pot of housemade hot sauce oil and you won't be sorry!
The breakfast and teatime specials are great as well! Always opt for the additional $1 for a cold drink (I go for the red bean drink), even though the drinks are not the best it is a lot better than the coffee or laicha that comes with the meal."}
{"text":"Went here the other day with my one and only. It was packed (at 3:30PM on a Sunday). We were contemplating on leaving because we were starving. Their hostess sat us down right away which was awesome. We were put in the singles round table. At first I thought it was weird to share a big table with other singles but I did like sitting right beside my boyfriend (as opposed to sitting across from him if we sat for a table of 2).

He ordered the House Special Fried Noodles while I ordered the Pan Fried Noodles with Beef, Bean Sprouts in Soy Sauce. Both were very delicious. We ate it all within 5-10 minutes (yes, we were that hungry). Overall, great comfort Chinese food!"}
{"text":"Typical Hong Kong style restaurant: quick and cheap. The waiters don't give you much time to pick what you want or answer any questions, but in return the food comes out pretty quickly. 

I had a pig liver with fish congee, which I usually don't eat because the liver has a strong taste and is tough to chew, but this bowl didn't seem to have any of those problems.

The beef tendon appetizer was a pretty big portion and wasn't tough at all. Soft wih all its gelatinous goodness.  

A few days later I went to eat breakfast there, and it's still like being in HK lol. For $3.50 I got a sunny side up egg (if you don't tell how you want your eggs it's automatic sunny), a slice of bacon, two pieces of buttered toast, and a small cup of hot milk tea. I would probably avoid the sausage though, it looked like a really dry hot dog. 
 
The cheung fun looks really delicious from a distance, but the taste is pretty average. What a let down :|

Overall not a bad place to go, especially if you just want a quick bite."}
{"text":"MUST GO if you're in downtown craving for Chinese food. They have everything from congee to noodles to lobsters to roast pork. Their roast pork was reaaaally good, spicy beef noodle was reaaaaally good, and wonton noodle was reaaaally good too. And the price is cheap! What else can beat that?"}
{"text":"For local area students this place is a well-known restaurant for delicious, inexpensive late night Chinese food. On par with other BBQ joints around this area, the dining menu is colossal, and there will almost certainly be something for everyone who cares to look. Atmosphere is often busy, and service spotty but efficient once you're able to flag someone down. Would suggest a bowl of noodle soup with BBQ or roast cuts on the side; delicious for a quick wintery lunch."}
{"text":"Cheap eats. Though I do enjoy some of their dishes, the service here is crap. One morning, I read the time wrong and ended up going to work super early, so I decided to come here for breakfast. After telling the staff that I was there alone and started walking towards one of those small tables for two, I literally got screamed at. I got sent to one of those big tables where people who were dining alone were seated together, which I really didn't mind. But the lady who yelled at me thought I didn't understand Chinese and started making fun of me with her coworkers in Cantonese which was extremely rude. So I made my orders to go to save my already dying appetite, and I did this in Cantonese. Lady at the cash register threw my change onto the table too. #scums #morningruined #milkteawasgoodtho"}
{"text":"This is an awesome place you can go for Chinatown area.Nice service ,delicious food,and what you need more?"}
{"text":"We went to this restaurant last night for Chinese New Year.  I'd found it based on reviews from this site and a couple of others, and all the positives made it seem a good bet.  Any lingering doubts I had quickly vanished as we entered the crowded restaurant.  To say it was busy would be an understatement!  I am so glad we called ahead to book a table, and we were seated within minutes.

We ordered a combo meal which included tofu and sweetcorn soup, crispy peking duck - first served with pancakes and plum sauce, then again with beansprouts and ginger.  We also had house special fried rice, Eggplant and shrimp in a spicy sauce served in a clay pot and beef tenderloin with chef's special sauce.  Each dish was delicious!  The rice had everything from chicken and pork, to squid and shrimp in it and the eggplant was soft and buttery with perfectly cooked shrimp.  The service was fast and furious, but polite.  It was very noisy and loud, but on a night like that it was to be expected.  It wouldn't have made a great place for a romantic meal, but as a family with 2 kids and a baby, it was perfect.  The meal came to less than 80 including tip - bargain!

Oh, and the toilets were clean :-) 

We will most certainly go back"}
{"text":"The food tasted like bad American Chonese good catered to Chinese people. Wtf???!!! The ?? was old and tough, the ???? was just okay. The corn starch crust was oddly thick and overly dry. I ordered the clams, but they were sandy and the sauce lacked flavor, yet was overly gooey. The presentation of the dishes were impeccable. But yelp, you failed me in selecting a food Chinese restaurant in Toronto. 

The table next to us ordered a steamed fish, but complained between themselves it tasted frozen. Uh, obviously it is going to be frozen when there are no discernible tanks. But they mentioned some other things about what they ordered (they were a young ??couple) that I can't recall now that made my wary of the authenticity. 

The place was really big on their corn starch/tapioca starch.

My cousin liked it, but I dare argue her mom is a bad cook of Cantonese food, so anything that isn't her mom's food tastes heavenly. 

I personally felt it was overly pricey, but I think any Chinese food outside of Monterey Park or LA County is going to be pricey."}
{"text":"Short ribs with black beans sauce - 3 stars
Seafood with tofu - 3 stars
Wonton noodles - 3 stars"}
{"text":"Once in a blue moon, Yelp lets me down. My visit to House of Gourmet last night was one of those occasions.

I failed to see what was so great about this place. I knew what to expect in terms of service (blunt) and setting (meat carcasses at the entrance; place didn't look exactly gleaming), so I'm not complaining about that. In my opinion, the meat quality just wasn't good enough, and no amount of focusing on the cheap prices can distract from that.

The chicken in my Szechuan dish came in slimy, thin pieces - a turn off to both the eye and palette. It tasted just how it looked - slimy, thin and grey. The quality of my DC's pork was similarly poor.

As for the rest of the dish, I can honestly say I enjoy the chicken Szechuan in fast-food chain Szechuan Express way more. Maybe that's ignorant on my part; maybe the stuff at House of Gourmet is The Real Deal and I'm a fool who's been misled by too many European and North-American style Chinese takeouts, but Yelp is all about giving your opinion, right? And my opinion is that I didn't enjoy my dish here at all.

The sauce was waaay too oniony and spicy. Even though I generally adore oniony and spicy food, and even though I generally LOVE Szechuan chicken, I couldn't finish more than three bites of my dish (and I was really hungry upon arrival and thought that I was hungry enough to eat anything.) Onions, onions, onions...

This place was as cheap as you'd get in Toronto, but it didn't feel like much value for money when I only ate three bites. I took the rest home in a takeout box and gave it to my boyfriend; he didn't want it and he ended up donating it to a homeless man. 

I hope he likes onions..."}
{"text":"Don't be fooled by the appearance on the outside, the inside is really roomy and modern looking.  I had the Honey Walnut Chicken, what I was expecting was breaded chicken and roasted walnut covered in a white mayonnaise-like sauce, what I got was more like cashew chicken but instead of cashew I got walnuts.  It was a great dish, probably a more accurate dish instead of the Americanized Chinese food I'm used to.  Issues I had with the place was the server we had \"Jessica\" was very brash she even missed a side of rice I ordered and also walked away when we asked her about the missing rice.  The place looked busy since it was around lunchtime, but that is no way to treat a customer.   On a side note the washrooms had a foul stagnant water smell not sure if they had issues that day but it was horrendous.  Overall, I enjoyed the food and thought the dinning area was clean.  They would have earned a 4 star, but I deduct 1 due to Jessica and her poor customer service."}
{"text":"First time coming here and the impression wasn't great. I ordered a beancurd with roast pork and rice. I expected crispy roast pork but what I got was what seemed to be old roast pork recooked with beancurd in a sauce. Needless to say the roast pork was soggy by this point. The beancurd was fine but the roast pork was supposed to have been the \"highlight\" of the meal. They do not even give a sliver of vegetable or garnish to go with your meal (King's Noodle does). Price-wise, it's pretty comparable to King's Noodle.

I will give this place another shot. Hopefully my experience and selection will be better. If not, there's always King's Noodle."}
{"text":"first time i ever came here was when my boyfriend introduced me. Almost every time we always get seafood chow mien, beef rice noodle stir fry and black bean sauce mussels. I've gotten other stuff and they were good as well. I always see people ordering their noodle soup so I am going to try it one day. It does get VERY busy and very loud, it's not a place to have a bonding conversation or anything, but just to eat delicious food and carry on with your day.

Food 5 stars"}
{"text":"I ordered pork BBQ on rice and it's delicious! I'm vegetarian and it's my cheat day today and it's worth it. My partner ordered roast duck on rice and he was not impressed coz he said it was cold and too many bones and less meat. Hehe.. it was not that bad though. We can come back and try some other food."}
{"text":"The food here is amazing and quite inexpensive. I ate at this restaurant multiple times several days in a row while on vacation. The Cantonese dishes are authentic and are the best items to order, especially their noodles dishes, e.g., with wontons, roast duck/pork, beef brisket, etc. You can also mix and match and have whatever protein combination with your noodles, available dry (i.e., lo mein) or in a soup. My favourite dishes were the roast duck + roast pork over rice, and their house special beef brisket noodles. Their menu is huge, which is good, but my only gripe is that certain items on the menu are not available before 10:30 am."}
{"text":"I've been to this restaurant a few times and it never disappoints. I'm a picky eater, but I wouldn't hesitate to try everything in their menu. Best restaurant in Chinatown by far!"}
{"text":"Decided to go to this restaurant for lunch one day, since I had seen the good reviews on Yelp. 

The waitress who brought me to the table wasn't as friendly as in other restaurants, but oh well! It's Chinatown right? Since I wasn't very hungry I decided to take something simple: noodles with won tons and dumplings. When I asked what the difference between dumplings and won tons was, the waitress quickly mumbled something of which I could only understand the words 'shrimp' and 'pork'. That was enough of an explanation to me, I guess...

The food looked pretty good and the portion was big, although the waitress had put it down rather loud and rough. It tasted pretty decent, but I wasn't impressed when I found a piece of plastic in my dumpling/won ton...!

I didn't like this restaurant and I thought it was rather rude of the waitress to ask for a tip after I had payed the bill (with tip!)."}
{"text":"2.5
Food:
Some of their foods were pretty good (eggplant with minced pork), but some were just below average (rice rolls, congee, bbq pork)

Service:
Horrible. Rude. The lady complained that we ordered too slow right in front of us. She said to my friend \"you just said you've decided but now you dont know what you want?!\" And when I ordered roasted crispy pork which was sold out, she kinda forced/recommended me to order another kind of pork dish. I said give me one more second and she rolled her eyes."}
{"text":"This is overall a consistent Chinese restaurant Chinatown.  The food is always tasty and delicious yet the price has remained competitive for years.  I believe their specialities are wonton/shrimp dumpling noodles as well as porridge.  Another recommendation is beef noodle soup, the broth is flavourful and the meat is well seasoned.  The portion will get you full but not over filling.  They also open very late and early in the morning to satisfy patrons with different schedule.   It's definitely a good place to go after late night clubbing and you want something different from Pho.  They are also in contrary to Kitchen Nightmare formula (serve small and light menu) by serving large menu, for sure you will find something you like to order here.

However, came here recently to order food to go but sad to see it tends to slip.  Ordered half BBQ goose which costs $15.99 plus tax, but it was quite disappointing because not only the colour seemed a bit dark, the meat itself tastes a little bit spoiled.  It was definitely a sign that the meat wasn't fresh and it was about to get rotten.  I didn't pay attention to its colour upon order as I thought it's due to spice and cooking technics, but its taste confirmed my suspicions.  It was so gross I actually throw away the whole box.  I used to frequent this place a lot so I guess maybe they had one bad day, and I surely hope this was a one time slip.  After this experience I'd go order BBQ item from Hong Fatt instead."}
{"text":"Fast service, decent food, reasonably priced. Can't really complain about this restaurant. Their turnip cake was really good when I first visited this place but it wasn't as good second time around. (Hence minus one star)"}
{"text":"I used to frequent this place for their noodles, which get the seal of approval for being not overly greasy. They're not great but late at night, it works.

I went last night and ordered seafood and vegetable noodles. I quickly was given a plate of beef noodles which I sent back (I do not eat meat). 

When the proper noodles quickly arrived they were very poorly prepared. The noodles are supposed to be fried so parts are crispy but they rushed it and it had no caramelization.The \"vegetables\" in the dish were just green bell peppers, very irregularly cut and utterly raw (along with giant chunks of raw onion). I am quite an expert of Chinese food and love crunchy barely cooked veggies, these were just simply raw and cold. The seafood consisted of maybe one scallop cut into pieces and a decent amount of shrimp but mostly consisted of the worst squid I've ever had. It was pure rubber: the bias cutting that helps to tenderize it was not properly done but based on the lack of sweetness it was also not fresh enough. I should have sent it back but it was late at night and I was tired and just wanted to go home so I left with the rest for leftovers.

I noticed in the leftovers that there is a piece of beef. 

Complete fail. Never returning."}
{"text":"This place is very authentic and their food is similar to what you can get in Hong Kong. It can get crowded during regular dining hours (11:30am - 1:00pm and 6:00 - 7:30pm), so try to avoid those times whenever possible. Service is good when the place is not crowded.

These are some of best items I ordered:
Roast pork on rice - I got both kinds of roast pork
Congee with pig's blood - Very good if you like pig's blood
Cow's internal organs noodle soup - You can get all kinds of internal organs here, not just intestine
Beef's brisket flat rice noodle soup - The broth is very aromatic and tasty.
Wonton and dumpling noodle soup - The wontons and dumplings are plump.
Sweet and sour pork - Delicious

Average items:
Rice rolls - The rice rolls is too thick with not much flavour.
Hong Kong style milk tea: The milk tea is just sweet and doesn't fully taste like what you can get in Hong Kong. It tastes like they didn't get the right mix of tea leaves."}
{"text":"This place was terrible. My friends and I were in town and were staying at a hotel nearby, due to the reviews on yelp we decided to check it out. We asked our waitress what she recommended since this was our first visit. She was absolutely no help. When we did order she told us that they ran out of those items by 5:30pm. We re-ordered and the food that they brought to us was either cold or bland. They never brought us drinks, not even water. I wasn't planning on even tipping due to the extremely poor service but she stood over us while we were paying the bill and pointed out 3 times that I left the tip portion blank. Never going back here again!"}
{"text":"The lunch special was the worst meal I have ever had at a restaurant.

Their baby beef spaghetti special for 5.75 is made out of spaghetti (literally spaghetti) with a flavorless pasta paste (pasta in a can at Sobey's tastes better), and an equally flavorless beef pieces. If I had to choose again, I would not pay $2 for this meal. In fact, as my friend noted, when he was 8 years old he could have probably made a better meal."}
{"text":"This is probably the restaurant I frequent the most in Chinatown, but for some reason never felt compelled to write a review until today.  Sure, I like their extensive menu choices and the spacious seating.  Service is generally friendly and price is good. This is the default restaurant for my family and I when we just want to grab something quick.  My dad usually gets the fish congee which comes in a huge bowl.  The congee is usually an excuse for me to order the cow tongue donut or the fried dough.

So why did I finally want to yelp about this place?  Because today I tried their popular Singaporean-style fried turnip cake!  My friend had previously told me it was good, but she didn't tell me HOW good! It's a very simple dish - turnip cake fried with pepper, egg and a shrimp thrown in for good measure.  For a price of $5.25, I can have this every week!

The other common dishes - wonton noodle soup, bbq rice, congee, etc are good too, but the Singaporean-style fried turnip cake is a real stand-out.

This place is an excellent example of a well-run restaurant - it's always busy even though the seating area is one of the larger ones in Chinatown.  They've got a lot of menu choices yet everything is done to a certain standard. The staff is generally friendlier than other  restaurants of the same caliber.  Renovation was done here recently, resulting in a cleaner, classier look.

remember to try the SINGAPOREAN STYLE FRIED TURNIP CAKE!"}
{"text":"Went here during Nuit Blanche in the early morning hours after walking around all night brown bagging tall cans. 

I might have had a healthy buzz going but dang was the food ever good. Had the BBQ duck, shrimp fried rice and a few other dishes that I was too drunk too remember what they were but all of it was top notch. Big portions. I think."}
{"text":"House of Gourmet is a go-to place if you want decent Chinese food quick and without a fuss.  Service is usually fast and efficient, but sometimes you feel rushed as the service is rarely friendly.  Only on occasion you would get a smile or able to engage in small talk with the staff.  A typical dine and dash place as they have quick table turnovers, plus the clientele is usually mostly Asians with 20-25% non-Asians, so the staff is usually just quick to serve. 

It's definitely a good place when you're there on a Saturday night at 9pm and the place is extremely busy; which so happened yesterday as I dined with family for a late dinner.  We were all hungry so ordered rather quickly without realizing we had mostly beef dishes and one fish dish.

Prices are reasonably inexpensive, but the food quality has gone a bit downhill over the years as food quality is not always consistent and sometimes you wonder if the items are even fresh.  Best bet is usually stick to the popular dishes such as BBQ meats or order a soup based noodles dish. 

Our dishes:

Braised beef in hot pot with bean curds, shitake mushrooms and baby bak choy was tasty, but some pieces of beef were overcooked and didn't have the melt in your mouth taste.

Beef tenderloin with chef's special sauce on sizzling plate (which is usually one of my favourite dishes) was quite bland.  The beef had no flavour, was a little chewy, and the colour of the sauce was not the usual red that is normally served.  Did the chef forget to add the special sauce? (i.e. ketchup)

Beef with Chinese broccoli was way too salty.  The greens were cooked nicely, but it seemed like the chef forgot they had added salt and just added more salt.  Definitely was not enjoyable, but since we were all hungry we managed to finished it.

Steamed fish with soya sauce was probably the best dish that night since the fish was fresh (they had fish tanks located at the back wall) and cooked nicely as the pieces of fish just flaked off.  FIsh was served with onions, ginger and coriander garnish which added a nice complement to the fish.

Overall, it was a pretty decent place for quick Chinese cuisine at an inexpensive price.  Mind you when you're hungry, you'll eat anything unless it was absolutely terrible.  Plus they have a very extensive menu, so House of Gourmet will definitely satisfy any dietary concerns and palates.

I will probably come back to try their peking duck as it was recommended from a fellow Yelper and for their lunch specials because of the very reasonable pricing."}
{"text":"I love this place.  Between 3 and 5pm the have what they call tea, where are a few smaller portion items on a little menu that are only $4.95.  Their food is consistent and reasonably priced.  Service is fast and the staff is very friendly."}
{"text":"Love this place for consistent cheap yummy eats. Lobster, crispy chicken, beef chow mein, bbq pork, and some Chinese vegetables are some basically delicious things to order. Service is quick maybe too quick since they want you out to turn tables constantly. So don't be upset about that or expect much service and you'll agree with this 4 star rating!"}
{"text":"my go to for yummy noodley soup, esp. the shrimp wonton/dumpling.  noodles are perfectly prepared and never overcooked in their yummy broth.  love the beef brisket too tho' no longer eating meat.  been eating there for years and have not once been disappointed.  my parents love it here too, even more so than the goldstone (glass noodle house we call it) on spadina!
very clean, quick and casual dining."}
{"text":"Always fast here - came here around 6 for dinner and there was a line. We were the 6th party or so, but got seated in 5miniutes. It's one of the bigger restaurants in Chinatown and some people are willing to share tables, so the turnover is pretty fast. 

Anyways, you can always count on it for some comfort foods - congee, noodles, fried rice, rice with BBQ dishes. Cheap and good."}
{"text":"First Chinese restaurant we went to upon arrival in Canada.  Food was good, the price was reasonable.  The braised duck was excellent.  Too bad that we won't get a chance to go back for we are now 3000 miles away.  Nonetheless, the restaurant still deserves a
praise."}
{"text":"a little bit salty. You must drink lots of tea! food supplied in big size! lots of people there. waiter and waitress are very friendly. we three people cost 40 bucks to get a good dinner!"}
{"text":"This is exactly what I was looking for in a Chinese restaurant. The duck was excellent and I loved the congee. The place is packed! I would return."}
{"text":"@Robert K. and I needed some quick Chinese before the Yelp Elite event at Augusta House (nbd) and stumbled upon this spot.

Seated as soon as we came in at a giant table and got our noodle soup with vegatables and shrimp wontons very quickly. It was acceptable. What I liked was how domestic beer was only $3! I splurged and got an import for $4.

Soup could have had more veg (I think it was only lettuce and three slices of carrots)- other than that, t'was nice."}
{"text":"Best in Toronto downtown... hands down!

Aalways good for lunch/brunch/dinner/late night... Cheap and taste good!

portions are also good!"}
{"text":"Ah le House of Gourmet ! C'est un restaurant où ceux qui mangent seuls sont assis à une table commune. Vous êtes deux ? Vous partagerez aussi votre table circulaire avec d'autre convives. Le menu ? Rien que 400 choix, enfin un nombre multiple d'au moins trois nombres premiers. Et c'est pas mal ! Pas mal du tout, les portions généreuses, les saveurs pleines. N'y venez pas pour un repas romantique ou la tranquillité, c'est pas l'objectif du lieu !"}
{"text":"My girlfriend and I went here having high hopes as it is one of the highest-rated Chinese restaurant on Yelp outside of Markham. I walked away with the same feeling I get after visiting pretty much every Chinese restaurant in the city - meh. 

We started with the hot and sour soup. I felt like I have had this soup a million times before and it is never that impressive. We also had the beef strip congee and I definitely enjoyed it. It felt like more of a breakfast food than something to eat with dinner but that may just be my tendency to associate a porridge-like soup with the morning. 

While the first part of the meal was average, the second part was underwhelming. The braised duck in chili sauce was dripping in a gelatinous, goopy and oddly flavoured sauce. The duck itself was was well-cooked but you could barely taste it in all that sauce. The fried squid in black pepper didn't really seem like a complete entree. It was something that you might want to eat if you had drank a few pints but we didn't want to eat an entire plate. 

This leads me to my final thought. The menu is a joke. I know this is standard for Chinese restaurants but how the hell is a non-Chinese person supposed to reasonably wade through 500 menu items? The restaurant would be far better off highlighting their specialties so that the typical restaurant-goer can walk away satisfied that they didn't make a bad choice simply because they were picking at random"}
{"text":"Restaurant: House of Gourmet
Cuisine: Chinese
Location: Chinatown
Address: 484 Dundas St W
Price Range: ~$10

1: Poor
2: OK
3: Good
4: Very Good
5: Excellent

Food: 4
Service: 3
Ambiance: 2
Overall: 3

Extra information:

*Famous for BBQ and Congee
*Lunch Special 11 to 3
*Fresh Seafood and Peking Duck special at Dinner
*Only accept Visa over $20

House of Gourmet is another Chinese restaurant located at corner of Dundas and Spadina. This restaurant is crazy busy during lunch time so get there early!

If you are not Chinese, I recommend you go with a friend who speaks Chinese since ordering might be a little difficult for you. Chinese ladies who work here will, 1) assume you are Chinese if you are Asian 2) speak really loud and fast. They are very quick and efficient (always at a Chinese restaurant) but don't expect a laid back meal at this place.

First page of the menu has smaller menus/appetizers such as congee, toast, sandwiches, eggs&omelette, snack and baked rice dishes (my fav!) Make sure to look around you and check out their Special menu on the wall.

Ordered: #8 HOUSE SPECIAL SPICY BEEF NOODLE SOUP, $6.50, This noodle soup was off of their Special menu on the wall. It had good 6-7 pieces of good quality beef brisket on top as well as some Bok Choy and Green onions. Noodles were more so like udon type and it went really well with the soup. It's called Spicy Beef Noodle Soup but it's not spicy at all! We actually asked for some hot sauce and added to the soup and it was perfect.

Ordered: #62 BAKED PORKCHOP ON RICE, $7.50, This is def my comfort food from Chinese restaurants. I believe this is more so HK cafe style food so I was surprised to find it here. When it first came, I was weirded out by the bright neon red color of the sauce cause usually it's more so orange'ish color. This came with 3-4 pieces of large porkchop pieces with few bones inside. But even after you cut out the bones, this dish is def big enough to be shared by 2 girls. Underneath all the porkchop pieces and the sauce, it's all fried rice. Not much goes into the fried rice except carrot pieces and eggs but it's so good with the sauce. The sauce was tad too sweet for my likings and it reminded me just a little too much of sweet and sour sauce but it was still very delicious.

The bill came to $30.51 for 4 adults.

Summary: This will be my go to place for Baked porkchop on rice dish if I ever miss Vancouver and their HK cafe food :)"}
{"text":"Yesterday, four of us attended House of Gourmet for a second time.  I had what was without doubt the worst Chinese food I have experienced in over 50 years.

We ordered the Peking duck combo so highly recommended by several reviewers. The stir-fried duck was hacked to pieces and mediocre at best, certainly not worth the price. The beef short ribs were bland and did not justify the effort of eating them. The mixed seafood with vermicelli and vegetables in hot pot was a disaster: the seafood was mostly squid, which didn't trouble me terribly despite its toughness, but the vermicelli - glass noodles to be more exact - was cooked to absolute mush as was the baby bok choi that accompanied the dish. The ingredients could not have been blander if they were simply dropped into a big pot of boiling water. Were they? The snow pea greens in garlic were OK but not as good as I have had elsewhere.

No complaint about the staff who were actually helpful and quite attentive. But at $20 per head, I expect a modicum of quality in the dishes served, not complete mediocrity.  I have absolutely no intention of returning to this place ever."}
{"text":"Been here twice. The first time my bf and I felt a bit sick after we had dinner here. But then we went again and wanted to give it another try.

The food was ok. But it may have MSG or just be too salty, I got so thirsty afterwards. 

I won't go back again, it is very average in general. But my two experiences here were not pleasant. Just personal opinions."}
{"text":"Enjoyed this tea house with the family today. Liked the food, ambience and service. The food was delish and arrived quickly."}
{"text":"One of the best Chinese restaurant in Chinatown. Good food and prices. I come here often when I'm nearby. :)"}
{"text":"This is a local place. I was a little wary from the three star Yelp rating. We came here for breakfast and order two noodle soup - a duck and beef noodle soup and chicken and roast pork. The food is good and come with a generous amount of meat and noodles. The soup had good flavor. 

This is a good value for good food and would come back to try lunch and dinner options."}
{"text":"The menu is large here and I only really stick to a shortened menu of noodle soups, congee and some roast meats.

Beef brisket noodle soup for $3.99 is a frickin steal!!!  The congee is alright here as well as some of the roast meats.  I like sticking to the noodle soups though especially at the price.  I'd give 4 stars to the noodle soups and 3 stars for most of the other things.

Seriously people why are you coming here getting full meals?  Stick to what's awesome here and head out to some of the other restaurants for dishes!"}
{"text":"I came here every Sunday with an ex-boyfriend and we ate congee here after a long night of partying (i.e. watching Netflix and going to bed at 9pm). The servers are quick, efficient, and will not make chit chat with you. Low prices are low. Good food is good."}
{"text":"Wonderful Chinese food.  Very reasonable price.  The dishes are surprisingly light in salt & oil, very atypical Cantonese. No MSG that I can detect.  The service is very friendly, unexpected for a Chinese restaurant.  Decor are simple. I had great Peking duck 2 way, bbq pork.  Best casual Chinese food I had in Toronto.  Better than most LA restaurants.  A real gem."}
{"text":"This is THE place in Chinatown for cheap, delicious eats. Service is quick and no-nonsense, the portions are generous, and the food is delicious. Their menu has a lot of variety and the food is consistently good. They do Chinese fast food (wonton noodles, fried rice, etc.), Hong Kong style breakfasts, and dinners. Some things I recommend getting:

- The Yeung Chow fried rice. You can get this at tea time for $4 with a milk tea, but the portion is a little smaller than the menu option. Still, it's consistently delicious. The yeung chow fried rice here is the standard against which I hold all other places to.

- The wonton noodle soup. Big, juicy, delicious wontons. Can't go wrong.

- The (I'm not sure how to translate exactly) clear-soup (ching-tong) beef brisket noodle soup. This is the only place I've been to around the GTA that makes beef brisket noodle soup this way. Other places have a thicker, chunkier brisket -- which isn't bad -- but I like the House of Gourmet version more. The brisket in this disk is thinly sliced, not Pho thin, but thinner than other places, and the soup is less salty. I get this dish most of the time I go to HoG. Best of all, it's only $4 or so.

- The fried rice noodles with beef (dry style?): . You can get this at a lot of places, but rarely is it ever as good as it is here. This is also on the tea time menu as a slightly smaller serving with milk tea, but again, it's still really really good.

I order these 4 things about 80% of the time I go here, but HoG has a lot more to offer. Try different things because it's hard to go wrong at House of Gourmet."}
{"text":"Went there tonight.  It wasn't as good today for some reason.  I ordered the home-made ice tea and it was great.  But that's all that was great.  We had the general tso chicken and it tasted raw and there seem to be more batter than chicken.  And their chow mein portion was so small and again the chicken seemed raw; and the sauce was pasty and greasy.  Last, we had egg rolls and they were soooo greasy too....

I still rate it a 4 b/c this is the only time I ate here that was a miss.  Just remember it's nothing fancy - just straight rustic Chinese food at a daily price you can afford."}
{"text":"I am judging this place solely on its General Tao, because its really the only thing I order when I go here. Amazinggg. Best Ive ever had, hands down. What can I say, when I like something, I stick to it.

A little too much glaze stuff on their veggie dishes, kinda makes me think of alien movies and slime...not great.

Usually super fast service, big tables that are great for groups and usually busy until about 2 am.

oh, and watch the servers if you order a pop, they like to put your straw in your can with their fingers. Eww"}
{"text":"We go to house of gourmet about twice a month for the last 5 years,  and the food is  decent.  I love the tofu sizzling hot plate, the cheung fun and many other dishes.  

This review is on their customer service, we ordered 5 dishes yesterday and one of them was 2 kinds of bbq.  We chose duck and soya chicken.   When the plate arrived it had one chicken leg (just the leg not thigh attached) and the breast bone of the duck that was skin and no meat.

We called the waitress over and told her this was unacceptable for $9.  She said we would have to talk to manger because we had already eaten one piece of the duck.  The manager/owner argued for 15 minutes with us (while the food was getting cold).  She told us that some people just like bones and skin?  REALLY when you order meat i think you want meat.  She also said, she couldn't sell it again because we ate one piece.  Ewwwwee they would actually sell it again?

I didn't give up i told her that customer service was about making your clientele happy, and that we spend $$ in her restaurant,  we do like the food, and we come often and spend at least $60 a visit, but her count on this bbq dish was not acceptable.  For the record i'm not cheap  i would pay $20 for the dish if the count was good.  This looked like left overs.

She finally relented gave us a soya chicken breast and a duck breast and said next time don't order that dish, lol.  There won't be a next time.  and she kept touching my shoulder over and over again with each stupid point she made  it was creepy. 

She actually had the balls to say that if she did this for us she would have to do it for everyone else that complained??  dumbfounded on that response.   the waitress also told us we were wrong.  

Very disappointing, since we do like going there, but alas no more for us."}
{"text":"Always thought this place was the best and cheapest for Cantonese style Chinese food til a really bad late night experience in which beef and tofu on rice came out completely inedible. The overcooked beef and tofu both came out doused in Americanized-takeout cornstarchy gravy. Both had little or not flavor and very strange textures--the beef was barely edible as it had a kind of old freezer burn taste and crumbled In your mouth as if there were too much tenderizer used on it, but frankly it was just overcooked and tasteless. Couldn't finish it. 

My own beef brisket noodles had strangely cut noodles that were either too long or too short, and the beef cuts were particularly gelatinous and lacking in actual meat. They also forgot the iced milk tea. Only get the stir fried noodles here guys don't get anything else!"}
{"text":"My Favorite Place!!!

Four years ago, on one of my many trips to Toronto to visit my homies, I passed by House of Gourmet. The delicious roast ducks hanging in the window caught my eye, so I walked in to give the place a try and rest is history.  I am going to be honest about my bias right out of the gate: This is my favorite restaurant ever.  However, I give it this rating for good reason: it has seemingly endless varieties of amazingly delicious, authentic Chinese food.  Besides the enormous menu, the service is always prompt and no-nonsense.  Their roast duck is always a favorite of mine, as well as their shrimp dumpling noodle soup (well, I actually have several favorites). 

The atmosphere is bustling and cozy, but not too loud.  I am usually solo when I go here, so am sat at tables with other patrons whom I do not know.  I bring a newspaper, but I usually always end up chatting with patrons, which makes for a nice dining experience.  I would say 80% of the patrons at any given time are Chinese, however, within that remaining 20%, I always see a diverse mix of cultures/ethnicities - all united by their love for delicious Chinese food!!!!

Bottom Line: If you are in Toronto and are craving authentic Chinese, hit up House of Gourmet."}
{"text":"A good but not great Chinese option in Chinatown. I find myself going with my Mom, whenever I'm back in town. It's conveniently located near her condo and it's also open late.

However, despite its name, don't expect gourmet food. For a quick late night snack, it does the trick. It's the Chinese version of a greasy spoon. I actually really like their wontons and BBQ meats."}
{"text":"It was after a Yelp event nearby, I was led here by my new friend Elaine K, and some less newer friends.  I originally had my heart set on something more hardy, like dim sum, but I recently got onto this thing where I have to take other people's feelings into consideration, so I didn't say anything.

Obviously I was here with a bunch of Yelpers, which meant ordering took forever.  We finally decided on approximately seven dishes, maybe there was more.  This was the problem, the food wasn't bad, but it certainly did not impress me.  It says gourmet, gourmet tends to sticks to the cerebellum by impressing the palate.  
Maybe I should have ordered the roast duck, or tried the more extravagant seafood.  
I might come back just to do that and give House of Gourmet another chance.

There was no decor, the space looked like most Chinese restaurants, round tables with white linen.  It was a lot more bigger than I expected a restaurant on Dundas would be.  Four two five tables across, and it went in pretty deep.  This was a good feeling.  The clientele was mostly Mainland Cantonese people, with a dash of French speaking tourists.  So I guess, it's as diverse as Chinatown.

The service was efficient, prompt, and without bullshit.  It's not friendly, or unfriendly.
The waitress was clearly just here to do here job, and nothing else.  I can appreciate that.  

There was seven or us, or eight, or six.  We didn't know each other too well yet, so nobody took a risk by engaging in any in-depth topics of conversation involving sensitive topics.  Or maybe I did...damn I can't remember anything.  This restaurant really was very forgettable.  

There was a vegetarian at our table, who was considering going vegan...so naturally I (very politely) bullied him all night."}
{"text":"I thought I would be eating authentic Chinese food.  It was just so so.  If you want great authentic Chinese you have to be in Boston or NYC Chinatown.  Gets no better than that.  But their Peking duck was a nice platter.  Toronto Food scene definitely let me down."}
{"text":"Wasn't going to write a review since I thought it wouldn't be very special (only came here since King Noodle was closed at 12AM) but this place was a lot better than expected. We ordered the Shrimp Wonton Noodle Soup and BBQ Pork + Shrimp Wonton Noodle Soup. The soup was perfect (not too salty) and came with a LOT of noodles (way more than other HK places). The BBQ pork tasted fresh despite us coming in at ~1AM but could be cut more thinly, however the shrimp wontons were probably the best I've tasted in Toronto (very authentic & flavourful). Everything was great (BBQ pork could be cut better) and very filling for the price. Service wasn't the best but it can definitely be overlooked for the great food!"}
{"text":"Really good deal for peking duck. $46 for duck 2 ways, soup and 2 other dishes from the list in the menu. Really good duck slices, especially with the crunchy skin on it.

Service was fast but not that great; I asked to add ice cream to my red bean crunch drink and instead the server just brought me a cup of ice and rushed away LOL"}
{"text":"Toronto has a Chinatown second to none.  When visiting this great and diverse city, and you heard about the Chinese food, it is a must that you dine at one of so many restaurants.  We entered the House of Gourmet on Dundas Street West.  It was full of what I would say local regulars and students and families and even visitors like us.  This place was rocking with busy servers and full up tables.  We got seated just about past midway and our server came.  Some questions about the food and combos and what best way to get what we want.  Of course everything is good, so we decided to individually order one or two dishes and eat family style.  Our lady server named Jessica, barked the orders to the runners of the kitchen, and wow she had a loud voice.  So we had bean curd w Broccoli, Bean curd stuffed, Sweet And Sour Pork, Cantonese Noodles, BBQ Pork Fried Rice and a bowl of white steamed rice.  For drinks we had the hot tea they served but found the taste old and stuffy.  We asked for a fresh pot.  The food came quickly and we enjoyed trying out each dish.  It was certainly Chinese food and compared well with our own favorites.  What was disappointing was the urgency of our server to get us out and not following thru with any dessert or even offering us that obligatory fortune cookie, until we asked for it.  Why did every table get such service except ours.  Oh well, dismiss this as an unfortunate oversight.  After all there are plenty more Chinese restaurants we can visit other than the House of Gourmet."}
{"text":"Absolutely terrible customer service and I doubt their sanitary practices.

When we asked to have our food packed up, the server grabbed food that fell on our table and put it in our takeout box. It makes me wonder how they treat our food when we aren't watching. Just disgusting.

The server, Jessica Z, was extremely rude and forced us to order quickly (we weren't even there long and the menu is extensive). Once we finished and paid our bill, we were sitting for maybe five minutes before being asked to leave by who I presume is the owner. We were not loud or disrespectful in any way. He said \"You done? Okay, leave. We have people waiting\" and he tossed around our boxes a bit.

I probably won't go back. It's unfortunate because the food is decent but I wouldn't be surprised if they served food that fell on the floor."}
{"text":"Great food at this restaurant that has a lot of variety on the menu.  Late night BBQ is awesome if you are craving some roast and bbq pork.

The last couple of times I stopped by Chinatown, this is the first place we went to get a great late night meal.

However, it is kind of dirty with shady characters that always seem to hang out in front."}
{"text":"HK style diner in Chinatown with cheap food and one of the few places open late. They have $4 breakfast combos, lunch combos and certain items on the menu are only $4 (like the congees or the BBQ pork on rice). I usually get the beef tendon in rice noodle soup which is a pretty generous portion that comes out to about $5."}
{"text":"Went here with a group of 6 and was a recommended joint so I thought why not, even though I had a bad experience at another place a few doors away.

The place is busy, noisy and busy!

We were however seated quickly on one of the larger tables which I think could have seated 10-12 in total so we did close to the end of our dinner, end up sharing our table with two strangers but this was not an issue.

Decided to go for a combination of 6 dishes from the menu which I think was $59.99 in the end, not sure if we were charged for the tea but I do know a Heineken beer costs $8.

The dishes we ordered were the lobster, sizzled spicy beef, fried squid, some fish dish, chicken noodles, and I cannot remember the last one.

The lobster was great, big portion and great tastes, the beef was also okay and the chicken was...well chicken. The fried squid was a bit salty so that was the only thing I did not like too much.


The menu is pretty big so I would like to come back try a few more dishes but for now I think 3 stars is reasonable and it is definitely a place for larger groups due to the noise factor and the no frills involved in finding a place to sit."}
{"text":"An inauspicious exterior gives way to a huge restaurant when you come through the door. We were seated immediately and tea arrived shortly thereafter. The tea was pink; I wish I remembered to ask what it was!

We had BBQ pork, stir-fried gai lan and rice. Simple meal but it was so good! The pork reminded me of my mum's, but in a more Chinese way. The gai lan was perfect and helped make our livers feel better after a weekend of wedding festivities. The dishes passing us on the way to other tables made us wish we were gluttons, but there was no way to get another bite down once we cleaned up the last of the rice!

Table turn-over is pretty fast. If you want to linger, come after 8:00 pm."}
{"text":"Got 2 take outs - Fish with sweet corn sauce on rice and a BBQ duck with lo mein.  The rice dish was pretty bad, the duck was okay, but there are a few better ones on Dundas."}
{"text":"Came here for dinner with my family. The food arrived pretty fast after we ordered it. We got the fish congee, fried rice, spinach, diced chicken with egg plant and sizzling steak. The food was ok. There was nothing special."}
{"text":"Lovely place! Food is delicious and very affordable.  I come here for lunch all the time! Service could've been better but overall I'm very satisfied with the experience!"}
{"text":"Good place for some good ol' chinese food. From noodle soup to BBQ items to chow mein, they have all the favorites. Their BBQ duck was really tasty. We both got noodle soup and the soup flavor was better than average. Noodles were not over or under cooked. We also got the beef tendon appetizer plate. Let's just say we probably didn't need to order it, but it was good!"}
{"text":"Cheap, fast, good. 
You can have duck for a very reasonable price here. Sometimes it feels too greasy so once in a while is better. I would visit them again."}
{"text":"The roasted pork and roasted duck was fabulous. There's so much to eat in this area. You can never go wrong in Chinatown, so put your walking shoes on and have a good time"}
{"text":"Haha le Chinatown dans toute son authenticité! Ca crie dans tous les sens, le service est ultra rapide et on peut même partager sa table avec d'autres personnes.
Perso j'adore la gastronomie chinoise qui est tellement riche en saveurs.
La soupe de nouilles au canard laqué est un délice et leurs smoothies sont très bons !
Les tarifs sont très avantageux : profitez en si vous y allez en groupe ça peut être très sympa."}
{"text":"We were initially drawn here due the crowds of people and thought why not try it out and glad we did! Now it's one of our go-to restaurants in ChinaTown.

FOOD:

I was excited to realize they had Turnip Cake here which is not available in all restaurants. I was first introduced to it at Congee Queen but living downtown I was glad to find a place to get my fix. This dish is cubes of starchy, soft Turnip cake, pan fried with scrambled eggs, shrimp and chilies.

We always get fried rice of any kind which is always yummy, I like it because it's not oily like other ChinaTown restaurants. 

General Tao is ok. It very crusted and sauce is a little overly sweet. It's missing the spiciness I expect from General Tao.

Steamed Chinese Broccoli with oyster sauce is a simple delicious vegetable option. Its the dish we always order that makes us feel better about eating all the fried food!

3 Kind of Seafood Fried dish has Shrimp, Calamari and scallops is crispy coating of deep fried goodness. Sometimes overly salty, always satisfies the craving something fried. 

BBQ Pork is good here too. The chopping of the BBQ is done with such a flair, When I order takeout I find myself watching them chop it up in perfectly even little rectangular pieces satisfies the OCD in me.

ATMOSPHERE:

Upon coming in you are flanked with the BBQ section on the left and the steaming/soup section on the right. There are tanks of fish and lobsters at the back of the restaurants and is always busy! Sometimes seating multiple people in the same table.

Cleanliness is bare-able, I choose to overlook the sticky tables because the food is good!

Language is a little spotty at times but overall you can get your point across."}
{"text":"I go here so often it almost becomes my off work cafeteria... everything tasted very good and reasonably priced. They accept credit cards too which is a rare scene in Chinatown. 
Only thing I'd like to complain is the cashier, which is always busy and slow to get to your bill."}
{"text":"Pretty good Cantonese noodle soup. Fast service and can't beat a wonton noodle soup plus a veggie dish for under 15 bucks."}
{"text":"- solid chinese eats
- it gives me a good feeling when a restaurant is full of people. and this one normally is. (especially those of the same ethnic background as the cuisine)
- if ever i have a craving for congee or roasted pork on rice, i'm here. 
- oh and it's mad cheap - which is a nice bonus. i dig healthy competition."}
{"text":"Beijing duck was delicioussssssssss!!!!! Too bad they don't do lettuce wrap here though :( lost 1star from me for that!
Other dishes are pretty good too, my personal favorite is deep fried squid. Crispy but tender!!"}
{"text":"???????9?????????????????????????????????????????????????????????????????2??3??????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????"}
{"text":"A great place to go for some inexpensive family style Chinese food : )
It has a huge selection of choices on their menu, a bit overwhelming, but always a good thing to have more options : )
I usually get the simple soups or the rice meals such as the Shrimp Dumpling Egg Noodle Soup or the BBQ Pork Rice which usually comes with a small bowl of soup for a pretty cheap price (both less than $7). 
There is also a MUST HAVE order that I always end up getting even if I tell myself no, and that is a personal favourite: Singapore Style Fried Turnip Patties!
(This place makes them especially delicious) 

The restaurant is almost always packed with Chinese people so you know it must be good haha. The service is what you'd expect at a typical Chinese restaurant. It's not a fancy type restaurant so you wouldn't probably expect 5 star service. I also don't recommend this place for a date or anything like that cause it can get pretty loud. I do however like this place to go with a group of friends or with family.

I do like this place and if I do start to crave Chinese food again, I'll be sure to stop by : )"}
{"text":"Ventured here with a Yelp Eating Buddy (YEB) in the wee hours of the morning. The initial impression was a clean dinning area which is surprisingly well lit for a late night dinning spot.
We were seated immediately and the menus were brought in. The menu is hefty and goes on for many pages. 
YEB and I decided to go for the 2 dish combo for 18$. We choose black pepper short ribs and sizzling platter with chicken and beef. The food arrived fast and the sizzling platter got its due attention in the dinning area.
The taste however was sub par unfortunately. The black pepper ribs were slathered with sauce but didn't have much of a pepper punch. I couldn't figure out the sauce on sizzler as it was just thickened beyond recognition. 
I guess they cater to a certain late night clientele (read people trying to soak up booze with food with taste buds numb beyond recognition) and it serves that crowd well i.e. cheap, quick and a never ending menu where one is bound to find something."}
{"text":"Greasy, late night Asian food at its finest."}
{"text":"A most reliable Chinatown stop for lunch or dinner.

The food is good, served efficiently, especially, their hot & sour soup, B.B.Q. duck, calamari, and vegetable dishes (steamed bok choy is nicely done). Wine list is so-so: I usually order a couple Chinese beers. 

One cannot go wrong dining here, as the restaurant offers tremendous value, and they have recently updated and renovated their interiors, too."}
{"text":"We always come here when we are looking for food in Chinatown. I think the food is very slightly better at King's Noodle, but you get much better value at this place. 

I don't think anything in particular stands out (for good or bad reasons). Our favorite order is the roast duck, which I often just pick up to take home. It comes to around $24 after tax. 

Portions are pretty huge. Takes credit."}
{"text":"Delicious and reasonable Chinese restaurant. Crowded with Chinese people, means good dishes for them too, I guess.
It tastes very nice to me, as a Japanese, too. Shared 2 dishes with my wife and it was good enough for us. Especially heaped fried rice should be shared."}
{"text":"Food is really but the service was ridiculous bad. Went there on a sunday night, we ordered some food and were waiting it to come, the food didnt come until half an hour later but the boss already gave us the bill before we start eating. What kind of service is that?"}
{"text":"I used to live in Kensington market and during that time made it a mission to try as many of the Chinese places as my budget and time could afford. House of Gourmet ended up being the top pick for a number of reasons

 Reason number  1 was probably that my 6'2 Caucasian friend who spent a year in China lived across the street and would come in and order for us in Mandarin (Never mind that the staff here speak Cantonese), The staff always enjoyed this and seemed to have taken pretty good care of us. I'm not sure if $40 is the regular price for the lobster or duck and 3 dishes combo, but that's what they usually gave us. So much food.... 

 The Congree, Tofu cakes and all the other Catonese/Canadians standards are also quite nice.  The waiters are speedy, bordering on brisk, but what do you expect from a place that makes all its money on volume? I've always wanted to try the 3.99 Eggs and Bacon breakfast from here but never been put together early enough in the morning. If someone does, let me know."}
{"text":"King Noodle House was closed and I wanted Duck. My boyfriend wanted Cantonese Chow Mein. This was the next closest place.

We just stopped in for takeout and I ran in to order. Service was pleasant and very quick. The place looked clean and their menu seemed varied and everything on it sounded delicious (with the exception of their weird western style dishes like spaghetti and chicken coup with lunch meat).

My boyfriend gave the Chow Mein a solid 3. The ingredients on top looked fabulous-- big scallops, squid, shrimp and large crunchy vegetables crowned with fat shitake mushrooms. Although it looked great, he said it was rather bland and tasteless.

My duck was cold. :(. I was looking forward to having a nosh straight outta the container followed by a salad. But I had to fire up the oven and roast it. Not the most tender bird I've had. Very fatty and the meat was difficult to pull of the bone in some places.

I'd like to come back and try some of their other offerings as they look quite good. I will be back."}
{"text":"Me and my boy always come here for BBQ duck and noodle soup. The service is fast and efficient and they are very observant. The dishes are cheap around $4-5 for a bowl of greatness. The best part about this resto is they are open late for those late night owls and cravings. I recommend getting congee or hot and sour soup! All in all, everything is descent."}
{"text":"I haven't actually visited House of Gourmet in a few years but it used to be one of my regular haunts. The food was always great, the prices were always good, and the service, like most places in China town was always cordial and fast.

I have a great memory from many years ago when I was at the place with a few friends. One of my friends was from Hong Kong and he was talking to their waiter in Cantonese while we were ordering. I have no idea what they were saying but their conversation started to slowly escalate in volume and intensity. Another friend of mine recognized a golden opportunity. As the heated conversation rose to just a point where a number of people from other tables started to notice, he stood up very quickly and slammed his hands on the table. EVERYONE stopped and the restaurant went silent! 

It took me a few moments to get it but he had replicated a scene from a Chow Yun-Fat movie in which an escalating conversation resulted in a gun fight. Only this time, there was no gun fight. I don't remember which movie it was but it must have been one that had come out close to the event because enough customers got the joke that there was a considerable amount of laughter in the restaurant, including the waiter and our friend from Hong Kong. :D

Isn't it interesting how we are able to tie memories to food so well? :D

If you end up going to House of Gourmet based on my review, please let me know if it's still a good place to eat."}
{"text":"Favourite go to restaurant for those cold, rainy nights you don't want to cook. This restaurant is authentic Chinese with tons of locals and repeat customers. 

The service is no fuss and efficient, the price is just right. For under $10 you can go away with a full belly."}
{"text":"As close to authentic Cantonese food as you can get in Spadina area.
However, not every item on the menu are considered delicious/authentic, some of them can be horrible.
Low-cost specials available day/night.
Very popular restaurant, you will share table with other patrons during peak hours."}
{"text":"Best shrimp wonton noodle soup in Toronto!  Love this place.  Fast service great food great prices.  Sometimes crowded and you have to sit with 5 strangers at one table but well worth it."}
{"text":"Like a cliffhanger that leaves you panting for more, House Of Gourmet (someone might have forgotten to mention to them that their name isn't exactly grammatically complete...) made us vow to come back to try their other cheap and tasty dishes.

Rundown:
- Shrimp Dumplings in soup: I had them withhold the noodles; just wanted a big bowl of shrimp dumplings which were Amazing! Perfectly done...dumplings were not soggy or too soft or mushy. Huge chunks of shrimps. Soup was tasty. @$3.99, this dish is unbeatable

- Singapore-style Pan Fried Turnip Cake: I grew up eating this dish, so i have high expectations. They did it pretty well here...but not 100% authentic. The pieces of turnip cake were a lot bigger than what the dish normally would be (honestly, about 4-5x bigger than what it should be). 
Most importantly, it's missing the crunch that usually gives this dish texture: Preserved radish (chai poh). Without the chai poh, the texture of this dish is pretty one-dimensional
It also doesn't have the slightly crispy glaze on the turnip cake...they should have left it a little longer in the wok
But don't get me wrong...everything else about the dish was pretty good taste-wise. 
@ $5.50, the dish is pretty good. I'm not sure i'll order it again though, unless i'm really craving S'porean food

- HK Milk Tea. Wow. They really need to add condensed milk to this drink. It was too bitter and tasted a little medicinal?

Overall, a great and affordable meal... will be back to try other dishes; the menu is extensive!"}
{"text":"I heard good things about this place so I wanted to give it a try. I think it might've just been what we ordered, but the food we had was bad. We ordered their fried dough in rice noodle roll and baked Portuguese chicken rice. The fried dough was cold and not crispy at all. The rice didn't look or taste baked and I didn't like that they served the rice separate from the heavily battered chicken and runny sauce.

I think they're more known for their stir-frys, so that might still be worth a try."}
{"text":"This place is always packed during lunch/dinner whenever I go.
They offer dine-in and take-out options. You can grab BBQ to go

There's fresh BBQ hanging at the front of the window.
There's fresh seafood swimming around in the tanks at the back.

If you're not here to get something to go, you can sit at one of the many (large) round tables. Though, if you are dining on your own or a pair, you may be sharing a table with others. But hey, you're in Chinatown, so just call it the authentic experience. They do have seating for 4 I think, but it looks like they prefer large round tables.

Washrooms are a bit too small in comparison, however, and the way they've set up their floor-plan, if it's a full-house, you need to basically walk all the way around the restaurant to actually reach the washrooms because the tables are so close that there's no space if a bunch of people are sitting around them. But you can't really blame them there's only so much room and they want to maximize capacity.

                                                          * * *

They have two menus: a green menu, and a red menu. I'm not sure what the difference is but they have different categories and items...So I guess you're looking at a restaurant with over 400 items to choose from.

There's also lists of weekly specials posted.

In addition to all those menus, they also have special menus for

1. Breakfast 8 AM to 11 AM
2. Lunch 11 AM to 3 PM
3. Afternoon Tea 3 PM to 5 PM

Given that they close at 2 AM or 4 AM, I'm wondering if they have a midnight menu.

Given the abundance of cantonese restaurants at dundas/spadina, prices are competitive, portion sizes are pretty big. Even the ones you get from the special menus. You're looking at something like a $6 lunch and it should be enough to fill you up.

Food comes up at a good rate, and while you're waiting, their selection of teas are pretty good to pass the time. Of course, refills included.

All of the dishes I've tried so far were enjoyable.
There was some hints of rancid oil in the flavours for a couple dishes."}
{"text":"I was here with my parents and husband recently.  Man, is this place busy and loud!  We were there for lunch on a Saturday, so we were expecting it to be busy, but not as busy as it actually was.  However, the line moved fast.  

So after a fair wait, we are directed to our table and given the menus.  There are 2 menus, a regular menu and a combination menu.  There are like 500 items on each menu.  We hardly have any time to read the menu and one of the servers comes over and asks us if we are ready to order.  I had done my research with online reviews and the sort, so I knew we wanted to order the Singapore-style spicy fried turnip cakes, the Young Chow fried rice, and the General Tao chicken, so we ordered those.  She said she would put in that order and come back for the rest.  We were looking through the menu and I said out loud to the rest of my party \"how about the stewed noodles with beef brisket?\"  The server who previously took our order was close by and overheard and she took out her notepad and started writing it down as she said \"ok, stewed noodles with beef brisket.  Four dishes for four people, that's enough\" and then proceeded to take our menus.  That was a little abrupt, and we were going to order more food, but uh ok.  

The food came out so quickly, we were shocked.  The turnip cakes were piping hot, crispy on the outside and soft on the inside and really spicy.  There was a lone shrimp on the plate and some tiny bits of chicken.  I hate turnips, but this dish was delicious (it actually tastes more like fried dough than turnips).  The Young Chow fried rice was also so tasty.  Good sized shrimp, BBQ pork and peas.  Not too salty and not too much soy sauce.  The General Tao chicken was a little too fatty, like the chicken pieces used had too much fat on them.  The sauce was also a little too sweet for my liking.  The stewed noodles with beef brisket was by far the worst of the 4 dishes.  The brisket was not lean and the stewed noodles were kind of flavourless.

This is not relaxed dining folks, it's stuff your face and get outta there.  Service is very quick (if somewhat abrupt), food is on the most part good (depends on what you order) and the price is really cheap.  I would go back.  I've taken their take-out menus, so next time I will know what I want to order ahead of time."}
{"text":"Pretty good, pretty cheap. It's your standard Chinatown restaurant. Nothing really stood out for me, one way or another."}
{"text":"I'm from Hong Kong and this is kinda like Meh. Close enough. 

Clean place. Fast service. Acceptable bbq meat. Don't know what else I could ask for from toronto chinatown. 

Specifically in the case of Beef tripe/intestine/lung/etc (tsap) noodle though, goldstone noodle cafe is better."}
{"text":"I use this as my cafeteria as it is close to u of t, kinda. Food is delicious and has large portions for the price, but service can be a hit and miss. But the cashiers are friendly, as well as this older cantonese gentleman who works there."}
{"text":"Sadly I've been back a few times and it went from meh, to meh-er to WTF?! when I was just there over the weekend. 

So my recent visit - horribly rude staff who seemed confused about what I was ordering even though I literally just picked a number off the menu (no subs or anything special). 

Me: \"I'd like 210.\"

Her: *blank stare*

Me: the orange chicken

Her: *blank stare* 

Me: (points on menu, because the menu is huge, and maybe they don't really use the numbers when sending the order to the kitchen)

Her: \"That says it's spicy.\"

Me: Yeah, that's fine. Spicy orange chicken. 

Her: \"But that's spicy.\"

Me: Yeah...that's...fine. 

Her: *long dramatic sigh* 

She seemed equally confused by my boyfriend's order, though he also just picked something off the menu with no subs or special requests. The waitstaff seemed overworked in general looking around and flustered, so I was like...okay, she's having a rough day. No bigs.

 A pot of tea was slammed down. Yay, the house tea I remember! Woot! Then it tasted super musty and weird because they were just adding hot water to the same *massive* blob of old tea in the bottom (burnt dried chunks of....something were sticking to the outside of the pot too). Sigh. 

Our appetizers - two shrimp rolls and a spring roll - were just okay. Aldi frozen food quality with very little filling. 

The food was unceremoniously plopped in front of us both and the waitress who brought it - who was not the person who took my order - told me my food was something else, then sort of....argued with me (?) when I told her what I ordered, then changed her mind that yes, this totally was what I said I had ordered. Wink nudge. It's TOTALLY THAT THING! *waitress runs from the table*

My food could scarcely be \"orange chicken\" (marked spicy) when it in fact did not taste at all like oranges and was not spicy. At all. It was basically a rubbery pile of greasy tasteless slices of chicken with some (admittedly well-cooked,crisp) veggies. I did find a single shred of orange peel in the middle of the pile... It was in an oily, virtually tasteless brown sauce with a few sad dried peppers that even when put in my mouth weren't hot. Normally a hot pepper from Chinese food turns my face into Niagara Falls. 

My bf's pork combo was a tiny plate of grisly pork with a few shreds of veggies on the side and nothing else. He'd ordered the identical thing last time and it was a meal with a carb and other sides and good cuts of meat. 

No one came back to the table at all. After about forty minutes my bf flagged someone down and asked about the check. Literally no one asked us how the food was or my response would have been a blunt \"disgusting.\" I'm *not* a fussy eater. I'm easy AF to please and the fact I left my food half untouched means it was flat out gross.

Super disappointed. Second worst Chinese food I've ever had after a buffet in a tiny town that clearly left the same stuff out for hours."}
{"text":"This place makes amazing Peking Duck - the skin is so crispy and the meat melts in your mouth. Number 102 gets you the Duck two ways, meat carved and served sliced with pancakes & hoisin sauce and a really delicious stir fry of rest of the meat on the carcass with ginger and sprouts, its super delicious. 

Other amazing things in the menu - dry fried lobster, I can't even begin to describe this preparation - it's fried lobster with salt and white pepper. Soya chicken and pork are also on point and the ginger fried beef special is basically sweet spicy meat candy. 

It's a busy place, be prepared to have to share a table and sit tight for the waitress - no doubt worth the wait."}
{"text":"If you are not a regular they won't give you a good service. The portions that were served to us - we were four - were small compared to the other tables. We ordered a Peking duck, double lobster and clams. The duck was good and tender but compared to other places, it was very very small. They charged $0.40 for each extra pancakes we asked for (4). The lobsters that were served to us were handicaped : only one claw! Lol where the h*ll is the food!? Half of the clams were empty and definitely not fresh. And we ate somewhere else after because we were still hungry :( Disappointed with this place unfortunately. Maybe you will be luckier than us or maybe we just didn't ordered the right stuff!"}
{"text":"Prices are low here for what you get. I have dined in, and it has the typical chinese restaurant feel, and can get busy at peak hours. For take out they have a great combo with lobster + any number of dishes that is my go to when I want to binge eat all of my chinese food classics at once- deep fried seafood, ginger beef and onion, seasfood hot plate, chow mein, etc. I will definitely continue coming here whenever I need my fix!"}
{"text":"I just ordered a BBQ pork/roasted pork on rice with a side of Chinese greens and wonton soup. This is just take out. The reason this restaurant is getting such a low rating is because they just tried charging me more money on the an item that they made a mistake with. I wasn't looking for an apology but they tried to cover their mistake by telling me that they charge me for the wrong thing and it will cost me a few extra dollars. What was even more annoying was the wait time was 35 minutes for what I ordered.  Sadly, the roasted pork skin got soggy, the BBQ pork was dried and the rice was just too soft. Everything that could go wrong in a dish happened.  Would this be a one time scenario, sadly no. Chinese restaurant are never know for their customers service but House of Gourmet really showed they're true colours. 

I would recommend Sawtow or The dumpling house for Chinese food.  If you need Chinese BBQ go over to King Noodle or Goldstone. There is better places than House of Gourmet."}
{"text":"I've gotten takeout from the H.o.G. a bunch of times, but stopped in last night for an impromptu dinner when the resto I was planning on fell through. On my birthday! Good thing I'm flexible. Bad thing I was hungry. Good thing I love Chinese food. Bad thing I'm only armed with about 3 key phrases: \"HO FUN\" (wide rice noodles, my favourite), \"DA BAO\" (take out) and \"M GOI\" (thank you). Good thing my waitress was somewhat patient and managed to understand my wild gesticulations, making a customized vegetarian dish involving - you guessed it - HO FUN happen. Happy birthday to me.

From the two tomes of offerings available, we selected the Pineapple and Seafood Fried Rice ($9), Mixed Veggies and Soy Sauce Fried Rice Noodles ($8.50) and Steamed Rice Roll with Deep Fried Donut ($3). The donut was fresh and not greasy-feeling at all, though I'm sure it is. I especially loved the fried rice - expertly done with big chunks of pineapple and flavourful shrimp. All of the food came out fast and hot, with enough left over for lunch the next day (\"DA BAO, M GOI!\" I said, proudly butchering the Cantonese language).

In summation: Place is clean, service is efficient, and everything is delicious. House of Gourmet, the Chinese restaurant so nice they have menus twice. \"M GOI\" for reading. (Did I do that right?)"}
{"text":"Excellent food, great prices, good atmosphere. I come here all the time! While the service is not the most attentive (given it is a Chinese restaurant, that is not too surprising and I don't really expect that), I always come and leave here feeling satisfied -- nothing is too expensive, portions are good, food is tasty. My favourite times to come is between 3-5 because they have their afternoon tea specials or before 11am to get their breakfast special."}
{"text":"Food was excellent, but the service was so bad that I had to go with only a four-star rating.  Place is super busy.  No parking."}
{"text":"Very busy place. We've been here on numerous occasions. Each time we have been here, the restaurant is full. With decent pricing and a variety of selection of chinese food, you can expect this is one of busier chinese restaurants in Chinatown. 

If you can't handle spicy food, don't order the hot and spicy soup. Their turnip cake is really good! We order this every time we come here. 

The washrooms are surprisingly clean compared to the other restaurants around the area."}
{"text":"Everything we had was disgustingly fat and the beef and soy sauce noodles were inedible since they tasted like burned oil. I barely eat anything and we definitely won't come back again."}
{"text":"Another alternative to King's Noodle and Goldstone for your HK bbq/diner cravings. This place is fairly clean and bustling with activity and throngs of hungry diners just like King's Noodle. The prices are good, they have tons of specials and they have a delicious spicy beef noodle soup that is worth trying in cold weather. The noodles are a little too thick but the broth is delicious-garlicky and spicy."}
{"text":"The restaurant's in Chinatown survive on 1 of 2 principles - its either dirt cheap or its damn good.  This restaurant has been around for over 15 years, and has recently gotten a face lift.  

In terms of cleanliness (at least that meets the eye), this is probably as good as it gets for Chinatown.

Barbecued meats and a full view of wontons in-the-making welcome you into the restaurant.  Strangely, there seem to be more larger tables than smaller tables.  This leads to a lot of \"communal dining\" or \"dap toi\" in Chinese where you may be sharing a table with strangers.  

Service here was actually quite good.  The servers were swift, and were always around should you need something.  

They have quite a variety of items on their menu ranging from your everyday Cantonese dishes, to dishes you'd find at your HK style cafes.  

With my wisdom teeth acting up, I settled for a bowl of Sliced Fish Congee and some Steamed Rice Noodle Rolls served with Hoisin, peanut and soy sauce. 

The fish congee is not heavily MSG-ed or heavily salted, which is actually a nice change.  However, I did find that their congee was a bit on the bland side.  Nothing a sprinkling of salt couldn't fix.  

The rice noodle rolls were very smooth, but a little bit on the soft side.  Oversteamed much?  But they are still one of the silkiest rice noodle rolls I've had in the city.

I also ordered a bowl of Beef Brisket Lo Mein.  This dish comes with its usual accompaniment - a bowl of broth-based soup.  The lo mein itself was not particularly flavourful, but the beef brisket was absolutely delicious.  The flavours of the five spice, anise, soy sauce and whatever else they used to marinate their brisket was YUMMY!  The brisket was nice and soft and I would definitely order this dish again.

At the end of the day, we left stuffed for $17, including tax and tip.  

While I was savouring my meal I noticed their lobster and crab specials.  Two lobsters for $26.  Their crab and lobster also come with 5-6 different preparation/sauces.  I will definitely come back to try their Curried Crab!

Cash only."}
{"text":"Discovered this restaurant after the awesome boat cruise event this week because my friends and I were so hungry! It was a surprise in every aspect.  I'm usually skeptical about eating in Chinatown because most of the Chinese restaurants are hit or miss like Rol Saan which I will now replace with House of Gourmet. Unlike Rol Saan, this place is not overpriced and offers a wide variety of dishes and was pretty delicious! Definitely coming back here, I also liked the fact that the service was pretty friendly (which you dont usually expect at an Asian restaurant) and the restaurant itself was super clean being the fact that it's in Chinatown.

Go here if you want delicious gourmet Chinese food downtown."}
{"text":"The food here is ok. The decor is also nice. That's about everything good i have to say about this place. When we got in, my freind and i were given two completely different menus with no explanation why. One of the waitresses (seemed like she was in charge) was yelling and shouting orders loudly across the room. Each time she barked out an instruction or order i flinched. When she did come to check up on us, i asked a question about the food and she replied with a harsh and rude tone. I felt intimidated.
While i was ordering, i simply and politely asked for a fork from a different cashier. She nodded and said okay. Several minutes later she was serving an helping other tables while i sat here without the utensil i asked for. I asked a different cashier this time and she also said okay. A couple minutes later, no fork from either of them. Finally the waitress who was shouting walked by us in no hurry. My friend asked for a fork quite loudly. The waitress glanced at us and ignored us, walking away. I got up from the table and walked to the cashier to ask for one. Finally! It took ten minutes to get a utensil. 
Once the food got to us after a long wait, i went to the bathroom to wash my hands. I noticed that there was actual MOLD on the bathroom sink, which made me seriously question how clean the food is. If the staff doesn't have the time to simply add some bleach to a surface, why would they ensure each customer has clean food?? (Picture of the mold)
Finally, on the menu i saw options for shark fin. The majority of shark fins are harvested by fishers getting sharks out of the water and cutting off their fins. After that, they dump them back into the ocean with no fins. The shark has a hard time swimming and is in severe pain. I didn't take off any points because of that, but it's my own opinion.
Definitely not going back. Only come here if you want a horrible experience and mediocre food."}
{"text":"One of the few tolerable restaurants in Chinatown. It's fine when you're in a pinch for food at the oddest hours. Decent portion sizes; especially, the noodles in soup. You're also guaranteed to leave with a full belly with your wallet decently intact."}
{"text":"I am a Hong Kong born Chinese, lived in downtown TO for the past 20 years and House of Gourmet is my favourite regular joint for fair priced and authentic Cantonese foods.

Here, the menu is extensive with hundreds of variations of noodles and rice dishes. I may not have tried every single item on the menu but I have confidence that 1) your dish will be tasty and 2) the portion will be generous here. In fact, most rice and dry noodle dishes I get here are at least 2 meals for me; always have leftover for dinner or lunch the next day.

I am a noodle person and I usually go for soup noodles with beef brisket or some type of wanton/dumplings by default when I want a cheap and quick meal. Other things I normally order include rice with BBQ pork or roast pork, congee of some kind with fried breadstick/donut, any fried rice or egg noodle dishes, fried rice (I like the Malaysian seafood fried rice), fried Singaporean turnip/parsnip cake. The stuff on their lunch and dinner specials (displayed on your table) is of great value and pretty good too. From those menus, I liked the 'Portuguese' (coconut curry sauce) chicken, baked rice, any 'steak' items (I like mine cooked to medium rare). With these specials, you get the option of being served on rice or plain spaghetti, cream (chowder) soup or vegetable soup, and tea or coffee. I don't recommend tea or coffee as actually, they both taste pretty gross :) Regular Chinese tea you get when you sit down is much better. Otherwise, you can add $1 and pick any cold special drink from the menu e.g. Iced red bean coconut milk drink. Lobsters is always good too. Oh, and French toast for afternoon snack too. Like I said, most things are pretty good here. One thing I probably won't order is the BBQ duck as although it's taste and smells nice, I find there's not a lot of meat on these guys generally, more fat and skin than meat. I also won't recommend the baked tenderloin served with 'red sauce' as it's a oddly sweet ketchup sauce, unless that sounds good to you.

Also the service is good here. Although it gets pretty loud here with the staff always yelling out orders and to each other re. tasks to be done and rushing around quickly to get things done, each one of them is nice when you wave them down to take an order. I never feel any attitude and hostility like I feel at some other places (like King's Noodles on Dundas, I find the servers there grouchy and scary to talk too). Service is generally super quick (unless you order something like baked rice which take a bit longer to bake). Otherwise, it's probably an honest kitchen mistake and you can gently remind them and they will follow up immediately.

So generally, it's like a Chinese diner, good comfort Chinese food, fair and quick service, reasonable prices and portions. It's a great place considering the options here in the downtown TO area. I also like eating here because it's rather large, plenty of seatings, well-lit, well air-conditioned in the summer and well ventilated. They also recently renovated.

I highly recommend this place for casual and authentic Cantonese food in downtown TO or in Chinatown."}
{"text":"Lost on the shuffle.  Lucky i had extra time.  Ordered soup noodles with beef brisket and tendon.  Normally very fast as everything is already cooked.  They had to ask me about my order 3 times after I asked them to check on it after waiting for 25 mins. When the food finally came, taste was good and portion was pretty big.  Beef tendon and brisket noodle... the tendon was sooo soft and gooey.... mmm.  but I had to deduct a point for the service mishap. and it wasn't busy yet..."}
{"text":"Lots of choices, good food, fast service, descent prices.  This is the only restaurant in China town that we tried while visiting Toronto, but we liked it so much, we went back for a second night."}
{"text":"Once again, my family and I decided to dine at the House of Gourmet for some authentic Cantonese home style cuisine. House of Gourmet is the closest Cantonese food that you will eat unless you make a trip to Hong Kong. 

I was looking forward for to eat some of my favourite classics like Shrimp Wonton Noodle Soup and Pork Loin and Preserved Duck Egg Congee. We were not disappointed of the quantity and quality we received in our selections. Even though the place was filled with customers when we arrived, we were still ushered to a table in no time flat and were served our dishes, just a few minutes after we placed our order. We were in and out of the restaurant in about 30 minutes, which was nice for a quick lunch. 

The service was fairly decent as the waiters were very attentive and friendly in their service, despite the restaurant being very busy. Definitely, if you are looking for some comfort food that you would find in Hong Kong, then come to House of Gourmet, as you will be very satisfied for a quick, cost efficient , and delicious meal."}
{"text":"Fried pork was really good! We ordered a special menu for 2 and it was way too much food... At least for 3 or 4 people"}
{"text":"Get:
Beef Brisket with Rice ~$8
Hong Kong style milk tea (get hot, ask for glass of ice, mix and save more than $1)
5/5 food
2/5 service (don't expect smiles)
5/5 value
5/5 beef brisket
Order the wrong items on menu and you won't like it."}
{"text":"I might be over critical on this but I eat Chinese food on a daily basis so this place was just average. My dad had the wonton noodles in soup which was very good. The wonton had lots of shrimp and meats. I had the black pepper pork chop on rice which wasn't as good. The rice was a bit mushy and sticky. The black pepper sauce was very salty. The pork chop was a touch disappointing because it wasn't seared or baked or pan fried more broiled something. It was sort of what reheated pork chops would taste like. I guess their more traditional Chinese food is better but I didn't order any. Based on this I wouldn't recommend their HK Western food, or at least the black pepper pork chop or any other pork chop."}
{"text":"Huge menu.

I'm a fan of Chinese culture. I traveled to Beijing and ate the most I could there. I'm not joking when I say that the selection of food in China, was almost as wide as in this restaurant...

I looked into both menus, and took me more than one cup of tea to decide what to ask for. I ordered a bowl of shark soup, and the boneless duck with spicy sauce. My husband, the Chow Mein, and a pork/duck- noodle soup.

I thought, they would tell me that they ran out of shark soup, maybe because they needed a bigger order, or simply, cuz nobody asks for it. But I was wrong. They brought it, and it was delicious.

The duck was really good as well.

I realized you can't get disappointed in a place like this. In where the majority of customers were happy Chinese people, of all kind of ages; enjoying their perfect meals."}
{"text":"Great spot in Chinatown with non-westernized food. 
This brings back great memories of HK eateries. Lots of variety to choose from. I loved the congee with preserved duck egg and pork. The small size was big enough to share between 2 people (as a side dish). Also, you can't go wrong for $4.50 (as it's one of their \"weekly specials\")."}
{"text":"Food was good. We came here to eat \"light\" but ended up ordering like 8 dishes. The fried turnip rice cakes with onions and scallions was delish! Iced coffee was amazing as well. 

However, I'm deducting 2 stars due to our server, Jessica. Sounds like a pleasant name, I know, but she came across very loud and ill-mannered. Wanted to order a second ice coffee but was afraid we were gonna get walloped in the face for not ordering it the first time. She was always in a rush and we had a difficult time getting a hold of her."}
{"text":"This place is usually busy throughout the day.  Great variety of Chinese food and great prices.  They have daily breakfast, lunch and afternoon tea specials. Food comes out quickly."}
{"text":"King's Noodle used to be my go-to place for authentic, inexpensive Chinese eats but I think I've found a new favorite.

It's larger, has an extensive menu, and seems to be a bit better value. Service was surprisingly fast. The BBQ duck was delicious and I had some sort of creamy seafood soup that I've forgotten the name of that was surprisingly the star of the meal.

This may certainly become my go-to place when I'm in the area!"}
{"text":"Excellent. The shrimp dumpling soup so good we returned the next day for more. Beware portions are very large ."}
{"text":"I did notice the aforementioned \"face lift\" done to the dining room (upgraded cash area; new floor tiles and paint job) on my last visit, and the food was also much better than what I recollect."}
{"text":"My go-to Chinese restaurant downtown. There is a huge menu with a lot of variety. Food is great and is served promptly. Service isn't always the greatest, but they tend to be friendlier if you speak Cantonese."}
{"text":"Always fantastic food with great prices. I went every weekend for a month in the summer. The owners are always friendly. If you are going later in the evening or late, don't order the tea (milk tea) or coffee. They boil it all day and by then its completely gross. But other wise, I've never had a bad experience here."}
{"text":"I have been here a few times. The prices are good,  on par with other chinese restaurants in China Town. The restaurant is consider clean and the seating is satisfactory. You can even share a table with strangers at a large table.  This typically happens when all the other small tables are full and u didn't want to wait. The food quality is satisfactory and the portion size is on par with other chinese restaurants in China Town."}
{"text":"Solid Chinese fair. The Chinese broccoli was outstanding, we also tried the squid and scallops which was fairly tasty as well. They also had nice selection of cold beer."}
{"text":"I was meeting a friend for dinner at chinatown after work. Suppose to go to Rosewood but they are currently renovating. Decided to come to House of Gourmet instead. Ordered their two dishes combo: Bean Curd with Broccoli and Cantonese Fried Noodle. When we saw both dishes, we kind of laughed about our choice of dishes. Cantonese Fried Noodle was technically the Bean Curd with Broccoli with fried noodles. At least the food was good. They have really low cost menu during lunch and tea time for less than $6."}
{"text":"I would've put no stars at all. They were rude we waited too long for our drinks. They literally would throw the food at the table and even the drinks. I tried to order a drink and she ignore me because someone of her own race needed a table. The food was horrible and I wish we would've ate at Ka Chi they have great customer service and food. I would not recommend this place at all unless you're Asian or are with asians."}
{"text":"4stars for the food 
Came here twice during my stay in Toronto. This place gets really crowded. Be sure to get there early so that you won't be waiting in line. Their shrimp wonton was really good! I do not recommend their shrimp rice vermicelli roll becoz it's too thick and shrimp were tasteless. Their iced lemon tea was very good too. It's cheap and nice and not too much MSG. :)) good for pocket good for health! It's also a great place for late night meal. 

3stars for the service
The only complaint I had was the way of ordering when you are alone dining at the restaurant. You order through the waitress and then they gave u a plastic tag. So I was unlucky that I went on a busy afternoon, the waitress did gave me the plastic tag but didn't key into the system. I waited for a long time but the food didn't come. I approached another waitress to ask about my food but she didn't even bother to check and just replied that the food is coming. And then, I had to ask another waitress for my food again."}
{"text":"Premier VRAI chinois de ma vie, car les resto chinois en France il y a prendre et a laisser!

Le service le plus rapide que je n'ai jamais vu, et très organisé! Bon je n'ai pas apprécier la nourriture mais après c'est une affaire de gout. 

Bien sur le service est très bien, bon ne pas s'attendre à un sourire ou un mot gentil mais il parait que ce n'est pas dans la culture."}
{"text":"If you are looking for cheap eats in Toronto's Chinatown, this is probably one of the better choices. Most of the dishes we ordered were a bit bland, though quite edible. Ingredients tasted fresh. The tastiest thing we ordered was definitely the Barbecue Pork. We ordered the large serving and it hit the spot. It had a delicate smoky-barbecue flavor and was not slathered with soy sauce as another reviewer on here complained several months ago (maybe the cook got the message). If you order the large serving ($5.50) in addition to a vegetable entree (the Pork Barbecue has no vegetables), you should have a fine banquet for two.

The other entrees we tried, which impressed us a good deal less were the Hot Pot with Seafood and Vermicelli Noodles (tasteless, though the shrimp and scallops were tender), Chicken with Cashews (pretty generic), and Baked Oysters Xo Style (just tasted weird). Among the soups we had, the Corn with Chicken was a nice chowder, while the Wonton and Egg Drop, along with the Spring Rolls, were so-so.

From the looks of other plates coming out of the kitchen, Roast Duck is one of the better selections alongside the BBQ Pork. They do a whole fish dish that looks interesting too. Good luck trying to figure out the rest of the extensive double-menu. The place is interesting and authentic enough such that we will probably return and try more hit-or-miss ordering.

Ultra-casual atmosphere with attentive service. At peak times you may have to wait standing up for 10 to 15 minutes. The restrooms/washrooms are clean. The lighting is a bit severe and may give you a headache, but at least you can see what you're eating. Eating conditions are a bit cramped with tables shoved together or against the walls, so you may not wish to come here if you are exhausted from shopping and carrying bundles."}
{"text":"It was just average.  If you want a quick bite at reasonable prices, try them out.  Although it is a rush to go for lunch to try the specials, I stop by once in a while to grab some takeout or join my friends for dinner.

It is fairly easy to get a table since it is a relatively big place. When I looked at an ordering app, the prices seem higher than if you were to order directly with the restaurant.  I've tried their wonton noodles as well as their rice dishes which were both good.  However, the the fried noodle and rice is hit and miss.  Sometimes, there is not enough ingredients and at times, it could be a bit bland.

I only come there once in a while as there are many other choices in the area and sometimes I drive uptown to get my Chinese food fix."}
{"text":"Looooots of people on a Saturday evening, but they give you the option of sharing a big round table with other customer(s), which we did and it was less awkward than we thought. As a vegan, I found the menu pretty limited. There is an entire vegetarian section in the red menu (there are 2 menus - red for special combos and dishes categorized by meats vs seafood vs veggies and green for grain-based meals), but be careful as some dishes also contain eggs and/or seafood. A small bowl of white rice is complimentary with combo meals. We ordered the special for 2 combo ($23.99), which came with 2 vegetarian egg rolls (the spring rolls are not vegetarian) and 2 veggie dishes. Both veggie dishes were generic, but A-OK. Generic Chinese restaurant ingredients such as carrots, broccoli, mushrooms, pea pods, corn starch, etc. The bean curd vegetables with black mushrooms was more corn starchy while the stir-fry veggie dish was surprisingly light, umami (MSG alert lol), and almost refreshing. I thought they used LESS cornstarch and sodium here than at other Chinese restaurants, but I have no basis for this beyond the texture and taste. 

Huge portions overall (some guy next to us ordered fried rice for 1 and I swear to god it was enough to feed a small classroom), great value. They accept card and cash. Nothing special about the food. Venue is crowded and pretty noisy, but pretty clean (even the restrooms). Probably won't return again since there are so many other, better Chinese restaurants out there."}
{"text":"Came here for some late-night Chinese food after going out on a Friday. They're open late and very accommodating to those who stumble in drunk.

It's a pretty standard Chinese restaurant. You can get your fix of noodles, rice plates, congee, etc. I was disappointed because I was really in the mood for some shrimp rice noodles but that was the only thing they were out of. My friend and I settled for an order of Singaporean fried turnip cake instead (on their daily special menu on the wall) and it was really good! It's blocks of turnip cake slightly deep fried with soy sauce and eggs and shrimp.

I really liked that they separate your bill for you. When you order, they give you a tag to keep and then you pay at the cashier at the end. That way, everyone can order their own thing and pay separately without dealing with the hassle of splitting the bill. Such a great idea. Would definitely come back again for some late-night Chinese food."}
{"text":"My FAVOURITE spot in downtown Chinatown Toronto!

I have tried items from different sections of their menu, and they have all been consistently good.

The prices are also fair, and portions are large, so it is great value; great for when you are starving and don't know where to eat! Food comes quickly as well, and is fresh. Service could be improved, but it is typical of places in Chinatown.

I particularly enjoy their congee and dimsum items (fried squid, and fried dough wrapped in rice noodle roll), any of their noodle soups, and their milk tea! The BBQ meats that they make onsite are very tasty and addictive.

I always end up with leftovers, and the food is just as delicious the next day."}
{"text":"Best Hong Kong milk tea in Toronto. 

The food here is also pretty decent (had their preserved egg congee and peking duck). However, none of that matters because their Hong Kong tea is that good. 

Oh, did i mention their Hong Kong tea is amazing?"}
{"text":"I come to House of Gourmet whenever King Noodles is closed. The food and dining environment is slightly less refined than that at king noodle. Their dishes aren't bad, its just that other they lack refinement (e.g. the Chinese doughnut wrapped in rice rolls could use some green onions, the friend turnip cakes could use some hot pepper seasoning).

My favourites are the preserved egg and pork congee (The House of Gourmet has my favourite congee in all of downtown chinatown) and the friend turnip cakes (again, best ones I've had downtown). They are open until very late a night which is a huge bonus ! AND they happen to take cash and card, something that's quite rare in chinatown."}
{"text":"Extremely rude staff. Went for lunch and they insisted on me sitting on one large comunal table with a whole bunch of other people. I would be fine with that except that the restaurant was almost empty. I asked if I could sit on a small corner table and one lady rudely said 'fine you eat then you leave'! Wow. I promptly left. I've never had a good experience there with the staff. They've always been rude. The food is also oily, tasteless and the duck is never the freshest. I would just avoid this place altogether until they get their act together."}
{"text":"The dumplings here were not fresh tasting at all they tasted like they came right out from the freezer. I did not eat other foods only the dumplings in pan fried had the chicken and vegetable & the beef and onion one. They weren't the freshest tasting. With that said the venue is clean, tidy, fast service. It looks like they pre made all the dumplings and whatever doesn't sell for the day go straight to the freezer. I prefer dumpling house location as they all the dumplings on the spot so its as fresh as possible. Overall I wouldn't be coming back."}
{"text":"One of the best places for Cantonese-style Chinese food downtown. The wait can sometimes be long, but it's worth it for the food. I'd recommend one of their lobster set options with sliced beef. Great authentic Hong Kong restaurant atmosphere all around."}
{"text":"This place is legit. The hot and sour soup was delicious and generous with seafood. The lobster was so tasty and even the fortune cookies are good. I'll try the Peking duck next time but a lot of people were eating the lobster. Solid specialty dishes."}
{"text":"Good solid food place in Chinatown. Student budget friendly!

Pros:
-cheap ($4 for a noodle soup)
-good food (delicious)

Don't need many points for pros when those 2 are so good!

Cons:
-staff can imply you to leave by bringing you the bill after you finish your food... but that's mainly due to long waits
-sometimes hard to get a table due to it being so full

Notes
-the more expensive noodle soups aren't bigger... so I usually eat the cheaper one and sometimes order 2... tho 2 is a LOT of food

Definitely recommend, I eat here fairly often!"}
{"text":"Food options are done like a Hong Kong style cafe with simple and cheap options, not necessarily a great quality of food or service. Staff are okay and are decently attentive. Food can be quite oily or greasy at times, but their prices are unbeatable, especially for breakfast. It's simple, Chinese comfort food, that draws tons of people for breakfast, lunch, and dinner. Some of their breakfast and lunch combos also come with a complimentary beverage. They also have seafood specials with lobster and crab, but personally I've never tried those. I've always stuck to classics like mushroom and young bean leaves, congee, and wonton/beef with noodles."}
{"text":"Looking for cheap eats downtown and wanting variety, somewhat clean, and feels like home (at least my home)? House of Gourmet isn't fancy \"chinois\", you could even argue that it's not great. But what it does I think is hit home for me which is why I go regularly.

Wonton noodles soup being prepared right by the door, you see bowls of noodles ready to have the hot soup placed inside with quite a few wonton ball (I think like 5 or 6, which is a lot). Of course I believe it has a few pieces of veggies so you get some greens. Right next to them is the congee station, a huge pot of watered down white rice and smaller pots to add whatever variety you choose whether it's minced beef, sliced fish, or some mixture of many things. Don't forget the peanuts to put on top!

The service here isn't fabulous, they might be willing to split your bill into two if you ask at the beginning (you can forget about it if you ask at the end), speak fast cause they got other stuff to do. Otherwise tell them to come back.

So why is this 4-star? Well whether it's wonton noodle soup, congee, beef brisket noodles or fried noodles, food comes quick and is pretty good. And it's cheap and quick. It's not dirty. But it is quite hectic as there are people spilling in to eat or take out all the time."}
{"text":"Bad congee... quite thin, sloppy preparation, inferior reconstituted mushrooms, salt soaked chicken, old oil in the fryer stays on the palate from Chinese donuts."}
{"text":"Worst Chinese food experience in Toronto!!! Our middle-aged male server was unhelpful and only came to our table to take our order after we sat for about 10 minutes unattended. He couldn't answer simple questions about the food. We got our food that was extremely salty after about 15 minutes and my friend and I only ate maybe 1/3 of our entrees. We paid or check and then after the server gave us back our change he demanded a tip even though he never checked on us or gave good service... Don't come here!!!"}
{"text":"I went their during lunch time with my co-workers. It was very busy. Considering that the service was relatively quick and professional. There were plenty of food choice. We had ordered chicken fried rice, chicken meat balls, egg roles and another chicken item - one dish from each item. Quantity was good - enough for three persons. Food taste just ok, kind of flat - no flavor at all. Interior is nice and clean with very average décor. Probably I won't visit on my own again."}
{"text":"OMG EXACTLY what i've been craving!! we heard raves about the chinatown here in toronto (if you've been to chinatowns in SF, NYC, or LA you'll be underwhelmed) and so decided to park, walk around, and eat at the busiest dinner spot in the area. raised by my cantonese dad, i have specific criteria that i look for when i crave wonton noodle soup, specifically bbq ducks and fresh noodles in the window! while asian legend (a block down also on dundas) has lots of  \"awards\" on their window and quite a few people (some chinese even) dining there, prices were a little more expensive and the atmosphere wasn't like the family style spots i was raised on. 

house of gourmet, on the other hand, was perfect. lots of cantonese people chatting loudly, a butcher chopping away at fresh duck and pork, fast service and surprisingly servers that can speak english! i got my shrimp wonton noodle soup for $3.99 and they aren't joking about the shrimp - the wontons were huge and basically stuffed solely with about 4 large shrimp and just a hint of extra stuffing. the noodles were chewy but a little more broken than i'm used to and the soup was sweet. forrest y ordered the sizzling beef and chicken satay for $9.99 and the portions were certainly generous! he had a large platter of tender beef, tasty chicken, bell peppers, pineapple, and onions immersed in delicious satay sauce. i think they charge rice extra per bowl but we didn't want to waste precious stomach space and left stuffed!

lots of locals but also some non-chinese tourists in the mix - i'd definitely come back here!"}
{"text":"IMO, for every place i've ever been, this is the hierarchy of where to get Hong Kong style Chinese Food
1. Hong Kong
2. Markham/Scarborough
3. HOUSE OF GOURMET
4. Mississauga
5. Anywhere else downtown Toronto 

This might not sound like a good review, like where do those five stars come from? Well real talk House of Gourmet is FIVE OUT OF FIVE when compared to ANY OTHER Hong Kong style restaurant in the downtown core.

Trust me."}
{"text":"Great food and very entertaining   Beat the rush hour and watch the place fill up and the staff was intense.  I like that level of getting it done!"}
{"text":"Crazy.
Busy.
If u want a meal done in under 90 seconds, this might be for you.
Unique Chinatown Toronto experience.
Won ton NOT great. 
BBQ pork fried rice was decent.
Waitress entertaining. Lot of yelling and rushing."}
{"text":"Gets very busy especially night time, I find their prices good and I love that they are open till 5 or 6am. Staff seem over worked and you get that feeling they want you to eat, pay and leave. Good spot overall"}
{"text":"I often dine by myself so sometimes my dining experiences as a single person differs from those in couples or groups. In the case of House of Gourmet, it was a really nice experience. I was greeted at the front and directed to a table shared with other people. The shared table led to a really pleasant conversation with the older woman sitting next to me  - she also provided some advice on what to order (the fact that she eats there once a week was also a good sign to me). 

Meal: Shrimp wonton soup with egg noodles
I have weakness for shrimp wonton soup, and I'm on a quest to find the best one in existence. This one was really good - the broth was flavourful, the noodles were chewy and tasty and the shrimp wontons were amazing! So fresh and large and incredibly tasty! I had my face planted in the bowl for at least 15 minutes (only coming up for air and to chat with the woman next to me). I really enjoyed it and the overall experience at the restaurant. I'm already planning what I'll eat when I return (besides another bowl of that soup)."}
{"text":"Yummy, cheap, and pretty authentic Chinese food. Don't expect the wait staff to hold your hand and explain the menu, so have an idea what you want before you call the waitstaff. The food is very good but not great. You will also likely share a table with other customers. Its a restaurant I'd go back again."}
{"text":"This restaurant was surprisingly spacious on the inside, considering how unassuming it was outside. The barbeque (??) was pretty tempting, and I had been meaning to eat some during my visit, so I ordered the rice plate with duck, pork, and chicken. All were very decent, and they also gave me a small soup (with a small stalk of vegetable) to go with it. Toward the end I realized it wasn't the best idea to order such a large plate, as we also got the house special noodle soup, which was a large bowl full of noodles with a bunch of random meats, from meat ball to fish cake to some pork innards. Overall a lot of food--we may be a bit more careful and order less if coming back again."}
{"text":"Cheap price for not bad food. Worth visiting when u felt so hungry around Chinatown. 
We four people came there for lunch, ordered three noodles, two rice roll and one liver congee. All dishes were delicious although noodle soups tasted all the same because of added oyster-sauce. Won ton was delicious with lots of shrimps inside.
 The portion of food were really large, we cannot eat them all. It also provides classic hk breakfast for morning. The restaurant was always crowded with people and open from early morning to late night. It maybe not that clean because all the staff were too busy."}
{"text":"House of Gourmet is a name no Chinese person will know if you tell them, but say the name in Chinese and you should get a bunch of wide grins and head nodding. The place itself is identifiable by all the hanging dead animals on the window front. That image alone should entice you to walk in. And then as soon as you glance at the menu, you'll notice they have close to 500 items!

This place is constantly packed and for good reason. This time around, we ordered up a beef brisket noodle soup, shrimp wonton soup with rice noodle, 3 kinds of BBQ meat on rice (BBQ Pork, Roast Duck, and Roast Pork), and Jellyfish with Sliced Pork Congee (Jook). Everything was so cheap.

The beef brisket noodle soup was a large bowl of goodness. The brisket was incredible as it wasn't chewy and was just tender and meaty. The noodles were thin but were still able to soak up that beefy broth. The portion was incredible for under $4! The shrimp wonton noodle soup was the same price and just as good. The shrimp wontons were incredible. I hate shrimp wontons that are minor chunks of shrimp mixed with some other kind of meat. These wontons were purely shrimp and had a wonderful sesame oil taste to them as well. The rice noodle is awesome for soaking in the juices of the broth. 

The BBQ Meats here are great! The Roast Duck is juicy, meaty, and the skin is so crisp, its incredible. The Roast Pork was good too. Crispy skin and big pieces of meat, but there was a bit more fat than desired. The BBQ Pork (Red Char Siu Sauce) was good but a bit dry. The sliced pork and jellyfish congee was probably my least favorite. It wasn't seasoned well enough and the jellyfish was bland and chewy, though the sliced pork was incredible! Add some salt and soy sauce and it becomes pretty good.

Parking garage is located right across the place. One of the few places in Chinatown worth really checking out."}
{"text":"We started with the shrimp wonton with egg noodle soup: The broth was delightful and the shrimp dumplings were big, juicy, and perfect. The noodles were a little thinner than I'd like, but overall, this $4.75 bowl of deliciousness was great!

Next we had the Cantonese Fried Noodle ($11.00) that was equally delicious. The \"gravy\" was more flavorful than usual and it was full of a variety of vegetables and seafood. 

We also had the shrimp stuffed crab claw ($3.50 each) that was pretty good. It was a snow crab claw that had a big shrimp puff fried on top of it. This was just OK - I think my husband and I could have split one since it was pretty big. It also came at the end of our meal so we weren't very hungry when it arrived. 

This place makes me excited about Chinese food again and I would love to come back again and again to try stuff off of their incredibly large menu. It was a toss up between four and five stars and I went with four because although it is really good Chinese food, it's not the absolute best I've ever had in my life. House of Gourmet is definitely worth trying. And, they are open early so you can get an early breakfast when a lot of other shops are still closed!"}
{"text":"This used to be my favourite restaurant in Chinatown but I have found other places I like more (Ajisen Ramen, Red Room, King Noodle Restaurant, Celebrity Hot Pot, etc). The food is extremely inconsistent and the service is worse than the average standards in Chinatown. The servers constantly speak Chinese to me even after I tell them I don't speak Chinese (ok cool) and I find I usually have to tell two separate servers for water / the bill as the first usually forgets. I guess that's what you get for the low prices here.

The food is inconsistent here - I've gotten the shrimp wonton soup and sometimes the shrimp tastes grainy, sometimes they barely put any soup in, sometimes it's lukewarm, etc. The Chinese BBQ dishes (ie roast pork, bbq pork, etc) are sometimes too fatty / not fresh tasting. I do love the plain congee and fried donuts here though. It's always very good. And the drinks are quite cheap here."}
{"text":"Often I come here for wonton noodle soup or for their afternoon tea specials. Last time I was here I was with a group of 9 friends and we decided to share the double lobster special combination dinner. For this special there is a list of food options and we picked 8 dishes from that list. Dishes included deep fried squid with pepper salt, cantonese chow mein, steamed tilapia with soya sauce, three kinds of seafood on sizzling plate, golden mushroom with young bean leaves, steamed bean curd with scallop and black bean sauce, and boiled free range chicken. Food was good but nothing was memorable.

Will definitely be back again but will try other dishes.  I would rate this experience 3.5 out of 5."}
{"text":"Reliably mediocre, not necessarily in a bad way. I've been coming here on and off for about a decade, usually just for the wonton congee - which isn't offered as a congee option at rosewood or king noodle, my other staples. The wontons are much bigger than other spots, which is a good enough reason to keep me coming back.

The rice rolls have a good noodle texture but the filling is often bland, particularly the mince beef which is usually my favourite. 

I once made the mistake of asking for just a take out order of their noodle soup broth, which tasted awfully tinny and fishy and somehow still watery and bland. 

The one other real disappointment were the fried turnip cakes, I couldn't find a piece of turnip in the whole dish! The cubes were just rice cakes in the shape of turnip cakes. Big bummer. 

Probably just stick to the congee and plain rice noodle rolls here, but those are all you should really need in life anyways."}
{"text":"Some tips to future goers:

- Don't expect much for service. This is a cheap Chinese restaurant where half the waitresses don't speak English. Their goals are to get the food to you fast so more customers can dine. Also, they may ask you if you want to be seated at a big table with strangers if it's busy. This is common in Chinatown.

- Do order the beef satay with rice noodle. It is delicious and only $9 and enough for 2 portions. 

- Don't stick with the congee and wonton soups all the time. Try something new.

- Chinese food is filling - so you will likely have leftovers

I did have a poor experience last time I came here though. I was taking a spoonful of rice from my rice bowl and I got this horrible overwhelming bleach taste instantly in my mouth. I realized it was the rice bowl which was NOT properly rinsed. That wasn't pleasant at all. Otherwise, the food is cheap and quick and worth going for once in a while."}
{"text":"Strange place. Good food, brought to you quickly, but the quality of service and seating arrangements and the guy who patrols the front of the restaurant make this go from a 3 star to a 2.

First time I went, there was a employee who I'm not sure if they were a dishwasher or cook, but that's not what's mattered. What caught my attention was the fact that this employee would not stop picking their nose. For a good 10-15 minutes. In plain view. After I coughed enough times while staring at them, they stopped. Since I was beyond hungry, I let it go hoping that they actually washed their hands upon returning to the kitchen or they were not the one making or handling my food (here's hoping!).

Another time I visited while volunteering for TIFF and was on my own. I totally get not wanting to waste an entire table on one person, but they placed me at a huge round table with 3 groups of complete strangers. They were nice enough, but c'mon, that's just being cheap/stubborn in saving space in a restaurant that's fairly spacious to begin with.

Yet another time I went, and the manager/guy at the front got so impatient with my question of if they serve pork or shrimp won tons that he was visibly agitated and yelling at me. Again, so hungry I just let it go and ate, passing it off as a typical Chinese food experience where you order, eat, pay and leave, and to be fair, the guy sounds like he's yelling at everyone, but let's get real here! I'm a paying customer asking a reasonable question, there's no need to get all in a twist over something you could have answered in two seconds. Not necessary.

Hmmmm....why the hell have I gone back here so many times??! STOP PICKING YOUR NOSE, DUDE!!!

NOT worth the trip!"}
{"text":"Five Words: Beef and Broccoli Chow Mein.

I don't think it's technically on the menu, but you can still order it.  Just tell them you want only beef and Canadian broccoli on crispy noodles and they'll know what you're talking about.  

House of Gourmet is one of the O.G. Chinese food places my Dad used to take me to when I was younger.  Don't let the dead animal carcasses hanging in the window scare you off -- this is pretty much as good as it gets."}
{"text":"If you are looking for a wide selection of Chinese food that is quick, relatively cheap and tasty, House of Gourmet has you covered. The menu here is extensive, so you can get pretty much any combo of rice, meat, noddles, veg, etc that you desire.

The service is often very quick and the large dining room means that I've never waited for a table here. 

My husband ate the tilapia fish cooked fresh from the tank. The tank filled with sea creatures might be something fun to look at (except for the icky eel on the way to the washrooms), but I personally would not recommend partaking of those offerings.

Recommended highly as a go-to restaurant in Chinatown."}
{"text":"Probably one the largest menus I've ever seen, which is cool, but, at the same time, a bit overwhelming. I had no idea what to order, due to the quantity and similarity of items, so I just went with the combination menu.

All in all, it's good and it's pretty cheap. If you go during rush hour, expect to be, well, rushed a little by the servers. However, with the food as abundant and cheap as it is here, one does not expect great service.

Can definitely recommend it as a takeout staple."}
{"text":"We really like this spot located in the heart of Toronto's China Town. It's tight seating, with the most number of chairs and tables that could possibly be squeezed into one room. 

The food is what brings us back time and again. For about $10/person, you can eat until you can't eat anymore. The service is ridiculously efficient and you can normally be in, seated, order, eat and pay all within a half hour. 

The food is always fresh and hot. The menu is about 10 pages long, so there is always something for everyone. Often we'll eat and then grab some meat from the butcher on the way out, which we can then take home. 

It's kind of a 'no frills' type restaurant but it's good food at a great price!"}
{"text":"This has been my regular go to place for the past few years. I probably come here 1-2 times a month. My usual is their soya sauce chicken on noodles special and sometimes also get their lunch specials. Recently, they renovated but I think it was mostly cleaning the restaurant and perhaps re-doing the lighting and wallpaper. You probably wouldn't notice it if it wasn't shut down for a couple weeks. As expected, after the renos, they raised their prices. I'm hurt as it is always painful to have to pay more for the same thing, but can understand that prices can't stay the same forever.

There's not too many more places where the norm is for servers to yell across the restaurant, look pissed off, angrily wait for you to order something. It's part of the culture and I'm totally cool with it. There are others like Goldstone and King's Noodles that offer similar food, but I find the atmosphere and cleanliness at HOG better.

I forgot to mention the food. It's pretty good. The BBQ selection, the fresh rice noodles that you can see them making, those I would recommend. The rest of their dishes are decent, nothing to write home about as you can get better quality in Markham, but it's one of the better places in chinatown."}
{"text":"Service - 4/5: quick, fast and efficient, but can appear rushed to some people

Food -4/5: good food, not as good as markham chinese food but probably really good for downtown

Price - 4.5/5: pretty cheap for downtown. Especially the wonton noodle soup

Definitely one or the better chinese places in Chinatown. If you are looking for Wonton Noodle Soup downtown, this is the place to go for sure! Its $5 for a bowl and it is pretty good tasting. Wayyyy better than King's Noodle House, which makes a completely garbage bowl of noodles. The bbq duck and pork is also pretty good and the sauce for them is amazing. Also open late so if you are craving chinese food at 3am after going out to a bar, this is the place to go!!"}
{"text":"Not bad - it's cheap and pretty decent Chinese food.  If the proportion of Chinese people here aren't enough of a hint, the awkward English name should tip you off.

A few of us were here for dinner and everything was decent - other than the char siu (BBQ pork)... why is it doused in soy sauce?  I can't taste the BBQ!

But I'm probably being a bit generous to this place - I'm a Chinese dude from Vancouver - I live and breathe good Chinese food.  But considering this is a cheap joint in Toronto Chinatown... 3 stars."}
{"text":"My cousin travels a lot for work and this is one of his spots for a Chinese food fix whenever he returns to Toronto. He invited me here after I helped him set up his new TV.

It was busy when we arrived around 8:00pm but we found a table near the back and were presented with menus right away. Wow, big menu with hundreds of items, plus a separate menu with dinner combos! I left the ordering up to my cousin since he was familiar with some of the good stuff.

We shared a platter of roasted pork, soya chicken and BBQ duck over rice, spaghetti with black pepper beef, and an order of snow peas leaves with garlic. They started us off with complimentary bowls of their house soup, a simple pork broth. Surprisingly, there was a good chuck of meat in each bowl. They do this for all diners? Cool!

The rest of the food arrived pretty quickly and the portions were very generous. The meat platter, while not the best I've had, was tasty and the pork skin was nice and crispy. Ordering Chinese style spaghetti was new to me and it was alright. My cousin said it's usually better. The veggies were cooked nicely, with just the right amount of garlic. We had enough noodles and veggies for leftovers.

Overall, it was okay. Would I come back? Maybe, but I would be tempted to explore some of the many other other choices nearby. After all, this is right in the middle of Chinatown!"}
{"text":"**MUST TRY: Singapore style fried turnip cake
- Chicken and Eggplant
- Satay beef/chicken in sizzling hot plate
- Chicken/beef with black bean sauce on rice noodles
- Szechuan chicken
- Spicy calamari
- Bbq duck
- Bbq pork on chow mein
- chicken with coconut and taro sauce in hot pot (a weird one, reminiscent of a certain bodily fluid. but tasty)

budget options:
- egg noodles in soup 
- wonton noodles (with whatever)


I've found this to be the most dependable and consistent option in chinatown. And it's quite cheap. They have a happy hour period which has a discount on their already cheap food.

It's not a glamorous spot, but it really seems quite clean (backed up by no health inspection failures), which is an important consideration in chinatown.

Tons of options here. The menu is actually a bit too long. There are 2 menus and it's pretty confusing. (see my recommendations above)

House of Gourmet is extremely versatile and very fast. The service is fast too.

If you're eating alone, it can be a good place to meet others, as you'll probably be seated at a sharing table when they're busy.

Bonus: Open til 4AM on friday and saturday."}
{"text":"The service was amazing and all the servers were super nice and happy. Everyone walked in and knew the servers which meant they were repeat customers and that is impressive to me at a Chinese restaurant because great service is often hard to find. The food was also amazing and not just because it was a night after drinking. I would def come here sober so I recommend it for anyone who wants authentic Chinese food!!"}
{"text":"Tea: Hot

Tsingtao Beer: Cold

Noodle soup with pork: Good

Young Chow Fried Rice: Good

Waiter service: Rude, slow and abrupt.

That's why three instead of four stars."}
{"text":"Environment:
Located near the Dundas/Spadina, House of Gourmet is basically at the heart of Toronto's Chinese Town, and is super convenient to get to. On the TTC, you can take either the Dundas or Spadina street car to reach the restaurant. As for driving, there are a good amount of parking space at the underground parking of the Dragon City mall, and the price is $15 per day. 
The restaurant itself is very large and can accommodate many large groups, thus making it very good for special events or for eating out with a large group of friends. At the front they have a Chinese BBQ station where you can also get them for take out. 

Food:
We went to House of Gourmet for a Chinese New Year dinner and between the 10 of us we ordered a combo from their page A7 menu. We ordered the \"8 Kinds\" deal which we chose a bunch of items from the fixed selection (see pictures) and the 8th dish was the lobster. The combo also came with complementary soup and dessert (got the sweet soup). We also ordered a large bowl of rice to share for a $11.50. 
Some of the foods that I really liked include the complementary Asian bone soup, their lobster dish (we got 2 lobsters to share), the mixed seafood and vegetables on fried noodle, the steamed tilapia (fish was really fresh), and the salty chicken (flavour soooo goooood). 
The meal was a super good deal as it ended up being $14/person after tax and tips, and we all left feeling satisfied. 

Service:
Slightly awful service as the servers always have a sort of impatient/pissed-off expression on their face, but they did fulfill all of our requests. They can speak English but to get better service speaking in Cantonese with them is recommended. 

I would definitely come back for another time, as their foods are really good and at good prices. Their BBQ items look really good and it's probably better to get them earlier in the day when they are fresh."}
{"text":"This place have good cheap Chinese food! Prices are very reasonable, good for breakfast, lunch and dinner! The food comes fast, place is usually very busy but the wait is not long. If you want a quick bite and cheap decent food,  check out this place! Prices are cheaper than King's Noodle."}
{"text":"I live in NYC and I came to visit to Toronto for vacation and decided to stop by and dine in at House of Gourmet. In terms of service, it was great. In terms of food it was great as well. Would recommend to anyone looking for authentic chinese cuisine!"}
{"text":"House of Gourmet combines great value and better-than-usual Chinese food. Given that status, it's no surprise they're always packed. Always.

House of Gourmet's menu is massive, offering any and every combination of dishes ranging from Chinese BBQ to congee to dishes you've never seen before. It's sheer amount of choices makes this place incredibly enticing for a casual lunch, or a festive dinner. It's prices are not so bad either compared to other places in Chinatown, especially their peking duck combo meal. 

The food itself is not bad either. The old traditional dishes are done well, without appearing too oily or reliant on MSG. The value of the dishes is consistent, with large portion that's not caked in starch or filler vegetables (water chestnuts or onions). Authentic dishes such as beef kidneys and snails were offered as well, which, judging by the amount of customers they get every night, is definitely a hit with the local Chinese population.

All in all, combined with great value and wide selection that doesn't gyp you with overfilled vegetables, makes this restaurant a win for a delightful Chinese meal on any day."}
{"text":"It's always busy at the House of Gourmet. However, you never have to wait long for the food to come, even if you have ordered a Peking Duck! I'm a big fan for its duck though not so much for the doughy wrap. They know how to grill the duck to its perfection - crispy skin for wrapping and tender meat for stir-fry."}
{"text":"I have been there many times, it is fast, inexpensive, and tasty. They have done renovation not too long ago, so the place doesn't look cheap.  it is always busy, I love their congee and BBQ poke..."}
{"text":"Located at 484 Dundas the House of Gourmet is in the very heart of Toronto's China Town. The place has seemingly been here forever and I've dined here many times and have always found it to be one of the better the many Chinese restaurants of the area. It's nothing fancy and the Chinese food it serves isn't really the tops of what China ever produce, Chairman Mao's Cultural Revolution pretty much wiped that out, but for what it is it's pretty darn good. And one thing for sure is that you can generally tell you're in the right place as most everyone in the place is speaking in Chinese. 

When I lived in Toronto I usually got the BBQ Duck, a hanging display of which they always have in their window, but now that I live in Florida where Chinese restaurants only served warm water spiny backs, I went for the lobster knowing I'd get the more tasty cold water lobster, which in fact I did. The lobster I order came chopped mixed in with varying noodles and vegetables done over with an oriental garlic like sauce. Whoever chopped the lobster did it perfectly. Every chop was clean and precise leaving no little flakes of shell or shrapnel, allowing one to easily pick the meat from the shell, all of which I found to be flavorful and good. 

The service here is extremely fast, almost to the point that you might believe they had to have your order prepared before you ordered though it is only prepared upon order. 

There isn't anything classy or upscale about the place, it's just a good Chinese restaurant serving good though not exemplary or unique Chinese food."}
{"text":"One of the best places for shrimp wonton soup with noodles.. And it's cheap and great food.."}
{"text":"I went there to get a quick snack on a Sunday afternoon. It was packed with people.

ENVIRONMENT
It was very loud.  All I could hear was voice of people from other tables.

SERVICE
Service was horrible. When I was asking what size of congee to order, my waitress gave me a shrug and didn't seem to care. When I asked her to show me size of bowl that comes with small congee, she went to table beside me and yelled at me.
She was yelling at me entire time I was ordering.
It seemed to me that she really wanted to order faster or she wanted me to get out of the restaurant. 
When I finished eating, I saw her yelling rudely at other customers as well.
Definitely I would not go back to this restaurant again in the future.

FOOD
I've ordered their \"Singapore style fried turnip cake\" and their Congee. I've had much better food.
Turnip cake was over-fried. If you go up in North York, I can at least list two places which has much better taste than their turnip cake.
Congee was decent, but the meet inside it was a little bit undercooked.

PRICE
To get full for one person, you need at least $10.
Turnip cake was $5.99 and their small congee was $6.99"}
{"text":"The rice soup is tasty and made-to-order. I got the pork with cabbage. Also ordered the salted baked pork chop which was very good. The night I went it was very busy, but the wait staff handled it very well."}
{"text":"This place is a piece of sh*t! We ordered a whole Peking duck and lobster and pieces was missing, suspect the back of the kitchen ate them before it got to our table! The boss told us to wrap up and pay our bill and leave when we still had food on the table! They still think they're entitle to a tip!? 

We already paid to much for their mediocre food and salty seafood dishes. Never will go back here again!"}
{"text":"Brought peaking duck it was pretty decent, for the price. Service is quick but rude."}
{"text":"I'm a fan, reminds me of the places I grew up with in Markham. 

The liver and kidney congee was super delicious, the meat wasn't overdone and the congee was super flavourful by itself. 

The fried Chinese doughnut was hot and fresh! The zhaliang (rice paper wrapped fried doughnut) is SUPER YUMMY! 

The preserved veg and pork noodle breakfast (B5) was no great, the breakfast combos are cheap though, and offer a lot of food. 

The bread is not the heavenly Chinese square bread. Also, someone in my party spoke Canto, which I think helped with the service we got."}
{"text":"Yummy ..... ordered the gigantic bowl of lobster congee... they put in 1/2 a lobster.... also came with the fried doughnuts and a choice of crepes... (we choice the beef)... all for $19.95... this could have feed 4 people... we were two and had plenty of leftovers... place is typical Chinese dive, but great place and all the diners here are Chinese so that tells you something!"}
{"text":"This place isn't bad, considering the average Chinese food quality you get in Chinatown these days (and this is coming from a Markham resident, where all the good Chinese restaurants are).

I arrived just in time for the tea time special, where the meals are only $4.25, including a hot drink (+$1 for cold drink). I got the stir-fried beef noodles and an iced lemon tea.

The iced lemon tea came fast, and actually tasted almost like what you expect in the good Markham cafés. However, the beef noodles took a while to come (about 15 minutes). It was worth the wait though, as portions were good and the overall taste was definitely one of the better ones in Chinatown.

Definitely would come back whenever I come back to Chinatown for anything."}
{"text":"They have tea special (???)everyday from 3-5 pm. One dish with milk tea or coffee is around $5. The portion is so big enough even for a man. Their milk tea and ?? are very good!"}
{"text":"We ordered two wonton/dumpling mein soups. The broth was light and not too salty. Simply the BEST shrimp wonton and shrimp dumplings I've ever had! Fresh, huge and extremely YUMMYTASTIC!

Their beef and egg rice plate and the fish fillet with corn plate were OK.

The shrimp was so good, we forgot to take pictures!

Service was efficient and fast."}
{"text":"Cheap Chinese eats in Toronto. During my stay in Toronto I even visited twice!

I love that they're open late into the evening in Toronto's Chinatown and enjoyed the efficient service. The prices were surprisingly reasonable and the food tasted authentic. 

Not the best Chinese I've ever had, but 4 stars for convenience and value.

What was strange to me is that they served American food here as well. I would pass on their fruit shakes."}
{"text":"My favourite Chinese restaurant in Toronto - great food and quick service. We usually order the steamed chicken but the eggplant and shrimp hot pot dish was really good!"}
{"text":"This place was great! If lived near here would come back all the time. The atmosphere is very good, typical Chinese restaurant with even a nice bathroom.  

The food was just as good with a good price! Not to mention they're open till 4AM on Friday and Saturday.

On our visit out of 3 days came back 2times."}
{"text":"Came here at midnight and it was pretty busy considering it was a Tuesday. I got a big bowl of preserved and pork congee for $4.80 including tax. It was part of their special. It was too big for me to finish actually. Great place for post drinking and late night eats as it's open til 2am. Yay for cheap eats!"}
{"text":"The best freakin' place ever. As close to dining in Hong Kong as it gets. Cheap, fast, nothing fancy or high-brow. Food is always great. Great place for a quick lunch; they have meals for breakfast, brunch, and lunch for less that $5."}
{"text":"This place has been my late night craving fix for a while now. They are open late and service is actually quite decent. 

Menu has a good selection of Chinese dishes and there is a lot of combos available if you come in group or are just very, very hungry. There's also a good number of daily/weekly specials. 

Rather a busy dining room but it can be quiet if you go in the late hours of a week night. 

As long you know that you're going for an unpretentious, filling meal, you will be happy."}
{"text":"Denny Z. recommended this place to me and when I got there I realized that I've been before.  This place is solid, the variety of foods they have is incredible.  They have the regular authentic Chinese food as well as the Hong Kong style foods like macaroni and steak and stuff like that.

I might actually like this place better than Rol San because of the large menu.  We had the fake bird's nest with veggies and scallop, a black been beef dish and chicken and mushroom rice roll - so good!  I think if we go back, we would order different things (there's just so many things to try!).

We went late, but it was still busy.  The waiters/waitresses were not intrusive and the service was fast."}
{"text":"Two of us went here for the peking Duck special. For $41 you get Peking duck in two courses two dishes and soup. The price is a little deceptive because rice isn't included, and you pay an extra $1.50 a bowl for steamed rice, but it is still enough food to feed four (though you wouldn't get 4 soups). 

We started with soup, and we got hot and sour soup. Perhaps a bad choice on my part, but it was pretty horrible. Very gelatinous and thick, without a ton of flavor. I wouldn't order it again.

The peking duck comes out in two courses. The first is the way that I normally think of peking duck, with the pancakes. It was lovely, and greasy, with lots of skin and not a lot of meat. There were plenty of pancakes and they were not dry or tough like they can often be. We devoured the first dish. You get two choices for how you want your second dish of duck. We picked the ginger and onions variety that comes with the bones. This was yummy, but hard to eat since we were basically eating around the bones. 

There were about 35 different dishes that you could choose for your side dishes (and you could pay extra to get more dishes if you wanted). We picked the greens and the eggplant with pork. The greens were simply greens with garlic, but they were nicely done, and it was good to have something healthy feeling in the meal. The eggplant wasn't actually very spicy and the pork seemed kind of unnecessary. Though sauce was thick in that corn starch way, but it was lovely. 

We ended up taking a ton of food home and I'm not at all sure how it will be the next day.

Service was quick and a bit sharp, but without being unfriendly. They took time to answer our questions, but at the same time were not going to stand around and wait for us to decide. It worked out well enough for us. 

Dinner came to a total of $48 after tax and one bowl of steamed rice without tip. We would have needed a lot more rice if we had really made a dent in our two side dishes. Definitely felt like good value for the money. The restaurant itself was also clean, and well populated, in a traditional Western Chinese way. Clientele was actually mostly Chinese. 

A totally solid offering for the peking duck craving, probably not somewhere that I would eat often."}
{"text":"It's usually a hit or miss for me here. I find that the quality of the food has gone down throughout the years. I've been going here for 5 years and I find they aren't consistent. I really like their beef or seafood rice noodles and dumplings in soup. Not so much anything else. But good spot for some cheap food."}
{"text":"bomb ass bomb ass food! the decor in this restaurant is really nice too! very clean and waitstaff looks sharp. we had a table of 9 and ordered from their special combination with lobster menu where you get to choose I believe 7 dishes and a soup for $107.99. every dish was good, even the ones we thought looked plain. 

- the soup... ugh can't figure out what its called but it was bomb!!!
- 2 kinds of BBQ cold cut: bomb, very flavorful roast pork
- steamed live fish with soya sauce: so good we ended ordering another one at the end
- 1/2 a free range chicken: juicy chicken with flavorful ginger sauce for dipping on the side
- deep fried 3 kinds of seafood with salt & pepper: looked very boring when arrived but very delicious and flavorful we ended up ordering a 2nd serving at the end. 
- baby bok choy: good but veggies so moving on.... haha
- braised lamb: good and flavorful
- eggplant and oyster clay pot: ok this one i had never tried before but boy oh boy was it good especially with their rice
- seafood clay pot: this is probably the only dish that was mehhhh ok compared to the other dishes but nonetheless not bad

10/10 for food and 10/10 for service!!!!"}
{"text":"I really like this place and I think a lot of others do as well since it's often busy. This is my go to place in Chinatown for fast, tasty, well priced Chinese.

I've always had fast but friendly service and food always comes out as expected, not overly greasy, and hits the spot. What more does a guy need? Recommended!"}
{"text":"My go-to late night Chinese spot. Authentic and not altered to satisfy North Americans. Did I mention delicious? :D"}
{"text":"Best wonton soup I've had so far, and when you add noodles and bbq pork it's out of this world"}
{"text":"Ahh, House of Gourmet (or Man Ting Fang as I know it), you were my savior every weekend when i had music class and symphony orchestra rehearsals in the same, long, tiring day. I had little money, but your food was so cheap that I could fill my belly with the mere $6 I would have on me with tips and all. I still love your soy chicken, and the sauce to go along with it, it's good enough to be eaten just by itself. 

lol. Their menu is too extensive for me to have tried a lot of stuff, and I'm the kind that, when I find something I like at a restaurant, I hardly ever stray from that. I loved their black-egg conji (have no idea what the real english name for that is), and their peking duck is probably one of the cheapest, not to mention good tasting ducks around the area. Their fried oysters are actually amazing, and very fresh every time. I also love their bbq baby pork. I go there almost every time I get to China Town. 

During lunch and dinner times, it's usually pretty packed, so it'll be harder to find seats, especially if you have a big group. The service is usually pretty quick, but brisk, since there's so many people milling around, it's hard to say much more than your orders. 

All in all, one of my favourite restaurants in Chinatown."}
{"text":"We went here for a late night snack.  Let me just tell you, the salted fish fried rice here was hands down the best I've ever eaten.  The rice grain was cooked to perfection and just a look at it sold us because the rice was covered with a lot of egg.  You would think that would make the rice mushy but it was the total opposite.  The flavor and salted fish portion was just perfect.  I licked every grain of rice off the plate.  It's insane because you can see all the grease dripping with the massive amounts of oil being used.  So bad for you but sooo good at the same time.  The ung choi was decent, would of been better if there was more bean curd flavor.  Apparently the congee was delicious too.  

I don't give 5 stars often but this one truly deserves it!"}
{"text":"Service -The word \"hospitality\" is non existent and they tend to rush you to order the food, eat fast and get out.
Food- The BBQ pork, Noddle with Beef brisket, Congee with preserved duck eggs & shredded Pork are consistently good
Sanitation-Washroom is dirty
I would give them a 3 or 3.5 star if the sanitation and service is better."}
{"text":"Very nice spacious seating arrangement. The severs are a little slow but good overall impression.

I tried the rice with grilled chicken and roasted duck. Not bad overall but the chicken looked a little undercooked and was cold. The duck was better: served with plump sauce and there was a seed in my sauce....try the rice with Chili oil. To end my meal...Korean style milk tea. This was very delicious as it tasted of sugar cane juice."}
{"text":"The food is horrible. The fish was stir fried with tofu, veggie and BBQ pork, which was obviously not refresh, and the fish itself was hard and stingky. The beef was also overlooked... The only good stuff got tonight was the shrimp wanton, very impressive."}
{"text":"Wow ... what used to be a dream treat for Canadian-style Chinese food turned into a nightmare.

The hostess/senior waitress had a scowl and a tone that was brittle enough to warp the wood on a ship and sink the ship.  And yet she was nice to another couple who had KIDDIES!  She was mean to us two (older farts).

Had the flat noodles with seafood (seafood fresh), noodles greasy.  The Hong-Kong tea is always good here.  The BBQ pork here is good (don't tell my grandparents).  The bowl needed a good wash but I figured WTF I'd take a chance.  The other wait staff were very sweet - but this is no longer the place I remember.  I am crushed!!  Was so looking forward to it!"}
{"text":"Was walking in China town and decided to walk into the House of Gourmet for dinner yesterday with my family. It was one of the best dining experiences that we've had! The food was so good that we decided to come back a second time for dinner. We ordered the Vancouver Crab cooked in garlic sauce.. heavenly! 

House of Gourmet is a must if you are in Toronto!"}
{"text":"I came to the house of gourmet coming off 8 years of avoiding the place after I got food poisoning from a fish dish the first time I ate here, and I'm glad I decided to give them another chance.

Despite the obvious issue, the place is much cleaner than before, both in the eating and prep areas. We made a reservation and we were seated immediately and were greeted with plentiful seating and very friendly hostesses. There's an extensive brunch and special menu which you should definitely take a look at as there will be something for all palates with both Western and traditional Hong Kong favorites.

I ended up playing it safe this time around, avoiding the fish altogether, and opting instead for an egg sandwich, tea and a lychee cooler and I was very satisfied with the total lunch price siting around 6.50. Good value, good food and great service what more can you ask for? I'll be definitely coming back in the mean time, but it'll be a while before I get another fish plate."}
{"text":"I used to go to Kings Noodle until we started frequenting HOG. They have great congee, fried turnip and garlic sprouts. I have been here a number of times already and it's satisfied me every time. Fast and quick service. Eclectic crowd which means they cater to all. A nice spot in Chinatown."}
{"text":"I've been to HoG thrice now, and i rate it a solid 3.5*

It's excellent for a more authentic 'value' Chinese experience in a group setting (4 or more). 

A friend introduced me to it, and pretty much explained how i should and shouldn't be ordering. This is what i learnt: 

- The value of this place lies in the special combination dinners, at the back of the purple menu 
- Do not bother with the green menu unless you looking for greasy and cheap
- The combination menu's come with two x 1lb lobsters or with Duck. Your choice. The combo menu's are laid out as either being 3 - 8 dishes in with soup. For example, a 4 dish combo with lobster costs $63

The lobster is done really well, lightly deep-fried to absorb a green onion and ginger sauce. The fresh fish of the day (typically tilapia) is done the traditional steam way and it's perhaps the best thing on the menu along with their specialty in cantonese noodles. Other dishes are decent (not exceptional) and include things like sizzling filet, duck, and so on.

I see some pretty bad reviews here - but i'm honestly quite impressed with the ability to eat decent food for $20 (in a group of 4) which includes filet, lobster and steamed fish and all at decent taste."}
{"text":"This establishment features a variety of menu offering from different cuisines from China.  Judging by the large number of Chinese patrons over the lunch hour, I figured it should be a safe bet, so I tried.  The place was packed so I was willing to overlook the fact that they asked us to share the round table with 5 other people.  However, from the moment i sat down til i settled the bill, no one came to collect or clean the dirty dishes with leftover food left behind by previous customers - God knows how long they had been sitting there.  I had to shove them aside to make space for my own food, which is not one of the things I'd like to do when I dine out.  

We ordered Szechuan chicken and beef ($13 each).  Not impressive.  Meat was fresh but the sauce was strange - some blend of oyster sauce, sweet and sour sauce and hoisin likely wokked over fire for 10 seconds - just no depth, no tongue-burning and frankly a complete sacrilege to call it \"Szechuan\".  

It's unfair to judge a restaurant with one visit but I concluded that the place was packed because of the price, not because of the quality or service or the food.  I'd try again but only if I am hungry, happen to be in this neighbourhood, and maxed out my credit card for the month."}
{"text":"Got the seafood congee with Chinese donut. Congee had lots of fresh seafood (squid, shrimp, scallops). The Chinese donut was freshly fried but I don't think they are made in house as I see prepackaged donut in their fridge. Also got a plate of vegetables and hoisin sauce.... so delicious"}
{"text":"Amazing, patient and accommodating service at a delicious and affordable Chinese restaurant in the heart of Toronto's Chinatown!"}
{"text":"Great dinner deals, you will not be disappointed. Stays open late. Great tasty food. Great lobster deals. We are Chinese born Hong Kong from Louisiana so we Luuuuve food. We also eat beef chow fun, my husband said they have the Best Fried Chicken."}
{"text":"Get the beef and raw egg on rice. It's the best rendition of the dish in Toronto. Service is fast and friendly. Great place to eat after drinks. Great hours."}
{"text":"for a typical noodle and siu mei (roasted meat) joint, the name is a bit presumptuous.  moreover, like many chinatown restaurants, it is noisy and can be crowded, and little attention is given over to pleasantries and other niceties.  (however, in case you're wondering, it is *sufficiently* clean.)

taste and speed are factors that distinguish a chinatown restaurant, and house of gourmet excels on both fronts.  for example, the beef brisket is more tender and juicier than its peers (for example, goldstone and king's noodle).  

it's good food at a good price."}
{"text":"I came to get some Cantonese food for my last day in Toronto, and I choose this one. I saw that they have some HK style spaghetti but they only have it until 5 pm. So I couldn't get that but I ordered the soy sauce chicken for appetizer and a black bean beef fried noodle for main dish along with some HK milk tea(had two LOL). The soy sauce chicken had no taste and it was cold. The black bean beef fried noodle was all right but not as good as I expected. 

Service.....it takes them a while to get their attention, and they tend to walk away before I am even finished. Even though it is not crappy, I wouldn't recommend this place if you want some decent Cantonese food."}
{"text":"I seldom frequent this restaurant because the service is subpar compared to the local competition. Used to be a regular customer for lunch/takeout at HOG. Though the dishes are adequate and the prices competitive the service really sucks. When I used to eat here upon finishing my meal and head over to the cashier to pay my $25-$35 (with an extra take out dish) 9 times out of 10 she will ignore me, cash in hand, and service someone who is Chinese-speaking. I realize that I don't speak fluent Chinese but that is no reason to discriminate! I'm a regular, paying customer and she knows that. 

I decided to give this restaurant an other try today and went in for a late lunch. The place wasn't busy at 2:15pm. I waved for the waitress and pointed out the lunch special menu (11am-3pm) of Curry Beef Brisket on Rice -which other customers were ordering. She took her time to come over and told me that the lunch special was over. i said it was only 2:15pm and the special is good until 3pm. She walked away so I had to ask another waitress to assist with my order.

They lost a regular customer in me. Lots of Chinese restaurants in Downtown Chinatown with good food and service who would appreciate my business. Chinese Restaurants like Canteen, Swatow, Rol San, king Noodle House, Lee Garden and Rosewood etc."}
{"text":"Super good dining experience here in Chinatown. Interesting experience, nice service, and very good  Chinese food.

After reading some of the previous reviews, we went in with lower expectations, but House of Gourmet far exceeded them.

We spend over 4 months in China, (still don't speak Chinese!)  so maybe we liked it because of a bit of nostalgia, BUT the service here definitely was FAR superior to the majority of the restaurants that we visited in China! The staff seemed pretty fluent in English. 

We sat at a big round table shared with 3 other couples (which seemed to be fairly norm here), and it was not uncomfortable at all.

The BBQ pork was the best thing that we had,  followed by the BBQ duck and also the shrimp wontons (in noodle soup) were to die for (IMO). 

The older Chinese couple next to us at the table told us that after returning from a week in Cuba on vacation, then needed to come to House of Gourmet to have some Chinese food which they had been missing so much (they had noodle soup and BBQ pork).  We felt even more confident about our restaurant choice in Chinatown after hearing their opinion. 

If you don't mind the Chinese atmosphere and want some good Chinese food, then I would definitely recommend house of Gourmet!"}
{"text":"5 stars for an authentic Chinese food experience - complete with affordable food, yelling Chinese ladies, and potential sharing of tables with strangers. It's a classic Asian experience in the heart of Chinatown. Opens late and a go to place for many after a night out. 

FOOD:
The food here is very affordable with each dish usually below $10. The menu has hundreds of items for you to choose from. We got some rice noodles, ma po tofu, and some duck with rice. You can't go wrong with their duck / chicken + rice... it's a classic! Also had 2 Hong Kong milk teas which were tasty and strong in tea flavour.

SEATING:
There's fairly quick turnover here for seating - if you don't mind sharing with strangers at a large family style dining table. They have tables for 2 as well - you'll just have to wait a little longer should you specifically want to sit alone.

SERVICE:
Keep in mind this is Chinatown so don't expect anyone to refill your water every few minutes. You'll likely be asked what you want within a few minutes of sitting down and throughout your meal, hear lots and lots of yelling. But that's just Chinese restaurants for you, and I'm willing to sacrifice on service for some decent Chinese food at good prices."}
{"text":"Cheap Chinese Food... Not the best, not the worst, but middle of the road.

Huge menu. HUGE!

We ordered beef and Chinese broccoli, General Tao Chicken, Singapore Noodles and Shrimp Dumpling Soup.

Overall better than Swatow around the corner, but Swatow still wins for best Shrimp Dumpling Soup!"}
{"text":"Classic Hong Kong style eatery. No frills dining with a bunch of crazy animal parts on the menu. Still interested? 

If so, this place has basically everything you'd want at all hours of the day.  Place has two menus. One is the standard, and other is for their special items. 

I tend to stick to their BBQ items, and wash it down with some cheap Heineken. Baby sucking pig, and BBQ are common, and their shrimp wontons give most places a run for their money. 

You could spend days eating without trying everything, but stick to what the locals order. 

As with most places in Chinatown, it's not the prettiest. I'd hold it in too if you need to use the washroom - it's pretty nasty."}
{"text":"On this one to five rating system, the food is passable so the 2-star rating stands. But the service leaves little to be desired (0 Stars).

I have truncated my 40+ line review in light of new news regarding businesses and a media clause. Restaurants and businesses can add a no report on media site clause to their invoices and receipts that we sign saying, we the end user can be charged (fined) if they find our review to be not in their favor."}
{"text":"Good food, but mediocre service. 

I've been coming here since I was a child. It's my family's go-to spot in Chinatown! The food is decent and well portioned. The reason for the missing two stars is the customer service; though not all, some of the waitresses are rude and quite stingy. My friends and I came by the other day and one of their bills came to $9.03 in which they were in the process of paying. Our server started counting their money and rudely tapped on the bill demanding for a tip. Not asking, but demanding. Overall, servers seem to get the job done, but some lack manners in the process."}
{"text":"I'm so disappointed, and I hate writing one-star reviews unless if I feel very strongly about something, so here we go. 

My friends and I visited this restaurant during a weekend get-away to Toronto. We were really looking forward to eating a decent Cantonese breakfast. Since there is a significant Cantonese population here, and based on Yelp, we thought we couldn't go wrong. Oh boy. It was such a let-down. Part of the reason is probably because we had such high expectations. 

Below are some of the dishes we ordered:

1) Steam shrimp roll/???-I am not kidding when I say that this is completely tasteless. It's a very strange experience to know that you are eating something, but there is absolutely no flavor. 

2) Toasted bread with condensed milk ??+??-Umm. Typically this is served as a thick-cut bread that's slathered with some butter and drenched with condensed milk. Their version? It's the typical sliced white bread half toasted with maybe a 2-mm thickness of condensed milk layer. 

3) Cantonese coffee ????-Everyone in the group has eaten at Cantonese cafes/restaurants and also at cafes/restaurants in HK, so don't label your coffee as Cantonese if what you're serving is regular drip coffee, and you provide a couple creamer singles to go with it (I'm not even exaggerating). When I asked about condensed milk (Or even for that matter, evaporated milk. I know different places make their coffee/tea differently), our waitress told us they didn't have any condensed milk. Then five minutes later, she brought out our toasted bread with condensed milk (See #2 above) 

4) Cantonese coffee+tea ????-See #3 above. 

5) Wonton noodle soup ???-Meh 

Without looking at the pictures, I honestly can't  remember what else we ate. Lastly, I don't know what to say about the service. Everybody knows you can't expect much at Asian restaurants, but when multiple people had to ask more than five times for a glass of water, it just made me wish I could take that part of my life that I spent at this restaurant back."}
{"text":"I love this place. Been coming here for years and finally had a chance to review. This is now my favourite place after Noble seafood closed down. I like the fact that they accept visa (order over $20) and debit (order over $5). As well, they have a diverse menu for lunch specials where the most expensive dish costs ~10$. They also have noodles and Bbq meats which I love. This is a one spot stop for all your chinese food cravings! The portion sizes are big without sacrificing taste. Lastly, the staff is very welcoming and for once they understand English so all your questions will be answered"}
{"text":"This spot is the goto spot after a night out of drunken adventures. Food was great and the staff were friendly. I thought the food were reasonably priced and it's definitely a lot better than some NYC spots. It's pretty legit as a Hong Kong style restaurant. I'd come back if I ever visit Toronto again!"}
{"text":"House of Gourmet (HoG) marks what may be one of the last chapters for me and my group of friends. 

A few years ago, we chose HoG as the site for our pre-movie Christmas dinner. 

We ordered mostly chicken dishes, defanged the spice levels, and requested accommodations for peoples' religious beliefs and general squeamishness. No pork, no shrimp, no beef, just fun and fellowship among the Jews and Muslims and others driven out into the cold on Christmas Eve. 

We ordered many glasses of water and diet cokes, and were generally pretty raucous. 

Despite having to repeat a few of these requests, they were readily accommodated by the harried staff. We ate a tonne, paid a little, and went on to argue about which movie we'd see (this part of the evening was less successful. Unable to decide between Les Miserables and Django Unchained-I know, how could you tell them apart?-the group split off. 

We all left full and happy. 

Soon, some of us would be married off (some to each other), and would start popping out babies--babies who will one day join in this most esteemed of cultural traditions. But for now, this would be way past bedtime."}
{"text":"This place I go regularly. Food selection is great. Service is fast and efficient. Price is decent. Quality wise, they are usually pretty good and consistent. Just don't order their lunch specials take out - the portions and quality are disappointing. But dinning in is great. Best thing is that they open late (til 4am on weekends), and the atmosphere is clean, bright and roomy."}
{"text":"Great place if you're looking to grab a bite past the usual dinner hour.
The further back of the restaurant you're seated, there seems to be a funky smell. Can't really describe what kind of smell, but it doesn't smell pleasant at all. 
The service is fast and has a huge variety of Chinese dishes.
Sharing tables is allowed and common, very Hong Kong style Chinese restaurant in the heart of Toronto's Chinatown downtown.
This is a good place if you're not too fussy and merely want something to fill up your tummy, quick and easy."}
{"text":"The only reason why I stepped inside this restaurant is because I saw how crowded it was and thought to myself that lots of people = great food. That equation, unfortunately, doesn't always work. The place is indeed buzzing with people most of the time, it's loud and you'll be lucky if you flag down a waitress. The menu is gigantic with more combinations than you would normally expect at a Chinese restaurant. We ordered duck with rice noodles. The duck was so-so, but the noodles were bland and   covered with gooey stuff made of eggs. Suffice it to say, the noodles tasted awful. After my gf and I were done, we felt weird in the stomach and my gf even vomited at night. Yes, most dishes on the menu are priced in the $5-$10 range, but the quality of food is abysmally low, being greasy and bland. If you need some calories when you're feeling hungry, I'd recommend to walk a bit west to Spadina and then about 100m north to Ajisen. Ajisen's pork ramen is unbeatable, especially on a windy and cold winter day."}
{"text":"It's time for a change from Golden Stone on Spadina. 
I had really wanted Cantonese cafe breakfast and suggested to my mom that we head to House of Gourmet. Let me just say that their breakfast is CHEAP.
I had the beef vermicelli with free milk tea for $3.50. My mom had the congee with all the innards of a pig for $3.99 and a little extra for the milk tea. After tax and tip, we paid $11 and we were FULL.

The quality of the food is pretty standard for what I had but i am interested in trying out their lunch specials and afternoon specials. Service was typical cantonese. Not very friendly but gets the stuff done.

Will be back!"}
{"text":"This place serves the Chinese food from my Canadian childhood memories. 

I grew up in Scarborough as a wee one and was torn away from my beloved GTA home for California, where sadly, subpar Chinese food reigns supreme. 

After spending years searching for Chinese food that satiated my childhood cravings (only coming close in Vancouver) I finally stumbled across this place on a visit to Toronto with my family. 

It was like a delicious Proustian experience for me and certainly proof that Canadians just do it better."}
{"text":"In general, I am underwhelmed by the food in Chinatown Toronto.  I find the Chinese food in the suburbs (Mississauga, Markham, & Richmond) to be tastier.

I had dinner at House of Gourmet two nights ago.  A plus is that they are open til late (2am/4am).  Their appetizer selection was lacking.  It's a Cantonese restaurant with roast meats, is clean, and does have non-Canto dishes.  

I tried a Sichuan-style spicy eggplant with minced pork, which was just okay.  I wasn't craving anything Cantonese at the time."}
{"text":"Quick order of HK milk tea.  Can't complain, $1.85 for a hot beverage with milk.  Anywhere else that would have been a $3 drink at least"}
{"text":"This is your typical Cantonese comfort food restaurant. Apparently, they're beef brisket stew is quite popular here. I noticed a lot of patrons ordering the beef brisket noodle soup. I ordered the same except with wontons and ho fun noodles! The brisket was nice and tender and the soup was tasty. It wasn't overly salty and I didn't experience a bad MSG headache afterwards. So that's a good sign, ya? I also had a seafood and pork congee. I'm not crazy about them using pork skin in my congee though and wish that they instead use salted pork meat like they do in NY. I noticed this in a few other Cantonese restaurants in Toronto. The congee was a tad less salty than what I'm used to, but that could good sign because some congee places overload the soup with MSG. It might taste great at first, but then you feel like a water balloon. Also, the service could be a tad more attentive. I only had one cup of water during my whole time there."}
{"text":"This place is all business... really good food, fast. 

I think we were profiled as soon as we walked in. They let us choose our seating location but the waitress serving a different section helped us after a sharp discussion with another server. I think it was a language thing but who knows, I only speak English. We were one of four Caucasian parties dinning with them at the time. We all had the same server. 

The menu is huge and there are two of them. Every few minutes our server checked on us... ready to order (big smile). It was a high pressure situation. This isn't an Applebee's menu; no short narratives heavy on descriptions and pictures... Just line after line of choices (fried rice, fired rice with vegetables, etc). We stuck to what we were familiar with and the food was great. The dishes are served family style. 

Moving to Canada has been a bit of a financial shock when it comes to eating out. The prices at this place were great. We were out the door for under $30 (including tip) and we had left overs (we drank tea, not beer). I recommend you give House of Gourmet a try."}
{"text":"Good place and price for Toronto!  Love their Peking duck and lobster too!  They're fast with service and like any other Chinese restaurant theyll hand you the bill without you having to call for them.   Some would say it's rude but I've grown use to it."}
{"text":"I was about to go home in the evening last night, but suddenly, decided to have a lite dinner. Nearby was House of Gourmet. Gone there and have some bites, it was okay. Staff was bit slow, but no doubt was cooperative. Not a good experience to place a 5 star review. Hope to have another visit again for delicious dinner with my friends !!"}
{"text":"My staple Chinese restaurant in the downtown core! Traditional, tasty and lots of variety (some dishes better than others). Great for single meals AND group dinners."}
{"text":"Very nicely done. This place serves up traditional Chinese food. The venue is massive with those huge tables that can seat up to 10 people. Their seafood menus is extensive and the chow mein is expertly made. We usually never have to wait to be seated and we always see large groups here. It's located east of Dundas and Spadina, on Dundas. The venue is a bit hidden, so you'll have to look a bit but it's on the north side on Dundas. There's a butcher shop in the front window for you to get your roast pork to go or dine in. Overall it's super cheap and pretty good. Come here if you're craving Chinese food. Pro tip: Some meals don't come with rice so make sure to order a bowl of small rice."}
{"text":"Great food, great service.  I highly recommend this place - really takes me back to my childhood.  And the prices!  You can't beat the prices:

$11 gets you:
- toast with eggs & sausage
- toast with eggs & bacon
- roast pork with macaroni
- iced Horlick (malt drink)

$12 gets you:
- beef brisket & egg noodles soup
- beef brisket, shrimp wonton & egg noodles soup
- iced Ovaltine

The portions are big - I could have shared and still be full (but if you know me, I don't share). ;p

If I lived in the area, I would go there every day."}
{"text":"Just maybe I need a beer or 2 more before I eat at House of Gourmet. 

Came here on a late night after a few beers, I was hungry and ready to have some \"cheap\" good Chinese food. The menu is quite extensive so we ended up ordering

Beef Tenderloin on a Sizzling Plate with Chef Sauce ($12.99)
- Beef was  tough and tasted bland

Beef Rice Noodle ($8.95)
- food court quality: super greasy with no fresh off the wok taste

Stir Fried Veggie with Garlic ($10.95)
- oily oily and why veggie has to be that oily

The portion is decent and House of Gourmet opens till 4 am on weekends. So should I go to bed hungry or should I come here to eat next time? Maybe I should drink another pint or 2 instead.

Washroom here though really clean!! I do need to go washroom after all these beer drinking!"}
{"text":"Good cheap Chinese food in the heart of Chinatown. 

The preserved egg and pork congee for $4.50 is a bargain! Very generous with the ingredients and tasty

We usually take out an extra order.for the next day!

The other dishes we like are the barbecue meats with rice.  When we are not in a spendy mood this is our downtown haunt."}
{"text":"The only thing that brings me back to House of Gourmet is my cheap friends or late night eats. The food is decent enough, nothing that stands out too much compared to other local offerings, but the service needs work. Now, I'm used to below average service living in Chinatown all my life and not speaking a lick of Chinese but there are some pretty bad stories I can give at House of Gourmet. 

Once, all my friends (group of 6) received their meals and I was in limbo. It must be a recurring trope in my life since it happens quite often to me. After asking our host/waitress several times, they started arguing with other waitresses to say that I didn't order. She finally checked out her notepad and 'lo and behold, she didn't ring the order in. No apologies, just dropped my plate of rice and meat in front of me. 

The most appalling - and in retrospect, hilarious - was when I was at House of Gourmet with my friend and his spoon was extremely dirty (I'm talking stains and hardened rice, all that!). He called a waiter over who gave copious amounts of attitude on his way over. My friend explained that his spoon was dirty and if he would get a new one. As we watched the waiter step away, we saw him wipe the spoon with his uniform and come back. He then proceeded to just throw the spoon in front of my friend and said 'here'. Suffice it to say that he did not get a tip that night."}
{"text":"Yum, cheap Chinese food. Yes, I know the majority of places in Chinatown are cheap, but this place is CRAZY cheap.

When I went there, I saw we had just missed the \"Lunch Special\" but just after that, there was a \"Tea Special\" that was just as cheap. Not to mention the Breakfast Special, Dinner Special, and the board of \"Specials\" on the wall. I feel like everything is on sale all the time!

This place has great BBQ Pork and rice dishes....so good. But I would NOT recommend taking the risk on their Rice Rolls -- mine was really dry and tasted a bit off. I'd recommend King's Noodle down the street for Rice Rolls what will change your life.

If you are starving and want a bunch of food for under $5, this is where you need to be."}
{"text":"Came here for probably thousands of times, and it is still one of my favorite spot to have good Cantonese food. Love the Peking duck here! And the Vancouver crabs"}
{"text":"Their wonton and dumpling soups with noodles are excellent. Inexpensive but not cheap on flavour. Also great for late night eats."}
{"text":"3 and half star

it's quick fast and cheap. service is soso.

Order chinese dougnut with rice rolls. Their congee (little.boat with thousand year old egg)are delicious. Their wonton noodles are pretty simple el dante and descent amount of shrimp in the won tons..ho fun is a bit oily but itS suppose to be.

pretty cool you could watch the chef cook from the outside,total hk style

if you wanna experience a descent cheap hong kong style resto this is the place to go"}
{"text":"I had the wonton, BBQ pork, & duck with egg noodle in soup in $8.25, and it was very good for the price. There were five slices of duck, six slices of BBQ pork, and three wontons.

The duck was great - savoury, succulent, and tender, and the BBQ pork was also very tasty, albeit a bit fatty. The wontons were... adequate. Not as tasty or fresh (the shrimp) as some others I've had before, but they were large and fairly decent. 

The noodles, though. Holy crap, I swear there was a pound of noodles in that bowl. I was stuffed by the time I finished eating.

There service was perfunctory but very quick, so nothing to complain about.

Would definitely visit again, especially if I were starving."}
{"text":"So what do me and a few coworkers do on the coldest night in Toronto in over 30 years? Go to Chinatown and hit up a highly recommend spot. Turns out that place and most didn't take credit card, cash only. 

Well that put me and the lads in a real spot. We literally ran outside from spot to spot because it was so cold. We ended up taking shelter in this phone accessory store. I flat out asked them what's a good spot that takes credit card and was good. Without hesitation they whipped out the House of Gourmet menu! We ran as fast as we could in the cold. 

Inside we were promptly seated and given hot tea. We looked at both the menus and we were overwhelmed.  Our waitress helped a lot. We ended up each getting a version of wonton noodle soup with sides. All the food was top notch and damn tasty. This place was the highlight of my culinary experience in Toronto! 

Again our waitress was great. The menu can be a little much. Ask for help. They take credit and will split.  Minimum of $20 CA per card. If you're a tourist save yourself some trouble and come here. This place is decent in size while others and tiny shacks. Clean and respectable place. Even the restroom."}
{"text":"I got the roast duck won ton noodles. The noodles were good and firm and the wontons were 100% shrimp which was very good. The roast duck and roast suckling pig was bland.  But not bad for the prices."}
{"text":"We got the peking duck along with some \"3-kind\" seafood stir fry, snow pea leaves with garlic (they call it \"young bean leaves with garlic\"), steamed live fish, and the house special fried rice. The peking duck was good although the sauce wasn't the best that I've had- it was too watery and not tasty enough. Still, the duck meat was perfectly cooked and not overly fatty. The snow pea leaves were AMAZING. Hands down best dish of the night. It was fresh and perfectly seasoned. It's really hard to get this dish right for a lot of chinese restaurants. The house special fried rice was very good as well. The seafood stir fry was tasty but filled with way too much squid and only a few pieces of scallop and shrimp to fulfill its title.  And finally the steamed live fish... probably the worst dish of the night only because the fish wasn't super fresh and they didn't use the sweet soy sauce for the fish that most chinese restaurants use. They seem to only use regular soy sauce, which doesn't really work as well for me. Still, it was acceptable.

One warning though: do not take a date or friends to this place if they like very... blunt service. Don't get me wrong, the waitresses are extremely efficient and you can tell they work very hard even though the restaurant wasn't full. The thing is they tend to speak very quickly and get impatient if you don't spit out your order fast enough. The waitress in her efficiency also grabbed the menu and swung it right over my sister's head missing her by about an inch. I was amused and impressed but others might have been."}
{"text":"\"Meh. I've experienced better\" is about right. It was a cold, below zero night and if it wasn't for the hot wonton soup that warmed me up I would give this place 1 Star. The staff is not welcoming at all and they come off as quite rude. I am not Chinese and needed some clarification with the menu but apparently asking a question was not worth their time to answer as the waitress gave me a one word answer \"No.\" and walked away. I simply needed to know whether or not the dish I was planning on ordering came with Rice or if I had to order it separately. I asked again and the waitress said \"That's a different price\". She then walked away, AGAIN! After deciding on the Black Bean Beef Tenderloin special, I regretfully have to say that this place is far from \"Gourmet\" as their name suggests. It was very bland to say the least. The hot chilli oil on the condiment tray was much needed to give this dish a little bit of life. I payed the bill and left without a thank you from the staff and when I asked for my receipt I got a loud sigh from the cashier. If you're in the area and in the mood for Chinese, keep walking fellow Yelpers."}
{"text":"My favourite place to eat in Toronto! Come here way too often, but you can't beat the amazing food and quick service. Authentic Chinese cuisine and feel."}
{"text":"I recommend this place for chinese food. They have a good afternoon tea menu that comes with a tea/coffee for a great price, 4-5 bucks. I also highly recommend the fried wontons. I love their coffee/tea mixture. Overall, a great place for chinese food here in downtown."}
{"text":"Got sick after eating here. STAY AWAY! Good quality was terrible. Shrimp wontons had shrimp shells in it. The shrimps were not clean and was loaded with black poo. The shrimp was not fresh, so the texture was soggy and stuck to the shells. DONT EAT HERE UNLESS YOU WANT TO FEEL SICK ALL NIGHT"}
{"text":"Initially went to Chinatown to eat beef brisket noodle soup at Kings Noodle but they were closed on Wednesdays. Walked down Dundas and found this spot, decided to try it and as really surprised. The noodles were tasted good, much more generous portions compared to Kings Noodle and they were the same price. Would recommend this place!"}
{"text":"I loved the food.  

The soup I ordered did not come with shrimp and pork dumplings it came with shrimp and a different shrimp dumpling.  This was good for all at the table except the person who does not like shrimp.  The other foods we ordered were great.  The staff is busy and you must be aggressive about getting things, but they are wonderful once you get them.

I really liked the place, and would return if we go back to Toronto."}
{"text":"This restaurant has been there forever. I had not gone there for more than 10 years. On Wednesday, I was planning to go to King's noodles. But it was closed. So I ended up in here. For single customers, they have a few big round tables in the back for the singles to share. The table where I was eating was actually quite comfortable. I didn't feel awkward eating alone like in some other restaurants because there were 4 others eating alone at my table. So I really like that. It was casual atmosphere. When I got there was around 2;30 pm and the restaurant was packed, which was a good sign. 

I ordered the beef brisket with ho fun (flat rice noodles) for $4.5 and beef chang fun (dim sum  rice noodles with minced beef inside) for $4. Price was unbeatable. The chang fun was freshly made in the restaurant, which tasted different than other dim sum places, I kind of like it even the skin was a bit thick for my liking.  The beef brisket tasted like rock; however, the ho fun was good. I think I will order the same things next time except the beef brisket."}
{"text":"Food is quite decent, just not a-m-a-z-i-n-g. I like it."}
{"text":"Have you ever been to a restaurant with over 800 menu options? You haven't. Read on. 

House of Gourmet raises many questions and answers all of them with simplicity and consistency:
Do you have wifi? (I don't know).
What's in the tofu and vegetable hot pot? (Tofu and vegetables).
Why are there so many Jews here? (It's Christmas). 

Seated at a large circular table, we dined with a number of regulars, all warm and full of menu advice. I learned the ins and outs of perhaps Canada's largest menu, filled with authentic Chinese delicacies. I eventually decided on the traditional \"General Tao's Chicken on white rice\" retailing for $12.50 (by some Christmas miracle I was only charged $8, however). The service was no-nonsense; I believe I exchanged fewer words with the waitresses (we had at least 7 different ones) than I typically do with a toll booth agent. 

The food arrived rapidly, as if the chefs were clairvoyant mediums. Commenting on the taste and quality of the food is perhaps cliché for a restaurant review - I will avoid doing so here - but know this, Yelp: for the first time in my short history, I returned to the same restaurant twice in the same day. 

Cracking open the fortune cookie revealed my kismet: \"you will be spoiled with wealth and rices (sic)\". If a being a satisfied House of Gourmet customer counts as riches, I am an extremely wealthy man."}
{"text":"Friendly, been coming here for years, wish the washrooms were cleaner, honestly I like a clean washroom, and they don't exactly have a pristine clean not should I expect it too, but that's just me right.  
Yelper for life."}
{"text":"Food portions were small and nothing special.
Bonus its its open late."}
{"text":"I went to this place a lot. This is a Hong Kong style cafe. It is close to University of Toronto, so I went here a lot during my last year of university. It is cheap. They have afternoon special from 3-5, a dish and a milk tea is 4.99 (used to be 4 dollars during my university year).
It is the typically chinatown cafe you would expect. Busy and impatient waitresses and waiters, cheap and authenticated food.
I usually order beef fried rice noodle. It is pretty oily, but I like it. Sometimes the dish came was cold, then they just microwaved it.
I ordered their rice noodle, which I don't like it that much. They rice noodle was too soft and fell into pieces.
I would come to this place for the lunch specials and afternoon speicals."}
{"text":"Not from Toronto so I can't compare it to other Chinese restaurants in the city, but it was cheap and yummy food. It reminded me of being in a New York Chinatown restaurant. Service was typical Chinatown restaurant style--not very warm and friendly, but they got our food out efficiently."}
{"text":"Not sure what the hate for this place is about, but this is as cheap/available as it gets for a HK-style cafe. The weekly and tea time specials are legit - it's really hard to complain for what you get for $4.99 + HST. The portions are pretty big for the price. It's a good spot when you need that second dinner if your first dinner happens to be not so filling. 

Don't get brushed off if you have to deal with the communal table setup here. It's just part of the system. They're an efficient bunch.

I've had their wonton noodle soup and their spicy beef noodle soup here. They were both delicious."}
{"text":"The price point is a little higher than the places I frequent in Richmond Hill/Markham and the selection is smaller, but if I ever craze decent, solid, authentic Chinese food when I'm downtown, I come here!"}
{"text":"This place is my go-to spot in Chinatown - just east of Spadina on Dundas.

I've been coming here since I was a kid as my family attended a church just down the street from the place, also on Dundas. I stop by for a quick meal when I'm short on time and don't want to think about choosing a restaurant -  which is often.

The service is typical of most Chinese venues, very blunt and to the point - it's as authentic as it gets, myself being in the hospitality industry, I have no qualms with how the front of house staff work.

The food is always good, reminiscent of home, with amazing prices and comes out quick.

I recommend the cheap dinner combos or breakfast/lunch deals. Ordering a la carte can be a little pricier and difficult if you don't speak the language.

Breakfast is Hong Kong Cafe style and is my favourite in the downtown core."}
{"text":"???????????10?????????????????????????????????????????????????????????????????????????????B????????????????????????????????????????????????????????20????????"}
{"text":"busy, chaotic, but holy crap it's the best damn rice noodle i've had in canada.
typical chinese restaurant, maybe a bit cheaper. staff seems abrupt but they don't screw up and are efficient - what more do you want for spending $4 on a hot meal!?

 - I went back a few weeks later and the food was sub-par.... need to try again before I make further judgement(s)..."}
{"text":"This is our late night go to place.  Lots of selections!  Fast and speedy service.  Sounds like a typical Chinese resto in Hong Kong... lots of loud chatter, yelling out of orders from the front of the restaurant to the back.  Haha.  Very entertaining though.  

They have great Bbq pork handing in the window.  Of course they have the whole ducks and chickens hanging there too.  Yum!  Lol.  Definitely a must is the big Roast pig as well.  Skin is crispy and you also have a choice of baby suckling pig or adult one.  

The lobster E-fu noodle is good too.  A great late night snack is the pork and thousand year old egg congee.  They are very generous with their ingredients.  Spicy Carrot cake is also pretty good.  

If you fancy just a nice hot bowl of wonton soup, they make it fresh everyday. There's a station for that right at the entrance beside the door just as soon as you enter.  

They are open til the wee hours of the morning so it's a perfect place to go to when you have late night hunger pangs.  Very friendly people too."}
{"text":"Items from the soup/noodle menu was good. I got a beef brisket rice noodle for 4.50, while my bf got a beef brisket and tendons on rice for 7 or 8. Portion was big as well. Was there around 5pm, food came fast anf were pretty tasty"}
{"text":"There are a million items on that menu and we were completely overwhelmed.  It was actually pretty clean for a place with such high volume of traffic. 

We got some jelly fish, porridge and fried noodles. It was nothing spectacular but it was cheap."}
{"text":"Great food, great price, mediocre standard Chinese restaurant service.

The lobster congee combo special is pretty good. For about $19 you get 1 lb. lobster congee, a choice of rice roll, and Chinese deep fried doughnut. The rice roll is made fresh to order.

The Roasted Pork is soooo goooood. Crispy skin and lotsa meat.

I also really like the Steamed Oyster with two choices: Garlic sauce or Black-bean sauce. I like both, but Garlic's better. Just make sure you got some super-minty gum for afterwards.

Deep fried spicy squid is a bit bland, but it's okay. General Tao chicken's pretty standard, but slightly better than some. I just order them because these are the standard stuff my boyfriend eats at every Chinese rest.

The washroom's decent. Cleaner than most Chinese restaurants' toilets.

Most servers are quite alright, except for this 1 lady with short hair. She fulfills every typical Chinese restaurant server stereotype. So grumpy and almost throws/slams bowls, spoons, etc. onto your table. Don't take it personally. It's Chinatown, whaddya expect? oh, and I don't speak Chinese, so it gets confusing sometimes. Best is to order and point the number on the menu, rather than just saying it out loud, but i'm sure if you speak Chinese, it'll help.
They're pretty efficient though. The crowd's pretty mixed, not just Asians.

To finish off my meal, i like to order the Red Bean Punch with Coconut Milk. Yum :)

Dinner for 2 for me costs about $30-$50 after tax depending on our level of hunger. We can eat a lot."}
{"text":"Fully authentic Hong Kong style food and set up.

Food was spot on. Peking duck, hot and sour soup etc were all excellent.

Fresh made food in a family style cafeteria setting with \"make your mind up what you having\" type service which adds to the experience.

Good value prices and if you do research the menu beforehand you can snag plenty of bargains and eat very well for not a lot.

Loved this place."}
{"text":"Several of my friends that live and play downtown like this place a lot and I can see several reasons why : 

- it's cheap
- the menu goes on for pages and pages and into another menu
- it's fast

Having been there twice now, I find this place does the job for what people want in this area. I actually wasn't too impressed with my first visit here with a friend. We had ordered a beef dish, a plate of green veggies and a plate of scallops. From what I remember, it just felt like all the sauces were so tapioca starchy and that really turns me off. 

When another friend suggested going here, I was tempted to say noooooo but I bit my tongue and figured I could choose something else anyway with their billion item menu.  I played it safe this time and ordered fish and shrimp congee and their turnip patties. I admit, I like these simple dishes a lot better! Congee was $6 for a huge bowl full of plenty of sliced fish. The turnip patties were surprisingly good too. I love when they make it nice and crispy all around. Almost as good as Congee Queen's version, which is the best I've had so far in Toronto. 

We started out with a group of 4 people and slowly grew to 8 over the night (with food ordered throughout the night) but we sat in the restaurant from 7:30 til midnight without anybody harassing us about leaving so that's a big +1. Service is prompt and friendly. and they kept our tea filled all night as well.

I'm in no rush to come back here but I'm not opposed to it anymore as I'm sure I could find some more dishes that I would like."}
