{"text":"Very satisfied with all the food I tried tonight! I had the Governors chicken, Pork Mu Shu and Shrimp with Lobster Sauce. All of it was excellent and I will be eating here every week! Thanks House of Mei"}
{"text":"Good service and food for low prices. Quiet atmosphere. I went with my partner and we had a garlic pepper lamb dish for 10.95 and shrimp lettuce wraps for 10.95. Both were excellent with large portion sizes. The only thing I didn't fully enjoy was the appetizer. We had a 7.95 sampler for two with shrimp, calamari, egg rolls, and pot stickers. Most food in the sampler was mediocre, but I can't complain too much for the ~$36 price tag for drinks, appetizer, and 2 great entrees."}
{"text":"Absolutely delicious! My wife and I have been here three times now and have been totally satisfied each time. I always order the house chicken (sweet, mildly spicy, high quality chicken). Word to the wise, one entree is enough for two people!! Also, try the grilled potstickers...you'll be happy you did!"}
{"text":"Excellent food by a great staff. They were prompt, kind and welcoming! I will definitely go back as I have not found a Chinese restaurant in the area that comes close to this standard."}
{"text":"Not too impressed. I gave it a second chance on Saturday but was disappointed again. Flavorless, even the spicy dishes. The place has zero atmosphere and personality. Bright lights are annoying and it is understaffed. Cannot recommend it."}
{"text":"I loved this place! Friends of ours took us here and the first thing I noticed was that it was clean, which is always a bonus. The women was very nice and the food was great. It tasted very fresh! Would make the extra 15 minute drive to pick this up!"}
{"text":"Finding good Chinese food on a Friday night can be a gamble, as pizza is often my sacred standard. But, on this grand pursuit of phenomenal Midwest Asian food, I made a stop at the House of Mei in Sun Prairie for some hot & sour soup, vegetable fried rice, vegetable lo mein, double pan fired noodles with chicken, beef with broccoli, mushroom chicken and house chicken (I know this is a monstrous amount of food. Don't judge...I had friends coming over).   FOOD TASTE/QUALITY: I did not like the soup at all (cold, bland and way too thick). Both the fried rice and lo mein were very tasty, with fresh vegetables and just enough seasoning/salt. I'm always interested in the kinds of noodles Chinese restaurants choose; House of Mei chose more a linguine-style (not my fave; but it works). We all liked the double fried noodles, too. Slightly different than the lo mein in that the noodles were...well, double fried with a nice crispy edge. Beef was good, and mushroom chicken was fine.   I ordered the House Chicken (think General Tso's Chicken) because I'm always interested in what flavors/twist they thought was so delicious, they would call it their \"house\" chicken. The breaded/fried white meat chicken pieces came with broccoli in a brown sauce. Not bad, but certainly not worthy of being called special. Would have liked more spice and a little twist to make it worthy.  PRESENTATION: Other than the soup and small white rice portions (which came in small white boxes), everything came in plastic containers that were typical for take-out. I ordered the sauce on the side, as there is nothing worse than getting soggy take-out food; this worked very nicely, and all of it was number coordinated (i.e, sauce # 42 went with dish # 42). Everything was nicely packed into a box, which was much easier to carry out.  PORTION: These were typical-size portions in comparison to the price (see below). Each dish was enough for 1-2 people.   PRICES: Moderate. $2.50 for the hot & sour soup. Vegetable fried rice and vegetable lo mein were each $7.95. Double pan fired noodles with chicken, mushroom chicken and house chicken were each $8.95. And, finally, the beef with broccoli was $9.95. Three bucks for tax and the evening meal cost a little over $58. In my opinion, this is about $2 to $3 too expensive for each main dish, given the portion sizes. Also, not one coupon online or in print; for a smaller-town Chinese restaurant with other competition, that's not good.  DINING EXPERIENCE: I would have loved to have this delivered, but no dice! I ordered online (which was great and an easy experience). After about 45 min to 1 hour, it was ready for pick-up.   FINAL NOTES/IMPRESSIONS (3 to 3.5 stars): House of Mei is a mom-and-pop restaurant. I really wanted them to be extraordinary with stand-out tastes and fresh ingredients. That got some of those points, but not many. This was average Chinese food, in my opinion. If they took some time to refine it a bit, they could be very good.  For example, they need to find a signature dish and really rock it, lower their prices slightly to be more competitive, get online coupons, and -- for the love of Pete -- get a delivery kid! In the meantime, it was unfortunately not much better than a typical Chinese buffet."}
{"text":"The hard part about moving to a new city is finding restaurants to satisfy any cravings.  We got take out from House of Mei because of proximity and Yelp reviews, and we were not disappointed!  The food was fresh and not greasy like many Chinese restaurants.  We got the steamed dumplings, shrimp fried rice, mu shu pork, sizzling beef pepper steak and chicken with almond sauce.  The shrimp in the fried rice was a good size not the frozen little baby shrimp like other places.  The entrees were not too saucy, they were just right.  There were so many other entrees we wanted to try, can't wait to go back!"}
{"text":"My favorite Chinese take-out food place! The egg rolls are the best ever. I have never been disappointed with my food and we have been going there for years. I recommend it greatly!!"}
{"text":"Ordered the szechuan beef and chicken egg roll at lunch and it was bland and they gave me a vegetable  egg roll! There is a reason this place is empty at lunch time - overpriced, long wait for my dish, and below average bland food!"}
{"text":"If House of Mei  is wrong, i don't want to be right.   Govenor's Chicken Chicken Lo Mein Grilled Potstickers Spicy veggie Fried Rice Eggrolls Shrimp Rangoon All Delish!"}
{"text":"Great food, poor service. Just picked up an order for lettuce wraps and three eggs rolls.. Was over charged and the cashier didn't understand English well enough to comprehend what we were trying to explain... Ended up just giving up and paying. Next time we'll order online to avoid the miscommunication and pay the correct prices."}
{"text":"Be cautious of your take-out order. Clearly they give the scraps to customers on the go. Asian lettuce wraps- barely half a portion with sad bits and pieces of lettuce amid two two solid leaves of lettuce. Was tasteless and soggy. Let's talk about the Teriyaki Chicken. Rock hard outside and bone dry like jerky inside. I'm not even going to guess what the strange yellow goo was inside. Crab Rangoon was nicely stuffed with a spit of cream cheese. Such a disappointment. If this is how they show they care about customers, they don't deserve customers"}
{"text":"Wow authentic Chinese food in sun prairie!  We didnt think it would be good but this place blew us away!  I highly recommend!"}
{"text":"My husband and I have been fans of getting appetizers, the grilled pot stickers and the shrimp lettuce wraps are enough to keep us satisfied.  Very tasty shrimp and vegetable bits in iceberg lettuce is so fresh and tasty.  The pot stickers didn't have too much dough and the sausage style mix is so tasty.  For an extra treat we occasionally have crab rangoon and it's yummy.  House of Mei is one of the tastiest restaurants."}
{"text":"House Of Meii is constantly above average in their food and service. Very friendly and welcoming staff . A very diverse menu and excellent prices for quality & fresh ingredients.  They welcome substitution requests, and want to make sure you are satisfied with your dining experience.  Great place for sit down or take out.  Either way you will be pleasantly surprised."}
{"text":"Pretty good!  Stopped for lunch, had Governor's Chicken.  Nice amount of spice and flavor.  Seems like more of a take out place with a few tables.  Nice enough place though.  Friendly people."}
{"text":"Our go-to place for Chinese in the area! The food always is hot and tastes fresh, and the portions are quite generous. I have always really enjoyed the Sesame Chicken which comes with rice. I love that they include sauce in a separate container, so you can choose how much sauce you want to put on. I really like the flavor of the sauce, so I'm a fan of the large container they include. The best place for Chinese that we've found in the area! Just wish their parking lot was a bit bigger, as I believe there are only a couple spots in the tiny lot in front of the building, and I always have a difficult time parking and maneuvering my SUV due to the very limited space."}
{"text":"We used to be regulars here. It had been a while since we visited, so we stopped in for dinner tonight. I got a bad feeling when I saw the big plastic \"Buffet\" sign hanging from the roof.   The big surprise came when we stepped inside, though. They completely remodeled, replacing all the tables and chairs with booths. It felt very different and impersonal. None of the staff we were used to seeing were working either.   We ordered 4 different dishes and crab rangoon, and everything was different and much less appetizing and flavorful. For that reason, this will be our last family visit to House of Mei.   We didn't eat from the buffet, but we checked it out before ordering, and everything looked like it had been sitting out for a couple hours. Nothing looked fresh."}
{"text":"I was excited to try this play because of the raving reviews, but I found it to be rather average. It wasn't the best I've ever had nor was it gross. It was just \"typical.\" The staff were incredibly helpful and friendly, though!"}
{"text":"5 stars for freshness! I can't tell you guys how fresh the ingredients were because they tasted like they were picked right out of the garden. I am so fortunate that I have a local Chinese place to patronize that uses really fresh ingredients not the run of the mill frozen vegetable blend and canned sauces. I am not a big Chinese take out customer because it all looks like garbage thrown into a box. House of Mei pays attention to detail and freshness, considering I had an eggplant dish that had smokey and vibrant cilatro and citrusy spices going on in it. I'll update this review soon once I can get the pictures uploaded off my Iphone. Another home run for Sun Praire. I sure hope the residents of Sun Prairie appreciate the uniquness of this restaurant because it does not hold a candle to any of the other dirty, gross, over rated Chinese restaurants we have"}
{"text":"Very clean, nice looking decor. Polite and fast Waitress. Okay food.   Beware of the sample platter. The pork on ours tasted nasty."}
{"text":"B and I were on the way up the her parents for Christmas and needed to find some place for lunch.  Add to this, she wasn't feeling so hot.  The egg drop soup really fit the bill that day.  The other dishes (I think general's pork, but can't be sure) were good too.  The portions were huge and the prices were very reasonable.  Also the ladies that run it were very friendly.  Definitely a good stop on our trip."}
{"text":"Yum. Moo Shoo Chicken and House Pork. Both were great. Just what I would have expected after hearing so many great things about House of Mei.   I had read before heading there that it was never busy over the lunch hour, which made it a great place for a business lunch. The service was very friendly. I enjoyed that interaction as much as the food. True to the review we were only one of two parties in there.   I will definitely be back and look forward to trying more items off the menu. The prices were fantastic for the portions. Especially off of the lunch menu."}
{"text":"It's been four years now that I've been eating at House of Mei in Sun Prairie. The quality has been consistently good, due to Chef Susan, her husband, and her sister harmonizing the flavors in their menu. The food I gravitate tends to be on the saltier and greasy side (Mah Poh tofu always adds pounds to me the day after), but it's good and hearty, and not the greasy Americanized Chinese food that you'll encounter at places such as Panda Express.  I love the shrimp with lobster sauce, the mah poh tofu, the garlic eggplant, mooshoo pork/chicken, and their egg drop soups.  Their crab rangoon (rolling my eyes for its lack of authenticity the whole world over) is rather good and piping hot.  The prices are oddly deflated, it must be a factor of the Sun Prairie prices being competitive.   I've catered from here, gotten take out, and eaten in with my family.  I'm a huge fan, and hope they continue to thrive here."}
{"text":"Horrible service. No one cares about customer service. Placed an order at 8:58. Called at 9:50 to check on the delivery status. Was placed on hold multiple times and told the food was on the way. At 10:36, called and was told the food wasn't coming and I had to call my card company to get my money back.  I would prefer a 0 star review."}
{"text":"I ordered takeout online. I love the convenience of being able to do that. When I got there the woman behind the counter was very friendly. My food was up just a minute later. The food was still piping hot when I got home a few minutes later. It was also packaged very neatly, no leaky sauces coating the inside of the bag.  We got pork fried rice, shrimp rangoon, seafood hot & sour soup, and sesame chicken. The portions were huge. I think we'll have enough left over for lunch and dinner again tomorrow. The fried rice was very savory and would be wonderful on a cold snowy day when you want something to warm you from the inside out.  The soup was delish and my favorite part of the meal. The different textures made it delightful and it was so warm and flavorful!  The sesame chicken came with the sauce on the side which kind of threw me at first, reminded me of sweet & sour chicken. The sauce was good though and the chicken seemed to be a higher quality than the breaded chicken you sometimes get at a Chinese place. I usually order a meat/veggie main dish as opposed to a breaded chicken dish so I'm anxious to try other things there.  I hadn't had shrimp rangoon before, it was good.  I think I may have a new Chinese favorite spot in Sun Prairie."}
{"text":"Something changed. I used to go a few times a month but I haven't been in House of Mei since winter. When I walked in everything was different. The inside was remodeled to a buffet, different staff and a different menu. It looks like it changed ownership.   I used to get take out here frequently because they had a small handful of traditional Chinese dishes, and not just the Americanized stuff you can get anywhere else. They used to do a crispy duck and a peaking duck that was amazing. Now it's nothing but Americanized food.   I got a handful of Americanized classics that go well in my house, and they're all off. The wonton soup base is different, it's much more water than anything, very plain. The hot and sour soup no longer has pork The chicken wings are more oil than wing. The moo shu barely had any sauce, its like it didn't touch a wak, everything is steamed and plain. No pancakes we're included with the moo shu.  The fried rice wasn't fried. It was plain rice mixed with soy sauce and scrambled eggs.   I don't know it this is a change of business plan, ownership or both. But it's not a direction for me. I'll stick to downtown Madison for the real stuff, which is too bad since HoM is just down the street from my house."}
{"text":"Sad news. I broke up with the House of Mei, the love affair is over. The quality of their food has been going down hill for a long time now, and I caught myself looking around for something better. Then they redid the dining room and added a buffet. Not that I'm above slummin' at a buffet table, but this one was pretty sad.   The last time I was there I slowly walked out the door and looked back a few times longingly as I clutched a white handkerchief. *Cue the violin* Goodbye HoM, it's over."}
{"text":"Sorry House of meh, but serving chicken trash as General Tso's  is unacceptable.  those hard super chewy tough chicken bits in a bland sweet sauce was an insult (takeout)."}
{"text":"3.5 stars to be precise.  An above average Chinese restaurant that delivered well on flavor, portion and options. Would definitely reorder when craving something quick and simple."}
{"text":"My favorite Chinese take-out food place! The egg rolls are the best ever. I have never been disappointed with my food and we have been going there for years. I recommend it greatly!!"}
{"text":"I ate here for the first time on Saturday and I must say it was very good,. the place was very clean, the service was great.  Nice sized portions you get a lot.                               I will definitely be back again. Loved it!!!"}
{"text":"If you're looking for fresh, tasty Chinese in the East Madison and Sun Prairie area, this place is a great choice. Though the ambiance is more hole in the wall then restaurant,  it more than makes up for it in its extensive menu and large portions.  My group and I started out with pot stickers (some of the best I've had) and spring rolls. From there we moved on to Chow Fun, Lo Mein, Mongolian Beef, and Mu Shu Chicken. All of the dishes were very good, and not overly seasoned. The Mongolian Beef in particular was very rare, but absorbed the sauce and was not overcooked.  Service was good (we were the only group in the restaurant) and I would definitely recommend it as a solid Chinese food choice."}
{"text":"Very intimate place, very clean. This was part of our Sun Prairie experience we really enjoyed. It made driving 300 miles for our dog's surgery much more enjoyable. For appetizer we had the egg rolls, BEST egg rolls we have ever had! Seriously! Crispy outside with meat inside not just cabbage or some unidentifiable shit. It was a very hot day so we had fruit smoothies which were awesome. You can choose from a wide variety of fruit and there is no bad choice.  My wife had mu shu chicken which she loved, I had sesame chicken which was ok but I have had better. If it had some broccoli or other veggie it would have been better. The owner came out and talked to us and could not have been nicer. Sun Prairie seemed like a super nice town. Not sure if we will ever be back, but if so House of Mei will be one of our stops."}
{"text":"I promise y'all I read all the reviews and took their lead on what to order and what to expect.   I don't get the 5star rating but I will return for lunch and add a soup to whatever I have. Then update my review.   I will say the dumplings are 4.5star worthy. The kid & I had the $6.80 sampler (1 egg roll, ample # of dumplings, frozen shrimp & calamari rings, and sliced pork) + Governor's Pork for me + Pepper Beef for her + 2 sodas and I don't usually have soda but it was free. And I don't care for the Pepsi line up (we prefer Coke).   The egg roll is more meaty than any other place. Fried perfectly. I will never complain about too much meat but it was meaty. lol. I know, right.   Food was just ok. Everything was simple (decor) & fresh (food wasn't stale). But honestly, I've never had bad Chinese. At any rate, I love the \"Extras\" as in the SIZZLING PLATES...reminds me of good TEX-MEX.  It was a 10m ride one way for us and we'll go back.   Sidebar: I wish they would clean the windows (inside & out)  & the cobwebs but next time we won't sit by the windows. Sorry, I forgot to take pictures of our meals, but our total bill at dinner........ $22.47.   My word those were good dumplings. I had steamed but will go for pan fried next time just to mix it up. Brought home leftovers - so you get good value."}
{"text":"Been here half a dozen haven't had a bad dish solid appetizers good service must be a small staff I've always had the same waitress I've only gone for lunch never been disappointed with my meal good food at reasonable prices"}
{"text":"Great food, and service! Very casual Food was awesome and with large portions great for trying out food with a group."}
{"text":"Great Chinese! I stopped in for carry out and ordered the chicken lo mein, sweet and sour chicken, Singapore beef, hot and sour soup, and spring rolls.  All the entrees were delish and piping hot by the time I made the 10 min drive home. The ingredients were fragrant and fresh, and not greasy like other Chinese restaurants I've been to.  The only negative feedback I have at all would be for the spring rolls to be smaller (the were bigger than the average egg roll) and for the hot and sour soup to have more of that sour twist at the end.  Other than that I would highly recommend this place and will definitely be back!"}
{"text":"Very tasty food. Been here several times. Quick service. I have been here several times."}
{"text":"We recently moved to Sun Prairie and wanted to try out a new Chinese place. We are always hesitant in trying out new Chinese places, but have been pleasantly surprised by the House of Mei.  The shrimp Rangoon is really good.  I have enjoyed the chicken and broccoli and the shrimp lo mein.  The grilled potstickers are good.y husband for the beef and seafood, which was fantastic!  I would appreciate it if you could get fried rice with your entree, but they will not do that even for an upcharge.  We have only picked up so far, but the inside is surprisingly nice for how small it looks on the outside! Plenty of dining space.  The staff is really nice on the phone and in person when picking up.  The prices are also very reasonable."}
{"text":"I ate here with a group for lunch on a Thursday. We arrived around 12:30pm and were one of only three groups in the restaurant. Our orders were taken quickly and we had great service on drinks and soup.  It took quite a while to get our food. Several groups came in quickly after us and they were definitely busy. It seemed like there were only two people working in the whole place.  Once the food finally arrived, it was great! Everyone was more than pleased with their dishes. Also, the smoothies were great! They have many flavors and all of the ones we ordered were winners.  I will definitely eat here again!"}
{"text":"I enjoy eating here and whenever we need a place for Chinese and want to leave the confines of our home we head on over. We have also placed our order while shopping in Sun Prairie to take home for supper. We have never been disappointed in the quality of food. What has been slightly disappointing the last two visits is the service when dining in.  Our food is ordered and brought to our table in a very timely fashion but then when we are finished we have to ask for to go boxes and the bill because they haven't checked back with us. One night this was with, what I presume to be, a new employee and she was overwhelmed. Last night, 6/24/14, there really was no excuse as we were basically the only patrons in the place.   This being said, it won't deter us from coming back. The food is always excellent!"}
{"text":"My only regret is that we probably won't be in Sun Prairie, WI again so we can't go here again.  This is a great little place & we enjoyed our lunch and time here very much.  Note that there is a set lunch period of 11-2:30pm then they close for a bit before reopening for dinner.  Loved the food, the service, and the simple, peaceful beauty of the place.  Only thing is I would have preferred quiet music instead of the flat screen TV that played weather and other newsy stuff.  Somehow the TV didn't destroy the peacefulness of the place, though, but quiet music could have been better & less distracting.  It's possible that other times they do have music, because we noticed the wall-mounted Bose speakers.  Egg rolls were a complimentary part of our lunch menu selections.  We had chicken egg rolls and they were crispy and delicious.  I had mu shu chicken (sp?) and it was really excellent- very flavorful sauce & nice variety of flavors & textures for the filling.  We also had fruit smoothies.  They had a huge selection of smoothie flavors.  I had the banana blueberry and it was a little too sweet for me, but still good.     If we lived in the area we would definitely become regulars.  We had two lunch menu dishes plus two fruit smoothies and our bill before tip was under $21, so great price for the experience.  Thanks to all the local yelpers who reviewed this place so we could learn about it!!!!"}
{"text":"Food was pretty good.  Wait time was horrible today...I've never seen the place so busy and un- organized...i felt bad for the women at the counter as she was very very busy but also very confused.  I only had the wonton soup, very good and flavorful...but they need better staff."}
{"text":"I walked in on a Sunday, I think.  It was dead. It was so dead, I thought about leaving. There was only one other table occupied by a family of four--a mom, a dad, and two kids around nine or ten.  They had already ordered by the looks of it, so I decided to take a chance.  I sat myself in the corner booth that had a good view of the Brewer game and perused the menu.  It looked pretty standard fare and-- holy crap!  The family that is there?  I went to high school with that couple. Well, they weren't a couple when we were in high school.  She was sort of a nerdy girl, but sweet, and he was a total douchebag.  They actually got married?  What the hell! I almost asked her to prom!  I ordered sweet and sour chicken--a pretty standard go-to for me.  If I go someplace new, that's my baseline. If they screw that up, I know they can't do anything right.  I honestly can't believe those two got married, though.  They didn't really date in high school. Maybe they went to the same college and things happened then.  Those kids are the same age as my kid, so that makes sense.  If they got married after college, had a year or two of domestic bliss, and then fired up the babymaker, I get that.  I see how it could happen. That's how it went with me.  The waitress brought the sweet-and-sour chicken, and it was solid.  I'm not going to say that it was the best Chinese I've ever had.  In fact, I'm not certain it was any different than any other Chinese I've had in the greater Madison area.  The rice was just rice.  The chicken wasn't high quality, but it tasted pretty good.  Look--I'll level with you:  I was pretty sure those two would recognize me, but she looked directly through me without recognition.  Granted, I'm taller and heavier than I was in high school, and wearing a hat and a goatee (she's never seen me with facial hair), but damn--I went to her birthday party when I was a sophomore.  It was the only party I was ever invited to, really.  Her parents were pretty persnickety born-again types.  It wasn't really a good time, but still--I was grateful for the invite.  I'm not the best expert on Chinese food, but I liked what I ate. I think, if I'm in the mood for a chicken-based Asian dish, I'd rather go to Sarku Japan for chicken teriyaki, but I can't hate on anything they do at House of Mei.  They don't have the greatest parking lot, but the interior is nice for an older restaurant.  I'd go back in a heartbeat. I just hope I don't run into old classmates that I'd rather not run into while I'm there.  I don't have anything against either of them, I just don't have a thing to say to them. And I'm bad at small talk. I can't act interested in things I'm not interested in, and I know her type--she would have wanted me to meet her kids and she would have acted like they were the greatest humans to ever walk the Earth, and I just know that wouldn't be true. I don't really like kids. I like my kid only because she's mine, and she's funny.  Most kids, to me, are sort of wastes of space. I think I don't like to try to get to know them because of my social anxiety disorders.  Who knows, really?  I'm just glad I was able to get out of there without any sort of glad-handing and fake conversation about how amazing it was to run into each other twenty years after high school.  I didn't attend the class reunion for a reason.    House of Mei--I'd go back.  You're not too bad."}
{"text":"Excellent food! Clean and friendly atmosphere. They have an excellent website that allows customers to order on line and your order is ready when you arrive. We have only had carry out, have not dined in but it looks like a very comfortable place to dine in as well. Excellent all around!"}
