{"text":"This is our favorite place for pho (both Vietnam and Cambodia style). Their broth is so tasty, especially for the Cambodia noodles. They explained to us that the broth is slow cooked with cattle fish. I wouldn't drink the soup when I have pho somewhere else because of the MSG. But I love the broth here and it doesn't make me thirsty like those in other places. The texture of both the Vietnam pho and Cambodia style rice noodles is just right. 

Frankly speaking, other dishes are average. And the drinks are just so so. But we always go back because of the pho and their cleanliness, which is not too common among Pho restaurants. 

Forgot to mention their service is exceptional too :)"}
{"text":"Good place to eat in vaughan mill. My boyfriend love the beef stew and hu tieu every time for me. Highly recommend if u are going for those 2 dishes"}
{"text":"Place is always clean, people are always friendly and food are always GREAT! 

The Nam Vang and beef nam vang are a must try. The satay beef noodle also nice. 

Their apps are also satisfying. I have tried their veggie wrap.(a cold dish) and fried wings, love them.

Been there a few times since it opened, everytime we left with a happy tummy and a happy face."}
{"text":"everything was very fresh, and very very fast.  i ordered custom instead of from  the menu and was perfect.  we both had versions of vermicelli and shrimp spring rolls  will go again."}
{"text":"They always have great foods and fast customer services. A must to dine in if you are around Vaughan mills area"}
{"text":"Excellent nodle.  You can't find anywhere in Toronto. Very similar to HokKien Mie from Indonesia Medan.
Good customer service,  and great price."}
{"text":"Clean place with good service. But most importantly,  great food; best Vietnamese food I had in GTA."}
{"text":"This is the newly open restaurant taking over the place of BUN PHO PHU HAI.  There is some renovation done.  The bottles on the tables are brand new.  It is clean and fresh looking.  There are 2 TVs installed on the wall so no matter which side you sit, you can always watch TV at your spare time.  I notice the auto sensor light switch in the washroom is fixed.  

When I go to a Vietnamese restaurant, I always first order its Pho noodle.  If it is good, I can then try other dishes.  The Pho noodle is very smooth, a good quality one.  For the 101, it has many meat balls, usually it is very limited.  The beef is medium rare and tender.  The beef tendon is soft.  The soup is clear but tasty.  I guess not much MSG is used as I don't feel thirsty after eating the Pho.  The fresh vegetable vermicelli roll is good but cannot be compared to its former owner which has the best roll in town.

Overall the service and food are good and polite.  The place is kept clean."}
{"text":"Went to this place before and after new management take over. I normally order the same thing. Order of vermicelli for myself and a bowl of pho with rare beef and flank for the girlfriend. I notice the broth is a lot more richer and service there is great. I personally like it more better than pho 99 which is also in the same plaza. This location is more intimate an the food is reasonably priced and yummy. For a fix of Vietnamese food in Vaughan it's worth taking a look into and trying out this place."}
{"text":"The food is excellent and fresh and hot. I like the option of hot or cold tea in the summer. It was an accidental find and we've been back several times since then."}
{"text":"I ordered the vermicelli with grilled chicken and sausage. $10.25. It wasn't bad but it also wasn't anything amazing. 

There are a whole bunch of other pho places in the area that serve the same dish for similar pricing and slightly better taste. 

We also ordered a large beef brisket pho. The soup was super oily and the beef was a little tough to chew. 

The service was decent and it wasn't too busy when we went so there wasn't any wait. 

Not sure if I would come back since there are soo many other options in the area."}
{"text":"My parents and I had dinner here recently.  I love Hu Tieu Nam Vang (aka Phnom Penh Noodle Soup), although truth be told, I don't like organ meats, so I secretly like it when the dish is slightly Westernized to omit the innards, which means more of the other toppings ;)  Unfortunately, (or fortunately, depending on your point of view), this place serves up this dish with organs.  

I ordered H01 which is the original Hu Tieu Nam Vang (I got a medium, which was $8.49).  My mom ordered the H02, which is the dry version of my dish (so it's the same thing except they serve the broth on the side, and they add soy sauce to the noodles).  She also got the medium and it was the same price as mine (many places charge you more for the \"dry version,\" but not here).  My dad wanted the same thing as my mom but in a large, but I accidentally wrote on the order form H03 for his order instead of H02 (Oops!).  So when it came out, I said \"we didn't order that\" and the server brought out the order form to show me, and sure enough, there it was in my own handwriting, I did order that (!)  D'oh!  My dad said it was ok and he would eat it anyway.  Well, guess what?  His erroneously ordered dish turned out to be the best of the lot!  So H03 was the Seafood version of the Hu Tieu Nam Vang.  The large was $10.25.  I wish I had ordered that for myself!

So firstly, I was kind of disappointed that the noodles were just regular rice noodles and there was no option of tapioca noodles.  However, I was willing to over look that.  My soup had liver and some other organ that I couldn't make out (both of which went straight into my dad's soup; I didn't even try them), pork sausage, pork slices, about a teaspoon of ground pork, and a lone shrimp, and also some fried scallions and lots of green onions.  I was disappointed that there were no real vegetables in my soup.  I also did not like the pork sausage.  It had a spongy jello like texture.  It was the worst pork sausage I have ever tasted.  I gave it to my dad (who pretty much eats anything) and even he felt that it was not good.  The pork slices were lean, which I appreciated because I don't like fatty meats.  My lone shrimp was good too.  The pork broth was fragrant and tasty and wasn't overly oily.  The noodles were nicely done, not too mushy.  

Since I gave my dad pretty much half of my toppings, he gave me the fish cakes that were in his soup.  They were pretty good, not too doughy.  My dad's soup had actual vegetables in it (carrots, broccoli and nappa cabbage).  It also had mushrooms in it.  His soup had 2 shrimps, some squid and fish cake slices.  I totally would have enjoyed this soup more than mine!  My dad was happy with the soup he ended up with.

My mom also felt that the pork sausage was terrible.  She said the liver was fine, but all the other organ meats tasted off.  She wasn't thrilled about her meal either.

So I find it disappointing that a restaurant's namesake dish was such a letdown.  

Service was nice and friendly though.

This restaurant is in that complex of restaurants across from Vaughan Mills Mall.  Lots of free parking, although the parking lot can be a bit of a zoo."}
{"text":"I came here for lunch on a Sunday with my mom and sister. The restaurant wasn't packed but it was still pretty busy. A well known Vietnamese man and his family were also dining here at the same time as us lol. 

My sister and I ordered the dry version of Hu Tieu Nam Vang while our mom ordered the soup version.   The dry version comes with soup on the side. The cool thing about the dry version here is the side soup comes with a pork bone. More meat yayyy but if you come later in the day, they will most likely run out. 

This is my first time having the dry version and it's pretty good. The rice noodles are seasoned with a soy sauce blend and there is a decent amount of meat and organs. It's a good option if you aren't in the mood for pho, rice or vermicelli. 

What is don't like about this place is the utensils have this weird waxy/greasy film over them. I thought they weren't cleaned properly but my sister said that's normal, so okay. 
Also I've eaten pho here years ago and it was salty and not great so I avoided this place for a long time lol. 

The Hu Tieu Nam Vang here is good though and I'll most likely come back when I'm craving it."}
{"text":"Hu Tieu Nam Vang, whatever that may mean I wasn't sure because I do not speak French.  It turns out to be Vietnamese, which meant I do not speak Vietnamese either. On the menu there's an item named after those words. Sold!

Pork liver, kidneys, patty, pork slices, ground pork, all hidden in the sweet clear broth. Chives, scallions and a shrimp or two top the bowl.  A Pork version of beefy Pho, that may just help me cut down the red meat intake from all the Pho restaurants I'm surrounded by.

Many meals after, I still continue to visit Hu Tieu Nam Vang for Hu Tieu Nam Vang and only ever had Hu Tieu Nam Vang.  The dish has been consistent and so has the family/staff that serves here.  The rice noodles in the wet still continues to stick together until a gentle nudge begins it's separation.

I've since tried the dry version and it's a completely different way of eating even when the ingredients are mostly the same.  Between wet and dry, my meals here through-out the years have kept me coming back when I need a bit of the other WHITE meat in my life."}
{"text":"Perhaps it's the nostalgia, or perhaps it's really the best Cambodian noodle joint around -- though there are not many to compare to, my parents keep on coming back.

Canadian born and raised, my appreciation of Cambodian dishes may not match my parents, whom had both grown up in Cambodia. I have only ever ordered noodle soup with beef. Not to be mistaken with the more known Vietnamese soup noodles, phó, Cambodian soup noodles contain a sweeter soup. I personally enjoyed the rare beef and rice noodles.

If you're in the area and want to try a new cuisine, or need something warm on a cold day, give this authentic restaurant a try."}
{"text":"My date is a true viet girl so she knows a good hu tiue. She said this one is the best one she has tried so far. She gives it a 4.5 stars. I came here mainly for her as the other dishes were not as good as other viet restos. It has a mix between cambodian and chinese influences mixed with viet. 

My grilled beef with rice was decent. Not great. I bet the pho and bun were better picks. Next time. Read this as 3.5-4 stars for grilled beef and 4-4.5 stars for the hu tieu here. Come for the hu tieu!"}
{"text":"When ever I happen to be in Vaughan mills I always some how end up eating here.

This place has a decent menu selection, food comes out hot and fast and pretty tasty. It's owned by Vietnamese people, and it's actually pretty decent. Their milk shakes are also very good, always made with a bit of fresh ingredients unlike other places where they use powder (for example the avocodo milk shake).

It's a pretty solid meal for the price your paying and being in Vaughan mills. It's unpretentious no fancy, and is solidly decent. And sometimes, that's all thats needed"}
{"text":"Love coming here for the dry style of Hu Tieu. After all, it is named after the store! If you like saucy dry noodles, you have to try the Hu Tieu with Mi and Hu Tieu (if you like 2 types of noodles, rice noodles & egg noodles)"}
{"text":"I came to this restaurant a few time in the past and found the pho and buns pretty decent.  Coming here again after my last time which was a few years ago has been a bit disappointing.

Ordered cold viet coffee with condensed milk.  It should have been refreshing especially on a hot summer's day but taste was a bit off (pre dripped and stored in take out cups in fridge) so I asked for a bit extra condensed milk.  Before they even asked why, they said sternly \"we are NOT tim hortons or starbucks\" which I was shocked about.  They did eventually take drink and brought it behind to prep area, stirred and threw the spoon into the sink than brought back the cup.

Had also ordered grilled pork and chicken bun which was about half size of a medium bowl.  The vinegary sauce in the rice noodles was same memorable tangy flavour but the noodles was glued into a clump making it hard to separate.  The meat was a small handful of small chunks but was grilled nicely for chicken but pork was dry.  For $9.05, i expected an actual medium size serving with a bit more meat (ie more than 10 pieces)

Would I go back? Probably not now that I know there is another 7 or so viet restaurants in the same area where there may not be attitude problems"}
{"text":"The noodle is good. The staffs there are veey friendly as well. I always come here to eat whenever I got a chance."}
{"text":"I did not order the dry noodles this place is better known for and went for the pho instead given my craving on that very cold day.

I like Pho and theirs was very nice. It was tasty without being too fatty. It was not the most flavourful I had had though. The vegetables were fresh. There was adequate beef balls in it. The sizes available are medium and large and the $10 medium is more than adequate. Who can finish a large bowl?

Water and tea were quickly offered and delivered, which was indicative of the service overall. The waiter and waitress were quick, polite and smiling. You can expect a welcome and 'thank-you' here. There were quite a few Vietnamese persons here, which is always a good sign.
They have the standard-issue TV set tuned to CP 24 and oriental ornaments for good luck. Most importantly, the premises seemed clean."}
{"text":"The mi bo kho was so delicious. The soup was nice and spicy and I tasted a hint of lemon grass which was the perfect amount... I hate when some restaurants  over do it with lemon grass.  The beefs was tender and cooked perfectly. I ordered the large and shared it with my mom and there was still leftovers to take home, so they serve big portions. The rice noodles was the thin angle hair style which is kinda like vermicelli which I also enjoyed with the soup. 
I would say the soups don't have much MSG in it compared to other Asian restaurant soups because I was not left feeling like I needed to drink a gallon of water after. 
I think this place has reasonable prices for the quantity and quality of the food served.
I enjoyed the food and I will return again when I'm craving some good Vietnamese and Cambodian food."}
{"text":"We found out about this place through friends who raved about their broth. My wife and I gave this place a try when we finished doing some errands at Vaughan Mills. We are so glad to dine at this place!

I ordered the Rare Beef Pho (P02) and my wife ordered their famous Nam Vang Style Rice Noodle Soup (H01).  We also went for Chinese Donut Stick and Chiu Chow Style Deep Fried Shrimp Rolls (K01). 

First came the deep fried shrimp rolls. It was super hot, crispy on the outside, sweet and delicious flavour on the inside. So noticeable that this dish came right out of the fryer.  Absolutely delicious!!!  The Chinese donut stick they called it was just so so. Nothing to rave about it. 

Rare Beef Pho came. The broth is super hot and rare beef was actually rare beef. I see non-Asians putting bean sprouts and the squeeze of lime into their broth without first tasting the broth. Hooligans!  First taste the broth, if you like it then put whatever garnish you want into your bowl and if you somehow don't like it, tell the servers and they'll happily take it back and bring you another one. 

My wife Nam Vang style has the best broth flavour. There was a hint of sweetness. Really delicious. My palette was going crazy!  Found out from the owner that this style of soup is from Cambodia. Glad I didn't have to make the trip to Cambodia!

We are still talking about this place after a week. We would definitely come back to this place. 

Pro tip:  Go there early. This place is packed on weekends. They don't take reservations. If you happen to wait, it might take 5-15 mins but it is worth it!!!"}
{"text":"Like. Restaurant is clean with quick friendly service.

Had the dry Hu Tieu Nam Vang.  Liked the combo of flavors.

Ordered the spicy salt soft-shell crab appetizer as well.  AVOID!  Way too oily, and not enough flavour. Was so oily that it came out soggy, and ended up with quite a fishy taste. Seriously, this was gross.

Apart from the soft-shell crab horror, I'd say all the noodle dishes that people were ordering around me looked great.  Will probably come again when I'm shopping at Vaughn Mills."}
{"text":"The food is not good here compared to other Vietnamese restaurant. I ordered the house special the dry Hu Tieu Nam Vang (Nam Vang style vermicelly). The dry version has the noodle and soup served separately. The black sauce on noodle is super oily, although I did like the soup because of the big pork bone served in the soup. My friend ordered Bun Bo Hue (spicy Hue style vermicelly) and he did not like it too. 

This restaurant is quite small and got crowed during lunch time. It is not very well-cleaned but it is not the worst that I had been to. I would not really recommend this place if you want to try Vietnamese food, there are many other better places."}
{"text":"Hu Tieu Nam Vang Hong Phat is supposed to be specialized in Hu Tieu Nam Vang which is Cambodian Style noodle. So Instead of my usual pho, I decided to try out their dried version of Cambodian noodle.

H02 - Hu Tieu Nam Vang ($6.95)
- A heap of noodle topped with pork everything: intestines, belly, patties, grounded meat, livers, kidneys. 
- Love the slightly sweet sauce and different garnishes on top
-The dry version does serves with a bowl of pork bone broth with chives on the side 
- For taste just use fish sauces, hot sauces and whatever you prefer as it can be quite personal

HTNVHP has a nice family owned restaurant. It is clean and people are friendly. Food are decent and reasonably priced. I will definitely be back for their noodle again!"}
{"text":"very close to the vaughn mills shopping mall. Not too many opitions for lunch or dinner. But the pho tasted Good and grilled pork was.very juicy and yummy"}
{"text":"I love this place. The staff is super friendly, not too noisy and is always clean. The food is great for the price. And the portions are pretty decent. There's always enough seating when I get there, and I've never waited before. However I wouldn't mind waiting if I had to. 

And the best part? Pho to-go! SOLD."}
{"text":"Since my family and I were sort of in the area we decided to check out this newly opened restaurant after seeing it in the paper. We got there around 12:30 and it was quite busy but we were seated pretty quickly.

The ad in the paper boasted about their special hu tieu nam vang so we all decided to order a bowl. I also decided to try out their lychee bubble tea since they had a neon sign saying bubble tea outside...so it must be good, right?

The bubble tea came out first and I was VERY disappointed. This was the worst bubble tea I had in my entire life. It didn't taste like lychee and there were many ice chunks that didn't get broken down in the blender. We complained about it but all they said was it's supposed to be like and I argued back and all they said was sorry. It was so bad that I only took a few sips...a total waste of $3.15. Next came our hu tieu nam vang that was served with the broth on the side. The hu tieu was very slimy and were stuck to each other. It consisted mostly of huge badly sliced Vietnamese sausage (which shouldn't even be in this type of order), pork, and liver. 

We were VERY disappointed and I have to say that this experience reminded me of the one I had back in December in Alberta. We will definitely not return because the food sucked. The 10% discount didn't even make things better."}
{"text":"Been there twice and can't say I'm wow'd.  There are a handful of Vietnamese restaurants within steps of eachother.  That would mean that each of them should step up their game to gain their piece of the Pho Market.  

Play hard to reign as the Pho-King...er...you know what I mean!

We gave this place a second shot after I wasn't quite won over the first time.  Yep.  Done.  Maybe should has tried their Cambodian noodle instead of the pho.  We did order a wide swath of food.  Pho, grilled chicken, grilled pork, rice stuff, and dough fritter!

Only thing we really liked - the dough fritter.

The broth was flavourless and the meats were unusually tough and not edible.  The grilled meats were also a disappointment.

Oh...well.  One down and four more places to go!

Cheers!"}
