{"text":"Little food court Chinese BBQ house. Always priced well.  Food: 4/5 Filling but could use better veggies. Service: 4/5 Friendly. Environment: N/A Food court. Washrooms: N/A Mall washrooms available. Worth it?: 5/5 When you just want to eat!  I come here whenever my girlfriend or I have a cha siu (BBQ pork) craving. The last time we came here was on one of those rainy days you just want to do nothing.   We arrived 5 minutes before closing time (9 pm) and they were already cleaning up. We asked if they were still opened and they graciously said yes and made us 2 boxes of cha siu rice. At $5.99 a box, you can't go wrong.   They give you a good amount of meat here and a complimentary soy milk. I wish they had better vegetables tho. They only had stir fried cabbage. It's always just whats available in house.   Will definitely come back. It's our go to because it's close and priced well."}
{"text":"Dishes will definitely get you full, and what's best is that the prices are insanely cheap! Def would recommend coming here if you want some good tasting BBQ meat. Will for sure be back!"}
{"text":"In a rush to eat some food before heading to volunteer, I was in the area today and felt like having Chinese BBQ. I ordered a box of rice and a selection of 2 bbq items (chasiu/bbq pork + chicken leg) and overall, the food was mediocre at best. The chicken, which was the star of the show, was tender and saucy but I can't say the same about the chasiu. It was a little more tough/lean than I had hoped, but I reasoned that at least it was healthier! Unfortunately, the worst part was the rice, which was too damp and clumped together even though I ate it immediately after being served.   I mean, at only $6, the quality of the food is exactly what you would expect to get from a food court. There's not much else to complain about. At the end of the day, the real appeal is that the meal is quick, filling, cheap, and comes with a soy beverage (or soup if you prefer). So would I eat here again? Eh, I'd consider it."}
{"text":"Typical chinese BBQ place inside a food court.  The great thing about this place is its price.  For $5, you can get a BBQ pork w/ thin noodles in soup.  How great is that?  I usually go for the dual-topping (Roasted Pork & BBQ Chicken leg) on rice, which also comes with a small side of vegetables and a drink (soy milk or soup, i like their soy milk), all for $6.50 + tax.  Not bad at all!  So with these type of prices in this economy, I'd say this is go to if you don't mind the quality, i mean, it's not disgusting or anything, but just don't expect the same quality as a sit-down restaurant which charges you $15 per plate.  If you're fine with that, then go for it, try it out. It aint that bad, really!"}
{"text":"couldn't believe my eyes at how cheap roast duck with vermicelli in soup was! absolute steal... came to $6 after tax and be sure to ask them when their tofu was made... my mom and i happened to visit them when they had just finished frying off some fresh tofu so we got a box of it and it was soooooo bomb.  moreover, the duck we got was top notch (all duck breast pieces!). Not sure if we got lucky but yea it tasted absolutely amazing. Will be back next time im around in the area."}
{"text":"OK, here I go again....every once is a while I get that Chinese BBQ fever....lunchtime hits and the hunger pangs occur....the only thing that cures it is Chinese BBQ!   Closest place to get a fix this time is the Hua Ting BBQ which is located in the food court near Hwy 7 and Kennedy.  As with all my BBQ reviews I get the usual BBQ Pork with Roast Pork combo which also comes with veggies and option of soup or soya milk.  Portions are good with a good meat to rice ratio.   The BBQ Pork and Roast Pork was flavourful but a little too fatty for me but maybe not for others.   The skin of the Roast Pork was also not as crunchy as I would like as well.  Cost was good as its $6.70 taxes in for the combo.  Service was quick and polite.  Overall its a typical BBQ joint and satisfies my cravings and a good call when the BBQ pangs hit but wouldn't go out of my way to find it."}
{"text":"Markham, the land of BBQ options.  Hua Xing BBQ House is a great place for cheap yet great tasting BBQ! This mom and pop has been around for ages, and is inside the food court at Peach Tree Plaza in Markham. They get pretty busy during lunch hours, so be prepared to wait in line.  Food is always fresh and consistent. A soy chicken and BBQ pork lunchbox with soup will cost you around $6.78. A great alternative to your McDonalds!   Tip: You can always ask the butcher for leaner or fattier cuts of meat based on your preference. Don't be shy! There is also free wifi at the food court."}
{"text":"Hua Xing BBQ House is located in the food court at New Kennedy Square on Kennedy just South of Hwy 7.  Am I ungrateful to rate this place at 2 star? Since someone nice enough to treat me and even offered home delivery?  Am I too being too harsh since for $3.99 one get a full box of BBQ with rice and veggie and even a daily soup?  Roasted Pork with Round Rice Noodle - The skin of the roasted pork is crunchy and tasty, the best part of the meal, the meat itself is not bad too - The noodle though is overcooked, soggy and the soup based tasteless..   Roasted Chicken  with Rice - even with dark meat the chicken is tough, dried and lack BBQ flavour.  If you are hungry and you just want to eat something cheap and fast, maybe Hua Xing is good enough for you...   I will pass...... Next!"}
