{"text":"We had really high hopes, and while the service and ambiance were great the food just wasn't that great.  The veggies were all undercooked.  A plate of carrots had a lovely caramel color and looked fabulous but they were basically raw.  Similar issue with Brussels sprouts.  

Everything seemed a little under-seasoned and lacking in flavor generally, and worse, nothing arrived especially hot, which seems odd since we were there pretty early and I believe the first table served.  A halibut entree had a totally raw squid tentacle section, which seemed unintentional.  For the money I'd be really hesitant to give them another chance when there are so many other spectacular options in the neighborhood.  

Most of the 5 star reviews seem to be for brunch, so maybe we'll have better luck if we try that instead of dinner."}
{"text":"Honestly can't say enough about this place! Staff was friendly from the front door to the bar tender to the server to the chef! A solid, consistent, genuine spirit gives Hudson kitchen a soulful, rustic, down to earth vibe through the entire place.  Not only does it shine through the impeccable service, but also right down to the sexy plates that come out of the kitchen.  My husband (who is a chef himself) and I just came from a wonderful evening with our son and are still raving about every dish we had including their albacore tuna, broccoli salad and tasty lamb.  It is extremely evident the chef puts every ounce of love into each gorgeous plate he sends out.  This place has definite character and sweet little spots for a private dining.  A place we will definitely return to immediately.
Thanks for making dads first Father's Day the most memorable experience! Check them out!!!"}
{"text":"After fleeing the bottle-service-testosterone-style crowd on King West we came here hoping to finally try Hudson. Managed to get a spot at the bar. Good place to be.

Definitely a great food and service experience with a real attention to detail. Tuna ceviche and the beef cheeks with barley porridge were full of flavour and very satisfying. And a ginger bread/cream/wafer dessert was an original.

Nice low key ambience, great service, and creative satisfying food."}
{"text":"We had a fabulous meal at the chef's table. It was a family celebration  which was a huge success. The food was excellent and interesting. The service was prompt and friendly. Highly recommended."}
{"text":"Opening Remarks:
-The restaurant officially opened about 2 weeks ago, but had already incurred quite the buzz even before any critics or bloggers came through their doors. Using the most ingenious media technique I have ever heard of, Hudson Kitchen hosted exes Brad Pitt and Jennifer Aniston on two separate occasions- wow, for a restaurant without a reputation, that's a pretty impressive feat. 
-Located at Dundas and Palmerson where they took over three former spaces- the Palmserston Café, an art gallery and one of Jamie Kennedy's old spaces.
-Owned by Borys Chabursky and Vince Antonacci, with Executive chef Robbie Hojilla  (of Woodlot and Ursa) in the kitchen.

Ambiance:
-The space feels more like a cozy neighbourhood joint than your typical Hollywood hot spot. And I really respect that seeing as \"glamour\" isn't really a hot Toronto trend like, let's say \"hipster\" is. 
-The dining rooms feature light coloured exposed brick, hardwood floors, an engraved tin ceiling, a full-wall plaster mural by local artist Harley Valentine on one wall, and a mirage of wonky vintage framed food referencing artwork on another. One of the gentlemen told us that they intend to continue to fill up some of the empty frames with photos of menu items- I think it will be a really nice touch.
-In addition to 70 seats indoors there is also a private dining room in the wine cellar and a fairly generous 45 seat street-facing patio for the warm months. Believe it or not, even in mid October I saw a few tables out there having dinner. Wow, that's dedication.
-The room was packed with mid 20- early 40 year olds (likely heavy on the 30s range), dressed in everything from stunning sexy backless black dresses, to T shirts and jeans, to business suits. But wherever people wore, they all looked fabulous.
-My only criticism of the place was that it was ridiculously loud. The tables are placed very close together- so much so that the only staff member who could likely get to us without putting their ass in some other tables face was the gorgeous super slim hostess. We also happened to be sat beside a table of 7 (which I was told was an anomaly) so the noise level was likely a little higher in our cozy quarters than elsewhere. Just something to consider if you're sensitive to noise.

Service:
-The service was professional yet casual. Our server made sure to check in on us at each course to ensure everything was up to our standards and made strong recommendations on menu items. I also appreciated that despite how tight it was in there, the staff still made the effort to consistently refill our water glasses, and replenish cutlery and side plates between courses.

Drinks:
-The drink menu is printed on the main menu and features about 30 International bottles ($30-250) and 6 wines by the glass ($6-9). 
-The 6 item cocktail menu takes classic cocktails and really elevates them with seasonal flavours and unique preparations. Think Pear Syrup, Clarified Lime, Orange Flower Water, Cream of Earl Grey, Tiki Bitters (whatever that is), and Xanthan Gum. I also found it interesting that in drinks requiring an egg white froth that the ingredient was labeled \"albumin\" - the globular protein found in egg whites. Maybe the technical term is more diner friendly than a raw egg white? Well, I've taken food science courses so I don't really care what they call it, I just know it's delicious in my drink and I wanted to try it out.

Food:
-HK's website describes Hojilla's food as \"Progressive American\" and embodying a Leaf to Root philosophy that preserves the nutritional value of fresh ingredients and celebrates \"food and all its possibilities\".
-Just a quick scan of the menu and the local, seasonal, fresh, light and healthy slant is clear. Actually, the menu reads almost spa like, touting a near grocery list of fresh produce and unique \"trendy\" whole grains like amaranth, rye berries and quinoa. But where HK differs is in how those health-food ingredients come together on the plate- with innovative elegant plating techniques, and of course, with its sumptuous flavours.  If this is health food, than consider me on the HK diet.
-The menu is very simply divided into starters, mains and desserts- designed to support a simple 3-course square meal in contrast to the small plate trend of its west-end neighbours."}
{"text":"Wow. I cannot describe how impressed I was with Hudson Kitchen.  I rarely give out 5 star ratings but this place deserves every star. Came here on a Wednesday evening with a party of 6, and reservations were not difficult to make.

Food: I sampled both the mushroom salad and tuna appetizer to start. Mushroom salad was very flavorful and fresh, but the tuna was what blew me away in terms of freshness and texture - you can absolutely taste the quality. My colleagues were also highly pleased with the harvest salad which came together nicely with the whipped blue cheese. For my main, I ordered the chicken adobo, not expecting much, but it was tender, and the skin was crispy. Every part of the dish was such an amazing blend of flavours; I didn't know that chicken could be done so well. My colleagues enjoyed the pork dish as well, though I thought I could have been served warmer, but a minor nitpick in the larger scheme of things. And dessert didn't disappoint either. We had the Phillipino citrus dessert and the gingerbread and pear with ginger ice cream: the desserts were very different in character but I enjoyed both. The gingerbread was not overwhelmingly gingery but retained just enough flavour, and the citrus dessert was a unique tart flavor with a marshmallow compliment to juxtapose the texture and sweet with tart. All round consistent and excellent food.

Service: Our server was the right amount of attentive and knowledgeable. water and wine were refilled at a good cadence, and service was prompt and friendly. Definitely enhanced the experience.

Ambiance: The decor is kind of kitschy and the ambiance was more on the intimate and romantic side. It is definitely a date-eligible location and was relatively quiet on a Wednesday night.

I am definitely coming back."}
{"text":"I was here in July of this year.  We were warmly created by the wait staff and lead to our table on the terrace and given complimentary champagne to start.   

The starters were the highlight of the meal, varying from tuna ceviche to their broccoli salad (a highlight) and they're fantastic devilled eggs.  

Mains: the bc salmon dish was very good but I found the Filipino broth to not work with the dish at all.  The wild mushroom polenta was excellent.  

Dessert was a simple strawberry sorbet with fresh strawberries.  This complimented the meal perfectly and brought out by their star sous chef - Kyle Webster.  More good things to come from him Id say.  

Overall an excellent experience."}
{"text":"Food is decent but choices are limited. Prices are on the high side. Should be changed to $$$ from above, entree around $27 on average. Bread not that great to be listed on the menu for $4 (however, cute presentation). Wine selection by the glass is decent and you help support jobs here.. For such a small place, they do employ many people. Was a pleasant experience but the food is not that memorable."}
{"text":"5/5! It has been awhile since I've given a place 5 stars but this one deserves it b/c of the food, service and special cocktails. All 4 dishes were magnificant: Broccoli Salad, Pan Seared Scallop, Filipino Fried Chicken On Brioche (taste like mini McChicken sandwiches but better) and Lamb Kofta Lettuce Wrap. Each dish was unique and satisfying. I highly recommend the burbon cocktails. Must try"}
{"text":"Kept driving by this place on my way home from work so made reservations to try it out.  The good things: adobo chicken and broccoli salad.  The awesome thing: dessert in the funky bowl.  The really crappy thing (and this is not entirely the restaurant's fault): The obnoxious patrons who were sitting us who completely ruined our dining experience.  For the price of the food, as good as it was, not sure the place was for me."}
{"text":"Food was artfully displayed and delicious! I loved trying the multiple dishes. Cocktails were also excellent. Defiantly a unique and very enjoyable experience!"}
{"text":"I had the veal breast/tongue sous-vide. Very tender and mixed well with the carrots and gingery broth. Atmosphere was ok as we showed up when the place was completely empty and they had to think about seating us. I guess it's best to have a reservation."}
{"text":"Excellent food and cocktails, but a bit pricey.  Fully enjoyed our dinner, food was consistently good with several standout dishes, especially the squid and the silverbass which were divine.  Dishes are tapas style priced in the mid teens to low twenties each.  Cocktails were excellent, but at $15 they better be.  All in we paid $200 for two people, worth the money but definitely a once in a while spot."}
{"text":"Pretentious service and average food is a bad combination.  Steak was undercooked although we were very clear with our instructions. Pasta had odd flavors and not odd in a good way. I won't be back."}
{"text":"Is Hudson Kitchen worth the hype?
After the soft opening during TIFF, the Hudson was popular before it was open to the public.  I was excited to eat here and see what made it A-Lister worthy.

I arrived early for another fantastic brunch UYE hosted by Roma (yay)! 
I didn't even know that the Hudson served brunch.
Brunch.. with reservations!

Greeted with smiles from the staff, I was taken to our reserved table in the back area.  

Even though this restaurant is considered buzzy,  I found it very friendly and warm (in ambiance, not temperature).  
I sat down and our table and noticed that the room was very cold.
They had just opened for the day and the restaurant was still warming up.
I was offered an Americano while I waited for other Yelpers to arrive.

A shout-out to our server because he was out of this world great!
He was welcoming, attentive, and accommodating!  
Yelpers can be a tough crowd, but he went out of his way to take care of our group.

He actually offered me his own personal sweatshirt because he was worried that I was too cold.  That was a very kind gesture!

The decor was simple but a lot of attention was paid to the details.  
My coffee cream was served out of a little porcelain cow spouting milk.  
Too cute!

As for the food, definitely one of the best eggs benny I have had in a long time!
The rich hollandaise was just perfect. Heavy, smooth, and creamy.
The eggs were topped with sauerkraut served with a corned veal brisket ($13).
The tart and crispy sauerkraut with the salty and tender veal was a magical combination of flavours that worked wonderfully.

Even though we had a large group, the service was great and the food left you wanting more.  I was actually stuffed after my dish, but wanting more for next time!

So is Hudson worth the hype?  Yes.
Worth a revisit. YES! :)"}
{"text":"EPIC!!!
That is how I would describe my dining experience here.  We made resos for a party of 4 last week for dinner at 8pm.  This place was completely packed last night which says a lot considering it was a Tuesday night and located on a relatively quiet strip of Dundas St. W.

The service here is excellent!!!  I would describe the overall vibe as casual fine dining.  What I mean by this is that the servers are all knowledgeable, passionate about the food and friendly.  You get an upscale dining experience minus all the pretentiousness.  Try leaving your napkin crumpled up on your seat or the table while you step away to the bathroom.  When you return you'll find your napkin folded neatly into a little triangle.  I don't know why but I got a complete kick out of this!

Now on to the food!  

Appetizers:
Homemade bread with artisanal dip $4 
This came with soft little buns and homemade flatbread served with 2 different dips.  The eggplant dip was intense and crazy flavourful.

Broccoli salad with Serrano ham, manchego and mustard $14 (sorry my pic of the menu is a bit blurry and I think it says $14 but not positive)
MMMMMM Serrano ham!!!  Everything complemented eachother well and I really enjoyed the different textures and especially the grainy mustard.

Wild mushroom salad with rye berries and watercress $14 
Great presentation.  This dish was served on a rustic looking block of wood, or more like a tree trunk.  Delicious combination of flavours and textures with an earthy feel.

Albacore tuna crudo with radish, hazelnuts and aioli $15 
This was my absolute favourite app!!!  I will be dreaming of this for days.  **This dish is raw tuna** that melts in your mouth!  Combined with the aioli, it is very soft and buttery with the right amount of crunch from the radish and an unbelievable flavour combination with the hazelnuts.  Completely unexpected.  YOU MUST ORDER THIS!

Seared pork terrine with celery, lettuce, chilli, egg, tofu and lime vinaigrette $14
The sear on this terrine is a nice touch, it's also not too salty and is balanced nicely with the accompanying veggies and vinaigrette.

**Amuse bouche was like a sour cream potato chip sandwich.  Yummy!!!**

Mains:

Risotto with buffalo mozzarella and beef pepperoni $22
This was so comforting and reminiscent of pizza, but in risotto form!

Seared pork loin and cider glazed belly with onions and parsnips $27
I'm a sucker for a good pork belly and this pork belly was to die for!  The loin was nicely cooked as well, tender and moist. 

Chicken adobo with eggplant, garlic, brussel sprouts and quinoa $26
For all you Filipinos - this is not the traditional adobo you grew up on but you definitely get the adobo flavours.  This dish was served with white and dark meat (both very tender and moist) and a nice piece of crispy chicken skin.

Hanger steak with barley, sunchoke and chimichurri $28
One of our party found the steak to be a little tough but remember, this cut of meat is not going to be as soft as a tenderloin.  Great flavour and perfectly paired with the chimichurri. 


Desserts:

Since I didn't manage to take a photo of the dessert menu I can't tell you what each dessert was or the price.

My favourite was a gingerbread pear dessert, comforting and familiar flavours. 

The chocolate beet cake was different and paired with a beet ice cream.  Warning: if you do not like beets do not order this.  The ice cream was earthy and definitely tasted like beets!

We also tried an almond gelatin type dessert with almond butter and jelly.  This was interesting and reminded me of a Filipino dessert I had growing up.

Cocktails:

Tried a bunch and they were all good!  My fave was the innocence lost ($15).

Overall with the superb service and really flavourful food I had an amazing experience.  The prices are decent for the value that you're getting and I wouldn't hesitate to return."}
{"text":"I stepped into the shoes of past guests at my own dinner parties who were relegated towards the head of the table, and so naturally I started with a double shot vodka with redbull. It was brunch.

You will be offered two experiences of waiting services; the service you expect to get in a restaurant, and the service you'll get from your waiter. I have never shaken the hand of my waiter prior to a meal, but somehow it happened that I offered my hand after a short conversation with the man who was to handle my food. The hierarchies of restaurant patronage which I hold so dearly escaped me this day, and for good reason. The Hudson Kitchen does not sell redbull, but my waiter ran across the street in chilling morning temperatures so that I may enjoy my morning cocktail that no one else in the world has at this time--which was so politely stated by the woman sitting across from me--and I am grateful.

The World looked different from the tables edge, and I felt my dear friend right of me was the only thing holding me from falling to my egotistical death. Table arrangements is my second idol which could possibly hindrance me at the gates of St. Peter, and so I ordered another vodka redbull.

I don't brunch, its not a thing in my life. The only part of my life where brunch was a thing was during boarding school, and it was either brunch or nothing. Out of respect for the religious refinement of our host, I abstained from the veal and opted for the cured pork French toast. Not an auspicious start to my vegetarian week.
Three grossly thick slices of bread each topped with thinly sliced ham, drizzled in pineapple shavings, and lightly coated with a bourbon syrup. It was rich and flavorful, but the bread proved to be too overwhelming. 
I stared at my neighbour's sausage dish with obvious sausage envy, and like a commiserable puppy dog she fed me a cut of it. It was the most delicious breakfast sausage I have ever eaten.

Our waiter joshed at some new arrivals to the group by pretending to offer deplorable waiting etiquette, and then offering exactly the opposite. The preponderancy of conversation rested upon my very broad shoulders, and so instead of laid-back Raymond, I fashioned for the other guy; the restaurant eccentric.
I tested the depth of sufferance at the (social) world's edge by speaking my mind, and I think I didn't make any friends on this day. 
I was extremely amused by my waiter, he acted without the restraint that is placed upon a guest like me, and it was very comfortable for me to to experience such little divide. 

Suddenly, a capricious feeling washed over me, and I caught bimbo's husband glaring at me from across the table. I think he was having the veal. 
I waywardly looked away, but could not resist the temptation to look back beaming in amusement, and I stiffed my laughter with great labour.  
Another vodka redbull.

The decor was so simplistic that it felt like I was at my friend's Manhattan studio apartment. Ample natural light lit the two dining floors. One at the front, one to the rear. The kitchen was so bloody open concept I felt I could have just strolled in for a pickle without being met with protest. 
The restrooms downstairs was clean, but there was no rubbish receptacle in the mens loo, so I placed my disposable hand towels conspicuously on the sink like a pillager and took off before anyone could catch me.

My friend from across the table came to me once the seats freed up, and finally I was able to relax and talk normally. Although I wish my friend to the right of me stayed a little longer so we could have all gossiped. 
Three or four nightclub hour drinks later, I was feeling rather high-falutin. That is until I heard a rumour that it was our host's birthday. It was the only time throughout the meal that I felt rude, and I wished I had a chance to acknowledge this personally. 
I had a lot of fun here. The food was good, and I got to exhume my nighttime obnoxiousness at this unfamiliar hour, at this unfamiliar location.  

Upon leaving, I caught one of my employees having lunch with his lady friend. So I busted his balls for a moment just for fun. I was inebriated, I'm sure he'll get me back for this.

In the future, I believe I shall indoctrinate more diplomacy with my restaurantship, like, round tables.."}
{"text":"We live a few blocks away and heard the word on the street about Brad Pitt and other celebs that dined here.  The restaurant/bar has great curb appeal, hip decor, and we've been for brunch twice now.  The patio is nice too for sunny days."}
{"text":"So far I've only been here for brunch but both times have been super great. The decor is lightly rustic with comfortable seating. The music is 80's and the volume is not too loud- just right. I had the same server both times. She's genuinely lovely. But it seems all the staff have a good vibe. 

I'm not a coffee drinker but my friends said it was ver good. They are from Europe and picky about their coffee. 

Now for the food. OMG. My friends ordered the chorizo and the steak tartar. Both times I ordered the eggs Benny without the sausage (vegetarian). Everything was beautifully plated and we all were very satisfied with our choices.

When I was here with my friends the first time, they ordered the caramelized torrija. 
It was so decadent and lemony good I suggested this time we split one between us for \"dessert\". 

I think this will become my Sunday ritual."}
{"text":"Yelpers attending one of Roma's series of UYE brunches at Hudson spread out comfortably taking over half a section of the restaurant and settled in quickly getting down to the business of chatting amid the clatter of staff realizing they had their work cut out for them at 11 am. 
Since a Toronto brunch is unpredictable at best with no clear agenda, the staff made us feel secure in that we could order everything from a Mamosa to a fancy cocktail to my choice, a delicious cappuccino to start that clear and cold Sunday off on the right foot. The pacing was nice and pleasant with little awkwardness and a spattering of welcome deadpan wit from our server.
Love the light in this place! Inside, as typical in vintage Toronto corner lot restaurants style, we needed all the warmth we could get with the minus degrees night that refused to warm up with the sunrise, and the the big, clear picture windows facing west along Dundas helped very much.
A truly gorgeous modern interior design adorns this restaurant which even has the original tin ceiling gracing the front room. We chose from a gourmet style traditional brunch menu consisting of Eggs Benny and omelets, garnished with creative ingredients and bold flavours making the choices surprising yet predictable at the same time. A fantastic feat! And very creative.
The little details, like home made preserves and delicious whole-grain artisan breads along with sea-salt sprinkled on butter made the wait for our courses pleasant. Even a little cow-shaped creamer helped add some kitschy-ness to the smooth lines of wood and tile evening out the experience and tempering the potential pretentiousness of dining in a restaurant like this. And psst, the prices are reasonable too!
Highly recommended as a brunch spot in the west end where you gotta go early!"}
{"text":"Undistinguished flavours, portions that you may need to look for with a magnifying glass (this is re the steak tartare) and really inattentive/verging on rude service from our young blonde female server who clearly felt she had better things to do with her time. That makes for at least two brunch afficionados who will most definitely not be back."}
{"text":"A recent ROTD brought this spot to attention and I bookmarked it to try it sooner rather than later. Brunch in TO can be tricky for popular spots as many of them don't take reservations and who wants to go with an unknown wait time for brunch. Thankfully Hudson Kitchen is on Open table so the reservation was smooth.
Even though we showed up early there we were seated promptly. The dinning area is quite inviting and has high ceiling and apparently there are multiple dinning areas as we saw people seated in areas other than the main dinning space. 
Menu is sparse which is fine as its better to do some things right rather than a lot of thing average. They cover pretty much most bases (vegetarians etc.) so you will find a dish that will satisfy the picky eaters even with this limited menu.
I ordered a mimosa for starters and it was quite poor (no fresh juice and weak sparkling wine) expected for a low priced drink but it could use an improvement. 
We settled on the following 
Pancakes: decent though the frozen item (bananas were devoid of taste)
Omelette: below average IMO I know getting an omelette right is still an art form but they can do much better here
Duck fat fries were meh as well and some were burnt. 
Service is good and we were checked on regularly.
An average spot for brunch so I would say 2.5 stars."}
{"text":"Everything a foodie could ask for in a chic yet casual setting. Still dreaming about our meal. Maze bahhhhlz"}
{"text":"I'm becoming increasing reluctant to check out new places popping up in areas where trendy new restaurants always seem to be coming in and out of my life ever so quickly but when a foodie friend recommended that I try Hudson Kitchen on the same day another friend asked me to Brunch, I knew it was fate.

This restaurant is quaint and cozy and oozes with charm. The exposed brick and the decor really allows you to settle in.

I was there for brunch but was rather parched so I indulged in their signature Cesar, made with Gin, Dill and Cucumber. Let me say, three things (along with Clamato) have never danced around in my mouth so well together.

For brunch, I tried the Chorizo Sausage with a slow poached egg, potatoes and an apple glaze. It was pretty delightful. And the price was right.. $12 bucks for the dish and worth every penny.

Other Brunch goers with me had the buttermilk pancakes with bourbon syrup and French toast and were equally impressed.

I think this is a place to definitely have on your radar. 

With the food being that tasty and the price being oh so right, I think the Hudson Kitchen has some staying power."}
{"text":"Good food and great drinks. But that's not it.
It's that the staff seem to be passionate about their work, the eats and the drinks they serve, that it makes the dining/ beveraging experience here simply wonderful!

I've been here a few times and the staff have been crazy attentive. The first time, my friend and I exchanged birthday presents at dinner. Our server overheard and got us each a glass of champagne!
The second time, a different friend and I were being indecisive on the drinks. We were asked a set of questions, which we answered and the perfect drinks of the moment were presented to us.
This attention to detail, not commonplace is most Toronto eateries, sets Hudson Kitchen apart.

Everything from their breadbasket to their lamb shoulder and tuna is delicious. The ganache dessert is heavily!

Killer cocktails and the best ginger beer I've had in the city!

This place is made with love. And it's very apparent!"}
{"text":"Perfect for special occasion!

My partner and I were looking for downtown restaurant to celebrate a very special occasion. An extremely knowledgeable foodie suggested Hudson Kitchen. From the first contact, it was the right choice. They listened to what we wanted and put together a tasting menu with wine pairings that was thoughtful, delicious, beautiful and FUN. In short, we were treated well throughout - from the moment we arrived soaked from a downpour through 10 well-paced courses. A memorable meal worth every penny and more."}
{"text":"This is an undiscovered foodie heaven. They pay careful attention to every detail in terms of taste and texture and produce some wonderful results.

We had a cold cucumber soup to die for, an olive cake with wonderful fixings, the grilled broccoli salad with Serrano and Manchego was great, a stinging nettle pappadelle, braised rabbit dish that was completely unique.

Wine list good. The Sancerre was excellent.

They are not your normal up market snotty locale, but they produce food that exceeds such locations and the service is more informal. 

Highly recommended."}
{"text":"Not great but not bad.

The chorizo breakfast was a bit dry and quite salty. Not enough potatoes to cut the salt. I left feeling a bit peckish.

Service was friendly, though they seemed a bit worried about the size of our group (12 maybe?)

Everyone else's dish looked amazing, but there were very few choices for the dairy free (thus, chorizo)."}
{"text":"A very nice experience.  I was there with a group of 7.  I like to share things - so I just picked at what everything had to offer.  

In terms of appetizers I tried: 
Broccoli Salad, Serrano Ham, Manchego Cheese, Mustard - delicious, the broccoli is steamed and then cooled a bit - but the dressing is nice.

Late Summer Harvest Salad, Walnuts, Champagne Vinaigrette - very nice, although way to heavy on the dressing.

Wild Mushroom Broth, Rye Berries, Watercress - very ok - though not super into these flavors.

Albacore Tuna Crudo, Radish, Hazelnuts, Bagna Fredda Aioli - this was delicious 

Mains - 

Shared the gnocchi, did not appreciate the waiter saying this was the smallest dish on the menu - I know my body and if I'm hungry I'll eat more!  Same with the waiter saying he would never order fish or chicken at a restaurant.   The gnocchi was delicious and because of all the appetizers I had shared was perfect for me even as a shared.  I also tried the salmon - which had a nice crust to it.  

The atmosphere was very nice and a great table - not sure I would rush back there because it ended up being over $600.00 with 2 bottles of wine for 7 people..."}
{"text":"Hudson Kitchen - I don't think there's an urban Torontonian who doesn't know that name.  Having gained much buzz during TIFF because Hollywood's infamous ex-couple Brad Pitt and Jennifer Aniston graced the restaurant with their presence (on different occasions of course), phones rang off the hook and it was near impossible to get a reservation that wasn't didn't have you eating dinner like a senior or late into the night where you'd probably tear into your food like a prisoner who just got let out of jail and is having his first meal.

I hate hype so while I was late to check it out, I'd like to think I got to enjoy and savor my meal without having to counter the masses.  While Aniston + Pitt will be the talk of the town for sometime, I think that fad will end and chef Robert Hojilla's names will be blaring on neon signs because his food is truly delicious.

IMG_2633 (480x640)There's no doubt that Hudson Kitchen takes its drinks seriously seeing as 2 of the 3 pages of their menu is dedicated to libations.  We opt for the cocktails which are okay, but doesn't wow as much as the food.  But I do love the esthetics of the bar.


The restaurant itself is quite small (which doesn't make getting a reservation any easier); but I like the quaint and coziness of it all.  My favorite bit of interior design is definitely the wall that is plastered with food-related art.  Simple, but cute.

I hope the menu will expand as time goes by as the selection is rather limited.  I also don't quite understand why you need three choices for salads on an appetizer menu of six items.  It's taking up prime real estate on the page if you ask me.

With that said, we opt for the much-talked-about Broccoli Salad ($13) which is topped with Manchego cheese, Serrano ham and Kozlik's mustard.  The duo of textures of both hot and charred broccoli made this salad much more interesting on the tongue.  I'm not sure, however, that the Serrano really enhances the dish.  For me, it was almost a separate component that didn't mesh with the rest of it.

We also hesitantly opt for the Albacore Tuna Crudo which is under-marketed on paper, but a winner on the plate. It was served on a stark black plate which really allowed the colors from the watermelon radish and to pop.  This was my favorite dish of the night as I haven't ever had a tuna crudo that melted on the tongue like this.  It was very delicate and the brown butter aioli's creaminess went great with the melt-in-your-mouth crudo.

For our mains we indulge in a Seared Pork Loin with cider glazed pork belly, charred scallion, cippolini onions + parsnip.  While my Asian taste buds are biased towards roast pork belly, this melt-in-your-mouth, tender take was a nice departure from my usual.  The parsnip crisps added a nice bit of crunch to contrast the soft textures of all the other components of the dish and the glaze was just right - neither too tart nor too sweet.

We opt for both a dessert special (a deconstructed lemon meringue pie with calamansi curd, brûléed marshmallow and graham cracker ice cream); as well as the Pear, Gingerbread & Caramel at the suggestion of the server.  Of the two, we definitely enjoyed the dessert special (which our server informs us will soon earn a permanent spot on the dessert menu).  The curd was just the right level of tartness and everything just came together to create an epiphany of flavors and textures that would be worthy of a standing ovation.

The pear on the other hand saw a rather stale gingerbread with a red wine poached pear and graham cracker ice cream.  While the ginger ice cream was a great choice as an accompaniment; it didn't save the overall dish.  The red wine drowned out the simple, yet natural flavors of the pear and outshone the key ingredient.  I liked thin slices of Asian pear that were layered between the gingerbread - reminds me of this pear-ginger-longan concoction that the women in my family would cook up as a sort of \"beauty drink\" in the summer months.

I am quite a fan of Hojilla's cooking and am also impressed by the attentiveness and knowledge of the staff.  Our server knew the menu inside-out and was able to speak about the dishes in depth.  Hojilla knows how to both excite the palate and create beautiful dishes with palettes of color that pop.  I am looking forward to returning and look forward to an expanded menu as the testing phase continues.

Definitely make a reservation!"}
{"text":"Much like love, the first experiences left us giddy with pleasure, the later courses couldn't match our increasing anticipation. We left Disappointed but we are romantics, so we will return, hopeful..."}
{"text":"Great unassuming spot for brunch. Food is great and the service is very welcoming. Get a side of duck fat roasted potatoes with \"fine herbs\" and preserved lemon."}
{"text":"A great group or date night place for a special occasion. It was better than expected for me. Based on the photos, I thought the portion sizes would be small, and I would leave both feeling hungry and disappointed. But decided to go there for a pre valentines day dinner since it's getting such rave reviews. 

It was so much better than expected - maybe it was just the big plates vs the portions sizes.. This hidden gem in this neighbourhood (among a bunch of other hipster places like Bent and Montauk), is bigger than it seems. Typical for a trendy resto these days with exposed wood and edison bulbs, but gave a cozy feeling, and wasn't pretentious at all. 

The service was excellent, and everything that I would expect an establishment to be. The server was courteous, really knowledgeable about the food, willing to tell me and suggest things to me - and cleaned up after course.

For FOOD - we started with the Albacore Tuna Crudo ($16) which was smooth and loved the crunchy nut crusted top with some radishes and watermelon. Also got the basket of breads which came with home made eggplant and roasted red pepper puree ($4). 

For mains, we i couldn't decided between the Morroccan Lamb, the aged duck or the Beef Cheek Gnocchi. I think any would have been good (all around $28-30). But opted for the Lamb and the Beef Cheek Gnocchi.  The Lamb was like a terrine, mixed with spices and served in two pieces. it was flavourful, tender and hearty. I cleaned and licked my plate. 
The Beef Cheek Gnocchi, is definitely one for someone that likes cheese. It was melted all over , and paired nicely with the ample beef cheek portions that were given. I kind of likes this better than the lamb, almost. With a side of roasted artichokes ($6) we were full but with enough room for dessert. 

Since it was pre-valentines day, they didn't make any specials, and only had 3 desserts off the regular menu. A warm brioche bread pudding, coconut chocolate cake or a calamansi lime curd with graham cracker sorbet and roasted marshmellow. I took the one that sounded the most unique. I think it might have been better to call it a custard rather than a 'curd', but regardless, I love calamansi, and it's not really the easiest to get in Toronto. It was perfect for sharing as there was two portions and a great end to an awesome meal. 

I think it would be great for groups - there's the back room and the chef's table. Also a private dining room downstairs that would be perfect for a rehearsal dinner, or party etc. I would definiately come back, just want to find an excuse. I like trying new places too much.I need to come back for brunch."}
{"text":"Brunch is awesome on so many levels. I find it awesome because it combines two of my favourite things; breakfast food (without the early wake up) and alcohol (without the crowded bars and drunken fools). At Hudson Kitchen they are doing brunch right, justifying this newcomers stellar reputation.

The menu is short, but sweet, containing a handful of brunch classics with a twist. While the sugary pancakes tempted me I find it hard to turn down a runny egg, so I opted for the eggs benny. This particular benny seems to be inspired by a traditional reuban sandwich, containing corned veal, saurkraut, and Russian dressing served up on rye. I enjoyed all elements of my meal, the veal was delicious, the hollandaise had a creamy consistency that served to balance the sourness from the other elements on the dish. My only complaint would be that my eggs were slightly overcooked, but this was only a minor setback. 

I also managed to snag a bite of the french toast which sadly put my benny to shame; beautifully made french toast layered with fillipino style cured pork created a salty-sweet symphony that was to die for. 

An assortment of breads with butter and marmalade were also provided for the table, these too were delicious. 

The place itself is quite cozy, and modern. The service was exceptional, despite the fact that they had a dozen rowdy yelpers to deal with. Split bills were accomodated for our large group. 5 stars for service! I will definitely be returning here!"}
{"text":"I recently stopped by Hudson Kitchen for a night cap. When I walked in, I saw the most beautiful bar I have ever seen in my life. A classic wooden mid-century style perfectly round semi-circle with a glass backdrop of fine liquors. I vowed to come back for a meal.

The bartender was extremely warm and had great knowledge of the unique wines being served. Even though closing is at midnight, we were not asked to leave when we overstayed our welcome. Instead, we were offered a sample of homemade chocolate toffee to snack on with our wine. What a delight!

The decor is lovely: semi-rustic mixed with candle-lit classic. I look forward to returning and reporting on the food....menu looks fantastic."}
{"text":"Pricey and pretentious. The dishes don't come together as I had hoped. Although presented beautifully they fall short in taste."}
{"text":"My ex and I ended up coming here 3 weeks after it opened because he drove past one night and was so impressed by the front bar that he pulled over the car to check it out. A+ for eye-catching decor!

He made a 6pm reservation for Saturday and when we showed up the restaurant was nearly empty. However, within a half an hour all the tables around us had filled up. The patrons were generally older, but to be fair, we were dining at senior's hour. 

Everything turned out to be fantastic. We started off with a bottle of the Old Zin Vineyards Zinfandel for $45, which ranked high on the list of wine's I've had recently. They then brought us a complementary play on chips and dip, an amuse bouche of potato chips and house-made ranch. We then ordered the $4 bread basket which came with house-bake brioche rolls (yum). I unfortunately didn't write down what we had after that and it was long enough ago that I don't remember, but I walked away full and satisfied. I would certainly recommend
Hudson to anyone looking for a nice, delicious meal!"}
{"text":"STUDS!

From the first step in the door to the last step everyone in this place was a stud LOL
i mean studs as in they took care of us really well.  My buddy and I started the brunch with our favs...MIMOSAS! that is always going to put a smile on my face :)

i had the chorizo with roasted potatoes, braised apples, and a poached egg....AMAZING!

What  love most is their use of social media.  Their Instagram feed showcases their crew which i think is genius.  It gives a personal touch and makes you feel like you know them...smart.

I also noticed a bunch of Yelpers at a big table and the owner?? or whoever was on top of everything and all i saw were smiles...well done my friend.  Service is important and they were all over it like ketchup on fries.

SOLID PLACE.  I can't wait for the summer when their patio opens because this place is going to be off the hook."}
{"text":"Hudson Kitchen is a very cool place to have brunch - I haven't been here for dinner, yet but that will change. It's got a very cool rustic, laid-back vibe but the menu and ingredients is definitely nothing to scoff at. It makes an awesome venue for a first date. 

They've got a wonderful patio outside their signless exterior. The interior is charmant and downright sexy in an unpretentious manner. They have tons of seats - stools at the bar, tables with benches, single tables and a whole private dining area in the basement. 

The brunch menu is creative. There is a strong Filipino influence in each item with care and focus on blending the sweet and savoury. The presentation is simple and rustic - it may not be for everyone but I prefer the modern to the traditional. On my first visit last November, I ordered a mimosa and a french toast with pineapple and cured pork and it was all glorious. Service was impeccable and we all had a great time (this was at my UYE). This time around, the menu is different - I ordered the Spanish omelette, aioli, tomato soffrito on a baguette. It was delicious but I am anti salt on eggs. We ordered the bread basket which comes fresh from Thuet with apple preserve. Quite delicious. They have some interesting themed cocktails and there was one today called the Selena Gomez #insertjokehere. 

I would return for dinner in a heartbeat."}
{"text":"I just love when unexpected surprises work out!  While checking an art gallery me and my friend starting getting the hunger panes.  So we walked up and down Dundas looking for somewhere to eat.  This place looks a little unassuming from the outside, however we peeked through the window and decided it looked interesting for us to try.  Actually we were pretty starving at that point and just wanted to eat.

It's small, maybe about 30 people could fit but it has such a nice and relaxed atmosphere to it.  Honestly this is a GREAT DATE PLACE (are you listening men?!)  Small and cosy, but with a relaxed vibe.

Their  menu is share plates so we ordered a few things - the roasted brussell sprouts were divine. I could eat a whole plate of them.  We had the fried chicken burgers.  These weren't the greatest, but they brought them out in a Betty Boop lunch box.  How friggen awesome is that?!  That just upped the the reason to order these!  You get 3 mini burgers.  We also had their lamb koftas with a yogurt sauce, pomegranate seeds in a lettuce wrap.  A little mouth explosion going on - dee-to-the-licious people!

The servers are really friendly, there is a small bar area for drinks if you just want to chill.  They have really cool cocktails looking at their menu.

I will definitely run back to this place when I am in the area, it definitely is a hidden gem"}
{"text":"Excellent service excellent food with reasonable price I went there first time last week and it wont be the last for sure"}
{"text":"I usually rate restaurants on 3 basic criteria:  service,vibe, and food.

Service: friendly and professional.  Very knowledgeable about wine and how to pair. As good as I've ever seen in Toronto.

Vibe: hip and upscale. Side note: acoustics are great - the place was buzzing but I could still have a conversation with my dinner date quite easily.  

Food: I went for the pork dishes and recommend them to anyone. 

Big plus: they know how to mix an Old Fashioned, which is critical to me. That alone gets them 2 stars because this classic drink is butchered by too many wannabes in Toronto's dining scene."}
{"text":"A tapas menu with Philipino influences. 

Started with anchovies toast - 2 tiny toasts for $6! But it was good, very flavorful anchovies & red pepper spread on a too-crispy toast. 

Albacore Tuna - a ceviche in coconut mik, served with cassava chips. Surprised that the tuna chunks were quite big enough for a good bite, and worked well with the coconut milk - a different take than the usual lime juice. 

Broccoli Salad - blanched and fried broccoli (couldn't see or taste the fried part?), with serrano ham (my fav) and crispy fried shallots in a mustard seed dressing. Very refreshing take on broccoli.

Brussels Sprouts - a warm dish, I like how it was cooked so that you couldn't taste the usual bitterness from brussels sprouts. 

Adobo Chicken - my least favorite; the fried chicken, while juicy, wasn't crispy as i expected and it was served as 3 mini burgers in a lunch box. Brioche bun was a bit dry. 

Dessert - poached pear. Great ginger icecream with a dry cake. Thank you Hudson Kitchen for this complementary dessert for my boyfriend's birthday!"}
{"text":"This restaurant is a nice little spot near College and Bathurst. The decor is welcoming and at the back there's more comfortable seating.

My wife and I came here for brunch and we ordered the buttermilk pancakes with peach compote and the chorizo with duck fat potatoes, poached and glazed apples. The pancakes were fresh and fluffy and the peach provided a light twist on each one. The chorizo came with potatoes that were made with duck fat and had deep lemon and herb infused flavour. The apples also provided a nice contrast to the spicy sausage. 

The quality of the food was top notch, albeit not your typical brunch fares, but with a more sophisticated take on flavours. Not likely to be something I'm ever craving, but it's worth a try if you're looking for something different than the usual eggs benny. 

Service was great and price was comparable to other brunch places in Toronto ($12-15)."}
{"text":"We had our rehearsal dinner here with our wedding party last week. Our group of 20 had their $60 tasting menu and our experience was fantastic.

Firstly, the service was very friendly and welcoming. Some of our guests arrived late and delayed our first course, but the staff was completely understanding. Everyone was attentive and unpretentious.

Secondly, the food! The dishes were interesting, delicious, and appealed to everyone. We ate family style and there was a huge amount of food, so no one left hungry. Overall it was a very unique and fun meal. 

Here's is their tasting menu as of last week:

Housemade Bread
Brioche, Lavash, Sunflower Oil

Broccoli salad
Manchego, Serrano Ham, Mustard

Deviled eggs
Salmon Roe, Nori, Togarashi

Albacore
Coconut Milk, Lime, Chili, Shallot, Cilantro

Lamb Kofta Lettuce Wrap
Caramelized Yogurt, Cucumber, Pomegranate

Squid A La Plancha
Jerusalem Artichokes, Squid Ink Sauce

Corned Veal Brisket 
Succotash, Grits, Smoked BBQ Sauce

Brussels Sprouts
Lemon, Anchovy, Chili

Hazelnut Anglaise
Coronation Grapes, Milk Chocolate

Pear & Ginger
Gingerbread, Caramel Meringue"}
{"text":"Very good dining. Good for a date or just drinks. Just past bathurst so still close to downtown.
We split the steak, gnocchi, broccoli ap and Brussels sprouts side. It was tasty.
Cocktail list is nice, pretty standard but clever drinks for a trendy place. The main wall in the lower room looked like they just ripped off the wall paper. Somehow they made this look good.
It was my dates birthday, they gave us some sparkling wine gratuit to celebrate. Nice touch I always have said to anyone who will listen a low cost (to the resto) gesture like that will go a long way.
Key lime deconstructed pie for dessert and we were two happy campers."}
{"text":"the food here is gross (lamb was ok though)
super slow service. not impressed and not worth the price ($100 for two)"}
{"text":"I came here recently for brunch and I think I will add it to my list of favourite places for a slow weekend brunch:) 

- Takes online reservations -- so key to avoid lineups!
- Small menu but plenty of options from your classic eggs benny to more unusual (and healthy) options like socca crepes (a gluten free chickpea based grain) with hummus and chickpea salad. I went for the latter and it was light, tasty, and just the right size portion-wise. My DC had the chorizo and it looked great, especially the egg -- perfectly soft with a gooey yolk. 
- Friendly servers
- Interesting cocktails (I didn't try any, but they sounded great!)
- Good espresso

I would be back for brunch and I'd also check out their dinner menu. There is also a sweet private dining room in the basement that looks like it would be fantastic for a small party (seats ~15 for dinner and more for cocktails/appetizers)."}
{"text":"Hudsons Kitchen is probably one of my favourite restaurants in Toronto, having discovered it for the first time just last night. 

Really interesting and unique menu with several influences, but quite notably filipino, which I adore. 

Star dishes were the devilled eggs - so amazing we had to order a second helping. 
Smoked mushroom polenta, Adobo Chicken sliders & the Halo-Halo. I've never seen a nice restaurant do a take on Halo-Halo, and I must say - it was delicious. Really refreshing, with great textures and bright flavours. 

The dishes are made for sharing, and the best thing is that each dish isn't so small that you are left wishing for more - it's the perfect serving size to make sure you can sample a wide range of dishes, but also be satisfied by each plate. 

Cocktails were also great. 

And the service....absolutely amazing. The staff here seem genuinely passionate about the food they are serving. 

It's a great place for an intimate celebration or date night"}
{"text":"The menu and service here make it worth a repeat visit. They don't provide many choices but they're more than happy to modify your order to make you feel special. Small portions are deceptive - the rich ingredients will keep you satisfied until dinner. 
Clean bathrooms downstairs are well heated in winter. Consider eating a silent meal if your voice is strained from the night before; the noise in here is considerable and you'll find it difficult to speak over the din."}
{"text":"What's with all the hype? We had one of the poorest meals from recent memory for the price we paid. None of the dishes popped, even the humble brussels sprouts were given a pedestrian treatment. 

The beer based cocktail I had showed a lot of promise but the food was a major letdown.

I hate paying for bread service particularly when it's nothing special. The carrot butter had a puree like texture and the charred eggplant was too strong. I did not understand how this made any sense with the sweet brioche. For 4 bucks, it did not feel like a waste of fortune, so we moved on.

For mains, we had the gnocchi with squash and parmesan. The gnocchi was tender as expected but the rest of the ingredients weighed down the dish. Overall taste was sweet which made it very boring very quickly.

The most promising dish on paper - moroccan braised lamb turned out to be a disaster from the kitchen. The lamb was dry and although the couscous did help to cut the richness I wasn't sure what the bland salad was doing on that plate. I had to ask for some lamb jus to add a sauce component to this dish. Please avoid this dish if you can unless you are hell bent on lamb.

Dessert also did not go any distance in salvaging the experience. The deconstructed key lime pie was meh. Nothing creative here just ordinary flavors. We were glad it was over.

Service was definitely what saved the day for a mediocre meal. Never going back nor would I recommend this to anyone."}
{"text":"Why does fresh fruit seem to be such a stretch for so many breakfast/brunch restaurants in Toronto? This place was no exception: an intricately prepared, carefully considered main that arrived with... nothing else. Eggs benny ($13) served with no greenery, no fruit, nothing fresh on the plate to cut the richness of the rest of the meal. 

Come on Big Smoke, you've bot loads of great produce around. Throw a handful of berries on there and live a little!"}
{"text":"We went to Hudson's Kitchen on Valentine's Day.  When I walked in, I first noticed the great bar in the dimly lit restaurant.  Nice dim, warm ambiance.

-Amuse bouche: two home made potato chips stuffed with a creamy dollop.   Surprised that no bread was provided or offered, then realized this restaurant charges for their house-made bread.
-Appetizers: We shared two apps.  Seared scallops with blood orange drops was on their Valentine's day special menu.  The scallops were good.  However, the Albacore Tuna Crudo was incredible.  Loved every bite and would definitely order that again.  
-Entrees:  The Grilled Pork was so succulent.  Just delicious.  My date ordered the chorizo stuffed pasta from the Valentine's Day menu.  The pasta tasted unbelievably light and just melted in my mouth.  I expected the chorizo to be overpowering but it was a great dish; I would even suggest adding this to the regular menu.
-Dessert:  The Chocolate Cake with coconut ice cream was ok.  The Bread Pudding with caramel, walnut, and rum raisin had great flavours when eaten together in each bite.  I prefer a bread pudding that is warm and fluffy, rather than a dense cake.  Great cup of Americano coffee.

Overall, the servers were attentive, very nice ambiance and the food was better than I expected.  The entrees we ordered were really delicious.  The presentation of each plate was beautiful as well.  Thanks Hudson's Kitchen for a great evening."}
{"text":"My experience at Hudson was rather flat. The food is good - but it's not exceptional. It's just kind of in that category of knowing what modern good cuisine is, but nothing is original.

Service wise, they're doing a bad job in my opinion. For the price point, they need to have an elevated level of service. But the servers walk around with a smile, offering the mediocre service they've been trained to offer. Nothing wrong with that, except they don't get the details that are clearly missing here. An overhaul is needed at this place to bring it to it's full potential."}
{"text":"Hudson kitchen... Mi amore... How I love you so! Oh... And how I love yelp for letting me stumble across this gem! 

I can't voucher for the dinner selection, although I've heard it's fabulous- but I can say this was the best brunch I ever had in Toronto! 

Was out on a beautiful Saturday morning and feeling a little hung over from the night before, and wanted a quaint joint to have a patio meal. Was greeted immediately by the pleasant hostess who informed me there was a bit of a wait for outdoors, but was gracious enough to seat us at the bar and start us off with mimosas. Awesomeness. After only having to wait a mere 15-20 minutes they sat us. 

After glancing over the menu, I couldn't make up my mind! I'm a hugeeeee eggs Benedict fan, and I've heard theirs with the veal and sauerkraut is to die for... But I wanted to try something different. Something outside of my comfort zone. I usually hate steak tartare but really wanted to give it another shot. Let me tell you, Hudson kitchen hit it spot on. The different flavors popped in my mouth, and the crostini was a nice addition. My partner in crime got the chorizo sausage with eggs and apples, which was probably some
Of the best chorizo I've had. Ever. 

Thanks Hudson kitchen for such an epic meal!"}
{"text":"Came here off of a recommendation from the Harbord Room, and I was not disappointed. Had the broccoli salad (serrano, manchego, mustard) and it was wonderful. The tanginess of the mustard cut some of the richness of the ham/deep fried parts of the broccoli (the flowers were tempura-esque), although they didn't always blend together (i.e. there were some tangy/some rich patches). I also got a beer cocktail - not sure what was in it, but I would have gladly gotten another if not for my time constraint. Service was pretty great, and there was an amuse bouche of a \"classified\" potato chip and ranch dip sandwich, though wasn't a huge fan of it -- hoping to try brunch there next time!"}
{"text":"Our server was great and the space is much bigger than we thought. The kitchen is quite big and the BOH staff gets a lot of natural light, kinda the dream for some of us :P We came for a girl's brunch.

I think our server was new but she was picking up the ropes very fast! I enjoyed my order of eggs benedict. Anytime I can eat a pickle, especially for brunch, it's a good day. The eggs are cooked sous vide and for some that result in an off putting texture and visual. I loved it!

Our bill was reasonable but I wish the dishes came with some sort of side. A light salad, or fruit...something."}
{"text":"Came for dinner in August 2014, and fell in love!! The decor is simple, yet the details so intricate. The staff are friendly, knowledgeable and helpful guiding guests through the menu. The food.... Just amazing. We loved that the dishes were sharing-style - it meant we could try and taste so many more things!!!
We ended up choosing 5 dishes, had 2 cocktails and 2 glasses of wine, and 1 dessert, and our bill was about $130 CAD. A great price for the quality of food and service. We'll certainly be back!!"}
{"text":"I thoroughly enjoyed the food here, as did each of my dining companions. We arrived during a snowstorm on a slow morning, so clearly the wait-time and crowded themes of some of the other reviewers are a moot point from our perspective. The place was pretty empty.

All of our dishes were delicious. I had the chorizo with poached egg and it was fantastic. My date had the steak tartare, and while that's not exactly my cup of tea (ironically, he also had tea), he loved it and spoke highly of the dish.

The coffee was delicious, but, at the risk of sounding like the opening monologue of Reservoir Dogs, when I order coffee I expect the cup to be kept full. We were there over an hour, and that initial cup I ordered at 10:00am wasn't offered a refill until 11:10am, as we were putting on our jackets to leave, and after waiting from 10:10am, when I emptied the cup, for an hour, I no longer wanted more coffee.
That's not okay when it's super-busy, but when the place is empty, that's just inattentiveness. I would have lost two stars instead of just one, except that the setting was lovely and the food was so delicious, that three stars seems a bit harsh for friendly but really less-than-attentive servers."}
{"text":"After all the buzz during TIFF with all the A-list customers at this yet to be open restaurant name Hudson Kitchen (@hudsonkitchen), I felt like I should try it as soon as possible. I tried to made reservation that fit my schedule several time but end up making a Friday reservation 3 weeks in advance. Helm by Chef Robbie Hojilla former sous-chef of Woodlot and chef-de-cuisine at Ursa, I am confident that this would be a great meal.

 Love the space as soon as I walk in the place with the semi circular bar, the overly packed bar shelves, the exposed brick wall and all the different size frames w/food reference taking up the entire focal wall.

The Miller $18.50
~ Mezcl, Tromba Blanco Tequila, Green Charteuse, Creme de Cacao, Sherry, House Made Dram
~ This was very strong and that basically explain the price tag. 
~ Love it but this is a cocktail that's better enjoy on it's own cause the flavors here are so strong that it compete with most food.

The New Black $13
~ Sailor Jerry's Spice Rum, Seabuckthorn Liqueur, Dead Elephant IPA, Aperol, Spiced Syrup, Lemon Juice
~ This is probably the best beer cocktail I ever had, I never really like the ones I had before. 
~ This was very light and refreshing, perfect to go with our meal if you ever decided to just have one cocktail for the night, that should be it. 
~ Ben wants to try to duplicate this at home in the near future.

House made Bread w/ Carrot Butter & Charred Eggplant Spread $4
~ This is one of the place that you feel paying for bread (brioche in this case) is all worth it, love the contrast of sweet carrot butter and the slightly bitter charred eggplant spread.

 The Chef's play on Chips n Dip for amuse bouche

Broccoli Salad, Serrano Ham, Manchego, Mustard $13
~ This was the \"must try\" dish everyone was talking about, I just had to try it for myself and it did indeed live up to it's expectation. 
~ Love the perfectly cook broccoli along a few crispy charred ones together with the savory ham, shavings of manchego and even better with the tartness from the mustard.

Seared Pork Terrine, Celery, Lettuce, Chili, Egg Yolk, Lime Vinaigrette $14
~ Who would have thought that just by searing the terrine can bring out all the flavors and also add that extra layer layer of texture & flavor. 
~ Love it ! 
~ While I usually would crave for toast or bread with my terrine but this was perfect on it's own with just the salad on top and also love the pop of heat from the red chili.

Seared Pork Loin, Cider Glazed Belly, onions, Parsnip $27
~ Love the cider glazed here, the slight tart/sour flavor made it so different from what we are use to and it sort of lighten up the otherwise heavy fatty pork belly if that's even possible. 
~ Usually not a huge fan of park loin but this was perfectly cook with nice pink center, this was tender and moist which goes perfectly with the yummy parsnip mash. 

Veal Pot Au Feu with Brisket, Tongue, Broth, Root Vegetables $27
~ This was the perfect rich warm comfy dish for cold days like these. 
~ Both the brisket and the tongue was perfectly cook, perfectly seasoned; just incredibly tender and moist. 
~ Even all the veggies was so packed with flavors and I can't help but have a bit of the intense broth with each bite. 
~ The plate was lick clean!!!

Beetroot & Chocolate Cake, Hibiscus $10
~ Love this, especially the beet ice cream and the dark chocolate which was so dense and intense.

Pear, Gingerbread & Caramel $10
~ This was complimentary from the chef and I'm sure he can read my mind cause I had wanted to order this but let Ben choose instead. 
~ I am so spoil (^_^) 
~ I usually love poached pears but I find this to be overly spiced and even more so with the gingerbread. 
~ Not sure if it's the pear itself or because of it's poaching process but the fruit lack sweetness to it.

Verdict :
~ Would love to come back already and it's a lot coming from someone who wants to try new restaurant all the time and try not to return to the ones that I have already been.
~ Love everything here; the food, the drinks & even the decor.
~ I am especially impress with our waitress who knew the answer to all my questions from the cocktails, wine to every single dish."}
