{"text":"Wow! This newly opened little food shop in the Mekong Plaza is fantastic. Very authentic Hue Food. Although I'm not a Vietnamese, I have been to Hue in Vietnam and had their famous Bun Bo Hue. Must say that this store was very close to the authentic Bun Bo Hue. The pork hock and the other meat used was very tender, the noodle was perfect. The broth is lightly flavored so that you can use the Shrimp Paste for those who like it a bit more salty. The veggie was very generous.

The Banh Beo was another neat Hue snack. It's a very thin rice cake snack which is steamed. You dip it in Fish Sauce. It was very nice and moist.

Their menu is pretty limited as they only have about 6-7 items, but they are definitely featuring the best of hue to serve. Very impressed to see. 
There was a good crowd too, so lot's of people have been dying for some nice Hue food.

Only thing to note is they were a bit disorganized the opening weekend as their register was not even working, and the service was a bit slow. I'm sure after a few weeks, this place will be running smoothly."}
{"text":"The food is good overall in my opinion, plus it's cheap. Yes, some of the dish could used more flavoring so it doesn't tasted diluted, but there's only one or two dish(s) that I have tried so far. Good portion for about 5 or 6 bucks. Four star, minus the a+ customer service."}
{"text":"An unpretentious little restaurant in the Mekong Plazza food court.  The price is right (low) and the quality is high, mom's and grandmom's recipes!  They now accept credit cards. The owner of this new (3+ months) restaurant is a charming young lady named Lan from Hue City, Vietnam, with a degree in Chemical Engineering and a life long desire to own a restaurant.  \"This is my baby\" she proclaimed proudly.  She is still upgrading and adding to her menu, using the freshest ingredients she can find.  There are 6 people in the kitchen, none of whom speak much if any English.  She serves the tastiest and best (I call it Pho) Pho I have ever eaten.  Called Bun Bo Hue and served as spicy as you would like.  The broth is rich with a depth of flavor rarely seen in restaurant soups.  It's addictive, filled with slices of chicken and beef and rice noodles, served with a side dish of shredded red cabbage and 2 different kind of green leaves, bean sprouts and a fish type of paste to mix in for added kick.  I have never had spring rolls as tasty and as well seasoned  with green onion oil and crunchy crushed peanuts, fresh shrimp, ground pork and several other items that created a symphony of flavors and textures.  My son-in-law likes this place so much that he eats lunch there three or four times a week and claims it to have the greatest Vietnamese food in town!  My wife and I have to agree.  Lan is happy to chat with you and suggest some of the dishes she thinks you might enjoy."}
{"text":"This place literally hooks me up. I cannot stop coming back every week to eat their bun rieu and bun bo hue. Their Bun Rieu is the best in phoenix so far. Very tasty broth. No other restaurant is even close to their level. Very affordable too! 5 dollar only!"}
{"text":"One word: Authentic! I love Hue food and this place pretty much has it all. I tried their bánh bèo chén, bánh kht and bún bò. The bún bò would be perfect if there were some rau kinh gii to eat with. I thought the bánh bèo was very good and so was the bánh kht. They also make fresh Pate Chaud and bánh giò! Can't wait to come back to try the rest on the menu."}
{"text":"I love the Bun Bo Hue made from this restaurant. So far, it is one of the most authentic Vietnamese Spicy Soup (a.k.a Bun Bo Hue) that I have tried in Phoenix, AZ. They have pretty much most of the stuff that a Bun Bo Hue's  supposed to have. When you get a bowl of this soup, you've gotta get Cha Thoi as well, which is only like $1 per piece. Trust me... It's well worth it to eat with the soup! Prices here are super reasonable, if not cheap compared to other places. Occassionally, they'd have Bun Rieu on special on the weekends for $5 as well!"}
{"text":"This restaurant is located inside of the Mekong Plaza. This is an authentic vietnamese place that specializes in middle vietnam cuisine. I come here for their speciality and this place is consistently delicious. Try the BUN BO HUE (spicy red soup) and you can tell them how spicy you like it. It can get pretty intense so plan accordingly - mild spice. They take cash or credit so no worries about not having cash in hand. You would not expect that this place to be a \"restaurant\" since it's looks like a mall food court. I still leave a tip on the table since food and drinks are technically served to me. I love me some pho noodle soups, but when it comes to bun bo hue - do not go anywhere else but here!"}
{"text":"When my friends and I want bun bo hue this is where we go. Not sure if it's because it's so good that we go here or is it because we don't know where else to go. I want to say it's because it's so good we can't go elsewhere. 

I wish I can say there's consistency here but there isn't. The time before last, the broth wasn't as savory and the last time the broth was so rich and savory but the noodles were over cooked so it ended up being broken and short. 

Only thing I hate is how cheap they are. When I ask for extra lime because I'm a lime-y type of gal, the people literally ignored me. I politely asked and he straight out act like I didn not spoke to him and walked away and the lime never came. 

I really want to give them more stars but from the last experience where they messed up an order and force my friend to take what they made instead of what she ordered really bump them down one. And when I said forced, I really mean forced. The owner stood there and said he thought this is what she ordered and she said no I ordered something else and he just blankly stare at her until she said fine I'll take that, and then it was followed up by a comment with his waitress saying good thing you took it or else you end up out of money and no food? Obviously they were not going to correct their mistake. 

With all of this said, i definitely will return because their bun bo hue is decent, second to my moms of course but until I find somewhere else better, this is where I go to get my fix."}
{"text":"I love this place. Bun many vit (duck noodle soup) is always on point. The owner who takes order is really nice too. Never had a bad experience here. A must."}
{"text":"This is, hands down, one of my favorite places to eat in the Phoenix metro area. 

They make a lot of Vietnamese dishes that are difficult to find anywhere else, and they do it beautifully. 

It's a fast-food/cafeteria-like setup where you can order food to go, or they give you a number and bring the food to you. Either way I've always had good service here. 

My go to dishes: 

Bánh Bèo(no. 101). I've never had this anywhere else, so I don't have anything to gauge it off of, but here it's cooked beautifully. You get ten in an order and one order is only $5, and the dipping sauce is amazing. Don't be intimidated by the chilies in the dipping sauce, if you don't eat them the sauce isn't too spicy(but if you love super spicy foods EAT THE CHILIES! They pack a punch). 

Bún Riêu Cua(No 203). One of my favorite dishes, and they do it the best. They give you a wide variety of veggies and herbs to put in the soup that you don't often find with this, though you'll find it often served with pho(onions, lime, perilla/shiso leaf, and fish paste). The broth is rich, the crab paste is amazing. 

Bún Tht Nng(No. 207). There are other places in Mekong Plaza that makes this, and they're good, but this one is the best by far. They only offer pork (as far as I know), and the pork is cooked perfectly, and is beautifully seasoned. It comes with the usual sides of lettuce, pickled carrot and daikon, and cucumber, as well as dressing. This is my current favorite.

To-go orders are packaged very, very well. A lot of places will pack the veggies in with the noodles and pork for dishes like Bún Tht Nng, which makes them kind of soggy but here they put the veggies in a separate bag, which I love because then the lettuce doesn't get all soggy and gross. It's a bit of a wait, especially during the dinner rush, but it's worth it. 

They will have different specials on the weekends, and they also do catering. 

If you're in Mesa give them a try!"}
{"text":"Terrible. Expensive and slow services. I ordered  $30 worth of food but I cam out hungrier than I was when I walked in. Disappointing. Never again. Save your money and go somewhere else."}
{"text":"I started coming here when they had their grand opening. I must say I've been back despite of the decreasing meat portion. Their seasoning hasn't changed, but rather better. Miss boss is nice, very accommodating. I love bún vit and bún bò here minus their meat quality."}
{"text":"I've been wanting a good Vietnamese place here in Arizona for a while. I was very excited to see they sell my personal favorites such as banh beo Chen, banh bot loc, banh khot, and many others. 

I ordered their mi Quang. Although not completely authentic. It was still pretty good. Banh Bot Loc was fire- lua affff. Although they were kind of small. 

Excited to come back and try their other dishes."}
{"text":"Hue, the former imperial capital of the Nguyen Dynasty between 1802 and 1945, has it's own regional cuisine that sets it apart from other regional cuisines in Vietnam and we're lucky to have a place that serves such cuisine right in our own Mekong Plaza in Mesa. I've been coming here at least every other weekend to try out a different dish. So far my favorite items are Banh Khot, Bun Mang Vit, Mi Quang, and Bun Bo Hue. They're open every day except Wednesday. Service is decent - the only complaint I have is all the flies in the food court you have to keep swatting away from your food. Prices are very cheap and you definitely get lots of value for your buck spent here. Their menu is kinda splattered all over the walls and is a little hard to follow so I'm pasting it in here in true OCD fashion (minus the diacritic marks which won't get posted in Yelp until Vietnamese becomes one of the languages supported.) 

101) Banh Beo - [BUN BAIL] - rice coin with shrimp flakes, green onion topping, and crunchy pork skin
102) Banh Nam - [BUN NUM] rice roll with shrimp flake in banana leaf
103) Banh Loc La - [BUN LOCK LAH] - Clear Dumpling filled with Shrimp and Pork in Banana Leaf
104) Banh Loc Tran (Party Tray Only) - [BUN LOCK TRONG] - Clear Dumpling filled with Shrimp and Pork, coated with green onion oil
105) Banh Gio - [BUN JOE] - pyramid shaped rice dough dumpling with pork, Jicama, wood ear mushrooms, and wrapped in banana leaf
106) Banh Bao Nhan Thit Trung - [BUN BOW NYANG TICK CHOONG] - steamed bun filled with pork and egg
107) Banh Bao Nhan Xa Xiu (Special Order Only) - [BUN BOW NYANG SA SIU] - steam bun filled with BBQ pork
108) Banh Ba Te So (Weekend Only) - [BUN PAH TAY SHOW] - Pork Paté Choud
109) Cha Gio Tom - [CHAW JOE TOME] - Shrimp Egg Roll
110) Banh Khot - [BUN CAULK] - crispy mini pancakes with shrimp topping served with veggies and dipping sauce
111) Banh Mi Thit Nuong - [BUN MEE TICK NOONG] - mini French bread filled with pepper pork and mint
112) Banh Mi Thit Nguoi - [BUN MEE TICK NOOEE] - mini French bread filled with cold cut and shredded pickle
201) Bun Bo Hue - [BOON BAW HWAY] - Hue style beef and pork noodle soup, spicy level [0-5]
202) Banh Canh Cua - [BUN KUN KOO AH] - hand cut tapioca flour noodle soup with real crab meat and shrimp
203) Bun Rieu Cua - [BOON REW KOO AH] - crab cake, spare rib, meat loaf, tomato noodle soup served with veggies
204) Bun Mang Vit - [BOON MUNG VEET] - Duck Noodle Soup with bamboo and served with duck slices on a bed of sweet and sour cabbage
205) Bun Cha Ca - [BUN CHAW KA] - steamed and fried fish cakes over noodle soup served with veggies
206) Mi Quang - [MEE KWANG] - Quang Nam style noodle with shrimp, pork, quail egg and veggies
207) Bun Thit Nuong (egg roll can be added) - [BOON TICK NOONG] - grilled pork over rice vermicelli, served with veggies and Vietnamese pickle
208) Com Hen - [KOM HEN] - baby clam meat over rice with vegetables and clam juice
301) Cha The - [CHAW TEH] - steamed pork stick wrapped in banana leaf
302) Cha Hue Don - [CHAW HWAY DON] - Hue style meatloaf
303) Cha Oc - [CHAW OAK] - Escargot mixed in pork stick
304) Cha Tom (Call In Advance) - [CHAW TOME] - shrimp cake, steamed
305) Cha Que (Call In Advance) - [CHAW KWAY] - charbroiled cinnamon flavor pork slab
306) Nem Nuong (Call In Advance) - [NUM NOONG] - broiled star anise flavored pork meat ball
307) Tre Hue - [CHE HWAY] - pickled head cheese wrapped in banana leaf
308) Tom Chua - [TOME CHOO AH] - pickled shrimp with shredded papaya

[ Drinks]

01) Ca Phe Sua Da/Nong - [KA FEY SOOH DA/NOWNG] - Coffee Iced/Hot
02) Nuoc Da Lanh - [NYOO DUH LUN] - Iced Water (free if you eat here)
03) Nuoc Tra Da - [NYOO CHA DUH] - Iced Tea
04) Nuoc Tra Nong - [NYOO CHA NOWNG] - Hot Tea
05) Pepsi, Coca Cola, Diet Coke, Dr. Pepper, Mountain Dew, Sprite, 7 Up, Shasta
06) Nuoc Suoi Chai - [NYOO SOY CHAI] - bottled water
07) Che Dau Do Bot Ban, Nuoc Cot Dua, Dap Da - [YEH DOW DOH BO BUN, NYOO KOH ZOO UH, DUP DUH] - red bean, tapioca, coconut milk, crushed ice
08) Nuoc Da Chanh Tuoi Vat - [NYOO DUH CHAN TOOEE VUT] - Freshly Squeezed Limenade"}
{"text":"Beside my parent's, this is probably one of the most authentic bun bo hue I have eaten here in Arizona. It's is so good. They give you an option of different spicy levels.   For a small bowl it is 5.50. Cheap and yummy! I need to go back and try more of their yummy food!"}
{"text":"I really love Vietnamese Food and this little restaurant is easily a favorite of mine. Cuisine from the Hue region of Vietnam is a little different than your typical soup places. No Pho here ... so get ready.

The owner is really cool and extremely helpful. It was fun on my first visit. She wanted to make sure I understood this type of cuisine and how it should be eaten. They take great effort to make sure the food is packed full of flavor and beautifully presented at the same time. Nice!

So far I have tried several of the soups and a good sampling of their tasty bite sized appetizers. Bun Bo Hue - Spicy Beef SOUP is a good place to start. The Crab and Shrimp versions are also excellent as well as the Duck. They have some really good specials during the week that will fill you up cheap. Just ask her and she will tell you what is good.

Located in the Mekong Plaza Food Court. The eating area here is pretty basic with a dozen or so community tables and chairs. Just kick back and enjoy yourself and pretend you are on a vacation adventure. It usually works for me. DID I HEAR SOUP?

4.75 STARS"}
{"text":"AWEFUL SERVICE!!!
POOR ORGANIZED!!!

Came here for the first and also the last time. I waited for 30 minutes but still didn't get my food. I had to leave so I came to ask them and saw that the same order after mine came out first. They gave me ridiculous excuses that didn't make any sense. The food was not good but not too bad.
Never again!"}
{"text":"No MSG is always a plus. And this is one of the better bun bo hue that's as good as homemade. But they go cheap on everything. Little bit of veggies, super thin slice of lime, and one napkin. And when you ask for another napkin they give you ONE extra sheet. Thanks I guess haha. Prices are good though, you won't pay more than $7 for a bowl."}
{"text":"OK - *six* stars now!  I've only recently become aware of the harmfulness of MSG, and this place does not use it, and that is very rare in a Vietnamese restaurant.  Does anyone know of any other Viet rest's in the state that don't?  If so, please pm me and tell me.  

Asian Cafe Express, Chinese - but they branch out into other cuisines as well -across the street, also does not use MSG."}
{"text":"Pretty good for viet food in Phoenix. I've only had BBH (please don't call it pho...completely different flavor profiles with different origins, different spices, different stocks, different noodles, different herbs, etc. ok done with mini rant) but will be back to try some other dishes.  Flies in the dining area though so get ready to swat, especially if hot outside."}
{"text":"Although this Vietnamese dining spot is in a food court - in Mekong Plaza -  the quality of the food is excellent. The ingredients are really fresh and the dishes are well prepared and delicious. For the same (low) price you would pay in other Vietnamese dining establishments, the food you get is of higher quality. There's also a rather wide variety of dishes to choose from, considering that it's in a food court setting. The owner is very friendly and I appreciate her help in understanding what the unfamiliar dishes are. I would have given this five stars if it were in a full restaurant setting rather than in a food court atmosphere with a shared seating area."}
{"text":"They have improved a lot from time to time. Excellent for the variety of their food with decent prices. This place has been a regular place for me once a week now."}
{"text":"So since I was out shopping by myself, I thought I would take advantage of the situation and get some breakfast that I normally do not get to eat. So I went to Mekong Marketplace, the SE Asian market center. Wandered around a little and decided to eat at Hue Gourmet, a Vietnamese little joint. I had the Bun Cha Ca (rice noodle soup with fishcake) and an order of 4 Cha Go Tom (pork and shrimp egg rolls). The egg rolls were very good and not too pricey. But the noodle soup was a little disappointing. The noodles were squishy and overcooked, the broth was weak, the veggies were sparse, and the soup had tomatoes in it! Maybe I am ignorant, but I never had Asian noodle soup with tomatoes in it before.....but after doing some research, I found out that this soup typically does have tomatoes and a tomato based broth. The fishcake was \"different\" -- not the typical Asian fishcake you get in most noodle soups. And they gave me a little container of chopped chilis which I dumped into the soup. Big mistake -- they were chopped Thai chilis and now both my mouth and my asshole are burning!!!"}
{"text":"Open pretty early, good for all time meal, like the broth, very rich. Fried spring roll is not that impressive though."}
{"text":"This place has a phenomenal Bun Thit Noung and for the love of all that is holy add the egg roll for a buck, it is totally worth it. The greens blend is very nice not just lettuce. Their nuoc mam is spicy like most hue style food, so heads up. I highly recommend giving them a try."}
{"text":"I'm usually not a fan of pho or noodle soup but when me and my man was hungry for breakfast and they were the only ones open, we had no choice but to go and explore. I couldn't remember what's the name of what I ordered but it had crab cakes on them and it was tasty. I actually love the broth. The waitress/cashier was very very very nice and attentive and even told me what to mix with what I ate. I guess she's the owner as well. The other servers, the old ones though, I think doesn't speak English, which was sort of a downside but not really. Anyway, nice food, superb service (of the owner), will be back again."}
{"text":"The Bun Bo Hue was great. 

However, not the best place to bring family to eat. There were flies all over the place. Best if you take out and eat someplace else."}
{"text":"The most authentic Bun Bo Hue I have tasted thus far (compared to the ones in Vietnam). The spice level is also adjustable to your liking on a scale of 1-6. I got a 3 and it was spicy, but not too bad. The veggies they brought out were fresh and abundant. The only downside was the amount of meat given. I got a small and it seemed like I only got one of each \"topping\". One pig knuckle, one pig blood cube, 1 or 2 small slice of boiled beef shank. The meat to noodle ratio is way off. If I would have known, I would just pay extra for more beef shank so I don't eat plane noodles with their delicious broth. I can't wait to come back and try other dishes like the bun rieu and bun cha ca!"}
{"text":"This place has great prices, great food, and unique menu items.  The staff is not great but the food makes up for it.  If you want real, authentic, non Americanized Vietnamese food, this is the place to go!  YUM!"}
{"text":"Not Vietnamese, Not even Asian, but this place was really good to my inexperienced tongue.

Affordable, plenty of menu options, and friendly service."}
{"text":"I tried combination plate \"bánh bèo, bánh nâm, bánh bôt lôc and cha\" bánh bèo taste good.
Bún Riêu so good. Customer service so nice. Will come back again"}
{"text":"I usually come here for BBH (bun bo hue). It's not that bad. There's usually a young guy that works the front. Today there was a little girl and some older ladies working. Service today wasn't bad, it was terrible. She charged extra for everything. I understand extra noodle would be an extra charge but with extra noodles they skimp me on the meat. We asked for more lime = $.50, extra shrimp paste = $.50, she didn't even want to give it to us. Only one pork grind per chen of banh beo. The soup was not spicy today. I was gonna ask for chili but she'll probably charge me another $.50 lol We will no longer come back here. Horrible service especially on Chinese New Year. If you come here, just remember condiments are not free. Smh
Btw, there was a guy that came up while we were ordering and asked for a to-go box. She didn't want to give it to him. She asked him why he wants it."}
{"text":"I was so thrilled to find the food court at Mekong Plaza. Cheap, delicious, and quick comfort food? What more can a hungry(and economically challenged grad school student from SoCal) ask for?!?!

This place has some pretty authentic Central Vietnamese cuisine (where the city Hue is located). I've been here twice, but I will be back and update my review because I do want to try their ENTIRE menu HAHAHA. 

Bun Bo Hue aka spicy beef soup (4.5/5) So good! The noodles were a tad soft for my taste but everything else was on point. The spiciness was spot on. The amount of meat was sufficient. The taste of the broth was authentic.  The veggies were just like how my mom would served it with. BBH is my favorite item here! 

Banh Bot loc aka sticky cake with shrimp and pork (4/5) they were 10 for $5. They're a lot smaller than the ones I'm used to in SoCal, but the taste was just as delicious. MMM MMM

Bun Rieu aka crab cake noodle soup (2.5/5) This was just oookay. The soup was tomato-y and yummy. But they didn't give that much meat and noodles. 

Overall, I wouldn't say it's the best Vietnamese food I've ever had since I lived in Vietnam. BUT it's pretty high up there on my list of decent Vietnamese eateries in Arizona! And did I mention the food is dirt cheap here?!?!?"}
{"text":"I had their bun bo hue a few days ago and enjoyed it!  The dish was delicious and hit all the right notes of what I expected (spicy broth, pork blood, hock, and cuts of beef, and decent fresh vegetables).  They have complimentary tea, but I forgot to ask if they had ice!  Iced water/tea would go great with the spiciness of the bun bo hue.  I have not had bun bo hue at other restaurants in Arizona, but I have had it many times at Westminster, CA and have few complaints about the dish."}
{"text":"Wish there was more in this plaza to get my Hue fix.  We come back here because the food is decent, not great.  But the service is bad.  They should smile more and not walk around like zombies, dropping food at our table and when I ask for extra plates or spoons, they just walk away.  They take forever to bring water out when we ask for it.  Just not a warm environment."}
{"text":"It is SOOO hard to find food from mid-Vietnam region (Da Nang and Hue) here in Arizona. This place has My Quang which I have yet to try but looks good. The Bun Cha Ca was decent. All the banh dishes (banh beo, banh khot) tasted great but came in small portions. The service isn't super warm but that is more of a culture difference and doesn't bother me!"}
{"text":"This place was authentic according to my wife who's mom us from Hue. She said it was the best bun no hue she's had so far in Phoenix. I had the bun rieu, and it was good, but have had better. The egg rolls were a little disappointing, but not bad. I loved the feel of the place; out in the open in the middle of the market place.

Our second trip here - not as good. Seems there broth recipe is inconsistent (referring to the Bun Bo Hue). Was still ok, can't go wrong with the price."}
{"text":"So when this place first opened it was pretty good, but now the quality and service has gone downhill and I will not be returning. I love Hue food and refuse to eat mediocre Hue food or support a business that do not value their customers enough to keep the quality the same or try to improve their quality."}
{"text":"My girlfriend and I were shopping at Mekong Plaza for the second time together and, after having tried one of the restaurants on our first visit (see our review of Deer Garden Signature from 9/24/16) we decided to check out the food court.
We shared a bowl of Bun Rieu Cua, which is noodle soup with pork spare ribs, meatloaf, crab paste, tofu, blood cake, and veggies.
The portion size was plenty for the two of us.

First, and most importantly, the broth was excellent with good depth of flavor. I suspect that including a greater number of ingredients in the soup does positively contribute to the flavor of the broth, however we felt that this broth could also stand on its own quite well.
All of the ingredients were flavorful and properly cooked, which is especially important when it comes to the blood cake since many uninitiated diners may be a bit hesitant to try this.
My girlfriend, who is a native of mainland China, said the soup was \"Very yummy, if you know what I mean ;-) ;-)\"

There are as many as five Vietnamese restaurants located in Mekong Plaza, we've tried two of them thus far (the other was Binh Duong Quan - see our review from 11/6/16), and this our favorite of the two.

Prompt, courteous service, reasonable prices for a mall restaurant, and a nice place for lunch.
We will definitely be back.

Photo design by Billie Z."}
{"text":"This place has really good bunbohue. It tastes about the same with what I used to have in Vietnam. I will definitely come back here with my family!!!"}
{"text":"Fresh, flavorful, cheap, and made quick.  While the menu is limited here, this allows them to specialize more in those certain items, and as a result the dishes are excellent.  The food here are a bit more esoteric than those you might find at other Vietnamese restaurants.  For instance, the dish I had was something I had never even seen on a Vietnamese menu in the US, and um... sorry I don't remember the Vietnamese name of what it's called, but it was labeled as Clam Rice.  It had a veggie component and a rice component with meat and nuts.  When it came out to our table, the presentation was beautiful due to the combination of colors and textures.  The entree was excellent and was the right mix of crunchy, sweet, salty, tangy, hot, and cold.  They packed a lot of flavor in that seemingly simple dish, and I will definitely be coming back here to try more of their entrees!"}
{"text":"This is the best Hue' restaurant that I love so far. I ordered the grilled pork and rice vermicelli this time. They are fresh and well cook. Highly recommended for anyone want to try Vietnamese authentic food. I am loving it!"}
{"text":"My favorite is the 201 it has good meat in it and if you want it pretty spicy just get one scoop of  Hot Chillys anything more than that it's unbearable"}
{"text":"I wouldn't consider this gourmet, but then again when I went to Hue in Vietnam I didn't have any gourmet style food.   Maybe I don't know what I'm talking about.  I can appreciate the authenticity of their food here.  Though I can't say I'm a big fan.  The taste just doesn't hit me with enough bang! The food was okay, but I must give them props for service.  I enjoy trying to speak Vietnamese and the server trying to teach and encourage me to speak...haha.  Yes, I'm still learning ..... Having it right inside Mekong Plaza is a big plus for this restaurant.  I just wouldn't know how it would do elsewhere. - enjoy!"}
{"text":"This place is good. The only thing about it is that the service could be better and the wait for your food is long, which is what I dislike about it. There was only one family ahead of my boyfriend and I and we waited for awhile. When I was here with my family, it took an hour for us to get our food."}
{"text":"How this storefront manages to average a 4 star rating is beyond me. Here's why:

1) The food isn't very good
2) The service is awkward and timely
3) Sanitation is lacking, seriously ... 

Tbh, I was so excited to find not only Vietnamese food here in the Grand Canyon State and even more so when I found out there was one specialized in Hue cuisine. I've personally been to Hue in Vietnam and it does have it's own regional differences among the various regions and cities of Vietnam. The food here doesn't even come close to that kind of authenticity or quality.

I ordered the Banh Beo, Banh Xeo and Bun Bo Hue to try a few of the most common things to eat. 

Banh Beo- these little steamed rice cakes come in little sauce plates, topped with shredded shrimp and pork cracklings. It comes with a fish sauce for dipping. Their cakes were too thin, the shrimp garnish was pale and the cracklings were minimal. The sauce was way too diluted, but slightly sweet. 

Banh Xeo- some may call this a savory Vietnamese pancake or crepe. Made with a rice batter of coconut milk, rice flour and tumeric. Then stuff with pork slices, shrimp and bean sprouts. This dish really surprised me, the Banh Xeo was over cooked, greasy, too crunchy and tasted like bacon. The cashier even mentioned they were out of mushrooms for the Banh Xeo and that was questionable as it isn't supposed to have mushrooms in it at all. The Banh Xeo was overstuffed with bean sprouts, minimal pieces of pork and undercooked shrimp with tails still on. They didn't provide many herbs and one piece of lettuce came with it. Total let down.

Bun Bo Hue- a complex flavored, spicy noodle dish. This dish could use a bit more work, a bit diluted, broth needed more flavor and complexity. The only flavor I got from this dish was spiciness from the oils and broth. I had to garnish a lot of shrimp paste and lime to get this one to a decent level. Props to them putting pork blood cubes in, but the beef slices was so chewy and tough. The side dish with veg for this was lacking, a minuscule piece of lime, some banana blossoms and deteriorating basil. No balance in flavor and where's the lemongrass?

I was seriously upset not only emotionally, but my stomach hurt the whole time after!

Besides the poor flavor and quality of food, just poor sanitation all around. There were flies everywhere flying about my head, landing on the table, on the food! It was gross. You can even tell that there is poor sanitation by looking at the storefront, fridges and open kitchen. The cashier was very awkward, we paid him $100 and he said he would give us change when our food was served ... what? In between serving our food, he would also go back to a table eat some of his meal and head back in the kitchen to get the rest of our food, without hand washing to be seen. Never coming back here, ick!"}
{"text":"Hue is a very fun place to stop in for a casual meal that offers more than what you're used to at your typical Vietnamese pho spot.  It's basically set in the food court of Mekong Plaza and you'll order from the counter using the menu and photographs of items before sitting in one of the few simple tables just a few feet from the counter.  When we were there, the counter server didn't speak a lot of English, but did his best to explain any items we questioned and came out multiple times to refill our small beverage cups.  

What the place lacks in atmosphere, it makes up for in bang for your buck.  When we were there, we tried the banh beo, tiny rice cakes that slid into your mouth or onto a spoon in a single round piece from a circular dish - one order came with a dozen tiny dishes!  We also had the banh loc la, clear, chewy pillows of tapioca flour with bits of crispy shrimp inside, and the banh gio trung cut, a pyramid-shaped pocket of dense rice with wood ear mushrooms and what tasted like seasoned sausage inside (reminiscent of the banana leaf wrapped rice pockets you see at dim sum).  We weren't impressed by the cha gio tom, or egg rolls, but my husband loved the com tom nuoc cham (broken rice with pork) which was served with tomato and cucumber slices and a bowl of broth.  The pork was tender and flavorful and this dish is easily accessible to diners who might not be willing to try some of Hue Gourmet's less familiar dishes.  We can't wait to get back and try more of them!"}
{"text":"Fantastic! It's hard to find great ethnic food in Phoenix, but this is one of them. I met the owner, Lan. She even took a minute to sit down with us while we ate. She told us she gave up a great engineering job to do her love, cooking. She's a smart lady. First off, the place is CLEAN! She was proud to tell me about the extra steps they take to not cut corners to make sure everything is Fresh.

I let her choose what we ate, which was Bun Bo Hue, a spicy beef soup to die for! Next was a steam bun filled with pork and egg. OMG, I ate 2 of them, and they are huge! Next was spring roll, and even though I'm not a huge fan of spring rolls, these were super fresh and flavorful. 

The bill for 2 of us, stuffing our faces, was $16. Now don't be put off, the place is in a huge open market with general seating, but it's very family friendly. Not to mention, a few other shops to try out there. Very different experience from the everyday."}
{"text":"I ordered #204 Duck Soup. The entree came with lots of duck meat and cabbage for the soup.

I added chili oil to my soup of course to give it extra flavor and a kick. I might have put a little too much chili oil in it! The broth was steaming hot and delicious!

It was only $7.95 for a big bowl of soup.

They are known for their bun bo hue. Which is beef and pork soup. I'm not a fan of pork so not my first choice.

Hue Gourmet is located in the Mekong Food Court."}
{"text":"As close to Califorrnia's Hue restaurants as I am going to get in Phoenix. Though it's really on a different scale all together, I still enjoy Hue Gourmet. They've really improved since they've opened. I'm glad their business has picked up. They offer a wide menu for a little food court joint. 

I particularly like their Banh Loc and their take on Mi Quang. Their other soups are good but on some days can be too sweet for my taste (Bun Bo Hue). I want to try their Duck Noodle Soup next. It seems to be a crowd favorite."}
{"text":"The Bun Bo Hue was okay.  This is a food court area.  Do not expect much for atmosphere."}
{"text":"Located in Mekong Plaza with one of the best Vietnamese restaurant which serves the local delicacies found nowhere in Phoenix.   Bun Bo Hue is handcrafted by chef who is actually from Hue herself so she knows exactly how it should be prepared for this dish that gain worldwide recognition.   If you don't mind eat in an open cafeteria setting,  this is right for you.  May be one star off for the flies around the Cafeteria  which is being shared by other restauranteurs."}
{"text":"This is probably the only authentic Central Vietnamese cuisine dining location in the valley. That's the way I see it so far I know. The former proprietor was a lady with Hue accent. She yielded the business to a relative who's doing pretty good so far. My favorites are all from Central Vietnam like mi quang, bun mang vit...so good, and bun bo Hue...indeed. If you want something different then rice with grilled pork is way to go. Beside they serve banh gio (steamed stuffed dough)..yummy, nem chua (cured ground pork) which is good as snack or as a meal. And they serve other dishes too."}
{"text":"This place has some fantastic food.  No MSG, no corn starch, just simply the food with no fillers to bolster the flavors.  Just enter Mekong Plaza through the northern most doors and walk directly back to the food court.  You practically walk right to Hue Gourmet.  Don't let the food court atmosphere fool you.  The food here is quite tasty and the owner is happy to tell you all about the food and how they prepare it.

I have been here on several occasions for foodie lunches (got to try a lot of different things) and lunch with friends.   I've gone here for lunch most days and I'm partial to the Banh kahn cua.  I recommend this place for folks who enjoy food!

Return Potential:  90%"}
