{"text":"???????. ?? ?????????????????????????9????10??????????????????????..????????????????? ????\"??\" ?????26????26???15??????????????????? --ASG???"}
{"text":"I wanted to like this restaurant, considering it is almost right next door to my new job.  However, after lunch this afternoon, I will not be coming back.  On a positive note, the interior is clean and the staff friendly.  The food unfortunately is another story...

I picked up a sweet & sour chicken combination with fried rice and vegetable egg roll.  The chicken looked like the mystery meat fried chicken pieces that you would find at any other mediocre Chinese establishment.  I thought it would be at least average, but was wrong.  The chicken had a hard chewy consistency and the sauce was bland.  The weird thing about the sauce was that it tasted like sweet and sour, but smelled like hot wings (very odd).  The vegetable fried rice was also very bland.  It taste like regular white rice with a few vegetables mixed in.  The eggroll was not bad, but not great either.

I think these Chinese restaurants order food from the same supplier.  Seems like it is very hard to find great Chinese made with quality ingredients.  If you are in the area, I would recommend checking out Peppermint Thai."}
{"text":"Great place to go for some chinese. You always get more than you need so expect to take home leftovers!"}
{"text":"This is a hidden jewel in Solon!  Very inviting space and staff, with exceptional food.  Love the vegetable tempura as an appetizer.  There is a wonderful chicken-beef-shrimp lo mein -- out of this world!  Love the spicy Hunan dishes.  Nothing great on the outside (strip mall), but it's well worth it once inside!"}
{"text":"There is this one waiter who is not Chinese and does not offer a free rice refill he is the downer and the let down in the restaurant he charges you 3.00 extra for a bowl of rice. The other waiters are nice and gives you free bowls of rice but that waiter has the worst attitude and mumbles impolite and unkind words at guests. Be careful not to ask that waiter to get you a rice refill."}
{"text":"Great Pot Stickers. My kids love them. Very clean with good service. A new favorite."}
{"text":"In US you don't find many good Chinese restaurants. I'd say Hunan Solon is good enough for those who'd like to try Chinese food in Cleveland."}
{"text":"If this is the best the area offers I'm truly sorry for all of you - just one word - gross"}
{"text":"The food was delicious!  Staff so professional and the restaurant is very clean. Appe"}
{"text":"Great authentic Chinese food! Little pricy, but saved us 45 minutes of driving to downtown Cleveland. Food flavorful but not too salty. Bubble teas are in pretty tall glasses and not terribly sweet. My kids loved them!"}
{"text":"located in a small shopping strip.  doesn't look like much from the outside.  but inside, the interior is beautiful.  very modern, very clean.  not the usual gold & red decor that every other chinese restaurant seems to have (yuk).

my friend had the cashew chicken & i had the hunan chicken. both were awesome.  good sized portions and nice presentation.  my only regret is, i wish i lived closer !!!!"}
{"text":"This is the best restaurant ever my family loves it. This has to be the best restaurant in Solon. The restaurant is very peaceful and the waitresses and waitresses are very nice. The food is not to salty and the price is very cheap. This is the hidden gem in Solon."}
{"text":"We have been going to Hunan Solon for several years and the last couple times we're not up to their normal standards. I wonder if they have a new owner or chef ?
The food has tasted bland even when asking for medium spice."}
{"text":"I ordered two dishes from the Chinese menu. I wonder why this restaurant even survive?!

Lamb taste like beef.  The most famous Hanan dish ---- fish head tofu is horrible. Will not go again.  It is no better than any of the ????, but it is more pricy."}
{"text":"Some of the best sesame noodles I've had outside of sunset park in brooklyn."}
{"text":"Not your run of the mill strip mall Chinese food.

Great lunch specials and huge portions. Seriously, the dinner portions are enough for two meals. The service isn't always the best, but the food is always delicious and they don't charge you for hot tea.

Personal favorites include: General Tso's Chicken, wonton soup, vegetable fried rice, lettuce cups, and lo mein.

They will make the spicy dishes extra hot upon request (and extra hot means extra hot)."}
{"text":"We came here for lunch yesterday and I must say, we were pleasantly surprised! I ordered a bowl of wonton soup with noodles and my wife had the potstickers as an app. The soup was the BEST wonton soup I HAVE EVER HAD! The potstickers were delicious, too. My wife had sweet and sour chicken (also delicious with fresh veggies) and I ordered the General Tso's Chicken. Again, fantastic food! This was our first time here but I can promise it won't be the last! We had wonderful service from our waitress Jennifer \"Lopez\" Hee. She was worth the price of admission! I highly recommend Hunan of Solon if you love good Chinese food."}
{"text":"Best Chinese takeout on the east side. Great dumplings and egg rolls. Other food is fresh and the portions are generous. The food is promptly prepared and reasonably priced making a great option for take-out. 
The restaurant is clean but not intimate. It is located in a strip mall and parking is plentiful."}
{"text":"It's an ok place to eat Chinese food.  They do serve pad Thai, but it doesn't compare to the real deal. The szechuan chicken isn't bad, it's probably one of my favorite dishes there, but I recommend getting it with some kick to it or else it's missing something. The general Tso's tastes like it is missing something and this dish too I recommend getting some level of spice. The restaurant is a very clean place and takeout is convenient and quick. It is a bit pricey but you get a lot of food. I also highly recommend being really specific on your order when you are calling in for take out. They are quick to take your order but they won't ask you how spicey you want certain dishes and what not. Just a heads up. Other than that it's an alright place to eat, but a little pricey"}
{"text":"We have been coming here for 20 years. The food is usually great and the service is speedy. 

We came here for Father's Day as this is my dad's favorite restaurant. It took them an hour to get our food. We talked to them about this poor service and they were extremely rude. They didn't do anything for us."}
{"text":"I would have to say if you want good Chinese food..............Go to Hunan."}
{"text":"Food was terrible, their Thai Fried Rice is not even close to what Thai Fried Rice should be. We ordered Pork item too and it was not tasty at all. We won't go back again neither would recommend anyone to go to this place, also bubble tea is just so horrible. The only thing that was good at this place was fortune cookie, seriously!"}
{"text":"Been coming here for many years first time I reviewed. This Chinese restaurant is a hidden gem in Solon west industrial area. I have never had a bad meal here ever !! My favorite is their egg plant. The service is fast and friendly. I have never been disappointed, give it a try !"}
{"text":"Delicious, high-quality Chinese food. I went for lunch, and the prices were very reasonable and the portions were just right.  Peking Chicken was tasty, crispy, sweet and spicy.  Also had a spring roll and the Korean spare ribs. I was impressed by everything."}
{"text":"Love this place.  Always so friendly and good fresh food.  Here is a hint, if you like Spicy and Authentic vs Midwest Chinese. Ask for the Chinese menu"}
{"text":"Food is good love the pad Thai here, also tried their Kalbi, this place is close to my job so on the weekends grabbing a lunch here is perfect, staff is kind. The location is good and inside the restaurant seems to be very well put together, their ice bubble tea not that great though but then again I am used to the normal bubble tea."}
{"text":"Ok, I travel A LOT for business and I rely on yelp reviews to determine where I eat. Today, I decided to try Hunan because I was staying at one of the hotel in the same area. Immediately upon walking in, I was greeted with \"pickup?\" Uh, hey, how are you tonight...needless to say, it was different. Usually I expect something along the lines of \"good evening, are you dining in or picking up?\" Or something. Anyway, I decided to try eating in. I noticed something right away that bothered me. Either they determined that I wasn't going to be worth their time or they figured other customers were more important. I wasn't asked what I wanted to drink (thankfully I don't mind just drinking water) and once I got my food I was completely ignored. No one ever asked me how everything was or anything. Finally, they check was just dropped on my table and no one asked me if I wanted anything else. I practically had to flag someone down to get a box. 

I would give the service (at least for a young, single, white diner) a 2, with the food a 4, though that's just for the entree...I wasn't a fan of the wontons in the soup. They were weird."}
{"text":"Pretty good Americanized Chinese food. They have a separate menu for real Chinese food on their website. I didn't try it, so I can't rate it. 

I had the Hunan beef and it wasn't bad. Not too greasy. It's beef mixed with baby corn, carrots, broccoli, and mushrooms."}
{"text":"Since I miss CA Chinese food terribly, their eggplant brings me home. Love the atmosphere and the people that go there are pretty great. The place is actually owned by Chinese nationals so YAY, sometimes I do ask them to make it a little more spicy for my tastes and keep more of the American style less out of my food, its a great place and my hubby and I go there after he gets out of school a lot. Great place to get that afternoon lunch :)"}
{"text":"Best Chinese restaurant in Solon for sure. There are some other great restaurants in China town. But I still love this one better. Because of its consistent quality and clean restroom. Lol. :)"}
{"text":"Not good as my imagine. The soup is bland , not delicious ,like many stuff mixed together . The corn fish does not taste good too. It is too bland without any flavor. 
The spicy pock garlic is not spicy, also we did not see garlic and pepper too. 
The vinegar  potato is too spicy. Maybe the chef is too busy to take care of quality. 
But the speed for them to prepare the dishes is quick. I do not think it represent Chinese food ."}
{"text":"Went here for a quick bite before a party for dinner. Szechuan tofu had a good flavor but the tofu was over fried but the vegetables were nice and crisp. Hubby had spicy red curry which he loved. Overall average Chinese food. Wish they had a vegetarian soup option. Would come back."}
{"text":"Great Chinese! Love the the wonton soup. Service is great everyone who works there is extremely nice. Would extremely recommend it!"}
{"text":"This is the standard by which I compare all Americanized Chinese food.

The food is essentially identical to Hunan Chagrin Falls. I'm not sure the details of the story, but they were related in one way or another - perhaps a shared chef, chef that switched, owners that parted ways. Something. Because the food is identical... and delicious.

It's the best fried rice I've had.
It's the best general Tso's I've had.
It's the best egg roll I've had.

The fried rice is one of those where the rice is white. For comparison, PF Chang's is a chain with similar fried rice. The rice is never overcooked and mushy.

I've been here many many times over the years with my family. The general Tso's is lightly breaded and fried crispy. The sauce is great, but is made fresh and served quickly such that the breading does not get soggy in the sauce.

The egg roll is very crispy and hot. The sauce that accompanies it in a dish is delicious. Definitely a knife and fork egg roll because of how hot it is, but SO good."}
{"text":"Best Chinese restaurant"}
{"text":"It's true that this is one of the best Chinese restaurants in Cleveland--but sadly, that's really not saying very much."}
{"text":"i feel sick from the sheer amount of grease that i just ingested, but god is it delicious. i'm also pretty sure their vegetable fried rice, along with everything else, was absolutely loaded with msg. i also got some sort of tofu dish, some noodles, an eggroll. i got it as take out but it smelled so good that i sat in the car and started eating.
it's a little bit of a far drive for me so i don't think i'll be back too often but if it were closer, i'd be there every week, which is probably just about enough time for my bowels to normalize after the subjecting them to the grease."}
{"text":"Great chinese for Northeastern Ohio and they also have good Thai curries.  Special Chinese menus for specialities.  Food makes good use of local producer, which might not quite be the ingredients called for in the original recipes, but still very tasty.  I've been 3 or 4 times, and the service has been consistently good, I believe the owner is usually on the premises."}
{"text":"I don't write reviews of places that often, but I'm honestly appalled at my experience last night and thought I might be able to prevent someone else from having to go through what I did. 

I went out to dinner with several of my friends and ended up at Hunan for some Chinese. Our experience started off quite poorly as we were standing at the host stand for about 10 minutes before being greeted and seated at a table. The service was a nightmare, as we were deciding what to order, and the wait staff came over about 15 times to ask if we were ready, right after we had told them we needed another minute. We finally placed our order, and the food took forever to come out. The food was fair, not like other times I had eaten here, but really poor considering we had to wait about 45 minutes for the food to come out since we had sat down in a relatively empty restaurant. But what really put me over the edge was the service at the end of the meal. The waitress gave us the checks, they were all in order, but she glared at us from behind the counter to make sure we were paying and to see that we were paying the right amount. Now I'm usually a very generous tipper, and will tip a good amount even if we have poor service, but there's a line that you just can't look past, and Hunan Solon crossed that line. We ended up paying exact with an extra dollar or two, and when the waitress came over to collect the checks she started YELLING at us that when you go out to a restaurant you ALWAYS leave a tip. I understand that servers live off their tips, but tips, especially 20% or more is for good, if not exceptional service. Not leaving us waiting up front for 10 minutes, annoying us while we were deciding what to order, and glaring to make sure we were paying and leaving a tip. I'm honestly appalled that the waitress had the audacity to start yelling at us about proper restaurant manners, which she had none. I would NOT recommend Hunan to anyone looking for a good customer experience with a wait staff that treats you properly."}
{"text":"The crispy ginger chicken is the best Chinese dish I have ever had!  Similar to generals chicken- but with a lot more flavor! The decor is bright and clean, and servers are friendly.  It is not a 5 star restaurant, but it is when comparing to other Chinese restaurants in Cleveland."}
{"text":"Strip mall?  Okay, we were hungry.  REALLY hungry.  Checked out the mobile Yelp reviews, stopped in and were amazed!

Quality, quantity, service.  Everything was great.  They bring you one menu if you are an Ugly American (yeah, I'm looking at YOU, face in the  mirror!) but you can ask for the REAL menu, the Chinese one.  Don't worry; next to the Chinese symbols are English symbols.  I mean letters.

Fortunately, I was in the company of two Asian women, so I was welcomed by proxy into the inner sanctum of the \"other menu.\"  Whoa.  Every previous post has covered this already, but trust me:  it is so, SO good, on all levels.

My fortune cookie summed it all up:  \"Things may soon get much, much worse.\"  And my lucky numbers?  Blank."}
{"text":"This is the most authentic Chinese you can find in this part of town. I'll let you in on a secret shared to me by a foodie friend: they have two menus.

The first menu is the American-Chinese menu for the general public.

The second menu is a secret menu (shhh, don't tell anyone). The password for this to say: I want the  \"Traditional Chinese\" menu, for those of us who want to eat fish and shrimp with the heads on or food with eyes staring back at you. It's not for the faint of heart and only for hard-core Yelpers."}
{"text":"Staying directly across the street at the Homewood suites. Don't let some of some reviews scare you. This place is nice, clean, and serves authentic fresh food. Very tasty. 

Ambiance: Picture do not do it justice. Bright, tasteful decor. Clean. Not your typical dingy diner type Chinese joint. Almost a bit upscale. No gaudy Chinese decorations. Jazz playing overhead. Family run: patriarch runs front of house, and even has little girl sitting in booth, quietly doing what looks like school work.  

Service: surprisingly good. Everyone pitches in, so the entire meal, from ordering to boxing up leftovers, is seamless. Even the patriarch at front of house pitches in to make the dining experience pleasant. 

Food:  remarkably good. Like really good. Seriously. Spicy Tom Yum soup is out of this world good. Broth has a nice spice level and is very flavorful. My wife does not do much spice, but it was so flavorful, she sampled it several times. Has considerable shrimp in it. All the veg is freshly added, and not cooked with the soup.  I'd come back just for this soup. 

We ordered vegetarian egg rolls. Again, a very fresh flavor. Not your traditional bean sprout filled egg roll, which I like, but nonetheless very good. 

We split an entree. The general tso chicken. Broccoli very fresh and only slightly steamed. Nice and crisp. Sauce is authentic; not a modified sweet and sour. Properly cooked chicken. 

Overall, very authentic/ very fresh. I like this place. More like 4.5 stars, but I round down."}
{"text":"This is not your normal Chinese restaurant. Food was high quality and well prepared."}
{"text":"Decent food but leaves a lot to be desired. I'd stay away from the Thai food."}
{"text":"My family and I just moved in the neighborhood and wanted to find a local Chinese restaurant which this one came recommended by a friend.  We typically order enough good so we have leftovers for lunch the next day.  

Me and my wife ended up getting sick half way through the meal and had to through all the leftovers out.

The egg rolls were extremely greasy and the sesame chicken should have been labeled sesame breading.

I don't know if we caught them on an off night but we will not be coming back.  Hunan east on Richmond road across from Richmond mall is twice as better for half the price."}
{"text":"Cheap and Delicious!

They have really great dishes there. I usually do the Hunan or Szechuan Beef or Chicken, so what I get is usually pretty much the same, but I love it! Also, friends I go with love what they get, and it's usually pretty different from my stuff. In fact, one co-worker upon hearing that we're going back to the restaurant exclaims \"HUNAN HUNAN HUNAN!\". Very fun to watch.

The restaurant itself isn't much to look at as the other posts say, but it's a great deal and is fast at lunch (except for the check for some reason). Anyway, I'll be back there soon, see you there!"}
{"text":"Having spent three decades living and travelling in areas of heavy Chinese populations in both Asia and along the West Coast, I have never been a fan of the Chinese Restaurants here in Cleveland (in fact, typically avoid them).  Hunan in Solon is clearly the dramatic exception!

The food at Hunan is authentic - not just \"close\".   Full of marvelous flavor and character, I particularly enjoy their barbecue spare ribs (appetizer, $7.00), Cantonese-style roast duck ($15.00), and choy sum with oyster sauce (requested, off the menu).  Of course their menu offers the complete \"standard fare\" known at area Chinese restaurants but at a far better quality.  For the more adventurous, some of Hunan's more flairful entrées include Singaporean Chow Ho Fun ($10.00), Tangerine Beef ($12.00), Lamb Scallion ($12.00), and Beef Yau Tsoi Portabella Mushroom ($13.00).

The interesting thing is Hunan incorporates other Asian palates into their menu, including Korean (like the spare ribs appetizer I mentioned) and Thai, such as fresh spring wraps and a complete line-up of Thai curries available in 9 meat/seafood/vegetarian selections.  I would estimate their offerings weigh in between 75% Chinese and 25% other Asian.  Typically this is a dangerous premise for a restaurant to attempt - but Hunan's execution of this diversity is flawless and spot on!

The cost ranges from average to a shade under pricey for the less mainstream, more exotic items in regard to the price-to-portion ratio.  However, once you sample the cuisine you will quickly discover you are clearly getting what you pay for.

The restaurant is located on the industrial side of Solon, easily accessible south of 422, across the complex of small hotels.  Use caution: it's relatively small and insignificant-looking in the small strip mall it's situated in and can easily be overlooked.

Some may criticize that Hunan is still Americanized or Anglo-Chinese.  True.  It is important to keep in mind this is the best Chinese Restaurant in the area but it must still cater to the NEO palate.  Personally, it is not 100% what I'm used to in Singapore, Honolulu, or San Francisco but for Hunan to mimic that level of authenticity and expect to stay in business in NEO would be unwise.  On the positive side, Hunan Solon has successfully bridged that crossover well enough that Chinese dignitaries we host have made repeated requests to dine here. (An alternate menu is available for Chinese readers.)

Best Chinese Restaurant in Northeast Ohio?  Hunan Solon is without doubt a prime contender for that title."}
{"text":"Best Chinese in Solon! I've loved everything I've ordered and frequently go for lunch or dinner. They have a unique slightly sweet cinnamon egg roll sauce that is delicious. The cracking rice/corn soup is amazing, and the portions are generous, even at lunch.
The wait staff is attentive, and the food arrives quickly. I frequently go at lunch time, and there is never a wait (a rarity in Solon) and their lunch specials are reasonable ($6 and $7 entrees). The decor is really pretty and upscale as well, a great place to take clients.

I've even heard people come in, describe dishes that are not on the menu, and get what they ordered. Takeout is available as well.

The only downside is that this place is a little hard to find (off Aurora Rd, near the movie theatre/KFC/Slam Jam's/Srta Bonita's)"}
{"text":"I've been here numerous times. Quick service, great services, and clean. The last couple of times I've been very disappointed though. The Sesame noodles was terrible, I ended up throwing it away. The Panang curry is nothing of the sort, no coconut milk, no peanut flavor... it was a flavorless broth with red pepper flakes in it. My favorite dish is the Thai fish, I'll be sticking to that from now on. Also not so interested in tomatoes as a part of my vegetables..."}
{"text":"Food isn't that great; weird salt distribution and very Americanized Chinese food. Maybe to non-Chinese the food is good."}
{"text":"The food here is pretty good. I usually get lunch take out at work. One of my favorite things is the soups. Both the hot and sour soup and the tom yum soup are great. Their portions are large and they're lunch prices are fairly low. The lunch prices do seem to creep up over time. Their noodle dishes or ok. Their fried rice is different than I've ever seen. The rice is stil white and seems like it's probably only fried for a very short amount of time and then some mixed vegetables thrown in. Kung bo and szechuan chicken are some of my favorite dishes. 

One word of caution, at most Chinese places the general tso's checken can always be counted on to be about the same and a safe choice. The flavor of the general tso's here is good but it's weird pieces of chicken almost like mystery meat. I prefer to stick to the non fried chicken dishes."}
{"text":"Have been coming here for years. Just got back from San Francisco and missed chinese food in Cleveland. Great food and fantastic service. The  spinach potstickers are amazing. Love the eggplant ho fun   People are friendly and attentive. You will not be disappointed."}
{"text":"I've heard many people rave about this place so i decided to drive 30mins out to check it out. First, if you like authentic asian food, get the Japanese Soft Tofu with golden mushroom and pork (from the 'asian' menu). 

Wonton Soup (3.5): many yelpers raved about the wonton soup here so i had to get it. the broth. The broth was better than other asian restaurants but it tasted like water with some soy sauce. Now, the part where i know why people love it is because for once, there's actually substantial meat in the wonton and it's NOT just wonton and soup. there's cabbage, scallions, etc.. it was actually your typical chinese soup. Given all that though... it wasn't an authentic wonton soup that I used to get back in Taiwan. 

Japanese Soft Tofu with Golden Mushroom and Pork in Oyster Sauce (4): I got this off the 'asian only' menu and i cannot tell you how much I appreciate chinese restaurants that have japanese soft tofu (i usually call them egg tofu). the only other place in cleveland that I know has this tofu is Wonton Gourmet's Jade Tofu (a MUST TRY). Anyway, i loved this dish. It was a bit salty and not entirely authentic tasting but it was worth getting. i'll be back for it.

Twice Cooked Pork (3): This is a very authentic dish back in Taiwan and sadly, hunan solon didn't make it well. Don't get me wrong, if you don't know how it should taste like, you will love it. But if you know what it should taste like, you'll find hunan solon's too sweet and the pork is sliced wrong. Twice cooked pork should not be ground pork but slices of pork. Either way, the flavors were there... it just wasn't twice cooked pork."}
{"text":"Best restaurant in town. Great service, food and atmosphere. Vegans and vegetarians will find a good amount of dishes."}
{"text":"This is a good place to go if you are getting a little tired of the Anglo-centric food in the area and are looking for some spice. 

The amount of food is HUGE. Seriously. I made 3 big meals out of 1 order of the Empress Chicken and I am an eater. It is almost ludicrous. 

As far as a the quality- it is delicious. 

This is a little gem in the heart of an Industrial park."}
{"text":"I do not get all the negative reviews.  I actually miss this place.  We lived in the area for 13 years and this place was close to where I worked.  I always ordered the Garlic Chicken, extra spicy and the hot and sour soup. The main dish was quality chicken with really fresh vegetables and the soup was perfect hot and sour.  They were always friendly at pickup and I always tip for to-go orders.  My company doesn't fly me out any more and I haven't been in a while, but seriously, I hate the word bland!  Use a more descriptive word PLEASE!"}
{"text":"We come here twice a week! The staff is amazing and super accommodating- My fiancé is vegan and the staff knows this and will warn me when I order something that I think is vegan but has something in it. There is an older guy who usually is the host-he cracks me up because he wants you to have a great experience- if my drink gets half full he will yell at someone to fill it up. There is a lady who seems like maybe she's the manager- she is awesome, too. She will come over and chat or grab a refill if needed. The food is great. Good portion sizes for the price. My favorite is walnut chicken, it's breaded and fried with a sweet honey sauce. It's usually pretty quiet, I think cause most people get take out."}
{"text":"Typical Chinese restaurant with a very big menu. Lots of choices but my meal was underwhelming. I had the General Tso Chicken. It was marked on the menu as hot. I like hot, but not too hot. It had NO heat at all. I think the peppers were added at the end for show, not for flavor or heat. Overall, the meal was bland."}
{"text":"I was told this is the best Chinese in Cleveland and it probably is, but when you are use to west coast Chinese, it is par for the course.  I had sesame chicken, fried rice, soup and an egg roll to go and took it back to the hotel.  So, I only experienced the front counter and the food, my thoughts:

The guy at the counter carried on a 10 minute conversation while two people waited in line.  He nicely apologized, saying it was an old friend.  It was mildly frustrating, and the lady behind me got angry.  

As for the food, the chicken was soggy, and kind of bland.  I realize I took the dish to go so the sogginess is whatever, but I only ate 1/4 of the ample serving because honestly it wasn't that good.  The spring roll was typical.  The winner, the hot and sour soup.

I have had better (not in Cleveland) but I have had worse."}
{"text":"On my quest to find really great Chinese, I stopped in Hunan after the recommendation of several Yelpers. I wasn't disappointed.

Nestled in a strip mall, Hunan has a nice, colorful vibe inside. That vibe is perfect because you can legit also eat your colors at Hunan. All of their entrees are loaded with fresh veggies, which I loveeeee. I can tell my new go-to here will be the green curry with chicken, which is super hearty and flavorful. However, ask for it mild- because otherwise, it will be HOT. Learned that the hard way tonight, but still enjoyed it. My guest and I also split an order of the green beans, which are covered in a delicious homemade garlic butter sauce. They are addicting beyond reason. We also tried the shrimp in garlic sauce, which also proved to be a generous portion with big ol' shrimps and a nice, subtle flavor.

Oh, and the service here is fast. Like really fast. Even if it's crowded, you won't have a long wait. The atmosphere is welcoming and upscale, making it perfect for any type of meal. Definitely worth checking out!"}
{"text":"Every time I'm in Solon for work, I eat at least one meal here.  They have the best wonton soup I've ever eaten & the entrees are huge (I can turn it into 2 meals).

The wontons in the wonton soup are huge.  And there are 6 of them.  The broth is very tasty & is full of little pieces of cabbage that add more substance to the broth.  Fantastic.

I usually get a Hunan version of chinese entree.  This last time I got the Hunan shrimp - medium heat.  There were plenty of BIG shrimp in the dish, good baby corns & carrots, etc.  The seasoning was tasty.

You can order carry out & they will have your meal ready in 10 minutes, or you can dine in.  Either way, you'll get a chance to stand next to their lobster tanks, which are situated by the front door.  Always a treat.

They have a very nice, modern dining room with wait staff.  This is an upscale Chinese place.  Next time you think of going to PF Changs, go here instead & support the local economy."}
{"text":"This place completely blew my mind.  Who would've known that there would be an authentic Chinese restaurant tucked away in a strip mall in some random industrial suburb of Cleveland, next to a longhorn steakhouse and a KFC?  We came here last week and it was so good that we came back again this week (yes, it's a half hour drive from my place).

The place gets a surprising number of Chinese clientele.  It seemed like all the Chinese people in Solon were there.  They also have... erm... very Andy Warhol-esque pictures of Asian vegetables on the wall.

They have an \"authentic\" menu and an Americanized menu.  If you look Chinese they will automatically give you the authentic menu.  (And they will talk to you in Chinese.)  If you don't look Chinese you should request the authentic menu.  The menu items are in both English and Chinese.  The food is not absolutely perfect but it's definitely the best Chinese food I've had in Cleveland.  What we've tried so far:
- Japanese soft tofu dish (#34) is _awesome_ as Fung said in her review - the tofu is delicious and soft and the sauce is fairly authentic.
- The salt baked shrimp (#11) is a great dish too - fried goodness with just the right amount of spice.  
- The beef ho fun noodles (#76) had a nice flavor and it was good except they did not premix the noodles with the sauce, which caused the noodles to incompletely absorb the sauce.  
- The fish pan fried in brown sauce (#42) had a very tasty sauce that was *different* from the other two but the texture of the fish was sort of flaky (I would say a bad choice of fish)
- The bubble tea (well, more of a smoothie with boba) was what really surprised me.  The boba was soft and cooked correctly, and the tea was not overwhelmingly sweet like other places in Cleveland.  It was actually pretty decent!

If this place was in Los Angeles I would give it a 4.  But for Cleveland, well, we might be coming here instead of Wonton Gourmet from now on."}
{"text":"Very disappointed at this place with a recent visit. There are not many options in Solon area for Chinese food, and this one is close to work. We went for lunch. The gentleman who sat us had nice suit on, but was not polite. He wanted to seat us at a booth by the kitchen, and I asked if we can sit the other one down the isle a bit farther. He replied \"what's the difference\". I have never got this response ever from a host. 

The food was very generic. If you like high sodium, oil, load of sauce typical American Chinese food, you probably will like it. But not my taste. It's far from real Chinese food.

We asked for separate check upon ordering but still got one check at the end. I asked for brown rice with extra charge but still got fried rice. Nothing went right. The guy came back with water and check with tons of bad attitude.

Not recommended."}
{"text":"Was this location ever associated with the Chagrin Falls location? Because they were creepy similar on menu! Even the font... Unfortunately I did not take photos, but I ended up here for a birthday lunch and I just don't typically interrupt social occasions like that for photos! I am having issues finding on the menu what we ate, because my mom ordered off of the specially requested menu of more authentic cuisine (I believe).

It was just one of those visits where it was so close, but no cigar. Not the best I've ever had, but also far from the worst. Their portion sizes were large and I appreciate that when eating family style. So, I do think it is worth a visit if you are not looking for the best of the best. I'm not spending my money there though!"}
{"text":"Ate here 3 times in a week. Convenient to my hotel stay and delicious Kung pao with brown rice meal. Good service. Could relax and enjoy my meal."}
{"text":"Got to comment about not like Taiwan--I don't order beef overseas; it doesn't taste like ours. Chinese here is Americanized; we don't have the same ingredients. I drive 50 minutes to eat here and stray all over the menu. I like some dishes better than others and that is as it should be. We all have different tastes influenced by our environment and origin. That said I have this place on my favorite list. I have eaten chinese from New York to San Fran and Hunan compares favorably ."}
{"text":"Food has a wide variety of both Chinese and Thai dishes."}
{"text":"This place used to be very good. I might even say excellent. Ten years ago and for the first five years I lived in the area, I had consistently high quality meals here. I was happy to come to Solon to eat, rather than drive downtown. However, over the past few years, I have had to become very cautious when ordering. When here with Chinese friends, especially when ordering off the Chinese menu (yes they have one), they still deliver quality most of the time. If you are American, though, there is a 50 50 shot that they may serve you crap, tasteless or undifferentiated tasting among dishes. Of course, a large number of Americans don't know the difference, even savoring the filler ingredients you would never find in real Chinese restaurants, thinking that vegetables like water chestnuts and baby corn (which are from cans!), slopped with oil and msg (which is fed to lab mice to make them fat!), are authentic Chinese food. (Okay, Chinese people DO use MSG in their homes.) It is funny, just as Hunan of Solon expanded its restaurant space, the quality of its ingredients and recipes and service dropped while raising its prices, I suspect losing so many customers which were the reason for their expansion. Yes, I still go there occasionally against my better judgment and order selectively. I don't want this place to close. I just want it to wake up and restore its quality."}
{"text":"Great food and a clean restaurant. Very friendly employees. My sweet and sour chicken was very good with all white meat. I would highly recommend this restaurant."}
{"text":"The wonton soup is pretty amazing!,  but everything else is poor quality. Pretty bad. Imperial wok in solon is much much better."}
{"text":"Authentic Southern Chinese food. Great taste! Price is medium high but you will get what you paid for. Lobster was cooked with special sauce. I will definitely order another next time. Also, if you like sea cucumber, the combination with tofu and scallops was unforgettable! You really need to try it yourself and will not be regretful!"}
{"text":"one of the best chinese restaurants in cleveland. went for chinese new year and it was very entertaining and everyone enjoyed the spectacle. the food may not compare to san fran or nyc, but its a cut above most of the chinese places in this city."}
{"text":"Quick, prompt service. Ordered General Tso Chicken Combo Platter which included about 15 bite size pieces of chicken and a small portion of vegetable fried rice plus veggie egg roll. The portion was perfect... not as much as other Asian restaurants, but enough to fill me up and without overeating (but with no leftovers either). The taste was not bad in the least, but very non-descript. It didn't stand out. I ordered the chicken \"hot\" and it wasn't even spicy in the least in my opinion. The eggroll was good- crispy and full and the rice was full of bits of egg. No complaints, but nothing that made me want to write a chapter in my culinary masterpiece for it either. Probably will have it again."}
{"text":"Best authentic Chinese in Cleveland..I really love their fried rice and Pad Thai. And their bubble tea was yumm"}
{"text":"i've been here twice and my opinion hasn't changed.  it's close to the hotel i stay and that's all i can say about it.  the food is just ok but the service is great.  went this time for lunch and ordered the garlic shrimp combo which comes with soup and rice.  not much taste to the shrimp and soup so i probably will go back when i'm too lazy to drive somewhere else."}
{"text":"Extremely Rude waitress.Absolutely horrible service.They lost 8 potential repeat customers.Not one of our group of 8 will return  due to the attitude of the waitress. She acted like she was doing us a big favor the entire time we were there . I don't remember ever experiencing such  horrible treatment at a restaurant. Food is just ok, nothing special."}
{"text":"A yummy and fast treat from the far east! A friend and I dropped into Hunan in hopes of just a fair at best lunch. They proved us wrong by serving it up hot and fresh. I started out with a bowl of the egg drop soup, which was the perfect temperature, golden hue,  and consistency. After the soup was finished, a beautiful crunchy vegetarian egg role made it over to our table. This little nugget of pure joy was surprisingly fresh and the fillings were not overly soaked by the grease. 

On to the main course... I ordered the hunan chicken which was saucy and spicy!!! A total win win combo for me. The vegetables the accompanied the chicken were crispy and delicious! My friend's meal was also well reviewed on his end. 

The rice that came with the entree was a little bland, which was the only negative of the entire experience."}
{"text":"I am a regular here.  But Yesterday I had a very bad experience and they acted like they could care less.  Of course they were mobbed because it was Christmas and all the members of my tribe jammed the take out as well as the sit down tables.  Some of our food was cold.  The first meal came out OK but not really hot....Then 15 minutes the second meal came out totally cold.  We sent it back but it never came out again.  Then 30 minutes later the next 3 meals came out.  They were hot but we could tell they were made wrong. 
 We knew that since we have been to this restaurant before and have ordered them before. The people next to us ordered 4 meals and they came out all together and theirs looked great.  So it was just that the kitchen could not get their act together.  This can happen occasionally like on Christmas day BUT... they still made us pay and we hardly touched our food. We did not expect a totally free meal as we ate the soup and we shared the first meal.  We asked to speak to the manager but he was too busy to show up.  I have not done this in a very long time but \"NO TIP FOR YOU ! \"  Or waitress was in La La land so she was partially to blame.  I think I will go to Hunan Of The Falls.  They are better equipped.  It will be worth the longer drive as I now have a bad taste in my mouth."}
{"text":"Excellent dish!  I enjoyed my General Tso's chicken very much!  It was a great portion. Crunchy breading, but not too hard to eat. The chicken stayed inside the breading, so this was likely never frozen. My egg roll was fat and delicious. 
Service was a little slow, but it's lunch time in SOlon.... everything is.

The restaurant was clean and attractive and our server was very friendly. I've worked in Solon for a year and a half and I can't believe I never knew this was here!
I'll be back."}
{"text":"Shrimp with garlic sauce.  Very good taste with big juicy shrimp.  But the shrimp still had the tails on!  Why would I want the tails on when the shrimp are covered in hot garlic sauce with no way to get them off without burning my fingers? 
And mushrooms, what's with all the mushrooms?  Not a fan of spores!  It was very enjoyable once I got the spores and tails segregated on their own side of the plate :)

Egg drop soup was different.  Had a spicy thick taste, mushrooms and big chunks of egg."}
{"text":"I went there for lunch yesterday with my friend. We both were pretty impressed. The combo or whatever is $7. You get your choice of a main dish with rice and either a wonton soup, eggroll or something else. We both were really happy with our meals. The portions were big enough to eat only half. Today I had the other half at lunch at the work cafeteria after sitting for a day. It stood the test of time and was still good. I think it is really good for the price. The service was pretty friendly too."}
{"text":"This was my first time eating at Solon and the red Thai curry was good. The servers were friendly but the manager had a horrible attitude. He was standing right behind me when the check arrived and before I could even include my tip, he said that you must tip at least 18%. This was really unprofessional from his side."}
{"text":"Very happy the authentic menu us now on the web site!"}
{"text":"This place is amazing. The staff is attentive and friendly. The food is beyond excellent. Best Thai curry I've ever had. I've used a Groupon here several times and I still get good service. I've been treated poorly at other establishments for using a Groupon deal. I haven't been here in over a month and I'm long overdue for a visit. It's so good!!!"}
{"text":"Hunan Solan has been here for a long time, so a good establishment. The interior is clean--blue and white. Very neat. The servers were friendly and helpful. The restaurant had two rooms. One looked ideal for a party group or for a family function, but we did not ask about that. We started with pot stickers and crab Rangoon. Very good. One entree was mandarin orange beef--large slices of beef with broccoli. Was very good. I had Thai vegetables and calamari. Light and tasty. The other dishes were well received with fresh sticky rice. We took home leftovers. We compared this to another popular restaurant in the area, and agreed this was better. We'll definitely return."}
