{"text":"Best gift for a foodie - The Chef's Table."}
{"text":"This place is special to me. It is tucked back a long drive and I always feel as I've arrived to another time. It's quiet, authentically built w love and transporting. Quaint quality. In atmosphere and food. My husband I had our wedding reception in the round room and go back for our anniversary each year. Every meal I've had is exquisite. Recently had Chilean Sea Bass. It was like salted butter w a liberal crust. Yes that good. Treat yourself with a retreat to another time and an opportunity to savor w all your senses."}
{"text":"I've had two business dinners here. Once I had a filet, and last night the sea bass with risotto.  Absolutely delicious.  I can't say enough good things.  Excellent service. Interesting ambiance.  Good wine and beer selection.  Go. You won't be disappointed!"}
{"text":"This is one of the best restaurants in Pittsburgh. The wife and I went for a romantic evening. It feels like you're in an old castle. The food is really top notch, american with french influences. There's a coat check and valet parking. You'll probably want to dress nice for dinner here."}
{"text":"Fantastic--a delicious meal in a castle!  I took my boyfriend here for his birthday dinner, and it was delightful.  I had the Chilean Sea Bass, and it was the best piece of fish I have ever had!  My boyfriend had elk, and he still talks about it, 8 months later.  It was lean, tender, and tasty.  He ordered it rare, per their recommendation, and he felt that you could cut it with a spoon.  The grounds are interesting and fun, and they let you walk around a bit.  I think it would be a great place for a small wedding."}
{"text":"My husband took  me here for my birthday dinner. I have been there a few times in the past, but somehow never think of it. I have to say, that I think this is the most beautiful restaurant in PIttsburgh. It's incredibly warm and romantic with the gorgeous wood beams and the crackling fireplaces. 

The food was impeccable from the starters to the dessert. I had the special of the evening-a lobster pasta that was plated beautifully.  Everything was executed well and our server was so sweet and accommodating.  She went above and beyond, including giving us a little tour of the mansion. I am looking forward to going back. I won't stay away as long this time.

Do yourself a favor and dine there. You won't be disappointed!"}
{"text":"Best place for ambiance for a superb dinner,  lovely history and good food,  pricey end but for a special occasion it's a local gem"}
{"text":"My boyfriend and I spent our 2 year anniversary here when we were living in Pittsburgh.  Truly memorable.   I love the fine dining experience.  The service and food were EXCEPTIONAL!  We've told all of our friends about this place after our wonderful experience."}
{"text":"Every once in a great while, I am blown away by an experience.  My wife's recent birthday dinner was one such night.  The key to it all was reserving a little room off to the side of this Pittsburgh institution called quite simply, The Q's.  It's a small private dining room with a fire place, sitting area and table.  It seats up to 16 people - but is exceptional for a party of 6-8.  The food was divine and the service and care extremely attentive.  We spent what felt like a 4 hour vacation nestled in a rustic cabin in the woods.  A remarkable evening.  But be warned.  You need to come in with the right mindset.  It is a quaint little room that is rather drafty and even a little smokey from the fire (also you must go outside and into the main restaurant to use the restroom) - but if you are up for a quiet romantic dinner party with your closest friends - I can think of no place better in Pittsburgh."}
{"text":"My husband took me to dinner here for our anniversary. It was by far one of the best dinning experiences that I have had. The food, service, and atmosphere are well worth the price. It is a must try and great for special occasions."}
{"text":"Excellent service and a very nice 'classic' menu. Wild mushroom salad, seared foie gras and the elk done medium rare were all excellent. Paired with a very nice blend (3 rivers I think) also quite good. 

The bread pudding was excellent as is the olive tapenade. The breads seemed lacking but I am a bread snob. They could have had more character and substance. 

Great for a romantic occasion or business dinner."}
{"text":"You want to go somewhere special and get a wonderful meal, then this place is where you should be.  Top notch food and service.  Wow, impeccable!"}
{"text":"I was in Pittsburgh for a business trip with a couple of colleagues who had been to this restaurant before.  They had simply driven around and found it the last time they were in town and had immensely enjoyed their experience.

This time around they weren't as thrilled, though.  My standards just may not have been as high, but I thought the food was good, although maybe it didn't warrant the price.  When the waitress asked how everything was at the end of the meal, my colleague honestly told her that it wasn't as great as last time.  She genuinely cared about his answer and seemed to take his criticism to heart, and I honestly believed they may change the menu a little bit, or at least what they recommended to people when asked.

My favorite part about this restaurant was the atmosphere.  You drive up to what looks like a little cottage and there is valet parking.  When you walk in someone takes your coat and shows you to your table.  The staff was very formal and pleasant, and the decor reminded me of my stay in Germany.  The food was pretty good and hinted at some German influences as well.  I could be totally off about that, though- it could be celtic or Old English.

When it comes to service and atmosphere, this place was great for a business dinner.  The food was pretty good, although I'd say not as great as the prices would suggest.  I don't know that I'd come there for an anniversary dinner or anything."}
{"text":"Wonderful experience.  I do not easily pass out five stars, but this restaurant deserves every one.  I was on business, searched online and found this gem.  I started with foie gras, which was excellent, followed by an elk fillet, perfectly done, topped off with an awesome cheese sampler for dessert.  Old-world ambiance. Totally unexpected.  If you are in the area, and looking to reward yourself, make the drive.  It's well worth it."}
{"text":"Review of hostess: 1 star
Review of restaurant minus the hostess: 5 stars

The point of this review: If, unfortunately, you are greeted by pretentious and rude remarks by the hostess, do not let it spoil your evening. Move forward into the dining area, admire the decor, order a fabulous meal, and have a good time. The servers are very friendly and not pretentious at all. I love the sherry bisque.

The long story: My husband and I have always had exemplary service and food at the Hyeholde. We had a lovely wedding reception there in 2006 (our guests still talk about it); and when we are in town visiting family, we always make it a point to dine at the Hyeholde. 

The other evening, my party was asked if we would like to check our coats. Before I handed my coat over,  I said, \"Let me take my phone out first.\" The hostess who took my coat said to me, \"We don't allow phones at the table.\" She added something like \"If you want to talk on the phone, you can come out here.\" 

I have never experienced such a rude comment at ANY restaurant (casual to fine dining) before. Hyeholde is a upper scale dining establishment; but being located in Pittsburgh, where the people are very down-to-earth and not pretentious, I was sorely disappointed to be treated in such a way. 

It is not the restaurant's responsibility, and certainly not the hostess' responsibility, to teach a grown adult about manners. I don't need someone else to tell me how to have dinner politely with my family. (I also must add that I dislike talking on the phone in public to the point that I won't answer a call from my husband in the company of others.) 

I found this experience to be so unusual that I emailed the restaurant. My intention was that the manager would address this matter with the hostess so it does not happen to another diner. IF I were a first-time diner at the Hyeholde, I would have left a horrible review here on Yelp and never returned to the restaurant. Service is just as important as the food in a dining experience. As a long-time customer, I did not want another diner to get the impression that this lovely restaurant was a pretentious and unpleasant one. 

The dining room manager, who happened to ALSO be the woman who said the rude remarks to me, replied back. She asserted that I had misinterpreted her remarks and that she was merely responding to the gentlemen in my party who were reading a sign about the restaurant's cell phone policy. They were not looking at a sign, and she was speaking directly to me in response to my wanting to take my phone out of my coat.

My conclusion is that not only is this manager pretentious and rude, she is also unprofessional, making up a story to probably cover her butt. 

DO go to the Hyeholde; it is such a lovely restaurant with great food. The servers have always been friendly and respectful. If you are unfortunate enough to be met with a rude greeting or unprofessional remarks by the dining room manager, do not let it spoil your evening. Everything else is great."}
{"text":"My girlfriend and I are new to Pittsburgh. We made a \"bucket list\" of restaurants to go to based on various recommendations and have now gone to quite a few of them now. 

This place is a very well kept secret. I don't know of many people who've heard of Hyeholde but let me just start by saying the experience was truly superb. 

We went for her birthday and left feeling quite honestly like family. The staff was exceptional. We even met the owner and she gave my girlfriend a very nice birthday present (a signed book about the history or Hyeholde). 

The grounds are beautiful and it is very much a romantic escape. 

Food was stellar as well. I had the Miso Sea Bass, my gf had the trout and we shared the Gaspacho and Cremé brûlée. 

Based on the food, service, atmosphere, and above and beyond, I think I left the biggest tip of any restaurant I've ever been to. 

We will definitely be back again. 5 stars, all day long."}
{"text":"We got married and had our wedding reception here so I will admit I am a bit biased.  This place is a gem...very romantic.  The service is above and beyond.  They use all fresh, in-season local ingredients that are masterfully assembled and plated like a work of art.  

If you are looking to win her heart and an unforgettable dining experience this is the place."}
{"text":"I recently hosted a client event at the Hyeholde, and I couldn't be more thrilled we decided to book here. The location was magical- straight out of fairy tale. The staff was the best - very friendly, accommodating, calm and everything was exactly as discussed. The events manager even had an entire file just for our event to keep all the details straight. There was a valet, which was perfect since it was raining and the parking was up the hill. The food and drinks were excellent; everyone raved about them all night. Thank you so much to the staff for all you did to make our evening incredible!"}
{"text":"The ambiance of this restaurant is fantastic.  We loved the architecture, candle lights and the different dinning rooms.  For appetizers we ordered the beet salad and the baby lamb chops.  The lamb chops had nice grill marks but were too sweet and very under seasoned.  The salad dressing was bitter because of the over use of vinegar in the dressing.  For entrees we ordered the elk and the lobster pasta special.  The lobster was chewy but the past was tender and definitely house made.  The elk was terrible, I didn't care for it at all.  For dessert we ordered the chocolate cake and creme brûlée.  The creme brûlée was definitely the winner.  Service was slow especially after the place filled up.  Overall we were excited about our meal when we walked in but were disappointed with the food.  Definitely will not return or recommend.  I wish the food tasted better because we love the architect and the ambiance."}
{"text":"Note this review is regarding the Mother's Day buffet ONLY, not their true sit down dining experience. 

I hadn't been here in years....it's still so very beautiful, inside and out. Last year we tried to get reservations for Mothers Day, but waited too long and could not get in. So this year I called super early (before Easter) and had no issue. They offered either the buffet or a sit down ala carte early dinner upstairs. Neither menu was posted and my mom said let's go with the buffet...it would be fine.  We realize buffets can either be really good or really bad depending on the restaurant. We figured for the price ($39 pp) and for the restaurants reputation, it would be on the good side. 

So me, my mom and aunt were seated, waited on quickly by a nice but odd waitress for our drink order, which were brought quickly. The buffet was very small on choices in my opinion...7 items  It consisted of the following:
Salad with the choice of miso vinaigrette (excellent) and Green Goddess dressings. 
Sautéed vegetables
4 cheese lasagna
Vegetable frittata
Salmon
Prime rib and ham 

The salad was fine. The vegetables were a bit undercooked, and mind you, I like them still a bit crisp to the bite, but they were practically raw with little flavor. (I added salt...I NEVER add salt). The frittata was just ok, and probably would have been better had it not been held in a buffet pan, but rather cooked to order. I had two slices of prime rib, the first better than the second helping, however, I understand that every piece of meat is different. But I will say that it's one of my most favorite things to eat and I've had better at other places. I had a small piece of lasagna...meh...average. I did not have salmon or ham, however my mom had ham and said it was very good. They did have bread as well, but even that was a little disappointing. Tiny slices of a baguette type of bread, one plain and one with raisins. Some really good bread or rolls would have been great.  Where we're the potatoes???  I love potatoes and there were none to be had. 

Desserts...average for the most part. If you've ever been to an all inclusive resort in Mexico or the like, that's what they reminded me of. They had a chocolate liquor cake that looked divine but was a little dry. They offered a couple other cakes, one lemon, one strawberry. Then cookies and cream puffs....the puffs were very good.  We also had to ask 3 people to bring plates to the dessert table and finally got them after the third request as we stood there waiting. 

The service was pretty good, but the waitress came to ask us if we wanted another drink, I said no, and she proceeded to try to run off with the last third of my bloody Mary....um, I wasnt done yet and told her so. She also did not come by while we were eating dessert, but after, and asked if we'd like some coffee.  I would have loved some.....WITH my dessert, not after I was done. 

All in all, I'd love to go back for actual dinner, ordering off the menu.  I don't doubt that it would be fantastic. But my expectations for their buffet today were let down, and I wouldn't recommend it.   For a bill of $145 for 3 (3 buffets and 3 drinks) I was disappointed."}
{"text":"This was a wonderful dining experience. We visited relatively late on a thursday night and received excellent service and the food was outstanding. I had elk for the first time and it was a great experience. The chef came out during dessert and apologized for holding our entrees too long and presented us with a complimentary dessert when we had not noticed a wait."}
{"text":"I had my baby shower at the Hyeholde and everything was amazing thanks to the staff there. Matt (event planner) answered all my questions whenever I needed something (had to email him because I was planning from out of town). The food was amazing, they were very helpful with decorations and set up and their staff was very professional and attentive to my guests. I loved having my baby shower here and would recommend having a private event here for any occasion."}
{"text":"We go here every summer for the picnics. The food is always excellent and the picnics are a great value-- about $60-$80 for a picnic for two. 

Our most recent picnic was again top notch. Everything was neatly packed; lots of great-tasting food. We had roasted chicken stuffed with chicken sausage; roasted vegetables; fresh bread; salad with blue cheese crumbles and nuts; lemonade and Pelegríno; and creme brûlée. All very tasty! 

The setting is great too. We were in a quiet table in the woods near the garden.

Would highly recommend it!"}
{"text":"We have eaten here about 6 or 7 times. We have nothing but good things to say about them. We have had consistently great food, fantastic service, and the atmosphere and ambiance is quite unique. It is a bit pricey, but we feel we have gotten our moneys worth every time."}
{"text":"Fostar, his place is hands down beautiful. The atmosphere and setting give an ambiance of tranquility that is first class. 
Eight of us split all three appetizers. All were delicious. The crab cannelloni were stuffed and had lumps of crab and fennel spirals on top. The rabbit stew was served in pots and delicious. The lemon gnocchi was the most disappointing. It was fried or appears to be fried, and overdone. I am used to pillows that melt in my mouth. The root veggies were good but over salted. 
The bread basket was overflowing and came with both butter and an olive oil for dipping. 
I ordered the sherry bisque which had lentils. And the elk.
The sherry bisque was rich. Had I not know there were lentils, I would not have guessed. Everyone else ordered salads and there were no leftovers. 
The Caesar presentation was impressive. The ham was wrapped around the lettuce. 
The elk was medium rare and very good. It could have been even a little more rare. I asked for a substitute of the bread pudding (had already had two courses involving bread). I suggested something green or the Quinoa. They put a sweet potato slice. 
I had fruit for dessert although the lemon dessert was calling my name. Next time! 
I'll be back."}
{"text":"The house was beautiful.  We liked the rooms and alcoves.  It was definitely a place to go for a romantic setting.

The food wasn't as impressive as the setting.  Large liquor menu.  Very short dinner menu.

We started with the sherry bisque ... yes sherry not lobster or turtle ... it was a tomato soup with sherry with a topping of cream served in a coffee cup.  Our guest had the butternut squash soup served in a traditional soup bowl.  

We had the Ceasar and mixed greens salads.  The veggies were fresh and dressing were flavorful.

For dinner, we had the filet, elk, and shrimp & mussels with cannoli beans.  The waitress told us premium cut of elk and not gamey tasting.  It was GAMEY.  The filet was very good.  The shrimp, mussels & cannoli beans needed rice or couscous.

For dessert, sorbet and cookies ended the evening.

The waitress was very attentive.  The bathroom was on the second floor (up steep steps).  The valets were prompt.

We expected more from the meal."}
{"text":"Had my bridal shower here in July and it was perfect!!!! The food (seafood pasta, steak, and chicken) were all fantastic, the wait staff was efficient, Matthew provided excellent assistance and the private room in the Round House was perfect. My family members and friends are still raving about how amazing it was! Thank you Hyeholde!"}
{"text":"Summary: The Yelp cost rating of $$$ was very accurate, yet lacked a few things you should know before going to the Hyeholde Restaurant. 

First, something not covered by any of these other Yelp reviews is that the restaurant is business / professional dress. My significant other and I felt very out of place when we showed up in decent looking casual clothes only to be judged and looked at funny. The crowd was much older, professional and seemingly snoody. We spent our dinner listening to a loud group complain about how Hilary Clinton has purposefully disobeyed Obama through his terms.

The location is up a long, steep driveway where you come across a beautiful colonial looking home. The parking is around back, or valet through the center archway. The location seems perfect for a romantic dinner or a professional get together.

My significant other and I did not make reservations as it seemed unlikely that it would be busy on a Tuesday evening. The front staff seemed irked that we didn't have a reservation, even through the restaurant could easily sit a few hundred people on it's two beautiful floors. 

The waitress was very nice and friendly, answering any questions we had about the menu. She informed us that all of their vegetables are grown on premises in their own garden. She seemed to be the only one on staff and at one point asked us to order because she had to go outside to take care of something. There was another gentleman who assisted in taking drink orders, but he appeared to be more of a manager. In all, they seemed very understaffed.

The food was fantastic. I did inform my waitress that I was allergic to dairy but twice my dishes came out with some form of cheese. The waitress was very apologetic and got me fresh potatoes as a substitute. I did leave feeling very ill, as I suspect there was dairy in something that wasn't caught. They were out of the lamb shanks, so I settled for the prime fillet - which was excellent. The waitress informed me that their medium-rare is more on the side of rare, but my medium-rare fillet came out looking raw. Luckily I don't mind a rare steak, but I know the amount of red would be an issue for some people.

In all, we wanted to have a good time but couldn't leave fast enough from being judged by our clothing. The wait staff was friendly, moderately attentive due to understaffing and the food was absolutely superb. I'd be terrified to see what a rare steak looks like as the medium-rare was practically mooing, but it tasted fantastic."}
{"text":"The food and drinks were excellent. The atmosphere is beautiful, comfortable and intimate. The best part though was our waiter. Vincent told us the history of the restaurant and banquet hall throughout dinner. He made fantastic food and drink recommendations and then after dinner he have us a tour of the inside and outside of the restaurant and the Round Room. We would go back for the food nut this is the first restaurant I would go back to because the waiter was so good too!"}
{"text":"One of my all-time favorite restaurants! I have literally never had anything here that I didn't like. 

Hyehold is definitely a place for special occasions. It's quaint, tucked away from the city, and very romantic. You know a restaurant means serious business when you don't even have the option to choose where to park your car. Hyehold offers valet parking only. If there is a self service parking lot somewhere, I don't know anything about it. 

The food here is so classy and elegant: not only prepared to perfection but plated so beautifully. During our last visit, we ordered two smaller plates to start: crab cakes and lamb ribs. Probably the best crab cakes I've ever had in my life. They were small but had the most delightful combination of flavors. The lamb ribs were fall off the bone, rich, and, of course, flavorful. For our entrees, my husband went with the pistachio crusted elk and I went with the filet mignon. Absolutely out of this world. The chef is so incredibly creative because the flavor combinations are honestly unlike anything I've ever had before. And for dessert, we opted to share the creme brûlée, which was traditional and an absolute perfect ending to a delicious meal. 

I am obsessed with Hyehold and I truly wish I could eat here every single day. I highly recommend coming here to celebrate any special occasion, or even just because. The food, service, and atmosphere are top notch."}
{"text":"We had both our wedding and reception here as well as our 1st year anniversary dinner. The atmosphere makes for a very unique dining experience and the food and service are excellent. I highly recommend setting aside some time to enjoy a longer dining experience here for any special occasion. You won't be disappointed."}
{"text":"This restaurant is just outside the city and is well worth the trip! Its in a beautiful, picturesque estate and the food is very elegant.  This place makes you feel like you are somewhere else and is very high end. They pay close attention to detail and service. Perfect for very special occasions. Just amazing."}
{"text":"We checked out Hyeholde as part of our special event host research.  We were thinking we should probably try the food if we were considering having our event there so we made a reservation for dinner to follow our meeting with their events planning manager. 

The Round Room space is a separate facility with floor to ceiling windows, a separate bar and restrooms, room for 100 at round tables, and a green lawn area for seating or cocktail hour just outside.  It's really perfect for a wedding!  

The restaurant itself looks like an old European house with thick wooden timbers that were harvested from an old barn when the original owners built the place themselves.  They were a husband and wife that married in the early 1900's and the wife always wanted to live in a castle on a hill -she just didn't know she was going to help build it brick by brick!  They raised their family upstairs and opened a restaurant downstairs.  The restaurant is still owned and run by one of the daughters who is now 82.  The Round Room was built later and operated as a Cabaret for some time.

Adriana, our server, was excellent!  Bonnie, in their events planning area, was terrific too.  Even the valet parking guys were nice. The grounds are green and inviting and the restaurant itself is warm and rich with history.  There are some really neat New York Times cartoon paintings in the den/library room and a lovely outdoor patio with a stone fireplace.

Our dinners were really delicious!  I had the filet and my partner had the scallops.  They were both cooked perfectly.  I tried their sherry bisque which was just okay, to be honest, as it's lacking a protein in my opinion.  They need a lump of crab or something in it to really make it shine but the flavor was good and it was served nice and hot.  My partner tried the citrus cured wild salmon appetizer which was very good although the salmon could have really shone if it was a little thicker cut so it didn't disappear as much under the crème fraiche.  It had a nice flavor profile.

The filet came with a Boursin potato stack that was outstanding and some very fresh tender haricots verts. The scallops were served over a bed of saffron couscous that included a few delicate mussels and some pieces of chorizo and a delicious side of braised fennel.  

We were so stuffed, we passed on dessert but had a really good port to cap off a truly memorable meal.  Adriana gave us a tour of the entire house when she found out we were considering the Round Room for our event.  She was very gracious and informative.  That's how we learned all about the husband and wife team and the history of the Hyeholde.  

They do romantic picnics on their grounds in the summer which sounds so perfect for a special anniversary!  We definitely want to try that too."}
{"text":"I had a wonderful experience at Hyeholde. The venue itself is so beautiful. I wanted to take time just to walk around and tour the place. Instead of eating inside, I opted for a beautiful picnic dinner. I would highly recommend this. Farther down on the grounds, within the gardens, they have areas for you to eat a picnic dinner. This was a fantastic option and brought something different to the dining experience. When you order the picnic dinner you need to pre-order 48 hours in advance. You can find the menus online. Your food comes individually plated and in containers to keep warm. I had the filet and it was cooked to perfection. I thought the bread was amazing and the soup was fabulous. The vegetables for the salad are grown right on the property, as I discovered while walking around. They tasted as if they were cut seconds before being put into the salad. For dessert I had fresh berries and biscotti, a nice light way to end the meal.  I would definitely come here again for a special occasion.  FYI: Bring some cash for the valet parking."}
{"text":"Wow! You're looking good at 80 Hyeholde! In business after 80 years, you've got to be good! 

A group of us decided to go to the Hyeholde after a full day intensive. We headed over without a reservation since it was Monday. As we were leaving our car, the valet asked if we had a reservation which we did not. He checked with the host and returned with happy news that there was room for us and information that tonight was the 80th Anniversary party of the Hyeholde and a special prix fixe menu. The valet encouraged us to check out the sports cars in the parking lot before we entered the restaurant - a special for tonight's celebration. Beautiful Porsche, Maclaren, etc. wow! 

The restaurant is a Tudor inspired building with outdoor sidebar and multiple dining rooms with vaulted ceilings. The lobby is a multi-sided room covered in a tapestry like wall covering. It was beautiful and fit the Tudor style. The restaurant was warm and inviting. We found a couple of suit of armor and stately chair (promoting their upcoming Feast of Thrones for Game of Thrones fans) - a perfect setting for a themed dinner. 

The atmosphere has candle lighting, dark stained wood furnishings and pale colored table cloths. Our foursome was greeted by our server (who has worked there for 25 years and was so pleasant. She was masterful in answering our food questions, pacing of drinks and food orders as well as being attentive. Even the owner stopped by to check in with our table and refill our water glasses. She was lovely! 

The 80th Anniversary had a special menu - original menu offerings from when the restaurant was opened, with a modern twist. I chose the seafood pot pie, pear salad, grilled beef and lemon dessert. The seafood pot pie was a bowl of seafood topped with a puff pastry top. The server poured a creamy soup base over the pastry top. It was prefect as the scallops and shrimp melded with the creamy soup base yet kept the top nice and crispy. Loved this dish! The pear salad had lightly dressed red and green lettuce with candied pecans, poached pears and soft cheese. It was presented on a \"slate\" dish. Our entrees came out next with my perfectly grilled beef sliced and fanned out over a purée of creamy potatoes and accented with a roasted turnip filled with short rib. OMG. The meat was so tender and delightful to swirl into the demiglace infused sauce - I cleaned the plate. I thought I wouldn't be able to fit in another morsel, but the light and fresh lemon dessert completed the meal. It was a little lemon pastry creation topped with a brûléed meringue. The plate was swirled with a creamy sauce and dusted with crunchy foam bits. My tastebuds were delighted with the lemon flavors and textures. The portions were perfect and the server and kitchen paced our courses well. We all were so happy with our meal. 

I tasted my colleague's chicken dish with woody mushrooms. It was incredible. I am still thinking of that moist and flavorful chicken. Oh, the chocolate semi freddo was rich and smooth - get it if you can. 

Note: We were dressed business casual. A couple of diners gave us disparaging looks and made a comment that they couldn't believe we were allowed to be seated the way we were dressed. It's too bad that they let this bother them. We had a wonderful meal and experience. Thanks to the restaurant for an incredible evening with them!"}
{"text":"I came here a few months ago while on a business trip in the area; we were too busy to drive far for dinner or go downtown, so coming here was a bit of a respite after several days of meals at chain restaurants and Sheetz (big fan, but sometimes enough is a enough). 

It was very dark and rainy the night we came here, so it was a bit scary driving. I'd read reviews about valet parking, but we were able to park our car ourselves; this might have been because we went on a rainy weeknight? The castle and the décor were really unique and our waitress told us a bit about the history of the building, which was nice. I would love to come back when it's nice out, possibly during the day, so I could see what the grounds look like.

I got a sea bass entrée, which was very tasty and filling. My coworker got the lamb, which she also really liked. I loved the bread pudding dessert.

I would recommend business casual dress when coming here. It took us a little while to be greeted when we first got there, and the hostess seemed to think we should have made a reservation, even though it was a weeknight and pretty empty. However, all in all, everyone was friendly and the food was good, if pricey. It's also pretty cool to tell people you had dinner in a castle. I'm really glad we found this place, and would love to go back."}
{"text":"Halibut was a tad dry. Service was impeccable. Interesting setting that makes you feel like in Medieval Madness without the craziness and kitsch. My colleague found the wine menu somewhat limited, but overall food was terrific."}
{"text":"I cannot say enough good things about this place, first and foremost the service itself is five star I came in underdressed and could have easily been turned away however I got some of the best service I have ever had.  Now coming from a restaurant background and having worked in a five star restaurant myself I can say the food is exceptional.   The menu is forever changing I had a prime filet with a Demiglace reduction a chopped salad and corn and crab chowder.  My wife had sherry soup and artic char and for desert I had a delicious tart with pear compote from pears picked from the property.   As far as the ambience second to none I cannot recall ever dining  in an establishment so elegant."}
{"text":"Hyeholde gets my highest recommendation. The food is exquisite and the service is top notch. You really can't go wrong with anything on the menu, from salads to desserts. I've had pork, elk and veal here, and all  were cooked perfectly. 

My wife and I had our wedding reception here as well, and were thrilled with the experience. They seemed to anticipate everything and really went the extra mile to make the day perfect."}
{"text":"I'm sorry to say, after dining here for various occasions, such as our wedding reception, anniversaries, New Years, and so on, the magic is gone.  No longer do I feel like a valued customer.  Even when you call to make reservations, no one cares if you are celebrating a special occasion--no special table request granted, no interest in making your evening special.  I can go anywhere and be treated like a number.  Not sure what happened to their personal touch, but after more than a decade, they are no longer our favorite place."}
{"text":"Before I begin, Jennifer was my server and she was fantastic. I will post a separate review with a glowing review on Trip Advisor. 

Upon arriving up the winding elegant driveway I was greeted by a employee named JEFF, who become very RUDE and ANGRY, as well as inquisitive after he discovered I did not want my car parked. Some people do not allow their car to be valeted for various reasons. My reason is irrelevant to this review. Once I informed JEFF that I needed to park the vehicle myself he began to be UNPROFESSIONAL and a poor representative of such a fantastic dining esatablishment.

Questions to the owner?

1) Why did JEFF ask if I had reservations? Do not people come without reservations? When I told him I did he stated that he didn't see any single reservations on the list. My date cancelled, but I decided to still come anyway. I did not know that a parking lot attendant was so involved with reservations. Who knew? 
2) Why did JEFF have me park in the very rear of the parking lot that was 98% EMPTY? Why did I have to walk through the mud to enter? It was muddy only where he had me park. I took pictures of the parking lot to show how empty it was. Yes, I will post pics. 
3) Why did JEFF treat me differently than other guests? Hmm, what could it have been about me that was different than the other guests? I did notice my complexion was darker than the others he engaged with?
4) Why did JEFF mumble under his breath after he had me park in the FAR back of the parking lot? 
5) Why did JEFF have such a poor attitude? He does not own the mansion, he merely parks the cars of the individuals who can afford to pay.    
6) Why do you the owner employ such a negative, unprofessional parking lot attendant-JEFF? I am sure I am not the first to raise such observations. Owner, please speak with some of your employees in private, see what they have seen and heard about JEFF."}
{"text":"Best restaurant in West Pa. Cannot duplicate the atmosphere here. Food is exceptional and delicious, service professional. Atomsphere, Atmosphere, Atmosphere!!!! Go soon with someone you love."}
{"text":"What a lovely place. Went here for dinner a while back and loved it. The atmosphere is beautiful. Our waitress was very helpful. To start with I chose there sherry bisque. It was just ok. It was a little bland for me but the texture was nice and creamy. The man had the crab cake which he loved. For our main course I chose fillet which I ordered medium but it came out medium rare  I hate having food refired so I just went with it and it was more bloody then I would have liked but still very tasty. The potatoes that were served with the dish were amazing paper thin cut and layered on top or each other with Boursin cheese. So good!!!! Bry got the elk which he liked a lot but prob wouldn't order again. For dessert I honestly don't remember what we had chocolate probably. however I do remember the late harvest wine we had with it was really yummy but didn't pair well with what we had.  Also there after dinner coffee menu is amazing. I can't tell you what was in it but its on the bottom right of the menu and tasted like a chai tea but coffee. All and all it was a wonderful night. Thinking about maybe doing thanksgiving here next year."}
{"text":"I have eaten at this restaurant for years probably over 30 times and recently it has just gone so far downhill and pricey it is not worth it and not worth the high reviews. The food is high end and exotic and just not worth the price and the service is getting worse every time I go."}
{"text":"All I've heard for years is how wonderful the Hyeholde is, so we decided to try it for Thanksgiving dinner.  Now we don't normally expect much from restaurants on holidays because the crush of business means that something will suffer, but even with our expectations lowered, the meal was a HUGE disappointment.

It was a buffet dinner for $39/person.  Not bad for such a highly regarded restaurant.

The pros:  the restaurant itself is everything everyone else has said about it: charming, warm, inviting and relaxing.   The host staff was gracious and welcoming.  

The cons: everything else.

The service was non-existent.  Neal, our waiter, took our drink order and returned maybe TWICE to see if we were all right.  Other staff refilled our water glasses.   He told other diners about how the buffet was setup but neglected to tell us.  Did we offend him in some fashion?  Did I look like his evil cousin?   It seemed that he went out of his way to avoid eye-contact with us!

The food was bland and tasteless except for the mashed potatoes and the cranberry relish.  Both were very good.  

Turkey: dry and bland
Prime Rib: cooked well but very tough
Salmon: undercooked (!!!) and tasteless (frozen?)
Stuffing: like eating wet sawdust
Vegetables: overcooked and limp
Bread: dry and tough
Desserts: dry and tasteless

No flavor to anything.  

Did I mention the salad?  No.  That's because there wasn't any salad.  How can you NOT serve some kind of green salad?  

The ONLY tasty dish was the acorn squash soup that we received at the meal.  From there?  Downhill.

Ugh.  Triple Ugh.  

Also, I know that it's a rustic country french decor, but it all seemed a bit shabby and ill-kept.  Tired and dusty.  

Definitely not worth the long haul out there."}
{"text":"Lavish setting, excellent service, very good food, excellent cocktails. A setting right out of a fairy tale.

BUT... the portion size is extremely small and the price very high. Two crab cake  appetizer (total under one ounce), each the size of a nickel, for $14? Two ounces of sea bass for $39? Two ounces of elk for $38? Three ounces of pork for $30? All cooked well but hardly dinner. The desert unfortunately was not up to par. A 'frozen souffle' that is not a souffle at all and tastes like it came from the grocery store. This is a great place for an impressive setting but the food, although good, sets new records for tiny portions and is therefore grossly overpriced.

Do not come here with a normal appetite or expecting a normal size premium dinner. Maybe the place to impress an anorexic girlfriend but this foodie will not return."}
{"text":"The spelling of the name says all that's needed about Hyeholde. The dining room looks like the set from beauty and the beast. It even smells smoky. It's a 5 star restaurant in all respects. The food and service are excellent. The wine list is diverse and fairly priced. Our dinners last night consisted of the crab appetizer, a shared house salad (very nice), the Arctic char, and a rhubarb-something desert (also shared). While limited, the menu offers something for everyone. Portions are just right, not excessive. Prices are, as you should expect, high, making this a dress-up, special occasion place."}
{"text":"This would be a 5 star review, if I didn't order the DUCK PROSCIUTTO.

First of all, this is a great romantic place for a date. Do prepare to pay, as it's not cheap! And you can tell the weekday night we are there, most people are for business. When we drive into the parking lot, it's like driving into the front door of an old castle. This is quite a good surprise! The interior deco is old but very stylish. The owner must take good care of this old building.

For the food:
The $ 14 DUCK PROSCIUTTO is the only disappointment of the visit. It have only several thin slice. The portion is so small, and with the normal taste, I will cry if paying the dinner by myself. 
The main course: Elk. It was great! You can tell it taste different from beef in a good way. A good life time experience.
The desert: Chocolate Rum Mousse is delicious! After the Elk, I'm kinda full, and still ate all the mousse, that's how good it is!

The wine list is sufficient.

This is a night to remember for the Elk and Castle."}
{"text":"This is a little late, but my boyfriend and I went to The Hyeholde for Valentines Day. It was so different and luxurious! We loved it!! First, we liked how it is sort of \"secluded\" but still easy to find. The wooded areas surrounding it give a magical feel. Of course the actual building was breathtaking and made me feel like I was in a princess storybook. Our waitress was so pleasant and professional. We both had the elk which was phenomenal (although it was our first time trying elk). It came with a side of mushroom bread pudding and heirloom beets. We both started with the lobster bisque, and although the portion was tiny, my boyfriend says it is the best thing he has ever eaten. The oysters and scallops that came with the meal tasted fresh and delicious. My boyfriend had a Manhattan and I had a martini, both of which were great. We can't wait to go back again."}
{"text":"Very good restaurant. Great service incredible ambiance. Very unique classy place to go. Incredibly quiet place for a date night. Very good place for group meetings downstairs in price room."}
{"text":"The food for the most part was cooked well but my trout dish was soaking, drenched in oil . They don't give refills on coke!


It was a slow Easter weekend day but the valet person told me they were totally full and had to triple park cars that night . I don want others Inside my car period. The valet told me he has parked $500 k cars.......I DONT CARE. I DONT WANT HIS HANDS IN MY CAR AND FURTHERMORE MY INSURANCE EXPECTS ME TO PAY THE DAMAGES If ANOTHER DRIver DAMAGES THE CAR! 
there were plenty of spots near the front that my car could have been parked ! 

He was a stubborn fool. In LA , service staff know how to accomodate people with elite requests 


We came at 5:15 and left at 7. There were hardly any people there. The confrontation with valet told me that they don't accommodate people's requests, typical  pittsburgh  mentality.

Fingerling potatoes were  burnt,,,,,see photos and drenched with glistening oil 

The place could use cleaning. Windows by our table had splash marks all over them . The place needs fresh paint 

They offered no reposado tequila. I knew I wasted my time coming here . They don't offer many craft cocktails . Their list was not impressive 

No music playing so we heard the other tables conversations 

I rarely complain at restaurants anymore . I TEST THEM like I do with non profit organizations and just follow up with reviews because money is no object. 

They love hearing glorious fb reviews but will act astonished to see this one. Sorry to burst any bubbles!

I simply state the facts and tell it like it is. I've dined exclusively all over the world. This place charges top dollar but doesn't deserve it

The tableclothes WERENT pressed , they had big creases in them. People In Pittsburgh are impressed with high prices . Not me. You have to deliver to deserve the premium prices

It's easy to fool pittsburghers , they rarely travel and most down own passports 

Furthermore if they are told something is good they will believe it 

My above complaints are unforgivable in high end restaurant dining

Those mistakes and faux pas  would kill a New York City or Aspen establishment but of course goes unnoticed by western Pennsylvanians"}
{"text":"I came here 30 years ago when in Pittsburgh and never forgot how wonderful it was.  Traveling with my daughter this time, I came back and was not disappointed.  The food was fabulous, the ambiance charming and the service attentive.  It's a little pricey, but worth it, especially for a special occasion."}
{"text":"Exceptional atmosphere, food and wine. Derek was my server and he was very polite and attentive.  I started with the sherry bisque which lived up to all of the fantastic reviews. It is definitely a must try!  I followed with the filet and subbed out the cauliflower gratin for the potatoes. A great choice as the cauliflower was amazing!!!  I finished with the tiramisu - another wonderful option.  I'm from out of town, sadly because I would love to come back!!"}
{"text":"My husbands family makes Sherry Bisque Soup every holiday based on the recipe from the Hyeholde.  I am so glad I finally got a chance to go to the \"family famous\" restaurant.  
The building to beautiful.  After you drive down an unassuming road you come across a beautiful farm house looking building.  The inside is just a striking.  Lots of beams and rock floors.  It is a really lovely venue.

My husband and I went for our 1 year anniversary.  It was a Wedn night not very crowded.  After we did a mini tour to see the building we were sat is a little room with a great view of the back gardens. 
I thought the food was nice.  We ordered a bottle of wine (a Zin) from a very long list.  I had a mushroom terrine that came with toasts.  It was really good and garlicky.  I also had fish for dinner.  It was good, although it came with the skin on the fish.  I usually love this style, but the skin was not very crisp, so was chewy to eat.  I ended up picking it off.  (I know, Zin doesnt go with fish, but I love Zin and will drink with anything) My husband had the Sherry Bisque, which he loved.  He also ordered a special steak.  It was HUGE, but he managed to eat the whole thing.  (not surprising) We were too full for dessert after all that.  They did bring us a little scoop of sorbet for our anniversary, which was cute."}
{"text":"The night I came here, they were not very busy. The hostess and the waiter were very accommodating. We even got to meet the chef. I really love the tucked away location of this restaurant, the architecture and the decor. But most of all I love the food! My date and I got the chefs choice and everything was perfect! Can't wait to go back!"}
{"text":"Lovely and very distinictive! Charming and delicious. With apples from their property, the salad was so fresh. Sherry soup, Crab cakes. Lemon sponge cake. Excellent service. I'd come back in a heartbeat. Just wish my love had been with me; so romantic!"}
{"text":"My husband and I went here for our wedding anniversary. The food was 3.5 stars. The waitress service and the castle setting were 5 stars. I ordered appetizers of crab cakes, which had much tasty meat, and sherry bisque, which I had never before eaten but liked. I ordered an entree of prime filet, which was cooked and seasoned to my liking. My husband ordered an appetizer of caesar salad wrapped in Speck ham and an entree of elk, neither of which I enjoyed (taste-test) but my husband did. For dessert I ordered a house-made sorbet, which I enjoyed but my husband did not. The atmosphere was different than what you get in other restaurants, so I was sure to take photos with my phone camera of things such as knight's armor and stained windows. We did wear business casual to look presentable. Price was expensive but not eye-popping. The waitress visited our table as needed to refill our glasses, and she brought out our courses promptly. You do have to use valet although the parking lot is not far away."}
{"text":"I was excited to come here but wasn't very impressed. The atmosphere was nice but the food wasn't anything to write home about. The staff was friendly but I don't have any intensions of coming back."}
{"text":"Hmm... where to start? Beautiful building, beautiful decor, however pretty far from the city. I came here to celebrate my husband's birthday. We pass by it when we head to the airport, so decided to check it out after reading some reviews and checking out the menu (their website was probably created in the 90's).
We started with the soup du jour a root vegetable soup and a salad. Both were a good start as we enjoyed our cocktails. Then came the elk and miso glazed sea bass. The fish was salty, but the fish itself was cooked beautifully. We also ordered the housemade ice cream, which were good.
For the total price and dish quality, we could've stayed in downtown."}
{"text":"This place was awesome. I had the Chicken Breast.  It was delicious.  The mushrooms and cabbage really complimented the chicken.  

The ambiance was very nice.  The place is actually a very old multi story house. This would be a great place for a quiet intimate dinner with a loved one."}
{"text":"It's a special place. Old, elegant, friendly, and cozy. The service is always perfect and the food the same. Their menu doesn't change often which I love. They're good at what they do and they stick to it. Their wine is always served properly and their staff knowledgeable on the list. It's location makes it ultra convenient if you're by the airport and looking for a quiet dinner. It's been our go-to for anniversary dinners over the last few years."}
{"text":"Beautiful restaurant building & grounds. Ask about the history of this restaurant since 1937 - feel good story. Delicious fine dinning food. The New Zealand Elk exquisitely delicious, every single bite.  Creative desserts both in presentation & taste. Service was on point, timely and never annoying. Wine list by the glass full of good options. Can not wait to come back to Pittsburg to visit this fine dinning establishment."}
{"text":"The best in Pittsburgh.  Have you ever been to a place that could do no right?  Well Eddies can do no wrong.  The happiest you'll ever be is on your night at Eddies. Birthdays, Anniversarys, Mothers Day,  Father's Day.  Any time that it's good to be alive.  That place will make your dreams come true.  Josie"}
{"text":"Eating inside the beautiful mansion is worth 5 stars alone.  The food is pretty great as well.  The sherry bisque is a long time standard.  On the down side staff can be stuffy and prices high.  

They consider themselves new American cuisine by keeping the menu the same since 1973 so that it's now trendy and retro."}
{"text":"The building at first glance is beautiful, but with close inspection is well worn and in need of much repair! We arrived to wait in the lobby as the hostess was on the phone with an obvious complaint from a previous customer, which was concerning.
I must say our server was lovely but said to each table she approached the same phrase about the liquor selection: \"it goes down very easy\"!
The bread tray was mediocre and marginal. The sherry bisque was like watery tomato soup with a bit of cream on top. We both ordered the short rib of beef, which contained NO RIB, and was a piece of beef smaller than a deck of cards, and tasted as though it was prepared in a crock pot. There was no salt and pepper on the table which was greatly needed to enhance the bland taste and lack luster seasoning. This seemed the best choice of the VERY limited menu. If you like lentils in various forms....you will love this place! 
This was to be a very special, long awaited meal...all that can be said is that we should have kept waiting!"}
{"text":"You have to go once just for the ambiance and the old building.  It's beautifully set and great for a romantic evening.  The wait staff was amazing... it wasn't particularly busy early on a weeknight so we were one of a handful of tables.  My water was never less than 3/4 full, everything was served quite quickly- and we even had a free sample of sorbet because our waiter said the entrees were taking a bit longer than he hoped.

We enjoyed the bread and the delicious olive tapenade they give to all the tables.

We also loved our appetizer- crab cakes- though were extremely disappointed at how small they were for the price. Literally about two bites for each of us.  Wish we'd known and may have ordered a second appetizer.

We got a caesar salad and root vegetable soup for a starter, both very good- soup rated as amazing in our book.

The entrees are where they lost the 5th star for us.  For the price we paid we really just were not overly impressed and I feel like we could have easily duplicated them at home.  I always hope when I pay $39 for something there are so many flavors I am blown away at all the happiness from my taste buds and I could never hope to replicate at home.  If they were both $10 less we would have felt better about it.

We ordered the miso sea bass and farm raised chicken with sauerkraut.  The sea bass did not taste like fish at all (which is a positive for me... I like fish but not 'fishy' fish), however the miso glaze was over the top salty for me and it overwhelmed the flavors of everything else. If you are a fan of asian inspired cuisine, and used the heavy salt, you would probably love it.  It's one of the house specialties so clearly lots of other folks enjoy it. For me there were too many noodles as well, I would have preferred more vegetables. I felt so bloated the next day from all the salt.
My husband had the chicken and really liked it- but wasn't too impressed with the homemade sauerkraut.  We often buy homemade sauerkraut from local farms and expected more of a muted flavor... this was strongly sour and tasted more like the canned stuff than homemade.  Again, probably more of a personal preference but most of it did not get eaten.

We did not have room for dessert, but ordered some anyway.  We had the s'mores cake and tasting of homemade ice creams.  Both very average.  We did get to sample their coconut dark chocolate sorbet too- and that was amazing.

We would go back and try different items on the menu, or for a special event, but we would only recommend it for the ambiance, not really the food.  Our in-laws were here years ago and said they hadn't returned because they were less than impressed with the food for the price as well- so maybe some things never change."}
{"text":"We recently had Thanksgiving dinner here.  We had a wonderful time!  We had to wait a little bit before we could be seated but the staff was very accommodating.  The food was excellent as well as the staff.  The owner of the Hyeholde stopped at each table at the end of the night to ask how we were.  The owner is fantastic and told us some fantastic stories about the historic restaurant, she even gave a book about the story of Hyeholde! This is a perfect, romantic and cozy place to go for any special occasion."}
{"text":"My boyfriend took me here for my 22nd birthday. It was such a beautiful and romantic place, I highly recommend going here with your significant other. It is located back in the woods in a giant mansion/castle building. Very beautiful! Just make sure you don't go there when there is a wedding reception going on in the back room - that tends to get very loud. Otherwise it's a beautiful place and the food is to die for."}
{"text":"Ambience and privacy.  Great food as well if you want american style. Deliciously and cared for prepared."}
{"text":"I was staying in the area for business and decided to have dinner tonight at the Hyeholde. And I unusual name for an unusual restaurant... It was extremely slow, and I was quickly seated and greeted by friendly hostess and cordial waiter. The menu was very limited & I thought of my dad who would never find anything on the menu to eat. I started with a mixed green salad that was not on the menu but the chef made me... It was delicious (but only contained greens, no tomatoes, no onions, no carrots... Strange). I then had the chicken with risotto mushrooms and greens. It was tasty & satisfying. I happened to look over at a table near me who is having the filet & she had ordered it medium and it was disgustingly raw.... I was glad I didn't order that. I've been finished with a chocolate dessert that was a mix of cake and jam and the small scoop of chocolate ice cream I personally of ever seen. All in all it was very good, but I wonder if it's not a bit overpriced for what you get."}
{"text":"Went here for the first time for our anniversary. Was a bit pricey, but the food was superb. We started by having a drink outside in the garden and moved inside to the main room for our meal. The owner was there welcoming guests too. The service was excellent in recommending drinks and food from the menu and telling us a little bit about the place. Great place for special occasions-truly one of a kind!"}
{"text":"I here for dinner this past Friday evening with my girlfriend in order
to celebrate my 30th birthday.  I had wanted to come here years ago
whenever I worked nearby but it fell off my radar until it showed up
on Pittsburgh magazine's top 25 list this year.  The restaurant itself
is a castle of sorts and quite impressive whenever you drive up to it.
It is secluded from the main road by a long driveway and trees and
gives you the impression that you have been transported over to
Europe.  The gardens surrounding the building are beautiful and help
to support this feeling.  We were able to walk them after our dinner
service had been completed and thoroughly enjoyed it.  The building and
its grounds alone are worth a trip to this restaurant.

Once inside the castle my girlfriend and I were seated in a medium
sized room with a large vaulted ceiling.  The plates had a picture of
the Hyeholde on them and the silverware was both ornate and dainty with
intricate holed patterns at the bottom.  My girlfriend and I decided
that everything about it reminded us of Victorian England.  After a
bit of a wait and some cocktails, we finally got around to ordering.
We decided to start off with soups for our appetizers with my
girlfriend ordering the seasonal soup (a salmon corn chowder) while I
decided on the sherry bisque.  My bisque was creamy with a slightly
sour taste from the sherry which I really enjoyed.  The corn chowder
was savory and tasted good with the salmon having very little
fishiness at all.  For my entree I decided on the Elk cooked medium
rare at the chef's recommendation.  It came with sides of roasted
beets and mushroom bread pudding.  I had forgotten that the dish had
beets on it whenever it came to our table as they looked like tiny
potatoes.  So I was pleasantly surprised by the flavor of beets which
I enjoy in my first bite.  The Elk came in two separate pieces and was
very lean.  It tasted much like a Fillet Mignon and my only complaint
with it is that I wish it would have been seasoned a bit more.  Still,
it was good quality meat.  Finally the mushroom bread pudding was
good, albeit quite salty.  Whenever it was eaten altogether with the
elk and beets, the salt was cut down and it ended up adding a nice
earthiness to the meal.  After dinner I decided to have a cup of
cappuccino in lieu of dessert.  It came served with 2 brown sugar cubes
and 2 white cubes on a spoon, a biscotti and was covered with quite a bit of froth.  As expected it was not a \"fake\" cappuccino and tasted quite
good, especially after the use of a sugar cube.

The bottom line for me is that I will definitely come back here in the
future.  It was nice to see the beautiful grounds and all by
themselves would have warranted a 5 star rating.  The food was also
good in its own way and I am looking forward to trying the salt block
halibut in the near future."}
{"text":"Don't be fooled by that quaint exterior....run, run far away and never come back!

I received a gift certificate to try Hyeholde after a friend had gone here in a date herself previously. Maybe there was too much hype, but on the night my boyfriend and I went, it was one bad thing after another. It was hands down one of the worst meals I've ever had.

First, we started off with barely being acknowledged by our server. And then we ordered, which included ordering our dessert, which we thought was weird. This dessert order included a coffee, which we wanted with our dessert and not before as we also ordered some alcoholic bevs. And yet the coffee came out mid appetizer, which we sent back.

The appetizer was fried green tomatoes and incredibly salty, almost inedible.

For our meals we ordered fish and chicken dishes. The fish was covered in tomatoes and acidic. The chicken was just bland.

Our dessert looked like they had cut it directly from a stale Entenman's box.

Our waiter was completely absent minded and frequently we had to ask another waiter for requests rather than our own. I'm not sure if this place thinks they're pulling the wool everyone's eyes, but it is not that charming, especially when the very expensive food is basically inedible."}
{"text":"Start off by saying the location of this establishment is beautiful... We've discussed coming here on a few occasions, just never really got the time! Plus I don't live in Pittsburgh, it was a special occasion.. So from calling to make reservations to letting the staff know what's bringing us to their restaurant, it all transitioned very easy... The ambiance inside is dim and romantic! A great place to take a gf, wife etc! Old rustic style farm house feel! The service was prompt, kind and professional ! They start you off with 2 types of bread followed by olive tamponade and butter... We both had soups... I had their traditional recipe that's been in the fam for 70+ years and it was amazing ! The other soup we had was their special...  Like tomato roasted red pepper if I remember correctly ! Our entrees were great pan seared chicken and pan seared trout! We both enjoyed these very much! Everything was prepped promptly and at the freshest it can be served! We finished the night by the fire place with dessert and coffee ! The desert is prepared fresh on location! And was amazing I had the apple streusel cake! You will def enjoy this place!"}
{"text":"This place had popped up on my radar when I was looking for a place close to our work offices to have a nice Dinner with my office team.

So on Tuesday night, I lucked out and got a reservation for 3 people (including myself) and it was a wonderful evening from beginning to end! Our server was Derrick and he was amazing - he welcomed us and then guided us thru the menu and even offered at the end to take us on a tour of the charmingly eccentric premises! From everyone's attitude, you can just tell that the staff genuinely enjoy welcoming people to this restaurant.

Ok, so on to food and drinks!  One of my colleagues who is vegetarian ordered the Sherry Bisque soup and told us it was the best soup he had ever had!! In fact he normally didn't order soups, but this dish made him realize what the fuss was all about. He also got the polenta cake and rhapsodized about the perfectly cooked crimini mushrooms. 

My other colleague got the chicken breast stuffed with sausage and found it a bit heavy going - he loved the taste and the accompanying heritage carrots were a special stand out but he thought the chicken tasted a bit gamey as it was free range and he wasn't used to such a pungent flavor. He also recommended ordering this dish only if one was super hungry cause its a massive dish!

I choose the Arctic Char aka a second cousin of the Salmon fish. It was perfectly cooked and seasoned and just a lovely medley of flavours on the tongue. I loved each bite as would absolutely recommend getting this item if it's on the menu (side note: I thought the herb butter milk jus was honestly totally unnecessary- the flavors of the Char were strong enough on their own!)

We decided to split one dessert - a white chocolate lavender panacotta with raspberry glacé and meringue. I'm not a fan of meringues generally, but this one was lovely. Dessert was the perfect end to the meal and then it was off on our tour.

You guys - (I'm bouncing with excitement just even thinking about it) this castle has hidden secrets - an underground passageway that leads to a Frank Lloyd Wright House (yes! On the premises !! I couldn't quite believe it either!!) to say more would be to spoil your own discovery - all I can say is be nice to the staff and maybe, just maybe you can also get a tour! Until then, my pictures will just have to suffice.

Absolutely recommend this place and when next in Pittsburgh plan to book again for dinner.

Yelp Review 55/2017"}
{"text":"I cannot afford to eat at the Hyeholde on my own but my company has our yearly holiday party there and I'm happy to eat & drink on the boss' dime.
Every drink I've tried has been yummy and the food is incredible. The portions are small but everything is pretty rich so you couldn't eat a huge portion. Their dressing that they use on their mixed green salad is amazing, I believe they sell bottles of it.
The atmosphere is really cool...rustic and they have fireplaces going in the winter. Just a really neat place if you're celebrating something special."}
{"text":"I recently visited here for the first time and loved it! I had the filet and was cooked perfectly, was very tender and had good flavor. Definitely better than Ruth Chris! I loved the Boursin potatoes, so savory and delicious! The service was extremely attentive and accommodating."}
{"text":"Beautiful setting & atmosphere, excellent service.  Delicious food.  Had the braised lamb shanks over grits with cauliflower and root vegetables- Stupendous.  Soemone else had the elk and raved.  I tried a bite- best red meat I've ever tasted.  Had the apple thingy for dessert, very, very nice.  Would highly recommend this place to anyone for a special occasion."}
{"text":"My wife and I went here for our anniversary upon the recommendation of some friends. We were not disappointed. The building was absolutely gorgeous. Once inside you felt like you were transported back in time. We were sat in the old hall (a large room with huge wooden beams, high ceilings, and an open fire place) which looks like it has been there for a few hundred years.  The drink menu was pretty extensive, and every drink we ordered was delicious. The food menu, while rather limited, had some really interesting options. To start I ordered the sherry bisque and my wife ordered the roasted beet tart.  The bisque was quite good. I didn't expect much from my wife's tart because I am not a huge beet fan, but it was fantastic. For our main course my wife ordered the scallops and I ordered the elk. The scallops were perfectly prepared and my wife loved them. The elk, which was a first for me, was fantastic. Because we were there for our anniversary they gave us a complimentary dessert, which was a nice touch. To top everything off, when they found out it was our first time there, gave us full tour, including going into the kitchen to meet the chefs. We can't wait to come back again, and we definitely want to try out their picnic menu once the weather is nicer."}
{"text":"My husband and I decided to come here for the first time for an early Valentine's Day date.  We rarely go to resteraunts such as this but after leaving,  we both decided we would like to come back . ( especially for the picnic option in the summer)

We both ordered drinks (him beer and myself wine) their wine was very good and he liked the beer options as well.   We started our order with sherry soup, which we advised we would share . Jenn , our waitress was kind enough to bring us two small bowls and spilt it. This soup was amazing and I can't wait to get this again the next time.  They also bring you fresh bread with softened butter and a pesto type sauce. This was very good as well. 

My husband ordered the short rib and I ordered the filet.  We agreed both were delicious.   The short rib was so tender you didn't even need a knife.

For dessert we had the chocolate torte, although a little small this was still delicious
.   At the end of the night, a woman came over to fill our drinks. We found out she was the owner.  She was great to talk to and it was so cool, talking to her. We actually found out the room we were sitting in used to bed a large bedroom with canopy beds inside.  It was so neat to visualize this, while you are in this beautiful place.

Although the pricing was steep, and you will most likely leave without any leftovers, the ambience and the service here is unbelievable."}
{"text":"Very expensive but well worth it for the quality of food and experience. Servers excellent. Great ambience with warm furnishings. Would be a fabulous place for a family Thanksgiving, Christmas, New Year's Eve/Day or other holiday meal if you didn't want to cook (if they are open on those days - not sure). What a wonderful place!"}
{"text":"Everything was wonderful. They said the elk is their specialty so I had it was was not disappointed! Highly recommend."}
{"text":"One of the best meals I have had in Pittsburgh. Fantastic setting. Super staff and the food was incredible. Froie gras to start off the night. Melt in your mouth. After the special salad that included pears and walnuts, we had Sea Bass that melted like butter on your mouth. Also had a nightly special of lobster and pasta in a light creme sauce. It's was amazing. Ended with a mixed berry galette and homemade ice creme. Magnificent !!
Really love the place  the attention to detail is amazing."}
{"text":"My husband and I went here for our second anniversary dinner and had such a lovely time. I was intregued by the menu - I love trying new things. When we saw how lovely the grounds were we were sold. 

The place did deliver. A very warm and friendly staff and the dining room was elegant with half timbered details - felt very old england or northern france. The wait staff was very gracious and service was fast. I started with the quail and my husband ordered the boar ribs. both were perfectly prepared and looked as beautiful on the plate as it in my mouth. 

For the main, I had the elk - something new for me and it was delicious. My husband ordered the steak - melt in your mouth. For dessert I had the apple tart and an espresso. While I have had better tarts in my life, the crust was buttery and flaky - excellent. My husband had the 4 scoops of ice cream - I have to say his was the better choice. 

We had a lovely meal and really enjoyed ourselves. The wine was generously poured and paired well with the meals. In the warmer months you can order picnics to enjoy on the grounds, something we are looking forward to trying."}
{"text":"My boyfriend was dropping me off at the airport and this place came up on yelp. It's so fancy! There is valet parking when you drive up. It looks like a small castle. We had foie gras as an app. We both had 2 bites but it was worth it. The bread it was served on was just right. The sauce and apple butter. I got a pomegranate martini! It was perfect. I got the trout that was sort of Mediterranean. It was excellent! Wouldn't change anything. My boyfriend got the filet. He said the best thing was the potato layered side with cheese. He said the steak was just fine not the best he's ever had and kind of a disappointment. I am already planning on when we can go back. I was dressed business casual because I came from work. I wouldn't recommend jeans. There was a couple there that was especially dressed up so you could go all out here."}
{"text":"This cozy little mansion looks like a castle as you drive up the long driveway. It felt like stepping back in time as we drove up, and equally as much as we enjoyed our meal inside. Most of my experiences here have been the chef's table, and as such some of the meal comes right from the seasonal menu, but with a twist or spin on the ingredients.

Highly recommend to anyone with any slight interest in food, to do the chef's tasting or table at least once in your life. I would do this again and again because you never really know what you're going to get and you come away thinking \"Wow, how delicious (your favorite here)!\" It really gets a foodie's creative juices flowing. Another suggestion is to get the wine/drink pairings as well, as it really takes the whole experience to the next level.

This is definitely a hidden gem in the Pittsburgh area!"}
{"text":"I was at the Hyeholde for a wedding and found the property and building to be breathtakingly gorgeous. I love old fashioned homes and was surprised to learn that this one is not actually as old as I suspected (it is less than 100 years old, apparently). The bathrooms were clean, the wait/bar staff was attentive and the food was decent. I didn't love it, but it is always difficult to judge the quality of the food based on a private event. Be advised that it is not safe to walk around here in high heels as everything is cobblestoned, gravel or narrow stairs. The only negative comment that I have is that the valets were extremely rude (an older gentleman in particular, who seemed to be the head valet). For example, rather than politely asking people to move away from the car load/unload area, he screeched \"GO INSIDE!\"."}
{"text":"In the past I have always had a wonderful experience but this time I was extremely unhappy! I had a Birthday cake, two presents and 4 Easter Lillie's because  my friends and I always celebrate our Birthdays there for the past 5 years and I simply asked the valet  if they could kindly help me with the items and they said they could not!!!! Not their policy to help customers! I then went into the restaurant and asked if someone else could help me  and another customer that came after me went in front of me and  ignored me and was walking into the restaurant and the lady in the front stopped him and he said that he had a reservation just like me and she then showed him their table before me! I then went outside myself and had to get everything out of the car and then she finally seated my sister, friend  and I who just came in! We were seated and I said that I was unhappy with the service and she ignored me and was really rude but she made a remark that the couple beside us moved because I ran into her and that was not true!  My sister and friend were seated with me and they and I said that didn't happen! The couple beside us changed tables the servers said because they wanted to be seated by the fireplace because the room was cold! I then said I need to speak to the manager and he was very understanding kind and polite and apologetic and said that she should have never said that especially because it was not true and even if it was true, you never say that to customer!  The food took forever also! I give this restaurant a 1 star! The only thing that was great was the waitress and server! They were excellent! Will never go back. Used to love this restaurant but the customer service in the front is now terrible and needs to changed!"}
{"text":"My wife and I have been here several times, but for us it's a special occasion restaurant because of the cost.  It was our 30th wedding anniversary and we didn't want to go into the city, so we decided to have dinner at the Hyehold.  

The atmosphere is quaint, but I'm not as impressed as most people.  It is very relaxing though and a nice change from most places.  

For appetizers, I had the foie gras and my wife had the garlic vegetable soup.  My foie gras was absolutely wonderful, but was the size of a silver dollar for $18.50.  My wife said her soup was good, but nothing exceptional.  For dinner, I had the braised lamb shank, and my wife who doesn't care much for meat, had the roasted vegetable pasta because it was the only meatless option.  My lamb shank was very good and was served with roated vegetables and grits.  The grits were cooked perfect and were flavorful.  The lamb, although very tender, lacked seasoning.  My wife said her pasta dish was ok, but needed salt and pepper to give it flavor.  She ate it, and enjoyed it but it wasn't worth $25 for pasta with a few vegatables.  For dessert, I just had coffee, and my wife had the grasshopper cake.  She siad it was very good.  Overall, the food here is good, some of it excellent, but not worth the price.  

Sure, I'll go back because it's the best special occasion place west of the city, but I always feel I've paid too much for what I got at the Hyehold."}
{"text":"I was in town for a conference and looking for a good meal at a place off the beaten path.  
I drove past on my first night in town and the second night decided to \" treat myself\" Ala Donna and Tom in parks and Rec -and boy did I do just that!

The lemon ricotta gnocchi was amazing and the arctic chard was like taking an everything bagel and coating the fish in it- yum!

I topped it off with the panna  cotta which had a lemon glaze and came with blueberry sorbet.  

I have to add that I just showed up without a reservation on a Saturday and they accommodated me with an outdoor patio seat where there was a fire going an throw blankets if ya got cold.  So welcoming and great!"}
{"text":"Food was great, service was absolutely top notch, the chef gave us a personal tour of the building since we were there on a Tuesday night. I have experienced fine dining in many countries and all over the US, Hyeholde is one of my favorites. I cannot wait to go again! I say the restaurant is \"family friendly\" but only if your children are very well behaved and will not take away from the incredible ambiance. Leave the kids at home and treat yourself, it is worth every penny! Order every course, you will not be disappointed...honestly, stop reading and go!"}
{"text":"What a wonderful experience.  I surprised my gf by bringing her here for Valentine's Day.  

As soon as you drive into the gates you know you're in for one heck of a dining experience.  Very scenic!  Free Valet and coat check as soon as you reach the top of the hill.  We were seated right away (even though we were half an hour early).  

I had previously notified the restaurant that my gf was vegan and this did not pose a problem at all.  The chef had marked off which items were vegan so  there would be no confusion about the ingredients used.  Usually vegans get left out when it comes to prixe fixe menus or anything really.  Luckily, the chef and pastry chef made sure she was able to get a dish for every course.  Now, these weren't your regular ol' salad dishes with a side of fries that poor vegans usually get stuck with.  Each course was well planned and had stellar flavor.  The gf was constantly in shock over how each course had amazing flavor and technique.  I, being an omnivore, had the most delicious scallops for one course and later on had a very tender filet.  The mountain chocolate lava cake at the end was also superb.  We both left highly satisfied and so stuffed it hurt.  I did like the portion sizes - I hate it when you get an obscene amount of food because it makes it unappetizing and you never have enough room for the next course.   Instead, the chef used the right portion to satisfy your taste of each course and still feel full at the end of all 6 courses.

I would definitely recommend coming here to celebrate a special day.  Vegans, you finally have a fancy place to eat!  The ambiance and food were equally superb.  I love that this wasn't one of those places where you are essentially paying for the ambiance and mediocre food.  I will be coming back!"}
{"text":"This restaurant may promise a little more than it delivers. If this review was only on entrees and ambiance it would be a four or five star review.

First the restaurant is gorgeous and a great place for a special dinner, work dinner, wedding, bridle shower, etc. The wait staff was attentive but seemed over whelmed by our group of six. We had to wait a long time for drinks, bread, and just overall service including getting salt, pepper, refills etc. This restaurant seemed more focused on couples than are larger business dinner.

The real downfall with this restaurant is that only some of dishes like the bread pudding that comes with the elk, and the sea bass were truly exceptional. Other dishes left much to be desired. When you are paying $15+ for side salads and appetizers you expect them to be more than an after thought. While the entrees are very well prepared I would recommend saving your money and skipping the appetizers and salads. 

Everyone in our party enjoyed their entrees, with the sea bass coming out on top as the favorite. You could easily make this dish at home with a bit of white miso glaze and a good piece of fish. The dish was very well prepared and full of flavor.

Desserts were also good. Nothing amazing, just nicely prepared small deserts. They are portioned for one person, and not overly rich or sweet. 

Overall this is a beautiful restaurant with great entrees. Grab drinks and an appetizer somewhere before hand and then head over for your entrees!"}
{"text":"This is a tough one for me.  This is a beautiful, beautiful special occasion restaurant.  If I were having a wedding in Pittsburgh I wouldn't hesitate to hold the rehearsal dinner here.

The service was sooooo welcoming and accommodating.  Normally with my various food sensitivities and general fussiness I can end up feeling like a total PITA at any restaurant.  But Hyholde seemed to have been created with fussy people like me in mind.  My waiter literally lived for adapting the dishes to whatever I could or could not tolerate.  The service was top notch and I was not made to feel stupid or out of place for being: a) alone, b) in only a sweater, jeans and some topsiders I luckily had in my car (since I actually had driven up in flip flops.)

I only came here on a whim.  I was up in Moon Township checking out the campus of Robert Morris University (very nice!) for a friend.  It was St. Patrick's Day, it was starting to get dark and I was very hungry.  I stopped off in the Ground Round for amusement factor (when was the last time you bumped into one of those!?).  I was downing a Yuengling, eyeing the menu and cringing a bit when inspiration hit and I check my Yelp app.  

Hey, there is a really nice 5 star restaurant right near here! Yay.  Maybe they will have a bar where I can grab a drink and an appetizer.  Obviously I am not eating at a really nice restaurant because I am a) alone b) in jeans and flip flops, and c) not spending that kind of money.

So up I drove, up a long driveway which had a sort of Bavarian castle on the end.  The minute I saw it I knew I wasn't leaving, wasn't doing a mere drive by and that, yes, I was about to spend that kind of money.  Especially when the valet parker (they only have valet) informed me that no, they didn't have a bar but that it did not matter one bit that I had no reservation and was casually dressed, that they would be happy to get me a table right away.

I consumed:

Olive tapenade (free with bread), crabcake app, special tortellini app, side pasta, choco bread pudding, 2 glasses of wine.

The bill was surprisingly not so bad for all that. Maybe $60 or $80 with tip?

Now the tough part: I didnt love the food (wah wah).  I really liked the free olive tapenade. I was too full to truly enjoy the bread pudding but it was quite good. The other stuff was, sadly, a little disappointing.  Also the tortellini dish was a bit cold. 

Still it was a gorgeous location and I definitely will be back!"}
{"text":"I took my wife here for our anniversary and it was definitely worth the EXPERIENCE. I don't live in PA so I would not have found this without GPS. Even my GPS got a little loopy when we were 3 minutes from the place.
It's very nice but if you go at night, the route, or back street/driveway to get there reminds me of an a place Blade AKA Wesley Snipes would go to find vampires. Very creepy elegant. If that makes sense. Nice...but at the same time you are waiting for something to jump out the woods. I would imagine the place looks even better in the daytime. I digress (the grounds are nice though)
The valet service was great. Some say \"free\" but I guess coming from DC I don;t think anything is \"free\". But I didn't mind providing a tip. I figure if you are going to spend 200-300 on dinner, you probably SHOULD be tipping. No time to be cheap now lol (no offense to those that didn;t because trust me..... :-/)
It was Valentines Day as well so they had a prix fix menu and the service was excellent. For some reason I get the impression, the service wouldn't be bad on a regular day as well. The inside is really elegant. I would come here for the ambiance alone. Probably good for a proposal or something to that effect. Its REALLY in cut. I am not a foodie so I can't really give a good review on the food. Was it fast, YES, did they accomodate even when I sent the lamb back (its not my taste) for the Filet Mignon - YES! I was surprised as I usually don;t eat LAMB and FILET MIGNON on the same day...hell not even the same YEAR probably lol. Needless to say it was my first time tasting Lamb and it wasn;t that it wasn't prepared well, its just not my THING. The Filet Mignon was great though! The Sherry Bisque was different and good. Again, I don't sway from my normal often so it was more for the EXPERIENCE for ME. The alcohol was very ALCOHOLIC :) I don;t remember finishing it but it was good. 
So basically, this is a great place for special occasions (anniversaries, proposals, etc) but only for a person that really takes in ambiance and appreciates being treated like a king or queen or at least dining like one. For foodies, this is definitely a place you want to go to. Also to my surprise their were all types of people there to dine. I expected to see all fur coats and minks, but there was a little of everything..that was able to splurge a little."}
{"text":"This restaurant is on a Pittsburgh's best restaurant list and it should be. Maybe the best restaurant that we have found in Pittsburgh so far.

They brought out a olive tapenade, that was to die for.  This has turned me into an olive fan. Before, I just tolerated them. It came with crisps and breads.

We had a nice chat with the owner (or one of them - not sure) and she was lovely. She suggested the elk. We had a few glasses of wine.

My husband had the elk and I had the fresh sole flown in from Dublin. Both were cooked to perfection. I usually give up on fish at restaurants, because I want them perfect and this one was.

We finished of with dessert drinks and shared a homemade apple dessert.

I hope to go back soon.  Wonderful night out without the kids. There were some older kids there but little too pricey, I think for a whole family and for kids who woof down anything in their path."}
{"text":"Excellent everything.  The elk was phenomenal.  The bread pudding dessert was fantastic.  Great service."}
{"text":"We went on a Saturday night.  The meal was very good.  I had the elk, which they said would be med rare, but which was actually more rare than that.  It was very tender and tasty though - encrusted with something a little nutty tasting, and slightly too salty.  She had the trout which she liked, but the skin was left on - normally ok, but which ended up getting a bit soggy in the sauce that it was in.  I also had the lamb stew - at first that sounds a little odd in such a high end restaurant, but given the castle like atmosphere, it seemed appropriate.  Very tasty, and I would even say luxurious for a stew.  The only thing that was a bit of a disappointment was that there was some type of party going on on the first floor, and there were several kids yelling most of the time that we were there.  Not what I expected to have to deal with at this type of restaurant."}
{"text":"This was my first time at Hyeholde and I only remembered that it was listed in Pittsburgh's Best Restaurant of 2014 when I went in search of restaurants near the hotel where out of town family members were staying and I was looking for something a relatively close drive for all of us to meet.  The restaurant and the surrounding grounds are charming - it was just unfortunate that it was raining because we had hoped to sit outside.  The place is rather darkly lit which was my primary complaint but again the overall decor was dated yet whimsical.  We were under-dressed - when we arrived my 2 male relatives were told that they recommend that men wear a jacket, yet the web site stated business casual (which is generally no jacket).

Our server (who we confirmed has worked there for quite some time) was unable to answer detailed questions about the wine list or the food menu and had to excuse herself to ask the bartender about the wine and again to ask someone about one of the dishes on the menu that wasn't a special.  She was nice, but service was also slow and while they had a number of people there, it wasn't all that busy for a Saturday night. 

For the appetizer we ordered the roasted mushroom pate, which was delicious, but the portions were very small for three people so we all wished that we had ordered another starter to share.  We also ordered a nice bottle of red wine, Two of us opted to have the braised lamb shank and my other family member ordered the pine nut crusted elk.  The lamb was accompanied by grits and cauliflower with roasted root vegetables and the lamb was covered in a lamb gravy.  The lamb was tender and fell off the bone and was cooked to perfection.  The elk was tender and was not very gamey tasting but the star of that dish was the side accompanying mushroom bread pudding about which my relative raved.  We had no room for dessert after our rich and filling entrees so unfortunately we missed out on that during this visit.

Overall I would give the food 3.5 stars but I would give the ambiance/decor, service, and prices 2.5.  While the food is good, I actually feel that the menu prices are over by at least $5 per entree for the area in which the restaurant is located, and the wine is also very overpriced - the least expensive bottle we could find was $47 for an average red blend, yet I've seen similar quality reds priced at around $38 at Casbah (for some reason that is my measure if only because they consistently have lamb shank on the menu and their wine list is out of this world).  One can get Elysian Fields Farm Lamb Shank at Casbah in Pittsburgh for only $34 versus the $38 that the Hyeholde is charging for it in Coraopolis and the lamb shank at Casbah is a better tasting dish.  I would go back here if invited to go, but I would not choose to go here again of my own accord unless they made some updates to the lighting and decor and made their prices more reasonable for the area where it's located."}
{"text":"A beautiful and romantic restaurant, perfect for sweeping your sweetie off their feet.  DH surprised me one evening to celebrate my new job offer.  I was stunned by the beauty of the building.  It was gorgeous ivy covering the rooftops.  I wish we had come a little earlier, so that we could have taken some time to walk around on their grounds.  This would be the perfect place to get married or have a rehearsal dinner.  The inside is very stately, and maintained quite well.  As we walked in we were greeted by two hosts.  We were then seated promptly.  Our waiter came by abruptly and took our drink orders.  He seemed like in a rush, and didn't explain the specials in a slower manner.  That was pretty much my only gripe with the restaurant, however I don't think it is really a reflection of the restaurant as much it was the problem with the waiter.  He was probably having an off night.  I ordered a hyehold lemon tea cocktail that was delish!  I can only describe it as a mojito lemonade with a dash of tea.  I would definitely order it again.  DH ordered the elk for his entree, and I got the house special lobster with fettuccine.  It was amazing!  I just wish there was more of it.  All in all it was a great night out with my sweetie.  It is an expensive restaurant, and you are definitely paying more for the ambiance and location then the food."}
{"text":"Attended a business dinner in their banquet room. The building is gorgeous and not only were we impressed with the warm cozy feel of the banquet room in the winter, but could see how nice it would be in the summer with huge windows. On our way out we looked at the upstairs room and felt there was a lot of charm and places for special romantic dinners. This is the best service I have ever had in my life whether talking about the servers, valet, etc. They greeted you the moment you walked in and were attentive the entire evening. The food is not extremely fancy or inventive, but they make classic dishes very well. The creme brulee was a highlight. This is an excellent place to have either a gathering or for a special occasion dinner."}
{"text":"I was in town for a business dinner, the hotel recommend this awesome establishment.  Great atmosphere with an old world feel.  A very eclectic menu, wherein the taste surpassed the visual appearance, which was incredible.    To top it off the staff was warm and knowledgeable.  I will be back!!"}
