{"text":"Hotel Herman is an amazing restaurant and our dinner there was one of the best meals I've had in quite a while! Everything on their menu is very seasonal and fresh and the flavors of each dish were very balanced, which is definitely not an easy feat to accomplish. We were lucky enough to try almost every item on the menu and all the plates were great with our favorites being the cold fennel soup, the duck, and the sweetbreads. The desserts and the drinks were also amazing and our servers were very knowledgable and provided great service. If you're ever in Mile End or Montreal in general, you should definitely hit up Hotel Herman!"}
{"text":"A cozy place with lovely service, nice ambiance, and good food! Loved the vegetable dishes, especially the eggplant was very well cooked and flavorful =D"}
{"text":"An unassuming restaurant brimming with wonderful local produce, meats, and cheeses. Great service, great food. This was the dining highlight of my Montreal trip and I look forward to returning."}
{"text":"We came for dinner. We had 6 dishes. The first was oysters, they were lovely, well-shucked and juicy. Then the razor clams and snow crab, both were refreshing and delicious with a pretty and unique presentation, but I would lean toward the razor clams if you could only choose one. Then, the venison tartare which was Dijon-ey but good- what disappointed me was that it didn't come with toasts or anything to serve it onto, we had to order (and purchase) bread separately. The bread, however, is housemade and delicious. Then came the sweetbreads which were tenderly cooked and served in a delightful sauce. Finally, we ordered the duck- I would pass on it next time. It was rushed (the waitress forgot to put the order in) and tough and slightly gummy. We skipped on dessert and coffee but were pleased with the cocktails and the wine list. The decor is cute and cozy and has an open kitchen concept. I would come again to sit at the bar with a glass of wine and a cheese plate. 3.5 stars."}
{"text":"This place is absolutely outstanding.  From their cocktails to their extensive and well-curated wine list, to, of course, the food. The presentation and preparation are both exquisitely cared for. I've never had something that didn't surprise and impress me. It is consistently excellent.  Be prepared for rich though. Sweet breads, bone marrow, duck egg, venison tartar, are good examples of the kinds of items you'll find on the menu. Even the vegetables are likely to be confit! This pleases me immensely but it isn't the place for you if you're looking for a light salad.   Order a few dishes and share. This is definitely the best way to go. The plates are a little small, but with how rich they are you won't want bigger. The best is to be able to try a few things and really get a feel for the kitchen's style and skill.   an important word of advice: Do not skip dessert. the panna cotta always blows us away (and my partner is generally not a fan)  The servers are knowledgeable and attentive and always so sweet. The ambiance is relaxed and refined at the same time."}
{"text":"Went to Montreal for a Bachelor Party on Valentines Day weekend....yes it's true...  All top restaurants were totally booked up over a month in advance but the groom was a foodie so finding a great restaurant was a must.  After doing some extensive research I came across an article that praises Hotel Herman as a MUST try restaurant in Montreal, double-checked Yelp for some positive reviews and gave them a call.   They said they were fully booked for reg dinner time but was able to accommodate seating for 12 for either 5:30pm or 9:30pm.  GREAT, we'll take it!!!  Went there on time and was pleasantly greeted at the door. Seating for 12 as promised on the side of the restaurant next to the horseshoe bar.   They have a good selection of drinks which made the fellas happy, I ended up having 2 Old Fashioned's which made me happy  I was disappointed they didn't have the bone marrow caviar mashed potatoes I read about as they were working with a different menu that day...but what they did have definitely made up for it.  Venison Tartare, Beef Cheek, Albacore Tuna, Blood Sausage, Duck Breast were a few of the items on the menu, we ordered multiple plates of most of the items on the menu and everything was awesome. Everything plated went together beautifully.  From beginning to end it was a great experience. Decor and ambiance was nice, staff was friendly, chefs were highly skilled. All the guys were full and had plenty of drinks in them for $100 each including tips and taxes  Foodie Groom loved it and said he'll surely be back with his soon-to-be wife the next time they were in Montreal.   5 stars all the way!"}
{"text":"Everything about this place is perfect. Sophisticated service, food is on point, room is cozy. A new favourite!"}
{"text":"Sexy decor Sexy cocktails Sexy bites  All the waiters were extremely attentive. The cocktails and food were the best I've had in a loooong time. The attention to detail on their plating and flavors were just spectacular. I thought I was in the SF food scene because of their fresh take on the plates like bar agricole. They played great snuggly music from a record player. What else can I say...  Grab a date and just go!"}
{"text":"They were a huge help in getting me a reservation for Valentine's Day and responded to questions immediately.  Their service and patience with our changing plans was impeccable... so much so that I had to leave a review.  Very amazing design as well."}
{"text":"Excellent food! Great date night place. The place for foodies.   Had the venison tartare and it was one of the best tartare I have tasted to-date. Very flavorful and fresh. It was deconstructed so the bread crisps were sprinkled on top. Almonds was a very nice touch.  Also had the Sweetbread with zucchini rolls and flowers. Sweetbread was laced with a drizzle of an umami/balsamic sauce which paired very well. Best way prepared - not overlooked and still moist.  Wine was very good and was often a taste before deciding on one. Service was excellent as well. Definitely will be back"}
{"text":"The food overall was good. The duck&carrots and the foie gras with pear and bread crumbs was great.   The pacing could have been shorter between each dish as there was a decent wait between each dish. Even 5 minutes less between each dish would have made a good difference. I originally expected maybe waves of 2 dishes or so, or some staggered close to that. Not really holding it against them but It didn't help that our foie gras dish was originally forgotten either."}
{"text":"Great Ambiance Knowledgeable staff Great wine list Sexy food. Tapas style plates. The U shaped bar was an eye catcher, if you're deciding to go to HH make sure you're seated at the bar. Prices are a lil on the expensive side, but that's expected from a modern Gastrohipsterpub. Should've hashtaged that."}
{"text":"Tremendous mid-afternoon find for a damned delightful glass of red (to satisfy any palette). The beet soup was tremendous, the fromage local and lovely (served with raw honey - bam).  AND they're open Mondays."}
{"text":"Great food, funky atmosphere, knowledgeable servers. We sat at the bar, which is the best place to be in the middle of the action."}
{"text":"Bien aimé l'atmosphère alentour de l'îlot. Séduit par le charme des lieux. Accueil et service chaleureux. L'effort mis dans l'assiette est de de même nature, généreux et de bon goût dans tous les sens."}
{"text":"Hotel Herman is no doubt Mile End's most exciting new restaurant.    Art Deco accents successfully blend with the industrial décor, creating an awesome modern metally-woodsy feel that still conveys a warm atmosphere. The departure from the usual \"rustic\" - or, fake-old - décor is welcome, and the long horse-shoe bar is wonderfully reminiscent of Paris. Take a seat.  Not a hotel but just as welcoming, the service at Herman is professional, friendly and relaxed. And no dinky rules about having to eat to drink - do as you will and no one will stop you. Nice!  We started with a New York Sour - a whiskey sour with red wine. Delish.  The portions are small, so we ordered a couple plates per person. First, we had the carrot salad with buttermilk cheese. It was good, certainly beautifully plated, but unexciting.  Next, we had the oyster mushroom salad with sweet onion puree, snails, and garlic chips. It was amazing! The mushrooms were flavourful and the snails were tender and buttery without being heavy. The pan-fried halibut with fennel and dill was also delicious. The different flavours complemented each other perfectly.  We ended with the Manjari chocolate dessert that was paired with cinnamon creme, sponge toffee and sea buckthorns (the red berry on top). Without being too cochon, the dark chocolate dessert was totally satisfying. The berries added a nice freshness, and the sponge toffee reminded us of our childhoods, in a good way.  All in all? Hotel Herman is a winner, and unpretentious about it. The team from Salle à Manger did great - they succeeded in offering something slightly different than what's already been done in a neighborhood that's home to a million restaurants. High five, guys.  Photos: http://www.belledenuitmontreal.com/2012/08/21/hotel-herman/"}
{"text":"I don't leave very many 5 star reviews. In fact, I can't remember the last time I did. Hotel Herman was so perfect, on so many levels, that I just can't help myself. I'd leave six stars if it were possible!  We found it quite by accident. We were walking past and said to each other, \"that place looks cool\". So, we stopped. At the front door was owner, Dominic. What a great first impression. He found us some seats at the bar, which by the way are the best seats in this house. Next came the bartender/waiter, Louis. Knowledgeable and extremely competent, he led us thru the menu like a pro. He also was easy and fun to talk with.   The food was simply, spectacular. We ended up here three separate times during our 6 day stay in Montreal. The chef was in the kitchen on each of our visits. He does a great job of using fresh, local ingredients and the menu changes daily. The duck egg with ramps and fiddleheads was particularly interesting. We ordered it twice!   The space was a combination of elegant, simple and cool. The U-shaped bar dominates the center of the room, and it's where you want to sit, if you can.   Polished service with a local flair, outstanding food prepared with thought and creativity and a beautiful room.... What more can you ask for in a dining experience."}
{"text":"Very adventurous way of preparing and serving food. Textures, colours and taste come together in a beautiful way here. I will definitely be going back to keep exploring their creativity. Portions are kind of small, so order 2-3 plates depending on your appetite. Kind of expensive, but if you are looking for a treat and something out of the ordinary - go for it!  Some of today's menu highlights: soy milk jelly covered snow crab, fresh morels with violets and blood two ways (puréed and charred). Enjoy!"}
{"text":"On a Wednesday evening, the place was not very busy and we did not end up needing reservations.  The dishes combined various elements that created fun and exciting flavors. One example was a fried mussel, roasted broccoli, and pea puree dish. The ingredients did not seem to make sense on the menu, but they did on the palate.  A selection of 2-3 craft beers, including the delicious Saison du Tracteur.  The portions are a bit small, so it is recommended you order 2-3 plates per person (which can be $30-50).  Three plates and three beers was about $70."}
{"text":"5 stars for the food. Portions are tiny but full of flavor. 4 stars for the uncomfortable seats at the bar and 3 stars for the service. Wine list was pretty good, slightly over priced as most wines are in Canada."}
{"text":"De ce petit espace quartier Mile-End se dégage une \"vibe\" intéressante, installés autour de l'îlot central.   Je goûte les oursins, très frais et savoureux, même si le caviar masque le goût délicat du mollusque.   L'agneau est correct, sans plus - un peu dur à mastiquer même!  Je trouve toutefois qu'on y retrouve de beaux produits originaux, comme la salicorne, cette herbe croustillante que je déguste trop peu souvent."}
{"text":"this is the type of place that makes you feel like you never left the LES or BK. cooly chic decor. creative and inspiring menu (so creative I barely understand it) that changes so me telling you what I ate, does no good. I'd come back to try ever dish if I could."}
{"text":"Well after reading some critics reviews I decided to give this new mile-end dig a try. Called same day for reservations at 8 on a friday and they only had the bar which in the end is the only place you should eat/drink at this establishment. The U-shaped bar pretty much dominants the space in such a good way save for a few tables on the side/front (bigger groups don't worry there is a section for you as well). It definitely contributes to the social aspect of drinking/dining if that's what you're looking for. Also the staff are friendly, very hands on and attentive.  They had Grolsch on tap which had me sold! But their classic drinks were truly well done. One of the better Old Fashioned's I had in a really long time and the Manhattan was perfect. My friend had a gin inspired drink called the 'bijou' with local quebec berries!  I read mixed reviews on the food so expectations weren't sky high at all but I was really impressed. Started off with oysters which were fresh and tasty and we both finished with the lamb which was interesting as there were two different cuts and cooks (seared and braised)....tender and not too gamey. Perfect!  Will definitely be back!"}
{"text":"This was my second trip to Hotel Herman.  My daughter likes the place a lot more than I do.  I think it kind of tries too hard.  On the plus side, they focus on seasonal dishes.  I do like the ambiance and cocktails (loved the Old Fashion), but the plates are pricey for what you get.  We had the Brussels sprouts which were too heavy with the hollandaise sauce; the Kohlrabi that had a nice crunch and tanginess; trout; and lobster--my favorite. We started with a dozen oysters which were amazingly fresh.  We sat at the bar and service was quite slow.  I would only go again for a full dinner if my daughter made me go.  I would definitely go for drinks."}
{"text":"Their menu is a lot of fun - I had the radishes, cucumbers and the razor clams. The preparations were all absolutely delicious and gorgeously prepared. The recommended wines were unique and paired very well.  Don't forget to have dessert!"}
{"text":"If you had to choose one spot to treat yourself to some seriously top notch upscale dining, Hotel Herman is the place to go - which is saying a lot when you have so many wonderful dining options to choose from in this city. And while the prices are what you'd expect from high end cuisine, the atmosphere couldn't be farther from stuffy and pretentious. The restaurant is beautiful, and is run impeccably. Try to get a seat at their beautiful U shaped bar, and then simply allow their friendly and extremely knowledgeable staff take care of you. You won't be disappointed.  My wife and I come to Montreal once a year around the end of December and try to enjoy as much of the amazing food in this city as we possibly can in five days and, at this point, we don't book our hotel dates until we can confirm our reservation at Hotel Herman - that's how much we enjoy visiting this wonderful restaurant. From the kitchen to the front of the house, everyone is at the top of their game here."}
{"text":"One of the best restaurant experiences we had in Montreal. We went two days after their three year anniversary. The atmosphere was cheerful, warm, and trendy. The walls were brick and the center of the space was dominated by a large bar for communal dining. The perimeter of the space was lined with two-person tables.  We started the evening with cocktails and a cucumber salad. It was amazing. Refreshing and just the right note to start off. The evening is sweet.  The night is young. We continued with dish after dish of beautifully delicious food. There was lobster bisque, lobster, and more. The presentation was artistic and the flavors were true to the ingredients with incredible combinations.  We finished with a cheese plate and some other dessert. I must admit - by this time I had a good buzz and my memories are a little fuzzy. What I do remember was that it was sublime. And the servers allowed us to leisurely indulge. It was a dream."}
{"text":"great ambiance, sexy apetizers and wine menu.  A bit pricy for what you get, but the food and service is good."}
{"text":"Hotel Herman commands a casual hipster vibe.  There's a large bar seating with a smattering of tables surrounding it.  We started off with some cocktails.  We tried the Pimms, Manhattan, Moscow Mule, and a few others.  The drinks were decent, though nothing mind-blowing.  I'd give it overall a B to B-.  Food-wise, we started off with the carrots.  The carrots were fantastic.  They were served al dente with dill sauce and buttermilk bits.  A-  Next, we had the beef tartare.  This was the highlight of the meal.  The beef was mixed with porcini mushroom emulsion and pine sprouts. The texture was a combination of crunchy and soft. It was probably the best tartare I've had in a while. A+  As our third dish, we had the leeks featuring chanterelles and quail eggs.  It was an interesting dish but flavour-wise didn't really do much for me.  C  We finished our meal with two meat dishes: the duck and beef.  The duck was served with garlic and savoury eggplant.  The eggplant was slightly bitter but had a bit of a sweetness to it.  The duck was tender and savoury. B+  The beef was served with cauliflower and thyme.  The cauliflower was cooked well and there was a crunchy sauce with it (that I couldn't quite identify).  The beef was cooked rare to medium-rare. B  For dessert, we ordered the Choux and White Chocolate.    The White Chocolate features soft white chocolate with blueberries, popcorn pieces and coriander.  It was an interesting mix with very different textures but it really wasn't that impressive.  C-  The Choux was a bit better, featuring caramel, brown butter and porcini.  B  We finished off with decaf Americano which was deep and rich. A+.  The service was somewhat attentive, although, on more than a few occasions, we had trouble flagging down the waiter to order more cocktails. Water was occasionally filled and dishes were cleared at a decent pace.  (The gentleman who was serving the customers at the bar seemed far more attentive).  Overall, it was a pretty good meal with a few misses."}
{"text":"I have to say that while I enjoyed the food, I was not overwhelmed or even all that impressed.  I thought the food was on the bland side, and the portions were quite small.  And it was pretty expensive as well.  I'm glad I went, but I would definitely not rush back.  I think Montreal has much better food to offer.  Oh, and the service was unbelievably pretentious."}
{"text":"Woah. This is some seriously involved food.   We arrived with a giant group of 12 people late on a Saturday night. They (amazingly!) were able to cobble together a table for all of us.   They had a great wine list, and the server was very knowledgeable. We were very happy with the white she recommended (oh I wish I remember what it was called).   The food was somewhere between crazy good and just crazy. First, when they say \"small plates,\" they REALLY mean small. The white asparagus dish was literally a single spear of asparagus. It was very good at first-- but the abundance of onions and pickled everything was just too overpowering by the end. However, my friend got the lamb and was dying a thousand deaths over its deliciousness.   I ended with the rhubarb and creme fraiche dessert, which was really awesome. If I went back, I might skip the mains, but I'd definitely get the dessert again."}
{"text":"A great dinner was had in this cool space.  Started with some lovely oysters that were briny and tasty.  The radish salad was a nice variety and started us off with a good freshness.  But the last two things we had were really really good.  The fennel soup was so good.  I should have gotten second bowl.  Served with a bit of caviar to add some saltiness, this was perfect on a hot day.  Also the sweet breads with black mushroom was a little bit of heaven.  The cheese course was nice as well and a better way to end than dessert.    Wanted to come back here before we left, but too many good things to try out and they were closed our last day in town.  But I would certainly come back.  Service was good, other than a snafu with our wine but overall a good experience and something everyone should try out.  Interestingly, when other restraint wait staff asked us where we were eating in Montreal, they all smiled and knowingly nodded when we mentioned Hotel Herman."}
{"text":"Went to Hotel Herman for a 9:30 p.m. reservation after getting shut out of many other places. We got there at 9 and were seated immediately, which was nice.  Per the waitress's recommendation, everyone ordered two plates each and they were all wonderful. Everyone truly enjoyed their food (my lamb in particular was cooked perfectly and juicy), though much of the menu was off-limits for some of the less adventurous eaters in our party. Don't come here if you're only down to eat meat and potatoes, because even the tamest dishes on the menu contain some sort of twist.  The reason for three stars only? Simple...my personal bill, after two plates, two cocktails and tip ran to almost $90, which would also be fine if I hadn't -- quite literally, I assure you -- left the restaurant hungry. The portions are simply way, way, way too small. This would be a lovely place to grab a drink and appetizer at the bar BEFORE dinner, but as a main meal it just doesn't cut it. And at the prices they charge, making this a pre-meal routine would also be questionable."}
{"text":"Great ambience and vibe. Food is refined and every bite is memorable. Extensive wine list.   Arguably, one of the best restos in town. An absolute shame that their landlords won't renew their lease."}
{"text":"Absolutely amazing! We spend 4 hours here and racked up quite a bill but it was a great evening with amazing food and amazing service. The seasonal menu offers lots of interesting options. The homemade bread is wonderful and the cheese board is delicious. Also delicious is the cold corn soup, the eel which is one of their signature dishes and the duck which is large enough on it's own as a meal. Most other plates are good for sharing as they are small so you can try lots of different things. The desserts were delicious and very interesting. We had the blueberry which has candied mushrooms, it actually works together well and the buckwheat chocolate dessert which was so amazing and interesting. We also had a few cocktails which were delicious as well. The service was truly amazing and the staff was so nice explaining the foods and giving us recommendations and always made sure we had water. Superb experience!"}
{"text":"Called at 8 on a Thursday night after deciding to try and grab a late dinner with a friend, got a table for 10:30 which was perfect and the friendly gent at the door had the table pretty much ready right on time. Service was helpful, wine list was full of new discoveries which our bilingual lovely waitress guided us through. My pork belly was perfect and nicely balanced with the turnip, my friend enjoyed his venison and said it was cooked just right (ie not much.) The chocolate dessert was dreamy and perfect, rich and bitter with a little caramel to balance out. The room is intimate and warm, wood, brick, with a square central bar where I recognized the staff from other excellent local restaurants just hanging out - always a good sign."}
{"text":"So. Good. Started with a cool fennel soup made with dill and caviar, and entree was sweetbreads which had me making contorted faces. Desert was a magical chocolate buckwheat concoction that I do not understand but loved. Waitstaff sort of forgot about us as they were closing, which was frustrating."}
{"text":"Disappointing meal. I found out this restaurant was listed as one of the top restaurant in Canada and decided to give it a try. However, it did not live up to its good reputation at all.  They have the concept of having small sized dishes and separate veggie and meat dishes. Bad idea!  We got potato and beets as our veggie dishes. The beets tasted like any beets salad from a food court. The potato was a little better, the dish preserved the natural flavour of potato but come on, I could make this dish at home... The meat dishes were smoked salmon and sweetbread. The salmon was ok, no surprises. And the sweetbread was flavourful and a little fatty( in a good way).  However, it's definitely not a top restaurant in Montreal. It's expensive($15 per dish), small portioned and got the taste just about average.  The service was slow, they need more waiters."}
{"text":"Hôtel-Herman has been on my list of resto's to try for the longest time. I finally decided to bite the bullet and make it happen on a Monday night with Mon and her bf. It blends in with its surroundings - kind of discrete and hidden but it's far from it with a steady reputation (#40 on Canada's 2016 100 Best List).  The horseshoe shaped bar that takes up most of the restaurant is stunning. Very modern and sleek interior. Cool that they have a turntable near the front. So hipster.  The dinner menu reminded me a lot like the one at Cadet. Simplistic front and simple, short descriptions.   The food here is all about small plates. Creative, sophisticated brilliance.  - Bread ($2.00) - the bread is made on site (which I'm a bit surprised at given Guillaume is across the street from them) but that shows the extra effort they put into the food. Nice crusty exterior, soft airy inside.  - Shrimp ($14.00) - horseradish and daylil. Super interesting dish as the flavours and textures were unique and inventive. Shrimp were perfect and the foam/crumble thing was nothing like I've had before.  - Chicken ($18.00) - coffee and morel. I would never have expected coffee and chicken to pair well together but lo and behold, it works. Earthy, rustic aromas.  - Eel ($14.00) - peas and lemon balm. This was HH's special of the night. Couple asparagus thrown in for good measure. The eel was an interesting texture.  - Lamb ($23.00) - white turnip and camelina. Lamb was tender, juicy and paired well with all the fresh vegetables.  Great spot to enjoy a couple small plates and drinks. Love the cool vibe, modern space and unique flavours."}
{"text":"So this place is a lovely set-up with a big long swanky bar smack dab in the centre of the room. Visually everything is quite stunning. The staff were lovely and helpful.   My one issue was actually the menu. It just wasn't my cup of tea. I don't consider myself to be a particularly  picky eater but I really feel this menu was made to freak me out. Horse tartare, rabbit meat, foie gras, duck, bone marrow -- these just aren't really my things. They are things that a lot of people like. But not me.   So anyways me and my friend ended up sharing marinated trout and the potatoes with Bone marrow (eek!), and a cheese plate. Presentation for the trout was gorgeous and it was all very tasty. I was squeamish about the bone marrow but I can say that it was actually pretty good.  I will say, I probably won't be back. The menu is too eclectic for my taste, but the overall experience was lovely and if you are into these sorts of things I would recommend you pay Hotel Herman a visit."}
{"text":"Great resto with a vibrant yet cozy atmosphere.. Tapas style plates that are great for sharing. Highly recommended!"}
{"text":"L'un des restaurants préférés à Montréal.  La cuisine est savoureuse et créative. Joli îlot central où l'on peut manger. Cela crée une ambiance unique. Belle carte de vin."}
{"text":"Another relatively new comer to the revamped upper St-Laurent street, Hotel Herman definitely adds to the hipster vibe of the neighbourhood. The decor is retro chic with it's dim but cozy lighting and a massive round table bar that makes up for most of the seating options.  The wine is mostly privately imported with a fair share of by the glass options, all of which are expertly described by the server. It's always reassuring when your waiter knows to the point what they are selling.  The menu is short, changing seasonally and consisting of about 15 larger than tapas items equally split among vegetable, meat and fish dishes.  We started off with their homemade bread, baked fresh daily until the crust has just the perfect amount of bite while the center remained still warm and soft.  We followed with a salad of finely shaved celeriac root served with a sea urchin and soya hollandaise. As we are big lovers of sea urchin, we would have liked the flavour to have been more bold. It definitely taste more like a regular hollandaise than a sea urchin delight.  Continuing on, being the carnivores we are, we had 3 meat dishes - a deer tartar coated in a porcini emulsion, fried sweetbreads with leeks and mustard and finally roasted duck breast with rye and salsify (oyster plant).  Although each dish was beautifully presented and well executed, they all lacked the 'wow' factor you would expect from such a high ranked restaurant. The tartar was a bit too much on the sweet side for us, which hid the taste of the deer. The sweetbreads were expertly fried but didn't stand out in flavour and finally the duck breast skin could have been crispier in our opinion.  Although Hotel Herman was not a hit out of the park for us, the ambiance, the overall quality of the food and the excellent service definitely makes this a pleasurable spot to spend a romantic evening. As the menu changes quite often, I can confidently say that we enjoyed this place enough to at least give it another try!"}
{"text":"I would have tried it all if I could. Maybe I should have. Maybe I'll be back. Life is full of what ifs.  Cocktail list is solid. Cocktails themselves are up there. With a twist. Possibly orange. Smoky. Fresh. Boozy.   Plates are surprising. Order a few. Then order one more. Share with your neighbors. Introduce yourself. Smile.  Don't overthink things. It's not what you were expecting. But it's everything you would have hoped for.  --  Disclaimer: Louis, server/beverage-tender, is rather charming in an understated kind of way and one can only wonder if he knows this. This (and my rather blissed out weekend away) may have resulted in rounding up to the fifth star, no shame."}
{"text":"Love this place. Food is special. Concept is unique and service is solid. Go there, eat that and drink that."}
{"text":"Joli nouveau resto semi art déco / industriel sur le Boulevard St-Laurent dans le Mile-End, belles présentations, bons plats et bon service. J'y retournerai probablement ! *Hipster place !"}
{"text":"Wow.  This was perhaps the most delicious meal that I've eaten in years!  Though somewhat expensive, all the food is inventively plated and the flavours complement each other so well.  Who would've thought that bone marrow, mashed potatoes and caviar would go together so well?  Not this girl.  We also had the marinated trout, scallops (PETONCLES!), beef, and a bunch of other dishes - and what I liked about this place is the unconventional combinations.  Yes, there were definitely some ingredients that would freak most people out, but the ability to make it all delicious is what counts!    Staff were also super friendly.  The only thing I would change is the entrance - which I think is the winter setup to keep the heat in/patrons warm.  After you walk through the door, you have to turn to the right - a lot of people were walking right into the glass partition thinking it was a door - oops.    My only regret is not having room for dessert!  I will return....."}
{"text":"Special occasions require special settings. For the night of my girlfriend's birthday, I wanted a lovely and refined experience with good service and atmosphere.... that also needed to be open on Monday. Not that easy given Monday is typically the Montreal restaurant off day! Looking through my options, I came to one that I had neglected from my to-visit list for a long time.... so off we went back to my favourite neighbourhood Mile End to go pay a visit to Hotel Herman.  Located on Saint-Laurent just south of Fairmount, Hotel Herman is a pretty unassuming restaurant from the outside and similarly inside. The space is focused around a beautiful U-shaped bar in the middle of the room. Small tables all around that and the open kitchen in the back so you can see the staff in action. No big visual flourishes on the walls. Lighting is low and the music is of the smooth jazz and soul variety so the general feeling of the room is relaxed but intimate. On this particular Monday, it was very quiet - much to the surprise of our waitress who stated that normally they get 70 people on Mondays but they only had 20 on this night! I can imagine the atmosphere being more energetic normally but this was very suitable for my girlfriend and I on this celebratory evening.   Drink-wise, I was in the mood for a cocktail, so I went with their Penicilline - scotch, honey and ginger. A nicely balanced drink. The sweetness of the honey dulled the scotch enough for my girlfriend to find it enjoyable but still leaving me for the scotch smokiness that I love. We also had some lovely glasses of wine from countries I've never associated with wine - Czech Republic and Greece. My girlfriend originally ordered a different wine which, after our waitress served it, she came back less than 5 minutes later and switched it - stating she wasn't happy with it. My girlfriend hadn't really been bothered by it but much appreciation to a staff that cares enough about those details. Throughout the night, the staff was friendly and sharp. Attentive but not overbearing which can be easy on the nights where there is no one in the room.  The dishes at Hotel Herman are of small-to-medium size with emphasis on doing ingredients in different ways on the plate. Our first starter was trout served in a gravlax-style with onions, beurre blanc and crispy seaweed. This first dish told me everything about what to expect from Hotel Herman - beautiful presentation, simple in terms of number of ingredients but so subtle, so refined and lovely flavours. The trout's texture was beautiful - firm but still delicate enough to come apart without much effort. Lovely smoked flavour that wasn't too salty despite its preparation - much to my girlfriend's satisfaction due to her hatred of salt. The inclusion of the sweet onions and the beurre blanc were nice compliments to the fish.  Our second dish was beet root served two ways with juniper berries and hay. Another beautiful dish visually although we were not blown away this time tasting it. Flavours were nice but not wowing truthfully. I did enjoy the crispy thinner strips of beet texturally but my girlfriend was not as pleased by it. We also got some of the housemate bread with butter. The bread had a nice crunchy crust but the interior was soft and dense.  For our mains, we started with the venison heart tartare with a porcini emulsion, spruce and breadcrumbs. Probably one of my favourite tartares ever. The use of the venison heart creates a more gamey flavour and texture. Also less fatty to taste. The binding felt minimal so there wasn't a gooey texture either to the tartare and the toasted breadcrumbs added a nice crunch to the mix. We ate this dish up pretty quickly. A huge hit for both of us.  Our other main dish was the veal sweetbreads served with parsnip gnocchi and mustard. Another excellent dish from the kitchen. The sweetbreads were nicely cooked and still had all that fatty goodness I love with sweetbreads. The real surprise to me here though was the parsnips gnocchi. A cool way to incorporate parsnips, the gnocchi had that strong earthy flavour of the parsnip all while keeping the pillowy soft texture one seeks in gnocchi.  Dessert wise, we decided to split the honey tart served with sour cream and sponge toffee. Nice crispy buttery tart shell on the outside, I really liked the use of sour cream to cut the sweetness from the honey filling. The sponge toffee adds an extra texturally element to the dish. A nice way to finish off the meal.  Safe for one dish, Hotel Herman met my expectations. There is a reason that this restaurant has been one of the best ranked in Montreal for three years and has made Canada's top 100. There is a level of attention and detail present here throughout the entire service that leaves you feeling that you are in good hands. Great service, simple but nice decor and excellent food - Hotel Herman is another great restaurant that gives Montreal a good name food-wise.  Cheers!"}
{"text":"Definitely a culinary experience, food was exotic and tasty and all together great. You get to try out a ton of dishes (in small portions), and it leaves you feeling full but not bloated or overwhelmed. Service was great, very helpful attentive waiters and waitresses"}
{"text":"I remember passing by the beautiful façade of this little joint on my way home one day and thought \"oh great, somewhere that I could possibly get a decent cocktail aside from Sparrow and Nouveau Palais in the Mile End!\" which, albeit painful for my financial situation, is great for my overall esprit and disposition.  I actually went by last fall to grab a quick cocktail after work, but alas due to Montréal's archaic lois sur les permis d'alcool, they only can serve a drink with a \"meal\" which I unfortunately wasn't in the mood for.  Today was the day.  Some lovely friends were visiting from out of town and seeing as though the place is a stone's throw from chez nous, we dropped in for a nice little early dinner.  We were seated at the bar I suppose because the server thought that we would take more than an hour to eat...and given how long it took for our food to arrive that seems fair enough.  We ordered a round of drinks and I think that the barman forgot to put any gin in my $9 Tom Collins.  Note to self: just go up the road to Lawrence or Sparrow if a decent cocktail is desired.  Anyhoo, after waiting for what seemed an inordinate amount of time, our entrées all arrived.  Our friends each opted for the asparagus and moules ('tis the season, après-tout) which consisted of a whopping five pieces of asparagus and six mussels a piece.  My date and I went with the canard goulu and tartare de cheval.  The canard seemed to be the winner, as it was not overcooked and tasted nice and ducky.  The horse tartare gave no surprises.  It seems as though the garde manger must have forgotten where the salt was...as well as the pepper, mustard, horseradish, etc.  On the plus side, the pain maison was lovely and tasty.  It seems as though the chef is trying to do his best to keep from offending the bland and genteel tastes of the Outremont richfolk who slum it out on the Main.  As for us, we went home and dove into some baguettes and cold cuts from Guillaume and Chez Vito as we all left quite hungry.  Unfortunately, tasteful décor and adequate service staff does not equate to a fine dining experience.  Next time I feel like a mid to high-priced treat, I'll just go to Comptoir or Lawrence or literally any one of the seven other delicious restaurants in the immediate vicinity."}
