{"text":"Update:

Unfortunately the management has changed hands. It is no longer an authentic Pakistani restaurant but like any other Indian restaurant with colored dishes and tasteless food. The owner is very courteous and did his best to impress is but to no avail."}
{"text":"This is a great place, the store is a small unit and not as big as other Indian stores but it serves your purpose. The restaurant is by far the best when it comes to indo-pak/bangaldeshi food. I am an Indian and I have eaten that all my life back home, in east coast and in bay area and this is some quality food. If people don't like the food then they are just not used to the taste but don't blame the authenticity because Imart is very very authentic. I simply love the place, its very cheap compared to some of the places I have been to in US with a greater quality."}
{"text":"Bought expired food, went to return it and the owner said expired food is fine...........hell no"}
{"text":"You've got your basic little mini-mart here--ice, water, ice cream, drinks, snacks, all in a small, manageable store you don't have to walk a mile in to get where you are going.  Just a fast convenient stop, close to my mother's where I was staying."}
{"text":"I-mart is a grocery store with a restaurant that has a good Pakistani chef if you like Pakistani food. Highly recommended for the adventurous food and the experienced Desi lover. I've eaten about everything on the menu and it is all good."}
{"text":"(NOTE: I-Mart review moved to I-Mart international Market review)
For restaurant (Indo-Pak cuisine)
1. Food = 4 (especially the kababs and nihari....didn't like the biryani...food in general little spicy on the higher side)
2. Service = 4 (well its mostly self service but the person/chef is very courteous)
3. Atmosphere = 2
4. Cleanliness = 3
5. Pricing = 4 (Looking at the taste, the items are well priced)

For grocery
1. Good collection of pulses, beans, tea, rice and frozen stuffs.
2. Halal goat and beef meat. For chicken crescent and tahir brand options are available.

Overall a good stop by local shop"}
{"text":"this is a shame! Muslims are not dirty people, and have high standards of hygiene, but you would never know going into this place!  I bought lentils one time from here, and it was infested with moths! they got into everything in my pantry resulting in a bunch of stuff having to get tossed, we had to empty our entire pantry because they laid eggs and made cocoons everywhere!!! EVEN MY COFFEE FILTER!!! (barf!!!)  Needless to say, they didn't even apologize or refund for that... and their meat sucks! they never cut it the way we ask, and last time they kept our meat in the fridge not freezer for 4 days, I forgot to pick it up, and they were like, we still have it! GROSS!  I never went to get my order, and will not go back here! Kosher Butchers here I come!"}
{"text":"Gross. I-mart has now expanded to include a restaurant just a few doors down from the market. Wise decision, because the market part smells whack. It is pretty obvious and common knowledge that they cut their meat in the back of the store. I suppose the market and restaurant deserve their own review, but I think its the same rating, I'll just merge them.

The market has your basic Indo-Pak foods. Don't confuse the owner for an Indian or Paki though, he's from Bangladesh. He's an extremely nice guy, but I feel like every since he moved from Tempe, near ASU, his store has just lost substance. If you need to buy substantial amounts of halal meat I suggest you go elsewhere, probably Baiz Market would be a good idea. The meat here is very inconsistent. He's got your basic Shan masala amongst other odd brands. Of course he has asian rice and everything else you'd really expect from this type of store. The mango juices he stocks are weird, but he has some Pakistani soda, Pakola. That's pretty cool.

The restaurant should be avoided. My fellow Indo-Pak friends rave about this place all the time, but I don't think they know any better. I walked in and the owner was taking orders... I was slightly confused and surprised (today was the first time I went to the restaurant). I thought to myself, \"Hey man, he's usually at the store cuttin' my meat, what the heck is he doing here?\" He must have made the food, because when he disappeared again he didn't reappear until my food was ready. My friends had bought me a tandoori chicken wrap, I'm being very ungrateful, but it was not enjoyable at all. The naan was obviously microwaved a few seconds too long, because by the time I got to it it was like chewing on plastic. Taking bites out my 'wrap' was just painful. I'm sad because the filling was actually pretty good, but how can you overmicrowave naan to that point? It's like overmicrowaving your hotpocket (just follow the damn directions).

The owner clearly wants to retire soon, he first moved from the ASU location to a much smaller store, and now he is barely focusing on the store. To make things worse, he decided to open up a restaurant. If you could compare this place to a legit Indo-pak restaurant, it'd be something like comparing Filiberto's to Chipotle. Everyone likes Chipotle, but only some people can stand Filiberto's."}
{"text":"This place is not your normal butcher. They have moved into a bigger building, but nothing extraordinary. 

If you're here for bagged foods, make sure you check the dates on the packaging. They do have explored foods that they do not regulate. 

Be aware of the charges!!! They do overcharge, make sure you know the price of the items you are buying prior to going to the register to pay because they will lie. 

If you are buying meat, it is halal meat. Downfall is that not everything is fresh, you would be better off butchering your own meat from a local farm."}
{"text":"Friendly service, a full range of Indian spices, frozen foodstuffs, freshwater fish (frozen) and meat (they cut up the meat and fish according to your preference) make this place useful for non vegetarian Indians, considering most of the Indian stores in my area sell only vegetarian stuff. They also sell cooked food like biryani and mutton curry, Just call up and place your order in advance and come down and pick it up."}
