{"text":"If you're like me and need a sushi fix at least once a week, and live in the deep south, Ichizen won't let u down. Sushi is always fresh and tasty and the service is always great. Try the soft shell crab roll, it is excellent. I've been coming here for close to 5 yrs and have yet to be disappointed. Lunch combinations are a great value and take out is also very good. Prices are decent and cheaper than other sushi places nearby."}
{"text":"I took an out of town friend and we both really enjoyed the food here. The ingredients were fresh; the flavors were tasty; the service was friendly. So I really can't complain about a thing, except for the drive there on the Deerfoot!"}
{"text":"I visit here pretty often because although it is not the best in the city, it is definitely the best place near my house. The service is always friendly and prompt, the food always reliably good and the prices are fair. I highly recommend the fatty salmon nigiri, as Ichizen is one of the few places to carry it. Ichizen doesn't have too many \"fancy\" rolls to choose from but their nigiri and sashimi is generally cut well and fresh. The sukiyaki beef appetizer is a stand out that I am always sure to order. The place is a bit small (although I have never had to wait for a table) and could be a bit better decorated and utilized. They have a large area in the middle of the restaurant that could be filled with tables if they redesigned a bit. I think if Ichizen was bit trendier with more seating they could be a lot busier. There are worse places in the same area that are much busier. But then again it's always nice to have that super laid back cafe style sushi restaurants that no one knows about for super relaxed nights."}
{"text":"For a long time Ichizen was one of the few reliable sushi options in the south. There are certainly a few more choices nearby now, but this place is still worth a visit (or takeout).  Maki and Nigiri are generally consistent, and pricing is a little less than average. Creative rolls are decent, though nothing particularly noteworthy or unique and pricing on these can be a little higher than average. Items that stand out in my memory though are some of the izakaya options. Takoyaki have a nice texture and a crispy outer shell, and the crisply fried thigh meat of the chicken karaage is covered in a great spicy sauce that has had me literally licking the plate clean.   Service is warm, and when I came a bit more regularly quite familiar as well. The only real knock I have against this place is the ambiance. The dinning room is rather cold and a little \"hard\". Tables are set within bamboo booth structures with seating on hard wooden benches. There is very little fabric or upholstery to deaden sound or warm the space. So much so that my wife prefers we don't come here in the cold winter months. Oh yeah, there's also a strange/huge wooden seating bar in the middle of the dinning room that I've never, ever seen anyone use.   In short, while I wouldn't make a special trip to come here if you're in the area and jonesing for sushi, this should fit the bill."}
{"text":"If you need a quick fix for some Japanese food, Ichizen is the place for you. Otherwise if you live in the deep south like I do, make the extra effort and drive to Shikiji's. They should do away with the big square seating thing that takes up so much space in the center of the restaurant. It gets pretty busy inside this place at times, and they need more tables.  The service is friendly, but sometimes it can get a little slow when it gets busy."}
{"text":"Updated with an extra star, because service here is so friendly and prompt. The waitresses are so welcoming, and they remember you, even if it has been months since your last visit.   I'll hold back on five stars, because I really wish that they carried gluten-free soy sauce. I'm not a Celiac sufferer, but I do have a gluten intolerance, so most of the time I get take-out here and then enjoy the rolls at home. If they could start carrying that, this place would be a winner."}
{"text":"Fail on my part. I've lived in the deeeeeeeep southeast for quite a few years and have always seen this place but never ventured in. I was absolutely craving sushi for HOURS, and decided to stop by here for take out.   (Disclaimer: sushi to me is smoked salmon or spicy salmon rolls.. or tempura.. or a fancy roll.. drool)   I was quite pleased!! It's by far not the BEST I've ever had, but it's close to home, felt very cheap, big rolls, and the quality was there. They didn't have just mini slivers of salmon, but the salmon in the rolls I could actually  taste in my mouth -- can't say the same about other places!   I had to change my rating to 4 stars as I was writing this, because of the convenience and quality factor.   The inside looks like fun!! Huge bamboo stalks is the decor -- not sure about the comfort though, I'll have to check it out.   ... on that note, I'll be having sushi for lunch tomorrow."}
{"text":"Great for local sushi though I should note that I would choose Haru just down the street given the choice.  Prices and food are both middle of the road but they do a nice beef tataki."}
{"text":"Ichizen was recommended to me by local friends, and I'd say that though it didn't shine, was worth checking out.  Food quality, portion size and price were good. Nothing particularly noticeable to recommend - just another sushi place - but nothing to shy away from Ichizen, it's all right.  What wasn't all right is a surprise charge for anything extra. For example, they give you a tiny piece of wasabi, and if you need to \"upgrade\" it to something more reasonably sized, that's a dollar.  Same for the \"extra\" ginger. I'm wondering if they charge for visiting the washroom, but decided not to test that one.  I believe that Ichizen would've been a good takeout place, especially if you have your own stock of wasabi and ginger in your fridge (I do). Otherwise, it's just about a-ok."}
{"text":"Service improved after our initial apprehension when no one came to our table for over 5 minutes. The food, as you can see, looks and tastes divine."}
