{"text":"Good food, great place to spend family time together. Love the ice cream, and sushi selection. Also the noodle soups are not bad for a buffet :)"}
{"text":"For the price they have a varied selection. You will get your money's worth. Every time I have been the food has been pretty fresh. Consider that it is a buffet. Good food and plenty of it."}
{"text":"Nice place. Cheap for lunch, 7 per person. They shouldn't charge toddlers 3yo that don't eat much.  The pork bbq is leathery, the chicken should be cook longer."}
{"text":"The price of this buffet is very low, only $6.99 compares to other places.  Great variety of selections and nice decorations.  Foods were much better than the previous buffet. Also the ambiance was very peaceful. If you are looking for an affordable and convenience place around mall. Then this is the place."}
{"text":"Exactly what you would expect from a buffet restaurant. A large variety of food with options for the whole family. All of the food is good and the cost is very affordable.   The quality is also what you would expect. Some dishes blacken because they have been under the lamps too long. Others cold and tasteless.  The star of the restaurant is the stir fry bar because of the freshness of the ingredients.  Bottom line, if you crave a good buffet for a great price, you can't go wrong with this one."}
{"text":"Enjoyed the lunch buffet here today.   Perhaps some buffets may have a greater selection, but the food quality (for a buffet) was great. We certainly found enough good stuff for lunch.  Again - using buffet is a qualifier - the sushi was outstanding. Most buffets in the area at this price point do not offer octopus, eel, or the more expensive sushi items on a lunch buffet. Those items and several others were all there today for lunch.  The reminder of the hot oriental foods were all average to good.   One outstanding item here is on the cold bar. Their cold mussels are outstanding! Very nice large mussels with a tasty red sauce on them. Worth the trip just for these.  One negative item: the glazed tile in the entry area and around the buffet line was extremely slippery. There was a light drizzle falling outside. I assume people had tracked in enough water that made walking on the floor like an ice skating rink. I slipped slightly, and saw several others slip and slide.  All factors considered, it was an enjoyable lunch and I will be back."}
{"text":"Floors were very slippery felt like at any moment I could slip and tear an ACL....waitress service was no good"}
{"text":"Service is average but the food is very fresh  (unlike a lot of buffets). The have a very good variety of sushi, which is nice. They also have the hibachi for you if the wide variety of different foods aren't for you. The price is right on too. I will definitely return."}
{"text":"I love the food! But...I normally have to go to an early lunch or dinner to ensure that I get fresh hot food because the crowds are pretty heavy at meal times.  This is my go-to Asian food place!"}
{"text":"This is exact same place as Osaka Buffet that closed down in the same location.  My family went here in hopes for a new and better Chinese buffet and we are sad to see the exact same layout and food.  It's just a name change.  :-(  If you have an itch for a good quality Chinese buffet, Ichiban won't scratch it."}
{"text":"Thought this would be a nice place for filling meal before a family movie night. Boy were we wrong. This place is not only overpriced at $10.99 for dinner, especially since barely anything was edible.   Seriously, it was disgusting and unsanitary. My dad has food poisoning and if it wasn't for my mom and I sticking to white rice and overcooked / heavily salted veggies we would be too.   No hand soap in the restroom, when requested we received blank stares.   Plates and silverware were dirty.   Overall bad experience and will never go there again. I would not recommend this restaurant."}
{"text":"My husband and I stopped in here as a random Choice after shopping and I was so glad we did! Great choices everything was great! Already looking forward to going back again. Price is fantastic for what they offer. Will absolutely be back!"}
{"text":"I was starving and had to eat before going to the dentist. I saw this hibachi buffet and decided to try it. It was pretty good. Many options for veggie lovers. It has many stations with your typical Chinese food and a big sushi station. I can say the sushi is taken up a level with different combinations and sauces. This place is not your typical generic sushi. It has a good selection of desserts, ice cream cups, sandwich bars and popcicles. Oh, and dont forget the cookies. Besides that everthing else is the same as any other hibachi buffet. Just see the pics."}
{"text":"GO FOR DINNER, Aug-7-2015. The service is great every worker smiled and said hello when passing or serving. The food was fabulous and fresh and plenty of it. The dinning area was super clean and maintained . Dinner for two one tea and one water about $ 23.00, Not bad for all you can eat dinner. Will be back . Thanks to everyone at Ichiban Buffet for a very enjoyable dinner.  THE FOOD DUDE.    : )"}
{"text":"Ichiban is probably the best Asian buffet I've ever been to.  The food variety is enormous and everything seemed fresh.  The sushi was very good.  You cannot beat the price!  My daughter and I couldn't stop talking about how good everything was.  My only complaint was that both the sugar donuts and the yeast rolls were very hard on the bottom.  Cooked too long, I guess. I was impressed with the selection on the cold salad bar.  They had stuff you don't normally see (like seasoned asparagus, octopus salad, and tomato/cucumber salad). Overall, we loved it and I will definitely be back."}
{"text":"This 3-star rating is a mixed bag. First, it is about average for buffet.  I have had better and far worse. This location is far better than the other Ichiban I have been to in the Charlotte area (by the airport). Most of the food was decent.  There were only one or two items that I rolled back into a napkin. The sushi was okay.  Ru San's is far better for Charlotte Sushi. The one thing I was a bit off was the waitress.  She was about as friendly as charcoal.  I wouldn't pass on this place, but I won't go out of my way either.  Won't warn you away, but I will suggest 'judge for yourself'."}
{"text":"I've had other ichiban in different locations and this location I by far the worst. Food was old and dried up. Sushi was discolored like it's been sitting out for hours on end. If I could give it no stars I would."}
{"text":"Never say you want your Hibachi spicy it taste like he used the 5 bottles I gonna have a baaaaad night on the toilet"}
{"text":"Food was stale and nobody there to tend to anything relating to sushi. We have been before with a much better experience. I think we will give them another shot and see if this was a fluke. I would not currently recommend this place."}
{"text":"Decent Asian buffet. Nothing was bad, nothing was mind-blowing, sushi was acceptable, price was reasonable for the weekend (11.76 with water). I'll probably come back."}
{"text":"Keep in mind that this is a buffet, but as far as buffets go, it's quite good!  Very affordable at around $10/person for dinner.  I was very impressed with the sushi.  They had nigiri and while it wasn't the best I've ever had, it was great for all-you-can-eat buffet sushi.  Hubby got some hibachi which was tasty as well.  Everything I tried was good.  I recommend it."}
{"text":"Grand opening and the place looks good and clean, many selections of food & it's tasty. Recommend you to stop by and try."}
{"text":"Horrible food!! The sushi was old and the sushi chef couldn't even make sushi to put out. He just kept on prepping for later on. I was eating at 4:00 pm when \"dinner\" was supposed to be. The food seemed to be the same food they put out over two hours ago when lunch was going on. The server was not around when we all had to have refills. Our table had plates piled up because the dumb bitc* didn't take them away after we were done.... Don't ever... Ever ever ever come here!!!! You will regret it!!"}
{"text":"Besides the friendly staff, the food was an absolute sh**show. Me and my boyfriend were trying to leave because I mean, who would wanna eat at a place they know isn't going to suit them? I'm vegetarian, and I just wanted to check it out. They didn't have tofu on the buffet so I honestly wanted to bounce. When we left, we were called back inside... actually, chased outside and dragged back inside by a polite lady employee who said \"the chef will make it specially for you, no charge\". And I mean, who wouldn't wanna eat at a place where one half of your meal is free of charge. This is where it went wrong, very wrong. Walking back into that place was literally like selling your soul to Satan aka a 25 dollar buffet meal that you're miserable eating. Anyways, we went back and they grilled us about confusing things we didn't really understand like what kind of tofu we wanted and if we wanted sauce. We chose brown because we're stupid and sat down and waited for our tofu. The chef brought it out to us and I took a bite second, fearlessly. I should've figured that the look my boyfriend gave me was a clear sign not to try it. But as I fearlessly stuck that tofu in my mouth and swallowed, I wanted out. I wanted to flee. I wanted to free myself of this horrible chain. But yeah, my dumb boyfriend got a conscience or something so he forced himself to eat the tofu, whilst I entertained myself with fries and stuffing the tofu underneath noodles and rice. At the end of the day, I'm a dumbass for staying and paying the bill but their food could have been better. Turned my happy graduation day into a peeved graduation day for a little bit. Yeah, don't eat here if you value your stomach and your wallet."}
{"text":"Well I had been craving Chinese food so since I was on this side I decided to try this place out. It was lunch time so I assumed it would be crowded and buffet would have a lot of food. This place was empty. The buffet table had little food except for what they had seen people eating more of. I only ate 1 plate and only liked the beef and broccoli that I had, the chicken wings were not warm at all. I would normally get the little bread that has the sugar on it but I didn't because it had been sitting there for a while. The egg rolls were not good either. So with that I can say I did not enjoy it."}
{"text":"Totally worth the 7 bucks but beyond the price, the sushi is really pretty good as we'll. each roll is easily worth 7 dollars and to get the whole buffet is great. The only reason I give it 4 stars not 5 - some of the fire stuff seemed like it was fire in old grease an just isn't taste right. Overall, pretty good and I would definitely come back."}
{"text":"This used to be my favorite Chinese buffet. After tonight it's now my least favorite. Price went up. Service went way down. I got steak cooked on the hibachi grill and it was still too rare after I asked if they would cook it longer. The chef tried to add garlic I said no it's too rare cook it longer. He put it on my plate any way. We never got our drinks refilled. It tasted like the food was sitting there since yesterday. I will not be returning. If someone offers I will still say no I don't like it. It's a darn shame."}
{"text":"Much much better then what it used to be. And the cook knows how to cook stake too! I could actually chew it and enjoy my meal. My husband loved the sushi !! Grade A ! Our friend joined us as well and he also enjoyed the sushi ! I to suggest in bring a sweater it was a bit chilly. Went for lunch 11pm-4pm would be $6.00 a person! So instead of us 3 eating for $45 all together it was $28.06! And left a tip of course!"}
{"text":"My husband and I visit this restaurant pretty regularly, as there are so many choices, and they're all fresh. The sushi and hibachi grill is great, and you can even get a choice of hot soups next to the hibachi area, which I highly recommend. I think there are four choices of those soups, (which are more like broth bowls,) and they're all very good. You can get more seafood choices on the weekend, including raw oysters, which are small but very good as well. The salad bar is fresh, the Coke is nice and fizzy, and the desert/fruit options are really good. You can't ask for much more than that. Plus it's directly across the street from me!"}
{"text":"Worst Buffet I have experienced since moving here two years ago.  Not recommended."}
{"text":"Yuck. Sushi selection had been sitting on bar long enough to dry out. Hot food was not prepared well. Never again."}
{"text":"Look people it's a buffet, not gourmet Chinese or Sushi.   Geez.  For dinner to be $10.99, what do you expect?   The sushi is decent and the buffet items are great, it is usually busy, so the food is turning over quickly, thus it is fresh.  I got no problems with this place.  The servers were very pleasant and quick.    I left full and happy."}
{"text":"Visited once.  I pretty much just eat chicken at chinese restaurants, so: General's chicken was not crispy at all, soggy from sitting in its liquid. Sesame chicken was just ok. Honey chicken was not bad. Bourbon chicken had a good taste on the well cooked pieces.  Some looked kinda soft.  They did not have some of the items my husband wanted, like shrimp dishes, so, probably won't be back."}
{"text":"It was adequate nothing spectacular. Food was hot appears clean. No complaints. Typical Chinese buffet."}
{"text":"Our first time back since they reopened. The decor was nicer and the food was great. A better selection than before."}
{"text":"One of the nastiest places I've been in. The food temps were low. It was not fresh either. Several pans had dried up and the food was stuck to the pans. The drinks were flat, the floors were filthy, and the servers were nonexistent. Once we got drinks, the waitress never came back. The bathrooms were even worse. We were glad to pay and get the hell outta there... Never again!!"}
{"text":"Came with my brother and cousins for some late lunch/early dinner? We selected this spot due to our other cousins positive ratings. However...maybe these guys had a bit of an off-day when we visited.   First off, let it be known that this is a buffet, no high expectations here. Also the price is pretty cheap, $11 I believe?  The sushi was ok, pretty basic flashy rolls. However, the rest of the food is what really concerned us. Nearly EVERYTHING else tasted.....off?  Very hard to describe the taste of all of these dishes, just that they did not taste like the way they should have.   I kid you not. We actually spent about 35 minutes playing a Dare Game out of the foods.  We grabbed a plate of food and did a taste reaction to each of the dishes.   Let's just say we can all agree that really the only thing we enjoyed was their egg drop soup. I don't think I shall ever return.   I mean...seriously. Who's Mac n' Cheese tastes like Whiskey??? (not the good kind)"}
{"text":"Sushi on the buffet looked like it was left out for hours. No signs to tell you which sushi roll was what and nobody around to ask questions to. Most of the chicken didn't have good flavor and it was overall just a complete disappointment. They did have a large variety of food options available though. Will not be going back."}
{"text":"Worst good ever, I guess for buffet hibachi it couldn't get better than what they served. Food was old and cold. I wouldn't recommend for anyone."}
{"text":"My wife and I stopped by for lunch while in the Concord area.  Great food and good service.  Large selection and everything was hot and very tasty!  I would eat here the next time I am in the Concord area."}
{"text":"Please bear in mind, my 4 star rating for this buffet is based on the fact that it is a buffet! A buffet is a buffet, don't expect anything amazing! Came here for lunch on a whim and it was only $6.99/person. I definitely ate more than $7 worth of food here and I don't even have a big appetite.   The lunch selection is pretty varied and large for its price point. You've got your American foods (tenders, mac n cheese, etc) and you've got your typical Asian fare (soups, fried rice, lo mein, stir fry, etc). But you've also got dumplings, red bean buns, sushi (they have eel!) and nigiri with seaweed, hibachi, and various other seafoods including mussels, clams, and fish. Oh and they do have a cold bar with various salads as well.  For dessert you can expect some cakes, fruits, and even ice cream bars.   Seriously for $7 I was blown away by the options. The food is not amazingly delicious by any means, but it's not bad! I've definitely had worse buffet food out there. Some of the food could have been a little more fresh but whatever.  The location is conveniently located right next to Concord Mills. If you're a fan of buffets, give this place a try."}
{"text":"Cold food, hair in sushi, cold food again. Manager was a nice guy. 30 dollar loss.  Gave me a 30 percent discount for his apologies."}
{"text":"Amazing food and staff. Always treated with a smile. Food is the freshest around. Love this place."}
{"text":"This place is great and much better than the previous buffet. The food delicious!! Food is prepared correctly and is always the correct temp. The soup bar they have added is nothing short of excellent!!!!  Bigger more tasty selection! 5 stars!"}
{"text":"For the price of $6.99 for lunch, you cannot beat that. Food was delicious and there was varieties! This used to be Osaka, but they closed soon after they opened and now it's Ichiban.   I was definitely not a fan of Osaka, but Ichiban has been my favorite Chinese buffet. Now I won't have to travel all the way to China Buffet for some good Chinese buffet. Cannot wait to check out dinner time and when I do, I will update my review!"}
{"text":"When this place first opened, it used to be pretty good. The sushi was always fresh and rivaled dedicated sushi restaurants, the food was tasty, and everything was clean. The past few times I've been, it was very sub-par. There was a noticeable drop in quality. Just as an example, the crab rangoons always seem to be mutilated in the bin you get them from... Like, they're always torn apart with the filling all over the place. Oh, and the bathrooms are disgusting. I probably won't be coming back unless the price drops or the quality goes up."}
{"text":"Honestly not bad. Clean and many items to choose from. A decent price for an all you can eat buffet. Didn't try the hibachi and the sushi was just \"eh\". But it's a buffet- what else is to be expected"}
{"text":"Service was good, pretty sure food was out of some Chinese restaurants dumpster and reheated."}
{"text":"Food was decent. About what you would expect from a Chinese buffet. I just wish the employees would control their guests.  My trip was ruined by a group of 6 people sitting beside me playing rap music out of their speakerphone. How rude is that?! If this is the norm for their customers I highly doubt I'll return."}
{"text":"So ICHIBAN Buffet is a new Asian buffet near concord mills. It is pretty crowded around lunchtime! The food is hot and fresh and the staff is constantly refilling the trays with hot steaming dishes!  There is a large variety of food to choose from including an array of deserts.  This restaurant is clean inside and it has a friendly atmosphere.   Oh yes and you can enjoy that you see for a little over $10....  I'm bringing the family here!  Bona petite!"}
{"text":"Food sat out too long. Everything was terrible. Would not go back. Sushi was old, fish not normal color, had that \"fishy\" smell.  Chinese food was fatty. Soup had a think layer of top.   Dirty restaurant.  Over all I had a very bad experience and will not return."}
{"text":"Today, while out shopping in the Concord Mills area I got the 3 pm hunger pangs and whipped into the first available - Ichiban Buffet Sushi & Hibachi. First off, let me say I normally don't break cardinal rule # 1 by eating at a Chinese buffet between the hours of 2 pm & 4 pm (they usually suck) but I did decide to give Ichiban a pass since the airport location is usually known to have pretty good food.  My first port of call at a Chinese buffet is the sushi bar for a little taste of anything and everything sushi, especially the sashimi. Then a round of the other goodies.  Concerning that sashimi, the first thing I noticed the thinly sliced sashimi perched on the sushi rice looked a little off-color. The salmon, tuna, eel (I guess that's what it was), and the carp (yes, I'm trying to be funny but that's exactly what it smelled like) were all nice and dried out. Kind'a like jerky. You could tell by the dried out crunchy rice most - if not all - had been sitting there for a LONG time. And - everything was at room temperature. That's just down right dangerous.   And the other 'goodies'. Well, what can you say about a trip to the Chinese buffet at 3 pm? Dried out, over cooked, and everything tasted the same ... nasty!    Then I noticed the restaurant itself, dirty carpets and floors, stains and finger print smudges everywhere. The place looked like it hadn't been deep cleaned in ages. So bad in fact - and this is the first time in my 60 years I ever felt the need - I called the county health department and complained.  This is just my opinion -- First off, this place needs to get their act together and start by jerking up all that filthy carpet and have a heavy cleaning session.  Secondly, and most importantly, if they are going to stay open between lunch and dinner they need to make sure they are supplying their customers with a quality product - served at the correct temperature - especially sushi!   Will I go back there? HELL NO! At least not until I see the above changes. I've had food poisoning before and I'd rather play Russian Roulette with a German 88!"}
{"text":"i was on there on Tuesday, they have lots selection. But all the food is either mediocre or not fresh. The service is not good too. The girl who serve me look a me like I own her thousand dollars. There lots choice out there. This one is not worth to try."}
{"text":"This was a bad choice to eat at this restaurant today. The food was not warm because some of the buffet warmers were not working properly. The waiter was not friendly at all and acted like we were bothering her. I will not be back and will spread the word until they get it together.   Secret Shopper,"}
{"text":"*** mind you, we went an hour before they closed, so I wasn't expecting the best, but this was pitiful.  They have a good size buffet, however we walked in and didn't feel welcomed at all, the food on the buffet was very dried up and gross at this point.   We literally got up after getting food that we realized wasn't very good, apologized to management, and told them we were going to just leave. So we got up, and left.   Maybe it's better when you go right at the beginning of lunch or dinner but this was not good at all."}
