{"text":"Love this place! My new favourite ramen house!! The chicken karage with the freshly grated daikon radish is excellent as is the ramen. The cha-siu isn't too fatty but still tender and juicy. The only issue are that there's not a/c so it can get hot inside."}
{"text":"Had a spicy yakisoba with vegetables which was not at all spicy. Noodles were perfectly cooked and very chewy but vegetables were  undercooked."}
{"text":"One of our favourite ramen spots. The broth is very tasty, love the noodles and the noodle and soup combo is perfect for those who want to try both."}
{"text":"I was not impressed. The reviews had this place hyped up but...I've had better.
The Noodles were home made fresh, so usually I am happy with this and the broth seldom a problem. But here it is the broths (both chicken and pork)  that were not great, no flavour, sometimes bitter to the taste.  Forgot the names but my friend had the pork shoulder (lot's of meat here) soup and I had chicken and minced meat soup.  We also got a side of crispy chicken and rice. The smell of chicken fat was present in the after taste (a deal breaker for me).
Pros : service was fast. It was reasonably priced. The noodles fresh.
Cons : Broth not great, we were seated at the end of resto where strong rancid kitchen smells emanated. 

Simply put, there is an effort here, with quality, portions and variety, but I've  had better at so many places, including the food court variety."}
{"text":"One of my preferred ramen spots. I usually order the Ramen Salad but the Volcano Ramen was surprisingly good."}
{"text":"I lived in Japan for a brief period of time and this is the best ramen I have found in Montreal."}
{"text":"I keep coming back! Every time I'm around and people ask me what we should eat, I always bring them here. I tried almost everything on the menu... nothing ever deceived me. I really like their broth because it's not too heavy or salty so you don't get sick of it. The chashu though.  It's soo tender. Their karaage is amazing too. And to top it off, their ramen is totally affordable. Oh, but just in case you're on low budget, you can always get their don's (rice bowls) that are under 10$ (before tip)"}
{"text":"Great location on Saint-catherine! 
When we came into the store, we were greeted by cute staff in Japanese. Huge thumbs up! 
What surprised me was that the ramen noodle are handmade, that's pretty nice. 
We were 4, so we got to try a lot of different dishes. 
I tried TONKATSU ramen. I had SUPER high expectations as my friend told me it was a typical super good type of ramen. 
I really like the COMBO option to add a Karaage don (Fried chicken and rice), which was a nice complement. (Super hungry after 2 hours of badminton :D)
I asked if they serve hot tea and guess what ?! BOOOOM They had it and also hot water if you ask. The tea was 0.50$ per cup (happy they had this option)
The ramen was meh. The soup wasn't flavourful enough. The egg was too well cooked. (normally they use the soft boiled egg technique to make the yolk not fully cooked)
The handmade noodle didn't taste crazy. On the other hand, the meat was SUPER TENDER (huge thumbs up right there), but I think they should give 2-3 slices for a regular ramen.
As for the Karaage, it wasn't the best I had. 
Customer service was excellent. Cup always filled up and we could stay a bit longer to chat.
Overall the restaurant is good, but there are lots of improvement for the food taste. 
When people go for ramen, they need a \"WOOOOW! TASTE SUPER GOOD\" feeling. 
Today, it was more like \"I'm hungry and this filled me up.\""}
{"text":"I went to this place with a group of friends with high expectations because i hadn't had ramen for a while and was feeling particularly hungry that evening. 

My friends all ordered the level 3 volcano because they like to challenge their threshold for spiciness and i went with the braised porc ramen soup. 

I had had braised porc ramen while visiting NewZealand the year before and it was one of the tastiest meal i had experienced so i figured i would enjoy it here as well. 
But alas, upon being served the ramen i immediately noticed that the noodles were undercooked and the porc wasn't anything like i expected which is normaly thinly sliced and melts in the mouth. 
These were low quality chunks of porc which are normaly found in buffet style stews or canned soups. In addition, the broth was so lackluster and odd tasting that i stopped eating after just a few spoonfulls. Not the mention the egg was hardboiled! 

I asked my friends how they were enjoying their dish and they all said that there was absolutely no spiciness to speak of which was the main reason they were excited about this place. 

I'm giving this place a one star because the service was great however none of us enjoyed our dish and were all utterly disapointed. 
I honestly would have been more satisfied if i had just cooked instant noodles at home. 

I'm dumfounded by the people who say this place serves good ramen."}
{"text":"I love Ichifuku. It's a simple no-nonsense ramen place with healthy servings and friendly staff. The restaurant looks neat and simple. The staff all wear the same red plaid shirts and greet you as you enter and leave. 

What I love about the ramen at Ichifuku is it's not overly salty and the ramen comes with enough toppings that you don't have to pay an arm and a leg for extra toppings. The bowls are delicious. There are plenty of options for side dishes and the pricing is more than reasonable. My personal favourite is the Volcano ramen which comes in different levels of spicy. 

Don't overlook the simplicity and deliciousness of Ichifuku."}
{"text":"Ichifuku is a great ramen restaurant, I'd even dare say it's the second best ramen you can get after Imadake. I've been here a few times and loved the handmade noodles, the succulent miso flavored broth and the hard boiled egg. It hits the spot every time and everyone I've gone with has been delighted by how yummy it was."}
{"text":"Terrible Ramen, those who find it good really dont know what they're talking about. Egg was hard boiled when should of been soft, they literally give you 2 razor thin pieces of average meat as well. Im not a huge fan of Ramen broth in general, and this one was not great either. Wanted to like it , but just cant. Maybe was just an off day but will not return."}
{"text":"It's very small restaurant, but their food is more than I thought. There are rice?ramen?appetizer and drink. Everything is better than I expected?The karaage is tender, crispy and in good amount. I tried the volcano ramen that is very creative?And there are enough meat in my bowl. Also the flavour of the soup is so intense?I love it so much, the only fly in the ointment is that the noodle is thick?I prefer the thin noodle?. However, my friend had the tonkotsu spicy miso that is very traditional style ramen?The noodle is thin one that is what I like.I will definitely go there again?"}
{"text":"I've been to Ichifuku a few times and my dishes have been consistently good. The prices are great and the portion substantial enough. I especially enjoy their cold dashi ramen. Service could be slow sometimes as the place could fill up quickly, which is fine as long you are not in a hurry. Seats at the counter is decent but not ideal especially in winter. Definitely one my go-to ramen location."}
{"text":"Really good ramen spot! 
They make fresh noodles and you can even see the noodle machine when you enter. Very Tasty noodles....
They have vegetarian tomato based ramen but I would rather had a vegetarian miso ramen instead. Good gyoza!
Overall a nice Japanese ramen restaurant, will be back for more! 
That's all you need to know."}
{"text":"Ichifuku is usually my first choice on Japanese ramen because they provide delicious food. But today I am disappointed. The pork meat in my ramen is out of date and I am pretty sure the taste is wrong. So I told my friend do not to eat it. 
When waiter ask us about the taste, we tell the truth. Sadly, Ichifuku does not solve the problem. They taste my friend meat and tell us everything is fine. And they said it is my fault because my meat come from the same pork. So my meat should be fine too. 
I don't want to bargain for anything but their attitude is not good. I think the position of Ichifuku just went down in my heart. And I won't recommend this place to my friend anymore."}
{"text":"My boyfriend and I came here last night specifically for the ramen. The ramen is not the best ... I took the tonkotsu spicy miso and my boyfriend took the tonkotsu kuro mayu. The noodles weren't our favourite because we prefer thicker noodles but it was probably the only good part of our dish. The broth is pretty bad (especially in the tonkotsu kuro mayu one ) and The egg was way too over cooked. 
We also ordered some fried chicken. The taste was good but it was pretty cold when we got it. 
The service was good though. 
We will not be coming back again!"}
{"text":"Serviceable tonkotsu, but not great.

Go to Yokato Yokabai for the best tonkotsu."}
{"text":"Soup is fresh and mild. Taste is as same as Ramen of Japanese Ramen restaurant in Japan. They make noodle by themselves and also everything NO MSG! It's amazing.
Cozy place and nice atmosphere!"}
{"text":"Yes! The bad-ramen streak finally comes to an end! 

After trying a few of the latest ramen hotspots and being rather disappointed, this was a total success! My biggest beef with all the new ramen places is they end up being more about trend than taste. This, however, was some top notch ramen. 

First, the noodles. So fresh and so good. You can literally admire them being made right next to you while you devour your bowl. And they make different varieties, so depending on the ramen broth you choose, it'll be paired with a different noodle type. I had the miso, which came with a round slightly fatter noodle, while my husband had the Shoyu, which came with a skinner noodle. Both excellent by the way. 

One of my favourite parts about this place was that you get to choose from all the classic ramen broths. They have both chicken and porc based broths, which is rare as most places tend to specialize in one or the other. I can't comment on the porc ones, but the miso and shoyu were both excellent. 

And finally the porc pieces were generous and tender, without being overly fatty. 

On all counts, an excellent ramen bowl."}
{"text":"It was by no means bad - it was just ok. We ordered the miso and shoyu ramen, as well as both (pork and vegetarian) gyoza. Service was quick and we got seated immediately. The food came in around 5min after ordering, but this was most likely because we came early at around 6pm. There was not a lot of soup for the abundant amount of noodles provided, but the broth was flavorful and the noodles had a bite to them. The char siu that accompanied the ramen was sliced thick and a bit dry, while the gyoza was flavorful but greasy. We found that the vegetarian gyoza was a bit spicy and actually was more flavorful than the pork. Not bad but not the most excellent either."}
{"text":"Belle découverte de ramen piquant avec poulet frit: le volcano. Je n'avais jamais essayé de poulet frit dans mes ramens, car je préfère habituellement le porc. Les nouilles sont d'une bonne grosseur et sont faites sur place dans la vitrine avant. Le bouillon est riche et bien épicé. Nous l'avons pris pour emporter et c'était très bon. Je crois même qu'il vient de dépasser le yokata yokabai et le misoya comme meilleur ramen de Montréal. 

À essayer!"}
{"text":"Service quite slow. 20 mins waiting time for Ramen is a bit long. And our order was wrong."}
{"text":"I received an invitation to this establishment by an old friend (you might know him as \"Monsieur Montreal\") about 1-2 hrs before he had wanted to eat their delicious ramen.

Obviously that was too short notice...but for some reason he has begun to wage psychological warfare on me.

I mean, this guy's spicier than Ichifuku's Tonkontsu miso ramen!"}
{"text":"Came here twice and have some mixed feelings about this place. The first time i took the tan tan men and the broth as well as the noodles were perfectly made. The noodles were very chewy and the broth was very flavorful. The second time, i took the volcano ramen. It was way too salty and it was hard to finish it. Didnt want to risk getting hypertension or acute kidney disease...

The service was good until a large group people came in. They started serving only them and it took us 30 minutes just to get the bill. 

Overall the place is ok, but first experience was way better than the second one."}
{"text":"Excellent ramen authentique, fait à la main et beaucoup de choix de bouillon. Le staff est chaleureux et très courtois. À recommander!"}
{"text":"The restaurant I was trying to get to was surprisingly closed for the Sunday (hours posted on a crappy piece of paper on the window! Bah humbug) so I dropped in here instead, as the noodle making machine out front looked promising. Unfortunately we caught them on a bad day - their AC was broken. We committed to staying anyway because we didn't know where else to go nearby, and the staff were very nice and showed us in immediately. The place is averagely sized and features an open concept kitchen - normally really cool, totally not on a day where the heat warning should've been in effect and their AC is broken. The waitresses were both very attentive bringing menus and iced water to help cool us down, and we quickly decided on Tonkotsu ramen bowls with black garlic oil, and an order of chicken karaage to start.

The menu has your standard variety of options, a fair number of appetizers, and a great combo deal where you can get a ramen bowl and a side don (bowl of rice with some meat item on top). Items were fairly priced for a ramen shop, and I discovered the portions to be generous. 

The wait was a bit longer than expected, but not intolerable. The chicken karaage came first with a ball of mashed turnip. There's quite a bit of salt on the chicken, but it was still quite crunchy and the pieces were large and meaty - definitely one of the best I've had. The turnip helped to cut the salt, and I was overall quite satisfied.

The ramen bowls came next and looked great. The broth was rich and there was lots of black garlic oil - they did not skimp out at all. The soft-boiled half egg was perfect, and my pork was tender and flavourful. The noodles were the thin kind - I wish they had asked and given me the option for my preferred thick noodles - and they were chewy yet soft. As I ate through the bowl there was continuously still noodle left, there was no shortage at all! Unfortunately that also meant some of it stayed clumped at the bottom and fused itself together, which was annoying given the lack of space in the bowl in general.

This was definitely one of the best bowls of ramen I've had, which is notable having gone to a number of ramen shops in Toronto as they popped up all around town. The broth and flavour is great - though some may find it too salty for their taste. If not for the chicken karaage tipping the scale a bit on the saltiness, and my noodles clumping at the bottom of my bowl, it would've been an easy five-star decision. What redeemed them was the super attentive and nice waitresses - we never had to ask for a refill or any other services, they just appeared at the right time right away. 

One interesting thing we noticed was that the staff spoke Japanese - makes the whole experience more authentic right? No worries, English and French are also well-commanded languages among the waitresses."}
{"text":"This restaraunt has a nice modern atmosphere. Got a chicken bowl and it was okay a bit cold though and my partner had the volcano bowl and found it too salty. They make their own noodles, which is cool, but I feel that maybe flavor-wise the food is imbalanced"}
{"text":"Worst ramen I've had in Montreal. Barely any ingredients, watery broth, noodles too thin and overall it tasted like feet. The pork was good but a little pink inside. Stick to Misoya!!"}
{"text":"The food is pretty good with healthy portions and limited but specialized menu.

The fried chicken with rice was tasty but felt reheated since some parts were stone cold.

The tonkutsu with pork was the high point , very savoury broth , excellent for a cold day.

It appears most of the employees are Japanese here, big plus for authenticity since some do say \"Irrashaimase\" (welcome in) as you enter, but rather shyly since most people would not understand it.

Unfortunately , poor service from me loses a star, I had to ask for menu, water refill once I was done eating and I had to flag someone for the bill"}
{"text":"I have no clue why this place isn't getting more five-star reviews. I've had ramen at some of the best ramen-yas in Tokyo and LA, and I'd say that Ichifuku holds its own against any of them. Their tonkotsu broth is rich, milky, and full of umami flavor. Their noodles are made in-house on a daily basis. Their chashu (the marinated and braised pork characteristic of ramen) is locally-sourced, meltingly tender, and incredibly tasty. Their ajitsuke tamago (marinated soft-boiled egg) is perfectly cooked, with a delicate, silky yolk. If you really want to take your ramen experience to the next level, you can get the \"kuro mayu\" tonkotsu, which adds a decadent black garlic-infused oil to the broth. On top of that, the service is fast, attentive, and incredibly friendly, and the prices are quite reasonable. I'm honestly at a loss as to what this place could do better. Check it out and see what you think."}
{"text":"Leur gyoza sont très bons ainsi que leur poulet karage don. Le ramen que j'ai choisi était pas mal mais pas totalement à mon goût, mais il faut que j'y retourne pour tester les autres ramens ^^"}
{"text":"I am a huge ramen fan.
First time eating here. I had the volcano ramen and the pork gyoza. Honestly, I wasn't that impressed. The gyoza was a bit too bitter and not as savoury. The same with the ramen, it lacked flavour profile and richness that I've had at other ramen shops. I also did not get it very spicy as well (as the spiciness can mask flavours). The noodles were also clumped altogether. Although they make it in house, clearly someone did not flour it enough because in my bowl there were a bunch of noddles stuck together. I was pretty disappointed, will not go here again.
The staff were very nice and friendly and service was relatively quick on the other hand."}
{"text":"This place just opened up and I already am in love. the noodles taste so fresh and are made right by the window! The broth is to die for. I went with 2 other people so I got the chance to try off their plates so I can definitely vouch for the miso and tonkutso broth. The staff is super friendly and always refilling our glasses (which is awesome). One of the waiters even took the time to give us some cultural information about ramen and broth in Japan which was so lovely. I really enjoyed the food, the atmosphere and the service. This little spot is going far!!"}
{"text":"Ramen with homemade noodles rules the roost! Authentic ramen place with decent service. Not a huge fan of their Gyoza tho- slimy without much flavor."}
{"text":"Was all right but maybe not the best ramen in town. The spicy ramen was actually pretty spicy and was surprisingly happy with the level because I don't usually find they out enough. The noodles themselves were not all that special and I thought there was missing some flavour in the bowls maybe adding an egg or some other vegetables would help. Finally I'll say I really didn't like the fried chicken which was bland and dry, I think it could definitely be improved!!! It seems the staff is enthusiastic and wants the place to be a success so I think they will improve over time."}
{"text":"Very disappointed with this place.......I give 2 stars cause the service was friendly....but the ramen was not good at all....the broth taste nothing like water....never want to go back to this place.......it's not the authentic Japanese ramen....."}
{"text":"Had the Shoyu ramen which is a chicken based broth. Went for lunch and it's a small shop, so great if you're no more than 4 per table. The noodles are freshly made, the BBQ pork was very tender and the service is friendly. It certainly matches the quality of other good ramen restaurants I've tried. For those who aren't familiar with ramen noodle soups, it might be quite heavy and a bit salty, but it tastes pretty good.   Best meal for lunch as they don't have much else as ramen is their specialty."}
{"text":"Tonkotsu broth was PERFECT. I usually never finish my ramen broth, but this time I loved every bit of it. It was rich and flavourful, but not too salty. You can tell a a lot of time and effort was put into making that broth. 
Noodles were awesome too, not like those knockoff instant noodle types. 
They don't go overboard with the toppings, because the basics of a good ramen is the most important.
Also, service was lightning fast! Food came in a jiffy too. 
Wow. Still dreaming about that broth."}
{"text":"Ramen volcano: parfaitement épicé. Bouillon épaisse...peut-être trop. Portion généreuse... peut-être trop. 
Garniture parfaite

Ramen tonkotsu: bien...manque de bouillon...ou trop de nouille...

Je recommande cette place, et le service est ultra rapide."}
{"text":"We had high expectations going in but were disappointed. I liked the noodles; they are thin round noodles, quite chewy but the soup base is simply not rich or flavourful enough. I had ordered the tonkontsu soup base and it was flavourless. Came with a tiny piece of pork and for $3 you get 2 other tiny pieces of pork - not worth it! The egg was not hot but just warm. My bf ordered the spicy ramen and it was better than mine but still missed the mark on the soup base. The karaage was fine but not outstanding. Overall an average ramen restaurant. Would be willing to return if they improve the soup."}
{"text":"I love this ramen place! They make their own noodles and the tonkotsu broth is delicious. The service is really good. One of my favorite ramen spot for sure."}
{"text":"I need to come back here. I wanted the tonkotsu kuru mayo but they were out. Instead, I had the shoyu. I was super pleased with mine and the noodles were great. I am, admittedly, a ramen novice but this place fit the bill. My husband had the volcano ramen and kid, the kids meal. Husband ordered a level one on the ramen and it was still too spicy for him. So, be aware that no abnormality/normal might still be spicy for some. I was able to help him with it though, so it worked out great for me. I can see where this place could get super congested but we came at 8 on a Saturday and had zero issues. We'll be back for the tonkotsu!"}
{"text":"This restaurant just opened yesterday! It is a small restaurant (I would say ~25 seats included the bar) and they have 8 selections of ramen on their menu (they also have rice, appetizers, dessert, beers, etc. But my friend and I didn't get anything else). I would like to try their karaage next time (when I'm not sick)! 

I got their tonkotsu ramen; I like their thin noodles which reminds me of those at Ippudo (one of my favorite ramen restaurants)! I wish my noodles were more under-cooked since towards the end, I find that my noodles were too soft (I like it chewier and firmer). It would be great if we can pick the texture (firmness and softness of our noodles).

Their soft-boiled egg was too cooked (the york wasn't even partially liquid but the egg white part was really soft and tender). Their chashu (BBQ pork) was soooo tender that it really melts in your mouth (the piece was quite thick). This compensates for the over-cooked soft-boiled egg!

My soup had a little bit of chicken flavor, which was a bit weird since I ordered the tonkotsu ramen. I think they might have mixed the pork and chicken broth together. The soup was also not thick/rich enough.. But then, the good thing about this fact is, the broth is not too salty! I'm more used to ramen from Asia (Ippudo, Ichiran, Butao, Tonchin, etc.) So I find that my tonkotsu is lacking flavour, but be assured that I'm not a fan of salty ramen. I think saltiness and flavor is too different things.

I would give this a 3.5/5. The service was really fast, we didn't wait a long time before receiving our ramen! I think the noodles are home-made since they have this big noodle-making-machine in front of the restaurant."}
{"text":"4 stars: Tan Tan Men
Spicy and flavorful. We ordered thicker noodles but the texture feels a little hard for me. Overall, would recommend this entree if you're here for ramen.

3 stars: Tonkatsu with garlic oil
This lacked flavor for me, maybe because I ate the Tan Tan Men soup first. Either way, I'd probably pass on this ramen. 

Overall, there's plenty of other restaurants in Montreal that I think are a lot tastier!"}
{"text":"Went for a late lunch. Broth and noodles were quite delicious. Lover said she thought it could very well be her favourite ramen in the city, but 10 minutes later she was bored and didn't finish her bowl."}
{"text":"It's ok 
The texture of the noodles too soft they should provide options for the noodles
Soup based a little weak
The bamboo and seaweed do not mesh well with the soup
The chashu was overcooked it was dry

Overall ok for location"}
{"text":"Ordered tonkotsu spicy miso ramen ($11)

Couldn't decide on what to eat so came here on a whim. Came on a Saturday night and most tables were filled. As soon as you walk you walk in, you're greeted by all the staff in Japanese. The decor is very similar to other Japanese ramen restaurants but with a more modern feel with bright red and white accents. The menu is quite simple, each ramen has basic toppings shown in the picture and you can choose to add toppings with extra costs of course. One flaw was that it wasn't quite clear what the basic toppings were for each ramen by just looking at the picture. I ordered the tonkotsu spicy miso ramen and my friend ordered the tan tan (the other spicy ramen). Apparently those were the two most popular ramens according to the waitress. The portion was decent even if it didn't seem like it since the bowl was quite deep. Both me and my friend agreed that the broths were too salty especially after mixing in the spicy dark coloured paste which was on the ramen. I would just remove the paste if possible since it just really made the broth way too salty for my liking. It wasn't spicy and the spicy ramen came with half an egg and decent amount of meat. However the other ramen didn't come with an egg. We were surprised the type of noodles were different for both ramens. The spicy miso ramen had thin noodles while the tan tan had thicker noodles. Personally, I preferred the thicker noodles. It would be nice if they had the option of allowing customers to choose the type of noodles beforehand. All in all, the ramen was average but if you're really craving ramen and you're in the area you can give it a try. On a side note, there was an outlet beside our table which I always appreciate because I always need to charge my phone haha."}
{"text":"This is my Ramen Rant.  I've Recently been around the block at quite a few ramen places that are springing up all over Montreal and NYC as well.  Most are cheap and only so so. This  one Ichifuku, rhymes with legendary momo _  _  _ _, more than makes the grade. Having recently lunched at NYC's highly touted ,and forget about getting in, Totto Ramen, I think Ichi was better.

What one looks for in the Ramen bowl is savory broth, silken not to gummy noodles, high quality add ins and the gelatinous yoke hard boiled egg. 
My miso chicken ramen was outstanding with all of the above characteristics. My partner's  Miso Pork ramen ..
Ditto. For and extra $4 bucks we bought the combo with a very fine chicken Kara age rice bowl and a delicious flaked salmon rice bowl. It was all yum the to max and far exceeded my recent experience at Totto  which Is a little jaded by their success. It's also better than New York's  Ivan and Ipuddo ramen. So big up Montreal you got a world class Ramen joint!
A few more tips:
1. Its fast food beehive busy so in and out in 30 minutes no chance of lingering.
2. Very clean and brand spanking new.
3. Super nice and attentive servers
4. Great bang for the buck."}
{"text":"Stopped in to get some real ramen. My son got the #3 I got the miso (#2). Best ramen I've ever had. Can't recommend enough.
With an appetizer total was $33cad."}
{"text":"Some of the worst ramen I've ever had.  Not sure if the regular chef was out on Sunday night, or what the problem was.  I ordered the spicy miso ramen -- a pretty standard, 'safe' choice at a ramen joint.  The noodles were uncooked(?) and horrible non-ramen consistency; the 'broth' was a gouy-glop, more akin to goulash and not at all like the light soup-broth it should have been; the flavors were utterly bland; the piece of pork and small dollop of mushrooms were passable.  The server was very nice.  I'm really uncertain as to how this place rates so well on Yelp?  I've eaten ramen around the world -- and have had excellent ramen at places in Taiwan, Japan, and the Washington, DC area -- but this ramen was bad bad bad."}
{"text":"I LOVED this place! The ramen was amazing. The service was really great too, and because our ramen came with some spice that could dirty our clothes we were given little bibs.

For appetizers we got the spicy karage(only has a little kick to it), and fried dumpling appetizer that came in a really good sauce.

Beware, the ramen is HUGE! We both ordered the  special volcano ramen to which you could adjust the spice level to. I got the non-spicy. It came with chicken karage inside it as well. My bf got the level 2 spicy. Our waiter told us that it might be too spicy, but he really liked it! It opened up his airways.

The atmosphere of this little shop is so cute and lively! In the window, you can see a woman making the noodles as well.

I wish I lived here to come back"}
{"text":"My partner and I ordered ramen. We liked it because the noodles are thin and taste good. However, the dishes felt like they were missing something. Not much flavour and I got a side of chicken and rice, that was okay. I had really high expectations from previous reviews on yelp. I really liked that the noodles were handmade, it made the experience special. But i think the dishes need more flavour."}
{"text":"Wow this is a really nice place!!  Tasty fresh food served by friendly staff. I had the Sio soup and the fried chicken & rice.  I will definitely be back."}
{"text":"Friendly service and good tasting ramen. 
Also, their Gyozas are super tasty, the best in Montreal!
Ramen has chicken soup based or pork soup based. I personally prefer the pork soup as it is more thick and flavourful but I am sure their chicken soup is good as well. 
The ramen noodles come in different thickness, request your favourite thickness!"}
{"text":"Luv this place! Unpretentious! Ramen soup base is not too salty. Generous noodle portion! The pork I had was fantastic... Lean without too much fat. Definitely my top two ramen places in town."}
{"text":"Ordered the volcano ramen, all I can taste was just the spicy flavor, no other flavor in it. A bit disappointed. Hubby ordered a tan tan ramen, was much better. We also ordered the tofu son for my son, but the tofu was cold. The stuff served the ramen with his finger on the bowl, also picked up the seaweed with bare hands without putting on a glove. It happened right in front of me. I think they gotta improved further."}
{"text":"Japanese food appears to be one of the booming trends in Montreal Asian food in the last few years. Many large cities in North America saw the boom in the last while based on the popularity of Sushi then Izakaya.  Ichifuku is a strong contender for top echelon ramen in MTL. Located on St Cath W there is a plethora of Asian restaurants. I decided after trying Yokato Yokabai to come test another ramen joint, so I came here.  

The first thing you notice as you enter Ichifuku is the industrial looking noodle machine at the front of the restaurant. It's a clear indication of serious intent to bring fresh ingredients and quality to the establishment. In Japan (when I visited 16 years ago) Ramen is taken seriously. It's akin to how North American carnivores (and usually men) take steakhouses seriously. The restaurant is brightly lit and clean and feeling like it was a diner in another era. 

For my lunch I went with the Tonkatsu kuro mayu soup. At $11 it's very reasonably priced. It came out piping hot a few small slices of pork, scallion half soft boiled eggs and a beautiful milky buttery garlic broth. Overall the soup was a strong 3.75/5. I did find the soup not as hearty as other ramen places. The noodles were a good texture of chewy and definitely fresh. I was a bit dissapointed as for condiments it only came with shichimi togarashi (dry chilli). It would have been nicer with fresh condiments. Go ahead and charge me $2 more the fresh condiments would be better. Overall with tax it came to $12.65. I would come back here and try another soup as they had lots of selection on the menu. Service was courteous and expedient."}
{"text":"I was looking for Ramen.

I didn't find the place that Yelp had directed me to - mainly because of a GPS misfunction on my phone.  But I saw the white storefront of Ichifuku and I was intrigued.  There were people inside. 

The staff were very polite and welcoming.  They take credit card.  (No cash in my wallet this day).  The noodles are made on site.  

The soup itself was delicious.  It wasn't as salty as I'm used to.  The meat felt pre-cooked (not cooked in the broth as I have come to expect).  The delicate egg was good.  The portion was good.  I would go back as the restaurant, staff, food all were good.  But there wasn't anything that blew me away."}
{"text":"I came here with a friend because they had vegan options on the menu. They have a vegan tomato ramen, and also a ramen salad, which I asked and they said it's vegan. I got the ramen salad. I thought ramen is usually served pretty fast, but the service was a bit slow. The ramen salad had medium thickness noodles with different vegetables on top; however, when I started mixing and eating, there was no sauce that came with it, so I wonder if they made a mistake. The noodle texture is really really nice; it has a nice chew. But because there was no sauce, the flavor was quite lacking. My friend got the tonkotsu ramen, and the noodles were thinner, but he said the noodle texture was also very nice. I noticed the table next to mine someone ordered the spicy ramen, which apparently is really spicy. I wish they could make a vegan spicy ramen so I could try how spicy it is. The interior is very nice and clean. They have a noodle making machine right at the front.  There are bar seats and tables, but this is not really the place for a large group of people."}
{"text":"The best ramen in Montreal I ate so far. I tried two different tonkotsu ramen and I really liked it. Portions are not big but good for the price."}
{"text":"Literally the BEST karage chicken I've had here in montreal! We got pork dumplings, I didn't like how there was ginger mixed in with the pork but still overall delicious. I ordered the VOLCAN (spice level 1: medium) and the portion was ALOT. It was way more than their normal bowls, which also reflects this difference in the price ($12 vs $9). The volcan came with chicken broth and karage chicken as well, egg, onions and a garlic miso base. I thought the broth was okay, it wasn't my favourite broth. I prefer something more creamy like the broth at yokata yakabai on drolet ave or atelier asie in Chinatown mtl. The volcan also came with FAT noodles which I did not know, I usually prefer the smaller skinny noodles. My bf ordered the pork spicy tonkotsu & his review is similar to mine. We weren't a huge fan of the broth but his noodles were skinny and we both loved it. Overall I would return to this place, but I wouldn't order the volcan or tonkotsu again, would probably try their shoyu (soy based chicken broth)! This place doesn't use MSG & their noodles are hand made, and cooked with \"soft water\". They seem to take great care in the way they make and serve their ramen which I think is really important and enough to make me return here. :)"}
{"text":"TLDR: Fantastic Kaarage and nonexistent service.

A friend and I arrived at the restaurant to a queue of two couples, and the servers gave no mind to the line forming at the door. There were two spots at the bar, which my friend and I were happy to take when we learned the others only wanted tables, but we couldn't get any of the servers' attention. After waiting for twenty minutes, we weren't in a rush, three tables freed up and everyone in the line was seated.

I decided to get the ramen combo with a miso chicken broth base and kaarage as my side. I also got a Sapporo to was it all down.

The Kaarage was phenomenal, which is why I gave this restaurant three instead of two stars. It was juicy, crispy, and tangy all at the same time, and the fluffy rice underneath soaked up all the leftover flavour. If you go here, you have to get the kaarage.

My ramen wasn't to my taste, but I can understand how it would be to the taste of others. I should have gone with the Shoyu broth, but I wanted to try the miso and I found the broth to be unbalanced. The in-house noodles were very chewy and felt underdone, but I guess some could say it had a bite to it. The ramen came with corn, mushrooms, tender pork, spring onions, and half an egg which lacked a runny yolk. One compliment I can give the ramen is that it is very filling.

The servers are clearly very nice people but they were unaware of the needs of their customers. I only had my water filled at the beginning of my meal and it was impossible to get a refill as they walked around with their eyes to the ground.

With tax and tip, my meal came out to just under $24. Would I come here again? Only if I had a friend who really only wanted to go to Ichifuku. There are too many places in Montreal to try for this restaurant to warrant a second visit on my own volition."}
{"text":"I came here with a friend on a cold winter night. While the broth of the soups were amazing, I had the garlic ramen and it was very flavourful. However one thing that was a disappointment was the noodles. For some reason it wasn't on par of what I expected. I had better noodles before. I ordered the rice bowl snack as well which was yummy. I would come again but only if I was desperate for ramen.

One good thing was the pudding dessert which was almond flavour. Not too sweet but full of flavour."}
{"text":"This is one of my favorites ramen restaurant..good with friends and co-workers.. they're really nice people and excellent service."}
{"text":"If there's a way to improve this place I can't think of it. The service is like anything I've found in Tokyo and the taste is identical. I had the standard ramen for 10 cad and change and the chicken was cooked to perfection. The layout of the restaurant is perfect whether you're in a group or alone."}
{"text":"OK, I loved it. Having the choice of broth is amazing. I tried two types but I need to go back to try others. The service and ambience was good but the place is about ramen. Noodles were great as well, made on the spot too. Really, don't tell Ramen-Ya but the ramen is probably one of the best in the city. Maybe as good as Ramen-ya and I love Ramen-ya. I'm now in a crazy ramen mood, want it again today. Try it out! Check out the pictures of the homemade noodles. Sweet!"}
{"text":"Best ramen in Montreal! Fresh delicious noodles, amazing broth, fantastic sides and great service. 10/10."}
{"text":"Waitress was super nice - love you megumi.  The ramen had a nice broth - very rich in flavour. The chicken karage- crunchy and fill our belly.

We had tons of ramen in Vancouver but nothing compare to this.  Now - the problem is... how do I transport this place to Vancouver =P."}
{"text":"Vraiment ordinaire comme restaurant. Il était difficile de se faire comprendre autant en français qu'en anglais auprès du personnel. Le goût du bouillon était fade, il n'y avait presque aucune garniture dans le ramen. La viande était inmangeable tellement elle était grasse. C'était la première et la dernière fois que j'y allais. On peut définitivement trouver des meilleurs ramens ailleurs à Montréal. 

Les seuls points positifs seraient l'accueil chaleureux en japonais, le service rapide et les portions généreuses (11$ pour un énorme bol de ramen)."}
{"text":"Il fait froid, c'est l'hiver et j'ai faim.

La soupe ramen est idéale. 
Ils ont un menu simple mais complet avec des choix de garniture qui pour 1.25$ rajoute vraiment une dimension différente. 
J'ai pris un repas très ambitieux:
les Gyozas au porc.(très bon) Option légumes disponible. 
Et le Karaage Don (Poulet frit sur riz avec soya) (excellent soit dit en passant).
La Tonkutsu ; soupe au bouillon de porc salé avec rajout de chashu et nitamago (Boeuf braisé et Oeuf mollet). 
Vraiment génial pour moins de 30$ ce qui est pas mal dans le plus cher si on ne boit pas d'alcool par personne!

Les nouilles sont fait maison à la machine. Celle de ma soupe était fine mais bonne et certain convive avec prix les nouilles d'extra plus large et épaisse qui semblaient délicieuse. 


Je vais y retourné, c'est 100% certain."}
{"text":"Delicious ramen!! The noodles are made right in the window, and you can just taste that they are fresh and homemade--so tasty and tender! The broth is flavourful and rich, although be prepared for saltiness, if you haven't had ramen before. 

The service is so friendly and attentive. The atmosphere is fun and relaxed. I will definitely be back for more!"}
{"text":"They close after lunch hours and reopen at 5pm for dinner service. I arrived early on a cold day and the waitress was kind enough to let me sit inside until they were ready to begin dinner service. I ordered a combo - tan-tan men and a karaage don rice bowl. The broth was flavourful, however the portion size is extremely small and I do not remember seeing an option to add extra noodles."}
{"text":"I have been to Ichifuku 4 times. Ramen are good enough and cheap. But they are NOT \"very good\" and very far from \"great\". Their dessert option is good."}
{"text":"I found this place to try another ramen restaurent than misoya ramen. 

They give some special ramen like volcan ramen. 3 level from non spicy 0 to spicy level 3. Actually, it's not really spicy (compare to Mckibbins Rim Reaper wings). Very tasty for someone who like spicy food. 

I tried it with extra chashu because the topping is the fried chicken cube. It match perfectly with the spicy sauce in the bowl. 

Talk about the soup. It's not too salty for volcan ramen. But the one my Gf tried is salty. But still very good. White creamy with oil.

I definitely will come again to try the classic miso ramen."}
{"text":"A nice place for ramen !!!
I ordered volcano ramen. It was very spicy. The soupe was pretty thick. It was a very heavy ramen with deep fried chicken...but it tasted so gooood!!"}
{"text":"We had the volcano it was absolutely delicious and yes spicy, but the broth was on a thicker density. We were expecting a lighter broth but that didn't change the fact that it was full of flavor. Service was amazing. They were having trouble with one of kitchen machines and that was delaying our meal. But manager sent the waitress to apologize and gave complimentary appetizer. He also later came and apologized himself. That in itself is amazing. We would definitely go back maybe try their lighter broths."}
{"text":"Finally got around to try this new ramen joint in my hometown with another fellow Yelper. The ramen scene in Montreal was very limited in authentic options (except for Ramen-Ya, always #1 since my teen years!) that were both affordable and convenient. Ichifuku is a stripped-down sit-down restaurant where the focus is on delivering hot, fuming ramen bowls to curious and less curious eaters hunting for an exotic meal. Despite the cold atmosphere, devoid of any decoration, the welcoming was warm. Staff greets you in Japanese at your entrance, isakaya-style, and seats you in one of their 30 seats or so.

The environment reminds me of the no-frills takeout Japanese restaurants, except that the high ceilings and open-concept kitchen set the mood for a modern Asian eatery.

As usual, I ordered a shio ramen with regular offerings. Broth was as clear as expected, maybe a bit more salty than what I expect from Japanese soups but still palatable. The toppings (bamboo, bean sprouts, seaweed, pork shank and soft-boiled egg) were executed to perfect, especially the egg. The noodles were a bit deceiving: I knew that they weren't made on-site, but I didn't expect to taste some noodles still in clumps (because of the way they are packaged). Nonetheless, it was an enjoyable ramen for a fair price (around $11). Also, it's worth nothing that portions are HUGE compared to typical Japanese places.

Also, a variety of beers on tap are offered. Ramen always pairs well with a Sapporo or an Asahi (best!).

Definitely coming back: Montreal is ready for ramen, and Ichifuku sets the bar high."}
{"text":"Afer being back from a trip to Japan this fall eating the most delicious food,this is really the only place in montreal that has come close to authentic japanese ramen.the noodles and broth are just right.I also like that the place is unpretentitious and is not trying so hard to look like a hip japanese spot.This has become my regular go to spot for ramen.happy slurping"}
{"text":"ATMOSPHERE: It's a cute little restaurant with simple decor. Kind of like a classic Japanese ramen shop with a touch of modern decor. I'd suggest sitting at a table and not at the counter cause it gets hard to move around when your seating space is limited.

FOOD: The food was delicious. I had the Volcano ramen (level 2) and it was amazing and spicy. I also love their spicy and classic karaage. The flavor itself was great. Their portions go hand-in-hand with the different prices. I will for sure be coming back!

PRICE: Prices were very affordable, especially if you compare them to similar restaurants in the area. Ramens range from 9 to 13$.

SERVICE: The service was great. The chef is super friendly and the waitresses are very nice as well. Although it is a tad bit slow at peak hours, it's to be expected when it gets so crowded and they're understaffed."}
{"text":"Having taste some top notch Ramen around Toronto, I've heard a lot of good things about this place. I believe it was all hype like a Supreme release. Yes, they roll their own noodle, but Kinton Ramen is way more lit!!"}
{"text":"First time when I was here, i ordered a combo of Tan Tan noodle  + small eggplant & rice dish and were not  impressed, the ramen was already too salty and the eggplant dish was greasy and saltier than the noodle! I left the place feeling too full & thirsty. 
Second time, however, I was in a rush for a movie after so I ordered a basis ramen - it arrived within 5 min, very fresh and filling, the bill? $12-13 including tips! I won't make a special trip to come here for the food but the classic items are good enough and very convenient for a after-work meal before catching a movie at forum."}
{"text":"Good taste, seems clean, nice service , honest price, good adress for me but they have only 1 dessert lol .. keep it simple and short ;)"}
{"text":"Now that's good ramen. Admittedly my fave ramen for the neighbourhood is still schlouppe on Mackay, but Ichifuku comes in as a close second. Also, I like that this place gives Ganadara a run for its money in terms of ramen quality.

The space is unpretentious though tastefully designed (which I really appreciate). It's a healthy contrast to the really decent plating and fantastic food at a very reasonable price.

While I have to agree with other reviewers that the service was variable, I do have a lot of respect for the one woman show that was the service on a busy Monday night. Also the food came pretty fast so I can't complain too much.

Vegans- they have two specifically named vegan items on the menu (one ramen and one rice bowl) but I get the impression you could tweak other items on the menu to be full veg."}
