{"text":"I ate here last week and it was fantastic. I was attending a show at the Bell Center and I had heard of this place. The Octopus is amazing as are the scampi's. If you're a fan you have to go try them. Also the wine list has to be one of the best in the city.  They have free parking when you eat here, so great tip when going to a game/show at the Bell Center."}
{"text":"Our group of eight arrived for what we hoped would be an enjoyable, conversation filled evening. Unfortunately at 7:30 a hockey game broke out on very large flat screen TVs generously placed throughout the room. 
What we where looking for - a fine dining experience turned quickly to a sports bar.
I wish I could say it go better but it got worse, our food arrived cold and with disappointing portions. The service on beverages was predictably good (sports bar) but on the food quite average.
Even on an evening without a hockey game being shown you can do much better in the surrounding area."}
{"text":"The ossocucco, the gnocchi, the risotto is always good here. Free parking! A huge wine collection! Vertical! If you can't find a supertuscan at the store, the owner probably has it. He is open to groups but he does not have a private room."}
{"text":"Calling Il Campari \"fine Italian dining\" captures the quality of the food and service, but doesn't give the heart and soul of the place any justice. Maybe it's the owner personally seating you, or the wait staff's respectful but friendly demeanours but there's something about this place that makes a meal here feel special without feeling pretentious. 

Appetizers range from $7-20 and entrees $20+, and portions are very generous. I had a busy day and had skipped lunch, but after the (free) bread and my soup appetizer, I was already starting to feel full. But my entree was so delicious I couldn't stop until I basically licked my plates clean! 

I've been here a couple of times for dinner and the \"busy-ness\" really seems to vary based on whether it's a hockey night. Hockey nights are super busy and vibrant, and non-hockey nights are much more quiet and subdued. Either way, the food is incredible and makes for an unforgettable experience. 

Bonus: You can park in the open lot behind the restaurant (enter from Drummond) and the wait staff can validate your ticket so you can park for free."}
{"text":"We had a friend recommend this place and Il Campari Centro really delivered. We are in town for the Rock n Roll Montreal Half Marathon and wanted to have an upscale Italian dinner. The room was tastefully decorated with good lighting and sound for casual conversation. We had the grilled salmon, the pasta trio and a simple spaghetti plate - all excellent. Our waiter Carl was extremely attentive and I think we may have convinced him to run the race next year. The tiramisu was a good dessert to split. Light and a good compliment with the home made Italian cookies. I'd highly recommend this place!"}
{"text":"Un restaurant chic et de bon goût, les prix un peut élevé mais ça vaut grandement la peine entre amis, travail ou amoureux un choix d'excellence pour célébrer un événement !!! À essayer !"}
{"text":"This is now easily one of my favourite Italian restaurants. The place looks nice and clean and the waiters are great. The grilled octopus is amazing! So is the pasta! Great food and great service, plus free parking! We liked everything about this place and are looking forward to our next visit!"}
{"text":"Between the unassuming exterior and its location just off of the high traffic areas of downtown, Il Campari Centro is easily missed if not for the recommendation of someone who has been there, in our case the concierge of the nearby Sheraton.  The interior of the restaurant is unmistakably dated yet appealing with a mix of wood features and colorful accents that befit a classic Italian dining experience.  The staff is the first real indication of what is to come, as they exude an air of warmth and professionalism upon entry that continues throughout the entirety of the meal.  I later discovered that most had been working together at the restaurant for many years, explaining not only the quality of the service but how comfortably they assisted each other.  

We began our meal with the Fiori di Zucchini appetizer.  The zucchini flowers were crisp and tasty with a mild flavor, serving as an effective warming of the palate without interfering with the main course.  For that portion, I ordered the Ravioli di Formaggio alla Puttanesca while my companion had the Osso Bucco alla Milanese.  The ravioli were small and thin for easy consumption and had a pleasant texture.  The eggplant, olive, and pea accents added flavor to the dish without being overwhelming.  Meanwhile the veal of the Osso Bucco was exquisitely tender, supplemented by a subtle assortment of flavors.  The pace between dishes was leisurely, encouraging the savoring of each and providing sufficient time to rest before the next.  It should also be noted that each of the items featured impressive presentation.  I am not one of those people who takes pictures of their food to share on social media, yet these dishes very nearly caused me to do so.  

As much as I appreciate chefs who push boundaries and attempt ambitious combinations of elements, there is much to be said for the steady, high-quality execution of classic dishes.  That appears to be the theme for Il Campari.  There is no pressure to be different or new, the emphasis is on delicious meals and excellent service that represent the best of the Italian dining tradition.  Having seen too many quality restaurants disappear over the years, I implore both the visitors to and the residents of Montréal to support this one.  Hopefully your experience will be as pleasurable as my own."}
{"text":"We came here for our wedding dinner, just the two of us, this past Saturday night.

They welcomed us, took our coats and, although it seems like a small thing, the waiter got my chair for me.  A little act of class like that goes a long way these days.

The wine list was fantasic and our glasses were never even close to empty as the waiter was super attentive and timely.

The food was superb.  The gnocchi I had was as good as the gnocchi I ate in the heart of Rome.  The mozzarella melted in your mouth and the crème brûlée was amongst the best I've had.

The service was wonderful, attentive but not overbearing, classy but not pretentious and the manager made his rounds to speak to the diners, which gave a very nice personal touch.

I will gladly celebrate our anniversary here next when we return to Montreal next year."}
{"text":"An Italian gem in the heart of downtown Montreal! Great romantic place to go to with your significant other, or even for a bite after a hockey game! I really enjoyed the service and the food!"}
{"text":"I went here for my friend's bachelorette dinner and was so pleased! Staff was very accommodating for our large party. Service was outstanding! Our wait staff was so personable and hilarious! We had had a wonderful time. Our party of 12 ordered various dishes. Perfect portions and there's something for everyone. There's a vast selection of wine. I don't think you can go wrong if you're looking for great food and quiet setting to catch up. Great for both small and big groups. Overall, ambience is fantastic and the service was outstanding!"}
{"text":"Great atmosphere, exactly what you would expect for an old school Italian restaurant.  The service was exceptional.   All the dishes were delicious.  They took requests for changes to a dish and accommodated one of our table.  Vast wine menu. Our choice was very good."}
{"text":"We had a wonderful experience here. The host, Pietro, was most gracious. We had a large party of 17 and had made reservations. Everything was ready when our group arrived. Many of us had the meatballs for an appetizer. They were described as delicious, and they did not disappoint anyone. Many of us had the lasagna as an entree. This was easily one of the best I've had in recent years. 
The service staff was knowledgeable, prompt, professional, personable and spoke both French and English. One of our group had been here before and thought we would enjoy a nice meal here. We did, and I would and will recommend this place.  Atmosphere, decor, cleanliness, staff, food, drinks - high marks all around."}
{"text":"I have eaten many times at this restaurant located just down the street from the Bell Center.   Not sure why, but lunch times there is always lots of place, no real reservations required.  The table d'hote is always fantastic, from the fish to the pasta.   The deserts are awesome and the small bite size portion is a great way to finish off a meal."}
{"text":"Two of our party ordered steak, which arrived cold, so it had been sitting for a while. Two people ordered fish, which reeked. My friend actually tasted the fish, which I would not do just based on the horrible smell that emanated from the fish. She said it had most certainly turned bad.  We could not imagine what chef would send out plates of fish which smelled as bad as they did.  The maitre d' came over and said it was a matter of opinion.  Our opinion is that you should not spend your hard earned money on any restaurant (especially one as expensive as this one) where they attempt to dispose of food that has gone bad by serving to their customers."}
{"text":"Very nice Italian restaurant in Montreal. It has romantic decor and a great wait staff. Our waiter had a very strong French accent (shocker in Montreal) that was very funny and accommodating.

I came here with my wife on a blistery cold Tuesday night in March 2007. So the place was probably 10% full. It is huge inside and looks like a great place for not only a dinner, but a party.

I ordered the gnocchi with porcini mushrooms and Gorgonzola. Very tasty dish. My wife had the filet mignon, which was so damn good. The waiter was spot on with everything. He knew when to get our drinks, and also knew when to leave us alone. It was a romantic setting, and definitely a place I would like to visit on my next trip to Montreal."}
{"text":"Wood paneling, a great (though expensive wine list), and a Goodfellas feel to this hidden gem that has been in business for 35 years.

An above average selection of pasta standards including squid ink fettuccine, and pesto made with basil so fresh it took on a different flavor.  The beer selection is poor, however the above average wine list made up for it.

Many varieties of scalopini, soups and fresh seafood, makes this more than just a pasta joint.

Service is friendly and professional.  I will be back."}
{"text":"This is the first time I've been back there since 1980 before they moved downtown. We had our meal on the outside terrace(in July) and it was lovely, although a bit cramped. So much so that we struck up a converstion with the people at the adjacent table, who were also traveling.  The wine selection is good as was the food.  The portions were good and flavorful.  The wait staff was extremely attentive and interacted well with the customers.  We'll be back again this summer."}
{"text":"It has been a while since I have been to a classic upscale Italian restaurant.  I went here for my father's 65th birthday on the advice of my cousin and it was a memorable experience.   

Il Campari is a classic restaurant in many ways.  First the wood panneling and classic decor makes you feel like you are at a place that is a product of a bygone era.  The second is the professional waiters.   These are people who have done this for a while and know exactly the proper way to treat the people they are waiting on.  Our waiter was a gentleman in his mid 40's and he was a combination of waiter, host, and maitre D.  It has been a while since I had service that good.

In terms of food, everything was amazing.  For an appetizer I had a combination of fresh vegetables and homemade Italian sausage which was really tasty while my father said that the soup he had was some of the best minestrone he has had.  My main was their seafood and mushroom risotto, it was fantastic.  A bowl full of shrimp, mussels, clams, calamari, and other seafood along with wild mushrooms and an incredible sauce.  My mother had lamb that she said was excellent while my dad really enjoyed his pork shank.   I didn't have a desert but my folks had a chocolate mousse that they absolutely loved.  

For drink they have an excellent (but expensive) wine list.  We had a bottle of Italian Cabernet Sauvignon that was very nice, but I struggled to appreciate it being $70.00 good.  I guess that is going price at upscale restaurants like this so you take it in stride.   It will probably be a while before I go back due to a) the price, I can't justify going to a place that fancy all the time and b) geography, I live in Ottawa.  But if you either have some money or are looking for a restaurant to go on special occasions then Il Campari would be a great choice."}
{"text":"We chose this restaurant after getting in to Montreal after a long day of travel. It was located across the street and looked charming. We sat outside under the awning. The service was fabulous and the food was even better. 

We had the Stuffed Zucchini Flowers and they were very tasty and different. They were followed by fresh Spinach Manicotti and Eggplant Parmesan. 

I have been on a search for good Eggplant Parmesan for years and I finally found a PERFECT one, but I had to leave the country to get it!!

Our waiter was very friendly and we enjoyed chatting with him."}
{"text":"Decent italian cuisine. Quiet, small, boringly tasteful interior. Friendly slow waitstaff. Gorgonzola noci gnocchi were delicious, but not enough noci. Pasta fagioli could have been more flavorful.  Hazelnut tiramisu was nice, but lacking substantive flavor and overkill with the mocha powder. Better than expected but still just ok."}
