{"text":"Do yourself a favour, and go down the street to Violet Angel!   This place is horrible. I have one positive thing to say, much like the other reviews, and that is that the waitress is very pleasant. That's where it ends though.   The food! Oh my god. So awful.  There aren't a ton of tasty food options in the village, and if you walk along the boardwalk and you'll find plenty of terrasses to choose from, but the restaurants are all mediocre at best. I was hoping for more from Il Lago, but it was actually worse than I could have anticipated.   My pasta was probably cooked about 5 minutes past the necessary cook time (totally mushy), the manicotti had a very questionable looking & tasting meat mixture in it (grey, slimy, funky), and the chicken parmigiana was so overdone that I was convinced I was eating pork or veal: it was dark and hard to cut (with a serrated knife) and tasted absolutely awful. I can't believe the chef was able to take a chicken breast and turn it into a brick. I'm shocked!  Food aside, unfortunately the terrasse is in very rough shape with broken floorboards, wobbly tables, cheap plastic chairs, and none of the pretty twinkle lights the other terrasses have. The inside of the restaurant looks quite nice, and if the food were remotely edible, I'd come here in the winter to eat inside. But ya, that ain't happening."}
{"text":"Let me start off by saying that our server was extremely sweet and accommodating and offered terrific service. She was always easily accessible and quick to meet our needs. She is the reason there is at least a star rating for this restaurant. The terrace was nice and has a nice view of the water. However, for the restaurant itself, there is minimal selection on the menu which okay if the quality of the food provided is exceptional.  Unfortunately,  the food is grossly sub-par especially taking into consideration the price of the meals. We ordered 2 separate pasta plates and one came out wrong.  They did offer to make the correct plate but we had already been waiting for over 45 minutes. The pasta itself was quite tasteless. In addition, our group ordered  the calamari entree which was rubbery, the fries which were very dry, the chicken masala was too salty with a thick gravy. As a side they offered linguini with tomato sauce which we changed to Alfredo sauce and that was 3$. The mussels we bland and under cooked. Overall, it was very disappointing."}
{"text":"There are many choices to choose from in this area but, this is one you should definitely try out.   So glad that I did not see Yelp before I came here.  The muscles and fries special was excellent, service is great, prices are very reasonable, and other food quality was spot on!"}
