{"text":"I went to Il Sogno for dinner (mainly because of the location) and found it be decent.  It's pretty small... about seating for 20-30 including the patio, but the food is good.. I'd say along the same lines as Grazie up the road.  The pasta is great and the calzone I had recently was a-ok.  

I found the waitresses a little inexperienced as they were confused about what to do when I spilled my entire drink.  They also took a little while to notice what had happened which was strange considering we were the only people in there (at about 7:30.. I think it gets busy around 8-9).."}
{"text":"Love this place! They have specials most weeknights and their $10 pizzas on Wednesday's can't be beat. I eat here about twice a month and have yet to be disappointed. They have a great little patio and the servers are wonderful & friendly, sometimes we pop in for a pint just to catch-up! If you're in the mood for some delicious, thin crust pizza try the Fuoco. This place is truly one of the hidden gems of the neighborhood!"}
{"text":"This is a really small place with great ambiance, if a little loud on the music front. Service is really friendly and prompt and we were not wanting for anything from our server. Really great beer taps and a decent wine selection.
Food wise it was a mixed bag. I had pizza and while tasty, the crust was premade with toppings added as ordered. We saw the crusts sitting on a rack in the open kitchen. While not a big deal, it almost always makes for a crust that's really on the hard side. My wife had pasta and thought it was good. Not great, but good enough that we would go again.
They have specials throughout the week making for a very busy place. Check out their website to see what's happening. We went on $10 pizza night Wednesday."}
{"text":"Such a hidden gem!  Il Sogno offers a quaint and personal vibe. Tues/Thurs BYOW no -corkage, Wednesday is $10 pizza, and my personal favourite, Friday is $4.50 Martinis. I love this place for after work drinks with friends or a few cheap martinis before heading downtown. 

Service was on-par. At first, our server forgot about us but when she did come by she was extremely personable and apologized for forgetting. 

Overall, Il Sogno was charming. Potentially my go-to neighborhood spot for good italian food."}
{"text":"Monday past as $10 and Wednesday any pizza is $10! Great deals. I've been for both nights but would not pay the regular price for what I ate. I got the linguine rosa pasta with chicken and pine nuts. It was pretty good, the pasta was cooked just right and the sauce was flavourful. There could have been more chicken in the dish but for $10.......
The pizza was great too! Nice flat, chewy crust and good toppings. I had the spicy sopressata.on the Monday, we had free bread and oil/vinegar to dip it in....the only problem was that the dispensers were DISGUSTINGLY dirty. We were in at 5:30 so it's not like they had a bus load in before us with sticky fingers molesting the bottles...I tink they have just NEVER been cleaned.
The service on both nights was good. But better on the Monday as the staff was different and the place wasn't as busy!
Apart from the dirty dispensers.....go here for your $10 Italian fix!"}
{"text":"The pluses: The service is fantastic, their servers are seriously awesome.  The drinks are great.  No corkage fees Tuesdays and Thursdays.  Cozy atmosphere.  

The negatives: This is not Italian food.  Seriously, the food tastes like it comes out of a package and like the preservatives that it is undoubtedly full of. As an Italian woman, this is actually insulting.  I have been here a few times as my friends that live in the neighbourhood hang out here regularly.  I will never eat here again, I have been nothing but disappointed with the food every single time.  

That being said, I will be back for drinks and to hang out."}
{"text":"Cute restaurant---an Italian gem in the community.  The grilled calamari is the best I have ever had (The balsamic reduction brings it over the top).  The mains are simple yet well executed.  The service is fast and efficient and our servers have always been very friendly and outgoing.  Check out their website regularly as they always seem to do something fun (such as $5 Martini night and BYOW).   It's worth a visit...enjoy!!!!"}
{"text":"I came here with my boyfriend to have a lovely, quiet dinner. What we got was anything but.  First off, the food took FOREVER.  I'm talking hours. We had Caesar salad which was decent, bruschetta which was tiny and grilled calamari which couldn't have been more over cooked. An hour later we finally got our pizza which was disappointingly not worth the wait --barely any toppings and the pizza dough seemed store bought. The  upside is that the pizza was hot.  The downside is that that's the upside. P.s the chili oil has no spice to it.  On top of all of this, we were surrounded by drunk men yelling to each other back and forth from the bar to the front table. Men, by the way, who were pouring alcohol from their flasks into their drinks while the server wasn't looking.  The server couldn't have been less apologetic about the experience and how long the food took.  Apparently the computers were down but having worked in multiple restaurants, that's not really an excuse as to why the food took over an hour to hit the table.  The restaurant itself only has about 10 tables total.  Definitely not worth the money. Save your appetite, save yourself!!"}
{"text":"came here for a nice casual dinner and will definitely return

ordered
-tornado and another martini, they were made perfectly! Just the right amount of liquor and juice 5/5
-shrimp and mushroom linguine with oil 3.5/5
-chicken penne with rose sauce 3/5
-chocolate chip banana cake 5/5

overall the star of the show was the chocolate banana cake!!!!!! I'm not a sweets fan and this was amazing.

I'll come back for sure for their BOYB night, and $10 pizza night. 

This server was very nice

p.s this was a nice cozy restaurant that can seat about 30-40 people, i wouldn't say it's good for parties"}
{"text":"I love this place - tiny, good food, BYOW Tues & Thurs with no corkage fee. The staff are great but do NOT expect seamless, chain-like, \"Hi - my name is Mindy and I'll be your waitress\" service. If you want plastic smiles go to Alice Fazooli's."}
{"text":"Made a reservation for our Anniversary dinner and arrived on time, seats were promptly waiting and staff were very friendly.  Ordered their Rosario Pizza and small Antipasto Platter, food was nicely timed, fresh and delicious!  Great food and service, would absolutely recommend and return!"}
{"text":"Sigh...do you ever run into a server (who I think may be an owner) who clearly just doesn't care? Like absolutely has zero desire to do, you know, the job?

Arrived at Il Sogno and found my friend already seated...banged the table and both water glasses spill all over the place...ask our server for napkins and she proceeds to drop of two of them for a table soaked in water...which we clean up ourselves...I hand her the drenched napkins and one of the linen napkins (needed due to lack of napkins) and asked for a new one...she proceeded to ask for my drink order despite never having a) given us a drink menu b) my having two seconds to think about it given I'd just spent my entire time at the restaurant mopping up water...then proceeded to get attitude over the drink menu...she needed to know whether I wanted the wine menu or the beer menu even though there is no beer menu (it's on the wall)...why wouldn't it be standard practice to bring a wine menu with the food menu AND tell people where to look for the beer list?...the new napkin proceeded to not arrive and I asked for it again while placing our food order...food arrives, no napkin and I ask AGAIN...five minutes later I give up and take one from another table.

The food was forgettable...pizza was greasy...my penne with chicken was ok...nothing I couldn't have made better myself...

Our server seemed shocked we didn't want to stay for desert and then gave me a nasty look when I left a 5% tip (WAY more than the service/food deserved).

Maybe she was having an off night, maybe she'd just gotten bad news, but no part of the experience made it worthwhile to give this place a 2nd go."}
{"text":"Great food... Bad service... We asked for bread and were told they didn't have enough and they were running low... Very unprofessional answer. Wouldn't go back due to bad service.   The waitress never asked us how we were doing and forgot the chicken in friends pasta.. No apologies no nothing."}
{"text":"Great little spot midtown, cool ambiance!!  All I have to say is.... the pizza is to die for.  Can't get over the tasty thin crust. Wow! Great services too, friendly staff!"}
{"text":"The Agnolotti Ripieni stuffed with butternut squash w/ spinach & mushroom cream sauce is AMAZING. 

I order this dish every time, along with one of their signature gummy bear martini - \"The Situation\". (Fridays: $4 Martinis)

The service is just as awesome as their food. The bar tender is very personable and has a good sense of humor. I understand the complaints some yelpers have regarding service, as it's a very small place, I don't think they can hire that many waitresses to make the place even more crowded. 

They open at 5PM dailiy, so just call them and leave a message on their answering machine to reserve a table. Trust me, they are always packed, especially on the weekends. 

There's also a nice patio for those who find it too stuffy inside. The chairs could be a little more comfortable, but I have no complaints because the food is great. The portions are not as large as Grazie up the street, but their pasta variety is definitely more unique. 

I will be back!"}
{"text":"For me and my boyfriend, this is our  favourite go-to restaurant in the area. Food is always good. Definitely get your money's worth. Penne d'amore is my favourite. Reasonably priced for the area. Never had bad service. Cant wait to go and try the second floor when its completed. The only downfall is that they have a small, limited dessert menu. But other than that, love it."}
{"text":"Cute small midtown restaurant.  We got the Eva Bella pizza (grilled chicken, pesto, mozzarella cheese, roasted red peppers & goat cheese) to share as an app. I seriously think getting mains as apps are the BEST idea! It was covered in toppings and I would def wanna come back and try other pizzas here.  I ended up dipping my crust in the balsamic sitting on the table which was SWEET :)

For my main I had the Agnolotti Ripieni (stuffed with butternut squash, alongside spinach & mushrooms in a cream sauce).  I liked this and they don't skimp out on the spinach and mushrooms.  The portion was small as I easily could've eaten two haha, but I'm a big eater.  Also, the cream sauce is quite heavy and they put a little too much of it on.  But still a great dish!

Dessert we got tiramisu (nothing special) and a chocolate molten lava cake which was fantastic.  It was light and fluffy, not dense and the chocolate oozed out nicely from the center."}
{"text":"This was just such a nice hidden, ambient place. It was a cozy little Italian restaurant, the server was probably one of the nicest I've met. She was over-friendly but it was nice. One of the things I loved was that she was able to get the cook to make our pizza half veggie and half chicken. And she would bring us whatever we needed. The pasta was one of the best I've had, we had the seafood pasta with shrimp. The pizza, and for the appetizer - bruschetta. We also went on a Tuesday so it was BYOW, and there's an LCBO close by so we just bought our own wine. It was just great. The only reason I don't give this place 5 stars is because the space was a little tight, so try to make reservations if you can, and we got seated in the corner near the door so we did get a little cold with people opening the door and what-not. There's a bar there too so you can either go there casually with friends or on a date. There was only one server, so she was a little slow at times. All in all, it was great, I'd definitely go back, it was a hidden gem and I felt pretty cool to have found it."}
{"text":"From the friendly, accommodating staff to the mouthwatering pasta, this hidden midtown gem is not one to be overlooked. My boyfriend is a very picky eater and is often given a hard time when he asks for modifications to a dish - not only were his requests accepted, he couldn't be more thrilled with the result! We look forward to our next visit to Il Sogno."}
{"text":"Just wanted to deliver on my promise to our server to give this restaurant the best Yelp review because she gave us a cup full of gummie Bears after dinner. They use them in their cocktails and she could see my desire to pinch some from the bar.

Excellent pizza & pasta and the best new old fashioned in town! Great atmosphere and service with prices that don't break the bank."}
{"text":"4.5 stars!

The calamari was really good!  Not stringy or tough.  The batter was light and potions were decent.  The Pappardelle Bolognese was excellent.  The meat sauce was very flavorful.  We also had the Tortiglioni d'Amore was good too but not as good as the Pappardelle Bolognese.

The service was excellent as well.  We would visit again."}
{"text":"Casual joint serving nice Italian fare in a setting that would be cozy if not for inconsistent ambiance. Tries hard to be modern, mood lighting worked but loud house music didn't. Food is good without being fancy, portions are reasonable, pricing is fair, and better than fair on $10 pasta Mondays, which is when we went.

Pro tips: There are two pastas that don't count for the $10 special (the gnocchi and the butternut squash agnolotti). Linguine il sogno is nice for a lighter taste, those who want heavier flavours will favour the chicken/mushroom fettuccini in rosé sauce. Gluten free pasta available for a small charge. Limited seating, groups should advance reserve."}
{"text":"I've been here twice, and as luck would have it, the same server has served me. This is a very small restaurant, so she can easily cover the entire floor! She's a very friendly and personable server. Yesterday, because I was the first one in, she gave me control of the tv! I switched it from some boring soccer to a chick flick (I wanted to watch Homeland, but unfortunately, that channel was not available).

The linguini with chicken and portobello mushrooms in rose sauce was very good and quickly filled the spot. The previous meal I had was equally delicious.  On Tues and Thurs, you can bring your own wine. The kitchen closes around 11:30/midnight. This is good to know for a future outing."}
{"text":"Definitely worth a visit. Delicious italian food and good ambience. Not too crowded, at least when we visited."}
{"text":"UPDATE: After several visits, I can say that the food is simply not worth eating. The only reason to come here is the drink specials: No corkless charge BYOW on Tues and Thurs, $4.50 martinis on Fridays and $5 pints on weekends

The bruschetta tastes fishy (I've had it twice).
The pasta is boxed, dried pasta in very unmemorable sauce (tastes canned).
I had pieces of bone in my chicken on the chicken pizza (the chicken is not even cooked in house).
The Mangicake pizza is just not pleasant. The salami they use has a very fatty, greasy texture and the flavour is too earthy, rather than meaty and salty.
The pizza crust is very bland - enhanced only by the chili oil (which is pretty tasty)

Just stick to a salad, I guess. i haven't tried any of those but it's hard to mess up a salad, right? 

Prior review to follow:

I really want to like this place because the drink specials are fantastic and it's a nice, intimate atmosphere. I came here for the corkless Tuesdays (no corkage fee) so I could actually bring a good bottle of wine to share for my friend's birthday. It was very quiet when I arrived. The server was friendly and attentive. I had ordered the pasta here once before and knew it was boxed (I had the Penne Amore and it tasted like Italpasta in Classico sauce), but we were by the open kitchen, so I asked the chef anyway. He answered honestly that the pasta was dried and recommended the pizza. 

FYI: If the pizza description doesn't say \"mozzarella,\" it doesn't have it. 

Ordered the special - chicken, goat cheese, pesto, sun-dried tomatoes and added some mozzarella ($16). It was actually tasty with the \"spicy\" oil they have at the table. Sadly, on my second piece of pizza I bit into something hard and unbreakable. I (yuckily) yanked it out and it was a tiny piece of bone. Didn't want to make a big deal so i kept eating but then came across another tiny bone piece! This was after some fishy-tasting bruschetta ($7), as well. I told our waitress and she apologized and took the pizza off our bill.  She said the chicken is not cooked in house, either. I think this place lacks quality control. Would love to see them cook their own meat and pasta in house and at a higher quality. The prices are not cheap enough ($14-18) to justify boxed pasta, canned sauces and mass-produced cooked chicken with pieces of bone still attached. 

But I will probably come back because the drink specials are so good."}
{"text":"My fiance and I spontaneously decided to stop by this place because we felt like having Italian food. This was our first time there and we had a good time. Everyone from the waitstaff to nearby customers were full of joy and spirit, which was refreshing. Our waitress definitely deserves a medal for the courteous service that she provided. If I were to judge our experience purely based on the quality of service and the intimate atmosphere, it would be a no-brainer 5 star.

Now let's talk about the food. I ordered a plate of Fettuccine Bolognese and my fiance had Gnocchi Alla Gorgonzola. His gnocchi was chewy, flavorful, comforting and overall fun to eat, which is up to par but nothing to write home about. My meal, on the other hand, was lackluster. The sauce to pasta ratio was way off and the tomato sauce was overpowering. 

In summary:

Recommended for: people who want to watch sports at a cool Italian bar

Not recommended for: hardcore foodies"}
{"text":"Fab drinks and food!Great Friday night spot to get the weekend started. Wish there was a bit more space though but it's not enough to keep me away from 5 $ Friday Night Martini nights and deelish pasta!"}
{"text":"My experience is more similar to heather b.We went their for my sister in laws Birthday .For seating in a small restaurant they were very accommodating.I have read other reviews and realize that the owner does get touchy about any negative reviews,infact on other websites he has answered back to customers  with a bit of arrogance ( if he watches ramsey kitchen nightmares he would realize a bit of a no no )lol anyways he told one reviewer that he is not Italian so does not see how non Italians can tell Italians what Italian food is ! So here it is i am not Italian but everyone else at the table except for one more was not ! And they all were not impressed with the food . i am very suprized at the rav reviews .Seriously is it his friends reviewing it on yelp ? The pizza had no taste the crust the dough had no taste and the Sicilian sausage on top was like paper mache .Literally I never tasted sausage that tasted like card board in my life .  He claims everything is made from scratch well my table  part would debate with that .The sauce is not like home made sauce but more to store bought . The pasta is not home made because the boxes were sitting piled up on a shelf I could see . The kitchen as we were right at the back needs a major dusting .It seemed were made him unhappy because we did send two plates back  and ask to exchange them for pizza . A friend actually had found a shrimp in the bottom of her expresso cup !!! Okay my other sister in law wondered if someone ,maybe sitting at the bar placed it in as a joke because it was friggin huge we could not see a server not noticing it ! He did take our coffee's off the bill for that . Which wa a nice gesture .The tirimisu was as good as mine ! Inherited from my sister in law , whi inherited it fro her calabrese mother in law ...LOL
Well a server did make light of it and gave us  huge laughs after  which was appreciated but the owner (bonfanti ) showed to be immature by sulking around us !! I would of expected him to come to the table as  advice with the sauce was that  the vinegary taste  in it could of been removed while making the sauce adding a little sugar to quiet that down ! I understand probably as the owner it was not even him who was cooking  hence being he should not take it so personally and act like a child ! For the price and what you get not worth it !"}
{"text":"I was not blown away by this place.  I'm surprised with the good reviews.
I found our waitress rather blunt and unfriendly.  Instead of asking what we'd like to drinnk she assumes we're ording alcoholic drinks to rack up out bill and offers us a wine menu.  When we said we won't be drinking and would like 2 cokes she 'tisks' and then wanders away.
I was disappointed with my meal.   I ordered the Sicilian Kiss which was suppose to be
Fettuccini,Italian sausage, mushrooms & roasted red peppers in a tomato sauce.

What I got instead was a bowl of noodles with maybe 4 thinly sliced pieces of so called sausage that looked all torn apart and fallen apart, 3 mushroom pieces I saw? and then topped off with ragu sauce.  
Not impressed.

My friend's dish looked more interesting, but I wouldn't risk trying this place again.
The waitress rubbed me the wrong way and made no effort to come back and check on us and took forever to come back, take the plates and bring the bill.

I'd walk an extra few metres and try Balsamico."}
{"text":"I went to Il Sogno and the server was drunk (visibly drunk at 7pm), drinking with patrons, talking badly about the kitchen staff to patrons and overcharged me. I didn't confront her about the overcharge because at that point, she was super drunk and I didn't know what the reaction would be.

I usually love the food, the servers and this restaurant in general. There is obvious infighting among the staff and it looked like last night it came to an apex. Not something you want to experience when going out for dinner. 

At one point, patrons were behind the bar serving themselves. I wrote the owner an email about it yesterday so hopefully it can be sorted out. I hope so. It was just weird and chaotic  - I have never have seen it before at a restaurant.

Update: Heard back from owner who apologized and was away that night. Will be improving things. Glad to hear and I will be back in the new year to see the difference!"}
{"text":"Really high quality Italian food and the kind of restaurant you take your time in.Bruchetta was some of the best I've ever had. Corkage is expensive at $15 but I couldn't drop the star because  4 really wouldn't do the fantasticly fresh ingredients justice. The Penne Chorizo was great as was the service and atnosphere. I'll definitely be back."}
{"text":"Really enjoyed this cozy little restaurant.  Food was good and waitress was really friendly and attentive."}
{"text":"I was pleasantly surprised by my experience at II Sogno Ristorante. Grano up the street has always been my default Italian restaurant when I am in the area. Armed with a voucher of $15 for $40 for drinks and food, I am willing to give II Sogno a try. 

The restaurant is really small, but there were only 3 tables occupied on this Sunday evening so it was not crowded at all and the services was decent even with the lone waitress. 

Drinks specials $4 a pint draft beer... I am IN!! And there seems to be daily drinks specials.... so even if you are eating just drop by a drink! 

Tue/Thu: BYOW no corkage fee 
Fri: $4 Martinis 
Sat/Sun: $4 Pint 

Caesar Salad ($10) was nicely done. Romaine was super fresh with right amount of dressing 

Linguine Di Mare ($18) has generous amount of seafood. The tomato based was rich and the pasta cooked al dente... 

Quattro Stagioni ($15) 1/4 prosciutto, 1/4 mushrooms, 1/4 sauce and 1/4 brocconchi cheese freshly baked in the brick oven..... The crust was thin and crisp and with the right amount of sauce! 

We really enjoy our food here at Il Sogno! And I prefer the more intimate atmosphere here than Grano next door...."}
