{"text":"This place is in the middle of nowhere - and it survives. This should tell you something. In Toronto, it's hard to find fresh sashimi - given that the nearest saltwater sea is some distance away. Hence, you invariably pay a premium for good quality sashimi and sushi. Prices here are a little on the steep side but I believe it delivers on quality.
Service is a little sporadic as the servers seem always to be busy and rushing around. It is a small space so things can be also get a little crowed but later in the night it becomes more intimate.
Reservations are recommended given it's popularity!"}
{"text":"I was just there tonight for dinner and the overall experience was mediocre.

The entire restaurant is quite small and fits not more than 30 customers. We had 5 adult and a 1.5 year old and we were seated at a 4-person table in a small corner area. The waitress who reserved our table already told us it will be a little tight, which I accepted. 

The service was 2 stars for me. The waitress we had seem to be very new to her job and the menu. We asked her to tell us the different between dishes ( i.e. Shrimp tempura vs. deep fried shrimp - they have pretty much the same descriptions for both dishes), how many pieces in one serving and such. Pretty much every question we asked she needed to go to the back and ask another waitress or the chef for information then came back to our table. Which took up quite a bit of time to order our food. And when we have our sushi, she didn't give us soy sauce and we had to ask and waited for 5 mins for her to bring the soy sauce over. Not too impress with the waiting. But I give her credits for her sincere and pleasant attitude.

The food is 4 stars, and the food it is on the pricey side. We had Grilled Sea Bass (Whole), Grilled Black Cod Neck (very tasty), Beef Tataki (very tasty as well), Beef Amiyaki (not sure if I got the name right, but it's a self-serve table top open flame grill for beef cubes), Butter Scallop, some side dishes and rolls.  We really enjoyed all the fish, beef and side dishes. Only common is the Beef Amiyaki, the beef got stuck to the metal grill sheet and we wasn't given any cooking tool to flip the beef cube. When we asked the same waitress to give us a pair of chopsticks, she brought out a plastic pair. Maybe she doesn't know that the open flame can melt the plastic chopsticks....but really?!?! Also the metal grill sheet was sliding off from top of the stone grill when I flipped the beef, very unsafe design. It was a 3 people task that we had 2 people to hold on the grill sheet and for me to cook the beef. I think it would be much better and safer if the staff can do the cooking.

Anyhow, we had been dining for more than 2 hours and there are still 3 more dishes to come. We waited for more than 15 mins without any food on the table and we asked the same waitress again. We told her that we don't want to wait any longer and want to cancel the remaining dishes, but she kept telling us that the food is on the way. We end up have another senior waitress to help us to cancel the food that never came and get the bill. Our whole table were not too impress by that point since some of us was still hungry. 

I was thinking to give them 3 stars. However, the service doesn't match with the price they charge. So it bump down to 2 stars."}
{"text":"Wanted to like this place, looks so cute/cozy and authentically Japanese. Atmosphere reminds me of emetai downtown although this place is much tinier. The service was good very nice waitresses and fast although we sat at the sushi bar and the two chefs were moody as if we were putting them out.  The food was the biggest problem though. We ordered a lot of different things cooked food, sushi, grilled, fried, salads and there was a fatal flaw in each and every dish. Not that everything was terrible its just that everything seemed a hair away from being enjoyable. Things were undercooked , too sweet, slightly burned, overdressed ect. Each dish had a different deal breaker. The best thing was the beer."}
{"text":"Our family of four visited this place yesterday for the first time and it was a total disappointment.  We are a Japanese food loving family and have Japanese food almost weekly.  We've been to countless Japanese restaurants in Toronto, Vancouver and in Japan.  We are almost at the food critic level when it comes to Japanese food.  Yes, we do have certain expectations in food quality but we also tie the expectations with the price.  With the price this place is charging, they are giving you the cheap quality of the cheapest Korean all-you-can-eat stuff.  The rice in the sushi was so mushy and you can probably imagine how it feels inside your mouth.  While the restaurant was half empty with less than 20 people, we waited almost two hours and still missing one food item from our order.  There was only one server running around all tables.  I feel bad for the server because his job was to serve but not to prepare food for the customers.  We didn't complain to the server because there was nothing he could do when the food wasn't prepared in the professional manner.  And so the one star here is actually for him, not for the restaurant.  Save your time, save your money and go somewhere."}
{"text":"While the name of this restaurant may not be familiar to many people, I've been hearing lots of buzz about it. In fact, now that I've eaten there, I realize how many pictures there are on Facebook of one their most popular rolls (rest assured I ordered this and took some nice pictures of it!).

Inayaka is located just north of Toronto, and really there isn't much else in that area. It's a really small location and sits probably sits under 20 people. The restaurant was quite dark upon entry, but I felt like it had a nice peaceful atmosphere. The waitresses have a pretty heavy Japanese accent, but they were so courteous and helpful --especially when it came to deciphering the menu which was all in alphabetized Japanese. Most of the menu was izakaya influenced, where you could order small appetizer-sized dishes. Their fishes are all imported from Japan, and I think I found the dishes and fish to be much more authentic than Guu.

\"Isaki sashimi\" ($40):
One of the most interesting things here, is that you can order an entire fish, and have it cut up into sashimi. The menu had like 9 or 10 different fish names, but since we couldn't differentiate them, we just told the waitress to bring us the fattiest specie of fish. Isaki as I would later find out from a website, is called \"Grunt\" in english. It was sliced very thinly and tasted amazingly fresh. It was melt-in-your-mouth fatty, and had a rich yet delicate taste. This fish ran us about $40, but it was honestly worth every penny.

\"Sashimi Starter\" ($14):
While the sashimi from the Sashimi Start didn't have the novelty of the Isaki fish, it was still very fresh. The sashimi had a certain fresh sweetness that is quite rare. You could also tell that the fish was not once frozen, and less dense than most Japnese places. The salmon and tuna were softer, and (for lack of a better word) very \"limp\". It's resembles more what I thought biting into a raw fish would be like. I didn't have any of the shrimp, but Rob said the brains was the best part, comparing it to the roe that you find under a crab's shell.

\"Volcano Roll\" ($18) - Butter and olive oil sauteed sliced onions, blanched zucchini, rolled and torched sliced certified Angus beef on top, served on an iron plate with teriyaki sauce and thinly sliced scallions in volcano fire\":

So this is the iconic roll I was talking about previously. I'm guessing there must be other places that serve flaming volcano rolls, but this is probably the first I've had. One thing that I found was interesting, is that despite the name, this roll was not one bit spicy. In fact, I thought it tasted like beef fried rice. I'm guessing the flame torch, and the Prince Igor vodka that was added to light the roll on fire probably cooked everything.

\"Maguro Yamakake\" ($9) -Chunk cut tuna sashimi with grated Japanese mountain potatoes, quail egg and dried seaweed:

This was the last dish that arrived, and was probably the most underachieving. The description explains pretty literally what it is, and it is meant to be mixed before eaten. I thought it would be similar to the Tako Wasabi at guu, but found it to be a little bland. We decided to add some wasabi to it (which by the way, the wasabi here is really spicy!) and it added some slight flavour. What it really lacked was different textures. The concoction had a one dimensional mushy/slimy feel to it, and would've been great if it was served with some crunchy seaweed.

Despite the less than amazing final dish, this is probably one of the best Japense places I've been to in Toronto. Granted that a meal would cost you a very pretty penny, the authenticity, quality, presentation, and freshness is top notch. One of the other things that I wanted to try but didn't have the stomach to, is the Wagyu beef cubes. This is also another popular facebook picture I've seen, and it looks delicious!"}
{"text":"Love love the uni and sweet shrimp sashimi here!!  Been here for like 5 times. Wish the price could be more reasonable."}
{"text":"Very authentic even though the owner and chef is Korean and not Japanese. Although both he and his wife previosuly lived in Japan.

Among the best sushi in Toronto but it's priced accordingly yet still cheaper than Ki or Hiro Sushi downtown Toronto. If you can come for lunch, the prices are much more reasonable and for the quality of food and service I would consider it a steal. 

The place is very small and it is always packed for dinner. Tried to order take out on a Saturday night once and the girl said \" oh so sorry, no takeout tonight, we are too busy\". Quite amusing but it speaks to how busy they are that they can turn away business."}
{"text":"I absolutely adore this place! From the cozy little restaurant to the food. All their food is always fresh - guaranteed and tastes absolutely amazing. It is always a weekend spot for my boyfriend and I. I have never once received bad service nor bad food. The chefs are also extremely friendly as well as ensuring that our food is the best. 
This place is a little pricier than your average japanese restaurant, but for the quality of the food, it is definitely well worth the price. It is a favourite for my whole family"}
{"text":"A typical Japanese food made by Korean. The food is terrible and the service is bad. And parking is a big headache over there. Just try other restaurants in that area."}
{"text":"Terrible place to eat and a huge disappointment. Expensive for no reason. Service is bad. Food is nothing special as they promote. I am regretting spending my time in there. What a rip-off!"}
{"text":"I order chef special for sashimi and sushi. It is not a surprise with the minimum order for $50. 

The volcano sushi is beef roll with flame. Again it looks interesting, but taste is ok only. The beef grill - grill beef kebab by yourself - it is another ok dish. I have no surprise to all the 'famous' food in this restuarant.

With the bill for 2 for $130, I can get much better quality food somewhere else."}
{"text":"Went on a recommendation.  I had very high hopes for an Izakaya that was off the beaten path.  Here is my first impression and probably my last of Inakaya.  They've cramped this space with as many tables as humanly possible.  For such a small space this takes away from the experience by taking away people's enjoyable yet personal space.  There was 2 servers and a person working the cash.  Unfortunately they were not attentive to the customers or they didn't really know how to work in tandem or work the room.  We had to wait so long for our order to be taken and had to ask twice for green tea.  Now to the food...  For the prices listed on the menu I was disappointed in the quality.  Wayyy over priced!  $15 for some single item dishes you can get a real Izakaya's for half the price.   The worst part of the experience is when they try to rush you out to accommodate new customers... this is like a slap in the face after you have to wait so long for your food to get to your table.

It's in our neighborhood but there are so many better options."}
{"text":"Great menu, food and décor. Price was fair but the value was good. I'll be back."}
{"text":"Ive been a customer for this restaurant for almost 3 years now.

The foods are okay, but nothing too special in tastes, but very special in prices.
Overpriced. I normally spend about $80~120 when I go there for dinner with a friend and I always end up saying why didn't I just go to Zen or Taro?

They focus a lot on decorations of foods and to be fair, they do pretty well on it. But,
their sushi sizes are small and I am not talking about the rice part, I am talking about the fish. I would say it's about 70% of what you would get from other Japanese restaurants. 

Robata section isnt anything special, just grilled veges or fishes, kind of taste you can achieve when you grill at your home yourself.

Rolls arent too bad, that lobster roll tasted fresh even though the lobster taste was destroyed by the dressing.  Spider roll is a huge let down, costs a lot, uses good ingredients, but the taste sucks.

Now, their whole fish sashimi selections are pretty decent in looks. They actually make a whole fish into a sashimi plate, which makes your eyes very happy. However, again, they dont taste anything special, they are rather bland. I havent been there for a few months now so I dont remember the exact prices but I think the price ranged from $35 to $80 per dish. 

You would enjoy the place a lot, 1) if you are generous in fish tastes or 2) if what most of people's $100 dollars feels like $10 dollars to you.

But, I know I can get A LOT, I mean A LOT better sushi and sashmi in different places in T.O, and that's why I go there only for beer or sake after dinner now. 

Why 3 stars despite my criticism?
Despite all my negative words, the place is at my doorstep and it still is a good place to grab a drink and enjoy the atmosphere. lol."}
{"text":"They are gonna get two stars. Why? Food was just Ok. Nothing special, but too expensive. Take my word for this. Nothing special, too expensive. That's all. 

Volcano roll? Specular some said, but it's just a beef roll with firework. Just beef roll, nothing special, no flavour.

Oh, the waitress there really wants you to order really expensive fish- some are like $55,$65 for two pieces of sushi. Hahahaha"}
{"text":"I've been to this place 4 times. The service sucked. I once went in the evening when it was empty. They sat us down at this tiny table in the centre of the room. When we asked to move to a booth by the window, the girl replied \"no you can't because this is the busiest time\". I looked around the room. There were only 2 other tables around. Not 5 min ago, she gave someone a booth (no, they didn't have reservations). If I can't get good service, I can't appreciate the food. I don't even remember how the food was because I leave the place thinking about the awful service I received (mostly by that one specific person...)"}
{"text":"I'm not really much of a fan of sushi. And I didn't have any. I went with some friends and they've said that it's pretty good though.

What I did get, though, was the Volcano Roll. It looks like a sushi roll, only with beef wrapped around it. And best of all, it's on FIRE!!! It was $18 for the roll though, which isn't that cheap given the portion size, but it's still good. I would recommend it not only for the taste, but also the presentation.

I also tried some wagyu sushi. $15 for two pieces. Wagyu is supposed to be some kind of amazing beef, but honestly, there isn't that big of a taste difference to justify the price. If you do not like wasabi, this won't be for you. The wasabi taste was stronger than the beef, so I wasn't able to enjoy it. 

The price range here is anywhere from ~$10-15 for a regular noodle meal to $130 for their dinner-for-two option. Something for everyone. It's a bit cramped in there though, especially around 7pm. The crowd seemed to die down a bit after 8pm, so if you're planning on hitting this place up, try for around then.

Also, they do reservations. But given how small the place is, it's probably not a good idea to go with a large group, even with reservations, during peak hours."}
{"text":"As far as restaurants in Toronto goes, this place definitely has it right.  From the nice decor, to the extremely diverse menu and the excellent customer service, this restaurant is one of the best places I have been to in Toronto, and I have tried out quite a few places here with limited success in food taste.

The food here is really good.  The service is friendly, and it feels really authentic.  We had the blue fin taro, the ototaro, sashimi sampler, caterpillar roll, kakage, udon, chicken katsu, and tonkatsu.  From the miso soup to the nice little side salad, everything was freshly prepared and tasted great.

The quality rivals some of the finer restaurants in New York and California.  Although nothing can really compare to Japan itself, this place is pretty darn close.

I highly recommend this place, as service and food quality are both excellent.  I did wish that they have a little more on the dessert menu, but hey, the authentic dishes are what I came here for.  I definitely want to come back here again soon."}
{"text":"Fresh raw seafood and the only place I've been so far where they serve very exotic sushi/sashimi.

Don't hesitate to ask the server what's on the special menu and they should be able to help you out especially if it's your first time !"}
{"text":"KOREAN chef faking authentic japanese cuisine. Don't even bother spending money here as it is over priced in the first place. Food is ok but considering the price, it is a rip off. To top it off, the main chef is properly missing half of his brain to be polite to the customers. Don't get me wrong, all other waitresses and waiters are nice. However, when you are spending 50 bucks or more per person for the night out, you would expect something better than good but this place fails to deliver. I wouldn't recommand it to my worst enemy. Go sonewhere else."}
{"text":"Very authentic Japanese cuisine, fresh seafood and nice service. I ordered the chef special sashimi, the quality is prob one of the best in Toronto, and you will have to try the volcano roll, very cool presentation and great taste! btw the Asahi black beer goes well with sushi and sashimi :)"}
{"text":"Food is quite boring, does not meet our expectation and of course, the price.
We ordered quite a lot ( for two people, my birthday), all the recommend food. And finally, maybe the udon is the best(among all the food in the restaurant). 
Else, when we walk in and ask where can we park our car, the waitress said: wherever you want. I know, it is not rush hour and it is not a busy street, but the answer is quite disappointed."}
{"text":"I was pleasantly surprised by this place. Very small, cozy, friendly joint. Sushi chefs definitely displayed an aura of authenticity and professionalism. The table beside us decided to share a plate of sushi and placed it in the centre. The waitress quickly went over and asked the plate be placed the other way, with sushi facing inwards.. else the chef will get mad! Whoa! 
We ordered the volcano roll, grilled hamachi with miso, uni roll, pork cutlet with curry and rice. It was very delicious, except the curry pork cutlet wasn't that special. A bit on the dry side. But I was definitely impressed with the grilled hamachi! Yum! 
I have to return again to try more of the sushi and sashimi. They have an extensive robataki list.
So happy I found this place!"}
{"text":"DO NOT COME HERE! I repeat! DO NOT COME HERE.  Three people walked out from here for $240 straight to another restaurant.  It is EXTREMELY overpriced for what you get.  We had really good experience at Kinka and at $240, we could have a really nice meal at Kinka.

We were supposed to go to Nome Izakaya but the wait there was like 1.5 hour so we decided to call this place.  There was not a single person in the restaurant when we arrived during dinner time, I was really skeptical at that point but decided to try it anyways.

First of all, they have no beer on tap, everything is in either bottle or can.  The sushi starter and the sashimi starter were like few pieces only, the sashimi wasn't great quality either.  The Karaage chicken was absolutely junk with no dipping sauce of any kind, you get a slice of lemon to go with it.  The sea bass was way too dry.  The fish used on the sushi wasn't fresh at all.  Also please don't get the oven baked oyster, it was full of oil, disgusting!  The only dishes that were acceptable were the udon and the volcano roll.  The volcano roll was $20, something like that should cost $13 at other izakayas.  Oh ya and the salad came towards the end of our meal. Hmmm.. really!

The waitress was trying to sell us Wagyu beef, at $69 and you get only a few tiny pieces, we passed on it.

At $240, if the food was great then I have no complaint but this place is seriously really bad.  There was no one in the restaurant during dinner time which is a sign. 

I should have waited at Nome Izakaya instead of coming here.  Read the other reviews and many people are saying he same thing.  Way overpriced for what it is, it's not a high end Japanese restaurant."}
{"text":"Restaurant: Inakaya
Cuisine: Japanese
Location: North York
Address: 126 Willowdale Ave
Price Range: $15~25

1: Poor 2: OK 3: Good 4: Very Good 5: Excellent

Food: 3
Service: 2
Ambiance: 3
Overall: 2.5

So my journey to finding fresh seafood/sushi continues here in Toronto. I heard many good things about Inakaya so I was excited to make a trip to North York to try out this restaurant. We made reservation prior to the visit since it was known that it gets super busy for dinner time. By the time we arrived, it was super packed inside the restaurant.

Inakaya is really tiny and I would not recommend going here in a big group. It's best if you are going with just another person or maximum 4 people in total. They used to serve lunch menu, but starting on January 1st, they stopped with their lunch service completely so keep that in mind.

For a somewhat pricier Japanese restaurant, I found their menu to be really cluttered and messy. It was super lengthy, had hand-written writings all over it and it was falling apart as well as stained with whatever it was. No big deal but I wish restaurants would pay attention to little things like this, kind of disappointing.

Ordered: Sashimi Starter $13

* Chef's assortment of fresh sashimi
* Very small portion but sashimi is very fresh

Ordered: Wagyu Amiyaki $55

* Grilled Wagyu beef on the hibachi
* I saw photos of this specific dish online many times and I was determined to try it
* Don't be fooled by photos online...this is one tiny dish
* Strips of beef are size of my pinky finger and there are 7~8 pieces (making them ~$7 each)
* They were good and yes they were tasty, but so not worth $55
* Make sure not to over-cook them (eat them while they are rare to medium-rare)
* I rather just go for steak at the Keg

Ordered: Rainbow Roll $12

* California roll topped with assorted fish and seafood
* This was really good but nothing special

Ordered: Sonomono $12

* King crabs, cooked shrimps, octopus, clams, seaweeds, cucumbers served with Japanese vinaigrette
* This was probably my favorite dish of the night
* It is a little pricey for $12 but everything was super fresh and it was very refreshing

Ordered: Chirashi

* This was what my friend ordered
* I didn't really try it but he said it was decent
* Probably should stick to dishes like this if you want to leave full


Summary: Inakaya is not a place if you want to leave full (unless you want to spend around $70 or more per person). Quality is good but not exceptional, service was mediocre and the restaurant was too crammed. Did I enjoy my dining experience at Inakaya? not so much...I am not going back."}
{"text":"The food here is very delicious, but in my opinion too expensive. The sushi and the sashimi all taste very authentic! The portions are large for one person, but too small for 2 people. Maybe get 1 set menu and add a roll or two to your meal? The salmon sashimi is very fresh and the fire roll is just super cool! The hot pot sets and the beef grill sets are delicious too. You can cook the meat to the way you want or you can order a perfectly cooked medium rare beef bowl set too. All sets come with some side dishes and miso soup."}
{"text":"Not just sushi. Menu offered many other Japanese dishes, which was refreshing considering the many mostly sushi places in the neighborhood. 

Food was yummy. Eel was very tasty, salmon very creamy. Prices on the pricier side. Cozy atmosphere. 

Waitress was incredibly friendly, recognized it was my first visit, kneeled down to table level and walked me through the entire menu with great enthusiasm. 

Look forward to trying the beef teriyaki on my next visit."}
{"text":"Previous reviews are right in that service is definitely lacking here. We were seated near the back washroom and I could barely pull my chair out to sit down because there was a pole behind the seat. I asked the waitress if we can move the table out and she pulled it out by probably half an inch and walked off..

Second complaint is lack of parking available. We almost missed our reservation time because street parking was nearly impossible to find. 

Third, after 15 minutes of being seated, no water or tea was offered. 

Fourth, taking a quick look at the menu, holy moly items are overpriced. The Chirashi is a whopping $25, the price charged at higher end authentic Japanese restaurants downtown on Front Street (Inakaya is Korean run). I'm not even sure if our tea is free.. The wet hand towel given to us was freezing cold.

Food was sooo slow with large time gaps in between dishes. 

1. Volcano Roll $18 - Not sure what the hype about this was, besides the little fire show. The beef was very tough to chew on, and the sauce was too salty, you wouldn't need to use soy sauce.

2. Gindara $12 - overpriced for one piece of black cod. It was very good, but still does not justify the price. 

3. Sushi Moriawase $26 - again, overpriced with very small portions. The fish is fresh but the variety wasn't impressive. 

4. Sashimi Moriawase $35 - three pieces per fish type. The octopus was very tough and dry, same goes with this white fish that had no taste to it. Salmon was fatty and delicious as was the tuna. The bowl of rice that came with this was overcooked and had no texture. 

I would not return to Inakaya because the food and service does not justify their steep prices."}
{"text":"Wow. 

As in: wow, this place is so BAD. 

One star goes to the really nice waiter who took his time to explain everything on the menu. 

Zero stars for:
- Being ridiculously overpriced (ie: 8 pieces of subpar quality, thin, small pieces of sashimi for $15 - I'm talking cooked octopus, salmon, really basic stuff) 
- The wait time. For 2 rolls, 1 small sashimi plate, 1 plate of seared hirame/fluke ($15 for five tiny slices, holy shitsnacks), one kama collar, one dinky sushi pizza sized for a doll, the wait time was almost two hours. Oh, have I mentioned there were only 3 other tables filled with people? 
- Refusing to allow the couple next to us to take a table for four, when they asked for it instead of squeezing into a very small space for two. I get it if the place is packed, but you could've heard crickets chirp - the place was pretty much empty!
- The rice. It was so bad. Mushy, broken grains of very poor quality. 
- Portions are so small, I could've piled all the food we ordered into one large mug
- The fried roll tasted of old oil that wasn't heated properly prior to the fry, so the rice soaked up a ton of oil
- After waiting 40+ minutes for our last sushi roll, we asked to cancel it if it hadn't been started and the waiter walked back to the counter and continued to serve other tables before cancelling our order

The worst part is that we walked out having paid $100 for what basically amounted to nothing. 

Your run-of-the-mill all you can eat place would be better than this. Seriously, in some opposite universe where their food was free, I still wouldn't eat here."}
{"text":"my favourite sushi place !!have been coming here for almost 10 years never disappointed!Keep up the good work Dani and Hana"}
{"text":"Quality of sashimi and cosy authentic ambience gives this place 4 stars. But because of the above average prices and the uptight attitude of the owners this is at most a 3. They are open till 11 which is rare for NY businesses."}
{"text":"I've been coming here for a few years now and must say this is my absolute favourite sushi restaurant within driving range. I've dined at many Japanese restaurants all over the world and in this neck of the woods, I have to say this is my go-to place when I don't mind spending $100 per person for an amazing meal.

I usually sit at the bar because, as known by any sushi eater, it is the only place to eat. The chef special is a fantastic selection of fish of great quality and great taste.

The chef is knowledgeable and friendly in the stoic, dedicated to their craft sort of way. I enjoy our short talks and explanations of the food.

The food is always to my liking and if you enjoy good sushi, you should try this place out. It's pretty expensive, the service allows you time to enjoy your meal and not interrupt conversation (read as: don't expect servers all over the place asking you questions every few minutes, just chill, and enjoy the food).

It's a great experience, pricey, but worth it.

If you want sushi on the cheap, go elsewhere. This is the place you want to spend an hour or two eating great stuff.

The drink program is decent as well, but I'd like it better personally."}
{"text":"Location/Service
It's located on a small street near Sheppard and Bayview. Street parking is available and the restaurant is on its own. It may look it's closed all the time, but that's cause they only open for dinner. 

Staff were very friendly, explaining different sections of the menu and catch of the day. I even had one of the chefs help us grill our meat - easy to talk to with a true izakaya feeling to it. 


Food
BBQ Meat - I don't remember the exact name of the item, but it's essentially Japanese bbq meat grilling. The grill is small, but powerful, while the meat are sliced thin in small pieces - so it's cooked pretty fast. There's a sauce that compliments with the beef and I'd really appreciate one of the chefs coming by and cooking it for us. 

Hobo sashimi - this dish was very good. I loved how thinly sliced they are and it's so fresh that the meat is almost transparent. It's a little chewy, but I like the texture and how you dip it in then ponzo sauce. Don't let the fish head intimate you, it's like any other regular sashimi dish. 

Fish head - again, I don't quite remember the exact name, but this was one of their specials of the day. Essentially, it's a cooked giant fish head - which was very meat from top to bottom. The meat was not overly cooked and it balances well with the sauce. This is not typically a dish Westerners would enjoy, but definitely worth a try if you're up for the challenge. 


Overall, I enjoyed my first experience here. I didn't order more food as it was only a party of 3.  I would like to try some of their sushi dishes next time and get to know the staff a little more since they're so friendly to talk to."}
{"text":"Last time I went to this place with my homies. My baby started to cry so bad because he haven't see my sister for a long time. Their female owner started to approach our table and suggest us to take our baby out just chilling for a second. Personally I am not asshole. I recognize the problem and took my baby out; when we come back my baby started to cry again. But I tried to say sorry to my neighbor diners and they understand the situations. So we plan on finish the meal sooner or later. BUT the PROBLEM is their male owner approaches us immediately and say YOU GUYS OUT!!!! I M like WTF!!! FUCK this stupid Korean fucking owner!!! We won't come to this place any more. No offense to Korean guys* worst dinning experience ever in my life. Hope they bankrupt soon!!! And the food taste very normal. Does not worth the prices at all!!!"}
{"text":"First like to say food was good, fresh but the portions were just a bit too small after dinner it felt like i needed to go get more food. Some sushi and sashimi platter each were 15$ but the amount of food in those were like 6 pc of a combination of salmon, red snapper, a raw sweet shrimp. If priced better i believe that even more people will come. The people there were nice and friendly the environment felt very cozy. 

I dont think i will be back too soon. There are other places that i shall try before coming back."}
{"text":"SUPER SLOW SERVICE.  My husband and I waited for over 45 minutes and got one of our dishes.  As we followed up with the owner a couple of times, she did very little to speed things along.  In the end, we ended up leaving before all our dishes arrived and went to grab a burger elsewhere.  Disappointing service and the food is way too slow."}
{"text":"This hidden gem in North York, I love this place. It's one more level than the restaurants you would normal find in the area like Ichiban.  The place really takes it up a notch with it's high quality food, friendly service and unique environment. 

I brought my parents here on a Saturday evening. the place is small, but I was able to make a reservation a few hours before arriving. She did advise me to come with at least 2hrs to spare so we had enough time to eat. 

I feel like eating here, you need to have some knowledge of japanese food, because although some things had lots of description around them, some didn't.  However, the waitresses were really nice and very attentive, especially when it wasn't busy  - so feel free to ask them!

The menu is really diverse with Robata Grill foods, beef, chicken, fish, noodles, rice and other appetizers. The interesting this was that most food showed up at a good pace, except the sashimi took a while (well worth the wait) 

We got quite a few dishes and it was about $45 per person in the end. 
The Assorted Sashimi ($35) was super fresh and very good. 
The Habichi grilled beef was a bit gimmicky, but for $15 it was well worth the novelty for what you get (not so much for the $45 Waygu) 
The best was the Sea Bream Fish neck - I learnt that Neck = also the head, which was my favourite. 
The oyster deep fried was really yummy as well. 

Given that my parents loved the place, it's an instant seal of approval - they are really hard to please!"}
{"text":"Way over priced...Japanese food which seemed to be opened by Korean.
We tried their beef amikayi.. It sure did gave us a fun experience to cook our own meat but the food itself tasted.. Bad. It's just cheap meat..
If I really have to recommend.. I would say their volcano roll is quite interesting. It's beef not fish.. Diff but yummy. 
Other than that I don't think I will ever go back to this restaurant"}
{"text":"I've heard good things about this restaurant, but it did not meet up to my expectations.

For a table of two, we ordered a la carte sushi (fatty salmon, geoduck, sweet shrimp, tuna, king crab, uni), wagyu beef, chicken katsu curry rice and skewered pork belly.

sushi was fresh but no wow factor
neat that you can cook your own wagyu beef (Caution: when we ordered it we got thin slices instead of thick slices so check before you order)
japanese curry taste exactly like J-town curry but double the price
skewered pork belly was extremely fatty, spicy and surprisingly dry

service was okay but food takes a long time when its during dinner hour.

I can see why they can overcharge their wagyu beef since no where else sells them but the value for this item isn't great for the quantity that you get. 

Maybe its what we ordered but there are definitely better japanese places to spend your money"}
{"text":"A little hidden gem, this place is TINY! they need to expand! it is very authentic Japanese Food! We sat at the bar in front of the chef making all the food, and he's amazing! especially how thin he can cut the fish! The sashimi is super fresh! must get! the TORO is to die for. Of course we got the volcano roll, which looks and tastes amazing, we also got this raw beef thing where we cook it our self. its a cute idea however the beef wasn't that good, not the melts in your mouth type is was expecting. However I come here for the fish!"}
{"text":"While \"Friends\" went on their separately planned HOT date-night, I didn't do so bad myself.  Even Paris Hilton would have said \"That's Hot\" in her sensual tone.  Unfortunately instead of pointing at me, she would point at my date with Inakaya's Flamin' Hot Volcano Roll.  Marshmallows not included.

Inakaya while not a substantial size establishment by any restaurant's standards is able to find a good balance within the tiny space and design elements.  There's enough to browse from the Chef's at the sushi-bar to the LCD displaying all the dishes they have to offer, even to the Sake displays which reminds you it's an official SAKE-bar.  There's something about their atmosphere that does draw and attract me.  2.5'd leaning towards 3'd.

Sake they do offer plentiful choices as well as multiple Beverages all display on 2-sided 8-1/2 x 11 that will take more than a second to peruse.  There's always the original Food Menu however the friendly staff would speak more in-depth towards the daily recommendations as well as the Specials Menu.  Whole Fluke did sound interesting but that's more for my Friend's AMEX to discover.

Salmon Tataki  -  Delightful starter both appealing in presentation and flavour.  Sliced red onions underneath help give a fresh crunch from the soft Salmon while the micro-greens on top give color contrast.  Maybe a touch more acidity would really get the saliva flowing.

Toro($18.00/2 nigiri), Hotategai Nigiri($6.00/2 nigiri)  -

In comparison, I've seen and tasted better.  My dining companion said it all when noting the overuse of Wasabi while spitting out sinewy parts of Toro.  Good FATTY Toro no doubt but we just happened to get stringy parts along for the ride this round.  The sushi-rice did have good mouth feel.

Volcano Roll($18.00)  -  Stunning presentation compared to your everyday bleh as the plate arrives engulfed in flames that take a few minutes to settle.  Beef Maki does take more chewing involved than your typical Maki.  Nothing wrong with this at all, just not something that I would consider as must-try.  Reminds me of home cooking Minute-Steak."}
{"text":"Went to Inakaya today for lunch and I was thoroughly impressed!

I read a feature of this place in a local Japanese magazine and had been meaning to check it out so I'm glad that I finally did so today ... thank you Snow Day. The owner of Inakaya is legit... he's worked at other Japanese restos as a chef. He also had a stint at Mikado (another one of my faves in Toronto).

The menu is extensive with items ranging from Japanese curries to sush rolls. Another bonus is that it's pretty reasonable considering the generous portion of food that you get! I love the interior of this place. It looks like your typical izakaya, but it's chic at the same time.

At lunch, there are specials that you can order from. Mind you, if nothing on the specials list appeals to you, you're free to order from the regular menu. I wanted something simple today so I ordered the Chicken Terriyaki Donburi (rice bowl with chicken on top). It was delish!

To finish our meal, both the dining companion and I ordered the creme caramel. If you're watching the waist size, you can opt for the 'small' size. There's also a 'large' size for us people who have given up on the dieting.

Yay, I dig it."}
{"text":"Absolutely the worst experience in my life. Female server act like deaf. I have to stand up and grab her from the table next to me. Sat there for an hour only appetizer came. Can't believe they actually have THREE STAR. Hope you CLOSE DOWN ASAP. Such a wasting of time."}
{"text":"My favourite place for Japanese - if I didn't eat it so often and need to budget, this is the place I'd go every time hands down. That and Taro's. 

Highlights: the sashimi and raw fish sushi. Spider roll is excellent (crispy and fresh). Salad is also excellent. The attention to detail from the fine fresh shaved turnip (not done with a grater like so many places) is appreciated.

We also tried the cooked monk fish and beef over a flame pot and that was just alright. I'd stick with the more traditional items at this place."}
{"text":"Awesome service and really good food. I know others have complained, but we came here on a snowy day, maybe it was slower than usual.

The volcano roll was spectacular (see photo). I also loved the grilled fish... I forget the name, but you can always ask them. I walked in rather clueless."}
{"text":"Best Japanese takeout, ever!  I wish I could've stayed and eaten inside, it was so warm and inviting and not too big.  Fish is incredibly fresh.  Yellowtail sashimi and spicy tuna rolls were great.  Chicken katsu was also well made."}
{"text":"Probably one of the worst meals I've had in 2016 and its almost December. The place is so close by that I really want to like it but every single time I go I am so disappointed.

Sushi - rice was refrigerator cold and sour. The fish was dry and crumbly. It also smelled like old fish. Takeout sushi at Yorkdale tastes much better than this joke.

Baked oyster - was $9 each and really greasy and bland at the same time. The sauce was too sweet and combined with the oyster's creaminess(fishiness) it just made it an odd combination.

Yakitori - skewered chicken legs, tasted very gamey. Was not good. 

Pork belly skewer - this was passable at best

Volcano roll - it comes in a flaming plate and the showmanship of the dish is great. But then the roll is doused in sauce and the rice on bottom of it just disintegrates and gets so soggy. It tastes like a california roll with a piece of beef on top, doused in teriyaki sauce.

The total came up to $140 + tax and tip

The worst part of this is that they charge exuberant prices for cheap, low grade food and they do not even try to hide it or fake it. Other than the terrible food quality, the interior is dying. Light sockets are falling out and paint is chipping. Their menu is tattered and covered with white-out scratching off prices to make them higher. 

Will not go again."}
{"text":"Love the food and service here every time I visit Inakaya.
I'd recommend:

KOTAI (whole fish - sashimi)
It's sooo fresh! The texture is nice and chewy. Reminds me of the sashimi from Japan :)

BEEF TONGUE (Robatayaki - with BBQ sauce)
Rich flavour, not dry at all - I think the sauce option would be yummier than salt.

VOLCANO ROLL
A very picture worthy dish. Beef was tender and it's served nice and hot.

MIRUGAI (sushi / sashimi)
It's a geoduck clam sashimi which I LOVE! Very sweet and yummy!

WAGYU BEEF
You get to cook the beef yourself, which makes it kind of fun. 
Despite the portions being very little, I still find the wagyu beef worth it :P"}
{"text":"I've been to Inakaya on Willowdale on several occasions. They have been average to pretty good in past visits depending on the day however my last experience was terrible.

To be fair, the restaurant is very nicely decorated and provides a good atmosphere although certain spots can be crammed and unpleasant. The service is sub-par at best on any given visit.

Down to the food,

Aji Tataki - pretty good (an entire spanish mackerel diced in many pieces)
Grilled Sea Bass - pretty good
Sashimi Moriwasa -  terrible choice recommended by the waitress. $35 with fish no one really enjoys (tai, maguro, sake, squid, etc) . possibly my mistake for taking the recommendation.

We then ordered sushi which took an excruciating 45 minutes before a single item was served. The restaurant was not full and waitresses continuously apologized without giving a justifiable reason. No complimentary dishes during the unacceptable wait.

Negi Toro - 6 pieces of toro in a sushi roll form. The seaweed was soggy and the roll ill-formed. A waste of toro by every means. By far the worst sushi I've ingested in awhile. All for a price of $16.

Hamachi sushi - average

Unagi sushi - average and again plagued by terrible seaweed 

We cancelled the rest of the sushi (ie. uni, volcano roll) due to the sub-par quality with terrible seaweed after one of the longest and worst waits with ridiculous excuses given by the waitstaff. 

Overall take your money elsewhere such as Zen. Better sushi and service."}
{"text":"If I have to choose between Kaji and Inakaya, I'll go to Inakaya any day.  The menu has very broad, with sushi, sashimi, robata grill to choose from.  All the fish is very fresh and the grilled items were done to perfection.  Of course, the presentation is not like Kaji, but then, for the price of one at Kaji, Inakaya can feed two, including a 300ml of cold sake.  The value is excellent, especially when the food is so good."}
{"text":"Very authentic but expensive.  Omakase at $125 and need 48 hours advance reservation.  Expect about $80 per person with drinks.  Great for special occasion and the the booth on the side.  More private & intimate experience.  Good sake selection!"}
{"text":"So disappointed, after waiting to come here for 2 plus years. Don't get me wrong my shrimp sushi pizza was great and my Maki lunch combo was pretty darn decent. So technically if i was just rating the kitchen, Inakaya would get much higher....

So why the 3 star review, it comes down to service... but more specifically the waitress. 

Now she wasn't overtly rude to me, or anything that would normally anger me, but ... she was a complete and utter disaster.

Keep in mind that Inakaya isn't a big space, and she's the only one doing the tables, so I did factor that in. But from taking forever to get me a menu, and a seating... to completely forgetting about me.. then having the rest of the staff apologize for her service, complete with eyeroll.. it just doesn't make for a good or fun experience for any customer, let alone a first-time customer.

But the guys at the sushi bar were tops. They got me water, when I stood up to ask for it and they checked back frequently with me to see if I enjoyed the food.

So my experience here wasn't a complete letdown, but still the service I got from the waitress leaves a bad taste in my mouth."}
{"text":"OMG i didnt even know this was a restaurant until my gal took me to this place for dinner. Its literally located in a house, away from the noisy yonge street restaurants. This is an authentic japanese cuisine that is not runned by chinese or koreans but by japanese people which is hard to find in uptown japanese restaurants. If you plan to come here, get reservations because from what I remember there was only 8-10 tables max. We ordered a whole bunch of dishes and it was amazingggggg. The fish tasted soooooo fresh and it literally melts in your mouth. You can tell the fish is legit and not the ayce japanese places. A great place to take for your date. Will be coming back to this place for sure!!"}
{"text":"Borderline 3.5 stars for this place.  It is definitely better than a lot of sushi places in North York, but can't compare to some of my favourite places in downtown Toronto.   This would be my first choice for a close sushi joint near my home if I don't want to drive too far.

Had the sushi and sashimi starter.  Very fresh, but nothing out of the ordinary.   They seem to cut the fish in crisscross fashion (which I am not sure, if it's to soften the meat).   Also order the bluefin tuna sushi nigiri, which was a whopping $25!  I would pay $25 for two pieces of bluefin tuna, but they must melt in your mouth like butter.   This one didn't.   Again, sliced the top of the fish in cross cross fashion again.   Really odd.   It was half buttery which a few veins in the fish, which is a no-no if I am going to pay $25 for this.   Not really worth it.   I'll just stick to their regular sushi and sashimi and stay away from their overpriced items on their special menu.   I dunno, maybe I will come back to try their wagyu beef for $65 next time, but after the bluefin experience, I am not so sure if it will be worth it.

Everything else was good.   Ordered fresh and baked oysters.    Both very delish. 

Will come back again if I am craving for sushi.  I heard their Izakaya items were good as well.  Anyhow, expect to spend a little more than the typical sushi restaurant you would normally not spend in the North York neighbourhood.   It's sort of worth it to a certain degree, if you order the right items."}
{"text":"Came here for the first time and it was quite busy! (It's a small restaurant on a quiet street, and you do have to park on the streets.) Service was decent, and the food was pretty good. We ordered the Fire Attack roll, Table BBQ (which had 12 cubes of meat), Takoyaki and a Scallop appetizer. For 2 people, this wasn't as filling as we thought it'd be, but overall we had a positive dining experience! 

Would recommend it to people looking for a quiet and intimate setting!"}
{"text":"Second time here and still the same thing happens. I have been here before and the biggest problem was service and food takes forever. 
I came today after seeing new things on the menu. It's way different from the old inakaya it's brighter and they do a lot of bento or set dinners.  We ordered the yakiniku set, black cod collar and Moriwasa 15pcs. Food took about 45 minutes to come. Beer came 15 mins upon ordering.  Not sure why this place runs like this but selling 1 table at a time seems to be the thing here. Unfortunately for us. 2 tables were ahead. For the food, yakiniku had 3 oz sirloin cut up and you cook yourself cool experience barely any food for the price. Ordered the black cod, it was good but unappetizing usually Kama s served with radish or soy this was plane just lemon. The sushi came it's very basic had to wait to track server down for soy sauce which is pretty automatic. Funny enough she drops soy sauce and not saucers. So we had to use a saucer that they used for the appetizer for the yakiniku. 
All in all food is ok.  Pricey and not the worth the wait."}
{"text":"Eh. When this place opened it was beyond fantastic. Full crew from japan it seemed. Well worth the cost. Last couple years it seems the crew has at least partially changed and while many of the favourites are still there and good, the overall experience is no longer what it was. The food is good but I'd say there are better choices now."}
{"text":"I went here for a valentine's day dinner. The volcano roll is now...fire something. Can't remember the name. The restaurant should get 2 waiters working at the same time. Some tables waited a long time to get their orders. Make sure to reserve early as many walk-ins were turned away because the reservations already made. I think this place has new owners?"}
{"text":"Ok, i almost want to keep this place a secret.
because it's SOOOO GOOOD that if everyone started finding out about this lil hide out of mine in north york, it would be even harder to just walk in and get the best and freshest japanese food in the city when i'm having a bad day. seriously, i was a having a shitty day, and i work in the industry, and the last thing i want to do is have anything to do with food when i get off of work, and i walked in this place as a pick me up.
and i walked out very satisfied with a bunch of \"mmmm\" kill me now i'm ready to die moments.

no joke, this place could give japango a serious run for it's money -- and considering there are a million wanna be japanese sushi restaurants in this area also, that says a LOT.

and when i talk about japanese food, i'm not talking about just sushi and rolls -- 
and like i've said before in my reviews of japanese restaurants, only the BEST and cream of the crop make it to a review that's worth reading and writing for moi.

It's a perfect lil date place, but it's tiny (~20 - 25 seater max) so make a reservation!

recommended:
- they offer OMAKASE style if you're in the mood to be completely pampered,
- with that said, the waitress always lets you know the chef's freshest sashimi selections of the day on the a la carte menu - and i always order off of this one (the albacore toro made my heart stop tonight) 
- they are also one of the few if any that offers YAKITORI in toronto.
like-real-you-can-taste-the-charcoal-smokiness-flavour-on-the-perfectly- tender and perfectly seasoned meat kind of yakitori --
so it's needless to say that anything else OFF THE GRILLED BAR MENU (ROBATA) IS UGH-MAZING. i recommend the 'gindara' (black cod marinated in saikyo miso)
- their soup bases for their noodles (either soba or udon) are to die for -- since this is where the real skill comes into play i think...(think of what french culinary cuisine would be if they had no stocks to made their sauces from... like a truly good teriyaki sauce full of depth in its flavour)
- seriously, i have nothing bad to say about this place's food --
- they even offer a take out and lunch menu which has your standard selection of what you expect a regular sushi / japanese restaurant to have in north america, and it's huge.

i will even go as far as claiming regional \"authen-- dah i hate that word, so i won't use it. but you get the point ;) but let me just say it reminds me of food i've had in japan. in terms of the correct portion sizes, perfection in seasoning, and the balance and beauty of the composition of their dishes :)

service is a bit slow, and it can get pricy if you order a lot of a la carte menu items like me. i like to mix and match.
~$35 / person
but it's definitely worth trying all the different dishes, i've been twice and i've always only ordered the dishes that don't even have the english translations beside them - 
cuz really, how can you really translate OISHI? :) 
(yummy!)"}
{"text":"Worth the price, but still quite expansive. Authentic Japanese restaurant.
Walking in you feel at ease straight away. It is a very peaceful and relaxing place, not too noisy like most Toronto restaurants. The sake we selected was not available and there were no other small bottles so had to order by the glass. Sashimi salad was awesome. Waitress was was very helpful. Had japanese snapper with ponzu as one of the appetizers which was very good. Sashimi was quite fresh though the chu-toro was extremely fishy that i didnt even dare to touch the oh-toro. The Hamachi roll was very good and i loved the chirashi sushi. We had quite a lot of food but the bill was really expansive. It is a good place for a quiet traditional Japanese meal if u have the money for it. Anyway, i am glad we have at least one real authentic Japanese restaurant in our area."}
{"text":"The only real advantage I would say is that this place is not near as busy as the other more popular places.

Seems to have a lot of different fish. The food seemed fresh but wasn't astounding. Ordered the Sashimi chef selection or something but really nothing special. Had the beef tongue as well, it was alright. The volcano roll was highly recommended but it wasn't that good, maybe because I would rather have fish than beef on my roll.

The fried whole fish (forgot which one they ordered for us by mistake) was the best dish of the meal I would say, but still nothing spectacular. 

For the price I would probably head elsewhere. Maybe I didn't order the more expensive sashimi but for the price I paid I would expect something a little better.

I would head to Aoyama & Sushi Restaurant which was our 2nd choice. We wanted to try something new so we gave this place a shot.

Edit: Oh and we ordered \"fresh\" wasabi which was pretty interesting and tasted pretty good with the fish. It was $20 though. You grind it yourself and definitely can smell the aroma of the wasabi right away. I've had it before but it was already ground up for me in Cali."}
{"text":"Inakaya is situated on a quiet street just a few minutes away from Yonge and Sheppard. 

I came here with a few friends to try out several items on their menu. Inside, the atmosphere was very laid back where people could simply sit and enjoy a meal. The restaurant was quite small with a few tables, however guests could also sit in front of the chef for their meal.

Menu items tasted and rating: 
Dori Bento (Japanese style fried chicken) - 5/5
Donkats Bento (Pork cutlet) - 4/5
Hambag Steak Set - 3.5/5
Yakiniku Set - 4/5
Skiyaki Set - 5/5

I really loved the fried chicken bento because the chicken was very crispy and contained a nice mayo-based sauce. The Hambag steak was okay, nothing too special. The self-grill beef was very tasty.

For each of these meals, the main was always accompanied by several side dishes (e.g. egg omelette, sausage, mashed potatoes, etc.)

The service here was very courteous and well-paced. Overall, this joint is a wonderful place to eat with friends!"}
{"text":"Good but overpriced."}
{"text":"Sadly Inakaya no longer offers lunch... no more lunch specials!! :(

Dinner experience here is so so... the food is really good... but the service really lacking and a little over priced for some of the items we shared!!

Rainbow Roll ($15)  - Excellent!
Wagyu Beef ($55) - MEH!!
Sashimi App ($15) - OK
Chirashi ($27) - love the sea bream and the sweet shrimp!
Cold Sake Draft ($15)

That Wagyu Beef for sure is a great disappointment... we got around 10 piece of thinly sliced beef and one have to cook them fast on the flame if not they just get burnt really fast... and definitely not worth the money we paid for!

I definitely not coming back on a Saturday when Inakaya is just so busy and ended up we no services... our waitress cannot even able to serve us our food properly...

I am so sad... I really want to love Inakaya........."}
{"text":"DO NOT COME HERE.
1) Extremely over priced as already mentioned. 
2) Main chef took 50 minutes to make 8 sushi. And it WASN'T Busy. The chef guy was in a mood spreading negative energy all over. Yelling / screaming at his employees, treating customers with no respect.
3) Overall bad atmosphere. Music was just radio playing top50s - it used to play great oriental themed jazz songs years and years ago."}
{"text":"Inakaya is a place where you can taste authentic Japanese food. All of the foods we ordered were absolutely delicious. As a fan of Jap cuisine like myself, I have never seen anything so creative like a fired-up volcano roll (from my photos). I believe the best part about food is when you can put some ideas in it to make it look presentable, and taste good.

This is a small restaurant so be sure to reserve your table! And be sure to finish up your palate with a nice smoothing sake."}
{"text":"I totally agreed with Janet's comment above.  This place is amazing.  It is so authentic that even the decor reminds me of japan.  I have ordered the sushi combo, it is $26 with a tuna roll and around 9 pieces of nigiris, however the selection us def nothing to those other pretentious Japanese restaurants that own by Korean or Chinese.  And the rice is cooked just right with the perfect seasoning of vinegar.    The seared yellow tail with apple mustard sauce is also must try.  This def is my other favourite after Zen in Scarborough."}
{"text":"I don't understand what people are talking about, this place is the most amazing sushi place in Toronto. So fresh and fantastic display.

The staff here are incredibly nice. Definitely worth a visit if you are in the Willowdale area!"}
{"text":"The food was very fresh and in a really good taste. But it was a bit expensive like almost 500 dollars for 4 people lol."}
{"text":"I enjoy most of the food items here but the service is very bad and slow. There was only 1 waitress for the whole restaurant on Valentine's Day (even though it's a small shop.. you need more than 1 server) 
The sashimi was of a very good value, 30$ for 15 pieces with uni, salmon belly, beef sashimi, etc. 
The donburi was surprisingly quite large for an izakaya."}
{"text":"One of the oldest izakaya in uptown Toronto.  The volcano roll is definitely a must get here.  Aside from that, I enjoy their beef bbq and hot pot a lot.  The sake selection is also extensive for those who love to pair their food with alcohol."}
