{"text":"Other than the chilli baby corn fry, and chilli chicken, everything else is ok. Better compared to other restaurants in ohio but no where close to the good indian restaurants in NJ and Toronto."}
{"text":"To say that my dining experience at Inchin bamboo garden was unpalatable doesn't do justice to the horrendous, atrocious, and overall appalling experience. We were a party of 6 plus a baby who decided to travel the 30 minute journey to experience the wonderful dining experience we've always had. Our waiter, Ben, came right away to greet us and take our order. He soon after served us our wonderful mango lassis which we loved so much the whole table decided to ordered one. We then ordered our appetizers, recommended by Ben, which we were more than pleased with. Finally it came time to order our entree. The heart of the meal, the reason for our 30 minute trip. When asked to substitute lo mein for the rice it became a problem. We were told by Sierra, the manager, that the portion size was too large and declined to accommodate the simple request which any other restaurant would have gladly done. After reasonable requests were denied Sierra than told us we could order from the kids menu in an oh so hush hush tone and said \"don't tell anyone\" as though the menu didn't speak for itself. We weren't sure if this was a jab at our intelligence but we decided to let it go. It's as if we went to eat at a restaurant where we couldn't get what we wanted. We then contemplated whether or not we should take our business to a restaurant we knew would accommodate us. However my mother had been craving Inchin bamboo garden for 6 months and we knew the food would be worth it, or so we thought. Later on our food came and immediately we noticed the plates were not hot, not to mention the lo mein noodles looked mushy. That first bite said everything. Our pallets were totally disappointed. The $30 lobster tail was dry, over cooked, and not seasoned. Lobster is intended to be succulent and juicy , this was dry, tough, and stringy like over cooked steak. It even had to be ripped apart like a piece of steak. The lamb Sezoun was very displeasing to my tastebuds. The lack of heat (fire heat) did no favor to the horribly seasoned lamb  Sezoun. Upon tasting the $12 lo mein noodles our tongues told us that our eyes had not deceived us. It was dry, over cooked, sticking together, and very unappealing to all senses. The fact that all of our food was served lukewarm was more than we were willing to overlook. We asked to speak to a manager. When Sierra came to our table we began to explain our complaints she quickly snapped, interrupting, and turned her back to us saying she would get the owner. The owner arrived defensive and unwilling to listen to our complaints. All we wanted was for him to acknowledge that we were displeased with our dining experience. He never apologized, he completely overlooked and disregarded our dining experience. As though we were not the ones tasting the food, we were not the ones paying for the food. After requesting our check, which Ben graciously brought over, we found ourselves in a dilemma as to whether or not we should leave our 3/4 filled plates or take it home. We decided and asked for to go containers. At which time we heard Sierra, the manager, question our decision as to why were taking our $200 meal. When addressed we were shouted at from the other side of the room \"it's not that deep, stay over there and do you mama, what my employees say is just talk, we do our business and you do yours\". Might I remind you this is the manager speaking. She than left and went into a room in the back where we heard her saying that we left and refused to pay our bill. The owner appeared from the back, phone in hand, saying he called the police since we won't pay the bill. We were highly offended at his implication of us attempting to dine and dash. 

Throughout this horrendous ordeal not one time were we apologized to. Not one time were we given an option to rectify the situation. Not one time did we get the impression that anybody cared (minus Ben). We wanted the food the way it should have been presented to us. Neither the manager nor the owner offered to reheat the food, or even replace the food. We wanted to have a good time, with good company and good food. 

Sierra, the manager, did not do her job. The managers job is to diffuse the situation and appease the customer. When a customer presents a complaint she is supposed to offer a solution. Instead Sierra further incited it by being arrogant, ignorant, rude, loud, and obnoxious. She should have dealt with the issues when they were small and it would have never escalated to our dining experience being catastrophic at Inchin Bamboo Garden in North Olmstead, OH.
Well this was definetly a memorable experience, a bad one. And one that I hope to never repeat."}
{"text":"Actually wanted to give 0.5 stars, but I have to select 1 for writing this review. Worst Indian food ever had on this planet. Lets start with the dishes they served as part of buffet today.

Started with Soup: Thought it will activate my taste buds as it goes. Worst than ever I had soups in my life.

Starters: 1. Fried idli and they called as \"Chilli Idli\", to my knowledge Idli's which are fronzed(atleast a month) and fried to prepare this.  

2. Cashew potato: You need to be lucky enough to get some cashew's on to your plate. Over oily, 

3.Chicken starters: I felt like, they have got the worst chefs to prepare such dishes. after reading those dishes name. I doubt myself I belong to some african forest/ Ice age. Never heard those names in my life. Nothing is hot. 

4. Colored rice mixed with fetid chicken and they called as \"Hyderabadi Biryani\". I pity myself calling Hyderabadi after eating the biryani they served. I guess the chef never heard or tastes how a Hyderabadi Biryani smells and tastes. Couldnt find any spices nor the Biryani masala in the biryani they served even with my 16mp camera. 

5.Deserts: Tastes like rotten eggs.

None of the food is covered with sneeze guards, I wonder how a food inspector/food officer allow such people running restaurants so bad.
None of the tables had dinner napkins(cloth), have to ask repeatedly for the paper napkins.

There was a man with shaved head(may be the manager) is so rude, demanding tip for their worst service. Dont refer your friends/family.

Actual Bill : $90. Tax: $6.75 Paid: $112.95(On demand from that shaved head person).

Stay starve rather than having food in this worst restaurant."}
{"text":"Do not, I repeat DO NOT order the lamb. Ended up with horrid food poisoning for a straight 24 hours. It's like someone turned on a switch that not only made me feel like I was blocked up inside and needing to use the bathroom but that a little orc was inside my stomach pounding my insides. I admit I love their level of spice but DO NOT get anything with lamb."}
{"text":"Pathetic and horrible customer service. Waiters do not have time to take care of customers, but they do have time to talk to their co workers. Customers are shown the table and  waiters forget or rather do not care to serve water. Food is good but service is bad. I have been to many restaurants, but this was the first one with horrible customer service. My husband and me love Indochinese food. The only one we liked in Bay Area was this restaurant. I would have recommended this restaurant with 5 stars but due to its poor customer service , I am ready to give negative rating too. What is the point in going to such a restaurant."}
{"text":"This restaurant makes me sad.  It's a large chain restaurant, so it's inconsistent food quality and poor customer service is surprising.  Usually there is better training in chain restaurants.  Not one person working the floor of the restaurant knows what is in a dish, including the manager.  I have ordered there once and had good food and have ordered a second time and the food was horrible.  There will be no third try.  I don't think this place will be open for long."}
{"text":"I had very bad experience with this restaurant, Lady manager was very rude, when i asked for napkins she said i need to get it, her staff was not there that time so that lady manager was working and she was so rude and un professional, they never clear the plates from table and never filled water when having buffet.  Service sucks and very rude lady manager, i will never go to this place again."}
{"text":"Food was okay, but the service was terrible. The waitress took a long time to get our order, then we waited close to an hour for food to arrive. Entrees came out separately and the last person to be served (there were three of us) had to wait another 5-10 minutes. Other parties who came after us were served and finished their meals before we even got our food. Won't be going back there anytime soon."}
{"text":"This review is for Bamboo Garden/ Tadka.  They are both essentially the same restaurant, prepared by the same chefs.  The buffet held at Bamboo Gardens has a fusion of foods from both restaurants.

I completely agree with Devi O's review, although I can't comment on the chefs, as I didn't talk to them.  The decor is great.  Honestly, the food was crap.  Over salted, lacking quality,  lack luster service a few times.  If you want to go to an Indian restaurant based on decor, go here.  If you want to go to an Indian restaurant based on amazing food, and decent decor, go to Flavors of India, located down the street from this place.  I know where I will and won't be going."}
{"text":"Ordered the Sliced Lamb Chili. It was awful. Nowhere close in quality to the Inchins that I've dined at elsewhere."}
{"text":"I have had bamboo garden in four states and this is by far the worst bamboo garden. Everything we ordered was terrible."}
{"text":"Worst service I have ever had, took 10 minutes for a server to talk to us and it has been over 30minutes without our food arriving. There are only 2 other tables here and this is rediculous."}
{"text":"The wait staff is consistently unable to answer simple menu questions (e.g. What is in this dish?). I think their menu could do with descriptions of what is in each dish to help the customer and wait staff to be better informed. The Chinese food is good but it seems overpriced when reflecting on the overall dining experience."}
{"text":"Why the 1 star - 
1) Prices - Ok, yes it's in Uptown, but I was still not expecting the prices at this place. Beware!
2) I generally can't handle spicy, so picked one of the few items on the list that didn't have an asterisk by its name, the steamed chicken with vegetables which was instead marked as a low calorie dish. Alas, it felt as if I were eating salt, and the sauce was still very dark. Normally, when I order a steamed dish at a Chinese restaurant, I expect a lighter sauce, so this was disheartening. 

Next time, if I had an extra few minutes, I would probably just drive to Asiatown."}
{"text":"The first time here and tried their lunch buffet. People are friendly and the place is clean.

Corn soup and goat curry were delicious
Baby corn fry, Chicken 65 and Shrimp fry were excellent!!! (Five Stars for Chicken 65)

The items were well prepared and I would recommend this place."}
{"text":"I just recently got to Cleveland and have been looking for a good Indian restaurant. Little did I know I would find the BEST I've ever tasted! In fact, I loved the first taste so much that I signed up and wrote this review right at the table.

The decor is absolutely lovely but don't get distracted because the food is even better! I had the muligtawni(sp?) soup to start - magnificent. From there, it was a rollercoaster of finely tuned flavors at perfect proportions. I rounded out the meal with a mango lassi that left me floating on cloud nine.

This has really been a wonderful experience. Thank you Inchin's!!"}
{"text":"Very disappointed!! Used to be good but went for dinner tonight  and food was average and the service was just awful. Server was unfriendly, brought out wrong dishes and neither she nor the manager apologized for all their mistakes. Will not be going back, it takes just one bad experience."}
{"text":"If I could have given 0 stars, I would have. This is one of the worst food experiences I have ever had. My girlfriend and I were excited to eat at this location having been to other bamboo gardens in the country. As soon as we walk, we should have realized something was up when there was not a single customer there on a Saturday night. We decided to ignore the warning signs and go ahead and try the place. First, the hostess urged us to order way more food than we needed. Second, the food comes out in 3 minutes, our second warning. However unlike other good fast casual places, food was cold, chicken smelled horrendous, sauces tasted like oil, and the rice was dry and sad. We wished we could've supported this local chain but it's hard to support a place that opened up two weeks ago and already lacks any semblance of quality or respect for the food they serve. A sad, sad edition to the Euclid food scene."}
{"text":"This is a really interesting restaurant because it offers both Chinese food and Indian food.  We're not talking shrimp fried rice kind of Chinese food or chicken tikka masala Indian food.  We're talking lamb with bean sprouts, mustard & chilis, chicken cilantro soup, biryanis made with rose water, and a large variety of naans and rotis, all bursting with flavor.  The food really was great - the entrees we tried had several layers of depth and were fairly spicy but served with rice and yogurt to cool the mouth.  The drinks menu wasn't huge but it was varied, including vodka and several other non-alcoholic options.

The prices were generally reasonable - entrees were generally around $11 - $17, $2 for sodas, $3 for mango lassi.  $5 for a small cup of soup was the only thing that made me frown.   Clientele were mostly Indian customers, which is a good sign.  In fact, my partner and I tried this restaurant because so many east side Indians we knew often made the trek out to this place.

Service was good - we were tended by at least 3 staff members who were all attentive, kept drinks filled, and inquired about our satisfaction about the food.

The restaurant itself is located in a strip mall right next to the Westfield Great Northern Mall in North Olmsted.

I will definitely return."}
{"text":"I am a regular at bamboo garden. One of the few places for authentic 'indian chinese' cuisine. This place is always crowded so be prepared to wait for a while. Their spicy dishes are not for the faint of heart. Soups are to die for. My favorite appetizer is the spicy chilly corn and the hot and sour soup."}
{"text":"They just don't understand service. One dinner came out 10-15 minutes before the other. Server didn't understand our frustration. 

Mongolian beef was excellent. Chicken sizzler had French fries as part of the mixed vegetables - I guess they are potatoes. 

Only going back for the lunch buffet"}
{"text":"We went there on Saturday for lunch (À la carte not buffet). We had been to Inchin in SFO and loved the food there and we decided to visit this one since we were in the area. It seems like they expect you to hit the buffet right away and they discourage ordering by menu. We asked them we want À la carte but the server insisted that we check buffet, which we did, and we asked for the menu after we returned to our seat. Well, seems like the server was not pleased with it and very reluctantly he took our order, he did not even look at us when we asked him questions and just walked away murmuring the answer, that was quiet rude ! 
Back to the food, it was OK, chilli chicken was good, I thought, it was oily but then again this is indo-chinese so expected. 
We had to ask our server for the check and he very reluctantly sent some other server to our table. The same server seemed nice and friendly to others (looked like he knew them personally) who took buffet.

There was indian buffet and there was a cook cooking dosas to order (which seems tasty) which also confused me, I was here to eat the pan-asian cuisine not indian  cuisine. 

Food, I would probably go back, service, not at all."}
{"text":"5 stars for the lunch buffet quality and variety. One of the best weekend brunches for an Indian food."}
{"text":"This place was hoppin when we walked in.  Ppl of all different ethnicities in various types of dress.  Some very dressed-up, some in smart casual.  We went as a table of 5 on a Sat. night, so we did have to wait a little to be seated, but it was less than a 10 min wait.

The owner was actually our server, as it was so busy in the restaurant.  He also went around & made sure everyone in the place was comfortable & had what they wanted.

The food was INCREDIBLE!!!  The flavors were so rich & vivid.  The food was fresh, & very carefully prepared.

It was decorated nicely, but w/ the high ceilings & no fabric, there was nothing to absorb the sound.  I think they have to decorate that way since it's a franchise & they all have to be the same.

But the owners do make it their own w/ their service.  And the food was superbly delish!"}
{"text":"My first clue that this wasn't going to be an impressive meal should have been the fact that it was pretty much empty on a Friday night. 

I expected the food to be better, considering the menu bragged about how everything was made from scratch and fresh to order. Neither seems accurate. 

The service was abysmal. None of the staff seemed to know what they were doing. 

I'd usually give a new (to me) restaurant at least a second try, because everyone has an off night, but I will definitely not be returning."}
{"text":"The lunch buffet is very bad. Some of the food is disgusting, and even the good choices were lacking in taste and quality. I wouldn't have had a problem with Asian fusion Indian cuisine, but this restaurant was bad at both parts. Avoid."}
{"text":"Ordered take out Chinese noodles, and that is exactly what they gave - sans the vegetable and chicken I had ordered!
Vegetables were sparse and a sole chicken piece decorated the entire dish! I have eaten here in the past and they serve decent Indo-Chinese fusion food, but the take-out was disappointing !"}
{"text":"One of the worst experiences I've had in a restaurant ever. After sitting at our table for a solid 25 minutes, the waiter finally decided to come and take our order. After we ordered our dinner, we didn't see our waiter for the next 30 minutes. We had to remind him that we were still sitting in the restaurant. After he acknowledged our existence, we FINALLY received our food, but it was ice cold. 

The food was disastrously under seasoned, and the sauce that they used was the same across THREE dishes. It felt as if we were eating a cold water soup with croutons. 

I have eaten at the Cary branch before and had a wonderful experience; however, I was nothing but dissatisfied with my experience here."}
{"text":"Relatively new restaurant serving a great menu of Chinese and Asian inspired dishes.  The owners (and chef) are actually Indian and plan to open an Indian restaurant next door.

Tastefully decorated if a little echoey. Warm colors. Excellent service. Dishes are cooked lighter than the Americanized Chinese fare. While appearing like a trendy fusion bistro designed by some California restaurateur, the entire  place is actually the work of the people who work there. And they have put a lot of their own heart into the place. They better have, considering it sits in a strip with 2 other Chinese restaurants of good quality. Give it a try, you won't be disapointed."}
{"text":"Had a great time here the food was tasty. I recommend the Mongolian beef. They have big portions enough to share. Service was good too!"}
{"text":"It's pretty sad when you're out to dinner with a group including your boyfriend and then you get pestered for your number.. unprofessional. Also if I point to what I want on the menu being specific and then receive totally different dishes that's a problem.."}
{"text":"This is the best Asian restaurant I have tried so far. Tried Curry fried rice, paneer Manchuria and Hakka noodles and they are very yummy."}
{"text":"Inchins is my new favorite restaurant in Charlotte. The ambience is good and the food ordered is very delicious."}
{"text":"We ordered Chicken Spring Rolls, Shredded Crispy Lamb Peking, and Burnt Garlic Chili Fried Rice.  The spring rolls were alright.  You would not have known the lamb peking was lamb unless somebody told you.  The strips of meat were really thin so they ended up being really tough and just tasted like the spices and nothing else.  The fried rice was unique - it had an unusual smoked flavor to it.  Overall I would not recommend this place, though.  If you want some amazing Indian food in our area check out Saffron Patch instead."}
{"text":"Great ambience and decor! And the food is delicious. Pan fried fish, street side Indian noodles, hongkong chicken are a few names to start with !"}
{"text":"This is the only restaurant in Cleveland metro area to serve Sino-Indian food! I think that makes it special. 

The ambiance is good with chinese murals on the walls and some chinese wood curtains. The wait staff is very nice and friendly. 

Food is good for selected dishes. There are some dishes like vegetable biryani, crispy okra, tofu etc are very nice and cooked in Indian style with a chinese twist. And then there are dishes like manchurian, hakka noodles which are cooked in a chinese style with indian spices. The problem comes when some Indian dishes are cooked in chinese style, which makes it worse tasting - so if you think it might not be as good it is not. For example, egg plant curry with general tso's sauce was not that great! This might depend on individual taste preferences also. Their kathi roll is cooked in mexican tortilla instead of indian naan - not a good idea. 

I think buffet is reasonably priced for wide selection of food."}
{"text":"Oh no no no. This is by far one of my strongest 1 star reviews. The restaurant has great food. But this would be at least my third time having to turn around hungry because of their miscommunication. Several times I have come and they had changed their schedule without telling anyone. If that is not frustrating enough, the last trip I brought my mother out on her day off to get food and I checked their webpage before leaving to verify that the weekend buffet was listed. I will include a screenshot to verify taken when i got home to write Inchin's about another disappointment. I had a gift card and I was frustrated that they would not keep to their listed schedule. So I was fortunate to be able to use the gift card at Tadka in North Olmsted for their lunch. So I got some emails back from either the manager, chef, or owner.

I will list the entire back and forth so you can decide who was correct. 
(ME)
Hello,

I am rather upset again. I have had issues with this location in the past changing their dates and times without telling anyone. I checked this morning before leaving to go to lunch. I took my mother with me on her one day off this week to try the buffet. I checked that time times of the buffet on the IG bulletin, it stated 12-3pm. I drove downtown and parked in a garage and walked over to the location with my mother and we were disappointed to find out they were not doing the buffet. This is the third time that I have been the victim of changing times. First they took it away and did not tell anyone. They then brought it back late December 2016 and I arrived at 2:15pm and they had changed the times to end at 2pm although the website said 12-3, and then today walking in at 1pm and there was no food. I understand that maybe the attendance was not great for the $5 buffet, an incredible price for lunch; however you need to communicate this. I also believe being on a college campus; greater communication should fill the restaurant since it is an incredible deal. I am upset I had to make my mother walk to the restaurant with me to be disappointed after I said how good it was and reviewed it in the past praising the location.

(REPLY)
Hi Eric,

We referred your complaint to the location and they have confirmed that there was buffet on Friday (2/24). I am hence baffled how you found 'no food' on Friday at 1 pm. In fact we had a busy lunch and, as always, we threw away a lot of food at the end of the buffet. Our buffet is always stocked till the end.

Pls elaborate as to why and how you were dissapointed.  

Thank you for your continued patronage and we look forward to further communication. 

Amit

(ME - I DID attach the screenshot)
Hello, 
My mistake it was 2/25/2017. Since the weekday buffet is $10 dollars, the $5 dollar buffet on weekends and what is advertised on bamboo garden's website is what I was referring to in the email. 

So; came on Saturday as advertised (see attachment) and there was no buffet. This should clear up confusion. 

(REPLY)
Hi,

There was no attachment. The website was changed a long time back where the weekend buffet was removed. 


Thanks for your interest in our restaurant.

Amit

(ME)
Hello,

It was attached and still is in my reply but I will try again. The website was the route cause of the problem last time that it was supposed to be updated but it wasn't along with the Facebook page. The same Facebook page that said come in for buffet the last time I complained where that same day I came in and I was told it is not being offered because Case was on break. No mention at all that is was not going to be offered while Case was on recess until I drove in and walked to the restaurant. 

Eric

(REPLY)
Hi,

You have to clear the cache in you computer as we have changed the information a long time back. I just checked and it is not showing up either!

Thank you

Amit

(ME)
Excuse me,

That was on the website. I do not have to 'clear' my cache. I checked on my desktop before I went with my mother and then when I took that screen shot after the fact it was on my iPhone so it was posted and recently taken down and not computer memory. The chance of two different devices visiting your website and having stored cache is abysmal. 

I am disappointed in how you handled this. I wanted the special to be taken down and it has but I am going to update my kind review with my current thoughts. 

Thanks 


And here I am. Call me correct or wrong in the matter, three trips without food and then needing to reset my cache because their webpage magically never updates if you have cache? I STRONGLY recommend not going to Bamboo garden."}
{"text":"I went to the location in University circle. First of all, this is not an Americanized version of Chinese food or authentic Chinese food; it is an Indo-Chinese fusion. I ordered the Vegetarian momos (appetizer) and Vegetable Tofu stir-fry with brown rice (entree). Surprisingly the entree came out first. While the brown rice was hot, the rest of the entree was not - the tofu was raw and cold (yes cold!) along with some of the veggies. Being disgusted, I pushed the plate to the side and waited for the momos to arrive. Thankfully, the momos were steamed hot - taste just OK; have had way better momos at Nepalese and Tibetan restaurants. I believe one of the managers looked at my table, noticed that I had left the entree pretty much untouched on the side, but didn't care to come by to ask for feedback. Honestly, it was an utter waste of time and money and I will never be walking into this place again."}
{"text":"Ordered the chicken fried rice. The rice tasted like it was old and heated in a microwave. The chicken was bland, along with everything else. Tried adding sauce to make it palatable, but it still wasn't good. 

I gave two stars for the friendly service, based on the food I received I wouldn't return. $7 for something I couldn't even finish."}
{"text":"Love this place.... Best part os food enjoy best of both worlds.... Chinese and Indian . Never ever get disappointed!!"}
{"text":"Great Ambiance, and awesome customer service compared to any other Indian restaurant in Charlotte area. There will be wait time on weekends just be prepared to wait 45 minutes and trust me its worth the wait.
Things to try
Sweet Corn Soup
Cauliflower Manchurian
Vegetable Coins 
Paneer with schezwan gravy

Please ask for recommendation before ordering, it might not be what you want."}
{"text":"Very good food! Kinda expensive for a lunch buffet but it was exactly what I needed. It will fill you up! Lots of selections too!! Good idea to include Indian and Chinese food selections...Staff is very nice."}
{"text":"First, let me say that I hope this restaurant lasts. I work and live near Uptown, and I want to see the small businesses here thrive. That being said, Inchin's is a national chain, which doesn't give me much hope that this location will improve.

On my first visit, I asked the waitress what she likes, and she recommended the lunch buffet. Thus with reluctance, but an open mind, that's what I tried. Unfortunately, it was the worst \"pan-Asian\" food I've ever had.

None of the dishes were authentic, none had any spice, and most were flavorless (or worse). The KungPao chicken was gooey, the Mandarin Chicken even moreso. The Curry Fish had no flavor in the sauce, which smelled and tasted like frying oil dilluted with water. The noodles were soggy. The steamed rice was not fresh. The highpoint were the \"spicy crispy chili chicken\" and similarly-named fried baby corn, neither of which was spicy or crispy, but both of which were at least edible.

My experience got even worse when I looked into the open kitchen and saw them prying open white plastic 3-gallon buckets of food. (The same kind of buckets you buy bulk paint in.) My guess is that the national brand makes the sauces and has them simply fry the protein before mixing. That's a fool-proof method many national chains use, but its nevertheless gross and unsettling to see it in practice. And it begs the question how everything that I sampled still ended up being so unflavorful.  

I'd feel remiss not to note that the staff was friendly, the service above-average, the atmosphere nice (although Orientalist and culturally insensitive), and the space was pretty clean. But the food was just too bad to go back."}
{"text":"there seems to be a lot of negative feeling toward this place. while I won't say it was great, it definitely wasn't bad. just different.

first, it's apparently \"Indo-Chinese\". we were not aware of that, as we thought it was just a Chinese restaurant. i've been to Indian restaurants and within seconds of walking in, the familiar aroma of Indian cuisine hit me and I was confused. we were then greeted and asked whether we wanted Indian food, Chinese food, or both. we chose to look at both menus and both settled on Chinese-esque dishes. Danielle had Singapore noodles and I had Szechuan Chicken Fried Rice. as with other experiences at Indian restaurants, the level of heat/spice was not considered when i ordered and holy jeez did my poor guts hate me for the rest of the weekend. that said, the food wasn't bad at all. i think if we went back i'd order Indian food as the Chinese-like dishes didn't really leave me wanting more, but weren't offensively bad either."}
{"text":"One of the best Indian-Chinese we have ever eaten. Finally cleveland has a decent    Indian food place. The rates are very reasonable."}
{"text":"Why are you are Uber eats buy can never complete and order and almost always unavailable?? This is such poor service.  Will not order again."}
{"text":"Recommended by a friend, ordered noodles and oreintal briyani. Both were pathetic, I could make better food in one or 2 attempts.
The price also not very attractive, one disappointing experience."}
{"text":"We catered for a party of 30 at our place and our guests loved every bit. The food was so yum that many had 4th helping and the trays were empty to the last grain.
Paneer tacos are a must eat. Chilli garlic friend rice , chilli chicken & veg coins were really good.
Highly recommend this place for dine in & catering."}
{"text":"So after 5 years, we have another party.  We decided to give bamboo gardens another chance, again because the food is usually good.  We interviewed 3 Indian food places and obtained 3 quotes.  We asked all 3 places for the exact same food and Bamboo won as far as quotes.  So we went with them.  A 2nd place then said they would match bamboos price, but we stuck with bamboo as they could not beat the price.  

The manager who took our order, rung up the order and then called the night before and read our order to us verbatim, then increased the price by $90 dollars when we showed up to pick up the food stating that \"the person that took the order forgot to ring up the 2 orders of byriani.\"  You, asshole, were the one who took the order and rung it up!!!!  And now 2 hours before the party you are going to screw us with no food?  How dare you!  

They are the worst to do business with.  DO NOT ORDER or DEAL with them.  They should have just given it to us as it was HIS FAULT for being stupid.  Again $500 worth of food...  absolutely terrible customer service"}
{"text":"I am not an Indian food savant - but I love trying all the different flavors and currys.  This place is fairly unassuming... it's in a strip mall tucked next to a bestbuy - the only reason we stopped to try it was because we were on our way to another indian restaurant and happened to pass by.  

How lucky we were to stop!  They have a large lunch buffet which gives you the opportunity to try 25 dishes (or so).  Not everything on the buffet was to my taste, but I loved being able to try little bites of everything.

We've been here twice, and plan to return many more times.  Our service has ranged from good to excellent."}
{"text":"We went for a second time this evening at the start of dinner. The manager was the only one on the floor (what happened to all of the servers?). Once we got the menus, it took him a while to come back and take our order, including our drinks. I ordered the Hong Kong chicken and my boyfriend ordered the lamb bulgogi. His order came out wrong. They brought him the lamb hot garlic. No one ever came back to check on us, and we were hungry, so we ended up eating what we could. My Hong Kong chicken was very disappointing. The texture of the chicken (minced) was very rubbery. I am usually not a picky eater, but I couldn't bring myself to take more than 2 bites. The manager did offer us 25% off our ticket, which was a nice gesture. But unfortunately, I don't think I will be returning anymore."}
{"text":"The service was really good: fast and the owner herself came to check if we liked the food and gave us extra informations. They have a lunch buffet for 10$ which I guess is fine for the quality of the food, but the dinner items are a little overpriced (11$ for a lo mein dish, or 9$ for steamed dumplings, with portions being smaller than usual asian restaurants). The food is good but nothing special, but they have interesting choices especially if you like spicy food. They have a program to collect points each time you go there, so maybe if you are a frequent costumer it gets more convenient. Bottom line, for the amount/ quality of food is overpriced, but it is ok for lunch."}
{"text":"First time I went hear it was wonderful.  I have been here several times but the last would be the last.  There is one word for this place SPICY!

The food is good but way too spicy.  We asked for it too be mild but they did noting to make it less.  It was not busy so they should have been able to prepare it mild.

The service was good except they seamed offended they were not eating Nan correctly.  The server showed us the correct way.  They did not need to that.  

The seating is funny.  The booth and chairs are real low.  If you a tall person you will find it difficult to sit.

The restaurant is connected to Tadka next door.  You can order from either menu."}
{"text":"I have visited them twice. First on Feb 14th when it was too crowded and we got a table 30 mins before their kitchen would actually close. The appetizers was good and we ordered the main course as well as the desserts well in advance before their kitchen closing time. After waiting for close to 15-20 mins, the desserts came out without the entrees. Finally when the food arrived it was tasteless.
Now, I went again yesterday to give them a second chance to prove themselves. The soup came in after the appetizers. We ordered chilly chicken and it was so hot that after one bite, my mouth kind a got burned. The manager was saying that since it's chilly chicken it will be hot but it should not be too hot like insanity. Horrible food and service. Not recommended at all."}
{"text":"This is hands down the worst food I have ever had in my life. Service was terrible. The entire staff was high as a kite. Food took too long. Then it was slimy over seasoned and or not seasoned at all. The server was a liar and the place smelled like HOME DEPOT. NEVER EAT HERE. I AM SERIOUS!"}
{"text":"This is probably best indo Chinese restaurant in town, it has nice ambience and decor.

Chili garlic noodles and chicken 65 are my favorite, I will be visiting more often."}
{"text":"Ordered trough uber eats it took longer than expected for the food to be delivered..
spicy paneer taco looked yuck taste and presentation wise..
tamato soup was red colour water.. 
hot n sour soup was like uncooked soya sauce..
Chilli garlic noodles was tasteless and oily..

Bag say u will find your lost appetite in the bag infact i lost appetite after eating this.. spoiled my weekend mood.. not coming back to this place."}
{"text":"The sunday buffet was average in taste. I expected a better balance of the salt, spice, sour and sweet that comes with the Indo Chinese food. Reading from other reviews,  maybe their a la carte is better. I really liked the chaat starter options though!"}
{"text":"Disappointing.

Ordered the stir fry vegetables with tofu for $7.

The rice had the taste and consistency you would expect from day old rice heated up in the microwave.

The stir fry and tofu was fairly bland; I couldn't taste any garlic or ginger in there and anything else was masked by the oil.

Portion size was pretty small for $7; I ended up having to add my own general tso's sauce to give it flavor and eat a bowl of Cheerios afterwards to feel full.

Maybe they are working out the kinks that new restaurants have to iron out... for now I suggest going somewhere else."}
{"text":"One saturday afternoon, tired of  weekend errands, decided to drop in Bamboo garden for buffet at North Olmstead. Honestly, had no big expectations, while walking in, and was pleasantly surprised. Did not have to wait more than 2 minutes.  Our main concerns are delicious food, cleanliness and attentive service. And they scored well above our expectations. Hot soup was so delicious , did not even want to go to the main course, buut we did.  We are vegetarian and have difficult time finding the right place for us. My hubby was so happy to find such a great variety of vegetarian dishes and that is tasty too.  

Decor is India-Chinese inspired and wall are painted red-yellow warm colors. I would rate it average, but who cares as long as I get delicious food in reasonable cost . I live like 45 min away but we are going back soon."}
{"text":"An Indian's Indian-Chinese craving in a foreign land can send them on quests far and arduous!lol..this was like a forty minute drive from my place, and I liked the friendly atmosphere and sometimes they would give me free ice cream ;-) I don't know why (may be I am nice to them that's why).
Anyway, food is close to standard Indian Chinese (being from the birth place of indian Chinese can't say it reminds me of home, but surely cuts it enough to make me come back, and with friends :)"}
{"text":"WOULD NOT RECOMMEND. Over priced and subpar food. We ordered the crispy chicken and it was BLAND. Tasted like chicken in water. We notified the server who was rude and reordered a different entree, spicy chicken. ALSO BLAND. THEY CHARGED US FOR BOTH EVEN THOUGH THEY TOOK BACK THE FIRST ITEM. The young Asian pregnant server was RUDE."}
{"text":"I would avoid this place completely!  Stopped by for lunch with my husband. The place looks hip and cool, but that's the only thing appealing about this place that we encountered. Out of both lamb and wontons when we went to order, so we settled for Mongolian chicken and momos. The Mongolian chicken was so small and abysmal, the side of fried rice was greatly undercooked, and the momos had no taste whatsoever... With all the other great food options around, this would be one of the last places I would go!!!"}
{"text":"Summary: Overpriced, poor-quality food. 

My wife and I went for dinner. The service was good throughout the night. We were promptly seated, shown to a table, and checked up on frequently.

The food was well-seasoned, but the quality of the meat was just... bad.

I ordered Hong Kong Chicken and my wife ordered Hot Garlic Beef.
The Hong Kong Chicken was as spicy as I asked for, and well seasoned, but the diced chicken was either very low quality or prepared half-hazardly. It had a spongy texture (like it had been boiled or steamed) and hadn't absorbed the spices at all. 

The same goes for my wife's Hot Garlic Beef. The sauce was good. The beef, however, was so tough that we couldn't tear pieces off with our teeth. I've never experienced anything like it at a restaurant. 

I hate giving bad reviews, but I do not recommend this place. 

If the prices were more reasonable, I'd say give it a shot, but it's not worth shelling out $12 to $18 per entree for such sub par food."}
{"text":"This does not compare to the food quality and taste of the restaurant in Sunnyvale, CA. Almost felt like it was low on spices."}
{"text":"Authentic Indo -Chinese food if that is what you are looking for!

We ate the paneer chili, a baby corn starter and the schezuan momo's... All of it was awesome!

For entree we had the Thai basil noodles which was nice and flavorful but a little dry for my taste, the vegetable curry noodles were really good. We also ordered gobhi Manchurian which was average.

For dessert we had the crispy noodles with ice cream and that was a big disappointment.. So definitely avoid atleast that for dessert!

Overall a good place, lot of vegetarian options... I will check them out in other locations as well!

Ps: the owner manager was really nice and friendly ... Made the meal even more personal and pleasant!"}
{"text":"No. No. No. No. No. (There's more to this review, I swear.)

The first time I went here, it was during the lunch buffet. It consisted of Indo-Chinese cuisine. By Indo-Chinese, I mean, some Indian food (from Tadka that is next doors) and some Indianized chinese food. Now, don't get me wrong, as a Bombay native, I have eaten some OUTSTANDING Indianized chinese food. Unfortunately, Inchin's just doesn't compare. The Indian parts of the buffet were tolerable and certain dishes did give a feel for home cooked food, but the Chinese half was simply terrible.

Later on, I gave dinner at Tadka a try.  I went there with my family and none of us really liked it. So if you're used to good, authentic Indian (or Indian-Chinese) food, you'll be disappointed.  If you're new to Indian cuisine or simply someone who hasn't had the good, real stuff, this will probably be acceptable to you.

I will say - the chef at Inchin's Bamboo Garden seemed super passionate about his cooking and eager to make you try his favorites. That, in itself, was respectable and made me want to like the food. Unfortunately, just wanting to like the food isn't enough. 

Final note - If there was a dearth of good cuisine in Westlake/Olmsted area, then maybe I'd try this place again. But seeing that there are plenty of options, I can safely say I won't be visiting this place anytime soon."}
{"text":"This is a great place which reminds you of good Indian Chinese food and Great north Indian Punjabi food...

I have never been to the buffet (as such I am not a fan of buffets in general) but I have catered from them too... great catering, great service and really good courteous staff!"}
{"text":"Tried the vegetarian Hakka noodles and added tofu for $1 upcharge. Veggies consisted of green peppers and carrots. 3 cubes of tofu. Noodles were super bland but added chili garlic sauce which was quite tasty. Hopefully they find their footing. We won't be rushing back."}
{"text":"Three starts are only for the food. They lost 2 stars due to poor customer service . The place wasn't super busy but the service was awfully slow. When we asked a question to the server about a certain dish , she simply she she has no idea. Anyways , I'll always come back here if I'm in Cleveland since this is the only indo chinese place around but I hope the service is better next time."}
{"text":"Pros: In a convenient location, walking distance to Case Western University, close to other shops and stores if you want to walk around when you're done eating, clean and nice decor, and very friendly waitresses.

Cons: The Asian food here is very very very very (I must emphasize 'very') Americanized. The potstickers were A-OK, the potstickers' sauce tasted like a heavily mixed sriracha, and the red thai curry does not taste like thai curry (did not taste any fish sauce and the curry sauce was overly thick). 

Note: This review is my opinion based on my experience only and may not reflect on the business as a whole. What experience I had may not be the same for someone else."}
{"text":"Disappointing. I tried their chinese menu. My food was way too salty, I ended up not finishing it. My friend's food was way too sweet. Not going to go back here ever."}
{"text":"I have had good experiences every time I have been here. The Thai red curry chicken main and chicken 65 appetizer are great. Staff is always courteous and inside is kept clean."}
{"text":"Got a bad rep for customer service but they were great when I went was there.  Made sure my water was refilled the whole time. Smiles and welcomes you. 

Buffet was okay.  Went on a Sunday.  Unique Chinese food but don't  really have the basics.  And the Indian food only had two different curry."}
{"text":"Probably one of the best place to get your craving for indo-chinese satisfied. Had been here with friends and had a wonderful dinner. The ambience is calm with the waterfall and bamboo sticks.. our server had good knowledge about the dishes and it's ingredients, so it was easy for us to decide our order. We had manchow soup, paneer tikka, chinese bhel, fried rice, manchurian with gravy, malaysian paratha & chocolate spring roles as desserts. The quantity is average. The best dishes that i would recommend is malaysian paratha and chocolate spring roles.."}
{"text":"UPDATE:  I'm reducing the star rating for this place.  Although the food quality continues to be good (see below) their service has hit the bottom of the pits now.  Its best to just get take out from here and not bother sitting down - you will get aggravated.  I am updating this review after 3 bad consecutive bad service from their wait staff, who are inattentive, have the air that they would rather be in the kitchen or somewhere else than on the dining floor.  They get the orders wrong and  don't pay attention while taking the order.


It's an un-assuming place in a strip mall with a rickshaw stationed in the front. Once you stepped through the first standard glass door you face two dark wood carved doors & the smell of Indian curry hits you. You realize something good is behind the doors. Bamboo Garden is an Indo-Chinese fusion - Mostly Indian with a historical Chinese influence. More is explained in their menu  Don't let this fusion business fool or confuse you. In the heart of it, this place is good Indian delish food. The atmosphere is open airy & well lit. Very different from the usual crammed dimly lit Indian sit-down joints. Their food is superb - well short of the true authentic home made Indian. 

The patronage is always a mix - the wide eyed curious first timers to the well trained foodies - but it's never an overwhelming crowd. The menu contains the usual Indian fair however you will see Chinese items alongside. These items are cooked with a heavy Indian influence - spices & Indian aromatics. The service staff are courteous & accommodating. They are well spoken. Bamboo Garden shares it's kitchen with Tadka which is next door and markets itself to be fully Indian. You can ask for menu of both from one place. I have found little difference however. 

Their lunch buffet also is more extravagant than others I have seen around. The items are actually well prepared & the number of dishes are always double the number than other Indian buffet.  They even have a party center for rent which is always hosting a function on weekends of course catered by Bamboo Garden.

Insider tips #1: order a green coconut for your drink. Once finished, ask them to split it apart and try the soft semi-white semi-sweet jelly-like inside. 

Insider tip #2: ask for both menus if you want even more variety. 

Insider tip #3: mind the spicy factor. When they say very spicy they Do meany very very very spicy. If you are used to the usual very spicy then order mild here.

Insider tip #4: ask for less sweet if you order their sweet mango lassi."}
{"text":"The restaurant is super unprofessional. The waiter didn't start the drink at the first. When we asked the drink option, he thought we just want water. I don't know if this is just laziness or the mistake. Then, the other waiter keep mess up the dishes we order. At last, the waiter didn't ask if we want separate check or together check and give us a together check for 9 people. The server is not polite at all. No please, no thank you. However, they still force us for tips. The dishes is really salty and not tasty. The overall experience is not pleasant. I don't recommend this restaurant."}
{"text":"Yikes! This restaurant seems to have an identity crisis.

Let's flash back a few months. This used to be a take out Chinese restaurant with a bit of modern flair. There was a ton of seating for those wishing to dine in. Entrees went for about $7 and were pretty tasty. I went here about once a week to get take out Chinese and would have rated it 4 stars.

But no more!

Almost overnight, the ordering counters were removed, the menu changed, and the place converted to a sit down place with entrees in the $14 range. It's kind of baffling how this could even work in a location full of college students looking for cheap meals and hospital employees running out for a quick meal to go. It almost seems like this place is just begging to go out of business with the new format.

Needless to say the food quality went downhill tremendously (along with the hefty price hike). 

The restaurant also introduced a $10 buffet at lunch which was one step above terrible.

Now let's discuss service. It can be summed up as \"not good.\" It seemed like our server had never waited tables in a restaurant before. 

The dining experience is also extremely awkward. The dining room has two floors and this place never has more than 4 tables occupied. It's sad to see how this restaurant had such great potential but failed to deliver."}
{"text":"After a long and good time spent at the Cayuhoga National Park with trekking, walking and what not, it was definitely time for some lunch. The desire to be back home soon meant finding a place nearer to West Lake.

Eating out is not as easy as what it seems, specially when the choice of cuisine is concerned. I don't recall how we settled down to an Indo-Chinese one. But Inchin's Bamboo Garden it was - the place to be for our lunch. Where a sumptuous buffet awaited all of its guests for the afternoon.

When entering in, the really huge and spacious setup was truly mind blowing - with some bamboo decor being present to be true to its name.  

The lunch buffet was placed in a strategic fashion in a corner of the building but yet providing for ample space for everyone to walk in and walk out with their food without elbowing out anyone else in the process. 

The buffet itself consisted of a wide variety of vegetarian and non vegetarian dishes. Their very notable take on the buffet menu was their dosa. There were only two varieties served. I happened to understand there used to be several more earlier but resignation of a chef has forced them to pare down on the number of dosa offerings. Not that it was any material for me to begin with - since I was there for the first time any case!! 

The dosas were freshly made in a separate counter. There was no oil / ghee available for the podis Peanut / Cocunut chutneys were not excellent but the dosa quality didn't require it either. You could munch one down as is when it was hot.

There were a couple of chaat items laid out in another table diagnoally opposite the dosa counter. I didn't give that a try and therefore, cannot write much about it except to say they had a lot of varieties.

There was an offer of a mango lassi or sugarcane juice that was freshly squeezed - and the sugarcane juice was a BIG win. It tasted awesome.

The buffet had two soup startes, a lot of appetizers like cutlets, chilli corn etc. They were all baked to the perfection. The cutlet specially didn't feel as if it was just potato stuffing.

The main course consisted of plain cumin rice, sambhar, rasam, vegetable biriyani, naan, goat biriyani and chicken biryani as well. 

The dessert menu consisted of the fruit custard, gulab jamun and carrot halwa. My favorite was the custard.

This place is definitely fit for families, single folks, couples - just about anyone who wants to have something. They have definitely tried to carve out something for everybody in their buffet menu even while trying to keep it as optimal as possible."}
{"text":"Are there as part of their opening and the food was great!  The favorite was the creamy fish and pepper salt shrimp along with the friendly staff!  

Recommend as fresh local Asian options made very well!"}
{"text":"It was my first time here in Charlotte and it has already become my favourite place to eat.
I had Paneer chilli which was really good, I could actually feel the indo-chinese flavour.
Then we had garlic chilli noodles and Gobi manchurian with fried rice (by default it comes with white/brown but the fried rice is really tasty) which was really good. It was not that spicy as I imagined but it was good.
Overall I was satisfied by the food."}
{"text":"Glad we decided to pop in to this new fast casual restaurant in the Uptown neighborhood. I unfortunately did not get to try much of the food since eating spicy foods on a hot day isn't my favorite.  However, I did enjoy the Chinese Bhel - it was the right amount of spicy and crunchy - reminded me of the bhel I ate growing up.  My husband enjoyed his lamb - his only complaints were the portion size and the rice (a little dry).  I think when it comes to fast casual, we are used to enormous portions so the portions here are probably what we should be eating and appropriate for spicy food.  The service was great - two people came up to us and asked us if we were having a good experience.  I look forward to trying the paneer, spring rolls, and noodles.  They actually have real dishes too so it has a little more of a restaurant feel.  If you're looking for a spicy lunch with Asian flavors, I'd check this place out."}
{"text":"The food was tasty and the buffet was interesting. However, the service was awful. We had made a reservation one week before only to be told we had no reservation. We were told the table would be in the Tadka side of the restaurant. When we arrived we were told they never take reservations and Tadka was rented out to a group of 75. So either someone answered the phone when we called who had no idea what she was doing, or they canceled our reservation when a bigger group called. We had to sit at a makeshift  table too small for our group. No one explained that there was a chaat station as well as the buffet. No one came to take our drink order (we waited 10 minutes) until most of us were already at the buffet. One of our party ordered a drink that never came. Plates were not removed in a timely manner. The place was very loud and crowded and clearly understaffed."}
{"text":"I have no idea why this place has such negative reviews. My roommate went here earlier today with her brother just to try out a new place and she came back saying how amazing it was. She recommended the beef curry, especially. Since I live in Uptown without a car I don't get to eat much asian cuisine anymore since your other options are Chopstick and Kenko and neither of them take CaseCash. Bamboo recently announced that they would be taking CaseCash which is a major plus if you're a student. So a friend and I decided to go today for dinner. 

Walking in, it definitely struck me as a nice sit-down dinner place. The atmosphere is great. Everything is clean, new, and relaxing. We ordered chicken potstickers, thai chicken curry, and chicken romaine and all were absolutely amazing! We took home a lot of leftovers since the food is rich. I think the only con would be the prices, the meal for 3 entrees (one of which was split) was $40. I definitely think they should be lowered if they want the restaurant to stay afloat with mostly college students getting lunch and dinner. Definitely better for an occasional nice dinner than anything else. But I thought it was great. The portions are a little small for the price, but the food is so rich that it goes a long way. Great if you love spicy food. I definitely recommend this place to anyone who wants a nice sit-down restaurant experience in Uptown."}
{"text":"It has been a while since I have been to Inchin's Bamboo Garden but if it was closer then I would make it more of a regular thing!

I went here twice with my co-workers who just love the food. So, if you are looking for some tasty indo-chinese then hit up the bamboo garden!"}
{"text":"This place is insanely overpriced. For example, $12 for a potato entree? Seriously?See other Yelp reviews for confirmation. We ordered carryout - lamb potstickers, decent. However, the Pad Thai \"mixed\" and garlic noodles \"mixed\" (mixed means with shrimp/chicken/lamb) cost $14 for each. That is crazy as the meat portion was non-existent. The meat was bite sized, like 3 tiny pieces of shrimp, chicken and lamb...and I'm still questioning if it was in fact lamb as it didn't taste like it. Overall, the dishes tasted very bland even though the menu describes the dishes differently. Portion size very small and they put into a pint size container. The prices are insane for what you get and it's just not worth it.So disappointed. If you're in the area, go to Ninja instead. Our $70 tab total waste of $. Good news is, CLE is loaded with many restaurants that are better so you don't have to venture far."}
{"text":"Authentic Indo-Chinese !!! Good quality ingredients and the food was well prepared..... 

People with low spice threshold - be careful since most of the dishes are a spicy (which is a good thing for me though !!)

Service could be better."}
{"text":"Finally a good Indo-Chinese restaurant in town! We ordered some appetizers both veg and non-veg and all of them were great. Chicken 65 & Hakka noodles were the  favorites! The lovely ambience added to making the dinner a memorable one! Definitely coming back and highly recommend this place."}
{"text":"Quick place for lunch. You order at the counter and they bring out the food.  The entrees are around 7-9$.  Theres only one size not lunch vs dinner. That being said, the portions are not enough for dinner but okay for lunch.  I have liked manchurian paneer and mongolian chicken the best.  The hakka noodles are good but a little bland but they have lots of sauces you can use to customize to your palette.  The drums of heaven are also good, 2 pieces cost 5$ which i think is a little overpriced.  In summary, good lunch option if you're in the area but there are better choices closeby, good food with bigger portions and reasonable price."}
{"text":"10$ weekday lunch buffet is a great deal.  They have about twenty items, with a good mix of indian, indochinese, vegetarian as well as meat options.  Its best to go on a busier day because the food is constantly replenished and is fresher.  The weekend buffet is a few dollar more but includes made to order dishes like dosas or chaat.  I really like their chili chicken or paneer and the drums of heaven appetizer.  I'm looking forward to the University Circle location so I don't have to drive 30 minutes when I'm craving hakka noodles."}
{"text":"The name of this place is confusing as the few times I've been here it was more of just an Indian place rather than a Chinese-Indian restaurant.  I believe I saw one or two boring, standard Chinese dishes in the buffet line but I skipped those for the more delicious looking Indian dishes.  I've only been for the Sunday buffets but this place is amazing.  From the outside it look slike just another non-descript Chinese restaurant but Bamboo garden is so much more than that.  It has a trendy and calming interior and when we went it was completely packed.  Almost everyone there was of Indian descent so they must be doing something right.  They even had to open the closed sister restaurant next door to seat people.  
The buffet is huge with a bunch of both familiar dishes and some new ones.  I had to try everything which took about three plates to fill up.  They had a pancake station and a traditional Indian \"salad bar\" (I'm sorry I have no idea what these are traditionally called).  Both were amazing.  My favorite part was all of the different types of sauces available.  I'm not sure if I ate them with the correct counterparts but I didn't care.  I agree with the other reviewers, this place was a great find and for 13 bucks you really cannot beat the price."}
{"text":"They have quality and fresh Indo Chinese food..one of the best in town. They have vareity of veg and non veg dishes.."}
{"text":"I wish I could give no star but I had to give one to write my review: on Tuesday I arriving with my work friend for lunch at 11.30 after brain seated we got our sweet corn soup which was only few corn with a paddle of cornflour, salad which was a bad replica of khimchi & spring Role which was edible
Then we kept waiting for almost 30-35 minutes looking for someone to take our order,the order arrive to us after another 30 mins by reminding the wait staff. The wait staff even asked how the food was & I had hesitation to say but the food was horrible & after getting the review the wait staff brings the check with no apology. That was the 1st & last experience of this place. Please don't wade your money here rathe go to any other Chinese Restaurent which are much tastier & the services are good."}
{"text":"Excellent food! Consistently they maintain a good taste be it a to-go order or dine in. They take a while to get the order ready.., but the food is worth the wait."}
{"text":"Four for atmosphere and three for food, so I would give it a 3.5 if I could.  My sweet and sour chicken with veggies and pineapple was just not tart enough.  I wasn't sensing the abundant flavors that sweet and sour dishes normally have.   The chicken was good.   Service was also good.   It annoyed me that a random man came by our table, trying to sell us a gift card to the restaurant.  He said that if we bought one, he would add an extra $15 to it.  This seemed rather suspicious to me and I certainly was not entertaining the idea of a quick return trip there.  Big turn off!  The restaurant was filled with Indian people, which was a decent indicator that the place is highly thought of by loyal patrons.   The bar was alluring with fascinating pieces of art all around it.  Best part of the evening was visiting with Sasirekha and her mother and taking my mom with us to celebrate Mother's Day.   My mom would have actually  preferred a steak and a plate of French fries, but tomorrow is another opportunity to please."}
{"text":"Tried a 2nd time, This time for lunch. NO crazy crowd this time around, none in fact, But still we got the same Crappy service. Last time we were here it was an evening and it was crowded. I understand the glitch in service with a heavy crowd. But the 2nd time was ridiculous. We waited for more than 30 mins for a Baby corn fry, ended up cancelling the order. 

They spoil the mood and feel like you are eating there for free. 

Food: 4/5
Service: 0/5."}
{"text":"Delicious!!!
We were skeptical because there was nobody else in the restaurant, but I'm so glad we stayed!! It was delicious. My husband had the chicken chili honey and I had the szchuan chicken. We both loved our dishes!! We also ordered the egg fried rice. We would definitely come back!!!"}
{"text":"The good, The bad, and the delivery. The good is they have a lot of vegan items. Their vegan Tom Yum soup is pretty damn good!! The vegan Szechuan tofu was quite good as well.
The bad, I ordered the lettuce wraps. It came with the filling in 1 cup in the lettuce in a box. There was maybe two usable pieces of lettuce in the box.
Further, I ordered thru Grubhub for noon delivery and it wasn't ready for pick up till noon.
Took 25 mins too get a few miles down.
Wish I had paid heed too the low rating."}
{"text":"Odd combo to have combined Indian and Chinese restaurant. I was craving naan and some chicken tikka masala and I wouldn't be denied. So I strolled in around 7 pm and the place was deserted. Great! Faster service for moi.

I was greeted immediately and decided that I wanted carry out. The host took my order and told me 10 minutes. My order was actually ready faster than that.

The food smelled delicious. By the time I made it back to my hotel it took all I had not to scarf it down in just a few bites. The chicken tikka masala curry was delicious! Creamy with just a hint of spice. The garlic naan was the perfect combination of butter and garlic. Yum! 

I'll definitely be back to sample some of their other dishes."}
{"text":"I went here for a late lunch and I was not impressed with the food, I'm eating my left overs as I write this too. So it seemed like this place is new, the decor is nice except for the hand painted  wall, but other than that it seems like a nice place. There was only one waitress at the time she seemed nice, but not too knowledgeable about that food on the menu. I ordered the $10 Lat Mai Kai starter, and on the plus side the starter portion was actually big enough for me to take home. The waitress did inform me that the spice levels of the dishes could be adjusted to my liking, a major plus. The spice levels were rated by **** one * being the mildest and **** being the spiciest. I love spicy food so I wanted mines to be really spicy. I was so disappointed when I got my food and there wasn't a hint of spice, as I continued to eat my food, my spice level **** seemed more like a spice level *. Not to mention my food was a little on the salty side, the sauces on the table where gross and really salty and my waitress did nothing to fix the issue. My friend also got ginger tofu and rice and it wasn't all that great either, hers should have had more sauce on it or something. I know this place is new so I hope it gets better, I'll come back for the buffet but by the time I come back I hope this place improves a lot. Over all, the food was not that great, I personally make a better, Lat Mai Kai (battered chicken with sauce)."}
{"text":"We went there with my sister and get family in Westlake. The buffet was good like cauliflower Manchurian, chili potato, tandoori chicken etc. Desserts were bad. You can also get your dosa made right in front of you. This time my sister said neither dosa nor sambhar was not good. The ambience is good but not great. I would say it was a so so experience."}
{"text":"It is sad to see a place where the food used to be delicious (since it is rare to find a good indo Chinese in the USA except for the Bay Area) however, the service  by the staff here is horrible. The staff does not have any skills to entertain their guests. They are super slow. They forget offering water and forget taking orders and the list goes on & on. Their current Maitre D/ host is rude if I have  to describe in one word. 

The owner of this place must take a charge and get hold of his business. If the owner of this place really cares to improve his business, s/he should do something about these major negative aspects. If not this restaurant will not flourish for long and will do a bad business. 

It is sad because this particular Inchin location had a nice and friendly manager called \"Peter\". Since he left the restaurant, it has become really bad (went down the drain)."}
{"text":"Had this place a few times while in CLE. My experience here was always positive. The menu is not what you'd expect but you will be happy.  A few friends with us didn't enjoy their items, but my wife and I loved the lo mein. 

Nice spot for a quick meal. I do not recommend if you are looking for a date night spot."}
{"text":"I honestly don't understand the low reviews on this page.

If you're an adventurous eater, you will love Inchin's. I think what they are doing is really unique... Indo-Chinese (Indian & Chinese) pairs two types of cuisine I love equally to create some really inventive dishes. Inchin's is a refreshingly original concept in the Uptown neighborhood. I've been here with friends a few times and have yet to find something that wasn't delightfully interesting. Last time, we split the lobster butter garlic, chili bean eggplant, and the homemade Szechwan dumplings. Yummmm. 

Do your homework. Don't come to Inchin's expecting run of the mill Chinese food. Come expecting really unusually awesome food with a spicy kick to it. The staff is super accommodating. I agree with Eric D, you can tell they take pride in their restaurant and building relationships with their customers. The inside is also very modern, with high ceilings and spacious seating.

Side note: they also have gluten free and vegan options available, if that's important to you! Score. They also seem to have social media contests happening often, so stay in touch with them to potentially win giftcards. Hooray Inchin's! We will be back."}
{"text":"This franchise is getting worse every time I come in to this part of town for work.  They only have a buffet available for lunch.  So if it's not what you want, you're shit out of luck.  Not good."}
{"text":"If you are looking for true indo- Chinese, this is the place for you! Good ambiance, good service, great food ! 
My fav was their chili garlic sauce."}
{"text":"Awful experience. Service was bad. The server was so disinterested and didn't even ask if we wanted a box for the half a plate of leftover food. Which we wouldn't have because the chicken was not good. Restaurant was not clean. The bottles of sauces on the tables were sticky with sauce running down them. All of this cost us over $40 for lunch.

Save your money and go to Hunan Coventry."}
{"text":"I like the Bamboo Garden, an odd little restaurant tucked into the strip mall between two Chinese buffets and next to an Indian restaurant that shares the same ownership.  The food is  India-Chinese, which is different-- Chinese food with an Indian take on the cooking and flavors; I really like it.  One of my favorites for lunch; it's never crowded, the decor is nice, and you can try the various things from the buffet and see what you like.
The food is buffet style."}
{"text":"We went to Inchin's Bamboo Garden for the third time this Thursday. When we arrived the place was bustling. We were greeted and seated promptly.

Within moments of being seated, our waiter greeted us and brought us water. He came back to get our drink orders, and then when he brought the drinks from the bar, he took our appetizer and entree orders. The pace of the meal flowed nicely and we never felt rushed.

We ordered vegetable tulips and lat mai paneer to start and for the main course we each ordered a spicy thai basil rice and street side chow mein. 

Both the vegetable tulips and lat mai paneer were excellent. Very fresh and made to perfection. 

We also loved our entrees. They were huge and we took over half home. 

Overall, we enjoyed all 3 of our experiences at Inchin's. Their menu was extensive and the food exceeded our expectations every time we visited them. They also have nice drinks, dessert and kids menu. Also, the price is quite reasonable. Can't wait to go back!"}
{"text":"Came here on a friend's recommendation and SO HAPPY that I did. Indo Chinese cuisine cuisine is my absolute favorite and it's difficult to find. You can imagine my delight at finding a BUFFET serving a wide variety of Indo Chinese dishes. The dishes offer the spice and piquant of Indian food with the umami you would expect in an Asian dish. I wish I had a place like this close by - the service was attentive and friendly, the ambiance was wonderful, and the food was wonderful! I hope I get a chance to come back."}
{"text":"Third time coming here and their kung pao chicken and Mongolian beef is pretty good. Their fried rice last time was dry though.  I guess you just need to choose wisely from the menu (aka Mongolian beef). The workers are friendly, the interior is nice and clean, most things on the menu is $6-9, it's a good place for a quick lunch."}
{"text":"Finally there's a Bamboo Garden in Charlotte and I don't have to the Triangle any more!!
Tried this place yesterday for lunch. The food is just as good if not better than the other location. They have really good lunch specials. I had the chicken manchurian with chicken fried rice and Hakka noodles. Lunch specials come with a spring roll, soup and kimchi. My husband had the garlic paneer. I also ordered a mango mojito (non-alcoholic) and we shared the darsaan dessert (fried noodles with sesame and honey and vanilla ice cream. I wasn't too crazy about the drink but everything else was top notch! The drinks looked phenomenal but since we went here for lunch during work hours, I decided to pass on the alcohol. But I will be having some tonight if we go again. The other location has crispy chili baby corn which I didn't think to look up but if you see it on the mit's a must-have. 
Our food arrived in a timely manner and was very well presented. Service was great and the decor is very tastefully done. They have ample parking. 
I am SO stoked to see this place finally open (the signs have been up since summer). Can't wait to go here again this weekend. Maybe I'll make this a weekly thing?"}
{"text":"I visited Inchin Bamboo garden last week.The taste and the flavors are promising.It has great ambience and I look forward to coming back."}
{"text":"This place is just ok. I love that it's halal and a very clean and nice restaurant. The food is just a little salty and served in small portions"}
{"text":"I gave this place 4 stars, but really it feels like 3.5ish. The first time here, I ordered the most awful sounding dish on the menu (Burnt garlic chili fried rice). Burnt garlic, to me, is that repulsive bitter overpowering evil that destroys all good flavor in a dish and screams \"i screwed up but kept going hoping no one notices\" 

Fortunately, it must have been an error in translation - I assume it's supposed to be \"roasted\" garlic. It had to have been because I love roasted garlic, it tasted like roasted garlic and it was the BEST fried rice I've ever had. 

The 2nd thru the 4th time going there, however, was a much more mundane experience. The prices started to look really high for what you get (lunch buffet seems being the exception). The flavors are hit or miss - some dishes are bursting with flavor, some are just pillowy feeling blandness. Maybe that's how they're supposed to taste. The buffet table is laid out in a strange manner though - you're supposed to go to the back for a plate, come to the front for rice/naan, then back to middle/back for the toppers. The traffic flow would've been a wreck if there were more people here.

The part that kills me though, is a $7 dessert that uses canned lychees and what tastes like sam's club bulk ice cream thrown together in a bowl...it wasn't distinct or interesting (sweet on sweet, mushy on mushy). However, their other dessert (ice cream and fried noodles in a simple syrup) was awesome...though borderline too sweet. It was a crunchy, sweet, nutty treat that I haven't had before.

Service is great, the folks working here have always been very friendly and accomodating."}
{"text":"Beautifully decorated restaurant in the University Area.  Located in a shopping center so parking can be dicey depending on the day or time.  Ordered my food go, but in the time I was there I could see they are still working out the kinks for serving and customer service.  The food was really great even in a to go fashion.  Packed nicely and everything was fresh and hot.  The salt and pepper shrimp really yum, the lamb bugoli super yummy(think of Mongolian beef just made with lamb, and chocolate mousse desert was divine.  The only thing I would not order again was the hot and sour soup-kinda blah.  Otherwise I will be back for sure!"}
{"text":"I guess I'll be the first to review! First, I'm going to say \"Thank You\" for bringing something fresh and unique to the University Area! Second, I think it was awesome that this place provided the community with free lunch on opening day! This was a great way to show appreciation for future clientele! 

I made sure to take advantage of this free lunch, and I was not disappointed. I had the Beef Mongolian and it was great. It was served with a healthy portion of fried rice and a side \"salad\" which was actually kimchi! All in all, the dish had a great flavor profile, and was enhanced by the different sauces they had table side. 

I didn't get a chance to look at their full menu, but I must say I have high expectations now! The ambiance is really cool. Very intimate and romantic. Also, I love their decorations that pay homage to Buddhism.

I will definitely be back!"}
{"text":"I was the first customer at this restaurant and on the first day the food was OK. However, my love for Indo Chinese food brought me back to this place again. My friends and I thoroughly enjoyed all the appetizers. In the main course; however, all the different curries ultimately had the same taste. You couldn't tell the difference between Szechwan sauces versus the Manchurian vs the garlic. I'm attaching all the pictures with this message. The lettuce with the Paneer tacos was old and turning yellow-ish. The desserts were really good. I highly recommend the chocolate spring rolls and the chocolate mousse cake !! I would come back and recommend this place but the service needs to get better. It is slow maybe due to still hiring process in this new restaurant."}
{"text":"A fantastic place for Asian cuisine in University Circle. I visit this place once a week for lunch. You can order from a menu or go the whole nine yards and grab a $10 lunch buffet which is amazing. Tons of options available for all, including vegetarians and of course, meat lovers! Parking is free at a lot next door for visits that are less than an hour."}
{"text":"A friend suggested this place and I started looking for an opportunity to visit. I drove 45 minutes one direction to fulfill my curiosity. Before leaving I verified that they only and always use halal meat.

We went to lunch buffet on a Sunday. The restaurant is clean professional looking with nice ambiance. The tables are located in a distance from each other, does not have a packed look like some other Indian restaurants. They have separated sections for groups of 6-8. They have enough people for service. Our table was checked quite often for filling our waters and removing the empty plates. I am not sure if their AC was on as I felt a little warm inside during a hot August day.

The plates, forks, spoons and dishes were placed on a long service table by the wall. I could not see dinner knives, and napkins were at register desk only. The setting of the dishes was OK to see and take each dish, but I am wondering why they do not set each dish against the wall, instead of placing them two by two. If they can turn all dishes to lean against the wall or set them in a 45 degree position, I believe that will give a better look and will make it much easier for customers to take their dishes. There was a label with the name of each dish, but not more than its name. It would be nice to see some, actually all, ingredients and spice level of each dish. I do not think all of their customers are familiar with all of their dishes. I am one of them. If they do that, that should be done with printed letters, instead of handwritten letters.

They had 2 soups, 2 types of appetizers, and many dishes that I did not count. 

I preferred to pass the soups to take advantage of other main dishes. 

2 appetizers were lentil patties and fried chestnuts. Lentil patties were crunchy but their inside was dry. Did not impress me. Fried chesnuts were new to me, they will not pull me back either. 

They had fried okra that I passed. Took a piece of naan but was not impressed. I do not mean it was bad, I mean it could be better like more crunchy and more appealing with bruhed butter on it.

A guy was making rice pan cakes on a separate grill inside the restaurant. Nice appealing idea and practice. We took a piece with potatoes filling to try, but could not finish because we had more to eat. More than lunch or dinner item, I would take it for breakfast.

They had plain rice and chicken biryani. I took a little from both. The chicken pieces in biryani were very few, and the one I took was dry, but the rice was very delicious. I could eat only that rice for lunch. 

They had tandoori chicken which was good, but I had better ones at other places and for cheaper !!! I beleive they should pay more attention to make the tandoori chicken from the peaces with bigger meat pieces on bones.

I had chicken tikka masala which was spicy but I liked it. 
I had chineese chicken pop corns, which were just ok to me. Not bad, and not very impressive.
I passed the lentil dish, paneer dish and hakka noodles.
I had goat curry, and remember having the better version at other places.

They also had another table for salads and sauces but I did not need to anything from those choices. 

I visited the desert table, but I was not lucky to get some rice pudding. It was gone before I got ready for deserts and they did not offer it again. That was not good for such a professional pace. But, they brought another desert after a while. The had 3 different deserts. Mango cream, Brown balls in syrup that was offered in place of rice pudding, and halva with cardamon flavor. I had the mango cream and halva twice. I would wish the mango cream was a little thicker. Halva was just great. It would be excellent to be offered Indian Chai with the deserts and I think it should not cost much to the restaurant to offer that.

Also, they could offer some kind of ice tea as part of the buffet. That would make the buffet more complete feast.

The chicken tikka masala, chicken biryani, goat curry and 2 deserts made my day. They were my favorites for this visit.

As far as the price, I think they charge the highest among the buffet restaurants.
Offering this many choices may be considered as incresaing the cost for the restaurant, but I do not think it does. If I am person who eats two plates, and they offer only one dish, let's say a chicken dish,  I will eat 2 plates of that dish. If they offer a second dish, for example chick peas, I will take one plate chicken and one plate chick peas. So, I am eating the same amount of food. However, the restaurant thinks they should charge me more and more for offering more choice. Yes, it takes extra effort to prepare two type of dishes instead of one, but I prefer to pay for what I eat, not for everything I was offered.

The bottom line, I do not think I will need to visit this place again because, it is in a distance from me, it is pricier than other places, and there was nothing with unique taste to take me back."}
{"text":"Great lunch buffet .. too many options. Food is very good and authentic."}
{"text":"Me and my friends were super excited to go to this place as all of us love Indo-Chinese but it was a complete disappointment . Everything we ordered was served cold , soup had too much salt , appetizers were served after the entrees. We had to  send almost everything to reheat .  Munchurian came first although it was hot but we had to wait for noodles for 15 min . It is on the expensive side . Portions served are kind of ok not too much . Staff was good . They tried to make us happy by offering some discount but mood gets spoilt with bad food ."}
{"text":"My Indian colleague said that it serves Indian Chinese food. The food is quite international, and there is even Thai fried rice... Their Nang is delicious. Atmosphere is nice, and perfect for the 10 dollar lunch buffet!"}
{"text":"The food wasn't bad but wasn't great either. Potstickers and lettuce wraps were okay but nothing special."}
{"text":"So, I'm really glad I went here because I will never go back. I came to visit my niece (a local student) My goal was a short visit. Well, one dish came out way before the other and that was odd. We ordered 2 completely different dishes and both tasted the same. (Really strange)  They were both way too sweet and the same sauce. Honestly,  they were not really bad and not really good. Just so sweet I left hungry and wrapped the food to go for starving students. I settled for a Wendy's burger on the way home and that was a 10 compared to this 1."}
{"text":"I was in town from Florida and was staying at a hotel with no food options for a conference. I noticed that delivery is pretty lame in Cleveland, basically everything was pick up and nothing delivered befofe 11-1130am. I came across this and looked through the pics and reviews and decided to surprisingly give it a try. I usually don't try stuff below 3.5 but we get no indo Chinese in Miami and I really wanted to try it. Anyway I ordered the chilli paneer and manchurian chicken. If arrived in 40-44 minutes and was hot and fresh. Portions were large. Manchurian was a little soupy. My actual main complaint was I asked for it super hot. Now I noticed the owners are Indian, and clearly I am Indian, so when I say I want it hot I mean fire! They sent it over mild without any hot sauce or anything on the side so I couldn't even fix it up. In actuality the average is probably deserved because they have more options here than we do in Miami. I hope they get their food more flavorful and listen when costumers say they want it hot!"}
{"text":"Chinese-Indian fusion? I'm there!

I have never tried this chain of restaurants, and after learning there was in Cleveland, I said \"sure, why not?\" and off we went with some friends to North Olmsted.

They had wisely advised us to not try the buffet or the Indian food, so we did not have to be disappointed. Instead, we ordered off the non-Indian menu (a blend of Asian dishes awaited!)

I mean, given, this isn't Cantonese food, but the food they cooked was actually really good. I was very very impressed..it was just tasty, not too greasy, flavorful food. I also enjoyed the Indian food too here.

Be careful on the spice level- they can make it hot. Otherwise, if you're craving both a mix of Indian and Asian food, definitely go to Inchin's Bamboo Garden- I highly recommend it!"}
{"text":"We came by here during a visit to Cleveland. We had heard a lot about this place from our friends, both from Ohio and Michigan, about the spicy Sino-Indian food dished out here, reminiscent of the street/comfort food dished out at home (Mumbai, India). 

From the get go, there was nothing comforting about this place. There were a grand total of two staff members for a place where I counted a seating capacity of at least 40. One of them was a gentleman who was really brusque and snappy when I asked him for time to decide my entrées after ordering the appetizers. Is it ever a good thing when you are slightly afraid to place an order?!

I'm 80% okay with bad service if the food makes up it, but the Inchin isn't going to be getting Michelin stars anytime soon, so could they please at least be nice to their customers?
Everything we ordered was either greasy or lukewarm. The Manchow soup tasted stale and we sent it back twice before just giving up on it altogether. The chili garlic noodles, spicy potatoes and drums of heaven fared only slightly better. We didn't stick around for dessert because we are not masochists.

Also, everything is ridiculously overpriced.

If you're here to satisfy your culinary nostalgia, you're better off waiting till you actually visit India. If you're here to get some good grub, just AVOID IT."}
{"text":"This place--as of this writing--currently has three and a half stars, which I think is not fair. It's a great place. Really nice decor and ambiance. Service was very good. And most importantly, the food was delicious! If you like Chinese and/or spicy and/or Indian, it's a must-go."}
{"text":"I'm not sure what they were trying to cover up, but we were greeted with the strongest, nastiest air freshener. Owner had to prop the door open to air the place out!

For the most part, the food was pretty good. Except the Mahi Mahi! It was freezer burned, and dried out. I sent it back after 2 bites. I was still charged $16! Be aware that $16 ONLY gets you a few pieces of fish and some shredded onions. No rice, nothing else."}
{"text":"Previously it was take out restaurant, now becomes full scale Indo-Chinese restaurant. Food and service improved considerably. Still lagging behind North North Olmsted Bamboo garden. Ordered Hakka chicken fried rice and chicken in garlic sauce. Both dishes were tasty."}
{"text":"Had the Mongolian beef, it was delicious! Service was good, atmosphere was chill I will definitely come back."}
{"text":"Great tasting noodles and fast service. Very convenient, affordable, and diverse selection of Asian cuisine"}
{"text":"Taste : they are ok, but service is what needs a heavy improvement.  They are Snail pace in service : for instance soup was served after the food:-) . They are just one week old .. may be they will soon ramp up. Will surely give a try next time in couple of weeks."}
{"text":"Buffet lately is really cold & stale. I can't believe the dosa was fat & not even cooked thru. They are losing the food quality of food. I might probably never return to this place."}
{"text":"I wouldn't want to give even one review. This was our go to place until today for Indian fusion Chinese food but the quality of the food is degraded so much recently that anything you order is tasteless. On our recent visit we felt that quality of the food is very poor in compare to the prices they charge. Specially we ordered Chinese bhel which we order every time and it was nothing except sev in there. No salad no chutneys nothing. Just plain sev. With cauliflower muncharian it was like a hospital patient food. No taste what so ever. Veg fried rice had few sprinkle of green pepper and carrots and that's it. And they charged $13 for it.. come on Inchin you can do better than this. PLEASE AVOID GOING IN OR TAKE AWAY AT ALL."}
{"text":"There isn't anything special about this place or anything negative. It was just basic. They have a buffet that features Indian and Chinese cuisine. Approaching the buffet I was so excited and it looked like a ton of options! I couldn't wait to fill up my plate. But once I got close and was looking at the food it seemed to be all the same. Noodles or rice. Chicken. Nothing exciting. I usually eat second (or third!) servings at buffets but with this one there wasn't any need to go up after my first plate."}
{"text":"Definitely would return to this resturant! The atmosphere nice and the wait service was very friendly and attentive. The food was yummy and the sizes were large. The sauces on the table are perfect for spicing up if you would like."}
{"text":"They have a lunch buffet, but it's not very good.
I wouldn't come back because it's more expensive than other options and chipotle is next door, which is much more worth it.
Not very authentic either."}
{"text":"I've been coming to Bamboo Garden ever since moving to the area. Actually, even before moving here. My parents had come to Cleveland a few years back and the people they were with took them to this restaurant and they fell in love. There's a chain back in Chicago (was? it may have closed), but my parents weren't fans but definitely liked this location. So, naturally when they found out I was moving here, we HAD to go. And, we continue to come here whenever they visit. (And, whenever I get a craving, I drive over and have an awesome meal)

This restaurant is indo-chinese food. They are combined with Tadka, which is north indian food. They're not separated, you just get two menus and can pick and choose - which is kind of nice if people in your party have varied tastes. 

As far as indo-chinese goes, I've tried a variety of menu items. My favorites are probably the Veg Coin Manchurian. Absolutely delish with the sauce. There have been a few times where it seems to be watered down and the taste is a bit blander, but for the most part, it's AMAZING. The Manchow soup is DELISH. Super spicy and they can't really take out the spice, but so tasty, so you don't mind the torture! As far as noodles go, the hakka noodles are pretty good! Chili noodles are good if you like spicier things!! 

I love coming for their lunch buffets if I can. They have a large variety of info-chinese and north indian specialties off their menu - different every day and they have a balanced variety of veg and non-veg options. On saturdays and Sundays, they have a man who custom makes Dosas and Uttapams (thin rice pancakes or thick rice pancakes with toppings) and they have (MY FAVE) chaat that you can make yourself! In my opinion, (and I'm sure this is the case with any buffet), the food quality is better when you order off the menu, but if you want to get a tasting of a lot of different menu items, the buffet is totally the way to go. 13 dollars a person is NOT bad at all for the amount of food that's available to try.

Thankfully, every time I've gone, I've had pretty good service. One of the waiters has come to recognize me (does it mean I go too often) and is always super attentive.

Basically, this place is worth giving a shot- if you are a fan of indian food, I'm sure you won't find it hard to find something you like on the menu(s). And, now that I've officially made myself super hungry writing this review, I'm pretty sure I'm getting takeout for dinner tomorrow!"}
{"text":"Grossly overpriced for simple Chinese food, but the food wasn't too bad. Not too impressive either. Swung by for take-out. Service was friendly. Venue was clean and ambiance was nice for a Chinese restaurant. That's all I've got for this place."}
