{"text":"I bought $ 20.00 Groupon for this Indian Bread Bar and went for dinner, it was simply
a disaster experience,. First we checked the Menu online very different Menu from the restaurant Menu. Price for each dish almost a dollar more then they quoted on online Menu. 

Here is an example:
We ordered: Veg. Pakoros, online menu price $ 6.95, in restaurant menu $ 7.25
Chicken Tikka Masala, online menu price $ 13.95, in restaurant menu $ 14.95
Saag Paneer, online menu price $ 11.95, in restaurant menu $ 12.95 
Garlic Naan online menu price $ 2.50, in restaurant menu $ 3.95
Plain Naan online Menu price $ 1.95, in restaurant menu $ 2.95

They charged us in restaurant price, even though they have total different prices online, we looked at a Onion Bhaji's for $ 4.95, online menu, in restaurant menu this item is not there. The veg. pakoros they gave was just awaful.

I was totally shocked to see they helped themselves with a gratuity of 17%
The food taste very salty and everything was done in tomatoe sauce.  
I have to agree the Garlic Naan was good.  I will not give one star, here no choice
for zero, I will not recommend anyone this place, please check the menu before
your order and the tip they will help themselves."}
{"text":"Another dismal Groupon experience. We felt ripped off at every turn. I knew we were going to be in for an eventful evening when we arrived. No one was at the front desk to greet you or see you to your seat. Usually you see happy people in a restaurant; no one was smiling here. It took a long time to bring us our food. There were only 2 guys working the whole restaurant. I was ready to leave but my wife was still sipping her $12 glass of wine. They also did a bait and switch on the menu. The prices you see are not the prices you get. Some things are way more. The naan is nearly twice as much as advertised.  You have to pay for rice.  Finally, when we got our bill, a huge tip was added in. Despite the poor service or should I say lack of service that we received, I paid by bill in full. The waiters never smiled once and never visited the table to see how things were going. In a nutshell, ended up paying over $50 (2 people) in total for average Indian food in a sub-par restaurant with pathetic service. Save your money and go elsewhere.  Groupon paid my money back in full but it does not make up for the horrible experience.  This was a huge opportunity for them to make a good name for the restaurant.  Once the Groupon goldrush is over, the owner will probably need to close the doors. I can't imagine they get much repeat business. And apparently they demand cash from patrons.  I paid in cash because I wanted to just get out as fast as possible and avoid making a scene on my wife's birthday."}
{"text":"Other than the 18% automatic gratuity, I thought the Chicken Tikka Masala and Eggplant dishes we got were pretty good.  I asked for spicy and it was just right amount of heat.

Service was good but they were not busy.  We got a mango lassi which wasn't as good.  Without the Groupon it would had been pretty overpriced, but it seems this place always do offer Groupon these days."}
{"text":"We had the worst possible experience at the Indian Bread Bar. We had bought a groupon and was excited to check this place out but was hugely disappointed. We went for dinner on July 18,2015. The server was very rude and abusive. It has horrible customer service which I did not expect from this place.

The prices are exorbitant and the food was awful. The naans(bread) were burnt and hardly edible. 

I would NOT recommend this place. It was a horrible experience. Be prepared to be abused if you ever happen to check out to place. AVOID Indian Bread Bar at all cost."}
{"text":"We should have listened to the first reviewer, but we decided to give this place a chance. Worst mistake ever. It's very overpriced and the food is bad.

The korma was awful, to the point I couldn't eat much of it. The curry was slightly better and since we were starving, we ate most of it. We felt a bit sick afterwards. The curries don't come with rice, you have to order it separately, it's 3.45 for a small portion.

We ordered a curry and korma, 1 serving of rice and naan, and samosas. That alone amounted for over $55, and yeah they do tip themselves around 18%. Whether you have a coupon or not, it's still overpriced! We've been to many other Indian restaurants that had more reasonable prices, and far better tasting food.

Also, the table we were seated at was very small for us. There were many other vacant tables and we asked if we could be moved. The server said no, so we assumed they were reserved or they get really busy. However, for the whole duration we were there, not a single table was taken. Even if they did get larger parties, there were still many other vacant tables we could have sat at. I attached a picture of the tiny table we were seated at.

The washrooms were disgusting, by the way."}
{"text":"I've been going to Bread Bar using Groupons for a few years now with my bf, from back when it was still owned by Amaya. Though the prices have gone up by a couple of dollars, the food is still excellent.

We also were not charged the 18% tip that I've heard about. I wonder if they decided to stop after seeing the negative reviews.

Tonight's highlights: 
1: Excellent garlic naan! Usually garlic naan just smells garlicky, but Bread Bar's garlic naan actually tastes like garlic. We had to order a second batch. I just wish it was a bit cheaper as it is so delicious.
2: the Butter Chicken! It actually used to be spicier, but now Bread Bar has a decadently smooth and delicious Butter Chicken without the burn that I used to dread. Seriously one of the best Butter Chicken dishes in the city! The chicken comes apart nicely as well.
3: Flank steak in spinach sauce. Good sauce and nice meat that also comes apart nicely.
4: Chana masala. Mild to moderate spice, so a bit much for me, but done nicely. My friend was more than happy to take the leftovers home when we were too stuffed to eat anymore.

Our server was very friendly. Make sure you present your Groupon at the beginning of the meal to be polite (as dictated on the Groupon).

As they increased their prices by a couple dollars, they reprinted their menu with the new prices but also use the old menu (with the old prices) simply to show their drinks. That part was a bit unclear but the server was very polite when he explained. So be sure to use the menu with the higher prices when attempting to calculate the cost of your meal. 

One thing a bit unclear on their menu was their curries but I managed to figure it out: They list all appetizers, sides, and vegetarian dishes with the prices next to them. For the meat-based curries, you have a selection of sauces and then at the bottom of the menu you choose what meat you want in the curry. It is the meat that determines your price. It makes it easy to construct a dish that you enjoy, for instance if you enjoy korma but want it with beef instead of the traditional lamb that is on many restaurant menus.

Another pro is that they're super easy to get to, whether by car or TTC. The sidestreet off of Yonge just East of the restaurant has unlimited parking after 6pm!

Would be 5 stars but I wish that the garlic naan and rice cost a bit less. Bread Bar continues to be a favourite of mine!"}
{"text":"we tried groupon. just me & my fiancé. terrible, sorry to say. we waited a long time for the appetizer, then after we FINISHED the appetizer, we waited an HOUR to get the main course. by then, we weren't all that hungry. 
but clearly, not every1 has to wait to long.
the group of 4 that came in well after us FINISHED their appetizer, & entire meal by the time my group of 2 even got the meal. we must have sat there over 2 hours.
lamb dish was tasty, the rest... meh... but I was burping up acid for hours afterwards, & I never get that. 
place was freezing, I sat in my jacket most of the night.
then they got order wrong. 
bathrooms were filthy. (it was only men working there, so gotta wonder hygienic conditions in kitchen, too)
little cup of chai tea was $4, I think that's ridiculous. small little cup of tea.
then, to add insult to injury, after really shoddy service, they added 15% gratuity to the bill. 
some restaurants do this. but they always tell you ahead of time or its on the menu. they can't just add things to the bill without giving you a heads up that they do so. 
this wasn't on the menu they gave me, but it was on some other menu that they DID NOT hand me. 
they made no apology for the repeated screw ups, didn't offer us tea or anything while we waited to get anything, total of 1.5 hours, seriously, that we sat at empty table with empty bellies, losing our appetite after having to wait so long. 
most places at least offer you a munchie to tide you over if they forget to make your meal, on the house, or at least offer some tea. 
but nope, no apologies, just told me he yelled at kitchen staff. does that help me feel better that he says he yelled at some1? don't really care. 
just want something to eat, sitting starving. 
would NEVER go again, even if they cleaned the bathrooms, improved service. 
don't recommend going, even for the food."}
{"text":"Indifferent waiter, avg food and a menu with two different prices.

This place is very shaddy, during our dinning experience we noticed people continually complaining about there bill. Sure enough when we got our bill everything was either 10 or 40% more  expensive. When we asked about  this they played stupid until i pulled out my smart phone and showed them there online prices. The waiter then replied thats their take out price.

When i went outside my friends and i were disusing this and a passerby overheard us and told us this place has a reputation in the neighborhood. Apparently, they have been scamming people for a while now with this dubious trick. The passerby told me this restaurant use to be associated with Amaya, however, Amaya had too many complaints about them scamming people that they disassociated themselves with this location."}
{"text":"Bought a groupon and had dinner there on a saturday.  The waiters were initially pleasant and kind.  Food arrived and was a big disappointment. The fish and prawn dish for $18.95 only had 2 medium sized shrimp and a paltry portion of very cheap BASSA filet!
The sauce it came with was good.

The naan bread and rice is very expensive ($5.75 or $4.25) and it adds to the cost of the main dish significantly. 

The braised lamb was a bit tough (pre cooked not fresh).  The korma sauce was good.

The only plus was the naan bread was hot and fresh and the sauces for the fish/prawn and lamb were fantastic.

Then the big surprise came when i saw the bill included a 15% gratuity.  I politely explained that tips are always at the discretion of the customer and it is mostly  based on quality of service.  He disagreed and became rude and said to me if you use a coupon you MUST pay a high tip!  I told him even if you wrote in a $20 tip i would simply not pay it.  I decided to leave him a 10% tip and pay cash.  They yelled at me \"then dont use groupon!\". I wanted to return and take back my 10% tip and leave 0% tip but my wife said to just leave.

I will never return to this restaurant.  Stay away from this place!"}
{"text":"I wish there was a lower star rating for this place. Saying this place has piss poor service does a disservice to piss. 

They brought the wrong dish then, after I pointed it out and waited 20 mins, they brought the right one...but charged me for both and refused to adjust the bill accordingly. The server was abusive about the whole ordeal...and when I decided he deserved no tip because of his jerk attitude and lengthy service delays, it nearly led to a physical altercation. 

I would recommend this place to my worst enemies or anyone who enjoys decent food in a fairly run down, dirty dive with staff who shouldn't be in the service industry."}
{"text":"Wish I had read the reviews before I bought the Groupon. Food was just okay. We ordered steak biriyani, butter chicken, and two garlic naan. The waiter made us order $40 before taxes and charged us 18% tip. He tried to overcharge us but changed it when I confronted him. Don't understand this kind of business attitude.
Save yourself your money and the trouble of coming here. Better off eating at McDonalds."}
{"text":"The food was good but it is a little pricey for food you could get elsewhere for less. 

Didn't like the fact that they automatically charge 18% gratuity. I wouldn't have tipped them no more than 15%. The service wasn't bad but slow for a restaurant that was dead (only a table of 4 besides my table of 2)."}
{"text":"Warning! Do NOT buy a Groupon for Indian Bread Bar!

Groupon continues to sell vouchers for Indian Bread Bar but they are closed and clearly out of business!!!

I bought a voucher a few months ago and went to Indian Bread Bar to use it 4, yes, FOUR times in the past 2 weeks and every time I got there they were closed, even though the hours on their website and posted on their front door showed they should have been open! 

If you call their number it goes directly to a machine that says the voice mailbox is full.  If you try to reserve through their link to Open Table it always says the restaurant is offline - even during their posted \"open hours\".

Every time I email Groupon to say I tried to redeem my voucher but the restaurant was closed, they send me a stupid email with the hours posted on the website!!! 

I tell them I can't reach the restaurant by phone and they tell me to email!!??

Of course when I tried to email the restaurant I received no reply - what a surprise, clearly they are out of business!

So either Groupon are idiots or are in on the scam.

I bought the voucher before seeing the reviews here, Amaya Bread Bar was a favourite of mine, if I knew it was no longer owned by Amaya, I never would have bought the voucher.

This experience has convinced me never to use Groupon again."}
{"text":"Im going to start off with the positives.
The food!! 
I was very worried about this place due to 1 star rating on Yelp, although it seems like it's mostly due to the service which I will talk about later.

We got chicken Vindaloo and Tikka Masala. It took about 30 minutes for food to arrive. Both were so flavourful in their own way, and their Garlic naan was crispy and soft inside which I love! Im a big fan of Indian food and this was one of the best.

Now the service. 
We were greeted and seated immediately. The server seemed nice and explained how the Groupon worked including the 18% tip that is automatically applied to bill. We already knew about it so we accepted that coming in. Then he demanded that we pay by 'CASH' which was a news to me. I sensed some illegality going on behind this. Anyways we went out to get cash from bank. That was the first downfall.

The second, our groupon allowed us to get up to $40 of food before taxes, which we did. But the server came back and told us we need to order more as it only came to 38. I added up our order infront of him referring to the prices on the menu. Then he showed us the bill and I noticed the Tikka Masala which was 16.95 on the menu was charged 14.95 on the bill. When I pointed out, he basically said that's what shows up on my system so you have to order more. Wtf?? I was so confused, but didn't want to argue over 2 bucks as this guy was starting to sound a bit abusive and forceful. I ended up ordering a side of rice to go. So their trick is to charge you less on bill so you have to order more and end up spending more money. 
All their food are over-priced. $17 for Tikka Masala? Although it was delicious, I would not return to this restaurant even with Groupon. 
Full of gimmicks."}
