{"text":"Went to this resto for the first time and really enjoyed my experience. The one dish that really stood out to me was the gnocchi poutine it was amazing. All the other appetizers were good also (lobster tacos, fried shrimp and grilled lamb). Tried the carnivore pizza and was very pleased with it. I liked the fact that it was not over loaded with too much meat it was just the right amount. I also liked the industrial decor and feel to the resto. I would recommend this place for sure."}
{"text":"Cool decor, horrible food. The pizza was doughy and dry, the mac & cheese was the worst mac&cheese I've ever tasted and the grilled cheese was really underwhelming. Sorry, but there are several pizza places in the same area that are exponentially better!!!  This is a fail."}
{"text":"I stopped by the restaurant since it was conveniently located in the same building as my hotel, and I'm glad I did. I ordered the prosciutto e rucola pizza, which was wonderful. The crust was perfect and all of the ingredients went really well together. You do have to cut the pizza yourself with the provided scissors, which is a little silly, but that didn't take away from how delicious the pizza was. I also recommend the aperol spritz cocktail."}
{"text":"My boyfriend and I ate here for our anniversary and had a great meal. We ordered the arancini and bruschetta to start. The arancini was delicious and very similar to the ones we had in Sicily. Only thing missing was a bit of sauce to dip them in. The bruschetta was a fresh tomato and garlic sauce on a thick crusty toasted bread which was quite good but a bit under salted. He ordered the pizza with prosciutto, tomato and parmesan, which was absolutely delectable, with a soft and airy crust which reminded me a lot of Bottega's pizza. I ordered the orecchiette with sausage and rapini, which was quite good but a bit too salty. All in all, I would highly recommend the pizza and would probably go back to try some of the other dishes. The service left a bit to be desired, but the decor and atmosphere made up for it."}
{"text":"On adore ce restaurant! Nous y sommes allés plusieurs fois. Il y a un DJ sur place et l'environnement est très agréable (belle déco autant section bar que section restaurant, belle vue du 2ème étage, ...)

J'adore les tacos au homard! La pizza Industria est aussi à essayer!"}
{"text":"In all fairness, I expected to love this place...the menu looked great and I had heard good things so I'm disappointed by how disappointed I was. 

My boyfriend and I went Saturday night with an 8:45pm reservation. The place was full and the decoration and vibe were very nice. Our hostess apologized for our small table and offered to have us wait to be seated at another - we assured her that it was fine. 

As I said, the menu looked delicious and we had a hard time choosing what to eat.

We ordered Aperol Spritz to start - it was good and authentic so no complaints there,

We were then told they had run out of the wine we ordered - which was fine too, we chose another. I suppose this threw the waitress off because she came back to ask what our food order was again. 

We started off with the charcuterie plate - and were disappointed. At 25$ it was a good size with quite a bit of cured meat BUT only 3 types: mortadella, pancetta and salami...the most basic varieties of Italian deli meat with some pickled vegetables. I would even be willing to let this go as \"authentic Italian brasserie\" if they were outstanding but they were slimy and not very fresh. 

We then tried the papardelle bolognese - the meat and sauce were very good. 

As a main dish, my boyfriend ordered the bistecca well done. It arrived bloody and he was forced to send it back. As she took it, the waitress asked if it would be ok if they just put the same piece of meat on the grill and brought it back to him...at a loss, he answered \"yeah sure\". It arrived medium-rare. 

My main dish was the porchetta burger. I'm a BIG fan of porchetta and couldn't wait to try it. It tasted off and the rest of the \"burger\" toppings didn't seem to go well with it. I couldn't stomach it after forcing down half. (I later got violently sick...but that's another tangent)

We declined dessert and asked for our bill. Our waitress kindly told us that she hadn't charged us the bistecca and a manager came over to apologize for the mistake. He seemed quite upset about it and we assured him it was fine. 

As my boyfriend went to pay the bill however, I noticed that we had been charged for our initial wine selection which they had run out of.  Another small detail. 

Overall, I was really let down by the food and the service. The waitresses were distracted and not very knowledgeable and while I can certainly forgive small oversights, there were quite a few of them. I was most let down by the food, which ultimately got me sick....

 I had heard good things about the place which, after I mentioned my experience, were met with \"oh but it was empty when I went and I just tried the pizza\" - so I guess it's better when it's not busy and I should have ordered the pizza?"}
{"text":"Cela fait plusieurs fois que je vais dans ce resto et j'y aime l'ambiance moderne. Par contre plus approprié pour y aller avec des amis que la famille car la musique est forte et il n'est pas facile de se parler.
J'aime la sélection de vin et le plateau de charcuterie, à chaque fois ma visite démarre de la même façon.
J'aime les tartares et les plats de viande. La sélection sans gluten est pas énorme mais clairement marquée sur le menu par contre.
Il y a plusieurs autres places d'Industria à Montréal mais je retourne toujours a celui de Griffintown. 
L'été il y a des grandes fenêtres qui ouvrent sur l'extérieur mais pas de terrasse. Très agréable;)"}
{"text":"Go there during the happy hour, and you'll thank me. Everything was good, but the appetizers were great, especially the tartare, which is beautiful and that too for $7-8. The gnocchi poutine was very disappointing though. Ruins poutine and gnocchi creating a mess."}
{"text":"Ouvert depuis hier, j'y allais par hasard. Agréablement surprise. Le Pompeii et le Berlusconi valent le détour. Comme nous sommes arrivés après 10 hres, les plats et pizzas étaient à 10$.

J'ai bien aimé la Big Mac Pizza"}
{"text":"Je suis vraiment déçu nos commandes ont été perdu sur 2 tables et aucune explications de données. La moitié de la nourriture était froide...... no more again this restaurant is banned for me......."}
{"text":"Woww c'est beau, c'est grand, c'est charmant... Même si le bâtiment où est situé la brasserie est un nouveau bâtiment, cette place à su garder l'endroit digne du quartier Griffintown. 

J'y suis aller un vendredi midi, donc j'ai pu profité du menu midi! Un endroit où nous avons le choix autre qu'une soupe ou salade ça fait du bien. J'ai donc pris une entrée (je ne me souviens pas du nom désolé) avec des oignons caramélisés, du fromage et de la mortadella servie sur du pain. Succulent! Et j'ai pris les côtelettes d'agneaux..yummy! Le menu midi varie entre 18$ à 25$. J'ai bien mangé, par contre un peu deçu que le café ne soit pas inclus. Je vais certainement y retourner le soir, car le menu est très abordable. Et bien sûre essayer leur 5@7.

Pourquoi cette place ne mérite pas une autre étoile...Désolé si je me trompe mais avec un nom de resto commencant par Brasserie, je m'attendais à voir des bières autres que de la Heinekein, Laurentides, Saporo...bref vous voyez le genre. Seulement 2 choix en bouteilles... Par contre, une bonne variété de vino! 

Bref, je vous le conseille et essayez de prendre une table près de la fenêtre pour avoir une belle vue des nouvelles construction et du centre-ville! Ahh et aussi j'ai bien aimé les banquettes rondespour 8 personnes (je crois) super ça!"}
{"text":"Oh my!! Let's start by saying that if you don't expect much from their cuisine, you won't be disappointed...
It's sad bc the location is very convenient since we live in Griffintown, but OMG how awful the food was.
They even do false advertising for their Happy Hour, saying that the cocktails are at $4 but it's not true... Only the basic alcohol, like vodka soda, gin tonic etc. Which isn't a cocktail; it's a regular drink lol And don't get me started on the food. Only the chicken appetizer my bf ordered was good. Lamb was wayyyy too cooked unfortunately and he asked for med rare... The lobster tacos are in fact goberge, and the tartare salmon is a real joke : like if they added a fake red color to it and spiced it up, hiding the real colour of the fish... (If there was any in it)
But the place is nice and offers nice views ;) Service was good too."}
{"text":"I recently visited here for dinner; we were in a large party of nine. And we all had wonderful meals. Reading the earlier reviews of this place, I can only surmise that this restaurant got its act together in the past few years since it opened. 

It was a warm evening when we dined here, and we all loved the industrial décor of this place and how the large, wide garage door \"windows\" were all wide open, exposing this second floor restaurant to the throbbing sounds and sights of bustling Griffentown (with a great view of the Montreal skyline lit up, too). The whole place had a vibrant, hip feel to it. The bar area adjacent to the dining room was hopping, too. 

Our long table (to accommodate 10 people) abutted a wall/divider of wine bottles. I can assume that they offer an extensive wine list.

The food was great! I don't recall all the meals we all chose. Two in our party ordered a few appetizers. One was the \"bacon lollipops\" which were presented beautifully and, I'm told, delicious. Most ordered different pizzas which are the specialty here. All came plated on thick wood planks with scissors to cut them. Some may think this kitschy but we all thought it fun and whimsical. And everyone loved their pizzas! One was a carnivore, one was the pizza equivalent of a Big Mac (yes, there were a few teenagers in our group! LOL). One person had a seafood pasta dish, which she enjoyed immensely. I had the Caprese salad equivalent: buffalo mozzarella with tomatoes. It was quite good. Without exception, we all had left-overs to bring home; the portions were very generous. 

One dessert was ordered and enjoyed but I don't recall what it was (perhaps a cheesecake? I recall that it looked good and fresh but not unique in any way). I had an earl grey tea with honey which, though not special, was still perfect for me. 

My only qualm about this place was the super loud, throbbing, thumping \"music\" which made it a little hard for us to hear each other. But I admit I am old. Perhaps if I were younger, this pulsating sound which jarred my guts with every beat would be enjoyable. Who knows. Otherwise, this was a thoroughly enjoyable meal in a really cool place!"}
{"text":"Walking into this place, I couldn't help being put off by the extremely loud club music. It could be different on other days, but on Friday night it made it difficult for my small group to have a conversation. 

Nothing caught my eye in the pasta section (somewhat small selection for an italian place) so I ordered the Margherita pizza and I wasn't disappointed. Not a lot of basil and the mozzarella was thick and chewy, but overall it was good. The Italian style dough was really great, not too thick, soft and had a good flavor on its own.

Only giving it 3 stars because I don't think I will return unless I'm already in the area for another reason."}
{"text":"Une excellente expérience, nous y sommes aller à quelques reprises et jamais déçu, les pâtes sont excellentes, les steaks cuits à point, les salmon bombs à tomber par terre...
Le chef Sergio Mattoscio (anciennement du Macaroni Bar et Top Chef Canada) est un trésor bien gardé...
Un resto à découvrir."}
{"text":"It's a fusion of modern and authentic Italian cuisine. It's a pizzeria and a bar; the place is a bit noisy. It's good to go with friends for a pizza and a drink, even on a date. 
Their pizzas are yummy, they come with scissors instead of a knife.
We had draft beers and pizzas:
A delicious Carnivoro;
Italian sausage, mixed meats, bacon, tomato sauce, fresh mozzarella. 
And a yummy Margherita;
Vegetarian - Tomato sauce, fresh mozzarella, basil.
Finally, service was okay, the couches were comfy."}
{"text":"Office XMAS dinner.
Entrée: meatballs...
Main course: salmon 
Food was delish... as always.
Modern and trendy decor! Clean establishment."}
{"text":"We went there on a Wednesday night, so naturally the restaurant wasn't full. I have to say, it was an excellent time to try it because we didn't feel rushed and really go to enjoy the restaurant. 

We got some great seats next to the floor to ceiling windows overlooking the view of downtown. 

We all ordered a variety of food, no pizza, but many appetizer and some pastas! Wow, we were very impressed at the quality of the meals. They were amazing. We had the salmon bomb, meatsauce pasta, beet and goat cheese salad and a bunch more. 

I would go back and probably order the same thing. Really reasonable pricing for the quality. The service was great and they were accomodating to my child."}
{"text":"Too expensive for average food and drinks. Don't recommend this place to anyone. I have no idea why so many offices have their get together at this place. We ordered the sangria, 2 pizzas and a meatball appetizer. 
I didn't enjoy cutting my pizza with a scissor and certainly wasn't too pleased with the quantities."}
{"text":"\"A good spot to overlook the transformation of griffin town.\" 

Italian place in Griffintown. Its in the Alt Hotel, and while Griffintown is literally an area in transition, this place offers some nice scenery, atmosphere, and views if you can get a window seat. Great place for an after work drink, casual lunch or dinner, or heck just hanging out. Expansive menu and lots of drink selection. 

Sat here for drinks and first thing you notice is a ton of natural light everywhere due to the windows. Lots of contemporary and modern restaurant finishes with rustic elements. 

Menu has enough selection for mains and snacks though we just had wine. Was happy to be here and would like to come back for a proper meal."}
{"text":"La poutine aux gnocchis m'a conquise.  Je crois bien que c'est la première fois qu'une poutine non traditionnelle me plaît autant!.  La pizza Industria est absolument à essayer parce qu'elle goûte le Big Mac! Bref tout ça en plus du spécial 10$ après 10 heures du soir pour une pizza ou un plat de pâtes font de Industria une place à visiter entre amis."}
{"text":"We visited this spot in Griffintown during Montreal's Pizza Fest with a group of 10 people and overall, we really enjoyed our experience at this restaurant. 

Firstly, the huge venue is located on the second floor to the Alt hotel offering a view of the ever changing neighbourhood and its condos. The space is beautifully decorated with modern accents, comfortable seating, and a nice long bar. There was a great vibe to the place with good old 80s music playing throughout the night. Given the size of the restaurant, it seemed empty although it was quite busy because of the layout of the space which allows for smaller intimate areas as well, making it great for our group. 

Secondly, the food was very reasonably priced, seeing we were there for pizzafest, we all ordered pizza; they have a great variety, the crust was perfectly chewy, generous toppings, very tasty and nicely presented on a wood plank with scissors for cutting up. They also have great drink specials during happy hour which we were able to enjoy as our generous waitress allowed us to place multiple drink orders before 7 pm although she served them later throughout the night. 

The service was great but our food did not arrive at the same time therefore the group wasn't able to start or finish at the same time; this is the only reason I would give this venue 4 stars. 

I surely would return especially during happy hour to enjoy a few cheap drinks with their food."}
{"text":"I said I would re review this place... I would recommend this place! The food was delicious but it's not an inexpensive lunch"}
{"text":"Good and original menu. Great decor. Waitress wasn't in the best of mood unfortunately. Too early to say that It's the norm."}
{"text":"Nouvelle brasserie italienne depuis Juillet 2014 dans Griffintown, genre de gros loft resto/bar au 2e étage du nouveau ALT. Bouffe/menu, prix et service ok mais bof, trop ''450/Dix-30/banlieue'' à mon goût. Y'avait quelques clients mais pas foule pour un mercredi soir de janvier en début de soirée. Je m'attendais à plus de ce lieu, je passe mon tour la prochaine fois et je vais ailleurs. Merci. Wifi gratuit. Bon appétit."}
{"text":"So I was excited to try this place... The successor to Macaroni Bar, where I loved the food. However after reading the reviews, I was a little scared. 

Ok, it's not as good as Macaroni Bar, but still good. 

We went for lunch and there were very few people in the place... Again, not very reassuring.

The food:
Pulled pork tacos, good but lacking in texture... Even the slaw didn't add any crunch. The pulled pork was very good.
Prosciutto pizza, on the small side, but really excellent. 
Salmon tartare appetizer, very fresh and very tasty. 

The service was friendly and efficient, which is great when you have limited time for lunch. Overall, the place has a nice vibe to it and decor is pretty cool too."}
{"text":"Ce resto veut concurrencer les bonnes pizzeria et restos italiens mais comme le nom l'indique, c'est un peu industriel comme bouffe. Rien de frais ou d'original mais vous payer le prix. L'ambiance est bonne et pour un lunch de bureau ça fait l'affaire mais il y a de mieux pour moins cher."}
{"text":"Good lobster pasta but pizza depends which one you pick the worse pizza i had is the Pizza Industria can't believe the waiter recommandesd that one, only reason i sometimes go is because i live next door."}
{"text":"The Holidays are a time to enjoy and celebrate with family. They are also a time to catch up on my writing. The next few reviews are a few months old now.... sorry for the delays. First up, I got a chance to visit Industria Brasserie Italienne for a mini McGill Football alumni get-together for homecoming. The results of the weekend weren't as we hoped on the field but I hoped at least I would get to enjoy a good meal at a place I'd had on my list for a while.

Located right in the epicentre of the Griffintown boom at the corner of Peel and Wellington, Industria is a project started by the Houston restaurant chain and chef Sergio Mattoscio - formerly of Macaroni Bar. Since first opening in Griffintown, they have opened a couple of other franchises in Montreal and Ottawa. The concept, according to them, is a modern pizzeria with an emphasis on sharing plates. Walking in, the venue is very sprawling and is definitely going for an industrial loft style with its high ceilings, metallic chairs, wood topped tables and black leather-ish banquettes. The bar area has plenty of TVs and the dining area has a huge glassed-in wine cellar. Frankly the space didn't work for me - felt way too big and lacked focus. The bar and dining areas feel very distinct and separate. One section to another felt like totally different restaurants. Coupled with the loud music, Industria felt more like a supper club than an Italian Pizzeria. I may be of the age demo who would like that ambience but personally it doesn't do it for me.

As I was drinking my Aperol Spritz, I was hopeful the food would spark my enthusiasm more than the ambience and the decor. The menu focuses on plates to share as well as some pizzas. As a group, we ordered a bunch of the starters to share. A mixed bag overall. The salad of mozzarella di bufala, tomatoes, cucumber, celery and fresh basil was solid with a freshness to the tomatoes and the mozzarella. The fried calamari with spicy mayo felt bland and came off as store bought honestly. They felt overly chewy and lacked seasoning. The meatballs with tomato sauce, ricotta, parmesan and basil were excellent - the meatballs were tender and juicy and the tomato sauce was wonderful. The pulled bacon lollipops with maple reduction had a nice crunch on the outside but the bacon inside was way too soft and mushy in texture. I know it's pulled bacon but it still needed a bit of crunch to really enhance that fatty bacon flavour. The maple reduction brought a nice sweetness level but the texture of the bacon sunk it for most of the table.

As chef Mattoscio is known for his gnocchi poutine, I couldn't come to the restaurant without ordering it. Fried potato gnocchi covered in a light chicken sauce and served with cheese curds that I am pretty sure were mozzarella and not traditional curds, I was left very disappointed in this dish. Flavour-wise, it felt way too rich and yet without much kick to it. I loved the gnocchi themselves but the cheese didn't bring that squeak you want from a poutine and the sauce really didn't do it for me.

Thankfully the pizza finished my meal on a more positive note. I went with the Carnivoro - italian sausage, salumi, bacon, tomato sauce and fresh mozzarella. Wonderful crunch to the crust, a nice zesty tomato sauce, tons of mozzarella and meat toppings, the pizza is the only dish I ordered that I would come back for.

In the end, Industria left me disappointed - the pizza was excellent but the rest of the menu was a mix of disappointed to okay. Add to it a look and ambience that I didn't take to and I left with no real desire to return. Perhaps for a pizza and a drink on happy hour but not sure about a full meal. Industria certainly tried to be a looker but in my case, she just ain't my type.

Cheers!"}
{"text":"The taste and texture of the gnocchi was very good. Usually, it is an indicator of a good Italian fare. The pizza was served cold on a thick tasteless crust. It lacked the freshness of the tomatoes and basil that you would expect from an Italian chef. The steak ordered medium came to the table well done. The plate was left untouched and the staff did not even care about inquiring. The service is extremely slow yet the staff is very courteous. Not worth the investment."}
{"text":"Nice place and good atmosphere. There is a big variety of pizza. The place is always crowded during the weekends. The music and the ambiance is nice. Some people might complain about the loud music. But I can tolerate that during the weekend.  I also liked the concept of large & open window. It gives you the feeling of being on a terrasse. The service is good too.
For meat lovers, go for the Carnivoro or Bacon.
I also tried the Salsiccia and liked it.
Lets not forget their scissors concept which very nice :)"}
{"text":"Les plats diminuent en taille, en qualité et en présentation et surtout le menu n'a absolument jamais changé depuis l'ouverture... Un petit effort de renouvellement serait le bienvenu."}
