{"text":"If you prefer pizza that's not from a restaurant chain and like your pizza to have thick toppings, then you should check this place out. My fiancé loves Inglewood Pizza and it's hard not to agree. The place is small with the only options being pick-up or take-out, but that's not a problem. They have 2 for 1 specials and offer $2 off for pick-up orders. I had the Zorba (salami, green peppers, olives, tomatoes & feta) and it was awesome! You can be sure I'll be ordering my pizza from here again."}
{"text":"Having lived in Inglewood 30 years I have many occasions to order from Inglewood pizza.  There pizza is ok but tends to be greasy.  It tends to be hit and miss; sometimes cold, sometimes dry, but always greasy.  Their service is always a problem.  They are more often then not rude.  Their regular delivery guy loves to try and engage in \"meaningful conversation\" which essentially is him judging people that he is delivering to.  Overall Inglewood pizza is not worth it.  There are way better options available."}
{"text":"Delicioius by the slice pizza, or delivery. Either way, you won't regret it. I order from here so much that the delivery guy knows me now."}
{"text":"Great little pizzeria (take out only)...   Family owned and serve the Ramsay & Inglewood areas.   Pizza is awesome and reasonably priced."}
{"text":"Be warned a large pizza is 12 inches!  Good pizza, but over $20 for a medium sized pizza is absolutely ridiculous. Mobile website is misleading. Unfortunately, we will not be buying pizza from here again."}
{"text":"Delicious, greasy pizza. I think this is a great pizza, really quick and really tasty. Good crust, good sauce, good toppings."}
{"text":"Excellent pizza tonight. Just got delivery, which we do from time to time. It is the best pizza we have had in a long time.  The crust is the right amount of crispiness for both me (preferably extra crispy) and my boyfriend (preferably more doughy). Toppings and cheese are great as well. Perfect on this cold night."}
{"text":"Yummo!! This place was Delish! So good that we ordered it two nights in a row! Even good the next day cold. O The villagers choice with red onion instead of mushrooms. Perfection  Just a touch too much cheese and sticks to the box bottom but hey. I'm very okay with that"}
{"text":"The pizza is great! Great crust and lots of toppings to choose from, their specialty pizzas are very good although I was told by the staff that the most popular is Hawaiian and meat lover. I tried the chicken   Souvlaki and it was of the hook! Cannot wait to visit this pizzeria again."}
{"text":"Easily the crappiest pizza in the city.  I can't believe so many people like over paying for poor quality.  I live in Inglewood and would love to support the local pizza shop but I can't.  We ordered a pizza last weekend, it took 1 hr to travel 4 blocks, cost $34 before tip!  It was cold when it got to our house and tasted like trash.  Now if the pizza was $12 like CPU I would have no problem with most of this, but $34 for one 14\" is nuts.  I can order two pizzas from WOP for that price.  The final straw for me is that this place closes by 11 pm!  The owner must own the build otherwise I have no idea how they make any money."}
{"text":"Such 'za. Very cheese.  Much yum. Wow.  Seriously though, awesome pizza. I loved the ample amount of cheesy goodness and the pizzas arrived nice and hot. Would definitely recommend. Ordered cheese, pepperoni, and Hawaiian pizzas."}
{"text":"I have no idea how the pizza is, but the service is terrible. We ordered a pizza two hours ago and have yet to get our pizza. After an hour and twenty minutes we called and they said it would be 5-10 minutes. Nope. No call, no information, no pizza."}
{"text":"Ok OMG chewy crust, delicious toppings, tangy sauce it's amazing gluten free pizza!! Think I love Inglewood Pizza!!!! :-) have set Inglewood to my favorites, since I can also order online!!   If you haven't already try this pizza!"}
{"text":"Another great experience Excellent quality pizza as usual! Lots of cheeze!"}
{"text":"We moved to Inglewood a year ago from Shawnessy and really missed Sammy's Pizza. Instead of driving for miles, decided to try Inglewood Pizza.  What a wonderful surprise. Inexpensive, ready in 15-20 minutes (we always pick up) and really, really good. Toppings taste of good quality and fresh.  My husband was never much of a pizza lover but we now order regularly.  I would highly recommend Inglewood Pizza."}
{"text":"Ooey gooey pizza goodness is what is on tap at Inglewood Pizza. Thick crust pizza with loads and loads of cheese. Our favourite is the town special. Yum!"}
{"text":"This is an exemplary little pizza place located in the heart of inglewood is one of my faves. I had a meat lovers and my husband took on the souvlaki pizza. All around the service was great and the za was even better. The place looks like a dump but looks can be deceiving. I would definitely recommend getting a slice here."}
{"text":"Popped in for a snack as we had coffee in the car already. Had never been in before. The place was clean and the service polite. I wish they had had veggie slices but what they serve by the slice is: pepperoni, Hawaiian and cheese. Settled on a piece of the first 2. YUMMY! The pieces are smaller then you would expect but cheesy (GOOD cheese) and very filling. 1 was more than enough for me for lunch. The pizza tastes homemade and they do not scrimp on the sauce which I love.  Take out only. $2.75 a slice - gotta like that! A great find, we will be back!!!"}
{"text":"A bunch of my friends needed some pizza. I walked over to Inglewood Pizza and noticed a Hawaiian pizza just popped out of the oven for pizza by the slice. I picked up the entire pizza for $22.00. I think there was a total of 6- 8 medium slices. The crust was good - baked to a golden brown. Good portion of cheese, ham and pineapple, not too much and not too little. Tasty."}
{"text":"Finally got to Inglewood pizza, $3.25 a slice ample toppings lots of great cheese tasted like a really good pizza. I was a little disappointed with the lack of pizza sauce and it tasted good when I did taste it. The lady at the counter was lovely."}
{"text":"Can't get enough of this place's pizza.  Best traditional italian thin crust pizza in town.  Although a little pricey, quality is awesome.  Love the Hog Wild, and if you love spicey, Hutch is it!!  Great location and interior design."}
{"text":"The pizza is great!! love the crust and lots of toppings on there pizza.  My favorite is their specialty pizza menu. I recommend the BBQ Steak Pizza, they use fresh grilled steak. Also I love their House Specials Its full loaded.  If your into Gluten-free pizza theirs is the best my brother has had. Made fresh in house."}
{"text":"When I'm on a business trip, I walk a lot, both in the morning and evening.  During one of those PM times, I started from the Hilton Garden Inn (East Village) and decided to explore the Inglewood neighborhood.  There's 2 places to cross the mighty Bow, and I took the pedestrian bridge both ways.    At some point on the way back, I felt a little hungry.  I guess that snacks purloined from the Homewood Suites part of the Hotel didn't completely satisfy.  What sounded really good was a slice to go and a nice winter ale back at the room.  Thanks to the insulated container, my Pizza was still warn when I got back. Delicious too!"}
{"text":"Mind blowing.. new to area, fairly new to Calgary.. ordered with no true expectations as we were simply trying to fulfill feeding the kids during our move. Could not have been more impressed!! Pizza came and we were completely taken back.. it was honestly the best pizza we have had! Will be repeating, beyond elated!! I normally choose thin crust as there never seems to be enough topping and all crust. This was normal crust with gobs of toppings and it was delicious!! Can not say enough~"}
{"text":"This pizza made me and my girlfriend sick. It's actually tasted pretty good , I suspect the cheese was going bad..  Sorry for a bad review but that's what happened..."}
{"text":"I only recently tried their Garden pizza-by-the-slice and I loved it! So much so, I had to try it again like, 3 days later. This time I ordered a gluten-free Garden pizza with extra cheese ... and to my surprise, I could see the extra cheese - elsewhere I usually get charged for the extras, but can never tell that the extras were added.  Staff is friendly and the location is quite convenient   Inglewood Pizza, you just scored another patron!"}
{"text":"I've been a pizza fan all my life.  In fact when I was younger I ran one of the highest volume Domino's Pizza stores in Canada.  Part of my job was to purchase and evaluate all of the pizzas in my community.  I guess this would qualify me as a well rounded pizza expert.  Having said that, in my opinion there are four things that seperate pizza places from each other:  crust, sauce, cheese, and toppings (or lack thereof).     Inglewood Pizza's crust is just right - a yeast leavened dough proofed correctly, and not too thick, but not so thin as to leave the slice droop when you hold it.    The sauce is amazing!  It's made in-house and is perfectly tangy - not the watered down ketchup that other pizza places call sauce!  I love the cheese and balance of toppings too.   Unlike many fast food chains, or pizzas you buy in the grocery store where cheese to them is more of a \"concept\" than a reality, every pizza I've purchased from Inglewood Pizza has had just the right amount - not too much that it smothers the toppings, but not so little that you can see gaps of sauce.  Kudos to them for also balancing the fat content in the cheese, so it's stringy, but not to the point of being gooey.  Every time I've ordered, I've walked in and watched my pie being made.  The toppings are all fresh, and generously placed on the pizza.  I know there are people out there who like real eclectic pizzas.  I like creative food too.  However to me, pizza is one of those comfort foods that should never be messed with.  Inglewood Pizza does it perfectly."}
{"text":"During a recent visit to Inglewood and the Inglewood Bird Sanctuary we decided to stop and have a late lunch. We were accompanied by our 3 & 6 year old so it had to be somewhere quick and easy. We were recommended to try the pizza place down the street. Being a family who loves Pizza this bode well with our lot.   Inglewood Pizza is a small take & out and delivery establishment and so they only had a few seats available...but we were able to grab a table for the kids. We opted for pizza by the slice (choices were pepperoni or ham/pineapple). As we ate our pizzas we watched a steady stream of locals come in and pick up their Sunday \"usuals\". This alone speaks volumes.  We all enjoyed our pizza slices and we even went back for seconds.  It was very good and highly recommended.  We will return!"}
{"text":"I've tasted their pizza before from a friend's party. I've always wanted to try them out for myself.  I used their handy website to pre-order for a pickup.  I was happy to see that they had note fields to leave them special requests.  When I arrived the pizza was ready and fresh.  This pizza rocks!  The crust is light and moist.  The mozzarella they use is a good quality one.  The pizza isn't too greasy.  We ordered two large pizzas, one the jalapeno-pineapple-tomato and one green pepper-olives-pineapple-tomato (veggie).  We got through half the pizzas while watching Blue Jasmine.  Nothing better than having pizza at home in front of a good Woody Allen movie with your significant other."}
{"text":"We just went here spur-of-the-moment the other day, while we were walking through Inglewood. I can see the owner is very popular, as people who came in after us were calling him by name :) Rob got the Hawaiian pizza by the slice, and I got the Pepperoni. We both agreed it was delicious. Truthfully, some of the best pizza I ever had. However, if you order the baklava for dessert, note that it isn't the typical, honey-saturated kind. I think this baklava is baked in a different way. If you've never been before, I must warn that it is a small storefront with limited seating, so I wouldn't advise bringing large groups, unless you are picking up a take-out pizza :d"}
