{"text":"So disappointed. It's just not the same. The highlight of our meal was the salad.... still the best black raspberry dressing. Though the online menu says they have filet, we were told they haven't had it in over 5 yrs.. I ordered the sirloin- with shrimp and scallops as I remembered them to be tasty, plump and with nicely seasoned mushrooms. I was so terribly disappointed when I saw the shrimp and scallops. They were lost -swimming in butter and overdone. . We were looking forward to our meal, but as we ate, we were looking forward to just leaving. I let our server/the owner know that the seafood was overdone - as they were still on my plate, and there was no reply.  We won't be back. Ever."}
{"text":"This place has meals on their menu that are in the 30 dollar price range.  The staff and venue were a real mismatch for that type of meal.  Someone needs to define what kind of restaurant they are.  Currently, they are a strange hybrid of trying sell themselves as upscale, but yet the staff wears sweatshirts and their restroom is beyond disgusting.  
I was into a chicken wing this particular night.  They were decent, not the best I've had, but decent.  However, the bleu cheese was spoiled and they do not have celery.  Who serves wings without celery?  
The place was dead, we were the only customers.  This place needs to step it up if they want that to change.  They can maybe, maybe, serve me a beer in the future.  Thats it.  But probably not."}
{"text":"The only saving grace was the phenomenal service. Other than that, this place is gasping for air. The ribs were burned and dry, the salad was wilted iceberg, and the butter was cheap dollar store margarine. The ladies room was dingy and dirty with no hot water. I'll be surprised if this restaurant is still in business in six months."}
{"text":"The Delmonico steak was excellent,.  Price was low.  From the outside you would never expect it.   Closest when headed from the airport to Pitrsburg."}
{"text":"Very nice place, not sure about dinner. But lunch was reasonably priced, especially with a groupon. Only complaint was the au jus sauce was just gravy with a little water added. Overall was a nice place and will visit for lunch again, as dinner is overpriced."}
{"text":"A wonderful little Mom and Pop place. The building is a bit of a maze and the decor reminds me of grandma's house.  We had the ribs and they were outstanding. Cooked to perfection and melted right off the bone.  The prices were reasonable ~$15 for a rib dinner with two sides. We were stuffed but had to try the Reese's peanut butter pie and it was absolutely delicious."}
{"text":"This place is real good. I was nervous at first but glad I visit It was my first time at a Inn Place. This is comparable to Bob's Steak and Chophouse. Definitely up there. The double filet I had was cooked perfectly and humongous; yummy! The waitstaff and ambiance was nice.
Great Deal"}
