{"text":"Inside the Bungalow really does things right.  The building itself is a large, old house, renovated with happy colors, artistic painting, and hardwood floors.  It's fun to explore the different rooms inside.  Outside, the patio is huge and beautifully landscaped.  

The place has a very family-run feel to it (for good reason), and the food reflects that; eating there almost feels like you're having lunch at a friend's house. The menu mostly features sandwiches and breakfast items, and there are always tasty homemade pastries in their display case.  Many items are vegetarian.  Occasionally they offer chef's specials that don't appear on the menu, and are always fantastic.  

But there's more to do than just eat, relax, and make use of their free wifi; behind the main building is a first-class yoga studio and massage facility.  And taking a yoga class entitles you to a free cup of tea!  Their selection is amazing, with loose-leaf and bagged varieties.

Their hours are a little strange, so check online before making plans to visit.  As they grow, no doubt they'll stay open longer."}
{"text":"This is a awesome coffee shop in downtown Mesa! Great place to grab a cup of coffee and hang out. They have a awesome patio and good stuff to munch on if you are hungry. Staff has always been quick, friendly, and very welcoming. I'd recommend checking them out!"}
{"text":"What a find. While visiting our son we stumbled upon this enchanting bungalow in downtown Mesa. A wonderful, friendly and knowledgeable staff, challenging yoga classes as well as beginner. Coffee house with delicious home baked goods and open Mike on wednesday evenings. All in  all a great find. This is a must when in Mesa. They also host small weddings and parties."}
{"text":"I was by myself, traveling for work, and wanted to go someplace that had Wi-Fi and a quiet place to get some work done and kill time before heading to the airport. I get so sick of the cookie-cutter, same-everywhere-you-go cafes.  I saw this place on Yelp and thought it looked interesting.  

I wish I lived nearby so that I could frequent this place often.  I love the kitschy decor throughout and beautiful outdoor patio seating.  Even the bathroom had an eclectic motif going.  As I write, I'm sitting at a dining room table, working.  I feel like I'm home, but with better coffee!

The decor aside, the food and drinks were very good, too.  I had an iced mocha and an iced tea (I had a long time to wait.)  I also had a turkey sandwich with raspberry chipotle dressing that was fresh and tasty.
The gentleman who served me was also very friendly.

All in all, next time I'm back in Mesa, I know where I'll be heading back here!"}
{"text":"If you read google reviews, you will see multiple people that agree that the owners are very RUDE! It was obvious that me and my children were not welcome the moment we walked in . I'm sorry I brought my 3 month old in her stroller  while also toting around my two-year-old little boy. I'm sorry I ordered banana bread and my child got a crumb on your chair. I'm sorry my child and his cousins played the games you have in your game cabinet. Apparently the games are for decoration. Before we even packed up all our things to go outside because we felt so uncomfortable, the owner was standing there with her vacuum waiting to clean up the crumbs. We wanted to finish our coffee so we went outside where the kids could play in the empty courtyard , the owner quickly came outside and told us our children are not allowed to run for fear of us suing them if our child fell.  I explained to him I didn't feel welcome from the moment I stepped in the door and he validated that we basically were not welcome. The crumbs were unacceptable to him, my stroller shouldn't have been inside the restaurant and my kids were not appropriately behaving. It's sad, this café is right across the street from a fun museum we frequent. We love going to get coffee and treats before our museum experience and unfortunately we will not be back. I would never recommend anyone with children to visit this place. Feeling bummed."}
{"text":"I have driven to this place 3 times now, each time was closed...I finally saw someone taking care of the gardens and asked and he said they close at 3 every day. I was really hoping to try this place but wasnt able to....due to the hours, I probably never will either :("}
{"text":"I am a regular at Bunglow for SO many reasons! The coffee is always good and the baked goods are amazing...dangerously so. There's nothing like homemade magic bars and/or lemon bars (yes, there are days that both happen...) and a good cup of coffee. Mike and Betty are wonderful, friendly and manage to always make my day/week better. My favorite coffee shop for sure!"}
{"text":"Beautiful, quiet little place. Went in tonight and the place was empty but the food was SO good. I had the Old Town sandwich which had some type of delicious raspberry sauce on it. The lady running the place was very welcoming and kind and made us some great food. I'll be back!"}
{"text":"Please go if you're in downtown Mesa. Dog Friendly!! Lovely proprietors. Two hot breakfast choices.  Very pleasant. You walk-up to order your food."}
{"text":"Rude, inconsiderate owners who have no business dealing with the public."}
{"text":"Grrrrreat coffee shop!  Comfy couches.  Good coffee.  Great service.  Yoga.  Good breakfast bites.  Lots of space indoor and outside.  The beautiful landscaping with abundant flowers takes it far and beyond.  My wife and I absolutely loved the ecclectic decor and architecture including the spiral chimney, china chandelier, and especially the Alice in Wonderland themed rooms.  The sheet music tables were a nice touch too.    

I spent all my college years lounging and studying in coffee shops around Seattle and SF.  This place challenges, if not surpasses the best of them.  Really quite astounded to find such a gem while here on vacation.  Had to come every day while in Mesa!!"}
{"text":"CUTEST CAFE EVER! I got a wonderful Cesar salad and one of the best IcedCarmel lattes, absolutely adorable and so many seating options. Love it!!"}
{"text":"I usually don't review after only one visit but since i won't be returning anytime soon I'll make an exception. I had been looking for a place besides the chains and burger joints my brother had take me to while visiting. After a quick yelp search i found this place. I got a delicious ice coffee and the \"enlightened one\" sandwich. The sandwich was very refreshing and light, yet filling. Exactly what i was looking for. The only thing lacking on the hummus, avacado, cucumber, tomato, and sprout sandwich was the bread. It tasted like packaged peppridge farm wheat bread, not bad. But, it could have been so much better, even if they just toasted it real quick. Mediocre bread can really drag down a sandwich in my opinion.

Besides that the service was great. The place itself is super nice and they even have yoga there."}
{"text":"Coffee was good but the service left a bit to be desired.  The older couple who waited on me started off pleasant but quickly turned on me as I requested a decaf americano ( i guess they like caffeine) with a pump of mocha ( he corrected me \" chocolate\") and extra room for cream. It seems the request for extra room was against the rules here.  Betty ( the lady making my coffee) gave me the look of death while the other guy suggested \" sounds like a latte to me\". So, if you want coffee your way- go to Lo Fi down the street, if you want it Betty's way then come here:) 
ps. if you are allergic to nuts, beware-they don't label  it as such"}
{"text":"Being that I work at home, I always look forward to meeting up with our web graphic designer and pow-wowing on the maintenance of our ever growing website. We usually choose a coffee house somewhere between our two homes and meet about every few months. Today we met at a very charming little coffee house/yoga studio in downtown Mesa, AZ called Inside the Bungalow. The patio was gorgeous and we had a lovely chicken waldorf salad sandwich. It was very yummy. I was happy that it was so quiet. We were able to talk and hear each other easily. I think this place might just be our east valley keeper. Very cute! :)"}
{"text":"Wonderfully unique atmosphere.   Good coffee,  fresh & very TASTY food.  Comfy cozy to stop in for a bite or hang out all day.   Free Wifi.  Yoga in the back cottage.  Very attentive and friendly staff.  Multiple rooms to choose.  

I will become a regular here.   ...And I've been searching high and low for the perfect reading spot with food and coffee.  After multiple weeks of testing various shops all over the East Valley...my coffee cup will rest here."}
{"text":"Great coffee, tasty food, and a huge, beautiful patio on which to enjoy them."}
{"text":"I visited Mesa from Southern CA about a month ago and was pleased to discover this gem my first night in town and I made a point of visiting every day of my trip. If I lived in Mesa, or anywhere near it I would be here every day! The coffee is excellent, they have an organic colombian, a good selection of veggie friendly foods, wi-fi, a large outdoor patio, and there is an extremely reasonably priced yoga studio on the premises, which I visited for one of their intro classes and removed the kinks of several days of driving from my back. The owner is a total sweetheart and the employees (and everyone else I ran into there) are friendly. They just don't make them like this anymore!"}
{"text":"My first time was last night - I went with a few friends, one of which raved about this place.  No wonder! The decor is eclectic filled with antiques of coffee art, books and some gems from the Victorian era.

I ordered the Americano with a shot of fat-free vanilla syrup.  They use Monin here, which if you're up to date on quality syrups, Monin is superior over Torani.  So that impressed me.  However, I thought their coffee roast was a bit too weak for me.  {I prefer a robust coffee roast over anything weak or bitter.}  Don't get me wrong; the Americano was delicious.

Also I had the Magic Bar, and my husband had a slice of apple pie.  We found out that they bake their own goods here from scratch.  Both were delicious.

I'll be coming back, but this time I'll be taking a book and settling myself in one of their comfortable, eclectic corners.  Pretty convenient since this place is close to Mesa Library.  

By the way, I've read the other reviews and it seems some were complaining about \"rude\" customer service.  I saw no evidence of that.  The staff was nice and friendly.  What more could I want... well, except for a stronger roast."}
{"text":"I've never really been a coffee house kind of guy, but then I'd never been to Inside the Bungalow before yesterday, when I found myself in Mesa with some time to kill. What a seriously cool place. It's an old house - a really big old house - with lots of little private corners to sit and eat/drink, chat, read, compute (apparently they got free wi-fi, but I didn't have my laptop with me), just chill, whatever. If I lived a little closer, I would totally hang out here. They've also got a giant patio with a fountain out front - a little hot in the afternoon this time of year, but only for another month or so.."}
{"text":"I came here to enjoy a sweet breakfast treat and an iced chai/espresso while I study. The Magic bar was delicious and my drink gave me that extra kick I was looking for! I had the opportunity to chat with owners, Betty and Mike. They are a great couple and always provide the quality experience that reminds me why I seek out locally owned businesses over franchises!! Thanks for another great experience!!"}
{"text":"One of my most favorite coffee shops! Location for sure. Soooo cute here. Inside and out. The patio is beautiful and you feel like you're in a diff city for a moment. Coffee is pretty darn good. Not the best, but good. And the menu is great. I am a vegetarian and they have many options for us. The treats are amazing. The staff is amazing. And they always seem to play great music too. Love this place. Wish it were not so far away in Mesa..."}
{"text":"If you read google reviews as well, you will read multiple reviews that agree with this post that the owners are very RUDE! 
It was obvious that me and my children were not welcome the moment we walked in . I'm sorry I brought my 3 month old in her stroller  while also toting around my two-year-old little boy. I'm sorry I ordered banana bread and my child got a crumb on your chair. I'm sorry my child and his cousins played the games you have in your game cabinet. Apparently the games are for decoration. Before we even packed up all our things to go outside because we felt so uncomfortable, the owner was standing there with her vacuum waiting to clean up the crumbs. We wanted to finish our coffee so we went outside where the kids could play in the empty courtyard , the owner quickly came outside and told us our children are not allowed to run for fear of us suing them if our child fell.  I explained to him I didn't feel welcome from the moment I stepped in the door and he validated that we basically were not welcome. The crumbs were unacceptable to him, my stroller shouldn't have been inside the restaurant and my kids were not appropriately behaving. It's sad, this café is right across the street from a fun museum we frequent. We love going to get coffee and treats before our museum experience and unfortunately we will not be back. I would never recommend anyone with children to visit this place. Feeling bummed."}
{"text":"What a wonderful little gem tucked away in Mesa!

The husband and I tried a few different yoga studios to find just the right instructor, atmosphere and personal attention. We found that and a whole lot more at Inside the Bungalow.

Our instructor is personable, welcoming and makes yoga truly a meditative practice. The studio itself is warm and inviting; a wonderful place to spend a Saturday stretching while living in the now.

I'm not a coffee drinker, but the cafe offers the best hot chocolate I've had best enjoyed on the outdoor patio area.

Love this place!"}
{"text":"This is the neatest place to have coffee and extras.  They also serve great lunches.  The staff is the friendliest people I know.  They make you feel like part of the family.  The facility not only quenches your thirst and feeds you well, they also have Yoga classes and they cater weddings.  All of this at a reasonable price.  The courtyard is is like sitting in a small grove and the inside is so cozy."}
{"text":"I love the food here.  I really do. It's always fresh, and tastes like what I want to make at home, but am too lazy to do it. I usually get the curry chicken salad. I also have had a peanut butter breakfast shake which was so good. 

This place is wonderful when you can actually sit outside. The inside is cozy, but I can't speak for how good it is when you need to work. 

It brings a nice dose of much-needed charm to downtown Mesa."}
{"text":"I. Love. This. Place.

It's seriously a hidden gem in Mesa. I drove over from Southern Tempe to find a new study spot and was not disappointed. They have free wi-fi, coffee, and a plethora of tables.

However, I would come here all the time for the decor alone. It is so cozy and quiet- I feel like I've been magically transported to Stars Hollow or something. They have a beautiful and spacious front patio, and the inside used to be a house so it's super eclectic and cute.

I ordered a cafe au lait and curry chicken sandwich (tastes just like how my mom makes it!)- the prices weren't steep at all and the service is so friendly. As I was studying I noticed that 99% of the customers were regulars- no surprise since the owners are so sweet! I want to start bringing my friends here because they deserve more business!

Overall: Perfect study getaway, good coffee and food at great prices, even better ambiance!"}
{"text":"While searching online for a yoga studio to practice in while visiting Mesa from out of town from NYC, I found the bungalow.  It was a real treat meeting teachers Carrie and Robin.  They were very professional, and lead great classes.  I enjoyed meeting the other members in the classes and found the studio to be a lovely, warm, and beautiful place to enjoy yoga.  The classes were small and comfortable, with music in the background during class, and lead at a comfortable pace.  Having a nice patio to relax with a tea or coffee after class is also a plus!"}
{"text":"Today was my first time here and unfortunately had a very bad experience. Me and six of my friends and our children had made plans weeks ago to go eat lunch here after visiting the Idea museum. Upon entering we all felt as if we were not welcome and felt very uncomfortable, we did not receive a pleasant welcome at all. In fact we all felt while we were ordering that we were irritating the lady behind the counter and somewhat of an inconvenience. After our orders were taken we continued to stand there and wait for our food to be prepared not knowing having our food brought outside to us was even an option considering there was very litte conversation not even a good morning, a how are you, thank you or have a great day. I'm not sure if the fact that we had children with us was an issue but believe me they were not out of control at all and were very well behaved. A younger gentleman that worked there came in after we had already sat outside was very kind and pleasant (he told other customers \"go ahead make yourselves comfortable I'll bring your food to you outside\") even the lady when she was assisting other customers was much more pleasant to them so unfortunately this leaves me take this personally. How we were treated and the fact one of the moms was told this is not a stroller accessible atmosphere tells me that this is not a kid friendly establishment, this is important to us because we are all in a Mommy group in the east valley with over 250 members. I'm disappointed by this because we were hoping this would be our regular monthly lunch spot for us after visiting the museum across the street but now we are forced to find a new lunch spot."}
{"text":"This place is AWESOME!!!!!!! The owners Mike & Betty are the best!!! The food is wonderful and the service is always 100%...Support your local Business!!! I go every single day for months and I have NEVER been disappointed! Treat yourself if you have not been to this wonderful Café!"}
{"text":"I met with a group of nerdy(bookish not loud) college students over the summer to review a team project. At 10 am, the place had no other customers. Of the 7 of us, 5 bought items. I bought three items which included food and a drink.
As soon as we all sat in a side area, the staff member delivering our food explained that everyone must purchase or we all needed to leave. I was so embarrassed for the students who may not have expected the cost, since I was the one who had suggested we meet at the coffee shop. 
After the staff member left, I went to the counter. I explained why  we were meeting and that I could not order for the two people who had not ordered because I did not know their preference (I did not want to  embarrass them by asking) but I had purchased three items that I was sharing with the group and some of the other students had purchased two items. I asked if we could stay for at least half an hour . (We had just started outlining our who would be doing which part of the assignment.)
 I thought that she would see the logic and our situation. Instead, she explained that the owners could not afford to have people using the bathroom if they were not paying customers (the bathroom is not a locked, ask- for- the-key place--to their credit). I was told to make our meeting quick because two people had not purchased items. 
We had planned on staying for an hour, but because we felt rushed, we left with the project half-outlined. None of us used the bathroom. I have not been back since."}
{"text":"The atmosphere is adorable and with a group of moms and babies, we expected to enjoy a nice brunch after playing at the Idea Museum. However, the owners (the older woman especially) were incredibly rude. They acted as if it was the world's biggest inconvenience to have a handful of toddlers in their little abode. After ordering, we immediately sat outside to get out of there way since it was clear they weren't happy we were there. A couple of plates (sandwiches/salad) came out over 20 minutes after the other meals were served. The sandwiches were very basic and plain, though the drinks (a smoothie and latte) were good. I will never again step foot in this establishment and to be quite honest, I'm surprised they're still in business after such awful service and less than stellar food."}
{"text":"Cute place. Hit or Miss service. I called once to inquire if they still had Yoga. The woman that answered was curt and seemed annoyed that I asked about something they no longer do. It is so cute and charming you want to experience it. You want it to become your hangout. But it is like a bad friend who doesn't think you are so great too. We have been there 3-4 times. Once, they were open but not serving food. One time we waited to order coffee but was ignored. On another visit we had a real friendly guy that we chatted with. The last time we visited was MLK Day 2016. We stopped in to get coffee and deserts after the parade. Our teenager wanted lunch, so we were considering it. We were never greeted and because the barista was making a drink for someone else, we just waited. He didn't offer menus. We looked for them on our own. The barista never looked at us or even gave a slight nod, just continued his long conversation. After almost five minutes of being ignored we just left.  It may not seem like a big deal to some but you do want to be acknowledged. Give a nod or smile. Throw in a \"Welcome. I'll be right with you.\" Something. There are many places like this in other states. They are usually warm and/or upbeat. It is a shame that Mesa only has this one superficial charmer that lacks real warmth and welcome."}
{"text":"Huge front courtyard with lots of trees to enjoy the Arizona \"winter\" weather. Owners are great and the home made breakfast pastries are divine. 

Haven't had lunch here, but if you work nearby why wouldn't you?"}
{"text":"I love this quaint little place! One of the most adorable coffee shops in the Phoenix Metro Area. The food and coffee are great also and fairly priced. I would just offer some constructive criticism: the kitchen seems a bit chaotic and inefficient. If you're going to work on improving anywhere, that's your target!"}
{"text":"I haven't been yet but I called in, asked to speak to a manager and the manager says, \"It in the middle of lunch and I had to leave a customer so this better be important.\" She didn't ask who I was or what my issue was I even politely offered to call back and she said don't bother. I guess this business doesn't want my business. Maybe she thought I was a sales call? Or a rude customer she encountered earlier? I was neither :-/"}
{"text":"This business is really a hidden gem.  The owners are great people and role models in my opinion. The atmosphere is whimsical and enlightening. Now the food, drinks, and desserts are amazing. If your in downtown Mesa, meet with a friend or two."}
{"text":"Very unique atmosphere- though already mentioned, it bears repeating.

 Yeah- the coffee and espresso are good- they also have Chai, herbal  teas, and some smoothies- but honestly, the lunch menu is worthy of a visit, and the Curried Chicken Salad sandwich is clearly the star pick. 

The \"Cafe\" is a L-A-R-G-E Craftsmen style home, originally built over 75 years ago, with an expanse of patios, fountains, and intimate outdoor spaces. It has a flavor likened to Alice in wonderland meets northern California-- Not sure why, but just feels that way. Inside is a kind of romantic kluttered kitsch, but without the manufactured feel of a Buca Di Beppo.

Overall, the feel is very nice- about as whimsycal and earthy as you're going to get in the big PHX- I personally love it, and would spend alot more time there if they were more flexible in their hours, and served a cold beer."}
{"text":"Charming and beautiful cafe! If I lived closer, I'd be here more frequently! Tasty coffee and friendly owners. Love the massive patio filled with lush greenery. Would return to hang out on a lovely, cool, Arizona day!"}
{"text":"Fantastic environment and friendly staff. It's quite a large location. Plenty of rooms with wood floors and nice carpeting in some of the quieter areas. Classic novels and encyclopedias line the bookshelves and old advertisements for food and entertainment can be found in frames along the walls. Often there will be freshly baked goods; I typically see cookies, breads, and pies. Free refills on my iced tea. I could spend hours there. So nice. You can sit indoors or outdoors. It's very tranquil. Quiet spots can be found, or you can sit near the fountain and enjoy conversation with the many folks around you.

As a final note, credit card charge on purchases under $4.00. Enjoy!"}
{"text":"Loved, loved, loved it!! Loved the atmosphere, friendly staff and my iced chai.  My son got a white chocolate/peach latte and it was awesome.  Even the bathrooms were cool.  Favorite thing- the gazebo outside.
Wish I could have stayed longer."}
{"text":"One of my friend's super cute finds in the heart of Downtown Mesa! The best part was definitely the patio area which they've transformed into a very quaint environment for all to enjoy. A group of us went to Inside the Bungalow and brought along a few board games to play outside as the weather was absolutely perfect.

We ordered lunch at the cafe which was delivered to us in a very short amount of time. I got a sandwich with a side potato salad. Their food was delicious were their other treats. Many of us even went back to get something again!

I know that they not only have lunch but also coffee & pastries. I'd definitely recommend checking this place out with a group of friends or even if you just want to go by yourself. I can definitely see myself returning with a good book to enjoy some time alone!"}
{"text":"I am so glad we chose this place for our wedding venue! We went to dinner here last week and as we were walking up I told my husband I would totally get married here (again)! The venue is so charming and such a wonderful backdrop for photos. We had tons of color in our wedding photos thanks to this venue and our photographer and we received many compliments on how beautiful our venue was from our guests and anyone who saw our photos.

We sadly had rain forecast for the wedding and I was really nervous about it in the week leading up to the wedding. We went to drop off our wedding stuff the night before and Betty had a plan of action in case we ended up with rain for the wedding. I felt such a weight lift off my shoulders and was able to relax knowing we had their support for whatever happened the next day. Mike and Betty's support really helped our day be completely fantastic, even if we had to make some changes last minute due to morning rain."}
{"text":"Great yoga. Tasty coffee. Beautiful patio. Cozy indoor seating. And (I hear) awesome soups. Sounds to me like a perfect combination!

The wife and I liked the yoga so much we bought a package and plan to attend every Saturday. It's a great workout and a perfect start to the weekend.

I'm really looking forward to hanging out on the patio once it warms up a bit. Overall the place is very inviting -- so much you just want to hang out there all day. 

Oh, and the people there are wonderful! All very nice, almost as if you're family. (Come to think of it, I think they're nicer than my family.)"}
{"text":"This may be OK as a coffee shop, but for special events, forget it.  It is a charming
venue with used brick on the outside patios, old trees with white lights sparkling in the evening.  The building is a converted house with whimsical rooms.  The problem is the owners/management.  They were uniformly rude, obnoxious, unhelpful and oh yes, just plain nasty.  If you are going to be in the hospitality business I would suggest being...hospitable.  Apparently they do not have the hang of that.  Somewhat of a problem if you are receiving large amounts of money moonlighting as a wedding venue.   My niece was married there , and they were supremely unaccommodating.   They had my sister, the mother of the bride in tears the day of the wedding!!
Additionally, evidently they did not want to spend extra money to air condition the bridal party room so that the mother of the bride could be there, and she was unceremoniously told to \"get out of there\" (air conditional for extra bodies given as a reason) .  Wow.  Do you want your wedding day to have extra stress because on top of everything else you have to deal with a B**** of a proprietor?    I would strongly urge anyone considering having your wedding there to reconsider, as it is too special of a day to be ruined by owners like that.  The place is indeed charming, but ultimately not worth it."}
{"text":"Very cute quaint and quiet... Friendly staff excellent quick service best hidden coffee gem in the east valley"}
{"text":"Friendly, knowlegeable, GREAT coffee, cute place where you can everything from meetings to weddings, take a yoga class, and meet great people on Monday nights for Leashes and Lattes!"}
{"text":"Super delicious lunch. I had the curry chicken sandwich and my husband had the ham and brie. They were really good, if I was closer I'd be here all the time. I only gave it 4 starts because the drinks were just ok, served so hot we couldn't even drink them until the lunch was gone and the taste was just average. The service was excellent and super friendly."}
{"text":"Inside the Bungalow or what I will always refer it as Coffee Talk is a nice surprise nestled in the hum drum downtown of Mesa. I have been enjoying their coffee and live talent since I was fifteen. When I was in High School it was a ritual to hit the local dollar movie and then end the night with some coffee at coffee talk. I think the best part was hitting on boys and trying to pass as being at least eighteen years old. My reasons for going to Coffee Talk have changed over the past decade, but the atmosphere and quality drinks and pastries have not changed. There is nothing better than sitting on their back patio and enjoying the cool breeze of the fall. There is something about that place that brings me a sense of relaxation. If you enjoy artistic ambiance, coffee, and live performance's then I would recommend Coffee Talk."}
{"text":"This place is magical and the food is awesome! I couldn't decide between the Waldorf or Curry Chicken salad so they gave me a small scoop of each on a bed of fresh greens. They were both delicious! The green tea was real brewed green tea...none of that fake fountain crap. My friend had the Turkey and Brie sandwich with a smoothie and left extremely satisfied. I'll definitely be back when the weather is cooler so I can spend a bit of time on the beautiful patio!"}
{"text":"Inside the Bungalow was like discovering part of downtown Mesa's historical treasure. At nearly a century old this charming home has been transformed into a whimsical café. The patio is inviting, the décor is delightful, and the friendly service immediately makes you feel right at home. I visited for the first time this past Saturday morning and my only regret is not finding the Bungalow sooner. I brought my Mom and daughter with the intention of ordering a coffee, or tea and perhaps one of their baked goods. To my surprise what we uncovered was a lovely café with more than meets the eye, be sure to look up the twisted chimney once you've entered the kitchen. There are cozy tables chairs and even books, magazines and board games too.
 They  drink menu consists of coffee and tea, espresso (hot or iced) Chai lattes, Italian sodas, twisters (blended drinks) in coffee flavors, green tea and creamsicle , and they offer smoothies too! The cashier offered the option of hot chocolate with whipped cream to my daughter's delight and even a few ice cubes to cool it down. They have several baked goodies; we chose a fudge brownie and 2 magic brownies (no not that kind) but irresistibly made with a graham cracker crust, coconut, chocolate chips, butterscotch and walnuts with two tasty Chai lattes to wash them down. 
They have breakfast and lunch sandwiches, even healthy options several salads, a Thai peanut tofu wrap, a hummus platter and a veggie pita.  While we were there  for over an hour I might add; they starting setting up their beautiful garden court yard for a wedding which they told us they host quite often. Open Mic nights are on Wednesday evenings so if your talented as well as hungry you can go for that too.

 This is sure to be my new home away from home, I can't wait to return. If you're in the area be sure to pay them a visit, you won't regret it!"}
{"text":"Inside the Bungalow (Formerly \"Coffee Talk\") represents the most unique cafe environment to be found anywhere in the greater Mesa area.  It's an island of alternative funkiness mired amongst a surrounding sea of strip-mall monotony and pervasively vapid decor.

Nestled amongst Mesa's historical district, Coffee Talk occupies two adjoining bungalow-style houses.  Walls and structural supports have been left  intact, creating a homey ambiance with a different feel in each room. Two outdoor brick patios are complimented by picket fences, gurgling fountains, and lush vegetation.

The service counter boasts a far-better-than-average selection of coffees, teas, and espressos along with a sizable assortment of baked snacks and high-end pastries.  Free wireless internet gives laptop users a link to the outside world, and a varying array of  talent brings in live music during select nights.

But wait! There's more!  It's sizable layout allows Coffee Talk to double as a Yoga Studio.  One of my friends (a yoga aficionado) described it to me as a \"lovely space\" that features large French-glass windows and hardwood floors. This friend once lived amongst a virtual sea of Yoga studios in San Francisco.  While she's had dreadful experiences with surrounding gyms and yoga instructors, she's referred to the on-site instructor as \"One of the Best\" and \"World Class\".

If you're holed up in Mesa, in search of a casual spot to hang, and tired of driving to Scottsdale or Tempe, pop by Old Town Mesa to check out tastes, places, and spaces like you've never seen in the surrounding area.  The word is getting out, a crowd is beginning to form, and it won't be long before Inside The Bungalow becomes a prime hangout for Mesa, it's surrounding communities, and quite possibly the ASU crowd."}
{"text":"I've never reviewed before but I thought I needed to say something about this place. I wanted this place for my wedding more than anything. I saw it online and my fiancé and I decided to go to their open house they hold on Wednesdays.  

We get there a little early and go in and check it out. I ask if I can have more informations on the weddings they hold there and the owner just hands me an information packet that is already online. She said the open house starts at 5 30 so I thank her and we go and wait. 

Her husband comes out and turns on all the lights and tells us we can look around and this is around 5 10. He tells us to go inside if we have any questions. I'm done looking and I go inside to talk and get more information. I go up to the owner and she claps her hands together and goes \" ok it doesn't start till 5 30, thank you\" and walks off. Really? It's 5 20 and you are standing doing nothing! why are you being so rude? Plus I was just told to come in here and ask you if I had questions!  We go outside to leave and her husband stops us and tells us he can show us and help us. Another couple comes in and she is nice as pie to them. 
Based on what that other review said about this lady I would never have your Wedding here.  If you own a wedding venue be prepared to be nice to people. I would have been ready to sign papers if only she was nice to us. Found a much better venue after this experience but wow blew my mind!"}
{"text":"In a half hours time I searched yelp for mesa wifi spots, drove to \"The Bungalow\" and am now enjoying an egg bake with a pomegranate ice tea. Couldn't be happier to put off working a few minutes to give this lovely little place 4 stars.  I may upgrade my rating after trying the sweets!! Peace

Ok,  I've now tried the brownie...  It's ridiculous.  I ate the whole thing save 2 bits just to kid myself.  It was good!"}
{"text":"Oh man, this is really one of those cases that I wish they had half stars. I really loved this place and wanted to give it the 5-star badge-of-awesome, but I can't bring myself to do that at a place where the food doesn't absolutely blow me away. Now, that isn't to say that the food wasn't great, it just wasn't that 5-star level that you have dreams about when you get home. None-the-less, I will be returning. This place uses organic, local, fresh ingredients for all their food. That is a rare find, my friends. The fresh, organic thing was the main reason I really wanted to give it a 5, but the flavors just didn't knock my socks off. I had the Gobble it Up Sandwich, a Chicken Waldorf salad, and Ginseng Soother smoothie. The sandwich, in my opinion, had one big thing going for it; the havarti cheese. I LOVE havarti cheese and not many places carry it. All in all, the food is good, but the only part that really wowed me me was the smoothie. It's labeled as their stress-reducer smoothie, so I thought I would give it a whirl seeing as a could use a little relaxation before heading back to work. I drank most of the smoothie before the food came, and I really did feel less stressed by then, but I'm not sure how much of that was due to the smoothie.

That brings us to the ambiance of the bungalow. It's a very quiet, peaceful place. The sitting areas are pulled off the street a little so you aren't right next to all the noise of the passing cars (not that there are many on that street anyway) and it has this cafe setup. No, not that Starbuck's always-on-speed-everyone-wants-to-kill-eachother-could-there-be-more-noise-in-here? cafe, but a cafe ambiance like they should be. It was quiet, free internet access, and very relaxed. Even the employees of the bungalow seemed relaxed and at ease.

This brings me to my third and final point, the staff. The staff here are excellent and they really add to the environment. I was greeted immediately by multiple, geniunely happy employees. Not that fake-smile BS happy that you get at most places, but that I-geniunely-enjoy-my-job happy smile that makes everyone feel better. The only other place I've met people who I knew were that genuinely happy while working was Pittsburgh Willy's, but check their page for that info.

Anyways, I really love this place and I will be back. Fresh, organic meals at these prices and sizes just don't exist anywhere else that I know of. Plus, this is one of the bets places to just sit, relax, and completely forget about work while on your lunch break. I'll just have to head back soon!"}
{"text":"I absolutely love this place! The employees are always friendly and welcoming. The food is fresh and tastes amazing!"}
{"text":"Disappointed that I have tried to come here twice in the past couple of months and both times, they have been closed.  Once on a weeknight evening - they were having a special group function and once on a Saturday - apparently they have changed their weekend hours.  Every other time I have been here, it's been really great with delicious food and a nice atmosphere."}
{"text":"Quaint place.  The coffee here has skyrocketed in the last year with the hiring of some better baristas and the use of better coffee.  This was our place to frequent in the Mesa area, and left something to be desired in the past - now it's little less than a go-to place, worth the trip.  Great eats here too.  The owners are incredibly friendly and are always open to a good conversation."}
{"text":"Almost everything was very poor. From weak coffee to almost no blueberries (one found) in their blueberry muffins. Then to top it off the toilet didn't flush and no paper towels or dryer. They're excuse was a wedding the night before. So open an hour later to make sure accommodations are correct. Buy more blueberries or make less. Simple yet so difficult for this coffee house. Until changes are made, We do not recommend this restaurant/coffee house. Thanks for reading. The Bike Chaplain"}
{"text":"Extremely cozy to meet with friends and spacious enough to appreciate the surrounding area. Whether outside on the patio, or inside nuzzled with books and welcoming couches, you can enjoy your specially crafted teas, drinks & food."}
{"text":"I just needed breakfast close to work and there weren't many options so I just came here by chance and I'm blown away. I haven't had coffee this good since Japan! I like that their sizes aren't pretentiously named and the cafe itself is mad tea party themed. But the true hero is the coffee, perfectly brewed and delicious! Highly recommended!"}
{"text":"My early morning savior - a large, ice cafe mocha with a straw.  I work in the neighborhood and love taking a little break to walk over to Inside the Bungalow.  Everyone there is friendly and cares about their customers. Funky and relaxing, there are little private areas to sip your beverage and nibble on a little nosh. Stop in and get to know them and their coffee & tea selections.  Ask about their yoga classes. But don't take the last apple danish...that's mine. ;)"}
{"text":"Rude, rude, rude, how does this place stay in business. With other coffee houses close by, try them. Way cute location, but the owners are so rude we will not be back."}
{"text":"Looks cute and hours say until 5 but they ended up being closed-boo! Looks like an old house converted to a coffee shopm?"}
{"text":"Very kind staff, I was instantly greeted upon entering. Good pricing on their coffee drinks. Free wi-fi and a very relaxing environment inside. 

chatty staff interact with all patrons. You folks in mesa are lucky to have a place with good coffee AND good service. I live in Seattle, and while we have good coffee, we don't always have good service. the food looks amazing! I will have to come here when I am actually hungry sometime."}
{"text":"Suggested by a family member -- friendly and gracious service, fine tasting coffee, and a very comfortable environment. Highly recommend!"}
{"text":"I came here for the first time before class with my boyfriend. I ordered a Fiji green tea and he ordered some coffee. Both were very good. I really wanted a salad and was able to customize it with no problem :) The staff was very nice and attentive, it's a hidden gem in my opinion. They have wifi, perfect place to read/work/study. It wasn't noisy when we were in, we definitely plan on coming back! :)"}
{"text":"My favorite place to get coffee! They will remember your name and they are such nice people. It is in an old historic house in downtown Mesa where they offer yoga classes as well. The courtyard is an excellent place to relax when the weather is nice. They know their coffee, and they have some great healthy lunch options. Check it out, you'll love it."}
{"text":"The most adorable coffee spot in Mesa. We walked past  lo-fi which I found to have a really cool interior. However it was bit too hipster for my Mom and I thought maybe it was a little dark and loud for Chemistry studying. So we searched on and found this shop to be the perfect compromise. The ambiance is magnificent with quirky old furniture, alice-in-wonderland themed, and there is seriously something unique to look at with every turn. The cappuccino was alright but the place will make me want to go back every time I visit my grandparents in Mesa!"}
{"text":"This is a great locally owned spot for coffee and homemade treats, breakfast or lunch. They have a Yoga studio also although I did not have the opportunity to experience that. There is plenty of seating inside and outside and they offer free WiFi which is really nice in such a friendly and relaxed atmosphere. They are only open until 3:00pm on weekdays and closed on the weekends though which is a bit of a bummer."}
{"text":"I stopped in here yesterday while I was working out in Mesa. I was confused at first cause my GPS said it was called Coffee Talk, but the sign out front told me otherwise. Now, reading the reviews, I understand. 

Anyways, I didn't stay too terribly long at this place but I loved the expansive front patio with lots of furniture. And I didn't venture out back but it looked like there was also seating on the back patio. The house and the surrounding area is exquisite. 

I had an Iced Americano which was really good although I didn't like that it was in a styrofoam/styrolean/whatever cup...it kind of reminded me of cafeteria coffee...but I think I can get over the enviro/bougie/green thirst in me and let that one go. The barista was super friendly and told me that they do yoga there as well...which made all the 30something, spandex sporting, blond women out front make a whole lot more sense. 

All in all, good coffee and beautiful atmosphere to read or chat with a friend in."}
{"text":"I found this place on yelp while trying to look for a nice coffee shop to just hang out with. I really liked how it was in a house. But it felt so empty. But then again I did go on a Monday afternoon. The coffee was good and it was just a cozy place to chat and hangout :)"}
{"text":"I was asking about the pricing of coming for a class and the woman was so unfriendly and impatient with my that I got instantly turned off. She told me the pricing for September and when I asked about October she said in a very nasty tone, \"why do you ask?!\" Shocked, I replied \"because I wanna take a class.\" What an awful way to treat customers especially when you are representing a business that promotes peace."}
{"text":"I LOVE THIS PLACE! First off, it's like walking into a book when you walk through the door. It's so cozy and homey...... sigh. I wish I could be there now.

They have great coffee, tea, meals, and little snack/desert bars. TRY THE MAGIC BAR!!! SO GOOD!!!

There yoga classes are also great! 

If you ever get the chance, go!"}
{"text":"I am torn writing this review as the place is cute, food was pretty tasty and some of the service was good. We visited today after going to the museum and had some uncomfortable interactions with the female owner.  Our group was sitting in the back room with our kids eating our food and waiting for more food to come. The female owner swooped in taking the toys from our children saying that they were another customer's toys. The room we were in had a table filled with kids toys and books, so it seemed like they were there for customers to play with and she only took the toys and left the books. Then when I asked her for 2 additional plates after she brought our food, she looked at me like I was out of my mind, stood silent for awhile and said \"i can do that\"... So strange. After we left, part of our group was still eating and the woman came back, began stacking chairs and vacuuming while they were sitting and eating.  Soo rude!  We will not be returning."}
{"text":"I went to an early morning yoga class yesterday and it was absolutely fantastic! I was greeted at the front gate and guided to the yoga studio. Cute studio space and very clean. Carrie's class was amazing! She is a great teacher and very knowledgeable! I am already looking forward to my next class at Inside the Bungalow!"}
{"text":"My sister got married here tonight. I'll start by staying that the venue is gorgeous. There is not a lot of parking so just plan on that. I am giving this place a one star simply because the owner Betty was terrible. She was cold and unkind. At 8pm when the part still had one hour, she started going table to table dumping out drinks and cleaning up. It Made the guests uncomfortable and my sister (the bride) felt anxious and started cleaning up and asking others to do the same. I thought that was unprofessional. She was also drunk and smelled strongly of alcohol. Not that I care if you're drinking but perhaps that altered her mood."}
{"text":"I will never return here and I highly suggest you avoid this place of business. Similar to other reviews I have read, my co-workers and I have also had very rude and unfriendly interactions with the female owner. I met here for a business meeting with five other co-workers. A few of us purchased items, and a couple of people in our group did not. This was the third time over a few months, that our group had met here. Every single time, the majority of our group ordered pie and/or coffee, so our group always had paying customers and we had a quiet meeting in one of their side rooms, bothering no one. We had noticed that each time, the owner was never very friendly and acted as if our being there was an inconvenience. This specific instance, the female owner confronted us right away and said that it is rude to bring in outside drinks (two people had brought their own drink this time). We apologized and responded to her very respectfully. After our meeting, the female owner asked what company we were with, and then proceeded to tell us we were no longer welcome to have meetings there. She clearly has no interest in earning or keeping anybody's business."}
{"text":"I absolutely love this yoga studio.  There isn't a teacher there I don't like.  The ambiance is fantastic and the price is just right. If you don't live in the area it's still worth the drive.  

After class enjoy a latte or snack in the cafe. Bring a book and sit on the patio it's gorgeous there."}
{"text":"Been here twice. Vastly different experiences; the first was five stars, and the second was 0, so I'll average it out to 2.5 and round down.

I found this place via yelp, and I have to say I was not let down by the yelp reviewers who heaped praise on this place. Fresh, healthy food; lots of seating options including couches for lounging, tables for having lunch or doing a little bit of work, free wifi, and a very unique setting that's uncommon in the east valley. On that visit I was 100% satisfied; ordered a sandwich and sat for an hour or so at a table in the back.

I raved about it a few times to my wife, knowing she would appreciate the garden vibe of the place and its healthy options. So one day, I convinced her to stop in and try it. She is 9 months pregnant and very uncomfortable, and was meeting me there with our hungry toddler in tow. Having just come from a grocery store with two small items that needed to remain cold, we were in an admittedly uncommon situation - needing to find a way to keep our cold food cold for the 20 minutes it would take us to have a quick sandwich. 

I chose this place that day because I remembered the great mom-and-pop vibe it had, and thought if anyone in the area could accommodate our need to refrigerate these two things (the size of small lean cuisine boxes, factory sealed), it would be these folks. I also had the realistic expectation that there might be some health code rule against it or something, so I politely asked, explaining that if we couldn't keep our food cold, we would have to leave. The owner was downright impolite - she had two large coolers/refrigerators, but said they were full of 'her food.' That was that. I explained that we just had these two very small items and if we could just borrow some space for a half hour, we would have a $30 lunch... she then held up a separate, portable igloo cooler that would have been perfect for our items, but still inexplicably said no. Another customer piped up and suggested a plastic bag with some ice in it, which would also have worked, so we both looked to the owner, who just said no and went back into the kitchen. 

It was honestly such a strange interaction, and goes so fully against the grain of how a locally-owned small business tends to act toward customers, that I have to boycott this place and recommend you do the same. Sure, they have a nice concept, but there are other places around that serve good food in a nice environment and who will treat me better. It seems like I'm in the tiny minority here on Yelp, so perhaps I caught her on a bad day. A very bad one."}
{"text":"Stopped here real quick for lunch and was very happy we accidentally found this place. Felt like a house inside, magazines.. Books.. And post cards you can buy. Every room had a different feel to it. After we ordered our sandwiches we opted to eat outside because we had lil ones and the weather was nice. 
Wasn't expecting much but wow ! Loved my sandwich! I ordered the ham and brie. They Didn't skimp on the meat and what an interesting combination of ham, brie ,bacon, cranberries, and Dijon sauce on ciabatta. My friend ordered the club and she said it was great too. Really liked the chill quaint atmosphere and the good sandwiches:)"}
{"text":"My experience here was a bit unique...I came as part of a Wedding Expo event with my sister, mom and aunt. The outside of this place is nice and relaxing, tables set up at the event to sit and relax, especially on a nice day. As a note, if you are handicapped or have trouble walking, the ground here is really uneven and can easily trip if you're not careful. My mom uses a cane to walk and had to help her several times just to walk on the property. There are also some stairs too. Guess that's part of the old home charm...

Bungalow is set up like an old home and when we walked inside, we saw a fire place to the left and a \"dining room\" to the right. The coffee shop is set near the fire place and is indeed very charming. However, we were a little put off when we tried to order black tea as a gift to someone who loves to try local coffee shops. The cashier told us he wasn't able to sell us the tea. Umm what?! I mean I know it's Sunday but why be open if you can't sell all your product(s)? We then made our way to the \"backyard\" and loved the ceremony type set up. In my perspective, if you are looking to host a casual event with a unique set up, I would suggest Bungalow. For more upscale events, I would look elsewhere."}
{"text":"Found this completely wonderful little spot off Main St in Mesa, and was extremely happy with everything.  Really good coffee, a great egg bake and delicious banana bread. Then there is the building... a magical old house with a ton of character, beautiful outside grounds and comfortable seating everywhere. CNN was on (grateful that it wasn't Fox) though a little music would be awesome too!  If you have a urge for coffee and a little happiness to add to your day, it is worth a trip to Main St."}
{"text":"Update your darn hours. They close at 2pm, not 9. Was really looking forward to trying this place out."}
{"text":"I've never had anything but good experiences here, short of long waits for food when it gets busy.  It is a little tight if you plan to come with lots of people or kids (stroller parking outside) but very quaint and homey inside.  I would recommend this place to anyone looking for a good cup of coffee and a unique experience."}
{"text":"Sorry, I can't help still calling this Coffee Talk, but no matter; everything but the name is the same. Coffee Talk, ahem, I mean The Bungalow is a funky arts-and-crafts inspired coffeehouse. Try the Green Tea smoothie or a cinnamon and pepper-spiced Mexican Hot Cocoa. Mmm!

I love this little gem, and really have nothing else to add to Mike W.'s exquisite review, except Amen Brutha!"}
{"text":"I LOVE Inside the Bungalow! Where do I even start? First of all, Mike and Betty are the sweetest couple EVER. Second, their brownies are the BEST I have EVER had, seriously, the best! 

For lunch, I like to get the Turkey and Brie sandwich, or the Chicken Salad. All of their food is fresh and made from scratch and it's all amazing. 

The patio in the spring and fall is to die for. Love this place!"}
{"text":"I was determined to have my wedding here until I read the reviews on google and yelp. On separate occasions I brought my father and future mother-in-law to scope out the place. Both times I was greeted by such coldness from the owner. I was treated very kindly up until I signed the contract and delivered the deposit. I just had a very bad feeling about this place. I since changed venue location. Of course the deposit is non refundable. I think it is a small price to pay for my sanity and happiness."}
{"text":"If you are interested in random acts of RUDENESS, this just may be the spot for you. 
The owner and his wife were blatantly unfriendly to my friend and I, so much so that we left the premises. 

THE OWNER SHOWED BLATANT RACISM TOWARDS MY LATINO FRIEND.

stating that \"you people need to go back to your country\" 

I legitimately was looking for the prank-show TV cameras to come out. Nope, just sorry owner and an even worse human being.

We will not be coming back."}
{"text":"My review might be a little biased because I'm sitting in Inside the Bungalow on a beautiful Tuesday afternoon in May.  There are maybe 4 people here so naturally it's nice and quiet.

I used to come to Coffee Talk all the time when I was a pretentious high school student.  I recently moved back to the East Valley after a 6-year hiatus and I'm trying to find great new spots to rival the places I loved in the other places I've lived.  Inside the Bungalow is definitely an oldie but a goodie.

Great prices! I'm a bargain hunter and the drink prices are excellent.  This place has a ton of ambiance... Very funky and comfortable.  I just got an iced black tea for $2.16 (+free refills) and it's delicious. It doesn't taste like a normal black tea but has more of a peach flavor to it with no need for sugar.

They also have a great outdoor space and FREE wi-fi.  The only downside is they have a $4 minimum on credit/debit.

I can't wait to come back to have lunch and try some of their coffee.  Their food prices are a bit pricey for me but considering how impressed by my drink I am, I think it will definitely be worth $8 for a sandwich."}
{"text":"Good little place for coffee or lunch.  I have had several meetings at this place.  The food is good, the drinks are good and the service is good.  It is kinda hidden away in downtown Mesa, which I like.  The prices are very affordable - its worth a try at least once!"}
{"text":"Not sure why, but I feel a bit like I'm in a fairytale land when I walk into this place :) Surely the 7 dwarfs or the mad hatter are sipping tea in one of the many nooks & cozy corners!

The loose leaf tea is great. Take a moment to open up the containers & take a nice big ol' whiff before you decide on 'the one'. The best one as of now in my opinion also doubles as aromatherapy, lol! It's black tea & coconut, yum!

The food is all made from scratch & so far I know that the Bungalow Salad, Curry Chicken sandwich & the Enlightened One sandwich are all FANTASTIC :)

Add to all of this that you are in a lovely historic home & that the owners & employees make you feel like you are a wanted & welcomed guest & it all adds up to a truly relaxing & delightful experience.

P.S. they offer yoga if you want to work off your food OR make room for more ;)"}
{"text":"I feel like I'm home here. Perhaps it's because it was once a home. This big beautiful bungalow is owned/managed by some of the most sincere and friendly folks I've met in the valley. This shop is so cozy.

The whole place has unique and inviting ambiance. The furniture is unique and comfortable. If it's nice outside there's a beautiful courtyard with comfortable outdoor seating for relaxing.

Awesome little place, I'm a regular now!"}
{"text":"It once was the absolute spot to be for a cup at most anytime of day. Small acting troupes would hold dramatics in the front and back patios at seven, eight, nine o'clock in the evening. The garden was large, lush and not a spec of harsh Arizona sunshine would find its way to its lovely front patio. 
     Coffee was... hell I don't even remember! I went there for its unbridled warmth and awesome hours. Art, drama, music... a fine establishment to indulge all things one wishes they had in a local coffee house... now... I have no clue. I've been back once and would/ will go to lost Dutchman every time from here on out. Screw you bungalow. You'll never be coffee talk. You suck most hard and I sincerely hope you go out of business for destroying a vital part of my small city's downtown area. 
    It was a small library, leave a book take a book! F-U snobby turds! You should burn some patchouli and sage! Friggen yuppie scum!"}
{"text":"I own a coffeeshop so this comes as a qualified review - their coffee is awesome!!!!! It's an old house... Feels like you're hanging out in someone's living room. But decent breakfast, charming property... And a unique experience I'd say."}
{"text":"If your are a \"Soccer Mom with a BMW\" you will see all your friends there. Better than the STARB, nice old house. \"Yoga & Kaffine\" ?

 ba jern daw
Liked it when it was Coffe Talk  it is still ok but has been yuppifyed..."}
{"text":"I'm here again, and was greeted with the same very friendly service.  The atmosphere is was brings me back.  The coffee shop is set in an old house; it's very cozy.  There is also an ourdoor seating area with a nice complement of shade trees.  The place is very clean and the coffee \"yummy!\"  Tried the Iced Mocha today, and it was a good choice.  

Parking can be limited depending on the time of day.  Worth trying!"}
{"text":"After I wrote my initial review, the owners emailed me saying that holiday hours were on the website. While I didn't see them when I went before, I could have been in a hurry or just didn't know what I was looking for. Please do not base your opinion on my original review but try it for yourself. However, I still think a sign saying that they weren't open at that time and why would have been extremely helpful, especially when they still had the original hours posted on the gate."}
{"text":"love this place! 1st time here, had an iced coffee and a piece of coffee cake (YUM) both were great, and service was great also!"}
{"text":"Do you know why there are zero stars checked?  BECAUSE THIS PLACE IS NOT OPEN ON THE WEEKENDS

My life plan:  \"vacation\" studying at new and exciting coffee shops and bars with the BDF (best drink friend, which is not the same as bast food friend) while we work on the weekends.  Two times I tried to go her, and two times I was denied.  I thought the closure was temporary the first time I went.  It was Historic Homes tour day... so I thought the private event was the reason it was closed on a saturday.  But this weekend, low and behold.... I still could not go!  Closed!  Every weekend!  No people in the old town componenet of Mesa -- which it too bad because it has a kickass yarn store and tons of potential.

Will add stars if my impending weekday visit really knowcks my socks off.  A penalty for th no weekend service will remain."}
{"text":"One star because the place is cute. A second because  the coffee is decent and most of the staff is very kind including the male owner. That is it, because the female owner is very rude and seems to resent having people walk in to her cafe. Apparently, this is a habit of hers, so I don't believe we will be back. Shame really, the place has solid potential."}
{"text":"What a pleasant surprise! Ran across this place on a work trip to Mesa and it was truly a hidden gem. The hours stink but that didn't really matter in our situation because the coffee shop we hit in the afternoon conveniently had opposite stinky hours. I had a great decaf americano and some sort of tasty egg thing. My co-worker got a sandwich and a breakfast shake. Great people, awesome atmosphere, and tasty drinks and food. If I'm ever in Mesa, or Phoenix, again I'll be sure to be back!"}
{"text":"Great food, people, and environment.  It's such a cute and peaceful place to eat lunch with clients or friends.  I love taking people from out of town to the Bungalow.  Everyone loves it! :)"}
{"text":"Excellent sandwiches and friendly service in a historic place! 
Wife had the curry chicken sandwich and and I had the ham and brie sandwich, both of which were very good, well crafted. The mocha drinks we had were ok, served too hot which tends to kill the flavor (or just burn your tongue).
Overall I found the bungalow to be a cool, quaint, little gem which is unique for AZ. A great place to relax and have a conversation, play a game, or read a book.
*Worth noting: the gentleman working the day I was in with my wife and children was very friendly and took the time to make fresh curry chicken for my wife's sandwich as well as a off-the-menu sandwich for my 6yr old (not that it's complicated, but worth noting)."}
{"text":"I worked at a nearby high school a couple years ago, and Inside The Bungalow was always my go-to place for yoga, lesson planning, or just respite from teenage angst. There's plenty of space, inside and out, to work or meet with friends, and every single employee was always sweet and helpful. Indoors, you've got a quiet, cozy space, while outdoors you've got an elegant porch and patio.

The yoga studio and lessons were all fantastic. The space was tranquil, the teachers so helpful, and the class sizes were always small enough that--especially for me as a beginner--I felt I was getting the attention and direction I needed.

I have since moved from Arizona, but I wish I could make a Polly Pocket version of this place to take with me wherever I go."}
{"text":"This coffee shop is just what you need if you are having a stressful day.  When the weather is this beautiful it's a great place to grab coffee with a friend or work outside the office for a few hours.  They have a great menu and wifi.  I've been coming here for years on and off and every time I come I ask myself why I have not been more often!"}
{"text":"Love it. The decor is quaint filled with interesting knick knacks. Had a mocha and blueberry muffin both excellent."}
{"text":"Spooky bit of history: Apparently this house is haunted by the Openshaw family, and people have reported seeing the ghost of a man and young children roaming around the grounds! 

I ain't afraid of no ghost! Actually I didn't even know this place was haunted when I ate here and I only found out after mentioning it to someone who knows quite a bit about the history of downtown Mesa. 

Ghost adventuring aside, this cafe is such a charming place to sit and relax. The converted home has many rooms to enjoy your breakfast or lunch in, and the patio has lush grounds that make it a welcoming place to enjoy the outdoors while drinking or eating something from their menu. The atmosphere is reminiscent somewhat of what you'd imagine the Secret Garden would look like.

After browsing through the menu I decided on an iced almond milk latte and spinach, cheese, green chile egg bake. The egg bake was premade and took a few minutes to heat up. The center of the bake had soft and fluffy eggs with ingredients that meshed well together. I would have liked some more seasoning but adding some Cholula to the bake helped with the flavor. The edges of the bake were rubbery hard and too chewy for my tastes though. 

The latte was decent and I like how there are multiple options for sweeteners available.

The food and drink were average, but the main stars of the show are the beautiful grounds and adorable rooms here. So go for the lovely atmosphere, and watch out for those ghosty Openshaws!"}
{"text":"The hours are now 6am-3pm M-F, they are closed on the weekends.  Since the hours changed I can no longer hang out with a cup of tea and a yummy dessert.  Such a bummer because the staff is super nice and welcoming.

Robin's Thursday evening restorative yoga class is the main reason I drive from central Phoenix out to Mesa once a week.  She is an amazing soul and makes even the newbies feel at ease.  She talks you through letting emotions and tensions go with each breathe and reminds you that you are there to restore not only your body but your mind.  She teaches yoga at other studios and private too...I seriously would follow her anywhere.
{Love}
https://www.facebook.com/pages/Robin-Yoga/153963341309603"}
{"text":"I've only enjoyed the coffee end of this multi-faceted business, and it's quite good!  Often, independent coffee houses offer up a cup of weak, icky coffee, and that's hardly the case at Inside The Bungalow. The patio is so relaxing, and beautiful!"}
{"text":"Love the delicious sandwiches here, they are fresh and tasty. I've not had any tea yet . The owner is a lovely person who seems engaged in the DT Mesa community, which is important to me. It's hard for me to get there when its open. Sundays would be awesome! And later too, I'm always seeming to be driving by face sadly pressed to the car window looking at the hours of operation... A little dramatic but I am disappointed :) I highly recommend this a a cozy unique place to go in down town Mesa ."}
{"text":"My favorite spot to eat in Mesa! The atmosphere is cute and they make great coffees and smoothies. They have a turkey sandwich with pesto and avocado that I dream about. It's right downtown so hit this spot up if you're visiting the arts center or a museum."}
{"text":"While the place itself is comfy and cozy (both inside and out), I do not see myself returning. I ordered a turkey sandwich and hot latte. The younger guys were friendly enough, but the two older workers (I assume the owners) were not. They made no effort to be welcoming. A blank stare and an almost angry/annoyed expression sat on their faces. The food was not anything amazing. A simple bread with turkey, tomatoes,lettuce,and pesto with a side of four bean salad. The side was extremely small and the beans(kidney,black,green bean, and chickpeas) were all from a can. The latte was 1/4 liquid and the 3/4 foam which explains why my large looking cup was so light."}
{"text":"This place has cute decor and a cozy feel. The outside is also filled with antique patio sets and beautiful landscape. Unfortunately, I am giving them 2 stars because despite how many times I've been there (over 5 times now) I still receive the same ignorant and horrific customer service. The owner and her staff are rude. They are also expensive and every meal I've tried as well as my guests has been awful. The coffee is disgusting. Disappointing! Never again! 

Update:1 star is rating customer service and food/drink 
4 stars for interior/exterior"}
{"text":"This place is a gem! I've heard about it from many people and I finally made my way inside. It feels like you're a guest in someone's house. Very comfortable. Great prices. AJ can whip up a mean mocha. And the food was delicious. I'll definitely be making my way here more often. A great place for brainstorming meetings or to just meet friends and have a nice cup of coffee."}
{"text":"This charming place is a perfect spot to sit outside and enjoy a beautiful Saturday morning and a great meal.  Going inside we were greeted by the friendly staff and instantly felt welcomed.  We shared the turkey pesto sandwich and potato salad which were both delicious!  The friendly woman who had taken our order brought out yummy potato chips for my son, a nice gesture as we hadn't ordered or paid for them.  The desserts and breakfast casseroles looked tasty, can't wait to go back!"}
{"text":"Love this little place. The coffee is always fresh and they have some yummy salads, sandwiches and sweet treats. I'm here about once or twice a month and always something good to enjoy."}
{"text":"I only go here for coffee.

This place is in a very different, very hip, and very old building. This is a truly unique atmosphere - not your daddy's starbucks!

The coffee is excellent and the way the former home is divided into dozens of different sitting areas is really cool. They have a HUGE patio in front AND in back.

Only wish they served coffee after 3pm."}
{"text":"As an update to my previous review, I have since learned that the staff here was extremely rude to my wedding coordinator and the caterers on the day of the event.  Very sad to learn that as I loved the place.
Additionally, I had to contact them weeks later to determine the status of my security deposit.  At the time they explained to me the reasons why I was not receiving any of it back, and I won't argue that with them, it was in the contract; however, send me a letter or call me and let me know.  I shouldn't have to track you down to find this out."}
{"text":"Inside the Bungalow is one of the many Downtown Mesa gems! I found this coffee shop Yelp and boy was I happy when I discovered Inside The Bungalow! Upon arrival I was greeted by an amazing house where the coffee shop is located. You feel as if you have stepped into some sort of story book fantasy house. The outside is covered with brick pavers, waterfalls and tons of greenery. The inside is decorated beautifully with comfy couches, wooden floors and tons of room to sit down and read a good book or just catch up. This coffee shop is unique and down right cute. You will be blow away by the amazing staff and delicious coffee/ baked goods. If you ever get the chance check this place out!"}
{"text":"The owners, Mike and Betty are two of the most miserable human beings I have ever met. I was the coordinator for a wedding here and not only did they treat me like absolute garbage, but they flat out stole money from my bride and her family. We were given a two hour window for set up with zero wiggle room. Tables had to be exactly where Mike wanted them, food service/bar could only be in one place and after about 30 minutes of setting things up they come and tell me we can't have live music. It started off as being because they had neighbors, then it was because it wasn't cleared with them first (which it was), then they said they would lose their event license, yet while I was trying to have a civil conversation with Betty regarding music, Mike was telling one of the musicians he could play if he paid Mike money. Seriously dude?! After multiple conversations and having to involve the father of the bride (who was the only person Mike would work with because apparently being young and female means I know nothing) they agreed to have the few live music performances that meant the world to the bride and groom. At 9:30 Mike came out yelling to clean up and get out because we had to be off property by 10. So we wrapped things up, cleaned everything perfectly and made it off property by 10. When the parents of the bride went to collect their security deposit Mike and Betty refused to return it, stating they had broken their contract. All in all, super cute little place with tons of character, but I promise you that your life is better off without interacting with the owners. If you're considering using this as a venue please just know they make life truly difficult when it's supposed to be an amazing day!! And if you do decide to use them, at least get a planner so they can take on all that burden and you can enjoy your wedding day!!"}
{"text":"My mother decided to go here with coworkers for their lunch break because the food is diverse and can suit all their dietary needs, such as gluten free, corn free, and vegetarian. This used to be a place they went to often to eat a good meal. Too bad for the owners, they have lost the business of a large department of regular customers. 

Why is this do you ask? Well the story is a very dramatic one that does not reflect kindly on the owners of this little joint. Looking at the other reviews on this page, I would say that many other customers have received the same kind of treatment. 

The owner was atrocious. I'm sorry, but if you're going to be in an industry where you serve food and you have earned a reputation, chances are you're going to get a lot of customers. If you cannot handle that, you should probably close shop or hire staff to help out in the establishment. 

Today, the owner decided to tell my mother that they were not able to serve a party of 6 or more, and if they ever wanted that, it was required that they call 24 hours in advance. No where, not on the web page or in person, is this policy displayed. It is entirely new to our knowledge. Not to mention, they were not a party, instead they were a group of coworkers who happened to go to the same place at the same time. Coincidence? Not particularly when your place of work is close by. 

Two of her coworkers were taken aback by how the owner nastily told them about this policy and decided immediately to eat elsewhere. My mother and the last three coworkers were hungry and wanted to eat immediately. Upon seeing that they were staying, the owner decided to tell them that since it was only her husband in the kitchen, the food was going to be served very slowly. It was almost as if she did not want them as customers and was trying to get them to leave. 

They decided to order anyway, there was not much time to go elsewhere after the nice long discussion with the owner. My mom was the last to order, and upon receiving the change back from her purchase, the owner decided to rip into her. She explained once more, nastily, their policy of parties. My mom explained, once again, they were not a party. They were coworkers that were coming in for lunch. 

After this, while they were sitting at the table, the food for my mom was served first. She had to get a to go box because the service was so slow. She followed the owner back to the front to get a box, to which the owner decided she was hiring my mom without pay, and asked her to take the orders back to her coworkers. Strange thing to do when you're supposed to be the server. Couldn't even do her own job. 

I don't recommend this place to anyone. My own personal experience was not good there when it was like the world was over when I didn't want cashews on my sandwich and preferred peanuts instead. They really need to work on their hospitality skills."}
{"text":"Hidden Gem Downtown Mesa, Great Establishment and I had one of the best Chai Tea Lattes W/ Hazelnut that I've ever had!"}
{"text":"Perfect atmosphere, perfect staff, perfect location, perfect drinks. Why am I here instead of there you ask? I have to make $,otherwise I'd be at ITB."}
{"text":"Such a cute little spot in downtown Mesa. Usually it's the owners working, and they are always super friendly and willing to make modifications to the menu items if you need them. You can tell they have a lot of regulars, which is always a sign of a good place. Healthy menu options, and just the right portions to satisfy but not overfill. My boyfriend works nearby, and we love to come here when we meet for lunch. Comfortable seating inside and lots of outdoor seating when the weather is nice!"}
{"text":"I am updating my previous review after recently attending the Farm Sanctuary charity event. Inside the Bungalow generously donated their beautiful backyard facilities and yoga studio for this benefit. There appeared to be more than ~100 people there and the staff remained incredibly laid back and warm while having two functions going on at once (Oktoberfest out front and Farm Sanctuary benefit in the back).  I am a fan of the shop for food, yoga, and massage and now I can see why people come here for events. It is charming and the people are wonderful to work with!"}
{"text":"I think I've exhausted every possible thing you can do at Inside the Bungalow- drink coffee, do yoga, go on a retreat, & have a wedding! I guess I'm well versed in what they have to offer! ;)

A couple of years ago I was searching out for a place to have my wedding. I had gone to Inside the Bungalow to drink coffee and enjoy their fabulous outside seating but never knew they did weddings. One Saturday I stumbled in early in the morning and saw them setting up for a wedding in the back. I knew immediately that I was having my wedding here. 

I can't say enough good things about the owners, Carrie and her mother. From the minute I expressed interest in having a wedding, they were nothing but generous, thoughtful, and helpful from start to finish. They were so accommodating and easy going, it felt like I was planning a wedding with a best friend instead of a business owner I hardly knew. It made the process seamless and pretty much stress-free from start to finish. 

In terms of their coffee and yoga, fantastic! Since I moved to the downtown Mesa area it's become my regular place to stop in, have a drink, and take a yoga class."}
