{"text":"Ordered take out from here 3 times and it was awful every time. I work in the industry and have never given a yelp review before bc I am not one to complain but the food was awful. We spent 20 dollars on fish sandwiches which weren't edible. We ended up throwing them away. No flavor the cocktail sauce was bad and we asked for cheese which we paid for and didn't get will never order again"}
{"text":"Have been here now about 10 times in last 6 months.  What great food, service and value. Plan for a doggy bag. I have ordered something different every time and have not been disappointed."}
{"text":"Really bad Experience!!!  I ordered Chicken Romano, which I've had many times at other places.  When the waitress brought my dinner 
I had to look twice to see what it was!  It looked like an omelette with chicken in it.  I took a bite and realized they cooked the batter and then through tiny bites of chicken in.  The hostess/manager asked how our meal was, when I told her I would like something else, she said your supposed to squeeze lemon on top and that's the way it should look!!! I asked for something else, grilled chicken, safe right?? I got a flat piece of tasteless chicken that was so dry I took a few bites and was done.  I ate half my baked potato the waitress came and took my plate she saw I didn't eat that either.  When we got the bill I was charged for the chicken Romano! I asked the waitress so she got the hostess/manager and I was told all the chicken was 16.95 even if there was nothing on it.  No customer service no sorry you didn't like it!! They really didn't care at all!!There are plenty of other restaurants out there don't waste your time or moneys"}
{"text":"Food isn't that good it taste different every time no steady cook"}
{"text":"I recently tried the Interchange. There aren't many places left out that way so this is a real oasis as far as I'm concerned.  It has just the right mix for me; casual and very friendly and with some very good items on the menu.  Their fish sandwich lives up to Pittsburgh tradition.  The pasta is great too.  I think they make their own sauce. We had an appetizer that consisted of fried mozarella, shrimp, zuccinni, and chicken.  All of it was good but the chicken was out of this world.  Before I forget, the last trip we started at the bar, it was happy hour, and enjoyed $.99 Captain and ginger.  Can't beat that and the bartender was really friendly and accomodating.  if you find yourself East of Century III and wonder where to go, this is it."}
{"text":"We love it here!! No matter how busy they are we're treated wonderfully! The food is amazing!! Our waitress went above and beyond!! Just happy all around!!"}
{"text":"This is a great place tucked off of Rte 51.  Homestyle food is always fantastic, with plenty for a take home box!  Have not had a bad meal.  Staff is friendly and courteous.  Check it out!"}
{"text":"Off the beaten path, but decent food, and often has some great specials, especially for happy hour. Seems to be mostly regulars. Not bad if you're in the area but probably not worth going out of your way..."}
{"text":"I am not one to complain at all, however, I have experienced the worst customer service ever at this restaurant. 

When I tried to speak with the owner Frank, all he did was respond with \"How about you suck my \"bleeping bleep\" and never come back here again."}
{"text":"Have had their pizza a few times and it was fine, not great, but ok.  Tonight, we tried their Sicilian pizza.  I would say that 95% of the pizza was dough.  It almost had the nice greasy, fluffy taste of Pizza Hut dough, except way more dough.  There was very little sauce or cheese with just the right amount of pepperoni.  Some of the pizza was over cooked too and we were very disappointed with our dinner.  I doubt we will try there again."}
{"text":"stopped for dinner last night. place was crowded so we took a table in the bar. we were waited on by TIFFANY (the bartender). she was loaded with personality and a really good waitress. wife had really good scrod dinner in lemony butter, she love it. I had chicken parmesan it was great, but it was so huge  I invited TIFFANY to share it with me.(she was tempted) go eat and drink there and if your are lucky Tiffany will serve you. You'll love her."}
{"text":"What a hidden gem! Me and my family went here for lunch today. Terrific lunch buffet if you are in a hurry and want a quick bite.  Buffet had wings, puzzled, homemade wedding soup and chicken stir fry.  The wings were served dry with sauces on the side. Just how I like it.  My wife had a great chicken salad with fresh cut fries. Both owners greeted our table to ask how things were going.  Check out their web site. The dinner menu looks awesome. It's a bit hidden off of route 51, but it's worth the search."}
{"text":"I have been a customer of the Interchange for years.   The food is good, the family atmosphere is friendly, the bar is well-stocked, and the prices are reasonable.  They have a lunch special, Monday through Saturday from 11:00 to 3:00, any hoagie with fries for $5.95.  My favorite menu items are the grilled chicken salad, salmon salad (grilled or blackened), the fish dinners, the chicken or steak fajitas, and the appetizers (try the fried mushrooms !). And of course they have great pizza and pasta.  They have a vast selection of mixed drinks. 6 draft beers, and a variety of bottled beers.  If martinis are your thing,  the Interchange is famous for them.  They have more than 20 different kinds.  There are fancier places out there, but if you are looking for a clean, friendly, down-to-earth place with good, reasonably priced food and drinks, you must give it a try."}
{"text":"Food was good, decently priced, more than enough to take home for later. Ask about their deals! We did two steaks for $20. The steak was delicious and we got a free appetizer! Only reason it didn't get 5 stars is because the food didn't really match the environment. It was great food, well worth $10-12 a plate but it looked more like a sports bar. Furthermore, the table we were seated at was like a fold-able table and chairs that didn't even match the other settings."}
{"text":"Tried to get into a few places last night but everyone in Pittsburgh must have decided to take advantage of the weather as our usual \"go to\" places had 1 hour plus waits (Gianna Via's, Armstrong's, Pasta Too, and Bravo's).   We have heard about The Interchange Lounge from friends and decided to give it a try.  Below is a summary of both myself and The Birds review:

We we were both in the mood for some Pasta.  I had the ravioli and she had the baked pasta.

Pros:
1. Bartenders were great.  
2. Drink prices were super cheap. (And strong).
3. Waitress was very nice as was the hostess.  Also very attentive to our needs.
4. Food prices were very reasonable.
5. Short wait for a table (around 7:45pm on a Saturday).

Cons:
1. Red Sauce had zero flavor.  We both thought perhaps salt was missing.
2. Presentation was also \"different \".  Sauce was placed on the bottom and the pasta was placed on top without any additional sauce. Did not make for an appetizing dish.

 Neither Pro or Con.
1. Place reminds me of a \"social/fireman's club\".  I've had some great food at these places.
2. Parking can be tricky as you may have to back out onto the main road when leaving.

I always like to give a place a few chances and I am a pasta snob having grown up Italian with some of the best pasta/sauce/pizza makers (Gram, Mum, Aunts, mine :) so pasta and sauce is always a tough sale for me (although Pasta Too and Gino's in Greensburg get me).  

When I was leaving I did see a hamburger come out that looked pretty good.  However I'll have to go by myself or with someone else since The Bird is never going back."}
{"text":"I've gone to the interchange quite a few times over the years unfortunately this was my last visit.

They are consistent, they offer consistently poor service. The kitchen puts food out on time, it is the servers.

It took 20 minutes before someone came to get a drink order and bring menus followed by forgetting to bring 1 of the drinks for an additional 15 minutes  (while the owner was walking past me often)...at this point I almost left...

Now 35 minutes in we can put our order on, yeah! (as I was about ready to start gnawing on my arm because I was starving)

We order!!! Tick...Tick...

Drinks empty...water empty...no bread...no salad...no soup...still no refills...Tick...Tick...

1 hour and 25 minutes of sitting the owner comes offering bread and refills...wow! Yes please...she said our food will be out shortly and that our waitress is new and overwhelmed, we let her know the timescale we have been sitting there without soup, salad, or drinks.

Our waitress brought our soup and salad approximately 5 minutes later...you guessed it...we didn't even get to put our forks in and our dinners arrive.

The owner stop back after dinner she took one drink off of our bill, told us how terrible the waitress was and when we return an don't see her there we will know why, gave us two wedding soups to go. When we open the soup at home I found a chicken bone in the soup.

As a manager myself I believe in owning the service my colleagues deliver because it's a reflection of me then if something happens make things right along with coach and develop rather than throwing someone under the bus. Now that's just me but it made for a very uncomfortable situation making me feel like the girl would be fired because she messed up our table when in reality the owner was walking back and forth past our table all evening seating people and standing 2 tables away wrapping silverware and should have noticed what was happening herself.

As for service this was my 8th visit and as stated prior service is consistently slow."}
{"text":"The signature sandwich is fantastic. A LARGE amount of real roasted beef with aus jus. Also really enjoy the Sicilian x large pizza- perfect for feeding many children."}
{"text":"Been here several times always leave happy and full!!! Today staff was very patient with me as i changed my order.....and ohhhhhh am i so happy i did!!!!! Great meaty finger licking good ribs!....and i have never ordered mac and cheese from any restaurarnt.....i did thos time....frigging amazing!!! I am not the easiest customer but stacia our waitress was on top of it!!!"}
{"text":"The food is always good and so is the service we eat here regular have not had a bad experience the pork chops are a favorite of mine the prices are reasonable the owner and his wife are great people . It has a nice little u shaped bar"}
{"text":"Seriously the worst chicken and Pizza I ever had. When I complained the manger actually said he knew it was fine and told me to F off if I didn't like it."}
{"text":"First time here recently, but definitely not my last. This little gem sits on the side of the road near Rt 51 and 43 in Clairton PA. From the outside I was kinda scared, it def has that eerie \"Deliverance\" vibe, but we heard good things so ventured in. Inside was cozy and welcoming, in a no frills atmosphere. The appetizers we had were great- onion rings, mozzarella sticks, and fried zucchini- and all HUGE portions. The homemade bread and dipping oil was amazing as well. The owners introduced themselves which was cool, and they were so incredibly nice. I'd say 10/10 check it out."}
{"text":"EVERYONE in the area knows the interchange for its huge portions!!! The apps are half price everyday if you sit at the bar... Otherwise in the dining room, they are full price. You can order one meal to split practically. The prices are a little high on dinner entrees, but for this reason. Their breaded mushrooms are the size of baseballs no joke, and are delicious :) I tried the chicken Marsala last time and I cant say I'd get it again, but my boyfriends hot sausage sandwich was delicious.. he had enough left over for lunch the next day, too."}
{"text":"I've been here a couple times. The first time was not so great, the food just really had no taste/flavor...just really blah. That was years ago. A few months ago we visited and the food was so good!! So my husband an I went back this past week and the food was pretty good! Everything is made from scratch so some things take a little longer and you may get your food at different times but that doesn't bother me as long as the food is good. Server was nice and attentive. They have a large menu! The cheese sticks were awesome!! My husband had stuffed peppers and he loved it!!"}
{"text":"small neighborhood restaurant, fantastic fish sandwich combo, ( slender brown hair server work ing corner booth next to door saturday night, stood out as being senior server with class and style! !!!"}
{"text":"The food here was fine. My personal experience was not great, but everyone else in my party seemed satisfied and the prices were so low I can't complain. We arrived 15 minutes before they opened, and I understand that can be stressful for a hostess, but we would have been happy to wait outside. They offered to seat us, which was a nice gesture, but we then overheard 2 of the 3 members of the wait staff talking about how unprepared they were to seat us at that time and how it was an inconvenience. It was clearly stressing them out, and the whole situation made all of us feel a bit uncomfortable. Luckily, the 3rd waitress was much more relaxed."}
