{"text":"I meet the owner at a local restaurant, I was new to the area and he told me about his restaurant irie vibes Jamaican cuisine. So I had to check it out, I got the curry chicken over a bed of rice and beans, and it was absolutely straight from the soul! This food was so saviour and tasty I ate every bite. I would definitely give two thumbs up to who ever has a craving for some amazing Jamaican cuisine."}
{"text":"Boyfriend got me this as a surprise one day due to the fact that I been craving Jamaican food! He brought it one day then after that we went back everyday for a week for me and my family! Excellent food!"}
{"text":"This place is awesome they are always friendly. And the food reminds me of my grandmother. This place was hidden we never new about this place. We drove by it and stop and we have been going here ever since. This is also the only place that I could find roti I had it a lot in Florida. They are absolutely wonderful I love this place."}
{"text":"The food was very delicious and seasoned well. This is the best Jamaican food in the Charlotte area I found so far and trust I have been searching. The only problem I have is they are a little slow with taking orders but the food was truly worth the wait."}
{"text":"The food is here is so friggin good! The Finga Lickin title is a wonderful choice because that's exactly what I was doing as I was eating! I had the curry chicken combo w/ mac n' cheese & peas n' rice w/ a side of cabbage.... ALL OF IT WAS DELISH! I'm not exaggerating when I say I can't think of a better spot unless we're IN Jamaica!!! I like it better than Mama's, CH & Ty's Wings.. jus saying.."}
{"text":"The service was good, the food was amazing. I wish they would've turned on the music from the kitchen on for the dining area."}
{"text":"The food is very tasty. They had two different cakes on the menu. Lemon and carrot cake. Neither were in the house! I asked for a traditional rum cake and I was told it was seasonal. My response, tis the season! The bathrooms were sort of dreadful and tables were dirty. One thing they have to do is upgrade the ambience. The stars or for the food that we ate; oxtails, Ackee and salt fish, and brown stew chicken."}
{"text":"I've searched high and low for some authentic Jamaican food and this place has it!! The other Caribbean restaurants I have tried in Charlotte don't compare at all.  I have had the oxtails, stew chicken and fried chicken, I'm always pleased. Check them out and see for yourself!!"}
{"text":"My boyfriend and I decided we wanted some Caribbean food while visiting Charlotte. We used yelp to check different restaurants and decided to go with Irie Vibes. We liked most of the reviews and thought the food would be more authentic. We ordered our food and waited. I noticed the server was constantly talking to other people while making our food. When she said it was ready, I realized that there were 3 plates in the bag and not four. I asked her about it and she instantly became very rude as if I was in the wrong. She asked for help from another server and started talking about me ordering correctly the first time. I had to show her on her ticket that she wrote herself that there were clearly four plates and she left one off. I also noticed that she didn't write down the extra sides we asked for. Another lady from the dining room area came around the counter and told her that we ordered 4 and she only gave us 3.( I'm assuming she may have been an owner or manager). She saw her mistake after I showed her. I was so disgusted by her rudeness and her lack luster apology that I didn't even say anything about the sides that she forgot. Needless to say, the food was really good, but we will not ever go back because of her. She belongs in the back."}
{"text":"I got food for my mom & I. She got oxtails and Mac& cheese, I got curry chicken and yams. EVERYTHING IS DELICIOUS & well priced."}
{"text":"We got our food to go and it was ok.  They were out of beef patties, which was a little disappointing.  But at least we got our curry shrimp, rice and beans, cabbage, and Mac & cheese.  It was good food, but I think Caribbean Hut has this place beat!  It's a hole in the wall spot and you probably should do take out inside of dine in."}
{"text":"I've been to this place about 3 times and have enjoyed everything. The staff are always friendly and welcoming and the food is super delish . I particularly like that the plantains are made fresh . You really can't go wrong with anything here . I've tried the curry goat (spicy ) , brown stew chicken , jerk  chicken , rice and peas, cabbage , and all are delicious . This is my new go to Jamaican spot."}
