{"text":"Service was terrible. Food was ALMOST mediocre. This isn't the first time either. I thought Paninis was bad at this location.. This was worse. NEVER going there again. Waste of my money"}
{"text":"Meh. Average bar with average beer. Food average. I just got nothin much to say. It's not horrible by any means but I mostly stop by out of convenience."}
{"text":"Don't venture past the cheap draft  beer.   Even the  fried food left something to be desired."}
{"text":"I wish I could give no stars but it doesn't allow me.  I am very disappointed in the management at this restaurant.  I sit down at the bar with my wife and we order some drinks.  There is a \"seasonal beer menu\", that has one of our favorite fall beers on tap for $6.00 a pint.  My wife orders one and we ordered some food as well.  It was a nice night so we ordered a few more drinks and then we get our tab.  When we get our bill they charged us $10.00 a beer. No where did we see that price anywhere and we questioned our server. She said let me talk to my manager to find out why this happened.  The server/bartender comes back to say that it was a mistake that the menu should not of been out.  I have a serious problem with this explination because the manager couldn't come out to explain this nor did they make up for the mistake of overcharging us.  They didn't charge for the price they advertised and did nothing to make the situation any better.  The management there should of come out and talked to us and rectified the situation because it was there mistake.  Instead they made it seem like we made the mistake for coming there and ordering.  Unbelievable customer service never go there. Our server/bartender was very nice but the manager handled the situation the wrong way."}
{"text":"Hope for West Park that this place improves.  I was so looking forward to something other than crappy Panini's and was sorely disappointed last night (3/3/15).  Except that the bartender was \"perky,\" I would give this place no stars.  It was too loud in the bar (see aforementioned bartender), so we got a table.  She told us to sit anywhere, that they don't have a hostess.  We grabbed a booth by the window, well in view of the 2 servers.  We brought our drinks to the table, so maybe the one thought the other already had taken care of us; one cleared the the booth immediately next to ours, and the other took away the tab.  After about 15 minutes of no service and two other tables being waited on, the female of the two, walked over and while turning her back to us, said \"you guys are ok?\" I said \"no, we're leaving,\" and she said \"oh, so you're good\" and walked away.  REALLY????  Won't hurry back.  PS Ended up at Angelo's Pizza and it was fabulous!"}
{"text":"Overall, very good. Have been here many times during all situations- when it's slow, busy, day, night  and never walked away hungry or having a bad experience. I can see how this would not be great choice for vegetarians or those with specialty diets, but if you want a beer and a burger/sandwhich/wrap-- then it's just as expected. Love the patio during the summer nights!"}
{"text":"If I could give negative stars I would. One star is giving this place to much credit. We went here for my friends birthday dinner and a few drinks. It was the most awful experience ever. I would never recommend this place to anyone ever. For starters we were the only people in the place. A table of eight. Our server was the worst. We sat for at least 20 mins before she came over to take our order. When the food finally came out, all but one dinner came out. We asked for a couple refills and a few sides of ranch dressing while we were waiting for her food. She came back 15 mins later with the ranch and drinks. But still no food for our friend. She then blamed the kitchen for making the wrong food. When we were finished and ready to go. We all paid separately and all of us had credit cards. She said sheeorgot to charge my card. Took it back and charged it again. I automatically jumped onto my online banking to see that it was charged twice. When I brought this ti her attention, she told me to call back in the morning and it would get taken care if then. Uhm NO! After waiting to speak with the manager and got the situation fixed, we decided not to leave her a large tip. Working in the service industry myself I have never left a small tip before. But she didn't deserve it at all. As we were walking. Out she muttered under her breath \"f***ing B*t*hes\" completely uncalled for. Do ur job correctly especially when there is only one table and maybe things would be better for you. We will never be back."}
{"text":"We went to the Ironwood Cafe in Westlake. We had a party of ten. We were told the mixed drinks were $2.50, because it was Happy Hour. We all order several drink because the price was right. Our bills did not reflect the same $2.50 price. Our server did make adjustment to our bills, but did not correct the prices to the quoted prices when we ordered. I ordered the Greek Salad with the addition of lamb. After I took the lamb and peta bread out of the bowl, I had almost an empty bowl.  I had a bowl with 1/3 of mixed lettuce, no cucumbers, no tomato, no onion, a little bit of feta chesse, they forgot the peppers and brought some to the table. The price was $10.50. I just had a Greek Salad from Marco's Pizza which was 100% better then the Greek Salad for a lot less. My friend ordered the Smoke Buffalo Chicken. The dried chicken came without any sauce. We told the server we needed sauce. The Buffalo sauce never came to the table. All sides are extra. Other orders were wrong at our table, drinks were mixed up and hot meals were not hot. We will not be returning to the Ironwood Cafe."}
{"text":"Two stars for the bar, it is a place to hang out with friends for drinks and watching sport games. Foods are not bad but not good either."}
{"text":"Ironwood is a great neighborhood bar & tavern. It's a very comfortable, casual, friendly place ... with great service, reasonable prices and very good food. The nachos, wings, fries and burgers are some of the best around the Westside. The gyros (lamb) are excellent, better than any I've had around Cleveland. The patio is great and something to look forward to in summer weather."}
{"text":"After reading the Plain Dealer review, I was looking forward to trying this place. I ordered the pulled pork and asked the server how much the sides were since they were ala carte. She said they ranged from $1.00 - $3.00. When we got the check, one was $4.00 and the other was $5.00.  Did not care for the baked beans which are usually one of my favorites. My dinner was just ok. My husband got the fish fry which he enjoyed. The server was very friendly."}
{"text":"As out of town guests, our host brought us to this restaurant for their friday fish fry. My husband ordered the perch dinner and I had the perogies. Both were excellent and perfectly cooked. The staff was friendly and courteous. The happy hour specials were excellent and their beer list was extensive with many local beers.  The regular menu was typical bar food. The large patio looked very nice for outdoor dining in better weather. We'd definitely return for the fish fry and probably for a regular lunch/dinner as well"}
{"text":"Came on a Thursday night for the CAVS game! Busy but our server kept up with us about every 10 minutes. Thursday nights they have 2$ pulled pork sliders and 5$ pitchers which was awesome!!!! Now here I am trying the menu again on a Saturday afternoon; with some mussels and Riesling! I told the bartender I was here to watch Grey's Anatomy and have a few glasses of wine and she kept them coming while I listened to my headphones. A fan of this place! Love the patio, just wish they played the game through a projector onto the back screen!"}
{"text":"I can live with bad service and bored bartenders if the beer is cheap. I can live with expensive beer if the service is good and the bartenders are attractive. If you want to feel like you are being ripped off with every sip and love indifferent service this place is perfect for you."}
{"text":"Not a good place for vegetarians.  There's like 1 vegetarian thing on the menu. But the food is good and the French fries are delicious. Beware of one of the tvs though. There's a channel with gross stuff on it and it's disturbing while your eating"}
{"text":"I feel compelled to write a review to lend some reality to the overall rating, as a public service. This place should be on Gordon Ramsay's \"Kitchen Nightmares\". Almost raw hamburgers (although ordered medium well). Chicken pasta made with Velveeta, and with little or no chicken. Run away."}
{"text":"Pay cash per round. The barmaids will add extra drinks to your bill. Sad but true. Foods ok."}
{"text":"Awesome fries and great friendly bar staff, a fun juke box, and close to home :) I wish the front was open more bc of the nice big windows!"}
{"text":"My wife and I ate there the other night. The service was good and the price was reasonable for what we had gotten.   My wife ordered the fish sandwich,  which we thought was very small.  I ordered the Club sandwich which tasted wonderful and was so large, I had to take part of it home. It tasted great on the second day also. The  fries were also great and plentiful."}
{"text":"I think I'll need to have a little more experience with this place to confidently bump my rating, though I give the food an initial 4 stars...I think.  We came here for a birthday party, so my first experience was a little different from the norm, which is why I'm iffy on a confident high rating. When we arrived, we were incredibly hungry and wanted to grab a couple of beers and put a food order in as quickly as possible. When we snagged our server and got a couple of menus, we expected her to come back ready to take our orders. This was not so. We went to the bar and attempted to place them, where we were turned away because our server was heading our direction again. She completely overlooked us and we went on, hungry and parched, regretting not placing our order with force at the bar.   Anyways, when the party quickly became bigger than projected, we were moved into the \"back\" where there was another bar and more seating for us. When we sat down, it seemed as though there were 2 different servers checking on us and buzzing around the area in confusion. I'm guessing it was because the girl that was serving the party on the other side wasn't going to continue to serve us on this side. So, we patiently waited for someone to take our orders and even mentioned to a couple of people a couple of times that we wanted to place an order with them. We got a few \"one sec\"s, which turned out to be a good 15 minutes. Eventually when the official bartender (I think he could be called the official one...) came, we placed an order at the bar. I do believe that this place is more efficient when it's a normal everyday crowd and not a larger than expected birthday party, or at least I want to believe it.   I'd like to say all of the chaos was worth the delicious fish sandwich I had, but not quite. It was, in fact, one of the more impressive fish sandwiches I've had at a bar, but I was also famished and packing peanuts would have worked for me at that point. The fries were good, too. Pretty standard bar fries. But, the kicker for me was the cole slaw. I. Don't. Like. Cole. Slaw. I ate my little cup of coleslaw and loved it! But, like I said, this could have been the serious hunger convincing me that I liked it. The Blue Moon was Blue Moon: delicious."}
{"text":"This place is right down the street from my work, but only my second time being there.  Food is really good and huge portions and the beer selection is pretty good.  Service was great!  Inside is kind of dark, but looking forward to going back for a 'partio' this summer with co-workers."}
{"text":"I was excited to try this new restaurant that had popped up in a neighborhood that I frequent. The atmosphere was nice and our waitress was friendly. The parking lot was just as impossible to find a spot in as the last restaurant that resided there.  I had ordered the mussels appetizer and was pleased with the amount of mussels that came in the dish however the pieces of bread that were included were very dense and overpowering.  The burger that my boyfriend had gotten and it was nothing special .. that was until he asked the waitress for some BBQ sauce. She came over with a carrier of three homemade sauces and that is when the magic happened. The Sweet BBQ was absolutely out of this world.  When it came to getting our check the waitress dropped it off and took a good old time picking it up.  Overall I was a little underwhelmed the parking lot tiny, the food was average and the service could have been more efficient."}
{"text":"This bar/restaurant is so close to home. We go here every couple of months and the food is pretty good. The fish fry is tasty!   It gets pretty busy on Fridays during Lent. So be sure to grab a seat early!"}
{"text":"We went here to watch the game on Tuesday. It was our second trip here. All of our food was excellent and clearly house made. I had the smoked half-chicken which was on special for $8 (every Tuesday). Again, $8 for a house smoked half chicken! It was delicious and fell off the bone. It came with fries and coleslaw both of which were spot on. We had also tried the lettuce wraps, and they were perfect. Quality ingredients and a smart chef."}
{"text":"Great little place.  I stopped in for a beer and a quick snack.  The service was good.  A good selection of beers and some different food options - like the Cajun Pretzels.  Very good."}
{"text":"We were undecided on where to go for dinner last night so we took to Yelp for guidance. We were looking for something kind of nice, not too loud, not too expensive and with a diverse menu.    We chose The Ironwood Cafe based on the reviews of others.   The walk to the doorway is elegant, well-decorated and hinted at being a trendy, 30-something restaurant.  However, when we walked in we were greatly underwhelmed. I knew it was listed as a sports bar but we had read reviews detailing a more family-friendly, quieter experience. We weren't given the option of that experience or the sports bar experience.    We were hungry so we decided to take a seat at a high top and give it a shot. The two sided, laminated menu should have been another red flag, but when our drinks were brought to us in clear plastic Solo cups we decided to leave the Ironwood behind and try our luck at another restaurant.   I'm sure it's a decent place, it was crowded and the folks seemed to be enjoying themselves so I can't comment on that, but we felt mislead by both their profile and the reviews given."}
{"text":"We went there Saturday afternoon.  It was very good.  After reading the previous reviews I had concerns.  They were rough, and I think that people should give this place a try.  The boyfriend had the pulled pork, and inhaled it!  I had the \"trailer parK\" a beef hot dog with slaw and cheese.  I had them hold the pepper jack and the ghost chili sauce.  We did try all the BBQ sauces and I liked the Cleveland one.  The BF liked the sweet one.  The fries were perfectly seasoned.  Honestly, the server (we sat at the bar) was quite attentive, and speedy with drink refills.  We will most assuredly be back."}
{"text":"Brunch was excellent. And there's live music today on the patio while we eat it. The food prices here are a little more expensive than the food at places nearby - but it's so good, that I'm ok with it and keep coming back. Will definitely be back for brunch!"}
{"text":"A good neighborhood bar and eatery. Initially gives the appearance of a dingy dim-lit bar, but has high quality food. The salads are some of the freshest around, upgrade your meal by adding the blackened salmon on top. Their French fries are my favorite in the Cleveland area. If I am really hungry I enjoy the Cajun chicken pasta, and choose one of their many seasonal beers to go with it. Sometimes the service is slow and the prices are a little higher than expected. But I still go here almost once a month."}
{"text":"Had a bizarre experience and will never come back. We sat down at the  bar and it took  the bartender a long time to see  us.She was very  nice  but was more interested in her conversation with other customers than serving us .we were there 10 minutes before we got our menus. It was so bad that  the  waitress ended  up taking  our  order  and getting our food  and the  bartender didn't  notice. I order steak and potatoe soup which was very  good and beef sliders which were  small and cold .seemed to sitting around a while. ..My friend ordered  2 plain chicken breasts with  barbecue  sauce  on side.I asked how they  were and he said  they  were  pre cooked and reheated.  They then  charged me $19 for 2 chicken  breasts  w no sides. Way Way over priced. ..expensive below  average food w poor  service. .Very  nice  people but not worth it."}
{"text":"I've always had a great experience at Ironwood. The food and service are excellent. We had lunch at the bar today....super, as always!!"}
{"text":"I was hoping for more... at least for the sake of the neighborhood.  Walked in on a slow rainy Tuesday night greeted by a sign that says bar seating only and a server passing by telling us no kitchen orders for at least 15 minutes.  We should have turned around  but figured we world have a cocktail and wait it out.  Beer selection was good but liquor pour was weak... so weak.  Finally place order (wings and nachos) and they were out in less than 5 mins?  But everything was cold.  Waited another 10 mins for side of blue cheese.  Food had no flavor everything tasted like poor quality straight from the can.  Blue cheese dressing tasted like water with feta?  Cheap.  Waitress was friendly but slow (there were less than 10 tables and at least 8 servers).  Not sure what's up with this place but definitely a disappointment."}
{"text":"Went for wing night and the wings were not very good. The ghost pepper sauce was around the same heat as Frank's red hot. As for the wings them selves they were not crispy and the skin was a bit chewy."}
{"text":"The four of us went in on a Saturday night. We were told that it would be about a 15 minute wait, however it was certainly not that long. I will say I was a little upset that I had to wait yet the front of the place was not even open.   The four of us ordered the Ironwood Club, Blackened Chicken Wrap, the Tuna and the Pasta. They were all fantastic. We finished off the evening with Chocolate Love.   We cannot wait to go back."}
{"text":"I've been to Ironwood one other time, but it was at night and I try not to review places if all I am doing is grabbing a beer.   So after an unsuccessful attempt at using a groupon (the place we went literally had an eviction notice taped to the front door) we decided to hop over to Ironwood for a late lunch. It was right in the middle of a Browns game and the small grouping of tables and bar were packed. But we managed to get a huge booth for the two of us and still had a great view for people and game watching.   I had the Ironwood burger that was awesome. I could've lived without the piece of salami, but I think it's their gimmick, so more power to them. The meat was really moist, a little on the greasy side, but in that good way, like in the \"I'm-craving-something-greasy\" way.  The BF had a Chicken Parmesan Melt, with required slice of salami, and that too was great.   Oh yeah, the enormous beers were $2.50 a piece. All in all I took a well deserved nap when I got home."}
{"text":"This place is kind of hard to find. It's behind Copper Cup and Moosehead. You have to walk to the back and you'll find the door. The environment is a bar and not so much cafe. It is also pretty dark in there. So, the atmosphere wasn't too great and definitely not family friendly since it's mostly a bar. The service was good, but the food was bad. I got a BLT sandwich with tomato bisque soup. The BLT came out cold and the soup was so salty, I could barely get 5 bites in. The waitress noticed I didn't like it and swapped out my soups which was really nice. I then got country chicken which was eh. It was just bland and mushy. The food was just not good. I don't plan on going back here."}
{"text":"Very disappointed!  The food use to be really good there but I have been twice in the last month and it was not good.  The fries tasted like fish.  I can only assume the oil was old.  Something has changed."}
{"text":"Delightful summer like evening on the patio.  Good beer and wine list.  Food was good and well priced.  My husband loved the salad he had....lots of meat in it."}
{"text":"Sour and tart.  Not the food, the service.  Lunchtime chickie is downright dismal.  Two visits.  Two bad moods.  Never came back to check on the table.  Not once.  She seems pre-occupied with daily bar tasks.  The other problem is the flying insects; gnats and flies buzzing about.  I don't appreciate waving my hands around shooing bugs during a meal.  Food is pretty darn good, though.  Tortilla soup was very cheesy and had plenty of chicken.  A nice variety of salads are offered.  Quality tasting fish and burgers.  Take the food recipes and place them in another building with better help."}
{"text":"Amazing! This place has great food and service!  You won't find anything bad on the Sunday brunch menu"}
{"text":"2 stars because all of the food was great. Messed up orders and really poor service were the reason for the poor rating.  Server was extremely green and needed more training. Everyone appeared to be brand new at their jobs.  Love the place and have had much better experiences."}
{"text":"Cute patio, however they allow smoking so it is hard to enjoy it on a nice day. The new chef isn't as vegetarian friendly as they used to be. They now up charge to sub out veggie burgers for meat. Used to love frequenting this place but the quality seems to be dropping with the new changes."}
{"text":"I was really excited about this restaurant as I wasn't a fan of the restaurant that used to be in its place.  I'd been to the other Ironwood before for private parties and it was a good experience.  I wish I could say the same for this location.  First, they seated us right by the bar where it was extremely loud and other people were standing on the ledge above and could overhear everything we were saying.  I asked to be moved and they did promptly move us to a table in the restaurant section which was better.  I ordered the veggie burger and my husband ordered the ribs.  The veggie burger was not great. The bun was like a bun you'd get in your school cafeteria. The burger itself fell apart. I did enjoy the avocado but thought overall, it was very bland. I had ordered tator tots instead of fries. They got the order wrong so I got to try both.  They were too salty in my opinion. My husband agreed.   I was disappointed at this experience but would be willing to give it another try in a few months. I'll chalk this experience up to its rookie status."}
{"text":"I was very excited to try out the new location in hopes that it would be a vast improvement from their previous one. No such luck. Parking was a challenge. Once inside, lots of open space and very cold. Sat at the bar and ordered the calamari. Took awhile even though there were only a few other customers at the time. When it arrived, it was so overcooked that it tasted like fried rubber bands. Very disappointing. Bartender took it away when we said we were done but didnt ask why we didnt eat it. We got our bill and headed across the street to the neighboring bar. Didnt want to waste the parking spot. Much better choice!"}
{"text":"My favorite \"bar\" around. Burgers & gyros are the best around the West Shore. Beer is cold & very reasonable plus the appetizers are very good .....especially the artichoke dip & the chicken quesadillas.  Their soups are outstanding!"}
{"text":"Great bar and good service. Typical Mid-western sports bar. The age of the crowd varies but usually there is a fairly younger crowd."}
{"text":"Ironwood has the best of both worlds - Obviously a very successful local hangout for the college crowd and a pretty good place for anyone to have some very good food and kick back. (Did I just use the term \"kick back\"? Press the shock buzzer!)  The trick is timing. Past 9 pm, if you were able to vote for Bubba Clinton, you don't belong here. For the math challenged that's over 33. Fish entrees are very good and the sandwiches are delicious. Here's my main beef - About a thousand years go the bar used to be a four-lane bowling alley. It's been remodeled very nicely but it is a very long and narrow barroom. the place is usually crowded and it seems the table seating is an afterthought-not enough, badly arranged, wasted space. this place was built for drinking and it's a shame as the food is better than most."}
{"text":"Bartender Ashley is smokin hot. Great service even better ass. She put chicken in my dilla even though I said no chicken. It's cool though.  I recommend this place. Super chill."}
{"text":"Stopped by Ironwood with my daughter and her boyfriend after a day at Huntington  Beach, 1st visit and looked like a nice casual local spot. We decided to sit outside, patio was nice, very casual and laid back, it was Wednesday which is $5 burger night, both my daughter and BF had the burgers, I ordered a club sandwich with fries.... Burgers were nice sized and the fries were tasty with a hint of the peel on the fries (similar to fair fries), the club sandwich was rather big, enjoyable with turkey pastrami and ham....The three of us had lemonade and ice tea, with tip dinner $32.....Not bad, for a casual night out, if I lived in the neighborhood I would be a regular at Ironwood, service was good and attentive, filling up our glasses of tea and lemonade without hunting down our servers...Give Ironwood a thumbs up for sure..."}
{"text":"OVERPRICED!!! Poor quality. It's almost as if the chef/cook doesn't know how to make simple things taste \"good\" so the throw a bunch of spices and combos together to try to make dishes \"good\" but they FAIL miserably. I really hope this place closes soon and something else reopens. Staff seems clueless (this statement is based of 4 separate visits, hoping service and quality would improve in the neighborhood joint). I have tried the burger, the chicken, sandwiches.... Nothing impressed me or was even okay'ish for that matter. This place isn't worth ever going to again hope they close down soon."}
{"text":"Slow service, they ran out of the special, hard to get the waitresses back for a second round, one order was wrong."}
{"text":"This place is my favorite local hangout. The food is great and the staff is very friendly and accommodating! They have 10 TVs in the main bar area so if you want to watch a specific game they can easily help you out with That! Prices aren't going to hurt your wallet either! I highly recommend this place if you want to go to a bar and have a conversation over libations!"}
{"text":"This place is terrible. I went there for the first time on Tuesday night. The place was slow and the service was awful. The server took 10plus minutes to come to the table, another 10plus minutes for the drinks to show up. Over 30 minutes for the food. Now the food was even worse. Two members of our party ordered fish and chips. The fish tasted like burnt oil and the fries were soggy. I ordered a gyro which was a 2 on a ten scale and my fries were soggy also. The fish was sent back for the grouper instead and it smelled awful. We could tell it was old fish because of the strong smell. The prices were really high for such terrible food and service. Those three meals and two beers were $55 plus dollars. Outrageous!!!! To top off the experience they had skee  ball tables in the middle of the dining room which were so loud it was hard to talk to the people I was with.  I am not sure who the owner is but they do not know how to run a business. I will never go back and will never recommend this place to anyone."}
{"text":"Visited twice since opening and I like this place. I think it will get better when they get more established and I hope they stick around! Ordered the ironwood burger on the first visit. No complaints,  good flavor, cooked perfectly and the club on the 2nd. Loved the bread and two kinds of cheese on the club. Both plates came w fries and theirs are very good fresh cut.  My boyfriend ordered a BBQ platter and was very happy and the pulled pork sandwich on the 2nd visit, but was not as impressed. Lots of coleslaw on the sandwich made it soggy.   Service was fine, not too helpful with menu or available at hostess desk to seat you when you walk in.  Decor is very generic and lacks any wall art so it has an unfinished just moved in look, but clean. I really hope when warm weather hits they get rid of that eyesore of an outdoor tiki bar. We'll be back for a third visit to try the fish fry for sure."}
{"text":"Divey little sports bar kind of place. Not my jam, but if you're into that kind of thing you should check it out.   Sat at the bar for a beer. Service kinda blew. She never came to take my money for the beer. So just left some money and peaced out.   Bathrooms are clean, which is a plus."}
{"text":"Worst Mother's Day meal ever. Our party of five ordered standard menu items. The food came out one at a time and by the time our Mom's food came out, two people in our party had finished. Our mom's omelette was also missing ingredients. No apologies, nothing. Two stars are for the Bloody Mary bar, the only redeeming factor for this atrocity."}
{"text":"Surprisingly good bottle beer selection.  Great bar food too.  Take a few minutes to get past the douchebags in sweaters, and you've got yourself a pretty great place to down a few."}
{"text":"Really sad to see this place deteriorate and close. My wife and I had been coming here since it was Tony's, Tuscan Grill, Paninis and then the Underwood. I had high hopes for a place that offers BBQ, but alas, the place died a sad death. The wait staff is great, but without Sue and Colin to steer the ship, it became the Andrea Doria."}
{"text":"Horrendous service....I never thought I'd say I miss the old Panini's, but at least they knew how to tend to their customers. It took well over 20 minutes for the waitress to finally pickup the credit card, not to mention never any checking in on the customer, it took concerned looks to draw any attention. Management should truly be ashamed of themselves. You're better off going to Red Lantern, Backstage, or even steak and shake."}
{"text":"Decent local bar that serves up your standard Americana food. Get in, get your drink, have some food, hang out. The patio is pretty nice for a landlocked location. Green bushes and shrubbery hide the views of the parking lot. Wait staff is courteous, but ordering at the bar can be a little time-consuming if you are not a regular. It's definitely understandeable that longer conversations with the usual patrons are to be had, but don't make it that obvious!   Because of the location, this place is ideal for a workday lunch or a happy hour gathering. I've noticed when eating solo or within a group, ticket times have been slow. If you are in a group of four or more and time is an issue, I suggest calling ahead to place food orders beforehand - the staff has always been accurate and accommodating in that respect."}
{"text":"Met family here for dinner July 4, 2013.  Super meal.  Kristen served us and was terrific.  I had the cedar plank salmon with jasmine rice and sliced zucchini.  The best!  A bit noisy with the ball teams they sponsor arriving for post-game libations.  Ask for Kristen, she'll take good care of you."}
{"text":"Been here twice to eat and it was okay. I will try the Friday fish fry and see what that's all about.  The place is clean lots of tv's great place to watch a game."}
{"text":"The Ironwood has two faces.    One is a sports bar for the barely legal.  Required attire is sketchers, backwards baseball caps, ultra low rise jeans and sports t-shirts.   This face reveals itself after 9pm and on weekends.  Not my scene at all, but everyone there seems to love it.   The other face is much more pleasant to those of us over 22.  Dinner here is a treat.  My 6 year old HRM Bonita and mon cher chou stopped in for some pub eats.  There were tables of adults drinking beer, but there were also many families with children.  There is even a really cute children's menu with a sports ball prize!!  The place was packed on Friday night, so it took a few minutes for the waitress to take our order.  We waited for what seemed like an awfully long time without getting our food.  When the waitress did arrive with our main dishes, we discovered she had forgotten to put in our appetizer order.  She was horribly embarrassed and apologized, explaining that she was at the end of a massive dinner rush, and that she must have just flubbed it.  To make it right, she bought us our beers.  Awesome.  That was very, very cool of her.  All is forgiven.  The food was amazing.  My beer battered cod was the best I have ever had-- crisp, light, non-greasy crust and moist, tender, fresh fish.  HRM's mac and cheese was creamy, gooey and decadent.  The skin-on fries were very crisp and not at all greasy.  Mon cher chou was pleased.  So, bring the kids before 8:30.  Act like a kid afterwards."}
