{"text":"This place showcases some really fantastic musicians but don't go there if you like to dance. Heaven forbid you stand in front of the stage to shake that lil groove thang of yours because you'll be BOOED outta there. It happened to me! Even the musician was like.... \"REALLY, guys?\" and invited me on stage to dance.   And honestly, what's a gal gotta do to get a drink 'round here? I know it may not be the server's fault but you're missing out on sales. Hire more staff. My whole table would have gotten a few more rounds if we had the opportunity to.. and we weren't the only ones.  Also, our server looked a little annoyed when my 15% tip was less than three dollars. Girl, it would have been more if there was more then two drinks on that bill. Welcome to the game of serving!   What a drag... this place is so close to home. I want to like it there- I really do. I'll give it a second chance when you get a musician in there that is NOT so groovy, where I'll enjoy sitting down and not drinking."}
{"text":"The food was mediocre and the flatbread crust was seemed and tasted like it was pre-made and not recommended. Do not have high expectations for the food. They should think more about quality and less about speed or ease. The music was great and the atmosphere is really good to enjoy live music, I just wish their food was good."}
{"text":"I like the Ironwood. It's definitely a great location for devout music fans, for sure. We were there last night listening to two bands play and it was a lot of fun.  The crowd was significantly older than my friends and I - I'm not sure if that's typical or just because of the particular band that was playing but everyone enjoyed the atmosphere and our servers were cheerful, helpful and on the ball.  I don't know that I love the cover-charge aspect but I know that bands have to get paid right?    One suggestion, I'd like to see them add some gluten-free options.  Anyway, I'll definitely go back."}
{"text":"Certainly, one of the best salads I've ever had.   Freshly made apple cider vinaigrette, which was more apple cider puree than anything, drizzled over avocado, fire-grilled chicken breast, strawberries and other veggies on a mound of lettuce.  The service, and thus the experience, was crap.  There's an obvious greeting area when you enter the Ironwood. Except there's no one staffing the desk. It's Friday night, so all the tables in the bar area are reserved.  The front section, all with low tables and a lovely view of the Inglewood denizen walking past on Ninth Avenue, was empty.   But for one couple, who left because they weren't getting served.  We eventually were approached for a drink order and another couple came in. They left because they weren't getting served.  Our drinks and then our meals came in an adequate amount of time.   The server came 'round for one last time about 45 minutes later to ask if there would be anything else. We said no.  We figured she would be back with our bill, but she disappeared. Nowhere to be found, lost among the artsy, more cultured folk who folded into the bowels of the Ironwood.  She finally came back about 15 minutes later, whereupon we showed her the broken wine glass and shiraz all over the floor. Sigh ... me and my Maritime talky hands ...  She registered an 'oh' and then disappeared again.  I asked my companion 'what should we do.'  She replied 'we should just leave.'  The thought crossed my mind but it just isn't something I can do. We struck a deal. We would hang out at the host desk for up to 10 minutes and if she didn't reappear with the bill, we would leave.  She reappeared and exclaimed 'oh, did you want your bill?'  It isn't often I don't tip. I normally will leave at least a couple of bucks but there was no way in hell this server or establishment was making  any more off me than they absolutely could.  The broken wine glass? It was still there when we left."}
{"text":"I've gotta let people know about this great little place in charming Inglewood. I went here on the eve of New Years Eve and it was just so nice and comfortable. We sat at the bar and got super service from two of the most accomodating young men you'd ever meet.  It was our first visit to the new location and 3rd visit ever to the Ironwood Stage. We ordered beer and an appetizer, broiled Spolumbo's sausage, and it was hot and delicious. The music was pretty good too. Greg Cockerell and his band were playing their final night. Their sound is countryish with a bluesy tinge, maybe even a flavour of Bob Dylan with his harmonica. We bought his CD and even got to chat with Greg himself who is very engaging and modest. Got to like that. Cockerell's sound was full, rythmic and very tight and nobody went deaf in the front row, if you know what I mean.  We even got a chance to chat with the owner, Pat McIntyre when the bartenders couldn't answer one of our trivial questions about the Edmonton night club scene. He mentioned he was planning to open another location in Victoria by the way.  I can wholeheartedly recommend the Ironwood Stage & Grill to anyone who wants a relaxing night out with better than average live entertainment and a friendly informal atmosphere. Every age group was represented by the way. Check it out. It's easy to get to and a cinch to find parking. We parked not more than 100 feet way in a public lot. There's lots of other shops and restaurantsin the area too. Inglewood is so nice now."}
{"text":"As an update and upgrade to my earlier review, the front of house staff seem to have really shaped up recently.  They have been very accommodating and attentive, and the food seems to come out much less haphazardly than before. Finally, the service quality matches the music quality!"}
{"text":"I don't even know what to say.    I will start by saying that my \"Roasted Veggie Sandwich\" was acceptable.  It had a good amount of roasted vegetables, unfortunately the bun had been cut so that the bottom half was about five millimetres thick, and the liquid from the vegetables had already soaked through by the time it arrived at my table.  I tried to flip the sandwich over but the bottom (now the top) was still too mushy to hold any of the ingredients in place.  I had to eat the sandwich open-face with a knife and fork.  The yam fries were excellent.  The girl who served me was nice.  But this place is DIRTY.  Dirty, dirty, dirty.  I understand that it's a live music venue in the evening and might serve as something more like a bar, but if you can't get your venue clean in time for lunch the next day then DO NOT OPEN.  I initially sat at the bar in the front window but was distracted by the dozens of fruit flies- and other bugs- crawling all over the glass and the bar.  There were cobwebs in all the corners where the wood frame met the glass window, and these were also full of dead flies.  When I moved myself to a table I looked back at the glass from a distance and noticed HUNDREDS of flies crawling all over the bottom of the window frame.  Not only did I have to pick flies out of my water glass, when I went to the bathroom each and every toilet bowl also had flies floating in the water.  I've never squatted so high before!  The Ironwood needs to close for a day or two and bring in a professional cleaning crew to get their front of house up to par.  I hope and pray that the front area is not representative of the kitchen."}
{"text":"The old Ironwood location was a mainstay for roots & country lovers.  Its fantastic rustic feel really gives showgoers an authentic experience of a remote country bar -- think down South-type of venues.    The Ironwood recently moved to a new location only 2 blocks down which I have to say is even better than the original location.  See my review of the new Ironwood.    In its place now, is a new live music venue, called the Blues Can.  I have yet to go but I am so happy that the Ironwood has been replaced by another locally-run venue."}
{"text":"Oh Ironwood. I wanted to like you, I really did.   I've heard great things about you, know you have terrific acts playing, and even you even host a big band brunch on Sundays.  I thought we'd be best friends right off the bat.   But it's no good - you're just not the right type of restaurant/venue to play a major role in my life.  To begin with, if you're a show venue, then you need more small tables, versus massive group ones.  I understand you want to cater for groups, and that you're also a restaurant, but having to share a table with complete strangers, that then talk all the way through a Flamenco performance? While it's not your fault they did, you could of prevented this if you'd just have more small tables. You'd work well for a band, but for a dance performance? Your setup just isn't right. You might also want to stock your bathrooms better - being out of paper towel and soap an hour before the show even starts is pretty sad.   And then there was your staff, which made me think you might be very temperamental.  Everyone was covering off for each other, which was great. And one of the women serving our table was wonderful - friendly, engaging, and made a point of trying to stay out of people's line of sight when checking in with a table. But the other server was surly, rude, ignored patrons, and took the other half of my table's orders before mine and Chuck B's... despite the fact we had been sitting there waiting to order for 10 minutes before the other group even arrived. So every time I needed to ask for something, I got concerned - I didn't know who I'd be dealing with, Dr Jenkyll or Ms. Hyde.   Finally, there was the food. This was where you really didn't live up to your promise Ironwood. I ordered the chicken pizza, Chuck B got the bison burger.  I was excited to see what you were like when it comes to food Ironwood, so excited to try to make our friendship work. Instead, you pretty much broke my heart.   My pizza should have been wonderful - pesto, apples, cheese, chicken - some of my very favorite things. And yet, everything was so thinly sliced I couldn't differentiate between any textures or tastes.  And then the burger - well, apparently the patty was dry, and the bun was soggy.   How can I be friends with somewhere that doesn't seem to  appreciate or serve good food?  Somewhere where I can't depend on the service or room set up to work properly with the event it's hosting?   I might be willing to give you another chance, especially if it was for a music event, and I can see how you'd be a great venue if you wanted a party or show venue with a 'raw' edge to it it.  So, because of this, and the one awesome waitress, you deserve a 2.5. But I can't praise you any more highly than that, and we'll only be acquaintances, not friends :("}
{"text":"All Stage, no Grill...  Last night a friend and I decided to pop in to the Ironwood for a pint and some food. There was a live show on but we weren't ready to stay all night to enjoy it so we chose to sit in the divided area near the entrance - a nice option for those who want to visit this local establishment but are not in the mood for live music. There were a few other people sitting there as well, eating meals and having drinks.  We chatted to each other while we waited for a server to take our order. After at least 10 minutes and no sign of service, my friend approached a staff person to see if there was something that we were not getting - did we need to approach the bar for a pint, or some other arrangement? We were assured that there was a server for our area who would be by very shortly.   Another 5 or more minutes go by and still no service!   So we elected to leave, and went to a different neighbourhood pub instead, where we had beers and appetizers on the table in less than 10 minutes.   I've seen great music at the Ironwood and would not hesitate to go there again to catch a show, but this was not the first time I've had lousy service. I've learned my lesson - The Ironwood is about the Stage, not the Grill."}
{"text":"One of the worst experiences I've had in Calgary!! My buddy won tickets to the skydiggers here and we didn't even stay for the whole show! The bartenders were incredibly rude! I've never been \"shooshed\" in a bar before! Haha. There are plenty of great places in Calgary to go for great live music, don't waste a penny here!"}
{"text":"This would be my one of my favorite places in the neighbourhood. It is a great place to stop  for lunch if you are looking for unconventional pub food or a fabulous place to settle in for an evenings entertainment (diverse program every week) over dinner and a few drinks. Atmosphere still has the original theatre feel even though it has been through a couple of incarnations since its Loose Moose days.Moose improv is still only a couple minutes away."}
{"text":"Love the Ironwood - have enjoyed it for years.  New location, the old Garry Theatre in Inglewood, has benefited artists a great deal.  Both the stage & backstage areas are larger - much apprecited by those that play there.  This venue hosts a variety of musical genres - from the amatuer to the seasoned veterans.    Every 2nd week, Kit Johnson & Tim Leacock, both great muscians themselves, host an open mic nite.  You must arrive early in the evening to be added to the list if you expect to be on stage before midnight!  Other regular gigs include the Blues Jams Saturdays, Chicks with Licks, Fools on Stools.  *check out the website for details of each  Last week I had the opportunity to see Peter Katz, who was nominated for \"New/Emerging Artist\" Canadian Folk Music Artist Award.  Included in the evening was a set by Roger Marin - I had never heard them before, and absolutely loved them.  That's what's special about the Ironwood.  Bottom line, the music is great.  Enjoyed visiting the new location on the 2nd evening that it was open in April 2010.  Artist - an absolute favorite of mine - Tom Russell.  The food special that evening - Bison Steak.  Total awesomeness.  The menu is limited, but food is good.  Wish they would add the Bison Steak to the regular menu - but so far it hasn't happened.  Personal favorite is the Warm Spinach and Artichoke Dip.    They would get a rating of 5 from me if they would change 2 things...  In summer it was HOT (no air-conditioning), and the chairs are wood & can be uncomfortable after hour 3!    Love this place - I check their schedule regularily!"}
{"text":"Here's one for your ears: A foodie style audio review.  Think of everything you look for in the best meal you've ever had. Textures. Colours. The way flavours within a single bite can both blend together and contrast each other. The way the tastes evolve in a timed sequence from initial smell to final swallow.  The Ironwood hits every key point... Except with sound.  There have been many musicians that I didn't realize just how good they were until I saw them at the Ironwood. They bring in some very high caliber performers, and this room does an incredible job showing them off.  The theatre is very open and live sounding, and it pairs brilliantly with folk, roots, and any kind of accoustic music. Instruments both fill the venue and blend together seamlessly, while keeping each individual timbre in tact. This warm sounding room lets colours blend together where need be, while still allowing individual voices to cut through.  Incredible.  and on that.. I think the food is pretty alright too.  Cheers to you, Ironwood sound guy. You do great work."}
{"text":"Updated: Came to see Rudy Moody. Excellent show. Okay food but inconsistent portions. We got the charcuterie platter twice. The first time it came it was small so we ordered a second one. The second one was more than twice the size of the first one and we could not finish it. They seem to always have issues with the kitchen.   Cheap drinks - $6 Manhattans (very simple ones; but for $6 for a double its more than reasonable for Calgary). Good service this time despite being really busy.   They lost my reservation but at least was able to get us a good table.  Great concert venue."}
{"text":"Okay, The Ironwood is my favourite place to see great Alberta musicians.   I've seen Ben Sures perform there,   Jori Kinjo  and a few other memorable but not famous folks that just love to sing, play and are great to listen to.  First time out the food was not spectuacular and in my opinion over priced.  That  was when the Ironwood was in the Blues Can location.   And then, when we went to see Jori,  okay, it was an appetizer but for what we had on the plate,  it was ... okay.  Then there was the charity event.   We were out to support a Give a Kid a Lift charity event at the Ironwood and my husband treated us to lunch.   And it was good.  I love that the Ironwood supports charities and local and all sorts of music.   It is live performing of live and often original music.     Yes, in the evening you can dance.   It's fun to watch the tables clear out by the stage and see people doing what they do best, making merry to some great music.  I'm looking forward to a little Sunday afternoon Blue Grass coming up in the near future, but several words to the wise.  1.  There is a cover, and it can be added to your bill, but it covers the enterainment, so you don't have to spend a lot of money on drinks or food if you don't want to. 2.  The appetizers range form  $12.00 - $14.00 and they feed maybe 2 small  appetite people or one me.   3.  The beer is the best deal.   There is a full bar but really, as Alison Brock says:  \"It's the music.\"  I want to go to the Bluegrass afternoon on May 19 and ... oh wow there is SO much good music there this spring!  Take a peek at their website and find the offerings.   The pick a day and just go!"}
{"text":"It  is always great when you can see your favourite artists in a small venue like this. Good Food. Good People.  It would be nice soda and such was complimentary for the designated drivers out there. Thanks Ironwood."}
{"text":"I went to the CD Release Party for Scott Cook at hte Ironwood Stage and Grill.  Admittedly, I have not been in this establishment since it was Loose Moose, so it was a real treat to see what they have done with the place since then.  The sound of the band in this space was unbelievable.  They are a good band to begin with, but the acoustics were fantastic.  This is definately a bit more of a rough-and-tumble atmosphere compared to what I am use to.  Usually when I go to a pub type atmosphere, it is usually more of an upscale place.  However, the ruggedness of the Ironwood Stage and Grill was not a turn-off for me at all.  It had a real small-town feel.  What really created my 4 out of 5 rating was the experience of hearing Scott Cook play.  He had never sounded better, mostly because of the acoustics in that space, compared to other venues I have heard him perform in.  I will not hesitate to go to Ironwood for live music again.  I did not order any food, but we did order drinks and the service was good.  No complaints!  If I was ever booking a music venue, I would definately consider the Ironwood!"}
{"text":"Great old former theatre from the 50's turned into a cosy bar and grill with very good performers. This is a well established and popular venue so reservations are strongly advised when live performances are on.  Staff: very good attentive and accommodating people including the owner Paul who mingles with the crowd and acts like one of the staff than the owner.  Food: I ordered the margherita flat bread, it was good but slightly bland, nothing that a few capers and a dash of oregano wouldn't have fixed, I expressed my thoughts and was graciously noted.  Price : very reasonable compared to Calgary  watering hole pricing"}
{"text":"Had a great New Year's Eve at the Ironwood! The live music was very entertaining. We sat near the stage and expected to be blasted by the band, but the music was actually pretty chill. We enjoyed drinks and i had the steak and my friend, the flatbread za. Good stuff! Bathrooms were not super cleanly but in some ways who cares. Adds to the atmosphere :)"}
{"text":"I'll only comment on the physical characteristics of the space, since I went here to photograph an event. It was dark and challenging for available-light work, but fast prime lenses and modern digital sensors can handle it even without flash. A bit of a gritty feel, lots of character. I can think of several scenarios that would make good use of this location for richly textured visuals."}
{"text":"I want to like you - but I don't. The food is overpriced and not very good.... Calamari was soggy, spinach and artichoke dip was cold - jambalaya bland. The service is mediocre at best. The music however is great and is what will continue to bring people back."}
{"text":"I have never seen a better Open Mic Night (Wednesdays) anywhere in the City.  The local talent that emerges  always astounds me - it is my favourite spot to go in Inglewood, hands down.  The service is always fast and friendly, and the beer's always good.  Their new location, while not as \"homey,\" is conducive to music performances.  The food is always good however the menu could use a few updates (it's been the same for quite some time now).  All in all - ALWAYS an excellent night out!"}
{"text":"Great venue, excellent service. There is a cover charge for when there is live music (fair enough).  It's big enough to seat larger groups and they take reservations, which is nice! I really enjoyed our visit. Definitely going back.  Tip: check their performance schedule ahead of time to see who is playing!"}
{"text":"One of the things I love most about the Ironwood is the caliber of performers.  Patrick, the owner, and man responsbile for booking never fails.  I've taken a chance a few times and have gone to see musicians I didn't know but was invariably delighted."}
{"text":"This place was so great! Got to see Amy Thiessen and Belle Plaine. The Steamwhistle was cold and the appies were tasty. 3 hours of excellent entertainment in a warm fun atmosphere. Will definitely be going again!"}
{"text":"The ambience is not bad... Even when is not the kind of places I would frequently go... I think it was cool that they have live music all day... I went there on a Saturday at noon and a band was presenting. Which was nice. The food was ok... Not better than most bars. This is not a place I would recommend to eat, but is good for a drink and live music..the service was friendly.."}
{"text":"I suppose, you, the reader of this will have to confirm or deny for youself the truth about Ironwood.   People on here are saying things like \"its cheap booze\" and \"been loving it for years\" and \" the sound was perfect\" etc..  Well.... in my \"opinion\" then, The Ironwood is expensive. $12 cover and $6+ beers. I guess its cheap if youre a lawyer hahah.  The Ironwood has only been there for a couple years, max. Sorry dude, you didnt haunt it when you were in college ok because it wasnt there. It was still the old runned down garry theatre up until recently.  I found the service to be average. The music, while subjective, I thought wasnt any good at all. We paid this cover charge to see a BAND, and it was just 3 guys with like a banjo, and 2 acoustic guitars. It went on and on and on. I periodically check to see whos playing at the Ironwood, and its ALWAYS an unremarkable no-name \"blue-grass fusion\" group, or a  folk trio from saskatoon, with alleged lyrics and esoteric meanings that are so intense you MUST be sophisticated if you are a fan. LOL whata joke.  Its a shame really, that the Ironwood is so aweful. Its in a neat historic building, the stage is located well, and the bar and seating all make sense and are laid out well. Also its on the fringe of downtown.  Whatever image or genre they are trying to appeal to is not working, for this reviewer at least."}
