{"text":"Thanks Island Loco.  It was like I was back home in Honolulu.  Haven't had a great plate lunch in a long time."}
{"text":"Fresh..Delicious & exceptional customer service! This food truck came to our community. First bite, I almost melted..the tacos I ordered were so goooood! The coleslaw was so fresh, crunchy and full of flavor! The meat was very tender and just all around yum! I hope they come by again!"}
{"text":"This Food Truck is Awesome. I was looking for a lighter but still yummy solution and this was it for me. I got the 2 meat plate with double greens. It was super delish, and the dressing for the salad was soo good. The people in the truck were very friendly. When I attempted to order  a different plate the guy let me know that it was a lot of food, if that is what I was looking for. It wasn't so I ordered the smaller plate, it was perfect for me. It was so nice of him to tell me that. Over all great food, awesome people and quick service. Totally great.... thank you Island Loco."}
{"text":"Island loco has the best crab puffs ever...crab rangoons...saw them at 4 peaks brewery...the new one in the industrial park in tempe...good beer and great streetfood...they are there like once a week.."}
{"text":"Was lucky enough to find out that Island Loco was going to be in Gilbert yesterday.  We had the kalua pork plate, chicken Teri plate and the Teri chicken sandwich.  Everything was perfect!  My husband is from Hawaii and really enjoyed the flavors.  Sometimes the kalua can be very salty but not this kalua!  Looking forward to trying the teri beef next time.  The owners are friendly and doing a great job.  Mahalo!"}
{"text":"One of my favorite food trucks!    I usually go for the mixed plate.  It is awesome.  Not a thing on it I don't like, but best is the beef.  It is perfectly cooked to order.  Only wish is that the would have a lunch plate on their menu with just beef."}
{"text":"Always been a fan of Hawaiian food and Island Loco always seems to be one of my favorites. Luckily they cater at my job every once in a while and i really enjoy when they go. Food is always fresh, chicken and beef have really good flavor, usually go for the bento box haven't had a chance to try the other things since i like the bento box so much, plus it's straight gainz. However!!! I think it is the owner who is one of the main chefs, not sure but man this guy has it out for me!! and every time he sees me coming he always hides his bento boxes because he knows i will take a few extra to go since i see them so rarely!! lol all jokes aside, great food, real cool guys, definitely give them a try. Thumbs up fellas, better stash some boxes for me!"}
{"text":"great stuff! just happened to be driving by and seen a hawaiian food truck. didn't expect much but much like the swat team food truck, this was great and surpassed my expectations. kinda bummed they didn't have Aloha Shoyu (much betta than kikkoman) but won't ding them for it, because the chicken was great, mac salad was great and the rice is sticky like its supposed to be when eating hawaiian food. It had that taste of grill fire extinguished with beer. very common when grilling. great touch guys, keep up the good work."}
{"text":"There is a difference between Island Burrito's and almost any other burrito you will find in the Southwest... white rice.  I had a pork burrito with Asian slaw.  The slaw was great with sweet and tangy dressing with relatively big pieces of shredded cabbage.  I really liked the slaw dressing and used it on the second half of the burrito.  The burrito itself was all good, but the rice seemed to be the dominate ingredient."}
{"text":"This truck is amazing, we moved to Phoenix and we're hoping we'd find new favorite food spots. Luckily our apartment had a special event with this truck there giving free fusion tacos and we fell in love. The teriyaki chicken with corn and black bean salsa is delicious, especially topped with sriracha.   We've become regulars here, not just for the food but the friendly staff of the truck. I definitely recommend trying this truck, you won't be disappointed."}
{"text":"The first food truck I have had the pleasure of trying at the capitol on food truck Friday. The two taco plate was amazing!  The chicken/pork combo is a perfect mix and the lomi salad on the side keeps it light and fresh so one doesn't fall victim to that 2:30 feeling. The plate is a huge portion, to further stave off the 2:30 feeling I passed up the rice and tortillas and ate it more like a bowl. My only request would be that they come up with a carb free/gluten free option. Maybe a bowl consisting of shredded fresh cabbage rather than rice topped with that crafty deliciousness Island Loco serves up."}
{"text":"I very seldom eat off of food trucks, because everything is fried and cheese and bread and potatoes. However Island Loco food truck is a breath of fresh air when it comes to food selections. Grilled chicken, rice, green salad, Asian coleslaw, they have tacos, burritos, plates, so delicious!!!"}
{"text":"Let me start by saying the food I tried from this truck yesterday at the Mesa Food Truck Fridays event was great! Very delicious, very flavorful I believe they deserved 5 stars but I am giving them 4 stars because the portion size was a little too small for the price.   My husband and I were at the food truck event yesterday and after walking around checking out all the food trucks available, I decided I would like to try this truck & order one of their fusion tacos. There were about 5 options on the menu, some were with rice and others were pork options so I decided to go for the beef street tacos which are normally served on corn tortillas. When I was ordering and I asked for flour tortillas instead of corn, I was told that I would have 2 tortillas instead of 3 because the size of flour tortillas was bigger. I was OK with that (thinking it must be much bigger). For my side I ordered the Asian Coleslaw.  I paid $10 for my order and waited. A guy ordered the same tacos after me but with regular corn tortillas and was waiting as well. A few minutes later, the food started to come out to people who were waiting before me but to my surprise, the guy after me got his food before mine. Not sure why my order took longer to prepare but I was hoping they didn't forget about me! A few minutes later my order was ready so I picked it up and found my husband who was ordering at another truck and we later sat to eat.  When I opened my container, I was a little surprised at how small my meal was compared to how much I paid. I had 2 small flour tortillas (yes slightly bigger than the little corn tortillas we normally get at Mexican taco places but still considered small) and a small container with the slaw.  I took my first bite and honestly, it was great! The meat was tender, the teriyaki flavor came through and the slaw was crisp and fresh, it was delicious, so delicious I was disappointed it was so small!  After I finished both my tacos and my slaw, I was still hungry! So hungry I needed another sandwich to keep me going. I have not had lunch to come and enjoy the food at the food truck event and so I was really hungry at 7:30pm I needed a much bigger meal. After debating whether I should stay at the event and order another meal or go to my usual taco place, I ended up ordering from another truck. The reason why I didn't go back to loco island is because they ran out of beef one order after mine.   Very good experience overall & a point worth mentioning, the guy who took my order was very courteous.  Would I consider eating there again? yes I would but I won't skip lunch! Definitely recommended if you don't mind the price and would like to enjoy a light dinner."}
{"text":"Found the food truck for lunch while in downtown.   I had the kalua sliders with macaroni and both were great.  The kalua pig and the macaroni both tasted authentic which was good.  Spoke to the cook briefly and I have to say he was authentic Hawaiian also.  I was hoping to get some Malasadas but they werent selling any.  I would go back for dinner to try a mixed plate."}
{"text":"Holy S*** Batman.  The kalua pork is to die for.  This place is as good of not better than the lunch plates I've had in Maui.  Even better is the chicken.  I'm a fan!  I could see my self crossing the line to stalker status soon.  Highly recommend!  I can't wait until my next meal here."}
{"text":"I can just vision myself sitting on the beaches of Hawaii, enjoying the cool breeze and the sounds of the waves flowing in and out from the shoreline.  A clear blue sky as I lean back in my chair on the sand but then I open my eyes... and realize I'm still in Phoenix, enjoying a delicious and fresh Hawaiian infused taco from Island Loco.  I've only been to Hawaii once in my life and it has been a long time since I had some really good Hawaiian food.  Then, Island Loco came and chef Jeff Chang brought the flavors that reminded me so much of my trip to Hawaii so many years ago.  I treated myself to the fusion tacos.  Got one of each, the Kalua Pork with Lomi and the Teriyaki Chicken with Black Bean & Corn Salsa.  The tacos were a pretty good size and very appealing.  The meat just exploded with flavor and the salsa and lomi was very cool and refreshing.  Everything was infused really well and was just delicious \"Kemika\" (\"Chemistry\") in my mouth.  If you ever get the chance, try Jeff's tacos.  They are delicious, fresh and full of flavor.  And there is a Secret Menu item coming soon for Social Media fans as well so be sure to follow them as well."}
{"text":"Just had the meat platter for lunch. The truck was at my work parking lot at Van Buren and 44th today.The portion was very very generous and the price was right $11. It came with rice, a side, beef, shredded pork and chicken thighs. This plate was designed for someone with a big appetite. The service was very friendly and quick and the food was all fresh -- all good!!!!"}
{"text":"best tacos i've ever had!!! also the best cole slaw ever sold at this food truck!  you have to try it!!"}
{"text":"Tried the \"special\" Spicy Korean Burger today.  After asking a bunch of questions about the quality of the gochujang (what made the burger \"Korean\") I gave it a try.  FANTASTIC! The bun was perfect - a good burger could be undermined by a bad bun. The burger was juicy with lots of taste and little grease. The cole slaw on the side was so good I slapped some on the burger. I don't think it was spicy at all though, but it didn't detract from the quality. It's not a regular menu item, but if you see it, get it!"}
{"text":"I'm a sucker for a good plate lunch so it doesn't take much for me to check out a place that serves Hawaiian food. When I found out this food truck was going to be near my house I knew what I was having for dinner. Yes, you can have plate lunch for dinner.  If you don't know plate lunch is typically a serving of meat (teriyaki chicken, beef, etc.) a scoop or two of rice and a scoop of macaroni salad. Some places have other types of salad but in my opinion mac salad is this only real option.  I ordered the teriyaki chicken and boyfriend ordered the fusion tacos. Both entrees were $8 a piece.   First of all the portion were huge. I swear I have never seen tacos this big. They were like burrito size. He described the teriyaki chicken taco as a mini chipotle burrito with teriyaki chicken as there was rice, beans and a kind of salsa in the taco. He liked the chicken better than the pork.   In my plate lunch I got two large pieces of chicken, two scoops of rice and an oversized scoop of mac salad. The chicken was cooked well and had a good flavor but I would have liked more sauce on it. Maybe a little container on the side? The rice was good and the mac salad was tasty too. Not as good as Aloha Kitchen but better than most other places here in town.  Overall I still rate Aloha Kitchen as my number one place in town for Hawaiian but Island Loco is now a close number two."}
{"text":"Experience there food on the Scottsdale food truck Festival.  Felt pretty bad for them cause it seemed they didn't get a location or they just wanted to be a hidden gem.  Either way I loved there chicken slider so much that I came back to get another before I left.  Wish they had an actual establishment so I could just go rather than trying to food truck stock them.    Wasn't much of a fan of Hawaiian food but I am definitely now :)"}
{"text":"I'm giving them only 3 stars because of the long wait to get my food (20 minutes) and because the plate lunch was Meh.. I ordered the chicken teriyaki w rice and cole slaw plate lunch. $8.50. Chicken was over cooked and the pieces were so fatty, I probably threw away 1/2 of it.  Not sure if I'll try it again.  (I went to this food truck at lunch on a Wednesday near the Capitol.)"}
{"text":"Heard that Island Loco was going to be at Four Peaks' Tasting Room in Tempe on the 3rd and the 5th, so I decided I'd take visiting family and Mom along for our first try of both businesses yesterday.  (I've never had IL's products, but the food truck's offerings looked and sounded great, and the reviews have been pretty positive from a few Yelp friends that I know and trust.)  For some reason, I was under the impression there would be authentic Hawaiian sweets on board, perhaps shave ice (nope) or malasadas (fryers were being repaired), so it was a disappointment not to find any.  However, the food that we had were delicious, if not almost worth the pain I had to suffer soon after consumption!  We quickly found theTasting Room via smartphone's Navigation, saw Island Loco's food truck parked in front, and parked at a nearby space (there are many).  After ordering our food, we went into the Tasting Room (food would be brought to us), which was just a room with tables and a bar counter that faced a window that looked into the brewery's warehouse.  FYI, tours of said warehouse ISN'T available at this location.  While FP food isn't available, the manager was able to provide us paper plates and extra napkins to use, since the food truck only supplies the to-go containers in which the foods are placed and sealed plastic utensils, salt and pepper packets, and single napkin.  Between three adults and two children, we all were very satisfied with the three entrees ordered:  Kalbi short ribs platter, $11-- short ribs marinated in traditional Kalbi sauce, two scoops of hot rice, and choice of side (Hawaiian mac 'n cheese).  Fusion Sliders, three for $12 (or two for $9), choice of side and any combo of Kalua pork with lomi, Kalua pork with Asian slaw, and Chicken teriyaki with Asian slaw.  I chose one of each, plus more Hawaiian mac 'n cheese.   Hawaiian burger with rice, fried egg (any style), and mac 'n cheese, with choice of brown gravy or another topping, which I've forgotten- sorry!  Everyone loved the Kalbi ribs!  So much so, Mom asked me to order another one to-go.  I found the meat to be too fatty, so I just trimmed the non-chewable gristle and put them aside.  The flavor is exactly like Filipino pork BBQ (on a stick), so Filipino Yelpers will know exactly how these taste!  :)  The Hawaiian mac 'n cheese was light, yet flavorful, and the noodles were tender, but not mushy!  I enjoyed this side very much, although I did notice too late that the dressing had very skinny and short ribbons of carrots (allergy), so it's one of those \"enjoy now, and pay later!\" deals for me.  :(  Mom said the rice was excellent--  she asked me to try it, but then remembered that I had an allergy.  She said it was a pity, since the texture was very good!  I asked Mom to see if the slider I was looking at was chicken (I try to avoid corn and anything that eats corn as much as possible), and she said it was pork, so after asking her again if it was chicken teriyaki, she said, \"no, it's pork,\" I tried it.  Loved the texture, but it was definitely chicken.  I knew the slider next to this one was Kalua pork since I could spot it beneath the Asian slaw, but the other one had chunky lomi (Hawaiian-style pico de gallo) and I couldn't see what was underneath it.  (Obviously, I couldn't recall which slider came with the lomi topping, or I would not have to ask Mom to identify the meats...)  I can't recall if sister enjoyed the pork with lomi, but I think she finished the meat portion.  Everyone enjoyed the bites pork and the chicken we all passed around.  My only complaint was that the buns felt like pieces of paper on my tongue at times.  Y'know, as in when you sometimes take a bite of food wrapped in tissue and you get a chunk of paper stuck to the food?  So there I was, picking off what felt like paper on the tip of my tongue, and it's actually a piece of the bun- weird!  Otherwise, the buns had a mildly-sweet flavor to them and were tender.  They complemented the fillings well.  (However, I would wait until they chose another bun variety before ordering \"slider\" style again, because that paper texture was very annoying.)  Niece had the fried egg and brown gravy-topped burger patty over rice and choice side of Hawaiian mac 'n cheese to herself, and while she liked it, she preferred the Kalbi short ribs much more.  This entree was basically a Loco Moco, but I think it was named so, because you could also choose Japanese curry topping.  Bring cash if you don't want to be charged a card fee.  I think I was only charged one time, even though I had two transactions."}
{"text":"Pretty good!  We tried some kalua pork tacos and malasadas at the Street Truck Festival.  The kalua pork tacos were pretty small, with more of a focus on the pulled pork rather than the taco as a whole.  The meat was moist, and had a nice flavor, although I do feel that Golden Hawaiian BBQ has better kalua pork.  The malasadas were the \"Secret item\" of the day (Show them their Secret Item picture from Twitter and you will get them in a little paper bag).  This was my first time trying them, and they reminded me a lot of Chinese-style doughnuts.  It had a nice sugary outer coating, with soft fried dough on the inside.    If they are in the area, I'd definitely like to try Island Loco for more Hawaiian style eats!"}
{"text":"I was put in charge of choosing a caterer for our open house which we were expecting 200-300 people. There were a lot of caterers to choose from but after communicating with the owner and reviewing his quote, I knew Jeff was my choice.  On the day of our event he was on time and dressed appropriately. The meat was fresh and super hot! All the sides were amazing flavor! He kept all the containers full.   Jeff we will recommend you to everyone!"}
{"text":"Couldnt decide ending up going with the plate which included 3 meats and 2 sides, a huge portion of food and all of it was excellent. if i had to narrow it down to something smaller next time - would def go with the slaw, pork & chicken although the beef was excellent as well.  I'm glad I found that little green truck on Jefferson yesterday"}
{"text":"We finally got a chance to try Island Loco this past Saturday. Ordered kalua pork plate, teri chicken plate and malasadas. Kalua was not salty and perfectly seasoned and teri chicken was tender and moist. Most of all malasadas were to die for. Only complaint would be that not enough serving of sides. Wish they would give actual scoop of mac salad and lomi salad instead of in these tiny little containers."}
{"text":"Love this truck! The pork slider is a no brainer. Great tasting, flavorful, yummy. Hubby had the combo beef, pork and chicken plate and he enjoyed it thoroughly.  I like that they keep their calendar up to date on their website so I can find them when desired.   Definitely give them a try. The plates are huge and will feed you for several days - bonus!"}
{"text":"So had to try this truck so I'm down for Hawaiian food. I ordered the lunch plate combo with kalua pork & teriyaki chicken, scope of rice and Asian cole slaw. I ended up eating the rice 1st 2nd chicken and mixed the pork with the cole slaw. The pork by itself tasted a little dry, the cole slaw added a much needed drench of flavor. The chicken was chewy but good. They give you big portions but i wish the meat had more flavor since the reviews are sided to this? I would try this truck again"}
{"text":"One of my favorite food trucks!  The plate lunches i've had are the beef and chicken with white rice and macaroni salad and are delicious but if I see the saimin salad with chicken as their special, I grab it!  One of the best salads out there.  :)  I would highly recommend this food truck.  The people are super nice and the food is excellent."}
{"text":"If Island Loco is ever in your neck of the woods at work, at home or at play - GO TO IT!  Their food is sweet, savory and filling!  Their Teriyaki Chicken FUSION TACOS are my ultimate favorite paired up with their Hawaiian Mac Salad.  Their portions are HUGE, and they give you a lot of savory meat, toppings and sauce.  Their Kaluah Pork FUSION TACOS are very moist, tender and a tad spicy if that is more your thing.  They are happy to give you extra sauce or cheese for NO additional charge.  If you pay with cash, the price on listed menu is what you pay.  If you pay by debit/credit, they will charge you tax. Like them on Facebook.  Go to their website and look at their schedule to see where they will be at.  Highly recommend!  They even have a KIDS MENU and awesome desserts like CHURROS!"}
