{"text":"The food was amazing a must go back and try the Curry Goat on Wednesday, I will tell all my friends about this place!"}
{"text":"Its a nice quick way to get something different. If you're looking for atmosphere this ain't it. The food is great!!"}
{"text":"WOW!! This place is amazing i went in an they were so friendly when I ordered my food it was fresh an hot an when i tasted it, it was like a PARTY IN MY MOUTH!!! I would definitely go back"}
{"text":"This is the best Caribbean food in Arizona. It's so authentic and soooo delicious!! Everything there is cooked to perfection and is so beautifully presented. 

We had the Jerk Chicken, Island Fries, and, Wing! The Jerk Chicken was spicy but to the best degree! It was seasoned perfectly and beautifully juicy and not over or under cooked a bit! The Island Fries can be described as a mountain of happiness! There was so much that three people were able to split it and they were so satisfied! And the wings were amazing that even the five year old in the family devoured them! And the plantains...... they could be the only thing on the menu and bring in twice the flow as any other five star restaurant they were so amazing!

The staff is so sweet! One of the owners and the cashier personally come to the table and ask is you are pleased with everything and if you need anything! They are all so homely and give off the best atmosphere! 

I definitely recommend this place and hope you enjoy it as much as our entire family did!!"}
{"text":"It's all about the food here. Great flavors, spicy, sweet, very good. I had the jerk chicken with rice & beans and candied yams.  Loved it. Good prices.  It's a no frills place, small but I would eat here for lunch or grab carry out. I recommend it for a break from sandwiches and pizza."}
{"text":"For my first time here I tried the fried chicken and a variety of sides. I wasn't blown away with the mac and cheese at first bite like I was hoping to be but the more I ate it the more I liked it. The greens were delicious, tender and salty with a great meaty flavor. They were my favorite out of everything. The fried chicken was pulled from the fryer after I entered the restaurant to grab my carry-out order. Don't get me wrong the fried chicken is good and flavorful! However it didn't quite bring me back to my mom's fried chicken. It could have been much more crispy. The red beans and rice were different than I've ever had. There was a hint of sweet to them, which I'm guessing is the island influence. The portions for everything were generous and one meal could serve two people. All in all I give this local restaurant four stars for quality food."}
{"text":"The hubby was excited to try this place so we went for lunch.  Heres the deal, they have a very limited menu,  4 main dishes, and about 8,9 sides. 

I ordered jerk chicken withe rice and greens, this was an awesome lunch, i thought the portion was big, even though i didn't eat the rice (too much coconut for me?). The chicken was amazingly tasty,  tons of flavor!  

Now, my husband ordered jerk pork, after a bit they came out and said that the pork wasn't ready to serve,  could he pick another?  So he chose the chicken stew, and after a bit they came out and ssid that tjey were out. Chose another and they will refund his meal...okay so since I already had the chicken. ..he ordered the oxtails. 

So bright side, oxtail stew? Was perfect for him and he was so glad he had the opportunity to try it:) he had cabbage  (too much coconut ) mac & cheese  (YUM), and greens  (YUM).

Tge downside is at 1pm for lunch 2 out of 4 main dishes were unavailable. 

We will be back for sure, because the food we had was good and the service was good, everyone was so nice."}
{"text":"Craving something tasty and different for lunch? Give this spot a try, you won't regret it! 

Soul food meets Jamaica is the best way I can describe a place that serves oxtail, jerk chicken and fried ripe plantains, but also fried chicken, homemade mac and cheese and AMAZING collard greens. 

It was a dreary day in AZ and I was wanting some food that would remind me of the sunshine I am so fond of, so I decided to try Island Girls a try. 

There is plenty of parking as its in a strip mall by some offices.  The location is very basic and I was impressed about how clean it was.  I would recommend you call in your order if you are pressed for time since they cook things to order.  The drinks are bottled and I am hoping that at some point they start to offer ginger beer.  I had the jerk chicken dinner platter (for lunch because I have no shame and I also had not had dinner the day before or breakfast, so I was VERY hungry). It included 2 large pieces of chicken breast that were fresh grilled to perfection.  they were juicy and the seasoning was so very well balanced. It was savory and spicy with niether aspect taking over.  You could add heat as well if you wanted to; there are a variety of hot sauces available on the tables.  I had the chicken with peas and rice (red beans and rice cooked together).  It was a long grain rice and had a hint, just a perfume of coconut in it, it transported me back to islands.  I also tried the greens (collard greens cooked down with onions and meat), which were the star of the show if you ask me.  Sometimes greens are so overly salty, you can't taste the collards anymore, but these were just right; all the flavors melded together and nothing was overpowering.  The meal also included a few slices of fried ripe plantain, so sweet and the edges were just a bit caramelized, which offered a nice texture contrast to the soft sweet banana on the inside.  

The staff was very friendly; willing to explain anything on the menu to those unfamiliar with the dishes and checked in on me as I devoured the ENTIRE plate of food. One of the owners came out to check in with me and she was very sweet.  

I'll be back to try the oxtail and curried goat! YUM!"}
{"text":"Back for the second time in two weeks and I'm sure this obsession is a permanent thing! This time I had the fried chicken with the heavenly mac n cheese and to die for candied yams. My husband had the delicious jerk pork, tender greens, and of course the mac n cheese. Friendly, great food and a hospitable vibe. Come to Island Girls!"}
{"text":"Tried to order some take out today, Friday evening at 5pm and got a recording telling me to leave a message and they would return my call within 24 hours!  I wanted this to be my 5th time eating their wonderful food:(   What a bummer, according to a review done last January they are only open two days a week and specializing in their catering business.  Their website says the restaurant is closed right now.  I will truly miss their food.  One star for not being available and not giving any sort of notice.  PS  I would probably give them 5 stars for their catering business.  Oh well fellow Yelpers, we suck it up and find new places!"}
{"text":"I really wanted to love this place.  It's not the usual sandwiches, or pasta/pizza, or \"chinese\", etc.  Caribbean food is generally unique and flavorful, as is soul food.  I found the results here sort of mixed.

They are only open two days per week. They emphasize catering.  They didn't say so, but I suspect they keep the restaurant so people can have their food and keep them in mind for catering.  I would prefer they put a bit more emphasis on the restaurant side, but it isn't my business. They weren't very efficient, and apparently surprised by how much business showed up today.  They \"ran out of food and had to get more\".  They were overwhelmed by having 10 or 12 people show up (there were three of us, a group of five, and one or two pairs of diners...they didn't really have enough tables or chairs even for this many).  And we showed-up only about 30 minutes after opening.

The menu is small, but has enough variety. There's the chalkboard on the wall, and additional menus at the register.  There are different items on each, so you need to look at them both. We ordered the soul food sampler, brown stew chicken, jerk chicken, and loaded fries.  It took FOREVER to get our food.  Again, they \"ran out\".  But it finally came.

The jerk chicken was really good.  Bold, spicy.  Good.  Also the brown stew chicken was good, but not as bold as I expected from Jamaican cuisine.  It seems like simple comfort food to me, but a Jamaican I know says it's actually a Sunday dinner dish.  I liked it, but wasn't bowled-over by the flavor.  The rice and beans were nice.  Nothing to get excited about, but it was a nice flavor.  The hushpuppies (another side dish) were cooked perfectly.  Truly perfect.  They really are just fried balls of bread with cornmeal in it, so one doesn't really expect a lot of flavor from them.  But they were fine.

The soul food sampler was a choice of three meats and two sides.  I did not try them, but my daughter says her fried chicken and shrimp and catfish were all good.  Not spectacular, but good.  She liked the \"greens\" side dish.  And the corn bread was really good (I did try that).

Lastly was the loaded french fries.  Those were really good.  They had a jerk pork, and some green onions, and a mango habanero salsa, and I think some cheese.  Really good.

So the verdict?  Well, I can't give them five stars just because of the management of the restaurant.  It doesn't seem to be their emphasis, and it shows.  They were nice about it, but the wait was much too long and their ability to handle just 10 people (divided into multiple groups) was surprisingly poor.  The jerk chicken was 5-star food.  The soul food seemed mostly not to have a lot of seasoning.  It was fried to perfection, and tasted fine.  But none of the bold flavors expected.  Probably 3.5 stars for that.  My brown stew chicken was good.  I liked it.  Again, no bold flavors one expects from the Caribbean, but it was good.  Probably another 3.5 stars.  And the loaded fries were easily 4-star food.  Maybe 4.5 stars.

Not sure if we'll come back.  I think I would like to try them again.  My wife was a bit more disappointed that some of the flavors were \"nothing special\".  Though she did agree the jerk chicken was really good.  The food overall is probably a hesitant 4-stars, but how the restaurant is run is important also.  I have to deduct for that.  If I could go to 3.5 stars I would, but Yelp doesn't work that way."}
{"text":"I went there on my lunch break...next time I will call the order in and pick it up! They recommend doing that if you aren't dining in since everything is made when ordered :)
I got the jerk chicken, candied yams, and greens. Loved every bite! The flavor of the chicken was extraordinary! I am looking forward to eating there again!"}
{"text":"We just tried this place out.  The food was good, I had curry goat and my husband had coconut curry veggie.   Both with rice & peas, cabbage.   The place is small and cozy with island music playing.   If your in the east Valley give this place a try.  I ate my food so I couldn't post."}
{"text":"I am So happy I tried his new restaurant. I don't normally like rice, but their rice tasted so good, like coconut milk or something, a clean and delicious side. I'm not a huge fan of greens, but their version was surprisingly good. The chicken was seasoned to perfection! I am excited to go back. I want to try their coconut curry soup entrée."}
{"text":"A group of six teachers came here for lunch. I had the jerk chicken with cabbage and mac and cheese. It was full of flavor and so delicious. It is made to order so don't expect instant food. I also had the mango passion fruit juice and it was to die for. Come here and support these girls!!"}
{"text":"Really really good food. I discovered this place by accident and boy am I glad I did.   I got the Jerk Chicken, Mac and cheese, and the red beans and rice. Fresh, tasty, and clearly homemade. I normally don't dig spicy food but loved this. And the portions were huge and it's very reasonably priced.   The only negatives are it's a very small restaurant and it's  slow (probably everything is made to order?)  Do yourself a favor, try this place."}
{"text":"Most amazing fried chicken I've ever had! I love this place, so cute! You can tell the passion for cooking these ladies have, you can taste it! I can't wait to try everything else on the menu. The strawberry lemonade was also TO DIE FOR! So yummy!"}
{"text":"Wow! We enjoyed the catering they offer and it was outstanding!  I'm really picky and this was seriously impressive flavors!  The price and qty can't be beat for what you get. I especially loved the turkey, green beans, and the corn bread was awesome.  I can't wait to try out the restaurant."}
{"text":"\"It's national fried chicken day! Let's get some chicken!\" So off we went on a quest for some finger lickin' fried chicken delight. Unfortunately they only sell the fried chicken on the weekends here due to low demand on the weekdays (Boo... Who wouldn't want some gut bustin' crispy crunchy goodness on a weekday?). So, I was left to browse the menu for my little silver medal of meals. I ended up with the Jamaican spicy beef patty, a small side of collard greens, and a small mango-passion fruit juice.

The interior is pretty basic and is a small space but has a comfortable feel to it. The menu consists of various jerk meats, vegetable curry, Jamaican style patties, appetizers and sides. The meals only took a few minutes to make and came piping hot.

The collard greens were excellent. They had large chunks of meat in it, were perfectly seasoned, and were tender with a lot of smoky flavor. I wasn't a fan of the \"meat\" patty though. The dough was brightly yellow and had a good crispy flakiness, but my filling had an anemic amount of paste in it with no meat. It was also not spicy. There was actually more empty air pocket in the patty than filling. If you look at my cross section photo you'll see the big gaping hole where meat should be in the patty.

I tried some of the jerk chicken which was tender and nicely grilled. It tasted slightly too salty for my tastes though. 

The juice was very nice. It was a tropical tasting nectar that went well with our meals.

There are a plethora of hot sauces at each table for those that want to kick up the spice level, including a tasty Scotch bonnet pepper sauce.

Service was warm and friendly. The only other criticism I have is that this place closes really early, at 6 PM most days and at 5 PM on Saturday. 

I definitely want to try that fried chicken next time. It is a 25 minute wait for them to make it though so it better be good!"}
{"text":"I came in on a Saturday afternoon. The restaurant is in a small office building in Chandler. They seem to just be starting out so I will not criticize the look because it WAS all clean, but all very basic and no real style to it though, but this will probably change. The music is dancehall which I do appreciate and there is hot sauce on all the tables. The menu is very sparse and have specialty menu items on weekdays. Drinks are bottle and can drinks. I got a bottled Sprite and the entree of jerk chicken half size with the sides of mac n cheese and red beans and rice. It was a fair price.  I had some good talks with some regulars here while we waited for the food. The food took a little while to prepare as it was all pretty fresh. The food arrived with cornbread and it was really good. All the food was especially the chicken. The spices were unbelievable and the Mac was great too. Highly recommended!"}
{"text":"Amazing!!!! This is really all that needs to be said - can't wait to come back and try the next items. 
The girls are so nice and the food truly speaks for itself. 
A new favorite for sure. 
My only complaint is more of a take out place - we ate inside and it was ok - clean and cozy, but no restrooms :-("}
{"text":"Craving flavor?  Sooo excited that this place opened! We needed a new lunch place in Chandler. It's kind of hidden on the NWC of Alma School and Elliot but it will be your go to for flavor. It is mostly set up to be a take out place with a few tables. You HAVE to give this place a try, it's absolutely amazing! I have never experienced Jamaican food like this before, even in Jamaica. These women can cook! The fries with mango habanero sauce were the best I have ever had and hubby loves the jerk chicken. They have so many items to choose from, soul food like mac & cheese and classic Jamaican like rice and peas. They have vegan options as well. I spoke with the owners and they are going to be open for lunch Tuesday - Saturday 11 am until 6pm so you can pick up some dinner on the way home. They also do catering for big events like corporate lunches and weddings! Get out of your Taco Bell and burger rut and support this family owned business! Spread the word!"}
{"text":"Their hours make it a little difficult to get dinner here but with the rave reviews I've been seeing popping up on my Yelp feed, it was on the \"to try\" list. And now it's on the \"I will be a fixture here\" list.

Okay, not so much a fixture since there isn't much restaurant seating, but I would say a million times yes to take out. We asked the lady at the register (she was sooo nice!) for her recommendations and we were beyond sold on the island fries by the time she was done. One order of large island fries with jerk pork and the brown stew chicken with a side of candied yams, please.

The fries came out first and was just a feast for the eyes. The large take out box was almost overflowing with fries, drizzled with sour cream, mango habenero sauce, and of course, jerk pork. I am not in the least bit ashamed to say that the hubby and I demolished it in less than 10 minutes.

The brown stew chicken came out shortly after, with rice, plantains, and our side of candied yams. We mixed the rice and chicken together and oh it was exactly what I needed. The rice had it's own flavor and the \"starchy\" texture perfectly complemented the stew. The chicken was fall off the bone soft and simply melts in your mouth. But it doesn't end there. In between mouthfuls of chicken, my husband took a bite of the candied yams, looked at me in mock seriousness and said, you can't eat this. So obviously, I dug in. Oh, my, goodness. Those candied yams are heaven on earth. I love sweet potatoes, but these candied yams are on a completely different level. The spices cooked with them blended marvelously together and the sweetness of it was perfect. Shamelessly, we demolished our second dish.

Next time, I'm thinking we'll get the jerk chicken, since it's a favorite. And probably the oxtail and a small order of island fries. I anticipate it being a lot of food, but nobody's stopping me from getting them fries."}
{"text":"Fantastic jerk chicken!!! Kidney beans are \"peas,\" so don't let the title fool you. I hate beans but I ate the rice and it wasn't bad. I prefer my rice a tad more moist but hint of coconut is nice addition. Will definitely be coming back!!!"}
{"text":"Awesome place!!!! All the  food made fresh when you order it! Friendly family owned and fantastic food'"}
{"text":"This place was one of our favorite stand-by takeouts, but it became difficult to plan ahead to order when they were open because their hours were changing.  

Their cooking was excellent - from the fried chicken to the Jamaican dishes - and everything was made fresh to order.  

The last time we visited the staff seemed busy and un-attentive to incoming customers.  The food was different - less flavor, chicken blander and not as crispy, and things just seemed \"off.\"  I think they may have increased staff to take on catering and unfortunately lost focus on their customer base.  

Wherever they are offering services now I am sure the food is good, but I wish they had stuck to their mom-and-daughter restaurant services that got us hooked.  I am genuinely sad to see them go."}
{"text":"Awesome! Very friendly staff and amazing food. My boyfriend and I had the jerk pork, jerk chicken, fries, candied yams and Mac n cheese. The meats were spicy and flavorful. The candied yams were the best I've ever had. You could feel the soul and love put into every dish, even though we enjoyed the food take out style. We will most definitely be back! Oh and P.S. the plantains were to die for!!"}
{"text":"The food was amazing. Everything was so delicious I will for sure be coming back a whole lot. In AZ you have all your different types of foods you have your typical Mexican and Chinese food and now we are adding Caribbean/soul food to the melting pot, witch in my opinion is the best!  If your looking for something new and spectacular this is the place to go. Good pricing and good portions! And on top of all of that, the owners and crew were welcoming and friendly. 5 star all day!"}
{"text":"Not able to try! They shut down!! Soo sad wanted some. Im sure they were great while they lasted"}
{"text":"I'm going to miss the hell out of this place, I'm from NY and alot of the food in Arizona is absolutely horrible. Not only was it my favorite place in AZ it was one of my favorite places ever. I can't believe they broke my heart this way but it was good while it lasted and when they come back I'll be there."}
{"text":"I stopped in here for the Grand Opening and wow.. Hands down the best fried chicken I have ever had! AND! Oxtail Tuesdays!? I can't wait to try it."}
{"text":"\"You don't need a silver fork to eat good food.\" ? Paul Prudhomme

Sure, this place serves you up your food in plastic to-go boxes and gives you a little baggy with your plastic utensils but that doesn't diminish the amazing food you're about to eat.  It's a bit warm in here and seating is limited so I suggest taking your food home to enjoy.

I had ordered myself the Fried Chicken entree with Candied Yams and Mac & Cheese as my side.  I also swiped some Jerk Pork with some Greens and Rice & Peas.  Everything I ate was delicious!  The seasoning and crispiness on the fried chicken was perfect.  Every bite was flavorful and just thinking about it makes me drool.  You don't even need any ketchup, hot sauce, or honey for the chicken.  Just dig in and enjoy!  The mac & cheese was pretty solid.  It wasn't creamy by any means but I liked it.  The candied yams, I gotta admit that I probably wouldn't order this again.  It tasted like Thanksgiving but I'm getting old and this was a bit too sweet for me.  Now that jerk pork... goodness!  Once again, superb seasoning and every bite was juicy.  I really was loving the greens and was low-key jealous that I didn't get it for my side.  The rice & peas were decent as well. As for the house made Ginger Pineapple Juice, it definitely had a kick from the ginger and was refreshing. All it need is a little rum! ;)

All in all, I'm glad I finally gave this place a try ---- and be still my arteries, it's so close to home!  A clean dish, or a to-go box in this case, never lies.  I'm super curious about that Tuesday special oxtail."}
{"text":"I purchased a meat and two sides here yesterday. The meat tasted different. I thought it was overly seasoned. I started getting ill last night and have been up with a sick stomach all night even now this morning.  I will never eat here again."}
{"text":"Tiny place, great food, great service. I love their greens and their rice and peas. Their cornbread is like cake, sweet and moist. The ginger pineapple drink is a must try, really good! Fried chicken was good too. I'm still exploring their menu items so I'll update soon!"}
{"text":"National fried chicken day!  As soon as I left work,  I did a local search for fried chicken and ended up at this restaurant not too far away.  Since my friend Leslie A was here and has given it a 4 stars, I have to give it a try. I immediately asked my pal Karen W to join me here for an early dinner today.  

I believe this is a family owned restaurant and it is tucked away in a local shopping mall.  It has approximately 6-8 tables with a simple menu (written on chalk broad)  and decoration.  The owner told us that the restaurant has been opened for approximately 2 months only.  She introduced different types of food to us and gave us samples of the mango juice and other dishes.  She was super nice and attentive.  I tried a small sample of the Oxtail. The meat is tendered but a bit too salty for my taste (still tasty though). I finally ordered the jerky chicken that came with 2 sides of my choice.  The rice & peas tastes OK,  but the candied yum (sweet potatoes) were amazing!  I also took a bite of the collard green.  It was so good I kept on picking at it.

The best thing about this restaurant is the different varieties of hot sauce that they offer on different tables.  We collect them all and took a picture of it. I'll definitely come back here again for their fried chicken.  Overall,  I do enjoy their food here.

P.S.  They only offered fried chicken and desserts in the weekend.  Chicken will take at least 25 minutes to make.  I advice u to call ahead if u r interested in trying it.  I know I am."}
