{"text":"Horrible! Don't ever order there! I literally waited 2 hours for my food to get here! I tried calling there a few time and the guy just hang up in my after telling me that the food will be there in 2 min ! 40 min later still nothing! When it got here it was cold and the sushi was the wrong order ! :(((("}
{"text":"I ate here with a couple of friends over the weekend and we were all quite happy with our food. The restaurant was full when we went (around 8:30pm on a Saturday). There was a large group celebrating a birthday and the staff dimmed the lights at some point to sing them Happy Birthday and serve cake. It's a busy yet friendly atmosphere and a Bring-Your-Own-Wine location,  My chicken teriyaki dish came on a sizzling plate which was nice, and had lots of crisp flavourful vegetables with a side of (well cooked) rice. My friends each got a Bird's Nest with seafood and were happy with their dish (though I did notice they put imitation crab in it which is a bit odd). For what it's worth, the sushi and bento boxes the next table had looked good too--a sort of pan-Asian approach to Japanese as is very common in Montreal.  Note most of the bad reviews refer to the online ordering. My experience was positive for dine-in. I have not tried ordering from here but I would eat in the restaurant again when looking or a place in the area."}
{"text":"Fresh-enough but standard takeout sushi. What really was off-putting was the really incomprehensible, frustrating user interface for ordering online with terrible user experience (some vendor called Tasty Boom). The confirmation screen is extremely confusing and I wasn't sure if my order had been confirmed because at some point, the screen (you HAVE TO leave it open to view your status) displayed something like \"order cancelled by admin\".   I was about to phone them to ask them what was going on until (da-duh-duh), some robot calls my phone to tell me my order had been processed. Mixed messages much? The cluttered and confusing interface also extended my ordering process by about 10 minutes which is, frankly ridiculous because my order consisted of a chef's combo and some sashimi (which turned out to be nigiri-sushi in the order!).      All to say, good try but better luck next time, Itamea. I'll go with something that is lower on the uncanny valley curve and instead, go with a place with more convivial human interaction and probably better sushi.   (Also, they forgot the \"bonus dragon rolls\" as advertised on their site and after paying $50 for their sushi. Salt on the wound, I'd say.)"}
{"text":"J'ai encore la panse pleine à l'heure où on se parle. J'y ai apporté mon vin (mon cidre, plutôt) et une amie de qualité. Nous avons obtenu deux choses: beaucoup de plaisir et beaucoup de nourriture.  Le prix: On voulait des sushis. On en a eu pour notre argent. Faut savoir que quand on mange des sushis, nous deux, c'est comme si on était sans fond. Et ça nous a coûté 30$ chaque avec le tip.   La bouffe: Pas compliqué. La première crevette tempura = on arrête de parler. On parle beaucoup, généralement. Mais là, c'était tellement bon, c'était vraiment dur de trouver autre  chose à dire que \"fudge c'est bon\". Tous ces sushis dans notre giga-assiette furent mangés avec un peu de bave qui coule.  Le service: C'était drôle. Notre serveuse avait un accent de type Micheline Lanctôt asiatique. On ne comprenait pas toujours, mais elle faisait des blagues et nous aussi. Un morceau de robot en moins ici parce qu'elle avait perdu notre commande quand on s'est levées pour payer. Il a fallu se souvenir de tous ces sushis engloutis... pas une mince affaire. Surtout, une chance qu'on est honnêtes!   L'ambiance: Pour la musique, on repassera, les classiques du piano remâchés version plastique, c'est non. Rien pour halluciner côté décor non plus, mais c'est bien éclairé, j'imagine que c'est une bonne chose quand on mange du poisson cru. On était bien installées au bord de la fenêtre, question de rire des gens qui marchaient sous la pluie, et on a passé beaucoup de temps à observer les plantes pour savoir si elles étaient vraies ou fausses. Verdict: 50/50.  ALORS VOILÀ LES AMI.E.S C'EST TOUT C'était bon et pas compliqué, je vous invite à l'essayer !"}
{"text":"Nice place with friendly staff that has very fresh sushi and simple Vietnamese dishes all in one! My favourite part is that they deliver downtown even though they're located further east (Beaubien!) Cheers for Itamea!"}
