{"text":"My regular go to for Greek food. Have eaten at several Greek restaurants including on the Danforth but this place fits my palate and what I'm looking for in Mediterranean dishes. Consistent quality, fairly priced, take out service is quick. Only negative is the dine in experience; service can be slow when needing the cheque or a refill, and the elderly servers can be quite grumpy and indirectly rude when serving you. Decor is dated and dusty. Stick with takeout and you should be good."}
{"text":"Like the food, better than Mr.Greek. Prices are reasonable and portion sizes are decent. We ordered the souvlaki and calamari, both were cooked perfectly. The Greek salad was also very good. Perfect spot if you are in the area and refuse to drive to the Danforth"}
{"text":"Customer service by a certain server sucks. He actually yelled at me when he placed the wrong order which tainted my whole experience. I only know I wouldn't make that mistake because I try new Greek places solely for the purpose of grilled calamari and not fried. 

The food itself was exceptional, he just ruined my dining experience. I will not be returning anytime soon for that purpose."}
{"text":"Was in the restaurant for an early lunch and it was awkward sitting there eating as the tv was playing a soccer game and no greek music was playing.   One waitor was rude as the others were fine.  Sides to our meals were on the small side but food tasted great."}
{"text":"My friend had her birthday dinner at this restaurant last year. I ordered the chicken souvlaki and found a dead bee lying under my steamed vegetables.. I didn't say anything because I didn't want to ruin my friends event. I just hope they're more careful and catch these things before they serve it. Other than that, the atmosphere was nice!"}
{"text":"Emparassing at how they are trying to save money!  Greek salad has only 1 olive; bread well let's just say they prefer you eat half a slice and if you ask for more the look on the servers face is like how dare you!  A total customer service training is in order.  Food is ok but customer service is bad enough that I definitely will not go back.  Hope the savings in the olive and bread is substantially to make up for lost business!!!"}
{"text":"Great Greek cuisine. The gyros are great. Both chicken n pork souvlaki is excellent. The service n good"}
{"text":"While the food is decent, the waiters are all 45+ and kind of slow... upsetting to see that the waiters have each been there for years on years and are pushing retirement. 
The ceiling is cracked, the floor is very dirty, and the garlic bread baskets were even dirtier! Their website is outdated and on top of that whenever I ask for a take out menu... THEY NEVER HAVE ANY. The food is okay, my friends always come because it's basically the only Greek restaurant in Markham. I got a salad last time and my olive had a finger print on it. Last time I came I was interrupted in my meal with the owner (Simon?), he was screaming (top of his lungs) at a guy telling him he didn't deserve to eat there. (YIKES) Pushed me to write a review finally after the last scream (Customer: I PICK UP EVERY WEEK AND YOU'RE SAYING I DON'T DESERVE TO EAT HERE?). Yikes. Hope my friends stop dragging me to this outdated, dirty restaurant, run by a very rude owner."}
{"text":"I had been to this place for lunch several times on different weekend and weekday. Every time my friends and I certainly ordered 3 different kinds of meat - lamb souvlaki, chicken souvlaki and pork souvlaki. The food all came out so tender and juicy having a very good appearance and smell that makes you want to eat. Each dish was also served with roast potatoes, veggies, rice and tzatziki. I really like its tzatziki which is cool yogurt and cucumbers combine. It's the best Greek dip ever for lamb, chicken and pork... And one of my friends really love the roast potatoes and she's able to finish every single piece on the plate..."}
{"text":"Great food but disappointed with wait times. 

Ordered food online at 4pm with a set pickup time of 6pm. 

Went into the restaurant to pick up, but food wasn't ready. After waiting and seeing customer after customer, coming in and picking up their food without delay I was finding it hard to believe they ordered before ours. 

Every ten minutes we would recheck with the take out counter for our food. After 35 mins of waiting for our food it was ready. 

 Not sure why a family dinner for four took so long to prepare.

Because how rude the staff was, lack of service and understanding, I would have to give their takeout service a 1 out of 5."}
{"text":"We had the dine in the 1st time here and the food was cooked perfect and everything tasted great, I usually get the large Gyros dinner with 2 sides and my girl usually gets the chicken or lamb souvlaki dinners with a couple sides, we couldn't finish it all and had to take it home, it was just as good the following day as a leftover.

great experience on food since my girl use to live down by the beaches and Danforth area and I've been dining on greek food for 30 years already. with that being said we've since moved up to Markham and we always get our Greek Food from Ithica on a take out basis and enjoy our food at home.

the only reason why I'm taking away a star is over 1 instance in our take out order we found 2 bristles in our meal, like the black ones from brushing down the grill (not metal or steel brush) and so we've taken a 6 month hiatus from them.  since being back and having take out for our last 3 meals, everything has been back to its great delicious standards.

Tip on take out: if you are ordering fries with your large meal (you get 2 sides), they've gone to bagging your fries on the side and putting it in a separate brown bag due to customer complaints/requests that the fries get soggy if thry had packed it in along with your dinner.......now here comes the good part, because of the absence of fries in the container they pack up your dinner in a slightly smaller container BUT you get more of the Protein (found this out for my gyros dinner) and/or they pack in more of the second side that you've ordered.

as for parking in that lot, it gets busy, try parking around in the rear of the resturant."}
{"text":"Ithaca is a cute place with slow service but really good food. The hummus was just right, the garlic bread had a DELICIOUS  sesame crust that I would never have thought to try myself, and the chicken was well-cooked and nicely spiced. The portions were large, so bring a big appetite or bring a friend. Even the steamed veggies that came with the souvlakis were delicious!"}
{"text":"I placed a huge catering order for a Saturday afternoon baby shower and I couldn't believe how great they would be.  After a bit of confusion about where to park (I couldn't help because I was in an unfamiliar place too), everything went uphill.  Condiments were plentiful and tasty.  I couldn't believe that they would give me a whole bottle of ketchup for the small serving of fries that I ordered.  The portion sizes were gigantic and well wrapped.  Best of all, the chicken was still moist.  I really want to say again how great everything was.  Thank you Ithaca."}
{"text":"Nice decor and good food. We have been here before and when our daughter wanted Greek food for her sweet16 celebration, we automatically thought of Ithaca. 

We had the elevated section for ourselves and hosted 27 people. We were allowed to go earlier to decorate the place, which was nice of them. 

It's probably the best greek restaurant in Markham."}
{"text":"I just hosted my baby shower at Ithaca Restaurant. We had about 60 people attending. The staff made sure all our needs were met. They had the tables set up perfectly and the restaurant was very clean from the moment we walked in. The atmosphere was great! The food was delicious and the portions were huge. We had a greek salad and chicken breast with potatoes and vegetables. They allowed us to set up our own dessert table at no extra charge. I was very pleased with how everything turned out."}
{"text":"My family of 3 always get the dinner for 2 take out meal which is more than enough to feed the 3 of us. 

It comes with 6 pieces of garlic bread, 2 Greek salads, rice, potatoes,  2 pork and 2 chicken skewers. The potatoes are so good. A little on the oily side but tastes delicious. The meats are marinated well aren't dry like other Greek places I've tried. 

Honestly. SO FILLING. The 3 of us have never been able to eat it all. You definitely get good value with this meal. After tax it comes to about $31. 

Since I only get take out I can't really comment on their service. They do have quite a few people working in the take out area though :)"}
{"text":"Food is really good.  The chicken is so juicy. A more expensive than I would like to see it but in the area it is a solid option."}
{"text":"Best Greek in town. 

The Good : Quality seems to be very good. Food is cooked perfectly. Quantity is great,  at least for all non-meat foods. Salads, potatoes, veggies etc are all delicious and plentiful. 
Saganaki is perfect and the waiter even keeps a distance when lighting it up for kids safety. Folks, this is Greek style done right. Yup,  I went there. 

The Bad : Although the meat,  rice and tzatziki all taste delicious, the quantity is abysmal. I understand the economics behind the meat portions. But rice and yogurt? Really? That's tighter than my jeans in the 80s. 

The Ugly : Truly 'ugly'. The decor is not usually something I really care about but it is such a shame considering the obvious attempt to give the place an authentic Greek restaurant feel. The problem is the lack of upkeep. Dust and grime everywhere.  Also, there are entire sections of the restaurant I could be getting a lap dance in and nobody would notice because apparently lightbulbs are optional. What is the point of interesting decor if you cheap out on basics like light? God created light on the FIRST day people!"}
{"text":"Garbage. 

Ordered 2 dinners for delivery and got 1 Tzatziki to split between both meals.

Rice was bland and Potatoes were boiled.

I ended up 2 dinners of bland rice, boiled potatoes and dry lamb."}
{"text":"Good food, good portion, good service, nice design, great people with humour.

Inside the plaza at Hwy 7 and McCowan beside Congee Queen. The restaurant with the cool exterior design.

Came on Christmas Eve with my family. Didn't need to make a reservation, not busy but same good food and service.

TIP: there is reserved parking for guests to this restaurant right in front of their doors marked with a sign.

House wine was surprisingly decent and I'm a wine drinker!

TIP: Ask for the flamed appetizer, a great show. 

TIP : They have a separate entrance at the back of the restaurant if you cannot find parking at the front.

Food portions were quite big, they also offer garlic bread to start.

They encouraged their famous Greek salad however I wasn't blown away by it. 

Their prix fix menu provides a lot of food; the pita dip is enough to be shared so one prix fix may be enough for the table. 

Overall if you're coming, come hungry."}
{"text":"That lamb shoulder!!! 
I still daydream about it and my mouth gets watery. 
It was a special that day but I believe you can request it or even order it from menu(?)
It was empty. 
We were the only customers for the entire meal but it was day time so I think its more of a night time restaurant. 
It is a big restaurant with at least 100 seating, I believe.
Price wise, it is expensive but when you get the food, it was worth it. 
Money matters, what matters more is quality and this restaurant had quality."}
{"text":"The best Greek food I ever have. Mediterranean decoration, nice music and great food! I ordered Gyro on a pita and it was so much that I was very full. It costed me only $11.99 before tax."}
{"text":"The really horrible cracked ceiling decor is a little off putting when you first walk in, but who cares when the food is what you're here for and it's some pretty good Greek cuisine. Nothing spectacular, but all the standards are here and well done: souvlaki, gyros, moussaka, etc., etc. And of course saganaki! Who doesn't like flaming cheese? Can't really go to a Greek restaurant and not order it. Yes, it was flamey.  Unfortunately the ceilings were too high for me to do my usual quick evaluation of a Greek restaurants quality: the number of scorch marks on the ceiling! Haha, just kidding...a little. 
Come here for friendly service and reasonable prices. You'll come away full."}
{"text":"We've meant to come here for yeas and finally made the trip. We actually tried to go last Friday, but there was no parking. Because of the success and expansion of Congee Queen in the same plaza, there is very limited parking and the adjacent plazas have HUGE signs basically saying \"park here and get towed.\"

So we went on a Monday, and there was parking, but even then there wasn't many spots.

The decor of the restaurant is a bit cartoonish, but we liked it. Everything is painted in a variety of blues and there are murals and photos of Greece everywhere. If you are going to go for this style, it's best to go all out and that's what they've done.

They have one beer on tap, which is Robert Simpson, and it's quite decent.

For an app, I had the Greek sausage, which wasn't as spicey as it claimed, but it was pretty tasty, if a little greasy.

I had the mixed souvlaki for the main and the meat was really tender and succulent. It was some of the best souvlaki I've ever had.

The service was very attentive and the food came quite quickly.

All in all this was a very good experience,"}
{"text":"They have pretty decent food. The salad is fresh and the cheese is ample. The meat is moist and juicy and the rice is very fragrant. I thought the place looked very interesting. The service was professional. It wasn't good or bad. I would go back there again."}
{"text":"Best Greek food north of Toronto!  The chicken and pork skewers are so tender, their seasoned rice just melts in your mouth like butter and can't forget the soft but toasty garlic bread.  Definitely a take out recommendation!"}
{"text":"Ordered takeout, so service was efficient and perfunctory. Some additional signage would be appreciated at the separate entrance. The lamb souvlaki was excellent. The rice was well seasoned and perfectly cooked. Portion size was more than adequate. In terms of price, the dinner was somewhat expensive, but not excessively so. Would definitely order again."}
{"text":"Because of some JustEat promo, I ordered a Pork Souvlaki On A Pita for pickup today for $5.75 and I must say, I was very impressed! As I walked through to the back of the restaurant where the pick-up counter was, all the staff along the way were friendly and greeted me with a smile. 

My pita was ready to be picked up by the specified time and even though I didn't get to eat it until 20 minutes later (because I was running errands), it was still warm and really delicious!  I was worried it'd be soggy by then but nope! The tzatziki sauce was creamy and tangy, there were large and tender chunks of pork souvlaki, and the diced tomatoes were fresh and juicy. Overall, I was very happy with the quality of the food. 

I would definitely come back again to try their other foods!"}
{"text":"Our company orders party size trays from this greek place. Delicious rice potatoes and chicken skewers in markham! They also do delivery which is amazing. Such fulfilling lunch for all parties! Great wuality"}
{"text":"This is consistently the best Greek food north of Danforth and it may actually be the best. Their roast lamb is ridiculous, calamari ALWAYS prepared property, souvlakis juicy, best garlic bread... I could go on and on. So hilarious how patrons in the area will flock for greasy fried turnips next door instead of this gem."}
{"text":"This is by far one of my favourite restaurants in Markham. I have been coming here for years and have never been disappointed. I usually order the Chicken Souvlaki Dinner, it comes with rice, potatoes, Greek salad and taziki sauce. The portion size of the sides are small but if you order takeout you get loads more. I also recommend the Greek Fries, Hummus, and Farfalle Pasta. Everything you eat here is delicious!  The staff is very friendly and the service is good. The restaurants decor is a bit outdated and the prices are a bit high compared to other Greek Restaurants, but the quality and flavour of the food makes it worth it."}
{"text":"Best Greek food in the area. All the ingredients are fresh and the flavour is incredible.  

I have been coming here for many many years and have never had a bad experience. I recommend the chicken, it's always so tender."}
{"text":"I came here for lunch with a friend at 11:30am. I was surprised that we were the only ones here for the whole hour. I think it's more of a dinner place.

I was very impressed with the decor. It looks really authentic and all the colours are vibrant and matching. It has personality and warming :)

The owners are true to their culture too. We got 2 appetizers: Dolmadakia and Spinach Pie. The Spinach pie is very crispy, flaky and delicious! Though the dolmadakia is interesting too, i just find that the lemon sauce is oddly sour and artificial.

Garlic bread was greeeat, so soft bread, though they just put 2 in a basket ...  i wish there was more :(

We also tried the galaktompoureko, which is a creamy cold dessert. Kind of like a sticky pudding, it was sweet and okay.

I will want to come back next time for the spinach pie and try the moussaka next time!"}
{"text":"Our go-to Greek restaurant in the neighbourhood. Great service and authentic food. Mousaka and grilled calamari are a must!"}
{"text":"Just picked up take out to bring all the way home to downtown Toronto (was up in Markham for work today).

Ordered the special for two plus an order of spinach pie and a galaktoboureko dessert (custard pie).

The hot food was separated from the cold thus making two bags which I very much appreciated since I had such a long drive.

Loved the food! Chicken and pork souvlaki were seasoned well and super tender. Greek salad was fresh and the homemade dressing was delicious. Spinach pie was very yummy, great thin crispy phyllo with tasty spinach filling. Tzatziki was also great, enjoyed the strands of cucumber. Rice and potatoes were good too, well flavored.

Kinda sad this place is pretty far from my home as I loved it but I would absolutely return for either dine in or take out - yay Ithaca!"}
{"text":"Came here on a saturday night around 7.30pm. The place was maybe half full, we got a seat by the window so it was nice and bright. I got the lamb souvlaki dinner and my friend got the gyro dinner. Both meals came with a greek salad, which was a great portion size and felt fresh, it was heavy on the lemon though. The garlic bread was good it was warm, crispy edges and oh so buttery. The lamb dinner came with steams veggies, rice and a few potatoes which were all good. The lamb was alright, it wasnt bad but it wasn't amazing either, but satisfying nonetheless. It was still tender but missing the charcoal grill taste that I want with a souvlaki. The gyro however was great , flavourful and wasn't dry, i think it was better than the lamb. The tzatziki sauce was garlicy and cucumbery the way i like it. However, they don't have free refills on pop. 

The service was alright, nothing stands out. The meal came up to about $60 for 2 people which felt a bit expensive, but the portions were large and I left very full! Not my fav. greek restaurant ever, but the best in the area (would be 3 stars in Toronto, but 4 stars in the gta)"}
{"text":"In a quick summary, delicious and great value.

We ordered lamb souvlakis, and they were moist, well seasoned, and came with vegetables, rice and potatoes (plus the salad and garlic bread that comes with every dinner option from pastas to lamb roast). Our companions had the chicken souvlakis and someone had a chicken pasta and all said the food was good. We said we would definitely come back again :)"}
{"text":"If you're looking for great Greek food this is definitely a go to place! I went during the week to grab a quick lunch and the restaurant was fairly empty. The service was quick and staff was very attentive. 

I ordered the gyro that came with rice, potatoes, and a big garden salad to start. Each table also receives a bread bowl that was delicious. The portion size was rather large and there was enough food to take home. 

Service: 5/5
Food: 4/5 
Atmosphere: 3/5
Overall: 4/5

Would go again."}
{"text":"Went here for the first time with my college placement for lunch outing that I had planned as the clients were Greek and I figured they'd enjoy the traditional setting. 

The staff were very welcoming and accommodating of the clients' needs in terms of accessibility and also in working with a larger group which was great to see.

Food was pretty good, a bit overpriced. I had the mousaka knowing that it had eggplant that was likely gonna be a bit mushy and not my preference, I quite enjoyed it. The usual weird taste I have come to expect with mushy eggplant was a lot more subtle and I was really able to taste its natural pure flavour. The béchamel sauce was deliciously creamy and rich. I thought the dish worked well together as a whole and I would definitely love to eat another mousaka again in the future."}
{"text":"Amazing Greek grub!  The calamari was crazy good and fast!  The gyro was great, and the baklava was a blast!  

This place is run by a real authentic Greek family and you can really taste the traditions.  

Every single thing we tried was really nice and some of the best Greek food I've had.  

The portion sizes were quite generous.  My girlfriend and I split a spinach pie as an appetizer, and I'm glad we did as one would have been too much for just myself alone.  We also got some calamari and it came out very quickly. 

I'm not a huge fan of calamari in general but the breading on this was amazing and I really enjoyed it.  

The gyro plate had a very generous portion of meat.  A side salad came with dinner as well."}
{"text":"I wouldn't say the food is great. But it was okay.

I would give this place a 2.5 out of 5.

Presentation was kind of sad looking. Plain looking broccoli and cauliflower. Huge pieces. That should be cut further. 

I came with a group of friends for dinner. Service was good. 

I ordered the pork and chicken soluvkaki (small plates). The chicken was dry. The pork was flavourful and tender. Some charred and burned bits were on the pork which I did not care for.

The meal came with Greek salad. This was drenched in their house dressing. Too tangy for my taste. With a lot of feta cheese. 

Garlic bread shouldn't be called garlic bread. More like toasted bread and butter. No garlic flavour at all. Could be better.

Potatoes on the main meal were bland looking. Could have been roasted and coated with some more authentic Greek flavours. 

Meal was on the pricy side. $16 for a small plate with salad and garlic bread.

I will take a pass next time."}
{"text":"I've been to this restaurant several times and they've been fairly consistent, with good food and good service.

Ithaca is a decent sized place with a small patio out front and a separate entrance at the back for take-out orders. It's located in a plaza with a lot of very busy Asian restaurants so parking is often a problem, even though they have a few reserved spots right out front. FYI: there's a bakery and another restaurant opening soon right next door.

We started with an order of fried Kalamarakia (calamari) and it was seasoned well but I would have preferred it a little crispier. We also had an order of Taramosalata (red caviar puree). I've only had this once before, a very long time ago, and I can't remember how that version tasted. I feel like this should have had more flavour. I found it very subtle. Garlic bread is included and was toasted nicely.

I had the Gyro dinner with rice, roasted potatoes, steamed vegetables, and tzatziki. It was made and formed from ground beef and lamb. The flavour was good but doesn't measure up to the ones from Messini's (in my opinion).

My friends ordered the Pork Souvlaki dinner and Seafood Platter which they all enjoyed. Portion sizes are very generous and all our meals included a Greek salad.

The service was courteous and efficient, although there was a delay with one of the souvlaki orders because the kitchen missed it. Our server apologized several times. He had earlier recommended a Greek beer and it wasn't bad at all. I would have awarded a half point more if it wasn't for the kitchen miscue."}
{"text":"Was ordering at take out counter on May 19th before rush time. Orders were a little long. Maybe preparing bigger orders.
Young lady there was ok and helpful. Just wish they can speed things up though. 
No complaints ok food. Good value price money."}
{"text":"I like neighbourhood restaurants that are local gems.  They are like secrets.  All these goodies for me and my community only.  Ithaca is such a local gem. 

Service was great.  We went there for lunch this weekend, and it was the first time that my mother tried Greek food.  I asked for recommendation cause my mother cannot chew through meat chucks, so souvlakis are out.  He listened and recommended Mousaka, which my mother enjoyed and found interesting.  It was yummy and with lots of ingredients and well made.  What a great recommendation.

We ordered mussels as appetizer.  I order Gyro and my BF ordered chicken souvlakis.  The appetizer was a crowd pleaser.  The Gyro was fresh and well seasoned.  The chicken souvlakis was tasty and easy to chew through.  I even found the Greek salad and garlic bread tasted good and fresh.

I drove by this restaurant so many times and never tried it before.  I am glad I tried out it out.  Greek is its specialty.  If you stay with it, I don't think you will be disappointed.

Like what Arnold said, \"I will be back\"."}
{"text":"We decided to check out Ithaca when we saw that some of our friends had been there recently. I've lived in the area all my life and I never noticed it so I was surprised that there was a Greek restaurant so close by.

Located in a plaza on Highway 7 and McCowan, walking in was a surprise as the decor was very interesting and not what you would expect from the outside. Service was professional but not very warm. The restaurant still had a fair amount of people in it when we got there with more coming in. Very spacious and good for groups probably.

The menu has quite a bit of variety and we were a little surprised by the prices. We hoped that at least the portion would be big. We got garlic bread before our meals, which was good. Very generous with the butter. They were also very generous with the feta cheese on our Greek salads, but the dressing was definitely too sour. 

We got the \"light\" version of the pork souvlaki and chicken souvlaki meal and we were definitely disappointed to see that it was almost all vegetables. They overwhelmed the plate and it looked like at least two thirds of it was vegetables, like we ordered vegetables with a side of meat. And they weren't even well made - it was all steamed and bland and on the soft side. The potatoes were definitely taken out of soup so at least there was flavor in them. The meal cost about 13-14 dollars each.

However, the souvlaki itself (despite how little there was) was quite good. Crisp on the outside, tender on the inside and flavorful. Not good enough to make up for the price though. Portion was definitely not worth it. My suggestion? It's a bit out of the way but Hunter's Pizza at Huntingwood and Birchmount is far cheaper and gives you much more for similar quality - maybe the souvlaki isn't as good but it's still a good meal and at least you're getting your money's worth."}
{"text":"I can't believe this place still exists with all the Chinese restaurants taking over the area. Went in for curiosity and left pretty disappointed. At first glance the place looks really cool with how they decorated it but once you get pass it you realize its actually a depressing place. Lighting was dim and tables were empty. And all you could see is Chinese customers walking by and going into Congee Queen which is packed to the bones. Got a chicken Slovakia lunch which came with a salad. It didn't taste bad but I think I would rather have Jimmy the Greek. Service was great of course because we were one of 3 tables being served."}
{"text":"Unfortunately the price to food is terrible. The meat is amazing but you get like barely a mouthful. It came with boiled carrots or steamed, potatoes, cauliflower, and broccoli. Absolutely unacceptable."}
{"text":"Decided to give this place a second chance.

4 stars this time!
Food is good. Service is very good.

Parking lot is terrible, too busy."}
{"text":"Decided to come to Ithaca since it had been a while since we had Greek food. We were greeted friendly and seated at a table. As other reviews mentioned, the decor is older and could use a renovation. I ordered the seafood special and my wife ordered the pork souvlaki. She asked for more rice instead of potatoes and the server quickly took her request. The Greek salad was a good size and had lots of cheese. The garlic bread was delicious. When the food arrived we got exactly what we ordered, including my wife's extra rice. My wife said her pork souvlaki was delicious. The pan fried sole and the battered shrimp from my combo were delicious,  but the battered scallops were small. Too bad we were full because the desert looked delicious. Contrary to what other people have said, I found the price reasonable. Will go back."}
{"text":"As good as it gets for Greek in Markham. Have been here twice and will go more frequently. Have been with kids and without. Service was outstanding! Truly was. I've had the souvlaki dinner and the sea bass without disappointment and the tzaziki is delicious! Traditional Greek restaurant interior. They do have outside space but they need to close it in more as it faces the parking lot.

Highly recommend."}
{"text":"Terrible. Most bland non Greek tasting food ever. Souvlaki was dry and rice and potatoes has a weird aftertaste. It didn't taste like there was any seasoning. I know Greek food, I cook Greek food. This was lazy garbage. Never again. You want Greek go to Louis Kouzina at 16th and woodbine. Cheaper and amazing."}
{"text":"My very favourite dish is the grilled calamari. It's my special treat because I find it a little pricey. I also wish they would deliver earlier in the day."}
{"text":"The restaurant is quite spacious and it didn't seem like out table was cramped for our large group. The service overall was good. Waiter was friendly. The interior is decorated with a Greek influence. It is very casual, borderline upscale casual. 

The orders were placed fairly quickly and very efficiently. They asked ahead of time if we wanted separate bills. The garlic bread and side salads didn't take too long to come out. I really enjoyed the garlic bread and salad, even though they were nothing special. There was a lot of feta cheese on the salad, which I really enjoyed. 

The main courses came out soon after. I ordered the chicken souvlaki dinner. The chicken was juicy and still nice and hot. The plate was not very appealing as the presentation was lacking. There were a few pieces of veggies and a very tiny bowl of tzaziki with a couple pieces of potatoes. The potatoes were delicious and I wanted more. The veggies were nothing special. Just seemed steamed and lightly seasoned. And I definitely needed more tzaziki with the meal. There was also a tiny bit of rice but I didn't care for it at all. I compared the size of the meal to the small dinners that were ordered and it seemed like the only difference was that rice was included in mine. I would order the small one next time as I did not think it was worth spending almost $5 more for rice. 

Overall, I say this restaurant is not bad. The prices are too high for the amount of food that you get. If the quality was above and beyond, I would not complain of the prices. It might be worth it to try this place once but I won't be returning any time soon."}
{"text":"Ithaca is a nice little Greek restaurant. The interior gives a vibe as if you were in a restaurant in Greece.  The staff here are very pleasant and helpful (it almost feels family owned and operated) and the food is amazing! 

I'd recommend the gyros dinner ($14.95) and it comes with garlic bread, Greek salad, a large portion of gyros, roasted potatoes, rice and steamed veggies! 

Overall, the best Greek restaurant I've been to in the suburbs.  I'm definitely going back."}
{"text":"Food is on the salty side... and they might need new servers. Decor is nice with bright blue painted everywhere, which somewhat reminds you of Santorini. The restaurant is a good size and space between tables were adequate to move around. Atmosphere is nice and calm; the seats extend to the far back of the restaurant so if you come here with a group that would be a convenient seat. 

So we came here for a birthday. Reserved a spot and said it would be for someones birthday. Person on the phone kindly said they would provide dessert and singing etc etc. on the house, which was nice of them. Got there, told them we have a reservation for 4. They didnt ask for the name or time and just gave us a seat by the fireplace, which was nice. 

Ordered the angel hair pasta with tiger shrimps and mussels; mussels were small and salty. The shrimps were decent sized, texture was nice, and more than the usual number you would get. The tomato sauce was on the sour side... portion was very generous. The dish wasnt bad... but if I were to visit again I wouldnt order that. The chicken breast dinner was nice and tender and not overly dry, same with the pork, but that one couldve had more meat - as is with other reviews here, the dish was mostly covered with veggies. The dishes were all neatly presented, though. 

As expected, because they didnt pay attention to our reservation, the birthday note was ignored, which was a bit disappointing. Other than that, it was a decent experience, but dont think will come back often..."}
{"text":"If there is no star choice ill put it!! Restaurant seems unclean ! Service is bad.. The waiter was so rude with us , i bet we didnt see his smile at all! Food was bad.. My husband ordered rack of lamp and it was bad, smells weird...and i ordered chicken parmesan and was chewy and weird.. I did not even end 1/3 of it,,, when waiter saw it he rudely said : well thats how the chicken breast taste! Appetizers were not bad ...i felt sick after going home... Dont waste ur time and just go somewhere else...god it shouldn't be a restaurant!"}
{"text":"Maybe I have a high expectation after reading all these 4 star reviews...

Maybe Ithaca having this huge menu that covers Greek and Mediterranean and end up everything is meh...

Maybe I should have order something else instead...

At least the salad and garlic bread tasted decently good...after that everything went downhill.

Fillet of Sole with Breaded Shrimp and Scallops ($19.95)
- The vegetables on the side is the most tasty items on my plate, cook perfect with a crunch
- My fish tasted really blend and mushy
- The breaded Shrimps has not texture... the mini scallops are tiny with more breading than substance

Seafood Linguine ($20.95)
- Don't ask me why someone would have order that in a Greek restaurant...  I know it would not be good already...
- The overcooked pasta is drowned in that \"light\" tomato.. look and taste like something I made at home (that's not a compliment)

Maybe Ithaca's meat dish is better? I don't know if I really want to come and give it another try?

Now I know why I always end up at Congee Queen next door instead!"}
{"text":"Went for a quick meal , excellent service , delicious food and warm atmosphere . Loved it and will definitely go again"}
{"text":"Drive to the Danforth for tourist-y food or find something up north. Not sure it is worth the drive to Pape to get meat on a stick - real tasty meat on a stick.
After scouring the web for souvlaki north of 7, Ithaca showed up on the radar.
Had decent reviews and it would save me the hassle of trying to park during dinner time off the Danforth strip.
Ithaca is located down restaurant row with limited parking for such a busy strip mall. The restaurant is flanked by Chinese and Pho restaurants. The Pho place is called \"Pho Quinn\" - yes, er...nice play on words.
The place reminds me of a Mr. Greek restaurant. You know, hand painted walls and a large menu served by older gentlemens. They had the standard fare and even \"Italian\" - go figure.
We had a variety of items and some good and some not so good.
The fried calamari was dark battered and was not crispy and light as other places I've been. The greek salad and the pikalia was good. The gyro was like all the others, and the various souvlaki was not a major standout either.
Basically, if you want a decent Greek meal and not make a long drive to get all the touristy ambiance with the food, Ithaca can be that place.
OPA!"}
{"text":"I gotta agree with the other reviews, this place is great :) It was my first time for my family and our waiter, an older gentleman, gave recommendations, answered our questions patiently and joked around with us. 

Food was great: grilled calamari was yum, my mom loves village salad (cucumber, tomatoes, and big slices of feta cheese), and the fried calamari was good but i'd pick the grilled over the fried. The special of the night was lamb shank and was fall off the bone good. 

We ordered greek coffee to end the night and our waiter came out to show us the little pot and the burner used to make it so that was pretty cool. This will definitely be the first place I think of next time I feel like having Greek food."}
