{"text":"This place had no cars in the parking lot at 5 pm on a Monday. Must be closed."}
{"text":"I had breakfast today at JJ North's.  I started with a serving of green salad with thousand island dressing, and sliced beets.  I followed that up with a heaping pile of bacon and hash browns with gravy.  I closed out with scrambled eggs and sausage.  The food was well presented and tasty.  The bus staff was very attentive in removing dishes.  I look forward to my next visit."}
{"text":"Went there for breakfast with car club, about 15 people, Service was friendly and lots of standard breakfast fare, all hot and fresh. Variety of eggs, sausages, French Toast, pancakes, fresh fruit and coffee/fruit juices. Just show up hungry and you'll enjoy the place."}
{"text":"The name on this restaurant has changed.  It used to be Hometown Buffet.  After reading the reviews for that restaurant I can certainly understand why they would want to change the name if the owners are the same.  That part of it I have no clue.  However, food sounds the same.  There were two carts for salads.  One was the green salad bar and that was probably the best part of the whole restaurant.  The other salad bar had hardly any salads on it.  The bowls were spaced far apart to make it look like more.  They definitely need to add to this.  Other than that some of the food looked like it had sat around for awhile.  Roast was over cooked and dry.  Other meats looked as though they may have sat out awhile too.   Carrot cake was crusty.  We weren't impressed so obviously we won't be returning."}
{"text":"When JJ North's took over what was an Old Country Buffet I assumed a smaller independent owner might be able to do something better. Nope, as hard as it is to believe it is actually much worse. Incredibly bland, poorly prepared, low quality food and very few items to choose from. DO NOT waste your money here - JJ's is for people who have already lost their taste buds and/or enjoy a $9 all you can barf lunch. Pathetic."}
