{"text":"The BEST in the area and the best ribeye anywhere(Actually my steak is better because I use charcoal and mesquite, but for local steak from a gas burner, this is as good as it gets.)!  Get the asiago and garlic steak topper and enjoy the aways great fresh vegetable offered."}
{"text":"My husband and I enjoy going to the Ride & Hunt Club when we want a really good steak. I have had their fish options as well and haven't been disappointed. It's in an old house off Rt. 30 that could use a little more curb appeal but once in the dining room is very nice with linen and all that you would expect for a nice dinner. The chef does a great job with the weekly menu selections. Good wine list. I'm so glad they finally went non smoking because that actually deterred us from going before. I recommend making reservations if you plan on going as they can get pretty busy. Membership (nominal fee) required for dinner but open to public for lunch."}
{"text":"Ok not much more to say the food selection needs N update . Some of its a little to fancy for that kind of place. I'mean sometimes you just want ice burgh"}
{"text":"Good food. Decent service. Manager is a pompous ass. He is the reason we will not be renewing our membership and will not be returning."}
{"text":"This place has really fallen down. Many management and server changes. They are woefully unprepared. Service is unbelievably slow. Key menu items are unavailable during prime business hours. How are you out of so many key times at prime dinner time?  Multiple times we have waited 45 minutes to get our appetizers!  Kitchen not paying attention to order requirements - order medium rare and get well done. Split deliveries of food - you get your appetizer and are finished before others in your party get theirs. It's time for us to look at other options.  This business is ineffectively managed."}
{"text":"Friendly service and great place to stop with friends especially for a late night bite. Ride and Hunt easily accommodates multiple separate checks, too.  Best wings ever! Rochelle delivers excellent customer service and club has had some nice improvements over the years, too."}
{"text":"It's a dinner club so I've only had there lunch there because it's open to the public. I've never had anything bad but the experience has been the opposite. One day I called to pre order our lunch for a group of 6 on a Friday I was told the cook never showed up for work........ oookkkkaaaaayyyyyy. That was it for me, haven't been back since. And it is a little pricey"}
