{"text":"Remember, this is a Chinese buffet. Expect quantity, not quality. That being said, the restaurant still needs improvement. First off, the cleanliness is an issue. Most of the glassware and utensils still looked unclean. Bathroom is not kept well. Service was okay. Plates were taken away at a reasonable rate. Water took a bit longer to get to our table.
The variety of food was alright. You have all the standard American-Chinese food (General Tao, Sweet and Sour pork, egg rolls, fried rice and noodles, etc. However, there was some dim sum options. Food was not great. Some food is reheated and placed in warmer for long periods. Other food just is flavorless or too salty. However, price is reasonable for you are getting. If you are looking to accommodate a lot of people at the last minute who have different taste. this buffet is not bad. If you are looking for quality Chinese food, avoid."}
{"text":"BOUGHT THE TEAMBUY DEAL...

and i regret it. Teambuy offered 2 lunch buffets for $10 (tax and tip excluded). The price was very cheap but the saying \"you get what you pay for\" did not live up to its meaning. My 10 dollars could have gotten me a better experience elsewhere.

Reasons I disliked the buffet

1. Poor quality of food - many food item in the tray were not steaming hot. They were lukewarm or sometimes cold. The buffet decided to not use the heating system beneath the food. 

2. Location is inconvenient - for those who take public transit, getting there is difficult. This buffet is hidden next to a motel. You would not expect a buffet here.

3. Lack of consistency - Some unpopular items like onion rings and french fries (and more) were not re-made after it lost its freshness. As a result, I had soggy or dried food.



Reasons I liked the buffet

1. Very polite and friendly service!!! - My friends and I were greeted as we walked in and our waiter was friendly. 


Reasons YOU might like the buffet

1. Price - for 5 bux + tax & tip, thats a steal

2. You just love AYCE


REVISIT?  unfortunately, no"}
{"text":"We were attracted by the very cheap promotional price and decided to give it a go. We did not have to wait too long but it was obvious that the hostess did not know what shewas doing. 

The decor was not bad and quite modern, and the seating was quite spread out which was good. We did not have any waiter or waitresstake our drink orders.And even when we did order, it took about another half an hour to actuslly get our drinks due to how busy the workers all were. They were nice people though.

The food selection was not large compared to other buffets such as Imperial or Mandarin. Also, many dishes were either not labelled or labelled incorrectly. The fried rice was stale. The pork buns were made in a strange way - it seemed like the pork was mashed up (and you usually expect it to be red inside but it was a yellow brown colour). Also, the eggtarts were overly buttery. They ran out of food easily and did not rrfill quickly enough. It was obvious that they needed more wrokers both in the back and the front. The ice cream selection was large though, but there were not a lot of other desserts.There was no shrimp in sight. 

The toilets also did not flush properly even after flushing 4 times. It was a bad experience, and none of us plan to go back there again, as the promotional price will be gone tomorrow anyways."}
{"text":"I came here with my family for the special lunch promotion - $7.99 for the lunch buffet. They lowered the price to celebrate their one year anniversary.

For the price, the food is not bad. I'm not a fan of buffets. The best buffet I've ever had was in Vegas and nothing can really compare to it.

However, trying to put all the biases aside, I think for the price, this buffet is okay but if I had to pay more, then I will probably lower the number of stars I'm giving out.

The desserts were good, they had many choices for ice cream and the garlic bread was delicious.
However, the crunchy food were not crunchy and I think the selection of food was just average. Nothing special really stood out.

I would give this place a try if you want a cheap lunch. Just make sure you come before December 13 on Monday-Friday to the get deal!"}
{"text":"A group of us from work hit this location a couple of weeks ago.  This used to be \"China Buffet King\" and has been re-branded as \"Jade River Buffet\".  It sits off a HoJo (hotel) location.

First impression - but for the name change, nothing else is different.  Period.  We came here a few years ago and experienced about the same quality then as we did now.  Something about it - it just doesn't get the traffic like the bigger named buffets such as Mandarin and Imperial as such everything suffers IMO.

On the plus side they are running a promotion until Dec 13th for $7.99 lunches and they do have (as did under the previous name) a selection of Dim Sum.  Mandarin only has Dim Sum during their festival event and even then there isn't that much.  OTOH, IMO the Dim Sum's at buffets tend to be lower in quality and the selection is typically quite poor.  That is the case here - Har Gow - sure - but thick flour wrapping and not much shrimp.  Pork Sui Mai wasn't too bad and the chicken feet were probably the best and most tasty.  A bunch of bean paste buns - I didn't see any BBQ Pork buns.  They have Egg Tarts - very poor crust and as with most things outside the Dim Sum - warm to cool.  Someone at our table liked the soups.   They had some BBQ pork slices - cold and tough - yeah!  IMO \"Star Walk\" (Buffet) in Scarberia has far better Dim Sum if that is what you are after.  In my world, Dim Sum for two alone is about $30 - so I know good dim sum from crap.

McWhat?  Hot side cold and the cold side hot?  Yeah.  We arrived just before noon and a lot of the dishes were not very hot in fact cold - only the chicken wings were hot.  After our first set of plates we went out and everything appeared to be updated with hotter fare.  Still the selection was poor.  Not a great selection of meat dishes (they had some beef dish which contained tough chewy beef pieces - inedible); fish was a toss - I believe they had salmon which some at our table liked but most did not.  They had onion rings - again cold.  

Couple of noodles.  When I saw the Singapore noodles it reminded me 100% of the prior banner name.  Again lack of traffic - instead of a heaping hot tray of noodles (as you would see at Mandarin) - there wasn't that much and was pushed to the center.  (that is what we saw when we first went out around noon for the food the first time).  Then later there were more noodles - not completely full though.

Overall the consensus was a poor selection of hot food.  the selection of food was poor - Someone commented that there were no \"torpedo\" style shrimp.

Deserts?   Actually they were the saving grace - a couple of puff pastries with not too sweet filling.  Some nice cakes as well - likewise not too sweet.  A number at our table enjoyed the fresh fruit - most liked the pineapple.  But IMO these are basics in the buffet world.  There isn't much skill or work required to unpackage these things and put them out on display.  I am sure they didn't make one cake from scratch.  So yeah good quality there.  However, as deserts go - this is no Mandarin - go there for better selection.

At $7.99 does that match the value?  I still question that actually.  For that money I could drive to a half decent Thai place and have a soup bowl and be thoroughly satisfied.  Sorry but the cold food is a turn off as it was years ago.  Nothing has changed.  Nothing here screamed out \"I want more of that\" - and with buffets one learns to pick a wide assortment the first go; pick up a few things the next; then swoop in the next one or two plates more with the stuff they really liked.  Not here.  After two plates of hot I had enough - which is unusual.  

I think the price shoots up to $13.99 shortly - making the value even worse.  And in case someone wants to know - I cannot say if at $13.99 there will be a better selection; but I will say years ago the price was about $11.99 or $12.99 and literally I see no difference.  I think the one reason why this place still exists at all is the AYCE Dim Sum - some I guess aren't that picky.  

Finally I went to the washroom to wash my hands - no issues there - clean.  Also 10% mandatory tip for groups of 6 or more.

Unimpressed overall.

jeff

PS: If you are asking, I am not a shill nor am I the daughter of the owner.  Even someone coming out of a hole for the first time to eat their first meal would question the quality of this place - so for \"Melody T\" to say this is the best [Buffet] she ever had in all of Canada is a complete farce and the 5 stars is - in a word - a lie."}
