{"text":"Ok we keep giving this place another chance and its not getting any better. One night We sat unnoticed at the bar for 15 min. The bartender was busy making drinks for the tables, but nobody was servicing the bar. Another night our food took forever, like 55 minutes, and since my husbands side salad came with his meal he asked the server to put his food back under the warmer so he could eat his salad first. I would think a manager would apologize or at least acknowledge this. I've only seen the Manager sitting with people, talking. Someone needs to be making sure the food is coming out in a timely manner, like 20 min or less. I don't think we will be in for awhile. Hopefully they work out the kinks."}
{"text":"A much needed addition to our SE Gilbert area. Great atmosphere, friendly service and good food. Nice daily and Happy Hour specials.  I also had a blast at their Saturday night Karaoke. My family likes to ask for Brandon as our server, but whether we sit at the bar or a table we have always had great service. My family's favorites are the \"gold-rush\" wings, stuffed jalapenos, deep fried pickles, white pizza and the ruben sandwich. This neighborhood bar and grill gives me that \"small town neighborhood\" feel.  We love Jake's."}
{"text":"Note to owner!  Customer service and good food creates success.  When you are there you should be walking around talking to people not sitting in a corner.  Also seeing our waitress every 30 minutes when she has 3 tables is not good.  Some food is good some is bad.  Your menu is as big as the Cheesecake Factories so that would explain the Microwave bacon on a BLT.  Bad!   If you want better success than the former Nick n Vitos then limit your menu, better quality food, offer a happy hour and get more friendly!  We are starving for a good quality restaurant around this area.  The positive here is quality beer (new Belgium, four peaks) is $5 for a 22oz glass.  Go here for the beer is about it."}
{"text":"Try the wings! Best I've had around here. I got grilled an was very impressed. Friendly service and a great place to watch a game and have a beer. My new favorite bar hands down."}
{"text":"I would like to confirm some of the reviews and or dispute them. I live in Gilbert and moved here about a year ago. I tend to go with the underdog of things, and Tailgaters is a sh*thole! I was relieved to find Jake's!   The food at Jake's is better than Tailgater's, decor is better, staff is prettier, but both are equally unwelcoming. I think it is more how AZ is, friendly at first, but business oriented. People go to bars to chat, watch television and be out. If staff was moving more chatting everyone up and your food could be crap, but it'd be a welcoming place to go. Suggestive sale goes a long way!"}
{"text":"I really enjoyed this place. I am from San Diego and took the grandkids there.   Food was veer good  But what made it was the chick with the \"tats\".  She was OUTSTANDING. It was the best service I have had on a long, long time."}
{"text":"Wow, I feel bad for taking this long to write an update. Jake's has been open for a little over a year now, and although they've had their growing pains, I think they finally found their groove.  Here are all the reasons I love the place now:  1. Their menu is varied and consistently good. We're talking anything from quesadillas to pulled chicken sandwiches to pasta, and it's ALL good. B. The kitchen is open until 11pm.  In Gilbert, that's HUGE. c. The service is great now! The last few times I've been in, I've been pleasantly surprised by the friendly & knowledgeable servers and bartender (ask for Britney!). 4. The pizza and wings are delicious. :) Z. It's a locally owned place that had its issues to begin with but has focused on improving and becoming a great local restaurant and bar.  I'm happy to say I have a new place to call my go-to local bar... and it doesn't hurt that it's across the street from my neighborhood. ;)"}
{"text":"I love this place because it's so local!!! It's a 5 minute drive from my house.  The wings are delicious grilled however this was the second night in a row that they ran out of the smoked wings.  Service was decent. However, at the end if the night we were outside waiting for our ride and we actually had a server come upto my husband and tell him that he had to get out of the chair that he was sitting in because they were closing up the patio.  To me that's not good service and I've been in the industry for years!! You don't rip a chair from under someone when they're sitting in it...I would possibly go back however because it is so close...."}
{"text":"Just an ordinary sports bar and grill....pretty cool little place, good service, but food was just ok.  Nothing special about the grilled chicken wings and the garlic fries are  horrible (too greasy and no garlic flavor).  Burger was decent, not great!  Cool place to catch a game and have a beer, but eat at home before you go there."}
{"text":"I went here for the first time with a bunch of friends and it was mediocre.  The margaritas were horrible in my opinion.  Made with that super sweet, lime cool-aid tasting mix.  Yuck!  Our party of like 20 ordered nachos, fried pickles, calamari, and pizzas.  The nachos just didn't have much flavor...although I ate the ones without meat because I'm veggie.  Maybe the meat ones were better.  The fried pickles were yummy though!  The veggie pizza was decent... lots of veggies on it, chopped up small, so it was very easy to eat.  It also lacked flavor though.  I don't know...won't go out of my way to go back, but if a bunch of friends want to go, I'm sure I'll tag along.  :-)"}
{"text":"Worst burger ever, they give Tailgator's a run for their money for the dryest burger in town.  For one, it's really small compared to the bun they serve it on.  It's almost like it came frozen and they throw it on the grill.  My friend had the meatball sandwich which was good but they don't put marinara sauce on it, which defeats the purpose of the sandwich.    The atmospher is kind of wierd, it's just one big room and if you sit in the middle there is no privacy.  I feel like I'm eating in a cafeteria.  Live and learn, I won't go back.  If you can't cook a burger, just like Tailgator's...those places don't deserve business."}
{"text":"Drove by this place on a Saturday afternoon & it's completely closed. Signs up on the windows saying the location is available for rent.   Guess all the bad reviews finally caught up with it."}
{"text":"Awesome service AND the beer prices are the best in the. Valley! $1.84 for an O'Douls (as it should be) and $5.50 for 2 Kiltlifters! Nice place, friendly people!"}
{"text":"This was my fifth time there and most likely my last. Food has been good there before but seems more miss than hit. Today we walked in and were seated right away, the waitress seemed to be the only one working the resteraunt so I really dont blame her for the poor service we had. After a very slow order process I looked up to see our waitress but not with our food instead she had a menu as they were out of what I had ordered 30 minutes prior, the bad part is 15 minutes before that they told my wife they were out of what she ordered. This has happened here before but this time was the last straw, I am guessing their building will be vancant soon."}
{"text":"Having limited dining options in Queen Creek, I was excited to try Jake's Bar and Grill after a friend told me it took over the location of Nick & Vittos II. Well, I got that out of the way.  The restaurant was full, but not overly crowded. The hostess was able to seat us after few a few minutes of cleaning off a table. The server was very friendly as well and arrived promptly. Having recently had the fried pickles at Texas Roadhouse, we ordered them here. They were...different. Rather than sliced pickle chips, these were pickle spears. None the less, I ate them and they were adequate. Nothing extraordinary.   For drinks my friend ordered a sweet tea. I asked what beers they had on tap and the server mentioned Guinness and Kilt Lifter - which made me recall another restaurant had a combination of those called the Guilt Lifter (kind of like a black & tan). I asked if he could do that and he said yes - he believed it was called a black & blue at Jakes. Looking back, that was the highlight of the meal. The tea tasted like instant Nestea I would have made back in 1982.  Nik F. wrote that the food took forever to arrive. I will say that despite the busy Friday night, our food arrived quickly and the service was generally very good.   The friend ordered a pasta with chicken in a basil cream sauce and I went with the buffalo burger. The pasta came with a salad  - which was just a typical salad with some croutons and lettuce. My friend didn't eat it because the lettuce was brown and didn't look good. The entrees arrived and again we were met with disappointment. The basil cream sauce on the pasta was very runny and didn't have any flavor. I wouldn't have know there was basil unless I read it on the menu. When the server handed me my plate she asked if I had every had it before. No, I said. \"You're in for a treat\" was the promise. Apparently the bar is law. The bigger was large, I will say that. It had lettuce, onions, tomato on the burger. The burger was odd too - it was breaded and fried giving it a second layer. It was dipped in wing sauce and topped with a drizzle of what I presume was blue cheesy. It was still really pink in the middle - I like medium, but this was maybe medium-rare and it was very sloppy. Just cutting the burger in half I was met with a lot of juice, grease, and sauce. I ate half it is and that was plenty. The sweet potato fries that I chose as my side were okay, but tasted frozen.   I overheard the table next to me state their pizza was very good. I am glad they enjoyed it because the burger I had and the pasta I tasted wasn't anything to write home about. It tasted as if I opened a restaurant. I was initially happy to see a newer restaurant in the area, but if tonight is any indication, I don't think they will be around long-term."}
{"text":"I had lunch at Jake's today - on their first day open to the public (12/13/2010) with my wife and daughter. We were hoping that Jake's would end up being a quality neighborhood spot as there aren't very many in the area.  Fortunately, we weren't disappointed. We were thrilled, actually.  The decor was nice and simple - booths around the perimeter with tall tables in the center of the restaurant. There's a large bar on the back wall of the restaurant with seating for 15-20 people. There's also a smallish patio on the side with at least one TV that I saw. Inside the restaurant, there are probably a dozen TVs - plenty for whatever event you're there to see, for sure.  The menu was well-rounded and pretty extensive... all your favorite appetizers, soups/salads, burgers, sandwiches/wraps, and BBQ, pasta, and steak dinners with several side dishes to go with whatever you're having.   Beverage-wise, there were 6-8 beers on tap, a full bar, and your regular assortment of soft drinks. There was no mention of happy hour drink or appetizer deals - but again, the place had been open for all of two hours when I was there.  The staff was friendly, attentive, and excited to be part of a new endeavor. They told us about their successful pre-launch party for family and friends and all seemed genuinely happy to be there. They were willing and able to answer our questions and make recommendations as they'd had the opportunity to sample the menu. They were also eager to tell us that everything is scratch-made at Jake's - their pizza dough, their cheesecake... even the pasta for their pasta dishes - all done on site. They also have a trailer-sized smoker that they do their BBQing in. In my experience, this focus on authenticity and quality is pretty rare in a neighborhood bar/grill and certainly seemed to be a point of pride for the staff.  Prices were just what you'd expect for this type of place. Most everything was under $10 with entrees and pizza in the teens.  For lunch, we split some bacon-wrapped jalapenos for a starter (excellent, have a beer handy to put out the fire though). My wife had a chicken-caesar wrap which she was really happy with and I had the buffalo wing burger, which was unlike any burger I've had (think: chicken fried steak + wing sauce on a bun. Roll up your sleeves and get 'er done.). The garlic fries and sweet potato fries were worth the $1 to upgrade from the standard fries.  All in all, a very promising start for Jake's and I wish them the best. This area needs quality options. I'm looking forward to my next visit."}
{"text":"Great place for beer, wings and fried mushrooms.  Friendly staff and I have been back for more so I'm a fan."}
