{"text":"Walked by the food cart on Library Mall and noticed a sign saying \"Goat Curry\" or \"Goat Stew.\" I can't remember. I like goat so I gave it a try. Yes, me like! There was plenty of flavors to go around and a fair share of goat. Enough to make the $9 worth it. I don't know if this is a special or regular menu item, but I hope it is available every time I go."}
{"text":"I had the Jerk chicken, no meat pattie that day :(, Have to come back, when I do I'll update. 
  The jerk chicken was pretty good, which equals Great for Madison. Not really spicy like jerk can be, though maybe medium by upper-Midwest standards; your mileage may vary. The chicken breast and other pieces were moist, well-cooked and served atop dirty rice (like jambalaya but no meats). The rice made an excellent juice catcher. 
The only complaint besides meat pattie outage would be the paper tray the dish came in didn't really lend itself to stable transport via car over the messed up roads. Easily something most won't encounter and no big deal. 
They have Jamaican champagne cola and ginger beer alongside usual drinks, a nice touch. 
Service is friendly and fast, though there was a wait while the cart was unattended for a few minutes while the owner went and got something.The jerk could have used a bit more spice in my humble opinion, or sauce. Then again I have a sauce thing.
 I'll definitely be back to try the rest of the menu."}
{"text":"I've not yet dined at their storefront location on Willy Street, though I've passed by it half a dozen times. I just love the convenience of the food cart they have set up on Library Mall during the lunch time hours. 

In the few times I've had Jamerica I've always ordered the Happy Jerk Combo. It's perfect for the indecisive as it is  1/2 pork and  1/2 chicken with red beans and rice, so there's no need to settle on just one meat. Awesome. What's also great about this dish is how huge it is. Really, it's easily enough to last you two good meals. And these will definitely be gooood meals because Jamerica packs their dishes with Flavor. Capital F. 

Every time, I leave Jamerica a happy customer not only because the Happy Jerk is delicious, but also because they're always crankin out the ever-optimistic, breezy Bob Marley tunes.

Nice slice of Jamaica man."}
