{"text":"excellent little cozy place .. took my wife there  for first time when we started dating about 2 yrs ago and was first time for me even though I passed it all the time . really good food and we wait for it to open for the season every year"}
{"text":"Really cute and quaint! Stopped by here while I was traveling through the town on business. Just got a salad and some soup but it was good, quick, and reasonably priced. (Not dirt cheap, but cheap enough and well priced.) Staff was friendly. I'd come back again if in the area."}
{"text":"All right, so your typical clientèle for Janet's is not really the sort to get on Yelp and read reviews, or even use the internet at all, really, but I feel like it's worthy of a review anyway.

Janet's is a landmark in the little village of Harrison City.  A little barn-shaped restaurant on the busiest corner in town, it is the place to go for a down-home atmosphere and good American fare.  

The decor is very small-town America, as is the atmosphere.  If you've any familiarity with Penn Township at all, Janet's is the exact kind of place you'd expect to find there.

The food is your basic American food, including burgers, sandwiches, and pasta dishes (if I recall correctly.)  I highly recommend their burgers, and their zucchini fries are some of the best I've had anywhere.  The price is pretty low... It's not dirt cheap, but it's cheapish.  MAKE SURE YOU BRING CASH! I don't know if it's just to match the \"yesteryear\" atmosphere of the place, but they never bothered to put a credit machine in.  There's an ATM at the gas station across the street, if you forget.

The wait staff is very friendly, as is Janet herself, should you see her there.  I also like that it's locally owned and independent.  Not a lot of those places left, in the diner market.

Downsides? The aforementioned lack of a credit machine is pretty off-putting.  The street corner on which it is located is a traffic nightmare.  The town in which it's located is hugely conservative, and definitely out of the way for anyone who doesn't have business there.  Still, if I ended up in the area again, I'd eat here for sure."}
