{"text":"I used to love coming here when it was still Chingu. The food and service was exceptionally good. It was cheap and affordable and it still is. I was actually nervous when I found out that it had change management and suggested it for a celebration dinner of 10 people. 

Fortunately enough, I was overall impressed that it had lived up to to my expectations and did not disappoint my friends. The waiters/ waitresses were very polite and patient. The ones I spoke to could either also talk in Chinese or English.
We came at a time when business seemed to be running slow (Friday afternoon) so since we were the only ones on the second floor, they were quick to help with whatever we needed. Of course that was until it got busier later in in the evening.
Food is still good and affordable. Will definitely come back."}
{"text":"This is one of my favourite korean bbq places for so many reasons. The staff are so welcoming and friendly, it feels like going over to your korean aunt's house. Their ayce options are pretty great especially if you love pork. Their sides are delicious and abundant. And hello! you get a delicious tofu soup with your ayce order! Overall, you get a fantastic bang for your buck."}
{"text":"Very nice, no complaints. Didn't order the All You Can Eat but the sirloin beef for 2 was already enough to qualify as binge eating."}
{"text":"Went to Jangwon for the first time this past weekend.

We ended up ordering the option that comes with all 4 types of meat for $19.99. Usually at Korean grill restaurants, I find that they start you off with only a little bit of meat so that you constantly have to ask for more but not here! They start off by giving a lot of meat. 

The owner does recommend bringing the bulgogi last but that's only because it is a sweeter than the other meat and more importantly is cooked on a separate plate than the other meat. In terms of the meat, it was a good selection was tasty with the dipping sauces.

Other info?
- Sauces include a sesame oil and fine salt dip and a Ssamjang (fermented soy bean paste with hot peppers - though wasn't spicy)
- Sides include rice, lettuce, mung beans, radish, fish cake, seaweed, a soup to share, and a salad to share
- There is free wifi
- There are signs saying a max time of 2 hours
- Staff was really nice and they have those round call buttons on the table to ask for help (though hours didn't work)"}
{"text":"Okay food, everything was decent except steak, which was rubbed with steak spice and tasted generic at best. 
It was really difficult to get the waiting staff's attention. It seemed like they've been trained to avoid eye contact. An average of 3-4 attempts had to be made before we could flag down somebody. Although there were only 3 tables. 
Also, someone was standing on the table behind ours drilling the wall as we were eating. Priorities. They just had to fix the wall with customers present..."}
{"text":"came here for dinner on a Saturday night around 7:30pm and the place was fairly packed. We got a table cooking combo for $34.99 that came with pork belly, a stew, rice and side dishes as well as sauce and lettuce for the wrap. The food was very good and the portions were good! although they were really busy, service was good and we got refills for side dishes really fast. will definitely be coming back...but yes like other people mentioned, you will smell like pork after but still worth it!"}
{"text":"Service slow... No dessert.  Meat kinda bland.... Offered us a soup... But it never came.  Wayy too many lights, went blind while eating."}
{"text":"I had a bad feeling about five minutes almost from the start. I thought about saying something to our group of seven but it was my brother-in-law's birthday and I didn't want to be a spoil sport. He had been here before a while back when it used to be Chingu and said it was awesome. I knew things were going to be tricky when our server first came by. She spoke very little English and hard a hard time understanding anything we told her, but she did understand we wanted the all your can eat BBQ which this place is/was known for. 

She had no problem bringing out the first serving of tea, kimchi appetizers, meat etc. Things broke down soon afterwards. Service was extremely slow. She would pour tea for some people in our group and not others. And forget about reordering food. Our server would come by and diligently write down what we ordered and then disappear. Ten minutes later she'd show up again with no food. We'd reorder again and then the whole cycle would repeat. All together we must have done this about seven or eight times during the course of the meal. Our second round of food showed up about 30 after we started, and aside from a few dishes here and there nothing else was brought out. We had to ask repeatedly for our BBQ grills to be changed, which was done clumsily and the temperature control dial on one of the burners was busted. 

Extremely frustrated we asked for another server. This time a guy came over who also barely spoke any English. Again, every time we ordered it was like groundhog day. We'd order, he'd write something down and disappear, and then he'd show up again 10 minutes later and we'd start all over again. 

An hour and a half later into this comedy of errors we asked for our bill. When my sister-in-law complained to our second server that we shouldn't have to pay full price because we only got half service he called over his manager. She was the only person we met who spoke passable English. She apologized profusely and offered us a free drink for our troubles. She also said next time we came she would remember us and they would do a better job, they would bring us whatever we wanted, and we could have three, four, five servings of green tea ice cream or more (they said they were totally out of green tea that night).   

But alas my sister-in-law robotically told her there will never be another time for Jangwon. The only good thing about this farce is the funny story we now have to tell. Bottom line - no won should ever eat here and I'm sure it won't be long before this place joins the great big restaurant grave yard in the sky."}
{"text":"Came here with a group of friends around 10pm on a Friday because we couldn't find any other Korean place open late that would take debit. We'd never heard of this place so we didn't know what to expect.

Our server was very nice. Despite it being so late (and he was probably tired), he still greeted us with a smile and was very friendly. On our way out, we passed by some of the employees cleaning and they all smiled and wished us a good night. It made the experience that much more pleasant despite the disappointment with my dish.

I got the lunch special bulgogi with rice (it said lunch, but they said that we could still get it), which tasted okay, but the meat was a little dry. It would have been better with a little more sauce on it. Also, I didn't realize it at first, but the portion of the meat was actually kind of small--it was hidden with a bunch of vegetables and brown onions that resembled beef until you actually look at it.

Overall, it was OK. I would definitely give this place another chance if I'm ever in the area late in the night again, as I feel like I can't really judge this place based off of one dish. My friends said the bibimbap was delicious so maybe I'll try that next. Or the Korean BBQ. Plus, the workers were all pretty friendly which makes me want to come back and give this place a second chance."}
{"text":"I haven't had any trouble flagging waitstaff down -- they're super busy running around so I don't mind at all not having them check up on me every two minutes. The AYCE BBQ option is still delicious, and the side dishes are free refills, so be sure to take advantage of that. Try to save the best for last and eat the bulgogi after the first 3 meats. Make sure you wear an elastic waistband."}
{"text":"This used to be one of my favourite places to have Korean BBQ. Not anymore! Their service was never that great even since the beginning of time. They did however have great value for the price you are paying.  Today me and a couple friends got to the restaurant at around 9:50 because I remember the ETA on the gps was 9:46. We sat down and ordered the 22.99 AYCE BBQ with beef. The food took about 10 minutes to come out which was not too bad. The gas on their portable cooking top was running low and the cooking was really slow. Finally after we switched to a new bottle of propane we got cooking normally. After a few rounds we noticed half of the beef on a new plate were a bit grayish and dried up. We thought they might be some leftovers from other tables but we were ok with it as long as nobody touched them. At 11:35 we asked for one more round of pork and they refused. We asked why because the restaurant opens till 1. The waiter went to the cash counter and came back saying it's because we were there for long we than two hours..... I mean wow! We only got our food brought to us after 11. I have never experienced bad service like this at any place before. And on another note, their side dishes have been getting worse than before."}
{"text":"Summary:  
You're seated in the restaurant according to your ethnic origin, Staff's English is poor, food is okay.

Details:
Sad when your recall is that you were segregated to another section because of how you look.  Over the course of the evening we noticed the two wait staff were placing Asian people on one side of the restaurant and non-Asians towards the back.  On Purpose? hmmm makes me wonder. 

Was on a biz trip last week. A colleague and I were craving Korean BBQ and walked over from our hotel.  The place was half empty and we were asked to wait 5 minutes while a table was prepped.   After being seated and exploring the menu we both settled on the all you can eat for $17.99 (what a deal!).  

The small plates are are brought out, then one plate with all the meats and fish. Lettuce is provided but no sauce to put in the lettuce leaf.  The grill is changed often and you can order as much refills of food as you want.  The funny part about the AYCE is they limit dessert to only two scoops of ice cream. 

Overall:
Food hit the spot, it was good.  Ordering is difficult unless you get the waitress who speaks English.  Service is very slow.   I'd give it another try to see it was my imagination."}
{"text":"Loved coming  here when it was Chingu,  gave it a try a month ago and was impressed by price, quality and service (Koreans are always nice).  

Since then I've been back 3 times and every time has been an absolute disappointment. Food is fine, price is still attractive but the service has been awful.  

Waitresses are always nice but they're clearly under staffed and do not care to shore it up. Wait times after being seated are almost offensive. 

The biggest pet peeve here is that Koreans are always served first.  After being seated and ordering, we saw a Korean family sit down while we were waiting for our grill and get serviced with food immediately even though we had ordered 5 min before they even say down.  

Korean speakers consistently receive attentive service while everyone else must order in large sums just to avoid long waits still. 

Overall if they could shore up with more staff it'd easily get 4 stars from me."}
{"text":"The food is good as it is a classic Korean BBQ type of restaurant. However, the woman working there was REALLY rude. I had to keep going back up to ask her for stuff (the gas in my grill ran out so I had to go up and ask for another can, more lettuce...etc.). Also, whenever I did, she would always shoot me the dirtiest look like we were a burden to her. There was no one else in the restaurant except for this other man. This place was okay but I know I can find someplace better, so I think I'll pass."}
{"text":"I have yet to give a single star for food but I suppose it had to happen one day.

My family stopped by lunch last week for first and now last time. We ordered the Samgaetang (chicken in broth) since it is a Korean tradition to have it at a time called malbok. We were deeply shaken to find a plastic wrap in my grandmother's dish. We inquired about this immediately and was told it was a mistake made in preparation. For this dish, all the ingredients come frozen in separate packages. In the middle of cutting open the packages, part of the plastic wrapping around the chicken stayed in the broth the entire time it was cooked. 

I must say here that the waitress did her utmost to explain what happened and took the dish away immediately. We were given an apology from the waitress who was never at fault in the first place but not a word from the manager or an owner.

I understand what happened must have been an anomaly but it was a bit too much for me to even consider returning. I thank the waitress for her concern and I would ask future diners to avoid this particular frozen prepared dish."}
{"text":"Came 2 this restaurant several times now, not a regular but I do enjoyed the dining. However, on the recent visit (which is right now), I discovered that their meat is recycled... Like some beef looked dried n looked been out there in room temperature 4 quite awhile, also they said limit is 2hrs but they stopped serving us after 1hr 50 mins... but still, 4 the price point this is a good place"}
{"text":"Amazing. Great prompt service by handsome beefy guys, delicious meats and an amaaaazing doenjang jjigae soup. Our grill built into the table seemed slower than the portable ones others had so next time we'll opt for one of those."}
{"text":"Been here dozens of time..broke a shot glass , got free food and recommended to all my friends..good food and a good place to hang out with a bunch of friends"}
{"text":"My fave AYCE KBBQ. They only have 4 types of meat but the cuts of meat are very good quality. The service is sometimes lacking but I go there mainly for the food so I don't really mind."}
{"text":"Went with friends! The food is amazing! I really enjoyed all the food! It's just the service. The service really wad that the guy came twice to make sure the heat was OK. But everything we needed something, we would always have to wait a long time to get someone's attention. But no one was rude just to ask for one thing takes quite a while."}
{"text":"I think investing in a $30 grill plate which you can buy from the PAT grocery store across the street is way worth your money than coming here.
I used to like this place but the fact that they place you in a booth without a bell is a struggle. They also limit you to 2 hours, but their really slow service and strict rules of what type of meat you can have and not have anymore will not get your money's worth. Also, what's the point of ayce when they don't even give you unlimited rice? 
I'd rather have this Korean experience in my own home and actually enjoy the food without the constant effort of flagging down a server and pay a ridiculous price for this \"ayce.\" ~end of rant"}
{"text":"This is the go to place when my group of friends are looking for late night snacks. As they open late (till 2am I think?) and with very good authentic Korean food. The place might look ghetto, but the food is definitely something worth our drive from uptown Richmond Hill) to here almost every other week! We particularly like their BBQ, and it is best to pair with the makgeolli (carbonated unfiltered rice wine). The place is not so packed when we go around 11pm, so it is good that we can feel less crowded in the restaurant. 

We also went and tried their AYCE dinner once, we picked the Beef dinner, which also allows you to order the pork as well. The beef was good and thinly sliced, tip is not to overcook them, just cook them for maybe 30 seconds one side, then turn it and cook for another 10 seconds, then you're good! The pork belly is also our favorite. Dip it in the sauce provided, then roll them inside the lettuce and add the spicy salad, nothing beats this!"}
{"text":"TL;DR- Overpriced, mediocre food and service is absolutely horrible.

I'm never coming back here again, and will advise everyone to stay away. 

Went in on Sunday night after seeing decent reviews for this place. Girlfriend and I noticed on the door there was an all you can eat special where you get 4 types of meat, veggies, rice for $22.

We walked in and there were 4 tables already sat and eating. We were sat at a table near the kitchen, and our server brought food a menu and water to start.

Our server took came by to take our order and spike very little English. I tried to order the ACYE $22 special, but the server kept pointing at the pictures on the menu (which were the 4 meats listed on the door special) so I said \"yes, all four\".

They brought the portable grill and our food to start. The food itself wasn't bad. Lettuce leaves (for wraps), kim chi spicy salad, bean sprouts, kim chi, sliced radish, seaweed, tofu, a soup (onions, tofu, cucumber, beef), two small bowls of rice and a plate with the bulgogi beef, pork belly, seasoned pork, but no capicolla. 

The food itself was okay. The pork was nicely seasoned and pretty tasty. The beef was alright, minus all the fat you had to cut off. The pork belly was 90% fat and had zero flavour to it. 

There were four servers we could see working and 2 others in the back working in the kitchen. Then for the next 35 minutes we did not get any service. We would make eye contact, say: \"excuse me\", and wave at any server who would walk by, but we were flat out ignored. It seemed the only way to get their attention was to physically grab one of them as they rushed by you. 

Eventually a different server came by and asked us if we needed anything else. I ordered more pork and two more bowls of rice. The server told me it was $1.50 per bowl. Each bowl was barely 1/4 a cup of rice. 

I went up to pay, and that seems to be the only time I got prompt service. The bill was $55, and that meal was barely worth $35. I left a $5 tip, but they didn't even deserve that. I'll definitely stick to the grill house or chako next time I'm feeling like korean bbq."}
{"text":"Was amazing. Affordable and everyone was really nice. The food was to die for. I definitely recommend to anyone who wants kbbq"}
{"text":"Always crowed, smell is so good as soon as walking in. We both have tried beef and pork sam gyup sal, but found out pork had too much fat and it didn't taste as good as beef. We love their tasty side dishes, and $20 (beef) for all you can eat, we loving it!"}
{"text":"Terrible service, terrible food. Food looks nothing like the pictures on their menu. The rice was more of a porridge and their plates came dirty with left over food on them. When you complain, you don't even get an apology but just a what-can-u-do face and a shrug.."}
{"text":"First when I read yelp before visiting this restaurant, I read a lot of complaints about the services and how the waiters don't seem to be working efficiently. I thought 'well SOME people are too anal'. 
NOPE! We had to hunt down waiters for every order. Other than the waiters, it was very good experience.
Whoever complained about the food, for that price that is best quality you can get so 5 stars for food.
Atmosphere of the restaurant is okay for friends, wouldn't suggest it for first date or any type of special occasions.
If you read up to this point! - go in expecting to hunt down waiters and occasionally going up to the counter yourself and you will be very happy."}
{"text":"Can't comment further about the other reviews.... my table got excellent service, and the bottomless platters of meat  just kept coming until we begged them to stop But with that said, if you've never don't a tabletop cookout before or if you don't understand the menu, the burden is on YOU to ask the wait staff for an intro/explanation! Otherwise they'll assume you know what you're doing when you place your order"}
{"text":"Visited today March 5 '16 at around 4pm and received very bad service. 

- we chose this restaurant for its AYCE option.

- the wait staff gave us a large pile of pork neck meat. I estimate it at rough 1kg. The meat was dry and not very good. We complained to the staff and asked for more beef instead but the staff refused to give us beef unless we finished the pork neck first.

- blatant false advertising: we ordered combo 4, but the staff failed to bring us one of the four items. After asking the staff for the item, the staff said if we received the item we will not be able to ask for more after -- this was the ALL YOU CAN EAT option

- the stove was poorly maintained: we asked the staff twice to  change the gas, the first one simply turned it off and walked away to serve the party seated next to us. We had to wave down a second staff after 10 minutes of non-service. 

- we had to wait another 20 minutes to pay the bill at the end as the staff was keeping their heads down at the counter and not making any eye contact with the customers. I don't know if they were playing with their phones or not. At the end of my visit I realized that there was a older male server who wandered around the restaurant and ignores my party the entire time, EVEN THOUGH WE HAD OUR HAND UP FOR SEVERAL MINUTES AT A TIME.  It would seem that this worker was more interested in talking to the younger female customers.

I would not recommend this restaurant and I would caution anyone who isn't a young, pretty Korean woman from visiting. We were ignored and it was IMPOSSIBLE to get their attention."}
{"text":"Food was good, but the service could of been better. I have been there a couple of times and you can't do all you can eat by yourself, which is sadly not good. The pig belly is their selling point for me, it's your traditional kbbq and it tastes right. It's just they honestly to work on their service."}
{"text":"One star for the service and 2 star for the food. The store front of this restaurant looks like a homeless shelter in Korea town. There's literally a ripped piece of paper on the glass door with the name of the restaurant. 

The service is awful. The employees inside don't speak English. I asked the female server how long is the wait on my food. She said \" coming soon\". 15 minutes later, I asked her if my meal is ready. She said \"coming soon\". 

The pork bone soup was very mediocre. Tasted very blan and the pork could've been seasoned more. The chives pancake was soggy and not crispy like other restaurants. 

They seem to have a short staff in the kitchen. As I saw the server had to run like a chicken into kitchen to help pack for deliveries and get side dishes ready while customers walk in and no one is there to greet them.

I don't know how comfortable I felt when the whole dining experience I was able to see the dishwasher washing dishes since they don't have a wall for kitchen to the dining room. 

Poorly renovated and really poor atmosphere with a crowd consisting of young drunk teenagers inside."}
{"text":"Today I went with a couple of my friends to Jangwon for lunch and we were greeted and seated immediately as there was only one other table at the time. We sat in the booth and got our menus right away and the service seemed pretty good, however as the meal continued everything got worst. We were all under the impression that it was an AYCE thus, we ordered the 4 different kinds of meat for $20.99. The first 3 cuts came out and we were barbecuing, but after the first round we were confused about the 4th kind, the bulgolgi. We had no idea that once we ask for the bulgogi the K-BBQ portion would be done and we wouldn't be allowed to switch back, as no one informed us. 

After we had 2 rounds of the bulgogi, we were ready to pay. None of us had cash and no one informed us as we came in that their debit/credit card system was down, but \"conveniently\" they had an atm in the restaurant. One of us decided to run down the street to the bank and grab cash instead, which took all but 5 minutes, and the woman, whom i'm assuming is the boss\" pointed at the atm and told us to take cash out there. We told her someone went to get cash and she just gave us a dirty look. 

Our bill came to $71, and we gave $75, and started to walk out, however she immediately said \"EXCUSE ME!\" and implied that we didn't leave her enough money for a tip. She stated that we had to give her the tip amount that totalled the tax which was about $8-9. We were so dissatisfied with the way she handled the transitioning of the meats as well as her attitude about the tip. I've never had anybody demand that we tip them the amount that the tax was. It was extremely rude and she wouldn't let us leave, we paid for our meal and no where within the restaurant did it say that there was a minimum amount required for a tip. 

Overall the food was okay, service was beyond terrible and the \"owners\" attitude was beyond appalling. Never will I go back, nor suggest friends to go there. Definitely our first and last time going."}
{"text":"AMAZING PLACE TO HAVE KBBQ!!! It's authentically korean, ran by koreans, served by Koreans, visited by koreans. They have $15 all you can eat kbbq which is nothing like the Chinese imitated ones. To u get to choose two items of the four (eg. Pork belly, beef, pork neck, bulgogi). They give you so many side dishes it's amazing oh and refillable. They have soju, import and domestic beer, some plum soju or sake too. I don't think they carry Cass beer anymore or they're always out. Gotta check them out and Pat Mart is right across the street too."}
{"text":"This was my go to AYCE spot when it was Chingu, however now this place is GARBAGE. With a new name, management, and staff it really went down hill.

Firstly, the service was poor. Our waitress barely spoke English and has a disgruntled/annoyed face every single time she spoke to us. When we ordered something she wouldn't even say 'Ok' or say anything she'd simply stomp off. 

The food was even worse. The meat was very low quality and the cuts of meat (namely the Kalbi) were very fatty (I'd say only 20% of some pieces would actually be protein). It was clearly not marinated for long enough and the flavor was overly salty and mediocre. They would also skimp out on giving large proportions of the beef so you would have to order several times. There are side dishes but they were also very underwhelming. Towards the end of the meal, it looked like maybe the only good part would be ice cream... which despite the ability to order '2 scoops' had proportions were so ridiculously small it is barely the size of a regular scoop from any AYCE joint.

Prices: They were kinda pricey for an average KBBQ joint and went up since they changed management...Fri-Sun is 19.99 for night time. During the week it is 16.99. For the variety and quality you get on the menu, you're probably better off just going across the street to Korean Grill House.

VERY disappointed. In all, I wouldn't recommend this place to anyone. Stay away and save your money!"}
{"text":"The food was original and tasty, but the waiter seemed annoyed and did not do his job properly."}
{"text":"We were excited to hear that this place has an all-you-can-eat Korean BBQ and when we arrived, we were given a nice private booth that were away from the crowd. 
However, our service was extremely poor as it took us a very long time to get anything from the servers. There is apparently a button that's supposed to signal them for assistance, but it doesn't seem to be working. It took us 20-30 minutes to get any refills for side dishes and meat.
I also noticed that the restaurant was severely understaffed for a Saturday evening and our booth made it hard for the servers to see us so these two reasons could've been the cause for the terrible service.
The food was decent, but the service made this pricy trip not worth the cost."}
{"text":"If you come here and choose the AYCE option (which they increased their price from $17.99 to $19.99), the server/owner will convince you to get pork belly, pork neck and beef brisket first, although you may be more interested in the bulgogi. I'm sure they will let you get bulgogi (if that's your favourite Korean dish) if you insisted enough at the beginning. 

Honestly, their bulgogi is overly seasoned, so salty and sweet I don't find it very appealing. Also, the entire pile of meat WITH the marinate is served to you on the grill, which is very not appetizing. Two star is given to their Dwenjeang Jjigae or fermented bean soup. 

Service is really sub par at this restaurant. It's difficult to get anyone's attention if you are hoping to get more condiments, water or lettuce. When the servers approach you, they don't even look you in the eyes or sometimes they don't even bother talking to you. Before you are done eating, the server comes to pick up your grill and dishes. Take the hint and expect to leave at that point. I feel completely unwelcome at a restaurant like this. I still don't know why I tipped them... Never coming back."}
{"text":"For the price, this place is decent for getting AYCE meat.  Not the best, but passable.  I'd come here again with these prices."}
{"text":"My second time at Jangwon was much much better. 
This time, we visited with just my girlfriend and I so we didn't have to keep bothering the wait staff. My complaints from the first review are still valid, so make sure you read that one to understand what to do/avoid at this restaurant.

Lesson learned from last time? Don't come here with 6 people to a grill. Stick with 2, max 4. 

Service was still slow, but this time the side dishes and the lettuce didn't get immediately consumed when they were put down. The problem is that their portions is the same regardless if the table has 2 or 6 people. If they just gave their food portions relative to the table size, it would drastically improve their service level. 

I still never figured out their mystery 5th meat, but at least I remembered to take a picture this time and post it. Capicola? What? My next time there, I'm determined to get this mystery meat. 

Highly recommended for their amazing quality of food at low prices. 
Just don't come with a big party. Do your birthday events elsewhere, trust me."}
{"text":"Came here with a party of 12 people for my birthday and wow was it ever a mistake.

1. Food took forever to arrive and there was only 1 person working the entire floor upstairs.  At one point I had to actually get my own water.
2. For an all you can eat place, we could not eat all we wanted to.  Meat was scarce and they cut us off from the pork bone soup for reasons unknown.
3.  The waitress (god bless her heart) realized we only spoke English and as a result decided to speak to us in only Mandarin and Korean.
4.  They asked us for a bigger tip when we left, so we gave them one as they would not let us leave otherwise.

Here is a tip for all of you though, DO NOT EAT HERE.  Unless you want to wait around for hours inhaling the smoke from burnt meat as you wait for grey coloured slabs of beef to come out."}
{"text":"rude staff ( i meant the female owner/azuma, not waitresses). ordered seafood pancake there were not enough dipping sauce so i asked for extra sauce, she acted so reluctant. food proportion is getting smaller! will not go back! old owner lady was so unfriendly"}
{"text":"I came here with a Korean friend who ordered for me. The fish was tender and all the side dishes/pickled salads could be re-filled. Delicious!"}
{"text":"Woah! This place has slid down the rungs faster than oil on a lamp post.

We arrived and were promptly seated. It wasn't that busy but did fill up about an hour after we arrived. 

It took them 15 minutes to bring menus and water, another 10 to place an order. We already knew that we both wanted the AYCE Pork belly. When our food came, it took another 20 minutes for the soup and after 25 minutes we eventually asked it we could have rice and the server snapped \"It's COMING!\". It still took another 10 minutes after we asked. 

Our grill went out after a server came over to turn it down. After realizing that our meat wasn't cooking at all we had to go to the counter and find a server to come and put a new canister of butane in.

Service was really really bad. I get that things happen, but it's been a consistent downslide the past few times I've visited. The quality of the food is also in decline. Several of the side dishes tasted off or were served in scant portions. 

I'll be looking for a new place for Korean BBQ."}
{"text":"Ordered: All you can eat #4 (comes with #1,2,3,4 which I think it worths my $17.99)

#1 Korean style bacon
#2 Sliced pork neck
#3 BulGoGi Stir fried marinated beef
#4 Sliced beef brisket

Please skip to next paragraph if you understand the system of Jangwon's All you can eat! I would suggest getting #4 ($17.99) since you will get all of the above. Getting same price ($17.99) #3 would get you#1,2,3 only. $14.99 #2 would get #1 and #2. When I looked at the menu with my friend, my friend was confused about the above. He just couldn't believe he could get all 4 types of meat for $17.99! So that's why I wanted to tell those who might want to know.

Our two #4 meals come with 5 side dishes, 1 hot potato and super soft tofu soup, 2 veggies, 1 bottle of water, and of course 2 bowls of rice. Also a pair of scissors.

The waitress gave us meat #1,2, and 4 first on a plate. She also helped us to set up the BBQ grill plate, and then put one piece of meat onto the plate. Nice service.

I personally like spicy food so I dipped my meat into the spicy sauce every single time! All meat are delicious and recommendable. I suggest eating the meat before it cools off. The variety of food choice on the table makes me didn't know what to eat first at all! However that would be perfect if I could have more rice in this meal since I usually eat a spoon of rice with a bite of meat. At the end, I didn't have enough rice to eat with the meat. Also the servings except rice are actually more than enough for a person. Having finished my meat #1,2,4, I was too full that I forgot I still have a meat #3. Meat#3 came separately in another grill plate, with sauce inside. That was another brilliant and unforgettable experience. The meat was soft enough for me to swallow, despite my full stomach. Reminder: the #3 meat will be stacked on the plate, you would have to spread them around the grill plate in order to have your food cooked faster and better. 

We came on a Sunday night (about 9pm). It was not quite packed so we can sit in the \"room\". There is no door but just a private area made by slides separated between the other room. Perfect for gathering or dating. 
Also make sure you call the restaurant for their opening hours if you decided for late night meal, since I couldn't find their hours on Yelp sadly. They open until 1am on Sundays!

Another reminder is that you have to press the service bell on your table/ wall after sitting down, especially in one of the rooms. The waiters can barely see you unless you press the bell for menu or anything. We were so dumb that we sat there and waited for ever for the waiters to come and serve us, and I nearly gave this restaurant a one star because of the service! No! Their service is actually very good and friendly to us, Korean or Canadians etc. We can enjoy our time with friends or family there without being disturbed. 

Moreover good location is what made up of the 5 stars. On such a cold and snowy day, no one wants to walk for 20 minutes to a restaurant if they don't drive. This restaurant is situated right 3minutes away from Christie station, very convenient. 

The washrooms are situated near the front door. Open the door and walk down a few stairs to get to men's and women's. The stairway was cold though. Washrooms (Men and Women) are clean that I do not have a feeling that I wanna get out of the restrooms immediately. Hot and cold water available for cleaning hands, good for chilly weather. 

I would definitely go back again to have the all you can eat again or try out other food!"}
{"text":"Service is terrible! 

My friends and I used to like coming here but we probably won't come here again because of this experience. The servers take so long to get your food or they often forget to bring your order so you have to ask twice or three times. I understand that there was two servers but sometimes they would say \"coming soon\", when really they stay near the cashier. What is annoying is that they won't give you more meat until you have no meat on your cooking plate. I get that they don't want any wasting of food however this was the first round and our huge group was hungry (we asked them when there was 2 pieces of meat and we had to call them again to show it was done) 

Something that threw us off was that they now start charging $1 for an additional basket of lettuce.... how is this AYCE? First charging rice and now the lettuce? Finally, they try to kick you out asap, warning you that your time is almost up. Luckily a friend took note of the time we sat down and we still had 30 min left. The restaurant was not busy at all, there was plenty of tables so it made no sense to rush us out. 

For those who still want to try this restaurant, just remember to bring cash beforehand. They no longer accept visa/debit. They do have an ATM machine near the entrance of the restaurant but of course there's a fee.

We were left feeling frustrated and annoyed. 
I suggest finding another AYCE Korean BBQ where they won't limit/take away your food."}
{"text":"Service USED to be great when it was Chingu.
Now it is probably one of the worst all-you-can-eat experiences i have ever had.

after the change of management, it was dissappointing in terms of service and food portions. price is FAIR for an all you can eat, but i was not full when i left.

I was fine with the $22 price for all you can eat on a saturday night, but they had signs saying there was an AYCE special for $10 from 10pm-12. we asked to see the special menu and she showed us, which has a limited number of items compared to the regular menu. we asked if we could do that special and the waitress said YES.

we arrived at 9:45 and ordered close to 10:00. we ordered items from the special limited menu. we had 4 people and food would come out in small portions, 1 small plate at a time (sized for 1 person), even when we asked multiple times for more meat.

by 11:10 we were still waiting on some meat orders until 11:30, and when we asked about the orders she checked her watch and said that it is last call. so we asked for pork belly and kalbi.

she came out with a small tray of kalbi and said that they ran out of pork belly. the table next to us said the server said they ran out of kalbi ribs.

the cuts of meat through the meal gradually got worse and worse, and I ordered a tofu soup that never arrived.

when paying, they charged us $22 because \"you arrived at 9:45\" even though they specifically said that we can do the special $10 menu, which we based our orders off of. when i left i was still hungry but you could tell that they did not want to keep giving us food. \"you can do the $10 all you can eat special next time\" was their final words. LMAO no thanks.

OVERALL:
- server was polite (at first), but barely spoke english and misleads customers
- portions were tiny, and asking for multiple portions at once just gets ignored
- considering how small the portions were, pretty big wait time to get to our table
- meat was poorly cut and they served the odds and ends
- food orders do not always make it to the table
- \"last call\" after 1.5 hours
-  \"ran out of pork belly\"
- left the restaurant still hungry (and they say all you can eat)
- did not honor special pricing when it came time to pay

this place sucks, don't bother. i will probably never go back.

UPDATE: guess who has diarrhea."}
{"text":"This place is really my favorite for korean BBQ.
You meat is great and everything is served korean style, the spicy salad, rice, sides dishes...
If not in the mood for BBQ,they have pretty much everything korean as well."}
{"text":"Why this place doesn't have a higher rating is beyond me? Can I give them 6 stars?

1. the meat is of pretty high quality and doesn't come soaked in a soy marinade bath
2. the owner and staff are all very friendly and accommodating and would walk you through the process if you're not familiar with how Korean BBQ works
3. the price is pretty fair considering what you get
4. really good side dishes and sauces. it's not just generic crappy kimchi.
5. the soup. again, it's real legit soup, not some powdery miso soup mix where they just add water.

i'll go back to this place time and time again now!"}
{"text":"There are some flaws, but if you're the type of person that does not expect to have a waiter come see you every 5 minutes at their own discretion and can do a little self-serve, things should be fine if the equipment is working and there aren't too many customers.

Came with a group of five around 5 PM. We were seated in one of the smaller booths, but it was a bit small so we asked for another seat. The place was pretty empty at the time, so we had a lot of choices. In the end we got seated in another booth in the corner near the back, but it was much more spacious (this section was probably for larger parties)

* * *

We ordered #4 AYCE, which comes with korean bacon, pork neck, bulgogi, and beef brisket. They will tell you in advance that the bulgogi will come at the end because they will provide you with a different grill, so it's something to take into consideration when planning out the dining strategy since they appear to have a 2-hour limit.

The AYCE comes with a bunch of side-dishes and baskets of lettuce, so along with all of your bowls and cups of water and all the raw meat, you'll need to figure out how you want to fit everything on the table.

The side-dishes and the meats tasted great. The meat didn't look like they had much done to them, but after grilling them the flavors were good. They also provide some sort of dipping sauces which were interesting.

* * *

I had read reviews that their grill wasn't hot enough. At our table, there were two grills. One was in the table, and another one a portable grill. We were asked to use the portable one because it was \"very hot\" compared to the one on the table. Well, super-grill, can't complain about that. 

And indeed super-grill it is, as the fire was blue/white. Presumably that should be hot enough, along with a nice conductive plate as meats were being grilled through within 20 seconds, and we had to ask for extra tongs so that we had more hands working that meat to avoid over-cooking them.

* * *

Between the five of us, the meats were going in and coming out pretty fast.  About halfway through the plate, we noticed that there was no service bell at our table. We looked around and there weren't any in other tables either. They had one in the first booth, and we had pressed it for fun but we didn't hear anything. After confirming with the staff, it looks like they really did remove the bell.

In any case, because we came before dinner time, the place was still pretty empty, and the wait-staff were all behind the counter doing whatever they're doing and not really checking up on us. Just had to walk up and ask for service and they'll rush over. So if your meat supply's running low, don't wait until you're done, send someone out while someone's finshing up the remaining portions.

* * *

An hour later, the place started getting really busy. Getting service became difficult as there were only two wait-staff and they're getting flagged over by everyone at this point. Sometimes they forgot about our next order. Well, lots of tables require refills so that's inevitable.

Fortunately we were finishing up so it wasn't a big deal. I can only imagine what things might have been like for those that were just starting when it got busy."}
{"text":"So this review ended up being more rant than review. Basically food is OK, prices OK but service (especially if you don't speak Korean) is bad.

I'd give the food here 3 stars but what got to me was the bad service, 1 star experience on that. Probably a third of my time was spent staring after the end of my meal at the table trying to get the attention of anyone from the staff while they munched and chatted away without a bother as to the what the customers might be up to.

At first I tried to be subtle about trying to get their attention so I could have my bill and be on my way (one of the many things I like about Korean restaurants is that it's a good meal you can be done with very quickly). It was getting pretty ridiculous and I was surprised that it was happening, the ONLY reason that one of the ladies stood up was when the TV show that was on finished, so she got up and changed the channel and she was well on her way back to the table if I hadn't loudly asked for the bill. 

Now walking in to a small restaurant like this in Koreatown which had the most minimum amount of English signage I was expecting some good food and to stick out from the usual crowd that probably visits here (yes I was the only non Korean in here). So perhaps coming in here when it's not time for the staff to have a meal won't be that bad. 

Even before the whole end of meal time wasted, I questioned my server about the \"free coffee\" sign they  had on the counter and asked if I could have some. She then went on to say that it was not for everyone or it might have only been for the staff (she wasn't very fluent in English) so I didn't grasp the exact reason, but she definitely ended the conversation gesturing that it was OK and that she would bring me a cup....never saw said cup. 

I will most definitely not be coming back here since there are a few places a minutes walk from here that I really enjoy, thought trying out a new place might have done me some good."}
{"text":"If you're craving for Korean BBQ then this would be the best place to be! I've tried a lot of places for Korean BBQ but no one can beat this place. Servers are nice and is patient. Amazing food."}
{"text":"All I have to say is WOW! It's been a long time since I've got to experience Korean bbq that of any quality for AYCE price. By no means do we eat a lot (we actually do...but beside the point), but we enjoy the variety that AYCE offers; sometimes that variety comes at the expense of quality. The Korean bbq is quite trending and places like Chako and Korean Grill, etc tends to be the forefront of the populace of the GTA. I feel that people pick those places for price/location and conveniences but forget to venture out to see what other restaurants have to offer. I am so glad that we did. The offerings at this restaurant is top notch. Hands down-I would go out of my way to get here. And to think when we first seated, we had second thoughts due to slow service. If anything, that was the one down-fall of this place. The food is amazing but service was very slow (there were only 3 servers, can't really fault them). The manager was friendly and quite dedicated to his restaurant and food. The vibe is low-key and homey. We go the AYCE menu that featured 4 different types of pork and beef preparation-pork belly (decent thickness though I wished it was more marbled but the fat crisped up quite nicely), pork neck (an interesting cut but I found dried out quickly if not taken off at the moment it cooked), the beef slices (nice and juicy) and bulgogi (the extra highlight of the meal). The difference between this restaurant and other of its kind is that the food came in stages rather than all at once (which I appreciated as it controlled a huge portion of cross-contamination and so forth). The bulgogi was last so that we could enjoy the meal without it overwhelming our taste-buds. The side dishes were also very good, simple but complimented the meal perfectly. The overall experience with the food was amazing...it is priced a bit higher than the run of the mill Korean bbq chains but the quality and experience was well worth the price. I would definitely without a doubt return dine here. It is worth noting that they do offer quite a large selection of other a la carte items and pairing (quite reasonably priced, may I add?). Definitely a place that would change your perspective on Korean bbq standards; a great place to grab a drink and hang out with good friends."}
{"text":"The best [and most authentic] Korean food I've had in Toronto!  The AYCE is at a fantastic price ($14.99 for pork belly and korean BACON - HECK YEAH!) with generous grilling portions, and unlimited lettuce and side dishes.  They're also home to the thickest pajeon (pancake) dishes, mmm.  

I don't recommend coming here on a Sunday nights, as there are only TWO people waiting tables.  The waitress I spoke to confirmed that it is their busiest time of the week.

However, something I do recommend is using the service button located at the side of each table to \"get their attention\".  

Oh, and did I mention that there's free wifi?  Check, and mate."}
{"text":"2.5 - Food is a 4 but Service is a 1. 

Ahhh, so much good and bad.

Come here for authentic, AYCE Korean BBQ. Now, this ain't no Chako or Korean Grill House (the Chinese interpretation of Korean BBQ) so don't expect any salmon, green peppers, sushi or anything of that sort. At $20.99 per person, you get 4 types of meat - pork belly, pork neck, beef brisket and bulgogi. There are other AYCE combinations you can choose from (i.e: pork belly and pork neck for $16.99 pp) but your best bet is to just get all four.

Accompanying the meat are side dishes, white pickled radish, shredded lettuce in spicy sauce, lettuce, a bowl of white rice for each person and a small soybean paste stew to share (doenjang jjigae). You can devour the meat however you want but lettuce wraps are probably the most common and most flavorful way to eat it. I have no complaints about the food, everything is delicious!

The environment and setup of the restaurant is very typical of a Korean meathouse and doesn't stray away from what you'd find in Korea at all. It really made me nostalgic of when I lived in Seoul which was nice.

Now the negatives which are all very substantial:

It's a family run business so the owners do their best to tend to everyone but this means service can be REAAALLY darn slow. Especially when every table has so many refillable dishes, I would imagine things to get really hectic. They're pretty friendly and willing to get you everything you ask for but it just takes a long time and may require repetitive requests on your part. What's worse is that we were a party of 6 and sat in one of the booths with no assistance bell. You can imagine how difficult it was for us to get their attention. 

In addition to that, it's not uncommon for AYCE establishments to implement a 2-hour eating rule but it tends to be loosely enforced and meant to discourage those who order way too much or stay way too long, neither in which we did. Promptly at the 2-hour mark (from when we sat), we were told we couldn't order anymore meat. Now how it works here is that 3 of the 4 meats are served first and the bulgogi comes out LAST on its own because they have to change the grill. So you have to be strategic somehow because 1. You can't switch back and 2. You have to give yourself enough time to do a few rounds of the bulgogi ( and trust me, you will want to because it's good). When our 2 hours hit, we hadn't gotten to the bulgogi yet and our server was not willing to accommodate us. But the owner was nice enough to \"do us a favor\" and give us a small portion of bulgogi. I'm half grateful but also half rolling my eyes. 

We left with some of us still feeling unsatisfied and hungry because there were 6 people to ONE fairly small grill. And if you take into account that we had slow service, how much could 1 person have actually eaten? 

My advice:

- Come with a small group (less than 4) so you can reasonably share one grill or have a party of 8 cause that's the magical number to get 2 grills (maybe even 7, not sure)

- Avoid sitting in the booths because you're less likely to get their attention and it'll just take away from your dinner when you spend half your time trying to hunt them down 

Final thoughts:

I wouldn't boycott this place entirely only because the food was great and AYCE Korean BBQ for four types of meat in Toronto is quite rare (most Korean places don't do AYCE and if they do, usually it's just pork belly) but it may just not be worth all the hassle in this case."}
{"text":"I kind of feel guilty for rating this place a 2* as I do believe this joint didn't set out to provide a mediocre experience intentionally, however the same could be said about many other joints.

First things first, even with the \"Grand Opening\" banner still hanging outside, the interior feels dated. Floors and tables are clean but the ceiling hasn't been dusted in ages evidently judging by the dust and lint accumulation on the tiles as well as water leak damaged tiles here and there. Overall sense of the place is one of dishevel. Men's room was more of the same, minus the clean floors. Women's seemed better when I peeked from the wide open door.

If you think all the above deters people from coming here, well, you're wrong! The place was literally PACKED on a Monday night at 8! It was pretty surprising in fact. Had to wait 10 minutes for the disorganized staff to finally clear a table and seat us.

Here is a tip: If you're going here, try to bring along someone who can speak Korean! It was a struggle to get the order through with the staff's broken English. Also, apparently once you pick a meat choice, you have to stick with it! Even though there were two of us, there is only one choice of BBQ meat type allowed between two folks. It took a painful few minutes of back and forth before they explained basically the pan they use over the table BBQ for beef is different from the Samgyeopsal (Pork!) and so once you pick one can't switch to another. Nevertheless we insisted to switch from Beef to Samgyeopsal in part due to the poor looks of the raw meat we were given (think: oxidized color!) and were successful after arguing for a few minutes although we were scolded quite a bit! In any case, I suggest you pick Samgyeopsal as it's very popular here and seemed much better quality. It's also a lot yummier.

Side dishes are free flow but the restaurant was seriously understaffed so you'd be in for a long wait before you're given replenishments.

Overall the \"Samgyeopsal\" was really good but the experience was marred by poor service (due mainly to understaffing actually not so the attitudes) and a malfunctioning BBQ grill that needed a revival every 30 seconds or so in the bottom half of our meal.

Won't be coming back here and won'e recommend despite the yummy Samgyeopsal!"}
{"text":"Pretty good. I ordered the dolsot bibimbap stone pot . It was sizzling hot when i got it. They served a lot of house dishes. I was really full by tue end of the night. My friends and i would come here again in the future. My friend ordered tye pork jiajiang mien. She was completely full and satiated afterwards."}
{"text":"Went with a group of friends for lunch. Service was bad and it wasn't even busy. The lady was rude and we left agreeing never to come back. The food was okay but the bad service just left a negative and much more lasting impression."}
{"text":"Worse service. I tried to order meat more but the staff ignored me. Besides, when i checked out, I didn't tip because the service was bad. But the owner tried to force me to tip them. Never come back."}
{"text":"TL;DR: Don't bother. There are better options in Toronto to spend $25-30/pp on. Good food and terrible service. Limit/take away the food then why bother? 

We've been going there for over two years. I loved Jang Wons. It was a pretty good All-You-Can-Eat Korean BBQ place that eclipses the standard KBBQ places that Torontonians are used to (Korean Grill House...). The place does not have the best ventilation and you always leave smelling like bacon (depending on who you ask this may be a good thing). As an honest disclaimer, we usually suggest going for here for the food not the service. 

For background, this place runs on a 'you don't get more food until you provide empty plates' policy to reduce food waste (understandable) . It always seemed like we were inconveniencing them when asking for service though. With an imposed 2 hour limit, the nature of their business is to moderate the customers consumption and the expectation is that customers would want the most out of their time if the service kept up. But when you flat out ignore customer requests for more food when they are empty and limit the meat available to that of a la carte quantities. That is ridiculous! 

We've accepted the fact that they removed the service buttons because they couldn't keep up, we've accepted the fact that they've removed the shrimp paste they use to provide and we accept the fact that service is slow. However, when you slow down the service to a halt and provide little to no food before cutting your loyal customers off. (we've gone here for two years!) That is unacceptable. 

Our most recent visit a few days ago has disappointed us so much that we have left this single star review. We will not be going back and will no longer recommend it to our friends. 

The story for those interested: 

I got a table for 5 and sat down before the rest of the group came. I told the waiter we were getting the number 4 which included beef and the bulgogi dish because one of our friends could only have beef. 

As we all started the dinner, it was the usual slow service despite the restaurant being relatively empty (2 other tables).  We had to spend most of our time chasing the waiter and presenting them with our empties to get our next serving. At this point we were only on our second plate of meat (keep in mind this is 5 people) and needed a variety of things from water, new butane for the stove and more meat. We subsequently asked for another serving. To our dismay, the waiter said we had been cut off as we had passed the 2 hours. They started the time the moment I sat down when the table they provided had not even been cleaned!!  As a last ditch attempt to get more food (we were starving), we asked for the bulgogi which is provided at the end of the meal since it's a separate dish. The exact words from the waiter: \"no, the owner said you can't have anymore. Owner says bulgogi is part of the all you can eat meat and you been here for two hours \". There was no last call warning and the two hours starts as soon as you sit. Not when you get food."}
{"text":"I came here on a Saturday night with Anastasiya, Agata, Gayle and another friend. We chose this place because it was right next to christie station and it had just started snowing, so we didn't really wanna walk anywhere else.

The first thing you notice when you walk in here is the SMOKE. This place is like walking into a smoky cloud. The ceilings are super low and the ventilation was horrible.

Anyways, we got to sit in a semi private booth, meaning that we shared it with another table but it was private.

Agata and I both had the Gamjatang, and Anastasiya and her friend had the soon tofu and some seafood dish.

The ban chan were okay.

The Gamjatang was lack lustre, even though I asked for extra spicy, I feel like it had no kick.

But here's the kicker...soon after both Agata and I got sick. I rarely ever get sick from non-dairy related foods cuz man's got a stomach of steel...but it happened. Not the best.

So yea, that happened."}
{"text":"Honestly the food is pretty solid. Meats are fresh and well season and the cuts are of the right size. We had the all you can eat combo B and they gave us a lot of food. The problem with this place isn't the food or the food quality its the service. We had the advantage of a Korean speaker in our group so I felt we received a little better service. Even with that it was very hard to flag down a waitress to ask for more food."}
{"text":"The moment we stepped out of here, my boyfriend and I both never wanted to return and this is quite unfortunate because we have been meaning to try this place forever...

Food wise, you get a third of a bowl of rice ($1.50 for every extra 1/3 bowl), five lettuce leaves ($2 for every extra 5 leaves) and a few side dishes (kimchi, pickled fish cake, picked daikon, seasoned lettuce, soybean and seaweed). Every table also had a limit of three additional round of side dishes. The pork belly was 90% fat and inedible, the other cut of pork was nicely seasoned but quality wasn't great (tiny piece here and there as opposed to the large slab you'd usually get). 

It took 30 minutes and two attempts to order (the waiter had forgotten our order - set A of AYCE), another 30 minutes and two attempts to get more food (once again, they forgot our order - more side dishes and meat). 

When we came to pay, the lady at the cash gave us the bill before service charge and as we were deciding on how much to give them for tips for the inexistent service, she printed out a new bill with a 13% service charge on it and told us that it was what we had to pay...

I've never seen a restaurant so rude before..."}
{"text":"Came here with a group of people and we did the all you can eat. There are many other options on the menu but if you do the all you can eat option you can choose from 4 types of meat (also have the option of doing only 2 types of meat which is cheaper). 

The meat was fairly good and tasted better when I dipped it in chili paste. Surprisingly I enjoyed the side dishes more than the meat as they were good especially the salad I believe it was.

Service here is slow as it was really busy when we were here and there were only 2 waiters working most of the night.

The experience was enjoyable and the food wasn't bad. Probably would come back again to try the kalbi"}
{"text":"I got the ayce option B. The pork was 90% fat and flavorless, the beef wasn't much better. This place has the worst service possible. Takes 20 minutes to get your orders and that was through flagging the two waitresses down (instead of waiting after ringing their \"bell\"). If you are coming with a group larger than 3 do not eat here as they have a 2-hour sitting policy and no matter how many people you come with you will only be provided with one grill. 

After being provided with terrible service they included a mandatory 15% gratuity on the cash only bill. I have never seen a place so eager to grab your money."}
{"text":"We were craving korean bbq, and decided to try this place out. We just went with the A package which came with only pork and beef for 18.99.

I was expecting some good meats but that never happened. The meat was tasteless and of poor quality. It does come with unlimited side dishes which was nice but most korean joints come with unlimited sides.

I would not go to this place again for Korean bbq."}
{"text":"Good food and price but the service is just super bad. The waitress rolling her eyes at us because we want bigger table at the cubicle, and she also complain if you didn't leave enough tips ( min. 10% from the bill ) one time, a customer didn't leave her enough tip and she chased her through the door. It's hard to get a refill and they usually make you leave soon (if the place gets busy) by turning off the stove."}
{"text":"So we went to the wrong subway stop we were meaning to go to lil piggys... But too lazy to get back in the subway so decided why not try this place jangwon for $18-22 ayce kbbq.

Big mistake. Yeah the price is good but these are the cons:

1. The bbq doesnt get hot enough. Even on max its not hot enough to cook the meat at any reasonable rate. Put the meat on, go outside and catch pokemon for 15 mins then come back and flip it and then take another pokemon go break. My crappy $10 frying pan at home would have cooked tastier pork belly than this. The server said it was supposed to take very long as well. Well if this is how its supposed to be.... I never wanna go back here...

2. The meat is tasteless. Maybe because u can't cook it properly.

3. Service is pretty bad. One server was pretty good but the other was terrible. Ie) putting napkins on the raw meat? Thanks.... Also ignoring us when waving.. Cmon.

4. Probably the worst overall kbbq experience I ever had. Would rather get the chinese style k bbq than this. At least it tastes good.

Pros:

1. The price.

Overall, wouldn't come back here. Meat is tasteless, service is pretty bad. Wish we would have dragged our butts to lil piggy. Or anywhere else..."}
{"text":"For authentic Korean BBQ, this is my go to place! My Korean friend brought us here for dinner once and I've been coming back since. For around $17 or $20, you can have AYCE of 2 or 4 types of meat respectively, which is a great price. 

You cook the meat yourself, and it also comes with lettuce wraps/rice/salad/soybean paste - for maximum tastiness, grill the meat and then wrap it in the lettuce with some soybean paste and salad (rice optional depending on how much carbs you'd like!)

Other reviews have noted that their service is a bit slow at times. This is definitely true, but with their relatively cheap pricepoint, I think it's worth it and you just have to call them a bit earlier to give more of a certain dish or to bring out more meat, and you'll be fine. Also don't be afraid to ask them multiple times for something if it looks like they might have forgotten. 

There's also a great selection of other Korean dishes and alcohol (which will probably bump your bill into the $$$ tier haha), if you're so inclined."}
{"text":"Read online that this had one of the best Korean BBQs in town, so we decided to check it out.  I made reservations for a friend's going away party a few weeks back. We were late as the subways closed due to an incident and it was raining on Friday, I called them to let them know and they were really nice about holding the reservation/nice table for us.  

Once we got there, the restaurant was really bust,  and we got seated,  despite having 2 people still running late and 1 veggitarian friend.  Bare in mind, selections are really limited if you are a veggitarian, and we asked for tofu in the Bimbim Bop,  and told that they don't have it. Strange, was there's tofu in our soup.  

We had the all you can eat that comes with a pop.  Great value for the price and it came with the standard rice,  condiments, and lettuce.  Once our friends arrived we asked for more meats,  and this is where things get strange.  

We asked for another bowl of soup,  as it comes with the meal,  but was told I would cost extra.  Same for the lettuce, rice etc...  As our 2 friends also wanted the all you can eat,  but never was properly set up,  just my friend and I.  Usually,  in an all you can eat,  this is common practice to actually get all you can eat sides too.  Then we asked for the bulgogi beef and chicken that also comes with the meal,  and we didn't like it and asked to switch back to the beef and pork.  Apparently you are not allowed to switch back and forth, and now this is really confusing now.  

Service was slow and some what unorganized, but it was a busy cold Friday night,  and I get it.  But even after it slowed down, service was slow.  Saving grace was that the food was good,  and the meat quality was excellent. I know it's a family run place, so I'll cut them some slack,  as not everyone has had the years of F&B service experience that I've had."}
{"text":"Number one most important thing you need to know: See that button on your table that looks like half of a tiny bowling ball? It's a kind of door bell. Why? If you're wondering why servers are walking past you, ignoring your eager expressions, it's because unless you ring the bell, the (really busy, hard working) servers don't know you need anything. Some Korean friends brought me here when they opened (a few years ago now, despite the fact that they've had their Grand Opening sign up for a few years, but whatevs) and I feel like a horrible person for not reviewing this place sooner! I have been coming here ever since they opened and (after trying many other AYCE Korean BBQ places in the city). Why mess with perfection? After trying a selection of the different meat grilling choices, I stick to my fave - Samgyeopsal (pork belly - sounds gross, totally isn't - it's consistency is a bit like peameal - only better, well, you've just gotta try it). I can be convinced (yeah, forced, twist my rubber arm-like) to come here ANY TIME for Samgyeopsal. So, expect to have your clothes smell like grilled meat (hell, I'd pay for that bonus alone) - and many of the in table cookers don't work, so the server will bring a table top one. If, for some reason, the flame on it doesn't work that just means that the can of fuel has run out - ring the bell, the server can fix it in a jif! If you go when it's busy, the room will be smoky, the servers will be running around like crazy, but hey, it's a popular place. Secret tip: I like to go at odd times like 3 or 4 p.m. when it's empty and we can be guaranteed one of the little side rooms, rather than a table in the middle of the floor. There's always a Korean variety show playing on both tvs. The bathroom is downstairs (door next to atm in the entryway). Okay, so here is how you do it (for the maximum satisfaction Korean BBQ experience): 1. Get seated, don't bother with a menu - just tell em you want the AYCE Samgyeopsal . If you go with 4 or more people (who are, of course, all having AYCE), there seems to be a deal that includes 4 beer/a bottle of soju, but I'm not totally clear on the parameters. 2. The server will bring the table top burner a plate of raw meat and side dishes, along with shredded green onions in a red sauce, lettuce leaves and a rectangular dish with what looks like oil in one half and sauce on the other. 3. Once the server turns on the burner, use the (thoughtfully provided scissors) to slice the meat in half (trust me, I've got this down to a science), toss it on the grill - ask for an extra plate (to place grilled meat on when it's done). 4. Once the meat is done, take a lettuce leaf in the palm of your hand, place some meat on the leaf, then shredded green onion, and a bit of the thicker sauce (from rectangular plate) then wrap it up like a baby burrito, dip the end of it in the clearish sauce (found on other side of rectangular plate). Mmmmmmm!!  Oh, and tip well please - these kids who are servers never stop for a second, are always on the go and professional as well. Enjoy!"}
{"text":"Go here often ever since the owner changed its great to go to this place for AYCE. The vegetables and meat are of better quality. It's a more casual place and it has bells that allows the waitress to know you are ready to order."}
{"text":"The ayce bbq here is pretty good but if you're not Korean, it's gonna be really hard to get the refill. They would just straight up ignore you 80% of the time.

Giving them 3 stars purely for the food, but 0 for the service."}
{"text":"Worst korean bbq I have ever eaten!
Ever since the new owners replaced Chingu, the place has been a mess.
Waitress could not speak english and she did not ask her other coworkers to help translate, nor did any of the other waitresses bother to help until we finally managed to flag someone else down.
Only half of the grilling meats on the menu were delivered to our table. And the ones that did, you could clearly tell they were still frozen/half frozen.
The chicken was mushy, the squid was still frozen solid and the pork belly was sliced badly (the thickness was like the thickness of a chocolate bar) and they were not mariniated.
We came here on a Saturday evening, you would think they would be prepared!!
Extremely disappointed and would never come back."}
{"text":"We were looking forward to coming downtown for authentic Korean food.  Bought 2 vouchers here from Wagjag which we used up.

We have had so far :

Donkatsu (Pork Cutlet) $7.99
Kal Bi Tang (Beef Rib Soup) $7.99
Beef Ribs $12.99
Dolsot Bibim bap  $7.99
Momil Jengban (for 2) $15.99

The food here was delicious.  Comes with complimentary side dishes.  The Kal Bi Tang is among the best I've had.  The Donkatsu was delightful.  The Momil Jengban (buckwheat noodle) was a huge cold dish great for take out.  The Beef Ribs was a bit overpriced though for 3 slices of beef.

The waiters barely speak english, but that's when you know you're at an authentic Korean owned restaurant.  Also notice free coffee posted at the desk, didn't ask about it though since it was too late at night for coffee.

The air ventilation here is very poor due to most tables doing KBBQ with low ceilings.  After dinner we found out we were covered in a layer of grease and had to quickly take a shower afterwards."}
{"text":"I know you might still give this restaurant a shot despite all the bad reviews. However you might be making a really bad choice because I was going through the same phase and the nightmare began:

The restaurant was horrible in general. The worst service to start with: it took them 15 minutes to start serving us (with a 2 hour seating limit) while we were just sitting there looking If anyone would come (didn't even give us water). We chose the all you can eat Combo B (Combo A only comes with pork), since my boyfriend doesn't eat pork. The waiter didn't even ask what we wanted from the combo and went ahead and served us a plate of pork with a little bit of beef. When I told him that my boyfriend does not eat pork and he just laughed and said my boyfriend could focus on the beef and I could be eating the pork. 

We asked for more beef and chicken, and he told us that they needed to change the grill pan for bulgogi and chicken, and we wouldn't be able to grill the pork anymore. Therefore, even though I do not eat that much pork on a daily basis, I still forced myself to eat more or the food would just go to waste. We finished all the beef that was served, and as much pork as I could, and then asked for bulgogi and chicken again. The waiter not only did not change the grill pan but also told us that we had to finish the pork before we could order more. We told him that we never wanted the pork initially, and he took the pork away unpleasantly. We did not get our chicken without asking again, and our grill pan was never changed.

The taste of the food was okay, compared to all other amazing Korean restaurants in K-Town. The menu states that our combo comes with a pop but most likely you won't get it unless you ask. 

We'll never come back here again since there are so many amazing K bbq restaurants in Toronto."}
{"text":"The restaurant meat quality and food taste is horrible :( Also we order combo menu, whereas we donnot eat pork but they don't have any option for us to choose chicken, beef or pork.. 
two years ago when l had been there everything was so delicious however at this time my friends and l was so disappointed"}
{"text":"Visited here recently for a late dinner all you can eat authentic Korean BBQ. Overall, an extremely disappointing experience with average food and terrible service.

Located by Christie on Bloor, Jangwon looks fairly standard for a Korean restaurant. We ordered the full all you can eat menu which was $20.99. This meant you would get access to 4 types of meat (pork belly, pork neck, bulgogi, and beef) soup, rice and side dishes. The food was average in my opinion but definitely much better than Chinese BBQ places like Korean grill house and Chako. This was authentic after all. The meat was good but not outstanding in term of quality (I don't think you should be expecting anything more at an ayce.)

The service however was probably one of the worst experiences I've had at a restaurant in Canada. First off, when we entered the restaurant we asked an older female server for a table. She, for sure seeing us completely ignored us. That was okay because we were able to wave down another younger male server who helped us with a table. 

We were seated in a booth (which contributed to the crappy service we got due to the lack of visibility). We probably waited 15 minutes with no one attending to us to take our orders. I actually sat looking out of the booth trying to wave someone over (had to do this throughout the night). I'm sure I was ignored multiple times. And when I say ignored, I mean the servers would look over to you, make eye contact and proceed to walk away and not come back. We ended up trying to wave down the one younger male server the whole night who actually acknowledged us. At one point we asked for additional lettuce, soup and meats and the female server actually asked us (while not paying attention/looking away from us) to pass her all the empty plates - when they were completely within her reach. I honestly thought that the service wasn't just crappy but down right disrespectful at one point during my night. 

I definitely won't be visiting again."}
{"text":"If I can rate 0-star I would. Worst eat out experience. The food is ok. We arrived at 10 pm for the dinner special $9.98.

On the menu it doesnt say what's on the dinner special. Dinner special was under 'regular'. So when the waiter asked us do you want the regular we said yes.

when the bill came it showed $19.99 per person. I asked them why. the waiter said because you guys ordered ribs.. which is not included in the dinner special. BUT THERE IS NOTHING SAYS WHAT AR INCLUDED IN THE DINNER SPECIAL!!! The lady owner puts her hands togethe and said sorry next time. Next time? There won't be a next time. 

We got ripped off. If we knew we would not order ribs at all.

Now we understands why there ar not many people there on a Friday night. It wa only half full. Compare to the other Korean Bbq dinner special nights this place is quite.

So yes we got cheated! We will never go to this place.

If you want to go make sur you ask them what is on the actual menu otherwise there is always suprise charges."}
{"text":"Came here a couple of years ago and we didn't come back when the owner gave us a hard time when we were short a couple dollars for tips cause we ran out of change. Decided to come again because it was late and we wanted ayce korean bbq. Better experience this time although the server did spill a cup of water all over me. But that was also because he didn't have much space between us so it's fine. Paid $25 in total for 2 kinds of meat. Comes with soup and a bunch of side dishes. Their side dishes were amazing. Servers checked on us quite frequent to make sure we got everything we needed. We also got free soft drinks at the end of the meal."}
{"text":"This place is excellent! Quality meats, great atmosphere, and the owner, Joe is a really nice guy! Highly recommend this place for Korean BBQ. Can't wait to go back."}
{"text":"My advice is not to order from this place, unless you feel like paying $20 for a big bowl of pickled cabbage. I ordered through Uber Eats and my order totalled ~$40 for a seafood pancake, and spicy kimchi with Pork. The spicy kimchi with pork was $20, with 5 measly pieces of pork. When we called the restaurant to see if they sent us a wrong dish, they retorted that they added \"12 pieces\" and that kimchi was expensive. Isn't the issue here about the fact that we had ordered $20 of food with meat - and received almost none of the latter? Bickering with me over how many pieces of low quality meat that was added still doesn't address the fact that your restaurant just ripped us off. Terrible service and the flavour of the food wasn't spectacular either. There are so many better Korean restaurants that give you better food, and service than this place. Save yourself the trouble and spend your money elsewhere."}
{"text":"I went here after seeing it on BlogTO's top picks for Korean BBQ.

Had the all you can eat. It was great. There are lots of sides that come with it. Everything was delicious! My dad was hoping for a more variety of meats though. There are just the 4 options and my dad just counts it as two: pork and beef. He's a real annoying person to take out for nice things. 

Since it was my first time there, I had no idea what our server meant when he said #3 comes after. The Bulgogi beef comes in after the other meats, because the cooking apparatus is different from the standard KBBQ grill top, but it was super tasty! I had a cold, and I still thought it tasted good. We almost ate too much before it arrived, because we didn't know there was more on the way. 

I almost thought the nice server boy didn't like us, cuz we didn't get as much attention at out table, but it turns out there are little doorbell things on every table!!!! What can I say, I am really more self-conscious than able to blame others for how they treat me. ANYHOW, don't forget to try the buzzers, when you need more food! I am too shy, okay? You can learn from my mistakes.

I would love to try a bunch of those other dishes that aren't on the AYCE menu, but it's really hard to turn down AYCE. Am I right???"}
{"text":"I've been to Jangwon many times and can finally give an honest review. If you really want to know how you're experience will be and how to order, here it is:

1. It's pretty busy most times. Booths on the left are great for privacy but it's hard to flag down the waiters when you need them. So if you have no problem with the open area, I recommend it 
2. They are usually always short staff. But it reminds me of Korea where you have to wave the waitress down whenever you need anything. DONT EXPECT them to cater to you like in western restaurants. I've accepted that it's the way it is. You gotta be aggressive, but I have no problem with this 
3. The food is amazing! I have yet to go to a AYCE Korean place that gives you good sides with quality meat! BEST EVER! 
4. Great selection of food. If you're not into AYCE, then have decently priced food. But here's the low down for AYCE BBQ - #1 & #2 is straight up pork belly and neck(seasoned) for a decent price and the rest of the selection at an increased price are SUPER GOOD. I usually go for the cheaper option, and leave the expensive option for special occasions. 
5. Sides are good. You get 4 sides, refills are free (I've never experienced any problems). Extra fees is additional rice and Lettuce. Don't know why, but I'm over it. The soup is AMAZING and there's also a lettuce salad that comes with it. Can of pop is included! 

**there is more options for meat**

Overall, I absolutely love this place. The best in town in my opinion. But if you honestly are expecting to be catered too... then this is not the place. But it's a great place to eat with your friends when you're not in a rush and want legit Korean BBQ. Definitely recommended it!"}
{"text":"Food was great and cheap. Had the AYCE 4 item BBQ. The apps were solid but not exceptional. of the BBQ items, the Bulgoki was the best. I have no idea what the other reviews complaining about the service are talking about. Me and my wife are distinctly NOT Korean (she's Jewish and I'm Indian) and had impeccable service."}
{"text":"Went recently and have the say the service isn't just poor - it's designed to ensure you aren't able to order full value for your time.

The first challenge was getting the attention of the staff.  They were persistent about ignoring you, quite obviously on purpose.  The second was how long it took for them to bring you food, after you'd order it - or reorder, which required getting their attention again.

And then the final insult.  Tried to order bulgogi, and were told they'd have to change the grill since we'd had only BBQ up to that point, and was that ok or did we want more BBQ first.  We took their advice (got more BBQ), finished it up and tried to order Bulgogi, only to be told we were \"out of time\".  They have a 2 hour time limit, and obviously didn't want us getting any bulgogi...

This is one of those places best avoided.  There's plenty of other options nearby."}
{"text":"Came here for some late night grilled meats. This is a more authentic Korean BBQ restaurant that offers four different types of meats to grill - pork belly, beef brisket, pork neck, and bulgogi. While there is the option to order one or two, for a few dollars more you can get all four. Each meat is flavoured differently, because of this the bulgogi is brought in last to grill due to its sweetness. The pork belly is actually quite fatty with little meat but it's so good when grilled crispy and wrapped in lettuce. 

Each order comes with rice, lettuce, salad, soybean paste stew, and an assortment of side dishes. These are refillable. Combined with the all you can eat meat it makes for a nonstop eating experience. 

Servers here are friendly, especially the owner. He will come and sit and drink with you if you invite him, but service is a bit slow. While I love that they have private booths for dining, it makes it hard to get the attention of the servers. Even with the equipped call bells, servers don't respond to them. Aside from that, this place is excellent for Kbbq. Expect to come out smelling like grilled meats!"}
{"text":"They offer traditional style AYCE Korean BBQ, as well as an extensive selection of other Korean dishes. I opted for the KBBQ which was decently priced at 19.99 for four kinds of meat (Korean bacon,  pork neck,  beef brisket and bulgogi), and you also get some complimentary soup, rice and salad in addition to the usual banchan which I thought was generous. 

The quality of the meat was good and although it was unseasoned, the sauce that came with it gave it more than enough flavour (I think it was just sesame oil and salt). The bulgogi came separately from the other meat because it was cooked in a different grill and it had some sweetness to it which I liked. 

But the attitude of the female (owner?) soured my experience because it seemed like she was reluctant to help us with even the simplest of tasks like turning on the grill (it was kinda broken and we couldn't figure it out) or serving us a second helping of meat... I'm pretty sure we didn't overstay our welcome judging by the 2 hour seating limit and the restaurant was pretty empty anyway...

The food was great but the service just made the whole experience feel off."}
{"text":"My friends and I came here yester day. My first feeling was \" Oh! Look like in Korea\". You know why? Because of the decoration here makes you feel really warmed. The boiled pork called bossam. I didn't like too much because its grassy and kind of big for me. And the kimchi is kind of boring. 
However, the jejang noodle is the hero!! I really loved it. The taste really delicious and couldn't stop eating. 
My friends liked both, but I just prefer this one only. 
The bill was 38, and we shared by 3 just 13$ and more for tips. 
P/s: the serveur is really cute, a nice girl!!!"}
{"text":"Came here on a Friday for a birthday, so had about 10-12 people in the party. We reserved a spot ahead, and I was excited to try the \"Chingu\" under new management. Was veryyy disappointed...the waitress did not speak english at ALL. When we asked for more water, she turned down the grill......huh? Yeah, exactly. When we asked for more lettuce, she told us there was no more. We never got the second order of pork bone soup, and we ended up pouring our own waters in the serving area because we were getting neglected.

The main problem was that they seem severely understaffed. This poor lady speaking no english had the whole second floor as her service area, and she had to go up and down the stairs all night. Really, we sympathized, but we ended up the evening nowhere near full and feeling like we were getting ushered to leave. 

Food was actually good too! Just that there wasn't enough of it for an AYCE place. Sigh, fail for them."}
{"text":"Jang Won All you can eat Mon~Thu lunch for $11.99? The choice is easy. 

Meat Meat Meat: Samgyupsal (Pork Belly), Kalbi (Beef Ribs), Bulgogi, Daeji Bulgogi (Spicy Pork) and Chicken.

I usually don't have patient to cook, so I glad that my Yelp friend in charge of the cooking. If not, I would have ate everything half cooked or burnt!  

I love Kalbi and Spicy Pork... there is no limit on what you can order even all those different kinds of soup aside from 2 scoops of ice cream each.

There are also entrees and other Korean fare one can order.

Watching World Cup game while BBQing.. a long lunch break!

15% Service Charge add to the bill. But service is friendly worth the tip!"}
{"text":"This restaurant was not worth the price of it!! So we tried the eat all you can and there are two options for it. First option is 2 meats (2 types of pork) and second option is 4 meats (2 types of beef and 2 types of pork). We got the 4 meat which was around $23.99. With each option you get a cup of rice and soup. The price you're paying for only 4 meats that did not taste anything at all!! It was so bland that you had to use the paste that they gave u in the side dishes. What was even more horrible is the fact that if you want another cup of rice, it's an extra dollar!!! Overall, I would not go to this restaurant again.
Side note: staff was friendly."}
{"text":"took my friends here.. so dirty, the table was't even cleaned.. not enough waiters to serve you, only accepted cash and automatic gratuity applied for 4 people... not worth-it! food is MEH! not going back!!"}
{"text":"Worth coming here for a good quality Korean bbq if you're looking for something cheap (in my opinion, it's better than going to Korean village restaurant, they make it way too expensive) rate 8.5/10"}
{"text":"\"15% tips sneaked into our bill even though we got crappy service and it wasn't busy at all (for obvious reasons)\"


We had reservations before we came but they didn't remember anything and asked our information again then we decided to take the AYCE with 5 choices of meat but they were served little by little and they were not happy because we ordered a lot.

The water was free but they kept forgetting about it even after asking 3 times. If you ask for extra sides included they will reuse your old dish. Even it's AYCE you only have one bulgogi which is the last dish because they don't want to change the grill. 
Now the worst part is that they gave me the bill after I already paid, she printed a new bill with 15% service fees then asked me to pay for it instead of the old one. It's so ridiculous because they didn't tell me in front or in the menu like other places. 

The food was OK but they did give me the Korean dip which I haven't had in other places. 


Definitely won't come back."}
{"text":"Lively and very popular Korean BBQ joint.  Several meat assortment options for the all-you-can-eat menu.  The cooking is done on a tabletop hot plate instead of on a table carve out.  The pork belly is very tender and the bulgogi is well marinated.  Better than average side dishes with hot soup as a bonus.  Quick service despite the crowd and not too pricey."}
{"text":"Definitely not my favorite Korean grill place. Mostly because I didn't feel the meat was flavorful at all. Only the pork ribs were marinated but the pork belly and the beef were not marinated at all and when we cooked them they had no flavor. The bulgogi that we also had was decent but again, the taste of the meat was not satisfying at all.

The good thing was the numerous amounts of sides served. There was kimchi, fried tofu, sprouts, seaweed salad, Korean salad and tofu and potato soup.

All in all, definitely better Korean BBQ places out there."}
