{"text":"Between the three of us we consumed two different soups, the vegetarian spring rolls and pad Thai, the chicken pad Thai and \"les brochettes d'amour\". We also received service from Siv. Everything was Excellent!"}
{"text":"C'est la troisième fois que j'y vais et je ne suis toujours pas déçue. Un bon service et un large choix de plats pour tous les goûts : gourmands aux arachides ou ananas, végétarien ou plutot healthy avec du poisson aux legumes. Je conseille particulièrement les dumpling aux arachides et le poulet general thao. Les prix sont corrects et les quantités plus que raisonnables. En plus, la terrasse a l'extérieur est très agréable."}
{"text":"Sympa resto thai/cambodgien/vietnamien, offrant presque tout les plats principaux en version végétarienne avec imitation de viande ou tofu. Ça me sauve d'aller jusqu'à Chu Chai!  J'ai déjà commandé pour emporter plusieurs fois et mangé sur place une fois, service rapide chaque fois. Très bien d'avoir un resto pareil dans le quartier car pas beaucoup d'options dans le coin sinon.  // Good thai/cambodgien/vietnamese restaurant, offering almost every main dish in a vegetarian version using fake meat or tofu. Saves me having to go to Chu Chai!  I've gotten takeout a few times and eaten in once, service was friendly and fast each time. I'm glad to see another dining option appear in this otherwise underserved corner of the neighbourhood."}
{"text":"Je n'ai fréquenté ce resto que sur l'heure du dîner.  Par contre je n'ai pas été déçu.  C'est un bon restaurant de quartier qui se dit à la fois cambodgien, vietnamien, thaïlandais et végétarien (rien de moins).   Comme c'est souvent occupé le midi et que mon temps est compté, je me contente de prendre dans ce qui est offert dans les spéciaux du jours (ça ne varie pas souvent). La nourriture est bonne, j'aime bien la soupe Bangkok (vermicelle,  cari avec un bon gout citroné).  Les roulés impériaux sont \"ordinaires\" mais pas mauvais. Je donne 4 étoiles car le rapport qualité/prix est là.  On s'en tire pour moins de 20 $ (pourboire inclus)  pour une soupe et un plat principal et la qualité est très honnête et les choix dans le menu sont très interressant et alléchant :-)"}
{"text":"Juste délicieux! On a retrouvé le goût de la Thaïlande! Tout était bon, de la salade thaïlandaise à la glace vanille en passant par le poulet Tao et les fruits de mer, nous nous sommes régalés. C'est un \"apportez votre vin\" ce qui donne un petit coup de pouce à l'addition. Si vous l'avez oublié le dépanneur juste côté saura remédier au problème. Situé dans l'Est de la ville sur la piste cyclable l'intérieur est paisible et la belle terrasse calme et verdoyante. Le service est correct, la dame souriante d'authenticité. Attention la cuisine ferme à 21h!"}
{"text":"This bring-your-own wine, Asian restaurants in Rosemont (close to the Olympic Stadium and the botanical gardens ) is a step above other Asian restaurants in the area. The Decor is modern, tasteful and relaxing, and the  service is excellent. The price is slightly higher than other Montreal Asian restaurant however the food makes it well worth it!"}
