{"text":"Pepper beef and cantonese noodles delish! What a deal! The shanghai noodle soup leaves a lot to be desired though. Bland broth filled with udon style noodles and porc and shrimp. Palatable with lots of siracha!"}
{"text":"I like the foods and the price! Been hearing a lot of good things about this place! Finally got the chance ti go today! I will go back because I enjoyed it!"}
{"text":"Went for lunch and ordered a lunch special.
The food was not of high quality and the price slightly high for a lunch special at a Chinese restaurant.  The meal came with a toast of bread, which does not make culinary sense.

In summary: Food subpar, hot sweetened tea abnormally bitter, will not go back."}
{"text":"Jardin du sud is as cheap and passable add it gets. The hours aren't particularly great, I don't think they deliver, the service, food and location are utterly forgettable.

That said, if you're craving cheap HK food in Brossard, this is a safe bet.

It certainly beats sukiyaki or tiki ming or those typical fast food \"Chinese\" restaurants that seem to be in every corner of the Montreal area."}
{"text":"If you're looking for good Hong Kong style food, this is the place I would recommend. It's a bit far if you live on the island, but it's worth the drive. Been here on multiple occasions, for breakfast/lunch and supper, and I've never been disappointed. I grew up eating Chinese food, so I like to think I can tell when something is actually good. 
For their breakfast, their congee is great, it's thick and homogeneous, I really like the seafood congee, especially with the fried dough. 
I don't remember seeing it on the actual menu, but we've ordered a \"Chu pa bao\" (which literally translates to pork chop bun) several times and it is amaaaazing. It's basically a slice of pork chop (not in the traditional sense, but its marinated with this thick sweet sauce and probably panfried afterwards) slipped in between a toasted baguette with caramelized onions - oh man. So good. Pair that with their cold milk tea is just superb (I highly recommend the cold milk tea!! - fantastic!) 
For supper everything I've tried there has been delicious, from the chicken curry, to the hot stone pan black pepper beef fried noodles, to their Cantonese style chow mein, everything tasted perfect, like the way I grew up with. 
So if you're looking for good Hong Kong style Chinese food (not the westernised versions) I would suggest Restaurant Jardin du Sud. I wish it were easier to get to though...
And their prices are completely fair too! Which is a big plus!"}
{"text":"Food was delicious. However, about two hours after I ate it I became violently ill. Unfortunately, my girlfriend and I are on a road trip and we were in a small town with no businesses open when the storm hit. I pooed many places that night. None of them were actual bathrooms. Sorry to the poor McDonalds employee that will discover my shame the next morning. Would not recommend this place."}
{"text":"Quality Hong Kong food...

Outside of Hong Kong?

I think so.

This place has the best Chinese yellow curry I've ever had. I've tried their beef curry, their chicken curry, and finally their seafood curry (which unfortunately is only available for lunch) and.. it was delicious. And an amazing amount. And their meals usually come with something (soup and bread, for example).

Open late enough for someone like me to be happy, plus.. oh yeah. Real Hong Kong milk tea? As in, tea with milk, not just milk tea powder? The boba/tapioca is fabulous, too. Their food in general is delicious.

I can't really find much wrong with this restaurant, and I'm usually so picky.. but it's awesome. Really."}
{"text":"Not bad for a place we found by fluck. Most of the food was authenIc and extremly cheap. I pretty much liked everything.  I esp. Liked the curry chicken."}
