{"text":"Don't go here if your are looking for fine dining. But if you are looking for no nonsense greasy spoon, try their smoked meat poutine, this is a great place & being opened 24hrs doesn't hurt either."}
{"text":"Peu importe l'heure de la journée, j'ai toujours aimé ce qu'on m'a servi chez Jarry."}
{"text":"Granted I DID walk in with some huge expectations and well - I was disappointed. What is the big deal? The smoked meat is OK (honestly it's not much better than the packets you buy at the grocery store) and their fries are not too bad. I ordered extra-lean and still got some awkwardly gummy parts to the meat. Their bread is stale. Isn't smoked meat supposed to be enjoyed on soft thin bread? Toasted maybe but stale? I'll pass.

The place itself smells strange ( and not the mmm meat way). The furniture is seriously outdated. By outdated I mean half broken tables & ripped booths. I suppose it's a good place to go to as a late night snack and like I said the fries are decent but this place really should not be anyone's first choice (or 2nd, or 3rd)."}
{"text":"Nous y avons pris 2 poutines à emporter, une avec smoked meat, l'autre au bacon. La sauce et l'accompagnement etait bon, en revanche les frites n'était vraiment pas à la hauteur (molle et sans gout). Ce n'est pas une adresse que je recommanderais pour la poutine, peut etre pour la smoked meat, mais je ne suis pas assez connaisseur sur ce point."}
{"text":"J'ai apprécié mon sandwich! Service rapide et simple. J'aurais aimé que mes frites soient faites de pomme de terre fraîches au lieu de surgelées,  mais elles étaient chaudes et cuites à points. Mon sandwich était goûteux et la portion était adéquate, tranche épaisseur et plutôt cuit vapeur que fumé ce qui lui procure une texture humide plutôt que sèche. J'ai toujours ma préférence en matière de viande fumée.  Mais je peux dire que j'ai apprécié min repas et que je retournerais sans hésiter à ce restaurant"}
{"text":"This place is a unknow institution in montreal. There smoke meat is legendary ( i don't like poutine but there smoke meat poutine just wow). Word of advice if you are willing to eat smoke meat order it full fat. They are open 24hrs so you can have you smoke meat at any time."}
{"text":"Oh hell yes! This is where its at. The place for an instant cardiac arrest at the price of awesome great food. The poutine is worth the trip to the north-east end of Montreal. This is a gem of gems."}
{"text":"Went there at 4AM and theres puke everywhere. The only nice thing is that it is a 24h restaurant.  I took their fettucine linguine and i thought it was a soup.. barely any noodles but full of liquidy sauce. The pork in their pita was literally burnt and tasted like carbon, they gave another pita to go after that we told them it was too burnt but they gave us chicken pita this time. The waitress gave a good service but it looks like the cook dont give a damn. Price not worth the food."}
{"text":"Awesome!!! Best smoke meat in Montreal!!! Try the Poutine Jarry Poutine!!! It's to die For !!! Service is great!!!! $$$$ is good & open 24/24"}
{"text":"Went to this spot on a recommendation from my boss.  Even though it's far from downtown, it's open 24 hours and getting their smoked meat platter and special Jarry poutine, it's to die for.  My only gripe is that it looks dated and the coleslaw I had wasn't too great but that a pretty minor, will hit this place up more often when I visit Montreal."}
{"text":"OMG!!! How has no one ever reviewed this place! This has been a landmark for decades!!!  Open 24/7, the place eastern Montrealers go after a night of debauchery!
Though this place is dated, & the waitresses are as old as the hills, I still had to give it a 4 star rating. I guess cause of nostalgia. Oh, and their smoked meat poutine freakin rocks!!
The sauce on this poutine is dark, thick and salty! It's old school sauce you can hardly find anymore. I love it, and though they use grated mozzarella instead of curd cheese, it just really works.Then add on the moist, juicy smoked meat on top and HEAVEN ON EARTH. 
The other things to try are the smoked meat pizza and the midnight specials, huge burgers on kaiser buns, and wraps with a side of poutine. 
This place is a dive but one of those good old fashion dives we can't help but love.
Try it out, let me know what you think."}
{"text":"Ouais bon... Grand fan de smoked meat, j'avais le goût d'essayer ce soi disant haut lieu du smoked meat de Montréal. J'y ai été amèrement déçu. 
Premièrement, quand tu sens que tu dérange la serveuse en voulant placé une commande, ça commence mal. Elle prend ma commande comme si je lui annonçait une visite chez le dentiste. Bahh... que je me suis dit... Elle a eut une mauvaise journée, je vais me régaler de ce smoket meat légendaire. Comme dirait nos amis anglo: Wrong again. Le smoked-meat est relativement sans goût, si ce n'est celui d'une viande qui a peut être un peu trop veilli, les frites sont tristes et froides et je n'ai pas osé toucher la salade de choux. Quand on pense au choix que l'on a à Montréal pour le smoked-meat, Jarry Smoked meat n'est vraiment pas à la hauteur."}
{"text":"So who goes to Montreal and DOES NOT try the Montreal smoked meat sandwich.  Well apparently me.  I've probably been to Montreal 10 times and NOT ONCE have I tried the Montreal smoked meat.  Well finally 10 times in the making I was able to make it somewhere to have a real Montreal smoked meat sandwich.  I ordered the Ruben.  Super thick super big super filling sandwich.  Juicy, tasty, messy.  Everything you can possibly ask for in a sandwich.  Fries were perfect, crispy and tasty.  Service was fast and good.  Jarry's will be seeing me the next time im in Montreal 100%

Oh and its open 24 hours might I add. (DANGEROUS!!!!!!!!!)"}
{"text":"Awesome jarry poutine is probably the best thing on the menu. Always good smoke meat can't deny. Hours are unbeatable 24 hours. Desert kinda sucks, but I don't know why you'd eat desert at a smoke meat house"}
{"text":"Good smoked meat in the east end/St Leonard area. We usually order the smoked meat poutine and the smoked meat platter - both are pretty good however they don't compare to the smoked meat at Dunn's or Reuben's. I removed stars for the interior decor or rather lack thereof. Once inside you feel like you're in the 70-80's and not in a good way. Service is fast although quite dry. I have returned to this resto several times due to proximity, ease of parking and pretty decent food. It is one of the few 24h restaurants so convenient for those late night cravings."}
{"text":"First time here from NYC. We liked this diner a lot. The staff is friendly and the food is good--lovely smoked meat sandwich."}
{"text":"je vais a ce restaurant depuis mai 1973 ( 39 ans )  . c'est tout simplement le meilleur endroit pour manger du smoked meat.j'ai essaye plusieurs endroits mais jarry reste le meilleur.

michel goulet"}
{"text":"Jarry Smoked Meat est désormais une référence pour moi lorsque vient le temps de manger un sandwich à la viande fumée. Le service est courtois et rapide et la caissière au comptoir des commandes à emporter est toujours très gentille et patiente avec mon fils !"}
{"text":"I came across this place a few years back with my sister when we were starving at midnight and staying in Anjou (don't ask...) Well on my most recent trip to Montreal, all the usual smoked meat haunts were nowhere near any available parking so off to Jarry we went. 

The service was great. Our server's English was so-so and so-so is my French so we all understood each other quite well. The smoked meat is not the best I have ever had but not the worst. They do offer it in a fatty and leaner version so for the uninitiated the leaner can be a better way to wade into the pool. There is the option of having a poutine with the sandwich but for $4 extra I was not expecting it to come out with shredded cheese. Not quite blasphemy because the gravy was good but where were the curds?

Parking is out front and a bit tight as well. I guess there are on street spots but it also seemed a bit sketch and I would not want to park too far from the light. Don't let the surroundings deter you from going, especially if it is late. It is a diner with a Québécois accent through and through. Charming to see another side of the city."}
{"text":"Fantastic diner. Came here with a friend as option one was closed for summer vacation. This is as Old Skool Montreal Diner as you can get. Like a truck stop diner or Guy Fieri working man's food. Don't come here to expect gourmet dining but come for old style MTL diner food. I decided to go with the Veal Parm and Spaghetti. It came served as a gargantuan serving. One of the best versions I've had in a while. Served just as I love with loads of sauce. The veal Parm sauce was tomato goodness and the spaghetti was different and a but more richer bolognaise style. My plate was also served with Caesar salad. It was a decent salad but not amazing. My friend dining had the London steak. He claimed his was delicious as well. Open 24 hours I'll be back for more."}
{"text":"This place is a fixture in Montreal when it comes to smoked meat fares. It's off the beaten path next to a highway and far form the usual touristy spots. 

The restaurant has been there forever and you can tell by the decor of the dinning room. But this is not a bad thing, it has some nostalgia and brings a comfortable feeling to the place. 

The staff is nice and friendly and they can serve both in French and English. 

In the menu, I recommend the classic smoked meat sandwich as well as the baked poutine with smoked meat. These two items are plenty for two hungry people. 

Place is clean and is open 24/7!"}
{"text":"I give it 5/5 because I go there with only one purpose.
I went out and it's 2-4 am, I'm hungry, and I order their special poutine smoke-meat !!

You can't go wrong with that. 
I usually share it with a friend.

The restaurant is open 24h/24 and the waitresses are really nice !! 

I cannot comment on other points.



Je donne 5/5 pcq je vais dans ce restaurant 
1) je suis sortie tard et il est 2-4h AM
2) j'ai faim
3) je veux une poutine et je prends leur special smoke-meat

11$ le plat, ça se partage à deux (ou seul si on a vrm faim) et on ne peut pas se tromper avec la poutine smoke-meat : c'est atrocement bon!!

Ouvert 24h et bon service."}
{"text":"J'ai mangé ici un excellent sandwich. La viande fumée est tendre et le mélange d'épice est balancé. Franchement l'un des meilleurs comptoirs à smoke meat de la métropole. Certaines critiques écrites par des collègues Yelpeurs dans le passé relataient la décevante qualité des frites. Et bien le propriétaire semble les avoir entendues! Fini les surgelées. Jarry SM offre maintenant de vraies bonnes frites maison bien dorées.  Services rapides et décors de vieux resto de quartier. Charmant si, comme moi, vous aimez le genre."}
{"text":"Recently, I saw a friend post yummy photos of smoked meat sandwiches. I recognized the location and food. I then realized that I have been to Jarry and never posted my review. Well, let's fix that issue now!

I was in Montreal in April 2015 for a few days. On Easter Day, I needed to get some lunch. I saw that Jarry Smoked Meat was open and walked in.

It wasn't too busy. I got a table immediately.

I ordered Jarry's special platter. It consists of a smoked meat sandwich, with fries, coleslaw, and a pickle. I went with medium fat content on the smoked meat. Hey, when in Montreal, go with flavour and the best smoked meat!

I absolutely loved my sandwich. The smoked meat was flavourful, tender, juicy,... oh my gosh, I can't stop drooling as I write this review. You get a generous amount of meat in your sandwich. The bread was fresh and delicious.

The fries and coleslaw were yummy. It was the perfect plate to have for lunch.

I can't recall whether I had a Diet Coke or Pepsi. I do remember washing my meal down with a drink.

I didn't have any issues parking. I like that this place is open 24 hours a day, year-round. This thankful hungry gal was happy as can be that day.

I would love to try the other items on the menu a try when I am in Montreal again.

(221)"}
{"text":"The food is okay but nothing to write home about.  The main appeal of this place is that it's open 24 hours so it's a good place to go after you've been drinking all night for a dose of greasy food.  There is also a special on the smoked meat the first Tuesday of every month."}
{"text":"I was quite excited to try this place as I heard it may be considered a landmark deli or iconic smoked meat establishement combined with the fact that it's open 24 hours - we were off to a good start.

The menu is extensive and features all your classic diner homemade style foods, including breakfast served all day if you just fancy eggs in the middle of the night. I love comfort food so I'm happy with the casual menu and low prices. What I found disappointing was how small the portions were. The largest smoke meat plate they offer really wasn't big at all and the fries and the poutine are underwhelming. The fries are skinny, too crispy and taste like freezer burn. Plus they use cheap grated mozarella instead of curd cheese for the poutine. It's not the classic Quebec style I was expecting.

Our table got a mix of smoked meat, lasagna, rice, souvlaki, poutine, cake and pie, all of which was decent but not great. 

If you like big portions, this place doesn't deliver the generous sizes you would come to expect from a homestyle deli. Mama's cooking really IS better in this case.

Most dishes are within the 15$ range, including the table d'hote specials, so it's very affordable and would serve well as a family outting."}
{"text":"Love the fact it's open 24/7. Great choices of food items and poutines. I took a poutine with minced beef and mushrooms, and it was okay, just a little too greasy for me. We had to wait awhile before being served and for our orders to come in. Their cakes, especially their famous chocolate cake, is absolutely decadent!
It's a good place to come eat during late hours."}
{"text":"It's been many years but I finally came back. Me and a buddy started with the calmar plate it was a littel smaller then expected  it's was all right not the best I had worst over all not recommend. I took the smoke meat poutine can't go wrong . Friend took the burger it didn't look or taste good ."}
