{"text":"In town for business & I ordered the beef panang w rice & received my order in relatively good time. My panang was loaded w veggies: zucchini, carrots, broccoli, green beans & a good amount of beef. Got a complimentary upgrade to my very tasty strawberry lemonade, which I recommend as well!"}
{"text":"Very good food and nice interior come check this out. If you looking for a fantastic food with a nice interior insight you should come check this place out"}
{"text":"I had a chance to taste a few dishes on the grand opening day and the food was amazing!!!! Green curry and Pad thai with shrimp was fantastic. Also, the atmosphere inside was fabulous especially the huge chandelier in the middle of the restaurant plus the color and tone make me feel like i was in the high end restaurant. Finally found new spot to hangout with friends with good service at reasonable price. Go check this place out!!!!"}
{"text":"The service was ok I was there during lunch today and they forgot to serve me the soup that came with my lunch order. The portion was ok and flavors were there so so. Definitely will not return."}
{"text":"I ordered takeout from Jasmine this week and had a great experience - quick service, friendly staff and delicious food.  We enjoyed the steamed dumplings (wish we had ordered more), the panang curry with pork and the pad see ew with pork.  This will definitely become a habit to pick-up on my way home from yoga!"}
{"text":"This restaurant has new ownership and it is much better than before. The inside has been remodeled and is very nice. The food is delicious. This time I ate the jasmine basil with pork and really enjoyed it. I look forward to coming back with my friends many times."}
{"text":"I hoped that the food would improve with the change of ownership. It did not. If you love thai food, which I do, avoid this place. Poor quality. Not fresh, premade sauces and not talking maeploy which still can be used doe a yummy thai meal.  This is bad food."}
{"text":"Very good food! We tired the orange chicken and it was delicious! Make sure you try the thai te as well, best tea ever"}
{"text":"Great food, Real Thai Food taste, Excellent Services, Perfect Recommendation from the Staff and clear explication about the food options.... Everything Delicious, the Food and the Tea. I will come back anytime."}
{"text":"I stopped by on opening night and tried the massaman curry. It was delicious and I look forward to coming back to try the other dishes."}
{"text":"I have eaten a lot of good Thai food and this was the worst. I ordered Pad See Yew. The noodles were narrow and dry, the sauce flavorless and not really good. I ask for the chill in fish sauce on the side and they used dry chili flakes , what kind of real Thai place does not have real chili???"}
{"text":"New owners, new tastes, new interior. Different and unique take on Thai food. Modern feel that reminds me of some of the best restaurants I visited in Bangkok."}
