{"text":"Tried out this place for lunch yesterday (2014/09/18) since I was in the area. The woman working there at around 12:00 noon and taking my order was extremely rude beyond belief. There was also a younger girl working who prepared my burger - she was OK; nothing to blame her for. I am providing this information in case management will see it. That older woman should not be working in the service industry if she is going to rush customers and get annoyed about them!  Also, I was almost overcharged for my meal until I pointed out the mistake to her. Her reaction was more attitude and shooing me away after correcting the mistake without a word. I could tell she didn't give any shats and just wanted me out of her sight.  Food was average, but I didn't come here expecting to be blown away. However, I rather get the same average food elsewhere without being treated like a doormat. That said, I will never be coming back ever again and management can thank that woman for this!"}
{"text":"Since they changed the size of there juicy burger I will definitely not be going back. It's not the same as before."}
{"text":"Love LOVE this place! My fav is the chicken crunch sandwich or wrap! Who doesn't like melted cheese and bacon on crunchy chicken?!? Their fries and onion rings are nice and crispy always and their burgers are DELISH too. I'm still exploring the menu but everything I've got so far has always been done to perfection and the management is wicked awesome! They also have this cool rewards swipe card and I get money off coupon texts to my phone. My only complaint is a usual combo comes with a small drink"}
{"text":"Some of the worst burgers I have eaten( I've been there on a number of occasions simply because there used to be nothing for miles, but now there is a place, I won't name it, that I can get a burger-fix from.  Admittedly, the first burger I had there was decent, which is why we returned so many times.  The last time we went there the \"cook\", from a small chaffing dish from atop the grill, took a dried out burger and threw it back on the grill to warm it.  Yummy.  It was dry and over-cooked. We asked him why he did this and he muttered something about foo safety.   The lettuce went on the bun with water on it, thus soaking my bun, turning into a soggy mush.  The fries were sitting in the basket over the grease, and, were dropped in already cooked to warm them.  mmmm.  It's waaaay over-priced, and I have to guess because they are over-staffed, and the actual owner doesn't work there, so prices have to pay the employees a wage, and the owner.   Rip-off.  Avoid"}
{"text":"We waited over two hours to get food that turned out to be a soggy, inedible mess. Staff had nothing to say about it besides \"We only have one driver.\"  Yeah, you should maybe stop taking takeout orders when you're overwhelmed. That's a charming combination of poor management and incompetent staff."}
{"text":"When I was in the neighbourhood I found this indie burger place near Centennial College.  This is the equivalent of what Lick's was, and there was a lot of old classics that looks to be home made.    Their burgers are on par with what you would expect, and the owner is a real hands on type.  Along with the burgers, you also get specials.  I got the burger, a chili poutine, and an Orange Crush.  Everything is made well, and they make their patties fresh I believe.  I would definitely come back when I need a quick bite, and it's good to see a place like this still be around in suburbia."}
{"text":"I came in very hungry today, and wanted a burger, fries, and a milkshake.  The hamburger was absolutely delicious! The meat was fresh, juicy, and had a lovely texture. The toppings were crisp, and full of flavour!  The fries were a nice, crunchy golden brown on the outside, and soft, moist, and fluffy on the inside.  To drink, I had a vanilla shake, and it complimented the meal beautifully.  I'm a picky eater with very high standards, and a lot of digestive and health problems. This restaurant impressed me, and the food made me feel good after eating it.  The atmosphere in the restaurant is pleasant, relaxing - a typical burger joint, but with a modern twist.   The fellow who owns the place, knows how to run a business, takes pride in his work, and that shows in his food!  5/5, would strongly recommend!"}
{"text":"I have been eyeing this place for awhile and decided to finally give in and try it! Not to mention I saw the deal of the day and that brought me in. Funny enough, I didn't get the special once inside.  I ordered the make your own Jetsun burger and got the crispy chicken burger. Just a heads up: the chicken burger is more of a two crispy chicken strips burger. That was a little bit of a let down. The topping station is stocked alright- the garlic mayo and bbq sauce is yummy. I ordered the Chili cheese fries as my side and It was ok. I wouldn't order what I got again if I do come back.  The atmosphere has a diner feel to it and the service is what you would expect from a burger joint."}
{"text":"This place was pretty good when I went shortly after it opened.  Back then they had decent burgers and good milkshakes.  Fast forward to the present.... looks like the place hasn't been cleaned since they opened.  Ice cream looks very unappealing; melty/re-frozen/very-old-scooped-into-new/frost-bitten.  The sign says they make the burgers fresh every day.  All burgers that I saw going on the grill were frozen solid.  Maybe they make them every day and then put them in the freezer?  Fries were nothing special.  The meal comes with a small drink.  Generally a medium is the expected size.  My burger was overcooked and hard on the outside.  The bun was fresh is the nicest thing that can be said about it.  Of the two servers behind the counter, agreed about the lacklustre personality of one, and the other must have been first day new  which is not necessarily a bad thing, but the amount of fuss surrounding successfully placing french fries into a bag was a bit much.  Five Guys is just down the street.  Quality food, fresh, not frozen burgers, extra fries purposely spilled into your bag, excellent staff and similar pricing for better portions."}
{"text":"Average burger. Poutine not good. Fries limp and tasteless. Go to the Wendy's across the street."}
{"text":"Real good. I thoroughly enjoyed it. If you are looking for a links type burger check this place out.   Make sure to check in before you buy. You get a 2 can dine for $15.99 deal."}
{"text":"I went to Jetsun's Juicy Burger about last month, ordered the philly cheese steak combo. It was one of the worst philly cheese steak I've ever had. The bun was small, the beef had no flavour and the cheese wasn't good at all. I got some fries with my combo which looks like home fries but like the rest of the food, they weren't tasty at all, they tasted old. I didn't finish my philly cheese steak nor the fries. The best thing about the combo was my orange pop. I am never going to eat there again and on top of that it was pricey."}
{"text":"Was half decent the first time I went close to when they first opened, seemed to imitate Lick's while not quite as good as Lick's (whether or not you like a Lick's burger)   So they were having some free combo deal or something (it was a while ago) figured I'd give them another shot.  Absolutely. God. Awful. Stale bun, veggies starting to rot, barely cooked fries, dirty seating area, dirty prep counter. The almost decent burger patty could not overcome everything else that the burger was put together with.   1 star only for the service (and because I can't rate it 0). The guy was nice.   If you're in this area looking for a burger, just go to the Mickey D's in Walmart or the Lick's by Best Buy/Homesense."}
{"text":"Delicious turkey burger. I had mine on a whole wheat bun with avocado, sautéed mushrooms, tomato, bbq sauce and dill relish. Very friendly, diner style.  On previous visit I asked the person inches their favorite and I ended up with gravy and cheese curds with bbq sauce on a beef burger. Messy, but also delicious."}
{"text":"With the abundance of \"gourmet\" type burger places showing up in East Toronto you have to bring something special to the table to stand out.  Jetsun's shows up to the party but feels like a wallflower.  The burgers here are grilled right in front of you and assembled the way you like it. It's tasty and filling but lacks the flavourfullness of other burger joints. Fries are homecut but the sizes aren't generous.   I have been pleasantly surprised by the quality of shakes from Jetsun's. A shake is a seemingly easy beverage to make but so often it comes to you either too thick or too thin. Jetsun's seems to get it right and the small selection of ice cream on hand includes traditional flavours and few exotics to meet your mood.  The restaurant itself doesn't offer much seating and the booths aren't incredibly comfortable. They do the trick but it feels cramped.   If you're in the shopping complex Jetsun's is located you won't be disappointed by choosing to get your burger and fries here, but if you're looking to go out specifically for a gourmet burger, there are better options in the neighbourhood."}
{"text":"Litte Jem. mixed in with a bunch of other stores pretty easy to miss. the gentleman that was working was very friendly. fresh cut fries and very good gravy one of the best poutines I have had outside of Quebec. lots of gravy and cheese to last to the very last bite. will definitely be back."}
{"text":"Jetsun's makes a good burger and made right in front of you the way you like it. You can even ask for it grilled to the temperature of you choice because they ground chuck. They have limited toppings but bit is all fresh. The fries are home cut and good.   The restaurant is cramped but large enough to grab a quick bite.   They are many burger joints but if you are in the area you will not be disappointed in the food or service."}
