{"text":"Absolutely horrible. Asked for medium cooked prime rib. Tasted like they cooked it in the crock pot. Lobster mac and cheese was ice cold. Lobster tasted like rubber. Even the soda tasted bad. Will never be back."}
{"text":"My wife and I ate there for our anniversary in early a December. We had reservations for a Saturday night and was promptly seated. The restaurant did not fill up all night which was concerning.  We were somewhat surprised at the seating expecting somewhat better seating accommodations. Most of the tables are tall tables near a large bar. 

Our service was good, not great but pretty good. We ordered cocktails that were very good.  The crab cakes for appetizers were fantastic.   The she crab soup was so good. I ordered the  regular crab legs and my wife ordered the bone in filet.  Our sides were family style which is a great way to serve and large portions. My crab legs were cooked to perfection. My wife liked the filet but was not in love with it as much as she was expecting. It was cooked very well. 

So why the 3 stars. PRICE versus the overall dining experience.  First the atmosphere is a loud bar type experience.  Tables were just ok, but not fitting for fine food.   And then the small stuff that does not add up for fine higher cost food.  For example the butter that went with my crab legs solidified about 15 minutes into my meal.  Really, you don't serve clarified butter.  Typically with a messy crab leg meal you would be supplied with another plate for the shells and extra napkins. Not even a packaged towelette for cleanup.  Had to pile the shells up on the table. For the cost the service should be spot on which it was not.   The food is very good, but not quite there with the whole package.  Bring the food cost down to the level expected or improve the dining experience!"}
{"text":"Was pretty excited to have a steak and seafood place in Matthews but very disappointing. The service wasn't very good and we had to order our beers several times because she forgot and took over 20 minutes for a beer. The food was ok but nothing fantastic and all the steaks ordered were over cooked. The crab legs however was good which is why I'm giving it two stars instead on none."}
{"text":"This place is great for a date night or if you have to bring the kids early and have them taken care of with food they would eat. Free WiFi and the oysters were fresher than what I had on the coast this week. Staff was friendly and great with the kids too. can't wait to bring the wife back here and experience a date night."}
{"text":"I have had better food at a gas station. Don't believe the facebook hype. Total garbage."}
{"text":"Tried to come here for Mother's Day.  We made reservations for after the rush was over thinking service would be better and more relaxed at that time.  Nope.  The restaurant wasn't packed at all, yet every single server passed by us several times without even acknowledging us or telling us someone would be with us shortly.  After we were flat out ignored for several minutes, we decided to leave as we could tell how poor our service was going to be.  We told two people on our way out that no one had even acknowledged us and all we got was \"I'm sorry about that\".  No offer whatsoever to even serve us or make it right and I believe the one lady was a manager.  It was as if they were glad to see us leave because they didn't feel like dealing with any more customers, which is unfortunate.  I don't think we missed out on much as we heard people at a nearby table complaining that the food was not at all worth the price tag.  Unfortunately, by the time we decided to go somewhere else, every other restaurant was packed and I had to cook my own dinner.  Needless to say, we will not be back.  I am a huge supporter of local establishments so this was truly disappointing, especially since this location has changed hands so many times over the years.  I was hoping to have a nice local spot that wasn't a chain.  I guess I'll keep looking."}
{"text":"First time here for lunch.  Interesting theme inside. Very nice staff.  Promptly seated. Wife had lobster rolls and I had shrimp toast along with a bowl of clam chowder soup.  
Everything was very good. (Especially the clam chowder). 
Will be back to try some other things for dinner!"}
{"text":"I've been here a couple times. Always tried something different. It's always been good. First time we split the massive porter house. Another time we got a couple seafood towers. The oysters are good chargrilled. The shrimp are MASSIVE! The big seafood tower even came with a lobster & crab legs. It's pricey but if you're with s group it's totally worth it! 

They could use bigger tables. The menu is rather large, so are the portions, so sometimes table space is limited. Otherwise, really solid place."}
{"text":"Went to JG's last night with two friend's, all of us trying it for the first time.  Based on my experience, I will definitely go back!

Staff was super friendly.  We sat up at the bar (our choice) and there was no shortage of jokes/conversation with the wait staff/bartenders or manager.  Super friendly atmosphere.

I didn't get a full on meal (ie an entree) bc I was in the mood to try their seafood.  They have an amazing list of fresh oysters with fabulous descriptions to help you decide which ones to try.  I got a half dozen made up of three different kind and they were DELICIOUS!   Hands down some of the best oysters I have had.  Then I had the drunken mussels.  When one orders muscle or clams, we normally expect to get a dozen or so.  Not the case here!  I cannot even express enough that you really get your money's worth.  It seemed like the mussels we're never ending in my little pit.  My friends were even joking bc I was trying to finish them off after they had finished their meals!

I also tried one of their specialty drinks at the bar and have no complaints.  Overall great first impression and a wonderful experience."}
{"text":"Not good. People who run it don't seem to know how to operate. Went there one afternoon around 6:00 and the whole place was empty but the bar and a few high tops, but they wouldn't seat us because they said a large party had a reservation at 7:00... an hour later. The next time we went we were seated but the food was awful... and expensive. The mussels were just drenched in cheap white wine that had not been cooked down enough, and the lobster Mac and cheese ($16) was cheap noodles with Alfredo sauce and a couple pieces of lobster. If I spend $70 on a seafood meal I want good food, a better environment, and more organized service. Definitely won't be back."}
{"text":"We placed our orders and I have to say the food came out quickly. Obviously it's Saturday night, they weren't packed to the gills but they were busy and the food came out fast. We were there at 5:30pm, ordered maybe around 6pm.

 The starters are great!! We tried Caprese salad, crispy brussel sprouts, cherry stone clams that were grilled, Florentine style and we had a shrimp cocktail.

Absolutely Flawless. Not one thing wrong definitely not under or over seasoned at all. Now I like fresh salt and a little bit of Cracked Pepper on my Caprese salad, especially if it's a beefsteak type tomato. I appreciated that they brought it out without seasoning so that I could put my own salt on it to bring out the flavor of the tomato. Light balsamic, no oil, basil. Very well done!!

The portions were appropriate, no one could complain about them at all. We went with the small or six servings because we just wanted to try the different dishes but you can scale up on some of them.

HOWEVER, the brussel sprouts were one of my FAVORITES, for the simple reason that it is really hard to get quality, crispy brussel sprouts. 

We were torn as to a favorite, because the shrimp cocktail was crisp when you bit into the shrimp, very fresh. As were the clams. And I mean fresh, there was no fishiness, not small, mushy or slimy. Nothing was over cooked. I don't do raw clams or oysters, these were grilled. There was no chewiness. Bacon, cheese, spinach (Florentine) style clams. Wow...just wow. It is really hard to get Cherry neck clams cooked well in this area. JGs nailed it. I did notice that he had a garlic parmesan option and again you could get them grilled in the Shell. Next time I go in? That's right at the top of my list. My 14 year old son loves Steamers but they're so small these Cherry neck clams were cooked perfectly he definitely will enjoy this one!

 Honestly we could come in any day of the week and order the starters and that would be enough. Now that I've tried so many different plates I would like to come in and try the dinners because I know the starters and the sides are really very good..

Oh by the way so when you buy an entree you get an entree on its own. There are sides that you can order family style which is quite cool! I'm an Italian, from New Jersey we love putting platters out as sides to the main meal. So this whole idea of the shared sides? It actually reminds me of being back home and I enjoyed it.

Their grits? I couldn't find a darn thing wrong with them, some of the best grits I've ever had and I've eaten at popular restaurants in Charlotte those have got to be the best grits I've had. I would get them as a side in future. They're that good.

Now on to the entree....The salmon they didn't even ask us how we wanted it cooked, they brought that salmon out and it was perfect plus the portion size was larger than I've had at other restaurants like even Bonefish. They did their version of a mango salsa. It was pineapple with what I believe? Might have been red pepper. It was very very good. Light not too sweet and thankfully there was no spiciness in it, excellent dish! 

As a side note I don't do raw oysters but I have to tell you we saw a lot of that coming out in addition to the stakes. People cleaned the tray off! I like my Seafood cooked, LOL! But that was a huge order because we saw people eating Alaskan king crab legs, big trays of fresh oysters. Now again while I don't eat it, if it was as fresh as the claims that we had? Got to say it had to be really good. And Jodi and Rhonda will not serve something that they don't eat and enjoy themselves. That's what we like about a locally-owned restaurant like this they would eat what they cook and purchase. The product matters to them.

The seafood was very fresh and flavorful. The owners take their products seriously and I appreciate that. I tend to not venture out very far and suspect many of us that work uptown or around Ballantyne, don't want to drive all the way out to get good food. I think Jody and Rhonda have brought us a classy level of food, close to home, in a relaxed environment.

Give them a try. Oh!!!  The Donati Cabernet! Wow....I am a 14 Hands Merlot person. Nope. This Cab...one of the best. Great with everything we ate."}
{"text":"Place is a joke. The owner fell asleep across from us at the bar. Variety of oysters are great, fresh, but if they were looking for upscale for their prices , they should have gone to a Morton's to see what and actual fine dining establishment looks like, in this case the bathroom has more ambiance then the restaurant. Owner can not take constructive criticism and he and his wife like to y ell quite a bit as I heard them and how they were talking to their employees..they need restaurant rescue lol and it's only a few months into opening. Aside from the oysters ..Food is horrible ..scampi is melted butter w shrimp , no flavor , salt needs to be added to Most dishes and lobster bisque tastes like hot heavy cream. If you're very lucky you'll get the drunks from the bar next door to enjoy your dinner with ! Ridiculous..cut your losses and move on! Hope this helps anyone checking this place out"}
{"text":"\"New\" addition to Mint Hill-Matthews area. And MUCH needed!  Great to have a place to eat that offers more than burgers & pizza. Stopped in for the first time today and had lunch. Started with the Craw
Puppies (pictured below) as an app...yum!  My wife loved the Shrimp & Grits while I had the Lobster Roll. 
The roll was phenomenal being mostly tail & claw meat. Just like you'd get in New England. Nice craft beer selection on tap as well as in bottles/cans. 
We will be returning to try other items on the menu!"}
{"text":"Wow I am so surprised that the owners of Moochies could open up a restaurant so different from their first. This place is awesome! I thought the atmosphere was very cool. Loved the funky blue lights and the different pieces of art on the wall.

I started with half a dozen blue points. Soooo good! They were enormous and very fresh. For my main I actually did an app of the shrimp scampi. These were huge! They came with fresh bread. I thoroughly enjoyed it.

My husband had the shrimp and grits and they were fantastic. They had large shrimp, spinach and pork bits in it.

I had a grapefruit margarita which was fab, but pricey ($11). 

I think the prices are a tad on the high side for Mint Hill. I love, love, love that we are getting better restaurants, but it's hard to justify uptown prices in Mint Hill. But---that will not deter me from going there again. It's right down the road from me and I love a good cocktail and oyster so I will definitely be there again."}
{"text":"The price and quality of the food do not match, not to mention the low standard of service. Not sure what they are trying to be."}
{"text":"We had the bone in ribeye, duck and shrimp n grits. The food and service was off the hook. The baked oyster app was probably the best i've eaten. 4 days since opening and it seemed like they are getting a good foot hold. Suggest putting in some booths to bring in a more intimate setting."}
{"text":"I have been to JG's twice within two weeks and have been very impressed.  They have a great selection of local beers and a nice wine list.  I have tried the Brussels sprout appetizer, the prime rib chop salad and the skirt steak.  Everything was delicious!  They also have a Sunday brunch buffet with a wide variety of food for only $20.  After you have dinner, head down to Moochie's for great live music."}
{"text":"Day three of being open and service was better than expected; given that they were newly open.

We, my wife, son and I, ordered some raw oysters and martini's for starters and what a great start it was!  We chose: blue point, French kiss and one other from PEI.  The oysters were mild and sweet as described.

For entrees we had Duck, cooked medium,  on rainbow chard, tuna poke, a side of the wild mushrooms and a child's steak medallions with fries.  Overall, nicely done!  The duck, poke and medallions were perfectly cooked and tasted delectable.  The rainbow chard was heavily salted, so much that I couldn't eat it and sent it back.  The wild mushrooms were good but a little bland.  Me personally, I didn't mind because I like the natural flavors of mushrooms however, a touch more salt wouldn't have hurt.  Ironic that I say that given the amount of salt on the rainbow chard.

We polished everything off with the dark chocolate cake.  Good but sort of run of the mill.  Very proud of the owners of Moochies' for opening this restaurant.  It's clear they've taken some time to pay attention to the details and they did very well."}
{"text":"I ordered the prime rib, medium rare. My steak was brought to my table medium well. I've never seen a prime rib that had no pink showing. As soon as I cut into it the waitress asked if it was over cooked which I said yes. She came back a few minutes later and said they didn't have any more prime rib and they were cooking me a ribeye. Now, I'm fine with a rib eye steak, but there is a big difference between a prime rib roast and a ribeye. What bothered me is I wasn't given an option. If they told me they didn't have anymore I would have understood, I know prime rib is limited in restaurants. But I would have chosen something else. The ribeye was fine. Still not cooked medium rare as I wanted. My wife's lobster bisque was cold as well. When I got the bill, no discount.  I would have assumed the manager would have removed the steak.  Either way, I wasn't happy. I paid $90 for a meal that wasn't what I wanted. The Decor of the restaurant is also very bland. For a pricier restaurant I would expect it to be nicer. I've been to the past two restaurants and the place pretty much as looked the same all three restaurants. Not a fan of this place and I won't go back."}
{"text":"I'm not sure why the majority of restaurants in Matthews and Mint Hill are content with being so mediocre, but this isn't one that distinguishes itself from the pack. 

We arrived to a near-empty restaurant, which wasn't immediately concerning because they had just opened about 10 minutes earlier. It really had a sports bar/casual restaurant vibe, much more akin to a Chili's or Applebee's than, you know, an oyster house. 

We did start with a big plate of oysters. They were decent, but I've had better. It also would've been nice if the cooks had prepped something to distinguish themselves...maybe a house mignonette instead of horseradish and some minced onions. 

I also had the lobster mac and cheese. It was definitely more of a penne pasta with lobster vs. true mac and cheese. It was decent, but I didn't love it. It was also wayyyy too much food. 

I had some sticker shock when I looked at the bill. I'm fine with paying for fine dining, but the cost of the food didn't match the atmosphere of this place whatsoever. 

We likely won't return."}
{"text":"Red Lobster who?! McCormick & Schmick's  what??! Honestly if I could give more stars I would. I'm an island girl and the seafood here was delicious! Did not expect it at all. Drinks were on point and that staff super friendly. Definitely coming back and recommending this place to everyone I know."}
{"text":"My husband and I have been there at least 3 times already. Food is spot on! Staff is amazing. They go out of their way to make sure you are enjoying your experience. Best oysters in Charlotte!!...Indian Trail is LUCKY to have this gem!"}
{"text":"I had never heard of this place before, but then again I don't get around Matthews much. This was a New Year's Eve option from a local with whom we were going to be spending our evening. 

I would definitely like to return due to the fact I came here when I was suffering from food poisoning from another restaurant the night before. So, I can't wait to check out what else they offer. Due to the aforementioned sickness I just stuck with ordering the wedge salad. It was a pretty good portion size and tasted good!

My girlfriend ordered several different things to try and said they were all delicious. A couple days later I reheated one of her leftover crab cakes. Wow, not having in the crab cake field basically ever, I thought it was very delicious!
 
There was a discrepancy in cocktail amount when two people ordered the same cocktail and one came out with less, so the management made it right by offering a complimentary cocktail. That was nice!

A loss of a star comes, in part, from the server screwing up everyone's bill at the end of the evening.

They definitely have a pretty stacked menu. Go check 'em out.

Chop, chop!"}
{"text":"The inside of this place is impressive, especially so if you consider that they are located in an otherwise somewhat nondescript strip mall, just off of 485 in Matthews (Mint Hill, Stallings, wherever you want to call it). The staff is equally refreshing, and seem genuinely happy to have you. If anything, they are almost too happy to have you.

When it comes to the food, it's interesting - but I'm not sure if this area really needs a raw bar, and the presentation doesn't quite fit. The chop house may have been a bit better focus, because overall the menu gave them a bit of a mixed presentation, where they had some meats and some raw bar items and some fried food that didn't quite hit the mark, with nothing being particularly memorable.

Choosing instead to focus on one particular area might have been a better choice, which would have (probably) allowed them a better chance to excel. Still, it was a nice meal and the staff is definitely happy to have you, and that is always a pleasure."}
{"text":"We stopped in for lunch (place was empty--complete shame really, but I think it's bc it looks closed with the dark windows & no open sign, etc). The service was fine--guy seemed a little scattered--but the food tasted great (except they overcooked my fillet). I really liked the atmosphere/decor, but there seemed to be some sort of identity crisis with the whole Sake flights/Japanese thing mixed with the \"high end\" menu choices & oyster bar--not sure what's going on there. Regardless it was a cute place & the food was good so we'll definitely go back. Hopefully they can figure out how to draw in more people so they don't close down...this area desperately needs decent places to eat."}
{"text":"Went with a group and it wasn't the best experience. We got our sides 10+ minutes after our entrees while some people were waiting 20 minutes for any food after others had already been served. The tables and chairs were cheap and uncomfortable. The food was soaked in butter and cheaply cooked. Nobody was in the restaurant and the service still sucked. Not worth the money and won't be back. If you think this food is good, you haven't been to a good chophouse."}
{"text":"Read the reviews and thought it might be good. Oysters were horrible, worst I've ever had. The prime rib wasn't the best either. One thing i can say is the lobster bisque was pretty good. I won't be coming back."}
{"text":"This place is trying to be a 4-5 Star restaurant but Their ambiance, food, and service suggests otherwise!  The only thing that is 5 Star about this place is their price!!  I would have been more satisfied eating at a Texas Roadhouse that would have been 60% cheaper. Don't waste your money on this overpriced restaurant."}
{"text":"Went there tonight with my wife.  We had Darnell as our waitress, and she was FABULUOUS. This is a new restaurant and everything about the place is very clean and new, even the silverware.  We are not oyster people but the rest. Is so close to home that we had to try it.  It was excellent.  Went early 4:00 pm so it was not very busy.  We ordered immediately, I had the shrimp and grits my wife ordered the French cut pork chop.  The S & G were excellent with spinach and sausage bits included with 5 shrimp.  It was very tasty and enough for me.  The pork chop was the biggest pork chop that I have ever seen.  Came with an apple skerry on top, very tasty.  The chop was done perfectly and more than enough.  It is an al a cart rest. So the sides are shareable.  We ordered the mushrooms and there was plenty for two.  Darnell took plenty of time explaining the menu and showed up photos of the entries.  She was perfect, kept an eye on us but not intrusive.  Was there whenever we needed her.  I would say this is a casual intermediate rest.  Not necessary upscale but very good.  The wine list looked very good, but we do not drink.  Will return and take photos next time."}
