{"text":"Can't wait to eat here all the time next time I'm in Montreal again. Shammy is the best and takes her craft very seriously."}
{"text":"Un beau restaurant servant des plats coréens ou fusion avec un décor minimaliste, avec un menu qui varie à chaque jour.   Nous étions à Jiep Jiep une soirée de semaine et il n'y avait qu'une seule personne qui s'occupait de tous les clients, ce qui inclut de prendre la commande, de préparer la nourriture, de l'apporter aux tables et de s'occuper de la caisse. Donc la nourriture semblait être préparée à l'avance. À mon avis, la plupart des mets coréens sont meilleurs chauds.   Nous avons pris la poutine et le bibimbap. Les deux étaient bons, mais rien d'extraordinaire. Je trouvais qu'il manquait un peu de saveur à la poutine.   Pour le service, la fille qui était présente était très accueillante, souriante et travaillante.   J'aimerais quand même y retourner pour essayer les plats du jeudi et du vendredi soir, qui semblent plus intéressants."}
{"text":"This Pan Asian restaurant is amazingly delicious and the dishes are very creative. This is a mix of asian cuisines. We went there for brunch and got the Jian Bing and the Bibimbap. We also had the Vietnamese coffee which was super delicious. Thank you Shammy, your restaurant is the best!!!"}
{"text":"Delicious and beautiful foods prepared with love. I'll be eating here every chance I get"}
{"text":"Nouveau restaurant dans le quartier.   Superbe présentation des plats.   Nous avons essayé la poutine, le bento box et la soupe ramen. Tout était délicieux!   Service un peu lent mais gentil."}
{"text":"This place is super new, so don't be put off by the lack of reviews! This particular bit of Jean Talon was in need of another lunch place - Marché Soupson and McDonalds were about all I could manage before!  The decor is minimalist, focusing on concrete & plants for an industrial but fresh look. It's a little cold as a result, but it seems so clean and bright that it perks up your soul anyway.  The menu is a little confusing for anyone who's not super familiar with korean food - it can be hard to know what you'd like since they're all made with similar ingredients of meat + rice/noodle + mushroom + vegetables. Maybe photos would be helpful!  The crockery is beautiful though. It's all either traditional plates and spoons or hand-made pottery, which adds to the trendy feel of the place.   As for the food - I usually get the bibimbap, which comes in a hot stone bowl. It's not the best bibimbap I've ever had but it's still exceptionally good, I just really like bibimbap!  It also comes with sides that change every day. Today it was melon & broccoli (separately!) which are both quite nice - and, I think, make the bibimbap worth $14 in total.   All in all, a clean, quiet and refreshing place to have lunch!"}
{"text":"J'aime bcp le concept tres moderne , assiettes simples et deco minimaliste mais je ne me suis pas sentie integrée dans la deco, c'est juste personel."}
