{"text":"Old place that's not in the best part of town. ... Food is good not great not bad either. .... Burgers wings and fish are my picks .... The prices are not bad either your defenetly not going to over pay here... The atmosphere is not for the weak of heart. ..."}
{"text":"very good little burgers the area may look dangerous, but that's how old neighborhoods look like in this part of town right off the side of Van Buren Street. Don't hate the people or the area but enjoy the food from when we have little ma and pa stop n go take -outs the employees are very nice and yes they do take phone orders. I have eaten here alot so don't judge a book by it's cover remember just cause it looks bad in the area doesn't mean the food is!"}
{"text":"Old and dingy burger stand gracing a part of town many folks would care not to venture over to.  The menu has a variety of options from burgers to wings to Mexican food.  Prices are cheap.  For under $6 I was able to get two cheeseburgers, a large sack of fries and a gigantic Dr. Pepper.  Great cheap eats.  Old school at its finest.  Don't expect anything fancy.  Even the trash cans are old.  If you're worried about the location just drop by during the day (though I don't think the night time would be any different).  My visit was void of the colorful characters mentioned in the other reviews.

At the end of the day Jimmy Jack's is better than any McDonald's or Burger King.  Give a local establishment a shot.  I shall return."}
{"text":"Burgers are ok, but I also ordered a meat burrito, and they gave me a bean burrito instead.  I was hungry and in no mood for confrontation so I took a couple of bites, and threw it in the trash.  Obviously canned beans.  Stick with the cheap burgers and wings!  It's in a rough area, lots of cops heavily patrol the area, but it's nostalgic and people still go there.  Not as good as it was back in the day."}
{"text":"Jimmy Jacks has been in business since the 60's, don't know the exact year, but my older brother use to eat there as a kid and he is now 53 years old. This place looks like a dump and  is located in high crime area, try and look past the crack whores and drug deals and you will find good hot wings and burgers. The fried chicken is pretty good too. Prices are really cheap, you can eat breakfast for like $3 bucks."}
{"text":"It was not that great and so many pan handlers it was crazy. And it was 20 minute wait for some wings and not only that the quality wasn't very fulfilling just most likely not going back #sorrynotsorry"}
{"text":"Okay, I think I saw the alleged crackwhore twice. But maybe she just has Parkinson's.

...from doing a shit ton of crack

Still, she doesn't make me feel unsafe and she is typically dressed very well. Business-casual. Corduroy blazer."}
{"text":"I was drawn here by the history of the place as well as the iconic sign posted on yelp.  The sign is gone, and any air of nostalgia from yesteryear has gone with it. 

 I landed here in search of a burger after being turned away at tommys down the street (they are remodeling).  The prices are incredibly low so I decided to give it a shot with a dollar burger and dollar fry.  While the burger was small (like mcds) - it tasted like Whataburger.  It was good enough for me to order a second and make it a double!  

If I lived in the area I would definitely choose this place over other fast food joints - the frys are pretty good.  But it's not the kinda place I would drive across town for.  

Overall - great value,  decent food.   If you remember the original Lennys before they tore it down - thats the vibe here."}
{"text":"Rude a##  fat broad needs to be trained on her  service... Broad was nicer  to all  bums then a mother buying food  her kids .."}
{"text":"I love window food. Jimmy Jack's is on point. Their  cheeseburger reminds me of the ones I used to get from another window in high school. I will be back"}
{"text":"I'm sorry but I cannot NOT give this place five stars. I know it's hood. I know it's cash only. I know it's host to many shady shady characters. I know this because I can't stop going back. It's all in the Jimmy Jack's experience! 

I'll tell you this. I've never been accosted by anyone here. The food has always been hot and the prices are a value. The ladies who work the window have always been friendly and prompt. And I've always been able to find parking and a place to sit here. What's there not to like?"}
{"text":"This place is a total sh!t hole, now with that being said, I absolutely loved it!!! For $12, I got a milkshake, half pound burger, fried oysters and fries. Everything was good except for the fried oysters, but then again if you're? order oysters at a place like this, you like to live dangerously. 

This place had everything!!! Cheap food, cup of noodles, cigarettes, crack heads, EVERYTHING!!! There was even a guy with no teeth working his way through a burger and a guy with handycap plates on his car picking up a hooker (okay, she might not have been a hooker but she was definitely a crack head). 

Would I come here again, DEFINITELY!!! Would I come here by myself at night, probably not. Please see pic of sign explaining how his place isn't? liable if you get hurt... I'm guessing that more than a few people have gotten stabbed here.

None the less, if you want to go somewhere different, then the burgers and shakes here are a pretty good choice."}
{"text":"GHETTO area...we gave this place a try tonight,  it's okay the food is not all that great but the wings are delicious. That is why I gave it a 2 start rating... honestly your better off at petes fish and chips down the street. One thing I notice is that a guy went up to the window with his own goodies to be mix in his shake,  I am surprised this place takes outside food from customers to be placed in there food lol...."}
{"text":"Great food and awesome prices, service could be better and facilities could be upgraded"}
{"text":"There are almost always shady looking people here. With that said, I've never been bothered or solicited by anyone here. For the most part, it's really just people doing their own thing but I know a lot of people get scared off. There is just so much nostalgia and history here. I can't get enough. It is somewhat of an easy place to miss if you don't already have knowledge of this place and the people outside might want to make you go in the next direction but in reality, I really like the food and you should give it a shot at least once.

The wings, burgers and fries are really good. The prices are pretty good compared to places like McDonalds and IMO, taste better too. The food is made fresh and is always hot and good. Love this place. It might take a while to get your food especially at the drive through because they make it to order."}
{"text":"It must be different in the day time.  At 8:30 pm it's really quite an interesting crowd.  At one of the tables there was a pennies and nickles poker game going on with a few guys.  Some woman arrived and got some food and joined the game.  I think it's sort of a community gathering of people.  Some came with their shopping cart.   A nice crazy guy was making flowers out of palm fronds and giving them to a few of the women.  

I ordered the quarter pound bacon and cheeseburger and fries.  The burger shrank down to something quite tiny, but the food was fresh and the fries were good."}
