{"text":"Best falafel sandwich I've had in a long time. The falafel is fried to order, and arrives hot, nestled in the cold, crunchy toppings.  All of Jimmy's pitas come in small, medium and large, but be warned that the large is huge. Next time I'm getting a medium falafel.  -1 star for their debit fee, and the awkward hallway by the till where you have to squeeze past all the other customers."}
{"text":"The falafel is good, not great--the biggest problem is how EXPENSIVE it is... upwards of $10 for a wrap. ugh."}
{"text":"Oh my chicken shawarma!  DH loves shawarma/falafels so we're always on the hunt for one. By far, the best chicken shawarma in Calgary. Abundant veggies & the sauce is the key ingredient.   Try the medium shawarma/falafel first because it is already big. The large size is indeed massive - even my husband couldn't finish it in one seating.   The place is clean too. The only downside is the $ street parking in downtown but it's waaay worth it!"}
{"text":"Disaster. High prices and excruciatingly slow service. They dont even accept VISA. What planet qre they on?? They dont accept credit cards. Would not recommend this to anyone."}
{"text":"Why did the chicken cross the road? To buy a shawarma from Jimmy's on 4th street!  One of the things that makes this second location different than the original Jimmy's A&A Deli nearby SAIT is that its not as busy except during lunch time! I'm not complaining though. People come here for the experience and reputation that Jimmy and his family created over the years and I think we're really lucky to have their restaurants in our city. This location has plenty of seating and everyone that works here has worked at the main location so its just a wonderful extension that makes it easier for people in the South or anyone downtown to enjoy their food.  Sometimes I just get that craving for a chicken shawarma from Jimmy's that I'll drive from wherever I am in the city just to get one. A shawarma from here is what I give myself as a reward for killing it after a day of working out or if I have time before volleyball, I'll drop by just to eat a little bit before my game to satisfy my craving and hunger... BUT CRAVING FIRST! hahaha  You know what I found really interesting? Half the people I knew at my last job (which was just minutes from 4th street) didn't even know this location existed... They'd actually drive all the way to SAIT just to get one... crazyness I tell you!  And bam! now you don't have to! Jimmy's A&A on 4th satisfy's cravings, your hunger and satisfies even your satisfaction! haha  I usually order the Combo, which is a half serving on chicken and a half serving of donair meat - DE.LI.CIOUS! its just a perfect mix of meat! its like almost 2am and I'm making myself crave this stuff now. geez. Lately though, I've been getting just the chicken shawarma *sigh* my favourite; the original in my books :)  Get what you want. Get a felafel \"wrap\", add some baklava to your order, grab a drink of their convenience store selection of pop and soda!  You can't go wrong with a chicken shawarma from jimmy's on 4th :)"}
{"text":"I was here at lunch time on a weekday. I was the only customer in the store and I had made it clear I was in a hurry. Despite this, the man making the food moved extremely slowly and took more than 15 minutes to make my food. He would pause at times to argue with his co-worker. It was a very frustrating experience."}
{"text":"They only accept cash or debit. But they charge you $0.35 to use debit. Who does that anymore these days? I've only seen that when you have to spend at least $5.00 or $10.00 but I was over that anyway.  The food was okay. A friend had recommended this place to me among some others because I'm an out-of-towner but I was kind of disappointed. There are no lunch combos so everything costs to add. For just a small salad with chicken/beef, it was over 10$ but the lettuce was iceberg and not really that substantial.   The service was good. The person working was kind to put sauce/hot peppers on the side."}
{"text":"Oh how I crave Jimmy's. This place has the best donairs, schwarmas, salads, olives, desserts, etc. ever.  I could eat here everyday.  The beef donairs use their own special spice mix, the chicken is even better. Portions are huge (get a small) and enjoy a wide selection of drinks (including old school pic-a-pop) to wash rhings down. The staff are friendly and chatty and will remember you when you go back. They often give out extras to regulars (like a free backlava or add some extra meat). The place can be a bit loud at lunch time (they play the tunes loud)."}
{"text":"If you don't already know how great Jimmy's is, then YOU my friend, are the ONLY person missing out.  Jimmy's makes THE BEST falafel in the city. I'm told their donairs and shawarmas are the best in town as well.  The service is always excellent, the portions are always mind-blowingly massive, the food is always to die for and the prices are always unbelievably cheap.  So what's the long and short of it? It's the same great Jimmy's A & A that we've all come to love, only now it's also available in downtown Calgary! HOLLLLLLLAAAA!"}
{"text":"Awesome food...but...it is closed randomly thus 3 stars.  If it actually followed the time posted it would be 4.5 stars."}
{"text":"Are you kidding with some of these people?  If you do not like the food here you are on some kind of drugs.  This place is the best, the lines are so long I call my order in every day on the telephone and it's ready when I get there.  If you don't like the staff, you are crazy.  The people are family people, and have excellent humor.  The lamb is top notch, and the best in the city.  The food melts in your mouth.  I love the baklava.  This is my favorite Jimmy in the world.   Go here now or I will."}
{"text":"What awesome food. I honestly haven't had anything bad here. Portions are more than generous. I recommend everything."}
{"text":"I had the chicken shawarma and was quite disappointed. It's a mess to eat, the flavors are barely there and the meat itself tasted rubbery. I wasn't able to finish it without getting a sick feeling in my stomach.  The food here is pretty expensive compared to other places. They charge a fee to use their debit machine. I won't be coming back. There are MUCH better places in the city."}
{"text":"Hey guys business and customer relations advise 101. If youre not going to take a credit card for payment but leave your customer only other option to pay by debit, then dont charge a surge on that. There are plenty of great Labenese places around this city I can go to."}
{"text":"Super weird vibes from the place. Food was super messy and hard to eat, tasted really greasy. Place looks dirty and run down, I hope they have had a health inspection recently. They also charge a fee if you pay with debit. Wtf? Who does that?."}
{"text":"We love this place, especially for takeout. Ordering can be a bit slow but the food is fantastic."}
