{"text":"A very well decorated coffee shop with friendly staff(: The only downfall is that the seating is occupied most times because it is so popular. Overall a comfortable atmosphere with fair priced coffee/ pastries/ juices."}
{"text":"Never knew about this coffee shop until they opened this current location as I walk by it everyday to work. Been there a few times and I have always left very impressed. Baristas are very friendly and actually make an effort to get to know you. The drip coffee and Americano were excellent. Decor is nice. Very pleasant space to stop and grab a coffee, have a chat with friends etc. Prices are fair, and to  be honest, I rather buy my coffee from a place with a bit of character than another Timmies or Starbucks. Definitely recommend people check it out."}
{"text":"Jimmy's coffee is a stand out in the \"indie\"  coffee crowd.  Phil Morrison knows his customers and how to give them exactly what they want.  From locally roasted beans to custom Jimmy's blends like \"Hendrix blend\"  there is something for everyone... And the internet is real high speed... :)"}
{"text":"First up.  You can easily walk past this place. But do they make this mistake as you may miss a hidden gem I  this cute coffee shop.   Second.  They were a little busy so there was a wait line, the girl staff member started taking orders up the line. The guy in front did not have enough change ad the girl eve said \"this one is on me\"! Wow how can you beat this service?   Totally impressed.   The coffee of course is the best in Toronto!"}
{"text":"Two-floors coffee shop provides us easily finding good seats to enjoy our coffee in the sunny afternoon. The second floor is not too noisy so that many people are sitting here to do their works. Not only free WiFi but also the air condition is an extra. The Americano can be ordered with one shot or two shots. For single shot, its taste is less strong with medium body. Easy to drink. The chocolate almond croissant ($3) is good as well. Will come back again because welovecoffee."}
{"text":"i love jimmy's coffee!! their iced peanut butter latte is 8/8."}
{"text":"Really subpar service and coffee. Last time I walked in the barista sneezed, didn't wash his hands and then made coffee. Gross.  I only went in once after that to meet a client and the two people behind the counter were so unconcerned with serving (consumed with talking to each other instead) that I've never been back. There are too many coffee shops in this neighbourhood to warrant spending time or money here."}
{"text":"Gem!   Coffee is cheap (under 2 bucks), scones are delicious (espresso chocolate is the bomb), cookies might be some of the best in the city (lookin' at you, sea salt chocolate chip), and the baristas are wonderful!  Worked down the street from here during the summer and was there almost every day. I wish lavendar lemonade was a year round thing!   Also, get the medium roast if you're not a fan of strong coffee. It's lovely and smooth."}
{"text":"I had to go here a couple times before rocking a 5 star, they deserve it. Some of the best espresso I've had in Toronto, far superior to Starbucks. They have an upstairs but I've never been, looks loungy up there from other pics.  Staff are pretty friendly and the service is always super fast. The espresso's are made with care, and I've seen others get designs when they order lattes or cappuccinos.  Don't forget there's a little patio out back too around the corner, or downstairs and out back, nice to chill out in the summer."}
{"text":"Interesting and unique coffee choices like s'mores and great healthy snacks. Really delish. \"Exceptionally Healthy\" brownie is a do again. Coffee is nice and strong. Good lift when you need one."}
{"text":"Was happy to see this location open here in this downtown neighbourhood because I knew I'd be able to count on coming here for a good quality Americano. It's hard to find good indie places in the heart of downtown.   The coffee and barista did not disappoint. The longer hours than most indie coffee shops were great for an after work spot.   Lots of seating and tables upstairs as well with free wifi and plugs make it a great spot for doing some work."}
{"text":"I cannot understand why a standard ratio of milk to espresso is not a priority at any Jimmies location. A cappuccino is a cappuccino because it's approx .3,.3,.3 froth,milk,espresso (Though modern style seems to favour espresso over foam which is fine). The way Jimmy's works is you can select your number of shots and then the size of your cup dictates how \"milky\" it is. This is according to the barista at this location. In my opinion, coffee creation is not a salad bar, I determine my \"milkiness\" through the drink type I order and number of shots... not cup size.   So if I'm so mad... why 4 stars? Because I realize that maybe it's just me... and well the coffee is damn good and shots are most always pulled well at this Jimmys location -- Portland I find is less consistent."}
{"text":"always consistently good coffee at Jimmy's :)  it's always at the top of my list whenever I'm in the area. free wifi and quiet work space on the 2nd & 3rd floors (the music is really only on the first floor). They have a good selection of baked goodies as well, this is a plus!"}
{"text":"they could definitely improve their internet speed.... it's sooo slow but other than that great place!"}
{"text":"I'm so excited to have a Jimmy's Coffee in the neighbourhood! Stopped by this morning for a latte and nutella croissant. Service is excellent, coffee just as excellent as the other locations. Lots of space to chill out, socialize or work, including a second floor lounge."}
{"text":"I like this place. It's cozy and the staff is friendly."}
{"text":"Great spot for getting some work done! If you can find a seat, that is... With free WiFi and an abundance of outlets, it's no wonder that this place is usually packed. Get here early to find a spot. (Pro-tip: the third floor is usually *not* booked for private meetings, so don't feel intimated grabbing a seat at the big communal table.) The atmosphere here is generally very pleasant and I like the eclectic decor. I also like the fact that there's a self-serve water station, so I can stay hydrated without bothering anyone. Better yet, it's located on the first floor, so I even get to squeeze in some exercise as I walk up and down the stairs.   Our most recent visit was on new year's day, so the place was pretty quiet and the service friendlier than usual. I ordered an americano misto and a lemon cranberry scone (I don't normally go for icing but this was the only option available that day). The beverage was nice and hot, the scone was surprisingly moist (they're not baked in-house), and both were yummy! No complaints."}
{"text":"One of the great coffee boutiques in the city , their, Kensington  market location and especially, the patio stands out. The young baristas definitely know how to make a great cup of espresso based drinks such as the Cortado  or the flight white etc"}
{"text":"Came by to Jimmy's coffee after work with a friend. It is a nice and cute location with ample seating. We ordered cappucinos and it was well done and very fresh."}
{"text":"I'm not a huge fan of coffee, but I liked the Iced Latte from this shop. The atmosphere is really quaint, three floors of seating. Perfect study/work space. They have a variety of bakery items, and even peanut butter shots!! i didn't try any, but it's exciting enough to mention. I would go here again. Especially for the outdoor patio seating!"}
{"text":"Good cafe to spend an afternoon at. They make pretty good cofee, and have quiet space on the second floor suitable for studying or working on your laptop."}
{"text":"I love the location on Queen West, inside of the Frank + Oak store.  This coffee is delicious, the service is great. What more could you want!"}
{"text":"I love this little cafe. Unfortunately, I had a very terrible experience recently:   Starting with the good:   - Great location  - Lovely decor  - Excellent coffee - Delicious treats  - Reliable Wifi  - Cozy study spots - Everything you'd ever hope for in a cafe  But, THE BAD:   I came here to get some work done, but the counter staff was just obnoxiously loud and it was incredibly distracting. I couldn't even drown them out with headphones. They were joking around, singing, talking about their personal matters with no regards for the customers who were sitting on the main floor trying to study, work, relax or whatever. I did not seem like the only one bothered by this.   I mean, it's kind of ridiculous when the baristas are louder than every person in the cafe combined. I'm all for socializing at work. We're all human. But this was over the top.   Now I'm not saying the staff was rude upfront. They were super friendly and gave excellent service. However, customer service doesn't end the moment you hand off a coffee to somebody. I don't go to a cafe to study expecting pure silence...I'd go to the library for that...but I think anybody would expect that staff would be courteous and respectful of the people who often go there to get some work done.    I've been to a hundred cafes in the city and I've never come across this kind of display. It was really rather disappointing and highly unprofessional. So I hope management reevaluates some of the employees they have behind the counter because this is a sure way to lose customers."}
{"text":"I wasn't really impressed by their Americano, it tasted like it had been watered down, which was really disappointing because I had read such good reviews.   The shop itself is really unique, it not like anything else I've seen, consisting of several floors and different sized tables. It's ok if you don't mind rock playing in the background, which is the shop's concept, but I prefer something more relaxing."}
{"text":"I LOVE this place. Great menu full of an assortment of drinks to try (my favourite is the Golden Latte - delicious!) as well as amazing scones and treats. If you need to study, there is an upstairs portion with a good amount of seating. The music is usually old school and awesome, and the staff are really friendly. Be patient if there is a line-up, you usually don't end up waiting long and it is well worth it! Great little gem of a spot in Toronto, highly suggest it."}
{"text":"Perfect study/work spot! There's 2 floors of seating with plenty of outlets near all the tables and free wifi. There are big common tables as well as as smaller individual ones.   I had their iced tea which is a refreshing peach black tea and their gluten free morning glory \"cookie\". The texture of the cookie was a bit strange but it was still tasty and filling.  Will definitely be back in the future."}
{"text":"Went here after hearing great things... Left empty handed as apparently they don't serve decaf coffee. Disappointing."}
{"text":"One of the best lattes in the city for sure! This location is super cool as its a three storey house right by all of the hospitals and office buildings in the Bay corridor. Kind of funny that there's also a Tim Hortons in a similar house on the corner now. Either way, this place is really great, the atmosphere is cozy and welcoming (kind of like being in someone's house!) and the quality is so good."}
{"text":"Visited Jimmy's twice in a day, and the atmosphere remains the same, which is so relaxed and friendly, it's really nice to have such kind of café in the city center, would definitely recommend it to my friends:)"}
{"text":"Cool eclectic decor with a relaxed vibe. There's not a lot of space on the 1st floor but the 2nd floor has more seating. Went there in the evening and it was a nice little study spot with some chill music.   Got a large hot chocolate (3.75) and it tasted great. Not too sweet. Their baked goods looked tasty and ranged from $2 to $3ish. Will get something next time."}
{"text":"I had a very delicious cup of hot chocolate complemented by a chocolate chip cookie. All in all, I had a great experience. The atmosphere is really relaxing and I feel like I'd be able to get a lot of work done. Definitely will be coming back!"}
{"text":"I think that early success is making this place worse - the past few times I've stopped by lately the staff seemed either nonchalant or just plain rude, i.e. shouting across the counter to each other about their evening plans in the middle of customers ordering. I was really happy when this cafe opened up, but now I don't feel as enthusiastic."}
{"text":"This coffee shop is so cozy and pretty. The building is beautiful, but inside it is modern and well decorated. I also love the yellow cups!"}
{"text":"There are a few reasons I think this place is great. Here they are:  1) the coffee is great. I've had a few drinks from them including Americano and various types of lattes. Delicious.  2) I like the people who work there. Whenever I come in, they are friendly and engaging.  The one thing that Starbucks has that many coffee shops I've been to do not is engaging staff. Jimmy does an excellent job of hiring people  3) I like the pictures of people named Jimmy on the walls: Fallon, Kimmel, Page, Hendrix, etc.  4) It is close to where I live (this one may not be as relevant for you).  As an aside, while the good options are not terrific they do have pastries and things. Heck it's not a restaurant it's a coffee shop so treat it accordingly and you'll really like this place too!"}
{"text":"I really liked Jimmy's Coffee. The taste of coffee is excellent. The staff is very nice. The price is reasonable. Other customers are refined and friendly. It is very pleasant to have a cup of coffee any time of the day. I like their promotion goods, Too. Next time I want to try their baked goods."}
{"text":"This coffee is astounding. I have never written a yelp review before but Jimmy's inspired me. It is my coffee crush; best cup of coffee I could have asked for, and a cute and cosy café environment! 10/10 would recommend! Cheers."}
{"text":"Near hospital row there weren't really any independent coffee joints, so I was super stoked when Jimmy's opened.  There's usually a line in the morning, but the staff are very efficient and the line moves pretty quickly. I've only ever had their brewed coffee and it's always solid - rich and bold without being too bitter - perfect with a bit of milk. As for their baked goods I love their ginger molasses cookie - it's HUGE, chewy, and the small slice of candied ginger on top is a nice touch."}
{"text":"I was walking by when I seen the great Wall art.  Had to go in. I ordered my wife a capachino  I love expresso but never order them because most places can't make them . I am picky would rather not have one then have a bad one. But I decided to try it out. Good thing because it was very good. Both of us enjoyed it. This place is small and busy but staff is fast and friendly.  I will return."}
{"text":"I liked that they offered a choice of one or two shots when ordering a medium cappuccino."}
{"text":"What a cute coffee place! A neat change from Starbucks or Second Cup, neatly hidden on Gerrard Street.  Downstairs is great for conversation, and the two upstairs levels are equipped with big tables, perfect for studying. People are silent up there.  Coffee was great, and they carry almond milk. A good selection of teas, herbal and caffeinated, and fresh-made cookies and desserts.  Hidden gem!"}
{"text":"They accept PayPal!!! The barista has this accent that I cannot get over. If I had her accent, I would not shut up!!! She is beautiful too. Coffee is delightful. Decor is very cooky and vintagey and all that jazz."}
{"text":"Pecan butter tart is sinfully good. It has one problem: it disappears almost instantly. But it is the best butter tart I ever tried (and i tried many). Will be back for more!"}
{"text":"A good spot for coffee in Kensington Market. The coffee was decent - a latte, but I preferred the drinks I had at nearby shops.  There was a huge amount of seating on the patio out back, and a good assortment of baked treats to choose from. Def. worth checking this cafe if you're in the neighborhood.  I bought a bag of beans to see what I can make of their blend at home - will update my findings another time."}
{"text":"Ordered 2 dirty chais and they had no flavor, was there actually a shot of expresso in there? I'm not sure."}
{"text":"Um, maybe it was this particular location, but from all the cafes I've been to in the last couple of weeks this was the most unimpressive.  Their Americano was a bit too weak for my taste but still decent. Not a fan of paper cups either when I'm actually staying there. Would still give them another shot (3.5/5)  Interior wasn't anything special either. Actually furniture looked pretty old. I know they have other locations and I might try something else, but I won't be going back to this one in particular. (2/5)  Service was okay! mmmm, not even that friendly to be honest.(2.5/5)  Best thing is price is quite reasonable! If you work in the area and just wanna grab a coffee it might be better."}
{"text":"REALLY nice space at this location, a bit off the beaten path. The staff was friendly and efficient, and my Americano passed muster, but I can't really judge because I had it \"to go\". I'll be back for a better assessment soon!"}
{"text":"Great coffee and service! Even though the lineup was out the door this morning around 830am, I got a delicious Americano within 5 mins of joining the line. Lovely staff too."}
{"text":"Relaxed coffee atmosphere with lots of seating. Staff are very friendly. Coffee is always good. I've had their iced coffee in the summer and now I'm trying their cappuccino. I ordered a medium and they offered 2 shots of espresso at no extra charge.  I liked that along with the standard white sugar, cream and milk they have honey, brown sugar and almond milk readily available on their bar counter. No need to ask. Great place to kill some time before meeting with friends."}
{"text":"It is my nearest espresso bar but funnily enough I have never been in, so at last an edition to my coffee reviews. Flat white was not on the board and so I couldn't be bothered to have a potential argument with another arrogant barista talking shite. I ordered a cortado with 1% milk. The barista was actually very nice and seemed to know what he was doing. However he said something strange that was 1-\"so you want no cream at all?\" And 2-\"next time order a 1% latte cos it'll be cheaper for you\". As nice as he was to be aware of my financial constraints, that's bull. I am happy to see he made my shots ristretto, but put far too much milk in. A latte is nothing like a cortado. Ristretto vs straight espresso, approx 50% espresso to 50% milk verses more like 30% espresso to 70% milk in latte. Plus the milk and breaking the crema is different. As usual Canadian baristas making up their own definition.  Taste is okay, but weak...at least their beans don't taste like they have been sitting around for ages and roasted weeks-months ago."}
{"text":"I had a few hours to kill in Toronto and was looking for a place to sit and work before taking the train out of town. Jimmy's wasn't particularly busy on a Monday mid-morning, so I decided to give it a shot. Jimmy's is a renovated historic house, and was quite charming although tight on space. Once I got upstairs I was able to find a place for myself, my suitcase, and my laptop. There are three floors, and no elevator as far as I could see, so you did have to lug things up a flight of stairs. The 3rd floor can be reserved for private meetings. That's great!  I ordered a maple tea latte, which is was a new treat. I love tea lattes and usually opt for a London Fog or Chai, but the maple tea latte was a nice option and I'm glad I got it. (Am I the only one who has to order the unique thing on the menu that you don't see everywhere else? It's an incurable condition, I think.)  The wifi was decent, with only one cut-out moment in the 3 hours I worked there. It did get loud, and isn't really a good space for a group meeting, unless you book the upstairs room."}
{"text":"Not bad! Baristas were a little unfriendly. I got an iced coffee that was strong but good. I also like that if you get a latte, there's no price difference between a single shot and a double shot of espresso. A girl's gotta have her caffeine!"}
{"text":"Without a doubt its the best coffee I have had in Toronto. I really like too the price you see is the price you pay. It also has a great atmosphere the upstairs is a nice place to study or catch up with friends. Friendly staff keep it up!"}
{"text":"Three floors of ample seating area, good music, free wifi, delicious coffee (dark roast is my go to) and fresh baked goods/snacks (I like their croissants and yogurt parfaits) - the perfect place for students looking to study or for friends looking to catch up over some java!"}
{"text":"Great coffee! Sat out on the patio and enjoyed my americano. Will definitely be coming back here."}
{"text":"Ordered a latte today 'for here' in a mug but it came in a glass. Lol I assume they had no mugs but it's like, a forewarning would have been nice! Common courteousy at the very least. And they didn't call up my order when it was done so it ended up just sitting there for a good minute -__- also I ended up having to surround the glass in a cup holder which just made me feel like I may as well have just gotten it to go. Overall, the smores latte I ordered didn't exactly remind me of smores at all and after this experience, although minor, made enough of an impact on me to probably not come back."}
{"text":"Delicious coffee and awesome service! The barista was lovely too: his debit machine crapped out on my order and he comped me my drink, which I found to be a very sweet thing to do but also may have had something to do with the steadily-growing line forming behind me ;)"}
{"text":"Finally a decent place to drink coffee in this area.  I wasn't aware if this chain of cafes so when a fellow Yelper recently gave a rave review I was intrigued.  I ordered a cappuccino so here is the verdict Espresso: Medium to strong Crema': Decent Milk: Frothed well Latte Art: None Also one is given the number of shots one wants in the drink so that's plus if you want a lot of caffeine. I would say 3.5 stars. I also tried the maple scone which was kind of simple and forgettable (though I am not a big fan of those).  3,5 Stars."}
{"text":"Great coffee! What a fun, weird little place. Make it up to the second floor to poke around. A smidge out of the way, but a nice place to sit down and plan your day."}
{"text":"I like this quaint little location.   I picked up a simple hot chocolate along my leisurely walk.  Very consistent with the Portland location, not too sweet, and a lovely heart made with the milk.  Service with a smile.  I couldn't ask for more."}
{"text":"This is a great coffee shop in Kensington. The coffee quality is great and pricing is very reasonable. The interior is very cozy and great for an intimate hangout or date. They so have a great patio for the nice summer day's or nights."}
{"text":"This place is nice and cozy. It looks like someone's house got turned into a coffee shop. The staff were friendly, helpful and accurate when I asked them about holding a small knitting get together with my friends during the weekend. They told me that it would be packed with people studying and it was true. We ended up getting stuck in a corner with two small tables. HOWEVER! Their americanos were good and I always appreciate cute latte art, which they made. My advice is to ask the staff about low traffic times if you want to hang out. Otherwise, Jimmy's is good for popping in for a quick caffeinated drink and going on your merry way. Definitely worth re-visiting."}
{"text":"Came here a few weeks ago and the woman making the coffees was self-admittedly new. She made two terrible, cold, completely incorrect drinks. I wanted to send them an email to express my displeasure and the email address on their website bounced back."}
{"text":"Since it's only a 7 minute walk away from Ryerson, I always come here to study if the Starbucks or Tim Hortons is full.   I usually get a medium half-caf americano 3/4 filled, topped with steamed soy milk. I know, it's an obnoxious order but Jimmy's always nails it. My sister lives by their cortado.   Calories permitting, I sometimes try their delicious fresh baked goods when my will power caves. I've tried the unicorn poop cookie (stupid name but cute), the pistachio croissant (YUM) and an earl grey croissant. All delicious.  They have an area upstairs that may or may not be full of people. I wouldn't have passed organic chemistry if it weren't for Jimmy's and their caffeinated beverages. Either way, it is ideal for studying and getting calorie laden baked goods."}
{"text":"This Jimmy's Coffee is a bit different than other ones since it is a house rather than a coffee shop. So the layout is great, however because of that, it seems like a waste of space because there are not too many seats available. otherwise the quality of food is good as it usually is!"}
{"text":"Thanks to PayPal I went to Jimmy's Coffee.  Honestly, I would never have thought to step foot in this place without the free $5 to spend.  I can't believe I have never thought to go in.  I will admit, I thought it was a sketchy place with nothing going for it.  Having gone into this one, I am officially a fan.  This place has straight up good coffee.  It's not the best in the city (that belongs to a place on Broadview), but it is definitely going to be a go to for me now.  Why? Primarily because my wife works right across the street, but also because the coffee is good.  Short review because there is nothing to complain about and nothing CRAZY to highlight.  3.5 stars for me  That's it."}
{"text":"Nice jimmys location here. I'm a tad biased because it's the closest one to me now but I love their Americanos. Awesome flavour, and for fair pricing. The shop is pretty narrow but has a selection of seating tucked in. Perfect grab and go coffee before heading on the ossington bus. Service is friendly and fast-no complaints here!"}
{"text":"I mean, rock & roll t-shirts, high- rise levi's are in and you guys, its massively inappropriate to rock that gold inside a Starbucks... Their fourth location offers equal parts of what my city's come to expect from Jimmy's: fireplace seating, arcadian décor with exceptional coffee. There are plenty of power outlets, cozy seating and free WiFi. The pastries are ridiculously fresh and they offer really cool visuals to gaze at while devouring them. I've always made friends with people who own extensive libraries over large tv's and I love the massive book shelves that manage the ambience.  I just feel really cool being here, you will too.  \"Knowledge speaks, but wisdom listens.\" Jimi Hendrix"}
{"text":"For the longest time I would observe people on Queen street holding coffee cups with yellow lids wondering where they came from. Took me a while figure out it was Jimmy's. I recently decided to try it out for myself. It's right next to Starbucks, but oftentimes I see more people coming out of Jimmy's.   The atmosphere of the coffee shop is nice. However, the coffee.. I really don't taste anything special. It is actually too strong for me. Last time I actually asked them to spill some out and add hot water. I've tasted coffee that I think is great or even exceptional, but I gave Jimmy's a few tries, and it's just okay to me. I haven't tried their specialty drinks."}
{"text":"Great coffee, sweet staff, a cute little patio out back with noisy fans blowing tree fluff on you. Just a little bit spectacular."}
{"text":"I ordered a small medium roast coffee and I was in a blissful coffee high for the next 3-4 hours. Don't let the small size fool you, you won't need more than that for a small pick me up. The service was really fast and friendly though I'm not sure how it would be with other orders since I only got brewed coffee. I thought that everything was great both in taste and price. Will be coming back during exam time."}
{"text":"Free Wifi and Work Spot - Coffee and Treats!   I was looking for somewhere to work from for the day this spot was perfect. I got a latte and a croissant and found at spot at the table on the 3rd floor in the loft. There were 2 groups of people already using the table, but there was a chair left at the table, so i took it and started working.  I was there all day - so people came and went at the table and I ended up getting 2 really great networking connections while I was there.   It can get very busy around lunch time, but they have 3 floors of seating and the free wifi was very fast."}
{"text":"We visited Toronto for the first time and were seeking a place with wifi when we stumbled across Jimmy's Coffee.  The coffee was excellent, very cool atmosphere with 3 levels of seating, and the service and cheerfulness from Samantha was awesome!  Would definitely go there again."}
{"text":"They have got one of the best Iced Mocha's in Toronto. Fairly priced. Although don't come here if you are prepared to spend the day working because the wifi is pretty iffy. It connects sometimes and when it does it works great. It just depends on the day. Overall great coffee though."}
{"text":"Located a short away walk from Gerrard and Bay, Jimmy's Coffee is a great place to grab a takeout hot chocolate, hot cider or coffee to go or to sit down for a couple hours. With three levels of seating options and free, reliable WiFi (you have to ask the barista for the password), I can see how it can cater to the academic and work crowd. However, everytime I visit it tends to already be quite full so I either sit at the counter or get takeout. The service here is fast and friendly. Currently, as a person not a fan of the cold winter but loves the flavour of festivity, I particularly enjoy their sea salt chocolate chip cookies and ginger pear mulled hot cider. Tastes like fall/winter rolled into one... So great."}
{"text":"I passed by here while I was heading to my training course, I couldn't help but noticed the smell of coffee. As soon as I stepped inside I couldn't believe how busy it was! Note to self, which means they serve good stuff here! The place is really cute, I oreded my medium coffee and handed to the milk/cream station. They have brown and white sugar in a bowl. They also have milk and cream in jars. Very different then what I'm used to.   Price is not bad as well! 1.75 cheaper than my SB short coffee. Would def come back. The smell if the coffee is so rich."}
{"text":"Great place to hang out and use WiFi.  Also, they have a good made-from-fresh Chai Latte."}
{"text":"Iced latte is my favorite coffee here! I usually go there to have some coffee when it's raining :) definitely recommend to try coffee here and you will love it."}
{"text":"Nice simply coffee shop with a simple drink and snack menu. Saw the back patio which was small but accessible from the street, would wish for more choices for  non coffee drinker like a London fog or some fancy hot chocolate ."}
{"text":"Coffee tastes very smooth. Hazelnut latte is my favorite!  Lemon coconut cookie is the best treats! Love this place! will keep visiting."}
{"text":"The perfect little local coffee spot. so much better than Starbucks. They also had pastries and fresh juices. Jay Z in the background was icing on the cake!"}
{"text":"After 4 years of living Toronto, I finally ventured to Jimmy's Coffee. I now understand why Torontonians love this chain so much!   I ordered a vanilla latte with almond milk and a chocolate espresso scone for the morning. The latte was splendid - it was not too sweet, and verrrry frothy. I was also pleasantly surprised at how flavourful the scone was! Although I could not detect any hints of coffee, I would definitely get again.   I had a great first experience and I see myself returning for more work/study sessions!"}
{"text":"This is the only coffeehouse in Toronto where their dark roast is nog burnt--and delicious black. Espresso is velvet. Staff a delight. I only drink jimmys and I have converted dozens of friends. Best coffee!!"}
{"text":"Good stuff. Better than Tim or Starbucks.  Would back.  Good location too right on the way. Good taste with the price"}
{"text":"I have always wanted to try this place since I walk by it everyday walking to work. I finally went in and tried. The dark roast coffee was good and the location was nice and cozy. It was very laxed and comfortable just sitting there and catching up with my friend over coffee. I would say I like the environment more than the coffee. So I am giving this place a four star because I really enjoyed the environment and the coffee was good. Maybe next time, I will try the pastries."}
{"text":"3.5*  Seating is pretty limited upon further inspection; there is definitely no backyard patio. However,  there are about 3 small tables at the front, 2-3 small tables at the back and one large communal table - I came on a Saturday afternoon to try and find a study spot but everything was full!  While the medium roast coffee is consistently good (and for the price, infinitely better than Starbucks especially since SB raised their coffee prices by a quarter), I had the cortado again and it wasn't good at all. The espresso tasted burnt, and the drink was much less creamy than the first time I had it. The barista who made it looked a little young, and didn't seem to be as careful or meticulous while making the drink. Further training for some of the junior staff would be beneficial."}
{"text":"Excellent cortado.   Nice barrista.   The place is funky with antique furniture in a modern interior.  2nd floor has a cosy feel.  Music is very cool hip loungy beats."}
{"text":"Great feel and music, fresh and tasty coffee, free wifi. What more can you ask for.   Caramel banana cake off the chain and the latee I ordered was done well.  Seems like it's a place I wouldn't mind chilling. Love the mural on the outside too."}
{"text":"It is pretty hard to find a place to sit here. And for a reason :) their delicious lattes are foamed to perfection! The service is welcoming in a very friendly and embracing way."}
{"text":"Easy to miss if not for the signs outside. This cute little building was taken over by Jimmy's Coffee earlier this year. It's small but cozy, decorated with antiques and tributes to all things Jimmy (Hendrix and others). Here's how it's laid out:  1st floor: counter/pastries + street-watching seats 2nd floor: communal tables that make for student haven 3rd floor: one communal table   I read a yelp review earlier today about how nowadays cafes do this odd thing where they blast music, and I cannot unread it. This cafe does the same unfortunately but it's more contemporary (e.g. Usher, Destiny's Child, the odd Bob Marley now and then). The plugged-in students here don't seem to mind.   I had a cortado and chocolate zucchini muffin (a little sweet but try it!). Inexpensive, came down to about $5.50. Coffee wasn't bad. Their cortados were relatively big (say, compared to Dark Horse and Red Line).  The baristas were friendly! I think one of them was new. All in all, sweet place. I'd come again."}
{"text":"Best coffee in the city! Excellent staff, laid back vibe and damn good coffee. Try the bacon and cheddar scones here: they make mornings tolerable!   All three locations are great with their own perks: the outdoor patio at Portland is fab on a sunny day, the upstairs seating in Gerrard is perfect for curling up with a book or getting a bit of work done and the Baldwin location (despite the slightly too-cool-for-school attitude of some of the staff) is a nice place to laze away a Sunday afternoon."}
{"text":"I love Jimmys! The staff are always fun and friendly, not pretentious, and the coffee is great. I've had their brewed coffee, americanos, lattes and mochas and they're all great. I love going to coffee shops and I think I have a good idea about what is good coffee, and Jimmy's definitely is. It also seems a bit more reasonably priced than some of its counterparts. I miss living near a Jimmy's- they need an east end location!!"}
{"text":"The perfect cup of coffee in downtown Toronto. Love the ambience and the staff are always friendly. Nice quiet place to get some work done or talk."}
{"text":"???????????????????????????????????????????????????????3?????????????????????????????????????3????????????????????????????????????????????????????????????????????????????????????"}
{"text":"Went there for coffee and a muffin in the morning with my sister. Couldn't find any place to sit after we ordered, too crowded. It's a shame since we had to go settle down somewhere else. The latte was delicious, the muffin was good, nothing spectacular. Couldn't give a better rating because we couldn't enjoy the place like we wanted to."}
{"text":"Cappuccino was pure and not sweet or creamy that makes you fat.  I can tell that the coffee was made with great care. The cashier asked how many shots I wanted and another specific server was making the coffee: nice and delicate little tools, skilful yet passionate handling of everything, and served your coffee with courtesy. The 3-floor traditional style brick building added more beauty to this place. Overall a nice place to visit."}
{"text":"Flat white was pretty much perfect.  Woman at counter (blonde/white) hair, genuinely polite. Nice interior. Good end to long day.."}
{"text":"Great little spot, free wifi, cute barista, nice atmosphere. Outdoor patio, new wave music on the radio. Some munchies and coffee merchandise. The coffee was also delicious."}
{"text":"Great local coffee shop.  The usual espresso based coffees are great, I tend to stay away from the seasonal \"hipster\" drinks they experiment with, they're hit or miss.  I love the vibe inside, very cool and relaxed.  Staff is friendly.  Prices are right. One big plus is the longer hours - it's hard to find many cafes around that don't close at 7pm."}
{"text":"Herbal rose tea is so beautiful ...yea beautiful no other word to describe it! Cappa is decent. What is outstanding for me is the free wifi and working atmosphere so if you need to get some work done come here and enjoy... The staff are very friendly a little too chatty but I'm becoming a grumpy human so it may just me a personal preception."}
{"text":"Jimmy makes nice coffee. It tastes stronger and bolder than Starbucks.  The decor and ambience is hipstery. There are paintings and prints of famous Jimmys - Jimmy Kimmel, Jimmy Carter, etc everywhere. I've only ordered to-go and haven't been pass the first floor, but it seems spacious with their upper floors.  The prices are reasonable. Excellent service, the baristas are very friendly.  This is a superb coffee spot. And yes, there is free wi-fi."}
{"text":"Always great coffee at Jimmy's - love that they opened up a location on Ossington. They make fantastic London Fogs."}
{"text":"This coffee joint had suce atmosphere. The only downfall is the limited space. Coffee was good. Definitely beats Tim Hortons"}
{"text":"A very cute coffee shop that makes an awesome drip coffee and has really friendly staff.  I came here because I was in the area for a business trip.  The staff was super helpful in recommending something to me based on what I like, and they were spot on.  Definitely recommend their drip coffee especially if you like just straight up, black, good coffee.  It was well made, not bitter and hit the spot. :)"}
{"text":"This is a fantastic, friendly, funky coffee shop in downtown Toronto. This is my first visit to Toronto; I'm here for a week-long business conference. Jimmy's is quickly becoming my daily go-to coffee stop. The coffee (light, medium, & dark roasts) are delicious and superbly brewed.  If you're looking for a delicious joe-to-go or a place to sit and sip, you won't go wrong with Jimmy's!"}
{"text":"Came here for a latte and cappuccino and both tasted amazing. Prices are great, especially when you compare to chain cafes like Starbucks and quality is much better."}
{"text":"Excellent staff and latte - great suggestion for a snack to have (chive scone) and on top of that my drink was free because it was my first time there.   Comfortable location."}
{"text":"Great little coffee shop at Gerrard and Bay that adds a nice alternative to the usual Starbucks and SecondCups that populate the area.  The location is cozy, the stuff are friendly, and the wifi is free. They have a nice little patio area outside that's just perfect for this warm weather.  They make a tasty Americano (no latte art, but that has no baring on the flavour so I don't care), and stuck a variety of baked goods. The baked goods are slightly on the pricey side for what you get, but the buttertart in particular is totally worth it if you are a fan. They run a tad on the sweet side, but I've got a serious sweet-tooth so I think they're totally worth every penny.  The staff are all pretty cool but Paul is definitely the most friendly. Interacting with him feels just like hanging out with a buddy. Great guy!"}
{"text":"I discovered this place completely by accident, but boy am I glad that I did. Jimmy's is just off the the side of Bay and Gerrard, tucked away in a small corner. The atmosphere is casual and staff very friendly, and I must say one of the better options for mid-work coffee in the area. Fresh and delicious, I opted for the double shot latte, which was a great pick up in the afternoon and kept me going for the rest of the day. Milk wasn't too overpowering such that I could still taste the coffee. Well done-will be back as a regular!"}
{"text":"The service is prompt, the scones are delicious and the coffee is well rounded. If you are in the area, this would be a great place to meet a friend or to get away from some of the coffee store chains around the hospital area. The cafe is located within a home which has lovely charm and decor and their is parking located beside the cafe which is a plus for those who drive."}
{"text":"Checked it out, had a coffee and just sat around reading for a few hours. Not bad. Great environment and I loved how peaceful it was!"}
{"text":"I went to the one in Kensington market, not this location but can't find it on yelp. Anyway, this place is awesome. The garden/open air area in the back is a very relaxing place to have a cup and recharge. Cold brew was very good."}
{"text":"The espresso roast is excellent, so really enjoyed a straight espresso. However, they served a cortado that was essentially a small latte - warmed milk with no air, and no art to the serving. Rather disappointing."}
{"text":"I really like this place for two reasons: 1) it has a warm/homey character but is also generous in space; 2) the waitstaff is always friendly. Coffee beverages are not bargain-priced but almost always on point quality-wise. They also have a solid array of treats/baked goods including scones, bars, and cookies. I also appreciate how the front end is more conducive to catching up with your homies while the back is more for solitary laptop time. You're sure to feel super comfortable either way."}
{"text":"I work nearby and wanted to get a Friday morning treat so I tried Jimmy's coffee. IIt's a small shop that looks cute from the outside. It has a decent amount of seating inside and some outside. There was a line of about 5 people since it was 9am, but someone took my order while I was in line, so that made it go by faster! The girl who took my order was super sweet and friendly.   I got:  Large Dirty Iced Chocolate Chai (Chocolate Chai Latte with a shot of espresso)  It was delicious! A little too sweet for an everyday thing, but next time I would get two shots of espresso for the large size to cut back on the sweetness.   The bakery items look really good. I will be back here to meet friends for coffee or have a coffee break with colleagues."}
{"text":"i love this place. every time i`m in the area, i always get a coffee here. i`m happy that they`re still strong after having a tim hortons open up just down the street. the staff are cool, coffee is consistently great, and it`s a cool place to chill out and get some work done."}
{"text":"SHUT THE FRONT DOOR. A Jimmy's at Bay and Gerrard? Sign me up!  This otherwise desolate corner near hospital row desperately needed some TLC, and Jimmy's hit a home run. I can't even recall what business was here previously, but this is a gorgeous location in what feels like an old townhome. Two levels, with a third for corporate events, hardwood, and Jimmys all over.  There's a shared courtyard patio that is quiet and perfectly nice for a sit.  Staff are all great, and oh yeah - the coffee is swell."}
{"text":"I'm in Toronto for the first time for work. The first thing I do in any city I visit is scope out the closest coffee. Jimmy's is a block away from my hotel and, reader, it is delicious. When I say \"delicious\", you have to know that I lived in Seattle for ten years and I am particular about my coffee. (Starbucks can keep its burnt over-hot drinks.) Jimmy's is divine. Tasty muffins, too. And, critically, excellent staff who keep the line moving. Recommended."}
{"text":"I've walked by this Jimmy's often but never decided to go in until today. Even though it was a bit busy it was nice and cool inside. The staff were efficient and friendly. I grabbed a double shot 12 oz latte ($4) and I can honestly say this is one of the best lattes I've had in a while. It's not scalding hot, the milk is silky and you get a great taste of the espresso in the drink. Catch me there tomorrow afternoon for another fix!"}
{"text":"I'm not going to pretend to be a coffee connoisseur, but I am a caffeine-addict as well as a coffee shop lover. Cute cafés are my jam! Jimmy's Coffee was a very average experience, however.  Jimmy's uses the unsweetened almond milk from Silk, which is horrible because the unsweetened version tastes incredibly salty, and this definitely transferred to the taste of my almond milk latte. They use a rather acidic strain of coffee beans (re: sour), and the double shot macchiato was hard to swallow. Also, no latte art. Whaaaaat? The barista used some hand motions that made it LOOK like she was doing latte art, but in reality it looked like a white, unidentifiable blob in the middle of my tiny cup of coffee.  There are three floors, yet there is zero place to sit down. The third floor has a conference-room style table, the second floor with a hodgepodge assortment of furniture, and the first floor has a severe lack of chairs. Good luck trying to enjoy your coffee inside!  Jimmy's Coffee is an alright café, and I may drop by to try their other items. However I won't make a special trip for Jimmy's because there are better shops in my neighborhood, thanks."}
{"text":"Nice place to sit, chat, or work in the back. There's also a small outdoor back area with two chairs. The coffee is great, and staff is very friendly. The pastries aren't the greatest, sometimes a little hard or stale, but I forgive them because of their tasty beverages. A nice alternative to Starbucks across the street if you're in the area."}
{"text":"At last, the downtown core/hospital row has a good quality independent coffee shop:) I have quickly become a regular here as it's a nice alternative to Starbucks and Second Cup. The espresso drinks and chai lattes are really well done, and the service is always friendly and laid-back. I especially love the ample seating room. The communal tables on the 2nd floor are great places to read or get some work done. Reliable wifi and an area to help yourself to water are added bonuses. The decor is warm and cozy and they usually play pretty good music. Can't really ask for more than that!"}
{"text":"Their fourth and newest location, located on Ossington right around a bunch of other competing coffee shops!  Admittedly I haven't been to any of the other locations they have, but this one is very cozy. There is a front section which looks like a stereotypical cafe, and a back section that looks like somebody's study or living room. A (probably out of commission) fireplace with armchairs gathered around it, a few 2-people tables, a big communal table at the back, and bookshelves with encyclopedia britannicas.   The coffee is not the best I've had, but for the moment it's a nice spacious place to come to work. I expect it to get crowded as more people wise up to this new location!  Bring your mug to both save $0.25 off your drink and help the environment!"}
{"text":"One of the best coffee shop in Toronto. Great coffee and nice baristas......definitely recommend to all of you! Will be back soon xo"}
{"text":"I like the feel of this coffee shop and it just felt right to have a business conversation with a friend here.  It offered a cozy setting that was a little bit more private upstairs, but yet a relaxed and non-crowded feel.  I think Jimmy's Coffee should open later since it would be a great place to catch-up with an old friend over coffee after work.  It's very relaxed and does not feel as busy or open as a typical chain coffee store.    I'm not at all a person that can say whether coffee is good or not, but I liked their Americano.  I probably drink coffee a handful of times a year though, so you probably can't trust my judgement on that.  With all the chain coffee shops these days taking over everything it's a nice coffee place that is not your typical chain shop nor is it extremely hipster, it's just a nice coffee place.  Take your friends here."}
{"text":"It is getting colder again. My partner and I can not work with the coldness and decide to swing by a coffee shop and grab something to drink.   I loved my spicy mocha. It is not overload with sugar and the spice gives a little kick for the after taste. Nice drink to have in winter.   The staffs here were nice and welcoming. Would love to come here again when I am nearby,"}
{"text":"Had a speaking gig in the area on the weekend and had never stopped in to this Jimmy's Coffee before. I can't remember what this use to be, but can I just say that the looks are certainly deceiving with this shop.  From the outside, you would never imagine how vast this shop is. There is a ton of space to sit, lots of plugs for laptops so you can sit and get work done plus there is even a small outdoor spot to bask in the sun, if that's important to you. Also, I loved the window in the front of the cafe where you could do some PEAK people watching.  One of my favourite Jimmy's Coffee drinks is their JVO (aka the Jimmy's Very Own). It is basically their take on the Starbucks caramel macchiato, in case you're wondering and comes in both iced and hot.  I would highly suggest getting it iced and also asking for double the drizzle because yolo.   While here I ordered a cookie and a scone. Both were kind of disappointing and I'll likely stay away from ordering 'food' items in future. But I was hangry and figured that you can't frig those up. But the scone was way too dry for me. Yes, I know - it's a scone. The cookie on the other hand was a bit hard, and I prefer chewier cookies. That one is more of a personal preference than anything.   If I'm in the area, would I totally stop here again? Absolutely. Way better than the Starbucks across the street, that's for sure."}
{"text":"*Their coffee menu is simple and straightforward, and they don't have those fancy crazy flavored syrups. I also appreciate that they carry lactose free or almond milk for those lactose intolerant people like me :).  *There are 3 floors for this location with the first and second floor available to the public. The third floor seems to be for a big party and require reservation in advance, so it was closed to the public.  *Though the Bay location is opened near the main street, it's actually a bit hidden and very quite. I also like that they aren't blasting loud obnoxious mainstream music like some other coffee shops either.   *I ordered JVO (Jimmy's Very Own) and an almond croissant. I ordered the JVO for $4 and the hazelnut croissant for $2-3? The JVO - Jimmy's very own was an iced vanilla latte with caramel drizzle.The iced latte was not too strong, smooth and the barista applied the right amount of caramel drizzle so the syrup wasn't overpowering the drink.  On the other hand the pastry wasn't my favorite. It was not too sweet and had a strong almond taste so it goes well with a cup of coffee. However the croissant was stale and the outer layer was too flaky. There is nothing I hate more than biting into a croissant and having it disintegrate into a million flaky crumbs :(. Also, does anyone hate it when someone cover the entire croissant with powdered sugar? It was extremely messy to eat with million of flaky crumbs and powdered sugar stick onto your hands..."}
{"text":"Yep, Jimmy's is now downtown! Coffee is as great as ever and this is a beautiful space."}
{"text":"If you are tired of Starbucks and secondcup, Jimmy's is the place to go. Big supporter of this local toronto business! There are six other locations. The one on Gerard has a great study space. There are 3 levels, the top floor is for silent studying. I pick up my morning coffee before school at the McCaul location."}
{"text":"I got the lavender lemonade which was pretty good for a lemonade, but didn't remind me of lavender at all. There's free wifi which is super nice and I really like the quirky seating."}
{"text":"This is the second time I have had a bad experience at this location. I love jimmy's coffee and have had them in other locations but the service here has me swearing off jimmy's coffee. I had ordered a JVO and waited about 10 minutes for my coffee. I had asked the barista once and he said that it was being made. Meanwhile he skips my cups (usually the cashier places them in the order in which they are paid). By the time he skips 3 more cups over mine, I was ready to go and ask for a refund with my receipt on hand. He then starts making my coffee and I ask if that was my coffee and he asked if I had paid for my coffee. The audacity to ask that when I had asked for my coffee twice by now and was waiting by the side where customers wait when they have paid. Apparently, racism is a problem at this location. I see that yelper Lynette O had a similar experience. I am Asian by the way."}
{"text":"Above average coffee, priced about the same as nearby cafes (a little cheaper maybe), free + fast wifi  They have three floors of seating but not as much available seating as you would think. The top floor is reserved for large groups so its not always available and the first/second floor only have a few tables each.  Will be back if I need a place to study for a couple hours!  *They don't do pour overs :("}
{"text":"This would be five stars if the line wasn't so awkward. It's jimmys it's good shit but like cmon people hustle in and order and get out. It's tight in here bad for claustrophobia people"}
{"text":"Actually really liked this place. And I did not even know it existed until I did a Yelp search for coffee shops near work that stayed open after 6pm - which is rare unless you are the usual chain (Starbucks, Tim's, etc.). The prices were reasonable, seating space on several floors, and good WiFi."}
{"text":"Favorite coffee shop in Bay Street Corridor.  I am definitely a regular at this coffee shop (if not daily).   There are three floors of seating, with a mix of sofas and tables. Given the convenience, affordability and quality of the coffee shop, Jimmy's is definitely a favourite amongst a lot of the health professionals and students within the area.   Coffee is fresh, with a fragrant aroma and no staleness.   The service is also phenomenal. All the baristas are adorably friendly and caring.   The downside to this coffee shop is that it is sometimes really difficult to find seats, especially in the early afternoon. Just goes to show how popular the place is!"}
{"text":"Great coffee shop, good espresso! Not a ton of seating and usually busy but if you catch a spot it's great. There are levels upstairs too but it's more of a communal study area."}
{"text":"I'm a frequent customer but I haven't been going to this joint lately because the service hasn't been that great. Today I walked in at 10.50am and ordered a cortado. Paid for it but the woman making coffee refused to make my coffee. 5-6 people who were behind me got theirs. I asked her about my order to which she replied I didn't know you've ordered it while I stood next to her all the time when waiting. After that, she still kept me waiting while serving another few customers. I confronted her and her shift supervisor finally. This is such rude service, I almost want to label this as racist or bullying behavior. The woman needs to be fired!!! She is blonde and wore a black cap. I'm going to start boycotting your joint unless the boss do something about this!"}
{"text":"Great coffee (from a coffee snob), cool environment. Music at a nice volume, enough to add to environment while still allowing conversations. Steps away from the hospitals."}
{"text":"3.5 stars... a nice stop near the UofT campus to get a decent cup.  Like all other Jimmy's spot I visited, this coffee spot has tons of character.  Housed in an older home, the interior feels like a home except you have these incredible portraits of Jimmy's around the spot.  Jimmy Carter, Jimmy Hendrix... you know the Jimmy's!  I LOVE the ceilings... it has the old metal tiles that are imprinted with a pattern.  They probably polished off the original paint and it looks like art work up there.  There is a decent number of seating and it seems like they're friendly to people coming in with laptops.  On a Sunday after the university school year is done, this was pretty empty.  I only saw 3 laptops and so it was pretty easy to get a table.  Service here is cute and funny... it was somewhat like a cute comedy act as the 2 just laughed it up with the Big Red Tour Bus that passed by.  One of the barista was non stop waving at them and trying to get the passengers to wave back.  He also had this ridiculously funny big mouth grin that reminds you of a happy muppet.  Anyhow... they got the drinks quick and ready for us.  They do have a few items to try out and I'm not sure if they're baked in house or brought it BUT they do have overnight oats, muffins, and a few bar items.  They do have a few healthy items as well ... green smoothies and looks to be freshly juiced OJ.    Purple Haze Iced Tea - This is a shade not normally scene outside of a crayon box!  Made with butterfly pea flowers that tint the herbal tea a vivid purple and then lightly sweetened with a bit of lemongrass.  This is a decently refreshing drink for those who dont want a coffee.  I would say there's really no traditional tea flavour.  It's a bit of a watery flower note ... I could taste a bit of a citrus but it's really light.  I did like how it wasn't a sugar bomb... just enough to call it refreshing.  3.5/5  Iced Coffee - Supposedly steeped in the coffee for 16 hours.  This was a decent as it wasn't super sour like some terrible iced coffee.  It was pretty light and not too heavy... but still enough flavour that it wasn't overwhelmed when you used a bit of cream in it.  It is a bit watery but I think thats just cause there was a fair bit of ice in it.  But on a hot day... that's probably welcomed 3.5/5  Overall, this is a pretty good spot to catch some nice A/C near the university.  There's not too many good spots that have decent coffee and seats available to you.  The service is funny and quick so you always have that to look forward to!"}
{"text":"I'm jealous of everyone living in Ossington area... they have Crafted and Jimmy's literally within minutes of each other.  Between both options, you can get really great pulls of espresso and delicious flat whites.    This particular Jimmy's has more character compared to Crafted. I would say Crafted is more put together and refined to the eclectic funky character of Jimmy's.  If you're looking for a great place to sit and work... I would say Jimmy's better as it has a lot of space and tables compared to Crafted.  The staff here was totally friendly and welcoming.  They were patient and for the regulars here, they knew exactly what everyone wanted without saying a word.  I want to be a regular here too!  As for the drinks, they're both reasonably priced and with the great option of non traditional milks.  I love how they don't overload their specialty drinks with sugar a la Starbucks.   My Matcha latte had that right bite of bitterness but the creaminess of the milk to balance.  I could have added sugar but it was such a rarity to actually have real matcha that I did without.  Definitely worthwhile to try out!"}
{"text":"I was craving a matcha latte and I decided to come here after class. I got a chive and cheese(?) scone and it was pretty good while the matcha latte was a tab bit diluted even though I saw her make it. I think either there was not enough powder added to it or it was not thoroughly mixed but it did taste a bit better after adding syrup to it. This location had multiple floors but were all full with people at around lunchtime."}
{"text":"It's a small coffee shop with a nice amount of space, including upstairs, for your seating and working pleasure. The hits: + The espresso is rich and tasty + A special signature drink on the menu is an orange zest latte. Don't see that often, but coffee and orange is a tasty mix. Unique. + They have a small patio out back if you like to soak up some rays while soaking up your beverage. + Bonus points for the amazing mural on the side, featuring a mount rushmore of jimmys. My fave: Jimmy Hendrix."}
{"text":"Jimmy's coffee is housed in an older building with a lot of character. I love the deco and the openness of the seating area. They also put in quite a few electric outlets for customers to hook up their laptops. There are selection of different seating options: small tables for 2, armchairs and some bigger tables at the back.   Jimmy's Coffee has always been one of my favourite in town. Their Jimmy's Coffee beans is sourced by Classical Gourmet and roasted in Vaughan.   My Macchioto ($2.50) was bold and rich. A great pick me up shot for the late afternoon."}
{"text":"This is a great little cafe with lots of character. The staff are hilarious and quite friendly. I've been here multiple times and have always come away happy.  The coffee is delicious, and I love that they have almond milk as an option! The only reason this didn't get 5 stars is because the food isn't covered and has flies all over it during the summer. Not super hygienic and pretty gross to look at. Luckily the food is edible and tasty in the fall and winter months, before fly season!"}
{"text":"Excellent little coffee shop with delicious espresso! They have 3-4 different blends of coffee and espresso so it really allows them to make a wide range of drinks with out a hundred different ingredients.   I got a caramel latte (they were out of maple) but it was absolutely delicious. My boyfriend got the JVO iced (caramel and vanilla) and I think I could drink one of those every single day without getting tired of it.   If you're in the area looking for good coffee this is a must stop"}
{"text":"Don't recommend the chai apple cider. Recommend their mocha with 2 shots.   Barista was super sweet.   Cafe was pretty crowded. Quiet enough for people to work but not pin drop quiet."}
{"text":"This is my favourite Jimmy's Coffee (although I've only been to one).   I was offered a free coffee during my first visit to Jimmy's. The gesture had made me felt so lucky that I managed to ACE the interview and landed a job nearby! Since then, our relationship had blossomed beautifully.   Jimmy's is like the boyfriend you always wish you would have. He holds space for you when you need to chat with your friend! He offers special coffee (starting at $1.75) on a cold winter day! He is your coffice when you need to work! He carries delectable healthy and unhealthy treats (starting at $0.75) when you are down! He warms your heart with delicious breakfast (starting at $3.75) when you forget to eat! He even surprises you on his own birthday on Dec. 10th with free drinks and cakes!   What more can a girl ask for? Just date him already!"}
{"text":"Walking in, this place looks cramped but it turns out there are I think 4 floors to sit in. Despite that, the place was packed and we got the last 2 spots. I ordered a cortado and it was pretty good. I had a good feeling when I saw how fancy their cortado-making machine (or whatever it's called) was. It wasn't mind-blowing, but it was pretty good. The only downside is the atmosphere here is VERY quiet (almost like a library) so it's hard to have a conversation here without feeling the need to whisper. I do like that they have a few large, group tables throughout the entire \"house\", but there are no couches here unfortunately."}
{"text":"I'm surprised there aren't more reviews by now. Jimmy's model is basically, have amazing coffee, but be super hidden. I was drawn in by the mural of the Jimmys of music (page, hendrix, morrison...... buffet was a bit of a stretch........ but they had to make it like Mount Rushmore, and there were already two liberties taken with Jimi, and Jim)  The menu isn't huge, which is good, because it means they focus on what they're good at. The coffee is extremely good. Very smooth, almost no bitterness to it. I enjoy their lattes as well for the same reason.   Big plus is the decor. A re-purposed house, seating can get a bit difficult as it's always pretty busy (hence why I'm surprised by so few reviews.) and I've twice had to awkwardly share the one big table upstairs with strangers (I recognize they may have made this a sort of conference room, but sound travels too easily.) Either way it has a very cozy wood cabin like interior, is always clean, and the staff are always upbeat and cheery. The baked goods are pretty good (especially the dulche du leche macaroons. Worth a try)  Basically, if you find yourself in this part of town, go for it."}
{"text":"Came here to try out the coffee since I heard the place was good. I tried the mocha with chilli and it was great. It had a nice spicy tang that wasn't overly spicy. The place is quite nice too. I was able to find sitting which was nice because I came at a relatively busy time. The barista was also helpful with recommendations. I would definitely return."}
{"text":"love love love the staff. They're super friendly and are always having a good time. Their coffee is great as well and they also play great music. This place is becoming one of my regular spots. My only complaint is the limited seating in the cafe.   + Try their carrot cake!"}
{"text":"I asked about Wi-Fi before I bought my drink and they gave me the password. I buy my drink and sit down to start some work, and the Wi-Fi doesn't work. I check at the front again and they tell me it hasn't been working all day. It seems unprofessional to not tell me that the first time I asked but to wait instead until after I've bought something."}
{"text":"I'm a huge fan of Jimmys.  Perfect almost for all occasions.  Got a friend in town, heading to the network of hospitals, UofT, or whatever... I mean even for long roadtrips, I try and stop here to grab a latte to go.  The coffee and espresso are okay.  On an occasion, I might get one that's been over extracted a little, but for me the winner here is really the latte.  It's done REALLY well.  I mean my fav latte in Toronto.  Put a little bit of brown sugar and you're set.  It's awesome, no jokes.  If you haven't tried their latte, you should."}
{"text":"I always go to the location on Yonge and Gerard and absolutely love this place! It's an old house converted into a coffee shop. Three floors provides plenty of space to sit and study or read or just catch up with friends. However, it does get quite busy! I always get the standard coffee (and keep it at home too) and their scones are also amazing!"}
{"text":"This location of Jimmy's Coffee is located right by Queen and Ossington. As one of my favourite coffee shops in the city, this location has a welcoming and warm vibe. The space is great to get some work done or to catch up with friends. Their ham/cheese croissant and butter tarts are delicious!!  As for their coffee, you can't go wrong with an Americano, done right. The staff are also always friendly and welcoming as well."}
{"text":"Coffee is great! The season menu is my favourite. This year is JVO (imagine iced chocolate and caramel double shot latte) and last year was Gold sth sth (turmeric ginger and chai tea latte)   The stuff are cool and hip but professional and friendly! They know how to do business like a friend.      It has 3 floor, vintage furnitures and fixtures allow ppl to really set in for study and work. 3rd floor is a conference room setting but open for everybody"}
{"text":"One of the best coffee shops in Toronto! Love this shop and working at the hospital for SickKids, it's a quick run across the street for a coffee.   I always get the cold brew coffee. (The larger size is worth the extra dollar) if you're going for a early morning pick me up drinking it without anything extra is the way to go. If you have a bit of a sweet tooth like me, you might like to add a splash (or 4) of simple syrup.   The bariatas know what they're doing so when I occasionally order a flat white (not on the menu) they know exactly what to do.   As a self proclaimed flat white expert it was spot on. The drink was creamy and melted like butter in my mouth, had a strong flavour and zipped the sides of my tongue. The only downside of the drink was that it was a bit grainy as I got to the bottom of the cup.   The seating is great, there's space for about 10 on the first floor, 15 on the second floor and there's a meeting room on the top floor. Needless to say  there's always a place to sit. The WiFi is free and super fast, 50 Mbps, (WiFi password is welovecoffee) and there's a pokestop at the shop. A near perfect coffee shop and a must visit if you're ever in the area."}
