{"text":"I was in Oakville for business. After a long day of meeting, my colleague and I were extremely hungry and just wanted some Chinese food to cheer ourselves up. I was skeptical in the first place because AYCE is offered at just $12.99 per person during weekday for dinner. I tried it out anyway because it was just around the neighbourhood. The food was surprisingly good for the price. I really liked the green curry chicken that they offered. There was a mix of Thai and Chinese food. Great selection and totally satisfied both my colleague and I. We had a great time and drove back to TO with a filled stomach."}
{"text":"Usually when I go to a Chinese buffet, the food and service are quite standard no matter where you go.  This place has got a few delicious highlights beyond the standard Chinese food.  The cocktail shrimps were HUGE and delicious for a standard buffet.  The pad thai tasted like it has fresh basil infused in it!  Way better than the pad thai I had at Spring Roll!!   i really really liked the chicken skewered and I had as much as I wanted, which was wwway to many servings for my own good lol.  There is lots of parking space and the tables aren't jammed packed.  Good value and good taste overall!"}
{"text":"This place used to be called Tasty Yu's but after a paint job and a new aquarium it is now called Jung Thai.  Same food as before as far as I can tell.  Same owner too with same service.  The food is okay for $14 pp for dinner.  Don't show up at 8pm because they won't replenish the food!  In fact, at 8 the rice veggies and some other stuff had already been sitting there for too long.  The wonton soup had a skin on it from sitting there so long  Ewwwh.    One item looked like sauerkraut.  Really sauerkraut?  German Chinese buffet?!?!   Wait - sign says its pad Thai.  Wow, not pad thai by a long shot unless there's a clear translucent sauce pad Thai recipe out there. No sign of tamarind anywhere.  Having said that the basics were ok.  Chicken wings, chicken balls, spring rolls, stir fried veggies and shrimps and noodles.  Stay away from the sushi and salad bar as it's not worth the effort.  Dessert is store bought coffee cake and pastries. Ice cream is fine."}
{"text":"I was hungry on the way to visiting my friends and stumbled upon this restaurant. I had the all you can eat lunch. Yummy food and excellent deal. The restaurant had a great selection of food. My favorite was the chicken skewer, and make sure you ask for the peanut sauce to go with it. After you are done dinner, you can also head over to the dessert table, where there are fruits, cakes, and ice-cream for you to enjoy. Definitely recommend this place. Best bang for the buck."}
