{"text":"Try to spend $50 or more at dinner.They'll give you a $10 gift card."}
{"text":"So this place has honestly some of the best Asian fusion cuisine I have ever had... I would highly highly advise to sit at the bar with the extremely friendly bartender have a few Asian drinks and order their authentic poke and boiling pot!! The poke is the perfect lunch entree and the boiling pot is the perfect dinner entree!!! The only reason I'm not giving it 5 stars is the ambiance is ruined due to the Christian music playing.... don't get me wrong I enjoy some Christian music just not at a bar in an Asian fusion restaurant... But overall they are a new restaurant that has extreme potential to be a big hit!! They are super unique and extremely high quality food at a great price point!! 5 stars For Dane (I thinks his name) our bartender. He made a shot for me, that I request he make his preference and it was great!! Just an overall great experience. Change the music and 5 stars all day every day!!!!"}
{"text":"I'm happy to see a menu that's a little more Korean/Thai infusion. We started with the Takoyaki, which was pretty good. I would like to see a little more spicy mayo though. We also had the 5 Protein Mini Pots.  My son had the Thai Fusion sauce. I had the milk creamy curry. Both were tasty but the milk curry needed more coconut milk flavor.  We requested additional pepper paste since it wasn't hot enough to our liking.  We like very very spicy. Staff was super friendly & nice. The place is clean. Overall a good experience. If they keep it up at this level, we will be regulars."}
{"text":"We finally got to try JJ's tonight.  I have been eagerly awaiting their opening ever since I heard rumor of it as Asian fusion is my absolute favorite cuisine.  I will say the name of the restaurant is somewhat off.  It just doesn't jive with Asian fusion, poke, Japanese or anything else on the menu.  However, don't let that stop you from trying them out.  There really isn't anything else like it around Concord.  The easiest way to describe the place is an Asian Chipotle/Moe's/Salsarita's/Cava except you order from your table.  They offer a noodle bowl, poke plate, boiling mini pot, Japanese and Korean specialties and continental options.  Their kids menu has chicken nuggets, chicken Katsu, chicken noodle soup bowl, coconut shrimp and of course, macaroni and cheese.  In most cases, you pick your veggies, your proteins (3 or 5) your sauce, your mixins or toppings and your side.  You truly can customize your entree and experience every time.  I ordered the poke plate with white rice, tofu, shrimp times 2, cilantro, edamame, pineapple, masago, sesame seeds and ginger in spicy mayo with a crab meat salad as my side.  It was excellent.  My oldest son ordered a noodle bowl with beef, tofu, cilantro, bean sprouts in a miso sauce.  My youngest son ordered the kid's coconut shrimp with sweet corn as his side.  He ate 3 of the 4 shrimp which were very large.  He liked dipping them in the \"spicy\" sauce which was probably actually sweet and tangy.  I didn't try it so i'm not sure what the sauce was.  He demolished all the carrots that were on the plate for presentation rather than his corn, but a vegetable is a vegetable.  LOL  The server was very patient and tried to be as informative and helpful as he could.  He did bring us a cucumber salad sample while we waited.  I noticed that he brought something different to every table to sample while they waited which I thought was clever and cool.  The only knock I would give them would be for no ice in our drinks.  The water was in a carafe on the table, but it had gone warm after the first glass.  I would also recommend that they have samples of each sauce available to try since it can be somewhat overwhelming to choose if you have never been there.  I'm not saying put them on every table like P.F. Chang's, but make it well known that you can ask to try before you decide.  JJ's is owned and managed by the same people who own Asian Cafe which we have been frequenting since we moved here in 2012.  I really wish them all the best and hope that they can prosper in this new venture.  I was skeptical at first when I heard they were opening another Asian restaurant.  I thought it would possibly more of the same, but it really is not. We will definitely be back to try our next creations!"}
{"text":"No like to be honest, if it was the old me I would've asked to spoke to the manager and everything. But I understand grand openings can be hard. The food was bland, some plates we ordered never came out. I literally ate 3 bites of my mini pot. It's definitely not fresh. The noodles bowls was also bland. I had a child crying in the restaurant because he was hungry, they forgot about the kids food.  The server was apologetic but I haven't experienced a worse dining experience. oh and our sweet was salty. Yes someone thought they put sugar in the sweet tea but it was salt. I paid the bill still because I am not that type of person who tries to get the meal for free. It the service industry, I understand. Please fix all the issues. I wanted to ask the manager hey come try this mini pot and tell me what you think. That's all. If yelp had zero stars, this would be the time I used it."}
{"text":"I was looking for a healthy lunch option and as I was riding by I saw the \"grand opening\" sign for JJ's Fresh Kitchen & Bar. We ventured inside and was met by our waitress Jasmine who did a great job explaining the menu options she was our waitress (FYI you get a waitress and server).  I ordered the Katsu Chicken and my friend ordered the Poke plate. Bennet was the server and he brought the piping hot plates to the table in such a professional manner; he had gloves on and he waited patiently while we inspected the plates which (BTW) were bright, beautiful and simply delightful!  JJ's is great option for fresh delicious foodand I will defiantly be returning in the very near future!"}
{"text":"This is a very strangely named restaurant with a even stranger menu, although the inside is clean. The staff is friendly, but the food was very bland and flavorless. We only had a few bites of our meals before we asked for the check, the waiter that came over asked us how the food was and I said very bland. He said well maybe next time try different combinations and he started listing off meat options which we don't eat and we told him that we eat vegan and he said oh okay and walked away. Our check was given to us soon after and the manager never came over to talk to us. The whole time we were there she was walking around talking to all of the other guests, but skipped us. The meals were not taken off our check and there were no apologies. This place is awful and we won't be back! I don't foresee this restaurant staying long."}
