{"text":"This place is awesome!! Prices are the best in the area and the quality is great. It is all fresh ingredients and good service.  It is refreshing to see them chopping up fresh veggies for the food instead of pulling stuff out of a freezer bag. I hope they open more stores!! More people need to try Jo-Lynn Pizza!

P.S. Get a calzone and mac n cheese bites... you won't regret it"}
{"text":"The teens who take the orders and deliver are very friendly and kind. Great customer service. The prices are very reasonable and the food is great! We love their pizza sauce, lasagna, stuffed shells & fish. We have never had any problem and we order often!"}
{"text":"Nobody's perfect. The food is great and I've been a regular customer for years. Fast delivery etc... Just bizarre last night (22 Sept) ordered chicken tenders, cheese sticks and a hoagie...didn't get tenders but they combined two orders of cheese sticks in one big batch.   Called and they said no problem and would send along chicken tenders but I first had to remove my one cheese stick order and give the driver the balance of cheese sticks...just wondering what lucky soul got my cold-to-be-reheated cheese sticks? Right thing would have been just to deliver tenders and call it a small loss to a regular customer? Is someone counting cheese sticks over there?  What if I had licked them all? Gosh. Now I'm wondering who had my chicken tenders before me?"}
{"text":"The food is good, I especially love the cheesy fries! Large portions for cheap. We've orderd delivery from here a few times ...one time I ordered a salad that came with no cheese, bummer cause thats my favorite part! Another time my marinara was forgotten for cheese sticks...it makes me nervous to order delivery again seems like this may be a place where I need to pick it up."}
{"text":"Really great traditional pizza that's gotta be from scratch!  The dough is really fantastic!  The dinner meals are also really good, but the pizza is really the celebrity ;)

I've only ever had delivery or pick-up, but you can dine-in.
The only experiences I've had with the staff are over the phone or the delivery guy, but they've all been very nice."}
{"text":"We have only been to Jo-Lynn's during lent, so we haven't experienced it fully, but we can't wait to go back! During lent they are extremely busy and the wait can be quite extensive, but the staff is great and everyone seems to work well together. They are also very friendly. 

We have only had the fish since we've went during lent, but if everything else is as good as the fish then the whole menu has to be amazing! The have a pretty large menu ranging in items from pizza to pasta so there is sure to be something for every palate.

We have eaten in both times we have been there, but they only have a handful of tables. Everyone seems to either pickup or have their order delivered. 

With the reasonable prices and delicious food, we will definitely be back again!"}
{"text":"Pepperoni and sausage (crumbled sausage) pizza pretty good.
Recommend steak hoagie it was good.
Italian hoagie ok...sampler app platter just ok, probably won't order again...
Delivery can take a while but the food is still warm and drivers are very nice"}
{"text":"The only place I would go everyday to eat if no one stopped me. The pizza here is excellent and all their other food is just as good. I always get the pizza with pepperoni, mushroom, and olives, or I get their pepperoni rolls. Cashiers and cooks are respectful and get your order done fast. Nice place to hang out with your friends. Never gets too busy unless the festival is in town. Really love this place,  have had their pizza since I was a little boy and it is my main pizza spot!"}
