{"text":"Delicious! I ordered a takeout of the barbecue chicken. They have the option of fried, grilled or barbecue chicken but the barbecue chicken was the only one that had a specific pairing to a side of taro chips with a dipping sauce made of at least grilled pineapples, salsa, pumpkin seeds, sesame seeds, beets, and green onion. The pairing was amazing and the chicken (white meat) was very tender. Portions are sufficient and price is reasonable ($10 for the 2 piece).   ***reason for 3 stars is because part of my chicken was pink. Thankfully I usually check before I eat and only one piece was like this. Hoping for some more consistency.  Order takes awhile to come during a workday lunch so I suggest using ritual.  Definitely recommend - hope the chicken is cooked fully next time!"}
{"text":"Found this place on our way to Goodman pub... Honestly so glad we chose to go here instead. The place is by the Harbourfront, so its great for patio. We got the chicken and waffles, BBQ chicken, and potatoes in Brava sauce. The chicken was super juicy and flavourful, not dry at all. The prices were surprisingly reasonable for a restaurant on the Harbourfront. Also got dessert from the fix which was a bit too sweet but still good. They have a lot of unique combinations of flavours for the ice cream. The only reason i gave it a 4 star is because they charge $2.50 for water, and the waiter didn't even tell us ? Also the service was okay but not terrible."}
{"text":"Tried this place out and for a first impression, I was very pleased!  What attracted me about this place was the decor. I didn't sit in to eat, I ordered takeout but I like that the takeout section makes it seem like you're ordering from a van.  I ordered the Smoky Grilled Bird 2 piece which was very tender (I love that especially for chicken breast) and a side order poutine which states in the menu is made with lemon-thyme gravy.  The chicken was tender and succulent and the poutine was very good (and it's kind of hard to get poutine right). The gravy gave it a nice touch and the portion size was just what I needed.  I highly recommend this place for those chicken lovers."}
{"text":"I went here on opening night with a friend. For it being their first night open service was great, no issues. Prices are more than fair, especially for the waterfront. I had the fried chicken sandwich and it was good, but nothing amazing. The \"fried\" part was a bit weird as the whole piece didn't seem fried? And it didn't quite stick to the chicken so need to work on that.  I also tried The Fix last night and had the coffee soft serve treat. It was good, but the soft serve was a little icy. I wish it was creamier, but the flavor was great!"}
{"text":"Really nothing special everything seems like out of a box or a can  Will not come back Why is it so hard to cook basic stuff Another meh! Place"}
{"text":"I had the pleasure of visiting this establishment twice in one day! What an experience to see the atmosphere on a sunny afternoon with the patio walls open so the outdoor dinning space blends beautifully with the flow of the indoor space. Also during the dinner hours when the sun has set. The vibes were consistent on both visits.    I only learned of the restaurant the day before after learning about \"The Fix\" and then realized it was inside of Joe Bird. Our initial visit was focused on trying one of The Fixes creations, that was interesting (see my review!). Our second visit is when we decided to stay close to  harbour front because of the down pour of rain.   Upon arrival we were greeted by one of the hostesses and seated, the restaurant kwasn't packed but bustling were were seated on the window with wood benches and pillows. I love the look but sucks if you want to sit back and digest your comforting  meal.   I loved our English server he was very accommodating and despite his section being busy he was still attentive to us and our needs.  The food:  We ordered fried chicken 2 piece which came with a side and sauce. Side chosen was the mini slaw and sauce was the mango chutney.  I was expecting the chicken to be a leg and thigh but it was a drumstick and part of the breast (I was tempted to but street meat afterwards from not being full). Unfortunately my pieces of chicken were not fully cooked but the server was apologetic and  accommodating. The second dish ordered was the bird chicken and waffle. Loved the waffle with a touch of coffee. We substituted the second piece of chicken to try the BBQ. Glad we tried it, interesting taste. We also tried the spicy fries which was nice and crunchy.   My biggest plus of the night was the cost of our meal. My advice, if you have not been just try it once!"}
{"text":"I have been to JB numerous times since it opened at the tail end of last summer. The fried chicken and corn bread is a must try and please don't forget about The Fix hiding inside!"}
{"text":"The only reason this place gets 2 stars is because it is literally on the water with a patio. Go for drinks and enjoy the ambience. The fried chicken has very little flavor and the sides (we ordered all of them) were not memorable or enjoyable. The service was fine."}
{"text":"The decor of the restaurant is very inviting and enjoyable. My wife and I ate on the patio and watched the sunset over the bay. The location is great and easily accessible, but our service was subpar. We entered the restaurant from its interior entrance and we were told we were put on the list to be sat so we went to the bar since the wait was only 15 minutes. We waited the 15 minutes and I went to check our spot on the list and we were never placed on it. We were sat 20 minutes later and after arriving at our table it took someone 15 minutes to notice we haven't been taken care of yet. The food arrived quickly and we had the cornbread as an appetizer. Growing up the south I was afraid of what Canadian cornbread would be like but this was probably the best cornbread I have eaten. I got the 2 piece fried chicken with the potatoes bravas and I was very pleased with my choice. My wife on the other hand got the chicken sandwich with fries. She enjoyed the fries but the chicken on the sandwich was paper thin. While here I tried a beer from the bar (their on tap selection is lacking) and the whiskey lemonade which was very tasty. Overall I would grade the food a 3.5/4 and the service a 2 with the atmosphere being a 4/5. If we are ever in the Toronto area again I may wonder into Joe Bird for a second time."}
{"text":"Amazing food, good customer service, great atmosphere,  and cheap too! You have the option of sitting inside or outside. You get a great view of the lake as well. Would definitely come back :)"}
{"text":"Great drinks and a perfect view of the waterfront.  Touristy and a bit annoying if it's too busy, but the staff is very nice and the atmosphere is cool.  Definitely drop it if you're downtown and it isn't too crowded."}
{"text":"Overall a good experience. We ended up here on their soft opening party (I believe) so unfortunately we didn't get a seat on the patio but the inside is definitely still cute. On each table there's a little cactus and mason jars for the utensils. The price is not bad for Harbourfront (less than $15) and the chicken is delicious! The chicken wasn't salted so you could put salt to your liking or they also had a spice on the table which you could add as well. You also get to choose a sauce that comes with it. I got the habanero sauce which was okay. The only thing was that I wish it was more savoury and less just plain spicy. I had some of the mango sauce from my friend which was good but it was just missing something to it. Each dish comes with a side so I got the wedges with the garlic aioli which tasted great, just wish that the potatoes were cooked slightly longer! Other than the sauces which I think they could definitely improve on it was great and I would definitely come back."}
{"text":"Food probably 3.5 but rounded up to 4 for decor and service.  I had the chicken and waffle. It came with a really interesting sauce (bourbon coffee?). So good. I enjoyed dipping my waffle straight into it. The chicken was good too and the coleslaw that came with it had good subtle flavours.  I got the corn on the cob as app. It was ok. Tasted of mayonnaise. I like the mexican corn cobs at taco places better in terms of the toppings.  Great spot to hang out by the water. I'd come again!"}
{"text":"Good food, good music,smiling staff, good birds and delicious ice cream. Just visit when you'r around. It makes you feel like you'r in a beach club!"}
{"text":"- Food was great. Had the Chicken & Waffles, Poutine and Corn. Came with a few different interesting dipping sauces as well.  - Now onto the service.... Staff was very friendly but everything was SLOW. My date and I was there around 2pm on a Labour Day and it wasn't even that busy. A few open tables available as people came and go.  Our food took about a half hour to arrive while the drinks (water and coke) didn't even come yet.  When the food arrived, we didn't have any napkins or utensils to begin with so we had to remind our waiter about that as well. 5 minutes later, glass of water arrived. 8 minutes later, utensils and napkins arrived.  The annoying part was trying to flag down any waiters as it seemed nobody was available for a good duration of a couple of minutes.  Food got a bit cold after all the waiting around.  Anyway, overall experience there was crap for such a nice place by the water. I would definitely come back for the food. I'll take it that waiters had a bad day and assume the service would be better next time hopefully."}
{"text":"3.5 out of 5 We ordered a grilled chicken sandwich for takeout.  The chicken was surprisedly tender.  The sandwich comes with tomatoes, coleslaw, pickles, Swiss cheese and garlic Mayo.  It comes in a sesame (black and white) bun that was a tad dry but I think it helps soak in the juices of the chicken.  I may come back again."}
{"text":"Great food! Chicken is super moist and ice cream is fantastic.  Make sure to get the potatoes bravas."}
{"text":"My friend and I came here for dinner on a Saturday night. We were greeted as soon as we arrived and were seated promptly. It was dark so we decided to sit inside but I would imagine the patio being a popular choice during the day as it overlooks Lake Ontario.   I ordered the two piece fried chicken with poutine and my friend ordered grilled chicken with seasoned fries. From previous reviews, I was expecting the chicken to be bland and would have to rely on the sauce (I chose BBQ), im the type that eats fried chicken as is without any dipping sauce lol but the chicken was juicy and flavourful, no dipping sauce needed.  The poutine was really good. The fries were crispy and the lemon thyme gravy was soooo good. The cheese curds on the other hand, tasted like Kraft cheese strings for some reason lol.  My friend enjoyed his grilled chicken but preferred the fried chicken better.   The service was really good too. The food came out in a timely manner and the server did check up on us often but just the right amount.   The quality of food and not to mention the view is superb for the price. I'm definitely coming back but next time during the day so I can enjoy the view with my meal!"}
{"text":"Amazing place. The service is great and the foood is awesome. Love going there, youre not paying an arm and a leg for your food but you get the most beautiful view of lake ontario. And when youre done with dinner, they got the perfect FIX!! Deliciousssssss ice cream. Keep it up guys!"}
{"text":"Great brunch spot ! The menu is trendy and has some really interesting options. Great presentation of food and the portions aren't overwhelming.   Great bar selection , and decent price for the meal and location.   Service was great as well. Beautiful view of the lake."}
{"text":"Very cool decor and great patio right on the water. Overall great staff and friendly vibes. Got fried chicken and chicken strips, which were really good but not like anything super special. Fries were on the squishy rather than crispy variety. So it was decent, but not super super great. Would go back again for the atmosphere and nice patio drink :)"}
{"text":"Was excited about this place but it did have a few flaws.   Cons:   I didn't understand the fries. I love me some small and crunchy bits but I don't want all of them to be. Felt like I was eating the leftovers from a fryer. It was seasoned well though. Would've just liked full, crispy fries.   The fried chicken itself didn't taste like it had a lot of flavour(the fries tasted better) . I understand they have their sauces but I've eaten at some chicken and waffles places before and it's a good sign to me when you can eat the chicken on its own. Dippings to me should just give it a little umph!   I know this might be a strong word but I hated the waffles. My partner ordered the chicken and waffles and the waffles tasted more like toasted biscuits to me. Maybe some people will like it though, I just didn't like the whole crunchy(chicken) on super crunchy(waffles) texture.   Pros: Decor is nice really wants you to chill and have a beer.   Service was great. Not overly hovering but they made sure they were close by.   Chicken was juicy and moist. Just needed more flavour to me.   Desserts are awesome. The variety is great and it's what makes me want to come back and try more.   Overall the place is fine. I haven't tried the other stuff yet but I'm willing to come by again for their BBQ. There's still a lot more to try. The atmosphere and service is great. I just personally won't order the chicken and waffles again."}
{"text":"A touristy joint on a weekend before the Mariposa cruise. Watch your heads when the umbrella stands fall lol- the service is very good and attentive; the chicken for 25 for 8 pieces on its own is a bit pricey for not adding a size a bit of a fleecing to the poor at home tourist. However, the chicken and sauces were very flavourful and the ice cream campfire sundae was excellent (so my son says!) Worth a try."}
{"text":"Fried chicken is decent. The chilli is the best thing on the menu and super cheap. The grilled chicken is awful! It tastes like they use liquid smoke...the ice cream bar is really good but has awful service. Get ready to wait 40 + minutes for a scoop of ice cream sometimes. Overall very disappointing"}
{"text":"Warning - don't get the BBQ chicken - it is borderline inedible.   Great location on the water and a wicked patio but the food was average at best. The fried chicken was homey and reminded me shake and bake.   The services was awful. We had a table of 6 and it was impossible to get the attention of a server. So much so that one of my friends just went without cutlery.   I would come back here for a patio beer or ice cream from the stand next door but I would make sure to eat before I came."}
{"text":"Horrible tasting chicken. Toonie Tuesday from Popeyes or KFC is way better. Expensive for what you get. The patatas bravas were a soggy mess. The chutney wasn't even chutney at all, but some jerk gravy. Chutney should have a jam like consistency.  Will never be back and will tell everyone I know"}
{"text":"I was on the harbour front this afternoon with my husband and was super hungry and wanted to have something really good. So I yelped and found Joe's Bird. They have a very nice casual dining set up for indoor seating and a gorgeous patio. We decided to sit outside as it was really nice outside.  We ordered 2 pc smokey grilled BBQ Bird with a side of Potato Bravas and Yogurt Za'atar sauce and 2 pc BBQ bird.  Well, I would say I've had better. Smokey grilled BBQ bird was just alright nothing special in that. Very simple seasoning and even the grill was just ok. I wasn't getting that nice smokey flavour. Potato Bravas were also just okay...... some of the potatoes were still raw and weren't cooked fully. Yogurt Za'atar was good.  2 pc BBQ bird was a total disaster. They had just added too many elements to it which didn't complement each other and moreover it was overcooked so chicken was dry from inside. We told about this to our server and she got a new piece of chicken for us but that was a waste too. We couldn't even finish 1 pc together. This dish was a complete failure to me.  Though the location of this place is amazing the food is not good at all. I won't come back here and waste my money."}
{"text":"Went here a few days after opening and they had the usual new place hiccups and a couple of unexpected features. The place wasn't too busy, probably because it had just opened.  Food: Ordered the chicken and waffles, grilled chicken with a side of broccoli & cauliflower and a couple soft drinks. For dessert we ordered coffee soft serve and a creme brulee sundae (whatever it was called).  The fried chicken reminded me of Shake n Bake chicken. The coating didn't stick and wasn't crispy or crunchy. Two pieces were included: half a breast fillet and half a thigh. Most people think of the south when they hear chicken and waffles. The chicken didn't remind me of southern fried chicken at all. The chicken tasted fine, but Popeye's tastes better and gives you whole pieces. The waffes were on the crunchy side while also being chewy, and the included maple pecan bourbon sauce was nice, but there wasn't enough of it. I'd have asked for syrup, but they didn't have any. I asked for hot sauce and they brought me a small container of the house made hot sauce. What our waiter neglected to tell me was they charge $1 for the sauce.  The grilled chicken was ok and about the same size portion as above. Since you specify a sauce, the expectation is the chicken would be basted with the sauce. Instead, a tiny container of sauce was served on the side. When they put the plate down, the chicken was hidden by the broccoli and cauliflower so either the pieces are small or the veggies are huge.  The coffee ice cream was more ice than cream. Think ice milk.   The creme brulee sundae was burnt marshmallow ice cream on a stale sugar doughnut and dressed w/ a few raspberries. Rather than brulee the sugar on the doughnut, or microwave the doughnut to soften it up, it just sat there like the day old doughnut it was, hard, dry and ready to be choked down. It was hard enough to raise a splinter or two on the wooden spoon that comes with the ice cream. Luckily, I felt the splinter before it actually got stuck in my lip. Even the melting ice cream had trouble penetrating the stale, dry doughnut skin. But the burnt marshmallow ice cream was good and creamy.  Service: I could've sworn it was our waiter's first day as a waiter, but apparently he waits at other places too. He came by to take our drink orders and expressed his sorrow that the place didn't serve lemonade or sweet tea. The place is dressed up to look a bad replica of either a southern seaside shack, a southern swamp shack or a southern road side shack, but they don't have two staples of the non-alcoholic south, lemonade and sweet tea. So we ordered some other soft drinks. After a couple minutes, he came by with water and glasses. Then he came by to explain the menu and take our dinner order. Then 10 minutes later, our soft drinks were delivered. Ten minutes after that, our food was delivered by a server. Then 5 minutes later, our waiter came by to check on us. At that point, I asked for hot sauce and 5 minutes later, he delivered me $1 worth of hot sauce. FYI, $1 buys less than a fluid ounce.   Interior: Good thing I had a tetanus booster a couple years ago because I could've easily gotten lockjaw if I scraped myself on the rusty table leg (unexpected feature #1). I also could've gotten splinters from the rough, reclaimed wood table top. Being a rough table top, glasses and plates didn't sit solidly or stably so you had to find the flattest part of the table to place your glasses. The interior makes liberal use of rusty, corrugated steel and repurposed wood pallets and cable reels, just like all the best shacks and shanties in the south do. And just like in the south, the rest rooms are outside the restaurant, across the atrium, behind the escalator (unexpected feature #2). Don't get lost making your way back to the bar.  Price: Reasonable, actually.  tl;dr: Bring your own hot sauce and make sure your tetanus booster is up to date."}
{"text":"Came here with a group of friends on a Saturday night. They had a live band playing, which was pretty cool.  I liked the decor.  We tried the fried (3 stars) and grilled (4 stars) chicken.  The fried chicken was moist but the batter did not have a lot of flavour. The grilled chicken had a nice smokey flavour which I liked.  I ordered chili with my order which I preferred over the fries that my boyfriend ordered.  Price was reasonable for the portion $18 for 4 pieces of chicken + a side and 1 sauce.   Overall I think I will come back again when I'm craving grilled chicken around the downtown area, esp in the summer when the patio will be opened."}
{"text":"Love this place and also the little space with Icecream..  you get to sit inside Joe Bird and still can order the icecream to your table or else just sit by the board walk enjoying the views especially when it's a sunny day!"}
{"text":"Wow, what a great find in Toronto! We totally did not have plan to eat their food! It was totally a coincidence and I was immediately sold when I saw their menu...fried chicken, smoked chicken, bbq chicken...i couldn't refuse!  We ordered from the truck for takeout since it was a Saturday and almost everything was closed so there were plenty of seatings at the food court area of the mall and hubby wanted drinks from Tim Horton lol...  We ordered the 2 pieces fried chicken with poutine (paid extra to get this as a side) with the yogurt based sauce and 2 pieces smoked chicken with the mango sauce with broccoli/cauliflower with some kind of aioli sauce.   The food came out within 10 minutes, piping hot!   The chicken was really juicy, I was a bit worried since one of the pieces was a white meat...and solo flavorful! The fried chicken was crispy on the outside, a bit on the salty side imo though.   The smoked chicken had deep Smokey aroma, flavorful and again juicy...so good! Personally I like the smoked chicken more than the fried. The sauces were just ok though.  The poutine was soooo good! They use good quality of cheese! It makes a big difference! The veggies were a bit dry but had good flavor.  Overall, we were very happy we found this spot! Certainly a good reasonably cheap eats in the waterfront area of Toronto :)"}
{"text":"Love this place. The decor and service are excellent. I have been here twice. Had the fried chicken with mango chutney - love the dipping sauce! They have plenty of sides to choose from. I got the broccoli & cauliflower, which was very good.   The second time I was here was for takeout lunch. I got the vegetarian chili. The food tasted great for the price, and was very filling.   I would definitely come back and recommend this restaurant :)"}
{"text":"Ate here today. Got the taquitos. The cheese tasted like it was expired and the chicken was gamey with lots of slimy skin. Absolutely disgusting. When I mentioned it I was told that was how it was supposed to be. I barely made it through half my meal and was charged full price. Never again"}
{"text":"Absolutely impressed with this new restaurant!!  The decor is tastefully put together... hip, chill atmosphere.  Love the graffiti on the walls.    The food was delicious and not expensive at all.  We ordered BBQ chicken and chicken sandwich with side salads, which were really well made.    Service was great as well.  Servers are super friendly.  Highly recommend and I will definitely come back!"}
{"text":"i had a very nice experience at joe bird.  the view is lovely and the service is friendly. the chairs and tables are a bit weird, but sometimes weird is a welcomed change. not sure if it'd be comfortable after a couple hours of sitting though.   my wife and i shared the bbq chicken and the fried chicken and both were excellent. the meat was juicy and the skin crispy. the sauces were full of flavor.   i didn't find the 2 pieces with 1 side all that filling. however, then i had their ice cream sandwich and was stuffed silly."}
{"text":"We went to Joe Bird for our office team lunch; we were greeted by friendly hostess upon entering the restaurant. We were seated at the patio facing the harbourfront as per our request.   The menu is simple - fried/grilled/smoked chicken, fried chicken with waffle or sandwich. Salad and vegetarian options, sides, bread. Sauce is their specialty, so you can order extra sauce or Sauce flight to try all flavours   My group have ordered different styles - fried, grilled, smoked and chicken waffle. Food arrived quickly and the portion is decent. I ordered fried Chicken with Waffles ($10). The fried chicken was juicy and the skin was crispy although the skin fell apart easily. I especially enjoyed the maple coffee sauce with the waffle.   Overall, my lunch companions were happy with their food except the one who had BBQ chicken found the bird was not marinated enough.   We also ordered the Fix Ice Cream as dessert. The desserts are definitely photogenic; they taste pretty good too. They claim their house made softserve to be no chemical and no artificial. $7 seems to be a little high cost but it seems to be norm in Toronto for a fancy ice cream sundae.   I will definitely come back. It is good value to have a harbour view Lunch with good food."}
{"text":"This restaurant is pretty new on Habourfront. It is hippy and trendy. It is a fancy and somewhat expensive fried chicken joint. The food quality was good, however, it is a bit pricy. The fried chicken here was smaller popeyes and 2 chicken of chicken costs about $10. I came here during team lunch. Some guys are ordering 4 pieces which is around $16. However, if I ever crave fried chicken, I would probably go to popeyes. Also, I found the bbq cause here tastes a bit bitter. Maybe because they put too much spices on my chicken. The biggest sale point is its view on Habourfront. However, if I got a friend who came to Toronto from out of town and want to dine at Habourfront, I would probably bring my friend to Amsterdam nearby, which got more variety."}
{"text":"I really wanted to give this place 5 stars, but unfortunately our waitress wasn't at all good. She was nice enough, but after taking out drinks it took her a good 20 mins to take our order.  I wanted to order the pouting for app, but came out 2 mins before our meal.  Food was good not amazing. We really enjoyed the bourbon lemonade, but the mint julep was too sweet. Chicken and waffle was good, BBQ was unique, def acquired test. All in all it was decent, but the waitress did ruin the experience"}
