{"text":"Horrible decor inside, the cook could be heard ordering the cashier around in loud voice.  As the Philly cheesesteak was concerned it lacked taste and the amount of steak in it was disappointing.  Best of Philly on Central south of Thomas puts this place to shame. I will not be returning...even with a groupon."}
{"text":"5 stars every time!!! Joe's original (request it the way he likes it) nothing like it!!! They make food like the good old days, fresh."}
{"text":"Joe's Philly is one of the best places to eat in the area and overall the best philly sub shop I've been to in Phoenix. The owner Joe, who is usually there cooking, is a very friendly nice guy. I'm in here at least 2 times a week for his breakfast. It's delicious, absolutely superior to anything you'd find at a chain breakfast place like IHOP, Denny's, ect.. You have to try his breakfast platter or the steak and egg. This place is very fairly priced, and you get very good sized portions of quality food. The inside is always very clean, with a flat screen tv on. Give Joe's Philly a try! It very well could be your new favorite breakfast or lunch place."}
{"text":"Gyros were amazing, wife loved it!  Hamburger a little too heavy on pepper.  Fries looked/tasted like they were cooked on too high of heat for a little too short of time, thick and DARK.  Now, for the Philly...  It tasted good, not blow my socks off, but good.  However, there just was not enough steak.  The sandwich disappeared too quick and not for the right reason. Inside was clean, but cold.  If you go somewhere to sit down and eat, you want to take your jacket off, but I had to zip it up.  I will come back, bit I'm going to try a different sandwich and steer away from the Philly..."}
{"text":"A nice quiet place with good food. This will be a regular stop for me! Thanks for a great meal!"}
{"text":"GUYS! IF YOU ARE LOOKING FOR THE PERFECT CHEESE STEAK SANDWICH, THIS IS THE PLACE TO GO!  This place uses fresh ingredients which makes all the difference in a good sandwich!  An interesting thing that I came across at this restaurant, is that they offer you a \"Malt Vinegar\" as a condiment along with ketchup of course to put on your fries. I never tried this before, but YOU GOTTA TRY IT! you'd be surprised, how good that tastes!  I didn't mix the ketchup with the vinegar I only used the vinegar on the fries. I HIGHLY RECOMMEND YOU GIVE IT A SHOT, you won't use ketchup on you fries again!  The next time I am hungry for a Cheese Steak sandwich, I know where to go!  GOOD EATS EVERYONE!"}
{"text":"The bread is so soft and yummy!!  Their cheese sauce is delish and you cannot beat the king fries.  I don't know where they get their bacon but holy pig.  Yum!!  I will be back next time to try the chicken philly."}
{"text":"First time in today. Well worth my money spent. Pleased with the portions and the people who worked there were very kind. Got a cheesesteak, potato skins and some loaded natural cut fries (which were full of bacon and lots of cheese and sour cream-Yum!) Also, the restaurant was Clean! Yaaaay!!! Sounds cliche, but, good food, good service! It's great to have both in a nice clean place. Great job! Please keep up the good work!"}
{"text":"The regular size Joe Philly is very good and has a good amount of meat.  I also like the potato skins which is a potato cut in quarters lengthwise.  The potato flesh is still there not scooped out, so these are pretty filling.  I like the food, but it is rather expensive for me for a lunch. NOTE: Regular is on a 7\" roll, Large is on a 12\" roll."}
{"text":"Great food and portions for the price... I had the Philly cheesesteak and king fries. I've been to Philly and this is the next best thing for cheesesteaks in AZ."}
{"text":"Yum, yum food ! You gotta try this place.  Meat is tender. Oh so good. go to 19th ave and northern for some great steak sandwich. Personal is friendly and fast."}
{"text":"Not impressed. Unlike the other reviewer; the meat was tough and gristley. Not very flavorful. Arby's beef dip much better. Ice tea was colored water. Fries were good"}
{"text":"Okay So I bought the Joe's Philly cheese steak combo that was about $9. The sub roll was soggy, the rest really didn't have any taste to it. I wouldn't consider this a \"Philly cheese steak\".  Just call it \"Joe's soggy bland steak\". The fries just made things worst. They reminded me of dead board walk fries. Soggy of course and bland. What a let down all these good reviews. All I received was disappointment. Maybe all the good review's. Came from people that are use to eating food from Nursing home's/ hospitals."}
{"text":"I have seen this restaurant many times when I've been in the shopping center. Whether it's visiting Sprouts or Bookmans or Walgreens. I finally decided to come in and give them a try. I got an order to go.  I wanted two Philly steak sandwiches. It was very good. However, just a little dry ,for that reason I don't know why. The bread is a little overwhelming with the sandwich. Sort of there's not enough filling to fill the bread. The filling that was there was good hot and fresh. You pay extra for mushrooms. Which, I would think that mushrooms came on a Philly sandwich, but not here you have to order them. Foods good ,not cheap. But, it's worth a try."}
{"text":"Real Great Unfrozen Chicago Food. The food is so fresh and is prepared for the customer with the customer in mind. The food is prepared with quality and the philliysteak is unlike any philliysteak you have ever had. The owner is amazing ! He served us like every person deserves to be served. The food was prompt and full of flavor ! I have never had something this good from Phoenix. The food was so authentic tasting like as if your favorite family member cooked for you !! I am so so so happy that I came here to eat. Great location watched TV and had a very fresh soda. Had a date with my girlfriend for $20 and we're full all day and especially satisfied"}
{"text":"Clean joint, low carb options, delicious cheesesteak and fries. They even have breakfast options. My food was made to order and the staff was great. Will definitely return."}
{"text":"Pretty good for being so far from Philly. Of course I've never been to philly to compare it to the real deal but they have cheese wiz!"}
{"text":"This place was awful. Poor quality steak and other ingredients; others are right about wilted lettuce and questionable freshness of the food. Heart attack food without being worth the heart attack. Dirty on the inside to boot. Like others, I threw my food away. :("}
{"text":"We were hungry and on a mission to find something good, local and fairly inexpensive and this place fit perfect.  At first impression walking in there is nobody there, the walls are plain, and there was only one girl working behind the counter and the kitchen by herself.  Overll the place was clean and well kept, just not much decoration to look at.   I ordered the buffalo chicken hot sandwich with cheese.  Man.. I'ts been a long time since I had a Philly style buffalo chicken and it was good! I got the combo with fries that looked and tasted home made.    This is definitely a mom and pop type place that's worth checking out for lunch or dinner.  The large combo or large sandwich might seem a little pricey but its huge and you can easily make 2 meals out of it."}
{"text":"Not sure if I went to the same place the three people who gave it 5 stars, lol.    The meat was dry and tough and tasteless....there was a blob (about  1 1/2 inch squarish) of cheese on the bread....had to actually go looking for it because I thought they'd left off the cheese.   The \"Super\" was supposed to come with onions, peppers and mushrooms, but not a single one of those could be found among the meat....but it also came with lettuce and tomato, which was NOT listed on the menu.      Probably not gonna bother trying this again, it was that disappointing.   I'd rather travel a little and go to Uncle Sam's.   Moist juicy, flavorful, plenty of cheese (and good quality that doesn't congeal before you get it to your table).   Yes, it's more expensive at Sam's but if I'm gonna eat all those calories, let's enjoy them!"}
{"text":"Some times you get that itch you need to scrarch, like getting a great Philly cheese steak. Here in the valley they can be places that are few and far between. Joe's Philly has what you need to scratch that itch.      I stopped in for lunch and ordered the combo meal. It includes any sandwich fries and a drink. My food came out hot, fresh and supper fast! Fries are homemade and you get plenty of them. The philly sandwich its self has plenty of flavor with shaved steak, grilled onions and provolone cheese.      The staff was friendly and patient as I looked at the menu to decide what I wanred to order and the place was very clean.       With low carb and low fat options as well I will definitely be coming back for more!"}
{"text":"High priced food, better going and get ur own burger ingredients and cook at home. I will not go back and get anything from here..."}
{"text":"It was very mediocre. My husband and I got the buffalo chicken sandwich and the Joe's Philly. The buns weren't toasted. The buffalo sandwich was canned chicken with tabasco sauce on it. Also, they charge for drink refills. We don't expect much from a sandwich shop, but not a fan of this place."}
{"text":"Meh is the best way to describe the food.  Went here on a whim for lunch and got the Philly Cheese Steak w/Fries. The bread was too mushy, the beef was poorly seasoned and the cheese used did little to enhance the flavor. The tomatoes were too thick and the lettuce was also chopped to large for a sandwich. The fries were hopeful but ultimately lacked the crispness to make them noteworthy. I won't be back I as this is definitely not a signature Philly."}
{"text":"Freakin Amazing!!! Philly cheesesteak to die for. Definitely recommend:) also great service, very friendly! Coming back soon!"}
{"text":"Trash. Prices were not worth the sandwiches. Got the regular \"Joe's Philly.\" Drier than the Sahara desert. Flavor was bland. I also tried \"the king potato\" expecting loaded fries, ended up getting a baked potato. Refills are extra, besides mustard and ketchup, ranch and other condiments are also extra charge. Would not recommend this place."}
{"text":"First timer here! I absolutely loved everything. The Cheesesteaks were amazing. Plus the fries are freshly cut and delicious. Nothing is frozen there. Great customer service too. Highly recommend this spot.  *Phoenix Foodies Approved!"}
{"text":"I don't eat beef very often so probably don't know what to expect like some of you.  The owner there was very polite, brought my meal to me.  He also checked back with me.  This is not a fancy place, It is basic and very clean.  If it wasn't,  I would have walked out.  Last two places I went that weren't I walked out with food poisoning over the years.  The True kitchen at the Billtmore being the exception...it was clean.  Overall I liked it.  The meat was very fresh and not overly spiced. Plenty of it.  I enjoyed the fact it just had a nice flavor with no gristle.    I will go back and next time will have the gyros.  If they are as good, I will be happy!"}
{"text":"If you want a genuine Philly Cheesesteak make sure you order it *without* mayo, lettuce, tomato.  The sandwich here is made with those items, which actually makes it NOT a Philly (Cheese)steak sandwich.  BUT, that said, the rolls are almost as good as the real deal - an Amaroso roll from Philadelphia.  And the meat on my sandwich was tender and tasty.  I got the Cheez Whiz (and not the provolone) and it was almost like being home again.  If I could just find someone to fix me a real hoagie I'd be in heaven!"}
{"text":"Both To Go's were around 8PM on Mondays. Visit One - I had the Philly Steak Large with Medium Fries.  I always order my Phillies with Steak and Cheese only.  Male Owner, most likely, prepares the food to order.  I enjoyed.  Visit 2. I ordered the Large Gyro Plate.  I told the Gentlemen that I would be eating 1 -2 hours later.  He asked me if I wanted the sauce on the side and I was happy to have it that way.   When I returned home all of the electricty was off from a summer storm.  I was happy to have this large Plate of delicious Food to eat in candlelight.  Also, the Restaurant is bleach cleaned and the stainless steel shines. I will be back.  Pricing is very fair for the amount of food."}
{"text":"I happened upon this place after the restaurant that was here was turned into Joe philly ..man am I glad I tried it. i am amazed at the quality of food here everything is fresh and delicious..and the gyros fantastic!... Fresh real steak in the cheese steak..just awesome! I will be coming here for years to come !"}
{"text":"Been wanting a decent cheese steak, and decided to give Joe's a try. Having spent most of my life in the Philadelphia - South Jersey area, I know what a good cheese steak should taste like. When I phoned in my order, the employee immediately asked if I could hold, and proceeded to drop the phone down on the counter, and for two minutes I had the pleasure of hearing every  thing that went on in the store. The flavor of the meat was very bland, and the provolone cheese ordered could barely be tasted. The sauteed onions had bits of onion skin in them, that was totally inedible!  The best thing that could be said about the sandwich was the roll was fresh! The french fries were very soggy, and under-cooked! Never again!"}
{"text":"Philly Cheesesteak WAS GREAT! I also ordered the Cajun fries with cheese, and the baked potato skins. The fries were okay (I'm not much of a fries person but love Cajun seasonings) much to my disappointment I was not impressed. No flavoring at all on the fries as I was expecting \"cajun\" it was flavored by the cheese sauce which was kinda nasty, thank goodness I ordered the skins as backup. The potato skins were HUGE! When I think \"skins\" I think just that. But this was one potato cut into 4ths then loaded with the typical toppings, so it basically was like a loaded baked potato albeit DELICIOUS! Just next time I know I can order that alone for a meal, not appetizer. Only drawback was the amount of time it took to receive my meal. Will order from them again (hopefully delivery time will be better), and try something different from menu."}
{"text":"Was going to Whole Market and saw this place. So afterwards stopped in to a Philly Steak. Got the regular with fries and cheese wiz. The one problem with it is too big. Lol going have to make two meals out"}
{"text":"Good food. Second time I went it took about 15 minutes to get my food but waiting is not an issue. Ordered joes Philly cheese king fries and it was not what I thought. It was still good tho. Dident find any Philly steak on the fries but hey it is one big portion."}
{"text":"I've had this place delivered to me via uber eats. And it is easily one of my favorite places ! I love getting the California turkey. Their Cajun fries are to die for !!!! The food always tastes very fresh, lasts quite a few days in the fridge ( I take my leftovers to work ) and the sandwiches are SO BIG !!!!! The large size will literally last me 4 meals."}
{"text":"I was in the area and stopped for lunch here.  Ordered a Philly steak with a sprit for a drink.  The cashier lady didn't give us our drink cups, because they fill up your soda themselves and bring it to your table...strange, I guess to prevent you from taking to many refills? Anyways, The cashier took 20 minutes to bring us our drinks and another 20 minutes to bring out our sandwiches.  My sprite tasted old and flat.  The philly sandwich was nothing special. Not a lot of flavor in the meat and the bread was old and tough.  Also, the whole time I was there eating, you can hear the cook/owner yelling at the cashier and his helpers loudly in a  the familiar middle eastern accent.  The value isn't really there for what you pay for the sandwiches.  Nothing special here.   Won't make a special trip to come back."}
{"text":"A philly should be more than 1/4 full of meat! Basically we over paid for a bun with lettuce and unripened tomatoes,the soda was flat and tasted dirty.  The French fries were way to greasy....kinda like the cook. Absolutely the worst food I have had in awhile. Rather eat McDonalds next time."}
{"text":"Everything smells as delicious as it tastes! Great family spot! We regularly order for lunch and it's always enjoyable! Cheesesteaks are perfect and the fries are awesome!"}
{"text":"Was in town on business and craving a philly. This place was nearby and had a decent menu. The steak was juicy and flavorful and the fries were fresh cut. Great portions for the price."}
{"text":"Stay away from this place. Not a Philly cheesesteak at all. I ordered a wiz with  and wiz without and got a blank look. After ordering a cheesesteak with fried onions and another cheesesteak, I got two cheesesteaks with wiz and fried onions. The steak doesn't taste fresh, and there is hardly any meat on them. When I went back inside to tell them one was supposed to be without onions, they made my new sandwich but informed me I should have made it more clear I wanted one with onions and one without. Absolutely unbelievable. Do not recommend."}
{"text":"Three stars for excellent customer service. Very polite and very accommodating. Food was good but the meat portions were not as expected. Less than half the bun was filled, making much of the sandwich just bread with no fillings. Fries were delicious though."}
{"text":"I had been wanting to try Joe's Philly Steak & More for a long time, but my husband is vegetarian, so I'd been waiting for a good opportunity to go. Finally, my husband was away for the weekend and Joe's had a Groupon, so I decided that this was my chance. I got the Super Steak sandwich with steak, grilled onion, peppers, and mushrooms and Provolone cheese. I got the smaller size sandwich so that I wouldn't feel too guilty about getting a side dish too... I got the Joe's Potato with steak, grilled onions and cheez whiz.   The sandwich and the baked potato were both excellent! The salty meatiness of the steak combined with the savory grilled onions and peppers, added with the grilled mushrooms and creaminess of the Provolone made for a wonderful taste combination! The baked potato was also a great choice. I was not too full, but very satisfied. It was warm and comforting and I would recommend Joe's Philly Steak & More to anyone who loves meat! Plus, they are open Monday thru Saturday until 9 pm, so you can get a late dinner if you want to."}
{"text":"Just eat at Joe's all fresh ingredients great food and he will make it any way you want it. He also has cheese wiz for your cheesesteak if that's what you want."}
{"text":"I purchased a groupon so I have been here twice. First off let me state I am from Philly so I know great cheesesteaks and some not so great ones. After two visits I will say it was inconsistent and I can't really determine why. The steak sandwich was good the first time, great the second time. While the fries were great the first time and uneven the second time. I don't know if it's because someone different was behind the grill each time. It's affordable and clean and since I haven't tried any other places that supposedly serve philly steaks I will say it's A-Ok."}
{"text":"This is not a Philadelphia establishment. The owners seem to be Greek. The default cheesesteak comes with lettuce and tomato!! I can't imagine how wilted that lettuce would be.   Average cheesesteak, poor decor inside. The fries were decent. I would not go back."}
{"text":"Great food, friendly service, clean Establishment!! I will definitely be coming back!! We got the chicken philly, super steak, and an order if king fries.....OMG, so good!!!"}
{"text":"His place is great. There's only one and they have great cheese fries with awesome sandwiches. I like to go to Bookmans and it's right next door so I appreciate it. Mariela is a nice worker who helped me decide the menu and Gustavo is a great cook. Thanks to small places like this"}
{"text":"Best philly steak I ever had! Must try this place! It's on 19th Ave & Northern on the Northwest corner. Everything is cooked fresh & delicious."}
{"text":"A little like home. Fresh cut fries, homemade philly and care put into every bite. The meat was sliced in the restaurant and everything was fresh. The owner cared enough to come and check on me and asked how the meal was. He moved here from Chicago who knows food and authentic flavors. Highly recommend!"}
{"text":"The first time I went they messed up my order. I couldn't eat the sandwich because it had something I really don't care for on it (even though I explicitly asked for it NOT to include that item). I took it to go and it was late in the evening so I didn't go back. Mistakes happen, I get it. The fries were really good!  The 2nd time I again took it to go. This time the sandwich was correct, but really not good. It was gristly. I took one bite and spit it out. I took another bite, same thing. YEACH. The bread was kinda tough. The fries were really good.   Fries alone do not make a meal. They had 2 chances. No more. I do not recommend, unless you want really good french fries."}
{"text":"The bread alone is 5 stars. I will warn you: you will eat all million calories of this sandwich, even if you're full. It's that good, and you will want to eat it while it's hot. I always get the small California turkey."}
{"text":"it was my first time here tried the over load fries the quanity was huge it had bacon sour cream cheese and chives the fries taste and look like they were sitting out for a while the sour cream had a bad taste to it i will never come back here again i ended up throwing my food away"}
{"text":"Not the best philly cheesesteak I had but it was good. The owner was very nice. I took 2 stars off because when we got there it was only one family order before ours. Well it took about 30-40 minutes to bring out our food and longer for those who ordered right after we did. People that came in after us cancelled their order because it was taking too long. I hope this is not usual for them because I would like to give them a second chance."}
{"text":"Great cheesesteaks and fries! Offered me the cheese sauce instead of whiz because it's less salty and it was perfect!"}
{"text":"No one wears gloves, they use old grease for fries, and fries are Black!  Food is awful"}
{"text":"I went here with the hopes that this was like another sandwich shop that my friend Omar more took me to, nooope! Matter fact he came by my house other day and asked me if I liked it. I said: Nooooo! This place has too much gristle on their steak, it's like chewing on the shoe!! Joe says everything is fresh, mm mm mm mm mmmm  Although a lot of people complained about his attitude, I didn't have a problem with his attitude.  I did like his fries. Something funny: I said I wanted whiz on my sandwich. He gave me that funny look like, no you don't! and then said it's processed. You should get the provolone. Helloooo, that's processed too! Listen if you want great cheesesteaks... you won't find it here!"}
{"text":"I am in my 70,s and the following is unfortunate.The food was alright. We all enjoyed the fries.The decor is not a bother as I am there for a sandwich that can be messy at times.The young lady at the front was very cordial to the patrons so no problem there as far as customer service.The problem was the screaming kids that were running around the establishment,They were literally screaming at the top of there lungs,The table in front of us was loaded with food. No one ever asked these folks to watch their offspring.They spoke a different language so there was a language barrier,Dosent matter where your from as there is no reason at all to have all 3 kids screaming at a Restaurant.You folks need to step on out and go to the nearest McDonalds.Since no one from the establishment would ask them to please watch let alone quiet them down,We will not be back,Hope all the screaming and running around was worth losing 3 customers"}
{"text":"I agree with R N, the lady must just had a bad day and probably took it out on the shop..but anyways this place has the best philly cheese steaks in az,i love philly cheese steaks and this is by far the best ones ive had..as for the owner,very great and funny guy..he kept coming back to our table asking if we needed anything and sat down to play with my son for a little bit until another customer came awesome employees and awesome food,ill be back for sure!"}
{"text":"This was our first time here and I can definitely say that we will be back! I had a regular (7inch) Joes Philly with jalapeños and my husband had a large (12 inch). We added some buffalo sauce to them and YUM! They also have a couple of kids choices for our 6 year old that were the size for him. They have AMAZING baked potato options and next time I want to try a broccoli and cheese potato. My husband said he will try the Buffalo Flamin' Chicken Fries.   This is also conveniently located right off the Northern stop on the light rail and directly next to Bookmans.  Support local business!"}
{"text":"I've been to Joe's several times, but never took the time to write a review. I was browsing through recent reviews and saw Tank's one star review complaining about kids running around and complaining that employees did nothing to stop it. Don't blame the business, as the business did the right thing by not confronting the parents. It could have turned ugly!!   Notice Tank didn't complain about the food, in fact he mentioned it was good. I actually would give it four stars, but I'm giving it five to counter his review as I don't think it is fair to the business to give a one star review because there were some bad parents allowing their kids to run around. That is not the businesses fault!!! Duh!!"}
{"text":"My favorite place for hot soup & a hot Philly Cheese Steak! Best in this neighborhood! Will definitely be returning for a 3rd visit!"}
{"text":"My husband and I decided to try this place out for dinner. We were very impressed with the natural taste and the quality of the food. Most ingredients taste processed, but Joe's Philly Cheesesteak's ingredients were fresh! We will definitely be coming here again."}
{"text":"Tried the philly super steak with grilled onions, cheese and peppers which came in a soft hoagie style bun this was good.  The homemade skin on fries were heavenly, these were some of the best I've had."}
{"text":"Always made fresh and the portions are gigantic. The king fries and the regular with whiz mmmmm!"}
{"text":"Might as well go to subway. No meat on sandwich, flavor was ok but too much pepper. Frys were mushy. Not in any way a phillysteak sandwich! Corleones is far better and cheaper! Don't waste your time."}
{"text":"Always late on orders. .. so many people walked out today. Missed out on so much  money.. poor business.  Every cook jokes around never serious about their job very sad"}
{"text":"Won a coupon from Valley Metro for shopping along the NWExtension.  Got a couple of sandwiches for 2 of us and they were so large that we probably could have done with splitting a sandwich!  Delicious tender beef with cheese on a soft steamed roll and topped with lettuce and tomatoes.  Delightful.  They are not the most ambient dine-in experience but for take out it is great.  Glad to have been given a reason to eat there."}
