{"text":"One of our favorite Italian restaurants. Fabulous pizza and light & tasty chew pose ravioli that never disappoints. Fabulous friendly staff. A neighborhood gem for casual dining."}
{"text":"Horrible. Food was clearly frozen before and was served cold with no taste. Will not be going back."}
{"text":"So I arrived and there was nobody to seat us. The restaurant was not crowded at all but for some reason it still took our food more than a half hour. And they still didn't have my nephew's grilled cheese. We had to wait an extra 8 minutes or so for it because the waiter said he forgot to put the order in. And its not like he was apologetic for it. Not to mention their Alfredo pasta had no flavor. I won't be coming back."}
{"text":"A friend and I stopped by on a whim. We left everything up to the waitor, a young guy tons of energy and happy to make suggestions. I tried the Chicken Florientine. It was fresh light and delicious. I finished the meal off with a Capaccino.  All in all it was a fine visit."}
{"text":"Joey's had some definite things going for it, but some significant detractions that will probably keep me from choosing to go there again.  The atmosphere was surprisingly sophisticated; comfortable and amenable to conversation, even on a Friday night with the large front open to the street.  The food was good, but not outstanding in any way.  Part of the problem was that the drinks and food (I ordered the Pasta Terrintina), would have registered as rather compelling if it were 20-30% cheaper, but for what I paid, I feel like I should have had something a bit nicer.  I would eat there again, it had more going for it than it did detracting from it, but it won't be anywhere on my recommendation list."}
{"text":"Stopped in this place yesterday late in the day while walking to the CVS, because it was cold.  Wanted a cup of coffee.  Woman at the bar was eating stuffed hot pepper and we started talking about how good it looked, so I ordered some apps to take home and they were fantastic.  It wasn't just the food, but the bartender introduced herself formally (who does that?), the owner couldn't have been more hospitable and the few customers that were there while I was were really please with their treatment and the food.  Plus, the place feels homey, like the original location in Chagrin Falls.  I have a business meeting which I've scheduled there for this Saturday and hoping to have the same experience."}
{"text":"We've eaten at Joey's a couple times and have enjoyed the restaurant and staff both times. We ordered the fried risotto for the appetizer and the Florentine pizza. Both were delicious. The restaurant was buzzing, yet our food arrived in a timely fashion piping hot. We like the fact that the new owners of the former Jimmy O'Neil's preserved much of the charm of the interior. This family owned restaurant is the type of place that Cleveland Heights is famous for. It's on our list!"}
{"text":"Unless Olive Garden was previously your favorite Italian restaurant, I would stay away from this place. The garlic knots are clearly reheated and not very good. We had calamari as an appetizer. It was lukewarm and just blah. The pizza is a step above the supermarket frozen kind. Finally, make sure you enter through lee rd, not the parking lot. The stench from the rear entrance is so bad, we should have turned around."}
{"text":"My wife and I had dinner at Joey's last night.  We were greeted and sat by the owner, Michael, and enjoyed attentive and friendly service throughout the evening.  Nice ambiance - Joey's is well decorated and the lighting and music creates a pleasant relaxing atmosphere. The complimentary pull-apart bread was arrived warm and delicious.  My wife ordered the toasted cheese ravioli and I had a Delmonico steak with angel hair pasta.  We were both very impressed with our meals.  The house made creme brulee was excellent!  We will be back again for sure."}
{"text":"New to the area we were casually walking around looking at the menus of the several restaurants in the area and while we were looking at joeys a waiter came out and was extremely nice and basically convinced us to come in even though we were hesitant since we had our 2 year old and 3 month old with us and weren't looking to be somewhere too formal. Long story short we were there for  happy hour which is awesome and the place was nearly empty until we were about done with our meal. I got the chicken florentine and my husband the beef sandwich. Both were delicious. We each had two alcoholic drinks and a kids meal and our bill was $53. Pretty awesome! Will definitely be back!"}
{"text":"Average at best.    My wife, daughter and I had dinner at Joey's last night.  We left with both disapointment and stomachs not feeling great.  The restaurant is so far from it's heritage as the great little place in Chagrin Falls from several years ago.  That was the standard we were planning to hold it to.  We started with an order of brushetta which was just OK.  It was mostly a leafy green salad over toast with only a few tomatos.  I've certainly had better brushetta and salads.    For dinner, my wife ordered the portabella grill sandwich.  They were out of portabella mushrooms so she subsituted eggplant.  She left not feeling so great and we were mistakenly over charged.  My 12 y/o daughter, who has a dairy issue, had grilled chicken over plain pasta.  While she enjoyed it, it was $13.95 for a bowl of pasta and a few pieces of chicken.  My dinner was the chicken parmigiana.  It's one of my favorite meals and I order it from lots of restaurants all over the country, so I've had plenty of experiences.   When it arrived, the tomato sauce looked burned and lumpy.  As I started eating, the chicken wasn't tender.  I then remembered it's a $12 entree and I'm getting what I'm paying for - nothing more.  I didn't touch the side of pasta, which they would not swap for a vegetable.  We each had a soda and skipped dessert.  When our dinner finished, it was about 7:45 on a Saturday night. The restaurant was maybe one-third full.  It was a beautiful evening, low 80s, still sunny and people were eating all up and down Lee Road.  Just not Joeys.   And now we know why.  With tip, it was a $78 dinner.  That's crazy - we did not have a $78 experience, and we're not going back.  And neither should you."}
{"text":"The food is excellent, the service is excellent, the wine choices are non-existent. They have a list, but no wine that is on the list. Get with it folks, you will not survive if you cannot please your customers. I have been there four times in 6 weeks and the last two times there were only three red wine choices.  This ruins my dinner!!!!!!!!!!!!!!!!!!!!!!!!"}
{"text":"My gff and I just had a terrific  experience at joeys.  Had the stuffed peppers and flat bread pizza. Super good. Love Ruth."}
{"text":"So, I love it when we decide to just go some place new because it's just that; new:)  Such was the case with Joey's. We happened upon this Italian-themed bistro-bar on a visit to Lee Road in Cleveland Heights. We don't do Italian often, and we thought it would be a nice change.  We arrived on a cool evening and there wasn't a large crowd; the service was immediate and excellent.   The place has a warm, Tuscan-decor with a full bar, lots of seating, indoor and out. We got a nice table in the back and got started with their garlic...well, it wasn't bread, it was, as the waiter mentioned, \"garlic balls\". It was a pull-apart bread, nicely crispy and drenched in a garlic sauce that made both of us want more. We also got a nice bottle of wine and just sat back and enjoyed,  (did I mention they have special nights, like Wednesday being half-off bottles of house wines?)   We got a chance to meet the owner, who told us about the food selections and the waiter was very helpful. We both ended up getting the chicken picatta, which was flavorful and I have to say, I've never had Italian food with brussel sprouts, but they were GREAT.   The food was nice too because it was flavorful and not overwhelming, and not, well, run of the mill. We really enjoyed the experience. The prices are about mid-range and overall, we were really impressed. Speaking of which, I can see many a young couple coming here for a romantic evening over drinks, and even desserts.   I was also told that,for the local crowds like the students, they're planning on special College Nights, as well as things like Happy Hour and Ladies Nights, which you wouldn't expect from a place this classy, but I admire any place that diversifies:)   All in all, we rate Joey's Bistro Bar very high on the \"Mambo Italiano\" scale, so stop in an enjoy!"}
{"text":"My husband I have frequented this neighborhood gem every Friday night since it opened and love it.  The food is delicious;  fresh, hot and well seasoned.  The chicken Parmesan is the best in the city.  I love their specials which range from swordfish to Gorgonzola crusted filet.  The wine list is good and fairly priced, we almost always get the house Chianti.  The service has always been prompt and friendly.  Ask for Rick, he's great!"}
{"text":"If you're into hanging out with John Carroll freshmen and not being served for 30 minutes in a packed bar where you can't move then this scene is definitely for you"}
{"text":"We've been to eat here twice now. Never again though.  The first time we ordered traditional italian dishes, chicken parmigian and spaghetti with meatballs.  Both dishes were average at best and nothing better than I'd make at home. Our 2nd trip we had a large pepperoni and sausage pizza.  The pizza looked great upon arrival but after tasting it, it was horrible. The oil which was used under the dough in the pan must've had a low burning point because the pizza tasted gross and burnt even though it didn't appear to be overcooked.  I'm guessing they used some cheap oil substitute instead of olive oil.  Both times we were there the service was good but the place was practically empty. Never again!"}
{"text":"I really want to love this place. It has cute homey decor, is right in the neighborhood, and could work for a romantic date or a family night out. I think we've given it four tries now, and sadly, it just seems to be going downhill. The first night we had great service and okay food. I appreciated the eggplant Parmesan, which was bright and not fried. The calamari was decent. And in both of these dishes, the marinara was delicious. On subsequent trips we ventured out and tried picatta and parmigiana style veal or chicken and the meat has been overcooked, tough, and greasy. On the most recent trip with the kids, the marinara sauce seemed to be days old...and not in a good way. My daughter ordered mozzarella sticks that came with this sauce. And I ordered the Eggplant Parmigiana again. The eggplant was fine, but the sauce that topped it and the side of spaghetti was thick, dark, and not fresh. There have been problems with the service on all subsequent trips. I really hope they can get it together, but sadly, I don't think we'll be back."}
{"text":"Horrible service at Bar which was not crowded at all! My friend and I stood for over 10 minutes waiting to order drinks before my friend finally asked after several times to be ignored to finally have someone come over.  No apologies given by bartender. Never to go there again."}
{"text":"I ordered takeout, so I cannot comment on the service.  Their menu consists of pasta dishes and pizza, as well as appetizers.  We had the black and blue risotto fritters for an appetizer.  They were two large patties, heavily breaded and very greasy.My biggest disappointment is that the proteins were barely flavored and thrown together with the pasta.  I am used to having Italian food that has flavors blended together, this seemed randomly thrown together.  I had penne pasta with chicken.  The pasta was drenched in sauce, and grilled, tasteless chicken placed on top.  With all of the fine Italian eateries in the area, I will not be back."}
{"text":"We have not been here before, and saw that they were on restaurant.com.  To say that we're were shocked with the food, is an understatement.  The restaurant is kid friendly, and the server was new but friendly.  Even the owner stopped by to shake my hand and say hi.  The meatballs were big, flavorful and had a great marinara sauce.  The crab cakes were meaty, had very little filler, and had a unique green sauce served with them.  The hot peppers were hot, could have used a little more garlic, and also were served with the same great marinara sauce.  The pizza was delicious, and the veal was tender, juicy, and not overpowered with lemon or capers.    The only area of improvement to the menu was the fried dough dessert.  It lacked any creativity, didn't have enough powdered sugar, and just felt like fried pizza dough.  I would add a variety of dipping sauces (chocolate, Nutella, raspberry, caramel, whip cream), and it would be the perfect way to end a great meal.  All in all, I can't wait to go back and try more things on the menus.  Nice job!!!"}
{"text":"Ted, Aaron and Ruth were fabulous! I highly recommend the eggplant Napoleon. Great environment, cozy and sophisticated. Best spot on Lee road hands down!"}
{"text":"Went here on a Saturday night with the lady.  We read all these bad reviews and were a little cautious but went in with an open mind. Well this certainly was no Jimmy O'Neill's.    Bread came out warm with oil and garlic. Excellent  Started with the calamari, rings and identical. It was cooked about perfect. Lightly breaded, and the marinara sauce was fantastic.  Not to sweet.  we each got a salad. My Mediterranean was great. Blue cheese, fesh fancy greens. I can not tell you how nice it is to get a salad that is not bagged iceberg mix.  Girls Caesar  r salad was very good , Greens, croutons, artichokes and a great Caesar dressing..  My Veal Parmesan  was excellent. I ordered the pasta with meat sauce, it was fantastic you could actually taste the sausage. there sauce is excellent. There were also fresh tomatoes under the mozzarella cheese. My only critique is that they should put the sauce on top of the cheese so it stays crispy.  Our server was supper attentive and did an overall good job.  They also gave us a 10$ card to come back."}
{"text":"Decent but pricy. I had a huge portion of lasagna that was pretty tasty. I bought expensive cannoli that isn't anything like what you'd find at Corbo's so I'd probably never get that again. If you go on a Tuesday night, be warned: it gets chilly bc they leave the side wall open for the karaoke night."}
{"text":"The staff was really good, very attentive. But the food...well, it wasn't good. We had meatball panini, it was relatively good. My mom had pasta with marinara sauce and meatball. And I had portobello sandwich. Marinara sauce was very watery and had no flavor. It was so bad I had an urge to make my own pasta sauce at home (which I did  ). My portobello was soaked in balsamic it burned my mouth. And the mushroom wasn't even cleaned properly. It's sad that places where they really care about the quality of food they serve have to close (speaking of Sweetie Fry) and places like this one are open...cmon, it's not hard to make good pasta sauce"}
{"text":"They are no longer open for business.  Our friends had coupon they got off restaurant.com and we went to use it and found it closed."}
{"text":"Quaint restaurant with a full bar and awesome decor. Came here on a date and would definitely go back. Dim lights set the mood and the wood floors add to the ambiance. Server seamed to be a college student but was fairly attentive and did not over visit the table. Ordered the eggplant napoleon for an app...wow delicious! Both our meals came out hot and in a timely fashion. We finished with a bottle of wine for desert that was just perfect. I'll be back for sure, date or no date."}
{"text":"This place was odd, and not what we expected.  The name makes you think it's a mom and pop pizza place, however, the interior is very nice, and the prices were mid-range.  Our waiter was attentive and friendly, and gave us plenty of time to look over the menu-which had a little bit of everything: apps, pizza, fresh calamari and mozzarella, steak, salmon and of course, pasta.  I had a cocktail and my husband had a beer.  These were good; as a matter of fact, my cocktail was one of the best I have ever ordered in a restaurant-no joke!  I ended up having a second.   We skipped appetizers, and ordered a seafood pasta dish and chicken piccata; both with side salads.  The salads were generic enough- tomato, lettuce, mozzarella, italian dressing.  The bread they were served with was wonderful-and I am very picky about bread!  It was fresh and flavorful.    Now, many people will say, there's not enough flavor or whatever in this food...but that's because it's not loaded with salt and sugar like a lot of other places prepare it (for the discriminating American palate).  For me, it was nice to eat at an Italian place where the sauce wasn't a salty, garlicky, buttery mess, nor a sugary, paste-y concoction slapped on reheated noodles.  This place tastes homemade, the healthy way.  Like how I would cook it at home.  No breaded fried junk slapped with salt.   With that being said: I really enjoyed my chicken piccata.  My husband ate every bite of his linguini seafood- the noodles were a true al dente, the seafood wasn't super sea-food tasting (fresher) and there wasn't some crazy large portion size that tempted you to keep eating just because it's there.   The ambiance was very nice; the bar area was spacious, and indoor and outdoor seating was offered and was readily available.   This place is on par with la dolce vida in little Italy.  It's easier to get a table here, better parking and it's very inviting.  Despite the name, it's a good place to take a date. If it wasn't for a gift card, I wouldn't have known it existed.  We tipped very high for the excellent service and I was very glad we went out to this place."}
{"text":"We came to Joey's on a Monday night with 5 adults and 1 child, hoping to avoid the crowds and keep my 2 year old daughter happy. There was a distinctly off-putting urinal smell hanging in the air, and despite the restaurant being nearly empty, it took nearly 30 minutes for us to even get our entree orders placed. Once we did, the food came out relatively quickly, and the salads and main courses were all delicious. However, dessert was a completely different story.  My wife and I used to frequent this spot when it was Jimmy O'Neill's, just for a slice of their awesome beet cake and maybe a glass of wine. Imagine our surprise and delight when \"Famous Beet Cake\" appeared on Joey's menu. So we ordered a slice, and convinced my wife's parents to do the same. Even though the description left us a little dubious, we were just hoping that somehow some way, Joey's made a deal with Jimmy to bring back the recipe we so missed...  Big Mistake. Not only did it take nearly 20 minutes to prepare, what came from the kitchen bore no resemblance to the beet cake of yore in either taste or presentation. It was sickly sweet, with a vague plastic aftertaste. Instead of a rich chocolate interior, we were given a light-brownish mass with no distinct flavor profile other than sugar. Gone was the delicious chocolate ganache and homemade whipped cream -- in their stead, some hershey's syrup drizzled on top and a scoop of nondescript vanilla ice cream on the side. It was so awful, no one at the table wanted to finish it.  To summarize: Slow service, delicious traditional Italian entrees, terrible dessert. If you have children with a short attention span, beware."}
{"text":"Not terrible, just not great. Marinara sauce is a little too sweet for my taste. Maybe it will be better as leftovers?"}
{"text":"Great food. Only reason they don't get 5/5 stars is that the service was lacking. Were only one out of two couples in the whole restaurant and it still took a long time for the food to come out and the waitress wasn't very attentive as far as our water glasses were concerned. However once the food came out it was fabulous. Would try this again especially in the summer when their store front garage door can be open."}
{"text":"The food was absolutely delicious. I had the special which was chicken parm with eggplant parm on top and then the noodles that were on the side, dont even get me started how amazing they were. I cant remember what the actual name of the dish was but I will definitely be going back for more. We had a canoli for dessert, sooo good. Every single item I tasted gets 5 stars from me."}
{"text":"We wanted to like this neighborhood spot, but left thinking it deserves a restaurant makeover. We went in after the movies and were the only people there; the server greeted us and then diverted to handle a larger party that came in after us and we got served by the bartender. I'm not sure how two tables qualifies as a service challenge.   That said, the servers were friendly.   The garlic bread that was delivered was reminiscent of greasy Pillsbury dough balls lightly salted with a hint of garlic. The oil on the table could not possibly have been olive, more like corn or canola or safflower. Tasteless, with an acidic aftertaste.   My caprese salad consisted of three slices of an unripe hothouse beefsteak tomato thinly sliced with packaged mozzarella. That said, the lettuce salad that accompanied it was the highlight of the meal, fresh and well dressed.   The kitchen was completely out of veal, so I ordered the chicken parm. I got a large breast, tasteless and tastelessly breaded, with a tasteless fresh tomato sauce which also topped the boxed linguine.   My daughter's angel hair pesto was uninspired and bland, and my wife suggested that a restaurant makeover artist would have said her Carbonara resembled no Carbonara served in any other restaurant. It wasn't as tasteless as everything else, instead it was heavily garlicky.   Sorry but we're not going back."}
{"text":"This place was really good to take kids. Food is reasonably priced and tasty. Our waitress was delightful and very attentive. We are outdoors on their cute little patio area. Sauce was really good on the fried mozzarella as well as the Chicken Florentine. Garlic bread that is complimentary is awesome. Go here for comfort food. I left stuffed and with leftovers. The prices didn't break the bank either. A nice addition to Cedar Lee which can be hit or miss."}
{"text":"My boyfriend and I eat here a couple of times a month because we are regular movie goers to the Cedar Lee theater on Saturday nights.  Service has always been efficient, we let them know ahead of time what time we need to leave and have never had a problem.  The garlic buttered pull apart bread is SOOOO good!  Entree portions are generous, and taste great.  The way they made over the space from the previous restaurant is a real improvement."}
{"text":"The food at Joey's is good but not great. The pizza has great flavor, but the sauce could have been thicker. I think the ambiance is great with nice fees of the neighborhood. The service is usually on point as well."}
{"text":"My husband and I had dinner here tonight. We sat outside as it was a beautiful night. Our waiter was prompt and laid back. He made suggestions but wasn't pushy. We had the jumbo meatball as an appetizer. I am a picky eater and I loved it. Very flavorful and juicy. For dinner I had chicken florentine which was fantastic. My husband had chicken parm which he loved. After dinner the manager named Michael stopped and talked to us for a good ten minutes. He seemed genuinely interested in our opinions of our meal. We saw him go to every table and at some tables he even sat down. Overall a great experience. It cost 65$ so it was pricy but worth it."}
{"text":"\"Meh. I've experienced better\".  I couldn't give it more than that. From all the hype I have heard about Joey's in Chagrin, I was really expecting to be wowed.  I was not. Calamari:  ok, but nothing special. Lots of tentacles. Chicken Florentine:  Pretty good, I didn't order it. Had one bite before my friend gobbled it up Antipasto Salad:  OMG!  Can you say pass the oregano?  I really should have told the server that the dressing was sooo overpowering, it was hard to eat.    But service wasn't that great to begin with, so I figured I may not see another dish for awhile.   I really hate when that happens!    And lastly, we kept eyeballing bread baskets??  Our server was MIA most of the time, so we didn't have the opportunity to ask for one. Maybe they aren't standard on the table?    We will never know. Won't be back for seconds."}
{"text":"Killed two birds with one stone when we had the hankering for Italian and a restaurant.com coupon. This is one of the many awesome restaurants on Lee Road in University Heights. Walked in to a very clean establishment, looked very traditional Italian. Our waitress was super awesome, so attentive, had lots of good suggestions and at the end gift us a $10 coupon to return.  Food came out fast. Started with fresh baked pull apart garlic bread. Intentionally had to stop myself from devouring this little pieces of heaven. Moved on to some calamari. This is one of those special places that actually give both the rings and tentacles. Lightly breaded and was in a medley of lightly breaded/fried onions and banana peppers, topped with this amazing tomato sauce (not too chunky/light, had a hint of sweet, tasted so fresh).  Entrees do not come with salads, but we ordered some. I got the Joeys Caesar salad, came in a 12 diameter bowl of greens with cheese slices, grape tomatoes and artichokes. Suggest adding grilled chicken and making that your entrée.  Main entrée was the $14 chicken parmesan. This guy was large and in charge. Pasta al dente. Chicken was a thick and tender serving. Perfectly breaded. Asked for seconds on sauce. With all I consumed, yes I took half home.  I'll be seeing you again soon Joeys, one of my new fave Italian spots."}
